{
  "source_file": "rl-20250329.htm",
  "form_type": "10-K",
  "item1": "Item 1.\n    Business.\nGeneral\nFounded in 1967 by Mr. Ralph Lauren, we are a global leader in the design, marketing, and distribution of luxury lifestyle products, including apparel, footwear & accessories, home, fragrances, and hospitality. For nearly 60 years, Ralph Lauren has sought to inspire the dream of a better life through authenticity and timeless style. Our long-standing reputation and distinctive image have been developed across a wide range of products, brands, distribution channels, and international markets. We believe that our global reach, breadth of lifestyle product offerings, and multi-channel distribution network are unique among luxury and apparel companies.\nWe diversify our business by geography (North America, Europe, and Asia, among other regions) and channel of distribution (retail, wholesale, and licensing). This allows us to maintain a dynamic balance as our operating results do not depend solely on the performance of any single geographic area or channel of distribution. We sell directly to consumers through our integrated retail channel, which includes our retail stores, concession-based shop-within-shops, and digital commerce operations around the world. Our wholesale sales are made principally to major department stores, specialty stores, and third-party digital partners around the world, as well as to certain third-party-owned stores to which we have licensed the right to operate in defined geographic territories using our trademarks. In addition, we license to third parties for specified \n3\nperiods the right to access our various trademarks in connection with the licensees' manufacture and sale of designated products, such as certain apparel categories, eyewear, fragrances, and home furnishings.\nWe organize our business into the following three reportable segments: North America, Europe, and Asia. In addition to these reportable segments, we also have other non-reportable segments. See \"\nOur Segments\n\" for further discussion of our segment reporting structure.\nOur global reach is extensive, as we sell directly to customers throughout the world via our 564 retail stores and 671 concession-based shop-within-shops, as well as through our own digital commerce sites and those of various third-party digital partners. Merchandise is also available through our wholesale distribution channels at over 9,400 doors worldwide, the majority in specialty stores, as well as through the digital commerce sites of many of our wholesale customers. In addition to our directly-operated stores and shops, our international licensing partners operate 116 stores.\nWe have been controlled by the Lauren family since the founding of our Company. As of March 29, 2025, Mr. R. Lauren, or entities controlled by the Lauren family, held approximately 85% of the voting power of the Company's outstanding common stock.\nObjectives and Opportunities\nOur purpose is to inspire the dream of a better life through authenticity and timeless style. We believe that our size and the global scope of our operations provide us with design, sourcing, and distribution synergies across our business. Our core strengths include a portfolio of luxury lifestyle products spanning across five categories: apparel, footwear & accessories, home, fragrances, and hospitality; a well-diversified global multi-channel distribution network; an investment philosophy supported by a strong balance sheet; and an experienced management team. Despite the various risks and uncertainties associated with the current global economic environment, as discussed further in Item 7 — \"\nManagement's Discussion and Analysis of Financial Condition and Results of Operations — Global Economic Conditions and Industry Trends,\n\" we believe our core strengths will allow us to effectively execute our long-term growth strategy.\nDuring our September 2022 Investor Day, we introduced our current 3-year long-term growth strategy for Fiscal 2023 to Fiscal 2025, which is presented below:\nOur next Investor Day will be held in September 2025, during which we will present our latest long-term growth strategy.\n4\nGlobal Citizenship and Sustainability\nAt Ralph Lauren, our purpose to inspire the dream of a better life through authenticity and timeless style guides everything we do. From creating iconic products to be worn, loved, and passed on through generations, to preserving the world's natural resources and supporting the people and communities that intersect our business, we continue to challenge ourselves when it comes to positively impacting our world. That is what we call \nTimeless by Design\n, our approach to Global Citizenship and Sustainability and our ambition for a better future. We weave our Company's purpose throughout our business through three key pillars: \n1.\nCreate with Intent\n•\nIntegrated Circularity\n — Our ethos of timelessness has always guided our creative vision. Today, we continue to deepen this philosophy and are evolving the way our products are designed, made, used, and recirculated. From empowering our designers with circular principles, to using materials that are sustainably sourced or recycled, our approach is designed to lessen our environmental impact. \n•\nSustainable Materials \n— Our iconic products are designed to be timeless and intended to be worn for generations. With this in mind, we choose our materials thoughtfully to ensure high-quality and durability. We are committed to using materials in ways that not only help our products live on, but also to help reduce environmental impact, protect biodiversity and animal welfare, support livelihoods, and improve the traceability of raw materials.  \n•\nDesign with Intent\n — Since our founding, Ralph Lauren has been inspired by the beautiful and interconnected histories, arts, crafts, and cultures that make up the fabric of America. We are on a journey to evolve from inspiration to collaboration with communities that inspire us, which includes taking meaningful steps to be more inclusive throughout our business, from how we design to how products go to market. At its core, our Design with Intent function is about making sure the products we create and the stories we tell are authentic expressions of heritage, which is foundational to our timeless brand.\n•\nValue Chain for Impact \n— To build a resilient and responsible supply chain, we are continuing to increase the transparency and traceability of our full value chain, strengthen our relationships with suppliers, and identify areas for improvement. We work with our suppliers to respect human rights and promote environmental sustainability. \n2.\nProtect the Environment\n•\nClimate\n — Significant reductions to global greenhouse gas (\"GHG\") emissions are collectively needed so we can protect and preserve the natural resources on which we depend. That is why we have committed to near-term and long-term targets to reduce absolute GHG emissions across our operations and supply chain.\n•\nWater Stewardship\n — We are committed to reducing water consumption across our value chain, as it is critical for communities and ecosystems to thrive and is also an essential resource for our business. We strive to conserve water throughout our operations, support our suppliers to improve their water use efficiency and responsibly manage wastewater, and help improve community access to this resource.\n•\nWaste Management\n — We are committed to conserving natural resources by managing waste responsibly. We work to minimize waste in our operations and divert waste from landfills and incineration through donation, reuse, and recycling. Our goal is continued improvement as we incorporate \"zero waste\" principles throughout our business practices.\n•\nChemical Management\n — We are committed to monitoring and reducing hazardous chemical use and discharge from our supply chain.\n•\nBiodiversity \n— Our business depends on critical resources such as freshwater and essential raw materials, and climate change and biodiversity loss are closely intertwined. As ecosystems are increasingly threatened, we are committed to leveraging science to build an in-depth understanding of our current impacts on biodiversity.\n5\n3.\nChampion Better Lives\n•\nBelonging & Equity\n — We believe a diversity of backgrounds, skills, and experiences of our employees and our culture of inclusivity drive innovation and creativity. We are committed to further strengthening a sense of belonging and equal opportunities for all. Our strategy is guided by three focus areas — \nTalent\n, \nEngagement, and Learning\n — and is designed to create a culture of belonging, enable open dialogue, amplify all perspectives, and continue to grow and advance our best-in-class talent. \n•\nEmployee Well-being\n — Our people drive our success and we are dedicated to supporting the physical, emotional, social, and financial needs of our employees and their families to help them thrive. To do so, we are focused on employee wellness, engagement, learning and development, and compensation and benefits.\n•\nCommunity Engagement and Philanthropy\n — We seek to make the dream of a better life a reality in communities across the globe through contributions and actions that create positive social and environmental impact. The two main drivers of our giving efforts are through the Company's Social and Community Impact department and donations to The Ralph Lauren Corporate Foundation.\n•\nRights and Empowerment in the Supply Chain\n — We are committed to conducting our global operations ethically with respect for the dignity of all people who make our products. To support this, we work with our suppliers to build capacity, with workers to empower them, and with industry partners to collaborate for positive change. Our comprehensive approach integrates risk assessment, monitoring, remediation, capability building, stakeholder engagement, life skills programs and empowerment opportunities for factory workers.\nOur most recently published Global Citizenship & Sustainability Report covering Fiscal 2024 may be found on our corporate website at https://corporate.ralphlauren.com/citizenship-and-sustainability. Our Global Citizenship & Sustainability Report covering Fiscal 2025 is expected to be released in September 2025. The content of our sustainability reports is not incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with the SEC. See Item 1A — \n\"Risk Factors — Risks Related to Citizenship and Sustainability Issues.\" \nRecent Developments\nNext Generation Transformation Project\nWe are in the early stages of executing a large-scale multi-year global project that is expected to significantly transform the way in which we operate our business and further enable our long-term strategic pivot towards a global direct-to-consumer-oriented model (the \"Next Generation Transformation project\" or \"NGT project\"). The NGT project will be completed in phases and involves the redesigning of certain end-to-end processes and the implementation of a suite of technology systems on a global scale. Such efforts are expected to result in significant process improvements and the creation of synergies across core areas of operations, including merchandise buying and planning, procurement, inventory management, retail and wholesale operations, and financial planning and reporting, better enabling us to optimize inventory levels and increase the speed with which we react to changes in consumer demand across markets, among other benefits.  \nIn connection with the preliminary phase of the NGT project, we incurred other charges of $25.2 million and $5.1 million during Fiscal 2025 and Fiscal 2024, respectively, which were recorded within restructuring and other charges, net in the consolidated statements of operations. \nOur Brands and Products\nOur products, which include apparel and footwear & accessories for men, women, and children, as well as our fragrance and home collections, together with our hospitality portfolio, comprise one of the most widely recognized families of consumer brands. Reflecting a distinctive American perspective, we have been an innovator in aspirational lifestyle branding and believe that, under the direction of internationally renowned designer Mr. Ralph Lauren, we have had a considerable influence on the way people dress and the way that fashion is advertised throughout the world. \nWe combine consumer insight with our design, marketing, and imaging skills to offer, along with our licensing alliances, broad lifestyle product collections with a unified vision:\n•\nApparel \n— Our apparel products include extensive collections of men's, women's, and children's clothing, which are sold under various brand names, including Ralph Lauren Collection, Ralph Lauren Purple Label, Double RL, \n6\nPolo Ralph Lauren, Lauren Ralph Lauren, Polo Golf Ralph Lauren, Ralph Lauren Golf, RLX Ralph Lauren, Polo Ralph Lauren Children, and Chaps, among others.\n•\nFootwear & Accessories \n— Our range of footwear & accessories encompasses men's, women's, and children's, including casual shoes, dress shoes, boots, sneakers, sandals, eyewear, watches, fashion and fine jewelry, scarves, hats, gloves, umbrellas, and leather goods, including handbags, luggage, small leather goods, and belts, which are sold under our Ralph Lauren Collection, Ralph Lauren Purple Label, Double RL, Polo Ralph Lauren, Lauren Ralph Lauren, RLX Ralph Lauren, Polo Ralph Lauren Children, and Chaps brands.\n•\nFragrance \n— Our fragrance offerings capture the essence of Ralph Lauren's men's and women's brands with numerous labels, designed to appeal to a variety of audiences. Women's fragrance products are sold under our Ralph Lauren Collection, Woman by Ralph Lauren, Romance Collection, and Ralph Collection. Men's fragrance products are sold under our Ralph's Club, Purple Label, Polo Blue, Polo Red, Polo Green, Polo Black, Polo 67, Safari, Polo Sport, and Big Pony Men's brands. Our fragrance offerings also include Polo Earth, a gender-neutral fragrance designed with sustainability in mind, made of 97% natural-origin ingredients.\n•\nHome \n— Our home collections, which are sold primarily under our Ralph Lauren, Polo, Lauren by Ralph Lauren, and Chaps brands, reflect the spirit of the Ralph Lauren lifestyle. Our range of home products includes bed and bath lines, furniture, fabric and wall coverings, lighting, dining, floor coverings, and giftware, among others.\n•\nHospitality \n— Continuing to engage our consumers with experiential and unique expressions of the brand, our hospitality portfolio is a natural extension of the World of Ralph Lauren as expressed through the culinary arts. Ralph Lauren's global hospitality collection is comprised of our restaurants including \nThe Polo Bar\n in New York City, \nRL Restaurant\n located in Chicago, \nRalph's\n located in Paris, \nThe Bar at Ralph Lauren \nlocated in Milan, \nRalph's Bar\n located in Chengdu, and our \nRalph's Coffee\n concept in various cities around the world. \nOur lifestyle brand image is reinforced by our distribution through our stores and concession-based shop-within-shops, our wholesale channels of distribution, our global digital commerce sites, and our Ralph Lauren restaurants and cafés. We sell our products under the following key brand platforms:\n1.\nRalph Lauren Luxury \n— Our Luxury group includes:\nRalph Lauren Collection and Ralph Lauren Purple Label. \n  Ralph Lauren Collection embodies the highest expression of chic, feminine glamour.  Each piece is inspired by a vision of timeless luxury and modern elegance and is crafted with unparalleled passion and artistry. For men, Ralph Lauren Purple Label is the ultimate expression of luxury for the modern gentleman. Refined suitings are hand-tailored, including custom made-to-measure suits crafted in the time-honored traditions of Savile Row. Purple Label's sophisticated sportswear is designed with a meticulous attention to detail, capturing the elegance and ease of Ralph Lauren's signature, timeless style. Ralph Lauren Collection and Ralph Lauren Purple Label are made predominantly in Italy with the utmost attention to detail and quality and are available in select Ralph Lauren stores around the world, an exclusive selection of the finest specialty stores, and online at our Ralph Lauren digital commerce sites, including RalphLauren.com.\nDouble RL.   \nNamed after Ralph Lauren's working cattle ranch in Colorado, Double RL is a tribute to America's pioneering spirit and tradition of rugged independence. The foundation of Double RL lies in timeless wardrobe staples for men and women, including authentic American-made selvedge denim jeans, military-grade chinos, tube-knit t-shirts, thermals, and flannels. Beyond these iconic styles are added seasonal vintage-inspired collections, along with a full collection of footwear & accessories, including quality belts, bags, and leather goods. Double RL is available at Double RL stores, at select Ralph Lauren stores, and an exclusive selection of the finest specialty stores around the world, as well as online at our Ralph Lauren digital commerce sites, including RalphLauren.com.\nRalph Lauren Home.\n \n  Ralph Lauren Home represents a full expression of modern luxury — style is a life well-lived. Based on an immersive design ethos, the collection includes furniture, lighting, bed and bath linens, tabletop, decorative accessories and gifts, as well as fabric, wallcoverings, and floorcoverings. Each piece is crafted with the greatest attention to detail. Ralph Lauren Home offers exclusive luxury goods at select Ralph Lauren stores and select wholesale partners, home specialty stores, trade showrooms, and online at our Ralph Lauren digital commerce site, RalphLauren.com.\n7\nRalph Lauren Watches and Jewelry.   \nWe offer a premier collection of Swiss-made timepieces, which embody Ralph Lauren's passion for impeccable quality and exquisite design. We also offer premium collections of jewelry, which capture the glamour and craftsmanship of Ralph Lauren's most luxurious designs, from everyday collections to the most refined and precious materials. Ralph Lauren watches and jewelry are available online at RalphLauren.com, at select Ralph Lauren stores, and a few of the finest watch and jewelry retailers around the world.\n2.\nPolo Ralph Lauren \n— The Polo Ralph Lauren group includes:\nPolo Ralph Lauren.  \nMen's Polo combines Ivy League classics and time-honored English haberdashery with downtown styles and all-American sporting looks in sportswear and tailored clothing. Women's Polo represents the epitome of classic and iconic American style with a modern and cool twist. Polo's signature aesthetic includes our renowned polo player logo. Polo Sport reflects the active lifestyle and youthful energy of Polo’s sporting roots through Men's and Women's activewear. Men's and Women's Polo apparel and footwear & accessories are available in Ralph Lauren stores around the world, better department and specialty stores, and online at our Ralph Lauren digital commerce sites, including RalphLauren.com. \nPolo Ralph Lauren Children.   \nPolo Ralph Lauren Children is designed to reflect the timeless heritage and modern spirit of Ralph Lauren's collections for men and women. Signature classics include iconic polo knit shirts and luxurious cashmere cable-knit sweaters. Polo Ralph Lauren Children is available in a full range of sizes, from baby to girls 2-16 and boys 2-20. Polo Ralph Lauren Children can be found in select Ralph Lauren stores around the world, better department stores, and online at our Ralph Lauren digital commerce sites, including RalphLauren.com, as well as certain of our retail partners' digital commerce sites.\nRLX Ralph Lauren.   \nRLX is the leading edge of Ralph Lauren's performance and activewear. Comprised of functional apparel that address the performance needs of a modern active lifestyle, RLX includes men's and women's apparel and accessories that represent Ralph Lauren's belief that things that are purposefully designed and made of the highest quality achieve a timeless elegance. \nPolo Golf Ralph Lauren, Ralph Lauren Golf, and RLX Ralph Lauren Golf.   \nTested and worn by top-ranked professional golfers, Polo Golf Ralph Lauren, Ralph Lauren Golf, and RLX Ralph Lauren Golf for men and women define excellence in the world of golf. With a sharpened focus on the needs of the modern player but rooted in the rich design tradition of Ralph Lauren, the Golf collections combine state-of-the-art performance wear with luxurious finishing touches. Our Golf collections are available in select Ralph Lauren stores, exclusive private clubs and resorts, and online at RalphLauren.com.\nPink Pony.   \nThe Pink Pony campaign is our worldwide initiative in the fight against cancer. In the U.S., a percentage of sales from Pink Pony products benefit the Pink Pony Fund of The Ralph Lauren Corporate Foundation, which supports cancer-related programs for early diagnosis, education, treatment, and research, and is dedicated to bringing patient navigation and quality cancer care to medically underserved communities. Internationally, a network of local cancer charities around the world benefit from the sale of Pink Pony products. Pink Pony consists of dual gender sportswear and accessories. Pink Pony items feature our iconic pink polo player \n—\n a symbol of our commitment to the fight against cancer. Pink Pony is available at select Ralph Lauren stores and online at our Ralph Lauren digital commerce sites, including RalphLauren.com. Pink Pony is also available at select Macy's stores and online at Macys.com.\n3.\nLauren Ralph Lauren \n— Our Lauren group includes:\nLauren Ralph Lauren.   \nLauren for women combines aspirational timeless style with modern femininity in a lifestyle collection of sportswear, denim, and dresses, as well as footwear & accessories. Lauren for women is available in select department stores around the world and online at select digital commerce sites, including RalphLauren.com.\nLauren Home.\n   Lauren Home collection includes accessibly-priced, timeless bath and bedding collections, as well as fabric and wall coverings, lighting, dining, and floor coverings, among others. The collection is built upon an assortment of essentials that is designed to be mixed with seasonal updates, all rooted in the brand's classic style.\n4.\nChaps \n—\n \nChaps celebrates real American style, delivering classic collections updated for modern lifestyles for men, women, children and home. The modern lifestyle collection offers versatile sportswear, workday essentials, tailored clothing, and occasion dresses that are wearable from season to season. Chaps is available in select department stores and retail partners' digital commerce sites across the U.S., Canada, and Mexico.\n8\nOur Segments\nWe organize our business into the following three reportable segments:\n•\nNorth America\n — Our North America segment, representing approximately 43% of our Fiscal 2025 net revenues, primarily consists of sales of our Ralph Lauren branded apparel, footwear & accessories, home, and related products made through our retail and wholesale businesses primarily in the U.S. and Canada. In North America, our retail business is primarily comprised of our Ralph Lauren stores, our outlet stores, and our digital commerce sites, www.RalphLauren.com and www.RalphLauren.ca. Our wholesale business in North America is comprised primarily of sales to department stores and, to a lesser extent, specialty stores.  \n•\nEurope \n— Our Europe segment, representing approximately 31% of our Fiscal 2025 net revenues, primarily consists of sales of our Ralph Lauren branded apparel, footwear & accessories, home, and related products made through our retail and wholesale businesses in Europe and emerging markets. In Europe, our retail business is primarily comprised of our Ralph Lauren stores, our outlet stores, our concession-based shop-within-shops, and our various digital commerce sites. Our wholesale business in Europe is comprised primarily of a varying mix of sales to both department stores and specialty stores, depending on the country, as well as to various third-party digital and licensee partners.\n•\nAsia \n— Our Asia segment, representing approximately 24% of our Fiscal 2025 net revenues, primarily consists of sales of our Ralph Lauren branded apparel, footwear & accessories, home, and related products made through our retail and wholesale businesses in Asia, Australia, and New Zealand. Our retail business in Asia is primarily comprised of our Ralph Lauren stores, our outlet stores, our concession-based shop-within-shops, and our various digital commerce sites. In addition, we sell our products online through various third-party digital partner commerce sites. Our wholesale business in Asia is comprised primarily of sales to department stores and various third-party digital and licensee partners.\nNo operating segments were aggregated to form our reportable segments. In addition to these reportable segments, we also have other non-reportable segments, representing approximately 2% of our Fiscal 2025 net revenues, which primarily consist of Ralph Lauren and Chaps branded royalty revenues earned through our global licensing alliances.\nThis segment structure is consistent with how we establish our overall business strategy, allocate resources, and assess performance of our Company.\nApproximately 57% of our Fiscal 2025 net revenues were earned outside of the U.S. See Note 20 to the accompanying consolidated financial statements for a summary of net revenues by segment and by geographic location, as well as additional financial metrics by segment. \nOur Retail Business\nOur retail business sells directly to customers throughout the world via our 564 retail stores and 671 concession-based shop-within-shops, totaling approximately 4.1 million and 0.7 million square feet, respectively, as well as through our own digital commerce sites and those of various third-party digital partners. We operate our business using a global omni-channel retailing strategy that seeks to deliver an integrated shopping experience with a consistent message of our brands and products to our customers, regardless of whether they are shopping for our products in physical stores or online. We also continue to scale and expand our Connected Retail capabilities to enhance the consumer experience, which include Online Appointment Bookings, Digital Clienteling, Endless Aisle, Buy Online-Ship from Store, Buy Online-Pick Up in Store, Same-Day Delivery, and Mobile Point of Sale and contactless payments, among other capabilities.\nRalph Lauren Stores\nOur Ralph Lauren stores feature a broad range of apparel, footwear & accessories, watch and jewelry, fragrance, and home product assortments in an atmosphere reflecting the distinctive attitude and image of the Ralph Lauren, Polo, and Double RL brands, including exclusive merchandise that is not sold in department stores. During Fiscal 2025, we opened 30 new Ralph Lauren stores and closed 10 stores. Our Ralph Lauren stores are primarily situated in major upscale street locations and upscale regional malls, generally in large urban markets.\n9\nThe following table presents the number of Ralph Lauren stores by segment as of March 29, 2025:\nRalph Lauren Stores\nNorth America\n51 \nEurope\n47 \nAsia\n154 \nTotal\n252 \nOur 9 flagship Ralph Lauren regional store locations showcase our iconic styles and products and demonstrate our most refined merchandising techniques. In addition to generating sales of our products, our worldwide Ralph Lauren stores establish, reinforce, and capitalize on the image of our brands. Our Ralph Lauren stores range in size from approximately 400 to 37,900 square feet.\nOutlet Stores\nWe extend our reach to additional consumer groups through our outlet stores worldwide, which are principally located in major outlet centers. Our worldwide outlet stores offer selections of our apparel, footwear & accessories, and fragrances. In addition to these product offerings, certain of our worldwide outlet stores offer home product assortments. During Fiscal 2025, we opened 6 new outlet stores and closed 26 stores.\nThe following table presents the number of outlet stores by segment as of March 29, 2025:\nOutlet Stores\nNorth America\n172 \nEurope\n57 \nAsia\n83 \nTotal\n312 \nOur outlet stores range in size from approximately 1,100 to 28,300 square feet. Outlet stores obtain products from our suppliers, our product licensing partners, and our other retail stores and digital commerce operations, and also serve as a secondary distribution channel for our excess and out-of-season products.\nConcession-based Shop-within-Shops\nThe terms of trade for shop-within-shops are largely conducted on a concession basis, whereby inventory continues to be owned by us (not the department store) until ultimate sale to the end consumer. The salespeople involved in the sales transactions are generally our employees and not those of the department store.\nThe following table presents the number of concession-based shop-within-shops by segment as of March 29, 2025:\nConcession-based\nShop-within-Shops\nNorth America\n— \nEurope\n30 \nAsia\n641 \nTotal\n(a)\n \n671 \n(a)\n      Our concession-based shop-within-shops were located at approximately 300 retail locations.\nThe size of our concession-based shop-within-shops ranges from approximately 100 to 5,500 square feet. We may share in the cost of building out certain of these shop-within-shops with our department store partners.\n10\nDirectly-Operated Digital Commerce Websites\nIn addition to our stores, our retail business sells products online in North America, Europe, and Asia through our various directly-operated digital commerce sites, which include www.RalphLauren.com, among others. We continue to expand accessibility to our digital flagships globally while localizing language, currencies, payment methods, product assortments, and content. We also sell our products online through various third-party digital partner commerce sites, primarily in Asia, as well as through our Ralph Lauren app in the U.S.\nOur Ralph Lauren digital commerce sites offer our customers access to a broad array of Ralph Lauren, Double RL, Polo, and Lauren apparel, footwear & accessories, watch and jewelry, fragrance, and home product assortments, and reinforce the luxury image of our brands. While investing in digital commerce operations remains a primary focus, it is an extension of our investment in the integrated omni-channel strategy used to operate our overall retail business, in which our digital commerce operations are interdependent with our physical stores. \nOur Wholesale Business\nOur wholesale business sells our products globally primarily to major department stores, specialty stores, and golf and pro shops, as well as to various third-party digital partners. We have continued to focus on elevating our brand by improving in-store product assortment and presentation, as well as full-price sell-throughs to consumers. As of the end of Fiscal 2025, our wholesale products were sold through over 9,400 doors worldwide, with the majority in specialty stores. Our products are also increasingly being sold through the digital commerce sites of many of our traditional wholesale customers and our third-party digital partners. \nThe primary product offerings sold through our wholesale channels of distribution include apparel, footwear & accessories, and home product assortments. Our luxury brands, including Ralph Lauren Collection and Ralph Lauren Purple Label, are distributed worldwide through a limited number of premier fashion retailers. In North America, our wholesale business is comprised primarily of sales to department stores, and to a lesser extent, specialty stores. In Europe, our wholesale business is comprised primarily of a varying mix of sales to both department stores and specialty stores, depending on the country, as well as to various third-party digital partners. In Asia, our wholesale business is comprised primarily of sales to department stores and various third-party digital partners. We also distribute our wholesale products to certain licensed stores operated by our partners in Asia, Europe, Latin America, and emerging markets.\nWe sell most of our excess and out-of-season products through secondary distribution channels worldwide, including our retail outlet stores.\nWorldwide Wholesale Distribution Channels\nThe following table presents by segment the approximate number of our primary full-price wholesale doors of distribution as of March 29, 2025:\nDoors\nNorth America\n3,000 \nEurope\n5,600 \nAsia\n850 \nTotal\n9,450 \nIn addition to our conventional wholesale doors, our products are increasingly being sold through the websites of many of our traditional wholesale customers, as well as those of our third-party digital partners. As of March 29, 2025, our wholesale business served approximately 120 third-party digital partners, primarily in Europe.\nWe have three key wholesale customers that generate significant sales volume. During Fiscal 2025, sales to our three largest wholesale customers accounted for approximately 12% of our total net revenues. Approximately 70% of sales to our three largest wholesale customers related to our North America segment and approximately 30% related to our Europe segment.\nOur products are sold primarily by our own sales forces. Our wholesale business maintains its primary showrooms in New York City, as well as regional showrooms in London, Madrid, Milan, Munich, Paris, and Stockholm. In addition, we utilize virtual showrooms, allowing our customers to experience and discover our product assortments in a retail setting remotely. \n11\nShop-within-Shops.\n    As a critical element of our distribution to department stores, we and our licensing partners utilize shop-within-shops to enhance brand recognition, to permit more complete merchandising of our lines by the department stores, and to differentiate the presentation of our products. \nThe following table presents by segment the approximate number of shop-within-shops in our primary full-price distribution network as of March 29, 2025:\nShop-within-Shops\nNorth America\n6,300 \nEurope\n7,000 \nAsia\n1,050 \nTotal\n14,350 \nThe size of our shop-within-shops ranges from approximately 80 to 9,200 square feet. Shop-within-shop fixed assets primarily include items such as customized freestanding fixtures, wall cases and components, decorative items, and flooring. We normally share in the cost of building out these shop-within-shops with our wholesale customers. \nReplenishment Program.\n    Core products such as knit shirts, chino pants, oxford cloth shirts, select footwear & accessories, and home products can be ordered by our wholesale customers at any time through our replenishment program. We generally ship these products within two to five days of order receipt.\nBacklog.\n    We generally receive wholesale orders approximately three to five months prior to the time the products are delivered to customers, except for orders received through our replenishment program which ship within two to five days of order receipt. Our wholesale orders are generally subject to broad cancellation rights. Further, the size of our order backlog depends on several factors, including the timing of the market weeks for our particular lines during which a significant percentage of our orders are received and the timing of shipments, which varies from year-to-year with consideration for holidays, consumer trends, concept plans, and the replenishment program's usage. Consequently, the dollar amount of our backlog as of any date may not be indicative of actual future shipments and therefore is not meaningful in understanding our business as a whole.\nOur Licensing Business\nThrough licensing alliances, we combine our consumer insight, design, and marketing skills with the specific product or geographic competencies of our licensing partners to create and build new businesses. We generally seek out licensing partners who are leaders in their respective markets, contribute the majority of product development costs, provide the operational infrastructure required to support the business, and own the inventory. Our licensing business has been aggregated with other non-reportable segments.\nProduct Licensing\nWe grant our product licensees the right to access our various trademarks in connection with the licensees' manufacture and sale of designated products, such as certain apparel categories, eyewear, fragrances, and home furnishings. Each product licensing partner pays us royalties based upon its sales of our products, generally subject to a minimum royalty requirement for the right to use our trademarks and design services. In addition, our licensing partners may be required to allocate a portion of their revenues to advertising our products and sharing in the creative costs associated with these products. Larger allocations typically are required in connection with launches of new products or in new territories. Our license agreements generally have three to five-year terms and may grant the licensees conditional renewal options.\nWe work closely with all of our licensing partners to ensure that their products are developed, marketed, and distributed to reach the intended consumer and are presented consistently across product categories to convey the distinctive identity and lifestyle associated with our brands. Virtually all aspects of the design, production quality, packaging, merchandising, distribution, advertising, and promotion of Ralph Lauren products are subject to our prior approval and continuing oversight. We perform a broader range of services for most of our Ralph Lauren Home licensing partners than we do for our other licensing partners, including design, operating showrooms, marketing, and advertising.\n12\nThe following table lists our largest licensing agreements as of March 29, 2025 for the product categories presented. Except as noted in the table, these product licenses cover North America only. \nCategory\nLicensed Products \nLicensing Partners\nMen's Apparel\nUnderwear and Sleepwear\nHanesbrands, Inc. (includes Japan)\nChaps\n5 Star Apparel LLC (includes South America and South Korea)\nWomen's Apparel\nOuterwear\nS. Rothschild & Co., Inc.\nSleepwear\nCharles Komar and Sons, Inc. (includes Europe and the Middle East)\nIntimates and Sleepwear\nDelta Galil (global)\nChaps\n5 Star Apparel LLC (includes South America)\nBeauty Products\nFragrances\nL'Oreal S.A. (global)\nFootwear\nMen's and Women's Slippers and Children's Footwear\nBBC International LLC (global, excluding Japan and South Korea)\nAccessories\nEyewear\nLuxottica Group S.p.A. (global)\nSocks and Hosiery\nRenfro Corporation\nSocks and Hosiery\nNaigai Co., Ltd. (Japan only)\nHome\nUtility and Blankets\nDown-lite International, Inc.\nLighting\nVisual Comfort of America LLC (global)\nInternational Licensed Distribution\nOur international licensing partners acquire the right to sell, promote, market, and/or distribute various categories of our products in a given geographic area and source products from us, our product licensing partners, and/or independent sources. International licensees' rights may include the right to own and operate retail stores. As of March 29, 2025, our international licensing partners operated 116 stores.\nDigital Ecosystem\nInvesting in our digital ecosystem remains a primary focus and is a key component of our integrated global omni-channel strategy that spans across owned and partnered channels, both physical and digital. Our digital ecosystem is comprised of directly-operated platforms, wholesale partner websites, third-party digital pure players, social commerce, and third-party gaming platforms.\nOur directly-operated digital commerce sites and mobile application represent our digital flagships, featuring the most elevated expression of our brands. The strategy for our digital flagships is to deliver distinct and immersive brand experiences, continuously enhance consumer experience, and develop digital content that drives deeper consumer engagement and conversion. We continue to optimize our customer experience globally with the introduction of numerous features including new payment methods and improved search capabilities, as well as greater personalization and enhanced content. In conjunction with introducing new features, we have focused on foundational needs ranging from platform enhancements to technology solutions to operational efficiencies. Driving our long-term growth strategy, we also continue to scale and expand our Connected Retail capabilities to enhance the consumer experience and leverage inventory across direct-to-consumer channels, which include Online Appointment Bookings, Digital Clienteling, Endless Aisle, Buy Online-Ship from Store, Buy Online-Pick up In Store, Same-Day Delivery, and Mobile Point of Sale and contactless payments, among other capabilities.\nOur products are also sold through the digital commerce sites of many of our wholesale customers across the globe. With all partners in our ecosystem, we seek to showcase the brand consistently with our values. We collaborate with our key wholesale customers to deliver the right content to the right audience, and leverage consumer insights to develop a holistic, channel-agnostic view of our consumer.\n13\nWe also sell our products online through various third-party digital pure-play sites to reach a broader audience of consumers, including younger consumers, and amplify our brand messages. On many of these sites, we have created digital shop-in-shop environments with a consistent brand experience, tailored product stories, and an assortment that is carefully curated by our merchants. We also partner closely with our pure-play customers on marketing content and events, as well as optimizing search and other data analyses to drive higher traffic and conversion for our brands. \nIn connection with our digital commerce operations, we engage consumers through various digital and social media platforms, which are supported through our collaboration with influencers who have an authentic connection to our brand. Ralph Lauren brands are also represented in several gaming platforms, providing digital apparel offerings and virtual brand experiences that attract younger consumers. \nSeasonality of Business\nOur business is typically affected by seasonal trends, with higher levels of retail sales in our second and third fiscal quarters and higher wholesale sales in our second and fourth fiscal quarters. These trends result primarily from the timing of key vacation travel, back-to-school, and holiday shopping periods impacting our retail business and timing of seasonal wholesale shipments. As a result of changes in our business, consumer spending patterns, and the macroeconomic environment, including those resulting from pandemic diseases and other catastrophic events, historical quarterly operating trends and working capital requirements may not be indicative of our future performance. In addition, fluctuations in sales, operating income (loss), and cash flows in any fiscal quarter may be affected by other events affecting retail sales, such as changes in weather patterns.\nWorking capital requirements vary throughout the year. Working capital requirements typically increase during the first half of the fiscal year as inventory builds to support peak shipping/selling periods and, accordingly, typically decrease during the second half of the fiscal year as inventory is shipped/sold. Cash provided by operating activities is typically higher in the second half of the fiscal year due to reduced working capital requirements during that period.\nProduct Design\nOur products reflect a timeless and innovative interpretation of American style with a strong global appeal. Our consistent emphasis on new and distinctive design has been an important contributor to the prominence, strength, and reputation of the Ralph Lauren brands.\nOur Ralph Lauren products are designed by, and under the direction of, Mr. Ralph Lauren and our design teams. We form design teams around our brands and product categories to develop concepts, themes, and products for each brand and category. Through close collaboration with merchandising, sales, and product management staff, these teams support all of our businesses in order to gain market information and other valuable input.\nMarketing and Advertising\nOur marketing and advertising programs communicate the themes and images of our brands and are integral to the success of our product offerings. The majority of our advertising programs are created and executed by our in-house creative and advertising agency to ensure consistency of presentation, which are complemented by our marketing experts in each region who help to execute our localized strategies.\nWe create distinctive image advertising for our brands, conveying the particular message of each one within the context of the overall Ralph Lauren portfolio. Advertisements often portray a lifestyle rather than a specific item and may include a variety of products offered by us and, in some cases, our licensing partners. Our communication campaigns are increasingly being executed through digital and social media platforms to drive further engagement with the younger consumer. With regard to influencers, we believe in fostering long-term relationships with those who have an authentic connection to our brand and influence the areas of culture that matter most to our audiences. We also continue to advertise through print and outdoor media, and, to a lesser extent, through television and cinema. \nOur digital advertising programs focus on high impact and innovative digital media outlets, which allow us to convey our key brand messages and lifestyle positioning. We also develop digital editorial initiatives that allow for deeper education and engagement around the Ralph Lauren lifestyle. We deploy these marketing and advertising initiatives through online, mobile, video, email, and social media. Our digital commerce sites present the Ralph Lauren lifestyle online, while offering a broad array of our apparel, footwear & accessories, home, fragrances, and hospitality product lines.\n14\nAdditionally, we advertise in consumer and trade publications, and participate in cooperative advertising on a shared cost basis with some of our wholesale and licensing partners. We have outdoor advertising placements in key cities as well, focusing on impact and reach. We also provide point-of-sale fixtures and signage to our wholesale customers to enhance the presentation of our products at their retail locations. In addition, when our licensing partners are required to spend an amount equal to a percentage of their licensed product sales on advertising, in certain cases we coordinate the advertising placement on their behalf. We believe our investments in shop-within-shop environments and retail stores, including our global flagship locations, contribute to and enhance the themes of our brands to consumers.\nWe also conduct a variety of public relations activities, including fashion presentations in major cities such as New York City and Milan. Such fashion events, in addition to celebrity dressing occasions, including those related to red carpet events, weddings, and major sporting events, and events hosted in our stores and restaurants, including The \nPolo Bar\n in New York City, generate extensive domestic and international media and social coverage.\nWe are the official outfitter for all on-court officials at the Wimbledon, U.S. Open, and Australian Open tennis tournaments. These tournaments provide worldwide exposure for our brand in a relevant lifestyle environment. We also continue to be an Official Outfitter of the U.S. Olympic and Paralympic Teams, providing the Opening and Closing Ceremony Uniform apparel and a collection of Villagewear apparel and accessories available to men, women, and children, with the right to manufacture, distribute, advertise, promote, and sell products in the U.S. Most recently, we dressed Team USA for the Summer Olympic and Paralympic Games in Paris in 2024, and we will be dressing the team for the upcoming Winter Olympic and Paralympic Games in Milan in 2026, and the Summer Olympic and Paralympic Games in Los Angeles in 2028. As part of our involvement with Team USA, we have established a partnership with athletes serving as brand ambassadors and as the faces of our advertising, marketing, and public relations campaigns. We are also an Official Partner for the Professional Golfers' Association (\"PGA\") of America and the Official Outfitter of the U.S. Ryder Cup Team, as well as a partner of the American Junior Golf Association. We sponsor a roster of professional golfers, including Andrea Lee, Billy Horschel, Davis Love III, Devon Bling, Doc Redman, Jonathan Byrd, Megha Ganne, Nick Watney, Sean Foley, Smylie Kaufman, Todd Anderson, Tom Watson, Trevor Werbylo, Troy Taylor II, Tyler Strafaci, and Zach Johnson.\nWe believe our partnerships with such prestigious global athletic events reinforce our brand's Sport & Style heritage in a truly authentic way and serve to connect our Company and brands to our consumers through their individual areas of passion.\nSourcing, Production and Quality\nWe contract for the manufacture of our products with suppliers and do not own or operate any production facilities. Approximately 300 different suppliers worldwide produce our apparel, footwear & accessories, and home products, with no one supplier providing more than 5% of our total products (by dollar value) during Fiscal 2025. \nOur Global Sourcing organization closely supervises these suppliers to make our designs as per our specifications and standards. Ralph Lauren's Quality Assurance team works with suppliers to ensure best practices are carried out prior to and during production. Compliance to our standards is ensured through our Quality Control requirements and follow-up inspections and reviews. Both the initial Quality Assurance work and the Quality Control requirements ensure merchandise is received at the distribution facilities and shipped to customers with minimal interruption.\nManagement continually monitors political, economic, social, environmental, trade, and labor risks. We manage our exposure through, among other measures, by diversifying production among countries and suppliers and sourcing from countries with trade preferences. In Fiscal 2025, approximately 96% of our products (by dollar value) were produced outside of the U.S., primarily in Asia, Europe, and Latin America, with approximately 20% of our products sourced from Vietnam, 16% from Cambodia, and 12% from China. See \"\nImport Restrictions and Other Government Regulations,\n\" Item 1A — \"\nRisk Factors \n— \nRisks Related to Macroeconomic Conditions — Economic conditions could have a negative impact on our major customers, suppliers, vendors, and lenders, which in turn could materially adversely affect our business,\" \nand Item 1A — \"\nRisk Factors \n— \nRisks Related to our Business and Operations — Our business is subject to risks associated with importing products and the ability of our manufacturers to produce our goods on time and to our specifications\n.\"\nWe are committed to conducting our global operations ethically and with respect for the dignity of all people who make our products. All our suppliers are expected to uphold our Ralph Lauren Operating Standards. These standards require business partners to foster a safe, sustainable, inclusive, and ethical workplace through continuous improvement. Our Global Citizenship team monitors the compliance of our business partners as part of our due diligence processes.\nOur business model requires us to commit to most of our garment production and related fabric procurement before actual sales occur. In cases where we overestimate customer demand for specific products or materials, we manage excess inventory by redirecting these items to our outlet stores and other secondary sales channels.\n15\nCompetition\nCompetition is very strong in the segments of the fashion and consumer product industries in which we operate. We compete with an extensive range of designers and manufacturers of apparel, footwear, accessories, fragrances, and home products, both domestic and international. We also face increasing competition from companies selling our product categories solely through the Internet. Some of our competitors may be significantly larger and have substantially greater resources than us. We compete primarily on the basis of brand strength, timeless style, quality, value, and service, which depend on our ability to:\n•\nanticipate and respond in a timely manner to changing consumer demands and shopping preferences, including the ever-increasing shift to digital brand engagement, social media communications, and online and cross-channel shopping;\n•\ncreate and maintain favorable brand recognition, loyalty, and a reputation for quality, including through digital brand engagement and online and social media presence;\n•\ndevelop and produce innovative, high-quality products in sizes, colors, and styles that appeal to consumers of varying demographics;\n•\ncompetitively price our products and create a compelling value proposition for consumers;\n•\nprovide strong and effective marketing support in several diverse demographic markets, including through digital and social media platforms in order to stay better connected to consumers;\n•\nestablish relationships with athletes, musicians, influencers, and other celebrities to promote our brands and products;\n•\nprovide attractive, reliable, secure, and user-friendly digital commerce sites;\n•\nadapt to changes in technology, including the successful utilization of data analytics, artificial intelligence, and machine learning;\n•\nobtain sufficient and desirable retail floor space and effectively present our products to consumers;\n•\nattract consumer traffic to stores, shop-within-shops, and digital commerce sites;\n•\nsource sustainable and traceable raw materials at cost-effective prices;\n•\nanticipate and maintain proper inventory levels;\n•\nensure product availability and optimize supply chain and distribution efficiencies;\n•\nmaintain and grow market share;\n•\nrecruit and retain talent to operate our retail stores, distribution centers, and various corporate functions;\n•\nprotect our intellectual property; and\n•\nwithstand prolonged periods of adverse economic conditions or business disruptions. \nSee Item 1A — \"\nRisk Factors \n— \nRisks Related to our Business and Operations — We face intense competition worldwide in the markets in which we operate\n.\"\n16\nDistribution\nTo facilitate global distribution, our products are shipped from manufacturers to a network of distribution centers around the world for inspection, sorting, packing, and delivery to our retail locations and digital commerce and wholesale customers. This network includes the following primary distribution facilities:\nFacility Location\nGeographic Region Serviced\nFacility\nOwnership\nN. Pendleton Street, High Point, North Carolina\nU.S.\nOwned\nNC Highway 66, High Point, North Carolina\nU.S.\nLeased\nToronto, Ontario\nCanada\nThird-party\nParma, Italy\nEurope and Latin America\nThird-party\nYokohama, Japan\nJapan\nThird-party\nBugok, South Korea\nSouth Korea\nLeased\nTuen Mun, Hong Kong\nChina and Southeast Asia\n(a)\nThird-party\n(a)\nIncludes Australia and New Zealand.\nAll facilities are designed to allow for high-density cube storage and value-added services and utilize unit and carton tracking technology to facilitate process control and inventory management. The distribution network is managed through globally integrated information technology systems.\nInformation Systems \nOur information systems facilitate business processes, consumer experiences, and decision-making support across the Company and our extended ecosystem of manufacturers, vendors, business partners, and customers. Our system applications are connected to support the flow of information across functions, including, but not limited to (i) product design, sourcing, and production; (ii) merchandising planning and buying; (iii) comprehensive order processing, fulfillment, and distribution; (iv) retail store, digital commerce, and hospitality operations; (v) marketing and advertising; (vi) financial accounting and management reporting; and (vii) human resources.\nOur retail operation systems, including point-of-sale registers and merchandising, planning, and inventory management systems, support operational processes within our store network and link with our digital commerce processes to support omni-channel capabilities. \nWe are continually improving and upgrading our computer systems, services, and software. For example, during Fiscal 2025, we continued to enhance our solutions for advanced analytics, furthering our use of artificial intelligence (\"AI\"), both predictive and generative, and machine learning (\"ML\") for areas such as planning, marketing, and personalization. Our digital commerce enhancements included expanded payment methods, improved search capabilities, more personalized user experiences, and elevated content offerings. \nWe are also in the early stages of executing a large-scale multi-year global project that is expected to significantly transform the way in which we operate our business and further enable our long-term strategic pivot towards a global direct-to-consumer-oriented model (the \"Next Generation Transformation project\" or \"NGT project\"). The NGT project will be completed in phases and involves the redesigning of certain end-to-end processes and the implementation of a suite of information systems on a global scale. See Item 1 — \"\nBusiness — Recent Developments\n\" for further discussion regarding our NGT project.\nSee Item 1A — \"\nRisk Factors \n— \nRisks Related to Information Systems and Data Security.\n\"\nSee Item 1C — \"\nCybersecurity\n\" for discussion regarding our cybersecurity risk management and strategy, as well as our cybersecurity governance.\n17\nWholesale Credit Control\nWe manage our own credit function. We sell our merchandise principally to major department stores, specialty stores, and third-party digital partners, and extend credit based on an evaluation of the wholesale customer's financial capacity and condition, usually without requiring collateral. We monitor credit levels and the financial condition of our wholesale customers on a continuing basis to minimize credit risk. We do not factor or underwrite our accounts receivables, nor do we maintain credit insurance to manage the risk of bad debts. In North America, collection and deduction transactional activities are primarily provided through a third-party service provider. See Item 1A — \"\nRisk Factors \n— \nRisks Related to our Business and Operations \n— \nA substantial portion of our revenue is derived from a limited number of large wholesale customers. Our business could be adversely affected as a result of consolidations, liquidations, restructurings, other ownership changes in the retail industry, and/or any financial instability of our large wholesale customers\n.\"\nTrademarks\nWe own the RALPH LAUREN, POLO, POLO RALPH LAUREN, and the famous Polo Player Design trademarks in the U.S. and over 120 countries worldwide. Other trademarks that we own include, but are not limited to:\n•\nPURPLE LABEL;\n•\nDOUBLE RL;\n•\nRRL & DESIGN;\n•\nRLX;\n•\nRL;\n•\nLAUREN RALPH LAUREN;\n•\nPINK PONY;\n•\nLAUREN;\n•\nRALPH;\n•\nPOLO BEAR; and\n•\nCHAPS.\nMr. Ralph Lauren has the royalty-free right to use as trademarks RALPH LAUREN, DOUBLE RL, and RRL in perpetuity in connection with, among other things, beef and living animals. The trademarks DOUBLE RL and RRL are currently used by the Double RL Company, an entity wholly owned by Mr. R. Lauren. In addition, Mr. R. Lauren has the right to engage in personal projects involving film or theatrical productions (not including or relating to our business) through RRL Productions, Inc., a company wholly owned by Mr. R. Lauren. Any activity by these companies has no direct impact on us.\nOur trademarks are the subject of registrations and pending applications throughout the world for use on a variety of items of apparel, apparel-related products and accessories, home furnishings, restaurant and café services, online services and online publications, and beauty products, as well as in connection with retail services, and we continue to expand our worldwide usage and registration of related trademarks. In general, trademarks remain valid and enforceable as long as the marks are used in connection with the related products and services and the required registration renewals are filed. We regard the license to use the trademarks and our other proprietary rights in and to the trademarks as extremely valuable assets in marketing our products and, on a worldwide basis, vigorously seek to protect them against infringement. As a result of the appeal of our trademarks, our products have been the object of counterfeiting. While we have a broad enforcement program which has been generally effective in protecting our intellectual property rights and limiting the sale of counterfeit products in the U.S. and in most major markets abroad, we face greater challenges with respect to enforcing our rights against trademark infringement in certain parts of Asia.\n18\nIn markets outside of the U.S., our rights to some or all of our trademarks may not be clearly established. Over the course of our international expansion, we have experienced conflicts with various third parties who have acquired ownership rights in certain trademarks, including POLO and/or a representation of a Polo Player Design, which impede our use and registration of our principal trademarks. While such conflicts are common and may arise again from time to time as we continue our international expansion, we have, in general, successfully resolved such conflicts in the past through both legal action and negotiated settlements with third-party owners of the conflicting marks (see Item 1A — \"\nRisk Factors\n — \nRisks Related to our Business and Operations \n— \nOur trademarks and other intellectual property rights may not be adequately protected outside the U.S.\n\" and Item 3 — \"\nLegal Proceedings\n\" for further discussion). Although we have not suffered any material restraints or restrictions on doing business in desirable markets in the past, we cannot assure that significant impediments will not arise in the future as we expand product offerings and introduce trademarks to new markets.\nImport Restrictions and Other Government Regulations\nVirtually all of our merchandise imported into the Americas, Europe, Asia, Australia, and New Zealand is subject to duties. In addition, most of the countries to which we ship could impose safeguard quotas and duties to protect their local industries from import surges that threaten to create market disruption. The U.S. and other countries may also unilaterally impose additional duties in response to a particular product being imported at unfairly traded prices in such increased quantities that would cause (or threaten) injury to the relevant domestic industry (generally known as \"anti-dumping\" actions). If dumping is suspected in the U.S., the U.S. government may self-initiate a dumping case on behalf of the U.S. textile industry which could significantly affect our costs. Furthermore, additional duties, generally known as countervailing duties, can also be imposed by the U.S. government to offset subsidies provided by a foreign government to foreign manufacturers if the importation of such subsidized merchandise injures or threatens to injure a U.S. industry.\nIn addition, each of the countries in which our products are sold has laws and regulations covering imports. Because the U.S. and the other countries in which our products are manufactured and sold may, from time to time, impose new duties, tariffs, surcharges, or other import controls or restrictions, or adjust presently prevailing duty or tariff rates or levels, we maintain a program of intensive monitoring of import restrictions and opportunities. We seek to minimize our potential exposure to import-related risks through, among other measures, adjustments in product design and fabrication, shifts of production among countries and manufacturers, and through geographical diversification of our sources of supply.\nAs almost all of our products are manufactured by foreign suppliers, the enactment of new legislation or the administration of current international trade regulations or executive action affecting textile agreements, or changes in sourcing patterns could adversely affect our operations. We are also subject to other international trade agreements, such as the U.S.-Mexico-Canada Agreement, the Central American Free Trade Agreement, the U.S.-Peru Free Trade Agreement, the U.S.-Jordan Free Trade Agreement, the U.S.-Korea Free Trade Agreement and other special trade preference programs. A portion of our imported products are eligible for certain of these duty-advantaged programs. See Item 1A — \"\nRisk Factors \n— \nRisks Related to Regulatory, Legal, and Tax Matters \n—\n Our ability to conduct business globally may be affected by a variety of legal, regulatory, political, and economic risks\n\"\n \nand\n \n\"\nRisk Factors \n— \nRisks Related to our Business and Operations \n—\n Our business is subject to risks associated with importing products and the ability of our manufacturers to produce our goods on time and to our specifications.\n\"\n Apparel and other products sold by us are under the jurisdiction of multiple governmental agencies, including, in the U.S., the Federal Trade Commission, U.S. Customs & Border Protection, the U.S. Fish and Wildlife Service, the Environmental Protection Agency, and the Consumer Products Safety Commission. Our products are also subject to regulation in the U.S. and other countries, including the U.S. Consumer Product Safety Improvement Act, which relate principally to product labeling, licensing requirements, and consumer product safety requirements and regulatory testing, particularly with respect to products used by children. Any failure to comply with such requirements could result in significant penalties and require us to recall products, which could have a material adverse effect on our business or operating results. We believe that we are in substantial compliance with these regulations, as well as applicable federal, state, local, and foreign rules and regulations governing the discharge of materials hazardous to the environment. Our licensed products, licensing partners, buying/sourcing agents, and the vendors and factories with which we contract for the manufacture and distribution of our products are also subject to regulation. Our agreements require our licensing partners, buying/sourcing agents, vendors, and factories to operate in compliance with all applicable laws and regulations, and we are not aware of any violations which could reasonably be expected to have a material adverse effect on our business or operating results.\n19\nWe are also subject to disclosure and reporting requirements, established under existing or new federal or state laws, such as the requirements to identify the origin and existence of certain \"conflict minerals\" under the Dodd-Frank Wall Street Reform and Consumer Protection Act, and disclosures of specific actions to eradicate abusive labor practices in our supply chain under the California Transparency in Supply Chains Act. While we require our suppliers to operate in compliance with all applicable laws and our operating guidelines which promote ethical and socially responsible business practices, any violation of labor, environmental, health, and safety or other laws, or any divergence by an independent supplier's labor practices from generally accepted industry standards, could damage our reputation, disrupt our sourcing capabilities, and increase the cost of doing business, adversely affecting our results of operations. See Item 1A — \"\nRisk Factors \n— \nRisks Related to our Business and Operations \n—\n Our business could suffer if we fail to comply with labor laws or if one of our manufacturers fails to use acceptable labor or environmental practices.\n\"\nAlthough we have not suffered any material restriction from doing business in desirable markets in the past, we cannot assure that significant impediments will not arise in the future as we expand product offerings and introduce additional trademarks to new markets.\nHuman Capital\nOur purpose is to inspire the dream of a better life through authenticity and timeless style. This purpose extends to how we provide resources to support our employees' health, well-being, work-life harmony, and quality of life. We believe that attracting, developing, and retaining a diverse work force that is both skilled and motivated is critical to the successful execution of our long-term growth strategy. To this end, we are committed to creating a culture and work environment in which all employees feel welcome and can thrive, both as individuals and as part of our team. \nOur Board of Directors regularly reviews our people and development strategic initiatives.\nOur Employees\nAs of March 29, 2025, we had approximately 23,400 employees, comprised of approximately 15,000 full-time and 8,400 part-time employees. Approximately 9,800 of our employees are located in the U.S. and 13,600 are located in foreign countries.\nAs of March 29, 2025, approximately 64% and 36% of our global workforce self-identified as female and male, respectively. In the U.S., approximately 59% of our workforce self-identified as an underrepresented race and ethnic group and 34% self-identified as White, with the remaining 7% electing not to disclose such information.\nBelonging & Equity\nWe believe a diversity of backgrounds, skills, and experiences of our employees and our culture of inclusivity drive innovation and creativity. We are committed to further strengthening a sense of belonging and equal opportunities for all within our Company. Our strategy is guided by the following three focus areas:\n1.\nTalent\n — We ensure that fostering a culture of inclusion and belonging is a priority company-wide, resulting in the cultivation of diverse, best-in-class teams and equal opportunities for development. We also plan to drive progress towards our goal of exceeding an 80% employee survey score on \"my manager creates a sense of belonging for the entire team.\"\n2.\nEngagement\n — We enable open dialogue and create opportunities for the amplification of all voices and perspectives. Our Employee Impact Groups harness the talent and passion of our employees from around the world to help create an inclusive and engaging company culture.\n3.\nLearning\n — We remain dedicated to the growth and advancement of our talent and offer a wide range of development programs for all levels, including on-the-job training, coaching, and skill-building through our various customized learning and training programs. All our employee learning and development programs aim to promote our Ralph Lauren Success Drivers — the key attributes, skills, ways of thinking, and behaviors that ultimately create conditions that better enable individuals and teams to succeed.\nAdditional information relating to our initiatives can be found in our most recently published Global Citizenship & Sustainability Report covering Fiscal 2024, which is available on our corporate website at https://corporate.ralphlauren.com/citizenship-and-sustainability. Our Global Citizenship & Sustainability Report covering Fiscal 2025 is expected to be released in September 2025. The content of our sustainability reports is not incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with the SEC. \n20\nTalent Development\nThroughout Fiscal 2025, we evolved from a focus on Talent Development to a more holistic approach under the Employee Learning Experience. This transformation reflects our commitment to providing meaningful, purpose-driven learning opportunities that resonate on a personal level, evoke emotion, and inspire thoughtful self-reflection and connection to our Purpose and Strategy.\nThe Employee Learning Experience model enables us to offer more tailored, meaningful learning journeys that align with our purpose and foster continuous development. A cornerstone of this transformation has been the continued delivery of Situational Leadership® II (\"SLII\") for all people leaders. This experience reinforces a shared understanding of leadership development and strengthens our ability to grow high-performing teams that drive organizational success. Building on the foundation of SLII, a key highlight of Fiscal 2025 has been the launch of Purpose Driven Coaching. As we evolve our leadership philosophy, we are transitioning from traditional management styles to a coaching-oriented mindset. This shift promotes greater accountability, while ensuring employees feel seen, heard, and valued — fundamentally enhancing engagement and performance.\nIn parallel, we have placed significant emphasis on career development and aspirations. Our goal is to empower employees to take ownership of their career journeys by providing visibility into various career paths and organizational functions. This initiative has included Career Aspiration Days, where employees engage in interactive learning sessions and connect directly with cross-functional teams to explore required skills and competencies. In Europe and Asia we also launched our Associate Career Development Journeys highlighting key skills and behaviors required to grow and develop at each level. Additionally, we have introduced comprehensive Career Aspiration Toolkits for managers. These resources are designed to support meaningful career conversations and help teams navigate the full spectrum of career growth opportunities within the organization.\nThese initiatives reflect our unwavering commitment to building a culture of continuous learning, intentional growth, and empowered leadership aligned with our Purpose — positioning us for long-term success.\nEmployee Safety and Well-Being\nWe are committed to the safety, health, and overall well-being of each of our employees and their families, providing a wide array of physical, emotional, social, and financial support to meet this objective. THRIVE, our global wellness program and related application tool, provides access to volunteer events and physical and mental wellness support. The THRIVE application also provides a daily pulse question through Microsoft Teams, which links to additional wellness articles based on an employee's response. In addition, these pulse responses are tracked so that employees can view their well-being progress. In partnership with THRIVE, we also introduced a variety of activations throughout the year — from educational webinars on topics such as family, mind, finance, harmony, and health, to Wellness Journeys, a three-part training series delivered in each region and tailored to local Health & Wellness priorities. These efforts also included a company-wide Summer Challenge focused on promoting physical activity.\nTo streamline access to our resources and ensure consistency across all markets, we rebranded and relaunched our global wellness offering under the unified name RL Wellness. This shift reinforces our global approach to employee well-being and introduces new tools, including the RL Wellness Catalogue — a comprehensive, evergreen resource that clearly outlines the support available in each region — and the Quarterly Wellness Digest, a global initiative designed to increase visibility and alignment of our Health & Wellness efforts across all three regions. Part of these efforts include conversations with external mental health and wellness experts — including Olympians, leading psychologists, and best-selling authors — who shared insights to support and inspire our global teams.\nWe also continue to offer key well-being services around the world, including Gympass in the U.S., which supports physical and mental wellness through access to thousands of fitness centers and digital health partners; Bond in France, the United Kingdom, and the U.S., a personal safety app that provides real-time support from trained security professionals in situations that may feel unsafe; and Benefit Station in Japan, providing discounts on gyms, travel, language schools, restaurants, childcare, and elderly care services.\n21\nCompensation and Benefits\nWe are committed to providing competitive compensation and benefits to attract and retain a diverse and talented workforce. In addition, we take a proactive approach to pay equity and continually monitor our compensation programs to promote fairness.\nWe offer a wide array of both employer-paid and employee-paid benefits to support our employees' overall financial, physical, and mental well-being, including, but not limited to, healthcare and welfare benefits, retirement savings, paid time off, temporary leave, sabbaticals, and flexible work arrangements. We understand that everyone has unique needs when it comes to caring for and growing their families.\nWith the rise in cancer diagnoses, specifically around breast cancer and skin cancer, starting in January 2025, we are providing free additional coverage to essential screenings above the national guidelines to lower overall cost of treatment for our U.S. employees and provide better outcomes for those impacted. In addition, all Ralph Lauren employees and their eligible dependents will have the ability to virtually meet and consult with an expert from Memorial Sloan Kettering for free if they receive a cancer diagnosis.\nIn previous years, part-time employee benefits eligibility was determined by the average number of hours worked per week in a 12-month lookback period. Now, all part-time employees with one year of service, regardless of average hours worked, will be eligible for Ralph Lauren benefits for calendar 2025. Our two medical plan options have been enhanced to provide more coverage, such as diagnostic doctor's visits, and one of our medical plan options also includes additional coverage, such as diagnostic testing and prescription drugs. In addition, dental and vision coverage is also available and can be purchased without the requirement to bundle with a medical plan.\nInformation About Our Executive Officers\nAs of the filing date of this Form 10-K, the following are our current executive officers and their principal recent business experience:\nRalph Lauren\n \n  \nAge 85\n  \nMr. Ralph Lauren founded our business in 1967 and, for over five decades, has cultivated the iconography of America into a global lifestyle brand. He has been our Executive Chairman and Chief Creative Officer since November 2015, and a director of the Company since prior to our initial public offering in 1997. He had previously been our Chairman and Chief Executive Officer since prior to our initial public offering in 1997 until November 2015. In addition, he was previously a member of our Advisory Board or the Board of Directors of our predecessors since their organization. \nPatrice Louvet\n \nAge 60\nMr. Louvet has served as our President and Chief Executive Officer, and a director of the Company since July 2017. Prior to joining the Company, he served as the Group President, Global Beauty, of Procter & Gamble Co. (\"P&G\") since February 2015. Prior to that role, Mr. Louvet held successively senior leadership positions at P&G, including the roles of Group President, Global Grooming (Gillette), and President of P&G's Global Prestige Business. Before he joined P&G, he served as a Naval Officer, Admiral Aide de Camp in the French Navy from 1987 to 1989. Mr. Louvet graduated from École Supérieure de Commerce de Paris and received his M.B.A. from the University of Illinois. Mr. Louvet also serves on the board of trustees of the Hospital of Special Surgery and joined the board of directors of Danone in April 2022. He is also on the CEO Advisory Council of the Fashion Pact, a coalition committed to advancing environmental sustainability in the fashion and textile industries.\n22\nRobert Ranftl\n \nAge 53\nMr. Ranftl has been our Chief Operating Officer since April 2025. He is responsible for Global IT, Digital, Transformation, Logistics, Real Estate, Architecture and Store Design, and Licensing for the Company. He joined the Company as Chief Operating Officer of Asia Pacific in 2015 based in Hong Kong. He served as Chief Operating Officer of International for Asia Pacific, Europe and Latin America from April 2017 to April 2019 based in Geneva. He served as Chief Operating Officer of Commercial from April 2019 to April 2022 based in London. Most recently, Mr. Ranftl served as Regional CEO for North America from April 2022 to April 2025 where he was instrumental in leading the execution and progress toward the Company’s Next Great Chapter: Accelerate strategic goals, including returning the North America business to growth. Prior to joining the Company, Mr. Ranftl was with the VF Corporation where he was the Chief Financial Officer of Asia Pacific. Mr. Ranftl earned his Bachelor of Science degree from Johnson State College in Vermont.\nJustin Picicci\n \nAge 46\nMr. Picicci has served as our Chief Financial Officer since May 2024. He joined the Company in 2006 and has held a series of senior finance leadership roles across the organization. Most recently, he served as Enterprise Chief Financial Officer from July 2022 through April 2024, overseeing all internal finance functions. Prior to that, he held several key leadership positions, including Chief Financial Officer of North America (January 2020 to June 2022), Global Controller (June 2017 to December 2019), and Chief Financial Officer of Asia based in Hong Kong (May 2015 to May 2017). Before joining the Company, Mr. Picicci held finance roles at Interpublic Group and KPMG. He holds a Bachelor of Science degree from the University at Albany.\nDavid Lauren\n \nAge 53\nMr. David Lauren has been our Chief Branding and Innovation Officer, Strategic Advisor to the CEO, and Vice Chairman of the Board since April 2022. He served as our Chief Innovation Officer, Strategic Advisor to the CEO, and Vice Chairman of the Board from October 2016 to March 2022. Prior to that, he served in numerous leadership roles at the Company with responsibility for advertising, marketing, communications, and philanthropy. He has been a director of the Company since August 2013. Mr. D. Lauren oversees the Company's innovation strategy, processes, and capabilities to drive its brand strength and financial performance across all channels. He has been instrumental in growing the Company's global digital commerce business and pioneering our technology initiatives. Mr. D. Lauren is also the President of The Ralph Lauren Corporate Foundation (formerly known as The Polo Ralph Lauren Foundation). Before joining the Company in 2000, he was Editor-In-Chief and President of Swing, a general interest publication for Generation X. Mr. D. Lauren is the son of Mr. R. Lauren.\nHalide Alagöz\n \nAge 53\nMs. Alagöz joined the Company as the Corporate Senior Vice President of Global Manufacturing and Sourcing in 2016. She has been our Chief Product & Merchandising Officer since March 2025. Ms. Alagöz is responsible for our end-to-end product life cycle, bringing the magic of our design and product vision to life for our consumers around the world. She leads all brand and product teams, driving innovation and execution – from development and merchandising, to sourcing and through our store presentation – of all products across the Ralph Lauren portfolio. Prior to joining the Company, Ms. Alagöz was with H&M Corporation for 18 years, most recently in Hong Kong as the Head of Purchasing. During her tenure with H&M, Ms. Alagöz was responsible for various regional and global supply chain operations in Hong Kong, China, Bangladesh, and Turkey. She also serves on the board of directors of the American Apparel & Footwear Association since April 2018 and was confirmed as its Chair for its 2025-2026 term in March 2024. Ms. Alagöz earned both her bachelor's degree in Industrial Engineering and her master's degree in Engineering Management from Istanbul Technical University.\n23",
  "item7": "Item 7.\n    Management's Discussion and Analysis of Financial Condition and Results of Operations.\nThe following management's discussion and analysis of financial condition and results of operations (\"MD&A\") should be read together with our audited consolidated financial statements and notes thereto, which are included in this Annual Report on Form 10-K. We utilize a 52-53 week fiscal year ending on the Saturday closest to March 31. As such, Fiscal 2025 ended on March 29, 2025 and was a 52-week period; Fiscal 2024 ended on March 30, 2024 and was a 52-week period; Fiscal 2023 ended on April 1, 2023 and was a 52-week period; and Fiscal 2026 will end on March 28, 2026 and will be a 52-week period. \nINTRODUCTION\nMD&A is provided as a supplement to the accompanying consolidated financial statements and notes thereto to help provide an understanding of our results of operations, financial condition, and liquidity. MD&A is organized as follows:\n•\nOverview.\n    This section provides a general description of our business, global economic conditions and industry trends, and a summary of our financial performance for Fiscal 2025. In addition, this section includes a discussion of recent developments and transactions affecting comparability that we believe are important in understanding our results of operations and financial condition, and in anticipating future trends.\n•\nResults of operations.\n    This section provides an analysis of our results of operations for Fiscal 2025 and Fiscal 2024 as compared to the respective prior fiscal year.\n•\nFinancial condition and liquidity.\n    This section provides a discussion of our financial condition and liquidity as of March 29, 2025, which includes (i) an analysis of our financial condition as compared to the prior fiscal year-end; (ii) an analysis of changes in our cash flows for Fiscal 2025 and Fiscal 2024 as compared to the respective prior fiscal year; (iii) an analysis of our liquidity, including the availability under our commercial paper borrowing program and credit facilities, our supplier finance program, outstanding debt and covenant compliance, common stock repurchases, and payments of dividends; and (iv) a summary of our material cash requirements as of March 29, 2025.\n•\nMarket risk management.\n    This section discusses how we manage our risk exposures related to foreign currency exchange rates, interest rates, and our investments as of March 29, 2025.\n•\nCritical accounting policies.\n    This section discusses our critical accounting policies considered to be important to our results of operations and financial condition, which typically require significant judgment and estimation on the part of management in their application. In addition, all of our significant accounting policies, including our critical accounting policies, are summarized in Note 3 to the accompanying consolidated financial statements.\n•\nRecently issued accounting standards.\n    This section discusses the potential impact on our reported results of operations and financial condition of certain accounting standards that have been recently issued.\nOVERVIEW\nOur Business\nOur Company is a global leader in the design, marketing, and distribution of luxury lifestyle products, including apparel, footwear & accessories, home, fragrances, and hospitality. Our long-standing reputation and distinctive image have been developed across a wide range of products, brands, distribution channels, and international markets. Our brand names include Ralph Lauren, Ralph Lauren Collection, Ralph Lauren Purple Label, Double RL, Polo Ralph Lauren, Lauren Ralph Lauren, Polo Ralph Lauren Children, and Chaps, among others.\nWe diversify our business by geography (North America, Europe, and Asia, among other regions) and channel of distribution (retail, wholesale, and licensing). This allows us to maintain a dynamic balance as our operating results do not depend solely on the performance of any single geographic area or channel of distribution. We sell directly to consumers through our integrated retail channel, which includes our retail stores, concession-based shop-within-shops, and digital commerce operations around the world. Our wholesale sales are made principally to major department stores, specialty stores, and third-party digital partners around the world, as well as to certain third-party-owned stores to which we have licensed the right to operate in defined geographic territories using our trademarks. In addition, we license to third parties for specified periods the right to access our various trademarks in connection with the licensees' manufacture and sale of designated products, such as certain apparel categories, eyewear, fragrances, and home furnishings.\n44\nWe organize our business into the following three reportable segments: \n•\nNorth America \n— Our North America segment, representing approximately 43% of our Fiscal 2025 net revenues, primarily consists of sales of our Ralph Lauren branded products made through our retail and wholesale businesses primarily in the U.S. and Canada. In North America, our retail business is primarily comprised of our Ralph Lauren stores, our outlet stores, and our digital commerce sites, www.RalphLauren.com and www.RalphLauren.ca. Our wholesale business in North America is comprised primarily of sales to department stores and, to a lesser extent, specialty stores.\n•\nEurope \n— Our Europe segment, representing approximately 31% of our Fiscal 2025 net revenues, primarily consists of sales of our Ralph Lauren branded products made through our retail and wholesale businesses in Europe and emerging markets. In Europe, our retail business is primarily comprised of our Ralph Lauren stores, our outlet stores, our concession-based shop-within-shops, and our various digital commerce sites. Our wholesale business in Europe is comprised primarily of a varying mix of sales to both department stores and specialty stores, depending on the country, as well as to various third-party digital and licensee partners.\n•\nAsia \n— Our Asia segment, representing approximately 24% of our Fiscal 2025 net revenues, primarily consists of sales of our Ralph Lauren branded products made through our retail and wholesale businesses in Asia, Australia, and New Zealand. Our retail business in Asia is primarily comprised of our Ralph Lauren stores, our outlet stores, our concession-based shop-within-shops, and our various digital commerce sites. In addition, we sell our products online through various third-party digital partner commerce sites. Our wholesale business in Asia is comprised primarily of sales to department stores and various third-party digital and licensee partners.\nNo operating segments were aggregated to form our reportable segments. In addition to these reportable segments, we also have other non-reportable segments, representing approximately 2% of our Fiscal 2025 net revenues, which primarily consist of Ralph Lauren and Chaps branded royalty revenues earned through our global licensing alliances.\nApproximately 57% of our Fiscal 2025 net revenues were earned outside of the U.S. See Note 20 to the accompanying consolidated financial statements for further discussion of our segment reporting structure.\nOur business is typically affected by seasonal trends, with higher levels of retail sales in our second and third fiscal quarters and higher wholesale sales in our second and fourth fiscal quarters. These trends result primarily from the timing of key vacation travel, back-to-school, and holiday shopping periods impacting our retail business and timing of seasonal wholesale shipments. As a result of changes in our business, consumer spending patterns, and the macroeconomic environment, including those resulting from pandemic diseases and other catastrophic events, historical quarterly operating trends and working capital requirements may not be indicative of our future performance. In addition, fluctuations in sales, operating income (loss), and cash flows in any fiscal quarter may be affected by other events affecting retail sales, such as changes in weather patterns.\nRecent Developments\nNext Generation Transformation Project\nWe are in the early stages of executing a large-scale, multi-year global project that is expected to significantly transform the way in which we operate our business and further enable our long-term strategic pivot towards a global direct-to-consumer-oriented model (the \"Next Generation Transformation project\" or \"NGT project\"). The NGT project will be completed in phases and involves the redesigning of certain end-to-end processes and the implementation of a suite of technology systems on a global scale. Such efforts are expected to result in significant process improvements and the creation of synergies across core areas of operations, including merchandise buying and planning, procurement, inventory management, retail and wholesale operations, and financial planning and reporting, better enabling us to optimize inventory levels and increase the speed with which we react to changes in consumer demand across markets, among other benefits.  \nIn connection with the preliminary phase of the NGT project, we incurred other charges of $25.2 million and $5.1 million during Fiscal 2025 and Fiscal 2024, respectively, which were recorded within restructuring and other charges, net in the consolidated statements of operations. \n45\nGlobal Economic Conditions and Industry Trends\nThe global economy and retail industry are impacted by many uncontrollable factors. Most recently, the U.S. announced significant changes to its trade policies, including widespread tariff increases on imported goods, with potential further increases and revisions or terminations to existing trade agreements. In response, many countries have announced or are otherwise considering retaliatory tariffs on U.S. exports and other trade restrictions. This has led to significant uncertainty regarding the future relationship between the U.S. and other countries, as well as growing concerns about a global trade war, higher inflation, and a potential global recession, which has already caused significant volatility of global stock markets and foreign currency exchange rates. \nOther recent economic conditions, including ongoing inflationary pressures, organized labor disputes, high interest rates, significant foreign currency volatility, and military conflicts (as discussed below), continue to impact consumer discretionary income levels, spending, and sentiment in the U.S. and beyond. In response to such pressures, as well as to reduce elevated inventory levels, many retailers (particularly in the U.S.) continue to resort to promotional activity in an attempt to offset traffic declines and increase conversion. Furthermore, the department store sector has also experienced consolidations, restructurings, bankruptcies, and other ownership changes in recent times, as well as an increase in store closures. \nThe global economy has also been negatively impacted by ongoing military conflicts, including the Russia-Ukraine and Israel-Hamas wars, militant attacks on cargo vessels in the Red Sea, and other hostilities in the Middle East. Although our voluntary decision to suspend operations in Russia has not resulted in a material impact to our consolidated financial statements and our ongoing operations in Israel are also not material, our business has been, and may continue to be, affected by the broader macroeconomic implications resulting from these and other military conflicts, including inflationary pressures, unfavorable foreign currency exchange rates, increases in energy prices, food shortages, and financial market volatility, among other factors, which have adversely impacted consumer sentiment and confidence. It is not clear at this time how long these conflicts will endure, or if they will escalate further with additional countries declaring war against each other, which could further amplify the impacts of the various macroeconomic factors described above and potentially result in a global recession.\nThe global supply chain has also been negatively impacted by various factors, including disruptions at U.S. ports and in the Red Sea. Although our business has not been significantly impacted by such disruptions, we have experienced some shipping delays impacting the timing of inventory receipts, and if such disruptions were to continue over a prolonged period, it could result in further inventory receipt delays and/or higher freight costs in the near-term and beyond.\nWe have implemented various global strategies to address many of these challenges and continue to build a foundation for long-term profitable growth by strengthening our consumer-facing areas and driving a more efficient operating model. We continue to monitor the current geopolitical landscape, including the potential impact of higher tariffs should they become effective. We have taken proactive measures in recent years to diversify our supply chain from a geographic perspective and believe we can further mitigate potential cost pressures associated with new tariffs through a combination of our disciplined inventory management, leveraging our relationships with suppliers to reduce product costs, our ability to change country of origin, and pricing actions. However, should the proposed tariffs become effective, our profitability will be negatively impacted. Regarding mitigating inflationary pressures, our strategy includes numerous levers, including our ability to effectively increase prices, leveraging our diversified supply chain and strong supplier relationships, and leveraging our in-house quality control to reduce time and cost from the manufacturing process, among other efforts. Despite the competitive environment, we plan to continue driving our broader long-term strategy of brand elevation, which includes multiple levers to continue driving average unit retail growth and brand equity.\nWe will continue to monitor these conditions and trends and adjust our operating strategies to help mitigate the related impacts on our results of operations, while remaining focused on the long-term growth of our business and protecting and elevating the value of our brand.\nFor a detailed discussion of significant risk factors that have the potential to cause our actual results to differ materially from our expectations, see Part I, Item 1A — \"\nRisk Factors\n\" included in this Annual Report on Form 10-K.\n46\nSummary of Financial Performance\nOperating Results\nIn Fiscal 2025, we reported net revenues of $7.079 billion, net income of $742.9 million, and net income per diluted share of $11.61, as compared to net revenues of $6.631 billion, net income of $646.3 million, and net income per diluted share of $9.71 in Fiscal 2024. The comparability of our operating results has been affected by net restructuring-related charges, impairment of assets, and certain other charges (benefits), as well as foreign currency volatility. Our operating results are also susceptible to changes in macroeconomic conditions.\nOur operating performance for Fiscal 2025 reflected revenue increases of 6.8% on a reported basis and 7.7% on a constant currency basis, as defined within \"\nTransactions and Trends Affecting Comparability of Results of Operations and Financial Condition\n\"\n \nbelow. Net revenues reflected growth across all of our reportable segments.\n Our gross profit as a percentage of net revenues increased by 180 basis points to 68.6% during Fiscal 2025, primarily driven by the favorable geographic, channel, and product mix, average unit retail (\"AUR\") growth, and lower cotton costs, more than offsetting incremental pressure from non-cotton product costs and unfavorable foreign currency effects.\nSelling, general, and administrative (\"SG&A\") expenses as a percentage of net revenues increased by 30 basis points to 54.6% during Fiscal 2025, largely attributable to geographic and channel mix, as well as increases across various expense categories, including higher compensation-related expenses and higher marketing investments due to planned key campaign events.\nNet income increased by $96.6 million to $742.9 million in Fiscal 2025 as compared to Fiscal 2024, primarily due to a $175.7 million increase in our operating income, partially offset by a $76.7 million increase in our income tax provision. Net income per diluted share increased by $1.90 to $11.61 per share during Fiscal 2025 driven by the higher level of net income and lower weighted-average diluted shares outstanding.\nDuring Fiscal 2025 and Fiscal 2024, our operating results were negatively impacted by net restructuring-related charges, impairment of assets, and certain other charges (benefits) totaling $57.8 million and $69.9 million, respectively, which had an after-tax effect of reducing net income by $46.0 million, or $0.72 per diluted share, and $52.6 million, or $0.80 per diluted share, respectively. Net income during Fiscal 2024 also reflected an income tax benefit of $13.1 million, or $0.20 per diluted share, recorded in connection with non-recurring income tax events.\nFinancial Condition and Liquidity\nWe ended Fiscal 2025 in a net cash and short-term investments position (calculated as cash and cash equivalents, plus short-term investments, less total debt) of $940.4 million, as compared to $642.7 million as of the end of Fiscal 2024. The increase in our net cash and short-term investments position during Fiscal 2025 as compared to Fiscal 2024 was primarily due to our operating cash flows of $1.235 billion, partially offset by our use of cash to support Class A common stock repurchases of $480.9 million, including withholdings in satisfaction of tax obligations for stock-based compensation awards, to invest in our business through $216.2 million in capital expenditures, and to make dividend payments of $201.1 million.\nNet cash provided by operating activities was $1.235 billion during Fiscal 2025, as compared to $1.070 billion during Fiscal 2024. The net increase in cash provided by operating activities was due to an increase in net income before non-cash charges, as well as a net favorable change related to our operating assets and liabilities, including our working capital, as compared to the prior fiscal year.\nOur equity increased to $2.589 billion as of March 29, 2025, compared to $2.450 billion as of March 30, 2024 due to our comprehensive income and the net impact of stock-based compensation arrangements, partially offset by our share repurchase activity and dividends declared during Fiscal 2025.\n47\nTransactions and Trends Affecting Comparability of Results of Operations and Financial Condition\nThe comparability of our operating results for the three fiscal years presented herein has been affected by certain events, including:\n•\npretax charges incurred in connection with our restructuring activities, as well as certain other benefits (charges) as summarized below (references to \"Notes\" are to the notes to the accompanying consolidated financial statements):\n \nFiscal Years Ended\n \nMarch 29,\n2025\nMarch 30,\n2024\nApril 1,\n2023\n \n(millions)\nRestructuring and other charges, net (see Note 9)\n$\n(57.0)\n$\n(74.9)\n$\n(43.0)\nNon-routine inventory benefits (charges)\n(a)\n \n— \n4.5 \n(15.4)\nImpairment of assets (see Note 8)\n(0.8)\n— \n(9.7)\nNon-routine bad debt expense reversals\n(b)\n \n— \n0.5 \n2.1 \nTotal charges, net\n$\n(57.8)\n$\n(69.9)\n$\n(66.0)\n \n(a)\nNon-routine inventory benefits (charges) are recorded within cost of goods sold in the consolidated statements of operations. The benefits recorded during Fiscal 2024 primarily related to reversals of amounts previously recognized in connection with delays in U.S. customs shipment reviews and approvals (approximately $3 million) and the COVID-19 pandemic (approximately $2 million). Non-routine inventory charges, net recorded during Fiscal 2023 primarily related to the Russia-Ukraine war (approximately $10 million) and delays in U.S. customs shipment reviews and approvals (approximately $5 million). \n(b)\nNon-routine bad debt expense reversals are recorded within SG&A expenses in the consolidated statements of operations. Non-routine bad debt reversals, net recorded during Fiscal 2024 and Fiscal 2023 primarily related to charges previously recognized in connection with the Russia-Ukraine war.\n•\na one-time tax benefit of $13.1 million recorded within our income tax provision during Fiscal 2024 in connection with Swiss tax reform and the European Union's anti-tax avoidance directive, which decreased our Fiscal 2024 effective tax rate by 170 basis points. See Note 10 to the accompanying consolidated financial statements for further discussion.\nBecause we are a global company, the comparability of our operating results reported in U.S. Dollars is also affected by foreign currency exchange rate fluctuations because the underlying currencies in which we transact change in value over time compared to the U.S. Dollar. Such fluctuations can have a significant effect on our reported results. As such, in addition to financial measures prepared in accordance with accounting principles generally accepted in the U.S. (\"U.S. GAAP\"), our discussions often contain references to constant currency measures, which are calculated by translating current-year and prior-year reported amounts into comparable amounts using a single foreign exchange rate for each currency. We present constant currency financial information, which is a non-U.S. GAAP financial measure, as a supplement to our reported operating results. We use constant currency information to provide a framework for assessing how our businesses performed excluding the effects of foreign currency exchange rate fluctuations. We believe this information is useful to investors for facilitating comparisons of operating results and better identifying trends in our businesses. The constant currency performance measures should be viewed in addition to, and not in lieu of or superior to, our operating performance measures calculated in accordance with U.S. GAAP. Reconciliations between this non-U.S. GAAP financial measure and the most directly comparable U.S. GAAP measure are included in the \"Results of Operations\" section where applicable.\nOur discussion also includes reference to comparable store sales. Comparable store sales refer to the change in sales of our stores that have been open for at least 13 full fiscal months. Sales from our digital commerce sites are also included within comparable sales for those geographies that have been serviced by the related site for at least 13 full fiscal months. Sales for stores or digital commerce sites that are closed or shut down during the year are excluded from the calculation of comparable store sales. Sales for stores that are either relocated, enlarged (as defined by gross square footage expansion of 25% or greater), or generally closed for 30 or more consecutive days for renovation are also excluded from the calculation of comparable store sales until such stores have been operating in their new location or in their newly renovated state for at least 13 full fiscal months. All comparable store sales metrics are calculated on a 52-week and constant currency basis. \nOur \"Results of Operations\" discussion that follows includes the significant changes in operating results arising from these items affecting comparability. However, unusual items or transactions may occur in any period. Accordingly, investors and other financial statement users should consider the types of events and transactions that have affected operating trends.\n48\nRESULTS OF OPERATIONS\nFiscal 2025 Compared to Fiscal 2024\nThe following table summarizes our results of operations and expresses the percentage relationship to net revenues of certain financial statement captions. All percentages shown in the table below and the discussion that follows have been calculated using unrounded numbers.\n \nFiscal Years Ended\n \n \n \nMarch 29,\n2025\nMarch 30,\n2024\n$\nChange\n% / bps\nChange\n \n(millions, except per share data)\n \nNet revenues\n \n$\n7,079.0 \n$\n6,631.4 \n$\n447.6 \n6.8 \n%\nCost of goods sold\n(2,226.1)\n(2,199.6)\n(26.5)\n1.2 \n%\nGross profit\n \n4,852.9 \n4,431.8 \n421.1 \n9.5 \n%\nGross profit as % of net revenues\n68.6 \n%\n66.8 \n%\n180 \n bps\nSelling, general, and administrative expenses\n(3,863.0)\n(3,600.5)\n(262.5)\n7.3 \n%\nSG&A expenses as % of net revenues\n54.6 \n%\n54.3 \n%\n30 \n bps\nImpairment of assets\n(0.8)\n— \n(0.8)\n100.0 \n%\nRestructuring and other charges, net\n(57.0)\n(74.9)\n17.9 \n(23.9 \n%)\nOperating income\n \n932.1 \n756.4 \n175.7 \n23.2 \n%\nOperating income as % of net revenues\n13.2 \n%\n11.4 \n%\n180 \n bps\nInterest expense\n(44.1)\n(42.2)\n(1.9)\n4.6 \n%\nInterest income\n74.0 \n73.0 \n1.0 \n1.4 \n%\nOther expense, net\n(11.3)\n(9.8)\n(1.5)\n14.5 \n%\nIncome before income taxes\n \n950.7 \n777.4 \n173.3 \n22.3 \n%\nIncome tax provision\n(207.8)\n(131.1)\n(76.7)\n58.6 \n%\nEffective tax rate\n(a)\n \n21.9 \n%\n16.9 \n%\n500 \n bps\nNet income\n \n$\n742.9 \n$\n646.3 \n$\n96.6 \n14.9 \n%\nNet income per common share:\nBasic\n \n$\n11.86 \n$\n9.91 \n$\n1.95 \n19.7 \n%\nDiluted\n \n$\n11.61 \n$\n9.71 \n$\n1.90 \n19.6 \n%\n(a)\nEffective tax rate is calculated by dividing the income tax provision by income before income taxes.\nNet Revenues.\n    Net revenues increased by $447.6 million, or 6.8%, to $7.079 billion in Fiscal 2025 as compared to Fiscal 2024, reflecting growth across all of our reportable segments, partially offset by unfavorable foreign currency effects of $66.1 million. On a constant currency basis, net revenues increased by $513.7 million, or 7.7%.\nThe following table summarizes the\n percentage change in our Fiscal 2025 consolidated comparable store sales as compared to the prior fiscal year:\n \n% Change\nDigital commerce\n9 \n%\nBrick and mortar\n10 \n%\nTotal comparable store sales\n10 \n%\n49\nOur global average store count decreased by 20 stores and concession shops during Fiscal 2025 compared with the prior fiscal year, largely driven by concession shop closures in Asia and lower-tierd outlet store closures in North America. The following table details our retail store presence by segment as of the periods presented:\n \nMarch 29,\n2025\nMarch 30,\n2024\nFreestanding Stores:\nNorth America\n223 \n230 \nEurope\n104 \n103 \nAsia\n237 \n231 \nTotal freestanding stores\n564 \n564 \nConcession Shops:\nNorth America\n— \n1 \nEurope\n30 \n27 \nAsia\n641 \n671 \nTotal concession shops\n671 \n699 \nTotal stores\n1,235 \n1,263 \nIn addition to our stores, we sell products online in North America, Europe, and Asia through our various digital commerce sites, as well as through our Polo mobile apps in the U.S. We also sell products online through various third-party digital partner commerce sites, primarily in Asia.\nNet revenues for our segments, as well as a discussion of the changes in each reportable segment's net revenues from the prior fiscal year, are provided below:\n \nFiscal Years Ended\n$ Change\nForeign Exchange Impact\n$ Change\n% Change\n \nMarch 29,\n2025\nMarch 30,\n2024\nAs\nReported\nConstant Currency\nAs\nReported\nConstant\nCurrency\n \n(millions)\n \nNet Revenues:\nNorth America\n$\n3,050.1 \n$\n2,950.5 \n$\n99.6 \n$\n(4.3)\n$\n103.9 \n3.4 \n%\n3.5 \n%\nEurope\n2,174.9 \n1,968.0 \n206.9 \n(13.2)\n220.1 \n10.5 \n%\n11.2 \n%\nAsia\n1,709.4 \n1,566.6 \n142.8 \n(48.5)\n191.3 \n9.1 \n%\n12.2 \n%\nOther non-reportable segments\n144.6 \n146.3 \n(1.7)\n(0.1)\n(1.6)\n(1.1 \n%)\n(1.1 \n%)\nTotal net revenues\n$\n7,079.0 \n$\n6,631.4 \n$\n447.6 \n$\n(66.1)\n$\n513.7 \n6.8 \n%\n7.7 \n%\nNorth America net revenues\n — Net revenues increased by $99.6 million, or 3.4%, during Fiscal 2025 as compared to Fiscal 2024. On a constant currency basis, net revenues increased by $103.9 million, or 3.5%. \nThe $99.6 million increase in North America net revenues was driven by:\n•\na $118.5 million increase related to our North America retail business. On a constant currency basis, net revenues increased by $121.9 million, reflecting increases of $114.3 million in comparable store sales and $7.6 million in non-comparable store sales. The increase in our comparable store sales reflected high-single digit AUR growth during Fiscal 2025 as compared to the prior fiscal year, as well as higher traffic. The following table summarizes the percentage changes in comparable store sales related to our North America retail business:\n \n% Change\nDigital commerce\n2 \n%\nBrick and mortar\n8 \n%\nTotal comparable store sales\n6 \n%\n50\nThis increase was partially offset by an $18.9 million decline related to our North America wholesale business primarily driven by reduced excess inventory sales in the off-price wholesale channel.\nEurope net revenues\n — Net revenues increased by $206.9 million, or 10.5%, during Fiscal 2025 as compared to Fiscal 2024. On a constant currency basis, net revenues increased by $220.1 million, or 11.2%. \nThe $206.9 million increase in Europe net revenues was driven by:\n•\na $132.8 million increase related to our Europe retail business, inclusive of unfavorable foreign currency effects of $6.2 million. On a constant currency basis, net revenues increased by $139.0 million, reflecting increases of $132.8 million in comparable store sales and $6.2 million in non-comparable store sales. The increase in our comparable store sales reflected low-double digit AUR growth during Fiscal 2025 as compared to the prior fiscal year, as well as higher traffic. The following table summarizes the percentage changes in comparable store sales related to our Europe retail business:\n \n% Change\nDigital commerce\n16 \n%\nBrick and mortar\n14 \n%\nTotal comparable store sales\n15 \n%\n•\na $74.1 million increase related to our Europe wholesale business largely driven by stronger re-order trends more than offsetting planned reductions within the off-price wholesale channel and unfavorable foreign currency effects of $7.0 million. \nAsia net revenues\n — Net revenues increased by $142.8 million, or 9.1%, during Fiscal 2025 as compared to Fiscal 2024. On a constant currency basis, net revenues increased by $191.3 million, or 12.2%.\nThe $142.8 million increase in Asia net revenues was driven by: \n•\na $167.8 million increase related to our Asia retail business, inclusive of unfavorable foreign currency effects of $46.6 million. On a constant currency basis, net revenues increased by $214.4 million, reflecting increases of $151.4 million in comparable store sales and $63.0 million in non-comparable store sales. The increase in our comparable store sales reflected low-double digit AUR growth during Fiscal 2025 as compared to the prior fiscal year, as well as higher traffic. The following table summarizes the percentage changes in comparable store sales related to our Asia retail business:  \n \n% Change\nDigital commerce\n25 \n%\nBrick and mortar\n11 \n%\nTotal comparable store sales\n12 \n%\nThis increase was partially offset by a $25.0 million decline related to our Asia wholesale business, largely driven by decreases in South Korea and Japan.\nGross Profit.    \nGross profit increased by $421.1 million, or 9.5%, to $4.853 billion in Fiscal 2025, including unfavorable foreign currency effects of $62.8 million. Gross profit as a percentage of net revenues increased to 68.6% in Fiscal 2025 from 66.8% in Fiscal 2024. The 180 basis point improvement was primarily driven by the favorable impact of approximately 70 basis points attributable to geographic and channel mix. The remaining 110 basis point improvement was primarily due to AUR growth of approximately high-single digits, lower cotton costs, and favorable product mix, more than offsetting incremental pressure from non-cotton products costs and unfavorable foreign currency effects of approximately 20 basis points.\nGross profit is the difference between total net revenues and cost of goods sold. Cost of goods sold includes the amounts incurred to acquire and produce inventory for sale to our customers, including product costs, freight-in, and import costs, as well as changes in reserves for shrinkage and inventory realizability. Gains and losses associated with forward foreign currency exchange contracts that are designated and qualifying as cash flow hedges of inventory transactions are also recognized within cost of goods sold when the hedged inventory is sold. The costs of selling merchandise, including those associated with preparing merchandise for sale, such as picking, packing, warehousing, and order charges, are included in SG&A expenses in the consolidated statements of operations. As a result, our gross profit may not be comparable to that of other entities.\n51\nSelling, General, and Administrative Expenses.\n    SG&A expenses include costs relating to compensation and benefits, marketing and advertising, rent and occupancy, distribution, information technology, legal, depreciation and amortization, bad debt, and other selling and administrative costs. SG&A expenses increased by $262.5 million, or 7.3%, to $3.863 billion in Fiscal 2025, including favorable foreign currency effects of $30.8 million. SG&A expenses as a percentage of net revenues increased to 54.6% in Fiscal 2025 from 54.3% in Fiscal 2024. The 30 basis point increase was largely attributable to geographic and channel mix resulting from growth of our international and retail businesses which typically carry higher operating expense margins, as well as increases across various expense categories, including higher compensation-related expenses and marketing investments due to planned key campaign events.\nThe $262.5 million increase in SG&A expenses was driven by:\nFiscal 2025\nCompared to \nFiscal 2024\n(millions)\nSG&A expense category:\nCompensation-related expenses\n$\n118.6 \nMarketing and advertising expenses\n49.3 \nRent and occupancy costs\n30.2 \nNon-income-related taxes\n24.0 \nSelling-related expenses\n17.6 \nOther\n22.8 \nTotal increase in SG&A expenses\n$\n262.5 \nImpairment of Assets.\n    During Fiscal 2025, we recorded impairment charges of $0.8 million to write-down long-lived assets in connection with certain North America wholesale shops that are expected to close earlier than the end of their original estimated useful life due to the related customer declaring bankruptcy. On a comparative basis, no impairment charges were recorded during Fiscal 2024. See Note 8 to the accompanying consolidated financial statements.\nRestructuring and Other Charges, Net.\n   During Fiscal 2025 and Fiscal 2024, we recorded net restructuring charges of $20.4 million and $55.8 million, respectively, primarily consisting of severance and benefits costs, as well as other charges of $11.4 million and $14.0 million, respectively, primarily related to rent and occupancy costs associated with certain previously exited real estate locations in connection with our restructuring activities for which the related lease agreements have not yet expired. In addition, during Fiscal 2025 and Fiscal 2024, we recorded other charges of $25.2 million and $5.1 million, respectively, in connection with our Next Generation Transformation project (refer to \n\"Recent Developments\"\n for additional discussion) and recorded other income of $2.8 million and $7.0 million, respectively, related to consideration received from Regent, L.P. in connection with our previously sold Club Monaco business. We donated this income to The Ralph Lauren Corporate Foundation, a non-profit, charitable foundation, which resulted in related offsetting donation expenses of $2.8 million and $7.0 million during Fiscal 2025 and Fiscal 2024, respectively. See Note 9 to the accompanying consolidated financial statements.\nOperating Income.\n    Operating income increased by $175.7 million, or 23.2%, to $932.1 million during Fiscal 2025, reflecting unfavorable foreign currency effects of $32.0 million. Our operating results during Fiscal 2025 and Fiscal 2024 were negatively impacted by net restructuring-related charges, impairment of assets, and certain other charges (benefits) totaling $57.8 million and $69.9 million, respectively. Operating income as a percentage of net revenues was 13.2% in Fiscal 2025, reflecting a 180 basis point improvement from Fiscal 2024. The improvement in operating income as a percentage of net revenues was primarily driven by the increase in our gross margin, as well as lower net restructuring-related charges and certain other charges (benefits) recorded during Fiscal 2025 as compared to the prior fiscal year, partially offset by the increase in SG&A expenses as a percentage of net revenues, all as previously discussed.\n52\nOperating income and margin for our segments, as well as a discussion of the changes in each reportable segment's operating margin from the prior fiscal year, are provided below:\n \nFiscal Years Ended\n \n \nMarch 29, 2025\nMarch 30, 2024\n \n \nOperating\nIncome\nOperating\nMargin\nOperating\nIncome\nOperating\nMargin\n$\nChange\nMargin\nChange\n(millions)\n \n(millions)\n \n(millions)\n \nSegment:\nNorth America\n$\n640.1 \n21.0%\n$\n548.9 \n18.6%\n$\n91.2 \n240 bps\nEurope\n566.2 \n26.0%\n464.6 \n23.6%\n101.6 \n240 bps\nAsia\n413.2 \n24.2%\n335.9 \n21.4%\n77.3 \n280 bps\nOther non-reportable segments\n \n125.8 \n87.0%\n128.9 \n88.1%\n(3.1)\n(110 bps)\nTotal segment operating income\n1,745.3 \n1,478.3 \n267.0 \nCorporate expenses, net\n(755.4)\n(647.0)\n(108.4)\nImpairment of assets\n(a)\n \n(0.8)\n— \n(0.8)\nRestructuring and other charges, net\n(a)\n \n(57.0)\n(74.9)\n17.9 \nTotal operating income\n$\n932.1 \n13.2%\n$\n756.4 \n11.4%\n$\n175.7 \n180 bps\n(a)\nSee discussion above for additional information related to impairment of assets and restructuring and other charges, net recorded during the fiscal years presented.\nNorth America operating margin\n improved by 240 basis points due to an increase of 230 basis points in gross margin and a decline of 10 basis points in SG&A expense as a percentage of net revenues. The overall improvement in operating margin was inclusive of the unfavorable impact of approximately 10 basis points attributable to channel mix. \nEurope operating margin\n improved by 240 basis points entirely due to an increase in gross margin. The overall improvement in operating margin was inclusive of the unfavorable impacts of approximately 30 basis points and 20 basis points related to foreign currency effects and channel mix, respectively. \nAsia operating margin\n improved by 280 basis points due to a decline of 190 basis points in SG&A expenses as a percentage of net revenues and an increase of 80 basis points in gross margin. The overall improvement in operating margin was inclusive of the unfavorable impacts of approximately 50 basis points and 20 basis points related to foreign currency effects and channel mix, respectively. \nCorporate expenses\n increased by $108.4 million to $755.4 million in Fiscal 2025 as compared to the prior fiscal year. The increase in corporate expenses was due to higher compensation-related expenses of $50.7 million, higher non-income taxes of $23.9 million, higher marketing and advertising expenses of $13.5 million, lower intercompany sourcing commission of $9.3 million (which is offset at the segment level and eliminates in consolidation), lower non-routine inventory benefits of $4.5 million, and higher other expenses of $22.8 million, partially offset by lower rent and occupancy expenses of $16.3 million.\nNon-operating Income (Expense), Net.\n    Non-operating income (expense), net is comprised of interest expense, interest income, and other income (expense), net, which includes foreign currency gains (losses), equity in income (losses) from our equity-method investees, and other non-operating expenses. During Fiscal 2025, we reported non-operating income, net, of $18.6 million as compared to $21.0 million during Fiscal 2024. The $2.4 million decrease in non-operating income, net was primarily driven by higher interest expense.\nIncome Tax Provision.\n    The income tax provision represents federal, foreign, state and local income taxes. Our effective tax rate will change from period to period based on various factors including, but not limited to, the geographic mix of earnings, the timing and amount of foreign dividends, enacted tax legislation, state and local taxes, tax audit findings and settlements, and the interaction of various global tax strategies.\n53\nThe income tax provision and effective tax rate in Fiscal 2025 were $207.8 million and 21.9%, respectively, compared to $131.1 million and 16.9%, respectively, in Fiscal 2024. The $76.7 million increase in our income tax provision was primarily driven by an increase in our pretax income, as well as a 500 basis point increase in our effective tax rate. The increase in our effective tax rate was due to the absence of prior year favorable adjustments related to the accrual of deferred tax assets in connection with a transaction entered into as part of a reorganization of our corporate entity structure, and revaluation of deferred tax assets as a result of tax rate changes enacted in the prior year period, partially offset by a current year favorable adjustment related to the revaluation of a deferred tax liability on foreign earnings. The increase in our effective tax rate was also due to the absence of a one-time tax benefit of $13.1 million recorded during Fiscal 2024 in connection with Swiss tax reform and the European Union's anti-tax avoidance directive, which lowered our prior fiscal year period effective tax rate by 170 basis points. See Note 10 to the accompanying consolidated financial statements.\nNet Income.\n    Net income increased to $742.9 million in Fiscal 2025, from $646.3 million in Fiscal 2024. The $96.6 million increase in net income was primarily due to an increase in our operating income, partially offset by an increase in our income tax provision, both as previously discussed. Our operating results during Fiscal 2025 and Fiscal 2024 were negatively impacted by net restructuring-related charges, impairment of assets, and certain other charges (benefits) totaling $57.8 million and $69.9 million, respectively, which had an after-tax effect of reducing net income by $46.0 million and $52.6 million, respectively. Net income during Fiscal 2024 also reflected an income tax benefit of $13.1 million recorded in connection with Swiss tax reform and the European Union's anti-tax avoidance directive, as previously discussed.\nNet Income per Diluted Share.\n    Net income per diluted share increased to $11.61 in Fiscal 2025, from $9.71 in Fiscal 2024. The $1.90 per share increase was primarily driven by the higher level of net income, as previously discussed, and lower weighted-average diluted shares outstanding during Fiscal 2025 driven by our share repurchases during the last twelve months. Net income per diluted share for Fiscal 2025 and Fiscal 2024 were also negatively impacted by $0.72 per share and $0.80 per share, respectively, attributable to net restructuring-related charges, impairment of assets, and certain other charges (benefits), as previously discussed. Net income per diluted share during Fiscal 2024 was also favorably impacted by $0.20 due to an income tax benefit recorded in connection with Swiss tax reform and the European Union's anti-tax avoidance directive, as previously discussed.\n54\nFiscal 2024 Compared to Fiscal 2023\nThe following table summarizes our results of operations and expresses the percentage relationship to net revenues of certain financial statement captions. All percentages shown in the table below and the discussion that follows have been calculated using unrounded numbers.\n \nFiscal Years Ended\n \n \n \nMarch 30,\n2024\nApril 1,\n2023\n$\nChange\n% / bps\nChange\n \n(millions, except per share data)\n \nNet revenues\n \n$\n6,631.4 \n$\n6,443.6 \n$\n187.8 \n2.9 \n%\nCost of goods sold\n(2,199.6)\n(2,277.8)\n78.2 \n(3.4 \n%)\nGross profit\n \n4,431.8 \n4,165.8 \n266.0 \n6.4 \n%\nGross profit as % of net revenues\n66.8 \n%\n64.6 \n%\n220 \n bps\nSelling, general, and administrative expenses\n(3,600.5)\n(3,408.9)\n(191.6)\n5.6 \n%\nSG&A expenses as % of net revenues\n54.3 \n%\n52.9 \n%\n140 \n bps\nImpairment of assets\n— \n(9.7)\n9.7 \n(100.0 \n%)\nRestructuring and other charges, net\n(74.9)\n(43.0)\n(31.9)\n74.1 \n%\nOperating income\n \n756.4 \n704.2 \n52.2 \n7.4 \n%\nOperating income as % of net revenues\n11.4 \n%\n10.9 \n%\n50 \n bps\nInterest expense\n(42.2)\n(40.4)\n(1.8)\n4.4 \n%\nInterest income\n73.0 \n32.2 \n40.8 \n127.1 \n%\nOther expense, net\n(9.8)\n(4.1)\n(5.7)\n142.3 \n%\nIncome before income taxes\n \n777.4 \n691.9 \n85.5 \n12.4 \n%\nIncome tax provision\n(131.1)\n(169.2)\n38.1 \n(22.5 \n%)\nEffective tax rate\n(a)\n \n16.9 \n%\n24.5 \n%\n(760 \n bps)\nNet income\n \n$\n646.3 \n$\n522.7 \n$\n123.6 \n23.7 \n%\nNet income per common share:\nBasic\n \n$\n9.91 \n$\n7.72 \n$\n2.19 \n28.4 \n%\nDiluted\n \n$\n9.71 \n$\n7.58 \n$\n2.13 \n28.1 \n%\n(a)\nEffective tax rate is calculated by dividing the income tax provision by income before income taxes.\nNet Revenues.\n    Net revenues increased by $187.8 million, or 2.9%, to $6.631 billion in Fiscal 2024 as compared to Fiscal 2023, including favorable foreign currency effects of $12.4 million. On a constant currency basis, net revenues increased by $175.4 million, or 2.7%. These increases were driven by our international businesses.\nThe following table summarizes the\n percentage change in our Fiscal 2024 consolidated comparable store sales as compared to the prior fiscal year:\n \n% Change\nDigital commerce\n5 \n%\nBrick and mortar\n6 \n%\nTotal comparable store sales\n6 \n%\n55\nOur global average store count increased by 30 stores and concession shops during Fiscal 2024 compared with the prior fiscal year, driven by new openings primarily in Asia. The following table details our retail store presence by segment as of the periods presented:\n \nMarch 30,\n2024\nApril 1,\n2023\nFreestanding Stores:\nNorth America\n230 \n237 \nEurope\n103 \n104 \nAsia\n231 \n212 \nTotal freestanding stores\n564 \n553 \nConcession Shops:\nNorth America\n1 \n1 \nEurope\n27 \n29 \nAsia\n671 \n692 \nTotal concession shops\n699 \n722 \nTotal stores\n1,263 \n1,275 \nIn addition to our stores, we sold products online in North America, Europe, and Asia through our various digital commerce sites, as well as through our Polo mobile apps in the U.S. We also sold products online through various third-party digital partner commerce sites, primarily in Asia.\nNet revenues for our segments, as well as a discussion of the changes in each reportable segment's net revenues from the prior fiscal year, are provided below:\n \nFiscal Years Ended\n$ Change\nForeign Exchange Impact\n$ Change\n% Change\n \nMarch 30,\n2024\nApril 1,\n2023\nAs\nReported\nConstant Currency\nAs\nReported\nConstant\nCurrency\n \n(millions)\n \nNet Revenues:\nNorth America\n$\n2,950.5 \n$\n3,020.5 \n$\n(70.0)\n$\n(2.2)\n$\n(67.8)\n(2.3 \n%)\n(2.2 \n%)\nEurope\n1,968.0 \n1,839.2 \n128.8 \n69.6 \n59.2 \n7.0 \n%\n3.2 \n%\nAsia\n1,566.6 \n1,426.7 \n139.9 \n(55.0)\n194.9 \n9.8 \n%\n13.7 \n%\nOther non-reportable segments\n146.3 \n157.2 \n(10.9)\n— \n(10.9)\n(6.9 \n%)\n(6.9 \n%)\nTotal net revenues\n$\n6,631.4 \n$\n6,443.6 \n$\n187.8 \n$\n12.4 \n$\n175.4 \n2.9 \n%\n2.7 \n%\nNorth America net revenues\n — Net revenues decreased by $70.0 million, or 2.3%, during Fiscal 2024 as compared to Fiscal 2023. On a constant currency basis, net revenues decreased by $67.8 million, or 2.2%. \nThe $70.0 million decline in North America net revenues was driven by:\n•\na $113.3 million decline related to our North America wholesale business as we carefully managed sell-ins to our wholesale customers to better align with consumer demand, as well as the return to a more normalized timing of shipments following the prior year's supply chain disruption.\nThis decline was partially offset by:\n•\na $43.3 million increase related to our North America retail business. On a constant currency basis, net revenues increased by $44.3 million, reflecting increases of $35.9 million in comparable store sales and $8.4 million in non-comparable store sales. The increase in our comparable store sales reflected high-single digit AUR growth during Fiscal 2024 as compared to Fiscal 2023, as well as higher traffic. The following table summarizes the percentage changes in comparable store sales related to our North America retail business:\n56\n \n% Change\nDigital commerce\n— \n%\nBrick and mortar\n3 \n%\nTotal comparable store sales\n2 \n%\nEurope net revenues\n — Net revenues increased by $128.8 million, or 7.0%, during Fiscal 2024 as compared to Fiscal 2023. On a constant currency basis, net revenues increased by $59.2 million, or 3.2%. \nThe $128.8 million increase in Europe net revenues was driven by:\n•\na $112.9 million increase related to our Europe retail business, inclusive of favorable foreign currency effects of $31.4 million. On a constant currency basis, net revenues increased by $81.5 million, reflecting increases of $66.7 million in comparable store sales and $14.8 million in non-comparable store sales. The increase in our comparable store sales reflected low-teens AUR growth during Fiscal 2024 as compared to Fiscal 2023, as well as higher traffic. The following table summarizes the percentage changes in comparable store sales related to our Europe retail business:\n \n% Change\nDigital commerce\n11 \n%\nBrick and mortar\n7 \n%\nTotal comparable store sales\n8 \n%\n•\na $15.9 million increase related to our Europe wholesale business largely driven by favorable foreign currency effects of $38.2 million and stronger re-order trends, more than offsetting the negative impact of lapping the prior fiscal year's favorable post-pandemic wholesale allowances.\nAsia net revenues\n — Net revenues increased by $139.9 million, or 9.8%, during Fiscal 2024 as compared to Fiscal 2023. On a constant currency basis, net revenues increased by $194.9 million, or 13.7%. \nThe $139.9 million increase in Asia net revenues was driven by: \n•\na $141.7 million increase related to our Asia retail business, inclusive of unfavorable foreign currency effects of $51.5 million. On a constant currency basis, net revenues increased by $193.2 million, reflecting increases of $116.9 million in comparable store sales and $76.3 million in non-comparable store sales. The increase in our comparable store sales reflected low-teens AUR growth during Fiscal 2024 as compared to Fiscal 2023, as well as higher traffic. The following table summarizes the percentage changes in comparable store sales related to our Asia retail business:  \n \n% Change\nDigital commerce\n19 \n%\nBrick and mortar\n10 \n%\nTotal comparable store sales\n10 \n%\nThis increase was partially offset by a $1.8 million decline related to our Asia wholesale business, inclusive of unfavorable foreign currency effects of $3.5 million.\nGross Profit.    \nGross profit increased by $266.0 million, or 6.4%, to $4.432 billion in Fiscal 2024, including unfavorable foreign currency effects of $4.9 million. Gross profit as a percentage of net revenues increased to 66.8% in Fiscal 2024 from 64.6% in Fiscal 2023. The 220 basis point improvement was primarily driven by the favorable impacts of approximately 90 basis points attributable to geographic and channel mix and 30 basis points attributable to lower non-routine inventory charges recorded during Fiscal 2024 as compared to the prior fiscal year. The remaining 100 basis point improvement was primarily due to lower freight costs and AUR growth of approximately low-double digits, more than offsetting incremental pressure from higher cotton costs and unfavorable foreign currency effects of 20 basis points.\n57\nSelling, General, and Administrative Expenses.\n    SG&A expenses increased by $191.6 million, or 5.6%, to $3.600 billion in Fiscal 2024, including favorable foreign currency effects of $11.4 million. SG&A expenses as a percentage of net revenues increased to 54.3% in Fiscal 2024 from 52.9% in Fiscal 2023. The 140 basis point increase was largely attributable to geographic and channel mix resulting from growth of our international and retail businesses which typically carry higher operating expense margins.\nThe $191.6 million increase in SG&A expenses was driven by:\nFiscal 2024\nCompared to \nFiscal 2023\n(millions)\nSG&A expense category:\nCompensation-related expenses\n$\n108.2 \nRent and occupancy costs\n30.9 \nMarketing and advertising expenses\n28.9 \nDepreciation and amortization expense\n8.3 \nOther\n15.3 \nTotal increase in SG&A expenses\n$\n191.6 \nImpairment of Assets.\n    No impairment charges were recorded during Fiscal 2024. On a comparative basis, during Fiscal 2023, we recorded impairment charges of $9.7 million to write-down certain long-lived assets, primarily related to a certain previously exited real estate location for which the related lease agreement had not yet expired. See Note 8 to the accompanying consolidated financial statements.\nRestructuring and Other Charges, Net.\n   During Fiscal 2024 and Fiscal 2023, we recorded net restructuring charges and benefits of $55.8 million and $19.2 million, respectively, primarily consisting of severance and benefits costs, as well as other charges of $14.0 million and $23.8 million, respectively, primarily related to rent and occupancy costs associated with certain previously exited real estate locations in connection with our restructuring activities for which the related lease agreements had not yet expired. In addition, during Fiscal 2024 we recorded other charges of $5.1 million in connection with our Next Generation Transformation project (refer to \n\"Recent Developments\"\n for additional discussion). Additionally, during Fiscal 2024 and Fiscal 2023, we recognized income of $7.0 million and $3.5 million, respectively, related to consideration received from Regent, L.P. in connection with our previously sold Club Monaco business. We donated this income to The Ralph Lauren Corporate Foundation, which resulted in related offsetting donation expenses of $7.0 million and $3.5 million during Fiscal 2024 and Fiscal 2023, respectively. See Note 9 to the accompanying consolidated financial statements.\nOperating Income.\n    Operating income increased by $52.2 million, or 7.4%, to $756.4 million during Fiscal 2024, reflecting favorable foreign currency effects of $6.5 million. Our operating results during Fiscal 2024 and Fiscal 2023 were negatively impacted by net restructuring-related charges, impairment of assets, and certain other charges (benefits) totaling $69.9 million and $66.0 million, respectively. Operating income as a percentage of net revenues was 11.4% in Fiscal 2024, reflecting a 50 basis point improvement from Fiscal 2023. The improvement in operating income as a percentage of net revenues was primarily driven by the increase in our gross margin, partially offset by the increase in SG&A expenses as a percentage of net revenues, both as previously discussed.\n58\nOperating income and margin for our segments, as well as a discussion of the changes in each reportable segment's operating margin from the prior fiscal year, are provided below:\n \nFiscal Years Ended\n \n \nMarch 30, 2024\nApril 1, 2023\n \n \nOperating\nIncome\nOperating\nMargin\nOperating\nIncome\nOperating\nMargin\n$\nChange\nMargin\nChange\n(millions)\n \n(millions)\n \n(millions)\n \nSegment:\nNorth America\n$\n548.9 \n18.6%\n$\n565.1 \n18.7%\n$\n(16.2)\n(10 bps)\nEurope\n464.6 \n23.6%\n407.3 \n22.1%\n57.3 \n150 bps\nAsia\n335.9 \n21.4%\n289.6 \n20.3%\n46.3 \n110 bps\nOther non-reportable segments\n \n128.9 \n88.1%\n146.4 \n93.1%\n(17.5)\n(500 bps)\nTotal segment operating income\n1,478.3 \n1,408.4 \n69.9 \nCorporate expenses\n(a)\n \n(647.0)\n(651.5)\n4.5 \nImpairment of assets\n(a)\n \n— \n(9.7)\n9.7 \nRestructuring and other charges, net\n(74.9)\n(43.0)\n(31.9)\nTotal operating income\n$\n756.4 \n11.4%\n$\n704.2 \n10.9%\n$\n52.2 \n50 bps\n(a)\nSee discussion above for additional information related to impairment of assets and restructuring and other charges, net recorded during the fiscal years presented.\nNorth America operating margin\n declined by 10 basis points due to an increase of 240 basis points in SG&A expense as a percentage of net revenues, more than offsetting an increase of 230 basis points in gross margin. The overall decline in operating margin was inclusive of the unfavorable impact of approximately 30 basis points attributable to channel mix. \nEurope operating margin\n improved by 150 basis points due to an increase of 240 basis points in gross margin, more than offsetting an increase of 90 basis points in SG&A expenses as a percentage of net revenues. The overall improvement in operating margin was inclusive of favorable foreign currency effects of 20 basis points and the unfavorable impact of 40 basis points related to channel mix. \nAsia operating margin\n improved by 110 basis points due to decline of 140 basis points in SG&A expenses as a percentage of net revenues, more than offsetting a decline in gross margin of 20 basis points. The overall improvement in operating margin was inclusive of unfavorable foreign currency effects of 20 basis points. \nCorporate expenses\n decreased by $4.5 million to $647.0 million in Fiscal 2024 compared to Fiscal 2023. The decrease in corporate expenses was due to lower non-routine inventory charges recorded during Fiscal 2024 as compared to the prior fiscal year of $19.9 million, lower rent and occupancy expenses of $6.6 million, lower marketing and advertising expenses of $6.4 million, lower depreciation and amortization expenses of $5.6 million, lower consulting fees of $5.1 million, lower selling-related expenses of $4.6 million, and lower other expenses of $6.8 million, partially offset by higher compensation-related expenses of $50.5 million. \nNon-operating Income (Expense), Net.\n    During Fiscal 2024, we reported non-operating income, net, of $21.0 million as compared to non-operating expense, net of $12.3 million during Fiscal 2023. The $33.3 million increase in non-operating income, net was mainly due to a $40.8 million increase in interest income driven by higher interest rates in financial markets and higher average on-hand cash, cash equivalents, and short-term investments balance during Fiscal 2024 compared to the prior fiscal year. The increase in interest income was partially offset by higher interest expense and other expense, net.\n59\nIncome Tax Provision.\n    The income tax provision and effective tax rate in Fiscal 2024 were $131.1 million and 16.9%, respectively, compared to $169.2 million and 24.5%, respectively, in Fiscal 2023. The $38.1 million decrease in our income tax provision was primarily driven by the 760 basis point decline in our effective tax rate, partially offset by an increase in our pretax income. The decline in our effective tax rate was due to a deferred tax benefit recognized as a result of transactions entered into as part of a reorganization of the Company's legal entity structure, the favorable impact of remeasuring net deferred tax assets as a result of changes enacted in tax legislation, and the absence of unfavorable prior year adjustments related to certain deferred tax assets and receivables, partially offset by the unfavorable impact of audit-related reserve adjustments. The decline in our effective tax rate was also due to a one-time tax benefit of $13.1 million recorded during Fiscal 2024 in connection with Swiss tax reform and the European Union's anti-tax avoidance directive, which lowered our effective tax rate by 170 basis points. See Note 10 to the accompanying consolidated financial statements.\nNet Income.\n    Net income increased to $646.3 million in Fiscal 2024, from $522.7 million in Fiscal 2023. The $123.6 million increase in net income was primarily due to an increase in our operating income and non-operating income, net, as well as a decrease in our income tax provision, all as previously discussed. Our operating results during Fiscal 2024 and Fiscal 2023 were negatively impacted by net restructuring-related charges, impairment of assets, and certain other charges (benefits) totaling $69.9 million and $66.0 million, respectively, which had an after-tax effect of reducing net income by $52.6 million and $52.9 million, respectively. Net income during Fiscal 2024 also reflected an income tax benefit of $13.1 million recorded in connection with Swiss tax reform and the European Union's anti-tax avoidance directive, as previously discussed.\nNet Income per Diluted Share.\n    Net income per diluted share increased to $9.71 in Fiscal 2024, from $7.58 in Fiscal 2023. The $2.13 per share increase was primarily driven by the higher level of net income, as previously discussed, and lower weighted-average diluted shares outstanding during Fiscal 2024 driven by our share repurchases during the preceding twelve months. Net income per diluted share for Fiscal 2024 and Fiscal 2023 were also negatively impacted by $0.80 per share and $0.76 per share, respectively, attributable to net restructuring-related charges, impairment of assets, and certain other charges (benefits), as previously discussed. Net income per diluted share during Fiscal 2024 was also favorably impacted by $0.20 due to an income tax benefit recorded in connection with Swiss tax reform and the European Union's anti-tax avoidance directive, as previously discussed.\n60\nFINANCIAL CONDITION AND LIQUIDITY\nFinancial Condition\n \nThe following table presents our financial condition as of March 29, 2025 and March 30, 2024.\nMarch 29,\n2025\nMarch 30,\n2024\n$\nChange\n \n(millions)\nCash and cash equivalents\n$\n1,922.5 \n$\n1,662.2 \n$\n260.3 \nShort-term investments\n160.5 \n121.0 \n39.5 \nCurrent portion of long-term debt\n(a)\n \n(399.7)\n— \n(399.7)\nLong-term debt\n(a)\n \n(742.9)\n(1,140.5)\n397.6 \nNet cash and short-term investments\n$\n940.4 \n$\n642.7 \n$\n297.7 \nEquity\n$\n2,588.5 \n$\n2,450.3 \n$\n138.2 \n(a)\nSee Note 11 to the accompanying consolidated financial statements for discussion of the carrying values of our debt.\nThe increase in our net cash and short-term investments position at March 29, 2025 as compared to March 30, 2024 was primarily due to our operating cash flows of $1.235 billion, partially offset by our use of cash to support Class A common stock repurchases of $480.9 million, including withholdings in satisfaction of tax obligations for stock-based compensation awards, to invest in our business through $216.2 million in capital expenditures, and to make dividend payments of $201.1 million.\nThe increase in our equity was attributable to our comprehensive income and the net impact of stock-based compensation arrangements, partially offset by our share repurchase activity and dividends declared during Fiscal 2025.\nCash Flows\nFiscal 2025 Compared to Fiscal 2024\n \nFiscal Years Ended\n \n \nMarch 29,\n2025\nMarch 30,\n2024\n$\nChange\n \n(millions)\nNet cash provided by operating activities\n$\n1,235.1 \n$\n1,069.7 \n$\n165.4 \nNet cash used in investing activities\n(264.1)\n(256.8)\n(7.3)\nNet cash used in financing activities\n(704.0)\n(665.6)\n(38.4)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n(8.2)\n(13.6)\n5.4 \nNet increase in cash, cash equivalents, and restricted cash\n$\n258.8 \n$\n133.7 \n$\n125.1 \nNet Cash Provided by Operating Activities.\n    Net cash provided by operating activities was $1.235 billion during Fiscal 2025, as compared to $1.070 billion during Fiscal 2024. The $165.4 million net increase in cash provided by operating activities was due to an increase in net income before non-cash charges, as well as a net favorable change related to our operating assets and liabilities, including our working capital, as compared to the prior fiscal year.\nThe net favorable change related to our operating assets and liabilities, including our working capital, was primarily driven by:\n•\na favorable change in our accounts payable driven by the timing of cash payments, as well as a net favorable change in accrued liabilities largely driven by accrued payroll and benefits resulting from anticipated higher bonus achievement levels, partially offset by our restructuring reserve due to a decrease in restructuring charges recorded during the current fiscal year period as compared to the prior fiscal year period.\n61\nThis increase related to our operating assets and liabilities was partially offset by:\n•\nan unfavorable change in inventory driven by higher in-transit inventory, as well as higher product and freight costs.\nNet Cash Used in Investing Activities.    \nNet cash used in investing activities was $264.1 million during Fiscal 2025, as compared to $256.8 million during Fiscal 2024. The $7.3 million net increase in cash used in investing activities was primarily driven by:\n•\na $51.4 million increase in capital expenditures. During Fiscal 2025, we spent $216.2 million on capital expenditures, as compared to $164.8 million during Fiscal 2024. Our capital expenditures during Fiscal 2025 primarily related to store openings and renovations, enhancements to our information technology systems, and corporate office renovations.\nThis increase in cash used in investing activities was partially offset by:\n•\na $41.0 million decrease in purchases of investments, less proceeds from sales and maturities of investments. During Fiscal 2025, we made net investment purchases of $47.5 million, as compared to $88.5 million during Fiscal 2024.\nIn Fiscal 2026, we expect to spend approximately 4% to 5% of net revenues on capital expenditures, primarily related to the purchase of real estate, store openings and renovations, enhancements to our information technology systems (including those related to our Next Generation Transformation project), and a continuation of our corporate office renovations.\nNet Cash Used in Financing Activities.\n    Net cash used in financing activities was $704.0 million during Fiscal 2025, as compared to $665.6 million during Fiscal 2024. The $38.4 million net increase in cash used in financing activities was primarily driven by:\n•\na $31.2 million increase in cash used to repurchase shares of our Class A common stock. During Fiscal 2025, we used $424.5 million to repurchase shares of our Class A common stock pursuant to our common stock repurchase program, and an additional $56.4 million in shares of our Class A common stock were surrendered or withheld in satisfaction of withholding taxes in connection with the vesting of awards under our long-term stock incentive plans. On a comparative basis, during Fiscal 2024, we used $398.2 million to repurchase shares of our Class A common stock pursuant to our common stock repurchase program, and an additional $51.5 million in shares of our Class A common stock were surrendered or withheld for taxes.\nFiscal 2024 Compared to Fiscal 2023\n \nFiscal Years Ended\n \n \nMarch 30,\n2024\nApril 1,\n2023\n$\nChange\n \n(millions)\nNet cash provided by operating activities\n$\n1,069.7 \n$\n411.0 \n$\n658.7 \nNet cash provided by (used in) investing activities\n(256.8)\n471.5 \n(728.3)\nNet cash used in financing activities\n(665.6)\n(1,208.8)\n543.2 \nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n(13.6)\n(8.8)\n(4.8)\nNet increase (decrease) in cash, cash equivalents, and restricted cash\n$\n133.7 \n$\n(335.1)\n$\n468.8 \nNet Cash Provided by Operating Activities.\n    Net cash provided by operating activities was $1.070 billion during Fiscal 2024, as compared to $411.0 million during Fiscal 2023. The $658.7 million net increase in cash provided by operating activities was due to a net favorable change related to our operating assets and liabilities, including our working capital, as compared to the prior fiscal year, as well as an increase in net income before non-cash charges.\n62\nThe net favorable change related to our operating assets and liabilities, including our working capital, was primarily driven by:\n•\na favorable change related to our inventories, largely driven by a more normalized receipt cadence;\n•\na net favorable change in our accrued liabilities largely driven by the impact of a lower bonus achievement level realized during Fiscal 2023 as compared to the prior fiscal year and a favorable change in our restructuring reserve due to an increase in restructuring charges recorded during Fiscal 2024 as compared to the prior fiscal year, as well as a favorable change in accounts payable driven by the timing of cash payments; and\n•\na favorable change related to our accounts receivable, largely driven by a decline in wholesale net revenues and timing of cash receipts.\nNet Cash Provided by (Used in) Investing Activities.    \nNet cash used in investing activities was $256.8 million during Fiscal 2024, as compared to net cash provided by investing activities of $471.5 million during Fiscal 2023. The $728.3 million net increase in cash used in investing activities was primarily driven by:\n•\na $783.3 million decrease in proceeds from sales and maturities of investments, less purchases of investments. During Fiscal 2024, we made net investment purchases of $88.5 million, as compared to receiving net proceeds from sales and maturities of investments of $694.8 million during Fiscal 2023.\nThis increase in cash used in investing activities was partially offset by:\n•\na $52.7 million decrease in capital expenditures. During Fiscal 2024, we spent $164.8 million on capital expenditures, as compared to $217.5 million during Fiscal 2023. Our capital expenditures during Fiscal 2024 primarily related to store openings and renovations, as well as enhancements to our information technology systems.\nNet Cash Used in Financing Activities.\n    Net cash used in financing activities was $665.6 million during Fiscal 2024, as compared to $1.209 billion during Fiscal 2023. The $543.2 million net decrease in cash used in financing activities was primarily driven by:\n•\na $500.0 million decrease in cash used to repay debt. During Fiscal 2024, we did not issue or repay any debt. On a comparative basis, during Fiscal 2023, we repaid our previously outstanding $500.0 million principal amount of unsecured 1.700% senior notes that matured on June 15, 2022; and\n•\na $38.9 million decrease in cash used to repurchase shares of our Class A common stock. During Fiscal 2024, we used $398.2 million to repurchase shares of our Class A common stock pursuant to our common stock repurchase program, and an additional $51.5 million in shares of our Class A common stock were surrendered or withheld in satisfaction of withholding taxes in connection with the vesting of awards under our long-term stock incentive plans. On a comparative basis, during Fiscal 2023, we used $454.3 million to repurchase shares of our Class A common stock pursuant to our common stock repurchase program, and an additional $34.3 million in shares of our Class A common stock were surrendered or withheld for taxes.\nSources of Liquidity\nOur primary sources of liquidity are the cash flows generated from our operations, our available cash and cash equivalents and short-term investments, availability under our credit and overdraft facilities and commercial paper program, and other available financing options. We also maintain access to the capital markets and may issue debt securities from time to time, which may provide an additional source of liquidity and/or funds to refinance existing debt.\nDuring Fiscal 2025, we generated $1.235 billion of net cash flows from our operations. As of March 29, 2025, we had $2.083 billion in cash, cash equivalents, and short-term investments, of which $1.398 billion were held by our subsidiaries domiciled outside the U.S. We are not dependent on foreign cash to fund our domestic operations. Undistributed foreign earnings generated on or before December 31, 2017 that were subject to the one-time mandatory transition tax in connection with U.S. tax legislation commonly referred to as the Tax Cuts and Jobs Act (the \"TCJA\") are not considered to be permanently reinvested and may be repatriated to the U.S. in the future with minimal or no additional U.S. taxation. We intend to permanently reinvest undistributed foreign earnings generated after December 31, 2017 that were not subject to the one-time \n63\nmandatory transition tax. However, if our plans change and we choose to repatriate post-2017 earnings to the U.S. in the future, we would be subject to applicable U.S. and foreign taxes.\nThe following table presents the total availability, borrowings outstanding, and remaining availability under our credit and overdraft facilities and Commercial Paper Program as of March 29, 2025:\n \nMarch 29, 2025\nDescription\n(a)\nTotal\nAvailability\nBorrowings\nOutstanding\nRemaining\nAvailability\n \n(millions)\nGlobal Credit Facility and Commercial Paper Program\n(b)\n \n$\n750 \n$\n11 \n(c)\n$\n739 \nPan-Asia Credit Facilities\n33 \n— \n33 \nJapan Overdraft Facility\n33 \n— \n33 \n(a)\nAs defined in Note 11 to the accompanying consolidated financial statements.\n(b)\nBorrowings under the Commercial Paper Program are supported by the Global Credit Facility. Accordingly, we do not expect combined borrowings outstanding under the Commercial Paper Program and the Global Credit Facility to exceed $750 million.\n(c)\nRepresents outstanding letters of credit for which we were contingently liable under the Global Credit Facility as of March 29, 2025.\nWe believe that the Global Credit Facility is adequately diversified with no undue concentration in any one financial institution. In particular, as of March 29, 2025, there were seven financial institutions participating in the Global Credit Facility, with no one participant maintaining a maximum commitment percentage in excess of 20%. In accordance with the terms of the agreement, we have the ability to expand our borrowing availability under the Global Credit Facility to $1.500 billion through the full term of the facility, subject to the agreement of one or more new or existing lenders under the facility to increase their commitments.\nBorrowings under the Pan-Asia Credit Facilities and Japan Overdraft Facility (collectively, the \"Pan-Asia Borrowing Facilities\") are guaranteed by the parent company and are granted at the sole discretion of the participating banks (as described within Note 11 to the accompanying consolidated financial statements), subject to availability of the respective banks' funds and satisfaction of certain regulatory requirements. We have no reason to believe that the participating institutions will be unable to fulfill their obligations to provide financing in accordance with the terms of the Global Credit Facility and the Pan-Asia Borrowing Facilities in the event of our election to draw additional funds in the foreseeable future.\nOur sources of liquidity are used to fund our ongoing cash requirements, including working capital requirements, global retail store and digital commerce expansion, construction and renovation of shop-within-shops, investment in infrastructure, including technology, payment of dividends, debt repayments, Class A common stock repurchases, settlement of contingent liabilities (including uncertain tax positions), and other corporate activities, including our restructuring actions. We believe that our existing sources of cash, the availability under our credit facilities, and our ability to access capital markets will be sufficient to support our operating, capital, and debt service requirements for the foreseeable future, the ongoing development of our businesses, and our plans for further business expansion. However, prolonged periods of adverse economic conditions or business disruptions in any of our key regions, or a combination thereof, such as those resulting from pandemic diseases and other catastrophic events, could impede our ability to pay our obligations as they become due or return value to our shareholders, as well as delay previously planned expenditures related to our operations.\nSee Note 11 to the accompanying consolidated financial statements for additional information relating to our credit facilities.\nSupplier Finance Program\nWe support a voluntary supplier finance program which provides certain of our inventory suppliers the opportunity, at their sole discretion, to sell their receivables due from us (which are generally due within 90 days) to a participating financial institution in exchange for receipt of a discounted payment amount made earlier than the payment term stipulated between us and the supplier. Our vendor payment terms and amounts due are not impacted by a supplier's decision to participate in the program. We have not pledged any assets and do not provide guarantees under the supplier finance program. Our payment \n64\nobligations outstanding under our supplier finance program were $181.0 million and $129.2 million as of March 29, 2025 and March 30, 2024, respectively, and were recorded within accounts payable in the consolidated balance sheets. See Note 3 to the accompanying consolidated financial statements for additional information relating to our supplier finance program. \nDebt and Covenant Compliance\nIn August 2018, we completed a registered public debt offering and issued $400 million aggregate principal amount of unsecured senior notes due September 15, 2025, which bear interest at a fixed rate of 3.750%, payable semi-annually (the \"3.750% Senior Notes\"). In June 2020, we completed another registered public debt offering and issued an additional $500 million aggregate principal amount of unsecured senior notes that were due and repaid on June 15, 2022 with cash on hand, which bore interest at a fixed rate of 1.700%, payable semi-annually (the \"1.700% Senior Notes\"), and $750 million aggregate principal amount of unsecured senior notes due June 15, 2030, which bear interest at a fixed rate of 2.950%, payable semi-annually (the \"2.950% Senior Notes\").\nThe indenture and supplemental indentures governing the 3.750% Senior Notes and 2.950% Senior Notes (as supplemented, the \"Indenture\") contain certain covenants that restrict our ability, subject to specified exceptions, to incur certain liens; enter into sale and leaseback transactions; consolidate or merge with another party; or sell, lease, or convey all or substantially all of our property or assets to another party. However, the Indenture does not contain any financial covenants.\nWe have a credit facility that provides for a $750 million senior unsecured revolving line of credit through June 30, 2028, which may be used for working capital needs, capital expenditures, certain investments, general corporate purposes, and for funding of acquisitions, as well as used to support the issuance of letters of credit and the maintenance of the Commercial Paper Program (the \"Global Credit Facility\"). Borrowings under the Global Credit Facility may be denominated in U.S. Dollars and certain other currencies, including Euros, Hong Kong Dollars, and Japanese Yen. We have the ability to expand the borrowing availability under the Global Credit Facility to $1.500 billion, subject to the agreement of one or more new or existing lenders under the facility to increase their commitments. There are no mandatory reductions in borrowing ability throughout the term of the Global Credit Facility.\nThe Global Credit Facility contains a number of covenants, as described in Note 11 to the accompanying consolidated financial statements. As of March 29, 2025, no Event of Default (as such term is defined pursuant to the Global Credit Facility) has occurred under our Global Credit Facility. The Pan-Asia Borrowing Facilities do not contain any financial covenants.\nSee Note 11 to the accompanying consolidated financial statements for additional information relating to our debt and covenant compliance.\nCommon Stock Repurchase Program\nAs of March 29, 2025, the remaining availability under our Class A common stock repurchase program was approximately $352 million. On May 15, 2025, our Board of Directors approved an expansion of our existing common stock repurchase program that allows us to repurchase up to an additional $1.500 billion of our Class A common stock, excluding related excise taxes. Repurchases of shares of our Class A common stock are subject to overall business and market conditions.\nSee Note 16 to the accompanying consolidated financial statements for additional information relating to our Class A common stock repurchase program.\nDividends\nWe have generally maintained a regular quarterly cash dividend program on our common stock since 2003. \nOn May 16, 2024, our Board of Directors approved an increase to our quarterly cash dividend on our common stock from $0.75 to $0.825 per share. On May 15, 2025, our Board of Directors approved an additional increase to the quarterly cash dividend on our common stock from $0.825 to $0.9125 per share. The first quarterly dividend to reflect this increase is expected to be payable to shareholders of record at close of business on June 27, 2025 and paid on July 11, 2025.\nWe intend to continue to pay regular dividends on outstanding shares of our common stock. However, any decision to declare and pay dividends in the future will ultimately be made at the discretion of our Board of Directors and will depend on our results of operations, cash requirements, financial condition, and other factors that the Board of Directors may deem relevant, including economic and market conditions.\n65\nSee Note 16 to the accompanying consolidated financial statements for additional information relating to our quarterly cash dividend program.\nMaterial Cash Requirements\nFirm Commitments\nThe following table summarizes certain of our aggregate material cash requirements as of March 29, 2025, and the estimated timing and effect that such obligations are expected to have on our liquidity and cash flows in future periods. We expect to fund these firm commitments with operating cash flows generated in the normal course of business and, if necessary, through availability under our credit facilities or other accessible sources of financing.\nFiscal\n2026\nFiscal\n2027-2028\nFiscal\n2029-2030\nFiscal\n2031 and\nThereafter\nTotal\n \n(millions)\nSenior Notes\n$\n400.0 \n$\n— \n$\n— \n$\n750.0 \n$\n1,150.0 \nInterest payments on debt\n29.6 \n44.3 \n44.3 \n11.1 \n129.3 \nOperating leases\n265.4 \n429.7 \n280.6 \n517.4 \n1,493.1 \nFinance leases\n28.2 \n58.8 \n44.4 \n166.8 \n298.2 \nOther lease commitments\n6.3 \n26.4 \n26.3 \n31.0 \n90.0 \nInventory purchase commitments\n937.8 \n— \n— \n— \n937.8 \nMandatory transition tax payments\n42.2 \n— \n— \n— \n42.2 \nReal estate purchase commitment\n116.9 \n— \n— \n— \n116.9 \nOther commitments\n110.9 \n122.1 \n71.8 \n— \n304.8 \nTotal\n$\n1,937.3 \n$\n681.3 \n$\n467.4 \n$\n1,476.3 \n$\n4,562.3 \nThe following is a description of our material, firmly committed obligations as of March 29, 2025:\n•\nSenior Notes\n represent the principal amount of our outstanding 3.750% Senior Notes and 2.950% Senior Notes. Amounts do not include any call premiums, unamortized debt issuance costs, or interest payments (see below);\n•\nInterest payments on debt\n represent the semi-annual contractual interest payments due on our 3.750% Senior Notes and 2.950% Senior Notes. Amounts do not include the impact of potential cash flows underlying our related swap contracts (see Note 13 to the accompanying consolidated financial statements for discussion of our swap contracts);\n•\nLease obligations\n represent fixed payments due over the lease term of our noncancelable leases of real estate and operating equipment, including rent, real estate taxes, insurance, common area maintenance fees, and/or certain other costs. For lease terms that have commenced, information has been presented separately for operating and finance leases. Other lease commitments relate to executed lease agreements for which the related lease terms have not yet commenced as of March 29, 2025;\n•\nInventory purchase commitments\n represent our legally-binding agreements to purchase fixed or minimum quantities of goods at determinable prices;\n•\nMandatory transition tax payments\n represent our remaining tax obligation incurred in connection with the deemed repatriation of previously deferred foreign earnings pursuant to the TCJA (see Note 10 to the accompanying consolidated financial statements for discussion of the TCJA);\n•\nReal estate purchase commitment \nrelates to our legally-binding agreement to purchase real estate located in New York City; and\n•\nOther commitments\n primarily represent our legally-binding obligations related to sponsorship, licensing, and other marketing and advertising agreements; information technology-related service agreements; and pension-related obligations.\n66\nExcluded from the above contractual obligations table is the non-current liability for unrecognized tax benefits of $193.3 million as of March 29, 2025, as we cannot make a reliable estimate of the period in which the liability will be settled, if ever. The above table also excludes the following: (i) amounts recorded in current liabilities in our consolidated balance sheet as of March 29, 2025, which will be paid within one year, other than lease obligations, mandatory transition tax payments, and accrued interest payments on debt; and (ii) non-current liabilities that have no cash outflows associated with them (e.g., deferred income), or the cash outflows associated with them are uncertain or do not represent a \"purchase obligation\" as such term is used herein (e.g., deferred taxes, derivative financial instruments, asset retirement obligations, and other miscellaneous items).\nWe also have certain contractual arrangements that would require us to make payments if certain events or circumstances occur. See Note 15 to the accompanying consolidated financial statements for a description of our contingent commitments not included in the above table.\nOff-Balance Sheet Arrangements\nIn addition to the commitments included in the above table, our other off-balance sheet firm commitments relating to our outstanding letters of credit amounted to $10.6 million as of March 29, 2025. We do not maintain any other off-balance sheet arrangements, transactions, obligations, or other relationships with unconsolidated entities that would be expected to have a material current or future effect on our consolidated financial statements.\nMARKET RISK MANAGEMENT\nAs discussed in Note 13 to the accompanying consolidated financial statements, we are exposed to a variety of levels and types of risks, including the impact of changes in currency exchange rates on foreign currency-denominated balances, certain anticipated cash flows of our international operations, and the value of reported net assets of our foreign operations, as well as changes in the fair value of our fixed-rate debt obligations relating to fluctuations in benchmark interest rates. Accordingly, in the normal course of business we assess such risks and, in accordance with our established policies and procedures, may use derivative financial instruments to manage and mitigate them. We do not use derivatives for speculative or trading purposes.\nGiven our use of derivative instruments, we are exposed to the risk that the counterparties to such contracts will fail to meet their contractual obligations. To mitigate such counterparty credit risk, it is our policy to only enter into contracts with carefully selected financial institutions based upon an evaluation of their credit ratings and certain other factors, adhering to established limits for credit exposure. Our established policies and procedures for mitigating credit risk include ongoing review and assessment of the creditworthiness of our counterparties. We also enter into master netting arrangements with counterparties, when possible, to further mitigate credit risk. As a result of the above considerations, we do not believe that we are exposed to undue concentration of counterparty risk with respect to our derivative contracts as of March 29, 2025. However, we do have in aggregate $25.9 million of derivative instruments in net asset positions held across three creditworthy financial institutions.\nForeign Currency Risk Management\nWe manage our exposure to changes in foreign currency exchange rates using forward foreign currency exchange and cross-currency swap contracts. Refer to Note 13 to the accompanying consolidated financial statements for a summary of the notional amounts and fair values of our outstanding forward foreign currency exchange and cross-currency swap contracts, as well as the impact on earnings and other comprehensive income of such instruments for the fiscal years presented.\nForward Foreign Currency Exchange Contracts\nWe use forward foreign currency exchange contracts to mitigate risk related to exchange rate fluctuations on inventory transactions made in an entity's non-functional currency, the settlement of foreign currency-denominated balances, and the translation of certain foreign operations' net assets into U.S. Dollars. As part of our overall strategy for managing the level of exposure to such exchange rate risk, relating primarily to the Euro, the Japanese Yen, the South Korean Won, the Australian Dollar, the Canadian Dollar, the British Pound Sterling, the Swiss Franc, and the Chinese Renminbi, we generally hedge a portion of our related exposures anticipated over the next twelve months using forward foreign currency exchange contracts with maturities of two months to one year to provide continuing coverage over the period of the respective exposure.\nOur foreign exchange risk management activities are governed by established policies and procedures. These policies and procedures provide a framework that allows for the management of currency exposures while ensuring the activities are conducted within our established guidelines. Our policies include guidelines for the organizational structure of our risk management function and for internal controls over foreign exchange risk management activities, including, but not limited to, \n67\nauthorization levels, transaction limits, and credit quality controls, as well as various measurements for monitoring compliance. We monitor foreign exchange risk using different techniques, including periodic review of market values and performance of sensitivity analyses.\nCross-Currency Swap Contracts\nWe periodically designate pay-fixed rate, receive-fixed rate cross-currency swap contracts as hedges of our net investment in certain European subsidiaries. These contracts swap U.S. Dollar-denominated fixed interest rate payments based on the contract's notional amount and the fixed rate of interest payable on certain of our senior notes for Euro-denominated fixed interest rate payments, thereby economically converting a portion of our fixed-rate U.S. Dollar-denominated senior note obligations to fixed rate Euro-denominated obligations.\nSee Note 3 to the accompanying consolidated financial statements for further discussion of our foreign currency exposures and the types of derivative instruments used to hedge those exposures.\nSensitivity\nWe perform a sensitivity analysis to determine the effects that market risk exposures may have on the fair values of our forward foreign currency exchange and cross-currency swap contracts. In doing so, we assess the risk of loss in the fair values of these contracts that would result from hypothetical changes in foreign currency exchange rates. This analysis assumes a like movement by the foreign currencies in our hedge portfolio against the U.S. Dollar. As of March 29, 2025, a 10% appreciation or depreciation of the U.S. Dollar against the foreign currencies under contract would result in a net increase or decrease, respectively, in the fair value of our derivative portfolio of approximately $121 million. This hypothetical net change in fair value should ultimately be largely offset by the net change in the related underlying hedged items.\nInterest Rate Risk Management\nSensitivity\nAs of March 29, 2025, we had no variable-rate debt outstanding. As such, our exposure to changes in interest rates primarily relates to changes in the fair values of our fixed-rate Senior Notes. As of March 29, 2025, the aggregate fair values of our Senior Notes were $1.089 billion. A 25-basis point increase or decrease in interest rates would decrease or increase, respectively, the aggregate fair values of our Senior Notes by approximately $9 million based on certain simplifying assumptions, including an immediate across-the-board increase or decrease in the level of interest rates with no other subsequent changes for the remainder of the period. Such potential increases or decreases in the fair value of our debt would only be realized if we were to retire all or a portion of the debt prior to its maturity.\nInvestment Risk Management\nAs of March 29, 2025, we had cash and cash equivalents on-hand of $1.922 billion, consisting of deposits in interest bearing accounts, investments in money market deposit accounts, and investments in time deposits with original maturities of 90 days or less. Our other significant investments included $160.5 million of short-term investments, consisting of time deposits with original maturities greater than 90 days.\nWe actively monitor our exposure to changes in the fair value of our global investment portfolio in accordance with our established policies and procedures, which include monitoring both general and issuer-specific economic conditions, as discussed in Note 3 to the accompanying consolidated financial statements. Our investment objectives include capital preservation, maintaining adequate liquidity, diversification to minimize liquidity and credit risk, and achievement of maximum returns within the guidelines set forth in our investment policy. See Note 13 to the accompanying consolidated financial statements for further detail of the composition of our investment portfolio as of March 29, 2025.\nCRITICAL ACCOUNTING POLICIES \nAn accounting policy is considered to be critical if it is important to our results of operations, financial condition, and cash flows, and requires significant judgment and estimates on the part of management in its application. Our estimates are often based on complex judgments, assessments of probability, and assumptions that management believes to be reasonable, but that are inherently uncertain and unpredictable. It is also possible that other professionals, applying reasonable judgment to the same set of facts and circumstances, could develop and support a range of alternative estimated amounts. We believe that the \n68\nfollowing list represents our critical accounting policies. For a discussion of all of our significant accounting policies, including our critical accounting policies, see Note 3 to the accompanying consolidated financial statements.\nSales Reserves and Uncollectible Accounts\nA significant area of judgment affecting reported revenue involves estimating sales reserves, which represent the portion of gross revenues not expected to be realized. In particular, gross revenue related to our wholesale business is reduced by estimates of returns, discounts, end-of-season markdowns, operational chargebacks, and certain cooperative advertising allowances. Gross revenue related to our retail business, including digital commerce sales, is also reduced by an estimate of returns.\nIn developing estimates of returns, discounts, end-of-season markdowns, operational chargebacks, and cooperative advertising allowances, we analyze historical trends, actual and forecasted seasonal results, current economic and market conditions, retailer performance, and, in certain cases, contractual terms. Estimates for operational chargebacks are based on actual customer notifications of order fulfillment discrepancies and historical trends. We review and refine these estimates on a quarterly basis. Our historical estimates of these amounts have not differed materially from actual results. However, unforeseen adverse future economic and market conditions, such as those resulting from widespread pandemic diseases and/or other catastrophic events, could result in our actual results differing materially from our estimates. A hypothetical 1% increase in our reserves for returns, discounts, end-of-season markdowns, operational chargebacks, and certain cooperative advertising allowances as of March 29, 2025 would have reduced our Fiscal 2025 net revenues by approximately $1 million.\nSimilarly, we evaluate our accounts receivable balances to develop expectations regarding the extent to which they will ultimately be collected. Significant judgment and estimation are involved in this evaluation, including a receivables aging analysis which shows, by aged category, the percentage of receivables that has historically gone uncollected, an analysis of specific risks on a customer-by-customer basis for larger accounts (including consideration of their financial condition and ability to withstand potential prolonged periods of adverse economic conditions), and an evaluation of current and forecasted economic and market conditions over the respective asset's contractual life. Based on this information, we record an allowance for estimated amounts that we ultimately expect not to collect due to credit. Although we believe that we have adequately provided for these risks as part of our allowance for doubtful accounts, a severe and prolonged adverse impact on our major customers' business and operations beyond those forecasted could have a corresponding material adverse effect on our net revenues, cash flows, and/or financial condition. A hypothetical 1% increase in the level of our allowance for doubtful accounts as of March 29, 2025 would have increased our Fiscal 2025 SG&A expenses by less than $1 million.\nSee \"Accounts Receivable\" in Note 3 to the accompanying consolidated financial statements for an analysis of the activity in our sales reserves and allowance for doubtful accounts for each of the three fiscal years presented.\nInventories\nWe hold retail inventory that is sold in our own stores and digital commerce sites directly to consumers. We also hold inventory that is sold through wholesale distribution channels to major department stores and specialty retail stores. Substantially all of our inventories are comprised of finished goods, which are stated at the lower of cost or estimated realizable value, with cost determined on a weighted-average cost basis.\nThe estimated net realizable value of inventory is determined based on an analysis of historical sales trends of our individual product lines, the impact of market trends and economic conditions (including those resulting from pandemic diseases and other catastrophic events), and a forecast of future demand, giving consideration to the value of current orders in-house for future sales of inventory, as well as plans to sell inventory through our outlet stores, among other liquidation channels. Actual results may differ from estimates due to the quantity, quality, and mix of products in inventory, consumer and retailer preferences, and economic and market conditions. Reserves for inventory shrinkage, representing the risk of physical loss of inventory, are estimated based on historical experience and are adjusted based upon physical inventory counts. Our historical estimates of these costs and the related provisions have not differed materially from actual results. However, unforeseen adverse future economic and market conditions could result in our actual results differing materially from our estimates. \nA hypothetical 1% increase in the level of our inventory reserves as of March 29, 2025 would have decreased our Fiscal 2025 gross profit by approximately $3 million.\n69\nImpairment of Goodwill and Other Intangible Assets\nGoodwill and certain other intangible assets deemed to have indefinite useful lives are not amortized. Rather, goodwill and indefinite-lived intangible assets are assessed for impairment at least annually. Finite-lived intangible assets are amortized over their respective estimated useful lives and, along with other long-lived assets, are evaluated for impairment periodically whenever events or changes in circumstances indicate that their carrying values may not be fully recoverable.\nWe generally perform our annual goodwill impairment assessment using a qualitative approach to determine whether it is more likely than not that the fair value of a reporting unit is less than its respective carrying value. However, in order to reassess the fair values of our reporting units, we periodically perform a quantitative impairment analysis in lieu of using the qualitative approach.\nPerformance of the qualitative goodwill impairment assessment requires judgment in identifying and considering the significance of relevant key factors, events, and circumstances that affect the fair values of our reporting units. This requires consideration and assessment of external factors such as macroeconomic, industry, and market conditions, as well as entity-specific factors, such as our actual and planned financial performance. We also give consideration to the difference between each reporting unit's fair value and carrying value as of the most recent date that a fair value measurement was performed. If the results of the qualitative assessment conclude that it is not more likely than not that the fair value of a reporting unit exceeds its carrying value, additional quantitative impairment testing is performed.\nThe quantitative goodwill impairment test involves comparing the fair value of a reporting unit with its carrying value, including goodwill. If the fair value of a reporting unit exceeds its carrying value, the reporting unit's goodwill is considered not to be impaired. However, if the carrying value of a reporting unit exceeds its fair value, an impairment loss is recorded in an amount equal to that excess. Any impairment charge recognized is limited to the amount of the respective reporting unit's allocated goodwill.\nDetermining the fair value of a reporting unit under the quantitative goodwill impairment test requires judgment and often involves the use of significant estimates and assumptions, including an assessment of external factors such as macroeconomic, industry, and market conditions, as well as entity-specific factors, such as actual and planned financial performance. Similarly, estimates and assumptions are used when determining the fair values of other indefinite-lived intangible assets. These estimates and assumptions could have a significant impact on whether or not an impairment charge is recognized and the magnitude of any such charge. To assist management in the process of determining any potential goodwill impairment, we may review and consider appraisals from accredited independent valuation firms. Estimates of fair value are primarily determined using discounted cash flows, market comparisons, and recent transactions. These approaches involve significant estimates and assumptions, including projected future cash flows (including timing), discount rates reflecting the risks inherent in those future cash flows, perpetual growth rates, and selection of appropriate market comparable metrics and transactions.\nWe performed our annual goodwill impairment assessment as of the beginning of the second quarter of Fiscal 2025 using the qualitative approach discussed above. In performing the assessment, we considered the results of our most recent quantitative goodwill impairment test, which was performed as of the beginning of the second quarter of Fiscal 2024, the results of which indicated that the fair values of our reporting units significantly exceeded their respective carrying values. Based on the results of the qualitative impairment assessment, we concluded that it is not more likely than not that the fair values of our reporting units are less than their respective carrying values and there were no reporting units at risk of impairment. No goodwill impairment charges were recorded during any of the fiscal years presented. See Note 12 to the accompanying consolidated financial statements for further discussion.\nIn evaluating finite-lived intangible assets for recoverability, we use our best estimate of future cash flows expected to result from the use of the asset and its eventual disposition where probable. If such estimated future undiscounted net cash flows attributable to the asset are less than its carrying value, an impairment loss is recognized to the extent that such asset's carrying value exceeds its fair value, as estimated considering external market participant assumptions.\nIt is possible that our conclusions regarding impairment or recoverability of goodwill or other intangible assets could change in future periods if, for example, (i) our businesses do not perform as projected, (ii) overall economic conditions in future years vary from current assumptions, (iii) business conditions or strategies change from our current assumptions, or (iv) the identification of our reporting units change, among other factors. Such changes could result in a future impairment charge of goodwill or other intangible assets, which could have a material adverse effect on our consolidated financial position or results of operations.\n70\nImpairment of Other Long-Lived Assets\nProperty and equipment and lease-related right-of-use (\"ROU\") assets, along with other long-lived assets, are evaluated for impairment periodically whenever events or changes in circumstances indicate that their related carrying values may not be fully recoverable. In evaluating long-lived assets for recoverability, we use our best estimate of future cash flows expected to result from the use of the asset (including any potential sublease income for lease-related ROU assets) and its eventual disposition, where applicable. If such estimated future undiscounted net cash flows attributable to the asset are less than its carrying value, an impairment loss is recognized to the extent that such asset's carrying value exceeds its fair value, as estimated considering external market participant assumptions and discounted cash flows, including those based on estimated market rents for lease-related ROU assets. Assets to be disposed of and for which there is a committed plan of disposal (commonly referred to as assets held-for-sale) are reported at the lower of carrying value or fair value, less costs to sell.\nIn determining future cash flows, we take various factors into account, including changes in merchandising strategy, the emphasis on retail store cost controls, the effects of macroeconomic trends such as consumer spending, and the impacts of more experienced retail store managers and increased local advertising. Since the determination of future cash flows is an estimate of future performance, future impairments may arise in the event that future cash flows do not meet expectations. For example, unforeseen adverse future economic and market conditions could negatively impact consumer behavior, spending levels, and/or shopping preferences and result in actual results differing from our estimates. Additionally, we may review and consider appraisals from accredited independent valuation firms to determine the fair value of long-lived assets, where applicable.\nDuring Fiscal 2025 and Fiscal 2023, we recorded impairment charges of $0.8 million and $9.7 million, respectively, to write-down the carrying values of certain long-lived assets based upon their assumed fair values. No impairment charges were recorded during Fiscal 2024. See Note 8 to the accompanying consolidated financial statements for further discussion.\nIncome Taxes\nIn determining our income tax provision for financial reporting purposes, we establish a reserve for uncertain tax positions. If we believe that a tax position is more likely than not of being sustained upon audit, based solely on the technical merits of the position, we recognize the tax benefit. We measure the tax benefit by determining the largest amount that is greater than 50% likely of being realized upon settlement, presuming that the tax position is examined by the appropriate taxing authority that has full knowledge of all relevant information. These assessments can be complex and require significant judgment, and we often obtain assistance from external advisors. To the extent that our estimates change or the final tax outcome of these matters is different from the amounts recorded, such differences will impact the income tax provision in the period in which such determinations are made. If the initial assessment of a position fails to result in the recognition of a tax benefit, we will recognize the tax benefit if (i) there are changes in tax law or analogous case law that sufficiently raise the likelihood of prevailing on the technical merits of the position to more likely than not; (ii) the statute of limitations expires; or (iii) there is a completion of an audit resulting in a settlement of that tax year with the appropriate agency.\nDeferred income taxes reflect the tax effect of certain net operating losses, capital losses, general business credit carryforwards, and the net tax effects of temporary differences between the carrying amount of assets and liabilities for financial statement and income tax purposes, as determined under enacted tax laws and rates. Valuation allowances are established when management determines that it is more likely than not that some portion or all of a deferred tax asset will not be realized. Tax valuation allowances are analyzed periodically by assessing the adequacy of future expected taxable income, which typically involves the use of significant estimates. Such allowances are adjusted as events occur, or circumstances change, that warrant adjustments to those balances.\nSee Note 10 to the accompanying consolidated financial statements for further discussion of income taxes.\nContingencies\nWe are periodically exposed to various contingencies in the ordinary course of conducting our business, including potential losses relating to certain litigation, alleged information system security breaches, contractual disputes, employee relation matters, various tax or other governmental audits, and trademark and intellectual property matters and disputes. We record a liability for such contingencies to the extent that we conclude that it is probable that a loss has been incurred and the amount of such loss is reasonably estimable. In addition, if it is considered reasonably possible that an unfavorable settlement of a contingency could exceed any established liability, we disclose the estimated impact on our liquidity, financial condition, and results of operations, if practicable. Management considers many factors in making these assessments. As the ultimate resolution of contingencies is inherently unpredictable, these assessments can involve a series of complex judgments about future events including, but not limited to, court rulings, negotiations between affected parties, and governmental actions. As a \n71\nresult, the accounting for loss contingencies relies heavily on management's judgment in developing the related estimates and assumptions.\nStock-Based Compensation\nWe expense all stock-based compensation awarded to employees and non-employee directors based on the grant date fair value of the awards over the requisite service period, adjusted for forfeitures which are estimated based on an analysis of historical experience and expected future trends.\nRestricted Stock Units (\"RSUs\")\nWe grant service-based RSUs to certain of our senior executives and other employees, as well as to our non-employee directors. In addition, we grant RSUs with performance-based and market-based vesting conditions to such senior executives and other key employees.\nThe fair values of our service-based RSU and performance-based RSU awards are measured based on the fair value of our Class A common stock on the date of grant, adjusted to reflect the absence of dividends for any awards for which dividend equivalent amounts do not accrue while outstanding and unvested. Related compensation expense for performance-based RSUs is recognized over the employees' requisite service period, to the extent that our attainment of performance goals (upon which vesting is dependent) is deemed probable, and involves judgment as to expectations surrounding our achievement of certain defined operating performance metrics.\nThe fair value of our market-based RSU awards, for which vesting is dependent upon total shareholder return (\"TSR\") of our Class A common stock over a three-year performance period relative to that of a pre-established peer group, is measured on the grant date based on estimated projections of our relative TSR over the performance period. These estimates are made using a Monte Carlo simulation, which models multiple stock price paths of our Class A common stock and that of the peer group to evaluate and determine our ultimate expected relative TSR performance ranking. Related compensation expense, net of estimated forfeitures, is recorded regardless of whether, and the extent to which, the market condition is ultimately satisfied. See Note 18 to the accompanying consolidated financial statements for further discussion.\nSensitivity\nThe assumptions used in calculating the grant date fair values of our stock-based compensation awards represent our best estimates. In addition, projecting the achievement level of certain performance-based awards, as well as estimating the number of awards expected to be forfeited, requires judgment. If actual results or forfeitures differ significantly from our estimates and assumptions, or if assumptions used to estimate the grant date fair value of future stock-based award grants are significantly changed, stock-based compensation expense and, therefore, our results of operations could be materially impacted. A hypothetical 10% change in our Fiscal 2025 stock-based compensation expense would have affected our net income by approximately $9 million.\nRECENTLY ISSUED ACCOUNTING STANDARDS\nSee Note 4 to the accompanying consolidated financial statements for a description of certain recently issued accounting standards which have impacted our consolidated financial statements, or may impact our consolidated financial statements in future reporting periods.",
  "item2": null
}