{
  "item1": "concession-based shop-within-shops located approximately 300 retail locations. size concession-based shop-within-shops ranges approximately 100 5,500 square feet. may share cost building out certain these shop-within-shops department store partners. Directly-Operated Digital Commerce Websites addition stores, retail business sells products online North America, Europe, Asia through various directly-operated digital commerce sites, which include www.RalphLauren.com, among others.",
  "item7": "Interest payments debt Other lease commitments Inventory purchase commitments Mandatory transition tax payments Real estate purchase commitment following description material, firmly committed obligations March 29, 2025: represent principal amount outstanding 3.750% Senior Notes 2.950% Senior Notes. Amounts do not include any call premiums, unamortized debt issuance costs, interest payments (see below); Interest payments debt represent semi-annual contractual interest payments due 3.750% Senior Notes 2.950% Senior Notes. Amounts do not include impact potential cash flows underlying related swap contracts (see Note 13 accompanying consolidated financial statements discussion swap contracts); represent fixed payments due over lease term noncancelable leases real estate operating equipment, including rent, real estate taxes, insurance, common area maintenance fees, and/or certain other costs. lease terms commenced, information been presented separately operating finance leases.",
  "item2": "Management's Discussion Analysis Financial Condition Results Operations. Special Note Regarding Forward-Looking Statements loss key personnel, including Mr. Ralph Lauren, other changes executive senior management team operating structure, including any potential changes resulting execution long-term growth strategy, ability effectively transfer knowledge maintain adequate controls procedures during periods transition; impact business resulting potential imposition additional tariffs, duties, taxes, changes existing trade agreements, other charges barriers trade, including those recently announced U.S. any responding retaliatory actions implemented impacted countries, any related impact global stock markets, foreign currency exchange rates, existing inflationary pressures, well ability implement mitigating sourcing strategies; potential impact business resulting inflationary pressures, including increases costs raw materials, transportation, wages, healthcare, other benefit-related costs; impact economic, political, other conditions us, customers, suppliers, vendors, lenders, including potential business disruptions related ongoing military conflicts taking place various parts world, most notably Russia-Ukraine Israel-Hamas wars, other recent hostilities Middle East, including between Israel Iran, militant attacks cargo vessels Red Sea, civil political unrest, diplomatic tensions between U.S."
}