{
  "source_file": "rok-20250930.htm",
  "form_type": "10-K",
  "item1": "Item 1. \nBusiness\nGeneral\nRockwell Automation, Inc. (Rockwell Automation or the Company) is the world’s largest company dedicated to industrial automation and digital transformation. We understand and simplify our customers’ complex production challenges and deliver the most valued solutions that combine technology and industry expertise. As a result, we make our customers more resilient, agile, and sustainable, creating more ways to win. See Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n (MD&A)\n \nfor additional information on our business and long-term strategy.\nThe Company continues the business founded as the Allen-Bradley Company in 1903. The privately-owned Allen-Bradley Company was a leading North American manufacturer of industrial automation equipment when the former Rockwell International Corporation (RIC) purchased it in 1985. \nThe Company was incorporated in Delaware in connection with a tax-free reorganization completed on December 6, 1996, pursuant to which we divested our former aerospace and defense businesses (the A&D Business) to The Boeing Company (Boeing). In the reorganization, RIC contributed all of its businesses, other than the A&D Business, to the Company and distributed all capital stock of the Company to RIC’s shareowners. Boeing then acquired RIC. \nAs used herein, the terms “we”, “us”, “our”, “Rockwell Automation”, or the “Company” include wholly-owned and controlled majority-owned subsidiaries and predecessors unless the context indicates otherwise. Information included in this Annual Report on Form 10-K refers to our continuing businesses unless otherwise indicated.\nWhenever an Item of this Annual Report on Form 10-K refers to information in our Proxy Statement for our Annual Meeting of Shareowners to be held on February 10, 2026 (the Proxy Statement), or to information under specific captions in Item 7. \nMD&A\n, or in Item 8. \nFinancial Statements and Supplementary Data\n (the Consolidated Financial Statements), the information is incorporated in that Item by reference. All date references to years and quarters refer to our fiscal year and quarters, unless otherwise stated.\nOperating Segments\nWe have three operating segments: Intelligent Devices, Software & Control, and Lifecycle Services. The Intelligent Devices segment includes drives, motion, advanced material handling, safety, sensing, industrial components, and configured-to-order products. The Software & Control segment includes control and visualization software and hardware, digital twin, simulation and information software, and network and security infrastructure. The Lifecycle Services segment includes digital consulting, professional services including engineered-to-order solutions, recurring services including cybersecurity, safety, remote monitoring, and asset management, and the Sensia joint venture. \nOur operating segments share common sales, supply chain, and functional support organizations and conduct business globally. Major markets served by all segments consist of discrete end markets (e.g., Automotive including Electric Vehicle and Battery, Semiconductor, and e-Commerce & Warehouse Automation), hybrid end markets (e.g., Food & Beverage, Life Sciences, and Tire), and process end markets (e.g., Energy, Mining, and Chemicals). See Note 20 in the Consolidated Financial Statements for additional information on our operating segments.\nGeographic Information\nWe do business in more than 100 countries around the world. The largest sales outside the United States on a country of destination basis are in Canada, China, Italy, the United Kingdom, and Mexico. See Item 1A. \nRisk Factors\n for a discussion of risks associated with our global operations.\nCompetition\nOur competitors range from large, diversified corporations that may also have business interests outside of industrial automation to smaller companies that offer a limited portfolio of industrial automation products, solutions, and services. Factors that influence our competitive position include the breadth and performance of our product, solution and services portfolio, technology differentiation, industry and application expertise, installed base, partner ecosystem, global presence and price. Major competitors include Siemens AG, ABB Ltd, Schneider Electric SA, Emerson Electric Co., Mitsubishi Electric Corp., Honeywell International Inc., and Dassault Systemes.\n2\nTable of Contents\nDistribution\nSee Item 7. \nMD&A\n for information on our market access strategy, including distributor concentrations. \nEmployees\nSee Item 7. \nMD&A \nfor information on our employees, including information related to attracting, developing, and retaining highly qualified employees.\nRaw Materials\nWe purchase a wide range of equipment, components, finished products, and materials used in our business. The raw materials essential to the manufacture of our products generally are available at competitive prices. We have a broad base of suppliers and subcontractors. We depend upon the ability of our suppliers and subcontractors to meet performance and quality specifications and delivery schedules. See Item 1A. \nRisk Factors\n for a discussion of risks associated with our reliance on third-party suppliers.\nBacklog\nSee Item 7. \nMD&A\n for information on our order backlog.\nEnvironmental Protection Requirements\nInformation about the effect of compliance with environmental protection requirements and resolution of environmental claims is contained in Note 17 in the Consolidated Financial Statements. See Item 1A. \nRisk Factors\n for a discussion of risks associated with liabilities and costs related to environmental remediation.\nPatents, Licenses, and Trademarks\nWe own or license numerous patents and patent applications related to our hardware and software products, solutions, and services. While in the aggregate our patents and licenses are important in the operation of our business, we do not believe that loss or termination of any one of them would materially affect our business or financial condition. We have received various claims of patent infringement and requests for patent indemnification. We believe that none of these claims or requests will have a material adverse effect on our financial condition. See Item 1A. \nRisk Factors\n for a discussion of risks associated with our intellectual property.\nThe Company’s name and its registered trademark “Rockwell Automation\n®\n” and other trademarks such as “Allen-Bradley\n®\n”, “A-B\n®\n”, “PlantPAx\n®\n Process Automation System™”, and “Connected Enterprise\n®\n”\n \nare important to all of our business segments. In addition, we own other important trademarks that we use, such as “ControlLogix\n®\n” and “CompactLogix\n®\n” for our control systems, “PowerFlex\n®\n” for our AC drives, “FactoryTalk\n®\n”, “Plex Systems\n®\n”, and “Fiix\n®\n” for our software and cloud offerings, “Clearpath\n®\n” and “Otto\n®\n” for our mobile robots, and “Verve\n®\n” for our asset inventory system and vulnerability management solution.\nSeasonality\nOur business segments are not subject to significant seasonality. However, the calendarization of our results can vary and may be affected by the seasonal spending patterns of our customers due to their annual budgeting processes and their working schedules.\nAvailable Information\nWe maintain a website at \nhttps://www.rockwellautomation.com\n. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to such reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 (the Exchange Act), as well as our annual reports to shareowners and Section 16 reports on Forms 3, 4, and 5, are available free of charge on this site through the “Investors” link as soon as reasonably practicable after we file or furnish these reports with the SEC. All reports we file with the SEC are also available free of charge via EDGAR through the SEC’s website at \nhttps://www.sec.gov\n. Our Guidelines on Corporate Governance and charters for our Board committees are also available on our website. The information contained on and linked from our website is not incorporated by reference into this Annual Report on Form 10-K.\n3\nTable of Contents",
  "item7": "Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nResults of Operations\nNon-GAAP Measures\nThe following discussion includes organic sales, total segment operating earnings and margin, Adjusted Income, Adjusted EPS, Adjusted Effective Tax Rate, and free cash flow, which are non-GAAP measures. See \nSupplemental Sales Information\n for a reconciliation of reported sales to organic sales and a discussion of why we believe this non-GAAP measure is useful to investors. See\n \nSummary of Results of Operations\n for a reconciliation of Income before income taxes to total segment operating earnings and margin and a discussion of why we believe these non-GAAP measures are useful to investors. See \nAdjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate Reconciliation\n for a reconciliation of Net income attributable to Rockwell Automation, diluted EPS, and effective tax rate to Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate, respectively, and a discussion of why we believe these non-GAAP measures are useful to investors. See \nFinancial Condition \nfor a reconciliation of Cash provided by operating activities to free cash flow and a discussion of why we believe this non-GAAP measure is useful to investors.\nOverview\nRockwell Automation, Inc. is the world’s largest company dedicated to industrial automation and digital transformation. Overall demand for our hardware and software products, solutions, and services is driven by:\n \n•\ninvestments in manufacturing, including new facilities or production lines, upgrades, modifications and expansions of existing facilities or production lines;\n•\ninvestments in basic materials production capacity, which may be related to commodity pricing levels;\n•\nour customers’ needs for faster time to market, agility to address evolving consumer preferences, operational productivity, asset management and reliability, and business resilience, including security and enterprise risk management;\n•\nour customers’ needs to continuously improve quality, safety, and sustainability;\n•\nindustry factors that include our customers’ new product introductions, demand for our customers’ products or services, and the regulatory and competitive environments in which our customers operate;\n•\nlevels of global industrial production and capacity utilization;\n•\nregional factors that include local political, social, regulatory, and economic circumstances; and\n•\nthe spending patterns of our customers due to their annual budgeting processes and their working schedules.\nLong-term Strategy\nAs the world’s largest company dedicated to industrial automation and digital transformation, our strategy is to bring the Connected Enterprise\n®\n to life. We understand and simplify our customers’ complex production challenges and deliver the most valued solutions that combine technology and industry expertise. As a result, we make our customers more resilient, agile, and sustainable, creating more ways to win. We deliver value by helping our customers optimize production, build resilience, empower people, become more sustainable, and accelerate transformation. \nRockwell Automation stands at the intersection of the technological and societal trends that are shaping the future of industrial operations. We see converging megatrends including digitization and AI, energy transition and sustainability, shifting demographics, and an increased need for resiliency. \nOur long-term profitable growth framework outlines how we will deliver accelerated growth while we continue to transform our company to meet stakeholder expectations over the longer term:\n•\nachieve faster secular growth in traditional markets due to customer needs for resiliency (including cybersecurity), agility, sustainability, and mitigating impacts of labor shortages;\n•\ngrow share and create new ways to win through technology differentiation, industry focus, go to market acceleration, expanded offerings and new markets;\n•\ncontinue double-digit growth in annual recurring revenue;\n•\nadd 1% average annual growth from acquisitions; and\n•\ndeliver profitable growth within a disciplined financial framework. \n17\nTable of Contents\nSustainability\n \nOur 2024 Sustainability Report highlights our sustainability strategy and outcomes. Our sustainability priorities are focused on three outcomes:\n•\nSustainable Customers - enable our customers to achieve their own sustainability goals, making a positive impact on the world;\n•\nSustainable Company - create innovative, sustainable products and solutions and foster a culture that empowers employees to operate safely, sustainably, and responsibly; and \n•\nSustainable Communities - support the communities in which we live and work, having an impact that extends beyond our own organization.\nWe will meet our customers where they are on their sustainability journey. Whether they are just starting or leading the way, we help them translate insights into impacts across energy, water, and waste. Our technologies provide data transparency across value chains and enable our partners to scale innovative and often industry-first sustainable solutions. \n•\nEnergy - contemporary industrial energy management software solutions that put energy data in context to production data, to reduce energy use across the value chain.\n•\nWater - smart water solutions leverage modern software and analytics to improve operations visibility, system reliability, and worker productivity while supporting security needs and meeting regulatory obligations. \n•\nWaste - enabling the circular economy for managing automation assets. Focus on developing solutions to automate industry-specific processes. \nDifferentiation through Technology Innovation and Domain Expertise\nWe have an industry leading portfolio of hardware, software, and services to give customers the flexibility to choose on-premises, edge, and cloud-native solutions. \nOur integrated control and information architecture, with Logix at its core, is an important differentiator. We are the only automation provider that can support many production disciplines, including discrete, process, batch, safety, security, motion, robotics, and power control, in a single hardware and software environment, helping customers increase the speed of deployment and reduce their total cost of ownership. \nOur open architecture and strong partner ecosystem allow customers to work with best-in-class partners across the technology stack and leverage existing infrastructure with new solutions. \nComplementing our strong technology differentiation is our own domain expertise. Domain expertise refers to the industry and application knowledge required to deliver solutions and services that support customers through the entire lifecycle of their automation investment. The combination of industry-specific domain expertise of our people with our innovative technologies enables us to help our customers automate and transform their manufacturing processes and solve their business challenges. Our digital services business has a deep understanding of customers’ biggest digital transformation challenges and opportunities for further productivity and growth.\nMarket Access and Expansion\nOver the past decade, our investments in technology and globalization have enabled us to expand our addressed market to approximately $120 billion. With our focus on innovation and growth, we expect to continue to expand our addressed market over our long-term planning horizon. All of our markets are expected to grow over our long-term planning horizon. Our domestic market projections reflect the opportunity to localize our customers’ supply chain and production operations. Our international market projections reflect higher levels of infrastructure investment and the growing middle-class population. We believe that increased demand for consumer products in our addressed markets will lead to manufacturing investment and provide us with additional growth opportunities in the future.\nWe have developed a powerful partner ecosystem that acts as an amplifier to our internal capabilities and enables us to serve our customers’ evolving needs around the world. \nIn most countries, our direct sales force works with Original Equipment Manufacturers (OEMs) or machine builders, system integrators, technology partners, and end users in conjunction with independent distributors. Approximately 65 percent of our global sales are transacted through independent distributors. Sales to our two largest distributors in 2025, 2024, and 2023, which are attributable to all three segments, were approximately 20 percent of our total sales. \n18\nTable of Contents\nMachine builders continue to represent an important growth opportunity. To remain competitive, machine builders need to find the optimal balance of machine cost and performance while reducing their time to market. Our scalable technology, leading design productivity tools, and recent acquisitions support machine builders in addressing these business needs.\nAcquisitions and Investments\nOur acquisition and investment strategy focuses on hardware and software products, solutions, and services that will be catalytic to the organic growth of our core offerings.\nOur key priorities for inorganic investments include:\n•\nindustrial AI applications;\n•\nmarket access in Europe and Asia; and\n•\nproduct portfolio expansion. \nIn addition, we make venture investments that enable access to leading-edge and complementary technologies aligned with our strategic priorities, accelerate internal development efforts, reduce time to market, and provide insights into disruptive technologies.\nWe believe these acquisitions and venture investments will help our served market and deliver value to our customers. See Note 4 in the Consolidated Financial Statements for additional information on our recent acquisitions.\nAttracting, Developing, and Retaining Highly Qualified Employees\nOur talent management practices are focused on ensuring we can attract, develop, and retain the talent we need to deliver our business strategy. We work to deliver a cohesive and consistent experience throughout the employee lifecycle that aligns with our four culture principles:\n•\nStrengthen our commitment to integrity, diversity and inclusion;\n•\nBe willing to compare ourselves to the best alternatives;\n•\nIncrease the speed of decision making;\n•\nHave a steady stream of fresh ideas.\nOur programs and processes are designed to enable and inspire great employees to do their best work and to make Rockwell Automation a place where the best want to be.\n19\nTable of Contents\nThere are several ways in which we attract, develop, and retain highly qualified employees, including:\n•\nWe make the safety and health of our employees a top priority. We strive for zero workplace injuries and illnesses and operate in a manner that recognizes safety as fundamental to Rockwell Automation being a great place to work. In fiscal 2025, we achieved 0.24 recordable cases per 100 employees. \n•\nWe capture and act upon employee feedback through our annual employee engagement survey. It measures several employee experience indicators and drivers and provides an overall employee engagement index (EEI) with external benchmark comparison. The latest survey, conducted in March 2025, showed a resilient EEI of 70 and a global inclusion index score of 74. Additionally, our intent to stay index was 71.\n•\nWe invest in growth and development of our employees. As the pace of change increases, it is important we provide re-skilling and upskilling opportunities for our technical talent, along with soft skills and leadership development for all. We offer a portfolio of all employee, managerial, and leader training that spans on-demand, virtual, and live instructor-led formats. Our programs focus on basic as well as transformational skills. Furthermore, our culture is the foundation for everything we do, and it is built on integrity and a shared commitment to innovation and growth. As such, we take great care in ensuring our employees understand our culture and how to activate it through dedicated workshops during our new employee onboarding. In fiscal 2025, the majority of our employees completed one or more of our training programs representing approximately one million learning hours.\n•\nWe offer employee assistance and work life benefits to all global employees. Our comprehensive benefits include healthcare benefits, disability and life insurance benefits, paid time off, and leave programs. Rockwell offers plans and resources to help employees meet future savings goals through defined benefit and retirement savings plans. We believe that face to face interaction is critical for our culture, innovation, people development, and engagement, and that flexible, virtual work arrangements help employees be more productive and engaged. During fiscal 2025, we saw strong participation in our Hybrid Workplace Program, which combines the values of both physical workspaces and virtual work options, both of which are important for attracting, retaining, and developing employees and facilitating innovation, engagement, and productivity. We offer flextime, remote work, and part-time arrangements whenever business conditions permit. \nWe monitor employee retention and attrition rates by several factors. For non-manufacturing roles, we generally experienced flat attrition rates in fiscal 2025 as compared to fiscal 2024. For manufacturing roles, we experienced a significant reduction in attrition rates in fiscal 2025 as compared to fiscal 2024. We believe these rates are favorable to market trends experienced broadly across labor markets in fiscal 2025. We use attrition rate information to identify and address unfavorable trends to mitigate risk to our business. See Item 1A. \nRisk Factors\n for a discussion of risks relating to our inability to attract, develop, and retain highly qualified employees.\nAt September 30, 2025, our employees, including those employed by consolidated subsidiaries, by region were approximately:\nNorth America\n9,000 \nEurope, Middle East and Africa\n5,000 \nAsia Pacific\n7,000 \nLatin America\n5,000 \nTotal employees\n26,000 \n20\nTable of Contents\nOur employees had the following global gender demographics based on voluntary disclosure:\nSeptember 30, 2025\nWomen\nMen\nUndisclosed\nAll employees\n33%\n67%\n—%\nIndividual Contributors\n34%\n66%\n—%\nPeople Managers\n27%\n73%\n—%\nTechnical Talent\n20%\n80%\n—%\nManufacturing Associates\n46%\n54%\n—%\nOur U.S. employees had the following race and ethnicity demographics based on voluntary disclosure:\nSeptember 30, 2025\nBlack / African American\nAsian\nHispanic / Latinx\nWhite\nMultiracial, Native American and Pacific Islander\nUndisclosed\nAll U.S. Employees\n7%\n11%\n5%\n70%\n2%\n5%\nIndividual Contributors\n8%\n12%\n5%\n69%\n2%\n4%\nPeople Managers\n6%\n7%\n5%\n75%\n1%\n6%\nTechnical Talent\n6%\n13%\n6%\n69%\n2%\n4%\nManufacturing Associates\n15%\n17%\n3%\n56%\n2%\n7%\n21\nTable of Contents\nU.S. Economic Trends\nIn 2025, sales in the U.S. accounted for over half of our total sales. The various indicators we use to gauge the direction and momentum of our served U.S. markets include:\n•\nThe Industrial Production (IP) Index, published by the Federal Reserve, which measures the real output of manufacturing, mining, and electric and gas utilities. The Manufacturing IP Index shown in the chart below is expressed as a percentage of real output in a base year, currently 2017.\n•\nThe Manufacturing Purchasing Managers’ Index (PMI), published by the Institute for Supply Management (ISM), which indicates the current and near-term state of manufacturing activity in the U.S. According to the ISM, a PMI measure above 50 indicates that the U.S. manufacturing economy is generally expanding while a measure below 50 indicates that it is generally contracting.\nThe table below depicts the trends in these indicators from fiscal 2023 to 2025. These figures are as of November 12, 2025, and are subject to revision by the issuing organizations. Through August, the IP Index did not significantly change from the third quarter of fiscal 2025. Manufacturing PMI results remained below 50 for each of the months in the fourth quarter of fiscal 2025.\nManufacturing IP Index\nPMI\nFiscal 2025 quarter ended:\n \n \nSeptember 2025 \n(1)\n49.1 \nJune 2025\n100.1 \n49.0 \nMarch 2025\n100.2 \n49.0 \nDecember 2024\n98.9 \n49.2 \nFiscal 2024 quarter ended:\nSeptember 2024\n99.0 \n47.5 \nJune 2024\n99.4 \n48.5 \nMarch 2024\n99.5 \n50.3 \nDecember 2023\n99.2 \n47.1 \nFiscal 2023 quarter ended:\nSeptember 2023\n99.6 \n49.0 \nJune 2023\n99.2 \n46.0 \nMarch 2023\n99.2 \n46.3 \nDecember 2022\n98.1 \n48.4 \n(1) \nThe September 2025 Manufacturing IP Index has not been published as of November 12, 2025. The Manufacturing IP Index was 100.3 for the month ended August 2025.\nInflation in the U.S. has also had an impact on our input costs and pricing. The Producer Price Index (PPI), published by the Bureau of Labor Statistics, measures the average change over time in the selling prices received by domestic producers for their output. September 2025 PPI has not been published as of November 12, 2025. Through August 2025, PPI growth did not significantly change from the third quarter of 2025. After observing double-digit PPI growth through most of 2022, we have now observed PPI growth in the low single digits for the last nine quarters. Producer prices remain elevated, however, year over year increases remain decelerated from the surges in 2023 and 2022.\nNon-U.S. Economic Trends\nIn 2025, sales to customers outside the U.S. accounted for less than half of our total sales. These customers include both indigenous companies and multinational companies with a global presence. In addition to the global factors previously mentioned in the Overview section, international demand, particularly in emerging markets, has historically been driven by the strength of the industrial economy in each region, investments in infrastructure, and expanding consumer markets. We use changes in key countries' gross domestic product (GDP), IP, and PMI as indicators of the growth opportunities in each region where we do business. Industrial production outside the U.S. was mixed in the fourth quarter of fiscal 2025. Manufacturing PMI readings outside the U.S were also mixed with readings in Asia Pacific generally better than readings in Europe, Canada, Mexico, and Brazil.\n22\nTable of Contents\nOutlook\nWe continue to manage the impact of tariffs through actions including pricing and the use of alternative sources of materials and redundant manufacturing locations. Resiliency actions we took in recent years enable us to build certain high value product lines in more than one geographic location. In consideration of these mitigating actions, tariff costs are expected to be neutral to EPS in fiscal 2026.\nBacklog\nOur total order backlog consists of (in millions):\nSeptember 30,\n2025\n2024\nIntelligent Devices\n$\n704 \n$\n737 \nSoftware & Control\n654 \n653 \nLifecycle Services\n1,520 \n1,701 \nTotal Company\n$\n2,878 \n$\n3,091 \nSee Note 2 in the Consolidated Financial Statements for additional information on the nature of our products and services and revenue recognition.\n23\nTable of Contents\nSummary of Results of Operations\nThe following table reflects our sales and operating results (in millions, except per share amounts and percentages):\n \nYear Ended September 30,\n \n2025\n2024\n2023\nSales\n \n \n \nIntelligent Devices (a)\n$\n3,756 \n$\n3,804 \n$\n4,098 \nSoftware & Control (b)\n2,383 \n2,187 \n2,886 \nLifecycle Services (c)\n2,203 \n2,273 \n2,074 \nTotal sales (d)\n$\n8,342 \n$\n8,264 \n$\n9,058 \nSegment operating earnings \n(1)\n \n \n \nIntelligent Devices (e)\n$\n676 \n$\n700 \n$\n828 \nSoftware & Control (f)\n708 \n530 \n953 \nLifecycle Services (g)\n319 \n365 \n148 \nTotal segment operating earnings \n(2) \n(h)\n1,703 \n1,595 \n1,929 \nPurchase accounting depreciation and amortization, and impairment \n(365)\n(144)\n(264)\nCorporate and other \n(3)\n(125)\n(114)\n(110)\nNon-operating pension and postretirement benefit (cost) credit\n(1)\n20 \n(83)\nNet legacy asbestos and environmental charges \n(3)\n(154)\n(21)\n(18)\nChange in fair value of investments\n(3)\n— \n279 \nRestructuring charges\n5 \n(97)\n— \nInterest expense, net\n(143)\n(139)\n(125)\nIncome before income taxes (i)\n917 \n1,100 \n1,608 \nIncome tax provision\n(168)\n(152)\n(330)\nNet income\n749 \n948 \n1,278 \nNet loss attributable to noncontrolling interests\n(120)\n(5)\n(109)\nNet income attributable to Rockwell Automation\n$\n869 \n$\n953 \n$\n1,387 \n \n \n \nDiluted EPS\n$\n7.67 \n$\n8.28 \n$\n11.95 \nAdjusted EPS \n(4)\n$\n10.53 \n$\n9.85 \n$\n12.25 \nDiluted weighted average outstanding shares\n113.1 \n114.5 \n115.6 \nPre-tax margin (i/d)\n11.0 \n%\n13.3 \n%\n17.8 \n%\nIntelligent Devices segment operating margin (e/a)\n18.0 \n%\n18.4 \n%\n20.2 \n%\nSoftware & Control segment operating margin (f/b)\n29.7 \n%\n24.2 \n%\n33.0 \n%\nLifecycle Services segment operating margin (g/c)\n14.5 \n%\n16.1 \n%\n7.1 \n%\nTotal segment operating margin \n(2)\n (h/d)\n20.4 \n%\n19.3 \n%\n21.3 \n%\n24\nTable of Contents\n(1) \nSee Note 20 in the Consolidated Financial Statements for the definition of segment operating earnings.\n(2) \nTotal segment operating earnings and total segment operating margin are non-GAAP financial measures. We exclude purchase accounting depreciation and amortization, and impairment, corporate and other, non-operating pension and postretirement benefit (cost) credit, net legacy asbestos and environmental charges, change in fair value of investments, restructuring charges aligned with enterprise-wide strategic initiatives, and interest expense, net because we do not consider these items to be directly related to the operating performance of our segments. We believe total segment operating earnings and total segment operating margin are useful to investors as measures of operating performance. We use these measures to monitor and evaluate the profitability of our operating segments. Our measures of total segment operating earnings and total segment operating margin may be different from measures used by other companies. \n(3) \nLegacy asbestos and environmental charges were previously included in Corporate and other. All periods have been recast to conform with current year presentation.\n(4) \nAdjusted EPS is a non-GAAP earnings measure. See \nAdjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate Reconciliation\n for more information on this non-GAAP measure.\n25\nTable of Contents\n2025 Compared to 2024 \nSales\nReported and organic sales in fiscal 2025 increased 1 percent compared to 2024, as currency had no material effect. Pricing increased total company sales by approximately 3 percentage points year over year, realized in the Intelligent Devices and Software & Control segments. Volume decreased total company sales by approximately 2 percentage points year over year driven by the Intelligent Devices segment.\nThe table below presents our sales for the year ended September 30, 2025, attributed to the geographic regions based upon country of destination, and the percentage change from the same period in 2024 (in millions, except percentages).\nChange vs.\nChange in Organic \nSales \n(1)\n vs.\nYear Ended \nSeptember 30, 2025\nYear Ended \nSeptember 30, 2024\nYear Ended \nSeptember 30, 2024\nNorth America\n$\n5,270 \n4 \n%\n4 \n%\nEurope, Middle East and Africa\n1,488 \n(1)\n%\n(3)\n%\nAsia Pacific\n1,024 \n(5)\n%\n(4)\n%\nLatin America\n560 \n(12)\n%\n(6)\n%\nTotal Company Sales\n$\n8,342 \n1 \n%\n1 \n%\n(1) \nOrganic sales and organic sales growth exclude the effect of acquisitions, changes in currency exchange rates, and divestitures. See \nSupplemental Sales Information\n for information on these non-GAAP measures.\nCorporate and Other \nCorporate and other expenses were $125 million in fiscal 2025 compared to $114 million in fiscal 2024. Legacy asbestos and environmental charges were previously included in Corporate and other. All periods have been recast to conform with current year presentation.\nPurchase Accounting Depreciation and Amortization, and Impairment \nPurchase accounting depreciation and amortization, and impairment expense was $365 million in fiscal 2025 compared to $144 million in fiscal 2024. The increase was primarily due to a $224 million non-cash impairment charge related to the Sensia joint venture, or $110 million including the impact of non-controlling interest and tax effects.\nRestructuring Charges\nDuring 2025, we reversed $5 million of restructuring accruals primarily due to attrition without payment of severance. Restructuring charges were $97 million in fiscal 2024, which relate to actions in conjunction with an enterprise-wide comprehensive program to optimize cost structure and expand margins. See Note 18 in the Consolidated Financial Statements for more information on our restructuring charges.\nLegacy Asbestos and Environmental Charges\nIn the fourth quarter of 2025, we elected to change our method of accounting for net legacy asbestos-related defense costs from expensing as incurred to accruing for all future defense costs for both known and unknown claims, similar to how we account for indemnity costs. We recorded pre-tax expense in Other (expense) income in the Consolidated Statement of Operations of $136 million in the fourth quarter of 2025 ($103 million after tax or $0.91 per share), which includes charges for a change in accounting method of $91 million and indemnity accrual increase of $45 million. See Notes 1 and 17 in the Consolidated Financial Statements for more information. Amounts were previously recorded in Corporate and other. All periods have been recast to conform with current year presentation.\n26\nTable of Contents\nIncome before Income Taxes\nIncome before income taxes decreased to $917 million in 2025 from $1,100 million in 2024. The decrease was primarily due to higher compensation, the non-cash impairment charge related to the Sensia joint venture, and an accounting change and accrual increase for legacy asbestos liabilities, partially offset by productivity, price realization, and prior year restructuring charges. Total segment operating earnings increased to $1,703 million from $1,595 million in 2024, primarily due to productivity, higher sales driven by price realization, and favorable mix, partially offset by higher compensation and unfavorable net currency.\nIncome Taxes\nThe effective tax rate in 2025 was 18.3 percent compared to 13.8 percent in 2024. The increase in the effective tax rate is related to valuation allowances and tax effects from the non-cash impairment charge for the Sensia joint venture and higher discrete tax benefits in 2024 as compared to 2025.  The Adjusted Effective Tax Rate in 2025 was 17.1 percent compared to 15.3 percent in 2024. The increase in the Adjusted Effective Tax Rate was primarily due to higher discrete tax benefits in 2024 as compared to 2025.\nSee Note 16 in the Consolidated Financial Statements for a complete reconciliation of the United States statutory tax rate to the effective tax rate and additional information on tax events in 2025 and 2024 affecting each year’s respective tax rates.\nIn October 2021, the Organization for Economic Cooperation and Development (OECD) and G20 Finance Ministers reached an agreement, known as Base Erosion and Profit Shifting (BEPS) Pillar Two, that, among other things, ensures that income earned in each jurisdiction that qualifying multinational enterprises operate in is subject to a minimum corporate income tax rate of at least 15 percent. Discussions related to the formal implementation and enactment of this agreement, including within the tax law of each member jurisdiction including the United States, are ongoing. Certain countries have enacted the Pillar Two framework, including Singapore, which is expected to result in the greatest impact to the Company. Enactment of this regulation in its current form would generally apply to the Company beginning in fiscal year 2026, resulting in an approximate increase in our effective tax rate of 3 percent as well as in the amount of global corporate income tax paid. \nIn addition to BEPS Pillar Two, other items could also affect our effective tax rate, many of which are outside of our control,\nincluding:\n•\nchanges in the valuation of our deferred tax assets and liabilities, and in deferred tax valuation allowances;\n•\nchanges in the relative proportions of revenue and income before taxes in the various jurisdictions in which we operate that have differing statutory tax rates;\n•\nchanging tax laws, regulations, rates and interpretations in multiple jurisdictions in which we operate;\n•\nchanges to the financial accounting rules for income taxes;\n•\nthe tax effects of acquisitions; and\n•\nthe resolution and timing of issues arising from tax audits.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBBA”) was enacted in the U.S. The OBBBA includes significant tax related provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act of 2017 (Tax Act), modifications to the international tax framework, and the restoration of favorable tax treatment for certain business provisions. The OBBBA has multiple effective dates with the earliest provisions taking effect in fiscal 2025 and others beginning in fiscal 2026 and beyond. ASC 740, “Income Taxes”, requires the effects of changes in tax rates and laws on deferred tax balances to be recognized in the period in which the legislation is enacted. We have reflected the impact in our deferred balances for the year ended September 30, 2025, and will monitor future effects as new guidance emerges. Based on our evaluation of the guidance available to date we believe the provisions will have an overall neutral impact.  \nNet Loss Attributable to Noncontrolling Interests\nNet loss attributable to noncontrolling interests was $120 million in 2025 compared to $5 million in 2024. The increase was driven by $107 million of the accounting charge for goodwill and intangibles impairment and related tax effects including tax asset valuation allowances that is attributable to noncontrolling interests.\n27\nTable of Contents\nDiluted EPS and Adjusted EPS\nFiscal 2025 Net income attributable to Rockwell Automation was $869 million or $7.67 per share, compared to $953 million or $8.28 per share in fiscal 2024. The decreases in Net income attributable to Rockwell Automation and diluted EPS were primarily due to lower pre-tax margin and a higher effective tax rate. Pre-tax margin was 11.0% in 2025 compared to 13.3% in 2024. The decrease was primarily due to higher compensation, the non-cash impairment charge related to the Sensia joint venture, and an accounting change and accrual increase for legacy asbestos liabilities, partially offset by productivity, price realization, and prior year restructuring charges. Adjusted EPS was $10.53 in fiscal 2025, up 7 percent compared to $9.85 in fiscal 2024, primarily due to higher segment operating margin. Total segment operating margin was 20.4% in 2025 compared to 19.3% in 2024. The increase in total segment operating margin was primarily due to productivity, higher sales driven by price realization, and favorable mix, partially offset by higher compensation and unfavorable net currency.\nIntelligent Devices\nSales\nIntelligent Devices reported and organic sales decreased 1 percent in 2025 compared to 2024. All regions experienced reported sales decreases. All regions except Latin America experienced organic sales decreases.\nSegment Operating Margin\nIntelligent Devices segment operating earnings decreased 3 percent year over year. Segment operating margin decreased to 18.0 percent in 2025 from 18.4 percent in 2024, primarily due to higher compensation, lower sales volume, and a prior year earnout accrual adjustment, partially offset by productivity and price realization.\nSoftware & Control\nSales\nSoftware & Control reported and organic sales increased 9 percent in 2025 compared to 2024. All regions except North America experienced reported and organic sales decreases.\nSegment Operating Margin\nSoftware & Control segment operating earnings increased 34 percent year over year. Segment operating margin increased to 29.7 percent in 2025 from 24.2 percent in 2024, primarily due to productivity, higher sales volume, and the positive impact of price realization, partially offset by higher compensation.\nLifecycle Services\nSales\nLifecycle Services reported and organic sales decreased 3 percent in 2025 compared to 2024. All regions except Europe, Middle East, and Africa experienced reported sales decreases. All regions experienced organic sales decreases. \nSegment Operating Margin\nLifecycle Services segment operating earnings decreased 13 percent year over year. Segment operating margin decreased to 14.5 percent in 2025 from 16.1 percent in 2024, primarily due to higher compensation, partially offset by strong project execution and productivity.\n28\nTable of Contents\n2024 Compared to 2023 \nFor a discussion of the Company’s fiscal 2024 results compared to fiscal 2023, see Item 7. \nMD&A\n of the Company’s Annual Report on Form 10-K for the year ended September 30, 2024, filed on November 12, 2024. \nSupplemental Segment Information\nPurchase accounting depreciation and amortization, and impairment, non-operating pension and postretirement benefit (credit) cost, and restructuring charges are not allocated to our operating segments because these costs are excluded from our measurement of each segment’s operating performance for internal purposes. If we were to allocate these costs, we would attribute them to each of our segments as follows (in millions):\n \nYear Ended September 30,\n \n2025\n2024\n2023\nPurchase accounting depreciation and amortization, and impairment\n \n \n \nIntelligent Devices\n$\n37 \n$\n38 \n$\n5 \nSoftware & Control\n66 \n68 \n69 \nLifecycle Services\n262 \n38 \n190 \nNon-operating pension and postretirement benefit (credit) cost\nIntelligent Devices\n$\n(2)\n$\n(7)\n$\n21 \nSoftware & Control\n(1)\n(7)\n21 \nLifecycle Services\n(2)\n(10)\n28 \nRestructuring charges\nIntelligent Devices\n$\n(2)\n$\n44 \n$\n— \nSoftware & Control\n(2)\n33 \n— \nLifecycle Services\n(1)\n20 \n— \n29\nTable of Contents\nAdjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate Reconciliation\nAdjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate are non-GAAP earnings measures that exclude non-operating pension and postretirement benefit cost (credit), purchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation, net legacy asbestos and environmental charges, change in fair value of investments, and restructuring charges aligned with enterprise-wide strategic initiatives, including their respective tax effects and related valuation allowances. \nIn 2025, we updated the definition of our non-GAAP earnings measures to exclude net legacy asbestos and environmental charges. We believe the change to our definition provides a more useful presentation of our operating performance to investors as the charges are not reflective of our core operational performance and relate to products sold many years ago including products from divested businesses and environmental matters at previously owned properties. All previously reported amounts within this report have been recast to conform to this new definition. In the fourth quarter of 2025, we elected to change our method of accounting for net legacy asbestos-related defense costs from expensing as incurred to accruing for all future defense costs and a related receivable for insurance recoveries for both known and unknown claims, similar to how we account for indemnity costs. See Notes 1 and 17 for more information related to our legacy asbestos claims and environmental matters.\nPurchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation includes a non-cash accounting charge related to goodwill and intangible asset impairment for the year ended September 30, 2025, and goodwill impairment for the year ended September 30, 2023, for the Sensia joint venture. See Note 3 in the Consolidated Financial Statements for more information on our goodwill and intangible asset impairment charges. The tax effect of the purchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation includes the tax effects on the Sensia joint venture impairments and related Sensia tax asset valuation allowances. We recognized restructuring charges in conjunction with an enterprise-wide comprehensive program to optimize cost structure and expand margins in the year ended September 30, 2024. See Note 18 in the Consolidated Financial Statements for more information on our restructuring charges. Non-operating pension and postretirement benefit cost (credit) is defined as all components of our net periodic pension and postretirement benefit cost except for service cost. See Note 14 in the Consolidated Financial Statements for more information on our net periodic pension and postretirement benefit cost. \nWe believe that Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate provide useful information to our investors about our operating performance and allow management and investors to compare our operating performance period over period. Adjusted EPS is also used as a financial measure of performance for our annual incentive compensation. Our measures of Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate may be different from measures used by other companies. These non-GAAP measures should not be considered a substitute for Net income attributable to Rockwell Automation, diluted EPS, and effective tax rate.\n30\nTable of Contents\nThe following are reconciliations of Net income attributable to Rockwell Automation, diluted EPS, and effective tax rate to Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate, respectively (in millions, except per share amounts and percentages):\n \nYear Ended September 30,\n \n2025\n2024\n2023\nNet income attributable to Rockwell Automation\n$\n869 \n$\n953 \n$\n1,387 \nNon-operating pension and postretirement benefit cost (credit)\n1 \n(20)\n83 \nTax effect of non-operating pension and postretirement benefit cost (credit)\n(1)\n4 \n(21)\nPurchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation \n(1)\n249 \n133 \n178 \nTax effect of purchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation \n(1)\n(38)\n(25)\n(9)\nNet legacy asbestos and environmental charges \n(2)\n154 \n21 \n18 \nTax effect of net legacy asbestos and environmental charges \n(2)\n(37)\n(5)\n(4)\nChange in fair value of investments\n3 \n— \n(279)\nTax effect of change in fair value of investments\n(1)\n— \n68 \nRestructuring charges\n(5)\n97 \n— \nTax effect of restructuring charges\n1 \n(25)\n— \nAdjusted Income \n(2)\n$\n1,195 \n$\n1,133 \n$\n1,421 \nDiluted EPS\n$\n7.67 \n$\n8.28 \n$\n11.95 \nNon-operating pension and postretirement benefit cost (credit)\n0.01 \n(0.17)\n0.72 \nTax effect of non-operating pension and postretirement benefit cost (credit)\n(0.01)\n0.03 \n(0.18)\nPurchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation\n2.20 \n1.16 \n1.54 \nTax effect of purchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation\n(0.34)\n(0.22)\n(0.08)\nNet legacy asbestos and environmental charges\n1.36 \n0.18 \n0.16 \nTax effect of net legacy asbestos and environmental charges\n(0.33)\n(0.04)\n(0.03)\nChange in fair value of investments\n0.02 \n— \n(2.42)\nTax effect of change in fair value of investments\n(0.01)\n(0.01)\n0.59 \nRestructuring charges\n(0.05)\n0.85 \n— \nTax effect of restructuring charges\n0.01 \n(0.21)\n— \nAdjusted EPS\n$\n10.53 \n$\n9.85 \n$\n12.25 \nEffective tax rate\n18.3 \n%\n13.8 \n%\n20.5 \n%\nTax effect of non-operating pension and postretirement benefit cost (credit)\n0.1 \n%\n(0.1)\n%\n0.3 \n%\nTax effect of purchase accounting depreciation and amortization, and impairment attributable to Rockwell Automation\n(2.5)\n%\n0.4 \n%\n(3.7)\n%\nTax effect of net legacy asbestos and environmental charges\n1.1 \n%\n0.2 \n%\n0.1 \n%\nTax effect of change in fair value of investments\n0.1 \n%\n0.1 \n%\n(0.7)\n%\nTax effect of restructuring charges \n— \n%\n0.9 \n%\n— \n%\nAdjusted Effective Tax Rate\n17.1 \n%\n15.3 \n%\n16.5 \n%\n(1) \n2025 includes $110 million net expense from a $224 million goodwill and intangible asset non-cash impairment charge included in Income before income taxes, ($7) million tax effect including related valuation allowances recorded in the Income tax provision, and ($107) million Net loss attributable to noncontrolling interests. 2023 includes $98 million net expense from a $158 million goodwill impairment charge included in Income before income taxes, $33 million tax effect including related valuation allowances recorded in the Income tax provision, and ($93) million Net loss attributable to noncontrolling interests.\n \n(2)\n All periods have been recast to conform with current year presentation.\n31\nTable of Contents\nFinancial Condition\nThe following is a summary of our cash flows from operating, investing, and financing activities, as reflected in the Consolidated Statement of Cash Flows (in millions):\n \nYear Ended September 30,\n \n2025\n2024\n2023\nCash provided by (used for)\n \n \n \nOperating activities\n$\n1,544 \n$\n864 \n$\n1,374 \nInvesting activities\n(216)\n(982)\n854 \nFinancing activities\n(1,335)\n(503)\n(1,676)\nEffect of exchange rate changes on cash\n4 \n12 \n20 \n(Decrease) increase in cash, cash equivalents, and restricted cash\n$\n(3)\n$\n(609)\n$\n572 \nThe following table summarizes free cash flow, which is a non-GAAP financial measure (in millions):\n \nYear Ended September 30,\n \n2025\n2024\n2023\nCash provided by operating activities\n$\n1,544 \n$\n864 \n$\n1,374 \nCapital expenditures\n(186)\n(225)\n(161)\nFree cash flow\n$\n1,358 \n$\n639 \n$\n1,213 \nOur definition of free cash flow takes into consideration capital investments required to maintain the operations of our businesses and execute our strategy. Cash provided by operating activities adds back non-cash depreciation expense to earnings but does not reflect a charge for necessary capital expenditures. Our definition of free cash flow excludes the operating cash flows and capital expenditures related to our discontinued operations, if any. Operating, investing, and financing cash flows of our discontinued operations, if any, are presented separately in our Consolidated Statement of Cash Flows. In our opinion, free cash flow provides useful information to investors regarding our ability to generate cash from business operations that is available for acquisitions and other investments, service of debt principal, dividends, and share repurchases. We use free cash flow, as defined, as one measure to monitor and evaluate our performance, including as a financial measure for our annual incentive compensation. Our definition of free cash flow may be different from definitions used by other companies.\nCash provided by operating activities was $1,544 million for the year ended September 30, 2025, compared to $864 million for the year ended September 30, 2024. Free cash flow was $1,358 million for the year ended September 30, 2025, compared to $639 million for the year ended September 30, 2024. The year-over-year increases in cash provided by operating activities and free cash flow were primarily due to cost reduction and other margin expansion initiatives, no payout of incentive compensation in the first quarter of fiscal 2025 related to fiscal 2024 performance, and lower tax payments, partially offset by a voluntary pre-tax contribution of $70 million to the company's U.S. pension plan.\nOur Short-term debt as of September 30, 2025 and 2024, includes commercial paper borrowings of $522 million and $657 million, with a weighted average interest rate of 4.24 percent and 5.14 percent, and a weighted average maturity period of 16 days and 24 days, respectively. In December 2022, Sensia entered into an unsecured $75 million line of credit. As of September 30, 2025 and 2024, included in Short-term debt was $70 million borrowed against the line of credit with an interest rate of 5.18 percent and 6.17 percent, respectively. Also included in Short-term debt as of September 30, 2025, and September 30, 2024, was $14 million and $42 million, respectively, of interest-bearing loans from Schlumberger (SLB) to Sensia. In April 2025, $14 million of new interest-bearing loans from SLB to Sensia were entered into, and in October 2025, these loans were extended to January 15, 2026. The loans outstanding as of September 30, 2024, were extended to October 15, 2026, and are included in Long-term debt as of September 30, 2025.\n32\nTable of Contents\nWe repurchased approximately 1.5 million shares of our common stock under our share repurchase program in 2025 at a total cost of $419 million and an average cost of $279.43 per share. In 2024, we repurchased approximately 2.2 million shares of our common stock under our share repurchase program at a total cost of $594 million and an average cost of $272.97 per share. At September 30, 2025, there were $1 million of outstanding common stock share repurchases recorded in Accounts payable that do not settle until 2026. At September 30, 2024, there was no significant outstanding common stock share repurchases recorded in Accounts payable that did not settle until 2025. Our decision to repurchase shares in 2026 will depend on business conditions, free cash flow generation, other cash requirements, and stock price. At September 30, 2025, we had approximately $927 million remaining for share repurchases under our existing board authorizations. See Item 5. \nMarket for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\n, for additional information regarding share repurchases.\nWe expect future uses of cash to include working capital requirements, capital expenditures, dividends to shareowners, repurchases of common stock, repayments of debt, additional contributions to our retirement plans, and acquisitions of businesses and other inorganic investments. We expect capital expenditures in 2026 to be approximately $270 million. Significant long-term uses of cash include the following (in millions):\n \nPayments by Period\n \nTotal\n2026\n2027\n2028\n2029\n2030\nThereafter\nLong-term debt and interest \n(1)\n4,712 \n$\n102 \n$\n102 \n$\n344 \n$\n503 \n$\n71 \n$\n3,590 \nMinimum lease payments (Note 19)\n479 \n112 \n96 \n76 \n53 \n40 \n102 \nPostretirement benefits \n(2)\n41 \n6 \n6 \n5 \n5 \n4 \n15 \nPension funding contribution \n(3)\n23 \n23 \n— \n— \n— \n— \n— \nNet legacy asbestos liabilities \n(4)\n151 \n12 \n15 \n13 \n12 \n10 \n89 \nTransition tax \n(5)\n97 \n97 \n— \n— \n— \n— \n— \nTotal\n$\n5,503 \n$\n352 \n$\n219 \n$\n438 \n$\n573 \n$\n125 \n$\n3,796 \n(1) \nThe amounts for Long-term debt assume that the respective debt instruments will be outstanding until their scheduled maturity dates and include interest but exclude unamortized discount. See Note 7 in the Consolidated Financial Statements for more information regarding our Long-term debt.\n(2) \nOur postretirement benefit plans are unfunded and are subject to change. Amounts reported are estimates of future benefit payments, to the extent estimable.\n(3) \nAmounts reported for pension funding contributions reflect current estimates. Contributions to our pension plans beyond 2026 will depend on future investment performance of our pension plan assets, changes in discount rate assumptions, and governmental regulations in effect at the time. Amounts subsequent to 2026 are excluded from the summary above, as we are unable to make a reasonably reliable estimate of these amounts. The minimum contribution for our U.S. pension plan as required by the Employee Retirement Income Security Act (ERISA) is currently zero. We may make additional contributions to this plan at the discretion of management.\n(4)\n Amounts reflect current estimates of net annual payments to resolve claims and will vary based on settlement rates and values, changes in state and national laws, defense strategies, and insurance recoveries.\n(5) \nUnder the Tax Act, the Company elected to pay the transition tax interest-free over eight years, with 8% paid in each of the first five years, 15% in year six, 20% in year seven, and 25% in year eight.\nWe expect to fund future uses of cash with a combination of existing cash balances, cash generated by operating activities, commercial paper borrowings, or new issuances of debt or other securities. In addition, we have access to unsecured credit facilities with various banks. \nAt September 30, 2025, the majority of our Cash and cash equivalents were held by non-U.S. subsidiaries. We use a global cash pooling arrangement to efficiently manage liquidity among our entities. As a result of the broad changes to the U.S. international tax system under the Tax Act, the Company accounts for taxes on earnings of substantially all of its non-U.S. subsidiaries including both non-U.S. and U.S. taxes. The Company has concluded that earnings of a limited number of its non-U.S. subsidiaries are indefinitely reinvested. \n33\nTable of Contents\nIn May 2025, we entered into a $500 million senior unsecured 364-day term loan credit agreement and were advanced the full loan amount. In August and September 2025, we repaid the loan amount. The credit agreement remains available until May 2026. This agreement was in addition to our existing $1.5 billion unsecured revolving credit facility expiring in June 2027, which remains outstanding and undrawn as of September 30, 2025. Both the credit facility and credit agreement use the secured overnight funding rate (SOFR) as the primary basis for determining interest payments. We can increase the aggregate amount of our credit facility by up to $750 million, subject to the consent of the banks in the credit facility. We did not borrow against the credit facility during the periods ended September 30, 2025, or September 30, 2024. The term loan agreement contains covenants similar to those under our credit facility, in which we agree to maintain an EBITDA-to-interest ratio of at least 3.0 to 1.0. The EBITDA-to-interest ratio is defined in the credit facility as the ratio of consolidated EBITDA for the preceding four quarters to consolidated interest expense for the same period. We were in compliance with all covenants under our credit agreement and credit facilities at September 30, 2025, and September 30, 2024.\nAmong other uses, we can draw on our credit facility as a standby liquidity facility to repay our outstanding commercial paper as it matures. This access to funds to repay maturing commercial paper is an important factor in maintaining the short-term credit ratings set forth in the table below. Under our current policy with respect to these ratings, we expect to limit our other borrowings under our credit facility, if any, to amounts that would leave enough credit available under the facility so that we could borrow, if needed, to repay all of our then outstanding commercial paper as it matures.\nSeparate short-term unsecured credit facilities of approximately $275 million at September 30, 2025, were available to non-U.S. subsidiaries, of which approximately $34 million was committed under letters of credit. Borrowings under our non-U.S. credit facilities at September 30, 2025 and 2024, were not significant. There are no significant commitment fees or compensating balance requirements under our credit facilities. \nThe following is a summary of our credit ratings as of November 12, 2025:\nCredit Rating Agency\nShort Term Rating\nLong Term Rating\nOutlook\nStandard & Poor’s\nA-2\nA-\nStable\nMoody’s\nP-2\nA3\nStable\nFitch Ratings\nF1\nA\nStable\nOur ability to access the commercial paper market, and the related costs of these borrowings, is affected by the strength of our credit ratings and market conditions. We have not experienced any difficulty in accessing the commercial paper market. If our access to the commercial paper market is adversely affected due to a change in market conditions or otherwise, we would expect to rely on a combination of available cash and our unsecured committed credit facility to provide short-term funding. In such event, the cost of borrowings under our unsecured committed credit facility could be higher than the cost of commercial paper borrowings.\nWe regularly monitor the third-party depository institutions that hold our cash and cash equivalents and short-term investments. We diversify our cash and cash equivalents and short-term investments among counterparties to minimize exposure to any one of these entities.\nWe use foreign currency forward exchange contracts to manage certain foreign currency risks. We enter into these contracts to hedge our exposure to foreign currency exchange rate variability in the expected future cash flows associated with certain third-party and intercompany transactions denominated in foreign currencies forecasted to occur within the next two years. We also may use these contracts to hedge portions of our net investments in certain non-U.S. subsidiaries against the effect of exchange rate fluctuations on the translation of foreign currency balances to the U.S. dollar. In 2025 we entered into cross-currency swaps that we designated as a partial hedge of our net investment in certain Euro, Swiss franc, and Chinese yuan functional currency denominated subsidiaries. There were no net investment hedges as of September 30, 2024. In addition, we use foreign currency forward exchange contracts that are not designated as hedges to offset transaction gains or losses associated with some of our assets and liabilities resulting from intercompany loans or other transactions with third parties that are denominated in currencies other than our entities’ functional currencies. Our foreign currency forward exchange contracts are denominated in currencies of major industrial countries. We diversify our foreign currency forward exchange contracts among counterparties to minimize exposure to any one of these entities.\n34\nTable of Contents\nCash dividends declared to shareowners were $593 million in 2025 ($5.24 per common share), $573 million in 2024 ($5.00 per common share), and $544 million in 2023 ($4.72 per common share). Our quarterly dividend rate as of September 30, 2025, is $1.31 per common share ($5.24 per common share annually), which is determined at the sole discretion of our Board of Directors.\nSupplemental Sales Information\nWe translate sales of subsidiaries operating outside of the United States using exchange rates effective during the respective period. Therefore, changes in currency exchange rates affect our reported sales. Sales by acquired businesses also affect our reported sales. We believe that organic sales, defined as sales excluding the effects of acquisitions and changes in currency exchange rates, which is a non-GAAP financial measure, provides useful information to investors because it reflects regional and operating segment performance from the activities of our businesses without the effect of acquisitions and changes in currency exchange rates. We use organic sales as one measure to monitor and evaluate our regional and operating segment performance. When we acquire businesses, we exclude sales in the current period for which there are no comparable sales in the prior period. We determine the effect of changes in currency exchange rates by translating the respective period’s sales using the same currency exchange rates that were in effect during the prior year. When we divest a business, we exclude sales in the prior period for which there are no comparable sales in the current period. Organic sales growth is calculated by comparing organic sales to reported sales in the prior year, excluding divestitures. We attribute sales to the geographic regions based on the country of destination.\nThe following is a reconciliation of reported sales to organic sales by geographic region (in millions):\n \nYear Ended September 30, 2025\nYear Ended September 30, 2024\nReported Sales\nLess: Effect of\nAcquisitions\nEffect of\nChanges in\nCurrency\nOrganic\nSales\nReported Sales\nNorth America\n$\n5,270 \n$\n2 \n$\n(12)\n$\n5,280 \n$\n5,053 \nEurope, Middle East and Africa\n1,488 \n— \n29 \n1,459 \n1,504 \nAsia Pacific\n1,024 \n— \n(8)\n1,032 \n1,073 \nLatin America\n560 \n— \n(38)\n598 \n634 \nTotal Company Sales\n$\n8,342 \n$\n2 \n$\n(29)\n$\n8,369 \n$\n8,264 \n \nYear Ended September 30, 2024\nYear Ended September 30, 2023\nReported Sales\nLess: Effect of\nAcquisitions\nEffect of\nChanges in\nCurrency\nOrganic\nSales\nReported Sales\nNorth America\n$\n5,053 \n$\n82 \n$\n(4)\n$\n4,975 \n$\n5,224 \nEurope, Middle East and Africa\n1,504 \n9 \n21 \n1,474 \n1,871 \nAsia Pacific\n1,073 \n5 \n(18)\n1,086 \n1,358 \nLatin America\n634 \n— \n5 \n629 \n605 \nTotal Company Sales\n$\n8,264 \n$\n96 \n$\n4 \n$\n8,164 \n$\n9,058 \n35\nTable of Contents\nThe following is a reconciliation of reported sales to organic sales by operating segment (in millions):\n \nYear Ended September 30, 2025\nYear Ended September 30, 2024\nReported Sales\nLess: Effect of\nAcquisitions\nEffect of\nChanges in\nCurrency\nOrganic\nSales\nReported Sales\nIntelligent Devices\n$\n3,756 \n$\n— \n$\n(16)\n$\n3,772 \n$\n3,804 \nSoftware & Control\n2,383 \n— \n(9)\n2,392 \n2,187 \nLifecycle Services\n2,203 \n2 \n(4)\n2,205 \n2,273 \nTotal Company Sales\n$\n8,342 \n$\n2 \n$\n(29)\n$\n8,369 \n$\n8,264 \n \nYear Ended September 30, 2024\nYear Ended September 30, 2023\nReported Sales\nLess: Effect of\nAcquisitions\nEffect of\nChanges in\nCurrency\nOrganic\nSales\nReported Sales\nIntelligent Devices\n$\n3,804 \n$\n69 \n$\n3 \n$\n3,732 \n$\n4,098 \nSoftware & Control\n2,187 \n— \n2 \n2,185 \n2,886 \nLifecycle Services\n2,273 \n27 \n(1)\n2,247 \n2,074 \nTotal Company Sales\n$\n8,264 \n$\n96 \n$\n4 \n$\n8,164 \n$\n9,058 \n36\nTable of Contents\nCritical Accounting Estimates\nWe believe the following accounting estimates are the most critical to the understanding of our financial statements as they could have the most significant effect on our reported results and require subjective or complex judgments by management. Accounting principles generally accepted in the United States require us to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the consolidated financial statements and revenues and expenses during the periods reported. These estimates are based on our best judgment about current and future conditions, but actual results could differ from those estimates. Refer to Note 1 in the Consolidated Financial Statements for information regarding our significant accounting policies.\nGoodwill and Intangibles Valuation - Sensia Reporting Unit\nWe monitor adverse events, conditions or changes in circumstances that would indicate impairment of intangible assets that are subject to amortization. When such events, conditions or changes in circumstances occur, we assess the recoverability of the assets by comparing the undiscounted future cash flows attributable to the intangible assets to their carrying amount. If the undiscounted future cash flows are less than the carrying amount, an impairment charge based on the excess of the carrying amount over the fair value of the assets, is recorded.\nAs a result of the historical financial performance of the Sensia joint venture not achieving expectations, during the fourth quarter of fiscal 2025, a strategic review by the partners resulted in a decision to pursue an orderly dissolution. This decision to dissolve resulted in downward revisions to growth and profitability projections. The decision by the joint partners to pursue dissolution of the joint venture is a triggering event for impairment testing. For the Sensia reporting unit identifiable intangible assets subject to amortization within the Lifecycle Services operating segment, we believed these changes that occurred during the fourth quarter of 2025 would indicate a potential impairment. The estimated undiscounted future cash flows attributable to the reporting unit were less than the carrying value; therefore, we determined the fair value for Sensia identifiable intangible assets as of September 30, 2025. We engaged an independent third-party valuation specialist to assist with the fair value determination of the identifiable intangible assets, primarily customer relationships, using a multi-period excess earnings model. We compared the fair value of $58 million to the carrying value, which resulted in a pre-tax, non-cash intangible asset impairment charge of $63 million during the fourth quarter of fiscal 2025. Subsequent to the impairment, our consolidated intangible asset balance as of September 30, 2025, is $864 million, including $58 million of identifiable intangible assets within the Sensia reporting unit.\nFollowing the intangible asset impairment analysis, we estimated the fair value of the Sensia reporting unit using an income approach derived from discounted cash flows. As of September 30, 2025, the carrying value of the Sensia reporting unit, after consideration of the fourth quarter intangible asset impairment, was determined to be in excess of the reporting unit’s fair value, resulting in a $161 million pre-tax, non-cash goodwill impairment charge recorded in the Consolidated Statement of Operations. Subsequent to the impairment, our consolidated goodwill balance as of September 30, 2025, is $3,839 million and there is no remaining goodwill within the Sensia reporting unit.\nCritical assumptions used in this approach included estimated future revenue growth rates and Earnings Before Interest, Taxes, Depreciation, and Amortization (“EBITDA”) margins, and a discount rate. Estimated future revenue and EBITDA margins are based on our best estimate about current and future conditions. The forecasted near-term growth rate projections take into account recent revenue performance and the order backlog. Margin assumptions reflect volume, mix, productivity and price estimates. These estimates and assumptions are based on a number of factors, including historical experience, reference to external product available market and industry growth publications, and analysis of peer group projections. Actual results and forecasts of revenue growth and margins for the Sensia reporting unit may be impacted by its concentration within the Oil & Gas industry and with its customer base. Demand for Sensia hardware and software products, solutions, and services is sensitive to industry volatility and risks, including those related to commodity prices, supply and demand dynamics, production costs, geological activity, and political activities. We determined the discount rate using a weighted average cost of capital adjusted for risk factors.\nSubsequent to September 30, 2025, and prior to the issuance of these financial statements, the joint venture parents have signed a term sheet that details the distribution of assets and related terms and conditions for the dissolution. As a result, the assets and liabilities to be distributed have met the requirements as held for sale and will be reported as such in our first fiscal quarter. The transaction is expected to close in the first half of fiscal 2026 subject to customary closing conditions.\nWe performed our annual quantitative impairment test for the Sensia reporting unit during the second quarter of fiscal 2025 and concluded that the goodwill balance within the reporting unit of $161 million was not impaired. \n37\nTable of Contents\nMore information regarding goodwill impairment testing is contained in Note 1 and Note 3 in the Consolidated Financial Statements.\nRetirement Benefits - Pension\nPension costs and obligations are actuarially determined and are influenced by assumptions used to estimate these amounts, including the discount rate. Changes in any of the assumptions and the amortization of differences between the assumptions and actual experience will affect the amount of pension expense in future periods.\nOur global pension expense was $38 million, $13 million and $122 million in 2025, 2024, and 2023, respectively. Global pension expense in 2023 included $123 million of settlement charges. Approximately all of our 2025 global pension expense and 69 percent of our global projected benefit obligation relate to our U.S. pension plan. The discount rate used to determine our 2025 U.S. pension expense was 5.10 percent, compared to 6.10 percent for 2024.\nFor 2026, our U.S. discount rate will increase to 5.35 percent from 5.10 percent in 2025. The discount rate was set as of our September 30 measurement date and was determined by modeling a portfolio of bonds that match the expected cash flow of our benefit plans.\nThe changes in our discount rate have an inverse relationship with our net periodic benefit cost and projected benefit obligation. The following chart illustrates the estimated change in projected benefit obligation and annual net periodic benefit cost assuming a change of 25 basis points in the discount rate for our U.S. pension plans (in millions):\n \nPension Benefits\nChange in\nProjected Benefit\nObligation\nChange in Net Periodic Benefit Cost \n(1)\nDiscount rate\n$\n56 \n$\n6 \n(1)\n Change includes both operating and non-operating pension costs.\nMore information regarding pension benefits is contained in Note 14 in the Consolidated Financial Statements.\nRevenue Recognition -\n \nCustomer Incentives\nWe offer various incentive programs that provide distributors and direct sale customers with cash rebates, account credits, or additional hardware and software products, solutions, and services based on meeting specified program criteria. Customer incentives are recognized as a reduction of sales if distributed in cash or customer account credits. We record accruals at the time of revenue recognition as a current liability within Customer returns, rebates, and incentives in our Consolidated Balance Sheet or, where a right of setoff exists, as a reduction of Receivables. Customer incentives for additional hardware and software products, solutions, and services to be provided are considered distinct performance obligations. As such, we allocate revenue to them based on relative standalone selling price. Until the incentive is redeemed, the revenue is recorded as a contract liability.\nOur primary incentive program provides distributors with cash rebates or account credits based on agreed amounts that vary depending on the customer to whom our distributor ultimately sells the product. A critical assumption used in estimating the accrual for this program is the time period from when revenue is recognized to when the rebate is processed. Our estimate is based primarily on historical experience. If the time period were to change by 10 percent, the effect would be an adjustment to the accrual of approximately $24 million.\nMore information regarding our revenue recognition and returns, rebates, and incentives policies are contained in Note 1 and Note 2 in the Consolidated Financial Statements.\nLegacy Asbestos-related Matters\nWe (including our subsidiaries) have been named as a defendant in lawsuits alleging personal injury as a result of exposure to asbestos that was used in certain components of our products many years ago, including products from divested businesses for which we have agreed to defend and indemnify claims. Additionally, we have maintained insurance coverage that includes indemnity and defense costs, over and above self-insured retentions, for many of these claims. See Notes 1 and 17 in the Consolidated Financial Statements for more information.\n38\nTable of Contents\nWe accrue for net legacy asbestos-related matters based upon an assessment of the ultimate liability for claims incurred, whether filed or not, including estimates of both future claim resolution costs and defense costs. We utilize historical claim and defense costs trends as well as a third-party actuarial valuation in determining estimated reserves and related insurance recoveries which we believe are probable and reasonably estimable through a 2060 terminal year. Accruals total $441 million at September 30, 2025, and are included in the Consolidated Balance Sheet in Other current liabilities and Other liabilities, with insurance recoveries related to these matters of $290 million recorded in Receivables and Other assets.\nThe valuation of the accrual is based on several critical assumptions, including projections of future claims, dismissal rates, average settlement values, inflation rates, and the ratio of defense costs to indemnity payments. We typically rely on a five-year historical average for dismissal rates, settlement values, and defense-to-indemnity ratios, adjusted to exclude outlier data and informed by input from national counsel regarding the current docket and jurisdictional trends. Future claims estimates are developed using actuarial models grounded in widely accepted industry studies, and inflation assumptions are aligned with long-term, broadly recognized economic indicators. The aggregate impact of these assumptions reflects estimated payments for approximately 12,130 claims and projected dismissals of approximately 24,340 claims through the 2060 terminal year.\nAcquisitions - Clearpath Intangible Assets Valuation\nWe account for business acquisitions by allocating the purchase price to tangible and intangible assets acquired and liabilities assumed at their fair values; the excess of the purchase price over the allocated amount is recorded as goodwill. We engaged an independent third-party valuation specialist to assist with the fair value allocation of the intangible assets assumed through the Clearpath Robotics, Inc. acquisition including its industrial division OTTO Motors (Clearpath). The intangible assets were valued using income approaches, specifically the relief from royalty method and multi-period excess earnings method. This required the use of several assumptions and estimates including forecasted revenue growth rates, margin, and cash flows attributable to existing customers, obsolescence factor, royalty rate, contributory asset charges, customer attrition rate, and discount rates. Although we believe the assumptions and estimates made were reasonable and appropriate, these estimates require judgment and are based in part on historical experience and information obtained from Clearpath management. \nThe key assumption requiring the use of judgement in the valuation of the $\n270\n million technology asset was the obsolescence factor. The obsolescence factor of 12 years was calculated based on the depletion of existing technology using a variety of factors including research and development spend toward new product development and scheduled patent expiration. A two-year change in this assumption would result in a change of approximately $82 million in intangible assets. The key assumption requiring the use of judgement in the valuation of the $\n41\n million trademark intangible asset was the weighted average royalty rate of 2.05 percent. This rate was based on royalty market data. A 100 basis point change in the royalty rate would result in a change of $20 million in intangible assets.\nMore information regarding this business combination is contained in Note 4 in the Consolidated Financial Statements.\nRecent Accounting Pronouncements\nSee Note 1 in the Consolidated Financial Statements regarding recent accounting pronouncements.\n39\nTable of Contents",
  "item2": null
}