{
  "source_file": "rok-20250630.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\nResults of Operations\nForward-Looking Statements\nThis Quarterly Report on Form 10-Q contains statements (including certain projections and business trends) that are “forward-looking statements” as defined in the Private Securities Litigation Reform Act of 1995. Words such as “believe”, “estimate”, “project”, “plan”, “expect”, “anticipate”, “will”, “intend”, and other similar expressions may identify forward-looking statements. Actual results may differ materially from those projected as a result of certain risks and uncertainties, many of which are beyond our control, including but not limited to:\n•\nmacroeconomic factors, including inflation, global and regional business conditions (including adverse impacts in certain markets, such as Oil & Gas), commodity prices, currency exchange rates, the cyclical nature of our customers’ capital spending, and sovereign debt concerns;\n•\nlaws, regulations, and governmental policies affecting our activities in the countries where we do business, including those related to tariffs, taxation, trade controls, cybersecurity, and climate change;\n•\nour profitability and market competitiveness may be adversely impacted by changes in trade policies, including tariffs or other factors; \n•\nthe severity and duration of disruptions to our business due to natural disasters (including those as a result of climate change), pandemics, acts of war, strikes, terrorism, social unrest, or other causes;\n•\nthe availability and price of components and materials; \n•\nthe availability, effectiveness, and security of our information technology systems; \n•\nour ability to manage and mitigate the risk related to security vulnerabilities and breaches of our hardware and software products, solutions, and services;\n•\nthe successful execution of our cost productivity and margin expansion initiatives;\n•\nour ability to attract, develop, and retain qualified employees; \n•\nthe successful integration and management of strategic transactions and achievement of the expected benefits of these transactions; \n•\nthe successful development of advanced technologies and demand for and market acceptance of new and existing hardware and software products; \n•\nour ability to manage and mitigate the risks associated with our solutions and services businesses;\n•\ncompetitive hardware and software products, solutions, and services, pricing pressures, and our ability to provide high quality products, solutions, and services;\n•\nthe availability and cost of capital;\n•\ndisruptions to our distribution channels or the failure of distributors to develop and maintain capabilities to sell our products; \n•\nintellectual property infringement claims by others and the ability to protect our intellectual property; \n•\nthe uncertainty of claims by taxing authorities in the various jurisdictions where we do business; \n•\nthe uncertainties of litigation, including liabilities related to the safety and security of the hardware and software products, solutions, and services we sell; \n•\nour ability to manage costs related to employee retirement and health care benefits; and\n•\nother risks and uncertainties, including but not limited to those detailed from time to time in our Securities and Exchange Commission (SEC) filings. \nThese forward-looking statements reflect our beliefs as of the date of filing this report. We undertake no obligation to update or revise any forward-looking statement, whether as a result of new information, future events, or otherwise. See Item 1A. \nRisk Factors\n, of our Annual Report on Form 10-K for the year ended September 30, 2024, and Item 1A. \nRisk Factors\n, of this Quarterly Report on Form 10-Q for more information.\n27\nTable of Contents\nNon-GAAP Measures\nThe following discussion includes organic sales, total segment operating earnings and margin, Adjusted Income, Adjusted EPS, Adjusted Effective Tax Rate, and free cash flow, which are non-GAAP measures. See \nSupplemental Sales Information\n for a reconciliation of reported sales to organic sales and a discussion of why we believe this non-GAAP measure is useful to investors. See \nSummary of Results of O\nperations\n for a reconciliation o\nf Income before income taxes to total segment operating earnings and margin and a discussion of why we believe these non-\nGAAP measures are useful to investors. See \nAdjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate Reconciliation\n for a reconciliation of Net income attributable to Rockwell Automation, \ndiluted EPS, and effective tax rate to Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate, respectively, and a discussion of why we believe these non-\nGAAP measures are useful to investors. See \nFinancial Condition\n for a reconciliation of \nCash provided by operating activities\n to free cash flow and a disc\nussion of why we believe this non-GAAP measure is useful to investors.\nOverview\nRockwell Automation, Inc. is the world’s largest company dedicated to industrial automation and digital transformation. Overall demand for our hardware and software products, solutions, and services is driven by:\n \n•\ninvestments in manufacturing, including new facilities or production lines, upgrades, modifications and expansions of existing facilities or production lines;\n•\ninvestments in basic materials production capacity, which may be related to commodity pricing levels;\n•\nour customers’ needs for faster time to market, agility to address evolving consumer preferences, operational productivity, asset management and reliability, and business resilience, including security and enterprise risk management;\n•\nour customers’ needs to continuously improve quality, safety, and sustainability;\n•\nindustry factors that include our customers’ new product introductions, demand for our customers’ products or services, and the regulatory and competitive environments in which our customers operate;\n•\nlevels of global industrial production and capacity utilization;\n•\nregional factors that include local political, social, regulatory, and economic circumstances; and\n•\nthe spending patterns of our customers due to their annual budgeting processes and their working schedules.\nLong-term Strategy\nAs the world’s largest company dedicated to industrial automation and digital transformation, our strategy is to bring the Connected Enterprise\n®\n to life. We understand and simplify our customers’ complex production challenges and deliver the most valued solutions that combine technology and industry expertise. As a result, we make our customers more resilient, agile, and sustainable, creating more ways to win. We deliver value by helping our customers optimize production, build resilience, empower people, become more sustainable, and accelerate transformation. \nRockwell Automation stands at the intersection of the technological and societal trends that are shaping the future of industrial operations. We see converging megatrends including digitization and artificial intelligence, energy transition and sustainability, shifting demographics, and an increased need for resiliency. \nOur long-term profitable growth framework outlines how we will deliver accelerated growth while we continue to transform our company to meet stakeholder expectations over the longer term:\n•\nachieve faster secular growth in traditional markets due to customer needs for resiliency (including cybersecurity), agility, sustainability, and mitigating impacts of labor shortages;\n•\ngrow share and create new ways to win through technology differentiation, industry focus, go to market acceleration, expanded offerings and new markets;\n•\ncontinue double-digit growth in annual recurring revenue;\n•\nadd 1% average annual growth from acquisitions; and\n•\ndeliver profitable growth within a disciplined financial framework. \n28\nTable of Contents\nU.S. Economic Trends\nIn the third quarter of 2025, sales in the U.S. accounted for over half of our total sales. The various indicators we use to gauge the direction and momentum of our served U.S. markets include:\n•\nThe Industrial Production (IP) Index, published by the Federal Reserve, which measures the real output of manufacturing, mining, and electric and gas utilities. The Manufacturing IP Index shown in the chart below is expressed as a percentage of real output in a base year, currently 2017. \n•\nThe Manufacturing Purchasing Managers’ Index (PMI), published by the Institute for Supply Management (ISM), which indicates the current and near-term state of manufacturing activity in the U.S. According to the ISM, a PMI measure above 50 indicates that the U.S. manufacturing economy is generally expanding while a measure below 50 indicates that it is generally contracting.\nThe table below depicts trends in these indicators since the quarter ended September 2023. These figures are as of August 6, 2025, and are subject to revision by the issuing organizations. The IP index did not significantly change from the second quarter of fiscal 2025. Manufacturing PMI results remained below 50 for each of the months in the third quarter of fiscal 2025.\nManufacturing IP Index\nPMI\nFiscal 2025 quarter ended:\nJune 2025\n100.2\n49.0\nMarch 2025\n100.3\n49.0\nDecember 2024\n98.9\n49.2\nFiscal 2024 quarter ended:\nSeptember 2024\n99.0\n47.5\nJune 2024\n99.4\n48.5\nMarch 2024\n99.5\n50.3\nDecember 2023\n99.2\n47.1\nFiscal 2023 quarter ended:\nSeptember 2023\n99.6\n49.0\nInflation in the U.S. has also had an impact on our input costs and pricing. The Producer Price Index (PPI), published by the Bureau of Labor Statistics, measures the average change over time in the selling prices received by domestic producers for their output. PPI growth has remained in the low single digits during the third quarter, which is consistent with the prior six quarters. Producer prices continue to remain elevated, however, year over year increases remain decelerated from the surges in 2023 and 2022.\nNon-U.S. Economic Trends\nIn the third quarter of 2025, sales to customers outside the U.S. accounted for less than half of our total sales. These customers include both indigenous companies and multinational companies with a global presence. In addition to the global factors previously mentioned in the \nOverview\n section, international demand, particularly in emerging markets, has historically been driven by the strength of the industrial economy in each region, investments in infrastructure, and expanding consumer markets. We use changes in key countries' gross domestic product (GDP), IP, and PMI as indicators of the growth opportunities in each region where we do business. Industrial production outside the U.S. was mostly positive in the third quarter of fiscal 2025. Manufacturing PMI readings outside the U.S were mixed with readings in Asia Pacific generally better than readings in Europe, Canada, Mexico, and Brazil.\nOutlook\nWe expect over $250 million of year-over-year benefits from cost reduction and margin expansion actions in 2025 including continuing benefits from restructuring actions we initiated last year and benefits from reduced costs of direct and indirect purchases, increased manufacturing efficiency, and price actions.\nWe continue to manage the impact of tariffs through actions including pricing and the use of alternative sources of materials and redundant manufacturing locations. Resiliency actions we took in recent years enable us to build certain high value product lines in more than one geographic location. In consideration of these mitigating actions, tariff costs are expected to be neutral to EPS in the current year.\n29\nTable of Contents\nSummary of Results of Operations\nThe following table reflects our sales and operating results (in millions, except per share amounts and percentages):\n \nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n \n2025\n2024\n2025\n2024\nSales\nIntelligent Devices (a)\n$\n968 \n$\n957 \n$\n2,670 \n$\n2,858 \nSoftware & Control (b)\n629 \n513 \n1,726 \n1,686 \nLifecycle Services (c)\n547 \n581 \n1,630 \n1,685 \nTotal sales (d)\n$\n2,144 \n$\n2,051 \n$\n6,026 \n$\n6,229 \nSegment operating earnings \n(1)\nIntelligent Devices (e)\n$\n182 \n$\n193 \n$\n461 \n$\n504 \nSoftware & Control (f)\n199 \n121 \n503 \n418 \nLifecycle Services (g)\n73 \n112 \n219 \n264 \nTotal segment operating earnings \n(2)\n (h)\n454 \n426 \n1,183 \n1,186 \nPurchase accounting depreciation and amortization\n(35)\n(35)\n(106)\n(108)\nCorporate and other\n(40)\n(29)\n(111)\n(97)\nNon-operating pension and postretirement benefit credit\n— \n4 \n— \n14 \nChange in fair value of investments\n— \n(5)\n(3)\n1 \nRestructuring charges\n— \n(70)\n— \n(70)\nInterest expense, net\n(37)\n(36)\n(109)\n(101)\nIncome before income taxes (i)\n342 \n255 \n854 \n825 \nIncome tax provision\n(49)\n(24)\n(135)\n(116)\nNet income\n293 \n231 \n719 \n709 \nNet loss attributable to noncontrolling interests\n(2)\n(1)\n(12)\n(4)\nNet income attributable to Rockwell Automation\n$\n295 \n$\n232 \n$\n731 \n$\n713 \nDiluted EPS\n$\n2.60 \n$\n2.02 \n$\n6.43 \n$\n6.19 \nAdjusted EPS \n(3)\n$\n2.82 \n$\n2.71 \n$\n7.11 \n$\n7.25 \nDiluted weighted average outstanding shares\n113.0 \n114.2 \n113.2 \n114.7 \nPre-tax margin (i/d)\n16.0 \n%\n12.4 \n%\n14.2 \n%\n13.2 \n%\nIntelligent Devices segment operating margin (e/a)\n18.8 \n%\n20.2 \n%\n17.3 \n%\n17.6 \n%\nSoftware & Control segment operating margin (f/b)\n31.6 \n%\n23.6 \n%\n29.1 \n%\n24.8 \n%\nLifecycle Services segment operating margin (g/c)\n13.3 \n%\n19.3 \n%\n13.4 \n%\n15.7 \n%\nTotal segment operating margin \n(2)\n (h/d)\n21.2 \n%\n20.8 \n%\n19.6 \n%\n19.0 \n%\n(1) \nSee Note 16 in the Consolidated Financial Statements for the definition of segment operating earnings.\n(2) \nTotal segment operating earnings and total segment operating margin are non-GAAP financial measures. We exclude purchase accounting depreciation and amortization, corporate and other, non-operating pension and postretirement benefit credit, change in fair value of investments, restructuring charges aligned with enterprise-wide strategic initiatives, and interest expense, net, because we do not consider these items to be directly related to the operating performance of our segments. We believe total segment operating earnings and total segment operating margin are useful to investors as measures of operating performance. We use these measures to monitor and evaluate the profitability of our operating segments. Our measures of total segment operating earnings and total segment operating margin may be different from measures used by other companies.\n(3) \nAdjusted EPS is a non-GAAP earnings measure. See \nAdjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate Reconciliation\n for more information on this non-GAAP measure.\n30\nTable of Contents\n Three and Nine Months Ended\n \nJune 30, 2025, Compared to Three and Nine Months Ended June 30, 2024\nSales\nSales increased 5 percent and decreased 3 percent year over year in the three and nine months ended June 30, 2025, respectively. Organic sales increased 4 percent and decreased 2 percent year over year in the three and nine months ended June 30, 2025, respectively. Currency translation increased sales by less than one 1 percent and decreased sales by 1 percent in the three and nine months ended June 30, 2025, respectively. Pricing increased total company sales by approximately 3 percentage points and 2 percentage points year over year in the three and nine months ended June 30, 2025, respectively, realized primarily in the Intelligent Devices and Software & Control segments. Volume increased total company sales by approximately 1 percentage point year over year in the three months ended June 30, 2025, driven by the Software & Control segment. Volume decreased total company sales by approximately 5 percentage points year over year in the nine months ended June 30, 2025, driven by the Intelligent Devices segment.\nThe tables below presents our sales, attributed to the geographic regions based upon country of destination, and the percentage change from the same period a year ago (in millions, except percentages):\nChange vs.\nChange in Organic \nSales \n(1)\n vs.\nThree Months Ended June 30, 2025\nThree Months Ended June 30, 2024\nThree Months Ended June 30, 2024\nNorth America\n$\n1,354 \n7 \n%\n7 \n%\nEurope, Middle East, and Africa\n392 \n10 \n%\n5 \n%\nAsia Pacific\n266 \n2 \n%\n2 \n%\nLatin America\n132 \n(21)\n%\n(14)\n%\nTotal Company Sales\n$\n2,144 \n5 \n%\n4 \n%\nChange vs.\nChange in Organic \nSales \n(1)\n vs.\nNine Months Ended June 30, 2025\nNine Months Ended June 30, 2024\nNine Months Ended June 30, 2024\nNorth America\n$\n3,792 \n— \n%\n— \n%\nEurope, Middle East, and Africa\n1,082 \n(5)\n%\n(6)\n%\nAsia Pacific\n744 \n(8)\n%\n(7)\n%\nLatin America\n408 \n(13)\n%\n(4)\n%\nTotal Company Sales\n$\n6,026 \n(3)\n%\n(2)\n%\n(1) \nOrganic sales and organic sales growth exclude the effect of acquisitions, changes in currency exchange rates, and divestitures. See \nSupplemental Sales Information\n for information on these non-GAAP measures.\nCorporate and Other \nCorporate and other expenses were $40 million and $111 million in the three and nine months ended June 30, 2025, respectively, compared to $29 million and $97 million in the three and nine months ended June 30, 2024, respectively. \nRestructuring Charges\nRestructuring charges were $70 million in the  three and nine months ended June 30, 2024, which relate to actions in conjunction with an enterprise-wide comprehensive program to optimize cost structure and expand margins. See Note 14 in the Consolidated Financial Statements for more information on our restructuring charges.\nIncome before Income Taxes\nIncome before income taxes was $342 million and $854 million in the three and nine months ended June 30, 2025, respectively, compared to $255 million and $825 million in the three and nine months ended June 30, 2024, respectively. The increase in the three and nine months ended June 30, 2025, was primarily due to restructuring charges taken in the prior year.\nTotal segment operating earnings increased 7 percent year over year in the three months ended June 30, 2025, primarily due to productivity, the positive impact of price realization, and favorable mix, partially offset by higher compensation and unfavorable currency. Total segment operating earnings decreased less than 1 percent year over year in the nine months ended June 30, 2025.\n31\nTable of Contents\nIncome Taxes\nThe effective tax rates for the three and nine months ended June 30, 2025, were 14.3 percent and 15.8 percent, respectively, compared to 9.4 percent and 14.1 percent for the three and nine months ended June 30, 2024, respectively. Our Adjusted Effective Tax Rates for the three and nine months ended June 30, 2025, were 15.2 percent and 16.6 percent, respectively, compared to 13.3 percent and 15.1 percent for the three and nine months ended June 30, 2024, respectively. The increase in both the effective tax rate and the Adjusted Effective Tax Rate was primarily due to lower discrete benefits in the current year.\nIn October 2021, the Organization for Economic Cooperation and Development (OECD) and G20 Finance Ministers reached an agreement, known as Base Erosion and Profit Shifting (BEPS) Pillar Two, that, among other things, ensures that income earned in each jurisdiction that qualifying multinational enterprises operate in is subject to a minimum corporate income tax rate of at least 15%. Discussions related to the formal implementation and enactment of this agreement, including within the tax law of each member jurisdiction including the United States, are ongoing. Certain countries have enacted the Pillar Two framework, including Singapore, which is expected to result in the greatest impact to the Company. Enactment of this regulation in its current form would generally apply to the Company beginning in fiscal year 2026, which could result in an increase in our effective tax rate of 2 to 3 percent as well as in the amount of global corporate income tax paid.\nIn addition to BEPS Pillar Two, other items could also affect our effective tax rate, many of which are outside of our control,\nincluding:\n•\nchanges in the valuation of our deferred tax assets and liabilities, and in deferred tax valuation allowances;\n•\nchanges in the relative proportions of revenue and income before taxes in the various jurisdictions in which we operate\n•\nthat have differing statutory tax rates;\n•\nchanging tax laws, regulations, rates and interpretations in multiple jurisdictions in which we operate;\n•\nchanges to the financial accounting rules for income taxes;\n•\nthe tax effects of acquisitions; and\n•\nthe resolution and timing of issues arising from tax audits.\nOn July 4, 2025, the OBBBA was enacted in the U.S. The OBBBA includes significant tax related provisions, such as the permanent extension of certain expiring provisions of the Tax Act, modifications to the international tax framework, and the restoration of favorable tax treatment for certain business provisions. We are currently assessing its impact on our consolidated financial statements and the applicable results of our evaluations will be reflected on the Company’s Form 10-K for the year ended September 30, 2025.\nDiluted EPS and Adjusted EPS\n2025 third quarter Net income attributable to Rockwell Automation was $295 million or $2.60 per share, compared to $232 million or $2.02 per share in the third quarter of 2024. 2025 third quarter Adjusted EPS was $2.82, up 4 percent compared to $2.71 in the third quarter of 2024.\nNet income attributable to Rockwell Automation was $731 million or $6.43 per share in the nine months ended June 30, 2025, compared to $713 million or $6.19 per share in the nine months ended June 30, 2024. Adjusted EPS was $7.11 in the nine months ended June 30, 2025, down 2 percent compared to $7.25 in the nine months ended June 30, 2024.\nIntelligent Devices\nSales\nIntelligent Devices reported and organic sales increased 1 percent year over year in the three months ended June 30, 2025. Sales decreased 7 percent year over year in the nine months ended June 30, 2025. Organic sales decreased 6 percent year over year in the nine months ended June 30, 2025. The effects of currency translation decreased sales by 1 percentage point year over year in the nine months ended June 30, 2025. For the three months ended June 30, 2025, reported sales increased in Europe, Middle East and Africa and Asia Pacific, were flat in North America, and decreased in Latin America. For the three months ended June 30, 2025, organic sales increased in North America and Europe, Middle East and Africa, were flat in Asia Pacific, and decreased in Latin America. For the nine months ended June 30, 2025, reported sales decreased in all regions. For the nine months ended June 30, 2025, organic sales decreased in all regions except Latin America. \nSegment Operating Margin\nIntelligent Devices segment operating earnings decreased 6 percent year over year in the three months ended June 30, 2025. Segment operating margin decreased to 18.8 percent in the three months ended June 30, 2025, from 20.2 percent in the same period a year ago, primarily due to higher compensation and unfavorable net currency, partially offset by productivity and the positive impact of price realization.\n32\nTable of Contents\nIntelligent Devices segment operating earnings decreased 9 percent year over year in the nine months ended June 30, 2025. Segment operating margin decreased to 17.3 percent in the nine months ended June 30, 2025, from 17.6 percent in the same period a year ago.\nSoftware & Control\nSales\nSoftware & Control sales increased 23 percent and 2 percent year over year in the three and nine months ended June 30, 2025, respectively. Organic sales increased 22 percent and 3 percent year over year in the three and nine months ended June 30, 2025, respectively. The effects of currency translation increased sales by 1 percentage point year over year in the three months ended June 30, 2025. The effects of currency translation decreased sales by 1 percentage point year over year in the nine months ended June 30, 2025. For the three months ended June 30, 2025, reported and organic sales increased in all regions except Latin America. For the nine months ended June 30, 2025, reported and organic sales decreased in all regions except for North America.\nSegment Operating Margin\nSoftware & Control segment operating earnings increased 64 percent year over year in the three months ended June 30, 2025. Segment operating margin increased to 31.6 percent in the three months ended June 30, 2025, from 23.6 percent in the same period a year ago, primarily due to higher sales volume, the positive impact of price realization, and productivity, partially offset by higher compensation.\nSoftware & Control segment operating earnings increased 20 percent year over year in the nine months ended June 30, 2025. Segment operating margin increased to 29.1 percent in the nine months ended June 30, 2025, from 24.8 percent in the same period a year ago, primarily due to productivity and the positive impact of price realization, partially offset by higher compensation.\nLifecycle Services\nSales\nLifecycle Services reported and organic sales decreased 6 percent and 3 percent year over year in the three and nine months ended June 30, 2025, respectively. For the three months ended June 30, 2025, reported sales decreased in all regions except Europe, Middle East, and Africa. For the three months ended June 30, 2025, organic sales decreased in all regions. For the nine months ended June 30, 2025, reported sales decreased in all regions. For the nine months ended June 30, 2025, organic sales decreased in all regions except North America.\nSegment Operating Margin\nLifecycle Services segment operating earnings decreased 35 percent and 17 percent year over year in the three and nine months ended June 30, 2025, respectively. Segment operating margin decreased to 13.3 percent and 13.4 percent in the three and nine months ended June 30, 2025, respectively, from 19.3 percent and 15.7 percent, respectively, in the same period a year ago, primarily due to higher compensation and lower sales volume, partially offset by productivity.\n33\nTable of Contents\nSupplemental Segment Information\nPurchase accounting depreciation and amortization, non-operating pension and postretirement benefit credit, and restructuring charges are not allocated to our operating segments because these costs are excluded from our measurement of each segment's operating performance for internal purposes. If we were to allocate these costs, we would attribute them to each of our segments as follows (in millions):\n \nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n \n2025\n2024\n2025\n2024\nPurchase accounting depreciation and amortization\nIntelligent Devices\n$\n9 \n$\n9 \n$\n28 \n$\n29 \nSoftware & Control\n16 \n17 \n49 \n51 \nLifecycle Services\n9 \n9 \n28 \n28 \nNon-operating pension and postretirement benefit credit\nIntelligent Devices\n$\n— \n$\n(2)\n$\n— \n$\n(6)\nSoftware & Control\n— \n(1)\n— \n(5)\nLifecycle Services\n— \n(2)\n(1)\n(7)\nRestructuring charges\nIntelligent Devices\n$\n— \n$\n32 \n$\n— \n$\n32 \nSoftware & Control\n— \n24 \n— \n24 \nLifecycle Services\n— \n13 \n— \n13 \n34\nTable of Contents\nAdjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate Reconciliation\nAdjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate are non-GAAP earnings measures that exclude non-operating pension and postretirement benefit credit, purchase accounting depreciation and amortization attributable to Rockwell Automation, change in fair value of investments, and restructuring charges aligned with enterprise-wide strategic initiatives, including their respective tax effects. Non-operating pension and postretirement benefit credit is defined as all components of our net periodic pension and postretirement benefit cost except for service cost. See Note 10 in the Consolidated Financial Statements for more information on our net periodic pension and postretirement benefit cost.\nWe believe that Adjusted Income, Adjusted EPS, and Adjusted Effective Tax rate provide useful information to our investors about our operating performance and allow management and investors to compare our operating performance period over period. Adjusted EPS is also used as a financial measure of performance for our annual incentive compensation. Our measures of Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate may be different from measures used by other companies. These non-GAAP measures should not be considered a substitute for Net Income attributable to Rockwell Automation, diluted EPS, and effective tax rate.\n \n35\nTable of Contents\nThe following are reconciliations of Net income attributable to Rockwell Automation, diluted EPS, and effective tax rate to Adjusted Income, Adjusted EPS, and Adjusted Effective Tax Rate, respectively (in millions, except per share amounts and percentages):\nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n2025\n2024\n2025\n2024\nNet income attributable to Rockwell Automation\n$\n295 \n$\n232 \n$\n731 \n$\n713 \nNon-operating pension and postretirement benefit credit\n— \n(4)\n— \n(14)\nTax effect of non-operating pension and postretirement benefit credit\n(1)\n1 \n(1)\n3 \nPurchase accounting depreciation and amortization attributable to Rockwell Automation\n33 \n33 \n98 \n100 \nTax effect of purchase accounting depreciation and amortization attributable to Rockwell Automation\n(7)\n(6)\n(22)\n(17)\nChange in fair value of investments\n— \n5 \n3 \n(1)\nTax effect of change in fair value of investments\n— \n(2)\n(1)\n(1)\nRestructuring charges \n(1)\n— \n70 \n— \n70 \nTax effect of restructuring charges\n (1)\n— \n(18)\n— \n(18)\nAdjusted Income\n$\n320 \n$\n311 \n$\n808 \n$\n835 \nDiluted EPS\n$\n2.60 \n$\n2.02 \n$\n6.43 \n$\n6.19 \nNon-operating pension and postretirement benefit credit\n— \n(0.04)\n— \n(0.13)\nTax effect of non-operating pension and postretirement benefit credit\n(0.01)\n0.01 \n(0.01)\n0.02 \nPurchase accounting depreciation and amortization attributable to Rockwell Automation\n0.29 \n0.28 \n0.86 \n0.87 \nTax effect of purchase accounting depreciation and amortization attributable to Rockwell Automation\n(0.06)\n(0.05)\n(0.19)\n(0.15)\nChange in fair value of investments\n— \n0.04 \n0.03 \n(0.01)\nTax effect of change in fair value of investments\n— \n(0.01)\n(0.01)\n— \nRestructuring charges \n(1)\n— \n0.61 \n— \n0.61 \nTax effect of restructuring charges\n (1)\n— \n(0.15)\n— \n(0.15)\nAdjusted EPS\n$\n2.82 \n$\n2.71 \n$\n7.11 \n$\n7.25 \nEffective tax rate\n14.3 \n%\n9.4 \n%\n15.8 \n%\n14.1 \n%\nTax effect of non-operating pension and postretirement benefit credit\n0.3 \n%\n(0.2)\n%\n0.1 \n%\n(0.1)\n%\nTax effect of purchase accounting depreciation and amortization attributable to Rockwell Automation\n0.6 \n%\n0.4 \n%\n0.6 \n%\n0.2 \n%\nTax effect of change in fair value of investments\n— \n%\n0.3 \n%\n0.1 \n%\n— \n%\nTax effect of restructuring charges \n(1)\n— \n%\n3.4 \n%\n— \n%\n0.9 \n%\nAdjusted Effective Tax Rate\n15.2 \n%\n13.3 \n%\n16.6 \n%\n15.1 \n%\n(1) \nRestructuring charges in the three and nine months ended June 30, 2024, include $65 million for severance benefits and $5 million for strategic advisory services related to the enterprise-wide severance actions.\n36\nTable of Contents\nFinancial Condition\nThe following is a summary of our cash flows from operating, investing, and financing activities, as reflected in the Consolidated Statement of Cash Flows (in millions):\n \nNine Months Ended\nJune 30,\n \n2025\n2024\nCash provided by (used for)\nOperating activities\n$\n1,090 \n$\n432 \nInvesting activities\n(165)\n(920)\nFinancing activities\n(904)\n(187)\nEffect of exchange rate changes on cash\n3 \n2 \nIncrease (decrease) in cash and cash equivalents\n$\n24 \n$\n(673)\nThe following table summarizes free cash flow, which is a non-GAAP financial measure (in millions):\n \nNine Months Ended\nJune 30,\n \n2025\n2024\nCash provided by operating activities\n$\n1,090 \n$\n432 \nCapital expenditures\n(137)\n(160)\nFree cash flow\n$\n953 \n$\n272 \nOur definition of free cash flow takes into consideration capital investments required to maintain the operations of our businesses and execute our strategy. Cash provided by operating activities adds back non-cash depreciation expense to earnings but does not reflect a charge for necessary capital expenditures. Our definition of free cash flow excludes the operating cash flows and capital expenditures related to our discontinued operations, if any. Operating, investing, and financing cash flows of our discontinued operations, if any, are presented separately in our Consolidated Statement of Cash Flows. In our opinion, free cash flow provides useful information to investors regarding our ability to generate cash from business operations that is available for acquisitions and other investments, service of debt principal, dividends, and share repurchases. We use free cash flow, as defined, as one measure to monitor and evaluate our performance, including as a financial measure for our annual incentive compensation. Our definition of free cash flow may be different from definitions used by other companies.\nCash provided by operating activities was $1,090 million for the nine months ended June 30, 2025, compared to $432 million for the nine months ended June 30, 2024. Free cash flow was $953 million for the nine months ended June 30, 2025, compared to $272 million for the nine months ended June 30, 2024. The year over year increases in cash provided by operating activities and free cash flow were primarily due to higher pre-tax income, no payout of incentive compensation in the first quarter of fiscal 2025 related to fiscal 2024 performance, and lower tax payments.\nOur Short-term debt as of June 30, 2025, included commercial paper borrowings of $260 million, with a weighted average interest rate of 4.51 percent, and a weighted average maturity period of 11 days. Our Short-term debt as of September 30, 2024, included commercial paper borrowings of $657 million, with a weighted average interest rate of 5.14 percent, and a weighted average maturity period of 24 days. In December 2022, Sensia entered into an unsecured $75 million line of credit. As of June 30, 2025, and September 30, 2024, included in Short-term debt was $70 million borrowed against the line of credit with an interest rate of 5.32 percent and 6.17 percent, respectively. Also included in Short-term debt as of June 30, 2025, and September 30, 2024, was $14 million and $42 million, respectively, of interest-bearing loans from Schlumberger (SLB) to Sensia. In April 2025, $14 million of new interest-bearing loans from SLB to Sensia were entered into and are due October 15, 2025. The loans outstanding as of September 30, 2024, were extended to October 15, 2026, and are included in Long-term debt as of June 30, 2025. \n37\nTable of Contents\nIn May 2025, we entered into a $500 million senior unsecured 364-day term loan credit agreement and were advanced the full loan amount. This agreement is in addition to our existing $1.5 billion unsecured revolving credit facility expiring in June 2027, which remains outstanding and undrawn. Borrowings under this term loan bear interest based on Secured Overnight Financing Rates (SOFR) in effect during the period the borrowings are outstanding, and the interest rate as of June 30, 2025, was 5.45 percent. The term loan agreement contains covenants similar to those under our $1.5 billion unsecured revolving credit facility, under which we agree to maintain an EBITDA-to-interest ratio of at least 3.0 to 1.0. The EBITDA-to-interest ratio is defined in the term loan agreement as the ratio of consolidated EBITDA (as defined in the term loan agreement) for the preceding four quarters to consolidated interest expense for the same period. We were in compliance with all covenants under our credit agreement and credit facilities at June 30, 2025, and September 30, 2024.\nWe repurchased approximately 1.3 million shares of our common stock under our share repurchase program in the first nine months of 2025. The total cost of these shares was $350 million, of which $1 million was recorded in Accounts payable at June 30, 2025, related to shares that did not settle until July 2025. At September 30, 2024, there were no significant outstanding common stock share repurchases recorded in Accounts payable. We repurchased approximately 1.7 million shares of our common stock under our share repurchase program in the first nine months of 2024. The total cost of these shares was $476 million, of which $1 million was recorded in Accounts payable at June 30, 2024, related to shares that did not settle until July 2024. Our decision to repurchase shares in the remainder of 2025 will depend on business conditions, free cash flow generation, other cash requirements, and stock price. On May 2, 2022, and September 11, 2024, the Board of Directors authorized us to expend an additional $1.0 billion to repurchase shares of our common stock. At June 30, 2025, we had approximately $996 million remaining for share repurchases under our existing board authorization. See Part II, Item 2. \nUnregistered Sales of Equity Securities and Use of Proceeds\n, for additional information regarding share repurchases.\nWe expect future uses of cash to include working capital requirements, capital expenditures, dividends to shareowners, repurchases of common stock, repayments of debt, additional contributions to our retirement plans, and acquisitions of businesses and other inorganic investments. We expect to fund future uses of cash with a combination of existing cash balances, cash generated by operating activities, commercial paper borrowings, or new issuances of debt or other securities. In addition, we have access to unsecured credit facilities with various banks. \nAt June 30, 2025, the majority of our Cash and cash equivalents were held by non-U.S. subsidiaries. We use a global cash pooling arrangement to efficiently manage liquidity among our entities. As a result of the broad changes to the U.S. international tax system under the Tax Act, the Company accounts for taxes on earnings of substantially all of its non-U.S. subsidiaries including both non-U.S. and U.S. taxes. The Company has concluded that earnings of a limited number of its non-U.S. subsidiaries are indefinitely reinvested.\nIn June 2022, we replaced our former $1.25 billion unsecured revolving credit facility with a new five-year $1.5 billion unsecured revolving credit facility, expiring in June 2027. This credit facility uses the secured overnight funding rate (SOFR) as the primary basis for determining interest payments. We can increase the aggregate amount of this credit facility by up to $750 million, subject to the consent of the banks in the credit facility. We did not borrow against this credit facility during the periods ended June 30, 2025, or September 30, 2024. Borrowings under this credit facility bear interest based on short-term money market rates in effect during the period the borrowings are outstanding. The terms of this credit facility contain covenants under which we agree to maintain an EBITDA-to-interest ratio of at least 3.0 to 1.0. The EBITDA-to-interest ratio is defined in the credit facility as the ratio of consolidated EBITDA (as defined in the facility) for the preceding four quarters to consolidated interest expense for the same period.\nAmong other uses, we can draw on our credit facility as a standby liquidity facility to repay our outstanding commercial paper as it matures. This access to funds to repay maturing commercial paper is an important factor in maintaining the short-term credit ratings set forth in the table below. Under our current policy with respect to these ratings, we expect to limit our other borrowings under our credit facility, if any, to amounts that would leave enough credit available under the facility so that we could borrow, if needed, to repay all of our then outstanding commercial paper as it matures.\nSeparate short-term unsecured credit facilities of approximately $275 million at June 30, 2025, were available to non-U.S. subsidiaries, of which, approximately $34 million was committed under letters of credit. Borrowings under our non-U.S. credit facilities at June 30, 2025, and September 30, 2024, were not significant. There are no significant commitment fees or compensating balance requirements under our credit facilities.\nThe following is a summary of our credit ratings as of August 6, 2025:\nCredit Rating Agency\nShort-Term Rating\nLong-Term Rating\nOutlook\nStandard & Poor’s\nA-2\nA-\nStable\nMoody’s\nP-2\nA3\nStable\nFitch Ratings\nF1\nA\nStable\n38\nTable of Contents\nOur ability to access the commercial paper market, and the related costs of these borrowings, is affected by the strength of our credit ratings and market conditions. We have not experienced any difficulty in accessing the commercial paper market. If our access to the commercial paper market is adversely affected due to a change in market conditions or otherwise, we would expect to rely on a combination of available cash and our unsecured committed credit facility to provide short-term funding. In such event, the cost of borrowings under our unsecured committed credit facility could be higher than the cost of commercial paper borrowings.\nWe regularly monitor the third-party depository institutions that hold our cash and cash equivalents and short-term investments. We diversify our cash and cash equivalents and short-term investments among counterparties to minimize exposure to any one of these entities.\nWe use foreign currency forward exchange contracts to manage certain foreign currency risks. We enter into these contracts to hedge our exposure to foreign currency exchange rate variability in the expected future cash flows associated with certain third-party and intercompany transactions denominated in foreign currencies forecasted to occur within the next two years. We also may use these contracts to hedge portions of our net investments in certain non-U.S. subsidiaries against the effect of exchange rate fluctuations on the translation of foreign currency balances to the U.S. dollar. There were no open net investment hedges for the nine months ended June 30, 2025, or September 30, 2024. In addition, we use foreign currency forward exchange contracts that are not designated as hedges to offset transaction gains or losses associated with some of our assets and liabilities resulting from intercompany loans or other transactions with third parties that are denominated in currencies other than our entities' functional currencies. Our foreign currency forward exchange contracts are usually denominated in currencies of major industrial countries. We diversify our foreign currency forward exchange contracts among counterparties to minimize exposure to any one of these entities.\nNet gains and losses related to derivative forward exchange contracts designated as cash flow hedges offset the related gains and losses on the hedged items during the periods in which the hedged items are recognized in earnings. During the three months ended  June 30, 2025, we reclassified $1 million in pre-tax net losses related to cash flow hedges reclassified from Accumulated other comprehensive loss into the Consolidated Statement of Operations. During the nine months ended June 30, 2025, we reclassified $6 million in pre-tax net gains related to cash flow hedges reclassified from Accumulated other comprehensive loss into the Consolidated Statement of Operations. During the three and nine months ended June 30, 2024, we reclassified $5 million and $18 million, respectively, in pre-tax net gains related to cash flow hedges from Accumulated other comprehensive loss into the Consolidated Statement of Operations. As of June 30, 2025, we expect that approximately $18 million of pre-tax net unrealized losses on cash flow hedges will be reclassified into earnings during the next 12 months.\nInformation with respect to our contractual cash obligations is contained in Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n, of our Annual Report on Form 10-K for the year ended September 30, 2024. We believe that at June 30, 2025, there has been no material change to this information.\n39\nTable of Contents\nSupplemental Sales Information\nWe translate sales of subsidiaries operating outside of the United States using exchange rates effective during the respective period. Therefore, changes in currency exchange rates affect our reported sales. Sales by acquired businesses also affect our reported sales. We believe that organic sales, defined as sales excluding the effects of acquisitions and changes in currency exchange rates, which is a non-GAAP financial measure, provides useful information to investors because it reflects regional and operating segment performance from the activities of our businesses without the effect of acquisitions and changes in currency exchange rates. We use organic sales as one measure to monitor and evaluate our regional and operating segment performance. When we acquire businesses, we exclude sales in the current period for which there are no comparable sales in the prior period. We determine the effect of changes in currency exchange rates by translating the respective period’s sales using the same currency exchange rates that were in effect during the prior year. When we divest a business, we exclude sales in the prior period for which there are no comparable sales in the current period. Organic sales growth is calculated by comparing organic sales to reported sales in the prior year, excluding divestitures. We attribute sales to the geographic regions based on the country of destination.\nThe following is a reconciliation of reported sales to organic sales by geographic region (in millions):\n \nThree Months Ended June 30, 2025\nThree Months Ended June 30, 2024\nReported Sales\nLess: Effect of\nAcquisitions\nEffect of\nChanges in\nCurrency\nOrganic Sales\nReported Sales\nNorth America\n$\n1,354 \n$\n— \n$\n(1)\n$\n1,355 \n$\n1,268 \nEurope, Middle East, and Africa\n392 \n— \n17 \n375 \n356 \nAsia Pacific\n266 \n— \n1 \n265 \n260 \nLatin America\n132 \n— \n(12)\n144 \n167 \nTotal Company Sales\n$\n2,144 \n$\n— \n$\n5 \n$\n2,139 \n$\n2,051 \n \nNine Months Ended June 30, 2025\nNine Months Ended June 30, 2024\nReported Sales\nLess: Effect of\nAcquisitions\nEffect of\nChanges in\nCurrency\nOrganic Sales\nReported Sales\nNorth America\n$\n3,792 \n$\n2 \n$\n(11)\n$\n3,801 \n$\n3,809 \nEurope, Middle East, and Africa\n1,082 \n— \n7 \n1,075 \n1,143 \nAsia Pacific\n744 \n— \n(6)\n750 \n806 \nLatin America\n408 \n— \n(42)\n450 \n471 \nTotal Company Sales\n$\n6,026 \n$\n2 \n$\n(52)\n$\n6,076 \n$\n6,229 \n40\nTable of Contents\nThe following is a reconciliation of reported sales to organic sales by operating segment (in millions):\n \nThree Months Ended June 30, 2025\nThree Months Ended June 30, 2024\nReported Sales\nLess: Effect of\nAcquisitions\nEffect of\nChanges in\nCurrency\nOrganic Sales\nReported Sales\nIntelligent Devices\n$\n968 \n$\n— \n$\n1 \n$\n967 \n$\n957 \nSoftware & Control\n629 \n— \n2 \n627 \n513 \nLifecycle Services\n547 \n— \n2 \n545 \n581 \nTotal Company Sales\n$\n2,144 \n$\n— \n$\n5 \n$\n2,139 \n$\n2,051 \n \nNine Months Ended June 30, 2025\nNine Months Ended June 30, 2024\nReported Sales\nLess: Effect of\nAcquisitions\nEffect of\nChanges in\nCurrency\nOrganic Sales\nReported Sales\nIntelligent Devices\n$\n2,670 \n$\n— \n$\n(27)\n$\n2,697 \n$\n2,858 \nSoftware & Control\n1,726 \n— \n(14)\n1,740 \n1,686 \nLifecycle Services\n1,630 \n2 \n(11)\n1,639 \n1,685 \nTotal Company Sales\n$\n6,026 \n$\n2 \n$\n(52)\n$\n6,076 \n$\n6,229 \n41\nTable of Contents\nCritical Accounting Estimates\nWe have prepared the Consolidated Financial Statements in accordance with accounting principles generally accepted in the United States, which require us to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the Consolidated Financial Statements and revenues and expenses during the periods reported. These estimates are based on our best judgment about current and future conditions, but actual results could differ from those estimates. Information with respect to accounting estimates that are the most critical to the understanding of our financial statements as they could have the most significant effect on our reported results and require subjective or complex judgments by management is contained in Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n, of our Annual Report on Form 10-K for the year ended September 30, 2024. We believe that at June 30, 2025, there has been no material change to this information.\nEnvironmental Matters\nInformation with respect to the effect of compliance with environmental protection requirements and resolution of environmental claims on us and our manufacturing operations is contained in Note 17 in the Consolidated Financial Statements in Item 8. \nFinancial Statements and Supplementary Data\n, of our Annual Report on Form 10-K for the year ended September 30, 2024. We believe that at June 30, 2025, there has been no material change to this information.\nRecent Accounting Pronouncements\nSee Note 1 in the Consolidated Financial Statements regarding recent accounting pronouncements."
}