{
  "item1": "additional information business long-term strategy. Company continues business founded Allen-Bradley Company 1903. privately-owned Allen-Bradley Company leading North American manufacturer industrial automation equipment when former Rockwell International Corporation (RIC) purchased 1985. Company incorporated Delaware connection tax-free reorganization completed December 6, 1996, pursuant which divested former aerospace defense businesses (the A&D Business) Boeing Company (Boeing).",
  "item7": "Diluted weighted average outstanding shares Pre-tax margin (i/d) Intelligent Devices segment operating margin (e/a) Software & Control segment operating margin (f/b) Lifecycle Services segment operating margin (g/c) Total segment operating margin See Note 20 Consolidated Financial Statements definition segment operating earnings. Total segment operating earnings total segment operating margin non-GAAP financial measures. exclude purchase accounting depreciation amortization, impairment, corporate other, non-operating pension postretirement benefit (cost) credit, net legacy asbestos environmental charges, change fair value investments, restructuring charges aligned enterprise-wide strategic initiatives, interest expense, net because do not consider these items directly related operating performance segments. believe total segment operating earnings total segment operating margin useful investors measures operating performance.",
  "item2": "investments manufacturing, including new facilities production lines, upgrades, modifications expansions existing facilities production lines; investments basic materials production capacity, which may related commodity pricing levels; customers’ needs faster time market, agility address evolving consumer preferences, operational productivity, asset management reliability, business resilience, including security enterprise risk management; customers’ needs continuously improve quality, safety, sustainability; industry factors include customers’ new product introductions, demand customers’ products services, regulatory competitive environments which customers operate; levels global industrial production capacity utilization; regional factors include local political, social, regulatory, economic circumstances; spending patterns customers due annual budgeting processes working schedules. world’s largest company dedicated industrial automation digital transformation, strategy bring Connected Enterprise life. understand simplify customers’ complex production challenges deliver most valued solutions combine technology industry expertise. result, make customers more resilient, agile, sustainable, creating more ways win."
}