{
  "source_file": "rop-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.     BUSINESS\nAll currency amounts are in millions unless specified\nOur Business\nRoper Technologies, Inc. (“Roper,” the “Company,” “we,” “our,” or “us”) is a diversified technology company. Roper has a proven, long-term, successful track record of compounding cash flow and increasing shareholder value. We operate market leading businesses that design and develop vertical software and technology enabled products for a variety of defensible niche markets.\nWe pursue consistent and sustainable growth in revenue, earnings, and cash flow by enabling continuous improvement in the operating performance of our businesses and by acquiring businesses that offer high value-added software, services, technology-enabled products, and solutions that we believe are capable of realizing growth while maintaining high margins. We compete in many defensible niche markets and believe we are the market leader or a competitive alternative to the market leader in most of these markets.\nIn the last three years, we have deployed approximately $9,950 of capital toward acquisitions. In 2024, this included approximately $1,860 for the acquisition of Procare, a leading provider of Software-as-a-Service (“SaaS”) solutions and integrated payment processing for early childhood education centers and approximately $1,600 for the acquisition of Transact Campus, a leading provider of integrated campus technology and payment solutions serving higher education, healthcare, and business campuses, which was combined with our CBORD business. In 2023, this included approximately $1,380 for the acquisition of Syntellis, a leading provider of SaaS solutions for healthcare, financial institution, and higher education providers, which was combined with our Strata business, and 2022 included approximately $3,750 for the acquisition of Frontline, a leading provider of SaaS solutions for school administration. Additionally, we deployed approximately $1,360 toward other bolt-on acquisitions to help build on the strategic position of several of our businesses.\nIn November 2022, Roper completed the divestiture of a majority equity stake in its industrial businesses, including its entire historical Process Technologies reportable segment and the industrial businesses within its historical Measurement & Analytical Solutions reportable segment (collectively “Indicor”), to Clayton, Dubilier & Rice, LLC (“CD&R”). Following the sale of the majority stake, Roper retained a minority equity interest in Indicor. See Note 10 of the Notes to Consolidated Financial Statements included in this Annual Report for additional information regarding Roper’s minority equity interest in Indicor.\nDuring 2021, Roper entered into definitive agreements to divest its TransCore, Zetec, and CIVCO Radiotherapy businesses (“2021 Divestitures”). Roper completed the 2021 Divestitures by March 2022. \nThe financial results of Indicor and the 2021 Divestitures are reported as discontinued operations for all periods presented. Unless otherwise noted, discussion within Part I relates to continuing operations. Refer to Note 3 of the Notes to Consolidated Financial Statements included in this Annual Report for further information regarding discontinued operations.\nWe were incorporated on December 17, 1981 under the laws of the State of Delaware.\nMarket Share, Market Expansion, and Product Development\nLeadership with Technology and Products for Niche Markets\n – We maintain a leading position in many of our markets. We believe our market positions are attributable to the applications expertise used to create high value products and solutions for our customers, the underlying critical nature of our offerings, and the inherent customer intimacy of our chosen niche markets. Our businesses realize growth from new and existing customers in their niche markets through successfully executing go-to-market strategies, developing new products and applications, and delivering professional services.\nDiversified End Markets and Geographic Reach\n – We have a global presence, with sales to customers outside of the United States (“U.S.”) totaling $975.9 in 2024. Information regarding our international operations is set forth in Note 14 of the Notes to Consolidated Financial Statements included in this Annual Report.\n4\nOur Reportable Segments\nRoper’s segment reporting structure is based on business model and delivery of performance obligations. The three reportable segments are as follows:\n–Application Software\n—Aderant, Clinisys, Data Innovations, Deltek, Frontline, IntelliTrans, PowerPlan, Procare, Strata, Transact/CBORD, Vertafore\n–Network Software\n—ConstructConnect, DAT, Foundry, iPipeline, iTradeNetwork, Loadlink, MHA, SHP, SoftWriters\n–Technology Enabled Products\n—CIVCO Medical Solutions, FMI, Inovonics, IPA, Neptune, Northern Digital, rf IDEAS, Verathon\nFinancial information about our reportable segments is presented in Note 14 of the Notes to Consolidated Financial Statements included in this Annual Report.\nApplication Software\nOur Application Software segment had net revenues of $3,868.3 for the year ended December 31, 2024, representing 55.0% of our total net revenues. Below is a description of the products offered by businesses that comprise the Application Software segment:\nAderant \n–\n \ncomprehensive management software solutions for law and other professional services firms, including business development, calendar/docket matter management, time and billing, and case management.\nClinisys\n – diagnostic and laboratory information management software solutions.\nData Innovations\n – software solutions that enable enterprise management of hospitals and independent laboratories.\nDeltek\n – enterprise software and information solutions for government contractors, professional services firms, and other project-based businesses.\nFrontline\n – K-12 school administration software, connecting solutions for human capital management, student and special programs, and business operations, with powerful analytics that empower educators.\nIntelliTrans\n – transportation management software and services to bulk and break-bulk commodity producers.\nPowerPlan\n – financial and compliance management software and solutions to large complex companies in asset-intensive industries.\nProcare\n – cloud-based software and integrated payment processing for the management of early childhood education centers.\nStrata\n – cloud-based financial analytics, performance management software, and data solutions used by healthcare providers, higher education, and financial institutions for financial planning, decision support, and continuous cost improvement.\nTransact/CBORD\n – integrated campus technology and payment solutions, including secure access and campus identity software, commerce solutions, tuition management software and payment processing, as well as foodservice technologies, serving higher education, healthcare, K-12, and business campuses.\nVertafore\n – cloud-based software for the property and casualty insurance industry, including agency and distribution management, compliance, workflow, and data solutions.\n5\nNetwork Software\nOur Network Software segment had net revenues of $1,475.6 for the year ended December 31, 2024, representing 21.0% of our total net revenues. Below is a description of the products offered by businesses that comprise the Network Software segment:\nConstructConnect\n – cloud-based data, collaboration, and estimating automation software solutions focused on the pre-construction phase for a network of construction contractors and building product manufacturers/distributors.\nDAT\n – electronic marketplaces that connect available capacity of trucking units with the available loads of freight throughout North America, and freight analytics solutions.\nFoundry\n – software technologies used to deliver visual effects and 3D content for the entertainment and digital design industries.\niPipeline\n – cloud-based software solutions for the life insurance/annuities and financial services industries.\niTradeNetwork\n – electronic marketplaces and supply chain software that connect food suppliers, distributors, and vendors, primarily in the perishable food sector.\nLoadlink\n – electronic marketplaces that connect available capacity of trucking units with the available loads of freight throughout Canada, and freight analytics solutions.\nMHA\n – health care services and software solutions to alternate site health care markets.\nSHP\n – data analytics and benchmarking information for the post-acute healthcare provider marketplace.\nSoftWriters\n – software solutions to pharmacies that primarily serve the long-term care marketplace.\nTechnology Enabled Products\nOur Technology Enabled Products segment had net revenues of $1,695.3 for the year ended December 31, 2024, representing 24.0% of our total net revenues. Below is a description of the products offered by businesses that comprise the Technology Enabled Products segment:\nCIVCO Medical Solutions\n – accessories focused on guidance and infection control for ultrasound procedures.\nFMI\n – dispensers and metering pumps which are utilized in a broad range of applications requiring precision fluid control.\nInovonics\n – high-performance wireless sensor networks and solutions for a variety of applications.\nIPA\n – automated surgical scrub and linen dispensing equipment for healthcare providers.\nNeptune\n – water meters, enabling water utilities to remotely monitor their customers utilizing Automatic Meter Reading (AMR), Advanced Metering Infrastructure (AMI) technologies, and cloud-based software supporting meter data management.\nNorthern Digital\n – optical and electromagnetic precision measurement systems for medical and industrial applications.\nrf IDEAS\n – RFID card and credential readers used in numerous identity access management applications across a variety of vertical markets.\nVerathon\n – medical devices that enable airway management, including bronchoscopes and video laryngoscopes, and bladder volume measurement solutions for healthcare providers.\n6\nMaterials and Suppliers\nWe believe most materials and supplies we use are readily available from numerous sources and suppliers throughout the world. However, some components and sub-assemblies are currently available from only a limited number of suppliers for which we regularly investigate and identify alternative sources where possible. We also believe these conditions affect our competitors.\nRemaining Performance Obligations and Backlog\nRemaining performance obligations represent the transaction price of firm orders for which work has not been performed, excluding unexercised contract options. As of December 31, 2024 and 2023, total remaining performance obligations were $4,754.9 and $4,612.6, respectively.\nBacklog is equal to our remaining performance obligations expected to be recognized as revenue within the next 12 months. Backlog was $3,105.4 at December 31, 2024 and $3,156.6 at December 31, 2023.\nDistribution and Sales\nDistribution and sales occur primarily through direct sales offices, manufacturers’ representatives, resellers, and distributors.\nGovernmental Regulations\nWe face extensive government regulation around the world relating to the development, manufacture, marketing, sale, and distribution of our software, services, and products. The following sections describe certain significant regulations to which we are subject, but these are not the only regulations with which our businesses must comply. For a description of risks related to the regulations that our businesses are subject to, please refer to “Item 1A. Risk Factors.”\nPrivacy and Data Security\nWe are subject to privacy and data security laws around the world that may impose operational burdens on our businesses. In 2018, the General Data Protection Regulation (“GDPR”) became effective in the European Union (“EU”) and United Kingdom (“UK”) and imposed restrictions on how companies use, process, and protect personal information. Additionally, repeated legal challenges to the way regulators implemented GDPR provisions relating to international data transfers have created additional operational burdens and legal risks for companies when transferring personal data back and forth from the EU to many other countries, most notably the U.S. and India. In the U.S., at least 20 states have individually passed comprehensive privacy legislation, which imposes restrictions similar (but not identical) to GDPR on companies conducting business or serving customers in those states. For example, in 2020 the California Consumer Privacy Act (“CCPA”) became effective and required companies to make disclosures to consumers about their data collection, use, and sharing practices; allowed consumers to exercise control over the use and sharing of their personal data; and provided a limited private right of action for data breaches. Changes to the CCPA which became effective in 2023 have added to the processing restrictions and notifications requirements – particularly when companies engage in online advertising. Canada (Quebec) has also significantly updated its privacy laws. The compliance and other burdens on our businesses imposed by these privacy laws and regulations may be substantial as we work to comply with differing legal and implementation requirements across multiple jurisdictions.\nHealthcare Regulations\nThe manufacture, sale, lease, and service of medical diagnostic and surgical devices intended for commercial use are subject to extensive governmental regulation by the Food and Drug Administration (“FDA”) in the U.S. and by a variety of regulatory agencies in other countries for some of our businesses. Under the Federal Food, Drug, and Cosmetic Act, known as the FD&C Act, manufacturers of medical products and devices must comply with certain regulations governing the design, testing, manufacturing, packaging, servicing, and marketing of medical products. FDA product approvals may be withdrawn or suspended if compliance with regulatory standards is not maintained or if problems occur following initial marketing. We are also subject to a variety of federal, state, and foreign laws which broadly relate to our interactions with healthcare practitioners and other participants in the healthcare system, including, among others, anti-kickback law, and laws regulating the confidentiality of sensitive personal information and the circumstances under which such information may be released and/or collected, such as the Health Insurance Portability and Accountability Act of 1996, or HIPAA, the Health Information Technology for Economic and Clinical Health Act, or HITECH Act, and the GDPR.\n7\nAnti-Corruption and Anti-Bribery Laws and Regulations\nWe are subject to the U.S. Foreign Corrupt Practices Act (FCPA) and anti-corruption laws, and similar laws in foreign countries, such as the UK Bribery Act. Any violation of these laws by us or our agents or distributors could create substantial liability for us, subject our officers and directors to personal liability, and cause a loss of reputation in the market. Increased business in higher risk countries could subject us and our officers and directors to increased scrutiny and increased liability. In addition, becoming familiar with and implementing the infrastructure necessary to comply with laws, rules, and regulations applicable to new business activities and mitigating and protecting against corruption risks could be quite costly.\nExport Controls and Trade Policies\nWe are subject to numerous domestic and foreign regulations relating to our operations worldwide. In particular, our sales activities must comply with restrictions relating to the export of controlled technology and sales to denied or sanctioned parties contained in the U.S. Export Administration Regulations, U.S. International Traffic in Arms Regulations (ITAR), and sanctions administered by the Office of Foreign Assets Control of the U.S. Department of the Treasury (OFAC). Our businesses may also be impacted by additional domestic or foreign trade regulations, including trade restrictions, trade agreements, tariffs (including new, expanded, or retaliatory tariffs), and sanctions.\nEnvironmental Regulations\nOur operations and properties are subject to laws and regulations relating to environmental protection, including those governing air emissions, water discharges, waste management, and workplace safety. We use, generate, and dispose of hazardous substances and waste in our operations and could be subject to material liabilities relating to the investigation and clean-up of contaminated properties and related claims. We are required to conform our operations and properties to these laws and adapt to regulatory requirements in all countries as these requirements change. In connection with our acquisitions, we may assume significant environmental liabilities, some of which we may not be aware of, or may not be quantifiable, at the time of acquisition. In addition, new laws and regulations, the discovery of previously unknown contamination, or the imposition of new requirements could increase our costs or subject us to new or increased liabilities.\nCustomers\nDuring 2024, no customer accounted for 10% or more of any segment or total Company net revenues.\nCompetition\nGenerally, our products and solutions face significant competition, although in certain niche markets there are a limited number of competitors. We believe that we are a leader in most of our markets, and no single company competes with us over a significant number of product lines. Competitors might be large or small in size, often depending on the size of the niche market we serve. We compete primarily on product quality, performance, innovation, technology, price, applications expertise, system and service flexibility, distribution channel access, and customer service capabilities.\nIntellectual Property\nIn addition to trade secrets, including unpatented know-how and other intellectual property like software source code, we own or license the rights under numerous patents, trademarks, trade dress, and copyrights relating to certain of our products and businesses. We also employ various methods, including confidentiality and non-disclosure agreements with individuals and companies we do business with, including employees, distributors, representatives, independent contractors, and customers to protect our intellectual property. We believe none of our operating units are substantially dependent on any single item of intellectual property, including a trade secret, patent, trademark, trade dress, or copyright.\n8\nHuman Capital Management\nRoper is a diversified technology company that utilizes a decentralized operating model across our many businesses which serve a diverse set of end markets. Subject to oversight and guidance from Roper executive management, each business operates as an individual unit with its managers empowered to make day-to-day operating decisions, including decisions with respect to human capital management. As a result, apart from guidance with respect to: (i) compliance with legal and regulatory requirements or corporate policies; and (ii) the implementation of business unit leadership compensation and benefit programs provided by corporate management, managers at individual businesses are the primary decision makers with respect to human capital management and development. Though our individual businesses are primarily responsible for these decisions, because of the importance of human capital to our enterprise, we provide guidance and share best practices on key aspects of selection, development, engagement, and diversity of talent within our workforce.\nAs of December 31, 2024, we employed approximately 18,200 people worldwide on a consolidated basis, of which approximately 12,100 were employed in the U.S. and approximately 6,100 were employed outside of the U.S. Management believes that the Company’s employee relations are favorable.\nOutside of the U.S., we have some employees, particularly in Europe, that are represented by an employee representative organization, such as a union, works council, or employee association.\nRoper has identified and implemented other human capital priorities, including providing competitive wages and benefits, and promoting a diverse and inclusive work environment. The Company is committed to increasing diversity and fostering an inclusive work environment that supports our large global workforce and helps us innovate for our customers. We continue to focus on building a pipeline for talent that creates more opportunities for growth within the Company.\nAvailable Information\nAll reports we file electronically with the SEC, including our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and our annual proxy statements, as well as any amendments to those reports, are accessible at no cost on our website at www.ropertech.com as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. These filings are also accessible on the SEC’s website at www.sec.gov. Our Corporate Governance Guidelines; the charters of our Audit Committee, Compensation Committee, and Nominating and Governance Committee; and our Code of Ethics (the “Code of Ethics”) are also available on our website. Any amendment to the Code of Ethics and any waiver applicable to our directors, executive officers, or senior financial officers will be posted on our website within the time period required by the SEC and Nasdaq. The information posted on our website is not incorporated into this Annual Report or any other filing made by Roper with the SEC.",
  "item7": "ITEM 7.     MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nAll currency amounts are in millions unless specified\nThis item generally discusses our 2024 results compared to our 2023 results. Discussions of our 2023 results compared to our 2022 results can be found within Part II, Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2023.\nOverview\nRoper Technologies, Inc. (“Roper,” the “Company,” “we,” “our,” or “us”) is a diversified technology company. Roper has a proven, long-term, successful track record of compounding cash flow and increasing shareholder value. We operate market leading businesses that design and develop vertical software and technology enabled products for a variety of defensible niche markets.\nWe pursue consistent and sustainable growth in revenue, earnings, and cash flow by enabling continuous improvement in the operating performance of our existing businesses and by acquiring businesses that offer high value-added software, services, technology-enabled products, and solutions that we believe are capable of realizing growth while maintaining high margins. \nIn November 2022, Roper completed the divestiture of a majority equity stake in its industrial businesses, including its entire historical Process Technologies reportable segment and the industrial businesses within its historical Measurement & Analytical Solutions reportable segment (collectively “Indicor”), to Clayton, Dubilier & Rice, LLC. Following the sale of the majority equity stake, Roper retained a minority equity interest in Indicor. See Note 10 of the Notes to Consolidated Financial Statements included in this Annual Report for additional information regarding Roper’s minority equity interest in Indicor.\nDuring 2021, Roper entered into definitive agreements to divest its TransCore, Zetec, and CIVCO Radiotherapy businesses (“2021 Divestitures”). Roper completed the 2021 Divestitures by March 2022. \nThe financial results of Indicor and the 2021 Divestitures are reported as discontinued operations for all periods presented. Unless otherwise noted, discussion within Management’s Discussion and Analysis of Financial Condition and Results of Operations relates to continuing operations. Refer to Note 3 of the Notes to Consolidated Financial Statements included in this Annual Report for further information regarding discontinued operations.\nSegment Reporting\nRoper’s segment reporting structure is based on business model and delivery of performance obligations. The three reportable segments are as follows:\n–Application Software\n—Aderant, Clinisys, Data Innovations, Deltek, Frontline, IntelliTrans, PowerPlan, Procare, Strata, Transact/CBORD, Vertafore\n–Network Software\n—ConstructConnect, DAT, Foundry, iPipeline, iTradeNetwork, Loadlink, MHA, SHP, SoftWriters\n–Technology Enabled Products\n—CIVCO Medical Solutions, FMI, Inovonics, IPA, Neptune, Northern Digital, rf IDEAS, Verathon\nFinancial information about our reportable segments is presented in Note 14 of the Notes to Consolidated Financial Statements included in this Annual Report.\n22\nApplication of Critical Accounting Policies\nOur Consolidated Financial Statements are prepared in conformity with generally accepted accounting principles in the United States (“GAAP”). A discussion of our significant accounting policies can also be found in the Notes to Consolidated Financial Statements for the year ended December 31, 2024 included in this Annual Report.\nGAAP offers acceptable alternative methods for accounting for certain issues affecting our financial results, such as determining inventory cost, depreciating long-lived assets and recognizing revenue. Other than the changes during 2023 as further described in Note 10 of our Notes to Consolidated Financial Statements with respect to the methodology used to value our equity investment in Indicor, we have not changed the application of acceptable accounting methods or the significant estimates affecting the application of these principles in the last three years in a manner that had a material effect on our Consolidated Financial Statements.\nThe preparation of financial statements in accordance with GAAP requires the use of estimates, assumptions, judgments, and interpretations that can affect the reported amounts of assets, liabilities, revenues and expenses, the disclosure of contingent assets and liabilities, and other supplemental disclosures.\nThe development of accounting estimates is the responsibility of our management. Our management discusses those areas that require significant judgments with the Audit Committee of our Board of Directors. The Audit Committee has reviewed all financial disclosures in our annual filings with the SEC. Although we believe the positions we have taken with regard to uncertainties are reasonable, others might reach different conclusions and our positions can change over time as more information becomes available. If an accounting estimate changes, its effects are accounted for prospectively or through a cumulative catch-up adjustment.\nOur most significant accounting uncertainties are encountered in the areas of income taxes, valuation of other intangible assets, goodwill and other indefinite-lived intangibles impairment analyses, and valuation of our equity investment in Indicor. Estimates are considered to be significant if they meet both of the following criteria: (1) the estimate requires assumptions about matters that are uncertain at the time the estimate is made, and (2) changes in the estimate are reasonably likely to have a material financial impact from period-to-period. \nIncome taxes can be affected by estimates of whether and within which jurisdictions future earnings will occur and if, how, and when cash is repatriated to the U.S., combined with other aspects of an overall income tax strategy. Additionally, taxing jurisdictions could retroactively disagree with our tax treatment of certain items, and some historical transactions have income tax effects going forward. Accounting rules require these future effects to be evaluated using current laws, rules and regulations, each of which can change at any time and in an unpredictable manner. If there is a material change in the actual effective tax rates, the time period within which the underlying temporary differences become taxable or deductible, or if the tax law changes are unfavorable, there could be a resulting increase to income tax expense and the effective tax rate. \nOur 2024 effective income tax rate was 21.2% and our 2023 effective income tax rate was 21.5%. \nWe expect the effective tax rate for 2025 to be approximately \n21% to 22%.\nWe account for goodwill in a purchase business combination as the excess purchase price over the fair value of the net identifiable assets acquired. Goodwill, which is not amortized, is tested for impairment on an annual basis in conjunction with our annual forecast process during the fourth quarter (or an interim basis if an event occurs or circumstances change that would more likely than not reduce the fair value of a reporting unit below its carrying value).\nWhen testing goodwill for impairment, we have the option to first assess qualitative factors to determine whether the existence of events or circumstances leads to a determination that it is more likely than not that the estimated fair value of a reporting unit is less than its carrying amount. If we elect to perform a qualitative assessment and determine that an impairment is more likely than not, we are then required to perform the quantitative impairment test; otherwise, no further analysis is required. Under the qualitative assessment, we consider various qualitative factors, including macroeconomic conditions, relevant industry and market trends, cost factors, overall financial performance, other entity-specific events, and events affecting the reporting unit that could indicate a potential change in the fair value of our reporting unit or the composition of its carrying value. We also consider the specific future outlook for the reporting unit.\n23\nWe also may elect not to perform the qualitative assessment and, instead, proceed directly to the quantitative impairment test. The quantitative assessment utilizes the equal weighting of both an income approach (discounted cash flow) and a market approach (consisting of a comparable public company earnings multiples methodology) to estimate the fair value of a reporting unit. To determine the reasonableness of the estimated fair values, we review the assumptions to ensure that neither the income approach nor the market approach provides significantly different valuations. If the estimated fair value exceeds the carrying value, no further work is required and no impairment loss is recognized. If the carrying value exceeds the estimated fair value, a non-cash impairment loss is recognized in the amount of that excess.\nKey assumptions used in the income and market approaches are updated when the analysis is performed for each reporting unit. The assumptions that have the most significant effect on the fair value calculations are the projected revenue growth rates, future operating margins, discount rates, terminal values, and earnings multiples. While we use reasonable and timely information to prepare our cash flow and discount rate assumptions, actual future cash flows or market conditions could differ significantly and could result in future non-cash impairment charges related to recorded goodwill balances.\nRecently acquired reporting units generally represent a higher inherent risk of impairment, which typically decreases as the businesses are integrated into our enterprise. Negative industry or economic trends, disruptions to our business, actual results significantly below projections, unexpected significant changes or planned changes in the use of the assets, divestitures, and market capitalization declines may have a negative effect on the fair value of our reporting units.\nAs of the annual impairment test, Roper has 23 reporting units with individual goodwill amounts ranging from $17.5 to $3,363.7. In 2024, the Company performed its annual impairment test in the fourth quarter for all reporting units. The Company conducted its analysis qualitatively and assessed whether it was more likely than not that the respective fair values of these reporting units were less than their carrying amounts. The Company determined that impairment of goodwill was not likely in any of its reporting units and thus was not required to perform a quantitative assessment for these reporting units as of October 1, 2024.\nTrade names that are determined to have an indefinite useful economic life are not amortized, but separately tested for impairment during the fourth quarter of the fiscal year or on an interim basis if an event occurs that indicates the fair value is more likely than not below the carrying value. We first qualitatively assess whether the existence of events or circumstances leads to a determination that it is more likely than not that the estimated fair value of the indefinite-lived trade name is less than its carrying amount. If necessary, we conduct a quantitative assessment using the relief-from-royalty method, which we believe to be an acceptable methodology due to its common use by valuation specialists in determining the fair value of intangible assets. This methodology assumes that, in lieu of ownership, a third party would be willing to pay a royalty in order to exploit the related benefits of these assets. The assumptions that have the most significant effect on the fair value calculations are the royalty rates, projected revenue growth rates, discount rates, and terminal values. Each royalty rate is determined based on the profitability of the trade name to which it relates and observed market royalty rates. Revenue growth rates are determined after considering current and future economic conditions, recent sales trends, discussions with customers, planned timing of new product launches, or other variables. Trade names resulting from recent acquisitions generally represent the highest risk of impairment, which typically decreases as the businesses are integrated into our enterprise.\nThe assessment of fair value for impairment purposes requires significant judgments to be made by management. Although our forecasts are based on assumptions that are considered reasonable by management and consistent with the plans and estimates management uses to operate the underlying businesses, there is significant judgment applied in determining the expected results attributable to the businesses and/or reporting units. Changes in estimates or the application of alternative assumptions could produce significantly different results.\nThe most significant identifiable intangible assets with definite useful economic lives recognized from our acquisitions are customer relationships. The fair value for customer relationships is determined as of the acquisition date using the excess earnings method. Under this methodology the fair value is determined based on the estimated future after-tax cash flows arising from the acquired customer relationships over their estimated useful lives after considering customer attrition and contributory asset charges. The assumptions that have the most significant effect on the fair value calculations are the customer attrition rates, projected customer revenue growth rates, margins, contributory asset charges, and discount rates. When testing customer relationship intangible assets for potential impairment, management considers historical customer attrition rates and projected revenues and profitability related to customers that existed at acquisition. In evaluating the amortizable life for customer relationship intangible assets, management considers historical customer attrition patterns.\n24\nWe evaluate whether there has been an impairment of identifiable intangible assets with definite useful economic lives, or of the remaining life of such assets, when certain indicators of impairment are present. In the event that facts and circumstances indicate that the cost or remaining period of amortization of any asset may be impaired, an evaluation of recoverability would be performed. If an evaluation is required, the estimated future gross, undiscounted cash flows associated with the asset would be compared to the asset’s carrying amount to determine if a write-down to fair value or a revision in the remaining amortization period is required.\nAs of December 31, 2024 and 2023, Roper held a 45.5% and 47.3% minority equity interest in Indicor Equity, LLC, respectively. This equity interest provides us with the ability to exercise significant influence, but not control, over the investee. We elected to apply the fair value option as we believe this is the most reasonable method to value this equity investment. This investment is classified within Level 3 of the fair value hierarchy as valuation of the investment reflects management’s estimate of assumptions that market participants would use in pricing the equity interest. Any changes to the valuation estimates or assumptions, as described further in Note 10 of the Notes to Consolidated Financial Statements included in this Annual Report, could produce significantly different results. The fair value of our equity investment in Indicor is estimated on a quarterly basis and the change in fair value is reported as a component of “Equity investments gain, net” in our Consolidated Statements of Earnings.\n25\nResults of Continuing Operations\nAll currency amounts are in millions unless specified, percentages are of net revenues\nPercentages may not sum due to rounding.\nThe following table sets forth selected information for the years indicated:\n \nYear ended December 31,\n \n2024\n2023\n2022\nNet revenues:\n \n \n \nApplication Software \n(1)\n$\n3,868.3 \n$\n3,186.9 \n$\n2,639.5 \nNetwork Software \n(2)\n1,475.6 \n1,439.4 \n1,378.5 \nTechnology Enabled Products\n1,695.3 \n1,551.5 \n1,353.8 \nTotal consolidated\n$\n7,039.2 \n$\n6,177.8 \n$\n5,371.8 \nGross margin:\n \n \n \nApplication Software \n68.4 \n%\n68.9 \n%\n68.8 \n%\nNetwork Software\n85.0 \n%\n85.1 \n%\n84.6 \n%\nTechnology Enabled Products\n57.6 \n%\n57.1 \n%\n56.9 \n%\nTotal consolidated\n69.3 \n%\n69.7 \n%\n69.9 \n%\nSelling, general and administrative expenses:\nApplication Software\n(42.0)\n%\n(43.1)\n%\n(41.8)\n%\nNetwork Software\n(39.9)\n%\n(41.2)\n%\n(43.2)\n%\nTechnology Enabled Products\n(23.7)\n%\n(23.7)\n%\n(23.8)\n%\nTotal consolidated\n(37.1)\n%\n(37.8)\n%\n(37.6)\n%\nSegment operating margin:\n \n \n \nApplication Software\n26.5 \n%\n25.8 \n%\n27.1 \n%\nNetwork Software\n45.2 \n%\n43.9 \n%\n41.4 \n%\nTechnology Enabled Products\n33.9 \n%\n33.4 \n%\n33.2 \n%\nTotal consolidated\n32.2 \n%\n31.9 \n%\n32.3 \n%\nCorporate administrative expenses \n(3)\n(3.8)\n%\n(3.7)\n%\n(3.9)\n%\nIncome from operations\n28.4 \n28.2 \n28.4 \nInterest expense, net\n(3.7)\n(2.7)\n(3.6)\nEquity investments gain, net\n3.3 \n2.7 \n— \nOther expense, net\n(0.1)\n— \n(0.9)\nEarnings before income taxes\n27.9 \n28.2 \n23.9 \nIncome taxes\n(5.9)\n(6.1)\n(5.5)\nNet earnings from continuing operations\n22.0 \n%\n22.2 \n%\n18.3 \n%\n(1)\nIncludes results from the acquisitions of Horizon Lab Systems, LLC from January 3, 2022, Common Cents Systems, Inc. from April 6, 2022, MGA Systems Holdings, Inc. from June 27, 2022, Common Sense Solutions, Inc. from July 12, 2022, viDesktop Inc. from August 19, 2022, TIP Technologies, Inc. from September 23, 2022, Frontline from October 4, 2022, Promium, L.L.C. from May 2, 2023, Syntellis from August 7, 2023, Replicon Inc. from August 21, 2023, ProPricer from December 26, 2023, Procare from February 26, 2024, Transact from August 20, 2024, and Surefyre, Inc. from November 4, 2024.\n(2)\nIncludes results from the acquisition of Trucker Tools, LLC from December 17, 2024.\n(3)\nIncludes unallocated corporate general and administrative expenses and enterprise-wide stock-based compensation.\n26\nYear Ended December 31, 2024 compared to the Year Ended December 31, 2023 \n \nNet revenues for the year ended December 31, 2024 were $7,039.2 as compared to $6,177.8 for the year ended December 31, 2023, an increase of 13.9%. The components of revenue growth for the year ended December 31, 2024 were as follows:\nApplication Software\nNetwork Software\nTechnology Enabled Products\nRoper\nTotal Revenue Growth\n21.4 \n%\n2.5 \n%\n9.3 \n%\n13.9 \n%\nLess Impact of:\nAcquisitions\n15.7 \n— \n— \n8.1 \nForeign Exchange\n0.1 \n— \n— \n— \nOrganic Revenue Growth\n5.6 \n%\n2.5 \n%\n9.3 \n%\n5.8 \n%\nIn our Application Software segment, net revenues for the year ended December 31, 2024 were $3,868.3 as compared to $3,186.9 for the year ended December 31, 2023. The growth of 5.6% in organic revenues was broad-based across the segment led by our businesses serving the project-based business/government contracting, acute healthcare, property and casualty insurance, and legal markets. Gross margin decreased to 68.4% for the year ended December 31, 2024 as compared to 68.9% for the year ended December 31, 2023, due primarily to a lower gross margin profile associated with the higher payments revenue mix at Procare and Transact, our 2024 acquisitions, whose results reduced gross margin by 180 basis points. This decrease was partially offset by improved leverage on higher organic revenues. Selling, general and administrative (“SG&A”) expenses as a percentage of net revenues decreased to 42.0% in the year ended December 31, 2024 as compared to 43.1% in the year ended December 31, 2023, due primarily to lower SG&A profiles at Procare and Transact, which collectively reduced SG&A as a percentage of net revenues by 70 basis points, operating leverage on higher organic revenues, and cost synergies resulting from the integration of Syntellis. The resulting operating margin was 26.5% in the year ended December 31, 2024 as compared to 25.8% in the year ended December 31, 2023.\nIn our Network Software segment, net revenues were $1,475.6 for the year ended December 31, 2024 as compared to $1,439.4 for the year ended December 31, 2023. The growth of 2.5% in organic revenues was led by our network software businesses serving the alternate site healthcare, life insurance/annuities, and construction markets, partially offset by a decline in our businesses serving the media and entertainment and freight match markets primarily related to end market conditions. Gross margin remained relatively consistent at 85.0% for the year ended December 31, 2024 as compared to 85.1% for the year ended December 31, 2023. SG&A expenses as a percentage of net revenues decreased to 39.9% in the year ended December 31, 2024, as compared to 41.2% in the year ended December 31, 2023, due primarily to expense reductions resulting from cost structure rationalization at our businesses serving the freight match market and operating leverage on higher organic revenues. The resulting operating margin was 45.2% in the year ended December 31, 2024 as compared to 43.9% in the year ended December 31, 2023.\nIn our Technology Enabled Products segment, net revenues were $1,695.3 for the year ended December 31, 2024 as compared to $1,551.5 for the year ended December 31, 2023. The growth of 9.3% in organic revenues was led by our medical products businesses, excluding our precision measurement business, and growth in our water meter technology business. These increases were partially offset primarily by a decline in our access management businesses. Gross margin increased to 57.6% for the year ended December 31, 2024 as compared to 57.1% for the year ended December 31, 2023, due primarily to improved leverage on higher organic revenues and revenue mix. SG&A expenses as a percentage of net revenues remained consistent at 23.7% in both the years ending December 31, 2024 and 2023. The resulting operating margin was 33.9% in the year ended December 31, 2024 as compared to 33.4% in the year ended December 31, 2023.\nCorporate expenses increased by $40.7 to $267.4, or 3.8% of net revenues, in 2024 as compared to $226.7, or 3.7% of net revenues, in 2023. The dollar increase was due primarily to higher stock-based compensation expense as well as expense associated with settled litigation.\nInterest expense, net, increased by $94.5, or a 57.4% increase, to $259.2 for the year ended December 31, 2024 as compared to $164.7 for the year ended December 31, 2023. The increase was due primarily to higher weighted average debt balances and less interest income earned on our cash and cash equivalents.\nEquity investments gain, net, was $234.6 for the year ended December 31, 2024 due primarily to a $135.6 gain on the sale of our equity investment in Certinia, a $96.4 increase in the fair value of our equity investment in Indicor, and $10.8 of dividend \n27\ndistributions received from Indicor, partially offset by our proportionate share of net loss associated with the investment in Certinia of $9.8 in accordance with the equity method of accounting. Equity investments gain, net, was $165.4 for the year ended December 31, 2023 due primarily to a $140.9 increase in the fair value of our equity investment in Indicor and $32.5 of dividend distributions received from Indicor, partially offset by our proportionate share of net loss associated with the investment in Certinia of $5.2.\nOther expense, net, of $5.0 for the year ended December 31, 2024 was composed primarily of foreign exchange losses at our non-U.S. based subsidiaries.\n \nOther expense, net, of $2.8 for the year ended December 31, 2023 was composed primarily of foreign exchanges losses at our non-U.S. based subsidiaries, partially offset by a gain on the sale of non-operating assets.\nOur 2024 effective income tax rate of 21.2% decreased as compared to our 2023 tax rate of 21.5%, due primarily to the release of valuation allowances, partially offset by a reduction in stock-based compensation tax benefits.\nBacklog is equal to our remaining performance obligations expected to be recognized as revenue within the next 12 months as discussed within Note 1 of the Notes to Consolidated Financial Statements. Backlog decreased 1.6% to $3,105.4 at December 31, 2024 as compared to $3,156.6 at December 31, 2023 due primarily to a decrease in our Technology Enabled Products segment associated with the normalization of supply chain ordering patterns, partially offset by acquisitions and organic growth in our Application Software segment.\nBacklog as of December 31,\n \n2024\n2023\nChange\nApplication Software\n$\n2,274.6 \n$\n2,136.1 \n6.5 \n%\nNetwork Software\n515.8 \n493.6 \n4.5 \n%\nTechnology Enabled Products\n315.0 \n526.9 \n(40.2)\n%\nTotal\n$\n3,105.4 \n$\n3,156.6 \n(1.6)\n%\nFinancial Condition, Liquidity, and Capital Resources\nAll currency amounts are in millions unless specified\nSelected cash flows for the years ended December 31, 2024 and 2023 were as follows:\n \n2024\n2023\nCash provided by (used in) continuing operations from:\nOperating activities\n$\n2,393.2 \n$\n2,037.4 \nInvesting activities\n$\n(3,468.5)\n$\n(2,128.3)\nFinancing activities\n$\n1,069.5 \n$\n(499.5)\nOperating activities – Net cash provided by operating activities from continuing operations increased by 17% to $2,393.2 in 2024 as compared to $2,037.4 in 2023 due primarily to higher net earnings from continuing operations net of non-cash expenses, increased collections on accounts receivable, the absence of the cash payment from the prior year of $45.0 related to the settlement of a patent litigation matter, and timing associated with interest payments on our senior notes issued in 2024, partially offset by higher cash taxes paid.\nInvesting activities – Cash used in investing activities from continuing operations during 2024 was primarily for business acquisitions, most notably Procare and Transact, partially offset by proceeds from the sale of our equity investment in Certinia. Cash used in investing activities from continuing operations during 2023 was primarily for business acquisitions, most notably Syntellis and Replicon.\nFinancing activities – Cash provided by financing activities from continuing operations during 2024 was primarily from the issuance of $2,000.0 of senior notes and net proceeds from stock-based compensation, partially offset by $500.0 of senior notes repaid at maturity, dividend payments, and $235.0 of net repayments on our unsecured revolving credit facility. Cash used in financing activities from continuing operations during 2023 was primarily for $700.0 of senior notes repaid at maturity as well as dividend payments, partially offset by net borrowings of $360.0 under our unsecured revolving credit facility and net proceeds from stock-based compensation.\n28\nNet working capital (total current assets, excluding cash, less total current liabilities, excluding debt) was negative $1,434.6 at December 31, 2024 as compared to negative $1,196.6 at December 31, 2023, due primarily to increased deferred revenue as well as increases in accrued liabilities driven by accrued compensation and interest, partially offset by an increase in accounts receivable. Consistent negative net working capital demonstrates Roper’s continued focus on asset-light business models.\nTotal debt excluding unamortized debt issuance costs was $7,669.2 at December 31, 2024 (28.9% of total capital) as compared to $6,360.2 at December 31, 2023 (26.7% of total capital). Our total debt increased at December 31, 2024 as compared to December 31, 2023 due primarily to the issuance of $2,000.0 of senior notes, partially offset by $500.0 of senior notes repaid at maturity and $235.0 of net repayments on our unsecured revolving credit facility. The net proceeds from the issuance of senior notes were used to repay a portion of the borrowings outstanding under our unsecured credit facility, including borrowings incurred to fund the purchase price of the Transact acquisition, as well as to repay a portion of the senior notes due September 15, 2024. The remaining portion of senior notes due September 15, 2024 were repaid using borrowings under our unsecured credit facility.\nOn July 21, 2022, we entered into a five-year unsecured credit facility (the “Credit Agreement”) among Roper, the financial institutions from time to time party thereto, JPMorgan Chase Bank, N.A., as administrative agent, Bank of America, N.A. and Wells Fargo Bank, N.A., as syndication agents, and Mizuho Bank, Ltd., MUFG Bank, Ltd., PNC Bank, National Association, TD Bank, N.A., Truist Bank, and U.S. Bank, National Association, as documentation agents, which replaced the previous $3,000.0 unsecured credit facility, dated as of September 2, 2020, as amended. The Credit Agreement comprises a five-year $3,500.0 revolving credit facility, which includes availability of up to $150.0 for letters of credit. We may also, subject to compliance with specified conditions, request additional term loans or revolving credit commitments in an aggregate amount not to exceed $500.0.\nThe Credit Agreement requires Roper to maintain a Total Debt to Total Capital Ratio (as defined in the Credit Agreement) of 0.65 to 1.00, or less. Borrowings under the Credit Agreement are prepayable at Roper’s option at any time in whole or in part without premium or penalty.\nWe were in compliance with all debt covenants related to our unsecured credit facility throughout the years ended December 31, 2024 and 2023.\nAt December 31, 2024, we had $7,500.0 of senior unsecured notes, $125.0 of borrowings outstanding under our unsecured revolving credit facility and $6.8 of outstanding letters of credit at December 31, 2024, of which, $6.0 was covered by our lending group thereby reducing our revolving credit capacity commensurately. At December 31, 2024, we also had $44.2 of other debt in the form of short-term borrowings and finance leases.\nWe may redeem some or all of each outstanding series of senior notes at any time or from time to time, at 100% of their principal amount, plus a make-whole premium based on a spread to U.S. Treasury securities.\nSee Note 9 of the Notes to Consolidated Financial Statements included in this Annual Report for additional information regarding our debt.\nCash and cash equivalents held at our foreign subsidiaries totaled $130.8 at December 31, 2024 as compared to $148.3 at December 31, 2023, a decrease of 11.8%. The decrease was primarily due to cash repatriation of $270.9, partially offset by cash generated at our foreign subsidiaries. We intend to repatriate substantially all historical and future earnings.\nCapital expenditures were $66.0 and $68.0 during 2024 and 2023, respectively. Capitalized software expenditures were $45.0 and $40.0 during 2024 and 2023, respectively. Capital expenditures and capitalized software expenditures were relatively consistent as a percentage of annual net revenues in 2024 as compared to 2023. In the future, we expect the aggregate of capital expenditures and capitalized software expenditures as a percentage of annual net revenues to be between 1.0% and 1.5%.\n29\nMaterial Contractual Cash Obligations\nAll currency amounts are in millions\nThe following table quantifies our material contractual cash obligations at December 31, 2024:\nMaterial contractual cash obligations\n 1\n \nPayments due in fiscal year\nTotal\n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal debt\n$\n7,669.2 \n$\n1,044.1 \n$\n700.1 \n$\n825.0 \n$\n800.0 \n$\n1,200.0 \n$\n3,100.0 \nSenior note interest\n1,315.6 \n244.3 \n215.4 \n188.8 \n179.0 \n145.4 \n342.7 \nOperating leases\n221.9 \n51.7 \n43.6 \n36.5 \n28.7 \n20.3 \n41.1 \nPurchase obligations \n2\n1,252.2 \n582.2 \n215.4 \n159.1 \n148.9 \n137.7 \n8.9 \nTotal\n$\n10,458.9 \n$\n1,922.3 \n$\n1,174.5 \n$\n1,209.4 \n$\n1,156.6 \n$\n1,503.4 \n$\n3,492.7 \n1  \nWe have excluded the liability for uncertain tax positions and certain other tax liabilities as we are not able to reasonably estimate the timing of the payments. See Note 8 of the Notes to Consolidated Financial Statements included in this Annual Report.\n2  \nRepresents minimum fixed price purchase commitments that are legally binding across Roper.\nWe believe that internally generated cash flows and the remaining availability under our unsecured credit facility will be adequate to finance our normal operating requirements. Although we maintain an active acquisition program, any future acquisitions will be dependent on numerous factors and it is not feasible to reasonably estimate if or when any such acquisitions will occur and what the impact will be on our business, financial condition, and results of operations. Such acquisitions may be financed by the use of existing credit lines, future cash flows from operations, future divestitures, the proceeds from the issuance of new debt or equity securities, or any combination of these methods, the terms and availability of which will be subject to market and economic conditions generally.\nWe anticipate that our businesses will generate positive cash flows from operating activities, and that these cash flows will permit the reduction of currently outstanding debt in accordance with the repayment schedule. However, the rate at which we can reduce our debt during 2025 (and reduce the associated interest expense) will be affected by, among other things, the financing and operating requirements of any new acquisitions, the financial performance of our existing companies, the impact of geopolitical and economic uncertainties, and the financial markets generally. None of these factors can be predicted with certainty.\nRecently Issued Accounting Standards\nSee Note 1 of the Notes to Consolidated Financial Statements included in this Annual Report for information regarding the effect of new accounting pronouncements on our Consolidated Financial Statements.\n30",
  "item2": null
}