{
  "source_file": "rop-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nYou should read the following discussion in conjunction with Management’s Discussion and Analysis of Financial Condition and Results of Operations included in our Annual Report on Form 10-K for the year ended December 31, 2024 (“Annual Report”) as filed on February 24, 2025 with the U.S. Securities and Exchange Commission (“SEC”) and the Notes to Condensed Consolidated Financial Statements included elsewhere in this report.\nInformation About Forward-Looking Statements\nThis report includes “forward-looking statements” within the meaning of the federal securities laws. In addition, we, or our executive officers on our behalf, may from time to time make forward-looking statements in reports and other documents we file with the SEC or in connection with oral statements made to the press, potential investors, or others. All statements that are not historical facts are “forward-looking statements.” Forward-looking statements may be indicated by words or phrases such as “anticipate,” “estimate,” “plans,” “expects,” “projects,” “should,” “will,” “believes,” “intends,” and similar words and phrases. These statements reflect management’s current beliefs and are not guarantees of future performance. They involve risks and uncertainties that could cause actual results to differ materially from those expressed or implied in any forward-looking statement.\nExamples of forward-looking statements in this report include but are not limited to statements regarding operating results, the success of our operating plans, our expectations regarding our ability to generate cash and reduce debt and associated interest expense, profit and cash flow expectations, the prospects for newly acquired businesses to be integrated and contribute to future growth, and our expectations regarding growth through acquisitions. Important assumptions relating to the forward-looking statements include, among others, demand for our products, the cost, timing, and success of product upgrades and new product introductions, raw materials costs, expected pricing levels, expected outcomes of pending litigation, competitive conditions, and general economic conditions. These assumptions could prove inaccurate. Although we believe that the estimates and projections reflected in the forward-looking statements are reasonable, our expectations may prove to be incorrect. Important factors that could cause actual results to differ materially from estimates or projections contained in the forward-looking statements include but are not limited to:\n•\ngeneral economic conditions;\n•\ndifficulty making acquisitions, including receiving the necessary regulatory approvals (including clearance under the Hart-Scott-Rodino Act in the U.S. and similar antitrust regulations in foreign countries), and successfully integrating acquired businesses;\n•\nany unforeseen liabilities associated with future acquisitions;\n•\ninformation technology system failures, data security breaches, network disruptions, and cybersecurity events, including any litigation arising therefrom;\n•\nfailure to comply with new data privacy laws and regulations, including any litigation arising therefrom;\n•\nrisks and costs associated with our international sales and operations;\n•\nvolatile interest rates;\n•\nlimitations on our business imposed by our indebtedness;\n•\nproduct liability, litigation, and insurance risks;\n•\nfuture competition;\n•\nreduction of business with large customers;\n•\nrisks associated with government contracts;\n•\nchanges in the supply of, or price for, labor, energy, raw materials, parts, and components, including as a result of inflation or potential supply chain constraints;\n•\npotential write-offs of our goodwill and other intangible assets;\n•\nour ability to successfully develop new products;\n•\nfailure to protect our intellectual property;\n•\nunfavorable changes in foreign exchange rates;\n•\nrisks related to changing U.S. and foreign trade policies, including increased trade restrictions or tariffs (including repeal of the United States-Mexico-Canada Agreement);\n•\nincreased warranty exposure;\n•\nenvironmental compliance costs and liabilities;\n•\nthe effect of, or change in, government regulations (including tax);\n•\nrisks associated with the use of artificial intelligence;\n•\nthe duration and impact of the U.S. government shutdown;\n•\neconomic disruption caused by armed conflicts (such as the war in Ukraine and the conflicts in the Middle East), terrorist attacks, health crises, or other unforeseen geopolitical events; and\n18\n•\nthe factors discussed in other reports we file with the SEC from time to time.\nYou should not place undue reliance on any forward-looking statements, which are based on current expectations. Further, forward-looking statements speak only as of the date they are made, and we undertake no obligation to publicly update any of these statements in light of new information or future events.\nOverview\nRoper is a diversified technology company. Roper has a proven, long-term, successful track record of compounding cash flow and increasing shareholder value. We operate market leading businesses that design and develop vertical software and technology enabled products for a variety of defensible niche markets.\nWe pursue consistent and sustainable growth in revenue, earnings, and cash flow by enabling continuous improvement in the operating performance of our businesses and by acquiring other businesses that offer high value-added software, services, technology-enabled products, and solutions that we believe are capable of realizing growth while maintaining high margins.\nCritical Accounting Policies\nThere were no material changes during the nine months ended September 30, 2025 to the items that we disclosed as our critical accounting policies and estimates in “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report.\nRecently Issued Accounting Standards\nInformation regarding new accounting pronouncements is included in Note 2 of the Notes to Condensed Consolidated Financial Statements.\n19\nResults of Operations\nAll currency amounts are in millions, percentages are of net revenues\nPercentages may not sum due to rounding.\nThe following table sets forth selected information for the periods indicated:\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n2025\n2024\n2025\n2024\nNet revenues:\nApplication Software\n$\n1,161.0 \n$\n984.4 \n$\n3,324.1 \n$\n2,811.4 \nNetwork Software\n413.4 \n367.1 \n1,174.7 \n1,102.1 \nTechnology Enabled Products\n443.1 \n413.1 \n1,345.1 \n1,248.6 \nTotal\n$\n2,017.5 \n$\n1,764.6 \n$\n5,843.9 \n$\n5,162.1 \nGross margin:\nApplication Software\n69.0 \n%\n68.3 \n%\n68.4 \n%\n69.0 \n%\nNetwork Software\n83.9 \n%\n84.9 \n%\n83.7 \n%\n84.9 \n%\nTechnology Enabled Products\n57.6 \n%\n57.4 \n%\n58.3 \n%\n57.7 \n%\nTotal\n69.5 \n%\n69.2 \n%\n69.2 \n%\n69.7 \n%\nSelling, general and administrative expenses:\nApplication Software\n(41.2)\n%\n(42.0)\n%\n(41.5)\n%\n(42.3)\n%\nNetwork Software\n(40.8)\n%\n(39.7)\n%\n(39.9)\n%\n(40.3)\n%\nTechnology Enabled Products\n(23.7)\n%\n(23.2)\n%\n(23.5)\n%\n(23.7)\n%\nTotal\n(37.3)\n%\n(37.1)\n%\n(37.1)\n%\n(37.4)\n%\nSegment operating margin:\nApplication Software\n27.8 \n%\n26.4 \n%\n26.9 \n%\n26.7 \n%\nNetwork Software\n43.1 \n%\n45.2 \n%\n43.8 \n%\n44.7 \n%\nTechnology Enabled Products\n33.9 \n%\n34.2 \n%\n34.8 \n%\n34.0 \n%\nTotal\n32.3 \n%\n32.1 \n%\n32.1 \n%\n32.3 \n%\nCorporate administrative expenses\n \n*\n(3.9)\n%\n(4.0)\n%\n(3.9)\n%\n(3.8)\n%\nIncome from operations\n28.4 \n28.1 \n28.2 \n28.5 \nInterest expense, net\n(4.4)\n(3.8)\n(4.0)\n(3.6)\nEquity investments gain (loss), net\n0.6 \n2.1 \n(0.3)\n1.8 \nOther income (expense), net\n0.1 \n0.1 \n— \n— \nEarnings before income taxes\n24.7 \n26.5 \n24.0 \n26.7 \nIncome taxes\n(4.9)\n(5.6)\n(5.0)\n(5.6)\nNet earnings\n19.8 \n%\n20.8 \n%\n19.0 \n%\n21.1 \n%\n*\n \nIncludes unallocated corporate general and administrative expenses and enterprise-wide stock-based compensation.\n20\nThree Months Ended September 30, 2025 compared to the Three Months Ended September 30, 2024\nNet revenues for the three months ended September 30, 2025 were $2,017.5 as compared to $1,764.6 for the three months ended September 30, 2024, an increase of 14.3%. The components of revenue growth for the three months ended September 30, 2025 were as follows:\nApplication Software\nNetwork Software\nTechnology Enabled Products\nRoper\nTotal Revenue Growth\n17.9 \n%\n12.6 \n%\n7.3 \n%\n14.3 \n%\nLess Impact of:\nAcquisitions\n11.6 \n6.5 \n1.0 \n8.0 \nForeign Exchange\n0.4 \n0.1 \n0.2 \n0.3 \nOrganic Revenue Growth\n5.9 \n%\n6.0 \n%\n6.1 \n%\n6.0 \n%\nIn our Application Software segment, net revenues in the third quarter of 2025 grew 17.9% to $1,161.0 as compared to $984.4 in the third quarter of 2024, led by acquisition contribution from Transact and CentralReach. The growth of 5.9% in organic revenues was broad-based across the segment, led by our businesses serving the acute healthcare, property and casualty insurance, and legal markets. Gross margin increased to 69.0% in the third quarter of 2025 as compared to 68.3% in the third quarter of 2024 due primarily to improved leverage on higher organic revenues, partially offset by a lower gross margin profile associated with the higher payments revenue mix at Transact. SG&A expenses as a percentage of net revenues improved to 41.2% in the third quarter of 2025 as compared to 42.0% in the third quarter of 2024 due primarily to cost synergies resulting from the integration of Transact with CBORD and operating leverage on higher organic revenues, partially offset by higher amortization of acquired intangibles from the acquisition of CentralReach. As a result, operating margin was 27.8% in the third quarter of 2025 as compared to 26.4% in the third quarter of 2024.\nIn our Network Software segment, net revenues in the third quarter of 2025 grew 12.6% to $413.4 as compared to $367.1 in the third quarter of 2024, led by acquisition contribution from Subsplash. The growth of 6.0% in organic revenues was led by our network software businesses serving the alternate site healthcare, construction, and freight match markets, partially offset by a decline in our media and entertainment software business primarily related to end-market conditions. Gross margin decreased to 83.9% in the third quarter of 2025 as compared to 84.9% in the third quarter of 2024 due primarily to a lower gross margin profile associated with the higher payments revenue mix at Subsplash as well as revenue mix. SG&A expenses as a percentage of net revenues increased to 40.8% in the third quarter of 2025 as compared to 39.7% in the third quarter of 2024 due primarily to SG&A profiles associated with our third quarter 2025 acquisitions, Subsplash and Convoy, including higher amortization of acquired intangibles. As a result, operating margin was 43.1% in the third quarter of 2025 as compared to 45.2% in the third quarter of 2024.\nIn our Technology Enabled Products segment, net revenues in the third quarter of 2025 grew 7.3% to $443.1 as compared to $413.1 in the third quarter of 2024. The growth of 6.1% in organic revenues was broad-based across the segment, led by our medical products businesses, highlighted by our precision measurement business, and growth in our access management businesses. Gross margin increased to 57.6% in the third quarter of 2025 as compared to 57.4% in the third quarter of 2024 due primarily to revenue mix as well as improved leverage on higher organic revenues at our precision measurement business. SG&A expenses as a percentage of net revenues increased to 23.7% in the third quarter of 2025 as compared to 23.2% in the third quarter of 2024 due primarily to revenue mix. The resulting operating margin was 33.9% in the third quarter of 2025 as compared to 34.2% in the third quarter of 2024.\nCorporate expenses increased to $78.3, or 3.9% of net revenues, in the third quarter of 2025 as compared to $70.3, or 4.0% of net revenues, in the third quarter of 2024. The dollar increase was due primarily to higher stock-based compensation expense.\nInterest expense, net, increased to $89.7 for the third quarter of 2025 as compared to $67.7 for the third quarter of 2024 due primarily to a higher weighted-average fixed-rate debt balance and interest rate.\nEquity investments activity, net, was a gain of $12.9 in the third quarter of 2025 due primarily to a $16.3 increase in the fair value of our equity investment in Indicor. Equity investments activity, net, was a gain of $37.4 in the third quarter of 2024 due primarily to an increase in the fair value of our equity investment in Indicor. Changes in the fair value of our Indicor investment are primarily due to fluctuations in the equity values of comparable guideline public companies.\n21\nIncome taxes as a percentage of pretax earnings decreased to 20.0% for the third quarter of 2025 as compared to 21.3% for the third quarter of 2024, due primarily to favorable rate impact of 5.2% from the recognition of a net tax benefit associated with legal entity restructuring, offset by approximately 3.1% of rate impact related to the OBBBA and 1.2% of rate impact from the nonrecurrence of prior year valuation allowance releases.\nBacklog is equal to our remaining performance obligations expected to be recognized as revenue within the next 12 months as discussed in Note 13 of the Notes to Condensed Consolidated Financial Statements. Backlog increased 4.9% to $3,174.0 at September 30, 2025 as compared to $3,026.1 at September 30, 2024. Organic growth in backlog was driven by our software segments, partially offset by a decrease in our Technology Enabled Products segment associated with the normalization of supply chain ordering patterns.\nBacklog as of September 30,\n2025\n2024\nApplication Software\n$\n2,326.8 \n$\n2,150.3 \nNetwork Software\n549.8 \n487.0 \nTechnology Enabled Products\n297.4 \n388.8 \nTotal\n$\n3,174.0 \n$\n3,026.1 \nNine Months Ended September 30, 2025 compared to the Nine Months Ended September 30, 2024\nNet revenues for the nine months ended September 30, 2025 were $5,843.9 as compared to $5,162.1 for the nine months ended September 30, 2024, an increase of 13.2%. The components of revenue growth for the nine months ended September 30, 2025 were as follows:\nApplication Software\nNetwork Software\nTechnology Enabled Products\nRoper\nTotal Revenue Growth\n18.2 \n%\n6.6 \n%\n7.7 \n%\n13.2 \n%\nLess Impact of:\nAcquisitions\n11.9 \n2.9 \n0.7 \n7.3 \nForeign Exchange\n0.2 \n(0.1)\n(0.1)\n0.1 \nOrganic Revenue Growth\n6.1 \n%\n3.8 \n%\n7.1 \n%\n5.8 \n%\nIn our Application Software segment, net revenues in the nine months ended September 30, 2025 grew 18.2% to $3,324.1 as compared to $2,811.4 in the nine months ended September 30, 2024, led by acquisition contribution from Transact, CentralReach, and Procare. The growth of 6.1% in organic revenues was broad-based across the segment, led by our businesses serving the acute healthcare, property and casualty insurance, and legal markets. Gross margin decreased to 68.4% in the nine months ended September 30, 2025 as compared to 69.0% in the nine months ended September 30, 2024 due primarily to a lower gross margin profile associated with the higher payments revenue mix at Transact, partially offset by improved leverage on higher organic revenues. SG&A expenses as a percentage of net revenues improved to 41.5% in the nine months ended September 30, 2025 as compared to 42.3% in the nine months ended September 30, 2024, due primarily to operating leverage on higher organic revenues and a lower SG&A profile associated with the higher payments revenue mix at Transact. These benefits were partially offset by higher amortization of acquired intangibles from the acquisition of CentralReach. As a result, operating margin was 26.9% in the nine months ended September 30, 2025 as compared to 26.7% in the nine months ended September 30, 2024.\nIn our Network Software segment, net revenues in the nine months ended September 30, 2025 grew 6.6% to $1,174.7 as compared to $1,102.1 in the nine months ended September 30, 2024, led by acquisition contribution from Subsplash. The growth of 3.8% in organic revenues was led by our network software businesses serving the construction, freight match, and alternate site healthcare markets. These increases were partially offset by a decline in our media and entertainment software business primarily related to end-market conditions. Gross margin decreased to 83.7% in the nine months ended September 30, 2025 as compared to 84.9% in the nine months ended September 30, 2024 due primarily to revenue mix as well as a lower gross margin profile associated with the higher payments revenue mix at Subsplash. SG&A expenses as a percentage of net revenues improved to 39.9% in the nine months ended September 30, 2025 as compared to 40.3% in the nine months ended September 30, 2024 due primarily to operating leverage on higher organic revenues, partially offset by higher amortization of \n22\nacquired intangibles and SG&A profiles associated with acquisitions. As a result, operating margin was 43.8% in the nine months ended September 30, 2025 as compared to 44.7% in the nine months ended September 30, 2024.\nIn our Technology Enabled Products segment, net revenues in the nine months ended September 30, 2025 grew 7.7% to $1,345.1 as compared to $1,248.6 in the nine months ended September 30, 2024. The growth of 7.1% in organic revenues was broad-based across the segment, led by our medical products businesses, highlighted by our precision measurement business, and growth in our water meter technology business. Gross margin increased to 58.3% in the nine months ended September 30, 2025 as compared to 57.7% in the nine months ended September 30, 2024 due primarily to revenue mix. SG&A expenses as a percentage of net revenues improved to 23.5% in the nine months ended September 30, 2025 as compared to 23.7% in the nine months ended September 30, 2024 due primarily to operating leverage on higher organic revenues. The resulting operating margin was 34.8% in the nine months ended September 30, 2025 as compared to 34.0% in the nine months ended September 30, 2024.\nCorporate expenses increased to $229.3, or 3.9% of net revenues, in the nine months ended September 30, 2025 as compared to $194.5, or 3.8% of net revenues, in the nine months ended September 30, 2024. The dollar increase was due primarily to higher compensation expense, predominantly higher stock-based compensation expense.\nInterest expense, net, increased to $231.7 for the nine months ended September 30, 2025 as compared to $188.4 for the nine months ended September 30, 2024 due primarily to a higher weighted-average fixed-rate debt balance and interest rate, partially offset by a lower weighted-average revolving credit facility balance.\nEquity investments activity, net, was a loss of $14.9 in the nine months ended September 30, 2025 due primarily to a $16.3 decrease in the fair value of our equity investment in Indicor. Equity investments activity, net, was a gain of $93.6 in the nine months ended September 30, 2024 due primarily to an increase in the fair value of our equity investment in Indicor. Changes in the fair value of our Indicor investment are primarily due to fluctuations in the equity values of comparable guideline public companies.\nIncome taxes as a percentage of pretax earnings remained relatively consistent at 20.9% for the nine months ended September 30, 2025 as compared to 21.0% for the nine months ended September 30, 2024.\nFinancial Condition, Liquidity, and Capital Resources\nAll currency amounts are in millions\nSelected cash flows for the nine months ended September 30, 2025 and 2024 were as follows:\nNine months ended September 30,\nCash provided by (used in):\n2025\n2024\nOperating activities\n$\n1,802.3 \n$\n1,671.0 \nInvesting activities\n$\n(3,354.0)\n$\n(3,528.2)\nFinancing activities\n$\n1,654.3 \n$\n1,901.7 \nOperating activities – Net cash provided by operating activities increased by 8% to $1,802.3 in the nine months ended September 30, 2025 as compared to $1,671.0 in the nine months ended September 30, 2024 primarily due to higher net earnings net of non-cash expenses, and a benefit to cash income taxes paid in connection with the repeal of the requirement to capitalize and amortize domestic R&D expenditures under Internal Revenue Code Section 174. These increases were partially offset by less cash provided by net working capital primarily related to changes in the balances of accounts receivable and accrued expenses, including the payment of $24.0 related to settled litigation, and $30.2 of cash taxes paid in 2025 associated with our sale of the equity investment in Certinia in 2024.\nInvesting activities – Cash used in investing activities during the nine months ended September 30, 2025 was primarily for the acquisitions of CentralReach, Subsplash, Convoy, and Orchard Software. Cash used in investing activities during the nine months ended September 30, 2024 was primarily for the acquisitions of Procare and Transact.\nFinancing activities – Cash provided by financing activities during the nine months ended September 30, 2025 was primarily from the issuance of $2,000.0 of senior notes in August 2025, net borrowings under our unsecured revolving credit facility primarily to fund the acquisitions of CentralReach and Subsplash, and net proceeds from stock-based compensation, partially offset by $700.0 of senior notes repaid at maturity in September 2025 and dividend payments. Cash provided by financing \n23\nactivities during the nine months ended September 30, 2024 was primarily from the issuance of $2,000.0 of senior notes in August 2024, net borrowings under our unsecured revolving credit facility to fund the acquisitions of Procare and Transact, and net proceeds from stock-based compensation, partially offset by $500.0 of senior notes repaid at maturity in September 2024 and dividend payments.\nTotal debt consisted of the following:\nAs of September 30, 2025\nFixed-rate senior notes\n$\n8,800.0 \nUnsecured revolving credit facility\n710.0 \nOther\n2.1 \nLess: Deferred financing costs\n(58.0)\nTotal debt, net of deferred financing costs\n9,454.1 \nLess: Current portion, net of deferred financing costs\n(300.0)\nLong-term debt, net of deferred financing costs\n$\n9,154.1 \nThe interest rate on borrowings under the $3,500.0 unsecured revolving credit facility is calculated based upon various recognized indices plus a margin as defined in the credit agreement. At September 30, 2025, we had $710.0 of borrowings outstanding under our unsecured revolving credit facility and $7.1 of outstanding letters of credit.\nIn relation to our total cash and cash equivalents, amounts held at our foreign subsidiaries represented 49.6% or $158.7 at September 30, 2025 as compared to 69.5% or $130.8 at December 31, 2024. The increase in foreign cash was due primarily to the cash generated at our foreign subsidiaries during the nine months ended September 30, 2025, partially offset by cash repatriation of $235.7. We intend to repatriate substantially all historical and future earnings.\nWe expect existing cash balances, together with cash generated by our operations and amounts available under our credit facility, will be sufficient to fund our operating requirements for the foreseeable future.\nWe were in compliance with all debt covenants related to our unsecured credit facility throughout the nine months ended September 30, 2025.\nNet working capital (total current assets, excluding cash, less total current liabilities, excluding debt) was negative $1,342.0 at September 30, 2025 as compared to negative $1,434.6 at December 31, 2024. The change in net working capital was primarily driven by changes in tax-related balances, increases in accounts receivable as well as prepaid expenses and other current assets, and the payment for settled litigation, partially offset by an increase in deferred revenue predominantly due to the timing of SaaS renewals associated with our Frontline business. \nTotal debt, net of deferred financing costs was $9,454.1 at September 30, 2025 as compared to $7,623.0 at December 31, 2024. Our total debt increased at September 30, 2025 as compared to December 31, 2024 due primarily to the issuance of $2,000.0 of senior notes and net borrowings on our unsecured revolving credit facility, partially offset by $700.0 of senior notes repaid at maturity in September 2025. The net proceeds from the issuance of senior notes were used to repay a portion of the borrowings outstanding under our unsecured credit facility associated with our 2025 acquisitions, as well as to repay a portion of the senior notes due in 2025. Our leverage is presented in the following table:\nSeptember 30,\n2025\nDecember 31,\n2024\nTotal debt, net of deferred financing costs\n$\n9,454.1 \n$\n7,623.0 \nLess: Cash and cash equivalents\n(320.0)\n(188.2)\nNet debt\n9,134.1 \n7,434.8 \nStockholders’ equity\n19,992.8 \n18,867.6 \nTotal net capital\n$\n29,126.9 \n$\n26,302.4 \nNet debt / Total net capital\n31.4 \n%\n28.3 \n%\n24\nOn September 15, 2025, $700.0 of 1.000% senior notes due 2025 were repaid at maturity using borrowings under our unsecured revolving credit facility and a portion of the net proceeds from the issuance of the Notes.\nCapital expenditures were $37.6 for the nine months ended September 30, 2025 as compared to $39.2 for the nine months ended September 30, 2024. Capitalized software expenditures were $42.8 for the nine months ended September 30, 2025 as compared to $33.4 for the nine months ended September 30, 2024. We expect the aggregate of capital expenditures and capitalized software expenditures for 2025 to be comparable to prior years as a percentage of net revenues.\nThe enactment of the OBBBA on July 4, 2025 introduced various tax reform provisions, among which include the repeal of the requirement to capitalize and amortize domestic R&D expenditures. Currently, the OBBBA is expected to provide a full year 2025 cash tax benefit of approximately $150, with a cash tax benefit of approximately $120 expected in 2026. The legislation has multiple effective dates and is not expected to have a significant impact on effective tax rate in future years. We continue to assess the broader impacts of the OBBBA as further information becomes available.\nOutlook\nCurrent geopolitical and economic uncertainties, including inflation, tariffs and changes in trade policy, supply chain disruptions, and labor shortages, could adversely affect our business prospects. An armed conflict (such as the ongoing war in Ukraine, as well as the conflicts in the Middle East), significant terrorist attack, other global conflict, widespread cybersecurity event or information technology failure, or public health crisis could cause changes in world economies that would adversely affect us. It is impossible to isolate each of these potential factor’s future effects on current economic conditions or any of our businesses. It is also impossible to predict with any reasonable degree of certainty what or when any additional events may occur that also would similarly disrupt the economy and have an adverse impact on our businesses.\nWe maintain an active acquisition program; however, future acquisitions will be dependent on numerous factors and it is not feasible to reasonably estimate if or when any such acquisitions will occur and what the impact will be on our business, financial condition, and results of operations. Such acquisitions may be financed by the use of existing credit agreements, future cash flows from operations, future divestitures, the proceeds from the issuance of new debt or equity securities, or any combination of these methods, the terms and availability of which will be subject to market and economic conditions generally.\nWe anticipate that our businesses will generate positive cash flows from operating activities, and that these cash flows will permit the reduction of currently outstanding debt in accordance with the repayment schedule. However, the rate at which we can reduce our debt (and reduce the associated interest expense) will be affected by, among other things, the financing and operating requirements of any new acquisitions, the financial performance of our existing companies, any allocation of capital toward share repurchases, the impact of the aforementioned geopolitical and economic uncertainties, and the financial markets generally. None of these factors can be predicted with certainty.\n25"
}