{
  "source_file": "rost-20250201.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nRoss Stores, Inc. and its subsidiaries (“we”, “our”, or the “Company”) operate two brands of off-price retail apparel and home fashion\n \nstores—Ross Dress for Less\n®\n (“Ross”) and dd’s DISCOUNTS\n®\n. \nRoss is the largest off-price apparel and home fashion chain in the United States, with 1,831 locations in 43 states, the District of Columbia, and Guam, as of February 1, 2025. Ross offers first-quality, in-season, name brand and designer apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 60% off department and specialty store regular prices every day. Ross’ target customers are primarily from middle income households. \nWe also operate 355 dd’s DISCOUNTS stores in 22 states as of February 1, 2025. dd’s DISCOUNTS features more moderately-priced first-quality, in-season, name brand apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 70% off moderate department and discount store regular prices every day. The typical dd’s DISCOUNTS store is located in an established shopping center in a densely populated urban or suburban neighborhood, and its target customers typically come from households with lower to more moderate incomes.\nBoth our Ross and dd’s DISCOUNTS brands target value-driven customers. The decisions we make, from merchandising, purchasing, and pricing, to the locations of our stores, are based on these customer profiles. We believe that both brands derive a competitive advantage by offering a wide assortment of product within each of our merchandise categories, in organized and easy-to-shop in-store environments.\nOur mission is to offer competitive values to our target customers by focusing on the following key strategic objectives:\n•\nMaintain an appropriate level of recognizable brands, labels, and fashions at strong discounts throughout the store.\n•\nMeet customer needs on a local basis.\n•\nDeliver an in-store shopping experience that reflects the expectations of the off-price customer.\n•\nManage real estate growth to compete effectively across all our markets.\nOur fiscal years ended February 1, 2025, February 3, 2024, and January 28, 2023 are referred to as fiscal 2024, fiscal 2023, and fiscal 2022, respectively. Fiscal 2023 was a 53-week year. Fiscal 2024 and 2022 were each 52-week years.\nMerchandising, Purchasing, and Pricing\nWe seek to provide our customers with a wide assortment of first-quality, in-season, brand name and designer apparel, accessories, footwear, and home merchandise for the entire family at savings of 20% to 60% below department and specialty store regular prices every day at Ross, and 20% to 70% below moderate department and discount store regular prices at dd’s DISCOUNTS. We aim to sell recognizable brand name merchandise that is on trend and fashionable in each category. New merchandise typically is received from three to six times per week at both Ross and dd’s DISCOUNTS stores. Our buyers review their merchandise assortments on a weekly basis, enabling them to respond to selling trends and buying opportunities in the market. Our merchandising strategy is reflected in our marketing, which emphasizes a strong value message. Our stores offer a “treasure-hunt” shopping experience where customers can find great savings every day on a broad assortment of brand name bargains for the family and the home.\nMerchandising. \nOur merchandising strategy incorporates a combination of off-price buying techniques to purchase advance-of-season, in-season, and past-season merchandise for both Ross and dd’s DISCOUNTS. We believe merchandise with nationally recognized name brands sold at compelling discounts will continue to be an important determinant of our success. We generally leave the brand name label on the merchandise we sell.\n3\nWe establish merchandise assortments that we believe are attractive to our target customers. We generally offer a large selection within each classification of our merchandise, with a wide assortment of vendors, labels, prices, colors, styles, and fabrics within each size or item. Our merchandise offerings include apparel, footwear, home accents and furniture, bed and bath, beauty, accessories, toys, gourmet food, luggage, electronics, pet accessories, jewelry and watches, and cookware.\nPurchasing. \nWe have a large network of merchandise vendors and manufacturers for both Ross and dd’s DISCOUNTS, and believe we have adequate sources of first-quality merchandise to meet our requirements. We purchase the majority of our merchandise directly from manufacturers.\nWe believe our ability to effectively execute certain off-price buying strategies is a key factor in our success. Our buyers use a number of methods that enable us to offer our customers brand name and designer merchandise at strong discounts every day relative to department and specialty stores for Ross, and to moderate department and discount stores for dd’s DISCOUNTS. By purchasing later in the merchandise buying cycle than department, specialty, and discount stores, we are able to take advantage of imbalances between retailers’ demand for products and manufacturers’ supply of those products.\nWe typically do not require that vendors or manufacturers provide promotional allowances, co-op advertising allowances, return privileges, drop shipments to stores, or delayed deliveries of merchandise. For most orders, delivery is made to one of our distribution centers. These flexible requirements further enable our buyers to obtain significant discounts on purchases.\nThe merchandise that we offer in all of our stores is acquired through opportunistic purchases created by manufacturer and brand overruns and canceled orders, both during and at the end of a season (“close-out” purchases), and production direct from brands and factories (“upfront” purchases). We also source merchandise under in-house brands or vendor brands. Upon receipt, merchandise can be shipped to stores in-season or can be stored in our warehouses as “packaway” merchandise.\nPackaway merchandise is purchased with the intent that it will be stored in our warehouses until a later date, which may even be the beginning of the same selling season in the following year. Packaway purchases are an effective method of increasing the percentage of prestige and national brands at competitive savings within our merchandise assortments. The timing of the release of packaway inventory to our stores is principally driven by the product mix and seasonality of the merchandise, and its relation to our store merchandise assortment plans. As such, the aging of packaway varies by merchandise category and seasonality of purchase, but typically packaway remains in storage less than six months.\nIn fiscal 2024, we continued our emphasis on this important sourcing strategy in response to compelling opportunities available in the marketplace. As of February 1, 2025 and February 3, 2024, packaway accounted for approximately 41% and 40% of total inventories, respectively.\nOur primary buying offices are located in New York City and Los Angeles, the nation’s two largest apparel markets. We also operate a smaller buying office located in Boston. \nThese strategic locations allow our buyers to be in the market frequently, sourcing opportunities and negotiating purchases with vendors and manufacturers. Thes\ne locations also enable our buyers to strengthen vendor relationships—a key element to the success of our off-price buying strategies.\nAt the end of fiscal 2024, we had over 800 merchants for Ross and dd’s DISCOUNTS combined. The Ross and dd’s DISCOUNTS buying organizations are separate and distinct, with each organization led by its own chief merchandising officer with a team of merchandise management, buyers, and assistant buyers. Ross and dd’s DISCOUNTS buyers have on average over seven years of experience, including merchandising positions with other retailers. We expect to make continued investments in our merchant organization to further develop our relationships with our manufacturers and vendors. Our ongoing objective is to strengthen our ability to procure the most desirable brands and fashions at competitive discounts.\nThe off-price buying strategies utilized by our experienced team of merchants enable us to purchase Ross merchandise at net prices that are lower than prices paid by department and specialty stores, and to purchase dd’s DISCOUNTS merchandise at net prices that are lower than prices paid by moderate department and discount stores.\n4\nPricing. \nWe sell brand name merchandise at Ross that is priced 20% to 60% below most department and specialty store regular prices. At dd’s DISCOUNTS, we sell more moderate brand name merchandise that is priced 20% to 70% below most moderate department and discount store regular prices. Our pricing is reflected on most of our price tags, which display our selling price as well as the comparable value for that item in department and specialty stores for Ross merchandise, or in more moderate department and discount stores for dd’s DISCOUNTS merchandise.\nOur pricing strategy at Ross differs from that of a department or specialty store. We purchase our merchandise at lower prices and mark it up less than a department or specialty store. This strategy enables us to offer customers consistently low prices and compelling value. Our buyers review their departments in our stores for possible markdowns based on the rate of sale on a weekly basis, as well as at the end of fashion seasons, to promote faster turnover of merchandise inventory and to accelerate the flow of fresh product to our stores. A similar pricing strategy is in place at dd’s DISCOUNTS where prices are compared to those in moderate department and discount stores.\nStores\nAs of February 1, 2025, we operated a total of 2,186 stores, comprised of 1,831 Ross stores and 355 dd’s DISCOUNTS stores. Our stores are located predominantly in community and neighborhood shopping centers in heavily populated urban and suburban areas. Where the size of the market and real estate opportunities permit, our real estate strategy is to cluster Ross stores with the objective to increase our market penetration and to benefit from economies of scale in advertising, distribution, field management, and other costs. When evaluating a new store location, we consider factors such as the availability and quality of potential sites, demographic characteristics, competition, and population density of the local trade area. In addition, we continue to consider opportunistic real estate acquisitions. Where possible, we obtain sites in buildings requiring minimal alterations, allowing us to establish stores in new locations in a relatively short period of time and at reasonable costs in a given market. We do the same for dd’s DISCOUNTS stores.\nWe believe a key element of our success at both Ross and dd’s DISCOUNTS is our organized and easy-to-shop in-store environment, which allows customers to shop at their own pace. While our stores promote a self-service, treasure-hunt shopping experience, the layouts are designed to enhance customer convenience in their merchandise presentation, dressing rooms, checkout, and merchandise return areas. Our store’s sales area is based on a prototype single floor design with a racetrack aisle layout. A customer can locate desired departments by signs displayed just below the ceiling of each department. We enable our customers to select among sizes and styles through prominent category and sizing markers. Our stores have shopping carts and/or baskets available at the entrance for customer convenience. Cash registers are primarily located at store exits for customer ease and efficient staffing.\nWe accept a variety of payment methods. We provide refunds or store credit on all merchandise (not used, worn, or altered) returned with a receipt within 30 days. Merchandise returns having a receipt older than 30 days are exchanged or refunded with store credit.\nOperating Costs\nConsistent with the other aspects of our business strategy, we strive to keep operating costs as low as possible. Among the factors which have enabled us to do this are: labor costs that are generally lower than full-price department and specialty stores, due to a store design that creates a self-service retail format and due to the utilization of labor saving technologies; economies of scale with respect to general and administrative costs resulting from centralized merchandising, marketing, and purchasing decisions; and flexible store layout criteria which facilitate conversion of existing buildings to our formats.\nInformation Systems\nWe continue to invest in new information systems and technology to provide a platform for growth over the next several years. Current initiatives include continued enhancements to our stores, supply chain, merchandising, and cybersecurity systems. These initiatives are intended to support future growth, the execution and achievement of our plans, efficiency improvement, ongoing stability, and compliance.\n5\nDistribution\nWe operate distribution processing facilities where we receive and ship all of our merchandise to our stores. These distribution centers are large, highly automated, and built to suit our specific off-price business model. We also operate warehouse facilities for packaway storage. \nWe utilize a combination of owned, leased, and third-party cross-dock facilities to distribute merchandise from distribution centers to stores on a regional basis. Shipments are made by contract carriers to the stores three to six times per week depending on location.\nWe believe that our distribution centers and warehouses with their current expansion capabilities will provide adequate processing and storage capacity to support our near term store growth plans. Information on the size and locations of our distribution centers and warehouse facilities is found in ITEM 2. PROPERTIES.\nMarketing and Advertising\nWe use a variety of marketing and advertising media to communicate our value proposition to customers—savings off the same brands carried at department or specialty stores every day. This includes a mix of traditional and streaming television, digital channels, and new store grand openings. We continue to shift our marketing and advertising towards digital channels, including social media, digital video, and digital audio, to reflect changes in media consumption. Our social media strategy includes influencer marketing and user generated content. We believe that a mix of channels and marketing strategies is important to effectively reach our customers.\nTrademarks\nOur principal trademarks are ROSS\n®\n, Ross Dress For Less\n®\n, and dd’s DISCOUNTS\n®\n, which are registered in the United States and in certain other countries. We expect our rights in these trademarks to endure in locations where we use them for as long as our use continues.\nHuman Capital\nAs of February 1, 2025, we had approximately \n107,000\n total a\nssociates, which includes both full- and part-time associates in our stores, distribution centers, and buying and corporate offices. Over 85% of these associates worked in our retail stores. Additionally, we hire temporary associates, especially during peak seasons. We have no associates who are covered by a collective bargaining agreement. Management considers the relationship between the Company and our associates to be strong.\nOur associates play essential roles not only in delivering great values to our customers but also in evolving and strengthening the culture at Ross. We strive to have a workforce that reflects our values, supports our business growth, and strengthens our communities. Throughout our organization, we recognize and appreciate the importance of attracting, retaining, and developing our associates, and we have a number of key programs to do so. \nOur culture.\n Values start with our people. At Ross, we value integrity, accountability, respect, learning, and humility. We strive to do what is right for our associates, customers, and the communities we serve. We are also committed to promoting an inclusive culture and work environment in which our associates are treated with dignity and respect.\nTalent development.\n The professional growth and retention of our associates is important to our success as a business. We identify and enumerate key competencies we believe are critical to our ability to execute our business model and deliver the values our customers expect. We utilize these competencies in the hiring, development, evaluation, and future planning of our teams. We provide training opportunities to help associates grow and build their careers. Our associates, managers, and executives may participate in technical and leadership development activities. We support associates interested in leadership roles by offering opportunities to gain experience and build the skills necessary to advance within the Company.\nCompensation and benefits.\n We are dedicated to providing our associates with competitive pay and benefits, a safe working environment, recognition for achievements, channels to share opinions and ideas, opportunities to give back, support for educational advancement, and merchandise and other discounts. We are also continuing to invest in our associates with programs that assist with physical, emotional, and financial wellness.\n6\nDiversity, equality, and inclusion. \nWe care about our associates and the communities we serve. We are committed to building diverse teams and an inclusive culture that respects, values, and celebrates the diversity of backgrounds, identities, and ideas of those who work and shop with us. We are focused on executing strategies to support our commitment to diversity, equality, and inclusion.\nCommunity and social impact.\n We provide our associates the opportunity to give back to their communities and make a social impact through various programs such as our matching gift program, volunteer time off for eligible associates, and a scholarship program for our associates and their dependents. \nCompetition\nWe believe the principal competitive factors in the off-price retail apparel and home fashion industry are offering significant discounts on brand name merchandise, offering a well-balanced assortment that appeals to our target customers, and consistently providing store environments that are convenient and easy to shop. To execute this concept, we continue to make strategic investments in our organization. We also continue to make improvements to our merchandising systems to strengthen our ability to plan, buy, and allocate product to our stores. We operate in an attractive sector of retail which offers both value and convenience. We believe that we are well-positioned within the off-price retail apparel and home fashion industry to compete based on these factors.\nNevertheless, the retail apparel and home fashion markets are highly fragmented and competitive. We face a challenging and rapidly changing macroeconomic and retail environment that creates intense competition for our business from online retailers, department stores, specialty stores, discount stores, warehouse stores, other off-price retailers, and manufacturer-owned outlet stores, many of which are units of large national or regional chains that have substantial resources. The retail apparel and home-related businesses may become even more competitive in the future. \nSeasonality\nAlthough our off-price business is subject to less seasonality than traditional retailers, sales are generally higher during the second half of the year, which includes the back-to-school and holiday seasons.\nAvailable Information\nThe internet address for our corporate website is www.rossstores.com. Our Annual Reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, Proxy Statements, and any amendments to those reports are made available free of charge on or through the Investors section of our corporate website, promptly after being electronically filed with the Securities and Exchange Commission. Our annual Corporate Social Responsibility Report is found in the Social Responsibility section of our corporate website. That report and the other information found on our corporate website are not part of this report or of any other report or regulatory filing we file with or furnish to the Securities and Exchange Commission.\n7\nExecutive Officers of the Registrant\nThe following sets forth the names and ages of our executive officers, indicating each person’s principal occupation or employment during at least the past five years. The term of office is at the discretion of our Board of Directors.\nName\nAge\nPosition\nMichael Balmuth\n74 \nExecutive Chairman\nJames G. Conroy\n55 \nChief Executive Officer\nMichael J. Hartshorn\n57 \nGroup President, Chief Operating Officer\nMichael Kobayashi\n60 \nPresident, Chief Capability Officer\nKaren Fleming\n58 \nPresident, Chief Merchandising Officer – Ross Dress for Less\nKaren Sykes\n64 \nPresident, Chief Merchandising Officer – dd’s DISCOUNTS\nStephen Brinkley\n52 \nPresident, Operations\nAdam Orvos\n60 \nExecutive Vice President, Chief Financial Officer\nMr. Balmuth has served as Executive Chairman since September 2023 and also rejoined our Board of Directors at that time. Prior to rejoining the Board in 2023, Mr. Balmuth had served on the Board from 1996 to 2021. Previously, he served as Strategic Advisor of the Company from 2021 to 2023, Chairman of the Board and Senior Advisor from 2019 to 2021, and Executive Chairman from 2014 to 2019. He was also Vice Chairman of the Board of Directors and Chief Executive Officer for 18 years from 1996 to 2014, during which time he also served as President from 2005 to 2009. Prior to this, Mr. Balmuth was Executive Vice President, Merchandising from 1993 to 1996 and Senior Vice President and General Merchandise Manager from 1989 to 1993. Before joining Ross, he was Senior Vice President and General Merchandising Manager at Bon Marché in Seattle from 1988 to 1989 and Executive Vice President and General Merchandising Manager for Karen Austin Petites from 1986 to 1988.\nMr. Conroy joined the Company in December 2024 as Chief Executive Officer – Elect and has served as Chief Executive Officer since February 2025. Previously, he served as President and Chief Executive Officer of Boot Barn Holdings, Inc. from 2012 to November 2024. Prior to this, Mr. Conroy was with Claire’s Stores, Inc. from 2007 to 2012, where he served as Chief Operating Officer and Interim Co-Chief Executive Officer in 2012, President from 2009 to 2012, and Executive Vice President from 2007 to 2009. From 2001 to 2007, Mr. Conroy served in various consulting roles, including with Kurt Salmon Associates and Deloitte Consulting. Previously, Mr. Conroy held several roles with consumer, entertainment, and consulting companies.\nMr. Hartshorn has served as Group President and Chief Operating Officer since 2019 and a member of the Board of Directors since 2021. Previously, he was Group Executive Vice President, Finance and Legal, Chief Financial Officer in 2019; Executive Vice President, Chief Financial Officer from 2018 to 2019; Group Senior Vice President, Chief Financial Officer from 2015 to 2018; Senior Vice President and Chief Financial Officer from 2014 to 2015; and Senior Vice President and Deputy Chief Financial Officer from 2012 to 2014. He was also Group Vice President, Finance and Treasurer from 2011 to 2012, and Vice President, Finance and Treasurer from 2006 to 2011. From 2002 to 2006, he held a number of management roles in the Ross IT and supply chain organizations. He initially joined the Company in 2000 as Director and Assistant Controller. For seven years prior to joining Ross, Mr. Hartshorn held various financial roles at The May Department Stores Company.\nMr. Kobayashi has served as President and Chief Capability Officer since 2022. He will leave his officer position on March 31, 2025, at which time he will transition to an advisor role. Prior to his current role, he served as President, Operations and Technology from 2019 to 2022; Group Executive Vice President, Supply Chain, Merchant Operations, and Technology from 2014 to 2019; and Executive Vice President, Supply Chain, Allocation, and Chief Information Officer from 2010 to 2014. Previously, he was Group Senior Vice President, Supply Chain and Chief Information Officer from 2008 to 2010, and Senior Vice President and Chief Information Officer from 2004 to 2008. Prior to joining Ross, Mr. Kobayashi was a Partner with Accenture, providing consulting services to clients in Accenture’s Retail & Consumer Goods practice.\n8\nMs. Fleming has served as President and Chief Merchandising Officer \n–\n Ross Dress for Less since December 2024. She held the corresponding role at dd’s DISCOUNTS earlier in that year. Previously, she served as Group Executive Vice President, Merchandising at dd’s DISCOUNTS since 2023 and Executive Vice President, Merchandising at dd’s DISCOUNTS since 2022. Prior to this, Ms. Fleming served as Group Senior Vice President of Merchandising from 2018 to 2022 and Senior Vice President of Merchandising from 2015 to 2018. Prior to that, she held various merchandising positions since joining the Company in 1999.\nMs. Sykes has served as President and Chief Merchandising Officer \n–\n dd’s DISCOUNTS since December 2024. Previously, she served as Executive Vice President of Merchandising at Ross Dress for Less since 2022. From 2018 to 2022, Ms. Sykes served as Group Senior Vice President of Merchandising. She served as Senior Vice President of Merchandising from 2010 to 2018. Before this, she held various merchandising positions since joining the Company in 1992.\nMr. Brinkley has served as President, Operations since 2023. Prior to joining Ross, he served as President of SportChek, a subsidiary of Canadian Tire Corporation, since 2020 and as Senior Vice President, Stores from 2019 to 2020. Previously, he held roles at Save A Lot Food Stores Ltd. as Executive Vice President and Chief Operating Officer from 2017 to 2019 and before that as Senior Vice President, Corporate Store Operations since 2017. He also held several store and field management positions during his 14-year tenure at Target Corporation.\nMr. Orvos has served as Executive Vice President and Chief Financial Officer since 2021. He will leave his officer position at the end of September 2025 when he retires from the Company. Mr. Orvos joined Ross in 2021 as Group Senior Vice President, Supply Chain Administration. Prior to joining Ross, Mr. Orvos served as Senior Vice President, Retail Finance and Global Financial Planning and Analysis at Lowe’s from 2019 to 2020; Chief Financial Officer and Chief Operating Officer at Neiman Marcus from 2018 to 2019; and Executive Vice President, Retail and then Chief Executive Officer at Total Wine & More from 2016 to 2017. Mr. Orvos held several senior management positions at Belk Department Stores from 2006 to 2016, where he \neventually became its C\nhief Financial Officer. For almost \n20\n years prior to this, Mr. Orvos held various financial roles at The May Department Stores Company, including Chief Financial Officer of their Foley’s division.\n9",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOverview\nRoss Stores, Inc. operates two brands of off-price retail apparel and home fashion stores—Ross Dress for Less\n®\n (“Ross”) and dd’s DISCOUNTS\n®\n. Ross is the largest off-price apparel and home fashion chain in the United States, with 1,831 locations in 43 states, the District of Columbia, and Guam, as of February 1, 2025. Ross offers first-quality, in-season, name brand and designer apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 60% off department and specialty store regular prices every day. We also operate 355 dd’s DISCOUNTS stores in 22 states as of February 1, 2025 that feature a more moderately-priced assortment of first-quality, in-season, name brand apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 70% off moderate department and discount store regular prices every day.\nOur primary objective is to pursue and refine our existing off-price strategies to maintain and improve both profitability and financial returns over the long term. Macroeconomic pressures and uncertainties continue to impact both consumer confidence and discretionary spending. We are closely monitoring these external factors, along with market share trends for the off-price industry. We believe that our flexible business model better positions us to navigate through uncertainty, and we plan to continue to focus on strong execution of our key initiatives. We believe that our market share gains can continue to grow through our continued focus on bringing value and convenience to our customers.\nOur merchandising strategies emphasize consistently offering a wide assortment of quality branded bargains for our customers. We believe that our merchandising and operational strategies enable us to deliver the most competitive bargains available to meet our customers’ ongoing demand for quality branded goods for the family and home at compelling discounts every day. Additionally, we anticipate the current retail environment will result in more opportunities for us to obtain close-out merchandise and to deliver even greater values on branded goods. We believe that staying diligently focused on executing our merchandising strategies is an important driver of our ability to gain market share in fiscal 2025 and the long term.\nThe fiscal years ended February 1, 2025, February 3, 2024, and January 28, 2023 are referred to as fiscal 2024, fiscal 2023, and fiscal 2022, respectively. Fiscal 2023 was a 53-week year. Fiscal 2024 and 2022 were each 52-week years.\nThe discussion that follows relates to fiscal 2024 and fiscal 2023. Discussion of fiscal 2022 items and year-to-year comparisons between fiscal 2023 and fiscal 2022 that are not included in this Annual Report on Form 10-K can be found in Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n \nin our Annual Report on Form 10-K for fiscal 2023.\n25\nResults of Operations\nThe following table summarizes our financial results for fiscal 2024, 2023, and 2022:\n2024\n2023\n2022\nSales\nSales (millions)\n$\n21,129\n \n$\n20,377 \n$\n18,696 \nSales growth (decline)\n3.7%\n9.0%\n(1.2)%\nComparable store sales growth (decline)\n1\n3%\n5%\n(4)%\nCosts and expenses (as a percent of sales)\nCost of goods sold\n72.2%\n72.7%\n74.6%\nSelling, general and administrative\n15.5%\n16.0%\n14.8%\nOperating income (as a percent of sales)\n12.2%\n11.3%\n10.7%\nInterest (income) expense, net\n(0.8)%\n(0.8)%\n0.0%\nNet earnings (as a percent of sales)\n9.9%\n9.2%\n8.1%\n1\n Comparable stores are stores open for more than 14 complete months.\nStores.\n \nTotal stores open at the end of fiscal 2024, 2023, and 2022 were 2,186, 2,109, and 2,015, respectively. The number of stores at the end of fiscal 2024, 2023, and 2022 increased by 4%, 5%, and 5% from the respective prior years. In fiscal 2024, \nwe opened \n89\n new stores. \nLooking forward to 2025, we expect to open approximately 90 new stores. Our long-term strategy is to open additional stores based on market penetration, local demographic characteristics, competition, expected store profitability, and the ability to leverage overhead expenses. We continually evaluate opportunistic real estate acquisitions and opportunities for potential new store locations. We also evaluate our current store locations and determine store closures based on similar criteria. We continue to believe that consumers’ focus on value and convenience provide opportunities for us to gain market share.\nThe following table summarizes the stores opened and closed during fiscal 2024, 2023, and 2022:\nStore Count\n2024\n2023\n2022\nRoss Dress for Less\nBeginning of the period\n1,764\n \n1,693 \n1,628 \nOpened in the period\n75\n \n72 \n1\n71 \nClosed in the period\n(8)\n(1)\n(6)\n2\nTotal Ross Dress for Less stores end of period\n1,831\n \n1,764 \n1,693 \ndd’s DISCOUNTS\nBeginning of the period\n345\n \n322 \n295 \nOpened in the period\n14\n \n25 \n28 \nClosed in the period\n(4)\n(2)\n(1)\nTotal dd’s DISCOUNTS stores end of period\n355\n \n345 \n322 \nTotal stores end of period\n2,186\n \n2,109 \n2,015 \n1 \nIncludes the reopening of a store previously temporarily closed due to a weather event.\n2 \nIncludes the temporary closure of a store impacted by a weather event.\nThe total selling square footage as of February 1, 2025, February 3, 2024, and January 28, 2023 was 43.9 million, 42.8 million, and 41.4 million, respectively.\n26\nSales. \nSales for fiscal 2024 increased $752.3 million, or 3.7%, compared to the prior year. This was primarily due to the 3% increase in comparable store sales and the opening of 77 net new stores during fiscal 2024. Sales for fiscal 2023 included approximately $308 million from the additional week of sales due to the 53rd week.\nOur sales mix is shown below for fiscal 2024, 2023, and 2022:\n2024\n1\n2023\n2022\nHome Accents and Bed and Bath\n26\n \n%\n26 \n%\n26 \n%\nLadies\n22\n \n%\n23 \n%\n24 \n%\nMen’s\n16\n \n%\n15 \n%\n15 \n%\nAccessories, Lingerie, Fine Jewelry, and Cosmetics\n15\n \n%\n15 \n%\n14 \n%\nShoes\n12\n \n%\n13 \n%\n12 \n%\nChildren’s\n9\n \n%\n8 \n%\n9 \n%\nTotal\n100\n \n%\n100 \n%\n100 \n%\nCost of goods sold. \nCost of goods sold in fiscal 2024 increased $458.9 million compared to the prior year primarily due to the 3% comparable store sales increase and higher sales from the opening of 77 net new stores during fiscal 2024.\nCost of goods sold as a percentage of sales for fiscal 2024 decreased approximately 40 basis points from fiscal 2023 primarily due to a 45 basis point decrease in buying costs mainly due to lower incentive compensation expense, a 45 basis point decrease in distribution costs, and a 30 basis point decrease in domestic freight costs. Partially offsetting these items was a 60 basis point decrease in merchandise margin primarily due to our continued efforts to offer more sharply priced branded bargains and a 20 basis point increase in occupancy costs.\nSelling, general and administrative expenses. \nFor fiscal 2024, selling, general and administrative expenses (“SG&A”) increased $15.5 million compared to the prior year. In December 2024, we completed the sale of a packaway warehouse facility and recognized a pre-tax gain on sale of $61.6 million. This sale, along with lower incentive compensation expense, partially offset the increase in SG&A which was primarily driven by the opening of 77 net new stores during fiscal 2024.\nSG&A as a percentage of sales for fiscal 2024 decreased 50 basis points compared to fiscal 2023, primarily due to the gain recognized from the previously mentioned packaway facility sale and lower incentive compensation expense.\nOperating income.\n Operating income as a percentage of sales for fiscal 2024 increased 90 basis points compared to fiscal 2023, primarily due to lower cost of goods sold and lower SG&A expenses.\nIn fiscal 2025, we expect operating income as a percentage of sales to be impacted by sales deleverage, higher distribution costs, and lower incentive compensation expense. \nInterest (income) expense, net\n.\n \nIn fiscal 2024, interest (income) expense, net improved by $7.5 million compared to fiscal 2023. Interest (income), expense, net as a percentage of sales, was flat compared to the prior year.\nThe table below shows the components of interest (income) expense, net for fiscal 2024, 2023, and 2022:\n($000)\n2024\n2023\n2022\nInterest income\n$\n(234,955)\n$\n(238,207)\n$\n(77,706)\nCapitalized interest expense\n(19,447)\n(12,106)\n(5,678)\nOther interest expense\n1,571\n \n1,599 \n1,668 \nInterest expense on long-term debt\n81,263\n \n84,596 \n84,558 \nInterest (income) expense, net\n$\n(171,568)\n$\n(164,118)\n$\n2,842 \n27\nTaxes on earnings. \nOur effective tax rate for fiscal 2024, 2023, and 2022 was approximately 24%. Our effective tax rate represents the applicable combined federal and state statutory rates reduced by the federal benefit of state taxes deductible on federal returns. Our effective tax rate is impacted by changes in tax law and accounting guidance, location of new stores, level of earnings, tax effects associated with stock-based compensation, and the resolution of tax positions with various tax authorities. \nEarnings per share.\n Diluted earnings per share in fiscal 2024 was \n$6.32\n compared to $5.56 in the prior year. Fiscal 2024 earnings include a per share benefit of approximately $0.14 from the sale of the packaway warehouse facility. Fiscal \n2023\n earnings include a per share benefit of approximatel\ny $0.20 from the 53rd week\n. The \n$0.76 increase\n in\n dil\nuted earnings per share in fiscal 2024 was primarily attributab\nle to a 12% increase in net earnings and a 2% reduction in weighted-average diluted shares outstanding largely due to stock repurchases under our stock repurchase program.\nFinancial Condition\nLiquidity and Capital Resources\nThe primary sources of funds for our business activities are cash flows from operations and short-term trade credit. Our primary ongoing cash requirements are for merchandise inventory purchases, payroll, operating and variable lease costs, taxes, capital expenditures related to our new and existing stores, and investments in distribution centers, information systems, and buying and corporate offices. We also use cash to repurchase stock under our stock repurchase programs, pay dividends, and repay debt as it becomes due. In September 2024, we repaid at maturity the $250 million principal amount of the 3.375% Senior Notes. As of February 1, 2025, we had $700 million principal amount of 4.600% Senior Notes that will reach maturity in 2025.\n($ millions)\n2024\n2023\n2022\nCash provided by operating activities\n$\n2,357\n \n$\n2,514 \n$\n1,689 \nCash used in investing activities\n(637)\n(763)\n(654)\nCash used in financing activities\n(1,859)\n(1,428)\n(1,405)\nNet (decrease) increase in cash, cash equivalents, and restricted cash and cash equivalents\n$\n(139)\n$\n323 \n$\n(370)\nOperating Activities\nNet cash provided by operating activities was $2.4 billion in fiscal 2024. This was primarily driven by net earnings excluding non-cash expenses for depreciation, amortization, stock-based compensation, and the gain on sale of property (i.e., packaway warehouse facility), partially offset by the payment of fiscal 2023 incentive bonuses in fiscal 2024. Net cash provided by operating activities was $2.5 billion in fiscal 2023. This was primarily driven by net earnings excluding non-cash expenses for depreciation, amortization, and \nstock-based compensation. Net cash provided by operating activities was $1.7 billion in fiscal \n2022\n. \nThis was primarily driven by net earnings excluding non-cash expenses for depreciation, amortization, and stock-based compensation, and an increase in deferred income taxes, partially offset by merchandise inventory payments and payment of fiscal 2021 incentive bonuses.\nThe decrease in cash provided by operating activities in fiscal 2024 compared to fiscal 2023 was primarily driven by \nhigher incentive compensation payments, partially offset by higher net earnings.\nAccounts payable leverage \n(defined as accounts payable divided by merchandise inventory) \nwas \n87% and \n89% as of February 1, 2025 and February 3, 2024\n,\n respectively. \nThe decrease in accounts payable leverage in fiscal 2024 compared to fiscal 2023 was primarily due to the timing of inventory receipts and related payments versus last year.\n28\nAs a regular part of our business, packaway inventory levels will vary over time based on availability of compelling merchandise purchase opportunities in the marketplace and our decisions on the timing for release of that inventory to our stores. Packaway merchandise is purchased with the intent that it will be stored in our warehouses until a later date. The timing of the release of packaway inventory to our stores is principally driven by the product mix and seasonality of the merchandise, and its relation to our store merchandise assortment plans. As such, the aging of packaway varies by merchandise category and seasonality of purchase, but typically packaway remains in storage for less than six months. We expect to continue to take advantage of packaway inventory opportunities to maximize our ability to deliver bargains to our customers.\nChanges in packaway inventory levels affect our operating cash flow. Packaway inventory was 41% of total inventory at the end of fiscal 2024, compared to 40% at the end of fiscal 2023.\nInvesting Activities\nNet cash used in investing activities was $637 million, $763 million, and $654 million in fiscal 2024, 2023, and 2022\n,\n respectively, and was primarily related to our capital expenditures. In fiscal 2024, capital expenditures were partially offset by cash proceeds from the sale of the packaway warehouse facility. Our capital expenditures include costs to build, expand, and improve distribution centers, open new stores and improve existing stores, and for various other expenditures related to our information technology systems and buying and corporate offices.\nThe decrease in cash used in investing activities in fiscal 2024 compared to fiscal 2023 was primarily due to lower capital expenditures in fiscal 2024 related to our new Buckeye, Arizona distribution center and cash proceeds from the sale of the packaway facility, partially offset by the purchase of land and the start of construction for our next distribution center.\nOur capital expenditures over the last three years are set forth in the table below:\n($ millions)\n2024\n2023\n2022\nDistribution and transportation\n$\n260\n \n$\n306 \n$\n270 \nNew stores\n193\n \n209 \n171 \nExisting stores\n171\n \n168 \n148 \nInformation systems, corporate, and other\n96\n \n80 \n65 \nTotal capital expenditures\n$\n720\n \n$\n763 \n$\n654 \nCapital expenditures for fiscal 2025 are projected to be approximately $855 million. Our planned capital expenditures for fiscal 2025 are for costs to open new stores and improve existing stores, investments in our supply chain to support long-term growth, including construction of our next distribution centers, investments in our information technology systems, and for various other expenditures related to our stores, distribution centers, and buying and corporate offices. We expect to fund capital expenditures with available cash. The increase in our planned capital expenditures for fiscal 2025 compared to fiscal 2024 is primarily driven by investments in our next distribution centers, new and existing store improvements, and various investments in our information technology systems.\nFinancing Activities\nNet cash used in financing activities was $1.9 billion, $1.4 billion, and $1.4 billion in fiscal 2024, 2023\n, and 2022, respectively, primarily resulting from stock repurchases under our stock repurchase program and dividend payments. In fiscal \n2024, we\n repaid the $250 million principal amount of the\n 3.375%\n Senior Notes in September 2024.\nRevolving credit facilities.\n We have a $1.3 billion senior unsecured revolving credit facility (“Credit Facility”). As of \nFebruary 1, 2025\n, we had no borrowings or standby letters of credit outstanding under the Credit Facility, t\nhe \n$1.3 billion\n Credit Facility remained in place and available, and \nwe were in compliance with the financial covenant. Refer to Note D: Debt\n \nin the Notes to Consolidated Financial Statements \nfor additional information.\n29\nSenior notes.\n As of February 1, 2025, we had approximately \n$2.2 billion\n of outstanding unsecured Senior Notes, of which \n$699.7 million\n was classified within Current Liabilities on our Consolidated Balance Sheet. Refer to\n Note D: Debt\n \nin the Notes to Consolidated Financial Statements \nfor additional information.\nOther financing activities.\n In March 2024, our Board of Directors approved a two-year program to repurchase up to $2.1 billion of the Company’s common stock through January 31, 2026. This program followed the previous two-year $1.9 billion stock repurchase program, effective at the end of fiscal 2023.\nThe following table summarizes our stock repurchase activity in fiscal 2024, 2023, and 2022:\nFiscal Year\nShares repurchased\n(in millions)\n Average repurchase\nprice\nAmount repurchased\n(in millions)\n2024\n7.3\n \n$\n144.46\n \n$\n1,050\n \n1\n2023\n8.2 \n$\n115.24 \n$\n950 \n1\n2022\n10.3 \n$\n92.15 \n$\n950 \n1\n Amount excludes excise tax due under the Inflation Reduction Act of 2022.\nDuring fiscal 2024, 2023, and 2022, we also acquired 0.6 million, 0.5 million, and 0.5 million shares of treasury stock, respectively, from our employee equity incentive plans for aggregate purchase prices of approximately $86.1 million, $48.6 million, and $48.9 million, respectively.\nOn March 4, 2025, our Board of Directors declared a quarterly cash dividend of $0.4050 per common share, payable on March 31, 2025. \nOur Board of Directors declared a cash dividend of $0.3675 per common share in March, May, August, and November 2024. Our Board of Directors declared a cash dividend of $0.3350 per common share in February, May, August, and November 2023, and a cash dividend of $0.3100 per common share in March, May, August, and November 2022.\nDuring fiscal 2024, 2023, and 2022, we paid dividends of $488.7 million, $454.8 million, and $431.3 million, respectively. \nShort-term trade credit represents a significant source of financing for our merchandise inventory. Trade credit arises from customary payment terms and trade practices with our vendors. We regularly review the adequacy of credit available to us from all sources and expect to be able to maintain adequate trade credit, bank credit facility, and other credit sources to meet our capital and liquidity requirements.\nDuring fiscal 2024, fiscal 2023, and fiscal 2022, our liquidity and capital requirements were provided by available cash and cash flows from operations.\nWe ended fiscal 2024 with $4.7 billion of unrestricted cash balances, which were held primarily in overnight money market funds invested in U.S. treasury and government instruments across a highly diversified set of banks and other financial institutions. We also have $1.3 billion available under our Credit Facility. We estimate that existing cash and cash equivalent balances, cash flows from operations, our bank credit facility, and trade credit are adequate to meet our operating cash needs and to fund our planned capital investments, debt repayments, interest payments, common stock repurchases, and quarterly dividend payments for at least the next 12 months.\n30\nContractual Obligations \nThe table below presents our significant contractual obligations as of February 1, 2025:\nLess than\n1 year\nGreater than \n1 year\nTotal¹\n($000)\nRecorded contractual obligations:\n   Senior notes\n$\n700,000 \n$\n1,524,991 \n$\n2,224,991 \n   Operating leases\n758,519 \n2,869,467 \n3,627,986 \n   New York buying office ground lease\n2\n7,552 \n1,092,953 \n1,100,505 \nUnrecorded contractual obligations:\n   Real estate obligations\n3\n9,026 \n178,204 \n187,230 \n   Interest payment obligations\n55,778 \n299,040 \n354,818 \n   Purchase obligations\n4\n4,183,454 \n104,916 \n4,288,370 \nTotal contractual obligations\n$\n5,714,329 \n$\n6,069,571 \n$\n11,783,900 \n1 \nWe have a $61.3 million liability for unrecognized tax benefits that is included in Other long-term liabilities on our Consolidated Balance Sheets. This liability is excluded from the schedule above as the timing of payments cannot be reasonably estimated.\n2\n Our New York buying office building is subject to a 99-year ground lease.\n3 \nMinimum lease payments for operating leases signed that have not yet commenced.\n4 \nPurchase obligations primarily consist of merchandise inventory purchase orders, commitments related to construction projects, transportation, information technology services, store fixtures and supplies, and maintenance contracts.\nSupply chain finance program. \nWe facilitate a voluntary supply chain finance program (the “program”) to provide certain suppliers with the opportunity to sell their receivables due from us to participating financial institutions at the sole discretion of both the suppliers and the financial institutions. A third-party financial institution administers the program. Our responsibility is limited to making payments on the terms originally negotiated with each supplier, regardless of whether a supplier sells its receivable to a financial institution. We are not a party to the agreements between the participating financial institutions and the suppliers in connection with the program, and we do not receive financial incentives from the suppliers or the financial institutions. We do not provide guarantees under the program, and our rights and obligations to our suppliers are not affected by the program. The range of payment terms negotiated with suppliers is consistent, irrespective of whether a supplier participates in the program.\nAll outstanding payments owed under the program are recorded within Accounts payable in the Consolidated Balance Sheets. We account for all payments made under the program as a reduction to operating cash flows in Accounts payable within the Consolidated Statements of Cash Flows. The amounts owed to participating financial institutions under the program and included in Accounts payable were \n$159.2 million\n and \n$146.9 million\n at February 1, 2025 and February 3, 2024, respectively.\nStandby letters of credit and collateral trust. \nWe use standby letters of credit outside of our revolving credit facility and a funded trust to collateralize some of our insurance obligations. As of February 1, 2025 and February 3, 2024, we had $1.8 million and $2.2 million, respectively, in standby letters of credit outstanding. As of February 1, 2025 and February 3, 2024, we had $63.9 million and $60.8 million, respectively, held in a collateral trust. The standby letters of credit are collateralized by restricted cash and the collateral trust consists of restricted cash and cash equivalents.\nOther than the unrecorded contractual obligations noted above, we did not have any material off-balance sheet arrangements as of February 1, 2025.\n31\nOther\nCritical Accounting \nEstimates\nThe preparation of our consolidated financial statements requires our management to make estimates and assumptions that affect the reported amounts. These estimates and assumptions are evaluated on an ongoing basis and are based on historical experience and on various other factors that management believes to be reasonable. We believe the following critical accounting estimates describe the more significant judgments and estimates used in the preparation of our consolidated financial statements and are not intended to be a comprehensive list of all of our accounting estimates. \nMerchandise inventory.\n \nOur merchandise inventory is stated at the lower of cost (determined using a weighted-average basis) or net realizable value. Inventory we purchase can either be shipped to stores or processed as packaway merchandise with the intent that it will be warehoused and released to stores at a later date. Merchandise inventory includes acquisition, transportation, pr\nocessing, and storage costs. Included in the carrying value of our merchandise inventory is a provision for shortage. The shortage reserve is based on historical shortage rates as determined through our annual physical inventory counts and cycle counts. Historically, our actual physical inventory count results have shown our provision for shortage to be reliable. \nA \nfive percent\n change in shortage rates as of \nFebruary 1, 2025\n \nwould not have materially impacted our cost of goods sold \nin fiscal 2024.\nInsurance obligations.\n \nWe use a combination of insurance and self-insurance for a number of risk management activities, including workers’ compensation, general liability, and employee-related health care benefits. Our self-insurance and deductible liability is determined actuarially, based on claims filed and an estimate of claims incurred but not reported. Should a greater amount of claims occur compared to what is estimated or the costs of medical care increase beyond what was anticipated, our recorded reserves may not be sufficient and additional charges could be required. A five percent increase or decrease in our insurance reserves would not have materially impacted our net earnings in fiscal 2024.\nRecent Accounting Pronouncements\n \nRefer to Note A: Summary of Significant Accounting Policies in the Notes to Consolidated Financial Statements for a discussion of recent accounting pronouncements and their impact to our Consolidated Financial Statements.\nForward-Looking Statements\nOur Annual Report on Form 10-K for fiscal 2024, and information we provide in our Annual Report to Stockholders, press releases, and other investor communications including those on our corporate website, may contain a number of forward-looking statements regarding, without limitation, projected sales, costs, earnings, planned new store growth, capital expenditures, sustainability and carbon reduction targets, and other matters. These forward-looking statements reflect our then-current beliefs, plans, and estimates with respect to future events and our projected financial performance, operations, and competitive position. The words “plan,” “expect,” “target,” “anticipate,” “estimate,” “believe,” “forecast,” “projected,” “guidance,” “outlook,” “looking ahead,” and similar expressions identify forward-looking statements.\nFuture impact from inflation, high interest rates and interest rate changes, tariffs, ongoing military conflicts and economic sanctions, extreme weather, public health events, natural disasters, climate change, and other economic, regulatory, consumer spending, and industry trends that could potentially adversely affect our revenue, profitability, operating conditions, and growth are difficult to predict. Our forward-looking statements are subject to risks and uncertainties which could cause our actual results to differ materially from those forward-looking statements and our previous expectations, plans, and projections. Refer to ITEM 1A. RISK FACTORS in this Annual Report on Form 10-K for a more complete discussion of risk factors for Ross and dd’s DISCOUNTS. The factors underlying our forecasts and plans are dynamic and subject to change. As a result, any forecasts or forward-looking statements speak only as of the date they are given, and do not necessarily reflect our outlook at any other point in time. We disclaim any obligation to update or revise these forward-looking statements.\n32",
  "item2": null
}