{
  "source_file": "rost-20250802.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF\nOPERATIONS\nThis section and other parts of this Form 10-Q contain forward-looking statements that involve risks and uncertainties. Our actual results may differ materially from the results discussed in the forward-looking statements. Factors that might cause such differences include, but are not limited to, those discussed below under the caption “Forward-Looking Statements” and also those in Part II, Item 1A (Risk Factors) of this Form 10-Q, and Part I, Item 1A (Risk Factors) of our Annual Report on Form 10-K for fiscal 2024. The following discussion should be read in conjunction with the condensed consolidated financial statements and notes thereto included elsewhere in this Quarterly Report on Form 10-Q and in conjunction with the consolidated financial statements and notes thereto in our Annual Report on Form 10-K for fiscal 2024. All information is based on our fiscal calendar.\nOverview\nRoss Stores, Inc. operates two brands of off-price retail apparel and home fashion stores—Ross Dress for Less\n®\n (“Ross”) and dd’s DISCOUNTS\n®\n. Ross is the largest off-price apparel and home fashion chain in the United States, with 1,873 locations in 44 states, the District of Columbia, Guam, and Puerto Rico as of August 2, 2025. Ross offers first-quality, in-season, name brand and designer apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 60% off department and specialty store regular prices every day. We also operate 360 dd’s DISCOUNTS stores in 22 states as of August 2, 2025 that feature a more moderately-priced assortment of first-quality, in-season, name brand apparel, accessories, footwear, and home fashions for the entire family at savings of 20% to 70% off moderate department and discount store regular prices every day.\nMacroeconomic Conditions\nThe macroeconomic environment continues to be uncertain. Tariffs remain at elevated levels, and we continue to expect broad-based inflationary pressures across the retail industry. Through these ongoing pressures and uncertainty, we continue to remain focused on offering our customers a wide assortment of high-quality, branded merchandise at outstanding values. We expect to continue to make necessary adjustments with our flexible off-price business model to navigate through this uncertain environment and believe we are well-positioned to capture market share while mitigating the impact from these macroeconomic challenges. Despite the ongoing uncertainty in the external environment, we believe that our merchandising and operational strategies enable us to deliver the values our customers have come to expect from us.\nStore Openings\nWe opened 31 new stores in the second quarter of fiscal 2025, which included expansion in new and existing markets. New market entries included several stores in the New York Metro area, as well as our three inaugural stores in Puerto Rico. We opened a total of 50 new stores in the first six months of fiscal 2025 and remain on track to open a total of approximately 90 new stores this year, comprised of about 80 Ross and 10 dd’s DISCOUNTS locations.\nOur long-term strategy is to open additional stor\nes based on market penetration, local demographic characteristics, competition, expected store profitability, and the ability to leverage overhead expenses. We continually evaluate opportunistic real estate acquisitions and opportunities for potential new store locations. We also evaluate our current store locations and determine store closures based on similar criteria. We continue to believe that customers’ focus on value and convenience provide opportunities for us to gain market share.\nSales Metrics\nComparable store sales (“comp store sales”) is a metric used by management and across the retail industry to evaluate the performance of existing stores by measuring the change in net sales for a particular period over the comparable prior period of equivalent length. We define comp store sales to be sales from stores that have been open for 14 complete months. \nSales excluded from comp store sales (“non-comp store sales”) consist primarily of sales from new stores that have been open for less than 14 complete months. Non-comp store sales also include sales from stores that are permanently closed (beginning in the month prior to closure) and temporarily closed (i.e., stores that do not have sales for at least two weeks within a fiscal month).\nThe calculation of comp store sales varies across the retail industry; therefore, our measure of comp store sales may differ from other retailers.\n17\nMetrics relating to customer purchasing behavior, such as “traffic” (defined as the number of transactions) and “basket” (defined as average transaction value), may provide additional insight into our comp store sales results (see Sales discussion).\nResults of Operations\nT\nhe following table summarizes our financial results for the three and six month periods ended August 2, 2025 and August 3, 2024:\nThree Months Ended\nSix Months Ended\nAugust 2, 2025\nAugust 3, 2024\nAugust 2, 2025\nAugust 3, 2024\nSales\nSales (billions)\n$\n5.5\n$\n5.3\n$\n10.5\n$\n10.1\nSales growth\n5\n%\n7\n%\n4\n%\n8\n%\nComparable store sales growth\n2\n%\n4\n%\n1\n%\n3\n%\nCosts and expenses (as a percent of sales)\nCost of goods sold\n72.4\n%\n71.7\n%\n72.1\n%\n71.8\n%\nSelling, general and administrative\n16.1\n%\n15.8\n%\n16.1\n%\n15.9\n%\nOperating income (as a percent of sales)\n11.5\n%\n12.5\n%\n11.8\n%\n12.3\n%\nInterest income, net (as a percent of sales)\n(0.6\n%)\n(0.8\n%)\n(0.6\n%)\n(0.9\n%)\nNet earnings (as a percent of sales)\n9.2\n%\n10.0\n%\n9.4\n%\n10.0\n%\nSales.\n Sales for the three month period ended August 2, 2025 increased $0.2 billion, or 5%, compared to the three month period ended August 3, 2024. This was primarily due to an increase in non-comp store sales of $0.1 billion and the 2% increase in comp store sales of $0.1 billion. The 2% increase in comp store sales reflects an approximate 1% increase in basket and 1% increase in traffic.\nSales for the six month period ended August 2, 2025 increased $0.4 billion, or 4%, compared to the six month period ended August 3, 2024. This was primarily due to an increase in non-comp store sales of $0.3 billion and the 1% increase in comp store sales, or $0.1 billion. The 1% increase in comp store sales is primarily due to an increase in basket.\nOur sales mix for the three and six month periods ended August 2, 2025 and August 3, 2024 is shown below:\nThree Months Ended\nSix Months Ended\nAugust 2, 2025\nAugust 3, 2024\nAugust 2, 2025\nAugust 3, 2024\nHome Accents and Bed and Bath\n23\n%\n24\n%\n24\n%\n25\n%\nLadies\n23\n%\n23\n%\n23\n%\n23\n%\nMen’s\n17\n%\n17\n%\n16\n%\n16\n%\nAccessories, Lingerie, Fine Jewelry, and Cosmetics\n15\n%\n14\n%\n15\n%\n14\n%\nShoes\n13\n%\n13\n%\n13\n%\n13\n%\nChildren’s\n9\n%\n9\n%\n9\n%\n9\n%\nTotal\n100\n%\n100\n%\n100\n%\n100\n%\n18\nCost of goods sold.\n Cost of goods sold for the three and six month periods ended August 2, 2025 increased $210 million and $301 million, respectively, compared to the three and six month periods ended August 3, 2024 primarily due to the increases in sales.\nCost of goods sold as a percentage of sales for the three month period ended August 2, 2025 increased approximately 70 basis points compared to the three month period ended August 3, 2024, primarily due to a 55 basis point increase in distribution costs mainly due to the deleveraging effect from the opening of our eighth distribution center in Buckeye, Arizona in May 2025 and tariff-related processing costs. Merchandise margin decreased 30 basis points which included the impact of tariffs, and occupancy costs deleveraged 10 basis points. Partially offsetting these higher costs were lower domestic freight costs of 15 basis points and lower buying costs of 10 basis points from lower incentive compensation expense.\nCost of goods sold as a percentage of sales for the six month period ended August 2, 2025 increased approximately 35 basis points compared to the six month period ended August 3, 2024, primarily due to a 35 basis point decrease in merchandise margin which included the impact of tariffs. Distribution costs increased by 30 basis points mainly due to the deleveraging effect from the opening of our eighth distribution center in Buckeye, Arizona in May 2025 and tariff-related processing costs. Occupancy costs deleveraged by 10 basis points. Partially offsetting these higher costs were lower buying costs of 25 basis points from lower incentive compensation expense and lower domestic freight costs of 15 basis points.\nSelling, general and administrative expenses.\n For the three and six month periods ended August 2, 2025, selling, general and administrative expenses (“SG&A”) increased $52 million and $73 million, respectively, compared to the three and six month periods ended August 3, 2024, primarily due to higher store related costs mainly from the increase in sales.\nSG&A as a percentage of sales for the three and six month periods ended August 2, 2025 increased by 25 basis points and 15 basis points, respectively, compared to the three and six month periods ended August 3, 2024, primarily due to costs associated with our Chief Executive Officer transition.\nOperating income.\n Operating income as a percentage of sales for the three and six month periods ended August 2, 2025 decreased by 95 basis points and 50 basis points, respectively, compared to the three and six month periods ended August 3, 2024, as both cost of goods sold and SG&A increased as a percentage of sales period over period.\nOperating income as a percentage of sales for the second quarter of fiscal 2025 included an approximate 90 basis point negative impact from tariff-related costs. Moving into the second half of fiscal 2025, we expect tariff-related costs will continue to have a negative impact to operating income as a percentage of sales. We also expect continued cost of goods sold deleverage from the opening of our eighth distribution center in Buckeye, Arizona in May 2025.\nInterest income, net.\n For the three and six month periods ended August 2, 2025, interest income, net decreased $11 million and $23 million, respectively, compared to the three and six month periods ended August 3, 2024, primarily due to decreased interest income both from lower average interest rates and from lower average cash balances, which decreased largely due to our repayment at maturity of $700 million of Senior Notes in April 2025 and $250 million of Senior Notes in September 2024. The decrease in interest income was partially offset by lower interest expense due to the repayment of those Senior Notes.\nThe table below shows the components of interest income, net for the three and six month periods ended August 2, 2025 and August 3, 2024:\nThree Months Ended\nSix Months Ended\n($000)\nAugust 2, 2025\nAugust 3, 2024\nAugust 2, 2025\nAugust 3, 2024\nInterest income\n$\n(40,326)\n$\n(60,282)\n$\n(87,194)\n$\n(123,500)\nCapitalized interest\n(2,963)\n(4,577)\n(8,367)\n(8,842)\nOther interest expense\n392\n \n367 \n792\n \n725 \nInterest expense on long-term debt\n10,551\n \n21,142 \n28,014\n \n42,317 \nInterest income, net\n$\n(32,346)\n$\n(43,350)\n$\n(66,755)\n$\n(89,300)\n19\nTaxes on earnings. \nOur effective tax rate is impacted by changes in tax laws and accounting guidance, location of new stores, level of earnings, tax effects associated with stock-based compensation, and the resolution of tax positions with various tax authorities. Our effective tax rates for the three month periods ended August 2, 2025 and August 3, 2024 were approximately 24% and 25%, respectively. The one percent decrease in the effective tax rate for the three month period ended August 2, 2025 compared to the three month period ended August 3, 2024 was primarily due to the resolution of tax positions with various tax authorities. Our effective tax rates for the six month periods ended August 2, 2025 and August 3, 2024 were approximately 25% and 24%, respectively. The one percent increase in the effective tax rate for the six month period ended August 2, 2025 compared to the six month period ended August 3, 2024 was primarily due to the tax effects associated with stock-based compensation.\nIn July 2025, the OBBBA was signed into law. The OBBBA made several changes to business tax provisions including the reinstatement of 100% bonus depreciation and immediate expensing of domestic research and development expenditures. As of August 2, 2025, the OBBBA resulted in an increase to our deferred tax liability balance of approximately $30 million primarily due to the reinstatement of 100% bonus depreciation.\nEarnings per share.\n Diluted earnings per share for the three month period ended August 2, 2025 was $1.56 compared to $1.59 for the three month period ended August 3, 2024. The $0.03 decrease in the diluted earnings per share for the three month period ended August 2, 2025 was primarily attributable to an approximately 4% decrease in net earnings, partially offset by a 2% reduction in weighted-average diluted shares outstanding largely due to stock repurchases under our stock repurchase program. \nDiluted earnings per share for the six month period ended August 2, 2025 was $3.03 compared to $3.05 for the six month period ended August 3, 2024. The $0.02 decrease in the diluted earnings per share for the six month period ended August 2, 2025 was primarily attributable to an approximately 3% decrease in net earnings, partially offset by a 2% reduction in weighted-average diluted shares outstanding largely due to stock repurchases under our stock repurchase program. \nEarnings for both the three and six month periods ended August 2, 2025 included approximately an $0.11 per share negative impact from tariff-related costs.\nStores. \nThe following table summarizes the stores opened and closed during the three and six month periods ended August 2, 2025 and August 3, 2024:\nThree Months Ended\nSix Months Ended\nStore Count\nAugust 2, 2025\nAugust 3, 2024\nAugust 2, 2025\nAugust 3, 2024\nRoss Dress for Less\nBeginning of the period\n1,847\n \n1,775 \n1,831\n \n1,764 \nOpened in the period\n28\n \n21 \n44\n \n32 \nClosed in the period\n(2)\n(1)\n(2)\n(1)\nTotal Ross Dress for Less stores end of period\n1,873\n \n1,795 \n1,873\n \n1,795 \ndd’s DISCOUNTS\nBeginning of the period\n358\n \n352 \n355\n \n345 \nOpened in the period\n3\n \n3 \n6\n \n10 \nClosed in the period\n(1)\n(2)\n(1)\n(2)\nTotal dd’s DISCOUNTS stores end of period\n360\n \n353 \n360\n \n353 \nTotal stores end of period\n2,233\n \n2,148 \n2,233\n \n2,148 \n20\nFinancial Condition\nLiquidity and Capital Resources\nThe primary sources of funds for our business activities are cash flows from operations and short-term trade credit. Our primary ongoing cash requirements are for merchandise inventory purchases, payroll, operating and variable lease costs, taxes, capital expenditures related to new and existing stores, and investments in distribution centers, information systems, and buying and corporate offices. We also use cash to repurchase stock under active stock repurchase programs, repay debt as it becomes due, and pay dividends. We repaid at maturity $700 million of our Senior Notes in April 2025. The $500 million principal amount of 0.875% Senior Notes is due in April 2026.\nSix Months Ended\n($ millions)\nAugust 2, 2025\nAugust 3, 2024\nCash provided by operating activities\n$\n1,078\n \n$\n961 \nCash used in investing activities\n(409)\n(334)\nCash used in financing activities\n(1,552)\n(830)\nNet decrease in cash, cash equivalents, and restricted cash and cash equivalents\n$\n(883)\n$\n(203)\nOperating Activities\nNet cash provided by operating activities was $1.1 billion for the six month period ended August 2, 2025. This was primarily driven by net earnings excluding non-cash expenses for depreciation, amortization, and stock-based compensation, partially offset by the payment of fiscal 2024 incentive bonuses. Net cash provided by operating activities was $961 million for the six month period ended August 3, 2024. This was primarily driven by net earnings excluding non-cash expenses for depreciation, amortization, and stock-based compensation, partially offset by the payment of fiscal 2023 incentive bonuses.\nThe increase in cash flow provided by operating activities for the six month period ended August 2, 2025 compared to the same period in the prior fiscal year was primarily driven by lower income taxes paid and lower incentive compensation payments.\nAccounts payable leverage (defined as accounts payable divided by merchandise inventory) was 85% and 89% as of August 2, 2025 and August 3, 2024, respectively. The decrease in accounts payable leverage was primarily due to the timing of inventory receipts and related payments versus last year.\nAs a regular part of our business, packaway inventory levels will vary over time based on availability of compelling merchandise purchase opportunities in the marketplace and our decisions on the timing for release of that inventory to our stores. Packaway merchandise is purchased with the intent that it will be stored in our warehouses until a later date. The timing of the release of packaway inventory to our stores is principally driven by the product mix and seasonality of the merchandise, and its relation to our store merchandise assortment plans. As such, the aging of packaway varies by merchandise category and seasonality of purchase, but typically packaway remains in storage for less than six months. We expect to continue to take advantage of packaway inventory opportunities to maximize our ability to deliver bargains to our customers.\nChanges in packaway inventory levels affect our operating cash flow. As of August 2, 2025 and February 1, 2025, packaway inventory was 38% and 41% of total inventory.\nInvesting Activities\nNet cash used in investing activities was $409 million and $334 million for the six month periods ended August 2, 2025 and August 3, 2024, respectively, and was related to our capital expenditures. Our capital expenditures include costs to open new stores and improve existing stores, build, expand, and improve distribution centers, and for various other expenditures related to our information technology systems and buying and corporate offices.\nThe change in cash used in investing activities for the six month period ended August 2, 2025, compared to the same period in the prior fiscal year, was primarily due to higher capital expenditures in the current year related to the construction of our next distribution center in Randleman, North Carolina and the opening of new stores.\n21\nCapital expenditures for fiscal 2025 are currently projected to be approximately $800 million. Our planned capital expenditures for fiscal 2025 are for costs to open new stores and improve existing stores, investments in our supply chain to support long-term growth, including construction of our next distribution center, investments in our information technology systems, and for various other expenditures related to our stores, distribution centers, and buying and corporate offices. We expect to fund capital expenditures with available cash.\nFinancing Activities\nNet cash used in financing activities was $1.6 billion for the six month period ended August 2, 2025 primarily resulting from the repayment at maturity of the \n$700 million\n principal amount of 4.600% Senior Notes in \nApril 2025, \nstock repurchases under our stock repurchase program, and dividend payments. Net cash used in financing activities was $830 million for the six month period ended August 3, 2024 primarily resulting from stock repurchases under our stock repurchase program and dividend payments. \nRevolving credit facilities. \nIn June 2025, we entered into a new, $1.3 billion 2025 Credit Facility, which replaced our previous $1.3 billion unsecured credit facility. As of August 2, 2025, we had no borrowings or standby letters of credit outstanding under the\n 2025 C\nredit Facility, our 2025 C\nredit Facility remained in place and available, an\nd we were in compliance with the financial covenant. Refer to Note E: Debt\n \nin the Notes to Condensed Consolidated Financial Statements \nfor additional information.\nSenior notes.\n As of August 2, 2025, we had approximately $1.5 billion of outstanding unsecured Senior Notes, of which $499 million was classified in Current Liabilities on our Condensed Consolidated Balance Sheet for the period ended August 2, 2025. Refer to Note E: Debt in the Notes to Condensed Consolidated Financial Statements for additional information.\nOther financing activities.\n In March 2024, our Board of Directors approved a two-year program to repurchase up to $2.1 billion of our common stock through \nfiscal 2025\n. During the six month period ended August 2, 2025, we repurchased 3.9 million shares of common stock for $525 million (excluding excise tax) under this program. As of August 2, 2025, there was $525 million available for repurchase under this program.\nDuring the six month periods ended August 2, 2025 and August 3, 2024, we also acquired 0.5 million shares of treasury stock in each period to cover employee tax withholding obligations under our employee equity compensation programs, for aggregate purchase prices of approximately $64 million and $72 million, respectively. \nOn August 20, 2025, our Board of Directors declared a quarterly cash dividend of $0.4050 per common share, payable on September 30, 2025. The Board of Directors declared a quarterly cash dividend of $0.4050 per common share in March and May 2025, and $0.3675 per common share in March, May, August, and November 2024.\nFor the six month periods ended August 2, 2025 and August 3, 2024, we paid cash dividends of $265.6 million and $245.8 million, respectively. \nShort-term trade credit represents a significant source of financing for merchandise inventory. Trade credit arises from customary payment terms and trade practices with our vendors. We regularly review the adequacy of credit available to us from all sources, and expect to be able to maintain adequate trade credit, bank credit, and other credit sources to meet our capital and liquidity requirements.\nWe ended the second quarter of fiscal 2025 with $3.8 billion of unrestricted cash balances, which were held primarily in overnight money market funds invested in U.S. treasury and government instruments across a highly diversified set of banks and other financial institutions. We also have $1.3 billion available under our new 2025 Credit Facility. We estimate that existing cash and cash equivalent balances, cash flows from operations, our bank credit facility, and trade credit are adequate to meet our operating cash needs and to fund our common stock repurchases, planned capital investments, quarterly dividend payments, debt repayments, and interest payments, for at least the next 12 months.\nContractual Obligations and Off-Balance Sheet Arrangements\nAs of August 2, 2025, there have been no material changes to our contractual obligations as disclosed in our Annual Report on Form 10-K as of February 1, 2025, other than those which occur in the ordinary course of business.\n22\nStandby letters of credit and collateral trust. \nWe use standby letters of credit outside of our revolving credit facility and a funded trust to collateralize some of our insurance obligations. As of August 2, 2025, February 1, 2025, and August 3, 2024, we had $1.0 million, $1.8 million, and $2.2 million, respectively, in standby letters of credit outstanding. As of August 2, 2025, February 1, 2025, and August 3, 2024, we had $65.3 million, $63.9 million, and $62.4 million, respectively, held in a collateral trust. The standby letters of credit are collateralized by restricted cash and the collateral trust consists of restricted cash and cash equivalents.\nCritical Accounting Estimates\nDuring the second quarter of fiscal 2025, there were no significant changes to the critical accounting estimates discussed in our Annual Report on Form 10-K for the year ended February 1, 2025.\nForward-Looking Statements\nThis report contains a number of forward-looking statements regarding, without limitation, projected sales, costs and earnings, planned new store growth, capital expenditures, liquidity, and other matters. These forward-looking statements reflect our then-current beliefs, plans, and estimates with respect to future events and our projected financial performance, operations, and competitive position. The words “plan,” “expect,” “target,” “anticipate,” “estimate,” “believe,” “forecast,” “projected,” “guidance,” “outlook,” “looking ahead,” and similar expressions identify forward-looking statements.\nFuture impact from tariffs, inflation, interest rate changes, ongoing military conflicts and economic sanctions, climate change, extreme weather, pandemics, natural disasters, and other economic, regulatory, consumer spending, and industry trends that could potentially adversely affect our revenue, profitability, operating conditions, and growth are difficult to predict. Our forward-looking statements are subject to risks and uncertainties which could cause our actual results to differ materially from those forward-looking statements and our previous expectations, plans, and projections. Such risks and uncertainties are not limited to but may include:\n•\nChanges in U.S. tax, tariff, or trade policy regarding apparel, shoes, and home-related merchandise produced in China and other countries could significantly and adversely affect our business. While we directly import only a small portion of our merchandise, more than half of the goods we sell originate from China. Elevated tariff levels on goods imported into the United States from China and other countries may disrupt our merchandise purchasing patterns, increase our costs, and put pressure on our margins and profitability.\n•\nUncertainties arising from the macroeconomic environment, including inflation and the price of necessities, high interest rates, housing costs, energy and fuel costs, financial and credit market conditions, recession concerns, geopolitical conditions, government policies and enforcement practices with respect to immigration, and public health and public safety issues may affect consumer confidence, consumer disposable income, and shopping behavior, as well as our costs.\n•\nUnexpected changes in the level of consumer spending on, or preferences for, apparel and home-related merchandise could adversely affect us.\n•\nCompetitive pressures in the apparel and home-related merchandise retailing industry.\n•\nOur need to effectively manage our inventories, markdowns, and inventory shortage in order to achieve our planned gross margins.\n•\nRisks associated with importing and selling merchandise produced in China and other countries, including risks from supply chain disruption, shipping delays, and higher than expected ocean freight costs.\n•\nUnseasonable weather or extreme temperatures that may affect shopping patterns and consumer demand for seasonal apparel and other merchandise.\n•\nOur dependence on the market availability, quantity, and quality of attractive brand name merchandise at desirable discounts, and on the ability of our buyers to anticipate consumer preferences and to purchase merchandise to enable us to offer customers a wide assortment of merchandise at competitive prices.\n•\nInformation or data security breaches, including cyber-attacks on our transaction processing and computer information systems, which could disrupt our operations, and result in theft or unauthorized disclosure of confidential and valuable business information, such as customer, credit card, employee, or other private and valuable information that we handle in the ordinary course of our business.\n•\nDisruptions in our supply chain or in our information systems, including from ransomware or other cyber-attacks could impact our ability to process sales and to deliver product to our stores in a timely and cost-effective manner.\n•\nOur need to obtain acceptable new store sites with favorable consumer demographics to achieve our planned store openings.\n23\n•\nOur need to expand in existing markets and enter new geographic markets in order to achieve planned growth and market penetration.\n•\nConsumer problems or legal issues involving the quality, safety, or authenticity of products we sell could harm our reputation, result in lost sales, and/or increase our costs.\n•\nAn adverse outcome in various legal, regulatory, or tax matters, or the adoption of new federal or state tax legislation that increases tax rates or adds new taxes could increase our costs.\n•\nDamage to our corporate reputation or brands could adversely affect our sales and operating results.\n•\nOur need to continually attract, train, and retain associates with the retail talent necessary to execute our off-price retail strategies.\n•\nOur need to effectively advertise and market our business.\n•\nPossible volatility in our revenues and earnings.\n•\nA public health or public safety crisis, or a natural or man-made disaster in California or another region where we have a concentration of stores, offices, or a distribution center could harm our business.\n•\nOur need to maintain sufficient liquidity to support our continuing operations and our new store openings.\nThe factors underlying our forecasts are dynamic and subject to change. As a result, any forecasts or forward-looking statements speak only as of the date they are given and do not necessarily reflect our outlook at any other point in time. We disclaim any obligation to update or revise these forward-looking statements."
}