{
  "source_file": "rsg-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nYou should read the following discussion in conjunction with the unaudited consolidated financial statements and notes thereto included under Part I, Item 1 of this Quarterly Report on Form 10-Q. In addition, you should refer to our audited consolidated financial statements and notes thereto and related \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n appearing in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024.\nDisclosure Regarding Forward-Looking Statements\nThis Quarterly Report on Form 10-Q contains certain forward-looking information about us that is intended to be covered by the safe harbor for “forward-looking statements” provided by the Private Securities Litigation Reform Act of 1995. Forward-looking statements are statements that are not historical facts. Words such as “guidance,” “expect,” “will,” “may,” “anticipate,” “plan,” “estimate,” “project,” “intend,” “should,” “can,” “likely,” “could,” “outlook” and similar expressions are intended to identify forward-looking statements. In particular, information appearing in this “Management's Discussion and Analysis of Financial Condition and Results of Operations” includes forward-looking statements. These statements include information about our plans, strategies, and expectations of future financial performance and prospects. Forward-looking statements are not guarantees of performance. These statements are based upon the current beliefs and expectations of our management and are subject to risk and uncertainties that could cause actual results to differ materially from those expressed in, or implied or projected by, the forward-looking information and statements. Although we believe that the expectations reflected in the forward-looking statements are reasonable, such expectations may not prove to be correct. Among the factors that could cause actual results to differ materially from the expectations expressed in the forward-looking statements are the impacts of the overall global economy and changing interest rates, impacts from international trade restrictions and tariffs, our ability to effectively integrate and manage companies we acquire, and to realize the anticipated benefits of any such acquisitions, the impact of prolonged work stoppages or other labor disruptions, the amount of the financial contribution of our sustainability initiatives, acts of war, riots or terrorism, and the impact of these acts on economic, financial and social conditions in the United States, as well as our dependence on large, long-term collection, transfer and disposal contracts. More information on factors that could cause actual results or events to differ materially from those anticipated is included from time to time in our reports filed with the Securities and Exchange Commission, including our Annual Report on Form 10-K for the year ended December 31, 2024, particularly under Part 1, Item 1A - Risk Factors. Additionally, new risk factors emerge from time to time and it is not possible for us to predict all such risk factors, or to assess the impact such risk factors might have on our business. We undertake no obligation to update publicly any forward-looking statements whether as a result of new information, future events or otherwise, except as required by law.\nOverview\nRepublic is one of the largest providers of environmental services in the United States, as measured by revenue. As of September 30, 2025, we operated across the United States and Canada through 373 collection operations, 254 transfer stations, 79 recycling centers, 209 active landfills, 2 treatment, recovery and disposal facilities, 23 treatment, storage and disposal facilities (TSDF), 5 salt water disposal wells, 15 deep injection wells and 2 polymer centers. We are engaged in 81 landfill gas-to-energy and other renewable energy projects and had post-closure responsibility for 125 closed landfills as of September 30, 2025.\nRevenue for the nine months ended September 30, 2025 increased by 3.9% to $12,456 million compared to $11,986 million for the same period in 2024. This change in revenue is due to increases in average yield of 4.2% and increased revenue from acquisitions, net of divestitures of 1.3%. These increases were partially offset by a decrease in volume of 0.4%, a decrease in fuel recovery fees of 0.2%, a decrease in environmental solutions revenue of 0.7%, and a decrease of 0.2% due to the number of workdays during the nine months ended September 30, 2025, as compared to the same period in 2024.\n31\nTable \nof\n Contents\nThe following table summarizes our revenue, expenses and operating income for the three and nine months ended September 30, 2025 and 2024 (in millions of dollars and as a percentage of revenue):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nRevenue\n$\n4,212 \n100.0 \n%\n$\n4,076 \n100.0 \n%\n$\n12,456 \n100.0 \n%\n$\n11,986 \n100.0 \n%\nExpenses:\nCost of operations\n2,463 \n58.5 \n2,367 \n58.0 \n7,226 \n58.0 \n7,033 \n58.7 \nDepreciation, depletion and amortization of property and equipment\n406 \n9.6 \n383 \n9.4 \n1,210 \n9.7 \n1,122 \n9.4 \nAmortization of other intangible assets\n22 \n0.5 \n18 \n0.4 \n65 \n0.5 \n54 \n0.4 \nAmortization of other assets\n31 \n0.7 \n21 \n0.6 \n81 \n0.7 \n58 \n0.5 \nAccretion\n29 \n0.7 \n26 \n0.7 \n85 \n0.7 \n80 \n0.7 \nSelling, general and administrative\n422 \n10.0 \n406 \n10.0 \n1,274 \n10.2 \n1,227 \n10.2 \nLoss (gain) on business divestitures and impairments, net\n— \n— \n1 \n— \n— \n— \n(1)\n— \nRestructuring charges\n3 \n0.1 \n8 \n0.1 \n13 \n0.1 \n20 \n0.1 \nOperating income\n$\n836 \n19.9 \n%\n$\n846 \n20.8 \n%\n$\n2,502 \n20.1 \n%\n$\n2,393 \n20.0 \n%\nOur pre-tax income was $645 million and $2,030 million for the three and nine months ended September 30, 2025, respectively, compared to $647 million and $1,899 million for the same periods in 2024, respectively. Our net income attributable to Republic Services, Inc. was $550 million and $1,595 million for the three and nine months ended September 30, 2025, or $1.76 and $5.10 per diluted share, respectively, compared to $566 million and $1,531 million, or $1.80 and $4.86 per diluted share, for the same periods in 2024, respectively.\nDuring each of the three and nine months ended September 30, 2025 and 2024, we recorded a number of charges, other expenses and benefits that impacted our pre-tax income, tax expense, net income attributable to Republic Services, Inc. (net income – Republic) and diluted earnings per share as noted in the following table (in millions, except per share data). Additionally, see our \nResults of Operations \ndiscussion in this \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n for a discussion of other items that impacted our earnings during the three and nine months ended September 30, 2025 and 2024.\nThree Months Ended September 30, 2025\nThree Months Ended September 30, 2024\nDiluted\nDiluted\nNet\nEarnings\nNet\nEarnings\nPre-tax\nTax\nIncome -\nper\nPre-tax\nTax\nIncome -\nper\nIncome\nImpact\n(1)\nRepublic\nShare\nIncome\nImpact\n(1)\nRepublic\nShare\nAs reported\n$\n645 \n$\n95 \n$\n550 \n$\n1.76 \n$\n647 \n$\n81 \n$\n566 \n$\n1.80 \nLoss on extinguishment of debt and other related costs\n— \n— \n— \n— \n2 \n— \n2 \n0.01 \nRestructuring charges\n3 \n1 \n2 \n0.01 \n8 \n2 \n6 \n0.02 \nLabor disruption\n56 \n14 \n42 \n0.13 \n— \n— \n— \n— \nLoss on business divestitures and impairments, net\n(2)\n— \n— \n— \n— \n1 \n1 \n— \n— \nSettlements and withdrawals on pension plans\n— \n— \n— \n— \n(8)\n(2)\n(6)\n(0.02)\nTotal adjustments\n59 \n15 \n44 \n0.14 \n3 \n1 \n2 \n0.01 \nAs adjusted\n$\n704 \n$\n110 \n$\n594 \n$\n1.90 \n$\n650 \n$\n82 \n$\n568 \n$\n1.81 \n32\nTable \nof\n Contents\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nDiluted\nDiluted\nNet\nEarnings\nNet\nEarnings\nPre-tax\nTax\nIncome -\nper\nPre-tax\nTax\nIncome -\nper\nIncome\nImpact\n(1)\nRepublic\nShare\nIncome\nImpact\n(1)\nRepublic\nShare\nAs reported\n$\n2,030 \n$\n435 \n$\n1,595 \n$\n5.10 \n$\n1,899 \n$\n368 \n$\n1,531 \n$\n4.86 \nGain on extinguishment of debt and other related costs\n— \n— \n— \n— \n(5)\n(1)\n(4)\n(0.01)\nRestructuring charges\n13 \n4 \n9 \n0.03 \n20 \n5 \n15 \n0.04 \nLabor disruption\n56 \n14 \n42 \n0.13 \n— \n— \n— \n— \nGain on business divestitures and impairments, net\n(3)\n— \n— \n— \n— \n(1)\n— \n(1)\n— \nSettlements and withdrawals on pension plans\n— \n— \n— \n— \n(8)\n(2)\n(6)\n(0.02)\nTotal adjustments\n69 \n18 \n51 \n0.16 \n6 \n2 \n4 \n0.01 \nAs adjusted\n$\n2,099 \n$\n453 \n$\n1,646 \n$\n5.26 \n$\n1,905 \n$\n370 \n$\n1,535 \n$\n4.87 \n(1) The income tax effect related to our adjustments includes both the current and deferred income tax impact and is individually calculated based on the statutory rates applicable to each adjustment.\n(2) The aggregate impact to adjusted diluted earnings per share totals to less than $0.01 for the three months ended September 30, 2024.\n(3) The aggregate impact to adjusted diluted earnings per share totals to less than $0.01 for the nine months ended September 30, 2024.\nWe believe that presenting adjusted pre-tax income, adjusted tax impact, adjusted net income – Republic, and adjusted diluted earnings per share, which are not measures determined in accordance with U.S. GAAP, provides an understanding of operational activities before the financial impact of certain items. We use these measures, and believe investors will find them helpful, in understanding the ongoing performance of our operations separate from items that have a disproportionate impact on our results for a particular period. We have incurred comparable charges, costs and recoveries in prior periods, and similar types of adjustments can reasonably be expected to be recorded in future periods. Our definitions of adjusted pre-tax income, adjusted tax impact, adjusted net income – Republic, and adjusted diluted earnings per share may not be comparable to similarly titled measures presented by other companies. Further information on these adjustments is included below.\nRestructuring charges.\n \nDuring the \nthree and nine months ended September 30, 2025, \nwe incurred restructuring charges of \n$3 million\n and \n$13 million, respectively, and during the three and nine months ended September 30, 2024, we incurred restructuring charges of\n \n$8 million and $20 million\n, respectively. The 2025 charges primarily related to the design and implementation of a new accounts receivable system. The \n2024\n charges primarily related to the redesign of our asset management, and customer and order management software systems. During the \nnine months ended September 30, 2025\n and 2024, we paid $10 million and $18 million, respectively, related to these restructuring efforts.\nDuring the remainder of 2025, we expect to incur additional restructuring charges of approximately \n$3 million\n,\n primarily related to the design and implementation of a new accounts receivable system\n. Substantially all of these restructuring charges will be recorded in Corporate entities and other.\nLabor disruption. \nDuring the three and nine months ended September 30, 2025, we experienced labor disruptions in certain isolated markets. The impact of these labor disruptions was $56 million during both the three and nine months ended September 30, 2025, including $16 million of customer credits and $40 million of cost of operations. \n33\nTable \nof\n Contents\nResults of Operations\nRevenue\nWe generate revenue by providing environmental services to our customers, including the collection and processing of recyclable materials, the collection, treatment, consolidation, transfer and disposal of hazardous and non-hazardous waste and other environmental solutions. Our residential, small-container and large-container collection operations in some markets are based on long-term contracts with municipalities. Certain of our municipal contracts have annual price escalation clauses that are tied to changes in an underlying base index such as a consumer price index. We generally provide small-container and large-container collection services to customers under contracts with terms up to three years. Our transfer stations and landfills generate revenue from disposal or tipping fees charged to third parties. Our recycling centers generate revenue from tipping fees charged to third parties and the sale of recycled commodities. Our revenue from environmental solutions is primarily generated by (1) fees we charge for the collection, treatment, transfer and disposal of hazardous and non-hazardous waste, (2) field and industrial services, (3) equipment rental, (4) emergency response and standby services, (5) in-plant services, such as transportation and logistics, including at our TSDFs and (6) in-plant services such as high-pressure cleaning, tank cleaning, decontamination, remediation, transportation, spill cleanup and emergency response at refineries, chemical, steel and automotive plants and other governmental, commercial and industrial facilities. Other non-core revenue consists primarily of revenue from National Accounts, which represents the portion of revenue generated from nationwide or regional contracts in markets outside our operating areas where the associated material handling is subcontracted to local operators. Consequently, substantially all of this revenue is offset with related subcontract costs, which are recorded in cost of operations. The following table reflects our revenue by service line for the three and nine months ended September 30, 2025 and 2024 (in millions of dollars and as a percentage of revenue):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nCollection:\nResidential\n$\n754 \n17.9 \n%\n$\n740 \n18.1 \n%\n$\n2,249 \n18.0 \n%\n$\n2,196 \n18.3 \n%\nSmall-container\n1,267 \n30.1 \n1,209 \n29.7 \n3,768 \n30.3 \n3,599 \n30.0 \nLarge-container\n797 \n18.9 \n775 \n19.0 \n2,330 \n18.7 \n2,278 \n19.0 \nOther\n17 \n0.4 \n18 \n0.5 \n53 \n0.4 \n54 \n0.5 \nTotal collection\n2,835 \n67.3 \n2,742 \n67.3 \n8,400 \n67.4 \n8,127 \n67.8 \nTransfer\n472 \n459 \n1,376 \n1,336 \nLess: intercompany\n(248)\n(247)\n(741)\n(733)\nTransfer, net\n224 \n5.3 \n212 \n5.2 \n635 \n5.1 \n603 \n5.0 \nLandfill\n845 \n768 \n2,421 \n2,234 \nLess: intercompany\n(329)\n(315)\n(968)\n(937)\nLandfill, net\n516 \n12.3 \n453 \n11.1 \n1,453 \n11.7 \n1,297 \n10.8 \nEnvironmental solutions\n449 \n480 \n1,393 \n1,408 \nLess: intercompany\n(16)\n(15)\n(49)\n(47)\nEnvironmental solutions, net\n433\n10.3 \n465\n11.4 \n1,344 \n10.8 \n1,361 \n11.4 \nOther:\nRecycling processing and commodity sales\n107 \n2.5 \n107 \n2.6 \n328 \n2.6 \n311 \n2.6 \nOther non-core\n97 \n2.3 \n97 \n2.4 \n296 \n2.4 \n287 \n2.4 \nTotal other\n204 \n4.8 \n204 \n5.0 \n624 \n5.0 \n598 \n5.0 \nTotal revenue\n$\n4,212 \n100.0 \n%\n$\n4,076 \n100.0 \n%\n$\n12,456 \n100.0 \n%\n$\n11,986 \n100.0 \n%\n34\nTable \nof\n Contents\nThe following table reflects changes in components of our revenue, as a percentage of total revenue, for the three and nine months ended September 30, 2025 and 2024:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nAverage yield \n4.0 \n%\n4.6 \n%\n4.2 \n%\n5.4 \n%\nFuel recovery fees\n— \n(0.2)\n(0.2)\n(0.2)\nTotal price\n4.0 \n4.4 \n4.0 \n5.2 \nVolume\n(0.3)\n(1.2)\n(0.4)\n(1.0)\nChange in workdays\n— \n0.3 \n(0.2)\n0.1 \nRecycling processing and commodity sales\n(0.2)\n0.7 \n— \n0.5 \nEnvironmental solutions\n(1.4)\n— \n(0.7)\n(0.2)\nOther\n(1)\n(0.4)\n— \n(0.1)\n— \nTotal internal growth\n1.7 \n4.2 \n2.6 \n4.6 \nAcquisitions / divestitures, net\n1.6 \n2.3 \n1.3 \n3.1 \nTotal\n3.3 \n%\n6.5 \n%\n3.9 \n%\n7.7 \n%\nCore price\n5.9 \n%\n6.2 \n%\n5.9 \n%\n6.6 \n%\n(1) Other represents customer credits recognized in connection with recent labor disruptions.\nAverage yield is defined as revenue growth from the change in average price per unit of service, expressed as a percentage. Core price is defined as price increases to our customers and fees, excluding fuel recovery fees, net of price decreases to retain customers. We also measure changes in core price, average yield and volume as a percentage of related-business revenue, defined as total revenue excluding recycled commodities, fuel recovery fees and environmental solutions revenue, to determine the effectiveness of our pricing and organic growth strategies. \nThe following table reflects core price, average yield and volume as a percentage of related-business revenue for the three and nine months ended September 30, 2025 and 2024:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nAs a % of Related Business\nAs a % of Related Business\nCore price\n7.2 \n%\n7.4 \n%\n7.2 \n%\n8.0 \n%\nAverage yield\n4.9 \n%\n5.5 \n%\n5.1 \n%\n6.5 \n%\nVolume\n(0.4)\n%\n(1.5)\n%\n(0.5)\n%\n(1.2)\n%\nDuring the three and nine months ended September 30, 2025, we experienced the following changes in our revenue as compared to the same periods in 2024:\n•\nAverage yield increased revenue by 4.0% and 4.2% for the three and nine months ended September 30, 2025, respectively, due to positive pricing changes in all lines of business.\n•\nThe fuel recovery fee program, which mitigates our exposure to changes in fuel prices, resulted in no change to revenue for the three months ended September 30, 2025, primarily due to the timing of implementing changes to the rates to reflect the increase in fuel prices compared to the same period in 2024. The fuel recovery fee program decreased revenue by 0.2% for the nine months ended September 30, 2025, due to a decrease in fuel prices compared to the same period in 2024.\n•\nVolume decreased revenue for the three and nine months ended September 30, 2025 by 0.3% and 0.4%, respectively, primarily due to a decrease in volume in our collection lines of business as well as a decrease in solid waste volumes in our landfill line of business. The decline in revenue in our large-container collection line of business was primarily driven by a slowing in construction-related activity as well as adverse weather in January and February. The decline in our residential and small-container collection lines of business is primarily attributable to certain municipal contract losses and broker-related business. \nThe decrease in overall volume during the three and nine months ended September 30, 2025 was partially offset by an increase in construction and demolition and special waste volumes. The increase was primarily related to Hurricane \n35\nTable \nof\n Contents\nHelene recovery efforts and the Los Angeles area wildfire remediation. The increase in volume from these events increased revenue during the nine months ended September 30, 2025 by approximately $100 million.\n•\nThe impact of the number of workdays resulted in no change to revenue during the three months ended September 30, 2025, as compared to the same period in 2024. Revenue decreased by 0.2% due to the impact of the number of workdays during the nine months ended September 30, 2025, as compared to the same period in 2024, which drove a decrease in volumes in our collection, landfill, and transfer lines of business.\n•\nRecycling processing and commodity sales decreased revenue by 0.2% during the three months ended September 30, 2025, primarily due to a decrease in price for recycled commodities compared to the same period 2024. This decrease was largely offset by increased volumes at the Las Vegas Polymer Center, the opening of the Indianapolis Polymer Center and reopening a recycling center on the west coast. There was no change to revenue as a result of recycling processing and commodity sales during the nine months ended September 30, 2025, as compared to the same period in 2024. The average price for recycled commodities at our recycling centers, excluding glass and organics, for the three and nine months ended September 30, 2025 was $126 and $143 per ton, respectively, compared to $177 and $168 per ton for the same periods in 2024, respectively.\nChanging market demand for recycled commodities causes volatility in commodity prices. At current volumes and mix of materials, we believe a $10 per ton change in the price of recycled commodities would change both annual revenue and operating income by approximately $11 million.\n•\nEnvironmental solutions decreased revenue by 1.4% and 0.7% during the three and nine months ended September 30, 2025, respectively, primarily due to a decline in manufacturing and emergency response activity as well as a decrease in event-based volumes into our landfills.\n•\nAcquisitions, net of divestitures, increased revenue by 1.6% and 1.3% during the three and nine months ended September 30, 2025, respectively, reflecting the results of our continued growth strategy of acquiring environmental services companies that complement and expand our existing business platform.\nCost of Operations\nCost of operations includes labor and related benefits, which consists of salaries and wages, health and welfare benefits, incentive compensation and payroll taxes. It also includes transfer and disposal costs representing tipping fees paid to third party disposal facilities and transfer stations; maintenance and repairs relating to our vehicles, equipment and containers, including related labor and benefit costs; transportation and subcontractor costs, which include costs for independent haulers that transport our waste to disposal facilities and costs for local operators that provide waste handling services associated with our National Accounts in markets outside our standard operating areas; fuel, which includes the direct cost of fuel used by our vehicles, net of fuel tax credits; disposal fees and taxes, consisting of landfill taxes, host community fees and royalties; landfill operating costs, which includes financial assurance, leachate disposal, remediation charges and other landfill maintenance costs; risk management costs, which include insurance premiums and claims; cost of goods sold, which includes material costs paid to suppliers; and other, which includes expenses such as facility operating costs, equipment rent and gains or losses on sale of assets used in our operations.\nThe following table summarizes the major components of our cost of operations for the three and nine months ended September 30, 2025 and 2024 (in millions of dollars and as a percentage of revenue):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nLabor and related benefits\n$\n812 \n19.3 \n%\n$\n814 \n20.0 \n%\n$\n2,475 \n19.9 \n%\n$\n2,412 \n20.1 \n%\nTransfer and disposal costs\n275 \n6.5 \n280 \n6.9 \n808 \n6.5 \n832 \n7.0 \nMaintenance and repairs\n384 \n9.1 \n380 \n9.3 \n1,122 \n9.0 \n1,106 \n9.2 \nTransportation and subcontract costs\n302 \n7.2 \n304 \n7.4 \n896 \n7.2 \n885 \n7.4 \nFuel\n120 \n2.8 \n113 \n2.8 \n349 \n2.8 \n360 \n3.0 \nDisposal fees and taxes\n95 \n2.3 \n91 \n2.2 \n275 \n2.2 \n265 \n2.2 \nLandfill operating costs\n99 \n2.3 \n88 \n2.1 \n292 \n2.3 \n275 \n2.3 \nRisk management\n109 \n2.6 \n103 \n2.5 \n321 \n2.6 \n300 \n2.5 \nOther\n \n227 \n5.4 \n194 \n4.8 \n648 \n5.2 \n598 \n5.0 \nSubtotal\n2,423 \n57.5 \n2,367 \n58.0 \n7,186 \n57.7 \n7,033 \n58.7 \nLabor disruption\n40 \n1.0 \n— \n— \n40 \n0.3 \n— \n— \nTotal cost of operations\n$\n2,463 \n58.5 \n%\n$\n2,367 \n58.0 \n%\n$\n7,226 \n58.0 \n%\n$\n7,033 \n58.7 \n%\n36\nTable \nof\n Contents\nThese cost categories may change from time to time and may not be comparable to similarly titled categories presented by other companies. As such, you should take care when comparing our cost of operations by component to that of other companies and of ours for prior periods.\nThe most significant items impacting our cost of operations during the three and nine months ended September 30, 2025 and 2024 are summarized below: \n•\nLabor and related benefits increased in aggregate dollars for the nine months ended September 30, 2025 due to higher hourly and salaried wages as a result of annual merit increases. Partially offsetting these increases was the impact of one less workday compared to the nine months ended September 30, 2024.\n•\nTransfer and disposal costs decreased primarily due to a decrease in collection volumes. \nDuring both the three and nine months ended September 30, 2025 and 2024, approximately 67% of the total solid waste volume we collected was disposed at landfill sites that we owned or operated (internalization).\n•\nMaintenance and repairs expense increased in aggregate dollars due to higher hourly wages as a result of annual merit increases, parts inflation and an increase in third-party maintenance.\n•\nOur fuel costs increased during the three months ended September 30, 2025 due to an increase in acquisition-related activity as well as the expiration of alternative fuel tax credits during the period. Our fuel costs decreased during the nine months ended September 30, 2025, primarily due to a decrease in the average diesel fuel price per gallon. The national average diesel fuel price per gallon for the three and nine months ended September 30, 2025 was $3.76 and $3.65, respectively, as compared to $3.69 and $3.83, respectively, for the same periods in 2024.\nAt current consumption levels, we believe a twenty-cent per gallon change in the price of diesel fuel would change our fuel costs by approximately $27 million per year. Offsetting these changes in fuel expense would be changes in our fuel recovery fee charged to our customers. At current participation rates, a twenty-cent per gallon change in the price of diesel fuel would change our fuel recovery fee by approximately $38 million per year.\n•\nLandfill operating costs increased primarily due to an increase in monitoring and maintenance costs on our gas and leachate extraction systems.\n•\nRisk management expenses increased primarily due to higher premium costs.\n•\nOther costs of operations increased due to increased occupancy and facility related expenses as well as a favorable non-recurring insurance recovery recognized during the nine months ended September 30, 2024.\n•\nDuring the three and nine months ended September 30, 2025, we experienced labor disruptions in certain isolated markets. We incurred $40 million of cost of operations primarily as a result of an increase in labor and other cost of operations.\nDepreciation, Depletion and Amortization of Property and Equipment\nThe following table summarizes depreciation, depletion and amortization of property and equipment for the three and nine months ended September 30, 2025 and 2024 (in millions of dollars and as a percentage of revenue):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nDepreciation and amortization of property and equipment\n$\n267 \n6.3 \n%\n$\n255 \n6.3 \n%\n$\n792 \n6.4 \n%\n$\n744 \n6.2 \n%\nLandfill depletion and amortization\n139 \n3.3 \n128 \n3.1 \n418 \n3.3 \n378 \n3.2 \nDepreciation, depletion and amortization expense\n$\n406 \n9.6 \n%\n$\n383 \n9.4 \n%\n$\n1,210 \n9.7 \n%\n$\n1,122 \n9.4 \n%\nDepreciation and amortization of property and equipment increased for the three and nine months ended September 30, 2025, largely due to an increased investment in trucks and the supporting infrastructure as well as the addition of assets through acquisitions.\nLandfill depletion and amortization expense increased for the three and nine months ended September 30, 2025 due to increased construction and demolition volumes related to the Hurricane Helene recovery efforts and increased special waste volumes attributable to the Los Angeles area wildfire remediation. Landfill depletion and amortization expense also increased due to an increase in our overall average depletion rate. \nAmortization of Other Intangible Assets\nAmortization of other intangible assets primarily relates to customer relationships. Expenses for amortization of other intangible assets were $22 million and $65 million, or 0.5% of revenue, for the three and nine months ended September 30, 2025, respectively, compared to $18 million and $54 million, or 0.4% of revenue, for the same periods in 2024, respectively. Amortization expense increased due to assets added through acquisition activity\n37\nTable \nof\n Contents\nAmortization of Other Assets\nOur other assets primarily relate to the prepayment of fees and capitalized implementation costs associated with cloud-based hosting arrangements. Expenses for amortization of other assets were $31 million and $81 million, or 0.7% of revenue, for the three and nine months ended September 30, 2025, respectively, compared to $21 million and $58 million, or 0.6% and 0.5% of revenue, for the same periods in 2024, respectively.\nAccretion Expense\nAccretion expense was $29 million and $85 million, or 0.7% of revenue, for the three and nine months ended September 30, 2025, respectively, compared to $26 million and $80 million, or 0.7% of revenue, for the same periods in 2024, respectively. \nSelling, General and Administrative Expenses\nSelling, general and administrative expenses include salaries, health and welfare benefits, and incentive compensation for corporate and field general management, field support functions, sales force, accounting and finance, legal, management information systems, and clerical and administrative departments. Other expenses include rent and office costs, fees for professional services provided by third parties, legal settlements, marketing, investor and community relations services, directors’ and officers’ insurance, general employee relocation, travel, entertainment and bank charges. Restructuring charges are excluded from selling, general and administrative expenses and are discussed separately.\nThe following table summarizes our selling, general and administrative expenses for the three and nine months ended September 30, 2025 and 2024 (in millions of dollars and as a percentage of revenue):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nSalaries and related benefits\n$\n269 \n6.4 \n%\n$\n278 \n6.9 \n%\n$\n842 \n6.8 \n%\n$\n834 \n6.9 \n%\nProvision for doubtful accounts\n9 \n0.2 \n— \n— \n27 \n0.2 \n20 \n0.2 \nOther\n144 \n3.4 \n128 \n3.1 \n405 \n3.2 \n373 \n3.1 \nTotal selling, general and administrative expenses\n$\n422 \n10.0 \n%\n$\n406 \n10.0 \n%\n$\n1,274 \n10.2 \n%\n$\n1,227 \n10.2 \n%\nThese cost categories may change from time to time and may not be comparable to similarly titled categories presented by other companies. As such, you should take care when comparing our selling, general and administrative expenses by cost component to those of other companies and of ours for prior periods.\nThe most significant items affecting our selling, general and administrative expenses during the three and nine months ended September 30, 2025 and 2024 are summarized below:\n•\nSalaries and related benefits decreased for the three months ended September 30, 2025 primarily due to a decrease in management incentive compensation. Salaries and related benefits increased in aggregate dollars for the nine months ended September 30, 2025 primarily due to higher wages and benefits resulting from annual merit increases, partially offset by a decrease in management incentive compensation.\n•\nOther selling, general and administrative expenses increased during the three and nine months ended September 30, 2025 primarily due to an unfavorable legal settlement recognized during the period.\nRestructuring Charges\nFor a discussion of Restructuring Charges incurred during the three and nine months ended September 30, 2025 and 2024, see \nOverview\n of this \nManagement's Discussion and Analysis of Financial Condition and Results of Operations.\n38\nTable \nof\n Contents\nInterest Expense\nThe following table provides the components of interest expense, including accretion of debt discounts and accretion of discounts primarily associated with environmental and risk insurance liabilities assumed in acquisitions, for the three and nine months ended September 30, 2025 and 2024 (in millions of dollars):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nInterest expense on debt\n$\n126 \n$\n121 \n$\n378 \n$\n357 \nNon-cash interest\n20 \n19 \n57 \n54 \nLess: capitalized interest\n(3)\n(2)\n(7)\n(5)\nTotal interest expense\n$\n143 \n$\n138 \n$\n428 \n$\n406 \nTotal interest expense for the three and nine months ended September 30, 2025 increased primarily due to a higher overall debt balance as well as higher interest rates on our debt compared to the same periods in 2024.\nFor the nine months ended September 30, 2025 and 2024, cash paid for interest, excluding net swap settlements for our floating-to-fixed interest rate swap, was $355 million and $345 million, respectively. \nAs of September 30, 2025, we had $1,941 million of principal floating rate debt. If interest rates increased or decreased by 100 basis points on our floating rate debt, annualized interest expense and net cash payments for interest would increase or decrease by approximately $19 million.\nIncome Taxes\nOur effective tax rate, exclusive of non-controlling interests, for the three and nine months ended September 30, 2025 was 14.7% and 21.4%, respectively. Our effective tax rate, exclusive of non-controlling interests, for the three and nine months ended September 30, 2024, was 12.5% and 19.4%, respectively. Our effective tax rate for the three and nine months ended September 30, 2025 reflects a benefit of $65 million due to our investments in renewable energy assets, $8 million and $18 million, respectively, due to investments in renewable natural gas projects and commercial electric vehicles, and $9 million due to the realization of additional federal and state tax benefits, as well as adjustments to deferred taxes due to the completion of our 2024 tax returns. \nOur effective tax rate for the three and nine months ended September 30, 2024 reflected a benefit of $81 million and $122 million, respectively, due to our investments in renewable energy assets qualifying for tax credits under Section 48 of the Internal Revenue Code, $6 million due to the realization of additional federal and state tax benefits, as well as adjustments to deferred taxes due to the completion of our 2023 tax returns.\nFor the nine months ended September 30, 2025 and 2024, net cash paid for income taxes was $166 million and $183 million, respectively. \nOn July 4, 2025, the One Big Beautiful Bill Act (the \"Act”) was signed into law. The Act, among other things, implemented changes to the tax treatment relating to bonus depreciation, research and experimental expenditures and interest expense, and included phase-outs and restrictions on several clean energy tax incentives. The Company does not expect the Act to have a material impact on our effective tax rate. We expect to recognize approximately $80 million of cash tax benefit during the year ended December 31, 2025 as a result of changes to bonus depreciation.\nFor additional discussion and detail regarding our income taxes, see Note 8,\n Income Taxes\n, to our unaudited consolidated financial statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q.\nReportable Segments\nOur senior management evaluates, oversees and manages the financial performance of our operations through three field groups, referred to as Group 1, Group 2 and Group 3. Group 1 is our recycling and waste business operating primarily in geographic areas located in the western United States. Group 2 is our recycling and waste business operating primarily in geographic areas located in the southeastern and mid-western United States, the eastern seaboard of the United States, and Canada. Group 3 is our environmental solutions business operating in geographic areas located across the United States and Canada. These groups are presented below as our reportable segments, which each provide integrated environmental services, including but not limited to collection, transfer, recycling and disposal. \nCorporate entities and other includes marketing, operations support, business development, legal, tax, treasury, information technology, risk management, human resources and other administrative functions. National Accounts revenue included in Corporate entities and other represents the portion of revenue generated from nationwide and regional contracts in markets outside our operating areas where the associated material handling is subcontracted to local operators. Consequently, substantially all of this revenue is offset with related subcontract costs, which are recorded in cost of operations. Revenue and \n39\nTable \nof\n Contents\noverhead costs of Corporate entities and other are either specifically assigned or allocated on a rational and consistent basis among our reportable segments to calculate Adjusted EBITDA. \nAdjusted EBITDA is the single financial measure our chief operating decision maker (CODM) uses to evaluate operating segment profitability and determine resource allocations. Cost of operations and selling, general and administrative are significant segment expenses used in the evaluation. Summarized financial information regarding our reportable segments for the three and nine months ended September 30, 2025 and 2024 (in millions of dollars) follows. For totals as well as further detail regarding our reportable segments and the adjustments used to calculate Adjusted EBITDA for each segment, see Note 12, \nSegment Reporting\n, of the notes to our unaudited consolidated financial statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q.\nGroup 1\nGroup 2\nRecycling & Waste Subtotal \n(1)\nGroup 3\n(Environmental Solutions)\nCorporate entities and other\nTotal\nThree Months Ended September 30, 2025\nGross revenue\n$\n2,191 \n$\n2,108 \n$\n4,299 \n$\n440 \n$\n88 \n$\n4,827 \nIntercompany revenue\n(320)\n(274)\n(594)\n(13)\n(8)\n(615)\nRevenue allocations\n39 \n35 \n74 \n6 \n(80)\n— \nNet revenue\n1,910 \n1,869 \n3,779 \n433 \n— \n4,212 \nCost of operations\n1,077 \n1,110 \n2,187 \n276 \n— \n2,463 \nSelling, general and administrative\n184 \n169 \n353 \n69 \n— \n422 \nOther segment items\n(11)\n(45)\n(56)\n— \n— \n(56)\nAdjusted EBITDA\n$\n660 \n$\n635 \n$\n1,295 \n$\n88 \n$\n— \n$\n1,383 \nCapital expenditures\n$\n171 \n$\n171 \n$\n342 \n$\n45 \n$\n57 \n$\n444 \nTotal assets\n$\n14,207 \n$\n11,495 \n$\n25,702 \n$\n5,140 \n$\n2,947 \n$\n33,789 \nThree Months Ended September 30, 2024\nGross revenue\n$\n2,071 \n$\n2,056 \n$\n4,127 \n$\n467 \n$\n86 \n$\n4,680 \nIntercompany revenue\n(304)\n(274)\n(578)\n(12)\n(14)\n(604)\nRevenue allocations\n31 \n31 \n62 \n10 \n(72)\n— \nNet revenue\n1,798 \n1,813 \n3,611 \n465 \n— \n4,076 \nCost of operations\n1,028 \n1,057 \n2,085 \n282 \n— \n2,367 \nSelling, general and administrative\n173 \n167 \n340 \n66 \n— \n406 \nAdjusted EBITDA\n$\n597 \n$\n589 \n$\n1,186 \n$\n117 \n$\n— \n$\n1,303 \nCapital expenditures\n$\n244 \n$\n161 \n$\n405 \n$\n33 \n$\n16 \n$\n454 \nTotal assets\n$\n13,515 \n$\n11,240 \n$\n24,755 \n$\n4,470 \n$\n2,589 \n$\n31,814 \n(1) The Recycling & Waste Subtotal represents the combined results of our Group 1 and Group 2 reportable segments.\n40\nTable \nof\n Contents\nGroup 1\nGroup 2\nRecycling & Waste Subtotal \n(1)\nGroup 3\n(Environmental Solutions)\nCorporate entities and other\nTotal\nNine Months Ended September 30, 2025\nGross revenue\n$\n6,439 \n$\n6,228 \n$\n12,667 \n$\n1,360 \n$\n273 \n$\n14,300 \nIntercompany revenue\n(953)\n(810)\n(1,763)\n(38)\n(43)\n(1,844)\nRevenue allocations\n107 \n101 \n208 \n22 \n(230)\n— \nNet revenue\n5,593 \n5,519 \n11,112 \n1,344 \n— \n12,456 \nCost of operations\n3,169 \n3,209 \n6,378 \n848 \n— \n7,226 \nSelling, general and administrative\n553 \n512 \n1,065 \n209 \n— \n1,274 \nOther Segment Items\n(11)\n(45)\n(56)\n— \n— \n(56)\nAdjusted EBITDA\n$\n1,882 \n$\n1,843 \n$\n3,725 \n$\n287 \n$\n— \n$\n4,012 \nCapital expenditures\n$\n554 \n$\n444 \n$\n998 \n$\n118 \n$\n194 \n$\n1,310 \nTotal assets\n$\n14,207 \n$\n11,495 \n$\n25,702 \n$\n5,140 \n$\n2,947 \n$\n33,789 \nNine Months Ended September 30, 2024\nGross revenue\n$\n6,083 \n$\n6,068 \n$\n12,151 \n$\n1,375 \n$\n258 \n$\n13,784 \nIntercompany revenue\n(907)\n(805)\n(1,712)\n(36)\n(50)\n(1,798)\nRevenue allocations\n94 \n92 \n186 \n22 \n(208)\n— \nNet revenue\n5,270 \n5,355 \n10,625 \n1,361 \n— \n11,986 \nCost of operations\n3,037 \n3,153 \n6,190 \n843 \n— \n7,033 \nSelling, general and administrative\n523 \n502 \n1,025 \n202 \n— \n1,227 \nAdjusted EBITDA\n$\n1,710 \n$\n1,700 \n$\n3,410 \n$\n316 \n$\n— \n$\n3,726 \nCapital expenditures\n$\n554 \n$\n426 \n$\n980 \n$\n92 \n$\n285 \n$\n1,357 \nTotal assets\n$\n13,515 \n$\n11,240 \n$\n24,755 \n$\n4,470 \n$\n2,589 \n$\n31,814 \n(1) The Recycling & Waste Subtotal represents the combined results of our Group 1 and Group 2 reportable segments.\nSignificant changes in the revenue and Adjusted EBITDA of our reportable segments comparing the three and nine months ended September 30, 2025 and 2024 are discussed below.\nGroup 1\nAdjusted EBITDA in Group 1 increased from $597 million and $1,710 million for the three and nine months ended September 30, 2024, respectively, to $660 million and $1,882 million for the three and nine months ended September 30, 2025, respectively.\nThe most significant items impacting adjusted EBITDA in Group 1 during the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024 include:\n•\nNet revenue for the three and nine months ended September 30, 2025 increased 6.2% and 6.1%, respectively, due to an increase in average yield in all lines of business and higher special waste volumes in our landfill line of business. The increase in special waste volumes was primarily driven by the Los Angeles area wildfire remediation. The increases were partially offset by decreased volume in our large-container and residential collection lines of business. The decrease in volume was also negatively impacted by lower solid waste and construction and demolition volumes in our landfill line of business. \n•\nCost of operations increased primarily due to an increase in labor costs, equipment maintenance and insurance premiums.\n41\nTable \nof\n Contents\nGroup 2\nAdjusted EBITDA in Group 2 increased from $589 million and $1,700 million for the three and nine months ended September 30, 2024, respectively, to $635 million and $1,843 million for the three and nine months ended September 30, 2025, respectively. \nThe most significant items impacting adjusted EBITDA in Group 2 during the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024 include:\n•\nNet revenue for the three and nine months ended September 30, 2025 increased 3.1% and 3.0%, respectively, due to an increase in average yield in all lines of business and increased volumes in our landfill line of business. The increase in volume in our landfill line of business was primarily due to increased construction and demolition volume related to the Hurricane Helene recovery efforts as well as increased special waste. These increases were partially offset by decreased volumes in our collection and transfer lines of business.\n•\nCost of operations increased primarily due to an increase in our insurance premiums.\nGroup 3\nAdjusted EBITDA in Group 3 decreased from $117 million for the three months ended September 30, 2024 to $88 million for the three months ended September 30, 2025. Adjusted EBITDA in Group 3 decreased from $316 million for the nine months ended September 30, 2024 to $287 million for the nine months ended September 30, 2025.\nThe most significant items impacting adjusted EBITDA in Group 3 during the three and nine months ended September 30, 2025 compared to the three and nine months ended September 30, 2024 include:\n•\nNet revenue for the three and nine months ended September 30, 2025 decreased primarily due to a decline in manufacturing and emergency response activity as well as a decrease in event-based volumes into our landfills, partially offset by acquisition related growth and price increases relative to the same respective periods in 2024.\n•\nCost of operations decreased for the three months ended September 30, 2025 primarily due to a decrease in subcontract costs partially offset by higher labor costs relative to the same respective period in 2024.\n•\nCost of operations increased for the nine months ended September 30, 2025 primarily due to an increase \nin labor costs partially offset by a decrease in subcontract costs relative to the same period in \n2024.\nLandfill and Environmental Matters\nAvailable Airspace\nAs of \nSeptember 30, 2025\n, we owned or operated 209 active landfills with total available disposal capacity estimated to be 5.1 billion in-place cubic yards. For these landfills, the following table reflects changes in capacity and remaining capacity, as measured in cubic yards of airspace:\nBalance as of December 31, 2024\nNew Expansions Undertaken\nLandfills Acquired, Net of Divestitures\nPermits Granted / \nNew Sites, \nNet of Closures\nAirspace\nConsumed\nChanges in Engineering Estimates\nBalance as of September 30, 2025\nCubic yards (in millions):\nPermitted airspace\n4,745 \n— \n72 \n146 \n(66)\n(2)\n4,895 \nProbable expansion airspace\n282 \n15 \n— \n(142)\n— \n— \n155 \nTotal cubic yards (in millions)\n5,027 \n15 \n72 \n4 \n(66)\n(2)\n5,050 \nNumber of sites:\nPermitted airspace\n208 \n— \n2 \n(1)\n209 \nProbable expansion airspace\n14 \n1 \n— \n(3)\n12 \nTotal available disposal capacity represents the sum of estimated permitted airspace plus an estimate of probable expansion airspace. Engineers develop these estimates at least annually using information provided by annual aerial surveys. Before airspace included in an expansion area is determined to be probable expansion airspace and, therefore, included in our calculation of total available disposal capacity, it must meet all of our expansion criteria.\nAs of \nSeptember 30, 2025\n, 12 of our landfills met all of our criteria for including their probable expansion airspace in our total available disposal capacity. At projected annual volumes, these 12 landfills have an estimated remaining average site life of 30 years, including probable expansion airspace. The average estimated remaining life of all of our landfills is 56 years. We have other expansion opportunities that are not included in our total available airspace because they do not meet all of our criteria for treatment as probable expansion airspace.\n42\nTable \nof\n Contents\nRemediation and Other Charges for Landfill Matters\nIt is reasonably possible that we will need to adjust our accrued landfill and environmental liabilities to reflect the effects of new or additional information, to the extent that such information impacts the costs, timing or duration of the required actions. Future changes in our estimates of the costs, timing or duration of the required actions could have a material adverse effect on our consolidated financial position, results of operations and cash flows.\nFor a description of our significant remediation matters, see Note 6, \nLandfill and Environmental Costs,\n of the notes to our unaudited consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q.\n \nProperty and Equipment\nThe following tables reflect the activity in our property and equipment accounts for the nine months ended September 30, 2025:\n \nGross Property and Equipment\n \nBalance as of December 31, 2024\nCapital\nAdditions\nRetirements\nAcquisitions,\nNet of\nDivestitures\nNon-cash\nAdditions\nfor Asset\nRetirement\nObligations\nAdjustments\nfor Asset\nRetirement\nObligations\nImpairments,\nTransfers, Foreign Currency Translation\nand Other\nAdjustments\nBalance as of September 30, 2025\nLand\n$\n897 \n$\n28 \n$\n(2)\n$\n35 \n$\n— \n$\n— \n$\n24 \n$\n982 \nLandfill development costs\n10,518 \n21 \n— \n37 \n57 \n4 \n306 \n10,943 \nVehicles and equipment\n10,998 \n491 \n(296)\n65 \n— \n— \n157 \n11,415 \nBuildings and improvements\n2,119 \n18 \n— \n47 \n— \n— \n191 \n2,375 \nConstruction-in-progress - landfill\n437 \n354 \n— \n— \n— \n— \n(309)\n482 \nConstruction-in-progress - other\n575 \n368 \n— \n6 \n— \n— \n(371)\n578 \nTotal\n$\n25,544 \n$\n1,280 \n$\n(298)\n$\n190 \n$\n57 \n$\n4 \n$\n(2)\n$\n26,775 \nAccumulated Depreciation, Depletion and Amortization \n \nBalance as of December 31, 2024\nAdditions\nCharged\nto\nExpense\nRetirements\nAcquisitions,\nNet of\nDivestitures\nAdjustments\nfor Asset\nRetirement\nObligations\nImpairments, Transfers, Foreign Currency Translation and Other Adjustments\nBalance as of September 30, 2025\nLandfill development costs\n$\n(6,031)\n$\n(413)\n$\n— \n$\n— \n$\n(5)\n$\n— \n$\n(6,449)\nVehicles and equipment\n(6,692)\n(709)\n288 \n2 \n— \n4 \n(7,107)\nBuildings and improvements\n(944)\n(84)\n— \n2 \n— \n(1)\n(1,027)\nTotal\n$\n(13,667)\n$\n(1,206)\n$\n288 \n$\n4 \n$\n(5)\n$\n3 \n$\n(14,583)\nLiquidity and Capital Resources\nCash and Cash Equivalents\nThe following is a summary of our cash and cash equivalents and restricted cash and marketable securities balances as of:\nSeptember 30, 2025\nDecember 31, 2024\nCash and cash equivalents\n$\n84 \n$\n74 \nRestricted cash and marketable securities\n225 \n208 \nLess: restricted marketable securities\n(84)\n(79)\nCash, cash equivalents, restricted cash and restricted cash equivalents\n$\n225 \n$\n203 \nOur restricted cash and marketable securities includes amounts pledged to regulatory agencies and governmental entities as financial guarantees of our performance under certain collection, landfill and transfer station contracts and permits, and relating to our final capping, closure and post-closure obligations at our landfills as well as restricted cash and marketable securities related to our insurance obligations.\n43\nTable \nof\n Contents\n The following table summarizes our restricted cash and marketable securities:\nSeptember 30, 2025\nDecember 31, 2024\nCapping, closure and post-closure obligations\n$\n66 \n$\n59 \nInsurance\n159 \n149 \nTotal restricted cash and marketable securities\n$\n225 \n$\n208 \nMaterial Cash Requirements and Intended Uses of Cash\nWe expect existing cash, cash equivalents, restricted cash and marketable securities, cash flows from operations and financing activities to continue to be sufficient to fund our operating activities and cash commitments for investing and financing activities for at least the next 12 months and thereafter for the foreseeable future. Our known current- and long-term uses of cash include, among other possible demands: (1) capital expenditures and leases; (2) acquisitions; (3) dividend payments; (4) payments to service debt and other long-term obligations; (5) payments for asset retirement obligations and environmental liabilities; and (6) share repurchases.\nWe may choose to voluntarily retire certain portions of our outstanding debt before their maturity dates using cash from operations or additional borrowings. We may also explore opportunities in the capital markets to fund redemptions should market conditions be favorable. Early extinguishment of debt will result in an impairment charge in the period in which the debt is repaid. The loss on early extinguishment of debt relates to premiums paid to effectuate the repurchase and the relative portion of unamortized note discounts and debt issue costs.\nAcquisitions\nOur acquisition growth strategy focuses primarily on acquiring privately held recycling and waste companies and environmental solutions businesses that complement our existing business platform. We continue to invest in value-enhancing acquisitions in existing markets. \nWe expect to invest at least $1.1 billion in acquisitions in 2025. \nSummary of Cash Flow Activity\nThe major components of changes in cash flows are discussed in the following paragraphs. The following table summarizes our cash flow from operating activities, investing activities and financing activities for the nine months ended September 30, 2025 and 2024:\n \nNine Months Ended September 30,\n \n2025\n2024\nCash Provided by Operating Activities\n$\n3,315 \n$\n2,914 \nCash Used in Investing Activities\n$\n(2,571)\n$\n(1,749)\nCash Used in Financing Activities\n$\n(723)\n$\n(1,188)\nCash Flows Provided by Operating Activities\nWe use cash flows from operations to fund our operating activities, capital expenditures and leases, acquisitions, dividend payments, share repurchases, interest payments and repayments of debt and other long-term obligations, and payments for asset retirement obligations and environmental liabilities.\nThe most significant items affecting the comparison of our cash flows provided by operating activities for the nine months ended September 30, 2025 and 2024 are summarized below.\nChanges in assets and liabilities, net of effects from business acquisitions and divestitures, decreased our cash flow from operations by $35 million during the nine months ended September 30, 2025, compared to a decrease of $243 million during the same period in 2024, primarily as a result of the following:\n•\nOur accounts receivable, exclusive of the change in allowance for doubtful accounts and customer credits, increased $78 million during the nine months ended September 30, 2025 due to the timing of billings net of collections, compared to a $100 million increase in the same period in 2024. As of September 30, 2025, our days sales outstanding were 41.0, or 30.2 days net of deferred revenue, compared to 41.2, or 30.4 days net of deferred revenue, as of September 30, 2024. \n•\nOur prepaid expenses and other assets increased $93 million during the nine months ended September 30, 2025, compared to a $59 million increase in the same period in 2024. The increase in prepaid expenses and other assets during the nine months ended September 30, 2025 is primarily driven by an increase in costs associated with cloud-\n44\nTable \nof\n Contents\nbased hosting arrangements and prepaid insurance premiums, partially offset by a decrease of income tax receivables due to the timing of our estimated tax payments.\n•\nOur accounts payable increased $23 million during the nine months ended September 30, 2025, compared to a $26 million decrease in the same period in 2024, due to the timing of payments.\n•\nCash paid for capping, closure and post-closure obligations was $38 million during the nine months ended September 30, 2025, compared to $35 million in the same period in 2024. \n•\nCash paid for remediation obligations was $14 million lower during the nine months ended September 30, 2025, compared to the same period in 2024.\n•\nOur other liabilities increased $182 million during the nine months ended September 30, 2025, compared to a $22 million increase in the same period in 2024, primarily due to the timing of payments for accrued payroll and an increase in insurance reserves.\nIn addition, cash paid for interest, excluding net swap settlements for our floating-to-fixed interest rate swaps, was $355 million and $345 million for the nine months ended September 30, 2025 and 2024, respectively. Cash paid for incomes taxes was $166 million and $183 million for the nine months ended September 30, 2025 and 2024, respectively.\nCash Flows Used in Investing Activities\nThe most significant items affecting the comparison of our cash flows used in investing activities for the nine months ended September 30, 2025 and 2024 are summarized below:\n•\nCapital expenditures during the nine months ended September 30, 2025 were $1,310 million, compared with $1,357 million for the same period in 2024. \n•\nDuring the nine months ended September 30, 2025 and 2024, we paid $1,259 million and $400 million, respectively, for acquisitions and investments. \nWe intend to finance future capital expenditures and acquisitions through cash on hand, restricted cash held for capital expenditures, cash flows from operations, our revolving credit facilities, and tax-exempt bonds and other financings. \nCash Flows Used in Financing Activities\nThe most significant items affecting the comparison of our cash flows used in financing activities for the nine months ended September 30, 2025 and 2024 are summarized below:\n•\nDuring the nine months ended September 30, 2025, we issued $1,200 million of senior notes for cash proceeds, net of discounts and fees, of $1,183 million. During the nine months ended September 30, 2024, we issued $900 million of senior notes for cash proceeds, net of discounts and fees, of $889 million. Net payments from notes payable and long-term debt were $743 million during the nine months ended September 30, 2025, compared to net payments of $1,219 million during the same period in 2024. For a more detailed discussion, see the \nFinancial Condition\n section of this Management's Discussion and Analysis of Financial Condition and Results of Operations.\n•\nDuring the nine months ended September 30, 2025, we repurchased 2.6 million shares of our common stock for $599 million, which included the cash paid for excise tax on share repurchases, compared to repurchases of 1.7 million shares for $321 million during the same period in 2024.\n•\nDividends paid were $544 million and $505 million during the nine months ended September 30, 2025 and 2024, respectively.\nFinancial Condition\nDebt Obligations\nAs of \nSeptember 30, 2025\n, we had $921 million of principal debt maturing within the next 12 months, which includes certain finance lease obligations. All of our tax-exempt financings are remarketed either quarterly or semiannually by remarketing agents to effectively maintain a variable yield, with the exception of three tax-exempt financings each with initial remarketing periods of 10 years. The holders of the bonds can put them back to the remarketing agents at the end of each interest period. If the remarketing agents are unable to remarket our bonds, the remarketing agents can put the bonds to us. In the event of a failed remarketing, as of \nSeptember 30, 2025\n, we had availability under our Credit Facility to fund the repurchase of these bonds until they are remarketed successfully. In the event of a failed re-borrowing under our commercial paper program, as of \nSeptember 30, 2025\n, we had availability under our Credit Facility to fund the commercial paper program until it is re-borrowed successfully. Accordingly, we have classified these tax-exempt financings and commercial paper program borrowings as long-term in our unaudited consolidated balance sheet as of \nSeptember 30, 2025\n.\n45\nTable \nof\n Contents\nFor further discussion of the components of our overall debt, see Note 7, \nDebt,\n of the notes to our unaudited consolidated financial statements in Part I, Item 1 of this Quarterly Report on Form 10-Q.\nCredit Facilities\nUncommitted Credit Facility\nIn January 2022, we entered into a $200 million unsecured uncommitted revolving credit facility (the Uncommitted Credit Facility). The Uncommitted Credit Facility bears interest at an annual percentage rate to be agreed upon by both parties. Borrowings under the Uncommitted Credit Facility can be used for working capital, letters of credit, and other general corporate purposes. The agreement governing our Uncommitted Credit Facility requires us to comply with certain covenants. The Uncommitted Credit Facility may be terminated by either party at any time. As of September 30, 2025, we had $68 million of borrowings outstanding under our Uncommitted Credit Facility. As of December 31, 2024, we had no borrowings outstanding under our Uncommitted Credit Facility.\nThe Credit Facility\nIn July 2024, we and our subsidiary, USE Canada Holdings, Inc. (the Canadian Borrower) entered into the Second Amended and Restated Credit Agreement (the Credit Facility) which amended and restated the unsecured revolving credit facility we entered into in August 2021. The total outstanding principal amount that we may borrow under the Credit Facility may not exceed the current aggregate lenders' commitments of $3.5 billion, and borrowings under the Credit Facility mature in July 2029. We have the right to request two one-year extensions of the maturity date, but none of the lenders are committed to participate in such extensions. The Credit Facility also includes a feature that allows us to increase availability, at our option, by an aggregate amount of up to $1 billion through increased commitments from existing lenders or the addition of new lenders.\nAll loans to the Canadian Borrower and all loans denominated in Canadian dollars cannot exceed $1 billion (the Canadian Sublimit). The Canadian Sublimit is part of, and not in addition to, the aggregate commitments under the Credit Facility.\nBorrowings under the Credit Facility in United States dollars bear interest at a Base Rate, a daily floating SOFR or a term SOFR, plus a current applicable margin of 0.805% based on our Debt Ratings (all as defined in the Credit Facility agreement). Canadian dollar-denominated loans bear interest based on the Canadian Prime Rate or the Canadian Dollar Offered Rate, plus a current applicable margin of 0.805% based on our Debt Ratings. As of September 30, 2025 and December 31, 2024, C$204 million and C$232 million, respectively, were outstanding against the Canadian Sublimit. \nThe Credit Facility is subject to facility fees based on applicable rates defined in the Credit Facility agreement and the aggregate commitment, regardless of usage. The Credit Facility can be used for working capital, capital expenditures, acquisitions, letters of credit and other general corporate purposes. The Credit Facility agreement requires us to comply with financial and other covenants. We may pay dividends and repurchase common stock if we are in compliance with these covenants. \nWe had $147 million and $514 million of borrowings outstanding under the Credit Facility as of September 30, 2025 and December 31, 2024, respectively. We had $320 million and $317 million of letters of credit outstanding under our Credit Facility as of September 30, 2025 and December 31, 2024, respectively. We also had $598 million and $477 million of principal borrowings outstanding (net of related discount on issuance) under our commercial paper program as of September 30, 2025 and December 31, 2024, respectively. As a result, availability under our Credit Facility was $2.4 billion and $2.2 billion as of September 30, 2025 and December 31, 2024, respectively. \nFinancial and Other Covenants\nThe Credit Facility requires us to comply with financial and other covenants. To the extent we are not in compliance with these covenants, we cannot pay dividends or repurchase common stock. Compliance with covenants also is a condition for any incremental borrowings under the Credit Facility, and failure to meet these covenants would enable the lenders to require repayment of any outstanding loans (which would adversely affect our liquidity). Additionally, if we are not in compliance with these covenants, we could not use the availability under our Credit Facility to fund borrowings we currently make under our commercial paper program, if there is a failed reborrowing under that program. The Credit Facility provides that our total debt to EBITDA ratio may not exceed 3.75 to 1.00 as of the last day of any fiscal quarter. In the case of an \"elevated ratio period\", which may be elected by us if one or more acquisitions during a fiscal quarter involve aggregate consideration in excess of $200.0 million (the Trigger Quarter), the total debt to EBITDA ratio may not exceed 4.25 to 1.00 during the Trigger Quarter and for the three fiscal quarters thereafter. The Credit Facility also provides that there may not be more than two elevated ratio periods during the term of the Credit Facility agreement. As of September 30, 2025, our total debt to EBITDA ratio was approximately 2.5 compared to the 3.75 maximum allowed. As of September 30, 2025, we were in compliance with all other covenants unde\nr our Credit Facility\n.\nEBITDA, which is a non-U.S. GAAP measure, is calculated as defined in our Credit Facility agreement. In this context, EBITDA is used solely to provide information regarding the extent to which we are in compliance with debt covenants and is not comparable to EBITDA used by other companies or used by us for other purposes.\n46\nTable \nof\n Contents\nFailure to comply with the financial and other covenants under the Credit Facility, as well as the occurrence of certain material adverse events, would constitute defaults and would allow the lenders under the Credit Facility to accelerate the maturity of all indebtedness under the Credit Facility. This could have an adverse effect on the availability of financial assurances. In addition, maturity acceleration on the Credit Facility constitutes an event of default under certain of our other debt and derivative instruments. If such acceleration were to occur, we would not have sufficient liquidity available to repay the indebtedness. We would likely have to seek an amendment under the Credit Facility for relief from the financial covenant or repay the debt with proceeds from the issuance of new debt or equity, or asset sales, if necessary. We may be unable to amend the Credit Facility or raise sufficient capital to repay such obligations in the event the maturity is accelerated.\nCommercial Paper Program\nIn May 2022, we entered into a commercial paper program for the issuance and sale of unsecured commercial paper in an aggregate principal amount not to exceed $500 million outstanding at any one time (the Commercial Paper Cap). In August 2022, the Commercial Paper Cap was increased to $1.0 billion, and in October 2023, was increased to $1.5 billion. The weighted average interest rate for borrowings outstanding as of September 30, 2025 is 4.249% with a weighted average maturity of approximately 8 days. The weighted average interest rate for borrowings outstanding as of December 31, 2024 is 4.646% with a weighted average maturity of approximately 18 days.\nWe had $598 million and $477 million principal value of commercial paper issued and outstanding under the program as of September 30, 2025 and December 31, 2024, respectively. In the event of a failed re-borrowing, we currently have availability under our Credit Facility to fund amounts currently borrowed under the commercial paper program until they are re-borrowed successfully. Accordingly, we have classified these borrowings as long-term in our consolidated balance sheet as of September 30, 2025 and December 31, 2024, respectively.\nSenior Notes and Debentures\nIn June 2024, we issued $400 million of 5.000% senior notes due 2029 and $500 million of 5.200% senior notes due 2034. We used the proceeds from the June 2024 notes issuance for general corporate purposes, including the repayment of a portion of amounts outstanding under the Commercial Paper Program and the Credit Facility; and repayment of the remaining amount outstanding under the Uncommitted Credit Facility and certain debt obligations.\nIn March 2025, we issued $500 million of 4.750% senior notes due 2030 and $700 million of 5.150% senior notes due 2035. We used the proceeds from the March 2025 notes issuance for general corporate purposes, including the repayment of a portion of amounts outstanding on our Credit Facility and a portion of outstanding borrowings under the Commercial Paper Program.\nOur senior notes and debentures are general unsecured and unsubordinated obligations and rank equally with our other unsecured obligations.\nTax-Exempt Financings\nAs of both September 30, 2025 and December 31, 2024, we had $1.4 billion of tax-exempt financings outstanding, with maturities ranging from 2026 to 2054 for both periods. \nFinance Leases and Other\nAs of September 30, 2025 and December 31, 2024, we had finance leases and other liabilities of $400 million and $315 million, respectively, with maturities ranging from 2025 to 2063 for both periods.\nIn our unaudited consolidated balance sheet as of September 30, 2025, finance leases and other included $120 million related to the construction of an office building located in Phoenix, Arizona, which has been accounted for as a financing obligation. The amount is recorded within long-term debt, net of current maturities.\nCredit Ratings\nOur continued access to the debt capital markets and to new financing facilities, as well as our borrowing costs, depend on multiple factors, including market conditions, our operating performance and maintaining strong credit ratings. As of September 30, 2025, our credit ratings were A-, A3 and A- by Standard & Poor’s Ratings Services, Moody’s Investors Service and Fitch Ratings, Inc, respectively. If our credit ratings were downgraded, especially any downgrade to below investment grade, our ability to access the debt markets with the same flexibility that we have experienced historically, our cost of funds and other terms for new debt issuances, could be adversely impacted.\nOff-Balance Sheet Arrangements\nWe have no off-balance sheet debt or similar obligations, other than short-term operating leases and financial assurances, which are not classified as debt. We have no transactions or obligations with related parties that are not disclosed, consolidated into or reflected in our reported financial position or results of operations. We have not guaranteed any third-party debt.\n47\nTable \nof\n Contents\nSeasonality and Severe Weather\nOur operations can be adversely affected by periods of inclement or severe weather, which could increase the volume of waste collected under our existing contracts (without corresponding compensation), delay the collection and disposal of waste, reduce the volume of waste delivered to our disposal sites, or delay the construction or expansion of our landfills and other facilities. Our operations also can be favorably affected by severe weather, which could increase the volume of waste in situations where we are able to charge for our additional services. \nContingencies\nFor a description of our commitments and contingencies, see Note 6, \nLandfill and Environmental Costs\n, Note 8, \nIncome Taxes,\n and Note 14, \nCommitments and Contingencies\n, to our unaudited consolidated financial statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q.\nCritical Accounting Judgments and Estimates\nWe identified and discussed our critical accounting judgments and estimates in our Annual Report on Form 10-K for the fiscal year ended December 31, 2024. Although we believe our estimates and judgments are reasonable, they are based upon information available at the time the judgment or estimate is made. Actual results may differ significantly from estimates under different assumptions or conditions.\nNew Accounting Pronouncements\nFor a description of new accounting standards that may affect us, see Note 1, \nBasis of Presentation\n, to our unaudited consolidated financial statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q."
}