{
  "source_file": "sbux-20250629.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nCAUTIONARY STATEMENT PURSUANT TO THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995\nCertain statements contained herein are “forward-looking” statements within the meaning of applicable securities laws and regulations. Generally, these statements can be identified by the use of words such as “aim,” “anticipate,” “believe,” “continue,” “could,” “estimate,” “expect,” “feel,” “forecast,” “intend,” “may,” “outlook,” “plan,” “potential,” “predict,” “project,” “seek,” “should,” “will,” “would,” and similar expressions intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. By their nature, forward-looking statements involve risks, uncertainties, and other factors (many beyond our control) that could cause our actual results to differ materially from our historical experience or from our current expectations or projections. Our forward-looking statements, and the risks and uncertainties related thereto, include, but are not limited to, those described under the “Risk Factors” and “Management\n’\ns Discussion and Analysis of Financial Condition and Results of Operations” sections of our most recently filed 10-K and 10-Q and in other reports we file with the SEC, as well as, among others:\n• our ability to preserve, grow, and leverage our brands, including the risk of negative responses by consumers (such as boycotts or negative publicity campaigns), governmental actors (such as retaliatory or threatened legislative treatment or other actions), or other third parties who object to certain actions taken or not taken by the Company, whose responses could adversely affect our brand value;\n• the impact of our marketing strategies, promotional and advertising plans, pricing strategies, platforms, reformulations, innovations, or customer experience initiatives or investments;\n• the costs and risks associated with, and the successful and timely execution and effects of, our existing and any future business opportunities, expansions, initiatives, strategies, investments, and plans, including our \n“\nBack to Starbucks\n”\n plan;\n• the costs and risks associated with, and the successful execution and effects of, strategic changes to our ownership and operating structure, including as a result of acquisitions, divestitures, or entry into joint ventures;\n• our ability to align our investment efforts with our strategic goals;\n• changes in consumer preferences, demand, consumption, or spending behavior, including due to shifts in demographic or health and wellness trends, reduction in discretionary spending and price increases, and our ability to anticipate or react to these changes;\n• the ability of our business partners, suppliers, and third-party providers to fulfill their responsibilities and commitments;\n• the potential negative effects of reported incidents involving food- or beverage-borne illnesses, tampering, adulteration, contamination, or mislabeling;\n• our ability to open new stores and efficiently maintain the attractiveness of our existing stores;\n• our dependence on the financial performance of our North America operating segment, and our increasing dependence on certain international markets;\n• our anticipated cash requirements and operating expenses, including our anticipated total capital expenditures;\n• inherent risks of operating a global business, including changing conditions in our markets, local factors affecting store openings, protectionist trade or foreign investment policies, such as imposed or threatened to be imposed tariffs and other trade controls, economic or trade sanctions, compliance with local laws and other regulations, and local labor policies and conditions, including labor strikes and work stoppages;\n• higher costs, lower quality, or unavailability of coffee, dairy, cocoa, energy, water, raw materials, or product ingredients;\n• the potential impact on our supply chain and operations of adverse weather conditions, natural disasters, or significant increases in logistics costs;\n• the ability of our supply chain to meet current or future business needs and our ability to scale and improve our forecasting, planning, production, and logistics management;\n• a worsening in the terms and conditions upon which we engage with our manufacturers and source suppliers, whether resulting from broader local or global conditions or dynamics specific to our relationships with such parties;\n• the impact of unfavorable global or regional economic conditions and related economic slowdowns or recessions, low consumer confidence, high unemployment, weak credit or capital markets, budget deficits, burdensome government debt, austerity measures, higher interest rates, higher taxes, international trade disputes, government restrictions, geopolitical instability, higher inflation, or deflation;\n• failure to meet our announced guidance or market expectations and the impact thereof;\n• failure to attract or retain key executive or partner talent or successfully onboard or transition executives;\n• the impacts of partner investments, business transformation initiatives, including those related to our workforce, and changes in the availability and cost of labor, including any union organizing efforts and our responses to such efforts;\n• the impact of foreign currency translation, particularly a stronger U.S. dollar;\n• the impact of, and our ability to respond to, substantial competition from new entrants, consolidations by competitors, and other competitive activities, such as pricing actions (including price reductions, promotions, discounting, couponing, or free goods), marketing, category expansion, product introductions, or entry or expansion in our geographic markets;\n• potential impacts of climate change;\n• evolving corporate governance and public disclosure regulations and expectations;\n• the potential impact of activist shareholder actions or tactics;\n27\nTable of \nContents\n• failure to comply with applicable laws and changing legal and regulatory requirements;\n• the impact or likelihood of significant legal disputes and proceedings or government investigations;\n• potential negative effects of, and our ability to respond to, a material failure, inadequacy, or interruption of our information technology systems or those of our third-party business partners or service providers, or failure to comply with data protection laws; and\n• our ability to adequately protect our intellectual property or adequately ensure that we are not infringing the intellectual property of others.\nIn addition, many of the foregoing risks and uncertainties are, or could be, exacerbated by any worsening of the global business and economic environment. A forward-looking statement is neither a prediction nor a guarantee of future events or circumstances, and those future events or circumstances may not occur. You should not place undue reliance on the forward-looking statements, which speak only as of the date of this report. We are under no obligation to update or alter any forward-looking statements, whether as a result of new information, future events, or otherwise.\nThis information should be read in conjunction with the unaudited consolidated financial statements and the notes included in Item 1 of Part I of this 10-Q and the audited consolidated financial statements and notes, and Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”), contained in the 10-K.\n28\nTable of \nContents\nIntroduction and Overview\nStarbucks is the premier roaster, marketer, and retailer of specialty coffee globally, with a presence in 88 markets worldwide. As of June 29, 2025, Starbucks had more than 41,000 company-operated and licensed stores, an increase of 4% from the prior year. Additionally, we sell a variety of consumer-packaged goods, primarily through the Global Coffee Alliance established with Nestlé and other partnerships and joint ventures.\nWe have three reportable operating segments: 1) North America, which is inclusive of the U.S. and Canada; 2) International, which is inclusive of China, Japan, Asia Pacific, Europe, Middle East, Africa, Latin America, and the Caribbean; and 3) Channel Development. Unallocated corporate expenses are reported within Corporate and Other.\nWe believe our financial results and long-term growth model will continue to be driven by new store openings, comparable store sales, and operating margin management, underpinned by disciplined capital allocation. We believe these key operating metrics are useful to investors because management uses these metrics to assess the growth of our business and the effectiveness of our marketing and operational strategies. Throughout this MD&A, we commonly discuss the following key operating metrics:\n•\nNew store openings and store count\n•\nComparable store sales\n•\nOperating margin\nComparable store sales represents the percentage change in sales in one period from the same prior year period for company-operated stores open for 13 months or longer and excludes the impact of foreign currency translation. We analyze comparable store sales on a constant currency basis as this helps identify underlying business trends, without distortion from the effects of currency movements. Stores that are temporarily closed or operating at reduced hours remain in comparable store sales while stores identified for permanent closure have been removed.\nOur fiscal year ends on the Sunday closest to September 30. Fiscal 2025 and 2024 include 52 weeks. All references to store counts, including data for new store openings, are reported net of store closures, unless otherwise noted. \nStarbucks results for the third quarter of fiscal 2025 showed continued progress on key “Back to Starbucks” initiatives, specifically investments in coffeehouse partners, including the Leadership Experience 2025, a conference designed to empower and motivate our retail leaders to accelerate our “Back to Starbucks” strategy, as we work to rebuild a stronger Starbucks. During the third quarter of fiscal 2025, consolidated net revenues increased 4% to $9.5 billion compared to $9.1 billion in the third quarter of fiscal 2024, primarily driven by incremental revenues from net new company-operated store openings over the past 12 months, partially offset by a decrease in global comparable store sales. During the quarter ended June 29, 2025, our global comparable store sales declined 2%, primarily driven by a 2% decline in the U.S. market. Specific to the U.S. market, the decrease in comparable store sales was driven by a 4% decrease in comparable transactions, partially offset by a 2% increase in average ticket, primarily due to fewer discounts in the current year. Consolidated operating margin contracted 680 basis points from the prior year to 9.9%, primarily driven by deleverage, investments in support of “Back to Starbucks,” including additional labor and the Leadership Experience 2025, and inflation, primarily driven by elevated coffee pricing.\nFor the balance of this fiscal year, we expect that the macroeconomic challenges we have been experiencing, including impacts from new tariffs and volatile coffee prices, will continue; however we are encouraged by the results we have seen from our “Back to Starbucks” initiatives and early results from our pilots. For example, as a result of compelling early insights, we have decided to accelerate the rollout of the Green Apron Service model, a new foundational operating model that establishes repeatable, consistent, and scalable standards, across U.S. company-operated stores in the next few months. We will continue to prioritize disciplined capital investments in our stores, and we are conducting a comprehensive evaluation of our store portfolio, which we expect will be complete by the end of the fiscal year and result in additional material restructuring charges. Additionally, we will continue our efforts to identify a strategic partner with a similar vision and values to help us capture future growth opportunities in China. Our focus will continue to be on the long-term, sustainable growth of the company. We believe the actions we are taking now and in the future, specifically through our investments in store partners, uplifting the coffeehouse experience, introducing new food and beverage platforms, and reimagining the Starbucks rewards program, paired with disciplined prioritization, while driving more efficiency, accountability, and agility as a company, will lay the foundation for the future of Starbucks.\n29\nTable of \nContents\nResults of Operations\n (in millions)\nRevenues\n \nQuarter Ended\nThree Quarters Ended\nJun 29,\n2025\nJun 30,\n2024\n$\nChange\n%\nChange\nJun 29,\n2025\nJun 30,\n2024\n$\nChange\n%\nChange\nCompany-operated stores\n$\n7,812.5 \n$\n7,516.0 \n$\n296.5 \n3.9 \n%\n$\n22,882.9 \n$\n22,323.8 \n$\n559.1 \n2.5 \n%\nLicensed stores\n1,105.6 \n1,129.0 \n(23.4)\n(2.1)\n3,257.3 \n3,375.7 \n(118.4)\n(3.5)\nOther\n537.9 \n468.9 \n69.0 \n14.7 \n1,475.2 \n1,402.8 \n72.4 \n5.2 \nTotal net revenues\n$\n9,456.0\n \n$\n9,113.9\n \n$\n342.1\n \n3.8\n \n%\n$\n27,615.4\n \n$\n27,102.3\n \n$\n513.1\n \n1.9\n \n%\nFor the quarter ended June 29, 2025 compared with the quarter ended June 30, 2024 \nTotal net revenues for the third quarter of fiscal 2025 increased $342 million, primarily due to higher revenues from company-operated stores ($297 million) and other revenues ($69 million), partially offset by a decrease in revenues from licensed stores ($23 million). \nCompany-operated store revenue increased $297 million, primarily driven by incremental revenues from 1,151 net new company-operated stores, or a 6% increase, over the past 12 months ($330 million). Also contributing to the overall increase in company-operated store revenue were favorable foreign currency translation impacts ($45 million) and incremental revenue from the conversion of 113 licensed stores to company-operated stores ($36 million) following the acquisition of 23.5 Degrees Topco Limited, a U.K. licensed business partner, during the first quarter of fiscal 2025. These increases in net revenue were partially offset by a 2% decrease in comparable store sales ($122 million), attributable to a 2% decrease in comparable transactions, partially offset by a 1% increase in average ticket.\nLicensed stores revenue decreased $23 million, primarily driven by lower product and equipment sales to, and royalty revenues from, our licensees in our North America segment ($37 million) and the impact of the acquisition of 23.5 Degrees Topco Limited ($9 million). These decreases in licensed stores revenue were partially offset by an increase in product and equipment sales to, and royalty revenues from, our licensees in our International segment ($28 million).\nOther revenues increased $69 million, primarily due to an increase in revenue in the Global Coffee Alliance ($45 million) and increased sales of cocoa butter to third parties ($20 million).\nFor the three quarters ended June 29, 2025 compared with the three quarters ended June 30, 2024 \nTotal net revenues for the first three quarters of fiscal 2025 increased $513 million, primarily due to higher revenues from company-operated stores ($559 million) and other revenues ($72 million), partially offset by a decrease in revenues from licensed stores ($118 million). \nCompany-operated store revenue increased $559 million, primarily driven by incremental revenues from 1,151 net new company-operated stores, or a 6% increase, over the past 12 months ($927 million) and incremental revenue from the conversion of 113 licensed stores to company-operated stores ($93 million) following the acquisition of 23.5 Degrees Topco Limited. These increases in net revenue were partially offset by a 2% decrease in comparable store sales ($453 million), attributable to a 4% decrease in comparable transactions, partially offset by a 2% increase in average ticket.\nLicensed stores revenue decreased $118 million, primarily driven by lower product and equipment sales to, and royalty revenues from, our licensees in our North America segment ($112 million), the impact of the acquisition of 23.5 Degrees Topco Limited ($26 million), and by unfavorable foreign currency translation impacts ($22 million). These decreases were partially offset by an increase in product and equipment sales to, and royalty revenues from, our licensees in our International segment ($49 million).\nOther revenues increased $72 million, primarily due to increased sales of cocoa butter to third parties ($34 million) and an increase in revenue in the Global Coffee Alliance ($27 million).\n30\nTable of \nContents\nOperating Expenses\n \nQuarter Ended\nThree Quarters Ended\nJun 29,\n2025\nJun 30,\n2024\n$\nChange\nJun 29,\n2025\nJun 30,\n2024\nJun 29,\n2025\nJun 30,\n2024\n$\nChange\nJun 29,\n2025\nJun 30,\n2024\nAs a % of\nTotal Net Revenues\nAs a % of\nTotal Net Revenues\nProduct and distribution costs\n$\n2,955.5 \n$\n2,740.9 \n$\n214.6 \n31.3 \n%\n30.1 \n%\n$\n8,586.8 \n$\n8,370.2 \n$\n216.6 \n31.1 \n%\n30.9 \n%\nStore operating expenses\n4,344.8 \n3,829.1 \n515.7 \n45.9 \n42.0 \n12,723.9 \n11,404.7 \n1,319.2 \n46.1 \n42.1 \nOther operating expenses\n151.6 \n143.9 \n7.7 \n1.6 \n1.6 \n442.8 \n427.1 \n15.7 \n1.6 \n1.6 \nDepreciation and amortization expenses\n427.6 \n380.4 \n47.2 \n4.5 \n4.2 \n1,254.0 \n1,117.6 \n136.4 \n4.5 \n4.1 \nGeneral and administrative expenses\n677.2 \n576.0 \n101.2 \n7.2 \n6.3 \n1,975.2 \n1,878.6 \n96.6 \n7.2 \n6.9 \nRestructuring\n20.8 \n— \n20.8 \n0.2 \n— \n137.0 \n— \n137.0 \n0.5 \n— \nTotal operating expenses\n8,577.5 \n7,670.3 \n907.2 \n90.7 \n84.2 \n25,119.7 \n23,198.2 \n1,921.5 \n91.0 \n85.6 \nIncome from equity investees\n57.1 \n73.9 \n(16.8)\n0.6 \n0.8 \n162.7 \n197.8 \n(35.1)\n0.6 \n0.7 \nOperating income\n$\n935.6\n \n$\n1,517.5\n \n$\n(581.9)\n9.9\n \n%\n16.7\n \n%\n$\n2,658.4\n \n$\n4,101.9\n \n$\n(1,443.5)\n9.6\n \n%\n15.1\n \n%\nStore operating expenses as a % of company-operated stores revenue\n55.6 \n%\n50.9 \n%\n55.6 \n%\n51.1 \n%\nFor the quarter ended June 29, 2025 compared with the quarter ended June 30, 2024 \nProduct and distribution costs as a percentage of total net revenues increased 120 basis points for the third quarter of fiscal 2025, largely due to inflation (approximately 100 basis points), primarily driven by elevated coffee pricing.\nStore operating expenses as a percentage of total net revenues increased 390 basis points for the third quarter of fiscal 2025. Store operating expenses as a percentage of company-operated stores revenue increased 470 basis points, primarily due to additional labor (approximately 160 basis points), deleverage (approximately 150 basis points), and increased marketing (approximately 90 basis points).\nOther operating expenses increased $8 million, primarily due to support costs for our licensed markets.\nDepreciation and amortization expenses as a percentage of total net revenues increased 30 basis points, primarily due to deleverage.\nGeneral and administrative expenses increased $101 million, primarily due to the Leadership Experience 2025 ($81 million).\nRestructuring was $21 million, largely due to costs associated with simplifying our support organization, primarily severance costs, in support of our “Back to Starbucks” strategy.\nIncome from equity investees decreased $17 million, primarily due to lower income from our North American Coffee Partnership joint venture.\nThe combination of these changes resulted in an overall decrease in operating margin of 680 basis points for the third quarter of fiscal 2025.\nFor the three quarters ended June 29, 2025 compared with the three quarters ended June 30, 2024 \nProduct and distribution costs as a percentage of total net revenues increased 20 basis points for the first three quarters of fiscal 2025, primarily due to inflation (approximately 70 basis points), partially offset by supply chain efficiencies (approximately 50 basis points).\nStore operating expenses as a percentage of total net revenues increased 400 basis points for the first three quarters of fiscal 2025. Store operating expenses as a percentage of company-operated stores revenue increased 450 basis points, primarily due to deleverage (approximately 200 basis points), additional labor (approximately 160 basis points), and increased marketing (approximately 90 basis points).\n31\nTable of \nContents\nOther operating expenses increased $16 million, primarily due to support costs for our licensed markets.\nDepreciation and amortization expenses as a percentage of total net revenues increased 40 basis points, primarily due to deleverage.\nGeneral and administrative expenses increased $97 million, primarily due to the Leadership Experience 2025 ($81 million).\nRestructuring was $137 million, largely due to costs associated with simplifying our support organization, primarily severance costs, in support of our “Back to Starbucks” strategy.\nIncome from equity investees decreased $35 million, primarily due to lower income from our North American Coffee Partnership joint venture.\nThe combination of these changes resulted in an overall decrease in operating margin of 550 basis points for the first three quarters of fiscal 2025.\nOther Income and Expenses\n \n \n \nQuarter Ended\nThree Quarters Ended\nJun 29,\n2025\nJun 30,\n2024\n$ \nChange\nJun 29,\n2025\nJun 30,\n2024\nJun 29,\n2025\nJun 30,\n2024\n$ \nChange\nJun 29,\n2025\nJun 30,\n2024\nAs a % of Total\nNet Revenues\nAs a % of Total\nNet Revenues\nOperating income\n$\n935.6 \n$\n1,517.5 \n$\n(581.9)\n9.9 \n%\n16.7 \n%\n$\n2,658.4 \n$\n4,101.9 \n$\n(1,443.5)\n9.6 \n%\n15.1 \n%\nInterest income and other, net\n25.6 \n28.1 \n(2.5)\n0.3 \n0.3 \n81.8 \n96.0 \n(14.2)\n0.3 \n0.4 \nInterest expense\n(142.3)\n(141.3)\n(1.0)\n(1.5)\n(1.6)\n(396.8)\n(422.0)\n25.2 \n(1.4)\n(1.6)\nEarnings before income taxes\n818.9 \n1,404.3 \n(585.4)\n8.7 \n15.4 \n2,343.4 \n3,775.9 \n(1,432.5)\n8.5 \n13.9 \nIncome tax expense\n260.4 \n348.6 \n(88.2)\n2.8 \n3.8 \n619.9 \n923.2 \n(303.3)\n2.2 \n3.4 \nNet earnings including noncontrolling interests\n558.5 \n1,055.7 \n(497.2)\n5.9 \n11.6 \n1,723.5 \n2,852.7 \n(1,129.2)\n6.2 \n10.5 \nNet earnings/(loss) attributable to noncontrolling interests\n0.2 \n0.9 \n(0.7)\n0.0 \n0.0 \n0.3 \n1.0 \n(0.7)\n0.0 \n0.0 \nNet earnings attributable to Starbucks\n$\n558.3\n \n$\n1,054.8\n \n$\n(496.5)\n5.9\n \n%\n11.6\n \n%\n$\n1,723.2\n \n$\n2,851.7\n \n$\n(1,128.5)\n6.2\n \n%\n10.5\n \n%\nEffective tax rate including noncontrolling interests\n31.8 \n%\n24.8 \n%\n26.5 \n%\n24.4 \n%\nFor the quarter ended June 29, 2025 compared with the quarter ended June 30, 2024 \nThe effective tax rate for the quarter ended June 29, 2025 was 31.8% compared to 24.8% for the same period in fiscal 2024. The increase was primarily due to the discrete impact of changes in indefinite reinvestment assertions for certain foreign entities in the third quarter of fiscal 2025 (approximately 850 basis points).\nFor the three quarters ended June 29, 2025 compared with the three quarters ended June 30, 2024 \n32\nTable of \nContents\nInterest income and other, net, decreased $14 million, primarily due to lower cash balances and lower interest rates in the current year. \nInterest expense decreased $25 million, primarily due to savings from cross-currency interest rate hedging, partially offset by higher interest rates on refinanced long-term debt.\nThe effective tax rate for the first three quarters ended June 29, 2025 was 26.5% compared to 24.4% for the same period in fiscal 2024. The increase was primarily due to the discrete impact of changes in indefinite reinvestment assertions for certain foreign entities in the third quarter of fiscal 2025 (approximately 300 basis points), partially offset by the discrete impact of a tax status change for a certain foreign entity (approximately 130 basis points).\n33\nTable of \nContents\nSegment Information\nResults of operations by segment \n(in millions)\n:\nNorth America\n \n \nQuarter Ended\nThree Quarters Ended\nJun 29,\n2025\nJun 30,\n2024\n$\nChange\nJun 29,\n2025\nJun 30,\n2024\nJun 29,\n2025\nJun 30,\n2024\n$ \nChange\nJun 29,\n2025\nJun 30,\n2024\nAs a % of North America\nTotal Net Revenues\nAs a % of North America\nTotal Net Revenues\nNet revenues:\nCompany-operated stores\n$\n6,285.7 \n$\n6,135.0 \n$\n150.7 \n90.7 \n%\n90.0 \n%\n$\n18,515.3 \n$\n18,240.7 \n$\n274.6 \n90.4 \n%\n89.8 \n%\nLicensed stores\n640.5 \n681.3 \n(40.8)\n9.2 \n10.0 \n1,953.5 \n2,074.1 \n(120.6)\n9.5 \n10.2 \nOther\n0.8 \n0.4 \n0.4 \n0.0 \n0.0 \n2.9 \n2.8 \n0.1 \n0.0 \n0.0 \nTotal net revenues\n6,927.0\n \n6,816.7\n \n110.3\n \n100.0\n \n100.0\n \n20,471.7\n \n20,317.6\n \n154.1\n \n100.0\n \n100.0\n \nProduct and distribution costs\n1,909.6 \n1,831.9 \n77.7 \n27.6 \n26.9 \n5,684.3 \n5,623.5 \n60.8 \n27.8 \n27.7 \nStore operating expenses\n3,552.4 \n3,131.1 \n421.3 \n51.3 \n45.9 \n10,442.5 \n9,316.2 \n1,126.3 \n51.0 \n45.9 \nOther operating expenses\n69.7 \n69.5 \n0.2 \n1.0 \n1.0 \n216.6 \n214.0 \n2.6 \n1.1 \n1.1 \nDepreciation and amortization expenses\n303.5 \n266.6 \n36.9 \n4.4 \n3.9 \n891.6 \n774.2 \n117.4 \n4.4 \n3.8 \nGeneral and administrative expenses\n170.0 \n84.9 \n85.1 \n2.5 \n1.2 \n363.9 \n287.9 \n76.0 \n1.8 \n1.4 \nRestructuring\n3.1 \n— \n3.1 \n— \n— \n24.5 \n— \n24.5 \n0.1 \n0.0 \nTotal operating expenses\n6,008.3 \n5,384.0 \n624.3 \n86.7 \n79.0 \n17,623.4 \n16,215.8 \n1,407.6 \n86.1 \n79.8 \nOperating income\n$\n918.7\n \n$\n1,432.7\n \n$\n(514.0)\n13.3\n \n%\n21.0\n \n%\n$\n2,848.3\n \n$\n4,101.8\n \n$\n(1,253.5)\n13.9\n \n%\n20.2\n \n%\nStore operating expenses as a % of company-operated stores revenue\n56.5 \n%\n51.0 \n%\n56.4 \n%\n51.1 \n%\nFor the quarter ended June 29, 2025 compared with the quarter ended June 30, 2024 \nRevenues\nNorth America total net revenues for the third quarter of fiscal 2025 increased $110 million, or 2%, primarily driven by net new company-operated store growth of  5%, or 513 stores, over the past 12 months ($266 million). This growth was partially offset by a net 2% decrease in comparable store sales ($116 million), driven by a 3% decrease in comparable transactions, partially offset by a 1% increase in average ticket, primarily due to fewer discounts in the current year. Also contributing were lower product and equipment sales to, and royalty revenues from, our licensees ($37 million). \nOperating Margin\nNorth America operating income for the third quarter of fiscal 2025 decreased 36% to $919 million, compared to $1.4 billion in the third quarter of fiscal 2024. Operating margin contracted 770 basis points to 13.3%, primarily driven by deleverage (approximately 250 basis points), investments in support of “Back to Starbucks,” including additional labor (approximately 170 basis points) and the Leadership Experience 2025 (approximately 120 basis points), and inflation (approximately 110 basis points), primarily driven by elevated coffee pricing.\nFor the three quarters ended June 29, 2025 compared with the three quarters ended June 30, 2024 \n34\nTable of \nContents\nRevenues\nNorth America total net revenues for the first three quarters of fiscal 2025 increased $154 million, or 1%, primarily driven by net new company-operated store growth 5%, or 513 stores, over the past 12 months ($722 million). This growth was partially offset by a net 2% decrease in comparable store sales ($420 million) driven by a 5% decrease in comparable transactions, partially offset by a 3% increase in average ticket, primarily due to annualization of prior year pricing and fewer discounts in the current year. Also contributing were lower product and equipment sales to, and royalty revenues from, our licensees ($112 million).\nOperating Margin\nNorth America operating income for the first three quarters of fiscal 2025 decreased 31% to $2.8 billion, compared to $4.1 billion in the first three quarters of fiscal 2024. Operating margin contracted 630 basis points to 13.9%, primarily driven by deleverage (approximately 320 basis points), additional labor (approximately 180 basis points), and inflation (approximately 70 basis points).\nInternational\n \nQuarter Ended\nThree Quarters Ended\n \nJun 29,\n2025\nJun 30,\n2024\n$\nChange\nJun 29,\n2025\nJun 30,\n2024\nJun 29,\n2025\nJun 30,\n2024\n$\nChange\nJun 29,\n2025\nJun 30,\n2024\nAs a % of International\nTotal Net Revenues\nAs a % of International\nTotal Net Revenues\nNet revenues:\nCompany-operated stores\n$\n1,526.8 \n$\n1,381.0 \n$\n145.8 \n75.9 \n%\n75.0 \n%\n$\n4,367.6 \n$\n4,083.1 \n$\n284.5 \n76.0 \n%\n75.0 \n%\nLicensed stores\n465.1 \n447.7 \n17.4 \n23.1 \n24.3 \n1,303.8 \n1,301.6 \n2.2 \n22.7 \n23.9 \nOther\n18.8 \n13.4 \n5.4 \n0.9 \n0.7 \n77.7 \n60.9 \n16.8 \n1.4 \n1.1 \nTotal net revenues\n2,010.7\n \n1,842.1\n \n168.6\n \n100.0\n \n100.0\n \n5,749.1\n \n5,445.6\n \n303.5\n \n100.0\n \n100.0\n \nProduct and distribution costs\n701.7 \n637.1 \n64.6 \n34.9 \n34.6 \n2,008.4 \n1,923.5 \n84.9 \n34.9 \n35.3 \nStore operating expenses\n792.4 \n698.0 \n94.4 \n39.4 \n37.9 \n2,281.4 \n2,088.5 \n192.9 \n39.7 \n38.4 \nOther operating expenses\n66.2 \n58.8 \n7.4 \n3.3 \n3.2 \n181.8 \n168.8 \n13.0 \n3.2 \n3.1 \nDepreciation and amortization expenses\n91.4 \n82.7 \n8.7 \n4.5 \n4.5 \n269.5 \n251.0 \n18.5 \n4.7 \n4.6 \nGeneral and administrative expenses\n81.9 \n80.5 \n1.4 \n4.1 \n4.4 \n259.1 \n253.9 \n5.2 \n4.5 \n4.7 \nRestructuring\n3.1 \n— \n3.1 \n0.2 \n— \n19.9 \n— \n19.9 \n0.3 \n— \nTotal operating expenses\n1,736.7 \n1,557.1 \n179.6 \n86.4 \n84.5 \n5,020.1 \n4,685.7 \n334.4 \n87.3 \n86.0 \nIncome/(loss) from equity investees\n(1.3)\n2.5 \n(3.8)\n(0.1)\n0.1 \n(2.1)\n2.9 \n(5.0)\n0.0 \n0.1 \nOperating income\n$\n272.7\n \n$\n287.5\n \n$\n(14.8)\n13.6\n \n%\n15.6\n \n%\n$\n726.9\n \n$\n762.8\n \n$\n(35.9)\n12.6\n \n%\n14.0\n \n%\nStore operating expenses as a % of company-operated stores revenue\n51.9 \n%\n50.5 \n%\n52.2 \n%\n51.1 \n%\nFor the quarter ended June 29, 2025 compared with the quarter ended June 30, 2024 \nRevenues\nInternational total net revenues for the third quarter of fiscal 2025 increased $169 million, or 9%, primarily due to net new company-operated store growth of 7%, or 638 stores, over the past 12 months ($63 million), favorable foreign currency translation impacts ($48 million), and higher product and equipment sales to, and royalty revenues from, our licensees ($28 million), primarily due to the opening of 446 net new licensed stores over the past 12 months. Also contributing to the increase \n35\nTable of \nContents\nin revenues was the incremental net revenue from the conversion of 113 licensed stores to company-operated stores ($27 million) following the acquisition of 23.5 Degrees Topco Limited, a U.K. licensed business partner, during the first quarter of fiscal 2025. International comparable store sales were flat, driven by a 1% increase in comparable transactions, offset by a 1% decrease in average ticket.\nOperating Margin\nInternational operating income for the third quarter of fiscal 2025 decreased 5% to $273 million, compared to $288 million in the third quarter of fiscal 2024. Operating margin contracted 200 basis points to 13.6%, primarily due to increased promotional activity (approximately 160 basis points).\nFor the three quarters ended June 29, 2025 compared with the three quarters ended June 30, 2024 \nRevenues\nInternational total net revenues for the first three quarters of fiscal 2025 increased $304 million, or 6%, primarily due to net new company-operated store growth of 7%, or 638 stores, over the past 12 months ($205 million), and the incremental net revenue from the conversion of 113 licensed stores to company-operated stores ($67 million) following the acquisition of 23.5 Degrees Topco Limited during the first quarter of fiscal 2025. Also contributing to the increase in revenues were higher product and equipment sales to, and royalty revenues from, our licensees ($49 million), primarily due to the opening of 446 net new licensed stores over the past 12 months. These increases were partially offset by a 1% decrease in comparable store sales ($33 million), driven by a 2% decrease in average ticket, partially offset by a 1% increase in comparable transactions.\nOperating Margin\nInternational operating income for the first three quarters of fiscal 2025 decreased 5% to $727 million, compared to $763 million in the first three quarters of fiscal 2024. Operating margin contracted 140 basis points to 12.6%, primarily due to increased promotional activity (approximately 180 basis points).\nChannel Development \nQuarter Ended\nThree Quarters Ended\n \nJun 29,\n2025\nJun 30,\n2024\n$\nChange\nJun 29,\n2025\nJun 30,\n2024\nJun 29,\n2025\nJun 30,\n2024\n$\nChange\nJun 29,\n2025\nJun 30,\n2024\nAs a % of Channel Development\nTotal Net Revenues\nAs a % of Channel Development\nTotal Net Revenues\nNet revenues\n$\n483.8 \n$\n438.3 \n$\n45.5 \n$\n1,329.0 \n$\n1,304.5 \n$\n24.5 \nProduct and distribution costs\n306.8 \n257.7 \n49.1 \n63.4 \n%\n58.8 \n%\n824.4 \n789.3 \n35.1 \n62.0 \n%\n60.5 \n%\nOther operating expenses\n15.1 \n15.2 \n(0.1)\n3.1 \n3.5 \n43.7 \n43.2 \n0.5 \n3.3 \n3.3 \nGeneral and administrative expenses\n1.7 \n1.6 \n0.1 \n0.4 \n0.4 \n4.8 \n5.7 \n(0.9)\n0.4 \n0.4 \nRestructuring\n0.2 \n— \n0.2 \n— \n— \n1.1 \n— \n1.1 \n0.1 \n— \nTotal operating expenses\n323.8 \n274.5 \n49.3 \n66.9 \n62.6 \n874.0 \n838.2 \n35.8 \n65.8 \n64.3 \nIncome from equity investees\n58.4 \n71.4 \n(13.0)\n12.1 \n16.3 \n164.8 \n194.9 \n(30.1)\n12.4 \n14.9 \nOperating income\n$\n218.4\n \n$\n235.2\n \n$\n(16.8)\n45.1\n \n%\n53.7\n \n%\n$\n619.8\n \n$\n661.2\n \n$\n(41.4)\n46.6\n \n%\n50.7\n \n%\nFor the quarter ended June 29, 2025 compared with the quarter ended June 30, 2024\nRevenues\nChannel Development total net revenues for the third quarter of fiscal 2025 increased $46 million, or 10%, primarily due to an increase in revenue in the Global Coffee Alliance ($45 million).\nOperating Margin\nChannel Development operating income for the third quarter of fiscal 2025 decreased 7% to $218 million, compared to $235 million in the third quarter of fiscal 2024. Operating margin contracted 860 basis points to 45.1%, primarily driven by a decline \n36\nTable of \nContents\nin our North American Coffee Partnership joint venture income (approximately 420 basis points), mix shift (approximately 270 basis points), and higher global product costs (approximately 250 basis points).\nFor the three quarters ended June 29, 2025 compared with the three quarters ended June 30, 2024\nRevenues\nChannel Development total net revenues for the first three quarters of fiscal 2025 increased $25 million, or 2%, primarily due to an increase in revenue in the Global Coffee Alliance ($27 million).\nOperating Margin\nChannel Development operating income for the first three quarters of fiscal 2025 decreased 6% to $620 million, compared to $661 million in the first three quarters of fiscal 2024. Operating margin contracted 410 basis points to 46.6%, primarily driven by a decline in our North American Coffee Partnership joint venture income (approximately 250 basis points) and higher global product costs (approximately 180 basis points).\nCorporate and Other\n \nQuarter Ended\nThree Quarters Ended\nJun 29,\n2025\nJun 30,\n2024\n$\nChange\n%\nChange\nJun 29,\n2025\nJun 30,\n2024\n$\nChange\n%\nChange\nNet revenues:\nOther\n$\n34.5 \n$\n16.8 \n$\n17.7 \n105.4 \n%\n$\n65.6 \n$\n34.6 \n$\n31.0 \n89.6 \n%\nTotal net revenues\n34.5\n \n16.8\n \n17.7\n \n105.4\n \n65.6\n \n34.6\n \n31.0\n \n89.6\n \nProduct and distribution costs\n37.4 \n14.2 \n23.2 \n163.4 \n69.7 \n33.9 \n35.8 \n105.6 \nOther operating expenses\n0.6 \n0.4 \n0.2 \n50.0 \n0.7 \n1.1 \n(0.4)\n(36.4)\nDepreciation and amortization expenses\n32.7 \n31.1 \n1.6 \n5.1 \n92.9 \n92.4 \n0.5 \n0.5 \nGeneral and administrative expenses\n423.6 \n409.0 \n14.6 \n3.6 \n1,347.4 \n1,331.1 \n16.3 \n1.2 \nRestructuring\n14.4 \n— \n14.4 \nnm\n91.5 \n— \n91.5 \nnm\nTotal operating expenses\n508.7 \n454.7 \n54.0 \n11.9 \n1,602.2 \n1,458.5 \n143.7 \n9.9 \nOperating loss\n$\n(474.2)\n$\n(437.9)\n$\n(36.3)\n8.3\n \n%\n$\n(1,536.6)\n$\n(1,423.9)\n$\n(112.7)\n7.9\n \n%\nCorporate and Other primarily consists of our unallocated corporate expenses and sales of cocoa butter to third parties. Unallocated corporate expenses include corporate administrative functions that support the operating segments but are not specifically attributable to or managed by any segment and are not included in the reported financial results of the operating segments.\nFor the quarter ended June 29, 2025 compared with the quarter ended June 30, 2024\nCorporate and Other operating loss increased 8% to $474 million for the third quarter of fiscal 2025 compared to $438 million for the third quarter of fiscal 2024, largely due to costs associated with restructuring our support organization, primarily severance costs, in support of our “Back to Starbucks” strategy.\nFor the three quarters ended June 29, 2025 compared with the three quarters ended June 30, 2024\nCorporate and Other operating loss increased 8% to $1.5 billion for the first three quarters of fiscal 2025 compared to $1.4 billion for the first three quarters of fiscal 2024, largely due to costs associated with restructuring our support organization, primarily severance costs, in support of our “Back to Starbucks” strategy.\n37\nTable of \nContents\nQuarterly Store Data\nOur store data for the periods presented is as follows:\n \nNet stores opened/(closed) and transferred during the period\n \n \n \nQuarter Ended\nThree Quarters Ended\nStores open as of\nJun 29,\n2025\nJun 30,\n2024\nJun 29,\n2025\nJun 30,\n2024\nJun 29,\n2025\nJun 30,\n2024\nNorth America\nCompany-operated stores\n122 \n113 \n292 \n312 \n11,453 \n10,940 \nLicensed stores\n(15)\n20 \n18 \n76 \n7,281 \n7,258 \nTotal North America\n107 \n133 \n310 \n388 \n18,734 \n18,198 \nInternational\nCompany-operated stores\n(1)\n103 \n244 \n420 \n562 \n10,277 \n9,526 \nLicensed stores\n(1)\n98 \n149 \n168 \n489 \n12,086 \n11,753 \nTotal International\n201 \n393 \n588 \n1,051 \n22,363 \n21,279 \nTotal Company\n308\n \n526\n \n898\n \n1,439\n \n41,097\n \n39,477\n \n(1)\nNet stores opened/(closed) and transferred during the period, for the three quarters ended June 29, 2025, includes the conversion of 113 licensed stores to company-operated stores following the acquisition of 23.5 Degrees Topco Limited during the first quarter of fiscal 2025.\nFinancial Condition, Liquidity, and Capital Resources\nCash and Investment Overview\nOur cash and investments were $4.7 billion\n \nas of June 29, 2025 and $3.8 billion as of September 29, 2024. We actively manage our cash and investments in order to internally fund operating needs, make scheduled interest and principal payments on our borrowings, fund acquisitions, and return cash to shareholders through common stock cash dividend payments and share repurchases. Our investment portfolio primarily includes highly liquid available-for-sale securities, including corporate debt securities and U.S. government treasury securities, as well as principal-protected structured deposits. As of June 29, 2025, approximately $2.1 billion of cash and short-term investments were held in foreign subsidiaries. \nBorrowing Capacity\nRevolving Credit Facility\nDuring the third quarter of fiscal 2025, we replaced our $3.0 billion unsecured five-year revolving credit facility (the “2021 credit facility”) with a new $3.0 billion unsecured five-year revolving credit facility (the “2025 credit facility”). \nOur 2025 credit facility, of which $150.0 million may be used for issuances of letters of credit, is currently set to mature on June 13, 2030. The 2025 credit facility is available for working capital, capital expenditures, and other general corporate purposes, including acquisitions and share repurchases. We have the option, subject to negotiation and agreement with the related banks, to increase the maximum commitment amount by an additional $1.0 billion.\nBorrowings under the 2025 credit facility will bear interest at a fluctuating rate based on the Term Secured Overnight Financing Rate (“Term SOFR”), and, for U.S. dollar-denominated loans under certain circumstances, a Base Rate (as defined in the 2025 credit facility), in each case plus an applicable rate. The applicable rate is based on the Company’s long-term credit ratings assigned by Moody’s and Standard & Poor’s rating agencies. The 2025 credit facility contains alternative interest rate provisions specifying rate calculations to be used at such time Term SOFR ceases to be available as a benchmark due to reference rate reform. The “Base Rate” of interest is the highest of (i) the Federal Funds Rate plus 0.50%, (ii) Bank of America’s prime rate, (iii) Term SOFR plus 1.00%, and (iv) 1.00%. Upon the occurrence of any event of default under the\n2025 credit facility, interest on the outstanding amount of the indebtedness under the 2025 credit facility will bear interest at a rate per annum equal to 2% in excess of the interest then borne by such borrowings.\nThe 2025 credit facility contains provisions requiring us to maintain compliance with certain covenants, including a minimum fixed charge coverage ratio, which measures our ability to cover financing expenses. As of June 29, 2025, we were in compliance with all applicable covenants. No amounts were outstanding under our 2025 credit facility as of June 29, 2025, or our 2021 credit facility as of September 29, 2024.\nCommercial Paper\nUnder our commercial paper program, we may issue unsecured commercial paper notes up to a maximum aggregate amount \n38\nTable of \nContents\noutstanding at any time of $3.0 billion, with individual maturities that may vary but not exceed 397 days from the date of issue. Amounts outstanding under the commercial paper program are required to be backstopped by available commitments under our 2025 credit facility. The proceeds from borrowings under our commercial paper program may be used for working capital needs, capital expenditures, and other corporate purposes, including, but not limited to, business expansion, payment of cash dividends on our common stock, and share repurchases. We had no borrowings outstanding under our commercial paper program as of June 29, 2025 and September 29, 2024. Our total available contractual borrowing capacity for general corporate purposes was $3.0 billion as of the end of our third quarter of fiscal 2025.\nCredit Facilities in Japan\nAdditionally, we hold the following Japanese yen-denominated credit facilities that are available for working capital needs and capital expenditures within our Japanese market.\n•\nA ¥5.0 billion, or $34.6 million, credit facility is currently set to mature on December 30, 2025. Borrowings under this credit facility are subject to terms defined within the facility and will bear interest at a variable rate based on TIBOR plus an applicable margin of 0.400%. \n•\nA ¥10.0 billion, or $69.2 million, credit facility is currently set to mature on March 27, 2026. Borrowings under this credit facility are subject to terms defined within the facility and will bear interest at a variable rate based on TIBOR plus an applicable margin of 0.300%.\nAs of June 29, 2025 and September 29, 2024, we had no borrowings outstanding under these credit facilities.\nSee \nNote 8,\n Debt, to the consolidated financial statements included in Item 1 of Part I of this 10-Q for details of the components of our long-term debt.\nOur ability to incur new liens and conduct sale and leaseback transactions on certain material properties is subject to compliance with terms of the indentures under which the long-term notes were issued. As of June 29, 2025, we were in compliance with all applicable covenants.\nUse of Cash\nWe expect to use our available cash and investments, including, but not limited to, additional potential future borrowings under the credit facilities, commercial paper program, and the issuance of debt to support and invest in our core businesses, including investing in new ways to serve our customers and supporting our store partners, repaying maturing debts, returning cash to shareholders through common stock cash dividend payments and discretionary share repurchases, and investing in new business opportunities related to our core and developing businesses. Furthermore, we may use our available cash resources to make proportionate capital contributions to our investees. We may also seek strategic acquisitions to leverage existing capabilities and further build our business. Acquisitions may include increasing our ownership interests in our investees. Any decisions to increase such ownership interests will be driven by valuation and fit with our ownership strategy. \nWe believe that net future cash flows generated from operations and existing cash and investments both domestically and internationally, combined with our ability to leverage our balance sheet through the issuance of debt, will be sufficient to finance capital requirements for our core businesses as well as shareholder distributions for at least the next 12 months. We are currently not aware of any trends or demands, commitments, events, or uncertainties that will result in, or that are reasonably likely to result in, our liquidity increasing or decreasing in any material way that will impact our capital needs during or beyond the next 12 months. We have borrowed funds and continue to believe we have the ability to do so at reasonable interest rates; however, additional borrowings would result in increased interest expense in the future. In this regard, we may incur additional debt, within targeted levels, as part of our plans to fund our capital programs, including cash returns to shareholders through future dividends and discretionary share repurchases, refinancing debt maturities, as well as investing in new business opportunities. If necessary, we may pursue additional sources of financing, including both short-term and long-term borrowings and debt issuances.\nWe regularly review our cash positions and our determination of partial indefinite reinvestment of foreign earnings. In the event we determine that all or another portion of such foreign earnings are no longer indefinitely reinvested, we may be subject to additional foreign withholding taxes, which could be material. Any foreign earnings that are not indefinitely reinvested may be repatriated at management’s discretion. During the third quarter of fiscal 2025, we revised our indefinite reinvestment assertions from prior years' cumulative earnings from certain foreign subsidiaries; as a result, and in anticipation of repatriating earnings from those subsidiaries, we accrued approximately $70 million of discrete tax expense related to foreign withholding taxes during the third quarter of fiscal year 2025. We continue to be indefinitely reinvested in the remainder of our foreign earnings, for which no tax accrual has been recorded.\nOn July 4, 2025, the President of the United States signed and enacted tax legislation into law through a reconciliation bill titled “An Act to provide for reconciliation pursuant to title II of H. Con. Res. 14,” commonly referred to as the “One Big Beautiful Bill Act.” This legislation was enacted during the fourth quarter of fiscal 2025; therefore, the fiscal 2025 accounting impacts \n39\nTable of \nContents\nfrom this tax law change will be included in our fourth quarter of fiscal 2025 results. We are evaluating the impacts of this tax law change; however, it is not expected to result in a material impact to our consolidated financial statements.\nDuring the third quarter of fiscal 2025, our Board of Directors approved a quarterly cash dividend to shareholders of $0.61 per share to be paid on August 29, 2025 to shareholders of record as of the close of business on August 15, 2025.\nDuring the three quarters ended June 29, 2025, we made no common stock share repurchases. As of June 29, 2025, 29.8 million shares remained available for repurchase under current authorizations.\nOther than normal operating expenses, cash requirements for the remainder of fiscal 2025 are expected to consist primarily of capital expenditures for investments in our new and existing stores, our supply chain, and corporate facilities. Total capital expenditures for fiscal 2025 are expected to be moderately lower than fiscal 2024.\nIn the MD&A included in the 10-K, we disclosed that we had $35.6 billion of current and long-term material cash requirements as of September 29, 2024. There have been no material changes to our material cash requirements during the period covered by this 10-Q outside of the normal course of our business.\nCash Flows\nNet cash provided by operating activities was $3.4 billion for the first three quarters of fiscal 2025, compared to $4.6 billion for the same period in fiscal 2024. The change was primarily due to a decrease in net earnings of $1.1 billion and a net increase of $424 million in inventories, which was primarily driven by green and roasted coffee, largely due to elevated coffee prices, partially offset by a net increase of $229 million in accounts payable, primarily due to payment timing.\nNet cash used in investing activities totaled $2.1 billion for the first three quarters of fiscal 2025, compared to $1.8 billion for the same period in fiscal 2024. The change was primarily due to a net decrease of $207 million in cash provided by investment activity, primarily structured deposit investments, and the acquisition of 23.5 Degrees Topco Limited. \nNet cash used in financing activities for the first three quarters of fiscal 2025 totaled $365 million, compared to $3.1 billion for the same period in fiscal 2024. The change was primarily due to no current year repayments of long-term debt and no current year share repurchases of our common stock compared to the prior year.\nCommodity Prices, Availability and General Risk Conditions\nCommodity price risk represents our primary market risk, generated by our purchases of green coffee and dairy products, among other items. We purchase, roast, and sell high-quality \narabica\n coffee and related products, and risk arises from the price volatility of green coffee. In addition to coffee, we also purchase significant amounts of dairy products to support the needs of our company-operated stores. The price and availability of these commodities, including recent volatility in green coffee prices, directly impact our results of operations, and we expect commodity prices, particularly coffee, to continue to impact future results of operations. For additional details, see Product Supply in Part 1, Item 1 of the 10-K, as well as Risk Factors in Part I, Item 1A of the 10-K.\nSeasonality and Quarterly Results\nOur business is subject to moderate seasonal fluctuations, of which our fiscal second quarter typically experiences lower revenues and operating income. Additionally, as our stored value cards (“Starbucks Cards”) are issued to, and loaded by, customers during the holiday season, we tend to have higher cash flows from operations during the first quarter of the fiscal year. However, since revenues from Starbucks Cards are recognized upon redemption and not when cash is loaded onto the Starbucks Cards, the impact of seasonal fluctuations on the consolidated statements of earnings is much less pronounced. As a result of moderate seasonal fluctuations, results for any quarter are not necessarily indicative of the results that may be achieved for the full fiscal year.\nCritical Accounting Estimates\nThe preparation of financial statements and related disclosures in conformity with U.S. generally accepted accounting principles and the Company’s discussion and analysis of its financial condition and operating results require the Company’s management to make judgments, assumptions, and estimates that affect the amounts reported. \nNote 1\n, Summary of Significant Accounting Policies and Estimates, to the consolidated financial statements included in Item 1 of Part I of this 10-Q and in the Notes to Consolidated Financial Statements in Part II, Item 8 of the 10-K describe the significant accounting policies and methods used in the preparation of the Company’s consolidated financial statements. There have been no material changes to the Company’s critical accounting estimates since the 10-K.\nRECENT ACCOUNTING PRONOUNCEMENTS\nSee \nNote 1\n, Summary of Significant Accounting Policies and Estimates, to the consolidated financial statements included in Item 1 of Part I of this 10-Q, for a detailed description of recent accounting pronouncements.\n40\nTable of \nContents"
}