{
  "source_file": "schw-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.     Management’s Discussion and Analysis of Financial Condition and Results of Operations\nINTRODUCTION\nThe Charles Schwab Corporation (CSC) is a savings and loan holding company. CSC engages, through its subsidiaries (collectively referred to as Schwab or the Company), in wealth management, securities brokerage, banking, asset management, custody, and financial advisory services.\nPrincipal business subsidiaries of CSC include the following:\n•\nCharles Schwab & Co., Inc. (CS&Co), incorporated in 1971, a securities broker-dealer;\n•\nCharles Schwab Bank, SSB (CSB), our principal banking entity; and\n•\nCharles Schwab Investment Management, Inc. (CSIM), the investment advisor for Schwab’s proprietary mutual funds (Schwab Funds\n®\n) and for Schwab’s exchange-traded funds (Schwab ETFs).\nUnless otherwise indicated, the terms “Schwab,” “the Company,” “we,” “us,” or “our” mean CSC together with its consolidated subsidiaries.\nSchwab provides financial services to individuals and institutional clients through two segments – Investor Services and Advisor Services. The Investor Services segment provides retail brokerage, investment advisory, and banking and trust services to individual investors, and retirement plan and business services, as well as other corporate brokerage services, to businesses and their employees. The Advisor Services segment provides custodial, trading, banking and trust, and support services to independent registered investment advisors (RIAs), independent retirement advisors, and recordkeepers. \nSchwab was founded on the belief that all Americans deserve access to a better investing experience. Although much has changed in the intervening years, our purpose remains clear – to champion every client’s goals with passion and integrity. Guided by this purpose and our vision of creating the most trusted leader in investment services, management has adopted a strategy described as “Through Clients’ Eyes.” \nThis strategy emphasizes placing clients’ perspectives, needs, and desires at the forefront. Because investing plays a fundamental role in building financial security, we strive to deliver a better investing experience for our clients – individual investors and the people and institutions who serve them – by disrupting longstanding industry practices on their behalf and providing superior service. We also aim to offer a broad range of products and solutions to meet client needs with a focus on transparency, value, and trust. In addition, management works to couple Schwab’s scale and resources with ongoing expense discipline to keep costs low and ensure that products and solutions are affordable as well as responsive to client needs. In combination, these are the key elements of our “no trade-offs” approach to serving investors. We believe that following this strategy is the best way to maximize our market valuation and stockholder returns over time. \nManagement estimates that investable wealth in the United States (U.S.) (consisting of assets in defined contribution, retail wealth management and brokerage, and registered investment advisor channels, along with bank deposits) currently exceeds $75 trillion, which means the Company’s $11.59 trillion in client assets leaves substantial opportunity for growth. Our strategy is based on the principle that developing trusted relationships will translate into more assets from both new and existing clients, ultimately driving more revenue, and along with expense discipline and thoughtful capital management, will generate earnings growth and build long-term stockholder value.\nThis Management’s Discussion and Analysis should be read in conjunction with our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 (2024 Form 10-K). \nOn our website, \nhttps://www.aboutschwab.com\n, we post the following filings after they are electronically filed with or furnished to the Securities and Exchange Commission (SEC or Commission): annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934. In addition, we post to the website the Dodd-Frank stress test results, our regulatory capital disclosures based on Basel III, our average liquidity coverage ratio (LCR), and our average net stable funding ratio (NSFR). The SEC maintains a website at \nhttps://www.sec.gov\n that contains reports, proxy statements, and other information that we file electronically with the Commission.\n-  1  -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nFORWARD-LOOKING STATEMENTS\nIn addition to historical information, this Quarterly Report on Form 10-Q contains “forward-looking statements” within the meaning of Section 27A of the Securities Act and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are identified by words such as “believe,” “anticipate,” “expect,” “prioritize,” “will,” “may,” “estimate,” “appear,” “could,” “would,” “maintain,” “continue,” “seek,” and other similar expressions. In addition, any statements that refer to expectations, strategy, objectives, projections, or other characterizations of future events or circumstances are forward-looking statements.\nThese forward-looking statements, which reflect management’s beliefs, objectives, and expectations as of the date hereof, are estimates based on the best judgment of Schwab’s senior management. These statements relate to, among other things:\n•\nMaximizing our market valuation and stockholder returns over time; and our belief that developing trusted relationships will translate into more client assets which drives revenue, and along with expense discipline and thoughtful capital management, generates earnings growth and builds stockholder value (see Introduction in Part I – Item 2);\n•\nCapital expenditures and expense management (see Results of Operations in Part I – Item 2);\n•\nNet interest revenue, client cash allocation behavior, and adjustment of rates paid on client-related liabilities (see Results of Operations in Part I – Item 2);\n•\nFunding sources and uses of liquidity (see Liquidity Risk in Part I – Item 2);\n•\nWholesale funding, funding strategy, and expectations for paydown of bank supplemental funding (see Results of Operations in Part I – Item 2, and Liquidity Risk in Part I – Item 2);\n•\nManagement of interest rate risk; modeling and assumptions, the impact of changes in interest rates on net interest margin and revenue, bank deposit account fee revenue, economic value of equity (EVE), and liability and asset duration (see Risk Management in Part I – Item 2);\n•\nCapital management; long-term operating objective; and uses of capital and return of excess capital to stockholders (see Capital Management in Part I – Item 2 and Commitments and Contingencies in Part I – Item 1 – Financial Information – Notes to Condensed Consolidated Financial Statements (Item 1) – Note 10); \n•\nThe acquisition of Forge Global Holdings, Inc. (Forge) and our expectation that incorporating Forge’s private markets capabilities will enhance Schwab’s ability to meet the evolving needs of investors across our growing client base (see Subsequent Events in Overview and Item 1 – Note 19); \n•\nThe expected impact of proposed and final rules (see Current Regulatory and Other Developments in Part I – Item 2);\n•\nThe expected impact of new accounting standards not yet adopted (see New Accounting Standards in Item 1 – Note 2);\n•\nThe likelihood of indemnification and guarantee payment obligations and clients failing to fulfill contractual obligations (see Commitments and Contingencies in Item 1 – Note 10); and\n•\nThe outcome and impact of legal proceedings and regulatory matters (see Commitments and Contingencies in Item 1 – Note 10, and Legal Proceedings in Part II – Item 1).\nAchievement of the expressed beliefs, objectives, and expectations described in these statements is subject to certain risks and uncertainties that could cause actual results to differ materially from the expressed beliefs, objectives, and expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this Quarterly Report on Form 10-Q or, in the case of documents incorporated by reference, as of the date of those documents.\nImportant factors that may cause actual results to differ include, but are not limited to:\n•\nGeneral economic and market conditions, including the level of interest rates, equity market valuations and volatility;\n•\nOur ability to attract and retain clients, develop trusted relationships, and grow client assets;\n•\nClient use of our advisory and lending solutions and other products and services;\n•\nThe level of client assets, including cash balances;\n•\nClient cash allocations and sensitivity to deposit rates;\n•\nCompetitive pressure on\n pricing, including deposit rates;\n•\nThe level and mix of client trading activity, including daily average trades, margin balances, and balance sheet cash;\n•\nRegulatory guidance and adverse impacts from new or changed legislation, rulemaking or regulatory expectations;\n•\nCapital and liquidity needs and management;\n•\nOur ability to manage expenses;\n•\nOur ability to attract and retain talent;\n•\nOur ability to develop and launch new and enhanced products, services, and capabilities, as well as enhance our infrastructure, in a timely and successful manner;\n-  2  -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\n•\nManagement’s ability to close the acquisition of Forge on the anticipated terms and timing; required regulatory approvals and approval by Forge’s stockholders; disruptions to Forge’s business as a result of the announcement and pendency of the acquisition; and the ability and timeframe to integrate the business and realize the anticipated benefits;\n•\nOur ability to monetize client assets;\n•\nOur ability to support client activity levels;\n•\nIncreased compensation and other costs; \n•\nRe\nal estate and workforce decisions;\n•\nThe timing and scope of technology projects;\n•\nBalance sheet positioning relative to changes in interest rates;\n•\nInterest-earning asset mix and growth;\n•\nOur ability to access funding sources;\n•\nPrepayment levels for mortgage-backed securities;\n•\nRegulatory and legislative developments;\n•\nAdverse developments in litigation or regulatory matters and any related charges; and\n•\nPotential breaches of contractual terms for which we have indemnification and guarantee obligations.\nCertain of these factors, as well as general risk factors affecting the Company, are discussed in greater detail in Part I – Item 1A – Risk Factors in the 2024 Form 10-K.\n-  3  -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nOVERVIEW\nManagement focuses on several client activity and financial metrics in evaluating Schwab’s financial position and operating performance. Results for the third quarter and first nine months of 2025 and 2024 are as follows:\nThree Months Ended\nSeptember 30,\nPercent\nChange\nNine Months Ended\nSeptember 30,\nPercent\nChange\n2025\n2024\n2025\n2024\nClient Metrics\nNet new client assets (in billions) \n(1)\n$\n134.4 \n$\n90.8 \n48\n%\n$\n340.4 \n$\n253.2 \n34\n%\nCore net new client assets (in billions)\n$\n137.5 \n$\n95.3 \n44\n%\n$\n355.5 \n$\n252.1 \n41\n%\nClient assets (in billions, at quarter end)\n$\n11,593.9 \n$\n9,920.5 \n17\n%\nAverage client assets (in billions)\n$\n11,151.9 \n$\n9,594.9 \n16\n%\n$\n10,490.8 \n$\n9,162.4 \n14\n%\nNew brokerage accounts (in thousands)\n1,143 \n972 \n18\n%\n3,424 \n3,051 \n12\n%\nActive brokerage accounts (in thousands, at quarter end)\n37,963 \n35,982 \n6\n%\nAssets receiving ongoing advisory services (in billions, \n  at quarter end)\n$\n5,809.2 \n$\n5,018.9 \n16\n%\nClient cash as a percentage of client assets (at quarter end)\n9.4\n%\n9.5\n%\nCompany Financial Information and Metrics\nTotal net revenues\n$\n6,135 \n$\n4,847 \n27\n%\n$\n17,585 \n$\n14,277 \n23\n%\nTotal expenses excluding interest\n3,114 \n3,005 \n4\n%\n9,306 \n8,890 \n5\n%\nIncome before taxes on income\n3,021 \n1,842 \n64\n%\n8,279 \n5,387 \n54\n%\nTaxes on income\n663 \n434 \n53\n%\n1,886 \n1,285 \n47\n%\nNet income\n2,358 \n1,408 \n67\n%\n6,393 \n4,102 \n56\n%\nPreferred stock dividends and other\n81 \n109 \n(26)\n%\n343 \n341 \n1\n%\nNet income available to common stockholders\n$\n2,277 \n$\n1,299 \n75\n%\n$\n6,050 \n$\n3,761 \n61\n%\nEarnings per common share — diluted\n$\n1.26 \n$\n.71 \n77\n%\n$\n3.33 \n$\n2.05 \n62\n%\nNet revenue change from prior year\n27\n%\n5\n%\n23\n%\n(1)\n%\nPre-tax profit margin\n49.2\n%\n38.0\n%\n47.1\n%\n37.7\n%\nReturn on average common stockholders’ equity (annualized)\n21\n%\n14\n%\n20\n%\n14\n%\nExpenses excluding interest as a percentage of average client \n  assets (annualized)\n0.11\n%\n0.12\n%\n0.12\n%\n0.13\n%\nConsolidated Tier 1 Leverage Ratio (at quarter end)\n9.7\n%\n9.7\n%\nNon-GAAP Financial Measures\n \n(2)\nAdjusted total expenses\n$\n2,987 \n$\n2,852 \n$\n8,921 \n$\n8,422 \nAdjusted diluted earnings per common share\n$\n1.31 \n$\n.77 \n$\n3.49 \n$\n2.25 \nReturn on tangible common equity\n38\n%\n31\n%\n37\n%\n33\n%\n(1)\n The third quarter and first nine months of 2025 include net outflows of $3.1 billion and $15.1 billion, respectively, from off-platform brokered certificates of deposit (CDs) issued by CSB. The third quarter and first nine months of 2024 include net outflows of $4.4 billion and $9.1 billion, respectively, from off-platform brokered CDs issued by CSB and an outflow of $0.1 billion from an international relationship. The first nine months of 2024 also includes an inflow of $10.3 billion from a mutual fund clearing services client. \n(2)\n See Non-GAAP Financial Measures for further details and a reconciliation of such measures to GAAP reported results.\nThe first nine months of 2025 continued to present a changing landscape for investors. Though macroeconomic uncertainty continued, during the third quarter of 2025, investor sentiment further improved and equity markets reached record levels. The Standard and Poor’s\n®\n 500 Index rose 8% and 14% during the third quarter and first nine months of 2025, respectively, and the NASDAQ Composite\n®\n increased 11% and 17% during the third quarter and year-to-date periods. The Federal Reserve reduced the target federal funds overnight rate 25 basis points in September, representing the first such rate cut since December 2024. \nSchwab saw strong client asset gathering, growth in new client accounts, and sustained client engagement continue through the first nine months of 2025. Core net new assets totaled $137.5 billion and $355.5 billion in the third quarter and first nine months of the year, respectively, increasing 44% and 41% from the comparative prior-year periods. Clients opened 1.1 million and 3.4 million new brokerage accounts in the third quarter and first nine months of the year, respectively, up 18% and 12% from the respective periods in 2024, and active brokerage accounts reached 38.0 million at the end of the third quarter of 2025, up 6% year-over-year. Though clients’ daily average trades (DATs) in third quarter of 2025 declined slightly from the second quarter, client engagement with the markets remained strong. DATs were 7.4 million and 7.5 million for the third quarter and first nine months of 2025, respectively, up 30% and 31% from the same periods in 2024.\n- 4 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nSchwab’s financial performance in the third quarter and first nine months of 2025 reflected strong asset gathering, sustained client engagement and equity market appreciation, continued demand for Schwab’s lending offerings and managed investing solutions, as well as reduction of higher-cost bank supplemental funding and balanced expense management. Net income was $2.4 billion and $6.4 billion in the third quarter and first nine months of 2025, respectively, growing 67% and 56% from the same prior-year periods. Diluted earnings per common share (EPS) was $1.26 and $3.33 for the third quarter and first nine months of 2025, respectively, rising 77% and 62% from the same periods in 2024. Adjusted diluted EPS \n(1)\n was $1.31 and $3.49 for the third quarter and first nine months of 2025, respectively, increasing 70% and 55% from the same periods in 2024.\nTotal net revenues grew 27% year-over-year in the third quarter of 2025 to reach $6.1 billion, resulting in a year-to-date total of $17.6 billion, an increase of 23% from the same period in 2024. Net interest revenue was $3.1 billion and $8.6 billion in the third quarter and first nine months of 2025, respectively, up 37% and 30% from the same periods in 2024, primarily due to lower interest expense from reductions in bank supplemental funding and lower rates on funding sources, as well as growth in bank and margin lending and higher cash and investments segregated, which more than offset lower yields on interest-earning assets due to lower market rates. Asset management and administration fees were $1.7 billion and $4.8 billion in the third quarter and first nine months of 2025, respectively, increasing 13% from both prior-year periods, due primarily to continued growth in money market funds and also higher client asset balances, reflecting asset gathering, equity market appreciation, and growth in managed investing solutions. Trading revenue was $995 million and $2.9 billion in the third quarter and first nine months of 2025, respectively, higher by 25% and 19% from comparable prior-year periods, due primarily to higher trading volume. Bank deposit account fee revenue rose to $247 million and $739 million in the third quarter and first nine months of the year, respectively, up 63% and 51% from the same periods in 2024 due primarily to higher net yields, partially offset by lower bank deposit account balances (BDA balances).\nTotal expenses excluding interest were $3.1 billion and $9.3 billion in the third quarter and first nine months of 2025, respectively, increasing 4% and 5% from the same periods in 2024. For the third quarter and first nine months of 2025, adjusted total expenses \n(1)\n were $3.0 billion and $8.9 billion, respectively, up 5% and 6% from the comparable prior-year periods. The increases in total expenses excluding interest and adjusted total expenses \n(1)\n reflect ongoing investments to support growth of the business and enhance client-serving capabilities while driving incremental efficiencies across the Company. The increases were primarily attributable to higher compensation and benefits expense and higher professional services expense, partially offset by lower regulatory fees and assessments, and for the quarter-to-date period, lower industry fees within other expense.\nReturn on average common stockholders’ equity was 21% and 20% for the third quarter and first nine months of 2025, respectively, up from 14% in both comparable prior-year periods. These increases were due to higher net income, which more than offset higher average common stockholders’ equity. Return on tangible common equity \n(1)\n (ROTCE) was 38% and 37% for the third quarter and first nine months of 2025, respectively, up from 31% and 33% for the same periods in the prior year, as growth in adjusted net income available to common stockholders \n(1)\n more than offset growth in average common stockholders’ equity. Average common stockholders’ equity increased primarily as a result of growth in retained earnings and improved average accumulated other comprehensive income (AOCI), partially offset by higher treasury stock due to common stock repurchases in 2025. The improvement in average AOCI was due to lower unrealized losses on available for sale (AFS) investment securities and securities previously transferred from AFS to held to maturity (HTM).\nIn the first nine months of 2025, Schwab supported strong client demand in margin and bank lending, while significantly reducing bank supplemental funding. Balance sheet assets totaled $465.3 billion as of September 30, 2025, up 1% during the third quarter and down 3% from year-end 2024. Principal and interest from our AFS and HTM securities portfolio along with normal client cash activity allowed for further reduction in bank supplemental funding, which includes brokered CDs, Federal Home Loan Bank (FHLB) borrowings, and borrowings under repurchase agreements at our banks. In September, we transferred $3.0 billion of BDA balances to our balance sheet (see Item 1 – Note 10) to accelerate the paydown of bank supplemental borrowings. In the first nine months of 2025, Schwab reduced the outstanding balance of total bank supplemental funding by $35.1 billion, or 70%, including a reduction of $12.9 billion during the third quarter. As of September 30, 2025, remaining balances totaled $14.8 billion, which is within a range generally consistent with our diversified funding strategy. Client margin loans increased during the third quarter to $97.2 billion at September 30, up 16% from year-end 2024, reflecting strong client demand amid rising equity markets and improved investor sentiment. Bank loans totaled $53.6 billion as of the end of the third quarter, increasing 18% in the first nine months of 2025 due to growth of pledged asset lines (PALs) and First Mortgages.\nThe Company also returned meaningful excess capital in the first nine months of 2025. During the third quarter, the Company repurchased $2.7 billion in common stock, bringing total year-to-date common stock repurchases to $4.6 billion. In addition, the Company increased its common dividend by 8% to $.27 per share in the first quarter of the year, and redeemed its Series G preferred stock for $2.5 billion in the second quarter. Inclusive of these capital actions and organic capital generation from net \n- 5 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nincome in the first nine months of the year, the Company’s consolidated Tier 1 Leverage Ratio was 9.7% at September 30, 2025, down slightly from year-end 2024. Our consolidated adjusted Tier 1 Leverage Ratio \n(1)\n increased to 7.3%, driven by net income in the first nine months of the 2025 and improvement in AOCI.\n(1)\n Adjusted diluted EPS, adjusted total expenses, return on tangible common equity, adjusted net income available to common stockholders, and adjusted Tier 1 Leverage Ratio are non-GAAP financial measures. See Non-GAAP Financial Measures for further details and a reconciliation of such measures to GAAP reported results.\nSubsequent Events\nOn November 6, 2025, Schwab announced that it has entered into a definitive agreement to acquire Forge Global Holdings, Inc. (Forge), operator of a leading private market platform and trading marketplace, in a transaction valued at approximately $660 million. The Company anticipates that incorporating Forge’s private markets capabilities will enhance Schwab’s ability to meet the evolving needs of investors across our growing client base. The transaction is expected to close in the first half of 2026, subject to customary closing conditions, including approval by Forge’s stockholders and regulatory approvals.\nCurrent Regulatory and\n \nOther Developments\n \nOn June 12, 2025, the SEC withdrew certain notices of proposed rulemaking issued between March 2022 and November 2023, including the SEC’s December 2022 equity market structure rule proposals, “Order Competition Rule” and “Regulation Best Execution”, previously referenced in Part II – Item 7 – Current Regulatory and Other Developments in our 2024 Form 10-K.\nOn March 3, 2025, the Federal Deposit Insurance Corporation (FDIC) withdrew certain notices of proposed rulemaking issued in 2023 and 2024, including the July 2024 proposal related to the brokered deposits framework, previously referenced in Part II – Item 7 – Current Regulatory and Other Developments in our 2024 Form 10-K.\nRefer to Part II – Item 7 – Current Regulatory and Other Developments in our 2024 Form 10-K for information regarding pending regulatory matters including:\n•\nThe U.S. Department of Labor’s April 2024 final rule significantly broadening the definition of “fiduciary” under the Employee Retirement Income Security Act of 1974 and related litigation;\n•\nThe FDIC’s November 2023 and February 2024 special assessments on banks, including the Company’s banking subsidiaries, to recover losses incurred by the Deposit Insurance Fund to protect uninsured depositors due to the March 2023 closures of two banks;\n•\nThe U.S. federal banking agencies’ August 2023 proposed rulemaking on long-term debt requirements for certain large banking organizations; and\n•\nThe U.S. federal banking agencies’ July 2023 notice of proposed rulemaking with amendments to the regulatory capital rules, which, among other things, would require us to include AOCI in regulatory capital and to calculate our risk-weighted assets using a revised risk-based approach, a component of which is based on operational risk.\n- 6 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nRESULTS OF OPERATIONS\nTotal Net Revenues\nThe following tables present a comparison of revenue by category:\n \n2025\n2024\nThree Months Ended September 30,\nPercent\nChange\nAmount\n% of\nTotal Net\nRevenues\nAmount\n% of\nTotal Net\nRevenues\nNet interest revenue\nInterest revenue\n1\n%\n$\n3,956 \n64\n%\n$\n3,928 \n81\n%\nInterest expense\n(47)\n%\n(906)\n(14)\n%\n(1,706)\n(35)\n%\nNet interest revenue\n37\n%\n3,050 \n50\n%\n2,222 \n46\n%\nAsset management and administration fees\n \n \n \nMutual funds, exchange-traded funds (ETFs), and collective trust \n  funds (CTFs)\n14\n%\n946 \n15\n%\n827 \n17\n%\nManaged investing solutions\n11\n%\n619 \n10\n%\n559 \n12\n%\nOther\n20\n%\n108 \n2\n%\n90 \n2\n%\nAsset management and administration fees\n13\n%\n1,673 \n27\n%\n1,476 \n31\n%\nTrading revenue\n \n \nCommissions\n17\n%\n453 \n7\n%\n388 \n8\n%\nOrder flow revenue\n37\n%\n490 \n8\n%\n357 \n7\n%\nPrincipal transactions\n—\n52 \n1\n%\n52 \n1\n%\nTrading revenue\n25\n%\n995 \n16\n%\n797 \n16\n%\nBank deposit account fees\n63\n%\n247 \n4\n%\n152 \n3\n%\nOther\n(15)\n%\n170 \n3\n%\n200 \n4\n%\nTotal net revenues\n27\n%\n$\n6,135 \n100\n%\n$\n4,847 \n100\n%\n2025\n2024\nNine Months Ended September 30,\nPercent\nChange\nAmount\n% of\nTotal Net\nRevenues\nAmount\n% of\nTotal Net\nRevenues\nNet interest revenue\nInterest revenue\n(2)\n%\n$\n11,500 \n65\n%\n$\n11,686 \n82\n%\nInterest expense\n(42)\n%\n(2,922)\n(16)\n%\n(5,073)\n(36)\n%\nNet interest revenue\n30\n%\n8,578 \n49\n%\n6,613 \n46\n%\nAsset management and administration fees\nMutual funds, ETFs, and CTFs\n14\n%\n2,695 \n15\n%\n2,370 \n17\n%\nManaged investing solutions\n13\n%\n1,777 \n10\n%\n1,572 \n11\n%\nOther\n14\n%\n301 \n2\n%\n265 \n2\n%\nAsset management and administration fees\n13\n%\n4,773 \n27\n%\n4,207 \n30\n%\nTrading revenue\nCommissions\n11\n%\n1,315 \n7\n%\n1,184 \n8\n%\nOrder flow revenue\n31\n%\n1,399 \n8\n%\n1,066 \n8\n%\nPrincipal transactions\n— \n141 \n1\n%\n141 \n1\n%\nTrading revenue\n19\n%\n2,855 \n16\n%\n2,391 \n17\n%\nBank deposit account fees\n51\n%\n739 \n4\n%\n488 \n3\n%\nOther\n11\n%\n640 \n4\n%\n578 \n4\n%\nTotal net revenues\n23\n%\n$\n17,585 \n100\n%\n$\n14,277 \n100\n%\n- 7 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nNet Interest Revenue\nRevenue on interest-earning assets is affected by various factors, such as the composition of assets, prevailing interest rates and spreads at the time of origination or purchase, changes in interest rates on cash and cash equivalents, floating-rate securities and loans, and changes in prepayment levels for mortgage-backed and other asset-backed securities and loans. Schwab establishes the rates paid on client-related liabilities, and management expects that it will generally adjust the rates paid on these liabilities at some fraction of any movement in short-term rates. Interest expense on long-term debt, FHLB borrowings, other short-term borrowings, and other funding sources is impacted by market interest rates at the time of borrowing and changes in interest rates on floating-rate liabilities. Net interest revenue reflects the impacts of derivatives used to manage interest rate risk. See also Risk Management – Market Risk and Item 1 – Note 11 for additional information.\nThe Federal Reserve maintained the upper bound of the target overnight rate at 5.50% through most of 2024 before reducing the rate by 50 basis points during the third quarter of 2024 and another 50 basis points across two cuts during the fourth quarter of 2024. The Federal Reserve maintained the upper bound of the target overnight rate at 4.50% for most of the first nine months of 2025 before reducing the rate by 25 basis points in mid-September to 4.25%.\nSchwab’s average interest-earning assets for the third quarter and first nine months of 2025 were relatively consistent in aggregate with the same periods in 2024, while the mix of interest-earning assets shifted year-over-year to reflect higher margin and bank lending, higher cash and investments segregated, and lower balances of AFS and HTM securities. Client demand for margin and bank lending continued to be strong in the first nine months of 2025, reflecting positive equity market performance and client engagement, as margin loan balances rebounded following market volatility in late March and early April and rose further in the third quarter. Margin loan balances ended the third quarter at $97.2 billion, increasing 16% from both the second quarter of 2025 and year-end 2024, and up 33% from September 30, 2024. Total bank loans increased 6% and 18% in the third quarter and first nine months of 2025, respectively, finishing the third quarter at $53.6 billion, higher by 24% from September 30, 2024, due primarily to growth in PALs and First Mortgages.\nClient cash activity during the first nine months of 2025 reflected normal cash behavior, inclusive of organic growth, engagement in equity markets, and seasonality. Bank sweep deposits and payables to brokerage clients increased by a total of $15.0 billion, or 5%, during the third quarter of 2025, $12.5 billion, or 4%, during the first nine months of 2025, and $42.6 billion, or 15%, from September 30, 2024 to September 30, 2025. Principal and interest payments on AFS and HTM securities, as well as September transfers of $3.0 billion of BDA balances to our balance sheet (see Results of Operations – Bank Deposit Account Fees and Item 1 – Note 10) supported paydowns in bank supplemental funding of $12.9 billion, or 47%, during the third quarter of 2025, and $35.1 billion, or 70%, during the first nine months of 2025. Since September 30, 2024, the Company has reduced bank supplemental funding by $50.0 billion, or 77%. \n- 8 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nThe following table presents net interest revenue information corresponding to interest-earning assets and funding sources on the condensed consolidated balance sheets:\n2025\n2024\nThree Months Ended September 30,\nAverage Balance\nInterest Revenue/ Expense\nAverage Yield/Rate\nAverage Balance\nInterest Revenue/ Expense\nAverage Yield/Rate\nInterest-earning assets\nCash and cash equivalents\n$\n24,298 \n$\n264 \n4.26\n%\n$\n27,623 \n$\n369 \n5.24%\nCash and investments segregated\n46,046 \n494 \n4.20\n%\n26,220 \n345 \n5.15%\nReceivables from brokerage clients\n90,121 \n1,490 \n6.47\n%\n73,102 \n1,431 \n7.66%\nAvailable for sale securities \n(1)\n69,794 \n360 \n2.05\n%\n98,645 \n531 \n2.14%\nHeld to maturity securities \n(1)\n137,672 \n587 \n1.70\n%\n151,004 \n650 \n1.71%\nBank loans\n51,849 \n557 \n4.27\n%\n42,653 \n484 \n4.52%\nTotal interest-earning assets\n419,780 \n3,752 \n3.52\n%\n419,247 \n3,810 \n3.58%\nSecurities lending revenue\n183 \n87 \nOther interest revenue\n21 \n31 \nTotal interest-earning assets\n$\n419,780 \n$\n3,956 \n3.71\n%\n$\n419,247 \n$\n3,928 \n3.69%\nFunding sources\nBank deposits\n$\n229,281 \n$\n248 \n0.43\n%\n$\n248,405 \n$\n841 \n1.35%\nPayables to brokers, dealers, and clearing organizations \n(2)\n19,131 \n188 \n3.84\n%\n9,825 \n118 \n4.68%\nPayables to brokerage clients\n96,064 \n97 \n0.40\n%\n72,700 \n79 \n0.43%\nOther short-term borrowings\n7,593 \n87 \n4.56\n%\n10,821 \n150 \n5.52%\nFederal Home Loan Bank borrowings\n7,103 \n79 \n4.35\n%\n22,621 \n310 \n5.38%\nLong-term debt\n20,204 \n207 \n4.01\n%\n22,446 \n208 \n3.71%\nTotal interest-bearing liabilities \n(2)\n379,376 \n906 \n0.94\n%\n386,818 \n1,706 \n1.75%\nNon-interest-bearing funding sources \n(2)\n40,404 \n32,429 \nOther interest expense \n— \n— \nTotal funding sources\n$\n419,780 \n$\n906 \n0.85\n%\n$\n419,247 \n$\n1,706 \n1.61%\nNet interest revenue\n$\n3,050 \n2.86\n%\n$\n2,222 \n2.08%\n2025\n2024\nNine Months Ended September 30,\nAverage Balance\nInterest Revenue/ Expense\nAverage Yield/Rate\nAverage Balance\nInterest Revenue/ Expense\nAverage Yield/Rate\nInterest-earning assets\nCash and cash equivalents\n$\n27,571 \n$\n897 \n4.29\n%\n$\n30,128 \n$\n1,205 \n5.26\n%\nCash and investments segregated\n44,104 \n1,412 \n4.22\n%\n25,744 \n1,014 \n5.18\n%\nReceivables from brokerage clients\n84,317 \n4,204 \n6.57\n%\n68,557 \n4,042 \n7.75\n%\nAvailable for sale securities \n(1)\n77,324 \n1,198 \n2.06\n%\n104,830 \n1,680 \n2.13\n%\nHeld to maturity securities \n(1)\n141,032 \n1,811 \n1.71\n%\n154,231 \n1,998 \n1.72\n%\nBank loans\n48,882 \n1,568 \n4.28\n%\n41,585 \n1,384 \n4.44\n%\nTotal interest-earning assets\n423,230 \n11,090 \n3.47\n%\n425,075 \n11,323 \n3.52\n%\nSecurities lending revenue\n339 \n258 \nOther interest revenue\n71 \n105 \nTotal interest-earning assets\n$\n423,230 \n$\n11,500 \n3.60\n%\n$\n425,075 \n$\n11,686 \n3.63\n%\nFunding sources\nBank deposits\n$\n237,488 \n$\n1,010 \n0.57\n%\n$\n260,254 \n$\n2,602 \n1.34\n%\nPayables to brokers, dealers, and clearing organizations \n(2)\n16,673 \n492 \n3.89\n%\n7,004 \n230 \n4.31\n%\nPayables to brokerage clients\n92,909 \n217 \n0.31\n%\n69,586 \n229 \n0.44\n%\nOther short-term borrowings\n7,314 \n256 \n4.68\n%\n9,164 \n382 \n5.57\n%\nFederal home loan bank borrowings\n9,180 \n322 \n4.62\n%\n24,347 \n988 \n5.36\n%\nLong-term debt\n21,029 \n625 \n3.92\n%\n23,299 \n640 \n3.66\n%\nTotal interest-bearing liabilities \n(2)\n384,593 \n2,922 \n1.01\n%\n393,654 \n5,071 \n1.71\n%\nNon-interest-bearing funding sources \n(2)\n38,637 \n31,421 \nOther interest expense \n— \n2 \nTotal funding sources\n$\n423,230 \n$\n2,922 \n0.92\n%\n$\n425,075 \n$\n5,073 \n1.59\n%\nNet interest revenue\n$\n8,578 \n2.68\n%\n$\n6,613 \n2.04\n%\n(1) \nAmounts have been calculated based on amortized cost. Interest revenue on investment securities is presented net of related premium amortization.\n(2) \nBeginning in the fourth quarter of 2024, payables to brokers, dealers, and clearing organizations is presented separately from non-interest-bearing funding sources and included in total interest-bearing liabilities. This line item includes securities loaned and related interest expense. Prior period amounts have been reclassified to reflect this change.\n- 9 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nNet interest revenue increased $828 million, or 37%, and $2.0 billion, or 30%, in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. These increases were primarily due to lower balances of bank supplemental funding, lower average rates paid on funding sources, growth in margin and bank lending, and increases in securities lending, partially offset by lower yields on floating-rate assets due to lower market rates. Average interest-earning assets remained relatively flat, increasing slightly in the third quarter of 2025, and decreasing slightly in the first nine months of 2025, compared to the same periods in 2024. Both the third quarter and first nine months of 2025 saw higher balances of cash and investments segregated, growth in margin lending supported by higher payables to brokerage clients, and an increase in bank loans compared to the same periods in 2024. The decrease in average interest-earning assets during the first nine months of 2025 was due primarily to lower average balances in AFS and HTM securities, as cash inflows from investment securities were used to pay down bank supplemental funding.\nNet interest margin increased to 2.86% and 2.68% in the third quarter and first nine months of 2025, respectively, compared to 2.08% and 2.04% during the same periods in 2024, as reduced balances of bank supplemental funding and lower rates paid on funding sources more than offset lower yields on floating-rate assets due to lower market interest rates.\nSchwab’s diversified funding strategy includes the use of wholesale funding. With the paydowns of bank supplemental funding in the first nine months of 2025, the outstanding balance of $14.8 billion is within a range generally consistent with our diversified funding strategy. Our use and the financial impacts of wholesale funding are dependent on a number of market and client activity factors. See also Risk Management – Liquidity Risk, Capital Management, Item 1 – Notes 8, 9, and 12, and Part II – Item 7 – Results of Operations – Net Interest Revenue in the 2024 Form 10-K for additional information on these and other funding sources.\n- 10 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nAsset Management and Administration Fees\nThe following table presents asset management and administration fees, average client assets, and average fee yields:\nThree Months Ended September 30,\n2025\n2024\nAverage\nClient\nAssets\nRevenue\nAverage\nFee\nAverage\nClient\nAssets\nRevenue\nAverage\nFee\nSchwab money market funds\n$\n663,218 \n$\n458 \n0.27\n%\n$\n551,945 \n$\n379 \n0.27\n%\nSchwab equity and bond funds, ETFs, and CTFs\n735,519 \n132 \n0.07\n%\n603,314 \n118 \n0.08\n%\nMutual Fund OneSource\n®\n and other no-transaction-fee (NTF) funds\n \n443,660 \n259 \n0.23\n%\n354,664 \n224 \n0.25\n%\nOther third-party mutual funds and ETFs\n \n618,032 \n97 \n0.06\n%\n611,555 \n106 \n0.07\n%\nTotal mutual funds, ETFs, and CTFs \n(1)\n$\n2,460,429 \n$\n946 \n0.15\n%\n$\n2,121,478 \n$\n827 \n0.16\n%\nManaged investing solutions \n(1)\nFee-based\n$\n654,220 \n$\n619 \n0.38\n%\n$\n554,726 \n$\n559 \n0.40\n%\nNon-fee-based\n127,592 \n— \n—\n114,307 \n— \n—\nTotal managed investing solutions\n$\n781,812 \n$\n619 \n0.31\n%\n$\n669,033 \n$\n559 \n0.33\n%\nOther balance-based fees\n (2)\n922,030 \n81 \n0.03\n%\n795,737 \n72 \n0.04\n%\nOther \n(3)\n27 \n18 \nTotal asset management and administration fees\n$\n1,673 \n$\n1,476 \nNine Months Ended September 30,\nSchwab money market funds\n$\n643,168 \n$\n1,318 \n0.27\n%\n$\n525,166 \n$\n1,072 \n0.27\n%\nSchwab equity and bond funds, ETFs, and CTFs\n685,300 \n376 \n0.07\n%\n569,608 \n337 \n0.08\n%\nMutual Fund OneSource and other NTF funds\n (4)\n384,614 \n699 \n0.24\n%\n335,813 \n647 \n0.26\n%\nOther third-party mutual funds and ETFs\n (4)\n617,441 \n302 \n0.07\n%\n606,026 \n314 \n0.07\n%\nTotal mutual funds, ETFs, and CTFs \n(1)\n$\n2,330,523 \n$\n2,695 \n0.15\n%\n$\n2,036,613 \n$\n2,370 \n0.16\n%\nManaged investing solutions \n(1)\nFee-based\n$\n613,302 \n$\n1,777 \n0.39\n%\n$\n528,850 \n$\n1,572 \n0.40\n%\nNon-fee-based\n122,920 \n— \n— \n110,191 \n— \n—\nTotal managed investing solutions\n$\n736,222 \n$\n1,777 \n0.32\n%\n$\n639,041 \n$\n1,572 \n0.33\n%\nOther balance-based fees \n(2)\n870,045 \n233 \n0.04\n%\n759,645 \n210 \n0.04\n%\nOther \n(3)\n68 \n55 \nTotal asset management and administration fees\n$\n4,773 \n$\n4,207 \n(1) \nAverage client assets for managed investing solutions may also include the asset balances contained in the mutual fund and/or ETF categories listed above. \n(2) \nIncludes various asset-related fees, such as trust fees, 401(k) recordkeeping fees, and mutual fund clearing fees and other service fees. \n(3)\n Includes miscellaneous service and transaction fees relating to mutual funds and ETFs that are not balance-based.\n(4) \nThe first nine months of 2025 include transfers from other third-party mutual funds and ETFs to Mutual Fund OneSource\n®\n and other NTF funds.\nAsset management and administration fees increased by $197 million, or 13%, and $566 million, or 13%, in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. \nThese increases were primarily a result of continued growth in Schwab money market funds amid the ongoing elevated interest rate environment.\n These increases were also due to growth in fee-based managed investing solutions, Mutual Fund OneSource\n®\n, and Schwab equity and bond funds, ETFs, and CTFs, reflecting the Company’s asset gathering and net inflows into managed investing solutions, as well as year-over-year equity market appreciation.\n- 11 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nThe following tables present a roll forward of client assets for the Schwab money market funds, Schwab equity and bond funds, ETFs, and CTFs, and Mutual Fund OneSource\n® \nand other NTF funds. These funds generated 51% and 50% of the asset management and administration fees earned in the third quarter and first nine months of 2025, respectively, compared with 49% in both the third quarter and first nine months of 2024:\nSchwab Money \nMarket Funds\nSchwab Equity and\nBond Funds, ETFs, and CTFs\nMutual Fund OneSource\n®\n \nand Other NTF funds\nThree Months Ended September 30,\n2025\n2024\n2025\n2024\n2025\n2024\nBalance at beginning of period\n$\n653,473 \n$\n533,586 \n$\n689,355 \n$\n564,002 \n$\n453,919 \n$\n344,813 \nNet inflows (outflows)\n6,253 \n26,829 \n11,176 \n13,238 \n(7,639)\n(6,555)\nNet market gains (losses) and other\n \n6,696 \n1,664 \n45,165 \n37,537 \n27,255 \n19,733 \nBalance at end of period\n$\n666,422 \n$\n562,079 \n$\n745,696 \n$\n614,777 \n$\n473,535 \n$\n357,991 \nNine Months Ended September 30,\nBalance at beginning of period\n$\n596,531 \n$\n476,409 \n$\n627,166 \n$\n506,149 \n$\n347,798 \n$\n306,222 \nNet inflows (outflows)\n50,163 \n69,064 \n36,379 \n29,751 \n(22,489)\n(17,579)\nNet market gains (losses) and other\n (1)\n19,728 \n16,606 \n82,151 \n78,877 \n148,226 \n69,348 \nBalance at end of period\n$\n666,422 \n$\n562,079 \n$\n745,696 \n$\n614,777 \n$\n473,535 \n$\n357,991 \n(1)\n Includes $63.3 billion of transfers from other third-party mutual funds and ETFs to Mutual Fund OneSource\n®\n and other NTF Funds for the nine months ended September 30, 2025.\nTrading Revenue\nThe following tables present trading revenue, client trading activity, and related information:\nThree Months Ended\nSeptember 30,\nPercent\nChange\nNine Months Ended\nSeptember 30,\nPercent\nChange\n2025\n2024\n2025\n2024\nCommissions\n$\n453 \n$\n388 \n17\n%\n$\n1,315 \n$\n1,184 \n11\n%\nOrder flow revenue\nOptions\n299 \n250 \n20\n%\n837 \n740 \n13\n%\nEquities\n191 \n107 \n79\n%\n562 \n326 \n72\n%\nTotal order flow revenue\n490 \n357 \n37\n%\n1,399 \n1,066 \n31\n%\nPrincipal transactions\n52 \n52 \n—\n141 \n141 \n—\nTotal trading revenue\n$\n995 \n$\n797 \n25\n%\n$\n2,855 \n$\n2,391 \n19\n%\nThree Months Ended\nSeptember 30,\nPercent\nChange\nNine Months Ended\nSeptember 30,\nPercent\nChange\n2025\n2024\n2025\n2024\nDATs (in thousands)\n7,421 \n5,697 \n30\n%\n7,461 \n5,711 \n31\n%\nProduct as a percentage of DATs\nEquities\n55\n%\n52\n%\n55\n%\n52\n%\nDerivatives\n22\n%\n21\n%\n21\n%\n22\n%\nETFs\n17\n%\n20\n%\n18\n%\n19\n%\nMutual funds\n5\n%\n6\n%\n5\n%\n6\n%\nFixed income\n1\n%\n1\n%\n1\n%\n1\n%\nNumber of trading days\n63.5 \n63.5 \n— \n185.5 \n187.5 \n(1)\n%\nRevenue per trade \n(1)\n$\n2.11 \n$\n2.20 \n(4)\n%\n$\n2.06 \n$\n2.23 \n(8)\n%\n(1)\n Revenue per trade is calculated as trading revenue divided by the product of DATs multiplied by the number of trading days.\nTrading revenue increased $198 million, or 25%, and $464 million, or 19%, in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024, driven by an increase in order flow and commissions revenue reflecting higher volume. \n- 12 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nBank Deposit Account Fees\nThe Company earns bank deposit account fee revenue from TD Bank USA, National Association and TD Bank, National Association (together, the TD Depository Institutions), in accordance with the Second Amended and Restated Insured Deposit Account Agreement (2023 IDA agreement). These fees are affected by changes in interest rates and the composition of balances designated as fixed- and floating-rate obligation amounts. See Item 1 – Note 10 for additional information.\nThe following table presents bank deposit account fee revenue and related information:\nThree Months Ended\nSeptember 30,\nPercent \nChange\nNine Months Ended\nSeptember 30,\nPercent Change\n2025\n2024\n2025\n2024\nBank deposit account fees\n$\n247 \n$\n152 \n63\n%\n$\n739 \n$\n488 \n51\n%\nAverage bank deposit account balances\n$\n80,030 \n$\n83,099 \n(4)\n%\n$\n82,145 \n$\n87,641 \n(6)\n%\nAverage net yield\n1.21\n%\n0.72\n%\n1.19\n%\n0.73\n%\nPercentage of average BDA balances designated as:\nFixed-rate balances\n77\n%\n87\n%\n78\n%\n88\n%\nFloating-rate balances\n23\n%\n13\n%\n22\n%\n12\n%\nBank deposit account fees increased $95 million, or 63%, and $251 million, or 51%, in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024, primarily due to a decrease in the amount paid to clients as a result of lower interest rates, partially offset by lower average BDA balances. The decrease in average BDA balances in the third quarter and first nine months of 2025 compared to the same periods in 2024 was primarily due to client cash allocation decisions in 2024 in response to elevated short-term market interest rates through most of 2024, as well as the transfer of $3.0 billion of BDA balances to Schwab’s balance sheet in September 2025. Pursuant to the 2023 IDA agreement, after September 10, 2025, Schwab has broader discretion to withdraw balances, subject to certain constraints, as described in Item 1 – Note 10. Transfers of BDA balances to Schwab’s balance sheet result in lower balances upon which bank deposit account fee revenue is earned but provide a source of funding to invest in interest-earning assets or pay down borrowings to increase net interest revenue. \nAverage net yield increased in the third quarter and first nine months of 2025 compared to the same periods in 2024 due to an increase in the average amount of floating-rate BDA balances, which was partially offset by a decrease in the average net yields on fixed-rate and floating-rate BDA balances. The percentages of BDA balances designated as fixed-rate and floating-rate obligation amounts as of September 30, 2025 were 76% and 24%, respectively.\nOther Revenue \nOther revenue includes industry fees, certain service fees, other gains and losses from the sale of assets, and the provision for credit losses on bank loans.\nOther revenue decreased $30 million, or 15%, in the third quarter of 2025 compared to the same period in 2024, primarily due to lower industry fees, partially offset by higher other service fees. Effective May 14, 2025, the SEC decreased the fee rate applicable to most securities transactions to zero from the rate in effect since May 22, 2024. This change resulted in lower industry fees in the third quarter of 2025 compared to the same period in 2024. Other revenue increased $62 million, or 11%, in the first nine months of 2025 compared to the same period in 2024, primarily due to a gain from the sale of an equity investment, higher other service fees, and higher industry fees. Industry fees increased primarily due to higher DATs, partially offset by the decrease in SEC fee rates.\n- 13 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nTotal Expenses Excluding Interest\nThe following table presents a comparison of expenses excluding interest:\nThree Months Ended\nSeptember 30,\nPercent\nChange\nNine Months Ended\nSeptember 30,\nPercent\nChange\n2025\n2024\n2025\n2024\nCompensation and benefits\nSalaries and wages\n$\n952 \n$\n893 \n7\n%\n$\n2,802 \n$\n2,633 \n6\n%\nIncentive compensation\n424 \n384 \n10\n%\n1,187 \n1,100 \n8\n%\nEmployee benefits and other\n277 \n245 \n13\n%\n872 \n777 \n12\n%\nTotal compensation and benefits\n$\n1,653 \n$\n1,522 \n9\n%\n$\n4,861 \n$\n4,510 \n8\n%\nProfessional services\n293 \n256 \n14\n%\n853 \n756 \n13\n%\nOccupancy and equipment\n280 \n271 \n3\n%\n824 \n784 \n5\n%\nAdvertising and market development\n101 \n101 \n—\n305 \n296 \n3\n%\nCommunications\n149 \n147 \n1\n%\n478 \n460 \n4\n%\nDepreciation and amortization\n212 \n231 \n(8)\n%\n644 \n692 \n(7)\n%\nAmortization of acquired intangible assets\n127 \n130 \n(2)\n%\n385 \n389 \n(1)\n%\nRegulatory fees and assessments\n59 \n88 \n(33)\n%\n225 \n309 \n(27)\n%\nOther\n240 \n259 \n(7)\n%\n731 \n694 \n5\n%\nTotal expenses excluding interest\n$\n3,114 \n$\n3,005 \n4\n%\n$\n9,306 \n$\n8,890 \n5\n%\nExpenses as a percentage of total net revenues\nCompensation and benefits\n27\n%\n31\n%\n28\n%\n32\n%\nAdvertising and market development\n2\n%\n2\n%\n2\n%\n2\n%\nFull-time equivalent employees (in thousands)\nAt quarter end\n32.7\n32.1\n2\n%\nAverage\n32.8\n32.3\n2\n%\n32.4\n32.4\n— \nExpenses excluding interest increased $109 million, or 4%, and $416 million, or 5%, in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. Adjusted total expenses, which excludes acquisition and integration-related costs, amortization of acquired intangible assets, and restructuring costs, increased 5% and 6% in the third quarter and first nine months of 2025, respectively, compared to the same periods in 2024. See Non-GAAP Financial Measures for further details and a reconciliation of such measures to GAAP reported results. There were no acquisition and integration-related costs or restructuring costs in the third quarter and first nine months of 2025.\nTotal compensation and benefits expense increased in the third quarter and first nine months of 2025 compared to the same periods in 2024, primarily due to annual merit increases, higher incentive compensation, and higher other employee-related costs. Compensation and benefits included a $34 million benefit in the first nine months of 2024 due to a change in estimated restructuring costs. Compensation and benefits also included acquisition and integration-related costs of $9 million and $44 million in the \nthird\n quarter and first nine months of 2024, respectively.\nProfessional services expense increased in the third quarter and first nine months of 2025 compared to the same periods in 2024, reflecting overall growth of the business and increased utilization of technology and other professional services. Professional services included acquisition and integration-related costs of $3 million and $32 million in the third quarter and first \nnine\n months of 2024, respectively.\nOccupancy and equipment expense increased in the third quarter and first nine months of 2025 compared to the same periods in 2024, primarily driven by higher technology equipment and software costs, as well as building expenses, related to growth of the business, and a benefit related to property taxes reflected in 2024.\nAdvertising and market development expense remained consistent in the third quarter and increased in the first nine months of 2025 compared to the same periods in 2024. In the third quarter of 2025, higher digital advertising costs were largely offset by lower client promotional spending, and the increase in the first nine months of 2025 primarily reflected higher digital advertising costs.\n- 14 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nCommunications expense increased in the third quarter and first nine months of 2025 compared to the same periods in 2024. The increase in the \nthird\n quarter was primarily due to higher proxy-related expenses reflecting growth in the business, partially offset by lower printing and telecommunications expenses. The increase in the year-to-date period primarily reflected higher proxy-related expenses and exchange quotation services, partially offset by lower telecommunications expenses. \nDepreciation and amortization expense decreased in the third quarter and first nine months of 2025 compared to the same periods in 2024, primarily due to finance lease terminations in 2024 and lower depreciation on equipment due to abandonment of certain data centers in 2024 related to the integration of \nAmeritrade Holding LLC (Ameritrade Holding) and its consolidated subsidiaries (collectively, Ameritrade). \nDepreciation and amortization expense included acquisition and integration-related costs of \n$8 million and $13 million in the third quarter and first \nnine\n months of \n2024, respectively\n.\nAmortization of acquired intangible assets was largely consistent in the third quarter and first nine months of 2025 compared to the same periods in 2024.\nRegulatory fees and assessments decreased in the third quarter and first nine months of 2025 compared to the same periods in 2024. The decrease in the third quarter of 2025 was primarily due to a $13 million reduction in the FDIC special assessment coupled with lower FDIC deposit insurance assessments. The decrease in the first nine months of 2025 was primarily due to a $30 million incremental FDIC special assessment in the first nine months of 2024 and the $13 million reduction in the special assessment in the third quarter of 2025, coupled with lower FDIC deposit insurance assessments reflecting a decrease in brokered CDs and a lower assessment base.\nOther expense decreased in the third quarter and increased in the first nine months of 2025 compared to the same periods in 2024. The decrease in the third quarter of 2025 was primarily driven by lower industry fees, partially offset by certain higher costs in 2025 related to growth of the business and increased client trading volume. Effective May 14, 2025, the SEC decreased the fee rate applicable to most securities transactions to zero from the rate in effect since May 22, 2024, resulting in lower industry fees in the third quarter of 2025 compared to the same period in 2024. The increase in the first nine months of 2025 from the same period in 2024 was primarily due to higher industry fees in the first half of the year and certain higher costs resulting from growth of the business and increased trading volume. The increase was also partially offset by a charge recognized in the second quarter of 2024 for the SEC’s industry-wide review of off-channel communications. Other expense included restructuring costs of $13 million in the first nine months of 2024.\nCapital expenditures were $152 million and $135 million in the third quarter of 2025 and 2024, respectively, and $444 million and $349 million in the first nine months of 2025 and 2024, respectively. Capital expenditures increased in the third quarter and first nine months of 2025 compared to the same periods in 2024, primarily due to higher investment in purchased software and telecommunications and other equipment, partially offset by lower internally developed software for the year-to-date period. The completion of certain construction projects resulted in a decrease of building-related capital expenditures during the third quarter of 2025. As a result of higher year-to-date total net revenues and lower spending, we now estimate capital expenditures for full-year 2025 will be on the lower end of our previously disclosed expected range of approximately 3-5% of total net revenues.\nTaxes on Income\nTaxes on income were $663 million and $434 million for the third quarter of 2025 and 2024, respectively, resulting in effective tax rates of 21.9% and 23.6%, respectively. Taxes on income were $1.9 billion and $1.3 billion for the first \nnine\n months of \n2025\n and \n2024\n, respectively, resulting in tax rates of 22.8% and 23.9%, respectively. The decrease in the effective tax rate in the third quarter of 2025 compared to the same period in 2024 was primarily due to a decrease in state taxes and in non-deductible FDIC deposit insurance assessments, partially offset by a decrease in certain tax credits. The decrease in the effective tax rate in the first nine months of 2025 compared to the same period in 2024 was primarily due to a decrease in the state tax rate and in non-deductible FDIC deposit insurance assessments, and an increase in equity compensation tax deduction benefits, partially offset by a decrease in certain tax credits.\n- 15 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nSegment Information\nFinancial information for our segments is presented in the following table \n(1)\n:\nInvestor Services\nAdvisor Services\nTotal\nThree Months Ended September 30,\nPercent Change\n2025\n2024\nPercent Change\n2025\n2024\nPercent Change\n2025\n2024\nNet Revenues\n \n \n \n \n \n \n \n \n \nNet interest revenue\n36\n%\n$\n2,424 \n$\n1,777 \n41\n%\n$\n626 \n$\n445 \n37\n%\n$\n3,050 \n$\n2,222 \nAsset management and administration fees\n14\n%\n1,221 \n1,074 \n12\n%\n452 \n402 \n13\n%\n1,673 \n1,476 \nTrading revenue\n28\n%\n906 \n710 \n2\n%\n89 \n87 \n25\n%\n995 \n797 \nBank deposit account fees\n66\n%\n196 \n118 \n50\n%\n51 \n34 \n63\n%\n247 \n152 \nOther\n(20)\n%\n136 \n169 \n10\n%\n34 \n31 \n(15)\n%\n170 \n200 \nTotal net revenues\n27\n%\n4,883 \n3,848 \n25\n%\n1,252 \n999 \n27\n%\n6,135 \n4,847 \nExpenses Excluding Interest\nCompensation and benefits\n10\n%\n$\n1,284 \n$\n1,169 \n5\n%\n$\n369 \n$\n353 \n9\n%\n$\n1,653 \n$\n1,522 \nProfessional services\n16\n%\n235 \n202 \n7\n%\n58 \n54 \n14\n%\n293 \n256 \nOccupancy and equipment\n4\n%\n220 \n211 \n—\n60 \n60 \n3\n%\n280 \n271 \nAdvertising and market development\n2\n%\n60 \n59 \n(2)\n%\n41 \n42 \n—\n101 \n101 \nCommunications\n2\n%\n105 \n103 \n—\n44 \n44 \n1\n%\n149 \n147 \nDepreciation and amortization\n(8)\n%\n161 \n175 \n(9)\n%\n51 \n56 \n(8)\n%\n212 \n231 \nAmortization of acquired intangible assets\n(1)\n%\n104 \n105 \n(8)\n%\n23 \n25 \n(2)\n%\n127 \n130 \nRegulatory fees and assessments\n(27)\n%\n51 \n70 \n(56)\n%\n8 \n18 \n(33)\n%\n59 \n88 \nOther\n(6)\n%\n207 \n221 \n(13)\n%\n33 \n38 \n(7)\n%\n240 \n259 \nTotal expenses excluding interest\n5\n%\n2,427 \n2,315 \n—\n687 \n690 \n4\n%\n3,114 \n3,005 \nIncome before taxes on income\n60\n%\n$\n2,456 \n$\n1,533 \n83\n%\n$\n565 \n$\n309 \n64\n%\n$\n3,021 \n$\n1,842 \nNet New Client Assets (in billions) \n(2)\n42\n%\n$\n52.7 \n$\n37.2 \n52\n%\n$\n81.7 \n$\n53.6 \n48\n%\n$\n134.4 \n$\n90.8 \nNine Months Ended September 30,\nNet Revenues\nNet interest revenue\n29\n%\n$\n6,826 \n$\n5,279 \n31\n%\n$\n1,752 \n$\n1,334 \n30\n%\n$\n8,578 \n$\n6,613 \nAsset management and administration fees\n14\n%\n3,479 \n3,050 \n12\n%\n1,294 \n1,157 \n13\n%\n4,773 \n4,207 \nTrading revenue\n21\n%\n2,563 \n2,115 \n6\n%\n292 \n276 \n19\n%\n2,855 \n2,391 \nBank deposit account fees\n54\n%\n581 \n378 \n44\n%\n158 \n110 \n51\n%\n739 \n488 \nOther\n7\n%\n514 \n479 \n27\n%\n126 \n99 \n11\n%\n640 \n578 \nTotal net revenues\n24\n%\n13,963 \n11,301 \n22\n%\n3,622 \n2,976 \n23\n%\n17,585 \n14,277 \nExpenses Excluding Interest\nCompensation and benefits\n8\n%\n$\n3,760 \n$\n3,480 \n7\n%\n$\n1,101 \n$\n1,030 \n8\n%\n$\n4,861 \n$\n4,510 \nProfessional services\n13\n%\n680 \n602 \n12\n%\n173 \n154 \n13\n%\n853 \n756 \nOccupancy and equipment\n6\n%\n647 \n610 \n2\n%\n177 \n174 \n5\n%\n824 \n784 \nAdvertising and market development\n2\n%\n194 \n191 \n6\n%\n111 \n105 \n3\n%\n305 \n296 \nCommunications\n5\n%\n338 \n321 \n1\n%\n140 \n139 \n4\n%\n478 \n460 \nDepreciation and amortization\n(11)\n%\n488 \n546 \n7\n%\n156 \n146 \n(7)\n%\n644 \n692 \nAmortization of acquired intangible assets\n(7)\n%\n314 \n339 \n42\n%\n71 \n50 \n(1)\n%\n385 \n389 \nRegulatory fees and assessments\n(24)\n%\n183 \n240 \n(39)\n%\n42 \n69 \n(27)\n%\n225 \n309 \nOther\n6\n%\n618 \n583 \n2\n%\n113 \n111 \n5\n%\n731 \n694 \nTotal expenses excluding interest\n4\n%\n7,222 \n6,912 \n5\n%\n2,084 \n1,978 \n5\n%\n9,306 \n8,890 \nIncome before taxes on income\n54\n%\n$\n6,741 \n$\n4,389 \n54\n%\n$\n1,538 \n$\n998 \n54\n%\n$\n8,279 \n$\n5,387 \nNet New Client Assets (in billions) \n(2)\n34\n%\n$\n153.4 \n$\n114.9 \n35\n%\n$\n187.0 \n$\n138.3 \n34\n%\n$\n340.4 \n$\n253.2 \n(1) \nIn connection with certain changes in Schwab’s organizational management structure, in the fourth quarter of 2024, the Retirement Business Services business unit was transferred from the Advisor Services segment to the Investor Services segment. Accordingly, amounts related to the Retirement Business Services business unit are included within Investor Services for the third quarter and nine months ended September 30, 2025, and prior-year amounts have been recast to reflect this new basis of segmentation.\n(2) \nIn the third quarter and first nine months of 2025, Investor Services includes net outflows of $3.1 billion and $15.1 billion, respectively, from off-platform brokered CDs issued by CSB. In the third quarter and first nine months of 2024, Investor Services includes net outflows of $4.4 billion and $9.1 billion, respectively, from off-platform brokered CDs issued by CSB and an outflow of $0.1 billion from a large international relationship. Also, in the first nine months of 2024, Investor Services includes an inflow of $10.3 billion from a mutual fund clearing services client.\n- 16 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nSegment Net Revenues\nInvestor Services and Advisor Services total net revenues increased by 27% and 25%, respectively, in the third quarter of 2025, and increased by 24% and 22%, respectively, in the first nine months of 2025, compared to the same periods in 2024. Changes in Schwab’s net revenues were driven by similar factors for both segments in the third quarter and first nine months of 2025 compared to the same periods in 2024. Net interest revenue increased primarily due to reductions in bank supplemental funding, lower average rates paid on funding sources, and growth of bank and margin lending balances, partially offset by lower yields on interest-earning assets. Asset management and administration fees increased primarily as a result of higher balances in money market funds, Schwab equity and bond funds, ETFs, and CTFs, and Mutual Fund OneSource\n®\n, and, additionally for Investor Services, managed investing solutions. Trading revenue increased primarily due to higher order flow revenue and commission revenue reflecting higher volume.\n \nBank deposit account fees increased primarily due to improved net yields partially offset by lower average BDA balances. Other revenue increased for both segments in the first nine months of 2025, and in the third quarter of 2025 decreased for Investor Services while slightly increasing for Advisor Services. Both segments saw growth in other revenue due to higher industry fees in the first half of 2025, higher other service fees, and a recognized gain on the sale of an equity investment, offset by lower industry fees in the third quarter of 2025.\nSegment Expenses Excluding Interest\nInvestor Services total expenses excluding interest increased by 5% and Advisor Services total expenses excluding interest remained consistent in the third quarter of 2025 compared to the same period in 2024. Investor Services and Advisor Services total expenses excluding interest increased by 4% and 5%, respectively, in the first nine months of 2025 compared to the same periods in 2024. Changes in expenses were driven by similar factors for the two segments in the third quarter and first nine months of 2025 compared to the same periods in 2024. Compensation and benefits expense increased primarily due to annual merit increases, higher incentive compensation, and higher employee-related costs. Professional services expense increased due to \noverall growth of the business and increased utilization of technology and other professional services\n.\n Occupancy and equipment expense increased in the first \nnine\n months of \n2025\n primarily due to higher technology equipment and software costs related to growth of the business and a property\n tax benefit reflected in 2024, while in the third quarter of 2025, both segments were relatively flat. Regulatory fees and assessments decreased during the third quarter and first nine months of 2025 compared to the same periods in 2024, primarily due to lower FDIC assessments. \nRISK MANAGEMENT\n \nSchwab’s business activities expose it to a variety of risks, including operational, compliance, credit, market, and liquidity risks. The Company has a comprehensive risk management program to identify and manage these risks and their associated potential for financial and reputational impact. \nFor a discussion of our risk management programs, see Part II – Item 7 – Risk Management in the 2024 Form 10-K. \nMarket Risk\nMarket risk is the potential for changes in earnings or the value of financial instruments held by Schwab as a result of fluctuations in interest rates, equity prices, or market conditions. Schwab is exposed to market risk primarily from changes in interest rates within our interest-earning assets relative to changes in the costs of funding sources that finance these assets.\nTo manage interest rate risk, we have established policies and procedures, which include setting limits on net interest revenue risk and EVE risk. To remain within these limits, we manage the maturity, repricing, and cash flow characteristics of the investment portfolios. Management monitors established guidelines to stay within the Company’s risk appetite. The Company utilizes interest rate swap derivative instruments to assist with managing interest rate risk, the effects of which are incorporated into the Company’s net interest revenue and EVE analyses. For further information on our interest rate risk management strategies utilizing interest rate swaps, see Item 1 – Note 11.\nOur measurement of interest rate risk involves assumptions that are inherently uncertain and, as a result, cannot precisely estimate the impact of changes in interest rates on net interest revenue, bank deposit account fees, or EVE. Actual results may differ from simulated results due to balance growth or decline and the timing, magnitude, and frequency of interest rate changes, as well as changes in market conditions and management strategies, including changes in asset and liability mix. Financial instruments are also subject to the risk that valuations will be negatively affected by changes in demand and the underlying market for a financial instrument. \n- 17 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nWe are indirectly exposed to option, futures, and equity market fluctuations in connection with client option and futures accounts, securities collateralizing margin loans to brokerage customers, and client securities loaned out as part of the brokerage securities lending activities. Equity market valuations may also affect the level of brokerage client trading activity, margin borrowing, and overall client engagement with Schwab. Additionally, we earn mutual fund and ETF service fees and asset management fees based upon daily balances of certain client assets. Fluctuations in these client asset balances caused by changes in equity valuations directly impact the amount of fee revenue we earn. Our market risk related to financial instruments held for trading is not material.\nNet Interest Revenue Simulation\nFor our net interest revenue sensitivity analysis, we use net interest revenue simulation modeling techniques to evaluate and manage the effect of changing interest rates. The simulations include all balance sheet interest rate-sensitive assets and liabilities, and include derivative instruments. Key assumptions include the projection of interest rate scenarios with rate floors, rates and balances of non-maturity client cash held on the balance sheet, prepayment speeds of mortgage-related investments, repricing of financial instruments, and reinvestment of matured or paid-down securities and loans. We use both proprietary and independent third-party models to simulate net interest revenue sensitivity and related analyses. Fixed income analytical vendors provide term structure models, prepayment speed models for mortgage-backed securities and mortgage loans, and cash flow projections based on interest income, contractual maturities, and prepayments. The Company’s net interest revenue sensitivity analyses utilize gradual parallel increases/decreases in interest rates over a twelve month period, though we also regularly simulate the effects of non-parallel shifts and instantaneous shifts of interest rates on net interest revenue.\nNet interest revenue is affected by various factors, such as the distribution and composition of interest-earning assets and interest-bearing liabilities, the spread between yields earned on interest-earning assets and rates paid on interest-bearing liabilities, which may reprice at different times or by different amounts, and the spread between short- and long-term interest rates. Interest-earning assets include investment securities, margin loans, bank loans, cash and investments segregated, and cash and cash equivalents. These assets are sensitive to changes in interest rates and changes in prepayment levels that tend to increase in a declining rate environment and decrease in a rising rate environment. Because we establish the rates paid on certain brokerage client cash balances and bank deposits and the rates charged on certain margin and bank loans, and control the composition of our investment securities, we have some ability to manage our net interest spread, depending on competitive factors and market conditions. When we have liquidity needs that exceed our primary sources of funding, the Company has needed to utilize higher-cost funding sources, which can reduce net interest margin and net interest revenue.\nHigher prevailing short-term interest rates generally improve yields on shorter duration interest-earning assets. During periods of rapidly rising interest rates, clients tend to reallocate cash out of sweep products into higher-yielding, off-balance sheet, fixed income investments and money market funds within Schwab’s product offerings. This can result in lower interest-earning assets and/or may require supplemental funding with higher funding costs, which therefore tend to constrain net interest revenue when interest rates are moving rapidly higher. A decline in short-term interest rates could negatively impact the yield on the Company’s investment and loan portfolios to a greater degree than any offsetting reduction in interest expense from funding sources, compressing net interest margin. \nNet interest revenue sensitivity analyses assume both statically and dynamically-sized balance sheet composition. Statically-sized balance sheet modeling assumes the asset and liability structure of the consolidated balance sheet would not be changed as a result of the simulated changes in interest rates. While this approach is useful to isolate the impact of changes in interest rates on a statically-sized asset and liability structure, it does not capture changes to client cash allocations. We therefore also conduct dynamically-sized balance sheet compositions as a function of interest rates. Dynamic net interest revenue simulations assume runoff of bank deposit and payables to brokerage client balances is supplemented with wholesale borrowing when needed to fund assets through the simulation horizon. We also conduct similar simulations on EVE to capture the impact of client cash allocation changes on our balance sheet. As we actively manage the consolidated balance sheet and interest rate exposure, we have taken and would typically seek to take steps to manage additional interest rate exposure that could result from changes in the interest rate environment. \n- 18 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nThe following table assumes a statically-sized balance sheet with simulated changes to net interest revenue over the next twelve months beginning September 30, 2025 and December 31, 2024 of a gradual increase or decrease in market interest rates relative to prevailing market rates at the end of each reporting period: \nSeptember 30, 2025\nDecember 31, 2024\nIncrease of 200 basis points\n8.5%\n8.6%\nIncrease of 100 basis points\n4.6%\n4.6%\nIncrease of 50 basis points\n2.3%\n2.5%\nDecrease of 50 basis points\n(2.1)%\n(2.3)%\nDecrease of 100 basis points\n(4.2)%\n(4.6)%\nDecrease of 200 basis points\n(8.2)%\n(9.3)%\nThe Company’s simulated incremental increases and decreases in market interest rates had a smaller impact on net interest revenue as of September 30, 2025 compared to December 31, 2024, primarily due to the use of cash flow hedges related to Schwab’s PALs beginning in the second quarter of 2025, and lower cash balances.\nEffective Duration\nEffective duration measures price sensitivity relative to a change in prevailing interest rates, taking account of amortizing cash flows and prepayment optionality for mortgage-related securities and loans. Duration is measured in years and commonly interpreted as the average timing of principal and interest cash flows. We seek to manage the Company’s asset duration in relation to management’s estimate of the Company’s liability duration. The Company’s liability duration is impacted by the composition of funding sources, and typically decreases in periods of rising market interest rates and increases in periods of declining market interest rates. The Company also utilizes derivative hedging instruments such as interest rate swaps in managing its asset and liability duration.\nThe following table presents the Company’s estimated effective durations, which reflect anticipated future payments, by category:\nSeptember 30, 2025\nSeptember 30, 2024\nIn years\nEstimated effective duration, exclusive of derivatives:\nConsolidated total assets\n2.0\n2.3\nAFS investment securities portfolio\n2.5\n2.3\nAFS and HTM investment securities portfolio\n4.0\n3.9\nPledged asset lines \n(1)\n0.1\n—\nLong-term debt CSC Senior Notes\n2.9\n3.4\nEstimated effective duration, inclusive of derivatives \n(2)\n:\nConsolidated total assets\n2.0\n2.3\nAFS investment securities portfolio\n2.0\n2.0\nAFS and HTM investment securities portfolio\n3.8\n3.8\nPledged asset lines \n(1)\n1.3\n—\nLong-term debt CSC Senior Notes\n1.6\n3.4\n(1)\n The duration of PALs was less than 0.1 years at September 30, 2024.\n(2)\n See Item 1 – Note 11 for additional discussion of the Company’s derivatives.\nAFS and HTM securities comprised approximately 43% and 51% of the Company’s consolidated total assets as of September 30, 2025 and 2024, respectively. The estimated effective duration of the remaining balance sheet assets, excluding the effect of hedging, in aggregate was less than one year as of both September 30, 2025 and 2024. \nEconomic Value of Equity Simulation\nManagement also uses EVE simulations to measure interest rate risk. EVE sensitivity measures the long-term impact of interest rate changes on the net present value of assets and liabilities, and includes the impact of derivative instruments. While EVE does not have a direct accounting relationship, the measure aims to capture a theoretical value of assets and liabilities under a variety of interest rate environments. EVE is calculated by subjecting the balance sheet to hypothetical instantaneous shifts in the level of interest rates. This analysis is highly dependent upon asset and liability assumptions based on historical and certain \n- 19 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nexpected behaviors. Key assumptions in our EVE calculation include projection of interest rate scenarios with rate floors, prepayment speeds of mortgage-related investments, term structure models of interest rates, behavior of non-maturity client cash held on the balance sheet, and pricing assumptions. We use both proprietary and independent third-party models to simulate EVE sensitivity and related analyses. We develop and maintain client credits and deposits run-off models internally based on historical experience and prevailing client cash realignment behaviors. We rely on third-party models for interest rate term structure modeling, prepayment speed modeling for mortgage-backed securities and mortgage loans, and cash flow projections based on interest income, and contractual maturities. \nSchwab’s EVE profile is characterized by a more stable asset duration relative to liabilities in both higher and lower interest rate environments. Currently, the EVE exposure to rates increasing or decreasing in a similar magnitude shows that there is greater exposure to rates decreasing. \nBank Deposit Account Fees Simulation\nConsistent with the presentation on the consolidated statement of income, the sensitivity of bank deposit account fee revenue to interest rate changes is assessed separately from the net interest revenue simulation described above. As of September 30, 2025 and December 31, 2024, simulated changes in bank deposit account fee revenue from gradual changes in market interest rates relative to prevailing market rates, under the interest rate scenarios described above for net interest revenue, did not have a significant impact on the Company’s total net revenues. \nOur net interest revenue, EVE, and bank deposit account fee revenue simulations reflect the assumption of non-negative investment yields.\nLiquidity Risk\nLiquidity risk is the potential that Schwab will be unable to sell assets or meet cash flow obligations when they come due without incurring unacceptable losses. \nDue to its role as a source of financial strength, CSC’s liquidity needs are primarily driven by the liquidity and capital needs of: CS&Co, our principal broker-dealer subsidiary; the capital needs of the banking subsidiaries; principal and interest due on corporate debt; and dividend payments on CSC’s preferred and common stock. The liquidity needs of our broker-dealer subsidiary are primarily driven by client activity, including trading and margin lending activities, and capital expenditures. The capital needs of the banking subsidiaries are primarily driven by client deposit levels and other borrowings. We have established liquidity policies to support the successful execution of business strategies, while ensuring ongoing and sufficient liquidity to meet operational needs and satisfy applicable regulatory requirements under both normal and stressed conditions. We seek to maintain client confidence in the balance sheet and the safety of client assets by maintaining liquidity and diversity of funding sources to allow the Company to meet its obligations. To this end, we have established limits and contingency funding plans to support liquidity levels during both business as usual and stressed conditions.\nWe employ a variety of metrics to monitor and manage liquidity. We conduct regular liquidity stress testing to develop a view of liquidity risk exposures and to ensure our ability to maintain sufficient liquidity during market-related or company-specific liquidity stress events. Liquidity sources are also tested periodically and results are reported to the Financial Risk Oversight Committee. A number of early warning indicators are monitored to help identify emerging liquidity stresses in the market or within the organization and are reviewed with management periodically. \nFunding Sources\nSchwab’s primary source of funds is cash generated by client activity which includes bank deposits and cash balances in client brokerage accounts. These funds are used to purchase investment securities and extend loans to clients. Other sources of funds may include cash flows from operations, maturities and sales of investment securities, repayments on loans, securities lending of assets held in client brokerage accounts, FHLB borrowings, borrowings under repurchase agreements with external financial institutions and the Fixed Income Clearing Corporation (FICC), issuance of CDs, cash provided by securities issuances by CSC in the capital markets, and other facilities described below.\nTo meet daily funding needs, we maintain liquidity in the form of overnight cash deposits and short-term investments. For unanticipated liquidity needs, we also maintain a buffer of highly liquid investments, including U.S. Treasury securities.\n- 20 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nOur clients’ bank deposits and brokerage cash balances primarily originate from our 38.0 million active brokerage accounts. More than 80% of our bank deposits qualified for FDIC insurance as of September 30, 2025. Our clients’ allocation of cash held on our balance sheet as bank deposits or payables to brokerage clients is sensitive to interest rate levels, with clients typically increasing their utilization of investment cash solutions, such as purchased money market funds and certain fixed income products when those yields are higher than those of cash sweep features.\nAs a participant in the financial services industry, Schwab relies on access to external financing in the normal course of business. Schwab’s use of external debt facilities may arise from timing differences between cash flow requirements, such as client cash outflows, cash flows from operations, payments on interest-earning assets, movements of cash to meet regulatory brokerage client cash segregation requirements, and general corporate purposes. Rollover risk is the risk that we will not be able to refinance or payoff borrowings as they mature. We maintain policies and procedures necessary to access funding, and test borrowing procedures on a periodic basis. We manage rollover risk on borrowings, taking into account expected principal paydowns on our investment and loan portfolios along with expected deposit flows.\nThe following table describes certain external debt facilities available at September 30, 2025:\nDescription\nBorrower\nOutstanding\nAvailable\nMaturity of Amounts Outstanding\nWeighted-Average Interest Rate on Amounts Outstanding\nFHLB secured credit facilities\nBanking subsidiaries\n$\n850 \n$\n75,342 \n(1)\nFebruary 2026\n4.11%\nFederal Reserve discount window\nBanking subsidiaries\n— \n29,706 \n(1)\nN/A\n—\nRepurchase agreements\nBanking subsidiaries, CSC\n3,995 \n— \n(2)\nOctober 2025 - November 2025\n4.45%\nUnsecured uncommitted lines of credit with\n  various external banks\nCSC, CS&Co\n— \n1,692 \nN/A\n—\nUnsecured commercial paper \nCSC\n800 \n4,200 \n(3)\nOctober 2025 - November 2025\n4.52%\nSecured uncommitted lines of credit with \n  various external banks\nCS&Co\n1,750 \n— \n(4)\nDecember 2025 - January 2026\n4.51%\n(1) \nAmounts shown as available from the FHLB and Federal Reserve facilities represent remaining capacity based on assets pledged as of September 30, 2025. Incremental borrowing capacity may be made available by pledging additional assets, subject to applicable facility terms. See below and Item 1 – Note 9 for additional information.\n(2) \nSecured borrowing capacity is made available based on our borrower’s ability to provide collateral deemed acceptable by each respective counterparty. See below and Item 1 – Note 12 for additional information.\n(3)\n Outstanding balance of unsecured commercial paper as of September 30, 2025 represents the gross par value before discount of $4 million.\n(4)\n Secured borrowing capacity is made available based on CS&Co’s ability to provide acceptable collateral to the lenders as determined by the credit agreements.\nN/A Not applicable.\nAvailable borrowing capacity from the FHLB and Federal Reserve facilities maintained by our banking subsidiaries is dependent on the value of assets pledged and the terms of the borrowing arrangements. As of September 30, 2025, the Company had additional investment securities with a par value of approximately $99 billion, or a fair value of approximately $93 billion, available to be pledged to obtain additional capacity. Additional details regarding availability and use of these facilities is described below. \nAmounts available under secured credit facilities with the FHLB are dependent on the value of our First Mortgages, home equity lines of credit (HELOCs), and the value of certain of our investment securities that are pledged as collateral. These credit facilities are also available as backup financing in the event the outflow of client cash from the banking subsidiaries’ respective balance sheets is greater than maturities and paydowns on investment securities and bank loans. CSC’s banking subsidiaries must each maintain positive tangible capital, as defined by the Federal Housing Finance Agency, in order to place new draws upon these credit facilities, and the Company manages capital with consideration of minimum tangible capital ratios at our banking subsidiaries. Tangible capital pursuant to the requirements of the FHLB borrowing facilities for our banking subsidiaries is common equity less goodwill and intangible assets. \nOur banking subsidiaries also have access to short-term secured funding through the Federal Reserve discount window. Amounts available under the Federal Reserve discount window are dependent on the value of certain investment securities that are pledged as collateral. Our banking subsidiaries may also engage with external financial institutions and the FICC in repurchase agreements collateralized by investment securities as another source of short-term liquidity. \n- 21 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nIn addition, our banking subsidiaries are counterparties to the Standing Repo Facility with the Federal Reserve Bank of New York; other than de minimis tests performed to satisfy the Federal Reserve Bank of New York’s testing requirements, this facility was not used during the first nine months of 2025 and there were no amounts outstanding at September 30, 2025. CSC maintains standing bilateral repurchase agreements with external banks. Other than de minimis tests, these facilities were not used during the first nine months of 2025 and there were no amounts outstanding under these facilities at September 30, 2025. \nCSC’s ratings for Commercial Paper Notes were P1 by Moody’s Investor Service (Moody’s), A2 by Standard & Poor’s Rating Group (Standard & Poor’s), and F1 by Fitch Ratings, Inc. (Fitch) at September 30, 2025.\nCSC has a universal automatic shelf registration statement on file with the SEC, which enables it to issue debt, equity, and other securities. \nCS&Co maintains unsecured uncommitted bank credit lines with a group of banks as a source of short-term liquidity, which can also be accessed by CSC. CS&Co also maintains secured uncommitted lines of credit, under which CS&Co may borrow on a short-term basis and pledge either client margin securities or firm securities as collateral, based on the terms of the agreements. Additionally, CS&Co is able to lend eligible securities held in client brokerage accounts in exchange for cash collateral as a source of short-term liquidity. As of September 30, 2025, liabilities for securities loaned totaled $21.7 billion and are included in payables to brokers, dealers, and clearing organizations on the condensed consolidated balance sheet. As of September 30, 2025, $18.7 billion of securities loaned had overnight and continuous remaining contractual maturities; $3.0 billion of securities loaned had contractual maturities of 35 - 95 days and had a weighted-average interest rate of 4.46%. See Item 1 – Note 12 for additional information on securities lending activities.\nCSB issues brokered CDs as a supplemental funding source. The following table provides information about brokered CDs issued by CSB and outstanding as of September 30, 2025:\nAmount Outstanding\nMaturity\nWeighted-Average Interest Rate\nBrokered CDs\n$\n9,936 \nOctober 2025 - January 2026\n4.21%\nCash Flow Activity\nThe Company’s cash and cash equivalents decreased $11.5 billion from year-end 2024 to $30.6 billion at September 30, 2025; cash and cash equivalents, including amounts restricted, decreased $10.6 billion from year-end 2024 to $54.9 billion at September 30, 2025. These decreases reflected a reduction of bank supplemental funding of $35.1 billion, maturities of long-term debt of $2.2 billion, repurchases of common and nonvoting common stock for $4.6 billion, and the redemption of Series G preferred stock for $2.5 billion. Bank deposits decreased during the first nine months of 2025 by $20.1 billion primarily due to a decrease of $17.8 billion in brokered CDs and a $1.4 billion decrease in deposits swept from brokerage accounts. The Company reduced FHLB borrowings and other short-term borrowings by a net total of $15.3 billion. Partially offsetting the repayment of borrowings and other financing activities, net investing cash inflows were $25.7 billion, driven by net inflows of $34.1 billion from our AFS and HTM securities partially offset by net outflows of $8.4 billion due to strong growth in bank loans; net cash inflows from operations totaled $10.1 billion.\nLiquidity Coverage Ratio\nSchwab is subject to the full LCR rule, which requires the Company to hold high quality liquid assets (HQLA) in an amount equal to at least 100% of the Company’s projected net cash outflows over a prospective 30-calendar-day period of acute liquidity stress, calculated on each business day. See Part I – Item 1 – Business – Regulation in the 2024 Form 10-K for additional information. The Company was in compliance with the LCR rule at September 30, 2025, and the table below presents information about our average daily LCR:\nAverage for the Three Months Ended\nSeptember 30, 2025\nJune 30, 2025\nTotal eligible HQLA\n$\n53,281 \n$\n54,707 \nNet cash outflows\n39,814 \n38,361 \nLCR\n134\n%\n143\n%\nTo support growth in margin loan balances at our broker-dealer subsidiary while meeting our LCR requirements, the Company may issue commercial paper, draw on secured lines of credit, or engage in securities lending, in addition to capital markets \n- 22 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nissuances. In managing compliance with our LCR requirements, the broker-dealer subsidiary may also retain client cash balances rather than sweeping such balances to our banking subsidiaries.\nNet Stable Funding Ratio\nSchwab is subject to disclosure requirements under the NSFR rule, which requires the semi-annual public disclosure of its NSFR levels. The NSFR rule stipulates that the Company’s available stable funding (ASF) must be at least 100% of the Company’s required stable funding (RSF). ASF is calculated by assessing the stability of the Company’s funding sources and RSF is calculated by evaluating the characteristics of the Company’s assets, derivatives, and off-balance-sheet exposures. The Company was in compliance with the NSFR rule at September 30, 2025.\nLong-Term Borrowings\nThe Company’s long-term debt is primarily comprised of Senior Notes and totaled $20.2 billion and $22.4 billion at September 30, 2025 and December 31, 2024, respectively.\nThe following table provides information about our Senior Notes outstanding at September 30, 2025:\nSeptember 30, 2025\nPar \nOutstanding\nMaturity\nWeighted-Average\nInterest Rate \n(1)\nMoody’s\nStandard\n& Poor’s\nFitch\nCSC Senior Notes\n$\n20,119 \n2026 - 2034\n3.66%\nA2\nA-\nA\nAmeritrade Holding Senior Notes\n81 \n2027 - 2029\n3.13%\nA2\nA-\n—\n(1)\n \nWeighted-average interest rates presented here exclude the impact of derivatives. See Item 1 – Note 11 for information on the Company’s hedging of Senior Notes. \nNew Debt Issuances\nThere were no new debt issuances of senior unsecured obligations in the first nine months of 2025.\nEquity Issuances and Redemptions\nThere were no new issuances of preferred stock in the first nine months of 2025.\nOn June 2, 2025, the Company redeemed all of the 24,580 outstanding shares of its fixed-rate reset non-cumulative perpetual preferred stock, Series G, and the corresponding 2,457,964 depositary shares. The depositary shares were redeemed at a redemption price of $1,000 per depositary share for a total of $2.5 billion.\nSchwab enters into guarantees and other similar arrangements in the ordinary course of business. For information on these arrangements, see Item 1 – Notes 6, 7, 9, 10, and 12. Pursuant to the 2023 IDA agreement, certain brokerage accounts are required to be swept off-balance sheet to the TD Depository Institutions. See Item 1 – Note 10 for additional information.\nAdditional information regarding our sources and uses of liquidity and management of liquidity risk is included in Part II – Item 7 – Risk Management – Liquidity Risk in our 2024 Form 10-K. See also Item 1 – Condensed Consolidated Statements of Cash Flows, Item 1 – Note 8 for the Company’s bank deposits, Item 1 – Note 9 for the Company’s debt and borrowing facilities, Item 1 – Note 12 for the Company’s securities lending activities, and Item 1 – Note 14 for the Company’s equity outstanding balances and activity.\nCAPITAL MANAGEMENT\n \nSchwab seeks to manage capital to a level and composition sufficient to support execution of our business strategy, inclusive of balance sheet growth, financial support to our subsidiaries, sustained access to the capital markets, and regulatory capital requirements. Schwab also seeks to return excess capital to stockholders. We may return excess capital through dividends, repurchases of common shares, preferred stock redemptions, and repurchases of our preferred stock represented by depositary shares. Schwab’s primary sources of capital are funds generated by the operations of subsidiaries and securities issuances by CSC in the capital markets. To ensure that Schwab has sufficient capital to absorb unanticipated losses or declines in asset values, we have adopted a policy to remain well capitalized even in stressed scenarios.\n- 23 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nRegulatory Capital Requirements \nCSC and certain subsidiaries, including our banking and broker-dealer subsidiaries, are subject to various capital requirements set by regulatory agencies as discussed in further detail in Part II – Item 7 – Capital Management of the 2024 Form 10-K and in Item 1 – Note 17. As of September 30, 2025, CSC and our banking subsidiaries are considered well capitalized, and CS&Co is in compliance with its net capital requirements.\nThe following table details the capital ratios for CSC (consolidated) and CSB:\nSeptember 30, 2025\nDecember 31, 2024\nCSC\nCSB\nCSC\nCSB\nTotal stockholders’ equity\n$\n49,384 \n$\n21,328 \n$\n48,375 \n$\n19,700 \nLess:\nPreferred stock\n6,763 \n— \n9,191 \n— \nCommon Equity Tier 1 Capital before regulatory adjustments\n$\n42,621 \n$\n21,328 \n$\n39,184 \n$\n19,700 \nLess:\nGoodwill, net of associated deferred tax liabilities\n$\n11,720 \n$\n13 \n$\n11,746 \n$\n13 \nOther intangible assets, net of associated deferred tax liabilities\n5,917 \n— \n6,232 \n— \nDeferred tax assets, net of valuation allowances and deferred tax liabilities\n50 \n41 \n50 \n41 \nAOCI adjustment \n(1)\n(11,794)\n(10,240)\n(14,839)\n(12,938)\nCommon Equity Tier 1 Capital\n$\n36,728 \n$\n31,514 \n$\n35,995 \n$\n32,584 \nTier 1 Capital\n$\n43,491 \n$\n31,514 \n$\n45,186 \n$\n32,584 \nTotal Capital\n43,552 \n31,537 \n45,218 \n32,606 \nRisk-Weighted Assets\n111,898 \n77,218 \n113,648 \n78,134 \nAverage Assets with regulatory adjustments\n447,094 \n253,874 \n458,119 \n280,701 \nTotal Leverage Exposure\n450,445 \n256,117 \n461,200 \n282,629 \nCommon Equity Tier 1 Capital/Risk-Weighted Assets\n32.8\n%\n40.8\n%\n31.7\n%\n41.7\n%\nTier 1 Capital/Risk-Weighted Assets\n38.9\n%\n40.8\n%\n39.8\n%\n41.7\n%\nTotal Capital/Risk-Weighted Assets\n38.9\n%\n40.8\n%\n39.8\n%\n41.7\n%\nTier 1 Leverage Ratio\n9.7\n%\n12.4\n%\n9.9\n%\n11.6\n%\nSupplementary Leverage Ratio\n9.7\n%\n12.3\n%\n9.8\n%\n11.5\n%\n(1)\n Changes in market interest rates can result in unrealized gains or losses on AFS securities, which are included in AOCI. As a Category III banking organization, CSC has elected to exclude most components of AOCI from regulatory capital.\nThe Company’s consolidated Tier 1 Leverage Ratio was 9.7% at September 30, 2025, down slightly from 9.8% at June 30, 2025 and 9.9% at year-end 2024. These changes reflect returns of excess capital, partially offset by organic growth from net income and lower average assets in the third quarter and first nine months of 2025. The Company repurchased $2.7 billion of common stock in the third quarter and $4.6 billion total voting and nonvoting common stock in the first nine months of 2025. The Company also increased its common dividend by 8% to $.27 per share in the first quarter and redeemed its Series G preferred stock for $2.5 billion in the second quarter of 2025. CSB’s Tier 1 Leverage Ratio increased from 12.2% at June 30, 2025 and 11.6% at year-end 2024, ending the third quarter of 2025 at 12.4%, primarily as a result of lower total assets as well as net income during the third quarter and first nine months of 2025.\nAs a supplemental measure of capital, the Company utilizes an adjusted Tier 1 Leverage Ratio, which is a non-GAAP financial measure that includes AOCI in the ratio. The primary component of AOCI for Schwab is unrealized gains and losses on our AFS investment securities portfolio and on securities transferred from AFS to the HTM category. \nThe Company maintains a long-term operating objective for its consolidated adjusted Tier 1 Leverage Ratio of 6.75% - 7.00%. As of September 30, 2025, our adjusted Tier 1 Leverage Ratio was 7.3% for CSC (consolidated) and 8.7% for CSB (see Non-GAAP Financial Measures for further details and a reconciliation of such measures to GAAP reported results). \nThe Company continues to manage its capital as described above and in Part II – Item 7 – Capital Management of the 2024 Form 10-K. In evaluating returns of excess capital to stockholders, we will consider the amount of bank supplemental funding outstanding, and may choose to utilize the liquidity we would otherwise use for capital returns to repay outstanding bank supplemental funding balances.\n- 24 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nDividends\nOn January 29, 2025, the Board of Directors of the Company declared a two cent, or 8%, increase in the quarterly cash dividend to $.27 per common share.\nCash dividends paid and per share amounts for the first nine months of 2025 and 2024 are as follows:\n2025\n2024\nNine Months Ended September 30,\nCash Paid\nPer Share \nAmount\nCash Paid\nPer Share \nAmount\nCommon and Nonvoting Common Stock\n (1)\n$\n1,477 \n$\n.81 \n$\n1,379 \n$\n.75 \nPreferred Stock:\nSeries D \n(2)\n33 \n44.64 \n33 \n44.64 \nSeries F \n(3)\n12 \n2,500.00 \n12 \n2,500.00 \nSeries G \n(4)\n66 \n2,687.50 \n99 \n4,031.25 \nSeries H \n(2)\n67 \n3,000.00 \n67 \n3,000.00 \nSeries I \n(2)\n62 \n3,000.00 \n62 \n3,000.00 \nSeries J \n(2)\n20 \n33.39 \n20 \n33.39 \nSeries K \n(2)\n28 \n3,750.00 \n28 \n3,750.00 \n(1) \nThe Company had no nonvoting common stock outstanding as of the record date for the Company’s 2025 dividends and accordingly, no dividends were paid on nonvoting common stock during the nine months ended September 30, 2025.\n(2)\n Dividends paid quarterly.\n(3)\n Dividends paid semi-annually until December 1, 2027 and quarterly thereafter.\n(4)\n Series G was redeemed on June 2, 2025. Prior to redemption, dividends were paid quarterly. The final dividend was paid on June 2, 2025. \nShare Repurchases\nOn February 12, 2025, TD Group US Holdings LLC, an affiliate of TD Bank, completed a secondary public offering of the Company’s common shares through which TD Group US Holdings LLC sold 133.8 million shares of the Company’s common stock and 31.7 million shares of the Company’s nonvoting common stock, which automatically converted into common stock, for an aggregate amount of $13.1 billion. The Company did not receive any of the proceeds from the sale of shares.\nConcurrent with the completion of the secondary offering, and pursuant to a repurchase agreement dated February 9, 2025, the Company repurchased directly from TD Group US Holdings LLC its remaining 19.2 million shares of nonvoting common stock at a price of $77.982 per share for an aggregate repurchase amount of $1.5 billion, which settled on February 12, 2025. The shares of nonvoting common stock automatically converted into common stock upon repurchase and are now held in treasury stock, reducing the number of shares outstanding. These shares were purchased under CSC’s $15.0 billion share repurchase authorization.\nThrough the completion of the secondary offering and the Company’s repurchase of nonvoting common stock, TD Bank disposed of all of its common shares of CSC and the Company has no remaining nonvoting common stock outstanding.\nCSC repurchased an additional 3.9 million shares of its common stock for $351 million during the three months ended June 30, 2025. These shares were purchased under CSC’s $15.0 billion share repurchase authorization. On July 24, 2025, CSC publicly announced that its Board of Directors terminated the $15.0 billion share repurchase authorization and replaced it with a new authorization to repurchase up to $20.0 billion of common stock. The new share repurchase authorization does not have an expiration date. During the three months ended September 30, 2025, CSC repurchased 28.9 million shares of its common stock under the new authorization for $2.7 billion. As of September 30, 2025, approximately $17.3 billion remained on the new authorization. \nThere were no repurchases of CSC’s common stock during the three and nine months ended September 30, 2024.\nCommon stock repurchases, net of issuances, are subject to a nondeductible 1% excise tax which is recognized as a direct and incremental cost associated with these transactions. The tax is recorded as part of the cost basis of the treasury stock repurchased, resulting in no impact to the condensed consolidated statements of income.\nSee Item 1 – Note 14 for additional information.\n- 25 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nOTHER\nForeign Exposure \nAt September 30, 2025, Schwab had exposure to non-sovereign financial and non-financial institutions in foreign countries. At September 30, 2025, the fair value of these holdings totaled $15.0 billion, with the top three exposures being to issuers and counterparties domiciled in France at $8.4 billion, the United Kingdom at $5.1 billion, and Japan at $600 million. At December 31, 2024, the fair value of these holdings totaled $10.6 billion, with the top three exposures being to issuers and counterparties domiciled in France at $5.1 billion, the United Kingdom at $2.1 billion, and Canada at $889 million. In addition, Schwab had outstanding margin loans to foreign residents of $4.2 billion and $3.5 billion at September 30, 2025 and December 31, 2024, respectively.\nCRITICAL ACCOUNTING ESTIMATES\nCertain of our accounting policies that involve a higher degree of judgment and complexity are discussed in Part II – Item 7 – Critical Accounting Estimates in the 2024 Form 10-K. There have been no changes to critical accounting estimates during the first nine months of 2025.\nNON-GAAP FINANCIAL MEASURES\nIn addition to disclosing financial results in accordance with generally accepted accounting principles in the U.S. (GAAP), Management’s Discussion and Analysis of Financial Condition and Results of Operations contain references to the non-GAAP financial measures described below. We believe these non-GAAP financial measures provide useful supplemental information about the financial performance of the Company, and facilitate meaningful comparison of Schwab’s results in the current period to both historic and future results. These non-GAAP measures should not be considered a substitute for, or superior to, financial measures calculated in accordance with GAAP, and may not be comparable to non-GAAP financial measures presented by other companies. \n- 26 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nSchwab’s use of non-GAAP measures is reflective of certain adjustments made to GAAP financial measures as described below. \nNon-GAAP Adjustment or Measure\nDefinition\nUsefulness to Investors and Uses by Management\nAcquisition and integration-related costs, amortization of acquired intangible assets, and restructuring costs\nSchwab adjusts certain GAAP financial measures to exclude the impact of acquisition and integration-related costs incurred as a result of the Company’s acquisitions, amortization of acquired intangible assets, restructuring costs, and, where applicable, the income tax effect of these expenses. \nAdjustments made to exclude amortization of acquired intangible assets are reflective of all acquired intangible assets, which were recorded as part of purchase accounting. These acquired intangible assets contribute to the Company’s revenue generation. Amortization of acquired intangible assets will continue in future periods over their remaining useful lives.\nWe exclude acquisition and integration-related costs, amortization of acquired intangible assets, and restructuring costs for the purpose of calculating certain non-GAAP measures because we believe doing so provides additional transparency of Schwab’s ongoing operations, and is useful in both evaluating the operating performance of the business and facilitating comparison of results with prior and future periods. \nCosts related to acquisition and integration or restructuring fluctuate based on the timing of acquisitions, integration and restructuring activities, thereby limiting comparability of results among periods, and are not representative of the costs of running the Company’s ongoing business. Amortization of acquired intangible assets is excluded because management does not believe it is indicative of the Company’s underlying operating performance.\nReturn on tangible common equity\nReturn on tangible common equity represents annualized adjusted net income available to common stockholders as a percentage of average tangible common equity. Tangible common equity represents common equity less goodwill, acquired intangible assets – net, and related deferred tax liabilities.\nAcquisitions typically result in the recognition of significant amounts of goodwill and acquired intangible assets. We believe return on tangible common equity may be useful to investors as a supplemental measure to facilitate assessing capital efficiency and returns relative to the composition of Schwab’s balance sheet. \nAdjusted Tier 1 Leverage Ratio\nAdjusted Tier 1 Leverage Ratio represents the Tier 1 Leverage Ratio as prescribed by bank regulatory guidance for the consolidated company and for CSB, adjusted to reflect the inclusion of AOCI in the ratio.\nInclusion of the impacts of AOCI in the Company’s Tier 1 Leverage Ratio provides additional information regarding the Company’s current capital position. We believe Adjusted Tier 1 Leverage Ratio may be useful to investors as a supplemental measure of the Company’s capital levels. \nThe Company also uses adjusted diluted EPS and return on tangible common equity as components of performance criteria for employee bonus and certain executive management incentive compensation arrangements. The Compensation Committee of CSC’s Board of Directors maintains discretion in evaluating performance against these criteria. Additionally, the Company uses adjusted Tier 1 Leverage Ratio in managing capital, including its use of the measure as its long-term operating objective.\nThe following tables present reconciliations of GAAP measures to non-GAAP measures:\nThree Months Ended\nSeptember 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nTotal expenses excluding interest (GAAP)\n$\n3,114 \n$\n3,005 \n$\n9,306 \n$\n8,890 \nAmortization of acquired intangible assets\n(127)\n(130)\n(385)\n(389)\nAcquisition and integration-related costs \n(1)\n— \n(23)\n— \n(97)\nRestructuring costs \n(2)\n— \n— \n— \n18 \nAdjusted total expenses (non-GAAP)\n$\n2,987 \n$\n2,852 \n$\n8,921 \n$\n8,422 \n(1)\n There were no acquisition and integration-related costs for the three and nine months ended September 30, 2025. Acquisition and integration-related costs for the three and nine months ended September 30, 2024 primarily consist of $9 million and $44 million of compensation and benefits, $3 million and $32 million of professional services, and $8 million and $13 million of depreciation and amortization. \n(2)\n There were no restructuring costs for the three and nine months ended September 30, 2025 and three months ended September 30, 2024. Restructuring costs for the nine months ended September 30, 2024 reflect a benefit due to a change in estimate of $34 million in compensation and benefits, offset by $3 million of occupancy and equipment expense and $13 million of other expense.\n- 27 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nAmount\nDiluted \nEPS\nAmount\nDiluted \nEPS\nAmount\nDiluted \nEPS\nAmount\nDiluted \nEPS\nNet income available to common stockholders (GAAP), \n  Earnings per common share — diluted (GAAP)\n$\n2,277 \n$\n1.26 \n$\n1,299 \n$\n.71 \n$\n6,050 \n$\n3.33 \n$\n3,761 \n$\n2.05 \nAmortization of acquired intangible assets\n127 \n.07 \n130 \n.07 \n385 \n.21 \n389 \n.21 \nAcquisition and integration-related costs\n— \n— \n23 \n.01 \n— \n— \n97 \n.05 \nRestructuring costs\n— \n— \n— \n— \n— \n— \n(18)\n(.01)\nIncome tax effects \n(1)\n(29)\n(.02)\n(36)\n(.02)\n(92)\n(.05)\n(111)\n(.05)\nAdjusted net income available to common stockholders \n  (non-GAAP), Adjusted diluted EPS (non-GAAP)\n$\n2,375 \n$\n1.31 \n$\n1,416 \n$\n.77 \n$\n6,343 \n$\n3.49 \n$\n4,118 \n$\n2.25 \n(1)\n The income tax effects of the non-GAAP adjustments are determined using an effective tax rate reflecting the exclusion of non-deductible acquisition costs and are used to present the acquisition and integration-related costs, amortization of acquired intangible assets, and restructuring costs on an after-tax basis.\nThree Months Ended\nSeptember 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nReturn on average common stockholders’ equity (GAAP)\n21\n%\n14\n%\n20\n%\n14\n%\nAverage common stockholders’ equity\n$\n42,655 \n$\n36,393 \n$\n40,903 \n$\n34,895 \nLess: Average goodwill\n(11,951)\n(11,951)\n(11,951)\n(11,951)\nLess: Average acquired intangible assets — net\n(7,423)\n(7,938)\n(7,552)\n(8,067)\nPlus: Average deferred tax liabilities related to goodwill and \n  acquired intangible assets — net\n1,695 \n1,735 \n1,695 \n1,747 \nAverage tangible common equity\n$\n24,976 \n$\n18,239 \n$\n23,095 \n$\n16,624 \nAdjusted net income available to common stockholders \n(1)\n$\n2,375 \n$\n1,416 \n$\n6,343 \n$\n4,118 \nReturn on tangible common equity (non-GAAP)\n38\n%\n31\n%\n37\n%\n33\n%\n(1)\n See table above for the reconciliation of net income available to common stockholders to adjusted net income available to common stockholders (non-GAAP).\nSeptember 30, 2025\nDecember 31, 2024\nCSC\nCSB\nCSC\nCSB\nTier 1 Leverage Ratio (GAAP)\n9.7\n%\n12.4\n%\n9.9\n%\n11.6\n%\nTier 1 Capital\n$\n43,491 \n$\n31,514 \n$\n45,186 \n$\n32,584 \nPlus: AOCI adjustment\n(11,826)\n(10,272)\n(14,839)\n(12,938)\nAdjusted Tier 1 Capital\n31,665 \n21,242 \n30,347 \n19,646 \nAverage assets with regulatory adjustments\n447,094 \n253,874 \n458,119 \n280,701 \nPlus: AOCI adjustment\n(12,176)\n(10,613)\n(14,831)\n(13,037)\nAdjusted average assets with regulatory adjustments\n$\n434,918 \n$\n243,261 \n$\n443,288 \n$\n267,664 \nAdjusted Tier 1 Leverage Ratio (non-GAAP)\n7.3\n%\n8.7\n%\n6.8\n%\n7.3\n%"
}