{
  "item1": "General Corporate Overview Charles Schwab Corporation (CSC) savings loan holding company. CSC engages, through its subsidiaries (collectively referred Schwab Company), wealth management, securities brokerage, banking, asset management, custody, financial advisory services. December 31, 2024, Schwab $10.10 trillion client assets, 36.5 million active brokerage accounts, 5.4 million workplace plan participant accounts, 2.0 million banking accounts. Principal business subsidiaries CSC include following: Charles Schwab & Co., Inc.",
  "item7": "Calculated principal amount loan divided value collateral securing loan. Money borrowed against value certain stocks, bonds, mutual funds client portfolio. borrowed money can used purchase additional securities meet short-term financial needs. Master netting arrangement: agreement between two counterparties multiple contracts each other provides net settlement all contracts through single cash payment event default termination any one contract.",
  "item2": "Principal transactions Bank deposit account fees Nine Months Ended September 30, Net interest revenue Net interest revenue Asset management administration fees Mutual funds, ETFs, CTFs Managed investing solutions Asset management administration fees Principal transactions Bank deposit account fees CHARLES SCHWAB CORPORATION Management’s Discussion Analysis Financial Condition Results Operations (Tabular Amounts Millions, Except Ratios, Noted) Net Interest Revenue Revenue interest-earning assets affected various factors, such composition assets, prevailing interest rates spreads time origination purchase, changes interest rates cash cash equivalents, floating-rate securities loans, changes prepayment levels mortgage-backed other asset-backed securities loans. Schwab establishes rates paid client-related liabilities, management expects will generally adjust rates paid these liabilities some fraction any movement short-term rates. Interest expense long-term debt, FHLB borrowings, other short-term borrowings, other funding sources impacted market interest rates time borrowing changes interest rates floating-rate liabilities. Net interest revenue reflects impacts derivatives used manage interest rate risk."
}