{
  "source_file": "schw-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.     Business\nGeneral Corporate Overview\nThe Charles Schwab Corporation (CSC) is a savings and loan holding company. CSC engages, through its subsidiaries (collectively referred to as Schwab or the Company), in wealth management, securities brokerage, banking, asset management, custody, and financial advisory services. At December 31, 2024, Schwab had $10.10 trillion in client assets, 36.5 million active brokerage accounts, 5.4 million workplace plan participant accounts, and 2.0 million banking accounts.\nPrincipal business subsidiaries of CSC include the following:\n•\nCharles Schwab & Co., Inc. (CS&Co), incorporated in 1971, a securities broker-dealer;\n•\nCharles Schwab Bank, SSB (CSB), our principal banking entity; and\n•\nCharles Schwab Investment Management, Inc. (CSIM), the investment advisor for Schwab’s proprietary mutual funds (Schwab Funds\n®\n) and for Schwab’s exchange-traded funds (Schwab ETFs).\nIn May 2024, the Company completed the final client account conversions to CS&Co from the Ameritrade broker-dealers, TD Ameritrade, Inc. and TD Ameritrade Clearing, Inc. (TDAC). Accordingly, these entities are no longer principal business subsidiaries. See Business Acquisition below for additional information regarding the integration. \nUnless otherwise indicated, the terms “Schwab,” “the Company,” “we,” “us,” or “our” mean CSC together with its consolidated subsidiaries.\nSchwab provides financial services to individuals and institutional clients through two segments – Investor Services and Advisor Services. The Investor Services segment provides retail brokerage, investment advisory, and banking and trust services to individual investors, and retirement plan and business services, as well as other corporate brokerage services, to businesses and their employees. The Advisor Services segment provides custodial, trading, banking and trust, and support services to independent registered investment advisors (RIAs), independent retirement advisors, and recordkeepers. These services are further described in the segment discussion below.\nBusiness Strategy and Competitive Environment \nSchwab was founded on the belief that all Americans deserve access to a better investing experience. Although much has changed in the intervening years, our purpose remains clear – to champion every client’s goals with passion and integrity. Guided by this purpose and our vision of creating the most trusted leader in investment services, management has adopted a strategy described as “Through Clients’ Eyes.”\nThis strategy emphasizes placing clients’ perspectives, needs, and desires at the forefront. Because investing plays a fundamental role in building financial security, we strive to deliver a better investing experience for our clients – individual investors and the people and institutions who serve them – by disrupting longstanding industry practices on their behalf and providing superior service. We also aim to offer a broad range of products and solutions to meet client needs with a focus on transparency, value, and trust. In addition, management works to couple Schwab’s scale and resources with ongoing expense discipline to keep costs low and ensure that products and solutions are affordable as well as responsive to client needs. In combination, these are the key elements of our “no trade-offs” approach to serving investors. We believe that following this strategy is the best way to maximize our market valuation and stockholder returns over time.\nManagement estimates that investable wealth in the United States (U.S.) (consisting of assets in defined contribution, retail wealth management and brokerage, and registered investment advisor channels, along with bank deposits) currently exceeds $75 trillion, which means the Company’s $10.10 trillion in client assets leaves substantial opportunity for growth. Our strategy is based on the principle that developing trusted relationships will translate into more assets from both new and existing clients, ultimately driving more revenue, and along with expense discipline and thoughtful capital management, will generate earnings growth and build long-term stockholder value.\nWithin Investor Services, our competition in serving individual investors spans brokerage, wealth management, and asset management firms, as well as banks, trust companies, financial technology companies, and retirement service providers. In the Advisor Services arena, we compete with institutional custodians, wirehouses, regional and independent broker-dealers, banks, and trust companies. \n- 1 -\nTHE CHARLES SCHWAB CORPORATION\nAcross both segments, our key competitive advantages are:\n•\nScale and Size of the Business – As one of the largest investment services firms in the U.S., we are able to spread operating costs and amortize new investments over a large base of clients, and harness the resources to evolve capabilities to meet client needs.\n•\nOperating Efficiency – Coupled with scale, our operating efficiency and sharing of infrastructure across different businesses creates a cost advantage that enables us to competitively price products and services while profitably serving clients of various sizes across multiple channels.\n•\nOperating Structure – Providing bank, wealth, and asset management services to broker-dealer clients helps serve a wider array of needs, thereby deepening relationships, enhancing the stability of client assets, and enabling diversified revenue streams. \n•\nBrand and Corporate Reputation – In an industry dependent on trust, Schwab’s reputation and brand across multiple constituents enable us to attract clients and employees while credibly introducing new products to the market.\n•\nService Culture – Delivering a great client experience earns the trust and loyalty of clients and increases the likelihood that those clients will refer others.\n•\nWillingness to Disrupt – Management’s willingness to challenge the status quo, including our own business practices, to benefit clients fosters innovation and continuous improvement, which helps to attract more clients and assets.\nBusiness Acquisition\nAcquisition of Ameritrade \nThe Company acquired TD Ameritrade Holding Corporation, now Ameritrade Holding LLC (Ameritrade Holding) and its consolidated subsidiaries (collectively referred to as Ameritrade), effective October 6, 2020. The Company’s integration of Ameritrade is now complete. Through the integration, the Company generally adopted Schwab platforms and systems, though we’ve leveraged certain material advantages in Ameritrade’s platforms, including our comprehensive integration of Ameritrade’s thinkorswim\n®\n and thinkpipes\n®\n trading platforms, education, and tools into our offerings for retail and RIA clients. In 2023, we launched Schwab Trading Powered by Ameritrade™, an enhanced trading experience made possible by the combination of the thinkorswim trading platform with Schwab’s trading capabilities on Schwab.com and Schwab Mobile. We have also incorporated Ameritrade Institutional’s customizable portfolio rebalancing solution, iRebal\n®\n, as part of our offering for independent advisor clients.\nOver the course of five client transition groups in 2023 and 2024, we converted approximately $1.9 trillion in client assets across more than 17 million client accounts, including 7,000 RIAs, from Ameritrade to Schwab. In May 2024, the Company completed the conversion of the final Ameritrade client transition group to the Schwab platform. Following the completion of the final client account conversions to CS&Co, TD Ameritrade, Inc., and TDAC submitted Uniform Requests for Broker-Dealer Withdrawal (BDW) to terminate their registration as broker-dealers with the SEC, the Financial Industry Regulatory Authority, Inc. (FINRA), and other applicable regulatory organizations, and as of December 31, 2024, TD Ameritrade, Inc. and TDAC are no longer registered as broker-dealers with the SEC and FINRA. \nFor additional information on our integration of Ameritrade, see Part II – Item 7 – Management’s Discussion and Analysis of Financial Condition and Results of Operations (Item 7) – Overview and Part II – Item 8 – Financial Statements and Supplementary Data (Item 8) – Note 16.\nIDA Agreement\nConcurrently with the execution of the Agreement and Plan of Merger, dated as of November 24, 2019, as amended (the Merger Agreement) to acquire Ameritrade, CSC entered into an amended and restated insured deposit account agreement with TD Bank USA, National Association and TD Bank, National Association (together, the TD Depository Institutions) (the 2019 IDA agreement), which became effective October 6, 2020. On May 4, 2023, the Company executed the Second Amended and Restated Insured Deposit Account Agreement (2023 IDA agreement) with the TD Depository Institutions that replaced and superseded the 2019 IDA agreement. Consistent with the 2019 IDA agreement, in accordance with the 2023 IDA agreement, cash held in eligible brokerage client accounts is swept off-balance sheet to deposit accounts at the TD Depository Institutions. Schwab provides recordkeeping and support services to the TD Depository Institutions with respect to the deposit accounts for which Schwab receives an aggregate monthly fee. Under the 2023 IDA agreement, the service fee on client cash deposits held at the TD Depository Institutions remains at 15 basis points, as it was in the 2019 IDA agreement. \nFor additional information on the 2023 IDA agreement, see Part II – Item 7 – Capital Management and Item 8 – Note 15.\n- 2 -\nTHE CHARLES SCHWAB CORPORATION\nProducts and Services\nSchwab offers a broad range of products and services through intuitive end-to-end solutions, including robust digital capabilities, to address our clients’ varying investment and financial needs. Examples of these offerings include the following:\n•\nBrokerage – an array of full-feature brokerage accounts with equity and fixed income trading, margin lending, options trading, futures and forex trading, and cash management capabilities including certificates of deposit;\n•\nMutual funds – third-party mutual funds through the Mutual Fund Marketplace\n®\n, including no-transaction-fee (NTF) mutual funds through the Mutual Fund OneSource\n®\n service, which also includes proprietary mutual funds, plus mutual fund trading and clearing services to broker-dealers;\n•\nExchange-traded funds (ETFs) – an extensive offering of ETFs, including both proprietary and third-party ETFs; \n•\nManaged investing solutions – managed portfolios of both proprietary and third-party mutual funds and ETFs, separately managed accounts, customized personal advice for tailored portfolios, specialized planning, and full-time portfolio management;\n•\nAlternative investments – access to a variety of third-party alternative investments, such as private equity and real estate on Schwab’s alternative investment platforms – Schwab Alternative Investment OneSource\n®\n and Schwab Alternative Investment Marketplace;\n•\nBanking – checking and savings accounts, first lien residential real estate mortgage loans (First Mortgages), home equity lines of credit (HELOCs), and pledged asset lines (PALs); and\n•\nTrust – trust custody services, personal trust reporting services, and administrative trustee services.\nThese investing products and services are made available through two business segments – Investor Services and Advisor Services. Schwab’s major sources of revenues are generated by both of the reportable segments, based on their respective levels of client assets and activity. Revenue is attributable to a reportable segment based on which segment has the primary responsibility for serving the client. The accounting policies of the reportable segments are the same as those described in Part II – Item 8 – Note 2. \nInvestor Services\nCharles Schwab initially founded the Company 50 years ago to provide individual investors with access to the financial markets at a highly competitive cost. The Company has expanded offerings over time in response to client needs, aiming to provide a compelling and often disruptive solution in the marketplace. The Investor Services segment includes the following business units: Retail Investor; Workplace Financial Services, which includes Retirement Plan Services, Retirement Business Services (formerly part of Advisor Services), Stock Plan Services, and Designated Brokerage Services; Mutual Fund Clearing Services; and Off-Platform Sales. \nThrough the Retail Investor business unit, we offer individual investors access to a broad set of products, tools, education, trading, and advisory solutions. We provide advice and guidance through various relationship models. And we offer award-winning and 24/7 service to all our clients, regardless of asset levels, via a multi-channel service delivery model, which includes online, mobile, telephone, and branch support.\nWe believe in the power of investing and the importance of planning in helping clients achieve their financial goals. At the core of our offer is our broad set of relationship models that help personalize the investing journey for our clients and offer them the choice of where, when, and how they do business with us. Financial Consultants, Active Trader Financial Consultants, and Wealth Consultants in Schwab’s branches and regional centers focus on building client relationships. We also have a range of roles to support clients with a broad set of specialized needs, including financial planning, managed investing, trading, trust, equity compensation, and lending. Additionally, we have teams focused on supporting the advice and education needs of all our clients and corporate plan participants irrespective of asset levels at Schwab. To better meet the differentiated needs of our more affluent clients, we offer Schwab Private Client Services™ for clients with $1 million – $10 million and Schwab Private Wealth Services™ for clients with $10 million or more in total assets. Clients enrolled in these offerings have access to a dedicated relationship and service team, specialists, expedited processing, pricing discounts and product access.\nOur advisory solutions span a broad range of discretionary and non-discretionary choices, with minimum investments starting as low as $5,000, making it accessible to a broad set of investors. Our premier advisory solution, Schwab Wealth Advisory™, features a personal advice relationship with a dedicated Wealth Advisor, supported by a team of wealth management professionals who provide individualized service, financial planning, a customized investment strategy developed in collaboration with the client, and ongoing guidance and execution. We offer referrals to independent RIAs in the Schwab Advisor Network\n®\n for clients seeking personalized portfolio management, financial planning, and wealth management solutions. We provide investors access to professional investment management in a diversified account that is invested exclusively in either \n- 3 -\nTHE CHARLES SCHWAB CORPORATION\nmutual funds or ETFs through the Schwab Managed Portfolios™ and the Windhaven Investment Management\n®\n Strategies, or equity securities and ETFs through the ThomasPartners\n®\n Investment Management Strategies. Through Wasmer Schroeder™ Strategies, more than 20 fixed income strategies and separately managed account offerings are available to retail clients, including two positive impact strategies, a multi-sector income strategy, and ultra-short-term U.S. Treasury ladder strategies. We also refer investors who want to utilize a specific third-party money manager to direct a portion of their investment assets to the Schwab Managed Account\n™\n program. Schwab Personalized Indexing\n®\n allows clients to own individual stocks that reflect the characteristics of an index in a professionally managed solution, enabling greater customization and tax efficiency. Schwab Intelligent Portfolios\n®\n is available for clients who are looking to have their assets professionally managed via a fully automated online investment advisory service. Schwab Intelligent Portfolios Premium\n®\n, a hybrid advisory service, offers clients an advisory service which combines our robo-advice technology with unlimited guidance provided by a C\nERTIFIED\n F\nINANCIAL\n P\nLANNER\n™\n to make financial and investment planning more accessible to investors. Schwab Intelligent Income\n®\n is a low-cost solution designed to offer a simple, modern way to generate income from existing investment portfolios.\nFurther, given our belief in the importance of financial planning, we offer a broad set of planning capabilities addressing a variety of planning needs. Our solutions include simple, free digital retirement calculators, our complimentary digital Schwab Plan\n®\n available to all Schwab clients, as well as more complex planning solutions that are delivered by a Schwab representative who takes into account a client’s personal and financial goals to build a tailored financial plan.\nTo meet the specific needs of trading clients, Schwab offers integrated web-, mobile-, and software-based trading platforms, real-time market data, access to an extensive set of tradeable products, premium research, and multi-channel access, as well as sophisticated account and trade management features, risk management tools, and dedicated service support – all at highly competitive pricing. In addition to equities, ETFs, and 24/5 trading on select securities, qualified clients can trade options, futures, and forex. In 2023, we introduced Schwab Trading Powered by Ameritrade™, which brings together the best of Schwab and Ameritrade’s trading platforms, comprehensive education, and specialized service. \nSchwab’s international business offers clients outside the U.S. the ability to invest in U.S. markets. For clients living inside the U.S., it offers multicurrency and foreign exchange trading. For all clients, it offers trading in foreign stocks. In addition, Schwab serves both foreign investors and U.S. clients with preferred language needs who wish to trade or invest in U.S. dollar-based securities.\nWe also offer clients a range of self-service education and support tools, providing quick and efficient access to a broad lineup of information, research, tools, and administrative services, which clients can access according to their needs. Schwab Coaching delivers online and in-person workshops as well as live and on-demand webcasts. In addition, we provide educational content including articles, videos, podcasts, and interactive courses covering a broad range of financial topics designed to support investors of all experience levels. Additionally, we provide various online research and analysis tools that are designed to help clients achieve better investment outcomes. As an example of analysis tools available to clients, Schwab Equity Ratings\n®\n is a quantitative model-based stock rating system that provides all clients with ratings on approximately 3,000 stocks, assigning each equity a single grade: A, B, C, D, or F. Schwab Equity Ratings International\n®\n, an international ranking methodology, covers stocks of approximately 4,000 foreign companies. \nAnother example of expanding access to investing includes Schwab Stock Slices\n®\n, a service which enables investors to purchase a single stock slice, or up to 30 different stock slices at once, from the Standard & Poor’s\n®\n 500 Index (S&P 500\n®\n),\n \ncommission-free through our online channels. We also offer Schwab Investing Themes\n®\n, a thematic investing offer that uses proprietary research and technology to identify trends, opportunities, and relevant companies and group them into themes in which clients can invest in just a few clicks. The Schwab Trading Activity Index™ is a proprietary, behavior-based index created by Schwab, designed to indicate the sentiment of retail investors’ portfolios. It measures what investors are doing and how they are actually positioned in the markets.\nWorkplace Financial Services includes Retirement Plan Services, Retirement Business Services, Stock Plan Services, and Designated Brokerage Services. Retirement Plan Services offers a bundled retirement plan product for a range of plan types that provides retirement plan sponsors with extensive investment options, trustee or custodial services, and plan participant-level recordkeeping. Retirement plan design features, which increase plan efficiency and achieve plan sponsor goals, are also offered, including automatic enrollment, automatic fund mapping at conversion, and automatic contribution increases. In addition to an open architecture investment platform, we offer a managed investing service to help plan participants work toward their retirement goals. Individuals investing for retirement through 401(k) plans can take advantage of bundled offerings of multiple investment choices, education, third-party advice, and an integrated brokerage window. \nBeginning in 2024, the Investor Services segment includes the Retirement Business Services business unit within Workplace Financial Services. Retirement Business Services provides trust, custody, brokerage, and software services to independent \n- 4 -\nTHE CHARLES SCHWAB CORPORATION\nretirement plan advisors and independent recordkeepers. Through Retirement Business Services, retirement plan assets are held at Charles Schwab Trust Bank (Trust Bank) or trusteed by a separate, independent trustee, or through brokerage accounts at CS&Co. Retirement Business Services also offers the Schwab Personal Choice Retirement Account\n®\n, a self-directed brokerage offering for retirement plans. The Company and independent retirement plan providers work together to serve plan sponsors, combining the consulting and administrative expertise of the administrator with our investment, technology, brokerage, trust, and custodial services.\nStock Plan Services offers equity compensation stock plan administrators full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, stock appreciation rights, and a full range of participant support services that includes education and investing services to individual equity plan participants. Specialized services for executive transactions and reporting, corporate actions, grant acceptance tracking, and other services are offered to stock plan administrators to meet the needs of administering the reporting and compliance aspects of an equity compensation plan. Designated Brokerage Services supports employers’ needs for employee account surveillance (trading and reporting) through a consultative and best practices approach. Comprehensive single-custodian solutions combine technology with experienced service team members to help compliance professionals manage risk. Single-custodian solutions provide Schwab account trading data via an outbound direct data feed to industry regulated companies’ proprietary compliance solutions or third-party compliance monitoring systems. \nLastly, we also offer Mutual Fund Clearing Services and Off-Platform Sales. Mutual Fund Clearing Services provides open-end mutual fund trading, settlement, and related transactional services to banks, brokerage firms, and trust companies. Off-Platform Sales offers proprietary mutual funds, ETFs, and collective trust funds (CTFs) outside the Company and not on the Schwab platform. They are included within the Investor Services segment given their leveraging of the products and services offered to individual investors. \nAdvisor Services\nMore than thirty years ago, Schwab supported a small group of entrepreneurial advisors who challenged the industry by creating independent firms. Through the Advisor Services segment, Schwab has become one of the largest providers of custodial, trading, banking, and support services to RIAs and their clients. Management believes that we can maintain our competitive position primarily through the efforts of our sales, support, technology, and business consulting teams, which are dedicated to helping RIAs grow, compete, and succeed in serving their clients. In addition to focusing on superior service, we utilize technology to provide RIAs with a highly-developed, scalable platform for administering their clients’ assets easily and efficiently. Advisor Services sponsors and hosts a variety of national, regional, local, and virtual events designed to help RIAs of all sizes and complexities identify and implement better ways to expand and efficiently manage their practices.\nRIAs who custody client accounts at Schwab may use proprietary software that provides them with up-to-date client account information as well as trading capabilities. The Advisor Services website is the core platform for RIAs to conduct daily business activities online with Schwab, including viewing and managing client account information and accessing news and market information. The website provides account servicing capabilities for RIAs, including account opening, money movement, transfer of assets, trading, checking status, and communicating with our service team. The site provides multi-year archiving of statements, trade confirms, and tax reports, along with document search capabilities. We also provide access to integrations with third-party platforms, which support a variety of advisor needs including client relationship management, portfolio management systems, trade order management, and financial planning. As an example, we offer Schwab Advisor Portfolio Connect\n®\n, a simplified portfolio management solution that is available free of charge to advisors to manage Schwab accounts. It delivers core capabilities and features through an intuitive modern experience, without the need to download and reconcile data.\nThe Advisor Services website also provides interactive tools, educational content, and thought leadership for advisors turning independent. We offer a variety of services to help RIAs grow and manage their practices, including business, technology, and operations consulting on a range of topics critical to an RIA’s success, as well as an annual RIA benchmarking study to help firms understand key business metrics relative to peers. We also offer an array of services to help advisors establish their own independent practices through a robust prospect consulting offer. To support them throughout their transition, we offer access to business start-up and transition consultants, technology engineers, and dedicated service teams.\nSchwab provides extensive educational materials, programs, and events to RIAs seeking to expand their knowledge of industry issues and trends, as well as sharpen their individual expertise and practice management skills. We conduct industry research on an ongoing basis, and hold a series of events and conferences every year to discuss topics of interest to RIAs, including business strategies and best practices. Schwab sponsors and hosts the annual IMPACT\n®\n conference, which provides a national forum for the Company, RIAs, and other industry participants to gather and share information and insights, as well as a multitude of smaller events across the country each year.\n- 5 -\nTHE CHARLES SCHWAB CORPORATION\nRIAs and their clients have access to our broad range of products and services, including individual securities, mutual funds, ETFs, fixed income products, managed accounts, cash products, bank lending, and trust services. By functioning as the custodian, Schwab earns revenue associated with the underlying client assets, predominantly through net interest revenue and asset management and administration fees. In this capacity, we do not charge the RIA or end client a custody fee. \nAs part of our integration of Ameritrade, we have added some of the best features from Ameritrade into our ongoing offerings. The Company’s thinkpipes\n®\n trading platform offers real-time charting and efficient trading and allocation, and iRebal\n®\n provides customizable portfolio rebalancing – both now part of our ongoing offering for RIA clients.\nSources of Net Revenues\nSchwab’s largest sources of net revenues are net interest revenue, asset management and administration fees, trading revenue, and bank deposit account fees. These revenue streams are supported by the combination of our bank, broker-dealer, and asset management operating subsidiaries, each of which brings specific capabilities that enable us to provide clients with the products and services they are seeking. \nNet interest revenue is the difference between interest generated on interest-earning assets and interest paid on funding sources. Schwab’s primary funding source for interest-earning assets is uninvested client cash balances held on our balance sheet as part of clients’ overall relationship with the Company. Schwab’s interest-earning assets are primarily comprised of high-quality fixed income securities, margin loans, and bank loans.\nAsset management and administration fees are primarily earned from proprietary money market mutual funds, proprietary and third-party mutual funds and ETFs, and fee-based advisory solutions.\nTrading revenue includes commissions earned for executing trades for clients in certain individual equities, options, futures, fixed income securities, and certain third-party mutual funds and ETFs; order flow revenue; and principal transactions revenue earned primarily from actions to support client trading in fixed income securities. \nBank deposit account fees are primarily recognized pursuant to the Company’s IDA agreement with the TD Depository Institutions. Under the IDA agreement, uninvested cash within eligible brokerage client accounts is swept off-balance sheet to deposit accounts at the TD Depository Institutions. Schwab provides recordkeeping and support services to the TD Depository Institutions for bank deposit account fees. \nRegulation\nAs a participant in the securities, banking and financial services industries, Schwab is subject to extensive regulation under both federal and state laws by governmental agencies, supervisory authorities, and self-regulatory organizations (SROs). We are also subject to oversight by regulatory bodies in other countries in which we operate. These regulations affect our business operations and impose capital, client protection, and market conduct requirements.\nHolding Company and Bank Regulation\nCSC is a savings and loan holding company and is regulated, supervised, and examined by the Board of Governors of the Federal Reserve System (Federal Reserve). CSC has elected to be treated as a Financial Holding Company (FHC) by the Federal Reserve. In addition to the activities that a savings and loan holding company that has not elected to be treated as an FHC is permitted to conduct, an FHC may also engage in activities that are financial in nature or incidental to a financial activity (FHC Activities), including underwriting, dealing and making markets in securities, various insurance underwriting activities, and making merchant banking investments in non-financial companies.\nThe Federal Reserve has the authority to limit an FHC’s ability to conduct otherwise permissible FHC Activities if the FHC or any of its depository institution subsidiaries ceases to meet the applicable eligibility requirements, including requirements that the FHC and each of its depository institution subsidiaries maintain their status as “well-capitalized” and “well-managed.” If the Federal Reserve finds that an FHC fails to meet these requirements, the FHC and its subsidiaries may not commence any new FHC Activity, either de novo or through an acquisition, without prior Federal Reserve approval. The Federal Reserve may also impose any additional limitations or conditions on the conduct or activities of the FHC or any of its subsidiaries as it deems appropriate. If the FHC still fails to satisfy the applicable eligibility requirements 180 days after the Federal Reserve’s finding, the agency may require divestiture of all of the FHC’s depository institution subsidiaries or, alternatively, the FHC may elect to cease all of its FHC Activities. In addition, if any depository institution controlled by an FHC fails to maintain at least a “Satisfactory” rating under the Community Reinvestment Act of 1977 (CRA), the FHC and its subsidiaries are prohibited from \n- 6 -\nTHE CHARLES SCHWAB CORPORATION\nengaging in additional FHC Activities. \nAs a result of our election to be treated as an FHC and the election of our \ndepository institution subsidiaries \nto be deemed savings associations under the Home Owners’ Loan Act, a statutory prohibition limits those subsidiaries from making loans or other extensions of credit to any affiliate unless that affiliate engages, directly or indirectly, only in activities permissible under section 4(c) of the Bank Holding Company Act.\nCSC’s three depository institution subsidiaries are CSB, CSC’s principal depository institution subsidiary, Charles Schwab Premier Bank, SSB (CSPB), and Trust Bank. CSB and CSPB are Texas-chartered state savings banks headquartered in Westlake, Texas, and Trust Bank is a Nevada state-chartered savings bank with its main office located in Westlake, Texas. CSB and CSPB are currently regulated, supervised, and examined by the Federal Reserve, the Texas Department of Savings and Mortgage Lending (TDSML), the Consumer Financial Protection Bureau (CFPB), and the Federal Deposit Insurance Corporation (FDIC). Trust Bank is currently regulated, supervised, and examined by the Federal Reserve, the Nevada Financial Institutions Division, the CFPB, and the FDIC. CSC, CSB, CSPB, and Trust Bank are also subject to regulation and various requirements and restrictions under state and other federal laws.\nThis regulatory framework is designed to protect depositors and consumers, the safety and soundness of depository institutions and their holding companies, and the stability of the banking system as a whole. This framework affects the activities and investments of CSC and its subsidiaries and gives the regulatory authorities broad discretion in connection with their supervisory, examination and enforcement activities and policies. Below is a discussion of significant regulations. \nRegulatory Capital and Liquidity Framework\nBanking organizations are subject to the regulatory capital rules issued by the Federal Reserve and other U.S. banking regulators, including the Office of the Comptroller of the Currency and the FDIC. In addition to minimum risk-based capital requirements, banking organizations must hold additional capital, referred to as buffers, to avoid being subject to limits on capital distributions and discretionary bonus payments to executive officers.\nThe banking regulators have established four risk-based categories for determining the regulatory capital and liquidity requirements applicable to large U.S. banking organizations with $100 billion or more in total consolidated assets based on their total assets, cross-jurisdictional activity, weighted short-term wholesale funding, nonbank assets, and off-balance sheet exposure. CSC is generally subject to the requirements under Category III based on its total consolidated assets of between $250 billion and less than $700 billion and having less than $75 billion in cross-jurisdictional activity. If the average of our total consolidated assets for the four most recent calendar quarters is $700 billion or more, or the average of our cross-jurisdictional activity for the four most recent calendar quarters is $75 billion or more, we will move into Category II. As of December 31, 2024, CSC had total consolidated assets of approximately $480 billion and cross-jurisdictional activity of approximately $27 billion. \nCapital requirements for Category III banking organizations include the generally applicable risk-based capital and Tier 1 leverage ratio requirements (the “standardized approach” framework), the minimum 3.0% supplementary leverage ratio, the stress capital buffer (CSC), the capital conservation buffer (banking subsidiaries), and the countercyclical capital buffer, which is currently 0%. As a large savings and loan holding company, CSC is subject to the stress capital buffer requirement, which applies to risk-based capital ratios (Common Equity Tier 1 Capital, Tier 1 Capital, and Total Capital). Under the currently applicable capital requirements, Category III organizations are not subject to the “advanced approaches” regulatory capital framework and are permitted to opt out of including most components of accumulated other comprehensive income (AOCI) in their regulatory capital calculations. CSC made this opt out election and excludes most components of AOCI from its regulatory capital. Category II organizations are not permitted to opt out of including AOCI in their regulatory capital calculations and have additional requirements for calculating risk-based capital ratios and risk-weighted assets. \nIn July 2023, the Federal Reserve, together with the Office of the Comptroller of the Currency and the FDIC, issued a notice of proposed rulemaking with amendments to the regulatory capital rules. Among other things, the proposed rules would require us to include AOCI in regulatory capital \nand \nto calculate our risk-weighted assets using a revised risk-based approach, a component of which is based on operational risk\n, \nphased in over a three-year transition period\n. See \nPart II – Item 7 – Current Regulatory and Other Developments and Part II – Item 7 – Capital Management for additional information on these proposed regulatory changes.\nCertain banking organizations with trading assets and trading liabilities above certain thresholds or greater than a certain percent of total assets are subject to the Market Risk Rule and must adjust their risk-based capital ratios to reflect a measure of market risk of their trading activities, perform calculations to measure market risk, including back-testing, and make regular quantitative and qualitative public disclosures. \nCSC\n is subject to the rule \nand the related Market Risk Rule required disclosures\n. \nCSC began incorporating market risk capital for the period ending December 31, 2022, and while CSC is required to make adjustments to its \n- 7 -\nTHE CHARLES SCHWAB CORPORATION\nrisk-weighted assets related to de minimis positions, those adjustments have not significantly impacted our risk-based capital ratios nor have they had a current impact on CSC’s activities.\nThe U.S. Liquidity Coverage Ratio (LCR) rule is designed to promote resiliency of the banking sector by requiring that certain large U.S. banking organizations (Covered Companies) maintain a liquidity risk profile which ensures that they have sufficient High Quality Liquid Assets (HQLA), such as central bank reserves, certain government securities, and eligible corporate debt that can be converted easily and quickly to cash, to survive a significant stress event lasting 30 days. The LCR rule requires Covered Companies, including Schwab, to maintain an amount of HQLA that are unencumbered and controlled by the Covered Company’s liquidity management function sufficient to meet a designated percentage of their total stressed net cash outflows over a prospective 30 calendar-day period, as calculated in accordance with the LCR rule. Schwab is subject to the LCR and public disclosure requirement on a consolidated basis. On a quarterly basis the Company is required to disclose the average daily LCR over the quarter, and the Company also discloses quantitative and qualitative information over certain portions of the Company’s LCR components. Under the LCR rule, Schwab is required to maintain HQLA to cover 100% of the total stressed net cash outflows on a daily basis. In addition, HQLA that are held at the Company’s bank subsidiaries in excess of the subsidiaries’ total net cash outflows, and are not transferable to non-bank affiliates, are excluded by rule from the Company’s eligible HQLA.\nThe final Net Stable Funding Ratio (NSFR) rule was jointly adopted by the Federal Reserve, the Office of the Comptroller of the Currency, and the FDIC to strengthen the resilience of large bank and savings and loan holding companies by requiring them to maintain a minimum level of stable funding based on the liquidity characteristics of the holding company’s assets, commitments, and derivative exposures over a one-year time horizon. The requirement is expressed as a ratio of a banking organization’s available stable funding (ASF) to its required stable funding (RSF). Under the NSFR rule, CSC and our banking subsidiaries are required to maintain ASF in an amount equal to 100% of its RSF on an ongoing, daily basis. CSC is also required to publicly disclose its quarterly NSFR on a semi-annual basis. \nCapital Stress Testing\nUnder the current Federal Reserve capital stress testing rules, savings and loan holding companies that are Category III banking organizations and state member banks with total consolidated assets over $250 billion are required to disclose the results of company-run stress tests in even-numbered years. In the most recent cycle in 2024, CSC and CSB conducted company-run stress tests, reported the results of their stress testing to the Federal Reserve, and published a summary of their stress test results. \nPursuant to the Federal Reserve’s requirements, Category III savings and loan holding companies are also subject to an annual supervisory stress testing requirement in which the Federal Reserve conducts its own stress testing analysis to evaluate the ability of a holding company to absorb losses in specified economic and financial conditions over a nine-quarter planning horizon using such analytical techniques as the agency determines are appropriate. This supervisory stress testing requirement went into effect for CSC beginning with the 2022 stress testing cycle. \nPursuant to the Federal Reserve’s requirements, savings and loan holding companies with total consolidated assets of $100 billion or more, including CSC, are subject to an annual Comprehensive Capital Analysis and Review (CCAR) process, which requires submission of an annual capital plan to the Federal Reserve. These requirements also impose a stress capital buffer requirement, floored at 2.5 percent of risk-weighted assets. In June 2024, the Company received the results of the Federal Reserve’s 2024 CCAR. These results included the Federal Reserve’s estimate of CSC’s minimum capital ratios under the supervisory severely adverse scenario for the nine-quarter horizon beginning December 31, 2023 and ending March 31, 2026. Based on these results, CSC’s calculated stress capital buffer remains below the 2.5% minimum, resulting in a stress capital buffer at the 2.5% floor. This 2.5% stress capital buffer became applicable on October 1, 2024. See Part II – Item 8 – Note 24 for additional information regarding our capital requirements.\nAdditional Enhanced Prudential Standards\nIn addition to the capital stress testing regime discussed above, the Federal Reserve’s enhanced prudential standards rules also extend the applicability of certain additional enhanced prudential standards to large savings and loan holding companies, with the specific requirements tailored based on the same four-category framework utilized in the interagency regulatory capital and liquidity rules. These additional enhanced prudential standards, applicable to large U.S. bank holding companies under section 165 of the Dodd-Frank Wall Street Reform and Consumer Protection Act (Dodd-Frank Act), include: risk management and risk committee requirements; liquidity risk management, liquidity stress testing, and liquidity buffer requirements; and single \n- 8 -\nTHE CHARLES SCHWAB CORPORATION\ncounterparty credit limits. CSC is required to comply with these risk management and risk committee requirements, the liquidity risk-management, stress testing, and buffer requirements, as well as the single counterparty credit limits.\nIn August 2023, the Federal Reserve, together with the Office of the Comptroller of the Currency and the FDIC, issued a proposed rulemaking on long-term debt requirements for certain large banking organizations. \nSee \nPart II – Item 7 – Current Regulatory and Other Developments for discussion of the rule proposal. \nSource of Strength\nThe Dodd-Frank Act codified the Federal Reserve’s long-held position that a depository institution holding company must serve as a source of financial strength for its subsidiary depository institutions, the so-called “source of strength doctrine.” In effect, the holding company may be compelled to commit resources to support the subsidiary depository institution in the event the subsidiary is in financial distress.\nInsured Depository Institution Resolution Plans\nThe FDIC requires insured depository institutions (IDIs) with total consolidated assets of $50 billion or more to submit to the FDIC periodic plans providing for their resolution by the FDIC in the event of failure (IDI resolution plans) dating to a rule adopted in 2012. In June 2024, the FDIC adopted a new final rule with additional requirements for IDI resolution plans. Under the new final rule, large banks with total assets of at least $100 billion are required to submit comprehensive resolution plans that meet enhanced standards. These IDIs generally are required to submit a full resolution plan every three years under the new final rule with limited supplements filed in the off years. Among other requirements, the final rule requires periodic testing to validate capabilities and processing needed in resolution, and the FDIC will make certain credibility assessments of the IDI resolution plan. Under the new final rule, CSB is required to submit an IDI resolution plan to the FDIC on or before July 1, 2025. CSC is not subject to a separate holding company resolution plan requirement. \nDeposit Insurance Assessments\nThe FDIC’s Deposit Insurance Fund (DIF) provides insurance coverage for certain deposits, generally up to $250,000 per depositor per account ownership type, and is funded by quarterly assessments on insured depository institutions. The FDIC uses a risk-based deposit premium assessment system that, for large insured depository institutions with at least $10 billion in total consolidated assets, uses a scorecard method based on a number of factors, including the institution’s regulatory ratings, asset quality and brokered deposits. The deposit insurance assessment base is calculated as average consolidated total assets minus average tangible equity.\nIn October 2022, the FDIC adopted a final rule to increase the initial base deposit insurance assessment rates by two basis points, which became effective for the first quarterly assessment period of 2023. The FDIC has stated that this change is intended to raise the FDIC’s DIF reserve ratio to the minimum threshold within the FDIC’s established DIF restoration plan, and will remain in effect until the DIF reserve ratio meets the FDIC’s long-term goal of 2%. In November 2023, the FDIC approved a special assessment to recover losses incurred by the DIF in 2023 to protect uninsured depositors due to the March 2023 closures of two banks. See Part II – Item 7 – Current Regulatory and Other Developments for additional information regarding the special assessment. \nBrokered Deposits\nThe FDIC’s amended brokered deposits rule became effective April 1, 2021, which established a new framework for determining whether deposits made through arrangements between third parties and depository institutions constitute brokered deposits and more specifically to clarify the circumstances under which broker-dealers that place deposits with depository institutions through brokerage sweep arrangements, such as CS&Co, qualify for the “primary purpose exception” from the definition of a deposit broker. Under this framework, the FDIC established a “25 percent” business relationship designated exception where a broker-dealer or other third party may qualify for the primary purpose exception by filing a notice with the FDIC indicating that less than 25 percent of its customer assets under administration for a particular business line are placed at depository institutions. Funds swept by our broker-dealer subsidiary to Schwab’s depository institution subsidiaries and third-party banks continue to qualify for the primary purpose exception under this framework.\nIn July 2024, the FDIC issued a notice of proposed rulemaking to amend the brokered deposits framework; see Part II – Item 7 – Current Regulatory and Other Developments for additional information regarding this proposed rulemaking.\n- 9 -\nTHE CHARLES SCHWAB CORPORATION\nCommunity Reinvestment Act\nThe CRA requires the primary federal bank regulatory agency for each of Schwab’s depository institution subsidiaries to assess the subsidiary’s record in meeting the credit needs of the communities served by the bank, including low- and moderate-income neighborhoods and persons. Institutions are assigned one of four ratings (“outstanding,” “satisfactory,” “needs to improve,” or “substantial noncompliance”). The failure of an institution to receive at least a “satisfactory” rating could inhibit the institution or its holding company from undertaking certain activities, including acquisitions or opening branch offices. \nVolcker Rule \nCSC\n and its subsidiaries are subject to the Volcker Rule, which generally prohibits proprietary trading or acquiring or retaining an ownership interest in, sponsoring, or having certain relationships with hedge funds and private equity funds, subject to certain exemptions, in each case as the applicable terms are defined in the Volcker Rule and the implementing regulations. \nConsumer Financial Protection\nThe CFPB has broad rulemaking, supervisory and enforcement authority for a wide range of federal consumer protection laws relating to financial products. The CFPB has examination and primary enforcement authority over depository institutions with $10 billion or more in consolidated total assets.\nFinancial Services Regulation\nBank Secrecy Act of 1970 and USA PATRIOT Act of 2001\nCSC and its subsidiaries that conduct financial services activities are subject to the Bank Secrecy Act of 1970 (BSA), as amended by the USA PATRIOT Act of 2001, which requires financial institutions to develop and implement programs reasonably designed to achieve compliance with these regulations. The BSA and USA PATRIOT Act include a variety of monitoring, recordkeeping and reporting requirements (such as currency transaction reporting and suspicious activity reporting), as well as identity verification and client due diligence requirements which are intended to detect, report and/or prevent money laundering and the financing of terrorism. In addition, CSC and various subsidiaries of the Company are subject to U.S. sanctions programs administered by the Office of Foreign Assets Control.\nBroker-Dealer, Futures Commission Merchant (FCM), Forex Dealer Member (FDM), and Investment Advisor Regulation \nOur principal broker-dealer subsidiary, CS&Co, is registered as a broker-dealer with the U.S. Securities and Exchange Commission (SEC or Commission), the fifty states, the District of Columbia, the U.S. Virgin Islands, and the Commonwealth of Puerto Rico. CS&Co, CSIM, and certain of our other subsidiaries are registered as investment advisors with the SEC. Charles Schwab Futures and Forex LLC (CSFF) is registered as an FCM and FDM with the Commodity Futures Trading Commission (CFTC). \nMuch of the regulation of broker-dealers has been delegated to SROs. CS&Co is a member of FINRA and the Municipal Securities Rulemaking Board (MSRB). In addition, CS&Co is a member of Nasdaq Stock Market, Cboe EDGX Exchange, Inc., and MEMX LLC. In addition to the SEC, the primary regulators of CS&Co are FINRA and, for municipal securities, the MSRB. The National Futures Association (NFA) is the primary regulator for CSFF’s futures, commodities, and forex trading activities.\nThe principal purpose of regulating these entities is the protection of clients and securities markets. The regulations cover all aspects of the securities business, including, among other things, sales and trading practices, publication of research, margin lending, uses and safekeeping of clients’ funds and securities, capital adequacy, recordkeeping and reporting, fee arrangements, order flow revenue from securities exchanges and market makers, disclosure to clients, fiduciary duties, and the conduct of directors, officers, and employees.\nCS&Co is subject to Rule 15c3-1 under the Securities Exchange Act of 1934 (the Uniform Net Capital Rule) and related SRO requirements. The CFTC and NFA also impose net capital requirements. The Uniform Net Capital Rule specifies minimum capital requirements intended to ensure the general financial soundness and liquidity of broker-dealers. CSC itself is not a registered broker-dealer and it is not subject to the Uniform Net Capital Rule. \nThe Uniform Net Capital Rule prohibits broker-dealers from paying cash dividends, making unsecured advances or loans or repaying subordinated loans if such payment would result in a net capital amount of less than 5% of aggregate debit balances or \n- 10 -\nTHE CHARLES SCHWAB CORPORATION\nless than 120% of its minimum dollar requirement. See Part II – Item 8 – Note 24 for additional information regarding our net capital requirements.\nIn addition to net capital requirements, as a self-clearing broker-dealer, CS&Co is subject to cash deposit and collateral requirements with clearing houses, such as the Depository Trust & Clearing Corporation and Options Clearing Corporation, which may fluctuate significantly from time to time based upon the nature and size of clients’ trading activity and market volatility.\nThe structure and regulation of the securities markets have a significant impact on the Company’s business and operations, including its sources of net revenues. See Part II – Item 7 – Current Regulatory and Other Developments for proposed regulatory changes, including in regard to equity market structure.\nAs a result of our operations in countries outside the U.S., we are also subject to rules and regulations issued by certain foreign authorities, including the Financial Conduct Authority in the United Kingdom, the Securities and Futures Commission in Hong Kong, the Monetary Authority of Singapore in Singapore, and the Ministry of Finance in the People’s Republic of China.\nHuman Capital\n \nWe believe that hiring people who share our corporate purpose of helping clients achieve their financial goals is an essential element of executing our “Through Clients’ Eyes” strategy, and we seek to attract, retain, and motivate the talent Schwab needs to successfully serve our clients and grow our business. As of December 31, 2024, Schwab had full-time, part-time, and temporary employees, and persons employed on a contract basis, that represented the equivalent of approximately 32,100 full-time employees. \nSchwab offers a compensation package that rewards both employee and company performance. The package encompasses an array of compensation components in addition to base pay including performance-based incentive pay, equity awards, recognition awards, and a range of health and wellness benefits. We also offer benefits and resources designed to help our employees achieve their financial goals, including a 401(k) plan, an employee stock purchase plan, financial planning consultations, and disability and life insurance options. In addition, Schwab offers programs to help with employee career growth including mentorship, development, and leadership programs as well as reimbursement for qualified business-related education and training. We also encourage and empower employees to volunteer in the communities where we live and work, offering paid time off for every employee to volunteer in his or her community. The Company offers a hybrid work and flexibility approach to work arrangements that is designed to balance the importance our employees place on workplace flexibility with the benefits of in-person interactions to train and learn from one another, build human connections, and maintain Schwab’s culture as we serve our clients.\nWe seek to build a workforce with a wide range of perspectives and experiences, which supports our strategy and helps us better serve our clients. We focus on attracting highly qualified talent with varied backgrounds and perspectives by maintaining a strong employer brand and expanding where and how we meet prospective employees. For Schwab employees, we support a number of Employee Resource Groups (ERGs), which are employee-driven and provide support, leadership development opportunities, and connection. Our ERGs are open to all employees, are not limited by affiliation, and help us build an inclusive culture. Additionally, our leaders are responsible for creating an environment where all people can do their best work, and for fostering the development of high-performance teams that value the individual strengths of every employee. We regularly request feedback from our employees through surveys.\nAvailable Information\nSchwab files annual, quarterly, and current reports, proxy statements, and other information with the SEC. The SEC filings are available to the public over the internet on the SEC’s website at \nhttps://www.sec.gov\n. \nOn our website, \nhttps://www.aboutschwab.com\n, we post the following filings after they are electronically filed with or furnished to the SEC: annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934. In addition, we post to the website the Dodd-Frank stress test results, our regulatory capital disclosures based on Basel III, our average LCR, and our average NSFR.\nAll such filings are available free of charge either on our website or by request via email (\ninvestor.relations@schwab.com\n), or mail (Charles Schwab Investor Relations at 3000 Schwab Way, Westlake, TX 76262).\n- 11 -\nTHE CHARLES SCHWAB CORPORATION",
  "item7": "Item 7.    Management’s Discussion and Analysis\n \nof Financial Condition and Results of Operations\nFORWARD-LOOKING STATEMENTS\nIn addition to historical information, this Annual Report on Form 10-K contains “forward-looking statements” within the meaning of Section 27A of the Securities Act, and Section 21E of the Securities Exchange Act of 1934. Forward-looking statements are identified by words such as “believe,” “anticipate,” “expect,” “intend,” “plan,” “will,” “may,” “estimate,” “appear,” “could,” “would,” “expand,” “aim,” “maintain,” “continue,” “seek,” and other similar expressions. In addition, any statements that refer to expectations, projections, or other characterizations of future events or circumstances are forward-looking statements.\nThese forward-looking statements, which reflect management’s beliefs, objectives, and expectations as of the date hereof, are estimates based on the best judgment of Schwab’s senior management. These statements relate to, among other things:\n•\nMaximizing our market valuation and stockholder returns over time; our belief that developing trusted relationships will translate into more client assets which drives revenue and, along with expense discipline and thoughtful capital management, generates earnings growth and builds stockholder value (see Business Strategy and Competitive Environment, and Products and Services in Part I – Item 1);\n•\nCapital expenditures and expense management (see Results of Operations in Overview and Results of Operations – Total Expenses Excluding Interest in Part II – Item 7);\n•\nNet interest revenue, the adjustment of rates paid on client-related liabilities, and client cash realignment activity (see Results of Operations – Net Interest Revenue in Part II – Item 7);\n•\nUtilization of bank supplemental funding and expectations for repayment of outstanding balances (see Results of Operations in Part II – Item 7, and Liquidity Risk in Part II – Item 7);\n•\nManagement of interest rate risk; modeling and assumptions, the impact of changes in interest rates on net interest margin and revenue, bank deposit account fee revenue, economic value of equity, and liability and asset duration (see Risk Management in Part II – Item 7);\n•\nSources and uses of liquidity (see Liquidity Risk in Part II – Item 7);\n•\nCapital management; potential migration of IDA balances to our balance sheet; capital accretion; expectations about capital requirements, including AOCI; long-term operating objective; and uses of capital and return of excess capital to stockholders, including dividends and repurchases (see Capital Management – Regulatory Capital Requirements in Part II – Item 7; and Commitments and Contingencies in Part II – Item 8 – Note 15);\n•\nThe expected impact of proposed and final rules (see Current Regulatory and Other Developments in Part II – Item 7);\n•\nThe expected impact of new accounting standards not yet adopted (see Summary of Significant Accounting Policies in Part II – Item 8 – Note 2);\n•\nThe likelihood of indemnification and guarantee payment obligations and clients failing to fulfill contractual obligations (see Commitments and Contingencies in Part II – Item 8 – Note 15, and Financial Instruments Subject to Off-Balance Sheet Credit Risk – Client Trade Settlement in Note 18); and\n•\nThe outcome and impact of legal proceedings and regulatory matters (see Commitments and Contingencies in Part II – Item 8 – Note 15, and Legal Proceedings in Part I – Item 3).\nAchievement of the expressed beliefs, objectives and expectations described in these statements is subject to certain risks and uncertainties that could cause actual results to differ materially from the expressed beliefs, objectives, and expectations. Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date of this Annual Report on Form 10-K or, in the case of documents incorporated by reference, as of the date of those documents.\nImportant factors that may cause actual results to differ include, but are not limited to:\n•\nGeneral market conditions, including the level of interest rates, equity market valuations and volatility;\n•\nOur ability to attract and retain clients, develop trusted relationships, and grow client assets;\n•\nClient use of our advisory and lending solutions and other products and services;\n•\nThe level of client assets, including cash balances;\n•\nClient cash allocations and sensitivity to deposit rates;\n•\nThe level and mix of client trading activity, including daily average trades, margin balances, and balance sheet cash;\n•\nRegulatory guidance and adverse impacts from new or changed legislation, rulemaking or regulatory expectations;\n•\nCapital and liquidity needs and management;\n- 24 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\n•\nOur ability to manage expenses;\n•\nOur ability to attract and retain talent;\n•\nOur ability to develop and launch new and enhanced products, services, and capabilities, as well as enhance our infrastructure, in a timely and successful manner;\n•\nOur ability to monetize client assets;\n•\nOur ability to support client activity levels;\n•\nIncreased compensation and other costs;\n•\nReal estate and workforce decisions;\n•\nThe timing and scope of technology projects;\n•\nBalance sheet positioning relative to changes in interest rates;\n•\nInterest-earning asset mix and growth;\n•\nOur ability to access and use supplemental funding sources;\n•\nPrepayment levels for mortgage-backed securities;\n•\nMigrations of bank deposit account balances (BDA balances);\n•\nBalance sheet positioning relative to changes in interest rates;\n•\nRegulatory and legislative developments;\n•\nAdverse developments in litigation or regulatory matters and any related charges; and\n•\nPotential breaches of contractual terms for which we have indemnification and guarantee obligations.\nCertain of these factors, as well as general risk factors affecting the Company, are discussed in greater detail in Risk Factors in Part I – Item 1A.\nGLOSSARY OF TERMS\n \nActive brokerage accounts:\n Brokerage accounts with activity within the preceding 270 days. \nAccumulated Other Comprehensive Income (AOCI): \nA component of stockholders’ equity which primarily includes unrealized gains and losses on AFS securities and securities transferred from the AFS category to the held to maturity (HTM) category. \nAsset-backed securities:\n Debt securities backed by financial assets such as loans or receivables.\nAssets receiving ongoing advisory services:\n Market value of all client assets custodied at the Company under the guidance of an independent advisor or enrolled in one of Schwab’s managed investing solutions at the end of the reporting period. \nBank deposit account balances (BDA balances):\n Clients’ uninvested cash balances held off-balance sheet in deposit accounts at unconsolidated third-party financial institutions, pursuant to the IDA agreement or agreements with other third-party financial institutions. Average BDA balances represent the daily average balance for the reporting period.\nBasel III:\n Global regulatory standards on bank capital adequacy and liquidity issued by the Basel Committee on Banking Supervision.\nBasis point:\n One basis point equals 1/100\nth\n of 1%, or 0.01%.\nClient assets:\n The market value, as of the end of the reporting period, of all client assets in our custody, BDA balances, and proprietary products, which includes both cash and securities. Average client assets are the daily average client asset balance for the reporting period. \nClient cash as a percentage of client assets:\n Calculated as the value, at the end of the reporting period, of all money market fund balances, bank deposits excluding brokered CDs issued by CSB, Schwab One\n®\n balances, BDA balances, and certain cash equivalents divided by client assets. \nCommon Equity Tier 1\n \n(CET1) Capital:\n The sum of common stock and related surplus net of treasury stock, retained earnings, AOCI, and qualifying minority interests, less applicable regulatory adjustments and deductions. As a Category III banking organization, CSC has elected to exclude most components of AOCI from CET1 Capital.\n- 25 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nCommon Equity Tier 1 Risk-Based Capital Ratio:\n The ratio of CET1 Capital to total risk-weighted assets as of the end of the period.\nCore net new client assets:\n Net new client assets before significant one-time inflows or outflows, such as acquisitions/divestitures or extraordinary flows (generally greater than $10 billion ($25 billion beginning in 2025)) relating to a specific client, and activity from off-platform brokered CDs issued by CSB. These flows may span multiple reporting periods. \nCustomer Protection Rule:\n Refers to Rule 15c3-3 of the Securities Exchange Act of 1934.\nDaily Average Trades (DATs):\n Includes daily average revenue trades by clients, trades by clients in asset-based pricing relationships, commission-free trades, and allocated trades by investment advisors.\nDelinquency roll rates:\n The rates at which loans transition through delinquency stages, ultimately resulting in a loss. Schwab considers a loan to be delinquent if it is 30 days or more past due.\nDodd-Frank Wall Street Reform and Consumer Protection Act (Dodd-Frank Act): \nRegulatory reform legislation containing numerous provisions which expanded prudential regulation of large financial services companies.\nDuration: \nDuration is typically used to measure the expected change in value of a financial instrument for a 1% change in interest rates, expressed in years.\n \nFirst Mortgages:\n Refers to first lien residential real estate mortgage loans.\nFull-time equivalent employees:\n Represents the total number of hours worked divided by a 40-hour work week for the following categories: full-time, part-time, and temporary employees and persons employed on a contract basis.\nHigh Quality Liquid Assets (HQLA):\n HQLA is defined by the Federal Reserve, but includes assets that are actively traded and readily convertible to cash in times of stress. \nIndustry Fees:\n Includes fees collected from clients for certain securities transactions to offset, as applicable, charges assessed on the Company by SROs and foreign governments. Such charges include Section 31 fees, FINRA trading activity fees, options regulatory fees, proprietary index options fees, and foreign transaction tax on American Depositary Receipts. \nInterest-bearing liabilities:\n Primarily includes bank deposits, payables to brokerage clients, payables to brokers, dealers, and clearing organizations, Federal Home Loan Bank borrowings, other short-term borrowings, and long-term debt on which Schwab pays interest.\nInterest-earning assets:\n Primarily includes cash and cash equivalents, cash and investments segregated, receivables from brokerage clients, investment securities, and bank loans on which Schwab earns interest.\nInvestment grade:\n Defined as a rating equivalent to a Moody’s Investors Service (Moody’s) rating of “Baa3” or higher, or a Standard & Poor’s Rating Group (Standard & Poor’s) or Fitch Ratings, Ltd (Fitch) rating of “BBB-” or higher.\nLiquidity Coverage Ratio (LCR):\n The ratio of HQLA to projected net cash outflows during a 30-day stress scenario.\nLoan-To-Value\n \n(LTV)\n \nratio:\n Calculated as the principal amount of a loan divided by the value of the collateral securing the loan.\nMargin loans:\n Money borrowed against the value of certain stocks, bonds, and mutual funds in a client portfolio. The borrowed money can be used to purchase additional securities or to meet short-term financial needs.\nMaster netting arrangement:\n An agreement between two counterparties that have multiple contracts with each other that provides for net settlement of all contracts through a single cash payment in the event of default or termination of any one contract.\nMortgage-backed securities:\n A type of asset-backed security that is secured by a mortgage or group of mortgages.\n- 26 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nNet interest margin:\n Net interest revenue (annualized for interim periods) divided by average interest-earning assets.\nNet new client assets:\n Total inflows of client cash and securities to Schwab less client outflows. Inflows include dividends and interest; outflows include commissions and fees. Capital gains distributions are excluded. \nNet Stable Funding Ratio (NSFR): \nThe ratio of the amount of available stable funding relative to the amount of required stable funding.\nNew brokerage accounts:\n All brokerage accounts opened during the period, as well as any accounts added via acquisition. \nNonperforming assets:\n The total of nonaccrual loans and other real estate owned.\nOrder flow revenue:\n Payments received from trade execution venues to which our broker-dealer subsidiary sends equity and option orders. \nPledged Asset Line\n®\n (PAL):\n A non-purpose revolving line of credit from a banking subsidiary secured by eligible assets held in a separate pledged brokerage account maintained at CS&Co.\nReturn on average common stockholders’ equity:\n Calculated as net income available to common stockholders (annualized for interim periods) divided by average common stockholders’ equity.\nRisk-weighted assets:\n Computed by assigning specific risk-weightings to assets and off-balance sheet instruments for capital adequacy calculations.\nTier 1 Capital:\n The sum of CET1 Capital and additional Tier 1 Capital instruments and related surplus, less applicable adjustments and deductions.\nTier 1 Leverage Ratio:\n End-of-period Tier 1 Capital divided by adjusted average total consolidated assets for the period.\nTrading days:\n Days in which the markets/exchanges are open for the buying and selling of securities. Early market closures are counted as half-days.\nU.S. federal banking agencies:\n Refers to the Federal Reserve, the Office of the Comptroller of the Currency, the FDIC, and the CFPB.\nUniform Net Capital Rule:\n Refers to Rule 15c3-1 under the Securities Exchange Act of 1934, which specifies minimum capital requirements that are intended to ensure the general financial soundness and liquidity of broker-dealers at all times.\n- 27 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nOVERVIEW\nManagement focuses on several client activity and financial metrics in evaluating Schwab’s financial position and operating performance. We believe that metrics relating to net new and total client assets, as well as client cash levels and utilization of advisory services, offer perspective on our business momentum and client engagement. Data on new and total client brokerage accounts provides additional perspective on our ability to attract and retain new business. Total net revenue growth, pre-tax profit margin, EPS, return on average common stockholders’ equity, and the consolidated Tier 1 Leverage Ratio provide broad indicators of Schwab’s overall financial health, operating efficiency, and ability to generate acceptable returns. Total expenses excluding interest as a percentage of average client assets is a measure of operating efficiency. \nResults for the years ended December 31, 2024, 2023, and 2022 are as follows:\nPercent Change 2024-2023\n2024\n2023\n2022\nClient Metrics\nNet new client assets (in billions) \n(1)\n7%\n$\n361.6 \n$\n337.2 \n$\n406.9 \nCore net new client assets (in billions)\n20%\n$\n366.9 \n$\n305.7 \n$\n427.7 \nClient assets (in billions, at year end)\n19%\n$\n10,101.3 \n$\n8,516.6 \n$\n7,049.8 \nAverage client assets (in billions)\n21%\n$\n9,400.4 \n$\n7,793.8 \n$\n7,292.8 \nNew brokerage accounts (in thousands)\n10%\n4,170 \n3,806 \n4,044 \nActive brokerage accounts (in thousands, at year end)\n5%\n36,456 \n34,838 \n33,758 \nAssets receiving ongoing advisory services (in billions, at year end)\n17%\n$\n5,061.7 \n$\n4,338.8 \n$\n3,673.2 \nClient cash as a percentage of client assets (at year end)\n10.1 \n%\n10.5 \n%\n12.2 \n%\nCompany Financial Information and Metrics\nTotal net revenues\n4%\n$\n19,606 \n$\n18,837 \n$\n20,762 \nTotal expenses excluding interest\n(4)%\n11,914 \n12,459 \n11,374 \nIncome before taxes on income\n21%\n7,692 \n6,378 \n9,388 \nTaxes on income\n33%\n1,750 \n1,311 \n2,205 \nNet income\n17%\n5,942 \n5,067 \n7,183 \nPreferred stock dividends and other\n11%\n464 \n418 \n548 \nNet income available to common stockholders\n18%\n$\n5,478 \n$\n4,649 \n$\n6,635 \nEarnings per common share — diluted\n18%\n$\n2.99 \n$\n2.54 \n$\n3.50 \nNet revenue growth from prior year\n4 \n%\n(9)\n%\n12 \n%\nPre-tax profit margin\n39.2 \n%\n33.9 \n%\n45.2 \n%\nReturn on average common stockholders’ equity\n15 \n%\n16 \n%\n18 \n%\nExpenses excluding interest as a percentage of average client assets\n0.13 \n%\n0.16 \n%\n0.16 \n%\nConsolidated Tier 1 Leverage Ratio (at year end)\n9.9 \n%\n8.5 \n%\n7.2 \n%\nNon-GAAP Financial Measures\n (2)\nAdjusted total expenses\n (3)\n$\n11,269 \n$\n11,029 \n$\n10,386 \nAdjusted diluted EPS\n$\n3.25 \n$\n3.13 \n$\n3.90 \nReturn on tangible common equity\n35 \n%\n54 \n%\n42 \n%\n(1)\n 2024 includes net outflows of $14.6 billion from off-platform brokered CDs issued by CSB and an inflow of $10.3 billion from a mutual fund clearing services client and an outflow of $1.0 billion from an international relationship. 2023 includes net inflows of $32.5 billion from off-platform brokered CDs issued by CSB and $12.0 billion from a mutual fund clearing services client and outflows of $13.0 billion from an international relationship. 2022 includes outflows of $20.8 billion from certain mutual fund clearing services clients.\n(2) \nBeginning in 2023, adjustments made to GAAP financial measures also include restructuring costs. See Non-GAAP Financial Measures for further details and a reconciliation of such measures to GAAP reported results.\n(3) \nAdjusted total expenses is a non-GAAP financial measure adjusting total expenses excluding interest. See Non-GAAP Financial Measures.\n- 28 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\n2024 Compared to 2023\nThrough an evolving macroeconomic landscape in 2024, Schwab continued its “Through Clients’ Eyes” strategy, striving to meet the needs of our diverse client base, while driving growth across multiple fronts and successfully completing the integration of Ameritrade. Amid easing inflation, the Federal Reserve began in September to cut interest rates for the first time in over four years, reducing the federal funds overnight rate by a total of 100 basis points in the third and fourth quarters. Equity markets were positive for the year in 2024, with the S&P 500\n®\n and the NASDAQ Composite\n®\n finishing the year higher by 23% and 29%, respectively. \nReflecting the strength of equity markets and organic asset gathering, total client assets rose to $10.10 trillion as of year-end 2024, up 19% from year-end 2023. Core net new assets totaled $366.9 billion in 2024, up 20% from 2023, and representing an annualized growth rate of 4.3%. Following the successful completion of our final Ameritrade client conversion in May, our organic growth trends strengthened, and core net new assets for the fourth quarter of 2024 were $114.8 billion, up 51% from the fourth quarter of 2023. We saw strong client engagement in the markets throughout 2024, with acceleration in the fourth quarter; clients’ DATs were 5.9 million in full-year 2024 and 6.3 million in the fourth quarter, increasing 9% and 22%, respectively, from the same periods in 2023. Clients opened 4.2 million new brokerage accounts in 2024, a year-over-year increase of 10%, and active brokerage accounts ended 2024 at 36.5 million, up 5% on the year.\nThe Company’s financial results in 2024 reflected the impact of positive equity markets, solid asset gathering, sustained client engagement, and improvement in client cash trends. Net income totaled $5.9 billion in 2024, up 17% year-over-year, and diluted EPS was $2.99, an increase of 18% over the prior year. Adjusted diluted EPS \n(1)\n was $3.25 in 2024, up 4% from $3.13 in 2023.\nTotal net revenues rose 4% year-over-year to $19.6 billion in 2024. Net interest revenue was $9.1 billion in 2024, down 3% from 2023, which reflected lower average interest-earning assets and higher rates on funding sources, partially offset by growth in margin and bank lending and lower bank supplemental funding. Client cash realignment activity continued to decelerate in 2024, and principal and interest payments on the AFS and HTM investment securities portfolios supported reductions in bank supplemental funding balances. Asset management and administration fees were $5.7 billion in 2024, increasing 20% from the prior year primarily as a result of growth in money market funds, equity market gains, and growth in managed investing solutions. Trading revenue was $3.3 billion in 2024, up 1% from the prior year, reflecting higher volume and changes in mix of client trading activity. Bank deposit account fee revenue totaled $729 million in 2024, up 3% year-over-year, due primarily to $97 million in breakage fees recognized in 2023, partially offset by lower average BDA balances. BDA balances totaled $87.6 billion at December 31, 2024, down 10% from year-end 2023 primarily resulting from lower client cash allocations.\nTotal expenses excluding interest were $11.9 billion in 2024, down 4% from 2023. This decrease reflected lower restructuring costs, lower acquisition and integration-related costs, and lower regulatory fees and assessments due primarily to a $172 million FDIC special assessment recognized in the fourth quarter of 2023 (see Current Regulatory and Other Developments). These lower expenses were partially offset by higher incentive compensation, higher depreciation and amortization due to continued investment to support growth of the business, and higher other expense. Other expense reflected higher industry fees resulting from the SEC’s May 2024 fee rate increase. Adjusted total expenses \n(1)\n were $11.3 billion in 2024, up 2% from 2023. Acquisition and integration-related costs, amortization of acquired intangible assets, and restructuring costs totaled $645 million in 2024, down 55% from 2023, as substantially all of the Company’s costs related to its restructuring were incurred in 2023, and spending for the Ameritrade integration decreased in 2024 as we completed the final integration activities.\nReturn on average common stockholders’ equity was 15% in 2024, down from 16% in 2023, and return on tangible common equity \n(1)\n (ROTCE) was 35% in 2024, down from 54% in 2023. These changes reflect the benefit of higher net income in 2024 offset by higher average common stockholders’ equity. Average common stockholders’ equity was higher year-over-year due to higher retained earnings as well as higher average AOCI. The increase in average AOCI was driven by lower unrealized losses on our AFS investment securities portfolio and securities transferred in 2022 from AFS to HTM (see Item 8 – Note 21).\nEmploying our diligent approach to managing the balance sheet, Schwab supported client-driven growth in margin and bank lending, while reducing our bank supplemental funding in 2024. Total balance sheet assets decreased 3% during the year, though margin lending grew to $83.8 billion at year-end 2024, up 34%, and bank loans increased to $45.2 billion, rising 12% during the year. Principal and interest from our AFS and HTM securities portfolios, along with deceleration of client cash realignment from sweep products to higher-yielding investment solutions, supported a reduction in bank supplemental funding, which includes brokered CDs, FHLB borrowings, and borrowings under repurchase agreements at our banks. Total bank supplemental funding ended 2024 at $49.9 billion, down $29.7 billion, or 37%, from year-end 2023, and down 49% from peak \n- 29 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nlevels in May 2023. Supported by strength of net income, our consolidated Tier 1 Leverage Ratio increased to 9.9% as of December 31, 2024, and our consolidated adjusted Tier 1 Leverage Ratio \n(1)\n, which includes AOCI in the ratio, rose to 6.8%, ending the year within our long-term operating objective of 6.75% - 7.00%.\n(1)\n Adjusted diluted EPS, adjusted total expenses, return on tangible common equity, and adjusted Tier 1 Leverage Ratio are non-GAAP financial measures. See Non-GAAP Financial Measures for further details and a reconciliation of such measures to GAAP reported results.\n2023 Compared to 2022\nThrough an uneven environment in 2023, with shifting views on the trajectory of the U.S. economy, persistent geopolitical unrest, and turmoil beginning early in the year within the banking sector, our “no trade-offs” value proposition continued to resonate with investors. The Federal Reserve raised the Federal Funds rate four times in the first three quarters of 2023 for a total of 100 basis points before holding rates unchanged from July through the end of 2023. Although equity markets were volatile during 2023, ultimate returns were strong with the S&P 500\n®\n rising 24% and the NASDAQ Composite\n®\n increasing 43%. Investor sentiment was also volatile throughout 2023; strongly bearish in the first quarter before recovering in the second, then declining again in the third quarter. Investor sentiment recovered significantly in the fourth quarter to end 2023 with a solid bullish viewpoint. \nDespite this mixed sentiment, our clients remained engaged with the markets and with Schwab. Clients entrusted us with $305.7 billion in core net new assets in 2023. Total client assets reached $8.52 trillion as of December 31, 2023, rising 21% from year-end 2022 as a result of asset gathering and market gains, partially offset by some expected deal-related attrition from clients originating at Ameritrade. Trading volume declined somewhat from the prior year, as DATs were 5.4 million in 2023, down 9% from 2022. Clients opened 3.8 million new brokerage accounts in 2023, bringing active brokerage accounts to 34.8 million at year-end, up 3% year-over-year. Clients sought to take advantage of higher market interest rates in 2023, and we saw significant client cash reallocation from our sweep products into higher-yielding alternatives offered by Schwab. While bank sweep deposits and payables to brokerage clients decreased by a total of $126.1 billion during 2023, client assets invested in Schwab’s proprietary money market funds and fixed income securities increased by a total of $383.8 billion. \nSchwab’s financial performance during 2023 reflected the challenges of navigating a market environment shaped by the Federal Reserve’s interest rate tightening policy and the follow-on effects stemming from the regional banking crisis beginning in March 2023. Schwab’s net income totaled $5.1 billion in 2023 and diluted EPS was $2.54, down 29% and 27%, respectively, from the prior year. Adjusted diluted EPS \n(1)\n was $3.13 in 2023, down 20% from $3.90 in 2022.\nTotal net revenues were $18.8 billion in 2023, down 9% from the prior year as client cash realignment activity impacted our net interest revenue. Net interest revenue was $9.4 billion in 2023, down 12% from the prior year, as the benefits of rising rates were more than offset by increased utilization of higher-cost supplemental funding and lower interest-earning assets. Asset management and administration fees totaled $4.8 billion in 2023, rising 13% from 2022, primarily as a result of growth in money market funds, as well as improvement in equity markets and growth in our other proprietary fund products, partially offset by lower balances of certain third-party funds. Trading revenue was $3.2 billion in 2023, down 12% from 2022, due primarily to mix of client trading activity and overall lower trading volume. Bank deposit account fee revenue was $705 million in 2023, down 50% from the prior year due to lower average BDA balances and lower net yields, as well as $97 million in one-time breakage fees related to ending our arrangements with certain third-party banks in the first quarter of 2023. BDA balances totaled $97.5 billion at December 31, 2023, down 23% from year-end 2022 due primarily to client cash allocation decisions.\nTotal expenses excluding interest were $12.5 billion in 2023, increasing 10% from 2022. This increase was due primarily to restructuring charges incurred in the second half of 2023, higher regulatory fees and assessments due primarily to an increase in FDIC assessments including the recognition of a $172 million special assessment in the fourth quarter, as well as higher expenses for compensation and benefits and depreciation and amortization, due primarily to growth in average headcount and investment in technology to support growth in our client base and the Ameritrade integration. Adjusted total expenses \n(1)\n were $11.0 billion in 2023, higher by 6% from 2022. Acquisition and integration-related costs were $401 million in 2023, up 2% from 2022, and amortization of acquired intangibles was $534 million, down 10% from 2022 as certain assets from the Ameritrade acquisition were fully amortized beginning in the fourth quarter of 2022. Beginning in the third quarter of 2023, adjusted total expenses \n(1)\n also excludes restructuring costs, which totaled $495 million in 2023, related to efforts to achieve run-rate cost savings in preparation for post-integration of Ameritrade.\nReturn on average common stockholders’ equity was 16% for 2023, down from 18% in 2022. Return on tangible common equity \n(1)\n (ROTCE) was 54% in 2023, up from 42% in 2022. These changes primarily reflected lower average stockholders’ \n- 30 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nequity and lower net income in 2023. Average stockholders’ equity was lower in 2023 due to a year-over-year decrease in average AOCI driven by unrealized losses on our AFS investment securities portfolio and securities transferred from AFS to HTM in 2022 (see Item 8 – Note 21).\nThroughout 2023, the Company continued its diligent approach to balance sheet management and sought to prioritize flexibility. During 2023, we issued $6.2 billion in Senior Notes to prepare for upcoming maturities as well as provide additional liquidity during the larger Ameritrade conversion weekends. Total balance sheet assets decreased 11% from year-end 2022 to $493.2 billion at December 31, 2023, due primarily to client cash realignment amid the higher interest rate environment. To assist in facilitating these client cash movements from sweep products to high-yielding cash and fixed income alternatives, the Company utilized bank supplemental funding sources, including FHLB borrowings and issuances of brokered CDs. As realignment activity significantly decreased in the second half of the year, by year-end 2023, we reduced the total outstanding balance of such supplemental sources by approximately 18% from the peak balances reached in May 2023. Driven by a combination of the Company’s net income and also a smaller balance sheet in 2023, our consolidated Tier 1 Leverage Ratio increased to 8.5% as of year-end 2023. \n(1)\n Adjusted diluted EPS, adjusted total expenses, return on tangible common equity, and adjusted Tier 1 Leverage Ratio are non-GAAP financial measures. See Non-GAAP Financial Measures for further details and a reconciliation of such measures to GAAP reported results.\nIntegration of Ameritrade\n \nOver the course of five client transition groups in 2023 and 2024, we converted approximately $1.9 trillion in client assets across more than 17 million client accounts, including 7,000 RIAs, from Ameritrade to Schwab. In May 2024, the Company completed the conversion of the final client transition group from Ameritrade to the Schwab platform. In connection with these transitions, we experienced some expected attrition of client assets from retail accounts and RIAs, though such attrition was below our initial estimates when we announced the acquisition. \nThe integration of Ameritrade is now complete. Throughout the integration, the Company incurred total acquisition and integration-related costs and capital expenditures of approximately $2.5 billion. Acquisition and integration-related costs, which are inclusive of related exit costs, totaled $117 million, $401 million, and $392 million in 2024, 2023, and 2022, respectively. Over the course of the integration, we realized annualized run-rate cost synergies of approximately $2.0 billion, with anticipated full-year synergy realization beginning in 2025. See also Results of Operations – Total Expenses Excluding Interest, Non-GAAP Financial Measures, and Item 8 – Note 16.\nOther\nIn addition to cost synergies directly related to the integration of Ameritrade, the Company began taking incremental actions in 2023 to streamline its operations to prepare for post-integration, including through position eliminations and decreasing its real estate footprint. Through these actions, the Company has realized approximately $500 million of incremental run-rate cost savings in addition to integration synergies. In order to achieve these cost savings, the Company incurred total exit and related costs, primarily related to employee compensation and benefits and facility exit costs, of approximately $500 million. Actions under the plan have been completed as of December 31, 2024. Refer to Results of Operations – Total Expenses Excluding Interest, Non-GAAP Financial Measures, and Item 8 – Note 16 for additional information.\nSubsequent Events\nOn February 12, 2025, the Company completed a secondary public offering of common shares through which TD Group US Holdings LLC, an affiliate of The Toronto-Dominion Bank (TD Bank), sold 133.8 million shares of the Company’s common stock and 31.7 million shares of the Company’s nonvoting common stock, which automatically converted into common stock, for an aggregate amount of $13.1 billion. The Company did not receive any of the proceeds from the sale of shares. Subsequent to the completion of the secondary offering, the Company repurchased directly from TD Group US Holdings LLC 19.2 million shares of nonvoting common stock, which automatically converted into common stock, for an aggregate repurchase of $1.5 billion. The repurchase was completed under CSC’s share repurchase authorization. Through the completion of the secondary offering and the Company’s repurchase of nonvoting common stock, TD Bank disposed of all of its common shares of CSC. See Item 8 – Note 28 for additional information. \n- 31 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nCURRENT REGULATORY AND OTHER DEVELOPMENTS\n \nIn September 2024, the SEC adopted amendments to Rules 610 and 612 of Regulation National Market System (NMS) to (i) establish an additional minimum price increment, or “tick size,” for the quoting and trading of certain NMS stocks, (ii) reduce the exchange access fee caps, and (iii) require transparency of odd-lots. In March 2024, the SEC adopted amendments to Rule 605 of Regulation NMS requiring enhanced disclosures of order execution quality for large broker-dealers that handle retail orders. We do not expect the new rules to have a material impact on the Company’s business, financial condition, or results of operations. The following two related equity market structure rule proposals released in December 2022 by the SEC remain pending:\n•\nThe “Order Competition Rule” would require that, before most individual investors’ orders could be executed internally by a trading center (like wholesaler market makers), those orders must first be exposed to a qualifying order-by-order auction in which both market makers and institutional investors can participate.\n•\n“Regulation Best Execution” would establish an SEC-level best execution standard (in addition to the existing FINRA and MSRB best execution rules) for broker-dealers and require them to establish, maintain, and enforce written policies and procedures addressing how the broker-dealer will comply with the best execution standard and make routing or execution decisions for customer orders. Regulation Best Execution would apply not only to equities, but to all securities.\nThe comment periods for the proposed rules ended on March 31, 2023. While the impacts to Schwab of the proposed rules cannot be fully assessed until final rules are released, as proposed, the rules would have a significant impact to numerous aspects of critical equity market structure and the execution of orders for retail investors. Among other impacts, the proposed rules would likely result in increased transaction costs for retail investors which could affect client investment and trading decisions, and would require substantial operational changes for financial intermediaries including the Company.\nIn July 2024, the FDIC issued a notice of proposed rulemaking to amend the brokered deposits framework effective since 2021 (2021 framework) setting forth its conditions for when broker-dealers such as CS&Co that place deposits with depository institutions through brokerage sweep arrangements qualify for the primary purpose exception (PPE) from the definition of a deposit broker, and from attendant restrictions for brokered deposits, under Section 29 of the Federal Deposit Insurance Act. Under the 2021 framework, a broker-dealer qualifies for the PPE if less than 25 percent of its customer assets under administration for a particular business line are placed at depository institutions. Among other changes, the FDIC is proposing a new framework that would revert back to the 10 percent threshold it applied to broker-dealers prior to 2021. The proposed new framework, certain alternatives, and other amendments described in the notice were subject to a public comment period that ended on November 21, 2024. The impacts to Schwab from any ultimate changes will depend on further clarification of definitions and requirements in any final rule.\nIn April 2024, the U.S. Department of Labor adopted a final rule to significantly broaden the definition of “fiduciary” under the Employee Retirement Income Security Act of 1974. Among other requirements, the rule, in conjunction with associated prohibited transaction exemptions (PTEs), subjects broker-dealers who provide non-discretionary investment advice to retirement plans and accounts to a “best interest” standard. The rule was scheduled to take effect September 23, 2024, with a one-year transition period for certain PTE provisions. On July 25 and 26, 2024, in two separate industry lawsuits seeking to vacate the rule, federal district court judges stayed effectiveness of the rule pending resolution of litigation.\nIn November 2023, the FDIC approved a final special assessment to recover losses incurred by the Deposit Insurance Fund (DIF) to protect uninsured depositors due to the March 2023 closures of two banks, which was subject to potential extension and a potential one-time final special assessment for any shortfall in the DIF. The pre-tax impact of the final rule’s initial assessment to the Company was $172 million, which was tax deductible and was recognized in earnings in the fourth quarter of 2023. In late February 2024, the FDIC notified banks, including the Company’s banking subsidiaries, that the estimated assessed losses to the DIF increased. Accordingly, the Company recognized additional pre-tax charges totaling $30 million during 2024, which are tax deductible. The Company paid its first amount on the special assessment in the second quarter of 2024 and expects the remaining collection period to be the next 18 months. The FDIC has indicated that its special assessments and related collection period remain subject to further refinement. \nIn August 2023, the U.S. federal banking agencies issued a proposed rulemaking on long-term debt requirements for certain large banking organizations. Among other things, the proposed rule would require CSC to maintain outstanding minimum levels of eligible long-term debt, as defined by the proposed rule, issued externally. The proposed rule would also require our banking subsidiaries to maintain outstanding minimum levels of eligible long-term debt, which our banking subsidiaries would \n- 32 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nbe required to issue internally to CSC. The proposed rule would be phased-in over a three-year transition period. The comment period for the proposed rule ended on January 16, 2024 and the rule proposal is subject to further modification. The proposed rule could have a significant impact on the amount of debt that CSC and our banking subsidiaries are required to maintain. \nIn July 2023, the U.S. federal banking agencies issued a notice of proposed rulemaking with amendments to the regulatory capital rules. Among other things, the proposed rules would require us to include AOCI in regulatory capital and to calculate our risk-weighted assets using a revised risk-based approach, a component of which is based on operational risk, phased in over a three-year transition period beginning July 1, 2025 and ending July 1, 2028. The comment period for the proposed rules ended on January 16, 2024. The impact of the proposal would be significant to Schwab, as the proposed rules could increase regulatory capital requirements for consolidated CSC and our banking subsidiaries. In anticipation of the rules being adopted, the Company’s capital management for consolidated CSC and our banking subsidiaries now incorporates measures that are inclusive of AOCI. See Capital Management for additional information.\nIn November 2022, the SEC proposed a rule which, among other provisions, would have required substantial changes to the liquidity risk management programs for open-end mutual funds other than money market funds (funds), including implementation of “swing pricing” adjustments to net asset value (NAV) upon exceeding a 2% redemption threshold; and a daily “hard close” on the acceptance of purchase and redemption orders for pricing at that day’s NAV. In August 2024, the SEC adopted portions of the proposed rule but declined to adopt the requirements for swing pricing and a hard close. We do not expect the rule as adopted to have a material impact to the Company’s business, financial condition, or results of operations. \nRESULTS OF OPERATIONS\nTotal Net Revenues\nThe following table presents a comparison of revenue by category: \nYear Ended December 31,\n2024\n2023\n2022\nPercent Change\n2024-2023\nAmount\n% of\nTotal Net\nRevenues\nAmount\n% of\nTotal Net\nRevenues\nAmount\n% of\nTotal Net\nRevenues\nNet interest revenue\nInterest revenue\n(4)\n%\n$\n15,537 \n79 \n%\n$\n16,111 \n86 \n%\n$\n12,227 \n59 \n%\nInterest expense\n(4)\n%\n(6,393)\n(32)\n%\n(6,684)\n(36)\n%\n(1,545)\n(8)\n%\nNet interest revenue\n(3)\n%\n9,144 \n47 \n%\n9,427 \n50 \n%\n10,682 \n51 \n%\nAsset management and administration fees\nMutual funds, ETFs, and CTFs\n26 \n%\n3,221 \n16 \n%\n2,563 \n13 \n%\n2,055 \n10 \n%\nManaged investing solutions \n(1)\n14 \n%\n2,129 \n11 \n%\n1,868 \n10 \n%\n1,854 \n9 \n%\nOther\n13 \n%\n366 \n2 \n%\n325 \n2 \n%\n307 \n1 \n%\nAsset management and administration fees\n20 \n%\n5,716 \n29 \n%\n4,756 \n25 \n%\n4,216 \n20 \n%\nTrading revenue\nCommissions\n(1)\n%\n1,591 \n8 \n%\n1,601 \n9 \n%\n1,787 \n9 \n%\nOrder flow revenue\n5 \n%\n1,477 \n7 \n%\n1,404 \n7 \n%\n1,738 \n8 \n%\nPrincipal transactions\n(13)\n%\n196 \n1 \n%\n225 \n1 \n%\n148 \n1 \n%\nTrading revenue\n \n1 \n%\n3,264 \n16 \n%\n3,230 \n17 \n%\n3,673 \n18 \n%\nBank deposit account fees\n3 \n%\n729 \n4 \n%\n705 \n4 \n%\n1,409 \n7 \n%\nOther\n5 \n%\n753 \n4 \n%\n719 \n4 \n%\n782 \n4 \n%\nTotal net revenues\n4 \n%\n$\n19,606 \n100 \n%\n$\n18,837 \n100 \n%\n$\n20,762 \n100 \n%\n(1) \nManaged investing solutions was formerly referred to as “Advice solutions”.\n- 33 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nNet Interest Revenue\nSchwab’s primary interest-earning assets include cash and cash equivalents; cash and investments segregated; margin loans, which constitute the majority of receivables from brokerage clients; investment securities; and bank loans. Schwab’s interest-bearing liabilities are comprised of bank deposits, which include brokered CDs issued by CSB; payables to brokerage clients; payables to brokers, dealers, and clearing organizations; FHLB borrowings, other short-term borrowings (e.g., commercial paper, repurchase agreements, other secured borrowings); and long-term debt. Schwab deploys the funds from these sources into the assets outlined above. Net interest revenue also includes amounts earned and expenses incurred on securities lending and borrowing activities conducted by our broker-dealer subsidiary using assets held in client brokerage accounts. \nAs Schwab builds its client base, we attract new client sweep cash, which is a primary driver of funding balance sheet growth. We do not use short-term, wholesale borrowings to support our long-term investment activity, but may use such funding for short-term liquidity purposes or to provide temporary funding as we have in recent years. Non-interest-bearing funding sources include stockholders’ equity, certain client cash balances, and other miscellaneous liabilities. \nRevenue on interest-earning assets is affected by various factors, such as the composition of assets, prevailing interest rates and spreads at the time of origination or purchase, changes in interest rates on cash and cash equivalents, floating-rate securities and loans, and changes in prepayment levels for mortgage-backed and other asset-backed securities and loans. Schwab establishes the rates paid on client-related liabilities, and management expects that it will generally adjust the rates paid on these liabilities at some fraction of any movement in short-term rates. Interest expense on long-term debt, FHLB borrowings, other short-term borrowings, and other funding sources is impacted by market interest rates at the time of borrowing and changes in interest rates on floating-rate liabilities. See also Risk Management – Market Risk.\nInterest rates increased significantly beginning late in the first quarter of 2022 through the third quarter of 2023. Short-term rates were near zero until the Federal Reserve began an aggressive tightening cycle in March 2022, ultimately increasing the federal funds target overnight rate eleven times between March 2022 and July 2023 for a total increase of 525 basis points. The Federal Reserve maintained the upper bound of the target overnight rate at 5.50% through most of 2024 before reducing the rate by 50 basis points during the third quarter and another 50 basis points across two cuts during the fourth quarter of 2024. Long-term rates increased throughout 2022 and 2023, generally at a slower pace, thus leading to an inverted yield curve. Long-term rates continued to increase during 2024, primarily in the fourth quarter of 2024 while short-term rates declined, resulting in an upward sloping yield curve as of year-end 2024.\nAverage interest-earning assets decreased $45.6 billion in 2024 from 2023; however, Schwab saw strong client demand for margin and bank lending, which grew by 34% and 12%, respectively. Even as higher interest rates continued for much of the year, the pace of clients’ reallocation of cash from sweep products to higher-yielding investment solutions further decelerated in 2024, particularly in the second half of the year. Bank sweep deposits and payables to brokerage clients increased by a total of $9.8 billion, or 4%, during the third quarter, and $30.1 billion, or 11%, in the fourth quarter of 2024, inclusive of typical seasonal cash inflows near year-end. Deceleration of client cash reallocation activity, along with principal and interest payments on the AFS and HTM securities portfolios, supported a reduction in bank supplemental funding of $14.9 billion, or 23%, during the fourth quarter and $29.7 billion, or 37%, for the full year ended December 31, 2024.\nSchwab’s average interest-earning assets in 2023 were lower compared with 2022, primarily due to clients’ reallocation of cash from sweep products to higher-yielding investment solutions in the second half of 2022 and during 2023, which resulted primarily from the rapid increases to the federal funds overnight rate. These changes in client cash allocations reduced average balances of bank deposits and payables to brokerage clients. To support this client cash allocation activity, the Company utilized bank supplemental funding beginning in the fourth quarter of 2022 and throughout 2023, including drawing upon FHLB secured lending facilities, engaging with external financial institutions in repurchase agreements at its banking subsidiaries, and issuing brokered CDs. The average pace of client cash allocation out of sweep products into higher-yielding investment solutions decreased significantly beginning in the second quarter of 2023, and, apart from an increase in August following the Federal Reserve’s July rate increase, continued to decline during the second half of 2023. In the fourth quarter of 2023, the Company saw bank deposits and payables to brokerage clients increase by a total of $17.5 billion, or 5%, due in part to typical seasonal cash inflows near year-end. \n- 34 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nThe following table presents net interest revenue information corresponding to interest-earning assets and funding sources on the consolidated balance sheets:\nYear Ended December 31,\n2024\n2023\n2022\nAverage\nBalance\nInterest\nRevenue/\nExpense\nAverage\n Yield/\nRate\nAverage\nBalance\nInterest Revenue/\nExpense\nAverage\n Yield/\nRate\nAverage\nBalance\nInterest Revenue/\nExpense\nAverage\n Yield/\nRate\nInterest-earning assets\nCash and cash equivalents\n$\n29,676 \n$\n1,539 \n5.10 \n%\n$\n37,846 \n$\n1,894 \n4.94 \n%\n$\n57,163 \n$\n812 \n1.40 \n%\nCash and investments segregated\n28,450 \n1,443 \n4.99 \n%\n28,259 \n1,355 \n4.73 \n%\n49,430 \n691 \n1.38 \n%\nReceivables from brokerage clients\n70,811 \n5,420 \n7.53 \n%\n61,914 \n4,793 \n7.64 \n%\n75,614 \n3,321 \n4.33 \n%\nAvailable for sale securities \n(1)\n101,659 \n2,166 \n2.12 \n%\n137,178 \n2,987 \n2.17 \n%\n260,392 \n4,139 \n1.58 \n%\nHeld to maturity securities \n(1)\n152,566 \n2,636 \n1.72 \n%\n165,634 \n2,872 \n1.73 \n%\n112,357 \n1,688 \n1.50 \n%\nBank loans\n42,255 \n1,867 \n4.42 \n%\n40,234 \n1,664 \n4.14 \n%\n38,816 \n1,083 \n2.79 \n%\nTotal interest-earning assets\n425,417 \n15,071 \n3.51 \n%\n471,065 \n15,565 \n3.28 \n%\n593,772 \n11,734 \n1.96 \n%\nSecurities lending revenue\n330 \n419 \n471 \nOther interest revenue\n136 \n127 \n22 \nTotal interest-earning assets\n$\n425,417 \n$\n15,537 \n3.61 \n%\n$\n471,065 \n$\n16,111 \n3.39 \n%\n$\n593,772 \n$\n12,227 \n2.04 \n%\nFunding sources\nBank deposits \n(2)\n$\n256,212 \n$\n3,152 \n1.23 \n%\n$\n306,505 \n$\n3,363 \n1.10 \n%\n$\n424,168 \n$\n723 \n0.17 \n%\nPayables to brokers, dealers, and clearing \n  organizations \n(3)\n8,522 \n372 \n4.30 \n%\n4,477 \n147 \n3.23 \n%\n5,884 \n48 \n0.81 \n%\nPayables to brokerage clients\n72,776 \n272 \n0.37 \n%\n66,842 \n271 \n0.41 \n%\n97,825 \n123 \n0.13 \n%\nOther short-term borrowings\n9,146 \n504 \n5.51 \n%\n7,144 \n375 \n5.25 \n%\n2,719 \n48 \n1.75 \n%\nFederal Home Loan Bank borrowings\n23,102 \n1,245 \n5.32 \n%\n34,821 \n1,810 \n5.14 \n%\n2,274 \n106 \n4.59 \n%\nLong-term debt\n23,083 \n846 \n3.66 \n%\n22,636 \n715 \n3.16 \n%\n20,714 \n498 \n2.40 \n%\nTotal interest-bearing liabilities \n(3)\n392,841 \n6,391 \n1.62 \n%\n442,425 \n6,681 \n1.51 \n%\n553,584 \n1,546 \n0.28 \n%\nNon-interest-bearing funding sources\n (3)\n32,576 \n28,640 \n40,188 \nOther interest expense\n2 \n3 \n(1)\nTotal funding sources\n$\n425,417 \n$\n6,393 \n1.49 \n%\n$\n471,065 \n$\n6,684 \n1.41 \n%\n$\n593,772 \n$\n1,545 \n0.26 \n%\nNet interest revenue\n$\n9,144 \n2.12 \n%\n$\n9,427 \n1.98 \n%\n$\n10,682 \n1.78 \n%\n(1)\n Amounts have been calculated based on amortized cost. Interest revenue on investment securities is presented net of related premium amortization.\n(2)\n Average balance includes $37.4 billion, $36.0 billion, and $437 million of brokered CDs in 2024, 2023 and 2022, respectively.\n(3) \nBeginning in 2024, payables to brokers, dealers, and clearing organizations is presented separately from non-interest-bearing funding sources and included in total interest-bearing liabilities. This line item includes securities loaned and related interest expense. Prior period amounts have been reclassified to reflect this change.\nNet interest revenue decreased $283 million, or 3%, in 2024 from 2023 primarily due to lower average interest-earning assets, higher average rates paid on most funding sources, and lower net interest revenue contributed from securities lending, partially offset by growth in margin and bank lending and lower bank supplemental funding. Average interest-earning assets for 2024 were lower by 10% compared to 2023. This decrease was primarily due to lower average bank sweep deposits, reflecting client cash reallocation and strong client engagement in the equity markets, as well as reduction in bank supplemental funding. The decreases in average interest-earning assets in 2024 were partially offset by growth in margin lending, which was supported by higher payables to brokerage clients and increased securities lending, and growth in bank loans. \nNet interest margin increased to 2.12% in 2024, from 1.98% in 2023, as improved average yields on interest-earning assets offset higher rates paid across interest-bearing funding sources.\nThe Company’s average balances of bank supplemental funding were lower in 2024 compared to 2023, which helped contribute to a 14-basis-point year-over-year improvement in net interest margin in 2024. The Company continues to prioritize repayment of bank supplemental funding balances. The total outstanding balance of bank supplemental funding decreased by $14.9 billion and $29.7 billion during the fourth quarter and full year of 2024, respectively. Our use and the financial impacts of such bank supplemental funding is dependent on several factors, including the volume and pace of clients’ cash allocation activity, which is driven primarily by changes in market interest rates, as well as asset gathering and the level of maturities and paydowns on our investment securities portfolios. While client cash realignment activity has continued to decline from peak levels, uncertainty remains, including the path of market interest rates and client behavior, which could significantly impact our utilization of bank supplemental funding sources. The impacts to net interest revenue of using bank supplemental funding sources also depend on the type of funding source used, levels of interest rates, and the use of proceeds. The Company currently expects its outstanding balances of bank supplemental funding sources to decrease over time. Certain balances outstanding at December 31, 2024 will require rollover into new borrowings, the amount and costs of which will depend on the above noted factors. See also Risk \n- 35 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nManagement – Liquidity Risk, Capital Management, Item 8 – Note 12, Note 13, and Note 18 for additional information on these and other funding sources.\nNet interest revenue decreased $1.3 billion, or 12%, in 2023 from 2022 primarily due to increased utilization of higher-cost bank supplemental funding sources to support client cash allocations in the rising rate environment, and lower average interest-earning assets, which more than offset the benefits of higher average yields on interest-earning assets. Net premium amortization of investment securities decreased to $830 million in 2023 from $1.4 billion in 2022 as a result of increases in market interest rates and a smaller investment securities portfolio. Average interest-earning assets for 2023 were lower by 21% compared to 2022, which was primarily due to lower bank deposits and payables to brokerage clients as a result of clients allocating cash out of sweep products into higher-yielding investment solutions due to higher market interest rates. Net interest margin increased to 1.98% in 2023, from 1.78% in 2022, as higher market interest rates improved yields on interest-earning assets, which more than offset the higher rates paid across interest-bearing funding sources.\nAsset Management and Administration Fees\nAsset management and administration fees include mutual fund, ETF, and CTF service fees and fees for other asset-based financial services provided to individual and institutional clients. Schwab earns mutual fund, ETF, and CTF service fees for shareholder services, administration, and investment management provided to its proprietary funds, and recordkeeping and shareholder services provided to third-party funds. Asset management and administration fees are based upon the daily balances of client assets invested in these funds and do not include securities lending revenues earned by proprietary mutual funds, ETFs, and CTFs, as those amounts, net of program fees, are credited to the fund shareholders. Proprietary CTFs may, but generally do not, directly participate in securities lending. The fair values of client assets included in proprietary and third-party mutual funds, ETFs, and CTFs are based on quoted market prices and other observable market data.\nWe also earn asset management fees for managed investing solutions (formerly referred to as advice solutions), which include managed portfolios, specialized strategies, and customized investment advice. Other asset management and administration fees include various asset-based fees, such as trust fees, 401(k) recordkeeping fees, mutual fund clearing fees, and non-balance based service and transaction fees. \nAsset management and administration fees vary with changes in the balances of client assets due to market fluctuations and client activity. \nThe following table presents asset management and administration fees, average client assets, and average fee yields:\nYear Ended December 31,\n2024\n2023\n2022\nAverage\nClient\nAssets\nRevenue\nAverage\nFee\nAverage\nClient\nAssets\nRevenue\nAverage\nFee\nAverage\nClient\nAssets\nRevenue\nAverage\nFee\nSchwab money market funds before fee \n  waivers\n$\n539,113 \n$\n1,461 \n0.27 \n%\n$\n391,864 \n$\n1,034 \n0.26 \n%\n$\n179,791 \n$\n499 \n0.28 \n%\nFee waivers\n— \n— \n(57)\nSchwab money market funds\n539,113 \n1,461 \n0.27 \n%\n391,864 \n1,034 \n0.26 \n%\n179,791 \n442 \n0.25 \n%\nSchwab equity and bond funds, ETFs, and CTFs\n588,999 \n462 \n0.08 \n%\n471,832 \n382 \n0.08 \n%\n433,005 \n364 \n0.08 \n%\nMutual Fund OneSource\n®\n and other NTF funds\n (1)\n342,615 \n878 \n0.26 \n%\n249,131 \n657 \n0.26 \n%\n202,015 \n602 \n0.30 \n%\nOther third-party mutual funds and ETFs \n(1)\n611,999 \n420 \n0.07 \n%\n640,689 \n490 \n0.08 \n%\n768,871 \n647 \n0.08 \n%\nTotal mutual funds, ETFs, and CTFs \n(2)\n$\n2,082,726 \n$\n3,221 \n0.15 \n%\n$\n1,753,516 \n$\n2,563 \n0.15 \n%\n$\n1,583,682 \n$\n2,055 \n0.13 \n%\nManaged investing solutions \n(2)\nFee-based\n$\n542,253 \n$\n2,129 \n0.39 \n%\n$\n458,114 \n$\n1,868 \n0.41 \n%\n$\n441,336 \n$\n1,854 \n0.42 \n%\nNon-fee-based\n111,571 \n— \n— \n96,633 \n— \n— \n89,525 \n— \n— \nTotal managed investing solutions\n$\n653,824 \n$\n2,129 \n0.33 \n%\n$\n554,747 \n$\n1,868 \n0.34 \n%\n$\n530,861 \n$\n1,854 \n0.35 \n%\nOther balance-based fees \n(3)\n776,715 \n286 \n0.04 \n%\n608,170 \n254 \n0.04 \n%\n561,416 \n244 \n0.04 \n%\nOther \n(4)\n80 \n71 \n63 \nTotal asset management and administration fees\n$\n5,716 \n$\n4,756 \n$\n4,216 \n(1)\n In 2023 and 2022, includes transfers from other third-party mutual funds and ETFs to Mutual Fund OneSource\n®\n and other NTF funds.\n(2) \nAverage client assets for managed investing solutions may also include the asset balances contained in the mutual fund and/or ETF categories listed above.\n(3) \nIncludes various asset-related fees, such as trust fees, 401(k) recordkeeping fees, and mutual fund clearing fees and other service fees.\n(4) \nIncludes miscellaneous service and transaction fees relating to mutual funds and ETFs that are not balance-based.\n- 36 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nAsset management and administration fees increased by $960 million, or 20%, in 2024 from 2023, primarily as a \nresult of higher balances in Schwab money market funds as clients shifted their cash allocations to higher-yielding investment solutions. The increase in asset management and administration fees in 2024 was also due to growth in balances in fee-based managed investing solutions and Mutual Fund OneSource\n®\n, as a result of strong equity markets and, for managed investing solutions, net inflows of client assets.\nAsset management and administration fees increased by $540 million, or 13%, in 2023 from 2022, primarily as a \nresult of higher balances in Schwab money market funds and the elimination of fee waivers on those funds \nas well as higher average client asset balances due to stronger equity markets. Money market fund balances increased in 2023 as clients shifted their cash allocations to higher-yielding investment solutions, and money market fund fee waivers were eliminated during 2022, both due primarily to the Federal Reserve’s increases to the federal funds target overnight rate. The increases in asset management and administration fees in 2023 were also due to growth in Schwab equity and bond funds, ETFs, and CTFs, partially offset by lower balances of certain third-party mutual funds and ETFs.\nThe following table presents a roll forward of client assets for the Schwab money market funds, Schwab equity and bond funds, ETFs, and CTFs, and Mutual Fund OneSource and other NTF funds. The following funds generated 49%, 44%, and 33% of the asset management and administration fees earned during 2024, 2023, and 2022, respectively:\nSchwab Money\nSchwab Equity and\nMutual Fund OneSource\n®\nMarket Funds\nBond Funds, ETFs, and CTFs\nand Other NTF Funds\nYear Ended December 31,\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\nBalance at beginning of period\n$\n476,409 \n$\n278,926 \n$\n146,509 \n$\n506,149 \n$\n412,942 \n$\n454,864 \n$\n306,222 \n$\n235,738 \n$\n234,940 \nNet inflows (outflows)\n98,224 \n180,513 \n130,483 \n38,138 \n23,301 \n35,156 \n(24,445)\n(28,741)\n(43,851)\nNet market gains (losses) and other \n(1)\n21,898 \n16,970 \n1,934 \n82,879 \n69,906 \n(77,078)\n66,021 \n99,225 \n44,649 \nBalance at end of period\n$\n596,531 \n$\n476,409 \n$\n278,926 \n$\n627,166 \n$\n506,149 \n$\n412,942 \n$\n347,798 \n$\n306,222 \n$\n235,738 \n(1)\n Includes $39.8 billion and $77.7 billion of transfers from other third-party mutual funds and ETFs to Mutual Fund OneSource\n®\n and Other NTF Funds in 2023 and 2022, respectively.\nTrading Revenue\nTrading revenue includes commissions, order flow revenue, and principal transactions revenue. Commission revenue is affected by volume and mix of trades executed. Order flow revenue is comprised of payments received from trade execution venues to which our broker-dealer subsidiary sends equity and option orders. Order flow revenue is affected by volume and mix of client trades, as well as pricing received from trade execution venues. Principal transactions revenue is recognized primarily as a result of accommodating clients’ fixed income trading activity, and includes adjustments to the fair value of securities positions held to facilitate such client trading activity. Principal transactions revenue also includes unrealized gains and losses on cash and investments segregated for regulatory purposes.\nThe following tables present trading revenue, client trading activity, and related information:\nYear Ended December 31,\nPercent Change\n2024-2023\n2024\n2023\n2022\nCommissions\n(1)\n%\n$\n1,591 \n$\n1,601 \n$\n1,787 \nOrder flow revenue\nOptions\n6 \n%\n1,010 \n949 \n1,170 \nEquities\n3 \n%\n467 \n455 \n568 \nTotal order flow revenue\n5 \n%\n1,477 \n1,404 \n1,738 \nPrincipal transactions\n(13)\n%\n196 \n225 \n148 \nTotal trading revenue\n1 \n%\n$\n3,264 \n$\n3,230 \n$\n3,673 \n- 37 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nYear Ended December 31,\nPercent Change 2024-2023\n2024\n2023\n2022\nDATs (in thousands)\n9 \n%\n5,862 \n5,394 \n5,925 \nProduct as a percentage of DATs\nEquities\n53 \n%\n49 \n%\n50 \n%\nDerivatives\n21 \n%\n23 \n%\n23 \n%\nETFs\n19 \n%\n20 \n%\n21 \n%\nMutual funds\n6 \n%\n6 \n%\n5 \n%\nFixed income\n1 \n%\n2 \n%\n1 \n%\nNumber of trading days\n1 \n%\n250.5 \n249.0 \n250.5 \nRevenue per trade \n(1)\n(8)\n%\n$\n2.22 \n$\n2.41 \n$\n2.47 \n(1)\n Revenue per trade is calculated as trading revenue divided by the product of DATs multiplied by the number of trading days.\nTrading revenue increased $34 million, or 1%, in 2024 compared to 2023, driven by an increase in order flow revenue reflecting higher volume and changes in the mix of client trading activity. This increase was offset by a decrease in principal transactions revenue due to lower volume in fixed income trading and lower market interest rates. Commission revenue was relatively flat due to higher volume offset by changes in the mix of client trading activity. \nTrading revenue decreased $443 million, or 12%, in 2023 compared to 2022, primarily due to lower options order flow revenue from changes in the mix of client trading activity and narrower quoted spreads in the options market, and lower equity order flow revenue reflecting a shift toward more low-price securities and lower equity trading activity overall. Additionally, commissions decreased as a result of lower client trading activity and fewer trading days. Partially offsetting the decrease in 2023 compared to 2022, principal transactions revenue increased as a result of higher volume in clients’ fixed income trading and higher market interest rates.\nBank Deposit Account Fees\nThe Company earns bank deposit account fee revenue from the TD Depository Institutions. These fees are affected by changes in interest rates and the composition of balances designated as fixed- and floating-rate obligation amounts.\nThe following table presents bank deposit account fee revenue and related information:\nYear Ended December 31,\nPercent Change\n2024-2023\n2024\n2023\n2022\nBank deposit account fees\n3 \n%\n$\n729 \n$\n705 \n$\n1,409 \nAverage BDA balances\n(17)\n%\n$\n86,846 \n$\n104,227 \n$\n147,273 \nAverage net yield\n0.84 \n%\n0.68 \n%\n0.96 \n%\nPercentage of average BDA balances designated as:\nFixed-rate balances\n86 \n%\n92 \n%\n79 \n%\nFloating-rate balances\n14 \n%\n8 \n%\n21 \n%\nBank deposit account fees increased $24 million, or 3%, in 2024 compared to 2023. This increase reflected the impact of breakage fees of $97 million incurred in 2023 as a result of ending other third-party bank arrangements and a decrease in the amount paid to clients due to interest rates declining in the third and fourth quarters of 2024, partially offset by lower average BDA balances. The decrease in average BDA balances in 2024 compared to 2023 was primarily due to client cash allocation decisions in response to higher short-term market interest rates. Average net yield increased in 2024 compared to 2023 due to the breakage fees incurred in 2023 and an increase in the average amount of and average net yield on floating-rate BDA balances, which was partially offset by a decrease in average net yield on fixed-rate BDA balances. The percentages of BDA balances designated as fixed-rate and floating-rate obligation amounts as of December 31, 2024 were 76% and 24%, respectively.\nBank deposit account fees decreased by $704 million, or 50%, in 2023 compared to 2022. The decrease was primarily due to lower average BDA balances, an increase in the amount paid to clients due to higher interest rates, and the breakage fees incurred in 2023. These factors contributed to the decrease in average net yield in 2023 compared to 2022. The decrease in average BDA balances in 2023 compared to 2022 was primarily due to client cash allocation decisions in response to rising short-term market interest rates throughout 2022 and through the first three quarters of 2023. The percentages of BDA balances designated as fixed-rate and floating-rate obligation amounts as of December 31, 2023 were 86% and 14%, respectively.\n- 38 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nOther Revenue\nOther revenue includes industry fees (formerly referred to as exchange processing fees), certain service fees, other gains and losses from the sale of assets, and the provision for credit losses on bank loans.\nOther revenue increased $34 million, or 5%, in 2024 compared to 2023 primarily due to higher industry fees and lower losses recognized on sales of AFS securities, partially offset by certain lower service and other fees and a smaller release from the provision for credit losses on bank loans. Industry fees increased in 2024 due to higher average SEC fee rates in effect during 2024 compared to 2023. Effective May 22, 2024, the SEC increased its fee rate applicable to most securities transactions from the rate in effect since late February 2023.\nOther revenue decreased $63 million, or 8%, in 2023 compared to 2022 primarily due to lower industry fees, net losses on sales of AFS securities, and certain lower service and other fees, partially offset by lower provision for credit losses on bank loans. Industry fees decreased primarily due to a decrease in the SEC fee rate which became effective in the first quarter of 2023 and lower year-to-date options volume. The provision for credit losses on bank loans was lower as loan loss factors decreased while the total balance of First Mortgages increased slightly compared to year-end 2022. The Company’s provision for credit losses on bank loans in 2022 reflected increased loan loss factors driven primarily by higher forecasted interest rates earlier in the Federal Reserve’s monetary tightening, as well as growth in the loan portfolio. In addition, other revenue in 2022 included $46 million in gains on the sale of Schwab Compliance Technologies, Inc. and certain investments.\nTotal Expenses Excluding Interest\nThe following table shows a comparison of total expenses excluding interest:\nPercent Change 2024-2023\n2024\n2023\n2022\nCompensation and benefits\nSalaries and wages\n(13)\n%\n$\n3,530 \n$\n4,046 \n$\n3,527 \nIncentive compensation\n20 \n%\n1,488 \n1,239 \n1,458 \nEmployee benefits and other\n— \n1,025 \n1,030 \n951 \nTotal compensation and benefits\n(4)\n%\n$\n6,043 \n$\n6,315 \n$\n5,936 \nProfessional services\n— \n1,053 \n1,058 \n1,032 \nOccupancy and equipment\n(15)\n%\n1,060 \n1,254 \n1,175 \nAdvertising and market development\n— \n397 \n397 \n419 \nCommunications\n(6)\n%\n591 \n629 \n588 \nDepreciation and amortization\n14 \n%\n916 \n804 \n652 \nAmortization of acquired intangible assets\n(3)\n%\n519 \n534 \n596 \nRegulatory fees and assessments\n(27)\n%\n398 \n547 \n262 \nOther\n2 \n%\n937 \n921 \n714 \nTotal expenses excluding interest\n(4)\n%\n$\n11,914 \n$\n12,459 \n$\n11,374 \nExpenses as a percentage of total net revenues\nCompensation and benefits\n31 \n%\n34 \n%\n29 \n%\nAdvertising and market development\n2 \n%\n2 \n%\n2 \n%\nFull-time equivalent employees (in thousands)\nAt year end\n(3)\n%\n32.1\n33.0\n35.3\nAverage\n(9)\n%\n32.3\n35.4\n34.7\nTotal expenses excluding interest decreased $545 million, or 4%, in 2024 from 2023, and increased $1.1 billion, or 10%, in 2023 from 2022. Adjusted total expenses, which excludes acquisition and integration-related costs, amortization of acquired intangible assets, and, beginning in the third quarter of 2023, restructuring costs, increased $240 million, or 2%, in 2024 from 2023 and $643 million, or 6%, in 2023 from 2022. See Non-GAAP Financial Measures for further details and a reconciliation of such measures to GAAP reported results. The overall decrease in expenses in 2024 reflected lower restructuring costs and lower acquisition and integration-related costs, as substantially all costs related to the Company’s restructuring were incurred in 2023, and spending for the Ameritrade integration decreased in 2024 as we completed final integration activities. We currently anticipate total expenses excluding interest in full-year 2025 will increase approximately 3.5% to 4.5% from 2024, and adjusted total expenses in full-year 2025 will increase approximately 4.5% to 5.5%. See Non-GAAP Financial Measures.\n- 39 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nTotal compensation and benefits decreased in 2024 from 2023 primarily due to restructuring costs recognized in 2023, as well as lower headcount as a result of position eliminations from the restructuring and Ameritrade integration. These decreases were partially offset by higher incentive compensation and annual merit increases. The 2023 increase was a result of restructuring costs recognized during the second half of 2023 related to position eliminations, higher average employee headcount to support Ameritrade client account transitions, and annual merit increases, partially offset by lower incentive compensation. Compensation and benefits included acquisition and integration-related costs of $54 million, $187 million, and $220 million in 2024, 2023, and 2022, respectively. Compensation and benefits also included a $34 million benefit in 2024, due to a change in estimated restructuring costs, and included restructuring costs of $292 million in 2023\n.\nProfessional services expense remained consistent in 2024 compared to 2023. The increase in 2023 from 2022 was primarily due to increased utilization of professional services to support overall growth of the business. Professional services included acquisition and integration-related costs of $36 million, $135 million, and $140 million in 2024, 2023, and 2022, respectively.\nOccupancy and equipment expense decreased in 2024 from 2023, due to lower technology equipment and software costs, lower property tax expense, and lower occupancy costs as a result of facility closures in 2023 related to restructuring and the Ameritrade integration. The increase in 2023 from 2022 was primarily due to an increase in software maintenance and other agreements as well as other technology equipment costs to support growth of the business and the integration of Ameritrade. Occupancy and equipment included restructuring costs of $5 million and $17 million in 2024 and 2023, respectively, and acquisition and integration-related costs of $28 million and $21 million in 2023 and 2022, respectively.\nAdvertising and market development expense remained consistent in 2024 compared to 2023, as higher client promotional spending was offset by lower spending on digital advertising. The decrease in 2023 from 2022 was primarily a result of lower advertising costs and lower client promotional spending for Ameritrade.\nCommunications expense decreased in 2024 compared to 2023, due to lower exchange quotation services expenses. The increase in 2023 compared to 2022 was primarily as a result of client communications related to Ameritrade account transitions completed during 2023.\nDepreciation and amortization expense increased in 2024 from 2023, and in 2023 from 2022, primarily as a result of higher amortization of purchased and internally developed software and higher depreciation of hardware, driven by capital expenditures to support growth of the business and, in 2023, to support the Ameritrade integration.\nAmortization of acquired intangible assets decreased in 2024 from 2023, and in 2023 from 2022, primarily as certain assets from the Ameritrade acquisition were fully amortized during 2023 and 2022.\nRegulatory fees and assessments decreased in 2024 from 2023, primarily due to a $172 million FDIC special assessment recorded during the fourth quarter of 2023, partially offset by $30 million of incremental FDIC special assessments in 2024. The increase in 2023 from 2022 was primarily as a result of the FDIC special assessment described above and higher FDIC deposit insurance assessments during 2023, reflecting greater use of brokered CDs and a 2-basis point increase to the FDIC deposit insurance assessment rate, which became effective for the first quarterly assessment period in 2023. These increases were partially offset by a lower assessment base. See Current Regulatory and Other Developments for discussion of the FDIC special assessments. \nOther expense increased in 2024 from 2023, primarily due to higher industry fees, partially offset by impairment charges recorded in 2023 related to restructuring. Industry fees increased primarily due to higher average SEC fee rates in effect during 2024 compared to 2023. Effective May 22, 2024, the SEC increased its fee rate applicable to most securities transactions from the rate in effect since late February 2023. The increase in other expense in 2023 from 2022 was primarily due to impairment charges in 2023 related to closing certain leased corporate offices for restructuring and Ameritrade integration. Other expense included restructuring costs of $37 million and $181 million in 2024 and 2023, respectively, and acquisition and integration-related costs of $27 million in 2023.\nCapital expenditures primarily include capitalized software costs, information technology and telecommunications equipment, and buildings. Total capital expenditures were $607 million, $804 million, and $952 million in 2024, 2023, and 2022, respectively. Capital expenditures decreased 25% in 2024 compared to 2023, primarily due to lower purchased and internally developed software as we completed Ameritrade client account transitions in the second quarter of 2024 and completed the Ameritrade integration, partially offset by higher investment in buildings. Capital expenditures decreased in 2023 compared to 2022, as lower capitalized information technology equipment and buildings more than offset an increase in capitalized software \n- 40 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\ncosts. We continued to invest in our technological infrastructure in 2023 to support the Ameritrade integration as well as greater capacity for our expanding client base. \nCapital expenditures were 3.1% of total net revenues in 2024, within our estimated range for the year. We anticipate capital expenditures for 2025 to be within our longer term expectation of 3-5% of total net revenues.\nTaxes on Income\nSchwab’s effective income tax rate on income before taxes was 22.8% in 2024, 20.6% in 2023, and 23.5% in 2022. The increase in the effective tax rate in 2024 from 2023 was primarily due to an increase in state tax expense and the recognition of certain tax credits during 2023, partially offset by additional tax credits recognized and the reversal of tax reserves due to the resolution of certain state tax matters during 2024. The decrease in the effective tax rate in 2023 from 2022 was primarily due to a decrease in state tax expense and the recognition of certain tax credits in 2023, partially offset by an increase in non-deductible FDIC deposit insurance assessments and a decrease in equity compensation tax deduction benefits.\nSegment Information\nRevenues and expenses are attributed to the two segments based on which segment services the client. Management evaluates the performance of the segments on a pre-tax basis. Segment assets and liabilities are not used for evaluating segment performance or in deciding how to allocate resources to segments. Net revenues in both segments are generated from the underlying client assets and trading activity; differences in the composition of net revenues between the segments are based on the composition of client assets, client trading frequency, and pricing unique to each. While both segments leverage the scale and efficiency of our platforms, segment expenses reflect the dynamics of serving millions of clients in Investor Services versus the thousands of RIAs on the Advisor Services platform. See Item 8 – Note 25 for additional segment information. \n- 41 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nFinancial information for our segments is presented in the following table \n(1)\n:\nInvestor Services\nAdvisor Services\nTotal\nPercent Change\n2024-2023\n2024\n2023\n2022\nPercent Change\n2024-2023\n2024\n2023\n2022\nPercent Change\n2024-2023\n2024\n2023\n2022\nYear Ended December 31,\nNet Revenues\n \n \n \n \n \n \nNet interest revenue\n2%\n$\n7,317 \n$\n7,193\n$\n7,936 \n(18)%\n$\n1,827 \n$\n2,234 \n$\n2,746 \n(3)%\n$\n9,144 \n$\n9,427 \n$\n10,682 \nAsset management and \n  administration fees\n19%\n4,146 \n3,492\n3,141 \n24%\n1,570 \n1,264 \n1,075 \n20%\n5,716 \n4,756 \n4,216 \nTrading revenue\n3%\n2,895 \n2,821\n3,196 \n(10)%\n369 \n409 \n477 \n1%\n3,264 \n3,230 \n3,673 \nBank deposit account fees\n4%\n568 \n546\n952 \n1%\n161 \n159 \n457 \n3%\n729 \n705 \n1,409 \nOther\n6%\n632 \n598\n621 \n—\n121 \n121 \n161 \n5%\n753 \n719 \n782 \nTotal net revenues\n6%\n15,558 \n14,650\n15,846 \n(3)%\n4,048 \n4,187 \n4,916 \n4%\n19,606 \n18,837 \n20,762 \nExpenses Excluding Interest\nCompensation and\n  benefits\n(3)%\n4,656 \n4,779 \n4,551 \n(10)%\n1,387 \n1,536 \n1,385 \n(4)%\n6,043 \n6,315 \n5,936 \nProfessional services\n1%\n834 \n824 \n809 \n(6)%\n219 \n234 \n223 \n—\n1,053 \n1,058 \n1,032 \nOccupancy and equipment\n(13)%\n823 \n951 \n889 \n(22)%\n237 \n303 \n286 \n(15)%\n1,060 \n1,254 \n1,175 \nAdvertising and market \n  development\n(14)%\n256 \n296 \n316 \n40%\n141 \n101 \n103 \n—\n397 \n397 \n419 \nCommunications\n(6)%\n415 \n441 \n411 \n(6)%\n176 \n188 \n177 \n(6)%\n591 \n629 \n588 \nDepreciation and \n  amortization\n18%\n716 \n609 \n483 \n3%\n200 \n195 \n169 \n14%\n916 \n804 \n652 \nAmortization of acquired \n  intangible assets\n(1)%\n445 \n449 \n489 \n(13)%\n74 \n85 \n107 \n(3)%\n519 \n534 \n596 \nRegulatory fees and \n  assessments\n(20)%\n311 \n387 \n197 \n(46)%\n87 \n160 \n65 \n(27)%\n398 \n547 \n262 \nOther\n11%\n782 \n703 \n568 \n(29)%\n155 \n218 \n146 \n2%\n937 \n921 \n714 \nTotal expenses \n  excluding interest\n(2)%\n9,238 \n9,439 \n8,713 \n(11)%\n2,676 \n3,020 \n2,661 \n(4)%\n11,914 \n12,459 \n11,374 \nIncome before taxes \n  on income\n21%\n$\n6,320 \n$\n5,211\n$\n7,133 \n18%\n$\n1,372 \n$\n1,167 \n$\n2,255 \n21%\n$\n7,692 \n$\n6,378 \n$\n9,388 \nNet new client assets\n  (in billions) \n(2)\n(11)%\n$\n161.1 \n$\n181.3\n$192.9\n29%\n$\n200.5 \n$\n155.9 \n$\n214.0 \n7%\n$\n361.6 \n$\n337.2 \n$\n406.9 \n(1) \nIn connection with certain changes in Schwab’s organizational management structure, in the fourth quarter of 2024, the Retirement Business Services business unit was transferred from the Advisor Services segment to the Investor Services segment. Accordingly, amounts related to the Retirement Business Services business unit are included within Investor Services for full-year 2024, and prior-year amounts have been recast to reflect this new basis of segmentation.\n(2) \nIn 2024, Investor Services includes net outflows of $14.6 billion from off-platform brokered CDs issued by CSB, an inflow of $10.3 billion from a mutual fund clearing services client, and outflows of $0.7 billion from an international relationship. In 2023, Investor Services includes net inflows of $32.5 billion from off-platform brokered CDs issued by CSB, inflows of $12.0 billion from a mutual fund clearing services client, and outflows of $5.8 billion from an international relationship. In 2022, Investor Services includes outflows of $20.8 billion from mutual fund clearing services clients. In 2024 and 2023, Advisor Services includes outflows of $0.3 billion and $7.2 billion, respectively, from an international relationship.\nSegment Net Revenues\nInvestor Services total net revenues increased by 6% in 2024 compared to 2023. Net interest revenue increased for Investor Services primarily due to growth of margin lending and lower average balances of FHLB borrowings, partially offset by lower average interest-earning assets and higher average rates paid on most funding sources. Trading revenue increased for Investor Services due to higher order flow revenue as a result of increased trading volumes and changes in the mix of trading activity. Other revenue increased for Investor Services primarily due to higher industry fees and lower losses recognized on sales of AFS securities. Advisor Services total net revenues decreased by 3% in 2024 compared to 2023. Net interest revenue decreased for Advisor Services primarily as a result of lower average interest-earning assets and higher average rates paid on most funding sources, partially offset by lower average balances of FHLB borrowings, and trading revenue decreased for Advisor Services, primarily due to lower order flow revenue as a result of changes in the mix of client trading activity. Asset management and administration fees increased for both segments, primarily as a result of higher balances in money market funds and Mutual Fund OneSource, and, additionally for Investor Services, fee-based managed investing solutions. Additionally, bank deposit account fees increased for both segments, primarily due to breakage fees incurred that resulted in lower bank deposit account fee revenue in 2023, partially offset by lower BDA balances.\nInvestor Services and Advisor Services total net revenues decreased by 8% and 15%, respectively, in 2023 compared to 2022. Net interest revenue decreased for both segments due to higher-cost funding sources and lower average interest-earning asset balances, as described above. Both segments saw a decrease in bank deposit account fees due to lower average BDA balances \n- 42 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nand higher yields paid to clients, as well as breakage fees incurred as a result of ending certain third-party bank arrangements. Trading revenue decreased for both segments, primarily as a result of lower order flow revenue and commissions, due to lower client trading activity and pricing, partially offset by higher fixed income trading activity. Other revenue decreased for both segments primarily due to lower industry fees, net losses on sales of AFS securities, and gains on the sale of certain investments in 2022, partially offset by lower provision for credit losses on bank loans. These decreases were partially offset by higher asset management and administration fees in both segments, primarily as a result of higher money market fund balances and the elimination of money market fund fee waivers during 2022 and growth in Schwab proprietary fund products, partially offset by lower balances in certain third-party funds.\nSegment Expenses Excluding Interest\nInvestor Services and Advisor Services total expenses excluding interest decreased 2% and 11%, respectively, in 2024 compared to 2023. Compensation and benefits expense decreased in both segments, primarily due to restructuring costs recognized in 2023 and lower headcount as a result of position eliminations, partially offset by higher incentive compensation and annual merit increases. Occupancy and equipment expense decreased in both segments, primarily due to lower technology equipment and software costs, lower property tax expense, and facility closures in 2023 related to restructuring and the Ameritrade integration. For Investor Services, depreciation and amortization expense increased, primarily due to higher amortization of purchased and internally developed software, driven by capital expenditures in 2023 and 2024 to enhance our technological infrastructure to support growth of the business. Regulatory fees and assessments decreased in both segments in 2024, primarily due to an FDIC special assessment recorded during the fourth quarter of 2023, partially offset by additional FDIC special assessments in 2024, as described above. Other expense increased for Investor Services primarily due to higher industry fees, partially offset by impairment charges recorded in 2023 related to restructuring. Other expense decreased for Advisor Services primarily due to impairment charges recorded in 2023 related to restructuring and lower clearing charges.\nInvestor Services and Advisor Services total expenses excluding interest increased by 8% and 13%, respectively, in 2023 compared to 2022. Both segments saw higher compensation and benefits expenses due to restructuring costs recognized in the second half of 2023, higher average headcount to support Ameritrade client account transitions, and annual merit increases, partially offset by lower incentive compensation. Regulatory fees and assessments increased in both segments, primarily due to an FDIC special assessment recorded during the fourth quarter of 2023 and higher FDIC deposit insurance assessments as described above. Other expenses were also higher for both segments, primarily driven by impairment of certain leased corporate offices related to restructuring and Ameritrade integration. Depreciation and amortization increased for both segments primarily due to higher amortization of purchased and internally developed software and higher depreciation of hardware, driven by capital expenditures in 2022 and 2023 to enhance our technological infrastructure to support the Ameritrade integration and growth of the business. \nRISK MANAGEMENT\nSchwab’s business activities expose it to a variety of risks, including operational, compliance, credit, market, and liquidity risks. The Company has a comprehensive risk management program to identify and manage these risks and their associated potential for financial and reputational impact. Our risk management process is comprised of risk identification and assessment, risk response, risk measurement and monitoring, and risk reporting and escalation. We use periodic risk and control self-assessments, control testing programs, and our internal audit department performs evaluations of our risk management processes and controls. \nCulture\nA fundamental commitment to strong and effective risk management is core to Schwab’s business strategy. Risk management is an integrated and foundational part of our culture and a duty of every employee. The Board of Directors has approved an Enterprise Risk Management (ERM) Framework that incorporates our purpose, vision, and values, which form the bedrock of our corporate culture and set the tone for the organization. We designed the ERM Framework to enable a comprehensive approach to managing risks encountered by Schwab in its business activities. The ERM Framework incorporates key concepts commensurate with the size, risk profile, complexity, and continuing growth of the Company. While all personnel are responsible for risk management, the Company’s risk appetite, which is defined as the amount of risk the Company is willing to accept in pursuit of its corporate strategy, is developed by executive management and approved by the Board of Directors.\nThe Company’s “Through Clients’ Eyes” strategy guides our actions and behaviors at Schwab, and informs our corporate culture, our risk appetite, and approach to risk management. Schwab is committed to the highest standards of ethical conduct and \n- 43 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\ncompliance with applicable laws, rules, and regulations, and our Code of Business Conduct and Ethics outlines the ethical conduct that we must demonstrate to deliver our strategy while retaining the trust of our stakeholders.\nRisk Governance\nSchwab maintains an integrated risk governance structure that directs Company-wide execution of the risk management process. The risk governance structure includes the Board of Directors, designated committees of the Board, and management risk committees. \nCSC’s Board of Directors sets the tone and culture of effective risk management. The Board has a Risk Committee that assists the Board in setting the type and level of risks that the Company is willing to take and supports the independence and stature of independent risk management. The Board Risk Committee also assists the Board in overseeing and holding senior management accountable for implementing the Board’s approved risk appetite, maintaining the Company’s risk management and control processes, and managing the Company’s activities in a safe and sound manner, and in compliance with applicable laws and regulations. The Board Risk Committee also approves risk appetite statements and related key risk appetite metrics, key risk policies, and reviews information relating to risk issues from functional areas of corporate risk management, legal, and internal audit.\nThe Audit Committee of the Board of Directors assists the Board in fulfilling its oversight responsibilities by reviewing the integrity of the Company’s financial statements and financial reporting processes, the qualifications and independence of the independent auditors and performance of the Company’s internal audit function and independent auditors, compliance with legal and regulatory requirements, processes to assess and manage risk exposures, and other matters as directed by the Board. The Compensation Committee of the Board of Directors assists the Board in oversight of compensation of the Company’s directors, executive officers, and other senior officers. The Board Nominating and Corporate Governance Committee assists the Board in its oversight responsibilities regarding Board composition, performance, and developing corporate governance principles, policies, and procedures.\nSenior management takes an active role in the risk management process and has developed policies and procedures under which specific business and control units are responsible for risk identification and assessment, risk response, risk measurement and monitoring, and risk reporting and escalation. The Global Risk Committee, which is comprised of senior executives from each client enterprise and support function, is responsible for the oversight of risk management. This includes identifying emerging risks, assessing risk management practices and the control environment, reinforcing business accountability for risk management, supervisory controls and regulatory compliance, supporting resource prioritization across the organization, and escalating significant issues to the Board of Directors. The Chief Risk Officer regularly reports activities of the Global Risk Committee to the Risk Committee of the Board of Directors. \nWe have established risk metrics and reporting that enable measurement of the impact of strategy execution against risk appetite. The risk metrics, with risk limits and tolerance levels, are established for key risk categories by the Global Risk Committee and its functional risk sub-committees. Functional risk sub-committees focusing on specific areas of risk report to the Global Risk Committee. These sub-committees include the:\n•\nOperational Risk Oversight Committee – provides oversight of and approves operational risk management policies, risk tolerance levels, and operational risk governance processes, and includes sub-committees covering Information Security and Cybersecurity, Technology, Fraud, Third-Party Risk, Data Integrity, and Model Governance;\n•\nCompliance Risk Committee – provides oversight of compliance risk management (inclusive of compliance programs for Schwab’s regulated entities, Anti-Money Laundering/Sanctions, Conduct, Fiduciary, Conflicts of Interest, and Privacy), policies, and risk tolerance levels providing an aggregate view of compliance risk exposure and employee conduct, including subcommittees covering Fiduciary and Conflicts of Interest Risk;\n•\nFinancial Risk Oversight Committee – provides oversight of and approves credit, market, liquidity, and capital risk policies, limits, and exposures and includes the Liquidity and Capital Subcommittee; and\n•\nNew Products and Services Risk Oversight Committee – provides oversight of, and approves new products, including the policy, program, and process designed to oversee new products and services risks prior to and post launch.\nSenior management created the Incentive Compensation Risk Oversight Committee to provide oversight of incentive compensation risks and achieve sound incentive compensation risk management practices; it reports directly to the Compensation Committee of the Board of Directors. \n- 44 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nThe Company’s finance, internal audit, legal, and corporate risk management departments assist management and the various risk committees in evaluating, testing, and monitoring risk management.\nIn addition, the Disclosure Committee is responsible for monitoring and evaluating the effectiveness of our disclosure controls and procedures and internal control over financial reporting as of the end of each fiscal quarter. The Disclosure Committee reports on this evaluation to the CEO and CFO prior to their certification required by Sections 302 and 906 of the Sarbanes Oxley Act of 2002.\nOperational Risk\nOperational risk arises due to potential inadequacies or failures related to internal processes, people, and systems, or from external events or relationships impacting the Company and/or any of its key business partners and vendors. While operational risk is inherent in all business activities, the Company has established a system of internal controls and risk management practices designed to keep operational risk and operational losses within the Company’s risk appetite. We have specific policies and procedures to identify and manage operational risk, and perform periodic testing to evaluate the effectiveness of relevant internal controls. Where appropriate, we manage the impact of operational loss and litigation expense through the purchase of insurance. The insurance program is specifically designed to address our key operational risks and to maintain compliance with local laws and regulations.\nSchwab’s operations are highly dependent on the integrity and resilience of our critical business functions and technology systems. To the extent Schwab experiences business or system interruptions, errors or downtime (which could result from a variety of causes, including natural disasters, terrorist attacks, technological failure, cyber attacks, changes to systems, linkages with third-party systems, extreme weather, and power failures), our business and operations could be negatively impacted. To minimize business interruptions and ensure the capacity to continue operations during an incident regardless of duration, Schwab maintains a backup and recovery infrastructure which includes facilities for backup and communications, a geographically dispersed workforce, and routine testing of business continuity and disaster recovery plans and a well-established incident management program. Please see Part I – Item 1C. Cybersecurity for additional information regarding Information Security risk, including cybersecurity risk management.\nFraud risk arises from attempted or actual theft of financial assets or other property of any client or the Company. Fraud risk includes internal fraud, or the risk arising from personnel attempting or committing theft of financial assets or other property of any client or the Company. Schwab is committed to protecting the Company’s and its clients’ assets from fraud and complying with all applicable laws and regulations to prevent, detect, and report fraudulent activity. Schwab manages fraud risk through policies, procedures, and controls. We also take affirmative steps to prevent and detect fraud and report, to appropriate authorities, any known or suspected acts of fraud in accordance with existing laws and requirements.\nSchwab also faces operational risk when we employ the services of various third parties, including domestic and international outsourcing of certain technology, processing, servicing, and support functions. We manage the exposure to third-party risk and promote a culture of resiliency through internal policies, procedures and controls, and contractual provisions, control standards, ongoing monitoring of third-party performance, and appropriate testing with third-party service providers. \nModel risk is the potential for adverse consequences from decisions based on incorrect or misused model outputs and reports. Model uses at Schwab include, but are not limited to, calculating capital requirements for hypothetical stressful environments, estimating interest and credit risk for loans and other balance sheet assets, identifying and preventing fraud and other financial crimes, and providing guidance in the management of client portfolios. Schwab manages model risk, including use of artificial intelligence, through use of policies, standards, and controls which evaluate the conceptual and technical soundness of models used by the Company. We maintain a model inventory that includes a distinct record and risk rating for each model, and we conduct independent validations, annual reviews, and performance monitoring of the Company’s models. \nCompliance Risk\nSchwab faces compliance risk which is the potential exposure to legal or regulatory sanctions, fines or penalties, financial loss, or damage to reputation resulting from the failure to comply with laws, regulations, rules, or other regulatory requirements. Among other things, compliance risks relate to the suitability of client investments, consumer protection, conflicts of interest, disclosure obligations and performance expectations for products and services, supervision of employees, the retention of \n- 45 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nrequired records, and the adequacy of our controls. The Company and its affiliates are subject to extensive regulation by federal, state, and foreign regulatory authorities, including SROs. \nWe manage compliance risk through policies, procedures, and controls reasonably designed to achieve and/or monitor compliance with applicable legal and regulatory requirements. These procedures address issues such as conduct and ethics, sales and trading practices, marketing and communications, extension of credit, client funds and securities, books and records, anti-money laundering, privacy, and employment policies. \nPrivacy risk is the risk of unauthorized collection, use, storage, or sharing of personal information, including data incidents and other mismanagement of personal information. We manage privacy risk through policies, procedures, and controls reasonably designed to achieve and/or monitor compliance with these laws and regulations.\nAnti-money laundering/sanctions risk is the risk of legal or regulatory sanctions, fines or penalties, financial loss, or damage to reputation resulting from the failure to comply with the Bank Secrecy Act/Anti-Money Laundering (BSA/AML) and Office of Foreign Assets Control (OFAC)/global sanctions (collectively, “AML”) laws, regulations, rules, or other regulatory requirements. Schwab manages this risk through daily monitoring, a system of internal controls, education and training for appropriate personnel, and developing risk-based procedures for conducting ongoing customer due diligence and complying with beneficial ownership requirements for legal entity customers.\nConduct risk arises from inappropriate, unethical, or unlawful behavior of the Company, its employees or third parties acting on the Company’s behalf that may result in detriment to the Company’s clients, financial markets, the Company, and/or the Company’s employees. We manage this risk through policies, procedures, a system of internal controls, including personnel monitoring and surveillance. Conduct-related matters are escalated through appropriate channels by the Company’s Corporate Responsibility Officer.\nFiduciary risk is the potential for financial or reputational loss through breach of fiduciary duties to a client. Fiduciary activities include, but are not limited to, individual and institutional trust, investment management, custody, and cash and securities processing. We manage this risk by establishing policy and procedures to ensure that obligations to clients are discharged faithfully and in compliance with applicable legal and regulatory requirements. Business units have the primary responsibility for adherence to the policy and procedures applicable to their business. Guidance and control are provided through the creation, approval, and ongoing review of applicable policies by business units and various risk committees.\nIncentive Compensation risk is the potential for adverse consequences resulting from compensation plans that do not balance the execution of our strategy with risk and financial rewards, potentially encouraging imprudent risk-taking by employees. We have implemented risk management processes, including a policy, to identify, evaluate, assess, and manage risks associated with incentive compensation plans and the activities of certain employees, defined as Covered Employees, who have the authority to expose the Company to material amounts of risk.\nCredit Risk\nCredit risk is the potential for loss due to a borrower, counterparty, or issuer failing to perform its contractual obligations. Our exposure to credit risk mainly results from investing activities in our liquidity and investment portfolios, mortgage lending, margin lending and client option and futures activities, pledged asset lending, securities lending activities, and our role as a counterparty in other financial contracts. To manage the risks of such losses, we have established policies and procedures, which include setting and reviewing credit limits, monitoring credit limits and quality of counterparties, and adjusting margin, PAL, option, and futures requirements for certain securities and instruments. \nLiquidity and Investment Portfolios\nSchwab has exposure to credit risk associated with its investment portfolios, which include U.S. agency and non-agency mortgage-backed securities, asset-backed securities, corporate debt securities, U.S. agency notes, U.S. Treasury securities, certificates of deposit, U.S. state and municipal securities, commercial paper, and foreign government agency securities.\nAt December 31, 2024, substantially all securities in the investment portfolios were rated investment grade. U.S. agency mortgage-backed securities do not have explicit credit ratings; however, management considers these to be of the highest credit quality and rating given the guarantee of principal and interest by the U.S. government or U.S. government-sponsored enterprises.\n- 46 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nMortgage Lending Portfolio\nThe bank loan portfolio includes First Mortgages, HELOCs, PALs (discussed below), and other loans. The credit risk exposure related to loans is actively managed through individual loan and portfolio reviews. Management regularly reviews asset quality, including concentrations, delinquencies, nonaccrual loans, charge-offs, and recoveries. All are factors in the determination of an appropriate allowance for credit losses.\nOur residential loan underwriting guidelines include maximum LTV ratios, cash out limits, and minimum Fair Isaac Corporation (FICO) credit scores. The specific guidelines are dependent on the individual characteristics of a loan (for example, whether the property is a primary or secondary residence, whether the loan is for investment property, whether the loan is for an initial purchase of a home or refinance of an existing home, and whether the loan size is conforming or jumbo). \nSchwab does not originate or purchase residential loans that allow for negative amortization and does not originate or purchase subprime loans (generally defined as extensions of credit to borrowers with a FICO score of less than 620 at origination), unless the borrower has compensating credit factors. For more information on credit quality indicators relating to Schwab’s bank loans, see Item 8 – Note 7. \nSecurities and Instrument-Based Lending Portfolios\nCollateral arrangements relating to margin loans, PALs, option and futures positions, securities lending agreements, and securities purchased under agreements to resell (resale agreements) include provisions that require additional collateral in the event of market fluctuations. Additionally, for margin loans, PALs, options and futures positions, and securities lending agreements, collateral arrangements require that the fair value of such collateral sufficiently exceeds the credit exposure in order to maintain a fully secured position.\nOther Counterparty Exposures\nSchwab performs clearing services for all securities transactions in its client accounts. Schwab has exposure to credit risk due to its obligation to settle transactions with clearing corporations, mutual funds, and other financial institutions even if Schwab’s clients or a counterparty fail to meet their obligations to the Company.\nMarket Risk\nMarket risk is the potential for changes in earnings or the value of financial instruments held by Schwab as a result of fluctuations in interest rates, equity prices, or market conditions. Schwab is exposed to market risk primarily from changes in interest rates within our interest-earning assets relative to changes in the costs of funding sources that finance these assets. \nTo manage interest rate risk, we have established policies and procedures, which include setting limits on net interest revenue risk and economic value of equity (EVE) risk. To remain within these limits, we manage the maturity, repricing, and cash flow characteristics of the investment portfolios. Management monitors established guidelines to stay within the Company’s risk appetite. The Company utilizes interest rate swap derivative instruments to assist with managing interest rate risk, the effects of which are incorporated into the Company’s net interest revenue and EVE analyses. For further information on our interest rate risk management strategies utilizing interest rate swaps, see Item 8 – Note 17.\nOur measurement of interest rate risk involves assumptions that are inherently uncertain and, as a result, cannot precisely estimate the impact of changes in interest rates on net interest revenue, bank deposit account fees, or EVE. Actual results may differ from simulated results due to balance growth or decline and the timing, magnitude, and frequency of interest rate changes, as well as changes in market conditions and management strategies, including changes in asset and liability mix. Financial instruments are also subject to the risk that valuations will be negatively affected by changes in demand and the underlying market for a financial instrument. \nWe are indirectly exposed to option, futures, and equity market fluctuations in connection with client option and futures accounts, securities collateralizing margin loans to brokerage customers, and client securities loaned out as part of the brokerage securities lending activities. Equity market valuations may also affect the level of brokerage client trading activity, margin borrowing, and overall client engagement with Schwab. Additionally, we earn mutual fund and ETF service fees and asset management fees based upon daily balances of certain client assets. Fluctuations in these client asset balances caused by changes in equity valuations directly impact the amount of fee revenue we earn.\n- 47 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nOur market risk related to financial instruments held for trading is not material. \nNet Interest Revenue Simulation\nFor our net interest revenue sensitivity analysis, we use net interest revenue simulation modeling techniques to evaluate and manage the effect of changing interest rates. The simulations include all balance sheet interest rate-sensitive assets and liabilities, and include derivative instruments. Key assumptions include the projection of interest rate scenarios with rate floors, rates and balances of non-maturity client cash held on the balance sheet, prepayment speeds of mortgage-related investments, repricing of financial instruments, and reinvestment of matured or paid-down securities and loans. We use independent third-party models to simulate net interest revenue sensitivity and related analyses. Fixed income analytical vendors provide term structure models, prepayment speed models for mortgage-backed securities and mortgage loans, and cash flow projections based on interest income, contractual maturities, and prepayments. The Company’s net interest revenue sensitivity analyses utilize gradual parallel increases/decreases in interest rates over a twelve-month period, though we also regularly simulate the effects of non-parallel shifts and instantaneous shifts of interest rates on net interest revenue.\nNet interest revenue is affected by various factors, such as the distribution and composition of interest-earning assets and interest-bearing liabilities, the spread between yields earned on interest-earning assets and rates paid on interest-bearing liabilities, which may reprice at different times or by different amounts, and the spread between short- and long-term interest rates. Interest-earning assets include investment securities, margin loans, bank loans, and cash and cash equivalents. These assets are sensitive to changes in interest rates and changes in prepayment levels that tend to increase in a declining rate environment and decrease in a rising rate environment. Because we establish the rates paid on certain brokerage client cash balances and bank deposits and the rates charged on certain margin and bank loans, and control the composition of our investment securities, we have some ability to manage our net interest spread, depending on competitive factors and market conditions. When we have liquidity needs that exceed our primary sources of funding, the Company has needed to utilize higher-cost funding sources, which can reduce net interest margin and net interest revenue.\nHigher prevailing short-term interest rates generally improve yields on shorter duration interest-earning assets. During periods of rapidly rising interest rates, clients tend to reallocate cash out of sweep products into higher-yielding, off-balance sheet, fixed income investments and money market funds within Schwab’s product offerings. This can result in lower interest-earning assets and/or may require supplemental funding with higher funding costs, which therefore tend to constrain net interest revenue when interest rates are moving rapidly higher. A decline in short-term interest rates could negatively impact the yield on the Company’s investment and loan portfolios to a greater degree than any offsetting reduction in interest expense from funding sources, compressing net interest margin. \nNet interest revenue sensitivity analyses assume both static and dynamically-sized balance sheet composition. Statically-sized balance sheet modeling assumes the asset and liability structure of the consolidated balance sheet would not be changed as a result of the simulated changes in interest rates. While this approach is useful to isolate the impact of changes in interest rates on a statically-sized asset and liability structure, it does not capture changes to client cash allocations. We therefore also conduct dynamically-sized balance sheet compositions as a function of interest rates. Dynamic net interest revenue simulations assume deposit and client credit balance runoff is supplemented with wholesale borrowing when needed to fund assets through the simulation horizon. We also conduct similar simulations on EVE to capture the impact of client cash allocation changes on our balance sheet. As we actively manage the consolidated balance sheet and interest rate exposure, we have taken and would typically seek to take steps to manage additional interest rate exposure that could result from changes in the interest rate environment. \nThe following table assumes a statically-sized balance sheet with simulated changes to net interest revenue over the next 12 months beginning December 31, 2024 and 2023 of a gradual increase or decrease in market interest rates relative to prevailing market rates at the end of each reporting period:\nDecember 31,\n2024\n2023\nIncrease of 200 basis points\n8.6%\n10.8%\nIncrease of 100 basis points\n4.6%\n5.8%\nIncrease of 50 basis points\n2.5%\n3.1%\nDecrease of 50 basis points\n(2.3)%\n0.4%\nDecrease of 100 basis points\n(4.6)%\n(0.2)%\nDecrease of 200 basis points\n(9.3)%\n(4.2)%\n- 48 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nThe Company’s simulated incremental increases in market interest rates had a smaller impact on net interest revenue as of December 31, 2024 compared to December 31, 2023, reflecting the impacts of hedging fixed-to-floating rate Senior Notes with receive-fixed-pay-floating interest rate swaps, resulting in higher interest expense in a higher rate environment, and lower cash balances held, partially offset by the benefit of a decreased allocation to shorter-term liabilities, which reduces interest expense in a higher rate environment. The Company’s simulated incremental decreases in market interest rates had a larger impact on net interest revenue as of December 31, 2024 compared to December 31, 2023, primarily due to lower non-maturity deposit rates and a decreased allocation to shorter-term liabilities, both of which reduce interest expense savings in a lower rate environment, partially offset by interest expense savings from hedging fixed-to-floating rate Senior Notes.\nEffective Duration\nEffective duration measures price sensitivity relative to a change in prevailing interest rates, taking account of amortizing cash flows and prepayment optionality for mortgage-related securities and loans. Duration is measured in years and commonly interpreted as the average timing of principal and interest cash flows. We seek to manage the Company’s asset duration in relation to management’s estimate of the Company’s liability duration. The Company’s liability duration is impacted by the composition of funding sources, and typically decreases in periods of rising market interest rates and increases in periods of declining market interest rates. The Company also utilizes derivative hedging instruments such as interest rate swaps in managing its asset and liability duration.\nThe following table presents the Company’s estimated effective durations, which reflects anticipated future payments, by category:\nDecember 31, 2024\nDecember 31, 2023\nIn years\nEstimated effective duration, exclusive of derivatives:\nConsolidated total assets\n2.1\n2.5\nAFS investment securities portfolio\n2.3\n2.5\nAFS and HTM investment securities portfolio\n3.9\n4.0\nLong-term debt CSC Senior Notes \n(2)\n3.2\n3.4\nEstimated effective duration, inclusive of derivatives \n(1)\n:\nConsolidated total assets\n2.0\n2.4\nAFS investment securities portfolio\n1.8\n2.2\nAFS and HTM investment securities portfolio\n3.7\n3.9\nLong-term debt CSC Senior Notes \n(2)\n2.3\n3.4\n(1)\n See Item 8 – Note 17 for additional discussion on the Company’s derivatives.\n(2) \nIn the fourth quarter of 2024, Schwab executed $15.0 billion of receive-fixed swaps on CSC’s Senior Notes to reduce interest expense exposure in a lower interest rate environment.\nAFS and HTM securities comprised approximately 48% and 54% of the Company’s consolidated total assets as of December 31, 2024 and 2023, respectively. The estimated effective duration of the remaining balance sheet assets in aggregate was less than one year as of both December 31, 2024 and 2023. \nEconomic Value of Equity Simulation\nManagement also uses EVE simulations to measure interest rate risk. EVE sensitivity measures the long-term impact of interest rate changes on the net present value of assets and liabilities, and includes the impact of derivative instruments. While EVE does not have a direct accounting relationship, the measure aims to capture a theoretical value of assets and liabilities under a variety of interest rate environments. EVE is calculated by subjecting the balance sheet to hypothetical instantaneous shifts in the level of interest rates. This analysis is highly dependent upon asset and liability assumptions based on historical behaviors. Key assumptions in our EVE calculation include projection of interest rate scenarios with rate floors, prepayment speeds of mortgage-related investments, term structure models of interest rates, behavior of non-maturity client cash held on the balance sheet, and pricing assumptions. We use both proprietary and independent third-party models to simulate EVE sensitivity and related analyses. We develop and maintain client credits and deposits run-off models internally based on historical experience and prevailing client cash realignment behaviors. We rely on third-party models for interest rate term structure modeling, prepayment speed modeling for mortgage-backed securities and mortgage loans, and cash flow projections based on interest income, and contractual maturities. \n- 49 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nSchwab’s EVE profile is characterized by a more stable asset duration relative to liabilities in both higher and lower interest rate environments. Currently, the EVE exposure to rates increasing or decreasing in a similar magnitude shows that there is greater exposure to rates decreasing. \nBank Deposit Account Fees Simulation\nConsistent with the presentation on the consolidated statement of income, the sensitivity of bank deposit account fee revenue to interest rate changes is assessed separately from the net interest revenue simulation described above. As of December 31, 2024 and 2023, simulated changes in bank deposit account fee revenue from gradual changes in market interest rates relative to prevailing market rates, under the interest rate scenarios described above for net interest revenue, did not have a significant impact on the Company’s total net revenues. Our net interest revenue, EVE, and bank deposit account fee revenue simulations reflect the assumption of non-negative investment yields.\nLiquidity Risk\nLiquidity risk is the potential that Schwab will be unable to sell assets or meet cash flow obligations when they come due without incurring unacceptable losses.\nDue to its role as a source of financial strength, CSC’s liquidity needs are primarily driven by the liquidity and capital needs of: CS&Co, our principal broker-dealer subsidiary; the capital needs of the banking subsidiaries; principal and interest due on corporate debt; and dividend payments on CSC’s preferred and common stock. The liquidity needs of our broker-dealer subsidiary are primarily driven by client activity, including trading and margin lending activities, and capital expenditures. The capital needs of the banking subsidiaries are primarily driven by client deposit levels and other borrowings. We have established liquidity policies to support the successful execution of business strategies, while ensuring ongoing and sufficient liquidity to meet operational needs and satisfy applicable regulatory requirements under both normal and stressed conditions. We seek to maintain client confidence in the balance sheet and the safety of client assets by maintaining liquidity and diversity of funding sources to allow the Company to meet its obligations. To this end, we have established limits and contingency funding plans to support liquidity levels during both business as usual and stressed conditions.\nWe employ a variety of metrics to monitor and manage liquidity. We conduct regular liquidity stress testing to develop a view of liquidity risk exposures and to ensure our ability to maintain sufficient liquidity during market-related or company-specific liquidity stress events. Liquidity sources are also tested periodically and results are reported to the Financial Risk Oversight Committee. A number of early warning indicators are monitored to help identify emerging liquidity stresses in the market or within the organization and are reviewed with management periodically.\nFunding Sources\nSchwab’s primary source of funds is cash generated by client activity which includes bank deposits and cash balances in client brokerage accounts. These funds are used to purchase investment securities and extend loans to clients. Other sources of funds may include cash flows from operations, maturities and sales of investment securities, repayments on loans, securities lending of assets held in client brokerage accounts, FHLB borrowings, borrowings under repurchase agreements with external financial institutions, issuance of CDs, cash provided by securities issuances by CSC in the capital markets, and other facilities described below.\nTo meet daily funding needs, we maintain liquidity in the form of overnight cash deposits and short-term investments. For unanticipated liquidity needs, we also maintain a buffer of highly liquid investments, including U.S. Treasury securities. Our clients’ bank deposits and brokerage cash balances primarily originate from our 36.5 million active brokerage accounts. More than 80% of our bank deposits qualified for FDIC insurance as of December 31, 2024. Our clients’ allocation of cash held on our balance sheet as bank deposits or payables to brokerage clients is sensitive to interest rate levels, with clients typically increasing their utilization of investment cash solutions, such as purchased money market funds and certain fixed income products when those yields are higher than those of cash sweep features.\nAs a participant in the financial services industry, Schwab relies on access to external financing in the normal course of business. Schwab’s use of external debt facilities may arise from timing differences between cash flow requirements, such as client cash outflows, cash flows from operations, payments on interest-earning assets, movements of cash to meet regulatory brokerage client cash segregation requirements, and general corporate purposes. Rollover risk is the risk that we will not be able to refinance or payoff borrowings as they mature. We maintain policies and procedures necessary to access funding, and test \n- 50 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nborrowing procedures on a periodic basis. We manage rollover risk on borrowings, taking into account expected principal paydowns on our investment and loan portfolios along with expected deposit flows.\nThe following table describes certain external debt facilities available at December 31, 2024:\nDescription\nBorrower\nOutstanding\nAvailable\nMaturity of Amounts Outstanding\nWeighted-Average Interest Rate on Amounts Outstanding\nFHLB secured credit facilities\nBanking subsidiaries\n$\n16,700 \n$\n59,810 \n(1)\nJanuary 2025 - July 2025\n5.11%\nFederal Reserve discount window\nBanking subsidiaries\n— \n30,512 \n(1)\nN/A\n—\nRepurchase agreements\nBanking subsidiaries, CSC\n5,499 \n— \n(2)\nJanuary 2025 - May 2025\n5.26%\nUnsecured uncommitted lines of credit with various external banks\nCSC, CS&Co\n— \n1,692 \nN/A\n—\nUnsecured commercial paper\nCSC\n— \n5,000 \nN/A\n—\nSecured uncommitted lines of credit with various external banks\nCS&Co\n500 \n— \n(3)\nApril 2025\n5.13%\nUnsecured committed revolving line of credit with various external banks\nCSC\n— \n2,100 \n(4)\nN/A\n—\n(1) \nAmounts shown as available from the FHLB and Federal Reserve facilities represent remaining capacity based on assets pledged as of December 31, 2024. Incremental borrowing capacity may be made available by pledging additional assets, subject to applicable facility terms. See below and Item 8 – Note 13 for additional information.\n(2) \nSecured borrowing capacity is made available based on the banking subsidiaries’ or CSC’s ability to provide collateral deemed acceptable by each respective counterparty. See below and Item 8 – Note 18 for additional information.\n(3) \nSecured borrowing capacity is made available based on CS&Co’s ability to provide acceptable collateral to the lenders as determined by the credit agreements.\n(4)\n During the first quarter of 2024, CSC entered into an unsecured committed revolving line of credit with various external banks.\nN/A Not applicable.\nAvailable borrowing capacity from the FHLB and Federal Reserve facilities maintained by our banking subsidiaries is dependent on the value of assets pledged and the terms of the borrowing arrangements. As of December 31, 2024, the Company had additional investment securities with a par value of approximately $124 billion, or a fair value of approximately $113 billion, available to be pledged to obtain additional capacity. Additional details regarding availability and use of these facilities is described below. \nAmounts available under secured credit facilities with the FHLB are dependent on the value of our First Mortgages, HELOCs, and the value of certain of our investment securities that are pledged as collateral. These credit facilities are also available as backup financing in the event the outflow of client cash from the banking subsidiaries’ respective balance sheets is greater than maturities and paydowns on investment securities and bank loans. CSC’s banking subsidiaries must each maintain positive tangible capital, as defined by the FHFA, in order to place new draws upon these credit facilities, and the Company manages capital with consideration of minimum tangible capital ratios at our banking subsidiaries. Tangible capital pursuant to the requirements of the FHLB borrowing facilities for our banking subsidiaries is common equity less goodwill and intangible assets.\nOur banking subsidiaries also have access to short-term secured funding through the Federal Reserve discount window. Amounts available under the Federal Reserve discount window are dependent on the value of certain investment securities that are pledged as collateral. Our banking subsidiaries may also engage with external financial institutions in repurchase agreements collateralized by investment securities as another source of short-term liquidity. In addition, our banking subsidiaries are counterparties to the Standing Repo Facility with the Federal Reserve Bank of New York; other than de minimis tests performed to satisfy the Federal Reserve Bank of New York’s testing requirements, this facility was not used during 2024 and there were no amounts outstanding at December 31, 2024. CSC maintains standing bilateral repurchase agreements with external banks. Other than de minimis tests, these facilities were not used during 2024 and there were no amounts outstanding under these facilities at December 31, 2024.\nCSC’s ratings for Commercial Paper Notes were P1 by Moody’s Investor Service (Moody’s), A2 by Standard & Poor’s Rating Group (Standard & Poor’s), and F1 by Fitch Ratings, Ltd (Fitch) at December 31, 2024. CSC also has a universal automatic shelf registration statement on file with the SEC, which enables it to issue debt, equity, and other securities.\n- 51 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nBeginning in 2024, CSC had access to an unsecured committed revolving line of credit with various external banks. This line expired in January 2025 and was not renewed. Other than an overnight borrowing to test the availability, the facility was not used during 2024.\nCS&Co maintains unsecured uncommitted bank credit lines with a group of banks as a source of short-term liquidity, which can also be accessed by CSC. CS&Co also maintains secured uncommitted lines of credit, under which CS&Co may borrow on a short-term basis and pledge either client margin securities or firm securities as collateral, based on the terms of the agreements. CS&Co is also able to lend eligible securities held in client brokerage accounts in exchange for cash collateral as a source of short-term liquidity. As of December 31, 2024, liabilities for securities loaned totaled $13.1 billion and are included in payables to brokers, dealers, and clearing organizations on the consolidated balance sheet. At December 31, 2024, $8.8 billion of securities loaned had overnight and continuous remaining contractual maturities; $4.3 billion of securities loaned had contractual maturities of 35-95 days and had a weighted-average interest rate of 4.62%. See Item 8 – Note 18 for additional information on securities lending activities. \nCSB issues brokered CDs as a supplemental funding source. The following table provides information about brokered CDs issued by CSB and outstanding as of December 31, 2024:\nAmount Outstanding\nMaturity\nWeighted-Average Interest Rate\nBrokered CDs\n$\n27,701 \nJanuary 2025 - November 2025\n4.90%\nCash Flow Activity\nAs a result of rapidly increasing short-term interest rates beginning in 2022, the Company saw an increase in the pace at which clients moved certain cash balances out of our sweep features and into higher-yielding investment cash alternatives at Schwab. As a result of these outflows, our banking subsidiaries have supplemented excess cash on hand and cash generated by maturities and paydowns on our investment securities portfolios with fixed- and floating-rate FHLB advances, repurchase agreements, and issuances of brokered CDs. The average pace of client cash allocations out of sweep products into higher-yielding investment solutions decreased significantly beginning in the second half of 2023, and continued to decrease through 2024.\nIn the fourth quarter of 2024, the Company saw an increase in client sweep cash, which, along with principal and interest on the AFS and HTM investment securities portfolio, supported the Company’s net reduction of $14.9 billion of aggregate bank supplemental funding. Bank deposits increased $12.7 billion during the fourth quarter of 2024, which reflected a $17.7 billion increase in deposits swept from brokerage accounts, partially offset by a net decrease of $6.4 billion in brokered CDs.\nThe Company’s cash and cash equivalents decreased $1.3 billion from year-end 2023 to $42.1 billion at December 31, 2024; cash and cash equivalents, including amounts restricted, decreased $9.0 billion from year-end 2023 to $65.5 billion at December 31, 2024. These decreases reflected a net reduction of bank supplemental funding balances of $29.7 billion and maturities of long-term debt of $3.7 billion. Bank deposits decreased in 2024 by $30.8 billion, which reflected a net decrease in brokered CDs of $20.6 billion, as well as a $9.7 billion decrease in deposits swept from brokerage accounts due to client cash allocations and engagement with equity markets. The Company reduced FHLB borrowings and other short-term borrowings by a net total of $10.3 billion. Partially offsetting the decrease in bank deposits and repayment of borrowings, net investing cash inflows from our AFS and HTM securities totaled $40.9 billion in 2024 and net cash inflows from operations totaled $2.7 billion.\nCash and cash equivalents increased $3.1 billion from year-end 2022 to $43.3 billion at December 31, 2023; cash and cash equivalents, including amounts restricted, increased $15.8 billion to $74.5 billion as of year-end 2023. This increase was driven by net cash provided by investing and operating activities, partially offset by net cash used for financing activities. Bank deposits decreased $76.8 billion in 2023, resulting primarily from a decrease of $113.5 billion in deposits swept from brokerage accounts due to client cash allocation decisions, partially offset by a net increase in brokered CDs of $42.3 billion. Offsetting the decrease in bank deposits, investing cash flows from our AFS and HTM securities totaled $58.9 billion in 2023, cash flows from operating activities totaled $19.6 billion, and the Company increased FHLB borrowings and other short-term borrowings by a total of $15.9 billion in 2023.\n- 52 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nLiquidity Coverage Ratio\nSchwab is subject to the full LCR rule, which requires the Company to hold HQLA in an amount equal to at least 100% of the Company’s projected net cash outflows over a prospective 30-calendar-day period of acute liquidity stress, calculated on each business day. See Part I – Item 1 – Regulation for additional information. The Company was in compliance with the LCR rule at December 31, 2024, and the table below presents information about our average daily LCR: \nAverage for the Three Months Ended\nDecember 31, 2024\nSeptember 30, 2024\nTotal eligible HQLA\n$\n56,109 \n$\n56,288 \nNet cash outflows\n40,232 \n43,356 \nLCR\n140 \n%\n130 \n%\nTo support growth in margin loan balances at our broker-dealer subsidiary while meeting our LCR requirements, the Company may issue commercial paper, draw on secured lines of credit, or engage in securities lending, in addition to capital markets issuances. In managing compliance with our LCR requirements, the broker-dealer subsidiary may also retain client cash balances rather than sweeping such balances to our banking subsidiaries.\nNet Stable Funding Ratio\nSchwab is subject to disclosure requirements under the NSFR rule, which requires the semi-annual public disclosure of its NSFR levels. The NSFR rule stipulates that the Company’s ASF must be at least 100% of the Company’s RSF. ASF is calculated by assessing the stability of the Company’s funding sources and RSF is calculated by evaluating the characteristics of the Company’s assets, derivatives, and off-balance-sheet exposures. The Company was in compliance with the NSFR rule at December 31, 2024, and the table below presents information about our average NSFR:\nAverage for the Three Months Ended\nDecember 31, 2024\nSeptember 30, 2024\nASF\n$\n197,689 \n$\n193,841 \nRSF\n150,777 \n152,268 \nNSFR\n131 \n%\n127 \n%\nLong-Term Borrowings\nThe Company’s long-term debt is primarily comprised of Senior Notes and totaled $22.4 billion and $26.1 billion at December 31, 2024 and 2023, respectively. \nThe following table provides information about our Senior Notes outstanding at December 31, 2024:\nPar Outstanding\nMaturity\nWeighted-Average\nInterest Rate\nMoody’s\nStandard\n& Poor’s\nFitch\nCSC Senior Notes\n$\n22,262 \n2025 - 2034\n3.69%\nA2\nA-\nA\nAmeritrade Holding Senior Notes\n163 \n2025 - 2029\n3.38%\nA2\nA-\n—\n- 53 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nNew Debt Issuances\nDuring 2024, CSC did not issue new long-term debt. The below debt issuances in 2023 and 2022 were senior unsecured obligations. Additional details are as follows:\nIssuance Date\nIssuance Amount\nMaturity Date\nInterest Rate\nInterest Payable\nMarch 3, 2022\n$\n500 \n3/3/2027\nSOFR + 1.050%\nQuarterly\nMarch 3, 2022\n$\n1,500 \n3/3/2027\n2.450%\nSemi-annually\nMarch 3, 2022\n$\n1,000 \n3/3/2032\n2.900%\nSemi-annually\nMay 19, 2023\n$\n1,200 \n5/19/2029\n5.643%\nSemi-annually\n(1)\nMay 19, 2023\n$\n1,300 \n5/19/2034\n5.853%\nSemi-annually\n(1)\nAugust 24, 2023\n$\n1,350 \n8/24/2034\n6.136%\nSemi-annually\n(1)\nAugust 24, 2023\n$\n1,000 \n8/24/2026\n5.875%\nSemi-annually\nNovember 17, 2023\n$\n1,300 \n11/17/2029\n6.196%\nSemi-annually\n(1)\n(1) \nInterest rates presented are those in effect at December 31, 2024. For additional information regarding future interest rates on fixed-to-floating rate Senior Notes, see Item 8 – Note 13.\nEquity Issuances and Redemptions\nDuring 2024 and 2023, CSC did not issue preferred stock. CSC’s preferred stock issued and net proceeds for 2022 are shown below:\nDate Issued and Sold\nNet Proceeds\nSeries K\nMarch 4, 2022\n$\n740 \nOn November 1, 2022, the Company redeemed all of the outstanding shares of its fixed-to-floating rate non-cumulative perpetual preferred stock, Series A at a redemption price of $1,000 per share for a total of $400 million. On December 1, 2022, the Company redeemed all of the fixed-to-floating rate non-cumulative perpetual preferred stock, Series E, and the corresponding depositary shares. The depositary shares were redeemed at a redemption price of $1,000 per depositary share for a total of $600 million.\nSee also Item 8 – Consolidated Statements of Cash Flows, Item 8 – Note 12 for the Company’s bank deposits, Item 8 – Note 13 for the Company’s outstanding debt and borrowing facilities, Item 8 – Note 18 for the Company’s securities lending activities, and Item 8 – Note 20 for equity outstanding balances and activity.\nContractual Obligations\nSchwab’s principal contractual obligations as of December 31, 2024 include payments on brokered CDs; payments on FHLB borrowings, other short-term borrowings, and long-term debt; lease payments including legally-binding minimum lease payments for leases signed but not yet commenced; credit-related financial instruments, representing our banking subsidiaries’ commitments to extend credit to banking clients, purchase mortgage loans, and fund CRA investments; and purchase obligations for services such as advertising and marketing, telecommunications, hardware- and software-related agreements, and professional services. For information on our contractual obligations for brokered CDs, FHLB borrowings, other short-term borrowings, long-term debt, leases, and credit-related financial instruments, see Item 8 – Notes 12, 13, 14, and 15. As of December 31, 2024, the Company had total short-term purchase obligations of $726 million and total long-term purchase obligations of $499 million.\nSchwab also enters into guarantees and other similar arrangements in the ordinary course of business. For information on these arrangements, see Item 8 – Notes 6, 7, 11, 13, 15, and 18. Pursuant to the 2023 IDA agreement, certain brokerage client deposits are required to be swept off-balance sheet to the TD Depository Institutions. See Item 8 – Note 15 for additional information on the 2023 IDA agreement.\n- 54 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nCAPITAL MANAGEMENT\n \nSchwab seeks to manage capital to a level and composition sufficient to support execution of our business strategy, inclusive of balance sheet growth over time, financial support to our subsidiaries, sustained access to the capital markets, and regulatory capital requirements. Schwab also seeks to return excess capital to stockholders. We may return excess capital through such activities as dividends, repurchases of common shares, preferred stock redemptions, and repurchases of our preferred stock represented by depositary shares. Schwab’s primary sources of capital are funds generated by the operations of subsidiaries and securities issuances by CSC in the capital markets.\nTo ensure that Schwab has sufficient capital to absorb unanticipated losses or declines in asset values, we have adopted a policy to remain well capitalized even in stressed scenarios. Internal guidelines are set, for both CSC and its regulated subsidiaries, to ensure capital levels are in line with our strategy and regulatory requirements. Capital forecasts are reviewed monthly at Asset-Liability Management Committee meetings and regularly at meetings of the Board of Directors. A number of early warning indicators are monitored to help identify potential developments that could negatively impact capital. In addition, we monitor the subsidiaries’ capital levels and requirements. Subject to regulatory capital requirements and any required approvals, any excess capital held by subsidiaries is transferred to CSC in the form of dividends and returns of capital. At the banking subsidiaries, dividends and returns of capital are managed with consideration of minimum tangible common equity and regulatory capital requirements.\n \nWhen subsidiaries have need of additional capital, funds are provided by CSC as equity investments and also as subordinated loans. The details and method used for each cash infusion are based on an analysis of the particular entity’s needs and financing alternatives. The amounts and structure of infusions take into consideration maintenance of regulatory capital requirements, debt/equity ratios, and equity double leverage ratios.\nSchwab conducts regular capital stress testing to assess the potential financial impacts of various adverse macroeconomic and company-specific events to which the Company could be subjected. The objective of the capital stress testing is (1) to explore various potential outcomes – including rare and extreme events and (2) to assess impacts of potential stressful outcomes on both capital and liquidity (see also Risk Management – Liquidity Risk for discussion of liquidity stress testing). Additionally, we have a comprehensive Capital Contingency Plan to provide action plans for certain low probability/high impact capital events that the Company might face. The Capital Contingency Plan is issued under the authority of the Financial Risk Oversight Committee and provides guidelines for sustained capital events. It does not specifically address every contingency, but is designed to provide a framework for responding to any capital stress. The results of the stress testing indicate there are two scenarios which could stress the Company’s capital: (1) inflows of balance sheet cash during a period of very low interest rates and (2) outflows of balance sheet cash when other sources of financing are not available and the Company is required to sell assets at a loss to fund the outflows. The Capital Contingency Plan is reviewed annually and updated as appropriate.\nFor additional information, see Business – Regulation in Part I – Item 1.\nRegulatory Capital Requirements\nCSC is subject to capital requirements set by the Federal Reserve and is required to serve as a source of strength for our banking subsidiaries and to provide financial assistance if our banking subsidiaries experience financial distress. Schwab is required to maintain a Tier 1 Leverage Ratio for CSC of at least 4%. Due to the relatively low credit risk of our balance sheet assets and risk-based capital ratios at CSC and CSB that are in excess of regulatory requirements, the Tier 1 Leverage Ratio is the most restrictive capital constraint on CSC’s asset growth. \nOur banking subsidiaries are subject to capital requirements set by their regulators that are substantially similar to those imposed on CSC by the Federal Reserve. Our banking subsidiaries’ failure to remain well capitalized could result in certain mandatory and possibly additional discretionary actions by the regulators that could have a direct material effect on the banks. Schwab’s principal banking subsidiary, CSB, is required to maintain a Tier 1 Leverage Ratio of at least 5% to be well capitalized, but seeks to maintain a ratio of at least 6.5%. Based on its regulatory capital ratios at December 31, 2024, CSB is considered well capitalized. \nIn July 2023, the Federal Reserve issued a notice of proposed changes to the regulatory capital rules that would require us to include AOCI in regulatory capital, phased in over a three-year transition period, beginning July 1, 2025 (see Current Regulatory and Other Developments). In anticipation of the rules being adopted, the Company’s capital management for CSC (consolidated), CSB, and our other banking subsidiaries now incorporates measures that are inclusive of AOCI. During the second quarter of 2024, Schwab updated its long-term operating objective to be its consolidated adjusted Tier 1 Leverage Ratio of 6.75% - 7.00%. See below and Non-GAAP Financial Measures for additional information.\n- 55 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nOur banking subsidiaries are required to provide notice to, and may be required to obtain approval from, the Federal Reserve and the banking subsidiaries’ state regulators in order to declare and pay dividends to CSC. In future periods, we may be required to obtain approval from the Federal Reserve for our banking subsidiaries to declare and pay dividends in excess of the amount of recent net income and retained earnings.\nAs a broker-dealer, CS&Co is subject to regulatory requirements of the Uniform Net Capital Rule, which are intended to ensure the general financial soundness and liquidity of broker-dealers. These regulations prohibit our broker-dealer subsidiary from paying cash dividends, making unsecured advances and loans to CSC and employees, and repaying subordinated borrowings from CSC, if such payment would result in a net capital amount below prescribed thresholds. At December 31, 2024, CS&Co was in compliance with its net capital requirements.\nIn addition to the capital requirements above, Schwab’s subsidiaries are subject to other regulatory requirements intended to ensure financial soundness and liquidity. See Item 8 – Notes 20 and 24 for additional information on the components of stockholders’ equity and information on the capital requirements of significant subsidiaries and CSC (consolidated).\nThe following table details the capital ratios for CSC (consolidated) and CSB:\nDecember 31,\n2024\n2023\nCSC\nCSB\nCSC\nCSB\nTotal stockholders’ equity\n$\n48,375 \n$\n19,700 \n$\n40,958 \n$\n16,079 \nLess:\nPreferred stock\n9,191 \n— \n9,191 \n— \nCommon Equity Tier 1 Capital before regulatory adjustments\n$\n39,184 \n$\n19,700 \n$\n31,767 \n$\n16,079 \nLess:\nGoodwill, net of associated deferred tax liabilities\n$\n11,746 \n$\n13 \n$\n11,782 \n$\n13 \nOther intangible assets, net of associated deferred tax liabilities\n6,232 \n— \n6,664 \n— \nDeferred tax assets, net of valuation allowances and deferred tax liabilities\n50 \n41 \n41 \n35 \nAOCI adjustment \n(1)\n(14,839)\n(12,938)\n(18,131)\n(15,746)\nCommon Equity Tier 1 Capital \n$\n35,995 \n$\n32,584 \n$\n31,411 \n$\n31,777 \nTier 1 Capital\n$\n45,186 \n$\n32,584 \n$\n40,602 \n$\n31,777 \nTotal Capital\n45,218 \n32,606 \n40,645 \n31,816 \nRisk-Weighted Assets\n113,648 \n78,134 \n128,230 \n83,809 \nAverage Assets with regulatory adjustments\n458,119 \n280,701 \n476,069 \n315,851 \nTotal Leverage Exposure\n461,200 \n282,629 \n479,302 \n318,007 \nCommon Equity Tier 1 Capital/Risk-Weighted Assets\n31.7 \n%\n41.7 \n%\n24.5 \n%\n37.9 \n%\nTier 1 Capital/Risk-Weighted Assets\n39.8 \n%\n41.7 \n%\n31.7 \n%\n37.9 \n%\nTotal Capital/Risk-Weighted Assets\n39.8 \n%\n41.7 \n%\n31.7 \n%\n38.0 \n%\nTier 1 Leverage Ratio\n9.9 \n%\n11.6 \n%\n8.5 \n%\n10.1 \n%\nSupplementary Leverage Ratio\n9.8 \n%\n11.5 \n%\n8.5 \n%\n10.0 \n%\n(1)\n Changes in market interest rates can result in unrealized gains or losses on AFS securities, which are included in AOCI. As a Category III banking organization, CSC has elected to exclude most components of AOCI from regulatory capital.\nThe Company’s consolidated Tier 1 Leverage Ratio increased to 9.9% at December 31, 2024 from 8.5% at year-end 2023. This increase was due primarily to a decrease in the Company’s total assets and the benefit of net income earned during the year. Total balance sheet assets decreased $13.3 billion, or 3%, during 2024, primarily driven by decreases of $30.8 billion in total bank deposits and $9.7 billion in FHLB borrowings due to repayments, offset by an increase in payables to brokerage clients and payables to brokers, dealers, and clearing organizations totaling $23.5 billion. CSB’s Tier 1 Leverage Ratio also increased from year-end 2023, ending 2024 at 11.6%, primarily as a result of lower total assets and 2024 net income. \nIn light of the Federal Reserve’s 2023 regulatory capital rule proposal, which, among other things, would require the Company to include AOCI in regulatory capital, the Company has developed an adjusted Tier 1 Leverage Ratio, which is a non-GAAP and non-regulatory capital financial measure that includes AOCI in the ratio. The primary component of AOCI for Schwab is unrealized gains and losses on our AFS investment securities portfolio and on securities transferred from AFS to the HTM category. \nDuring the second quarter of 2024, Schwab updated its long-term operating objective to be its consolidated adjusted Tier 1 Leverage Ratio of 6.75% - 7.00%. As of December 31, 2024, our adjusted Tier 1 Leverage Ratio, which includes AOCI in the \n- 56 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nratio, was 6.8% for CSC (consolidated) and 7.3% for CSB (see Non-GAAP Financial Measures for further details and a reconciliation of such measures to GAAP reported results). The Company is continuing to accrete capital organically, and will continue to manage its capital as described above. In evaluating returns of excess capital to stockholders, we will consider the amount of bank supplemental funding outstanding, and may choose to utilize the liquidity we would otherwise use for capital returns to repay outstanding bank supplemental funding balances. See also below and Item 8 – Note 28 for additional information regarding share repurchase activity subsequent to December 31, 2024. \nIDA Agreement\nCertain brokerage client deposits are swept off-balance sheet to the TD Depository Institutions pursuant to the 2023 IDA agreement. During 2024 and 2023, Schwab did not move IDA balances to its balance sheet. The Company’s overall capital management strategy includes supporting migration of IDA balances in future periods as available pursuant to the terms of the 2023 IDA agreement. The Company’s ability to migrate these balances to its balance sheet is dependent upon multiple factors including having sufficient capital levels to sustain these incremental deposits. See Item 8 – Note 15 for further information on the 2023 IDA agreement.\nDividends\nSince the initial dividend in 1989, and as of December 31, 2024, CSC has paid 143 consecutive quarterly dividends and has increased the quarterly dividend rate 28 times, resulting in a 19% compounded annual growth rate, excluding the special cash dividend of $1.00 per common share in 2007. While the payment and amount of dividends are at the discretion of the Board of Directors, subject to certain regulatory and other restrictions, CSC currently targets its common and nonvoting common stock cash dividend at approximately 20% to 30% of net income.\nThe Board of Directors of the Company declared a quarterly cash dividend increase per common share during 2023 as shown below:\nDate of Declaration\nQuarterly Cash Increase Per Common Share\n% Increase\nNew Quarterly Dividend Per Common Share\nJanuary 26, 2023\n$\n.03 \n14 \n%\n$\n.25 \nIn addition, on January 29, 2025, the Board of Directors of the Company declared a two cent, or 8%, increase in the quarterly cash dividend to $.27 per common share.\nThe following table details CSC’s cash dividends paid and per share amounts:\nYear Ended December 31,\n2024\n2023\nCash Paid\nPer Share\nAmount\nCash Paid\nPer Share\nAmount\nCommon and Nonvoting Common Stock\n$\n1,838 \n$\n1.00 \n$\n1,838 \n$\n1.00 \nPreferred Stock:\nSeries D \n(1)\n45 \n59.52 \n45 \n59.52 \nSeries F \n(2)\n24 \n5,000.00 \n24 \n5,000.00 \nSeries G \n(1)\n132 \n5,375.00 \n132 \n5,375.00 \nSeries H \n(1)\n89 \n4,000.00 \n90 \n4,000.00 \nSeries I \n(1)\n83 \n4,000.00 \n83 \n4,000.00 \nSeries J \n(1)\n27 \n44.52 \n27 \n44.52 \nSeries K \n(1)\n37 \n5,000.00 \n37 \n5,000.00 \n(1)\n Dividends are paid quarterly.\n(2) \nDividends are paid semi-annually until December 1, 2027 and quarterly thereafter. \nShare Repurchases\nOn July 27, 2022, CSC publicly announced that its Board of Directors approved a share repurchase authorization to repurchase up to $15.0 billion of common stock, replacing the previous and now terminated share repurchase authorization of up to $4.0 billion of common stock. The share repurchase authorization does not have an expiration date. There were no repurchases of CSC’s common stock during the year ended December 31, 2024. CSC repurchased 37 million shares of its common stock for \n- 57 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\n$2.8 billion during the year ended December 31, 2023. As of December 31, 2024, approximately $8.7 billion remained on the authorization. \nSubsequent to December 31, 2024, pursuant to a repurchase agreement dated February 9, 2025, on February 12, 2025, the Company repurchased directly from TD Group US Holdings LLC 19.2 million shares of nonvoting common stock at a price of $77.982 per share for an aggregate repurchase amount of $1.5 billion. The Company completed this repurchase under its share repurchase authorization, and following the repurchase, approximately $7.2 billion remains on the authorization. See Item 8 – Note 28 for additional information.\nThere were no repurchases of CSC’s preferred stock during the year ended December 31, 2024. During the year ended December 31, 2023, the Company repurchased 11,620 depositary shares representing interests in Series F preferred stock for $11 million, 42,036 depositary shares representing interests in Series G preferred stock for $42 million, 273,251 depositary shares representing interests in Series H preferred stock for $235 million, and 194,567 depositary shares representing interests in Series I preferred stock for $179 million on the open market.\n The repurchase prices are inclusive of $3 million of dividends accrued by the stockholders as of the repurchase date.\nShare repurchases, net of issuances, are subject to a nondeductible 1% excise tax which was recognized as a direct and incremental cost associated with these transactions. For repurchases of common stock, the tax is recorded as part of the cost basis of the treasury stock repurchased, resulting in no impact to the consolidated statement of income. For repurchases of preferred stock, the tax impact is included within preferred stock dividends and other on the consolidated statement of income.\nFOREIGN EXPOSURE\nAt December 31, 2024, Schwab had exposure to non-sovereign financial and non-financial institutions in foreign countries, as well as agencies of foreign governments. At December 31, 2024, the fair value of these holdings totaled $10.6 billion, with the top three exposures being to issuers and counterparties domiciled in France at $5.1 billion, the United Kingdom at $2.1 billion, and Canada at $889 million. At December 31, 2023, the fair value of these holdings totaled $12.8 billion, with the top three exposures being to issuers and counterparties domiciled in the United Kingdom at $5.0 billion, France at $3.2 billion, and Canada at $1.5 billion. In addition, Schwab had outstanding margin loans to foreign residents of $3.5 billion and $2.5 billion at December 31, 2024 and 2023, respectively. \nFAIR VALUE OF FINANCIAL INSTRUMENTS\nSchwab uses the market approach to determine the fair value of certain financial assets and liabilities recorded at fair value, and to determine fair value disclosures. See Item 8 – Notes 2 and 19 for more information on our assets and liabilities recorded at fair value.\nCRITICAL ACCOUNTING ESTIMATES\nThe consolidated financial statements of Schwab have been prepared in accordance with GAAP. Item 8 – Note 2 contains more information on our significant accounting policies made in applying these accounting principles.\nWhile the majority of the revenues, expenses, assets, and liabilities are not based on estimates, there are certain accounting principles that require management to make estimates regarding matters that are uncertain and susceptible to change where such change may result in a material adverse impact on Schwab’s financial position and financial results. These critical accounting estimates are described below. Management regularly reviews the estimates and assumptions used in the preparation of the financial statements for reasonableness and adequacy.\nManagement has discussed the development and selection of these critical accounting estimates with the Audit Committee of the Board of Directors. Additionally, management has reviewed with the Audit Committee the Company’s significant estimates discussed in this Management’s Discussion and Analysis of Financial Condition and Results of Operations.\n- 58 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nIncome Taxes\nSchwab estimates income tax expense based on amounts expected to be owed to the various tax jurisdictions in which we operate, including federal, state, and local domestic jurisdictions, and immaterial amounts owed to several foreign jurisdictions. The estimated income tax expense is reported in the consolidated statements of income in taxes on income. Accrued taxes are reported in other assets or accrued expenses and other liabilities on the consolidated balance sheets and represent the net estimated amount due to or to be received from taxing jurisdictions either currently or deferred to future periods. Deferred taxes arise from differences between assets and liabilities measured for financial reporting purposes versus income tax reporting purposes. Deferred tax assets are recognized if, in management’s judgment, their realizability is determined to be more likely than not. Uncertain tax positions that meet the more likely than not recognition threshold are measured to determine the amount of benefit to recognize. An uncertain tax position is measured at the largest amount of benefit management believes is more likely than not to be realized upon settlement. In estimating accrued taxes, we assess the relative merits and risks of the appropriate tax treatment considering statutory, judicial, and regulatory guidance in the context of the tax position. Because of the complexity of tax laws and regulations, interpretation can be difficult and subject to legal judgment given specific facts and circumstances.\nChanges in the estimate of accrued taxes occur periodically due to changes in tax rates, interpretations of tax laws, the status of examinations being conducted by various taxing authorities, and newly enacted statutory, judicial, and regulatory guidance that impacts the relative merits and risks of tax positions. These changes, when they occur, affect accrued taxes and can be significant to the operating results of the Company. See Item 8 – Note 23 for more information on the Company’s income taxes.\nLegal and Regulatory Reserves\nReserves for legal and regulatory claims and proceedings reflect an estimate of probable losses for each matter, after considering, among other factors, the progress of the case, prior experience and the experience of others in similar cases, available defenses, and the opinions and views of legal counsel. In many cases, including most class action lawsuits, it is not possible to determine whether a loss will be incurred, or to estimate the range of that loss, until the matter is close to resolution, in which case no accrual is made until that time. Reserves are adjusted as more information becomes available. Significant judgment is required in making these estimates, and the actual cost of resolving a matter may ultimately differ materially from the amount reserved. See Item 8 – Note 15 for more information on the Company’s contingencies related to legal and regulatory reserves.\n- 59 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nNON-GAAP FINANCIAL MEASURES\nIn addition to disclosing financial results in accordance with generally accepted accounting principles in the U.S. (GAAP), Management’s Discussion and Analysis of Financial Condition and Results of Operations contain references to the non-GAAP financial measures described below. We believe these non-GAAP financial measures provide useful supplemental information about the financial performance of the Company, and facilitate meaningful comparison of Schwab’s results in the current period to both historic and future results. These non-GAAP measures should not be considered a substitute for, or superior to, financial measures calculated in accordance with GAAP, and may not be comparable to non-GAAP financial measures presented by other companies. \nSchwab’s use of non-GAAP measures is reflective of certain adjustments made to GAAP financial measures as described below. Beginning in the third quarter of 2023, these adjustments also include restructuring costs, which the Company began incurring in connection with its previously announced plans to streamline its operations to prepare for post-integration of Ameritrade. See Item 8 – Note 16 for additional information.\nNon-GAAP Adjustment or Measure\nDefinition\nUsefulness to Investors and Uses by Management \nAcquisition and integration-related costs, amortization of acquired intangible assets, and restructuring costs\nSchwab adjusts certain GAAP financial measures to exclude the impact of acquisition and integration-related costs incurred as a result of the Company’s acquisitions, amortization of acquired intangible assets, restructuring costs, and, where applicable, the income tax effect of these expenses. \nAdjustments made to exclude amortization of acquired intangible assets are reflective of all acquired intangible assets, which were recorded as part of purchase accounting. These acquired intangible assets contribute to the Company’s revenue generation. Amortization of acquired intangible assets will continue in future periods over their remaining useful lives.\nWe exclude acquisition and integration-related costs, amortization of acquired intangible assets, and restructuring costs for the purpose of calculating certain non-GAAP measures because we believe doing so provides additional transparency of Schwab’s ongoing operations, and is useful in both evaluating the operating performance of the business and facilitating comparison of results with prior and future periods. \nCosts related to acquisition and integration or restructuring fluctuate based on the timing of acquisitions, integration and restructuring activities, thereby limiting comparability of results among periods, and are not representative of the costs of running the Company’s ongoing business. Amortization of acquired intangible assets is excluded because management does not believe it is indicative of the Company’s underlying operating performance.\nReturn on tangible common equity\nReturn on tangible common equity represents annualized adjusted net income available to common stockholders as a percentage of average tangible common equity. Tangible common equity represents common equity less goodwill, acquired intangible assets — net, and related deferred tax liabilities.\nAcquisitions typically result in the recognition of significant amounts of goodwill and acquired intangible assets. We believe return on tangible common equity may be useful to investors as a supplemental measure to facilitate assessing capital efficiency and returns relative to the composition of Schwab’s balance sheet. \nAdjusted Tier 1 Leverage Ratio\nAdjusted Tier 1 Leverage Ratio represents the Tier 1 Leverage Ratio as prescribed by bank regulatory guidance for the consolidated company and for CSB, adjusted to reflect the inclusion of AOCI in the ratio.\nInclusion of the impacts of AOCI in the Company’s Tier 1 Leverage Ratio provides additional information regarding the Company’s current capital position. We believe Adjusted Tier 1 Leverage Ratio may be useful to investors as a supplemental measure of the Company’s capital levels.\nThe Company also uses adjusted diluted EPS and return on tangible common equity as components of performance criteria for employee bonus and certain executive management incentive compensation arrangements. The Compensation Committee of CSC’s Board of Directors maintains discretion in evaluating performance against these criteria. Additionally, the Company uses adjusted Tier 1 Leverage Ratio in managing capital, including its use of the measure as its long-term operating objective.\n- 60 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nThe following tables present reconciliations of GAAP measures to non-GAAP measures:\nYear Ended December 31,\n2024\n2023\n2022\nTotal expenses excluding interest (GAAP)\n$\n11,914 \n$\n12,459 \n$\n11,374 \nAcquisition and integration-related costs \n(1)\n(117)\n(401)\n(392)\nAmortization of acquired intangible assets\n(519)\n(534)\n(596)\nRestructuring costs \n(2)\n(9)\n(495)\n— \nAdjusted total expenses (non-GAAP)\n$\n11,269 \n$\n11,029 \n$\n10,386 \n(1)\n Acquisition and integration-related costs for 2024 primarily consist of $54 million of compensation and benefits, $36 million of professional services, and $19 million of depreciation and amortization. Acquisition and integration-related costs for 2023 primarily consist of $187 million of compensation and benefits, $135 million of professional services, $28 million of occupancy and equipment, and $27 million of other expense. Acquisition and integration-related costs for 2022 primarily consist of $220 million of compensation and benefits, $140 million of professional services, and $21 million of occupancy and equipment.\n(2)\n Restructuring costs for 2024 reflect a change in estimate of $34 million in compensation and benefits, offset by $5 million of occupancy and equipment and $37 million of other expense. Restructuring costs for 2023 primarily consist of $292 million of compensation and benefits, $17 million of occupancy and equipment, and $181 million of other expense. There were no restructuring costs for 2022.\nWith the Ameritrade integration and restructuring programs complete as of December 31, 2024, non-GAAP adjustments to total expenses excluding interest in 2025 are anticipated to be solely comprised of amortization of acquired intangible assets, which is estimated to be $512 million for 2025.\nYear Ended December 31,\n2024\n2023\n2022\nAmount\nDiluted EPS\nAmount\nDiluted EPS\nAmount\nDiluted EPS\nNet income available to common stockholders (GAAP), \n  Earnings per common share — diluted (GAAP)\n$\n5,478 \n$\n2.99 \n$\n4,649 \n$\n2.54 \n$\n6,635 \n$\n3.50 \nAcquisition and integration-related costs\n117 \n.06 \n401 \n.22 \n392 \n.21 \nAmortization of acquired intangible assets\n519 \n.28 \n534 \n.29 \n596 \n.31 \nRestructuring costs\n9 \n— \n495 \n.27 \n— \n— \nIncome tax effects \n(1)\n(154)\n(.08)\n(338)\n(.19)\n(237)\n(.12)\nAdjusted net income available to common stockholders \n  (non-GAAP), Adjusted diluted EPS (non-GAAP)\n$\n5,969 \n$\n3.25 \n$\n5,741 \n$\n3.13 \n$\n7,386 \n$\n3.90 \n(1)\n The income tax effects of the non-GAAP adjustments are determined using an effective tax rate reflecting the exclusion of non-deductible acquisition costs and are used to present the acquisition and integration-related costs, amortization of acquired intangible assets, and restructuring costs on an after-tax basis.\nYear Ended December 31,\n2024\n2023\n2022\nReturn on average common stockholders’ equity (GAAP)\n15 \n%\n16 \n%\n18 \n%\nAverage common stockholders’ equity\n$\n35,475 \n$\n29,334 \n$\n36,605 \nLess: Average goodwill\n(11,951)\n(11,951)\n(11,952)\nLess: Average acquired intangible assets — net\n(8,002)\n(8,524)\n(9,084)\nPlus: Average deferred tax liabilities related to goodwill and acquired intangible \n  assets — net\n1,741 \n1,805 \n1,870 \nAverage tangible common equity\n$\n17,263 \n$\n10,664 \n$\n17,439 \nAdjusted net income available to common stockholders \n(1)\n$\n5,969 \n$\n5,741 \n$\n7,386 \nReturn on tangible common equity (non-GAAP)\n35 \n%\n54 \n%\n42 \n%\n(1)\n See table above for the reconciliation of net income available to common stockholders to adjusted net income available to common stockholders (non-GAAP).\n- 61 -\nTHE CHARLES SCHWAB CORPORATION\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n(Tabular Amounts in Millions, Except Ratios, or as Noted)\nDecember 31, 2024\nDecember 31, 2023\nCSC\nCSB\nCSC\nCSB\nTier 1 Leverage Ratio (GAAP)\n9.9 \n%\n11.6 \n%\n8.5 \n%\n10.1 \n%\nTier 1 Capital\n$\n45,186 \n$\n32,584 \n$\n40,602 \n$\n31,777 \nPlus: AOCI adjustment\n(14,839)\n(12,938)\n(18,131)\n(15,746)\nAdjusted Tier 1 Capital\n30,347 \n19,646 \n22,471 \n16,031 \nAverage assets with regulatory adjustments\n458,119 \n280,701 \n476,069 \n315,851 \nPlus: AOCI adjustment\n(14,831)\n(13,037)\n(19,514)\n(17,194)\nAdjusted average assets with regulatory adjustments\n$\n443,288 \n$\n267,664 \n$\n456,555 \n$\n298,657 \nAdjusted Tier 1 Leverage Ratio (non-GAAP)\n6.8 \n%\n7.3 \n%\n4.9 \n%\n5.4 \n%",
  "item2": null
}