{
  "source_file": "shw-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF \nRESULTS OF OPERATIONS AND FINANCIAL CONDITION \n(dollars in millions, except as noted and per share data)\nBACKGROUND\nThe Sherwin-Williams Company, founded in 1866, and its consolidated subsidiaries (collectively, the Company) are engaged in the development, manufacture, distribution and sale of paint, coatings and related products to professional, industrial, commercial and retail customers primarily in North and South America with additional operations in the Caribbean region and throughout Europe, Asia and Australia.\nThe Company is structured into three reportable segments - Paint Stores Group, Consumer Brands Group and Performance Coatings Group (collectively, the Reportable Segments) - and an Administrative function, which is representative of the way it is internally organized for assessing performance and making decisions regarding the allocation of resources. See Note 18 in Item 1 for further details on the Company’s Reportable Segments.\nSUMMARY\n•\nConsolidated Net sales increased 3.2% to $6.358 billion in the quarter and increased 1.0% to $17.978 billion in the year to date period\n◦\nNet sales from stores in the Paint Stores Group open more than twelve calendar months increased 3.6% and 1.9% in the quarter and year to date period, respectively \n•\nDiluted net income per share increased 5.3% to $3.35 per share in the quarter compared to $3.18 per share in the third quarter of 2024 and decreased 3.6% to $8.34 per share in the year to date period compared to $8.65 in the year to date period of 2024\n•\nNet operating cash generated in the year to date period increased 6.3% to $2.359 billion, or 13.1% of Net sales \nOUTLOOK\nIn a demand environment which has remained softer for longer, we have continued to serve our customers, invest for success, control costs, take advantage of a unique competitive environment and execute on enterprise priorities. Although we face a challenging macro-environment, we will continue to execute on our differentiated strategy, Success by Design, by focusing on providing customers with differentiated solutions that make them more productive and profitable. We remain well-positioned in each of our targeted markets and continue to execute on deliberate, disciplined and targeted initiatives such as new stores and digital technologies that we believe will allow us to generate sustained and profitable above-market growth in an increasingly uncertain and competitive landscape. \nWe employ a disciplined capital deployment strategy, while maintaining a balanced approach toward driving value for our customers and returns to our shareholders. We continue to pursue business acquisitions, transactions and investments that fit our long-term growth strategy and will return value to our shareholders through the payment of dividends and the reinvestment of excess cash for share repurchases of Company stock. We have a strong liquidity position, with $241.5 million in cash and $3.131 billion of unused capacity under our credit facilities at September 30, 2025. We are, and expect to remain, in compliance with bank covenants. \n29\nRESULTS OF OPERATIONS\nThe Company has historically experienced, and expects to continue to experience, variability in quarterly results. The results of operations for the three and nine months ended September 30, 2025 are not indicative of the results to be expected for the full year as our business is seasonal in nature, with the majority of Net sales for the Reportable Segments traditionally occurring during the second and third quarters. However, periods of economic uncertainty can alter the Company’s seasonal patterns.\nThe following discussion and analysis addresses comparisons of material changes in the condensed consolidated financial statements for the three and nine months ended September 30, 2025 and 2024.\nNet Sales\nThree Months Ended September 30, 2025\nThree Months Ended September 30,\n \n2025\n2024\n$ Change\n% Change\nCurrency Impact\nAcquisition \nand \nDivestiture Impact\nPaint Stores Group\n$\n3,836.8\n \n$\n3,650.2 \n$\n186.6 \n5.1 \n%\n— \n%\n0.3 \n%\nConsumer Brands Group\n770.1\n \n790.5 \n(20.4)\n(2.6)\n%\n(0.3)\n%\n— \n%\nPerformance Coatings Group\n1,750.0\n \n1,720.0 \n30.0 \n1.7 \n%\n1.3 \n%\n1.4 \n%\nAdministrative\n1.3\n \n1.8 \n(0.5)\n(27.8)\n%\n— \n%\n— \n%\nTotal\n$\n6,358.2\n \n$\n6,162.5 \n$\n195.7 \n3.2 \n%\n0.3 \n%\n0.6 \n%\nConsolidated Net sales increased by 3.2% in the third quarter of 2025 primarily due to higher sales in the Paint Stores and Performance Coatings Groups, partially offset by lower sales in the Consumer Brands Group. Net sales of all consolidated foreign subsidiaries increased to $1.135 billion in the third quarter of 2025 compared to $1.124 billion in the same period last year. The increase in Net sales for all consolidated foreign subsidiaries was primarily due to higher Net sales in the Europe region. Net sales of all operations other than consolidated foreign subsidiaries increased to $5.223 billion in the third quarter of 2025 compared to $5.038 billion in the same period last year.\nNet sales in the Paint Stores Group increased by 5.1% in the third quarter of 2025 primarily due to selling price increases, which impacted Net sales by a low-single digit percentage, as well as low-single digit percentage sales volume growth. Net sales increased in all professional customer end markets, led by a double digit percentage increase in protective and marine and a mid-single digit percentage increase in residential repaint and commercial. Net sales from stores open for more than twelve calendar months increased by 3.6% in the third quarter of 2025 compared to last year’s comparable period. Net sales of non-paint products increased 3.2% in the third quarter of 2025 compared to last year’s comparable period. A discussion of changes in volume versus pricing for sales of non-paint products is not pertinent due to the wide assortment of general merchandise sold.\nNet sales in the Consumer Brands Group decreased by 2.6% in the third quarter of 2025 primarily as a result of soft DIY demand in North America and Latin America, partially offset by higher Net sales in Europe.\nNet sales in PCG increased by 1.7% in the third quarter of 2025 primarily as a result of low-single digit percentage sales volume growth, incremental sales from acquisitions and favorable foreign currency translation, partially offset by unfavorable region and business sales mix. Performance was led by Packaging, which increased by a double digit percentage inclusive of an acquisition and Automotive Refinish, offset by decreases in the other business units.\n30\nNine Months Ended September 30, 2025\nNine Months Ended September 30,\n2025\n2024\n$ Change\n% Change\nCurrency Impact\nAcquisition \nand \nDivestiture Impact\nPaint Stores Group\n$\n10,478.8\n \n$\n10,143.1 \n$\n335.7 \n3.3 \n%\n(0.1)\n%\n0.1 \n%\nConsumer Brands Group\n2,341.7\n \n2,445.8 \n(104.1)\n(4.3)\n%\n(1.7)\n%\n— \n%\nPerformance Coatings Group\n5,153.1\n \n5,208.3 \n(55.2)\n(1.1)\n%\n(0.3)\n%\n1.1 \n%\nAdministrative\n4.8\n \n4.1 \n0.7 \n17.1 \n%\n— \n%\n— \n%\nTotal\n$\n17,978.4\n \n$\n17,801.3 \n$\n177.1 \n1.0 \n%\n(0.4)\n%\n0.4 \n%\nConsolidated Net sales increased by 1.0% in the first nine months of 2025 primarily due to higher sales in the Paint Stores Group, partially offset by lower sales in the Consumer Brands and Performance Coatings Groups. Net sales of all consolidated foreign subsidiaries decreased to $3.335 billion in the first nine months of 2025 compared to $3.370 billion in the same period last year. The decrease in Net sales for all consolidated foreign subsidiaries was primarily due to lower Net sales in the Latin America region. Net sales of all operations other than consolidated foreign subsidiaries increased 1.5% to $14.643 billion in the first nine months of 2025 compared to $14.431 billion in the same period last year.\nNet sales in the Paint Stores Group increased by 3.3% in the first nine months of 2025 primarily due to selling price increases, which impacted Net sales by a mid-single digit percentage, partially offset by a low-single digit percentage decrease in sales volume. Net sales increased in certain professional customer end markets, led by a high-single digit percentage increase in protective and marine and a mid-single digit percentage increase in residential repaint. Net sales from stores open for more than twelve calendar months increased 1.9% in the first nine months of 2025 compared to last year’s comparable period. Net sales of non-paint products increased 0.8% in the first nine months of 2025 compared to last year’s comparable period. A discussion of changes in volume versus pricing for sales of products other than paint is not pertinent due to the wide assortment of general merchandise sold.\nNet sales in the Consumer Brands Group decreased by 4.3% in the first nine months of 2025 primarily due to soft DIY demand in North America and a 1.7% unfavorable impact from foreign currency translation driven by Latin America, partially offset by higher Net sales in Europe.\nNet sales in the Performance Coatings Group decreased by 1.1% in the first nine months of 2025 largely due to unfavorable business sales mix, which impacted Net sales by a low-single digit percentage, partially offset by incremental sales from acquisitions. Performance was led by Packaging, which increased by a double digit percentage inclusive of an acquisition, offset by decreases in all other business units.\n31\nIncome Before Income Taxes\nThe following table presents the components of Income before income taxes as a percentage of Net sales:\nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\n% of Net Sales\n% of Net Sales\n% of Net Sales\n% of Net Sales\nNet sales\n$\n6,358.2\n \n100.0\n \n%\n$\n6,162.5 \n100.0 \n%\n$\n17,978.4\n \n100.0\n \n%\n$\n17,801.3 \n100.0 \n%\nCost of goods sold\n3,232.7\n \n50.8\n \n%\n3,135.0 \n50.9 \n%\n9,175.5\n \n51.0\n \n%\n9,179.4 \n51.6 \n%\nGross profit\n3,125.5\n \n49.2\n \n%\n3,027.5 \n49.1 \n%\n8,802.9\n \n49.0\n \n%\n8,621.9 \n48.4 \n%\nSG&A\n1,952.8\n \n30.7\n \n%\n1,893.7 \n30.7 \n%\n5,758.2\n \n32.0\n \n%\n5,539.2 \n31.1 \n%\nOther general (income) expense - net\n(4.7)\n(0.1)\n%\n0.7 \n— \n%\n10.5\n \n0.1\n \n%\n(30.9)\n(0.2)\n%\nInterest expense\n117.2\n \n1.9\n \n%\n103.4 \n1.6 \n%\n333.4\n \n1.8\n \n%\n317.2 \n1.9 \n%\nInterest income\n(2.6)\n—\n \n%\n(2.6)\n— \n%\n(8.3)\n—\n \n%\n(9.6)\n(0.1)\n%\nOther expense (income) - net\n2.3\n \n—\n \n%\n9.5 \n0.2 \n%\n9.9\n \n0.1\n \n%\n(30.2)\n(0.2)\n%\nIncome before income taxes\n$\n1,060.5\n \n16.7\n \n%\n$\n1,022.8 \n16.6 \n%\n$\n2,699.2\n \n \n15.0\n \n%\n$\n2,836.2 \n15.9 \n%\nThree Months Ended September 30, 2025\nConsolidated Cost of goods sold increased $97.7 million, or 3.1%, in the third quarter of 2025 compared to the same period in 2024 primarily due to a low-single digit increase in sales volume and unfavorable foreign currency translation.\nConsolidated Gross profit increased $98.0 million in the third quarter of 2025 compared to the same period in 2024 primarily due to higher sales volumes in the Paint Stores and Performance Coatings Groups and higher selling prices in the Paint Stores Group, partially offset by lower sales volumes in the Consumer Brands Group. Consolidated Gross profit as a percent of consolidated Net sales increased in the third quarter of 2025 to 49.2% compared to 49.1% during the same period in 2024 for these same reasons.\nThe Paint Stores Group’s gross profit in the third quarter of 2025 was higher than the same period last year by $103.0 million due primarily to higher Net sales as a result of increased selling prices and sales volume growth. The Paint Stores Group’s gross profit as a percent of Net sales was essentially flat in the third quarter of 2025 compared to the same period in 2024. The Consumer Brands Group’s gross profit decreased by $4.0 million in the third quarter of 2025 compared to the same period last year due primarily to lower Net sales, supply chain inefficiencies from decreased production volumes and restructuring expenses. The Consumer Brands Group’s gross profit as a percent of Net sales increased in the third quarter of 2025 compared to the same period in 2024 primarily due to favorable product mix. The Performance Coatings Group’s gross profit decreased $13.1 million in the third quarter of 2025 compared to the same period last year primarily due to unfavorable region and business sales mix, partially offset by higher Net sales. The Performance Coatings Group’s gross profit as a percent of Net sales decreased in the third quarter of 2025 compared to the same period last year for these same reasons.\nConsolidated Selling, general and administrative expenses (SG&A) increased $59.1 million in the third quarter of 2025 versus the same period last year primarily due to increased investments in long-term growth opportunities in Paint Stores Group, and costs related to the new global headquarters and R&D buildings. As a percent of Net sales, consolidated SG&A remained flat in the third quarter of 2025 compared to the same period last year.\nThe Paint Stores Group’s SG&A increased $48.5 million in the third quarter of 2025 compared to the same period last year primarily due to increased investments in long-term growth opportunities such as expenses for new store openings. As a percent of Net sales, SG&A decreased year-over-year. The Consumer Brands Group’s SG&A decreased $0.4 million in the third quarter of 2025 compared to the same period last year primarily due to effective cost control in the core business operations. The Performance Coatings Group’s SG&A increased $7.5 million in the third quarter of 2025 compared to the same period last year primarily due to higher employee-related costs. The Administrative function’s SG&A increased $3.5 million in the third quarter of 2025 compared to the same period last year due primarily to costs related to the new global headquarters and R&D buildings.\nOther general (income) expense - net was income of $4.7 million in the third quarter of 2025 compared to expense of $0.7 million in the same period last year primarily due to insurance recoveries related to previous asset losses at a current manufacturing site. See Note 15 in Item 1 for further details.\nInterest expense increased $13.8 million in the third quarter of 2025 compared to the same period last year. See Note 6 in Item 1 for additional information on the Company’s outstanding debt.\n32\nOther expense (income) - net decreased $7.2 million in the third quarter of 2025 compared to the same period last year primarily due to miscellaneous expenses which occurred during the third quarter of 2024 which did not recur in the current period, partially offset by a decrease in Other income. See Note 15 in Item 1 for further details.\nNine Months Ended September 30, 2025\nConsolidated Cost of goods sold was effectively flat in the first nine months of 2025 compared to the same period in 2024 primarily due to a low-single digit decrease in sales volume and favorable foreign currency translation, offset by unfavorable business sales mix.\nConsolidated gross profit increased $181.0 million in the first nine months of 2025 compared to the same period in 2024 primarily due to higher selling prices in the Paint Stores Group, partially offset by lower sales volumes in the Paint Stores and Consumer Brands Groups and lower selling prices in the Performance Coatings Group, primarily attributable to business sales mix. Consolidated gross profit as a percent of consolidated Net sales increased in the first nine months of 2025 to 49.0% compared to 48.4% during the same period in 2024 for these same reasons. \nThe Paint Stores Group’s gross profit in the first nine months of 2025 was higher than the same period last year by $276.3 million due primarily to higher Net sales driven by higher selling prices, partially offset by a decrease in sales volume. The Paint Stores Group’s gross profit as a percent of Net sales increased in the first nine months of 2025 compared to the same period in 2024 for these same reasons. The Consumer Brands Group’s gross profit decreased by $73.8 million in the first nine months of 2025 compared to the same period last year due primarily to lower Net sales, supply chain inefficiencies from decreased production volumes and an unfavorable foreign currency related impact. The Consumer Brands Group’s gross profit as a percent of Net sales decreased in the first nine months of 2025 compared to the same period last year for these same reasons. The Performance Coatings Group’s gross profit decreased $56.5 million in the first nine months of 2025 compared to the same period last year primarily due to lower Net sales and unfavorable business sales mix. The Performance Coatings Group’s gross profit as a percent of Net sales decreased in the first nine months of 2025 compared to the same period last year for these same reasons.\nConsolidated SG&A increased $219.0 million in the first nine months of 2025 versus the same period last year primarily due to higher employee-related costs, costs related to the new global headquarters and R&D buildings and increased costs to support higher sales. As a percent of Net sales, consolidated SG&A increased 90 basis points in the first nine months of 2025 compared to the same period last year for these same reasons.\nThe Paint Stores Group’s SG&A increased $158.5 million in the first nine months of 2025 compared to the same period last year primarily due to increased investments in long-term growth opportunities such as expenses for new store openings. The Consumer Brands Group’s SG&A decreased $8.8 million in the first nine months of 2025 compared to the same period last year primarily due to a favorable foreign currency related impact and effective cost control in the core business operations. The Performance Coatings Group’s SG&A increased $13.8 million in the first nine months of 2025 compared to the same period last year due primarily to higher employee-related costs. The Administrative function’s SG&A increased $55.5 million in the first nine months of 2025 compared to the same period last year due primarily to higher employee-related costs, including severance, and costs related to the new global headquarters and R&D buildings.\nOther general (income) expense - net was expense of $10.5 million in the first nine months of 2025 compared to income of $30.9 million in the same period last year primarily due to insurance recoveries for environmental matters in the first nine months of 2024 which did not recur in the current period and increased miscellaneous operating expenses in the Administrative function. See Note 15 in Item 1 for further details.\nInterest expense increased $16.2 million in the first nine months of 2025 compared to the same period last year. See Note 6 in Item 1 for additional information on the Company’s outstanding debt.\nOther expense (income) - net was expense of $9.9 million in the first nine months of 2025 compared to income of $30.2 million in the same period last year. The decrease is primarily due to higher foreign currency transaction related losses and lower miscellaneous income, net of miscellaneous expenses, in the current period. See Note 15 in Item 1 for further details.\n33\nThe following table presents Income before income taxes by Reportable Segment and as a percentage of Net sales by Reportable Segment:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n% Change\n2025\n2024\n% Change\nIncome Before Income Taxes:\nPaint Stores Group\n$\n954.3\n \n$\n895.9 \n6.5 \n%\n$\n2,412.0\n \n$\n2,296.2 \n5.0 \n%\nConsumer Brands Group\n157.3\n \n165.5 \n(5.0)\n%\n453.4\n \n523.3 \n(13.4)\n%\nPerformance Coatings Group\n240.3\n \n259.7 \n(7.5)\n%\n698.1\n \n798.9 \n(12.6)\n%\nAdministrative\n(291.4)\n(298.3)\n2.3 \n%\n(864.3)\n(782.2)\n(10.5)\n%\nTotal\n$\n1,060.5\n \n$\n1,022.8 \n3.7 \n%\n$\n2,699.2\n \n$\n2,836.2 \n(4.8)\n%\nIncome Before Income Taxes\nas a Percent of Net Sales:\nPaint Stores Group\n24.9\n \n%\n24.5 \n%\n23.0\n \n%\n22.6 \n%\nConsumer Brands Group\n20.4\n \n%\n20.9 \n%\n19.4\n \n%\n21.4 \n%\nPerformance Coatings Group\n13.7\n \n%\n15.1 \n%\n13.5\n \n%\n15.3 \n%\nAdministrative\nnm\nnm\nnm\nnm\nTotal\n16.7\n \n%\n16.6 \n%\n15.0\n \n%\n15.9 \n%\nnm - not meaningful\nIncome Tax Expense\nThe effective tax rate was 21.4% for the third quarter of 2025 compared to 21.2% for the third quarter of 2024, and 22.5% for the first nine months of 2025 compared to 22.4% for the first nine months of 2024. The effective tax rate was essentially flat for the third quarter of 2025 and for the first nine months of 2025 when compared to the same periods last year. The significant components of the Company’s effective tax rate were consistent in both comparable periods. See Note 16 in Item 1 for further details. \nOn July 4, 2025, U.S. tax reform legislation known as the One Big Beautiful Bill Act (the Tax Act) was signed into law. Key provisions of the Tax Act relevant to the Company’s operations include immediate expensing of certain domestic capital expenditures and domestic research and development expense beginning in 2025 and changes to various U.S. international tax provisions going forward. The Company does not anticipate the Tax Act will materially change its effective tax rate for 2025, however, the Company is continuing to evaluate the full impact of the Tax Act on the condensed consolidated financial statements as further information becomes available. The Company has reflected the effects of the Tax Act in the condensed consolidated financial statements for the quarter ending September 30, 2025, in accordance with the Income Taxes Topic of the ASC. \nNet Income Per Share\nDiluted net income per share increased 5.3% to $3.35 per share in the third quarter of 2025 compared to $3.18 per share in the third quarter of 2024. Diluted net income per share in the third quarter of 2025 included charges for Valspar acquisition-related amortization expense of $0.20 per share and severance and other restructuring expenses of $0.04 per share. Diluted net income per share in the third quarter of 2024 included a charge for Valspar acquisition-related amortization expense of $0.19 per share. Foreign currency translation rate changes had an immaterial impact on diluted net income per share in the third quarter of 2025.\nDiluted net income per share for the first nine months of 2025 decreased 3.6% to $8.34 per share compared to $8.65 per share in the first nine months of 2024. Diluted net income per share for the first nine months of 2025 included charges for Valspar acquisition-related amortization expense of $0.59 per share and severance and other restructuring expenses of $0.27 per share. Diluted net income per share in the first nine months of 2024 included a charge for Valspar acquisition-related amortization expense of $0.59 per share. Foreign currency translation rate changes decreased diluted net income per share by $0.05 in the first nine months of 2025.\n34\nFINANCIAL CONDITION, LIQUIDITY AND CASH FLOW\nOverview\nThe Company’s financial condition and liquidity remained strong at September 30, 2025. The Company generated $2.359 billion in Net operating cash during the first nine months of 2025 and returned cash of $2.132 billion to its shareholders in the form of dividends and share repurchases during the first nine months of 2025. Net income decreased 5.0% to $2.092 billion and EBITDA decreased 2.6% to $3.523 billion for the first nine months of 2025. Refer to the Non-GAAP Financial Measures section below for the definition and calculation of EBITDA.\nAt September 30, 2025, the Company had Cash and cash equivalents of $241.5 million and total debt outstanding of $11.516 billion. Total debt, net of Cash and cash equivalents, was $11.274 billion. The Company continues to maintain sufficient short-term borrowing capacity at reasonable rates, and has sufficient cash on hand and total available borrowing capacity to fund its current operating requirements.\nNet Working Capital\nNet working capital, defined as Total current assets less Total current liabilities, decreased $83.6 million to a deficit of $1.327 billion at September 30, 2025 compared to a deficit of $1.244 billion at September 30, 2024. The net working capital decrease is due to an increase of $255.4 million in current liabilities partially offset by an increase in current assets of $171.8 million.\nCurrent asset balances increased $171.8 million at September 30, 2025 compared to September 30, 2024 due to an increase in Accounts receivable, net of $148.9 million, an increase in Other current assets of $10.7 million, an increase in Inventories of $8.9 million, and an increase in Cash and cash equivalents of $3.3 million.\nCurrent liability balances increased $255.4 million at September 30, 2025 compared to September 30, 2024 due to an increase in Short-term borrowings of $931.4 million, an increase in Other accruals of $78.0 million, primarily related to increases in accrued severance as well as insurance and other benefits payable, an increase in Accrued taxes of $40.1 million and an increase in the Current portion of operating lease liabilities of $17.0 million. These increases were offset by a decrease in the Current portion of long-term debt of $698.4 million, a decrease in Accounts payable of $96.1 million and a decrease in Compensation and taxes withheld of $16.6 million. The Company’s current ratio was 0.82, 0.79 and 0.83 at September 30, 2025, December 31, 2024 and September 30, 2024, respectively.\nProperty, Plant and Equipment\nNet property, plant and equipment increased $380.0 million in the first nine months of 2025 and $568.5 million in the twelve months since September 30, 2024. The increase in the first nine months was due to capital expenditures of $550.7 million, currency translation and other adjustments of $68.9 million and assets acquired through business combinations of $12.3 million, partially offset by depreciation expense of $242.0 million and the sale or disposition of fixed assets of $9.9 million. Since September 30, 2024, the increase was due to capital expenditures of $833.6 million, assets acquired through business combinations of $45.2 million and currency translation and other adjustments of $20.3 million, partially offset by depreciation expense of $322.1 million and the sale or disposition of fixed assets of $8.5 million.\nBuildings within Property, plant and equipment, net increased by $1.366 billion and $1.358 billion in the first nine months of 2025 and in the twelve months since September 30, 2024, respectively, primarily due to the new global headquarters and the research and development center (R&D Center) meeting the criteria to be placed into service during the third and second quarter of 2025, respectively. An immaterial amount of capital expenditures related to finalizing the construction of the new global headquarters and R&D Center will be placed into service during the remainder of 2025 and into 2026 in the Administrative function. The new global headquarters and associated parking garage assets will be depreciated over their useful lives of 60 and 45 years, respectively. Additionally, the R&D Center asset will be depreciated over its useful life of 60 years.\nAlso included in 2025 capital expenditures were expenditures related to manufacturing capacity expansion, operational efficiencies and maintenance projects in the Consumer Brands and Performance Coatings Groups and the opening of new stores and renovation and improvements in existing stores in the Paint Stores Group.\nIn 2025, the Company expects to spend slightly less than 2024 for capital expenditures, which it will fund primarily through the generation of operating cash. Core capital expenditures, which exclude expenditures associated with the new global headquarters and R&D Center, are expected to be for investments in capacity, productivity improvements and maintenance projects at existing manufacturing, distribution and R&D facilities and new store openings. Refer to “Real Estate Financing” below for further information on the financing transaction for the new global headquarters. \n35\nReal Estate Financing\nIn December 2022, the Company closed a transaction to sell and subsequently lease back its partially-constructed new global headquarters. As part of the terms of the transaction, the Company is contractually obligated for completing the construction of the building and related improvements at the new global headquarters. This transaction did not meet the criteria for recognition as an asset sale under U.S. generally accepted accounting principles (US GAAP) and as such, was accounted for as a real estate financing transaction. The Company received the final proceeds for the new global headquarters in the first quarter of 2025 for a total of $800 million. The initial lease term includes the construction period and extends for 30 years thereafter, and the Company has the right and option to extend the lease term. Lease payments over the next twelve months are expected to be approximately $51 million. The amount of the lease payments during the initial 30 year lease term is estimated to be approximately $1.938 billion. \nThe net proceeds from this transaction and other real estate financing transactions are recognized as Proceeds from real estate financing transactions within the Financing Activities section of the Statements of Condensed Consolidated Cash Flows. The Company will continue to recognize the related assets within Property, plant and equipment, net on the Consolidated Balance Sheets under US GAAP. These assets will be subject to depreciation over their useful lives in accordance with the Company’s accounting policies. The Company will also allocate payments between interest and repayment of the financing liability over the life of the agreement. See Note 8 in Item 1 and Note 10 in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024 for more information concerning real estate financing. \nGoodwill and Intangible Assets\nGoodwill increased $214.0 million from December 31, 2024 and increased $137.1 million from September 30, 2024. The increase during the first nine months of 2025 was due to foreign currency translation fluctuations and other adjustments of $154.7 million and purchase accounting allocations of $59.3 million. The increase over the twelve month period from September 30, 2024 was due to purchase accounting allocations of $80.4 million and foreign currency translation fluctuations and other adjustments of $56.7 million.\nIntangible assets decreased $67.0 million from December 31, 2024 and decreased $190.7 million from September 30, 2024. The decrease during the first nine months of 2025 was due to amortization of $248.5 million, partially offset by currency translation fluctuations and other adjustments of $119.9 million, purchase accounting allocations of $34.5 million and capitalized software of $27.1 million. The decrease over the twelve month period from September 30, 2024 was due to amortization of $330.4 million, partially offset by purchase accounting allocations of $62.4 million, currency translation fluctuations and other adjustments of $44.5 million and capitalized software of $32.8 million.\nSee Note 5 in Item 1 and Note 6 in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024 for more information concerning the Company’s Goodwill and Intangible assets.\nOther Assets\nOther assets increased $1.266 billion from December 31, 2024 and $1.452 billion from September 30, 2024. The increase in the first nine months of 2025 was primarily due to an increase of $1.150 billion, primarily related to the deposit held for the Suvinil acquisition, and an increase in Non-Traded investments. The increase from September 30, 2024 was primarily due to an increase of $1.150 billion, primarily related to the deposit held for the Suvinil acquisition, an increase in finance lease right-of-use assets and an increase in Non-Traded investments. See Notes 1 and 3 in Item 1 and Notes 1, 3 and 9 in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024 in for further information.\nDebt (including Short-term borrowings)\nSeptember 30,\nDecember 31,\nSeptember 30,\n2025\n2024\n2024\nLong-term debt (including current portion)\n$\n9,668.6\n \n$\n9,226.0 \n$\n9,224.2 \nShort-term borrowings\n1,846.9\n \n662.4 \n915.5 \nTotal debt outstanding\n$\n11,515.5\n \n$\n9,888.4 \n$\n10,139.7 \nThe Company’s long-term debt primarily consists of senior notes as disclosed in Note 7 to the Consolidated Financial Statements in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024. \n36\nIn July 2025, the Company issued $500.0 million of 4.30% senior notes due 2028, $500.0 million of 4.50% senior notes due 2030 and $500.0 million of 5.15% senior notes due 2035 in a public offering. The net proceeds from the issuance of these senior notes were used to repay the outstanding principal of $400.0 million related to the Company’s 3.45% senior notes due August 1, 2025, the outstanding principal of $400.0 million related to the Company’s 4.25% senior notes due August 8, 2025 and a portion of the outstanding borrowings under the Company’s domestic commercial paper program. The newly issued senior notes contain customary qualitative covenants as defined in their respective agreements. The Company is in compliance with these and all other covenants related to the senior notes as of September 30, 2025.\nIn August 2025, the Company amended its existing revolving credit agreement dated July 31, 2024 to extend the maturity of $2.5 billion of the commitments under the agreement from July 31, 2029 to August 8, 2030, remove a credit spread adjustment and modify the pricing grid. \nAlso in August 2025, the Company entered into a new 364-day senior unsecured delayed draw term loan credit agreement which provided $750.0 million and €250.0 million tranches available as a single draw for general corporate purposes, including to finance working capital requirements. The Company exercised the draw in September 2025 to fund the acquisition of Suvinil. See Note 3 in Item 1 for additional information on the acquisition of Suvinil.\nSee Note 6 in Item 1 for additional information concerning debt. \nDefined Benefit Pension and Other Postretirement Benefit Plans\nLong-term liabilities for defined benefit pension and other postretirement benefit plans did not change significantly from December 31, 2024. The changes from September 30, 2024 are primarily due to changes in actuarial assumptions. See Note 8 to the Consolidated Financial Statements in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024 for more information concerning the Company’s liabilities for defined benefit pension and other postretirement benefit plans.\nDeferred Income Taxes\nDeferred income taxes increased $49.7 million from December 31, 2024 and $25.5 million from September 30, 2024. This increase is primarily due to provisions of the Tax Act signed into law in July 2025 which allows for the immediate expensing of certain domestic capital expenditures and domestic research and development expenditures. This increase was partially offset by amortization of acquisition-related intangible assets. \nEnvironmental-Related Liabilities\nThe operations of the Company, like those of other companies in the same industry, are subject to various domestic and foreign environmental laws and regulations. These laws and regulations not only govern current operations and products, but also impose potential liability on the Company for past operations. Management expects environmental laws and regulations to impose increasingly stringent requirements upon the Company and the industry in the future. Management believes that the Company conducts its operations in compliance with applicable environmental laws, regulations and requirements and has implemented various programs designed to help protect the environment and promote continued compliance.\nDepreciation of capital expenditures and other expenses related to ongoing environmental compliance measures were included in the normal operating expenses of conducting business. The Company’s capital expenditures, depreciation and other expenses related to ongoing environmental compliance measures were not material to the Company’s financial condition, liquidity, cash flow or results of operations during the first nine months of 2025. Management does not expect that such capital expenditures, depreciation and other expenses will be material to the Company’s financial condition, liquidity, cash flow or results of operations in 2025. See Notes 8 and 15 in Item 1 for further information on environmental-related long-term liabilities.\nContractual Obligations, Commercial Commitments and Warranties\nThere have been no significant changes to the Company’s contractual obligations and commercial commitments in the first nine months of 2025 as summarized in Management’s Discussion and Analysis of Financial Condition and Results of Operations in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024 other than the amount of the lease payments during the 30 year lease term of the new global headquarters as disclosed in the Real Estate Financing section above. \nLitigation\nSee Note 9 in Item 1 for information concerning litigation.\n37\nShareholders’ Equity\nSeptember 30,\nDecember 31,\nSeptember 30,\n2025\n2024\n2024\nTotal shareholders’ equity\n$\n4,425.3\n \n$\n4,051.2 \n$\n4,156.1 \nShareholders’ equity increased $374.1 million during the first nine months of 2025 primarily as a result of Net income of $2.092 billion, an increase in AOCI of $285.1 million mainly due to currency translation adjustments and an increase in Other capital of $151.5 million mainly associated with stock-based compensation expense and stock option exercises. These increases were partially offset by $1.561 billion of treasury stock activity mainly attributable to treasury stock repurchases and cash dividends paid on common stock.\nShareholders’ equity increased $269.2 million since September 30, 2024 primarily as a result of Net income of $2.572 billion, an increase in Other capital of $256.3 million mainly associated with stock-based compensation expense and stock option exercises, and an increase in AOCI of $86.1 million mainly due to currency translation adjustments. These increases were partially offset by $1.872 billion of treasury stock activity mainly attributable to treasury stock repurchases and cash dividends paid on common stock.\nDuring the first nine months of 2025, the Company purchased 4.5 million shares of its common stock for treasury purposes through open market purchases. The Company acquires its common stock for general corporate purposes, and depending on its cash position and market conditions, it may acquire additional shares in the future. The Company had remaining authorization at September 30, 2025 to purchase 30.0 million shares of its common stock.\nIn February 2025, the Company’s Board of Directors increased the quarterly cash dividend from $0.715 per share to $0.79 per share. This quarterly dividend was approved in all subsequent quarters and will result in an annual dividend for 2025 of $3.16 per share, or a 30% payout of 2024 diluted net income per share.\nEffective April 16, 2025, the Company’s shareholders approved The Sherwin-Williams Company 2025 Equity and Incentive Compensation Plan. See Note 10 in Item 1 for additional information.\nCash Flow\nNet operating cash for the nine months ended September 30, 2025 was a source of $2.359 billion compared to a source of $2.219 billion for the same period in 2024. The improvement in Net operating cash was primarily due to a decrease in cash used for deferred income taxes, a decrease in Inventories and an increase in Accrued taxes, partially offset by a decrease in Accounts payable, an increase in Accounts receivable and a decrease in Net income.\nNet investing cash usage increased $983.9 million in the first nine months of 2025 to a usage of $1.895 billion compared to a usage of $910.8 million for the same period in 2024 primarily due to cash deposited for the future acquisition of a business and cash used for the acquisition of businesses, partially offset by a decrease in cash used for capital expenditures.\nNet financing cash usage decreased $910.0 million in the first nine months of 2025 to a usage of $436.3 million compared to a usage of $1.346 billion for the same period in 2024 primarily due to an increase in short-term borrowings and proceeds from long-term debt, partially offset by a decrease in proceeds from real estate financing transactions, an increase in treasury stock purchases, a decrease in proceeds from stock option exercises and an increase in payments of cash dividends. \nIn the twelve month period from October 1, 2024 through September 30, 2025, the Company generated Net operating cash of $3.294 billion, used $2.180 billion in investing activities and used $1.107 billion in financing activities.\nMarket Risk\nThe Company is exposed to market risk associated with interest rate, foreign currency and commodity fluctuations. The Company occasionally utilizes derivative instruments as part of its overall financial risk management policy, but does not use derivative instruments for speculative or trading purposes. In 2025 and 2024, the Company entered into foreign currency forward contracts with maturity dates of less than twelve months primarily to hedge against value changes in foreign currency. The Company also has cross currency swap contracts to hedge its net investment in European operations. See Notes 12 and 15 in Item 1 for additional information related to the Company’s use of derivative instruments.\n38\nThe Company believes it may be exposed to continuing market risk from interest rate, foreign currency exchange rate and commodity price fluctuations. However, the Company does not expect that interest rate, foreign currency exchange rate and commodity price fluctuations or hedging contract losses will have a material adverse effect on the Company’s financial condition, results of operations or cash flows.\nFinancial Covenant\nCertain borrowings contain a consolidated leverage covenant. The covenant states that the Company’s consolidated leverage ratio is not to exceed 3.75 to 1.00, however, the Company may elect to temporarily increase the leverage ratio to 4.25 to 1.00 for a period of four consecutive fiscal quarters immediately following the consummation of a qualifying acquisition, as defined in the New Credit Agreement dated July 31, 2024. The leverage ratio is defined as the ratio of total indebtedness (the sum of Short-term borrowings, Current portion of long-term debt and Long-term debt) at the reporting date to consolidated “Earnings Before Interest, Taxes, Depreciation, and Amortization” (EBITDA), as defined in the credit agreement, for the 12-month period ended on the same date. Refer to the “Non-GAAP Financial Measures” section below for a reconciliation of EBITDA to Net income. At September 30, 2025, the Company was in compliance with the covenant and expects to remain in compliance. The Company’s notes, debentures and revolving credit agreements contain various default and cross-default provisions. In the event of default under any one of these arrangements, acceleration of the maturity of any one or more of these borrowings may result. See Note 6 in Item 1 and Note 7 in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024 for additional information concerning the Company’s debt and related covenants.\n39\nNon-GAAP Financial Measures\nManagement of the Company utilizes certain financial measures that are not in accordance with US GAAP to analyze and manage the performance of the business. The required disclosures for these non-GAAP measures are shown below. The Company provides such non-GAAP information in reporting its financial results to give investors additional data to evaluate the Company’s operations. Management does not, nor does it suggest investors should, consider such non-GAAP measures in isolation from, or in substitution for, financial information prepared in accordance with US GAAP.\nEBITDA and Adjusted EBITDA\nEBITDA is a non-GAAP financial measure defined as Net income before income taxes, Interest expense, depreciation and amortization. Adjusted EBITDA is a non-GAAP financial measure defined as EBITDA that excludes certain adjustments that management believes enhances investors’ understanding of the Company’s operating performance. Management considers EBITDA and Adjusted EBITDA useful in understanding the operating performance of the Company. The reader is cautioned that the Company’s EBITDA and Adjusted EBITDA should not be compared to other entities unknowingly. Further, EBITDA and Adjusted EBITDA should not be considered alternatives to Net income as an indicator of operating performance. The reader should refer to the determination of Net income in accordance with US GAAP disclosed in the Statements of Consolidated Income in Item 1.\nThe following table summarizes EBITDA and Adjusted EBITDA as calculated by management for the periods indicated below:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \n2025\n2024\n2025\n2024\nNet income\n$\n833.1\n \n$\n806.2 \n$\n2,091.7\n \n$\n2,201.3 \nInterest expense\n117.2\n \n103.4 \n333.4\n \n317.2 \nIncome taxes\n227.4\n \n216.6 \n607.5\n \n634.9 \nDepreciation\n82.8\n \n74.4 \n242.0\n \n217.3 \nAmortization\n84.1\n \n81.2 \n248.5\n \n244.8 \nEBITDA \n$\n1,344.6\n \n$\n1,281.8 \n$\n3,523.1\n \n$\n3,615.5 \nSeverance and other restructuring expenses\n14.4\n \n— \n92.7\n \n— \nAdjusted EBITDA\n$\n1,359.0\n \n$\n1,281.8 \n$\n3,615.8\n \n$\n3,615.5 \nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe preparation of financial statements in conformity with US GAAP requires management to make estimates and assumptions that affect amounts reported in the accompanying condensed consolidated financial statements. These determinations were made based upon management’s best estimates, judgments and assumptions that were believed to be reasonable under the circumstances, giving due consideration to materiality. We do not believe there is a great likelihood that materially different amounts would be reported under different conditions or using different assumptions related to the accounting policies described below. However, application of these accounting policies involves the exercise of judgment and use of assumptions as to future uncertainties and, as a result, actual results could differ from these estimates.\nA comprehensive discussion of the Company’s critical accounting policies, management estimates and significant accounting policies followed in the preparation of the condensed consolidated financial statements is included in Management’s Discussion and Analysis of Financial Condition and Results of Operations and Note 1 in the Company’s Annual Report on Form 10-K for the year ended December 31, 2024. There have been no significant changes in critical accounting policies, management estimates or accounting policies since the year ended December 31, 2024.\n40\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING INFORMATION\nCertain statements contained in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and elsewhere in this report constitute “forward-looking statements” within the meaning of federal securities laws. These forward-looking statements are based upon management’s current expectations, predictions, estimates, assumptions and beliefs concerning future events and conditions and may discuss, among other things, anticipated future performance (including sales and earnings), expected growth, future business plans and the costs and potential liability for environmental-related matters and lead pigment and lead-based paint litigation. Any statement that is not historical in nature is a forward-looking statement and may be identified by the use of words and phrases such as “anticipate,” “aspire,” “believe,” “could,” “estimate,” “expect,” “goal,” “intend,” “may,” “plan,” “potential,” “project,” “seek,” “should,” “strive,” “target,” “will,” or “would” or the negative thereof or comparable terminology. \nReaders are cautioned not to place undue reliance on any forward-looking statements. Forward-looking statements are necessarily subject to risks, uncertainties and other factors, many of which are outside our control, that could cause actual results to differ materially from such statements and from our historical results, performance and experience. These risks, uncertainties and other factors include such things as:\n•\ngeneral business and economic conditions in the United States and worldwide;\n•\ninflation rates, interest rates, unemployment rates, labor costs, healthcare costs, recessionary conditions, geopolitical conditions, terrorist activity, armed conflicts and wars, public health crises, pandemics, outbreaks of disease and supply chain disruptions;\n•\nshifts in consumer behavior driven by economic downturns in cyclical segments of the economy;\n•\nshortages and increases in the cost of raw materials and energy;\n•\ncatastrophic events, adverse weather conditions and natural disasters (including those that may be related to climate change);\n•\nthe loss of any of our largest customers;\n•\nincreased competition or failure to keep pace with developments in key competitive areas of our business;\n•\ndisruptions to our information technology systems, including due to digitization efforts or cybersecurity incidents;\n•\nour ability to attract, retain, develop and progress a qualified global workforce;\n•\nour ability to successfully integrate past and future acquisitions into our existing operations;\n•\nrisks and uncertainties associated with our expansion into and our operations in South America, Asia, Europe and other foreign markets;\n•\npolicy changes affecting international trade, including import/export restrictions and tariffs;\n•\nour ability to achieve our strategies or expectations relating to sustainability considerations, including as a result of evolving legal, regulatory and other standards, processes and assumptions, the pace of scientific and technological developments, increased costs, the availability of requisite suppliers, energy sources, or financing and changes in carbon markets;\n•\ndamage to our business, reputation, image or brands due to negative publicity;\n•\nthe infringement or loss of our intellectual property rights or the theft or unauthorized use of our trade secrets or other confidential business information;\n•\na weakening of global credit markets or changes to our credit ratings;\n•\nour ability to generate cash to service our indebtedness;\n•\nfluctuations in foreign currency exchange rates and changing monetary policies;\n•\nour ability to comply with a variety of complex U.S. and non-U.S. laws, rules and regulations;\n•\nincreases in tax rates, or changes in tax laws or regulations;\n•\nour ability to comply with numerous, complex and increasingly stringent domestic and foreign health, safety and environmental laws, regulations and requirements;\n•\nour liability related to environmental investigation and remediation activities at some of our currently- and formerly-owned sites; \n•\nthe nature, cost, quantity and outcome of pending and future litigation, including lead pigment and lead-based paint litigation; and\n•\nthe other risk factors discussed in Part 1, Item 1A of our Annual Report on Form 10-K for the fiscal year ended December 31, 2024 and our other reports filed with the SEC.\n41\nReaders are cautioned that it is not possible to predict or identify all of the risks, uncertainties and other factors that may affect future results and that the above list should not be considered a complete list. Any forward-looking statement speaks only as of the date on which such statement is made, and we undertake no obligation to update or revise any forward-looking statement, whether as a result of new information, future events or otherwise, except as otherwise required by law."
}