{
  "item1": "ITEM 1. BUSINESS Sherwin-Williams Company, founded 1866 incorporated Ohio 1884, engaged development, manufacture, distribution sale paint, coatings related products professional, industrial, commercial retail customers primarily North South America additional operations Caribbean region, Europe, Asia Australia. principal executive offices located 101 West Prospect Avenue, Cleveland, Ohio 44115-1075, telephone (216) 566-2000. used report, terms “Sherwin-Williams,” “Company,” “we”, “us” “our” mean Sherwin-Williams Company its consolidated subsidiaries.",
  "item7": "Adjusted Diluted Net Income Per Share Management believes investors’ understanding Company’s operating performance enhanced disclosure diluted net income per share excluding Valspar acquisition-related amortization expense certain other adjustments. Valspar acquisition-related amortization expense excluded diluted net income per share due its significance result purchase price assigned finite-lived intangible assets date acquisition related impact underlying business performance trends. While these intangible assets contribute Company’s revenue generation, related revenue not excluded. adjusted earnings per share measurement not accordance US GAAP.",
  "item2": "Item 2. MANAGEMENT’S DISCUSSION ANALYSIS RESULTS OPERATIONS FINANCIAL CONDITION (dollars millions, except noted per share data) BACKGROUND Sherwin-Williams Company, founded 1866, its consolidated subsidiaries (collectively, Company) engaged development, manufacture, distribution sale paint, coatings related products professional, industrial, commercial retail customers primarily North South America additional operations Caribbean region throughout Europe, Asia Australia. Company structured into three reportable segments - Paint Stores Group, Consumer Brands Group Performance Coatings Group (collectively, Reportable Segments) - Administrative function, which representative way internally organized assessing performance making decisions regarding allocation resources. See Note 18 Item 1 further details Company’s Reportable Segments."
}