{
  "source_file": "sjm-20251031.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\n(Dollars and shares in millions, unless otherwise noted, except per share data)\nThis discussion and analysis deals with comparisons of material changes in the unaudited condensed consolidated financial statements for the three and six months ended October 31, 2025 and 2024. All comparisons presented are to the corresponding period of the prior year, unless otherwise noted.\nOn March 3, 2025, we sold certain Sweet Baked Snacks value brands to JTM. The transaction included certain trademarks and licenses, a manufacturing facility in Chicago, Illinois, and approximately 400 employees who supported the business. Under our ownership, these Sweet Baked Snacks value brands generated net sales of approximately $48.4 in 2025, which were included in the Sweet Baked Snacks segment. Net proceeds from the divestiture were $34.6, inclusive of the final working capital adjustment and cash transaction costs. We recognized a pre-tax loss of $44.2 on this transaction, primarily during the third quarter of 2025.\nOn December 2, 2024, we sold the \nVoortman\n business to Second Nature. The transaction included products sold under the \nVoortman \nbrand, inclusive of certain trademarks, a leased manufacturing facility in Burlington, Ontario, and approximately 300 employees who supported the business. Under our ownership, the \nVoortman \nbusiness generated net sales of approximately $86.3 in 2025, which were included in the Sweet Baked Snacks segment. Net proceeds from the divestiture were $291.4, inclusive of the final working capital adjustment and cash transaction costs. We recognized a pre-tax loss of $265.9 on this transaction, primarily during the second quarter of 2025.\nWe are the owner of all trademarks referenced herein, except for the following, which are used under license: \nDunkin’\n is a trademark of DD IP Holder LLC used under three licenses (the “Dunkin’ Licenses”) for packaged coffee products, including K-Cup\n®\n pods, sold in retail channels, such as grocery stores, mass merchandisers, club stores, e-commerce, and drug stores, as well as in certain away from home channels. The Dunkin’ Licenses do not pertain to coffee or other products for sale in \nDunkin’\n restaurants. K-Cup\n®\n is a trademark of Keurig Green Mountain, Inc., used with permission.\nTrends Affecting our Business\nDuring the first half of 2026, we continued to experience input cost inflation and a dynamic macroeconomic environment, inclusive of tariffs, regulatory and policy changes, and changes in consumer behaviors, which we anticipate will persist through the remainder of 2026. Further, the higher costs have required price increases across our business, and we anticipate the price elasticity of demand could remain elevated during 2026 as consumers continue to experience broader inflationary pressures and are selective in their spending. In response to the inflationary pressures, we continue to focus on the delivery of our company-wide transformation initiative to deliberately translate our continuous improvement mindset into sustainable productivity initiatives in order to grow our profit margins and reinvest in the Company to enable future growth and cost savings. \nIn addition, it is possible significant disruptions in our supply chain could occur if certain geopolitical events continue to impact markets around the world, including the impact of potential shipping delays due to supply and demand imbalances, as well as labor shortages and tariffs. We also continue to work closely with our customers and external business partners, taking additional actions to ensure safety and business continuity and to maximize product availability. We have maintained production at all our facilities and availability of appointments at distribution centers. \nAlthough we do not have any operations in Russia, Ukraine, Israel, Palestine, China, or Taiwan, we continue to monitor these environments, among others, for any significant escalation or expansion of economic or supply chain disruptions, including broader inflationary costs and the impact of tariffs, as well as regional or global economic recessions. Overall, broad-based supply chain disruptions and the impact of inflation remain uncertain. We will continue to evaluate the nature and extent to which supply chain disruptions and inflation will impact our business, supply chain, including labor availability and attrition, results of operations, financial condition, and liquidity.\n22\nTable of Contents\nResults of Operations\n \nThree Months Ended October 31,\nSix Months Ended October 31,\n \n2025\n2024\n% Increase (Decrease)\n2025\n2024\n% Increase (Decrease)\nNet sales\n$\n2,330.1 \n$\n2,271.2 \n3 \n%\n$\n4,443.4 \n$\n4,396.3 \n1 \n%\nGross profit\n$\n869.9 \n$\n886.1 \n(2)\n$\n1,344.6 \n$\n1,683.3 \n(20)\n% of net sales\n37.3 \n%\n39.0 \n%\n30.3 \n%\n38.3 \n%\nOperating income\n$\n418.5 \n$\n169.7 \n147 \n$\n464.1 \n$\n519.2 \n(11)\n% of net sales\n18.0 \n%\n7.5 \n%\n10.4 \n%\n11.8 \n%\nNet income (loss):\nNet income (loss)\n$\n241.3 \n$\n(24.5)\nn/m\n$\n197.4 \n$\n160.5 \n23 \nNet income (loss) per common share – assuming dilution\n$\n2.26 \n$\n(0.23)\nn/m\n$\n1.85 \n$\n1.51 \n23 \nAdjusted gross profit \n(A)\n$\n789.9 \n$\n879.7 \n(10)\n$\n1,533.1 \n$\n1,712.2 \n(10)\n% of net sales\n33.9 \n%\n38.7 \n%\n34.5 \n%\n38.9 \n%\nAdjusted operating income \n(A)\n$\n394.3 \n$\n490.6 \n(20)\n$\n764.6 \n$\n938.5 \n(19)\n% of net sales\n16.9 \n%\n21.6 \n%\n17.2 \n%\n21.3 \n%\nAdjusted income: \n(A)\nIncome\n$\n224.3 \n$\n294.2 \n(24)\n$\n427.7 \n$\n553.7 \n(23)\nEarnings per share – assuming dilution\n$\n2.10 \n$\n2.76 \n(24)\n$\n4.00 \n$\n5.19 \n(23)\n(A)\nWe use non-GAAP financial measures to evaluate our performance. Refer to “Non-GAAP Financial Measures” in this discussion and analysis for a reconciliation to the comparable GAAP financial measure. \nNet Sales\nThree Months Ended October 31,\nSix Months Ended October 31,\n2025\n2024\nIncrease \n(Decrease)\n%\n2025\n2024\nIncrease \n(Decrease)\n%\nNet sales\n$\n2,330.1 \n$\n2,271.2 \n$\n58.9 \n3 \n%\n$\n4,443.4 \n$\n4,396.3 \n$\n47.1 \n1 \n%\nSweet Baked Snacks value brands divestiture\n— \n(14.2)\n14.2 \n1 \n— \n(29.9)\n29.9 \n1 \nVoortman\n divestiture\n— \n(36.3)\n36.3 \n2 \n— \n(73.4)\n73.4 \n2 \nForeign currency exchange\n1.6 \n— \n1.6 \n— \n1.8 \n— \n1.8 \n— \nNet sales excluding divestitures and foreign currency exchange \n(A)\n$\n2,331.7 \n$\n2,220.7 \n$\n111.0 \n5 \n%\n$\n4,445.2 \n$\n4,293.0 \n$\n152.2 \n4 \n%\nAmounts may not add due to rounding.\n(A)     Net sales excluding divestitures and foreign currency exchange is a non-GAAP financial measure used to evaluate performance internally. This measure provides useful information to investors because it enables comparison of results on a year-over-year basis. \nNet sales in the second\n \nquarter of 2026 increased $58.9, or 3 percent, which includes $50.5 of noncomparable net sales in the prior year related to divestitures. Net sales excluding divestitures and foreign currency exchange increased $111.0, or 5 percent. Net price realization contributed 11 percentage points to net sales, primarily driven by higher net pricing for coffee. Volume/mix decreased net sales by 6 percentage points, primarily driven by decreases for coffee, peanut butter, dog snacks, and lapping contract manufacturing sales related to the divested pet food brands in the prior year.  \nNet sales in the first six months of 2026 increased $47.1, or 1 percent, which includes $103.3 of noncomparable net sales in the prior year related to divestitures. Net sales excluding divestitures and foreign currency exchange increased $152.2, or 4 percent. Net price realization contributed 8 percentage points to net sales, primarily driven by higher net pricing for coffee. Volume/mix decreased net sales by 5 percentage points, primarily driven by decreases for coffee, dog snacks, peanut butter, and lapping contract manufacturing sales related to the divested pet food brands in the prior year.  \n23\nTable of Contents\nOperating Income\nThe following table presents the components of operating income as a percentage of net sales. \n \nThree Months Ended October 31,\nSix Months Ended October 31,\n \n2025\n2024\n2025\n2024\nGross profit\n37.3 \n%\n39.0 \n%\n30.3 \n%\n38.3 \n%\nSelling, distribution, and administrative expenses:\nMarketing\n6.1 \n%\n5.4 \n%\n5.9 \n%\n5.3 \n%\nSelling\n2.6 \n2.7 \n3.0 \n3.1 \nDistribution\n3.1 \n3.0 \n3.2 \n3.2 \nGeneral and administrative\n5.3 \n6.1 \n5.5 \n6.2 \nTotal selling, distribution, and administrative expenses\n17.1 \n%\n17.2 \n%\n17.5 \n%\n17.8 \n%\nAmortization\n2.2 \n2.5 \n2.3 \n2.5 \nOther special project costs\n0.2 \n0.5 \n0.3 \n0.4 \nLoss (gain) on divestitures – net\n— \n11.5 \n— \n5.9 \nOther operating expense (income) – net\n(0.1)\n(0.1)\n(0.2)\n(0.2)\nOperating income\n18.0 \n%\n7.5 \n%\n10.4 \n%\n11.8 \n%\nAmounts may not add due to rounding.\nGross profit decreased $16.2, or 2 percent, in the second quarter of 2026, primarily driven by higher commodity costs, unfavorable volume/mix, tariffs, and the noncomparable impact of divestitures, partially offset by higher net price realization and a net favorable impact of derivative gains and losses.\nOperating income increased $248.8, or 147 percent, in the second quarter of 2026, primarily driven by lapping the $260.8 pre-tax loss on the \nVoortman\n business disposal group classified as held for sale in the prior year, lower amortization expense, and a decrease in other special project costs, partially offset by the decrease in gross profit and an increase in selling, distribution, and administrative (“SD&A”) expenses.\nOur non-GAAP financial measures are adjusted to exclude amortization expense and impairment charges related to intangible assets, special project costs, gains and losses on divestitures, the change in net cumulative unallocated derivative gains and losses, and other infrequently occurring items that do not directly reflect ongoing operating results. Refer to “Non-GAAP Financial Measures” in this discussion and analysis for additional information. Gross profit excluding non-GAAP adjustments (“adjusted gross profit”) decreased $89.8, or 10 percent, as compared to the prior year second quarter, reflecting the exclusion of the change in net cumulative unallocated derivative gains and losses and special project costs as compared to GAAP gross profit. Adjusted operating income decreased $96.3, or 20 percent, as compared to the prior year second quarter, further reflecting the exclusion of the $260.8 pre-tax loss for the assets held for sale in the prior year, amortization expense, and other special project costs.\nGross profit decreased $338.7, or 20 percent, in the first six months of 2026, primarily driven by higher commodity costs, a net unfavorable impact of derivative gains and losses, unfavorable volume/mix, tariffs, and the noncomparable impact of divestitures, partially offset by higher net price realization.\nOperating income decreased $55.1, or 11 percent, in the first six months of 2026, primarily reflecting the decrease in gross profit, partially offset by lapping the $260.8 pre-tax loss on the \nVoortman\n business disposal group classified as held for sale in the prior year, lower amortization expense, and decreases in other special project costs and SD&A expenses.\nAdjusted gross profit decreased $179.1, or 10 percent, as compared to the prior year, reflecting the exclusion of the change in net cumulative unallocated derivative gains and losses and special project costs as compared to GAAP gross profit. Adjusted operating income decreased $173.9, or 19 percent, as compared to the prior year, further reflecting the exclusion of the $260.8 pre-tax loss for the assets held for sale in the prior year, amortization expense, and other special project costs..\nInterest Expense \nNet interest expense was comparable to the prior year for the three and six months ended October 31, 2025. For additional information, refer to Note 7: Debt and Financing Arrangements. \n24\nTable of Contents\nIncome Taxes \nThe effective income tax rates for the three months ended October 31, 2025 and 2024, were 24.2 and 136.7 percent, respectively, and for the six months ended October 31, 2025 and 2024, were 24.6 and 48.7 percent, respectively. During the current year, the effective income tax rates varied from the U.S. statutory income tax rate of 21.0 percent, primarily due to state income taxes. During the prior year, the effective income tax rates varied from the U.S. statutory income tax rate of 21.0 percent, primarily due to unfavorable impacts of the classification of the \nVoortman\n business as held for sale. We anticipate a full-year effective income tax rate for 2026 to be approximately 24.2 percent. For additional information, refer to Note 12: Income Taxes.\nSpecial Project Costs\nDivestiture Costs\n: Total divestiture costs incurred to date related to the \nSahale Snacks\n and Canada condiment businesses that were divested in 2024 were $6.4, which included $4.3 and $2.1 of employee-related and other transition and termination costs, respectively, all of which were cash charges. We did not incur any divestiture costs during the three and six months ended October 31, 2025, and incurred divestiture costs of $0.1 and $0.4 during the three and six months ended October 31, 2024, respectively, primarily consisting of employee-related costs. We do not anticipate any additional costs to be incurred related to these divestiture activities. \nAs a result of our recent divestitures, we identified opportunities to address certain distribution inefficiencies. We anticipate incurring approximately $12.0 of costs related to these efforts, consisting primarily of other transition and termination charges. The majority of these costs are expected to be cash charges and incurred by the end of 2026. We have recognized total cumulative costs of $8.4, of which $1.6 and $1.9 were recognized during the three and six months ended October 31, 2025, respectively, and $0.8 and $0.9 during the three and six months ended October 31, 2024, respectively, primarily consisting of other transition and termination costs.\nIntegration Costs\n: On November 7, 2023, we completed a cash and stock transaction to acquire Hostess Brands, a manufacturer and marketer of sweet baked goods brands. Total integration costs related to the acquisition are anticipated to be approximately $190.0 and include transaction costs, employee-related costs, and other transition and termination charges. We have recognized total cumulative integration costs of $186.0, of which $0.7 and $1.1 were recognized during the three and six months ended October 31, 2025, respectively, and $15.1 and $27.1 were recognized during the three and six months ended October 31, 2024, respectively. We anticipate the remaining integration costs will be incurred by the end of 2026 and are expected to be split between employee-related and other transition and termination costs. \nRestructuring Costs\n: During the first quarter of 2026, we announced plans to close our Indianapolis, Indiana manufacturing facility, which manufactures \nHostess\n branded products, and consolidate operations into other existing facilities by early calendar year 2026 to further optimize operations for our Sweet Baked Snacks segment. We anticipate incurring approximately $75.0 of costs related to these efforts, consisting of $60.0 in noncash charges for accelerated depreciation and $15.0 in employee-related and other transition and termination costs. We have recognized total cumulative costs of $47.9, which included $27.2 and $47.9 of employee-related and other transition and termination costs, during the three and six months ended October 31, 2025, respectively. \nFor further information on these costs, refer to Note 4: Special Project Costs.\nSegment Results\nWe have four reportable segments: U.S. Retail Coffee, U.S. Retail Frozen Handheld and Spreads, U.S. Retail Pet Foods, and Sweet Baked Snacks. The presentation of International and Away From Home represents a combination of all other operating segments that are not individually reportable.\nT\nhe U.S. Retail Coffee segment primarily includes the domestic sales of \nFolgers\n,\n Dunkin’\n,\n \nand\n Café Bustelo\n \nbranded coffee; the U.S. Retail Frozen Handheld and Spreads segment primarily includes the domestic sales of \nUncrustables\n, \nJif\n, and \nSmucker’s \nbranded products; the U.S. Retail Pet Foods segment primarily includes the domestic sales of \nMeow Mix\n,\n Milk-Bone\n, \nPup-Peroni\n,\n \nand \nCanine Carry Outs \nbranded products; and the Sweet Baked Snacks segment primarily includes all domestic and foreign sales of \nHostess\n \nbranded products in all channels. With the exception of Sweet Baked Snacks products, International and Away From Home includes the sale of all products that are distributed in foreign countries through retail channels, as well as domestically and in foreign countries through foodservice distributors and operators (e.g., healthcare operators, restaurants, educational institutions, offices, lodging and gaming establishments, and convenience stores). \n25\nTable of Contents\n \nThree Months Ended October 31,\nSix Months Ended October 31,\n2025\n2024\n% Increase\n(Decrease)\n2025\n2024\n% Increase\n(Decrease)\nNet sales:\nU.S. Retail Coffee\n$\n848.9 \n$\n704.0 \n21 \n%\n$\n1,566.1 \n$\n1,327.4 \n18 \n%\nU.S. Retail Frozen Handheld and Spreads\n461.1 \n485.2 \n(5)\n945.8 \n982.0 \n(4)\nU.S. Retail Pet Foods\n413.2 \n445.4 \n(7)\n781.2 \n845.1 \n(8)\nSweet Baked Snacks\n256.1 \n315.5 \n(19)\n509.3 \n649.2 \n(22)\nInternational and Away From Home\n350.8 \n321.1 \n9 \n641.0 \n592.6 \n8 \nSegment profit:\nU.S. Retail Coffee\n$\n154.3 \n$\n202.7 \n(24)\n%\n$\n288.5 \n$\n375.3 \n(23)\n%\nU.S. Retail Frozen Handheld and Spreads\n102.1 \n116.1 \n(12)\n216.4 \n235.1 \n(8)\nU.S. Retail Pet Foods\n124.4 \n121.4 \n2 \n225.7 \n236.7 \n(5)\nSweet Baked Snacks\n21.8 \n70.6 \n(69)\n56.0 \n145.0 \n(61)\nInternational and Away From Home\n76.4 \n68.0 \n12 \n141.9 \n116.6 \n22 \nSegment profit margin:\nU.S. Retail Coffee\n18.2 \n%\n28.8 \n%\n18.4 \n%\n28.3 \n%\nU.S. Retail Frozen Handheld and Spreads\n22.1 \n23.9 \n22.9 \n23.9 \nU.S. Retail Pet Foods\n30.1 \n27.3 \n28.9 \n28.0 \nSweet Baked Snacks\n8.5 \n22.4 \n11.0 \n22.3 \nInternational and Away From Home\n21.8 \n21.2 \n22.1 \n19.7 \nU.S. Retail Coffee\n \nThe U.S. Retail Coffee segment net sales increased $144.9 in the second quarter of 2026. Net price realization increased net sales by 27 percentage points, reflecting higher net pricing across the portfolio. Volume/mix decreased net sales by 6 percentage points, primarily reflecting decreases for the \nFolgers \nand \nDunkin’ \nbrands, partially offset by an increase for the \nCafé Bustelo \nbrand. Segment profit decreased $48.4, primarily reflecting higher commodity costs, tariffs, unfavorable volume/mix, and higher marketing spend, partially offset by higher net price realization.\nThe U.S. Retail Coffee segment net sales increased $238.7 in the first six months of 2026. Net price realization increased net sales by 23 percentage points, reflecting higher net pricing across the portfolio. Volume/mix decreased net sales by 5 percentage points, primarily reflecting decreases for the \nFolgers\n and \nDunkin’ \nbrands, partially offset by an increase for the \nCafé Bustelo \nbrand. Segment profit decreased $86.8, primarily reflecting higher commodity costs, unfavorable volume/mix, tariffs, and higher marketing spend, partially offset by higher net price realization.\nU.S. Retail Frozen Handheld and Spreads\n \nThe U.S. Retail Frozen Handheld and Spreads segment net sales decreased $24.1 in the second quarter of 2026. Volume/mix decreased net sales by 8 percentage points, primarily reflecting decreases for peanut butter, fruit spreads, and \nUncrustables \nsandwiches. Net price realization contributed 3 percentage points to net sales, primarily reflecting higher net pricing for \nUncrustables \nsandwiches. Segment profit decreased $14.0, primarily driven by unfavorable volume/mix, higher marketing spend, and increased costs, partially offset by higher net price realization and lower pre-production expenses related to the new \nUncrustables\n sandwiches manufacturing facility. \nThe U.S. Retail Frozen Handheld and Spreads segment net sales decreased $36.2 in the first six months of 2026. Volume/mix decreased net sales by 5 percentage points, primarily reflecting decreases for peanut butter and fruit spreads. Net price realization contributed 1 percentage point to net sales, reflecting higher net pricing for \nUncrustables \nsandwiches, partially offset by higher trade spend for peanut butter. Segment profit decreased $18.7, primarily driven by unfavorable volume/mix, higher marketing spend, and increased costs, partially offset by lower pre-production expenses related to the new \nUncrustables\n sandwiches manufacturing facility and higher net price realization. \n26\nTable of Contents\nU.S. Retail Pet Foods\n \nThe U.S. Retail Pet Foods segment net sales decreased $32.2 in the second quarter of 2026. Volume/mix decreased net sales by 8 percentage points, primarily driven by a decrease for dog snacks and lapping contract manufacturing sales related to the divested pet food brands in the prior year. Net price realization contributed 1 percentage point to net sales, reflecting higher net pricing across the portfolio. Segment profit increased $3.0, primarily reflecting lower costs and higher net price realization, partially offset by unfavorable volume/mix.\nThe U.S. Retail Pet Foods segment net sales decreased $63.9 in the first six months of 2026. Volume/mix decreased net sales by 8 percentage points, primarily reflecting a decrease for dog snacks and lapping contract manufacturing sales related to the divested pet food brands in the prior year. Net price realization was neutral to net sales. Segment profit decreased $11.0, primarily reflecting unfavorable volume/mix, partially offset by higher net price realization and lower marketing spend.\nSweet Baked Snacks\nThe Sweet Baked Snacks segment net sales decreased $59.4 in the second quarter of 2026, inclusive of the impact of $50.5 of noncomparable net sales in the prior year related to the divested \nVoortman \nbusiness and certain Sweet Baked Snacks value brands. Excluding the noncomparable impact of the divestitures, net sales decreased $8.9, or 3 percent. Volume/mix decreased net sales by 2 percentage points, primarily reflecting decreases for snack cakes, private label products, and breakfast, partially offset by an increase for donuts. Net price realization decreased net sales by 1 percentage point, primarily reflecting lower net pricing across the majority of the portfolio. Segment profit decreased $48.8, primarily reflecting higher costs, the impact of noncomparable segment profit in the prior year related to the divested businesses, unfavorable volume/mix, and higher marketing spend. \nThe Sweet Baked Snacks segment net sales decreased $139.9 in the first six months of 2026, inclusive of the impact of $103.3 of noncomparable net sales in the prior year related to the divested \nVoortman \nbusiness and certain Sweet Baked Snacks value brands. Excluding the noncomparable impact of the divestitures, net sales decreased $36.6, or 7 percent. Volume/mix decreased net sales by 5 percentage points, primarily reflecting decreases for snack cakes and private label products, partially offset by an increase for donuts. Net price realization decreased net sales by 1 percentage point, primarily reflecting lower net pricing for snack cakes. Segment profit decreased $89.0, primarily reflecting higher costs, the impact of noncomparable segment profit in the prior year related to the divested businesses, unfavorable volume/mix, lower net price realization, and higher marketing spend. \nInternational and Away From Home\n \nInternational and Away From Home net sales increased $29.7 in the second quarter of 2026, including $1.6 of unfavorable foreign currency exchange. Excluding the noncomparable impact of foreign currency exchange, net sales increased $31.3, or 10 percent. Net price realization contributed 9 percentage points to net sales, primarily driven by higher net pricing for coffee. Volume/mix contributed 1 percentage point to net sales, primarily reflecting an increase for \nUncrustables \nsandwiches, partially offset by decreases for coffee, peanut butter, and dog snacks. Segment profit increased $8.4, primarily driven by higher net price realization, lower SD&A expenses, and favorable volume/mix, partially offset by higher costs and tariffs.\nInternational and Away From Home net sales increased $48.4 in the first six months of 2026, including $1.8 of unfavorable foreign currency exchange. Excluding the noncomparable impact of foreign currency exchange, net sales increased $50.2, or 8 percent. Net price realization contributed 9 percentage points to net sales, primarily driven by higher net pricing for coffee. Volume/mix was neutral to net sales as decreases for coffee, fruit spreads, and dog snacks were mostly offset by an increase for \nUncrustables\n sandwiches. Segment profit increased $25.3, primarily driven by higher net price realization, lower SD&A expenses, and favorable volume/mix, partially offset by higher costs and tariffs.\n27\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity\nOur principal source of funds is cash generated from operations, supplemented by borrowings against our commercial paper program and revolving credit facility. Total cash and cash equivalents decreased to $62.8 at October 31, 2025, compared to $69.9 at April 30, 2025.\nThe following table presents selected cash flow information. \n \nSix Months Ended October 31,\n \n2025\n2024\nNet cash provided by (used for) operating activities\n$\n335.9 \n$\n577.1 \nNet cash provided by (used for) investing activities\n(190.0)\n(225.7)\nNet cash provided by (used for) financing activities\n(151.7)\n(363.7)\nNet cash provided by (used for) operating activities\n$\n335.9 \n$\n577.1 \nAdditions to property, plant, and equipment\n(150.6)\n(210.7)\nFree cash flow \n(A)\n$\n185.3 \n$\n366.4 \n(A)\nFree cash flow is a non-GAAP financial measure used by management to evaluate the amount of cash available for debt repayment, dividend distribution, acquisition opportunities, share repurchases, and other corporate purposes.\nThe $241.2 decrease in cash provided by operating activities in the first six months of 2026 was primarily driven by lower net income adjusted for noncash items in the current year and higher working capital requirements in 2026. The cash required to fund working capital increased compared to the prior year, primarily driven by an increase in cash used for inventories, reflecting higher inventory levels and input cost inflation in the current year, and an increase in cash used for accounts payable due to timing of spend and payments, partially offset by increases in cash related to the timing of settling our derivative instruments and the change in trade receivables due to timing of sales and payments.\nCash used for investing activities in the first six months of 2026 consisted primarily of $150.6 in capital expenditures, primarily reflecting plant maintenance and improvement of our facilities, and an increase of $52.8 in our derivative cash margin account balances. Cash used for investing activities in the first six months of 2025 consisted primarily of $210.7 in capital expenditures, reflecting our investments in the new \nUncrustables\n sandwiches manufacturing and distribution facilities in McCalla, Alabama, as well as plant maintenance across our facilities. The use of cash for 2025 also included an increase of $14.9 in our derivative cash margin account balances.\nCash used for financing activities in the first six months of 2026 consisted primarily of dividend payments of $231.2, partially offset by a net increase in short-term borrowings of $87.4. Cash used for financing activities in the first six months of 2025 consisted primarily of dividend payments of $226.5 and a net decrease in short-term borrowings of $121.6. \nSupplier Financing Program\nAs part of ongoing efforts to maximize working capital, we work with our suppliers to optimize our terms and conditions, which includes the extension of payment terms. Payment terms with our suppliers, which we deem to be commercially reasonable, range from 0 to 180 days. We have an agreement with a third-party administrator to provide an accounts payable tracking system and facilitate a supplier financing program, which allows participating suppliers the ability to monitor and voluntarily elect to sell our payment obligations to a designated third-party financial institution. Participating suppliers can sell one or more of our payment obligations at their sole discretion. We have no economic interest in a supplier’s decision to enter into these agreements. Our rights and obligations to our suppliers, including amounts due and scheduled payment terms, are not impacted by our suppliers’ decisions to sell amounts under these arrangements. As of October 31, 2025, and April 30, 2025, $248.0 and $340.4 of our outstanding payment obligations, respectively, were elected and sold to a financial institution by participating suppliers. During the first six months of 2026 and 2025, we paid $679.6 and $818.8, respectively, to a financial institution for payment obligations that were settled through the supplier financing program. \n28\nTable of Contents\nContingencies\n \nWe, like other food manufacturers, are from time to time subject to various administrative, regulatory, and other legal proceedings arising in the ordinary course of business. We are currently a defendant in a variety of such legal proceedings, and while we cannot predict with certainty the ultimate results of these proceedings or potential settlements associated with these or other matters, we have accrued losses for certain contingent liabilities that we have determined are probable and reasonably estimable at October 31, 2025. Based on the information known to date, with the exception of the matters discussed below, we do not believe the final outcome of these proceedings will have a material adverse effect on our financial position, results of operations, or cash flows.\nClass Action Lawsuits:\n We are defendants in a series of putative class action lawsuits that were transferred to the U.S. District Court for the Western District of Missouri for coordinated pre-trial proceedings. The plaintiffs assert claims arising under various state laws for false advertising, consumer protection, deceptive and unfair trade practices, and similar statutes. Their claims are premised on allegations that we have misrepresented the number of servings that can be made from various canisters of \nFolgers\n coffee on the packaging for those products. The outcome and the financial impact of these cases, if any, cannot be predicted at this time. Accordingly, no loss contingency has been recorded for these matters as of October 31, 2025, as the likelihood of loss is not considered probable or reasonably estimable. However, if we are required to pay significant damages, our business and financial results could be adversely impacted, and sales of those products could suffer not only in these locations but elsewhere.\nVoortman Contingency: \nIn December 2020, Hostess Brands asserted claims for indemnification against the Sellers under the terms of the Purchase Agreement pursuant to which Hostess Brands acquired Voortman. The claims were for damages arising out of alleged breaches by the Sellers of certain representations, warranties, and covenants contained in the Purchase Agreement relating to periods prior to the closing of the acquisition. Hostess Brands also submitted claims relating to these alleged breaches under RWI that was purchased in connection with the acquisition. In the third quarter of calendar 2022, the RWI insurers paid Hostess Brands the Proceeds related to these breaches. Per agreement with the RWI insurers, we will not be required to return the Proceeds under any circumstances.\nOn November 3, 2022, pursuant to the agreement with the RWI insurers, Voortman brought the Claim related to the breaches against certain of the Sellers. The Claim alleges the seller defendants made certain non-disclosures and misrepresentations to induce Hostess Brands to overpay for Voortman. We are seeking damages of $109.0 CAD representing the amount of the aggregate liability of the Sellers for indemnification under the Purchase Agreement, $5.0 CAD in punitive or aggravated damages, interest, proceedings fees, and any other relief the presiding court deems appropriate. A portion of any recovery will be shared with the RWI insurers. Although we believe that the Claim is meritorious, no assurance can be given as to whether we will recover all, or any part, of the amounts being pursued. We retained rights to the Claim upon the divestiture of the \nVoortman\n business in 2025.\nCapital Resources\nThe following table presents our capital structure.\nOctober 31, 2025\nApril 30, 2025\nShort-term borrowings\n$\n748.2 \n$\n640.8 \nLong-term debt\n7,039.8 \n7,036.8 \nTotal debt\n$\n7,788.0 \n$\n7,677.6 \nShareholders’ equity\n6,060.2 \n6,082.6 \nTotal capital\n$\n13,848.2 \n$\n13,760.2 \nWe have available a $2.0 billion unsecured revolving credit facility with a group of ten banks that matures in March 2030. Additionally, we participate in a commercial paper program under which we can issue short-term, unsecured commercial paper not to exceed $2.0 billion at any time. The commercial paper program is backed by our revolving credit facility and reduces what we can borrow under the revolving credit facility by the amount of commercial paper outstanding. Commercial paper is used as a continuing source of short-term financing for general corporate purposes. As of October 31, 2025, we had $748.5 of short-term borrowings outstanding, which were issued under our commercial paper program at a weighted-average interest rate of 4.29 percent.\nWe are in compliance with all our debt covenants as of October 31, 2025, and expect to be for the next 12 months. For additional information on our long-term debt, sources of liquidity, and debt covenants, see Note 7: Debt and Financing Arrangements.\n29\nTable of Contents\nDividend payments were $231.2 and $226.5 in the first six months of 2026 and 2025, respectively, and dividends declared per share were $2.20 and $2.16 in the first six months of 2026 and 2025, respectively. The declaration of dividends is subject to the discretion of our Board and depends on various factors, such as our net income (loss), financial condition, cash requirements, future events, and other factors deemed relevant by the Board.\nDuring the six months ended October 31, 2025, we did not repurchase any common shares under a repurchase plan authorized by the Board. The shares repurchased during the six months ended October 31, 2025 and 2024, consisted of shares repurchased from stock plan recipients in lieu of cash payments. As of October 31, 2025, approximately 1.1 million common shares remain available for repurchase pursuant to the Board’s authorizations. There is no guarantee as to the exact number of shares that may be repurchased or when such purchases may occur. \nAbsent any material acquisitions or other significant investments, we believe that cash on hand, combined with cash provided by operations, borrowings available under our revolving credit facility and commercial paper program, and access to capital markets, will be sufficient to meet our cash requirements for the next 12 months, including the payment of quarterly dividends, principal and interest payments on debt outstanding, and capital expenditures. However, as a result of the current macroeconomic environment, we may experience an increase in the cost or the difficulty to obtain debt or equity financing, or to refinance our debt in the future. We continue to evaluate these risks, which could affect our financial condition or our ability to fund operations or future investment opportunities. \nAs of October 31, 2025, total cash and cash equivalents of $58.1 was held by our foreign subsidiaries, primarily in Canada. We have not repatriated foreign cash to the U.S. during the first six months of 2026.\nMaterial Cash Requirements\nWe do not have material off-balance sheet arrangements, financings, or other relationships with unconsolidated entities or other persons, also known as variable interest entities. Transactions with related parties are in the ordinary course of business and are not material to our results of operations, financial condition, or cash flows. \nAs of October 31, 2025, there were no material changes to our material cash requirements as previously reported in our Annual Report on Form 10-K for the year ended April 30, 2025. \nNON-GAAP FINANCIAL MEASURES\nWe use non-GAAP financial measures including: net sales excluding divestitures and foreign currency exchange, adjusted gross profit, adjusted operating income, adjusted income, adjusted earnings per share, and free cash flow, as key measures for purposes of evaluating performance internally. We believe that investors’ understanding of our performance is enhanced by disclosing these performance measures. Furthermore, these non-GAAP financial measures are used by management in preparation of the annual budget and for the monthly analyses of our operating results. The Board also utilizes certain non-GAAP financial measures as components for measuring performance for incentive compensation purposes.\nNon-GAAP financial measures exclude certain items affecting comparability that can significantly affect the year-over-year assessment of operating results, which include amortization expense and impairment charges related to intangible assets, special project costs, gains and losses on divestitures, the change in net cumulative unallocated derivative gains and losses, and other infrequently occurring items that do not directly reflect ongoing operating results. Income taxes, as adjusted is calculated using an adjusted effective income tax rate that is applied to adjusted income before income taxes and reflects the exclusion of the previously discussed items, as well as any adjustments for one-time tax-related activities, when they occur. While this adjusted effective income tax rate does not generally differ materially from our GAAP effective income tax rate, certain exclusions from non-GAAP results can significantly impact our adjusted effective income tax rate.\nThese non-GAAP financial measures are not intended to replace the presentation of financial results in accordance with U.S. GAAP. Rather, the presentation of these non-GAAP financial measures supplements other metrics we use to internally evaluate our business and facilitate the comparison of past and present operations and liquidity. These non-GAAP financial measures may not be comparable to similar measures used by other companies and may exclude certain nondiscretionary expenses and cash payments.\n30\nTable of Contents\nThe following table reconciles certain non-GAAP measures to the comparable GAAP financial measure. See page 23 for a reconciliation of net sales adjusted for certain noncomparable items to the comparable GAAP financial measure. \n \nThree Months Ended October 31,\nSix Months Ended October 31,\n \n2025\n2024\n2025\n2024\nGross profit reconciliation:\nGross profit\n$\n869.9 \n$\n886.1 \n$\n1,344.6 \n$\n1,683.3 \nChange in net cumulative unallocated derivative gains and losses\n(103.0)\n(11.7)\n150.1 \n18.3 \nCost of products sold – special project costs \n23.0 \n5.3 \n38.4 \n10.6 \nAdjusted gross profit\n$\n789.9 \n$\n879.7 \n$\n1,533.1 \n$\n1,712.2 \nOperating income reconciliation:\nOperating income\n$\n418.5 \n$\n169.7 \n$\n464.1 \n$\n519.2 \nAmortization \n50.2 \n55.8 \n100.4 \n111.8 \nLoss (gain) on divestitures – net\n— \n260.8 \n— \n260.8 \nChange in net cumulative unallocated derivative gains and losses\n(103.0)\n(11.7)\n150.1 \n18.3 \nCost of products sold – special project costs \n23.0 \n5.3 \n38.4 \n10.6 \nOther special project costs \n5.6 \n10.7 \n11.6 \n17.8 \nAdjusted operating income\n$\n394.3 \n$\n490.6 \n$\n764.6 \n$\n938.5 \nNet income (loss) reconciliation:\nNet income (loss)\n$\n241.3 \n$\n(24.5)\n$\n197.4 \n$\n160.5 \nIncome tax expense\n77.1 \n91.3 \n64.5 \n152.3 \nAmortization \n50.2 \n55.8 \n100.4 \n111.8 \nLoss (gain) on divestitures – net\n— \n260.8 \n— \n260.8 \nChange in net cumulative unallocated derivative gains and losses\n(103.0)\n(11.7)\n150.1 \n18.3 \nCost of products sold – special project costs \n23.0 \n5.3 \n38.4 \n10.6 \nOther special project costs \n5.6 \n10.7 \n11.6 \n17.8 \nOther expense – special project costs \n0.9 \n— \n0.9 \n— \nAdjusted income before income taxes\n$\n295.1 \n$\n387.7 \n$\n563.3 \n$\n732.1 \nIncome taxes, as adjusted\n70.8 \n93.5 \n135.6 \n178.4 \nAdjusted income\n$\n224.3 \n$\n294.2 \n$\n427.7 \n$\n553.7 \nWeighted-average shares – assuming dilution\n106.9 \n106.7 \n106.9 \n106.6 \nAdjusted earnings per share – assuming dilution\n$\n2.10 \n$\n2.76 \n$\n4.00 \n$\n5.19 \nCRITICAL ACCOUNTING ESTIMATES AND POLICIES\nA discussion of our critical accounting estimates and policies can be found in the “Management’s Discussion and Analysis” section of our Annual Report on Form 10-K for the year ended April 30, 2025. There were no material changes to the information previously disclosed."
}