{
  "source_file": "sjm-20250430.htm",
  "form_type": "10-K",
  "item1": "Item 1.    Business. \nThe Company:\n The J. M. Smucker Company (“Company,” “registrant,” “we,” “us,” or “our”), often referred to as Smucker’s (a registered trademark), was established in 1897 and incorporated in Ohio in 1921. We operate principally in one industry, the manufacturing and marketing of branded food and beverage products on a worldwide basis, although the majority of our sales are in the United States (“U.S.”). Operations outside the U.S. are principally in Canada, although our products are exported to other countries as well. Net sales outside the U.S., subject to foreign currency translation, represented 4 percent of consolidated net sales for 2025. Our branded food and beverage products include a strong portfolio of trusted, iconic, market-leading brands that are sold to consumers primarily through retail outlets in North America.\nWe have four reportable segments: U.S. Retail Coffee, U.S. Retail Frozen Handheld and Spreads, and U.S. Retail Pet Foods (the “U.S. retail market segments”), and Sweet Baked Snacks. These segments in total comprised 86 percent of consolidated net sales in 2025 and represent a major portion of our strategic focus – the sale of branded food and beverage products with leadership positions to consumers through retail outlets in North America. Additionally, we sell products both domestically and in foreign countries through retail channels and foodservice distributors and operators through the Sweet Baked Snacks segment and the combined International and Away From Home operating segments. For additional information on our reportable segments, see Note 5: Reportable Segments.\nOn March 3, 2025, we sold certain Sweet Baked Snacks value brands to JTM Foods, LLC (“JTM”). The transaction included certain trademarks and licenses, a manufacturing facility in Chicago, Illinois, and approximately 400 employees who support the business. Under our ownership, these Sweet Baked Snacks value brands generated net sales of approximately $48.4 and $30.0 in 2025 and 2024, respectively, which were included in the Sweet Baked Snacks segment. \nOn December 2, 2024, we sold the \nVoortman\n® \nbusiness to Second Nature Brands (“Second Nature”). The transaction included products sold under the \nVoortman \nbrand, inclusive of certain trademarks, a leased manufacturing facility in Burlington, Ontario, and approximately 300 employees who supported the business. Under our ownership, the \nVoortman \nbusiness generated net sales of approximately $86.3 and $65.0 in 2025 and 2024, respectively, which were included in the Sweet Baked Snacks segment. \nOn January 2, 2024, we sold the Canada condiment business to TreeHouse Foods, Inc. (“TreeHouse Foods”). The transaction included \nBick’s\n®\n pickles, \nHabitant\n®\n pickled beets, \nWoodman’s\n®\n horseradish, and \nMcLarens\n®\n pickled onions brands, inclusive of certain trademarks. Under our ownership, these brands generated net sales of $43.8 and $61.6 in 2024 and 2023, respectively, which were included in the International operating segment.\nOn November 7, 2023, we completed a cash and stock transaction to acquire Hostess Brands, Inc. (“Hostess Brands”), a manufacturer and marketer of sweet baked goods brands and included \nHostess\n®\n Donettes\n®\n, \nTwinkies\n®\n, \nCupCakes\n, \nDingDongs\n®\n, \nZingers\n®\n, \nCoffeeCakes\n, \nHoHos\n®\n, \nMini Muffins\n, and \nFruit Pies\n, and the \nVoortman\n cookie brand at the acquisition date.\nOn November 1, 2023, we sold the \nSahale Snacks\n®\n business to Second Nature. The transaction included products sold under the \nSahale Snacks \nbrand, inclusive of certain trademarks and licensing agreements, a leased manufacturing facility in Seattle, Washington, and approximately 100 employees who supported the brand. Under our ownership, the \nSahale Snacks\n brand generated net sales of $24.1 and $48.4 in 2024 and 2023, respectively, primarily included in the U.S. Retail Frozen Handheld and Spreads segment.\nOn April 28, 2023, we sold certain pet food brands to Post Holdings, Inc. (“Post”). The transaction included the\n Rachael Ray\n®\n Nutrish\n®\n,\n 9Lives\n®\n,\n Kibbles ’n Bits\n®\n,\n Nature’s Recipe\n®\n, and \nGravy Train\n®\n brands, as well as the private label pet food business, inclusive of certain trademarks and licensing agreements, manufacturing and distribution facilities in Bloomsburg, Pennsylvania, manufacturing facilities in Meadville, Pennsylvania and Lawrence, Kansas, and approximately 1,100 employees who supported these pet food brands. Under our ownership, these brands generated net sales of $1.5 billion in 2023, primarily included in the U.S. Retail Pet Foods segment.\nFor additional information on the acquisition and divestitures, see Note 2: Acquisition and Note 3: Divestitures.\n2\nPrincipal Products:\n In 2025, our principal products were coffee, sweet baked goods, pet snacks, frozen handheld products, peanut butter, cat food, fruit spreads, portion control products, toppings and syrups, and baking mixes and ingredients. Product sales information for the years 2025, 2024, and 2023 is included within Note 5: Reportable Segments.\nProducts within our U.S. retail market segments are primarily sold through a combination of direct sales and brokers to food retailers, club stores, discount and dollar stores, online retailers, pet specialty stores, drug stores, military commissaries, mass merchandisers, and distributors. The Sweet Baked Snacks segment includes products distributed across all channels, both domestically and in foreign countries, such as supermarket chains, convenience stores, national mass retailers, discount and dollar stores, club stores, the vending channel, drug stores, and military commissaries. International and Away From Home includes the sale of all products that are distributed in foreign countries through retail channels, as well as domestically and in foreign countries through foodservice distributors and operators (e.g., healthcare operators, restaurants, educational institutions, offices, lodging and gaming establishments, and convenience stores). \nSources and Availability of Raw Materials:\n The raw materials used in each of our segments are primarily commodities, agricultural-based products, and packaging materials. Green coffee, peanuts, flour, sugar, oils and fats, fruit, and other ingredients are obtained from various suppliers. The availability, quality, and cost of many of these commodities have fluctuated, and may continue to fluctuate over time, partially driven by the elevated commodity and supply chain costs we have continued to experience in 2025. We actively monitor changes in commodity and supply chain costs, and to mitigate the fluctuation of costs, we may be required to implement material price increases or decreases across our business. Futures, basis, options, and fixed-price contracts are used to manage price volatility for a significant portion of our commodity costs. Green coffee, along with certain other raw materials, is sourced solely from foreign countries, and its supply and price is subject to high volatility due to factors such as weather, global supply and demand, product scarcity, plant disease, investor speculation, geopolitical conflicts, changes in governmental agricultural and energy policies and regulations, and political and economic conditions in the source countries. We source peanuts, flour, sugar, oils and fats, and fruit mainly from North America. The principal packaging materials we use are plastic, glass, metal cans, caps, carton board, and corrugate.\n \nFor additional information on the commodities we purchase, see “Commodities Overview” within Management’s Discussion and Analysis of Financial Condition and Results of Operations in this Annual Report on Form 10-K.\nRaw materials are generally available from numerous sources, although we have elected to source certain plastic packaging materials for our \nFolgers\n®\n coffee products, as well as our \nJif\n®\n \npeanut butter, and certain finished goods, such as K-Cup\n®\n pods, our \nPup-Peroni\n®\n \ndog snacks, and liquid coffee, from primary or single sources of supply pursuant to long-term contracts. While availability may vary year to year, we have not historically encountered significant shortages of key raw materials, and we believe that we will continue to obtain adequate supplies. We consider our relationships with key raw material suppliers to be in good standing. \nTrademarks and Patents:\n Many of our products are produced and sold under various patents and patents pending, and marketed under trademarks owned or licensed by us or one of our subsidiaries. Our major trademarks as of April 30, 2025, are listed below. \nPrimary Reportable Segment\n  \nMajor Trademark\nU.S. Retail Coffee\nFolgers\n®\n, \nDunkin’\n®\n, and \nCafé Bustelo\n®\nU.S. Retail Frozen Handheld and Spreads\nUncrustables\n®\n,\n \nJif\n®\n,\n \nand \nSmucker’s\n®\n \nU.S. Retail Pet Foods\nMeow Mix\n®\n,\n Milk-Bone\n®\n, \nPup-Peroni\n®\n, and \nCanine Carry Outs\n®\nSweet Baked Snacks \nHostess\n®\nOther \n(A)\n  \nFolgers\n, \nSmucker’s\n,\n \nand\n Uncrustables\n (A)  Represents the combined International and Away From Home operating segments. \nDunkin’ \nis a trademark of DD IP Holder LLC used under three licenses (the “Dunkin’ Licenses”) for packaged coffee products, including K-Cup\n®\n pods, sold in retail channels, such as grocery stores, mass merchandisers, club stores, e-commerce, and drug stores, as well as in certain away from home channels. The Dunkin’ Licenses do not pertain to coffee or other products for sale in \nDunkin’\n restaurants. The terms of the Dunkin’ Licenses include the payment of royalties to an affiliate of DD IP Holder LLC and other financial commitments by the Company. The Dunkin’ Licenses are in effect until January 1, 2039. Keurig\n®\n and K-Cup\n®\n are trademarks of Keurig Green Mountain, Inc. (“Keurig”), used with permission.\nSlogans or designs considered to be important trademarks include, without limitation, “\nWith A Name Like Smucker’s, It Has To Be Good\n®\n,” “\nThe Best Part of Wakin’ Up Is Folgers In Your Cup\n®\n,” “\nThat Jif’ing Good\n®\n,”\n \n“\nThe Only One Cats Ask For \n3\nBy Name\n®\n,” the \nSmucker’s\n banner, the\n Uncrustables\n Round, Crustless Sandwich design, the Crock Jar shape, the Gingham design, the \nJif \nColor Banner design, the\n Café Bustelo \nAngelina design, and the \nMilk-Bone,\n \nMeow Mix, \nand\n Hostess\n logos.\nWe own many patents worldwide in addition to utilizing proprietary trade secrets, technology, know-how processes, and other intellectual property rights that are not registered.\nWe consider all of our owned and licensed intellectual property, taken as a whole, to be essential to our business.\nSeasonality:\n The U.S. retail market segments do not experience significant seasonality, as demand for our products is generally consistent throughout the year. However, the Sweet Baked Snacks segment does experience moderate seasonality, with declines during the early winter period due to the holiday season.\nCustomers: \nSales to Walmart Inc. and subsidiaries amounted to 33 percent of net sales in both 2025 and 2024 and 34 percent of net sales in 2023. These sales are primarily included in our U.S. retail market segments. No other customer exceeded 10 percent of net sales for any year.\nDuring 2025, our top 10 customers, collectively, accounted for approximately 60 percent of consolidated net sales. Supermarkets, warehouse clubs, and food distributors continue to consolidate, and we expect that a significant portion of our revenues will continue to be derived from a limited number of customers. Although the loss of any large customer for an extended length of time could negatively impact our sales and profits, we do not anticipate that this will occur to a significant extent due to strong consumer demand for our brands.\nGovernment Business: \nNo material portion of our business is subject to renegotiation of profits or termination of contracts at the election of the government.\nCompetition:\n Our business is highly competitive as all of our brands compete with other branded products as well as private label products. In order to remain competitive, companies in the food industry need to consider emerging consumer preferences, technological advances, product and packaging innovations, and the growth of certain retail channels, such as the \ne-commerce market. The primary ways in which products and brands are distinguished include brand recognition, product quality, price, packaging, new product introductions, nutritional value, convenience, advertising, promotion, and the ability to identify and satisfy consumer preferences. Positive factors pertaining to our competitive position include well-recognized brands, high-quality products, consumer trust, experienced brand and category management, varied product offerings, product innovation, responsive customer service, and an integrated distribution network.\nThe packaged foods industry has been challenged by a general long-term decline in sales volume in the center of the store.  Certain evolving consumer trends have contributed to the longer-term decline, such as a heightened focus on health and wellness, an increased desire for fresh foods, and the growing impact of social media and e-commerce on consumer behavior. To address these dynamics, we continue to focus on innovation with an increased emphasis on products that satisfy evolving consumer trends. However, in recent years, there has been an increase in sales primarily driven by changes in consumer behaviors, including the increased frequency of employees working from home. \nIn addition, private label continues to be a competitor in the categories in which we compete, partially due to improvements in private label quality, the increased emphasis of store brands by retailers in an effort to cultivate customer loyalty, and a movement toward lower-priced offerings during economic downturns or instances of increased inflationary pressures. For the U.S. retail market segments, private label held a 15.2 dollar average market share during the 52 weeks ended April 20, 2025, for the categories in which we compete, as compared to a 13.7 dollar average market share during the same period in the prior year. We believe that both private label and leading brands play an important role in the categories in which we compete, appealing to different consumer segments. We closely monitor the price gap, or price premium, between our brands and private label brands, with the view that value is about more than price and the expectation that number one brands will continue to be an integral part of consumers’ shopping baskets. \n4\nOur primary brands and major competitors as of April 30, 2025, are listed below. \nOur Primary Products\nOur Primary Brands\nCompeting Brands\nCompetitors\nU.S. Retail Coffee\nMainstream roast and ground coffee\nFolgers \n(A)\n \nand \nCafé Bustelo\nMaxwell House \nand\n Yuban\nThe Kraft Heinz Company\nPrivate label brands\nVarious\nMcCafé\nKeurig Dr. Pepper\nCafe La Llave\nF. Gaviña & Sons, Inc.\nSingle serve coffee – K-Cup\n®\nDunkin’\n,\n Folgers\n,\n \nand\n Café Bustelo\nPrivate label brands\nVarious\nGreen Mountain Coffee \n(A)\n,\n Donut Shop\n,\n \nand \nMcCaf\né\nKeurig Dr. Pepper\nStarbucks\nNestlé S.A.\nPeet’s Coffee & Tea\nJDE Peet’s N.V.\nMaxwell House\n and \nGevalia\nThe Kraft Heinz Company\nPremium coffee\nDunkin’\nStarbucks \n(A)\n and\n Seattle’s Best Coffee\nNestlé S.A.\nPrivate label brands\nVarious\nPeet’s Coffee & Tea\nJDE Peet’s N.V.\nEight O’Clock\nTata Global Beverages Limited\nCommunity Coffee\nCommunity Coffee Company\nGevalia\nThe Kraft Heinz Company\nU.S. Retail Frozen Handheld and Spreads\nPeanut butter and specialty spreads\nJif \n(\nA)\nPrivate label brands\nVarious\nSkippy\nHormel Foods Corporation\nNutella\nFerrero SpA\nPeter Pan\nPost Holdings, Inc.\nFruit spreads\nSmucker’s \n(A)\nPrivate label brands\nVarious\nWelch’s\nWelch Foods Inc.\nBonne Maman\nAndros Foods USA, Inc.\nFrozen sandwiches and snacks\nSmucker’s Uncrustables\nHot Pockets \n(A)\nNestlé S.A.\nTotino’s\nGeneral Mills, Inc.\nEl Monterrey\nRuiz Foods\nPrivate label brands\nVarious\nU.S. Retail Pet Foods\nMainstream cat food\nMeow Mix\nCat Chow \n(A)\n,\n Friskies\n,\n Kit & Kaboodle\n,\n \nand\n Fancy Feast\nNestlé Purina PetCare Company\nIams \nand\n Sheba\nMars, Incorporated\nPet snacks\nMilk-Bone \n(A)\n,\n Pup-Peroni\n,\n \nand \nCanine Carry Outs\nBeggin’ Strips\nNestlé Purina PetCare Company\nBlue Buffalo \nand \nNudges\nGeneral Mills, Inc.\nDentastix, Greenies and Temptations\nMars, Incorporated\nPrivate label brands\nVarious\nSweet Baked Snacks\nSweet baked goods\nHostess\nLittle Debbie \n(A)\nMcKee Foods Corporation\nEntenmann’s\nGrupo Bimbo, S.A.\nPrivate label brands\nVarious, Flower Foods, Inc. \n5\nInternational and Away From Home\nFoodservice hot beverage\nFolgers\n,\n 1850\n®\n, and\n Café Bustelo\nStarbucks\nNestlé S.A.\nPrivate label brands\nVarious\nNescafé\nSociété des Produits Nestlé S.A.\nFoodservice portion control\nSmucker’s\n and \nJif\nPrivate label brands\nVarious, including Diamond Crystal Brands\nHeinz\n,\n Welch’s\n,\n \nand\n \nPrivate Label Brands\nThe Kraft Heinz Company\nFoodservice frozen handheld\nSmucker’s Uncrustables\nHot Off the Grill\nIntegrated Food Service\nClassic Delight\nClassic Delight Inc.\nCanada coffee\nFolgers\nTim Hortons \n(A)\nRestaurant Brands International Inc.\nMaxwell House\nThe Kraft Heinz Company\nPrivate label brands\nVarious\nCanada flour\nRobin Hood\n® (A)\n \nand\n Five Roses\n®\nPrivate label brands\nVarious\n(A)  Identifies the current market leader within the product category. In certain categories, the market leader is not identified as two or more brands compete for the largest share. \nGovernment Regulations: \nOur operations are subject to various regulations and laws administered by federal, state, and local government agencies in the U.S., including the U.S. Food and Drug Administration (the “FDA”), U.S. Federal Trade Commission, U.S. Departments of Agriculture, Commerce, and Labor, and U.S. Environmental Protection Agency. Additionally, we are subject to regulations and laws administered by government agencies in Canada and other countries in which we have operations and our products are sold. In particular, the manufacturing, marketing, transportation, storage, distribution, packaging disposal, and sale of food products are each subject to governmental regulation that is increasingly extensive. Governmental regulation encompasses such matters as ingredients (including whether a product contains bioengineered ingredients or artificial dyes), packaging and disposal of packaging (including extended producer responsibility regulations), labeling (including use of certain terms such as sugar free, healthy, low sodium, and low fat), pricing, advertising, relations with distributors and retailers, health, safety, data privacy and security, and anti-corruption, as well as environmental policies relating to climate change, regulating greenhouse gas emissions, energy, and sustainability, including single-use plastics. We are subject to tax and securities regulations, accounting and reporting standards, and other financial laws and regulations. We rely on legal and operational compliance programs, including in-house and outside counsel, to guide our business in complying with applicable laws and regulations of the countries in which we do business. We believe we are in compliance with such laws and regulations and do not expect continued compliance to have a material impact on our capital expenditures, earnings, or competitive position in 2026. \nEnvironmental Matters:\n Compliance with environmental regulations relating to climate change, regulating greenhouse gas emissions, energy, and sustainability, including single-use plastics, and prioritizing our environmental sustainability efforts are important to us as a responsible corporate citizen. As such, we have public goals related to waste diversion, water usage, energy usage, greenhouse gas emissions, and sustainable packaging. In support of our commitment to environmental sustainability, we have implemented and manage a variety of programs across our operations, including energy optimization, utilization of renewable energy, water conservation, recycling, and, in our supply chains, we support projects that increase sustainable practices. We continue to evaluate and modify our processes to further limit our impact on the environment.\nHuman Capital Management: \nOur values and principles are rooted in our \nBasic Beliefs \nto \nBe Bold\n,\n Be Kind\n,\n Do the Right Thing\n,\n Play to Win\n,\n \nand\n Thrive Together\n, which\n \nserve as the foundation for everything we do as an organization and are clear, concise, and actionable to help our employees continue to bring our unique culture to life, as our employees are among our most important resources. Our employees are critical to our success as a company, and we are committed to supporting them holistically, both personally and professionally. With over 8,000 full-time employees worldwide, every employee makes a difference to our Company. We believe our basic belief, \nThrive Together, \ntakes proactive steps to ensure we are enabling our employees to reach their full potential. To hold ourselves accountable, we conduct an employee engagement survey annually to provide an opportunity for open and confidential feedback from our employees and to help guide our priorities for the upcoming fiscal year. Additionally, we conduct functional pulse surveys as needed to gain additional information based on responses to the larger engagement survey, or in sub-groups of our employee population where a specific topic or question may be needed. These surveys are supplemented by regular Company Town Halls, which help to foster an environment of transparency and two-way communication. Employees have the opportunity to anonymously report violations of the Commitment to Integrity: Our Code (“Code of Conduct”) or complaints regarding accounting, auditing, and financial-related \n6\nmatters through our Integrity Portal (“Portal”). The Portal also can be utilized by customers, contractors, vendors, and their employees, as well as any others in a business relationship with our Company. To further support our commitment to ethics and our basic belief, \nDo the Right Thing\n, our employees are also asked to participate in Ethics and Compliance Surveys, to help us understand our strengths and identify opportunities for future ethics and compliance programs and training. We track our progress in the Ethics and Compliance space through ongoing assessments of our internal programs and through our Ethics and Compliance Survey, as well as through dedicated questions included in our annual Employee Engagement Survey, and we are pleased to share that our Company was once again recognized in 2025 as one of the World’s Most Ethical Companies by Ethisphere, a global leader in business ethics.\nIn conjunction with our\n \nbasic belief, \nThrive Together\n, we continue to advance on our three business imperatives that have guided our work for many years:\n•\nTo foster a safe, welcoming, and respectful workplace consistent with \nOur Commitment to Each Other\n and our \nBasic Beliefs\n;\n•\nTo cultivate and develop a workforce that reflects the consumers we serve and the communities in which we live and work; and\n•\nTo drive business growth while also helping our Company’s constituents thrive.\nOur \nThrive Together \nbasic belief is authentic to who we are and consists of five pillars: (1) community, (2) career, (3) health and wellness, (4) financial, and (5) family – each meant to support our employees’ varied interests and needs. \nCommunity:\n \nWe believe having a culture that supports all employees allows us to attract and retain talented professionals with unique skills, thoughts, and experiences across our business while helping them cultivate deeper connections at work, home, and in our communities. In support of our business imperatives, we have made important progress on our commitment to create an environment where our employees are supported, differences are truly celebrated, and individuality is appreciated. We have established employee resource groups, which are employee-led groups that represent a unique community and welcome all employees to join as either a member or ally. \nSupporting the communities where we live and work has been a Company priority since our inception and is aligned with our basic belief, \nBe Kind\n. Through our many partnerships, we are able to understand the needs and support required within our local communities and leverage these relationships to make the connections necessary to offer this critical assistance. This past year we donated more than $10 million to over 100 philanthropic partners, including local food banks, the American Red Cross\n®\n, United Way\n®\n, and Feeding America\n®\n.  \nAlong with our long-term national partnerships, we also have dedicated programming to support the unique needs of those in our communities. Examples include our consistent support of local food banks; expanding our work with Akron Children’s Hospital through the launch of the Smucker’s Berry Good Reading Program to encourage adolescent literacy; volunteerism, corporate donations, and employee engagement to aid the National Alliance on Mental Illness, the largest grassroots mental health organization dedicated to building better lives for Americans battling mental illness; and our brand engagements, such as \nMilk-Bone \nwhich provides funding for Canine Assistants, an organization dedicated to placing service dogs with people who need them most.\n \nWe are fortunate to have the expertise and passion of talented employees who help us deliver high-quality products to our customers and consumers across North America and who share our commitment to ensure that people, pets, and communities where we live and work have access to the support and essential resources they need. We believe it is important to celebrate their contributions, including recognizing organizations about which they are especially passionate. One way we do this is through our Company Matching Gift Program, which gives employees the opportunity to donate to partner charities and have their donation matched by the Company, dollar-for-dollar, from a minimum of $5 up to a maximum of $2,500 per calendar year per employee. Furthermore, the Company Matching Gift Program credits our employees’ Smucker Giving accounts for each hour of volunteering done for a non-profit charity, and these funds can be donated to an approved charity of the employee’s choice.\nIn addition, this past year we coordinated an initiative to evaluate our local market relationships to create more opportunities for us to connect in meaningful and impactful ways. As part of this work, we increased funding from our operational sites to organizations in the communities where we live and work, making a difference for our families, friends, and neighbors.\n7\nCareer:\n \nWe strive to foster an environment of growth and continuous learning for our people with a focus on our basic belief,\n Play to Win\n. We support and challenge our employees to increase their knowledge, skills, and capabilities through all phases of their career. We believe that we offer one of the best cultures in the food industry. As part of our work to retain this unique culture, we offer numerous learning and development opportunities to support a long and prosperous career for our employees. Our Employee Development programs offer foundational instruction on Company culture and provide employees additional learning opportunities throughout their careers to help them reach their full potential. This is reflected in annual reviews, which allow management and employees to partner and determine specific opportunities for growth within each role through important work, new experiences generated through a dynamic environment, regular feedback, and purposeful development opportunities. Building a career at our Company is fundamental to who we are and is evidenced by our Executive Leadership Team, where 4 of 6 members were promoted from within, and our trailing 12-month turnover remains below the industry average. While the current labor market presents significant challenges for employers, we have made differential investments in our talent acquisition tools and programs to help us continue to attract the right candidates.\nIn addition, we are committed to providing the tools and resources our employees need to learn, develop, and grow with us, including virtual sessions. A suite of online training and education programs is available to our employees, ranging from role-specific training to education on soft skills and our Company culture. Through these tools and resources, in 2025, we coordinated over 27,000 hours of professional development training for our employees. Our best-in-class “Discovering the Art of Leadership” series, developed in collaboration with Case Western Reserve University, teaches our people managers how to effectively lead teams and develop employees. We dedicate time to developing and coaching our people managers to provide support to our employees holistically. This means promoting resonant leadership and the practice of emotional intelligence and mindfulness, so our people managers have the knowledge and tools to support the unique needs of each employee. Our total rewards program also includes tuition assistance.\nFostering an environment for growth and continuous learning for our employees is an important priority of our Company. However, our commitment to education also includes our communities as evidenced by our partnerships with organizations passionate about improving access to quality education. We have partnered with Akron Children’s Hospital to launch the Smucker's Berry Good Reading Program, which provides books to children during annual well visits. We also continue to support our long-time partners including the Boys & Girls Clubs of America\n®\n and Junior Achievement USA\n®\n, among others, which offer programming focused on childhood growth and development. \nHealth and Wellness:\n \nMaintaining a safe and healthy workplace is among our top priorities and is aligned with our basic belief,\n Do the Right Thing\n. We are diligent in ensuring workforce health and safety through education and training which is provided at all locations. Our health and safety internal assessments conducted at each of our production facilities quarterly, as well as periodic external assessments, confirm our compliance with safety regulations and corporate policies. The teams document the results and determine corrective actions to ensure we hold ourselves accountable for providing a safe work environment. During 2025, we achieved a total recordable incident rate that is less than half of the national average for our industry peers as a result of these efforts. \nAs part of our focus on well-being, we emphasize the need for our employees to embrace healthy lifestyles. We offer all employees a variety of free and discounted services, as well as educational opportunities, to support their physical, emotional, and financial well-being, including free sessions through our Employee Assistance Program. We also offer onsite conveniences, such as health and wellness centers at several of our locations and a Child Development Center at our corporate headquarters in Orrville, Ohio. In addition, we provide our employees with paid time off to renew and programs to promote workplace flexibility.\nFurther, we have continued to promote the importance of self-care and the availability of mental health resources to our employees. In recognition of the need for mental health resources across society, we have partnered with the National Alliance on Mental Health to provide support for our employees and communities. Their mental health services and self-care programs benefit our employees by raising awareness and providing additional support and education for mental health. Additionally, we partner with The Village Network on their Early Childhood Mental Health initiatives. This commitment provides access to important mental health and educational services for families and their children from birth to age five and is provided by Therapeutic Childcare Centers.\nFinancial:\n In support of our basic beliefs,\n Be Kind \nand \nPlay to Win\n,\n \nwe believe in paying for performance and compensating our employees at market competitive rates and utilizing performance-based awards to support the overall well-being of our employees. Additionally, we employ an incentive program for eligible participants to reward both shared Company results and strong individual performance. Our Total Rewards program offers competitive, comprehensive benefits to meet the \n8\nunique needs of each employee at each life stage, including insurance coverage options for domestic partners in addition to married couples, a retirement savings program with a Company match, access to spending accounts and educational resources, including those available from our partners, to help employees navigate their immediate financial needs and prepare for long-term financial security. \nWe are committed to paying our employees fairly and equitably. To that end, we conduct a pay equity analysis each year and, with the support of our Compensation and People Committee, make necessary adjustments to make sure that similarly situated employees are paid equitably.\nLastly, we have an established working hours policy to clarify shared expectations but continue to review the professional environment to determine how to effectively manage it. As we looked at how to address the evolving workplace at our Company, it was important to us to deliver on our employees’ needs and expectations while enabling collaboration and supporting continued productivity to deliver our business objectives. To realize this, our corporate workplace model is focused on the idea of presence with purpose. We plan around core weeks, where we encourage employees to be in office three days per week. To us, true flexibility is not simply establishing a specific number of days in the office, and we have approached the development of our model based on guiding principles. Employees have shared an appreciation of the balance this model provides, allowing them the flexibility they desire with the consistent opportunity to engage with colleagues in person, which also remains important to them. While we are pleased with the results of the working hours policy to date, we will continue to evaluate and adjust, if needed. \nFamily:\n \nOur approach to paid time off is competitive with our industry peers, which includes at least three weeks of paid time off (and increases based on an employee’s tenure), 12 paid Company holidays per calendar year, including a floating holiday, which can be used at the employee’s discretion to observe and celebrate occasions that align with their personal interests and beliefs, 12 weeks of parental leave, in addition to short-term disability available to birth mothers, and pet bereavement leave. In addition, our family-building benefits support the desire for all aspiring parents to build their family through enhanced fertility benefits through a third-party partner, as well as enhanced adoption and surrogacy financial support. Our rewards program also addresses the holistic needs of our employees by supporting their physical well-being, providing tools and resources to help them actively take responsibility, share in the cost, and make the best decisions regarding their personal well-being. These programs provide resources that respond to their changing needs throughout their careers, including access to our Child Development Center, pet insurance, paid bereavement leave, and expanded parental leave for both parents.\nAdditional information regarding our human capital management is available in our 2024 Corporate Impact Report that can be found on our website at investors.jmsmucker.com/overview/default.aspx. Information on our website, including our 2024 Corporate Impact Report, is not incorporated by reference into this Annual Report on Form 10-K. \nInformation about our Executive Officers: \nThe names, ages as of June 11, 2025, and current positions of our executive officers are listed below. All executive officers serve at the pleasure of the Board, with no fixed term of office.\nName\nAge\nYears\nwith\nCompany\nPosition\nServed as\nan Officer\nSince\nMark Smucker\n55\n27\nChief Executive Officer and Chair of the Board \n(A)\n2001\nJohn Brase\n57\n5\nPresident and Chief Operating Officer \n(B)\n2020\nJeannette Knudsen\n55\n22\nChief Legal Officer and Secretary \n(C)\n2009\nTucker Marshall\n49\n13\nChief Financial Officer \n(D)\n2020\nJill Penrose\n52\n21\nChief People and Corporate Services Officer \n(E)\n2014\n(A)\nMr. Mark Smucker was elected to his present position in April 2025, having previously served as Chair of the Board, President, and Chief Executive Officer since August 2022. Prior to that time, he served as President and Chief Executive Officer since May 2016.\n(B)\nMr. Brase was elected to his present position in April 2025, having previously served as Chief Operating Officer since April 2020.  Prior to the time, he served at The Procter & Gamble Company (“P&G”) for 30 years. He was the Vice President and General Manager of P&G’s North American Family Care business from April 2016 through March 2020.\n(C)\nMs. Knudsen was elected to her present position in September 2022, having served as Chief Legal and Compliance Officer and Secretary since November 2019. Prior to that time, she served as Senior Vice President, General Counsel and Secretary since May 2016.\n9\n(D)\nMr. Marshall was elected to his present position in May 2020, having served as Senior Vice President and Deputy Chief Financial Officer since November 2019. Prior to that time, he served as Vice President, Finance since May 2016.\n(E)\nMs. Penrose was elected to her present position in March 2023, having served as Chief People and Administrative Officer since November 2019. Prior to that time, she served as Senior Vice President, Human Resources and Corporate Communications since May 2016. \nAvailable Information:\n Access to all of our Securities and Exchange Commission (“SEC”) filings, including our Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), is provided, free of charge, on our website (investors.jmsmucker.com/sec-filings) as soon as reasonably practicable after such reports are electronically filed with, or furnished to, the SEC.",
  "item7": "Item 7.     Management’s Discussion and Analysis of Financial Condition and Results of Operations. \n(Dollars and shares in millions, unless otherwise noted, except per share data)\nThis Management’s Discussion and Analysis of Financial Condition and Results of Operations is intended to provide an understanding of our results of operations, financial condition, and cash flows by focusing on changes in certain key measures from year to year, and should be read in conjunction with our consolidated financial statements and the accompanying notes presented in Item 8. “Financial Statements and Supplementary Data” in this Annual Report on Form 10-K. This discussion contains forward-looking statements that involve risks and uncertainties. Our actual results could differ materially from those anticipated in these forward-looking statements as a result of various factors, including those discussed in Item 1A. “Risk Factors” in this Annual Report on Form 10-K. \nCompany Background\nAt The J. M. Smucker Co., it is our privilege to make food people and pets love by offering a diverse family of brands available across North America. We are proud to lead in the coffee, peanut butter, fruit spreads, frozen handheld, sweet baked goods, dog snacks, and cat food categories by offering brands consumers trust for themselves and their families each day, including \nFolgers\n, \nDunkin’\n, \nCafé Bustelo\n, \nJif\n, \nUncrustables\n, \nSmucker’s\n, \nHostess\n, \nMilk-Bone\n, and \nMeow Mix\n. Through our unwavering commitment to producing quality products, operating responsibly and ethically, and delivering on our Purpose, we will continue to grow our business while making a positive impact on society.\nWe have four reportable segments: U.S. Retail Coffee, U.S. Retail Frozen Handheld and Spreads, U.S. Retail Pet Foods, and Sweet Baked Snacks. These segments in total comprised 86 percent of consolidated net sales in 2025 and represent a major portion of our strategic focus – the sale of branded food and beverage products with leadership positions to consumers through retail outlets in North America. Products within our U.S. retail market segments are primarily sold through a combination of direct sales and brokers to food retailers, club stores, discount and dollar stores, online retailers, pet specialty stores, drug stores, military commissaries, mass merchandisers, and distributors. The Sweet Baked Snacks segment includes products distributed across all channels, both domestically and in foreign countries, such as supermarket chains, convenience stores, national mass retailers, discount and dollar stores, club stores, the vending channel, drug stores, and military commissaries. International and Away From Home includes the sale of all products that are distributed in foreign countries through retail channels, as well as domestically and in foreign countries through foodservice distributors and operators (e.g., healthcare operators, restaurants, educational institutions, offices, lodging and gaming establishments, and convenience stores).\nStrategic Overview\nWe remain rooted in our \nBasic Beliefs \nto \nBe Bold\n,\n Be Kind\n,\n Do the Right Thing\n,\n Play to Win\n,\n \nand\n Thrive Together\n. Our \nBasic Beliefs\n are the core of our unique corporate culture, serving as the foundation for decision-making and how we interact with our colleagues and partners. While our \nBasic Beliefs\n have evolved over time as we have grown, we remain unwavering in our commitment to these core values and recognize how we are called to act upon them will continue to transform as the world around us does. In addition, we have been led by five generations of family leadership, having had only six chief executive officers in over 125 years. This continuity of management and thought extends to the broader leadership team that embodies the values and embraces the business practices that have contributed to our consistent growth. \nOur strategic vision is to engage, delight, and inspire consumers by building brands they love and leading in growing categories. This vision is our long-term direction that guides business priorities and aligns our organization. As a company of iconic brands and new favorites, we will continue to drive balanced, long-term growth, primarily in North America. Further, we will continue to guide the transformation of our business by advancing our strategy of leading in the attractive categories of pet, coffee, and snacking.\nOur strategic growth objectives include net sales increasing by a low single-digit percentage and operating income excluding non-GAAP adjustments (“adjusted operating income”) increasing by a mid-single-digit percentage on average over the long term. Related to income per diluted share excluding non-GAAP adjustments (“adjusted earnings per share”), our strategic growth objective is to increase by a high single-digit percentage over the long term. We expect organic growth, including new products, to drive much of our top-line growth, while the contribution from acquisitions will vary from year to year. Our non-GAAP adjustments include amortization expense and impairment charges related to intangible assets, certain divestiture, acquisition, integration, and restructuring costs (“special project costs”), gains and losses on divestitures, the net change in \n28\ncumulative unallocated gains and losses on commodity and foreign currency exchange derivative activities (“change in net cumulative unallocated derivative gains and losses”), and other infrequently occurring items that do not directly reflect ongoing operating results. Refer to “Non-GAAP Financial Measures” in this discussion and analysis for additional information. Due to the unknown and potentially prolonged impact of the inflationary environment and challenged supply network, we may experience difficulties or be delayed in achieving our long-term strategies; however, we continue to evaluate the effects of the macroeconomic environment on our long-term growth objectives. \nOver the past five years, net sales, adjusted operating income, and adjusted earnings per share increased at a compound annual growth rate of approximately 2 percent, 4 percent, and 3 percent, respectively. These changes were primarily driven by an increase in net sales from the acquisition of Hostess Brands, partially offset by the reduction in net sales from the divested \nVoortman\n business and certain Sweet Baked Snacks value brands in 2025, \nSahale Snacks\n and Canada condiment businesses in 2024, certain pet food brands in 2023, the private label dry pet food and natural beverage and grains businesses in 2022, and the \nCrisco\n®\n \nand \nNatural Balance\n®\n \nbusinesses\n \nin 2021. Net cash provided by operating activities decreased at a compound annual growth rate of approximately 1 percent over the past five years. Our cash deployment strategy is to balance reinvesting in our business through acquisitions and capital expenditures with returning cash to our shareholders through the payment of dividends and share repurchases. Our deployment strategy also includes a significant focus on debt repayment.\nAcquisition\nOn November 7, 2023, we completed a cash and stock transaction to acquire Hostess Brands. The total purchase consideration in connection with the acquisition was $5.4 billion, which reflects an exchange offer of all outstanding shares of Hostess Brands common stock at a price of $34.25 per share, consisting of $30.00 in cash and 0.03002 shares of our common shares, based on the closing stock price on September 8, 2023, that were exchanged for each share of Hostess Brands common stock as of the transaction date. The purchase price included the issuance of approximately 4.0 million of our common shares to Hostess Brands’ shareholders, valued at $450.2. In addition, we paid $3.9 billion in cash, net of cash acquired, and assumed $991.0 of debt from Hostess Brands and $67.8 of an other debt-like item, reflecting consideration transferred for the cash payment of Hostess Brands’ employee equity awards. New debt of $5.0 billion was borrowed, consisting of $3.5 billion in Senior Notes, an $800.0 senior unsecured delayed-draw Term Loan Credit Agreement (“Term Loan”), and $700.0 of short-term borrowings under our commercial paper program to partially fund the transaction and pay off the debt assumed as part of the acquisition. Hostess Brands is a manufacturer and marketer of sweet baked goods brands including \nHostess Donettes\n,\n Twinkies\n,\n CupCakes\n,\n DingDongs\n,\n Zingers\n,\n CoffeeCakes\n,\n HoHos\n,\n Mini Muffins\n, and \nFruit Pies\n, and the \nVoortman\n cookie brand at the acquisition date. In addition to its headquarters in Lenexa, Kansas, the transaction included six manufacturing facilities located in Emporia, Kansas; Burlington, Ontario; Chicago, Illinois; Columbus, Georgia; Indianapolis, Indiana; and Arkadelphia, Arkansas, a distribution facility in Edgerton, Kansas, and a commercial center of excellence in Chicago, Illinois at the acquisition date. During 2025, the acquired business contributed net sales of $1,178.8. We anticipate cost synergies of approximately $100.0, which are expected to be achieved by the end of 2026. To date, we have achieved cost synergies of approximately $86.0, of which approximately $75.0 was achieved during 2025. For additional information, refer to Note 2: Acquisition.\nDivestitures \nOn March 3, 2025, we sold certain Sweet Baked Snacks value brands to JTM. The transaction included certain trademarks and licenses, a manufacturing facility in Chicago, Illinois, and approximately 400 employees who supported the business. Under our ownership, these Sweet Baked Snacks value brands generated net sales of approximately $48.4 and $30.0 in 2025 and 2024, respectively, which were included in the Sweet Baked Snacks segment. Net proceeds from the divestiture were $34.6, inclusive of the final working capital adjustment and cash transaction costs. We recognized a pre-tax loss of $44.2 during 2025, within loss (gain) on divestitures – net in the Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows.\nOn December 2, 2024, we sold the \nVoortman\n business to Second Nature. The transaction included products sold under the \nVoortman \nbrand, inclusive of certain trademarks, a leased manufacturing facility in Burlington, Ontario, and approximately 300 employees who supported the business. Under our ownership, the \nVoortman \nbusiness generated net sales of approximately $86.3 and $65.0 in 2025 and 2024, respectively, which were included in the Sweet Baked Snacks segment. Net proceeds from the divestiture were $291.4, inclusive of the final working capital adjustment and cash transaction costs. We recognized a pre-tax loss of $265.9 during 2025, within loss (gain) on divestitures – net in the Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows.\nOn January 2, 2024, we sold the Canada condiment business to TreeHouse Foods. The transaction included \nBick’s\n pickles, \nHabitant\n pickled beets, \nWoodman’s\n horseradish, and \nMcLarens\n pickled onions brands, inclusive of certain trademarks. Under \n29\nour ownership, these brands generated net sales of $43.8 and $61.6 in 2024 and 2023, respectively, which were included in the International operating segment. Final net proceeds from the divestiture were $25.3, inclusive of a working capital adjustment and cash transaction costs. Upon completion of this transaction during 2024, we recognized a pre-tax loss of $5.7, within loss (gain) on divestitures – net in the Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows.\nOn November 1, 2023, we sold the \nSahale Snacks\n business to Second Nature. The transaction included products sold under the\n Sahale Snacks \nbrand, inclusive of certain trademarks and licensing agreements, a leased manufacturing facility in Seattle, Washington, and approximately 100 employees who supported the brand. Under our ownership, the \nSahale Snacks\n brand generated net sales of $24.1 and $48.4 in 2024 and 2023, respectively, primarily included in the U.S. Retail Frozen Handheld and Spreads segment. Final net proceeds from the divestiture were $31.6, inclusive of a working capital adjustment and cash transaction costs. Upon completion of this transaction during 2024, we recognized a pre-tax loss of $6.7, within loss (gain) on divestitures – net in the Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows.\nOn April 28, 2023, we sold certain pet food brands to Post. The transaction included the\n Rachael Ray Nutrish\n,\n 9Lives\n,\n Kibbles ’n Bits\n,\n Nature’s Recipe\n, and \nGravy Train\n brands, as well as the private label pet food business, inclusive of certain trademarks and licensing agreements, manufacturing and distribution facilities in Bloomsburg, Pennsylvania, manufacturing facilities in Meadville, Pennsylvania and Lawrence, Kansas, and approximately 1,100 employees who supported these pet food brands. Under our ownership, these brands generated net sales of $1.5 billion in 2023, primarily included in the U.S. Retail Pet Foods segment. Final net proceeds from the divestiture were $1.2 billion, consisting of $683.9 in cash, net of a working capital adjustment and cash transaction costs, and approximately 5.4 million shares of Post common stock, valued at $491.6 at the close of the transaction. We recognized a pre-tax loss of $1.0 billion upon completion of this transaction during 2023, within loss (gain) on divestitures – net in the Statement of Consolidated Income (Loss) and Statement of Consolidated Cash Flows. During 2024, we finalized the working capital adjustment and transaction costs, which resulted in an immaterial adjustment to the pre-tax loss. Furthermore, during 2024, we entered into equity forward derivative transactions under an agreement with an unrelated third-party to facilitate the forward sale of the Post common stock. All 5.4 million shares of Post common stock were settled for $466.3 under the equity forward contract on November 15, 2023. For additional information, see Note 10: Derivative Financial Instruments.\nFor additional information, refer to Note 3: Divestitures.\nTrends Affecting our Business\nDuring 2025, we continued to experience input cost inflation and a dynamic and evolving macroeconomic environment, inclusive of tariffs, regulatory and policy changes, and changes in consumer behaviors, which we anticipate will persist into 2026. Further, the higher costs have required price increases across our business, and we anticipate the price elasticity of demand could remain elevated into 2026 as consumers continue to experience broader inflationary pressures and are selective in their spending. In response to the inflationary pressures, we continue to focus on the delivery of our company-wide transformation initiative to deliberately translate our continuous improvement mindset into sustainable productivity initiatives in order to grow our profit margins and reinvest in the Company to enable future growth and cost savings.\nIn addition, it is possible significant disruptions in our supply chain could occur if certain geopolitical events continue to impact markets around the world, including the impact of potential shipping delays due to supply and demand imbalances, as well as labor shortages and tariffs. We also continue to work closely with our customers and external business partners, taking additional actions to ensure safety, business continuity, and maximize product availability. We have maintained production at all our facilities and availability of appointments at distribution centers. Furthermore, we have implemented measures to manage order volumes to ensure a consistent supply across our retail partners during periods of high demand. However, to the extent that high demand levels or supply chain disruptions delay order fulfillment, we may experience volume loss and elevated penalties. Although we do not have any operations in Russia, Ukraine, Israel, Palestine, China or Taiwan, we continue to monitor the environment for any significant escalation or expansion of economic or supply chain disruptions, including broader inflationary costs and the impact of tariffs, as well as regional or global economic recessions.\nOverall, broad-based supply chain disruptions and the impact of inflation remain uncertain. We will continue to evaluate the nature and extent to which supply chain disruptions and inflation will impact our business, supply chain, including labor availability and attrition, results of operations, financial condition, and liquidity.\n30\nResults of Operations\nThis discussion and analysis deals with comparisons of material changes in the consolidated financial statements for the years ended April 30, 2025 and 2024. For the comparisons of the years ended April 30, 2024 and 2023, see the Management’s Discussion and Analysis of Financial Condition and Results of Operations in Part II, Item 7 of our 2024 Annual Report on Form 10-K.\n  \nYear Ended April 30,\n  \n2025\n2024\n% Increase\n(Decrease)\nNet sales\n$\n8,726.1 \n$\n8,178.7 \n7 \n%\nGross profit\n$\n3,384.7 \n$\n3,115.4 \n9 \n% of net sales\n38.8 \n%\n38.1 \n%\nOperating income (loss)\n$\n(673.9)\n$\n1,305.8 \nn/m\n% of net sales\n(7.7)\n%\n16.0 \n%\nNet income (loss):\nNet income (loss)\n$\n(1,230.8)\n$\n744.0 \nn/m\nNet income (loss) per common share – assuming dilution\n$\n(11.57)\n$\n7.13 \nn/m\nAdjusted gross profit \n(A)\n$\n3,335.6 \n$\n3,111.6 \n7 \n% of net sales\n38.2 \n%\n38.0 \n%\nAdjusted operating income \n(A)\n$\n1,824.7 \n$\n1,636.2 \n12 \n% of net sales\n20.9 \n%\n20.0 \n%\nAdjusted income: \n(A)\nIncome\n$\n1,078.8 \n$\n1,038.0 \n4 \nEarnings per share – assuming dilution\n$\n10.12 \n$\n9.94 \n2 \n(A)\nWe use non-GAAP financial measures to evaluate our performance. Refer to “Non-GAAP Financial Measures” in this discussion and analysis for a reconciliation to the comparable generally accepted accounting principles (“GAAP”) financial measure.\nNet Sales\nYear Ended April 30,\n \n2025\n2024\nIncrease  \n(Decrease)\n  %    \nNet sales\n$\n8,726.1 \n$\n8,178.7 \n$\n547.4 \n7 \n%\nHostess Brands acquisition\n(669.3)\n— \n(669.3)\n(8)\nSweet Baked Snacks value brands divestiture\n— \n(11.2)\n11.2 \n— \nVoortman\n divestiture\n— \n(54.9)\n54.9 \n1 \nCanada condiment divestiture\n— \n(43.8)\n43.8 \n1 \nSahale Snacks\n divestiture\n— \n(24.1)\n24.1 \n— \nForeign currency exchange\n10.7 \n— \n10.7 \n— \nNet sales excluding acquisition, divestitures, and foreign currency exchange \n(A)\n$\n8,067.5 \n$\n8,044.7 \n$\n22.8 \n— \n%\nAmounts may not add due to rounding\n.\n(A)\nNet sales excluding acquisition, divestitures, and foreign currency exchange is a non-GAAP financial measure used to evaluate performance internally. This measure provides useful information to investors because it enables comparison of results on a year-over-year basis. \nNet sales in 2025 increased $547.4, or 7 percent, which includes incremental net sales in the current year of $669.3 related to the Hostess Brands acquisition, partially offset by $134.0 of noncomparable net sales in the prior year related to divestitures. Net sales excluding acquisition, divestitures, and foreign currency exchange increased $22.8. Net price realization contributed 2 percentage points to net sales, reflecting higher net pricing for coffee, partially offset by lower net pricing for sweet baked goods, dog snacks, and cat food. Volume/mix decreased net sales by 2 percentage points, primarily driven by lower contract manufacturing sales related to the divested pet food brands and decreases for coffee, dog snacks, and sweet baked goods, partially offset by increases for \nUncrustables\n sandwiches and cat food.\n31\nOperating Income (Loss)\nThe following table presents the components of operating income (loss) as a percentage of net sales. \n  \nYear Ended April 30,\n  \n2025\n2024\nGross profit\n38.8 \n%\n38.1 \n%\nSelling, distribution, and administrative expenses:\nMarketing\n3.3 \n%\n3.2 \n%\nAdvertising\n2.1 \n2.2 \nSelling\n3.0 \n3.1 \nDistribution\n3.3 \n3.2 \nGeneral and administrative\n5.9 \n6.0 \nTotal selling, distribution, and administrative expenses\n17.5 \n%\n17.7 \n%\nAmortization\n2.5 \n2.3 \nGoodwill impairment charges\n19.0 \n— \nOther intangible assets impairment charges\n3.7 \n— \nOther special project costs\n0.4 \n1.6 \nLoss (gain) on divestitures – net\n3.6 \n0.2 \nOther operating expense (income) – net\n(0.2)\n0.4 \nOperating income (loss)\n(7.7)\n%\n16.0 \n%\nAmounts may not add due to rounding.\nGross profit increased $269.3, or 9 percent, in 2025, primarily reflecting the noncomparable benefit of Hostess Brands and higher net price realization, partially offset by higher costs, the noncomparable impact of divestitures, and unfavorable volume/mix.\nOperating income (loss) decreased $1,979.7, primarily reflecting pre-tax noncash impairment charges of $1,661.6 and $320.9 related to the goodwill of the Sweet Baked Snacks reporting unit and\n Hostess \nbrand indefinite-lived trademark, respectively, the $310.1 net pre-tax loss on divestitures, reflecting the $44.2 and $265.9 pre-tax losses on the divestiture of certain Sweet Baked Snacks value brands and the \nVoortman\n business, respectively, and an $82.8 increase in selling, distribution, and administrative (“SD&A”) expenses. These impacts were partially offset by the increase in gross profit, a $94.4 decrease in other special project costs primarily related to integration costs associated with the acquisition of Hostess Brands, and lapping a $39.1 charge in the prior year related to the termination of a supplier agreement. \nOur non-GAAP adjustments include amortization expense and impairment charges related to intangible assets, special project costs, gains and losses on divestitures, the change in net cumulative unallocated derivative gains and losses, and other infrequently occurring items that do not directly reflect ongoing operating results. Refer to “Non-GAAP Financial Measures” in this discussion and analysis for additional information. Gross profit excluding non-GAAP adjustments (“adjusted gross profit”), increased $224.0, or 7 percent, as compared to the prior year, primarily reflecting the exclusion of the change in net cumulative unallocated derivative gains and losses and the exclusion of special project costs as compared to GAAP gross profit. Adjusted operating income, which further reflects the exclusion of the noncash impairment charges of $2.0 billion associated with the goodwill of the Sweet Baked Snacks reporting unit and \nHostess \nbrand indefinite-lived trademark, the $310.1 net pre-tax loss on divestitures, and other special project costs as compared to GAAP operating income, increased $188.5, or 12 percent, as compared to the prior year.\nInterest Expense\nNet interest expense increased $124.4, or 47 percent, in 2025, primarily due to increased interest expense related to the new Senior Notes issued during 2024 to partially finance the acquisition of Hostess Brands. For additional information, refer to Note 8: Debt and Financing Arrangements.\nIncome Taxes\nIncome taxes increased $68.4 in 2025, as compared to the prior year. The effective income tax rate for 2025 varied from the U.S. statutory income tax rate of 21.0 percent primarily due to state income taxes and the unfavorable permanent impacts associated with the goodwill impairment charges for the Sweet Baked Snacks reporting unit and the sale of the \nVoortman \nbusiness, partially offset by favorable noncash deferred tax benefits associated with the integration of Hostess Brands into our Co\n32\nmpany and certain state legislative changes enacted during the year. The effective income tax rate for 2024 varied from the U.S. statutory income tax rate of 21.0 percent primarily due to state income taxes and unfavorable tax impacts associated with the acquisition of Hostess Brands, partially offset by a favorable tax impact of the sale of the \nSahale Snacks\n business. We anticipate a full-year effective income tax rate for 2026 to be approximately 23.8 percent. For additional information, refer to Note 14: Income Taxes. \nSpecial Project Costs\nDivestiture Costs\n: Total divestiture costs incurred to date related to the divested \nSahale Snacks\n and Canada condiment businesses were $6.4, which included $4.3 and $2.1 of employee-related and other transition and termination costs, respectively. We incurred divestiture costs of $0.9 and $5.5 during 2025 and 2024, respectively, which primarily consisted of employee-related costs and a noncash gain related to a lease termination in 2025. As of April 30, 2025, we do not anticipate any additional costs to be incurred related to these divestiture activities.\nFurthermore, we identified opportunities to address certain distribution inefficiencies, as a result of the divestitures. We anticipate incurring approximately $12.0 of costs related to these efforts, consisting primarily of other transition and termination charges. The majority of these costs are expected to be cash charges and incurred by the end of 2026. We have recognized total cumulative costs of $6.5 during 2025, primarily consisting of other transition and termination costs. For additional information, see Note 3: Divestitures.\nIntegration Costs\n: Total integration costs related to the acquisition of Hostess Brands are anticipated to be approximately $190.0 and include transaction costs, employee-related costs, and other transition and termination charges, with the majority expected to be cash charges. We have recognized total cumulative integration costs of $184.9, of which $37.5 were recognized during 2025. We anticipate the remaining integration costs will be incurred by the end of 2026 and are expected to be split between employee-related and other transition and termination costs.  \nRestructuring Costs\n: On May 27, 2025, we announced plans to close our Indianapolis, Indiana manufacturing facility, which manufactures \nHostess\n branded products, and consolidate operations into other existing facilities by early calendar year 2026 to further optimize operations for our Sweet Baked Snacks segment. We anticipate incurring approximately $75.0 of costs related to these efforts, consisting of $60.0 in noncash charges for accelerated depreciation and $15.0 in employee-related and other transition and termination costs.\nFor further information on these costs, refer to Note 4: Special Project Costs.\nCommodities Overview\nThe raw materials we use in each of our segments are primarily commodities, agricultural-based products, and packaging materials. The most significant of these materials, based on 2025 annual spend, are green coffee, peanuts, oils and fats, flour, sugar, and fruit. Green coffee, corn, certain meals, oils, and grains are traded on active regulated exchanges, and the price of these commodities fluctuates based on market conditions. Derivative instruments, including futures and options, are used to minimize the impact of price volatility for these commodities.\nWe source green coffee from more than 20 coffee-producing countries. Its price is subject to high volatility due to factors such as weather, global supply and demand, product scarcity, plant disease, investor speculation, geopolitical conflicts, changes in governmental agricultural and energy policies and regulation, political and economic conditions in the source countries, and tariffs.\nWe source peanuts and oils and fats mainly from North America. We are one of the largest roasters of peanuts in the U.S. and frequently enter into long-term purchase contracts for various periods of time to mitigate the risk of a shortage of this commodity. The oils we purchase are mainly palm, soybean, and peanut. The price of peanuts, protein meals, and oils is driven primarily by weather, which impacts crop sizes and yield, as well as global demand, especially from large importing countries such as China and India.\nWe frequently enter into long-term contracts to purchase plastic containers, which are sourced mainly within the U.S. Plastic resin is made from petrochemical feedstock and natural gas feedstock, and the price can be influenced by feedstock, energy, and crude oil prices as well as global economic and geopolitical conditions. \nExcluding the impact of derivative gains and losses, our overall commodity costs in 2025 were higher than in 2024, primarily due to higher costs for green coffee, corn, and meals.\n33\nSegment Results\nWe have four reportable segments: U.S. Retail Coffee, U.S. Retail Frozen Handheld and Spreads, U.S. Retail Pet Foods, and Sweet Baked Snacks. The presentation of International and Away From Home represents a combination of all other operating segments that are not individually reportable.\nThe U.S. Retail Coffee segment primarily includes the domestic sales of\n Folgers\n,\n Dunkin’\n, and \nCafé Bustelo\n branded coffee; the U.S. Retail Frozen Handheld and Spreads segment primarily includes the domestic sales of\n Uncustables\n, \nJif\n, and \nSmucker’s\n branded products; the U.S. Retail Pet Foods segment primarily includes the domestic sales of \nMeow Mix\n, \nMilk-Bone\n, \nPup-Peroni\n, and \nCanine Carry Outs\n branded products; and the Sweet Baked Snacks segment primarily includes all domestic and foreign sales of \nHostess\n branded products in all channels. With the exception of Sweet Baked Snacks products, International and Away From Home includes the sale of all products that are distributed in foreign countries through retail channels, as well as domestically and in foreign countries through foodservice distributors and operators (e.g., healthcare operators, restaurants, educational institutions, offices, lodging and gaming establishments, and convenience stores).\n  \nYear Ended April 30,\n  \n2025\n2024\n% Increase (Decrease)\nNet sales:\nU.S. Retail Coffee\n$\n2,806.6 \n$\n2,704.4 \n4 \n%\nU.S. Retail Frozen Handheld and Spreads\n1,877.0 \n1,815.6 \n3 \nU.S. Retail Pet Foods\n1,663.6 \n1,822.8 \n(9)\nSweet Baked Snacks\n1,178.8 \n637.3 \n85 \nInternational and Away From Home\n1,200.1 \n1,198.6 \n— \nSegment profit:\nU.S. Retail Coffee\n$\n795.1 \n$\n759.2 \n5 \n%\nU.S. Retail Frozen Handheld and Spreads\n425.3 \n434.1 \n(2)\nU.S. Retail Pet Foods\n459.6 \n402.1 \n14 \nSweet Baked Snacks\n219.8 \n138.2 \n59 \nInternational and Away From Home\n247.4 \n208.1 \n19 \nSegment profit margin:\nU.S. Retail Coffee\n28.3 \n%\n28.1 \n%\nU.S. Retail Frozen Handheld and Spreads\n22.7 \n23.9 \nU.S. Retail Pet Foods\n27.6 \n22.1 \nSweet Baked Snacks\n18.6 \n21.7 \nInternational and Away From Home\n20.6 \n17.4 \n \nU.S. Retail Coffee\nThe U.S. Retail Coffee segment net sales increased $102.2 in 2025. Net price realization increased net sales by 5 percentage points, primarily driven by higher net pricing for the \nFolgers\n and \nCafé Bustelo \nbrands, partially offset by lower net pricing for the \nDunkin’ \nbrand. Volume/mix decreased net sales by 2 percentage points, primarily reflecting decreases for the \nFolgers \nand\n Dunkin’ \nbrands, partially offset by an increase for the \nCafé Bustelo\n brand. Segment profit increased $35.9, primarily reflecting higher net price realization, lapping a $39.1 charge in the prior year related to the termination of a supplier agreement, lower marketing spend, and favorable property taxes, partially offset by higher commodity costs and unfavorable volume/mix.\nU.S. Retail Frozen Handheld and Spreads\nThe U.S. Retail Frozen Handheld and Spreads segment net sales increased $61.4 in 2025, inclusive of the impact of $15.1 of noncomparable net sales in the prior year related to the divested \nSahale Snacks \nbusiness. Excluding the noncomparable impact of the divestiture, net sales increased $76.5, or 4 percent. Volume/mix contributed 5 percentage points to net sales, primarily reflecting increases for \nUncrustables\n sandwiches and peanut butter, partially offset by a decrease for fruit spreads. Net price realization was neutral to net sales as lower net pricing for \nUncrustables\n sandwiches was mostly offset by higher net pricing for toppings and syrups and peanut butter. Segment profit decreased $8.8, primarily reflecting increased marketing spend, higher costs, lower net price realization, increased distribution expenses, and equipment write-off charges, partially offset by favorable volume/mix.\n34\nU.S. Retail Pet Foods\nThe U.S. Retail Pet Foods segment net sales decreased $159.2 in 2025. Volume/mix decreased net sales by 7 percentage points, primarily reflecting lower contract manufacturing sales related to the divested pet food brands, as the contract manufacturing agreement with Post concluded at the end of 2025, and a decrease for dog snacks, partially offset by an increase for cat food. Net price realization decreased net sales by 2 percentage points, primarily reflecting higher trade spend for cat food and dog snacks. Segment profit increased $57.5, primarily reflecting lower costs and decreased operating and distribution expenses, partially offset by lower net price realization and unfavorable volume/mix.\nSweet Baked Snacks\nWe acquired Hostess Brands on November 7, 2023, as discussed in Note 2: Acquisition. During 2025, the Sweet Baked Snacks segment contributed net sales of $1,178.8 and segment profit of $219.8. Excluding noncomparable net sales of $669.3 in the current year related to the Hostess Brands acquisition and $66.1 in the prior year related to the divestiture of certain Sweet Baked Snacks value brands and the \nVoortman\n business, net sales decreased $61.7, or 11 percent during 2025. Volume/mix decreased net sales by 7 percentage points, primarily reflecting decreases for snack cakes and private label products. Net price realization decreased net sales by 4 percentage points, primarily reflecting lower net pricing across the portfolio. Segment profit increased $81.6 during 2025, primarily reflecting the impact of noncomparable segment profit in the current year related to the Hostess Brands acquisition, partially offset by lower net price realization, unfavorable volume/mix, the impact of noncomparable segment profit in the prior year related to the divestitures, higher costs, and increased marketing spend.\nInternational and Away From Home\nInternational and Away From Home net sales increased $1.5 in 2025, including the noncomparable impact of $52.8 of net sales in the prior year primarily related to the divestitures and $10.7 of unfavorable foreign currency exchange. Excluding the noncomparable impact of the divested brands and foreign currency exchange, net sales increased $65.0, or 6 percent. Net price realization contributed 5 percentage points to net sales, primarily driven by higher net pricing across the majority of the portfolio. Volume/mix was neutral to net sales, as increases for \nUncrustables\n sandwiches and peanut butter were mostly offset by a decrease for coffee. Segment profit increased $39.3, primarily driven by higher net price realization and favorable volume/mix, partially offset by higher costs, the impact of noncomparable segment profit in the prior year related to the divested businesses, and pre-production expenses primarily related to the new \nUncrustables\n sandwiches manufacturing facility. \nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity\nOur principal source of funds is cash generated from operations, supplemented by borrowings against our commercial paper program and revolving credit facility. Total cash and cash equivalents increased to $69.9 at April 30, 2025, compared to $62.0 at April 30, 2024.\nThe following table presents selected cash flow information.\n  \nYear Ended April 30,\n  \n2025\n2024\nNet cash provided by (used for) operating activities\n$\n1,210.4 \n$\n1,229.4 \nNet cash provided by (used for) investing activities\n(100.3)\n(3,964.6)\nNet cash provided by (used for) financing activities\n(1,102.7)\n2,141.6 \nNet cash provided by (used for) operating activities\n$\n1,210.4 \n$\n1,229.4 \nAdditions to property, plant, and equipment\n(393.8)\n(586.5)\nFree cash flow \n(A)\n$\n816.6 \n$\n642.9 \n(A)\nFree cash flow is a non-GAAP financial measure used by management to evaluate the amount of cash available for debt repayment, dividend distribution, acquisition opportunities, share repurchases, and other corporate purposes.\nThe $19.0 decrease in cash provided by operating activities in 2025 was primarily driven by higher working capital requirements in 2025 and lapping the $42.5 proceeds received from settlement of the interest rate contracts assumed as part of the acquisition of Hostess Brands in the prior year, partially offset by higher net income (loss) adjusted for noncash items in the current year. The cash required to fund working capital increased compared to the prior year primarily driven by an increase in cash used for accrued liabilities reflecting timing of interest payments and a decrease in the payable for transition s\n35\nervices agreements entered into in connection with the divestitures and inventories reflecting higher inventory levels and input cost inflation in the current year. These uses of cash were partially offset by an increase in cash from trade receivables due to timing of sales and cash collections and accounts payable due to timing of spend and cash payments.\nCash used for investing activities in 2025 consisted primarily of $393.8 in capital expenditures, reflecting our investments in the new \nUncrustables\n sandwiches manufacturing and distribution facilities in McCalla, Alabama, as well as plant maintenance across our facilities, and also included an increase of $39.4 in our derivative cash margin account balances. These uses of cash for 2025 were partially offset by net proceeds received of $326.0 from the divestiture of certain Sweet Baked Snacks value brands and the \nVoortman\n business. Cash used for investing activities in 2024 consisted primarily of $3.9 billion related to the acquisition of Hostess Brands, including $67.8 of consideration transferred for the cash payment of Hostess Brands\n’ \nemployee equity awards, and $586.5 in capital expenditures, primarily driven by investments in  \nUncrustables\n sandwiches to support the new manufacturing and distribution facilities in McCalla, Alabama, as well as plant maintenance across our facilities. These uses of cash for 2024 were partially offset by proceeds of $466.3 received from the settlement of our equity investment in Post common stock and net proceeds received of $56.3, primarily from the divested \nSahale Snacks\n and Canada condiment businesses, and a decrease of $18.9 in our derivative cash margin account balances.\nCash used for financing activities in 2025 consisted primarily of long-term debt repayments of $1,300.0 and dividend payments of $455.4, partially offset by $650.0 of proceeds from long-term debt and a net increase in short-term borrowings of $19.2. Cash provided by financing activities in 2024 consisted primarily of proceeds from long-term debt of $4.3 billion to partially finance the acquisition of Hostess Brands and a net increase in short-term borrowings of $578.2. These proceeds were partially offset by the $991.0 repayment of Hostess Brands’ debt assumed, the $800.0 Term Loan prepayment, dividend payments of $437.5, purchase of treasury shares of $372.8, and an $86.4 payment to terminate the tax receivable agreement assumed with the acquisition of Hostess Brands.\nSupplier Financing Program\nAs part of ongoing efforts to maximize working capital, we work with our suppliers to optimize our terms and conditions, which includes the extension of payment terms. Payment terms with our suppliers, which we deem to be commercially reasonable, range from 0 to 180 days. We have an agreement with a third-party administrator to provide an accounts payable tracking system and facilitate a supplier financing program, which allows participating suppliers the ability to monitor and voluntarily elect to sell our payment obligations to a designated third-party financial institution. Participating suppliers can sell one or more of our payment obligations at their sole discretion, and our rights and obligations to our suppliers are not impacted. We have no economic interest in a supplier’s decision to enter into these agreements. Our rights and obligations to our suppliers, including amounts due and scheduled payment terms, are not impacted by our suppliers’ decisions to sell amounts under these arrangements. As of April 30, 2025 and 2024, $340.4 and $384.9 of our outstanding payment obligations, respectively, were elected and sold to a financial institution by participating suppliers. During 2025 and 2024, we paid $1,562.3 and $1,685.5, respectively, to a financial institution for payment obligations that were settled through the supplier financing program. \nContingencies\nWe, like other food manufacturers, are from time to time subject to various administrative, regulatory, and other legal proceedings arising in the ordinary course of business. We are currently a defendant in a variety of such legal proceedings, and while we cannot predict with certainty the ultimate results of these proceedings or potential settlements associated with these or other matters, we have accrued losses for certain contingent liabilities that we have determined are probable and reasonably estimable at April 30, 2025. Based on the information known to date, with the exception of the matters discussed below, we do not believe the final outcome of these proceedings will have a material adverse effect on our financial position, results of operations, or cash flows.\nClass Action Lawsuits:\n We are defendants in a series of putative class action lawsuits that were transferred to the United States District Court for the Western District of Missouri for coordinated pre-trial proceedings. The plaintiffs assert claims arising under various state laws for false advertising, consumer protection, deceptive and unfair trade practices, and similar statutes. Their claims are premised on allegations that we have misrepresented the number of servings that can be made from various canisters of \nFolgers\n coffee on the packaging for those products. The outcome and the financial impact of these cases, if any, cannot be predicted at this time. Accordingly, no loss contingency has been recorded for these matters as of April 30, 2025, and the likelihood of loss is not considered probable or reasonably estimable. However, if we are required to pay significant damages, our business and financial results could be adversely impacted, and sales of those products could suffer not only in these locations but elsewhere. \n36\nProduct Recall:\n We are defendants in ongoing consumer litigation associated with a voluntary recall of select \nJif\n peanut butter products initiated in May 2022. The outcome and financial impact of this litigation cannot be predicted at this time. Accordingly, no loss contingency has been recorded for these matters as of April 30, 2025, and the likelihood of loss is not considered probable or reasonably estimable.\nVoortman Contingency:\n In December 2020, Hostess Brands asserted claims for indemnification against the sellers (the “Sellers”) under the terms of a Share Purchase Agreement (the “Purchase Agreement”) pursuant to which Hostess Brands acquired Voortman Cookies Limited (“Voortman”). The claims were for damages arising out of alleged breaches by the Sellers of certain representations, warranties, and covenants contained in the Purchase Agreement relating to periods prior to the closing of the acquisition. Hostess Brands also submitted claims relating to these alleged breaches under the representation and warranty insurance policy (“RWI”) that was purchased in connection with the acquisition. In the third quarter of calendar 2022, the RWI insurers paid Hostess Brands $42.5 CAD (the RWI coverage limit) (the “Proceeds”) related to these breaches. Per agreement with the RWI insurers, we will not be required to return the Proceeds under any circumstances.\nOn November 3, 2022, pursuant to the agreement with the RWI insurers, Voortman brought claims in the Ontario (Canada) Superior Court of Justice (the “Claim”) against certain of the Sellers related to the alleged breaches. The Claim alleges the seller defendants made certain non-disclosures and misrepresentations to induce Hostess Brands to overpay for Voortman. We are seeking damages of $109.0 CAD representing the amount of the aggregate liability of the Sellers for indemnification under the Purchase Agreement, $5.0 CAD in punitive or aggravated damages, interest, proceedings fees, and any other relief the presiding court deems appropriate. A portion of any recovery will be shared with the RWI insurers. Although we believe that the Claim is meritorious, no assurance can be given as to whether we will recover all, or any part, of the amounts being pursued. We retained rights to the Claim upon the divestiture of the \nVoortman\n business in 2025.\nCapital Resources\nThe following table presents our capital structure.\n  \nApril 30,\n  \n2025\n2024\nCurrent portion of long-term debt\n$\n— \n$\n999.3 \nShort-term borrowings\n640.8 \n591.0 \nLong-term debt, less current portion\n7,036.8 \n6,773.7 \nTotal debt\n$\n7,677.6 \n$\n8,364.0 \nShareholders’ equity\n6,082.6 \n7,693.9 \nTotal capital\n$\n13,760.2 \n$\n16,057.9 \nIn March 2025, we entered into a Term Loan for an unsecured $650.0 term facility. Borrowings under the Term Loan bear interest on the prevailing Secured Overnight Financing Rate (“SOFR”) and are payable at the end of the borrowing term. The Term Loan matures on March 5, 2027, and does not require scheduled amortization payments. Voluntary prepayments are permitted without premium or penalty. During 2025, the full amount was drawn on the Term Loan to partially finance the repayment of $1.0 billion in principal of our 3.50% Senior Notes due March 15, 2025. As of April 30, 2025, the interest rate on the Term Loan was 5.43 percent. \nIn March 2025, we also entered into an unsecured revolving credit facility with a group of ten banks, which provides for a revolving credit line of $2.0 billion and matures in March 2030. As a result of the new facility in March 2025, we terminated the previous $2.0 billion revolving credit facility. Additionally, we participate in a commercial paper program under which we can issue short-term, unsecured commercial paper not to exceed $2.0 billion at any time. The commercial paper program is backed by our revolving credit facility and reduces what we can borrow under the revolving credit facility by the amount of commercial paper outstanding. Commercial paper is used as a continuing source of short-term financing for general corporate purposes. As of April 30, 2025, we had $641.0 of short-term borrowings outstanding, which were issued under our commercial paper program at a weighted-average interest rate of 4.73 percent.\nIn December 2024, we commenced cash tender offers to purchase up to $300.0 in aggregate purchase price, not including accrued and unpaid interest, of certain outstanding Senior Notes. As a result, an aggregate principal amount of $122.5 of our 2.750% Senior Notes due 2041 and $138.8 of our 3.550% Senior Notes due 2050 were tendered and accepted, and $194.1 of our 2.125% Senior Notes due 2032 were tendered, of which $135.5 was accepted.\n37\nIn October 2023, we completed an offering of $3.5 billion in Senior Notes due November 15, 2028, November 15, 2033, November 15, 2043, and November 15, 2053. The net proceeds from the offering were used to partially finance the acquisition of Hostess Brands and pay off the debt assumed as part of the acquisition.\nWe are in compliance with all our debt covenants as of April 30, 2025, and expect to be for the next 12 months. For additional information on our long-term debt, sources of liquidity, and debt covenants, see Note 8: Debt and Financing Arrangements.\nDividend payments were $455.4 and $437.5 in 2025 and 2024, respectively, and dividends declared per share were $4.32 and $4.24 in 2025 and 2024, respectively. The declaration of dividends is subject to the discretion of our Board and depends on various factors, such as our net income (loss), financial condition, cash requirements, future events, and other factors deemed relevant by the Board. \nOn March 2, 2023, we entered into a share repurchase plan (“10b5-1 Plan”) established in accordance with Rule 10b5-1 of the Exchange Act in connection with the remaining common shares authorized for repurchase by the Board, which was approximately 3.5 million common shares as of April 30, 2023. In accordance with the 10b5-1 Plan, our designated broker had the authority to repurchase approximately 2.4 million common shares, which commenced upon the sale of certain pet food brands on April 28, 2023, and expired 45 calendar days after the closure of the transaction. In 2024, we repurchased approximately 2.4 million common shares for $362.8 under the 10b5-1 Plan, and approximately 1.1 million common shares remain available for repurchase. In accordance with \nThe Inflation Reduction Act of 2022, H.R. 5376 \n(the “Inflation Reduction Act”), a one percent excise tax was applied to share repurchases after December 31, 2022. As a result, an excise tax of $3.6 was accrued on the repurchased shares during 2024, and included within additional capital in our Consolidated Balance Sheet. An accrued excise tax of $6.7 was paid during 2025, which was related to these shares repurchased under the 10b5-1 Plan during 2023 and 2024. All other share repurchases during 2025 and 2024 consisted of shares repurchased from stock plan recipients in lieu of cash payments.\nOn November 7, 2023, we acquired Hostess Brands, and as a result, we issued approximately 4.0 million common shares valued at $450.2 in exchange for the outstanding shares of Hostess Brands common stock to partially fund the acquisition. The shares issued were based on each outstanding share of Hostess Brands common stock receiving $30.00 per share in cash and 0.03002 shares of our common shares, which represented a value of $4.25 based on the closing stock price of our common shares on September 8, 2023, the last trading day preceding September 11, 2023, the date on which the execution of the Hostess Brands merger agreement was publicly announced. For additional information on the acquisition of Hostess Brands, see Note 2: Acquisition.\nIn November 2021, we announced plans to invest $1.1 billion to build a new manufacturing facility and distribution center in McCalla, Alabama dedicated to production of\n Uncrustables\n sandwiches. Construction of this facility began in 2022, and production began during the second quarter of 2025. The project demonstrates our commitment to meet increasing demand for this highly successful product and deliver on our strategy to focus on brands with the most significant growth opportunities. Construction of the facility and production will occur in three phases over multiple years, with financial investments and job creation aligning across each of the three phases. \nThe following table presents certain cash requirements related to 2026 investing and financing activities based on our current expectations. \nProjection Year Ending April 30, 2026\nDividend payments – based on current rates and common shares outstanding\n$\n459.8 \nCapital expenditures\n325.0 \nInterest payments\n384.4 \nAbsent any material acquisitions, apart from the recent acquisition of Hostess Brands, or other significant investments, we believe that cash on hand, combined with cash provided by operations, borrowings available under our revolving credit facility and commercial paper program, and access to capital markets, will be sufficient to meet our cash requirements for the next 12 months, including the payment of quarterly dividends, principal and interest payments on debt outstanding, and capital expenditures. However, as a result of the current macroeconomic environment and the recent acquisition, we may experience an increase in the cost or the difficulty to obtain debt or equity financing, or to refinance our debt in the future. \n38\nWe continue to evaluate these risks, which could affect our financial condition or our ability to fund operations or future investment opportunities.\nAs of April 30, 2025, total cash and cash equivalents of $56.2 was held by our foreign subsidiaries, primarily in Canada. During 2025, we returned $35.0 of foreign cash to the U.S. from Canada, reflecting intercompany debt repayments, and as a result, there were no tax impacts. There was no other foreign cash repatriated to the U.S. during 2025.\nMaterial Cash Requirements\nThe following table summarizes our material cash requirements by fiscal year at April 30, 2025.\nTotal\n2026\n2027-2028\n2029-2030\n2031 and\nbeyond\nLong-term debt obligations, including current portion \n(A)\n$\n7,103.2 \n$\n— \n$\n1,150.0 \n$\n1,250.0 \n$\n4,703.2 \nInterest payments \n(B)\n5,266.1 \n354.1 \n668.4 \n564.0 \n3,679.6 \nPurchase obligations \n(C)\n2,361.4 \n2,078.9 \n264.3 \n18.2 \n— \nTotal\n$\n14,730.7 \n$\n2,433.0 \n$\n2,082.7 \n$\n1,832.2 \n$\n8,382.8 \n(A)\nLong-term debt obligations, including current portion, excludes the impact of offering discounts, make-whole payments, and debt issuance costs.\n(B)\nInterest payments consist of the interest payments for our fixed-rate Senior Notes. \n(C)\nPurchase obligations includes agreements that are enforceable and legally bind us to purchase goods or services, which primarily consist of obligations related to normal, ongoing purchase obligations in which we have guaranteed payment to ensure availability of raw materials. We expect to receive consideration for these purchase obligations in the form of materials and services. These purchase obligations do not represent all future purchases expected but represent only those items for which we are contractually obligated. Amounts included in the table above represent our current best estimate of payments due. Actual cash payments may vary due to the variable pricing components of certain purchase obligations.\nOur other cash requirements at April 30, 2025, primarily included operating and finance lease obligations, which consist of the minimum rental commitments under non-cancelable operating and finance leases. As of April 30, 2025, we had total undiscounted minimum lease payments of $142.1 and $13.8 related to our operating and finance leases, respectively. For additional information, see Note 12: Leases.\nIn addition, we have other liabilities which consisted primarily of projected commitments associated with our defined benefit pension and other postretirement benefit plans, as disclosed in Note 9: Pensions and Other Postretirement Benefits. The total liability for our unrecognized tax benefits and tax-related net interest at April 30, 2025, was $3.1 under Financial Accounting Standards Board (“FASB”) Accounting Standards Codification (“ASC”) 740, \nIncome Taxes\n; however, we are unable to reasonably estimate the timing of cash settlements with the respective taxing authorities. For additional information, see Note 14: Income Taxes.\nAs of April 30, 2025, we do not have material off-balance sheet arrangements, financings, or other relationships with unconsolidated entities or other persons, also known as variable interest entities. Transactions with related parties are in the ordinary course of business and are not material to our results of operations, financial condition, or cash flows.\n39\nNON-GAAP FINANCIAL MEASURES\nWe use non-GAAP financial measures including: net sales excluding acquisition, divestitures, and foreign currency exchange, adjusted gross profit, adjusted operating income, adjusted income, adjusted earnings per share, and free cash flow, as key measures for purposes of evaluating performance internally. We believe that investors’ understanding of our performance is enhanced by disclosing these performance measures. Furthermore, these non-GAAP financial measures are used by management in preparation of the annual budget and for the monthly analyses of our operating results. The Board also utilizes certain non-GAAP financial measures as components for measuring performance for incentive compensation purposes.\nNon-GAAP financial measures exclude certain items affecting comparability that can significantly affect the year-over-year assessment of operating results, which include amortization expense and impairment charges related to intangible assets, special project costs, gains and losses on divestitures, the change in net cumulative unallocated derivative gains and losses, and other infrequently occurring items that do not directly reflect ongoing operating results. Income taxes, as adjusted is calculated using an adjusted effective income tax rate that is applied to adjusted income before income taxes and reflects the exclusion of the previously discussed items, as well as any adjustments for one-time tax-related activities, when they occur. While this adjusted effective income tax rate does not generally differ materially from our GAAP effective income tax rate, certain exclusions from non-GAAP results, such as the unfavorable permanent tax impacts associated with the goodwill impairment charges for the Sweet Baked Snacks reporting unit, the sale of the Voortman Cookies Limited entity, and the favorable noncash deferred tax benefits associated with the integration of Hostess Brands into our Company, can significantly impact our adjusted effective income tax rate.  \nThese non-GAAP financial measures are not intended to replace the presentation of financial results in accordance with U.S. GAAP. Rather, the presentation of these non-GAAP financial measures supplements other metrics we use to internally evaluate our business and facilitate the comparison of past and present operations and liquidity. These non-GAAP financial measures may not be comparable to similar measures used by other companies and may exclude certain nondiscretionary expenses and cash payments.\nThe following table reconciles certain non-GAAP financial measures to the comparable GAAP financial measure. See page 31 for a reconciliation of net sales adjusted for certain noncomparable items to the comparable GAAP financial measure.\n  \nYear Ended April 30,\n  \n2025\n2024\nGross profit reconciliation:\nGross profit\n$\n3,384.7 \n$\n3,115.4 \nChange in net cumulative unallocated derivative gains and losses\n(58.2)\n(6.7)\nCost of products sold – special project costs\n9.1 \n2.9 \nAdjusted gross profit \n$\n3,335.6 \n$\n3,111.6 \n% of net sales\n38.2 \n%\n38.0 \n%\nOperating income (loss) reconciliation:\nOperating income (loss)\n$\n(673.9)\n$\n1,305.8 \nAmortization\n219.3 \n191.1 \nGoodwill impairment charges\n1,661.6 \n— \nOther intangible assets impairment charges\n320.9 \n— \nLoss (gain) on divestitures – net\n310.1 \n12.9 \nChange in net cumulative unallocated derivative gains and losses\n(58.2)\n(6.7)\nCost of products sold – special project costs\n9.1 \n2.9 \nOther special project costs\n35.8 \n130.2 \nAdjusted operating income\n$\n1,824.7 \n$\n1,636.2 \n% of net sales\n20.9 \n%\n20.0 \n%\nNet income (loss) reconciliation:\nNet income (loss)\n$\n(1,230.8)\n$\n744.0 \nIncome tax expense\n184.0 \n252.4 \nAmortization\n219.3 \n191.1 \nGoodwill impairment charges\n1,661.6 \n— \nOther intangible assets impairment charges\n320.9 \n— \nLoss (gain) on divestitures – net\n310.1 \n12.9 \nChange in net cumulative unallocated derivative gains and losses\n(58.2)\n(6.7)\nCost of products sold – special project costs\n9.1 \n2.9 \nOther special project costs\n35.8 \n130.2 \nOther expense – special project costs\n— \n0.3 \nOther infrequently occurring items:\nOther debt charges (gains) – net \n(A)\n(30.2)\n19.5 \nRealized loss on investment in equity securities – net \n(B)\n— \n21.5 \nPension plan termination settlement charge \n(C)\n— \n3.2 \nAdjusted income before income taxes\n$\n1,421.6 \n$\n1,371.3 \nIncome taxes, as adjusted\n342.8 \n333.3 \nAdjusted income\n$\n1,078.8 \n$\n1,038.0 \nWeighted-average shares – assuming dilution \n(D)\n106.6 \n104.4 \nAdjusted earnings per share – assuming dilution \n(D)\n$\n10.12 \n$\n9.94 \nFree cash flow reconciliation:\nNet cash provided by (used for) operating activities\n$\n1,210.4 \n$\n1,229.4 \nAdditions to property, plant, and equipment\n(393.8)\n(586.5)\nFree cash flow\n$\n816.6 \n$\n642.9 \n(A)    Includes a net gain on extinguishment of debt as a result of the tender offers completed during 2025 and financing fees associated with the Bridge Term Loan Credit Facility (“Bridge Loan”) entered into during 2024 to provide committed financing for the acquisition of Hostess Brands. For more information, see Note 2: Acquisition and Note 8: Debt and Financing Arrangements.\n(B)    Includes gains and losses resulting from the change in fair value of our investment in Post common stock and the related equity forward contract, which was settled on November 15, 2023. For more information, see Note 3: Divestitures and Note 10: Derivative Financial Instruments.\n(C)    Represents the nonrecurring pre-tax settlement charge recognized during 2024 related to the acceleration of prior service cost for the  portion of the plan surplus to be allocated to plan members within our Canadian defined benefit plans. For additional information, see Note 9: Pensions and Other Postretirement Benefits.\n(D)    Adjusted earnings per common share – assuming dilution for 2025 and 2024 was computed using the treasury stock method. Further, in 2025, the weighted-average shares – assuming dilution differed from our GAAP weighted-average common shares outstanding – assuming dilution as a result of the anti-dilutive effect of our stock-based awards, which were excluded from the computation of net loss per share – assuming dilution. For more information, see Earnings Per Share in Note 1: Accounting Policies and Note 6: Earnings Per Share. \nCRITICAL ACCOUNTING ESTIMATES AND POLICIES\nThe preparation of financial statements in conformity with U.S. GAAP requires that we make estimates and assumptions that in certain circumstances affect amounts reported in the accompanying consolidated financial statements. In preparing these financial statements, we have made our best estimates and judgments of certain amounts included in the financial statements, giving due consideration to materiality. We do not believe there is a great likelihood that materially different amounts would be reported under different conditions or using different assumptions related to the accounting policies described below. However, application of these accounting policies involves the exercise of judgment and use of assumptions as to future uncertainties and, as a result, actual results could differ from these estimates.\nTrade Marketing and Merchandising Programs:\n In order to support our products sold within the U.S. retail market segments and Sweet Baked Snacks segment, various promotional activities are conducted through retailers, distributors, or directly with consumers, including in-store display and product placement programs, price discounts, coupons, and other similar activities. The costs of these programs are classified as a reduction of sales. We regularly review and revise, when we deem necessary, estimates of costs for these promotional programs based on estimates of what will be redeemed by retailers, distributors, or consumers. These estimates are made using various techniques, including historical data on performance of similar promotional programs. Differences between estimated expenditures and actual performance are recognized as a change in estimate in a subsequent period. During 2025, 2024, and 2023, subsequent period adjustments were less than 2 percent of both consolidated pre-tax adjusted income and cash provided by operating activities. \n \nIncome Taxes:\n We account for income taxes using the liability method. In the ordinary course of business, we are exposed to uncertainties related to tax filing positions and periodically assess the technical merits of these tax positions for all tax years that remain subject to examination, based upon the latest information available. We recognize a tax benefit when it is more likely than not the position will be sustained upon examination, based on its technical merits. The tax position is then measured as the largest amount of benefit that is greater than 50 percent likely of being realized upon ultimate settlement. \nWe routinely evaluate the likelihood of realizing the benefit of our deferred tax assets and may record a valuation allowance if, based on all available evidence, we determine that it is more likely than not that all or some portion of such assets will not be realized. Valuation allowances related to deferred tax assets can be affected by changes in tax legislation, statutory tax rates, and projected future taxable income levels. Changes in estimated realization of deferred tax assets would result in an adjustment to income in the period in which that determination is made, unless such changes are determined to be an adjustment to goodwill within the allowable measurement period under the acquisition method of accounting.\nThe future tax benefit arising from the net deductible temporary differences and tax carryforwards was $231.5 and $279.8 at April 30, 2025 and 2024, respectively. In evaluating our ability to recover our deferred tax assets within the jurisdiction from which they arise, we consider all available positive and negative evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies, and results of operations. For those jurisdictions where the expiration date of tax carryforwards or the projected operating results indicate that realization is not likely, a valuation allowance has been provided.\nAs of April 30, 2025, a portion of our undistributed foreign earnings, primarily in Canada, is not considered permanently reinvested, and an immaterial deferred tax liability has been recognized accordingly. For additional information, see Note 14: Income Taxes.\nGoodwill and Other Indefinite-Lived Intangible Assets: \nA significant portion of our assets is composed of goodwill and other intangible assets, the majority of which are not amortized but are reviewed for impairment at least annually on \nFebruary 1, and more often if indicators of impairment exist. At April 30, 2025, the carrying value of goodwill and other intangible assets totaled $12.1 billion, compared to total assets of $17.6 billion and total shareholders’ equity of $6.1 billion. If the carrying value of these assets exceeds the current estimated fair value, the asset is considered impaired, which would result \n40\nin a noncash impairment charge to earnings, that could be material. Events and conditions that could result in impairment include a sustained drop in the market price of our common shares, increased competition or loss of market share, obsolescence, product claims that result in a significant loss of sales or profitability over the product life, deterioration in macroeconomic conditions, declining financial performance in comparison to projected results, increased input costs beyond projections, or divestitures of significant brands.\nTo test for goodwill impairment, we estimate the fair value of each of our reporting units using both a discounted cash flow valuation technique and a market-based approach. The impairment test incorporates estimates of future cash flows; allocations of certain assets, liabilities, and cash flows among reporting units; future growth rates; terminal value amounts; and the applicable weighted-average cost of capital used to discount those estimated cash flows. The estimates and projections used in the calculation of fair value are consistent with our current and long-range plans, including anticipated changes in market conditions, industry trends, growth rates, and planned capital expenditures. Changes in forecasted operations and other estimates and assumptions could impact the assessment of impairment in the future.\nAt April 30, 2025, goodwill totaled $5.7 billion. Goodwill is substantially concentrated within the U.S. retail market segments and Sweet Baked Snacks segment. During 2025, we recognized goodwill impairment charges of $1,661.6 related to the goodwill of the Sweet Baked Snacks reporting unit, which was a result of the evaluations performed during 2025. As of April 30, 2025, the estimated fair value exceeded the carrying value by greater than 10 percent for all of our reporting units with a goodwill balance, with the exception of the Sweet Baked Snacks reporting unit, for which its fair value approximated carrying value as a result of the impairment charges recognized during 2025.\nThe carrying value of the goodwill within the Sweet Baked Snacks segment was $507.5 as of April 30, 2025, and remains susceptible to future impairment charges due to narrow differences between fair value and carrying value, which is attributable to the impairment charges recognized during 2025. Any significant adverse change in our near or long-term projections or macroeconomic conditions could result in future impairment charges which could be material. For additional information, see Note 7: Goodwill and Other Intangible Assets.  \nOther indefinite-lived intangible assets, consisting entirely of trademarks, are also tested for impairment at least annually and more often if events or changes in circumstances indicate that their carrying values may be below their fair values. To test these assets for impairment, we estimate the fair value of each asset based on a discounted cash flow model using various inputs, including projected revenues, an assumed royalty rate, and a discount rate. Changes in these estimates and assumptions could impact the assessment of impairment in the future. \nAt April 30, 2025, other indefinite-lived intangible assets totaled $3.8 billion. Trademarks that represent our leading brands comprise more than 95 percent of the total carrying value of other indefinite-lived intangible assets. As of April 30, 2025, the estimated fair value was substantially in excess of the carrying value for the majority of these leading brand trademarks, and in all instances, the estimated fair value exceeded the carrying value by greater than 10 percent, with the exception of the \nHostess \nbrand indefinite-lived intangible asset within the Sweet Baked Snacks segment. During 2025, we recognized impairment charges of $320.9 related to the \nHostess\n brand indefinite-lived trademark, to the extent the carrying value exceeded the estimated fair value. \nFORWARD-LOOKING STATEMENTS\nCertain statements included in this Annual Report on Form 10-K contain forward-looking statements within the meaning of federal securities laws. The forward-looking statements may include statements concerning our current expectations, estimates, assumptions, and beliefs concerning future events, conditions, plans, and strategies that are not historical fact. Any statement that is not historical in nature is a forward-looking statement and may be identified by the use of words and phrases such as “expect,” “anticipate,” “believe,” “intend,” “will,” “plan,” and similar phrases.\nFederal securities laws provide a safe harbor for forward-looking statements to encourage companies to provide prospective information. We are providing this cautionary statement in connection with the safe harbor provisions. Readers are cautioned not to place undue reliance on any forward-looking statements, as such statements are by nature subject to risks, uncertainties, and other factors, many of which are outside of our control and could cause actual results to differ materially from such statements and from our historical results and experience. These risks and uncertainties include, but are not limited to, those set forth under the caption “Risk Factors” in this Annual Report on Form 10-K, as well as the following:\n•\nour ability to successfully integrate Hostess Brands’ operations and employees and to implement plans and achieve financial forecasts with respect to the Hostess Brands’ business;\n41\n•\nour ability to realize the anticipated benefits, including synergies and cost savings, related to the Hostess Brands acquisition, including the possibility that the expected benefits will not be realized or will not be realized within the expected time period;\n•\ndisruption from the acquisition of Hostess Brands by diverting the attention of our management and making it more difficult to maintain business and operational relationships;\n•\nthe negative effects of the acquisition of Hostess Brands on the market price of our common shares;\n•\nthe amount of the costs, fees, expenses, and charges and the risk of litigation related to the acquisition of Hostess Brands;\n•\nthe effect of the acquisition of Hostess Brands on our business relationships, operating results, ability to hire and retain key talent, and business generally;\n•\ndisruptions or inefficiencies in our operations or supply chain, including any impact caused by product recalls, political instability, terrorism, geopolitical conflicts, extreme weather conditions, natural disasters, pandemics, work stoppages or labor shortages, or other calamities;\n•\nrisks related to the availability of, and cost inflation in, supply chain inputs, including labor, raw materials, commodities, packaging, and transportation;\n•\nthe impact of food security concerns involving either our products or our competitors’ products, changes in consumer preferences, consumer or other litigation, actions by the FDA or other agencies, and product recalls;\n•\nrisks associated with derivative and purchasing strategies we employ to manage commodity pricing and interest rate risks;\n•\nthe availability of reliable transportation on acceptable terms;\n•\nour ability to achieve cost savings related to our restructuring and cost management programs in the amounts and within the time frames currently anticipated; \n•\nour ability to generate sufficient cash flow to continue operating under our capital deployment model, including capital expenditures, debt repayment to meet our deleveraging objectives, dividend payments, and share repurchases;\n•\na change in outlook or downgrade in our public credit ratings by a rating agency below investment grade;\n•\nour ability to implement and realize the full benefit of price changes, and the impact of the timing of the price changes to profits and cash flow in a particular period;\n•\nthe success and cost of marketing and sales programs and strategies intended to promote growth in our business, including product innovation;\n•\ngeneral competitive activity in the market, including competitors’ pricing practices and promotional spending levels;\n•\nour ability to attract and retain key talent;\n•\nthe concentration of certain of our businesses with key customers and suppliers, including primary or single-source suppliers of certain key raw materials and finished goods, and our ability to manage and maintain key relationships;\n•\nimpairments in the carrying value of goodwill, other intangible assets, or other long-lived assets or changes in the useful lives of other intangible assets or other long-lived assets;\n•\nthe impact of new or changes to existing governmental laws and regulations and their application, including tariffs, food ingredients, food labeling, and food accessibility;\n•\nthe outcome of tax examinations, changes in tax laws, and other tax matters; \n•\na disruption, failure, or security breach of our or our suppliers’ information technology systems, including, but not limited to, ransomware attacks;\n•\nforeign currency exchange rate and interest rate fluctuations; and\n•\nrisks related to other factors described under “Risk Factors” in other reports and statements we have filed with the SEC.\nReaders are cautioned not to unduly rely on such forward-looking statements, which speak only as of the date made, when evaluating the information presented in this Annual Report on Form 10-K. We do not undertake any obligation to update or revise these forward-looking statements to reflect new events or circumstances subsequent to the filing in this Annual Report on Form 10-K.\n42",
  "item2": null
}