{
  "source_file": "sna-20241228.htm",
  "form_type": "10-K",
  "item1": "Item 1: Business\nSnap-on is a leading global innovator, manufacturer and marketer of tools, equipment, diagnostics, repair information and systems solutions for professional users performing critical tasks including those working in vehicle repair, aerospace, the military, natural resources, and manufacturing. From its founding in 1920, Snap-on has been recognized as the mark of the serious and the outward sign of the pride and dignity working men and women take in their professions. Products and services are sold through the company’s network of widely recognized franchisee vans as well as through direct and distributor channels, under a variety of notable brands. The company also provides financing programs to facilitate the sales of its products and to support its franchise business. \nSnap-on markets its products and brands worldwide in more than 130 countries. Snap-on’s largest geographic market is the United States.  In addition, Snap-on has a meaningful presence across continental Europe and in the Asia Pacific region, as well as in Canada and the United Kingdom.\nThe company began with the development of the original Snap-on interchangeable socket set and subsequently pioneered mobile tool distribution in the automotive repair market, where well-stocked vans sell to professional vehicle technicians at their place of business. Today, Snap-on defines its value proposition more broadly, extending its reach “beyond the garage” to deliver a broad array of unique solutions that make work easier for serious professionals. The company’s “coherent growth” strategy focuses on developing and expanding its professional customer base in its legacy automotive market, as well as in adjacent markets, additional geographies and other areas, including in critical industries, where the cost and penalties for failure can be high. In addition to its coherent growth strategy, Snap-on is committed to its “Value Creation Processes” – a set of strategic principles and processes designed to create value and employed in the areas of (i) safety; (ii) quality; (iii) customer connection; (iv) innovation; and (v) rapid continuous improvement (“RCI”). Snap-on’s RCI initiatives employ a structured set of tools and processes across multiple businesses and geographies intended to eliminate waste and improve operations. Savings from Snap-on’s RCI initiatives reflect benefits from a wide variety of ongoing efficiency, productivity and process improvements, including savings generated from product design cost reductions, improved manufacturing line set-up and change-over practices, lower-cost sourcing initiatives and facility consolidations.\nSnap-on’s primary customer segments include: (i) commercial and industrial customers, including professionals in critical industries and in emerging markets; (ii) professional vehicle repair technicians who purchase products through the company’s multinational mobile tool distribution network; and (iii) other professional customers related to vehicle repair, including owners and managers of independent service and repair shops, as well as original equipment manufacturer (“OEM”) dealership service and repair shops (“OEM dealerships”). Snap-on’s Financial Services customer segment includes: (i) franchisees’ customers, principally serving vehicle repair technicians, and Snap-on customers who require financing for the purchase or lease of tools, diagnostics, and equipment products on an extended-term payment plan; and (ii) franchisees who require financing options for vehicle and business needs.\n4\nSNAP-ON INCORPORATED\nSnap-on’s operating segments, which represent Snap-on’s reportable segments, are based on the organizational structure used by the Chief Executive Officer, its chief operating decision maker (“CODM”), to make operating and investment determinations and to assess performance. Snap-on’s reportable operating segments are: (i) the Commercial & Industrial Group; (ii) the Snap-on Tools Group; (iii) the Repair Systems & Information Group; and (iv) Financial Services. The Commercial & Industrial Group consists of business operations serving a broad range of industrial and commercial customers worldwide, including customers in the aerospace, natural resources, government and military, power generation, transportation and technical education market segments (collectively, “critical industries”), primarily through direct and distributor channels. The Snap-on Tools Group consists of business operations primarily serving vehicle service and repair technicians through the company’s multinational mobile tool distribution channel. The Repair Systems & Information Group consists of business operations serving other professional vehicle repair customers worldwide, primarily owners and managers of independent repair shops and OEM dealerships, through direct and distributor channels. Financial Services consists of the business operations of Snap-on Credit LLC (“SOC”), the company’s financial services business in the United States, and Snap-on’s other financial services subsidiaries in those international markets where Snap-on has franchise operations. See Note 19 to the Consolidated Financial Statements for information on operating segments and foreign operations.\nSnap-on evaluates the performance of the Commercial & Industrial Group, the Snap-on Tools Group and the Repair Systems & Information Group operating segments based on segment net sales and segment operating earnings while the Financial Services operating segment is evaluated based on segment revenue and segment operating earnings. The Snap-on Tools Group segment net sales reflect external net sales, while the Commercial & Industrial Group and the Repair Systems & Information Group segment net sales include both external and intersegment net sales. Snap-on accounts for intersegment net sales and transfers based primarily on standard costs with reasonable mark-ups established between the segments. Identifiable assets by segment are those assets used in the respective reportable segment’s operations. Corporate assets consist of cash and cash equivalents (excluding cash held at Financial Services), deferred income taxes and certain other assets. Corporate expenses primarily reflect stock-based compensation and other costs not attributable to an operating segment. Intersegment amounts are eliminated to arrive at Snap-on’s consolidated financial results.\nRecent Acquisitions\nSnap-on has continued to broaden its business through a series of coherent acquisitions, which have expanded and enhanced Snap-on’s capabilities in a variety of critical industries and in its business operations serving primarily owners and managers of independent repair shops and OEM dealerships. For information regarding recent acquisitions, see Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and Note 3 to the Consolidated Financial Statements.\nInformation Available on the Company’s Website\nAdditional information about Snap-on, including its products and its environmental, health and safety, social responsibility, governance and sustainability (collectively, “ESG”) commitment, is available on the company’s website at \nwww.snapon.com\n. Snap-on is not including the information contained on its website as a part of, or incorporating it by reference into, this Annual Report on Form 10-K. \nSnap-on’s Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Proxy Statements on Schedule 14A and Current Reports on Form 8-K, as well as any amendments to those reports, are made available to the public at no charge through the “Investors” section of the company’s website at \nwww.snapon.com\n. Snap‑on makes such material available on its website as soon as reasonably practicable after it electronically files such material with, or furnishes it to, the Securities and Exchange Commission (“SEC”). Copies of any materials the company files with the SEC can also be obtained free of charge through the SEC’s website at \nwww.sec.gov\n. In addition, Snap-on’s (i) charters for the Audit, Corporate Governance and Nominating, and Organization and Executive Compensation Committees of the company’s Board of Directors; (ii) Corporate Governance Guidelines; and (iii) Code of Business Conduct and Ethics are available on the company’s website. Snap-on will also post any amendments to these documents, or information about any waivers granted to directors or executive officers with respect to the Code of Business Conduct and Ethics, on the company’s website at \nwww.snapon.com\n.\n2024 ANNUAL REPORT\n5\nProducts and Services\nTools; Diagnostics, Information and Management Systems; and Equipment\nSnap-on offers a broad line of products and complementary services that are grouped into three product categories: (i) tools; (ii) diagnostics, information and management systems; and (iii) equipment. Further product line information is not presented as it is not practicable to do so. The following table shows the consolidated net sales of these product categories for the last three years:\n \nNet Sales\n(Amounts in millions)\n2024\n2023\n2022\nProduct Category:\nTools\n$\n2,546.2 \n$\n2,528.9 \n$\n2,399.4 \nDiagnostics, information and management systems\n1,028.1 \n991.2 \n942.4 \nEquipment\n1,133.1 \n1,210.1 \n1,151.0 \n$\n4,707.4 \n$\n4,730.2 \n$\n4,492.8 \nThe \ntools\n product category includes hand tools, power tools, tool storage products and other similar products. Hand tools include wrenches, sockets, ratchet wrenches, pliers, screwdrivers, punches and chisels, saws and cutting tools, pruning tools, torque measuring instruments and other similar products. Power tools include cordless (battery), pneumatic (air), hydraulic and corded (electric) tools, such as impact wrenches, ratchets, screwdrivers, drills, sanders, grinders and similar products. Tool storage includes tool chests, roll cabinets and other similar products. For many industrial customers, Snap-on creates specific, engineered solutions, including facility-level tool control and asset management hardware and software, custom kits in a wide range of configurations, and custom-built tools designed to meet customer requirements. The majority of products are manufactured by Snap-on and, in completing the product offering, other items are purchased from external manufacturers.\nThe \ndiagnostics, information and management systems\n product category includes handheld and computer-based diagnostic products, service and repair information products, diagnostic software solutions, electronic parts catalogs, business management systems and services, point-of-sale systems, integrated systems for vehicle service shops, OEM purchasing facilitation services, and warranty management systems and analytics to help OEM dealerships manage and track performance.\nThe \nequipment\n product category includes solutions for the service of vehicles and industrial equipment. Products include wheel alignment equipment, wheel balancers, tire changers, vehicle lifts, test lane equipment, collision repair equipment, vehicle air conditioning service equipment, brake service equipment, fluid exchange equipment, transmission troubleshooting equipment, safety testing equipment, battery chargers and hoists.\nSnap-on supports the sale of its diagnostics and vehicle service shop equipment by offering training programs as well as after-sales support for its customers, primarily focusing on the technologies and the application of specific products developed and marketed by Snap-on.\n6\nSNAP-ON INCORPORATED\nProducts are marketed under a number of brand names and trademarks, many of which are well known in the vehicle service and industrial markets served. Some of the major trade names and trademarks and the products and services with which they are associated include the following:\nNames\n  \nProducts and Services\nSnap-on\n  \nHand tools, power tools, tool storage products (including tool control software and hardware), diagnostics, certain equipment and related accessories, mobile tool stores, websites, electronic parts catalogs, warranty analytics solutions, business management systems and services, OEM specialty tools and equipment development and distribution, and OEM facilitation services\nATI\n  \nAircraft hand tools and machine tools\nAutoCrib\nAsset and tool control systems\nautoVHC\n  \nVehicle inspection and training services\nBAHCO\n  \nSaw blades, cutting tools, pruning tools, hand tools, power tools and tool storage, including tool control systems\nBlue-Point\n  \nHand tools, power tools, tool storage, diagnostics, certain equipment and related accessories\nCar-O-Liner\n  \nCollision repair equipment and information systems\nCartec\n  \nSafety testing, brake testers, test lane equipment, dynamometers, suspension testers, emission testers and other equipment\nCDI\n  \nTorque tools\nChallenger\n  \nVehicle lifts\nCognitran\nOEM SaaS products\nDealer-FX\nService operation solutions and OEM SaaS systems\nEcotechnics\n  \nVehicle air conditioning service equipment\nFastorq\nHydraulic torque and tensioning products\nFish and Hook\n  \nSaw blades, cutting tools, pruning tools, hand tools, power tools and tool storage\nHofmann\n  \nWheel balancers, vehicle lifts, tire changers, wheel aligners, brake testers and test lane equipment\nIrimo\n  \nSaw blades, cutting tools, hand tools, power tools and tool storage\nJohn Bean\n  \nWheel balancers, vehicle lifts, tire changers, wheel aligners, brake testers and test lane equipment\nJosam\n  \nHeavy duty alignment and collision repair solutions\nLindström\n  \nHand tools\nMitchell1\n  \nRepair and service information, shop management systems and business services\nMountz\nTorque tools\nNexiq\n  \nDiagnostic tools, information and program distributions for fleet and heavy duty equipment\nNorbar\n  \nTorque tools\nPower Hawk\nRescue tools and related equipment for military, government, fire and rescue\nPro-Cut\nBrake service equipment and accessories\nSandflex\n  \nHacksaw blades, bandsaws, saw blades, hole saws and reciprocating saw blades\nShopKey\n  \nRepair and service information, shop management systems and business services\nSioux\n  \nPower tools\nSturtevant Richmont\n  \nTorque tools\nSun\n  \nDiagnostic tools, wheel balancers, vehicle lifts, tire changers, wheel aligners, air conditioning products and emission testers\nTreadReader\nAutomotive tire drive-over ramps and handheld devices\nTruckCam\n  \nCommercial vehicle OEM factory solutions\nWilliams\n  \nHand tools, tool storage, certain equipment and related accessories\n2024 ANNUAL REPORT\n7\nFinancial Services\nSnap-on also generates revenue from various financing programs that include: (i) installment sales and lease contracts arising from franchisees’ customers and Snap-on customers who require financing for the purchase or lease of tools, diagnostics, and equipment products on an extended-term payment plan; and (ii) business and vehicle loans and leases to franchisees. The decision to finance through Snap-on or another financing source is solely by election of the customer. When assessing customers for potential financing, Snap-on considers various factors regarding ability to pay, including the customers’ financial condition, debt-servicing ability, past payment experience, and credit bureau and proprietary Snap-on credit model information, as well as the value of the underlying collateral.\nSnap-on offers financing through SOC and the company’s international finance subsidiaries in most markets where Snap-on has franchise operations. Financing revenue is recognized over the life of the underlying contracts, with interest or finance charges computed primarily on the average daily balances of the underlying contracts.\nMarkets\nSales and Distribution\nSnap-on markets and distributes its products and related services principally to professional tool and equipment users around the world. The two largest market sectors are the vehicle service and repair sector and the industrial sector.\nVehicle Service and Repair Sector\nThe vehicle service and repair sector has three main customer groups: (i) professional technicians who purchase tools, diagnostics, and equipment products for use in their work; (ii) other professional customers related to vehicle repair, including owners and managers of independent repair shops and OEM dealerships who purchase tools, diagnostics, and equipment products for use by multiple technicians within a service or repair facility; and (iii) OEMs.\nSnap-on provides innovative tool, equipment and business solutions, as well as technical sales support and training, designed to meet technicians’ evolving needs. Snap-on’s mobile tool distribution system offers technicians the convenience of purchasing quality tools at their place of business with minimal disruption of their work routine. Snap-on also provides owners and managers of repair shops, where technicians work, with tools, diagnostics, equipment, and repair and service information, including electronic parts catalogs and shop management products. Snap-on’s OEM facilitation business provides OEMs and OEM dealerships with products and services including special and essential tools as well as consulting and facilitation services, which are comprised of product procurement, distribution and administrative support for dealership equipment programs.\nThe market for vehicle service and repair is driven by an accelerating rate of technological change, car and truck population growth and increasing unit age, and the resulting effects of these changes on both our suppliers and customers. Snap-on has historically benefited from the increasing complexity of car and truck fleets and the changing tools, technologies and data needed to monitor, calibrate, service and repair evolving vehicle platforms. While new technologies, including those associated with alternative energy drivetrains and greater vehicle autonomy, may alter the nature of certain service and repair for particular vehicle types, we believe many of these new technologies provide opportunities to fulfill requirements for enhanced solutions or greater precision. Snap-on believes it is well-positioned to innovate new products to address these changing needs and to extend its leadership position in the expanding vehicle service and repair market sector.\nIndustrial Sector\nSnap-on markets its products and services globally to a broad cross-section of commercial and industrial customers, including maintenance and repair operations; manufacturing and assembly facilities; various government agencies, facilities and operations, including military operations; schools with vocational and technical programs; aviation and aerospace operations; oil and gas developers; mining operations; power generation operations, including those associated with alternative energies; equipment fabricators and operators; railroad manufacturing and maintenance; customers in agriculture; infrastructure construction companies; and other customers that require instrumentation, service tools and/or equipment for their products and business needs. The industrial sector for Snap-on focuses on providing value-added products and services to an increasingly expanding global base of customers in critical industries. \nThe industrial sector is characterized by a highly competitive environment with multiple suppliers offering either a full line or industry-specific portfolios for tools and equipment. Industrial customers increasingly require specialized solutions that provide repeatability and reliability in performing tasks of consequence that are specific to the particular end market in which they operate. Snap-on believes it is a meaningful participant in the industrial tools and equipment market sector.\n8\nSNAP-ON INCORPORATED\nDistribution Channels\nSnap-on serves customers primarily through the following channels of distribution: (i) the mobile van channel; (ii) company direct sales; (iii) distributors; and (iv) e-commerce. The following discussion summarizes Snap-on’s general approach for each channel and is not intended to be all-inclusive.\nMobile Van Channel\nIn the United States, a significant portion of sales to the vehicle service and repair sector is conducted through Snap‑on’s mobile franchise van channel. Snap-on’s franchisees primarily serve vehicle repair technicians and vehicle service shop owners, generally providing weekly contact at the customer’s place of business. Franchisees’ sales are concentrated in hand and power tools, tool storage products, shop equipment, diagnostics, and repair information products, which can be transported in a van or trailer and demonstrated during a sales call. Franchisees purchase Snap-on’s products at a discount from suggested list prices and resell them at prices established by the franchisee. U.S. franchisees are provided a list of calls that serves as the basis of the franchisee’s sales route. Snap-on’s franchisees also have the opportunity to add a limited number of additional franchises.\nSnap-on charges nominal initial and ongoing monthly franchise fees. Franchise fee revenue, including nominal, non-refundable initial and ongoing monthly fees (primarily for sales and business training, marketing and product promotion programs, and technology support), is recognized as the fees are earned. Franchise fee revenue totaled $19.4 million, $18.7 million and $18.4 million in fiscal 2024, 2023 and 2022, respectively.\nIn addition to its mobile van channel in the United States, Snap-on has franchise distribution models in certain other countries, including Canada, the United Kingdom, Japan, Australia, Germany, Netherlands, South Africa, New Zealand, Belgium and Ireland. In many of these markets, as in the United States, purchase decisions are generally made or influenced by professional vehicle service technicians as well as repair shop owners and managers. \nSnap-on also has a company-owned route program that is designed to: (i) provide another pool of potential field organization personnel; (ii) service customers in select new and/or open routes not currently serviced by franchisees; and (iii) allow Snap‑on to pilot new sales and promotional ideas before introducing them to franchisees. As of 2024 year end, company-owned routes comprised approximately 5% of the total route population. Snap-on may elect to increase or reduce the number of company-owned routes in the future. As of 2024 year end, Snap-on’s total route count was approximately 4,700, including approximately 3,400 routes in the United States.\nThrough SOC, financing is available to U.S. franchisees, including financing for van leases, working capital loans and loans to help enable new franchisees to fund the purchase of the franchise or the expansion of an existing franchise. In many international markets, Snap-on offers a variety of financing options to its franchisees and/or customer networks through its international finance subsidiaries. The decision to finance through Snap-on or another financing source is solely at the customer’s election.\nSnap-on supports its franchisees with a field organization of regional offices, franchise performance teams, customer care centers and distribution centers. Snap-on also provides sales and business training, and marketing and product promotion programs, as well as customer and franchisee financing programs through SOC and the company’s international finance subsidiaries, all of which are designed to strengthen franchisee sales. National Franchise Advisory Councils in the United States, the United Kingdom, Canada and Australia, composed primarily of franchisees that are elected by franchisees, assist Snap-on in identifying and implementing enhancements to the franchise program.\nCompany Direct Sales\nA significant proportion of shop equipment sales in North America under the Car-O-Liner, Challenger, Hofmann, John Bean and Pro-Cut brands, diagnostic products under the Snap-on brand, and information and shop management products under the Mitchell1 and Dealer-FX brands are made by direct and independent sales forces that have responsibility for national and other accounts. As the vehicle service and repair sector consolidates (with more business conducted by national chains and franchised service centers), Snap-on believes these larger organizations can be serviced most effectively by sales people who can demonstrate and sell the full line of diagnostics, equipment, and services. Snap-on also sells these products and services directly to OEMs and their franchised dealers.\nSnap-on brand tools and equipment are marketed to industrial and governmental customers worldwide through both industrial sales associates and independent distributors. Selling activities focus on industrial customers whose main purchase criteria are quality and integrated solutions. As of 2024 year end, Snap-on had industrial sales associates and independent distributors primarily in the United States, Canada and in various European, Latin American, Middle Eastern, Asia Pacific and African countries, with the United States representing the majority of Snap-on’s total industrial sales.\n2024 ANNUAL REPORT\n9\nSnap-on also sells software, services and solutions to the automotive, commercial, heavy duty, agriculture, power equipment and power sports segments. Products and services are marketed to targeted groups, including OEMs and their dealerships, fleets and individual repair shops. To effectively reach OEMs, which frequently have a multinational presence, Snap-on has deployed focused business teams globally.\nDistributors\nSales of certain tools and equipment are made through independent distributors who purchase the items from Snap-on and resell them to end users. Hand tools marketed under the ATI, BAHCO, CDI, Fastorq, Irimo, Lindström, Mountz, Norbar, Sioux, Sturtevant Richmont and Williams brands and trade names, for example, are sold through distributors worldwide. Asset and tool control solutions are sold under the AutoCrib brand primarily through distributors worldwide. Wheel service and other vehicle service equipment are sold through distributors primarily under brands including Car-O-Liner, Challenger, Ecotechnics, Hofmann, John Bean, and Pro-Cut. Diagnostics and equipment products are marketed through distributors in South America and Asia, and through both distributors and a direct sales force in Europe under the Snap-on, Blue-Point and Sun brands.\nE-commerce\nSnap-on offers current and prospective customers online access to research and purchase products through its public website, \nwww.snapon.com\n. The site features an online catalog of Snap-on hand tools, power tools, tool storage units and diagnostic equipment available to customers in the United States, the United Kingdom, Canada and Australia. E-commerce and certain other system enhancement initiatives are designed to improve productivity and further leverage the one-on-one relationships and service Snap-on has with its current and prospective customers. Sales through the company’s e-commerce distribution channel were not significant in any of the last three years.\nCompetition\nSnap-on competes on the basis of its product quality and performance, product line breadth and depth, service, brand awareness and imagery, technological innovation and availability of financing (through SOC or its international finance subsidiaries). While Snap-on does not believe that any single company competes with it across all of its product lines and distribution channels, various companies compete in one or more product categories and/or distribution channels.\nSnap-on is a leading manufacturer and distributor of professional tools, tool storage, diagnostics, equipment products, and repair software and solutions, offering a broad line of these products to both vehicle service and industrial marketplaces. Various competitors target and sell to professional technicians in the vehicle service and repair sector through the mobile tool distribution channel. Snap-on also competes with companies that sell tools and equipment to vehicle service and repair technicians online and through retail stores, vehicle parts supply outlets and tool supply warehouses/distributorships. Within the power tools category and the industrial sector, Snap-on has various other competitors, including companies with offerings that overlap with other areas discussed herein. Major competitors selling diagnostics, shop equipment, and information to vehicle dealerships and independent repair shops include OEMs and their proprietary electronic parts catalogs and diagnostics and information systems, and other companies that offer products serving this sector.\nResources\nRaw Materials and Purchased Product\nSnap-on’s supply of raw materials, including steel, and purchased components are generally available from numerous suppliers and the company continuously works to expand and enhance supplier relationships to meet its supply needs. Snap-on believes it has secured sufficient raw materials and purchased components for the near future to meet the expected general sales demand. While the company does experience raw material and component cost fluctuations, as well as availability variations from time to time and from operation to operation, Snap-on endeavors to employ its RCI processes to improve efficiencies and reduce waste to minimize the impact of any cost increases. The company does not currently anticipate any significant impact in 2025 from raw material and purchased component cost or availability issues. \nTo date, the company has not observed any meaningful supply shortages or cost increases directly or indirectly resulting from climate change factors.\n10\nSNAP-ON INCORPORATED\nPatents, Trademarks and Other Intellectual Property\nSnap-on vigorously pursues and relies on patent protection to safeguard its intellectual property and position in its markets. As of 2024 year end, Snap-on and its subsidiaries held approximately 940 active and pending patents in the United States and approximately 3,420 active and pending patents outside of the United States. Sales relating to any single patent did not represent a material portion of Snap-on’s revenues in any of the last three years.\nExamples of products that have features or designs that benefit from patent protection include hand tools, power tools, wheel alignment systems, wheel balancers, tire changers, vehicle lifts, tool storage, tool control, collision measurement, test lane equipment, brake lathes, electronic torque instruments, emissions-sensing devices and diagnostic equipment.\nMuch of the technology used in the manufacture of vehicle service tools and equipment is in the public domain. Snap-on relies primarily on trade secret protection for proprietary processes used in manufacturing. Methods and processes are patented when appropriate. Snap-on leverages trade secret and other protections, as well as contractual arrangements and confidentiality procedures, for its proprietary software and other innovative solutions. Copyright protection is also utilized when appropriate.\nTrademarks used by Snap-on are of continuing importance in the marketplace. Trademarks have been registered in the United States and many other countries, and additional applications for trademark registrations are pending. Snap-on vigorously polices proper use of its trademarks. Snap-on’s right to manufacture and sell certain products is dependent upon licenses from others; however, these products under license do not represent a material portion of Snap-on’s net sales.\nDomain names are a valuable corporate asset for companies around the world, including Snap-on. Domain names often contain a trademark or service mark or even a corporate name and are often considered intellectual property. The recognition and value of the Snap-on name, trademark and domain name are core strengths of the company.\nSnap-on strategically licenses the Snap-on brand to carefully selected manufacturing and distribution companies for items such as apparel and a variety of other goods, in order to further build brand awareness and market presence for the company’s strongest brand.\nGovernment Regulations\nSnap-on is subject to various federal, state and local laws, such as those related to international trade, data privacy, tax and government contracts, as well as environmental laws, ordinances, regulations, and requirements of government authorities in the United States and other nations. At Snap-on, environmental liabilities are managed through the Snap-on Environmental, Health and Safety Management System (“EH & SMS”), which is applied worldwide. The system is based upon continual improvement and is certified to ISO 9001:2015, ISO 14001:2015 and ISO 45001:2018, verified through Det Norske Veritas (DNV) Certification, Inc.\nSnap-on believes that it complies with applicable environmental and government requirements in its operations. Expenditures on environmental and governmental matters through EH & SMS have not had a material effect upon Snap-on’s capital expenditures, earnings or competitive position. However, the increasing global focus on climate change is resulting in new and/or more stringent environmental or climate-related regulations or standards. While such regulations have historically created select opportunities for our business operations, the company continually monitors developments in this area.\nHuman Capital Management\nAs of December 28, 2024, Snap-on employed approximately 13,000 people worldwide, of which approximately 7,300 were employed in the United States and approximately 5,700 were outside the United States.  Recently filed EEO-1 data is available under “ESG Reporting” in the “Investors” section of the company’s website at \nwww.snapon.com\n. Additionally, on a global basis, approximately 2,300 employees are represented by unions and/or covered under collective bargaining agreements with varying expiration dates through 2027. In recent years, Snap-on has not experienced any significant work slowdowns, stoppages or other labor disruptions. \nSnap-on is guided by the beliefs and values in the company’s “Who We Are” mission statement and strives to be the “employer of choice” for its current and future associates. Our “Who We Are” beliefs serve as the guidepost against which we evaluate performance in operating reviews throughout the company. Furthermore, through our Snap-on Value Creation Processes, a suite of principles we use every day, the company remains committed to the areas of safety, quality, customer connection, innovation and RCI, which are closely linked to and contribute to improving employee engagement, productivity, and efficiency. \n2024 ANNUAL REPORT\n11\nSuccessful execution of our way forward is dependent on attracting, developing and retaining key employees and members of our management team, which we achieve through the following:\n•\nSnap-on believes strongly in workplace safety. As a permanent priority agenda item at all operational meetings, safety comes first. Snap-on strives to maintain a safe workplace and expects its employees to broadly embrace the company’s safety programs. Snap-on invests in its strong safety culture and in elevating the importance of worker safety throughout all levels of the organization. For 2024, Snap-on had an overall safety incident rate of\n \n1.08\n (nu\nmber of injuries and illnesses multiplied by 200,000, divided by hours worked).\n•\nSnap-on is committed to its employees and provides developmental opportunities throughout the organization. Leadership reviews to identify high potential talent in the organization are conducted on an ongoing basis with all business units and on an annual basis with the Board of Directors. Snap-on offers competitive compensation and benefits to its employees, including performance-based and stock-based management incentive plans, an employee stock purchase plan for associates in the U.S. and Canada, as well as pension plans covering most U.S. employees and certain employees in foreign countries. Additional information related to these plans is included in Notes 11 and 13 to the Consolidated Financial Statements. Other benefits, including skill training and tuition assistance programs, are available to employees, but vary from location to location.\n•\nSnap-on is committed to providing equal opportunities across all of our stakeholders and the company does not tolerate discrimination. To further our support of makers and fixers, both within and outside our company, Snap-on is partnering with national nonprofit organizations and community colleges to leverage career and technical education to expand the opportunities in our facilities, as well as in the critical industries we serve and beyond, for people from all walks of life.\n•\nSnap-on’s people and the behaviors they display define our success, including integrity, respect and teamwork. Annual employee training is used to reinforce ethics, environmental matters, health and safety, human rights, informatio\nn/cyber security\n and regulatory compliance, which includes anti-corruption training for all relevant employees.\n \nSocial Responsibility and Sustainability Commitment\nSnap-on is deeply dedicated to honoring and celebrating the dignity of work. The company supports upskilling the workforce through collaborations with Career and Technical Education (CTE) schools across the United States and throughout the world, and with SkillsUSA and World Skills to engage youth in order to enable and promote technical careers. Additionally, the company is a founding partner of the National Coalition of Certification Centers (NC3), which aims to more effectively match technical school curricula with the precise needs of the current and future workplace by developing, implementing, and sustaining industry-recognized certifications with programs in automotive, aviation, energy, oil and gas, manufacturing and other critical industries. To date, over 350,000 students have earned Snap-on certifications, preparing them for successful and satisfying careers across various technical disciplines. \nSnap-on is committed to conducting business and making decisions honestly, ethically, fairly and within the law, and is guided by the company’s “Who We Are” mission statement, which is translated into multiple languages and prominently displayed in its facilities around the world. Snap-on is dedicated to earning and keeping the trust and confidence of its shareholders, customers, franchisees, distributors, retirees and associates, as well as of the communities where the company does business. Snap-on’s Code of Business Conduct and Ethics provides guidelines and a framework for conducting business in an ethical manner. These beliefs go beyond Snap-on and are expected of suppliers as detailed in the company’s Supplier Code of Conduct. Snap-on has adopted policies that seek to eliminate human trafficking, slavery, forced labor and child labor from its global supply chain, and has formalized its commitment to protecting human rights in the company’s Human Rights Policy.\nSnap-on prioritizes continuous improvement in all facets of its operations, including environmental matters and health and safety. The company strives to protect environmental quality and human welfare in its workplaces and in its communities by implementing sound policies designed to prevent, mitigate and reduce the company’s impact on the environment. The company has voluntarily reported Scope 1 and Scope 2 greenhouse gas (“GHG”) emissions to the CDP (formerly known as the Carbon Disclosure Project) on an annual basis since 2008. In\n 2024\n, the company’s total Scope 1 and Scope 2 GHG emissions of 89,085 metric tons of carbon dioxide equivalent (“CO2e”) reflected an intensity of 18.9 (metric tons of CO2e, divided by net sales in millions).\n12\nSNAP-ON INCORPORATED\nSnap-on’s sustainability framework is focused on key areas impacting our industry, including energy management, employee health and safety, and material management, and is aligned with the principles of the International Financial Reporting Standards Foundation (formerly known as the Sustainability Accounting Standards Board or “SASB”), which has been consolidated into the International Financial Reporting Standards Foundation. Snap-on’s SASB Index is available under “ESG Reporting” in the “Investors” section of the company’s website at \nwww.snapon.com\n. \nFeedback on the evaluation of risks and/or opportunities related to ESG matters identified by the company’s internal Environmental, Social and Governance Committee (the “ESGC”) and by the company’s operating units is included and discussed as part of the company’s quarterly operations reviews with senior management. The ESGC reports to the company’s Chief Executive Officer and updates the Corporate Governance and Nominating Committee about its plans and actions at least two times per year. The full Board has ultimate oversight of the company’s strategy related to ESG matters and receives regular reports on the subject from the Corporate Governance and Nominating Committee.\nAdditional information regarding the company’s sustainability commitment is available in the “Investors” section of the company’s website at \nwww.snapon.com\n.\nCustomers and Seasonality\nSnap-on does not have any single customer or government on which its business was substantially dependent in any of the indicated periods. Most of Snap-on’s businesses are not seasonal and their inventory needs are relatively constant.",
  "item7": "Item 7: Management’s Discussion and Analysis of Financial Condition and Results of Operations\nManagement Overview\nWe believe our 2024 operating performance demonstrates the possibilities for growth across our businesses, confirms the special resilience of our markets, and reflects the considerable capability of our combined operations and our experienced team to prevail in the difficulties of the current macroeconomic environment. Throughout the uncertainty, we maintained and further extended our ongoing advantages in our products, in our brands and in our people. At the same time, we leveraged existing proficiencies to focus on expanding our professional customer base, not only in automotive repair, but in adjacent markets, additional geographies and other areas, including critical industries, where the cost and penalties for failure can be high. Snap‑on’s value proposition of making work easier for serious professionals is an ongoing strength as we proceed along our strategic runways for coherent growth:\n•\nEnhancing the franchise network, where we continued to focus on helping our franchisees increase their reach through innovative selling processes and productivity initiatives that break the traditional time and space barriers inherent in a mobile van;\n•\nExpanding with repair shop owners and managers, where we continued to make progress in connecting with customers and translating the resulting insights into innovation that solves specific challenges in the repair facility;\n•\nFurther extending to critical industries, where we continued to grow our lines of products customized for specific industries, including through further integration of acquisitions; and\n•\nBuilding in emerging markets, where we continued to maintain manufacturing capacity, as well as refine product lines and distribution capabilities.\nOur strategic priorities and plans for \n2025\n also involve continuing to build on our Snap-on Value Creation Processes – our suite of strategic principles and processes we employ every day designed to create value, and employed in the areas of safety, quality, customer connection, innovation and Rapid Continuous Improvement (“RCI”). We expect to continue to deploy these processes in our existing operations as well as into our recently acquired businesses.\nSnap-on’s RCI initiatives employ a structured set of tools and processes across multiple businesses and geographies intended to eliminate waste and improve operations. Savings from Snap-on’s RCI initiatives reflect benefits from a wide variety of ongoing efficiency, productivity and process improvements, including savings generated from product design cost reductions, improved manufacturing line set-up and change-over practices, lower-cost sourcing initiatives and facility consolidations. Unless individually significant, it is not practicable to disclose each RCI activity that generated savings and/or segregate RCI savings embedded in sales volume increases.\nOur global financial services operations continue to serve a significant strategic role in offering financing options to our franchisees, to their customers, and to customers in other parts of our business. We expect that our global financial services business, which includes both Snap-on Credit LLC (“SOC”) in the United States and our other international finance subsidiaries, will continue to be a meaningful contributor to our operating earnings going forward.\nSnap-on has significant international operations and is subject to risks inherent with foreign operations, including foreign currency translation fluctuations. \nRecent Acquisitions\nOn November 20, 2023, Snap-on acquired certain assets of SAVTEQ, Inc. (“SAVTEQ”) for a cash purchase price of $3.0 million. SAVTEQ, based in Lexington, Kentucky, provides precise non-contact measuring capabilities that Snap-on is leveraging in its product offerings.\nOn November 1, 2023, Snap-on acquired Mountz, Inc. (“Mountz”) for a cash purchase price of $39.6 million. Mountz, based in San Jose, California, is a leading developer, manufacturer and marketer of high-precision torque tools, including measurement, calibration and documentation products. The acquisition of Mountz has complemented and expanded Snap-on’s torque offerings to customers in a variety of critical industries including aerospace, transportation and advanced manufacturing.\nFor segment reporting purposes, the results o\nf operations and assets of SAVTEQ have been included in the Repair Systems & Information Group and those of Mountz have been included in the Commercial & Industrial Group since the respective acquisition dates.\nPro forma financial information has not been presented \nfor these acquisitions as t\nhe net effects, individually and collectively, were neither significant nor material to Snap-on’s results of operations or financial position. \n28\nSNAP-ON INCORPORATED\nFiscal Year\nSnap-on’s fiscal year ends on the Saturday that is on or nearest to December 31. Unless otherwise indicated, references in this document to “fiscal 2024” or “2024” refer to the fiscal year ended December 28, 2024; references to “fiscal 2023” or “2023” refer to the fiscal year ended December 30, 2023; and references to “fiscal 2022” or “2022” refer to the fiscal year ended December 31, 2022. References in this document to 2024, 2023 and 2022 year end refer to December 28, 2024, December 30, 2023, and December 31, 2022, respectively. Snap-on’s 2024, 2023 and 2022 fiscal years each contained 52 weeks of operating results. \nFiscal 2023 as Compared to Fiscal 2022\nA discussion regarding our financial condition and results of operations for fiscal 2023 compared to fiscal 2022 can be found under “Part II, Item 7: Management’s Discussion and Analysis of Financial Condition and Results of Operations,” in our Annual Report on the Form 10-K for the fiscal year ended December 30, 2023, which was filed with the SEC on February 16, 2024, and is available on the SEC’s website at \nwww.sec.gov\n as well as in the “Investors” section of our website at \nwww.snapon.com\n.\nNon-GAAP Measures\nReferences in Management’s Discussion and Analysis of Financial Condition and Results of Operations to “organic sales” refer to sales from continuing operations calculated in accordance with GAAP, adjusted to exclude acquisition-related sales and the impact of foreign currency translation. Management evaluates the company’s sales performance based on organic sales growth, which primarily reflects growth from the company’s existing businesses as a result of increased output, expanded customer base, geographic expansion, new product development and pricing changes, and excludes sales contributions from acquired operations the company did not own as of the comparable prior-year reporting period. Organic sales also exclude the effects of foreign currency translation as foreign currency translation is subject to volatility that can obscure underlying business trends. Management believes that the non-GAAP financial measure of organic sales is meaningful to investors as it provides them with useful information to aid in identifying underlying growth trends in the company’s businesses and facilitates comparisons of its sales performance with prior periods.\nSummary of Consolidated Performance \nConsolidated\n net sales of $4,707.4 million in 2024 represented a decrease of $22.8 million, or 0.5%, from 2023 levels, reflecting a $40.6 million, or 0.9%, organic decline and $5.5 million of unfavorable foreign currency translation, partially offset by $23.3 million of acquisition-related sales.\nOperating earnings before financial services of $1,068.8 million in 2024, including \na $22.5 million benefit for the final payments associated with a legal matter, which were received in the first six months of 2024 (the “legal payments”),\n compared to $1,039.9 million in 2023. As a percentage of net sales, operating earnings before financial services were 22.7% compared to 22.0% last year.\nOperating earnings of $1,345.7 million in 2024, including a $22.5 million benefit from the legal payments, compared to $1,310.4 million in 2023.  As a percentage of revenues (net sales plus financial services revenue), operating earnings were 26.3% compared to 25.7% last year.\nNet earnings attributable to Snap-on of $1,043.9 million, or $19.51 per diluted share, in 2024, \nincluding a $17.5 million, or $0.32 per diluted share, after-tax benefit from the legal payments,\n compared to $1,011.1 million, or $18.76 per diluted share, in 2023, an increase of $32.8 million or $0.75 per diluted share.\n2024 ANNUAL REPORT\n29\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nSummary of Segment Performance\nThe \nCommercial & Industrial Group\n consists of business operations serving a broad range of industrial and commercial customers worldwide, including customers in the aerospace, natural resources, government and military, power generation, transportation, and technical education market segments (collectively, “critical industries”), primarily through direct and distributor channels. Segment net sales of $1,476.8 million in 2024 represented an increase of $18.5 million, or 1.3%, from 2023 levels, reflecting a $1.5 million, or 0.1%, organic gain and $23.3 million of acquisition-related sales, partially offset by $6.3 million of unfavorable foreign currency translation. The organic increase primarily reflects a mid single-digit gain in sales to customers in critical industries, partially offset by a double-digit reduction in the power tools operation and a low single-digit decline in the European-based hand tools business. Segment operating earnings of $242.1 million in 2024 compared to $226.1 million in 2023, an increase of $16.0 million or 7.1%.\nThe Commercial & Industrial Group intends to focus on the following strategic priorities in 2025: \n•\nExpanding our business with existing customers and reaching new customers in critical industries and other market segments;\n•\nLeveraging our investments in emerging markets to support growth initiatives;\n•\nBroadening our product offering designed particularly for critical industry segments;\n•\nIncreasing our customer-connection-driven understanding of work across multiple industries;\n•\nInvesting in innovation that, guided by that understanding of work, delivers an ongoing stream of productivity-enhancing custom-engineered solutions; and\n•\nContinuing to reduce structural and operating costs, as well as improve efficiencies, through RCI initiatives.\nThe \nSnap-on Tools Group\n consists of business operations primarily serving vehicle service and repair technicians through the company’s multinational mobile tool distribution channel. Segment net sales of $1,989.2 million in 2024 represented a decrease of $99.6 million, or 4.8%, from 2023 levels, reflecting a $100.9 million, or 4.8%, organic sales decline, partially offset by $1.3 million of favorable foreign currency translation. \nThe organic decrease is due to a mid single-digit decline in the U.S., partially offset by a low single-digit gain in the segment’s international operations. Segment o\nperating earnings of $447.3 million in 2024 compared to $493.8 million in 2023, a decrease of $46.5 million or 9.4%.\nThe Snap-on Tools Group intends to focus on the following strategic priorities in 2025:\n•\nEnhancing franchisee sales productivity, profitability, commercial health, and satisfaction;\n•\nDeveloping new programs and products to match current technician preferences, reaching new customers and increasing penetration with existing customers;\n•\nExpanding investment in new product innovation and development; and\n•\nImproving customer service levels and productivity in back office support functions, manufacturing and the supply chain through RCI initiatives and capacity investment.\nThe \nRepair Systems &\n \nInformation Group\n consists of business operations serving other professional vehicle repair customers worldwide, primarily owners and managers of independent repair shops and OEM dealership service and repair shops (“OEM dealerships”) through direct and distributor channels. Segment net sales of $1,797.9 million in 2024 represented an increase of $16.7 million, or 0.9%, from 2023 levels, reflecting an $18.1 million, or 1.0%, organic sales gain, partially offset by $1.4 million of unfavorable foreign currency translation. \nThe organic improvement primarily reflects a mid single-digit increase in activity with OEM dealerships, partially offset by a low single-digit decline in sales of undercar equipment. Segment o\nperating earnings of $455.2 million in 2024 compared to $433.2 million in 2023, an increase of $22.0 million or 5.1%. \nThe Repair Systems & Information Group intends to focus on the following strategic priorities in 2025:\n•\nExpanding the product offering with new products and services, thereby providing more to sell to repair shop owners and managers;\n•\nContinuing software and hardware upgrades to further improve functionality, performance and efficiency;\n•\nFurther building our proprietary databases to enhance software solutions;\n•\nAdvancing productivity through RCI initiatives and the optimization of resources; and\n•\nIncreasing geographic penetration, including in emerging markets.\n30\nSNAP-ON INCORPORATED\nFinancial Services \ngenerates revenue from various financing programs and is a strategic partner of the company’s mobile franchise van channel. Financial services revenue of \n$401.0 million\n in 2024 compared to \n$378.1 million\n in 2023. Originations of $1,182.9 million in 2024 represented a decrease of $52.6 million, or 4.3%, from 2023 levels. Operating earnings from financial services of $276.9 million in 2024 compared to $270.5 million last year.\nFinancial Services intends to focus on the following strategic priorities in\n 2025:\n•\nDelivering financial products and services that attract and sustain profitable franchisees and support Snap‑on’s strategies for expanding market coverage and penetration;\n•\nImproving productivity levels and ensuring high quality in all financial products and processes through the use of RCI initiatives; and\n•\nMaintaining healthy portfolio performance levels.\nCash Flows\nNet cash provided by operating activities of $1,217.5 million in 2024 compared to $1,154.2 million in 2023. The $63.3 million increase is primarily due to a $34.3 million increase in net earnings and a $18.0 million change in net operating assets and liabilities.\nNet cash used by investing activities of $204.1 million in 2024 included additions to finance receivables of $966.0 million, which were partially offset by collections of $837.8 million. Net cash used by investing activities of $331.8 million in 2023 included additions to finance receivables of $1,029.0 million, partially offset by collections of $833.5 million, as well as $42.6 million of cash used for acquisitions. Capital expenditures in 2024 and 2023 totaled $83.5 million and $95.0 million, respectively. Capital expenditures in both years included continued investments related to the company’s execution of its strategic growth initiatives and Value Creation Processes around safety, quality, customer connection, innovation and RCI.\nNet cash used by financing activities of $649.8 million in 2024 included $406.4 million for dividend payments to shareholders, $290.0 million for the repurchase of 952,000 shares of Snap-on’s common stock, and net repayments of other short-term borrowings of $1.3 million. These amounts were partially offset by $92.3 million of proceeds from stock purchase plans and stock option exercises. Net cash used by financing activities of $572.9 million in 2023 included $355.6 million for dividend payments to shareholders, $294.7 million for the repurchase of 1,126,000 shares of Snap-on’s common stock, and net repayments of other short-term borrowings of $1.7 million. These amounts were partially offset by $113.6 million of proceeds from stock purchase plans and stock option exercises.\n2024 ANNUAL REPORT\n31\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nResults of Operations\n2024 vs. 2023\nResults of operations for 2024 and 2023 are as follows:\n(Amounts in millions)\n2024\n2023\nChange\nNet sales\n$\n4,707.4 \n100.0 \n%\n$\n4,730.2 \n100.0 \n%\n$\n(22.8)\n(0.5)\n%\nCost of goods sold\n(2,329.5)\n(49.5)\n%\n(2,381.1)\n(50.3)\n%\n51.6 \n2.2 \n%\nGross profit\n2,377.9 \n50.5 \n%\n2,349.1 \n49.7 \n%\n28.8 \n1.2 \n%\nOperating expenses\n(1,309.1)\n(27.8)\n%\n(1,309.2)\n(27.7)\n%\n0.1 \n— \nOperating earnings before financial services\n1,068.8 \n22.7 \n%\n1,039.9 \n22.0 \n%\n28.9 \n2.8 \n%\nFinancial services revenue\n401.0 \n100.0 \n%\n378.1 \n100.0 \n%\n22.9 \n6.1 \n%\nFinancial services expenses\n(124.1)\n(30.9)\n%\n(107.6)\n(28.5)\n%\n(16.5)\n(15.3)\n%\nOperating earnings from financial services\n276.9 \n69.1 \n%\n270.5 \n71.5 \n%\n6.4 \n2.4 \n%\nOperating earnings\n1,345.7 \n26.3 \n%\n1,310.4 \n25.7 \n%\n35.3 \n2.7 \n%\nInterest expense\n(49.6)\n(0.9)\n%\n(49.9)\n(1.0)\n%\n0.3 \n0.6 \n%\nOther income (expense) – net\n77.0 \n1.5 \n%\n67.5 \n1.3 \n%\n9.5 \n14.1 \n%\nEarnings before income taxes\n1,373.1 \n26.9 \n%\n1,328.0 \n26.0 \n%\n45.1 \n3.4 \n%\nIncome tax expense\n(304.2)\n(6.0)\n%\n(293.4)\n(5.7)\n%\n(10.8)\n(3.7)\n%\nNet earnings\n1,068.9 \n20.9 \n%\n1,034.6 \n20.3 \n%\n34.3 \n3.3 \n%\nNet earnings attributable to noncontrolling interests\n(25.0)\n(0.5)\n%\n(23.5)\n(0.5)\n%\n(1.5)\n(6.4)\n%\nNet earnings attributable to Snap-on Inc.\n$\n1,043.9 \n20.4 \n%\n$\n1,011.1 \n19.8 \n%\n$\n32.8 \n3.2 \n%\nPercentage Disclosure: All income statement line item percentages below “Operating earnings from financial services” are calculated as a percentage of the sum of Net sales and Financial services revenue.\nNet sales of $4,707.4 million in 2024 represented a decrease of $22.8 million, or 0.5%, from \n2023\n levels, reflecting a $40.6 million, or 0.9%, organic decline and $5.5 million of unfavorable foreign currency translation, partially offset by $23.3 million of acquisition-related sales.\nGross profit of $2,377.9 million in 2024 compared to $2,349.1 million last year, an increase of $28.8 million or 1.2%. Gross margin (gross profit as a percentage of net sales) improved 80 basis points (100 basis points (“bps”) equals 1.0 percent) from \n2023\n primarily due to benefits from the company’s RCI initiatives, increased sales in higher-gross-margin businesses, and lower material and other costs.  \nOperating expenses of $1,309.1 million in 2024, including a $22.5 million benefit from the legal payments, compared to $1,309.2 million last year\n. \nOperating expenses as a percentage of net sales rose 10 bps from last year primarily reflecting the effects of lower sales volumes, partially offset by benefits from the legal payments.\nOperating earnings before financial services of $1,068.8 million in 2024, including a $22.5 million benefit from the legal payments, compared to $1,039.9 million in \n2023.  \nAs a percentage of net sales, operating earnings before financial services were 22.7% compared to 22.0% last year. \nFinancial services revenue of $401.0 million in 2024 compared to $378.1 million last year. Financial services operating earnings of $276.9 million in 2024 compared to $270.5 million in \n2023\n. \nOperating earnings of $1,345.7 million in 2024, including a $22.5 million benefit from the legal payments, compared to $1,310.4 million in \n2023.  \nAs a percentage of revenues, operating earnings were 26.3% compared to 25.7% last year.\nInterest expense in 2024 decreased $0.3 million compared to last year. See Note 9 to the Consolidated Financial Statements for additional information on debt and credit facilities.\n32\nSNAP-ON INCORPORATED\nOther income (expense) – net primarily includes interest income, non-service components of net periodic benefit costs, and net gains and losses associated with hedging and currency exchange rate transactions. See Note 17 to the Consolidated Financial Statements for additional information on Other income (expense) – net.\nThe effective income tax rate on earnings attributable to Snap-on was 22.6% in 2024 and 22.5% in 2023. See Note 8 to the Consolidated Financial Statements for additional information on income taxes.\nNet earnings attributable to Snap-on of $1,043.9 million, or $19.51 per diluted share, in 2024, including a $17.5 million, or $0.32 per diluted share, after-tax benefit from the legal payments, compared to $1,011.1 million, or $18.76 per diluted share, in 2023, an \nincrease of $32.8 million or $0.75 per diluted share.\nSegment Results\nSnap-on’s operating segments are based on the organization structure used by management for making operating and investment decisions and for assessing performance. Snap-on’s reportable operating segments are: (i) the Commercial & Industrial Group; (ii) the Snap-on Tools Group; (iii) the Repair Systems & Information Group; and (iv) Financial Services. The Commercial & Industrial Group consists of business operations serving a broad range of industrial and commercial customers worldwide, including customers in the aerospace, natural resources, government and military, power generation, transportation and technical education market segments, primarily through direct and distributor channels. The Snap-on Tools Group consists of business operations primarily serving vehicle service and repair technicians through the company’s multinational mobile tool distribution channel. The Repair Systems & Information Group consists of business operations serving other professional vehicle repair customers worldwide, primarily owners and managers of independent repair shops and OEM dealerships, through direct and distributor channels. Financial Services consists of the business operations of Snap-on’s finance subsidiaries.\nSnap-on evaluates the performance of the Commercial & Industrial Group, the Snap-on Tools Group and the Repair Systems & Information Group operating segments based on segment net sales and segment operating earnings. The Snap-on Tools Group segment net sales reflect external net sales, while the Commercial & Industrial Group and the Repair Systems & Information Group segment net sales include both external and intersegment net sales. Snap-on accounts for intersegment net sales and transfers based primarily on standard costs with reasonable mark-ups established between the segments. The Financial Services operating segment is evaluated based on financial services revenue and segment operating earnings. Corporate expenses primarily reflect stock-based compensation and other costs not attributable to an operating segment. Intersegment amounts are eliminated to arrive at Snap-on’s consolidated financial results.\nCommercial & Industrial Group\n(Amounts in millions)\n2024\n2023\nChange\nExternal net sales\n$\n1,187.6 \n80.4 \n%\n$\n1,145.6 \n78.6 \n%\n$\n42.0 \n3.7 \n%\nIntersegment net sales\n289.2 \n19.6 \n%\n312.7 \n21.4 \n%\n(23.5)\n(7.5)\n%\nSegment net sales\n1,476.8 \n100.0 \n%\n1,458.3 \n100.0 \n%\n18.5 \n1.3 \n%\nSegment cost of goods sold\n(868.6)\n(58.8)\n%\n(887.5)\n(60.9)\n%\n18.9 \n2.1 \n%\nSegment gross profit\n608.2 \n41.2 \n%\n570.8 \n39.1 \n%\n37.4 \n6.6 \n%\nSegment operating expenses\n(366.1)\n(24.8)\n%\n(344.7)\n(23.6)\n%\n(21.4)\n(6.2)\n%\nSegment operating earnings\n$\n242.1 \n16.4 \n%\n$\n226.1 \n15.5 \n%\n$\n16.0 \n7.1 \n%\nSegment net sales of $1,476.8 million in 2024 represented an increase of $18.5 million, or 1.3%, from 2023 levels, reflecting a $1.5 million, or 0.1%, organic gain and $23.3 million of acquisition-related sales, partially offset by $6.3 million of unfavorable foreign currency translation. \nThe organic increase is primarily due to a mid single-digit gain in sales to customers in critical industries, partially offset by a double-digit reduction in the power tools operation and a low single-digit decline in the European-based hand tools business.\nSegment gross margin in 2024 improved 210 bps from last year, primarily reflecting increased sales volumes in higher-gross-margin critical industry sectors, savings from the segment’s RCI initiatives, lower material and other costs, and 40 bps of benefits from acquisitions. \nSegment operating expenses as a percentage of net sales in 2024 rose 120 bps as compared to \n2023 primarily due to increased personnel and other costs, and a 50 bps impact from acquisitions.\n2024 ANNUAL REPORT\n33\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nAs a result of these factors, segment operating earnings of $242.1 million in 2024 compared to $226.1 million in 2023, an increase of $16.0 million or 7.1%. Segment operating margin (segment operating earnings as a percentage of segment net sales) for the Commercial & Industrial Group of 16.4% in 2024 compared to 15.5% last year.\nSnap-on Tools Group\n(Amounts in millions)\n2024\n2023\nChange\nSegment net sales\n$\n1,989.2 \n100.0 \n%\n$\n2,088.8 \n100.0 \n%\n$\n(99.6)\n(4.8)\n%\nSegment cost of goods sold\n(1,050.3)\n(52.8)\n%\n(1,107.7)\n(53.0)\n%\n57.4 \n5.2 \n%\nSegment gross profit\n938.9 \n47.2 \n%\n981.1 \n47.0 \n%\n(42.2)\n(4.3)\n%\nSegment operating expenses\n(491.6)\n(24.7)\n%\n(487.3)\n(23.4)\n%\n(4.3)\n(0.9)\n%\nSegment operating earnings\n$\n447.3 \n22.5 \n%\n$\n493.8 \n23.6 \n%\n$\n(46.5)\n(9.4)\n%\nSegment net sales of $1,989.2 million in 2024 represented a decrease of $99.6 million, or 4.8%, from \n2023\n levels, reflecting a $100.9 million, or 4.8%, organic sales decline, partially offset by $1.3 million of favorable foreign currency translation. The organic decrease is due to a mid single-digit decline in the U.S., partially offset by a low single-digit gain in the segment’s international operations.\nSegment gross margin in 2024 improved 20 bps from last year primarily reflecting decreased sales of lower-gross-margin products.\nSegment operating expenses as a percentage of net sales in 2024 rose 130 bps from last year primarily due to the lower sales volumes.\nAs a result of these factors, segment operating earnings of $447.3 million in 2024 compared to $493.8 million in 2023, a decrease of $46.5 million or 9.4%. Operating margin for the \nSnap‑on\n Tools Group of 22.5% in 2024 compared to 23.6% last year.\nRepair Systems & Information Group \n(Amounts in millions)\n2024\n2023\nChange\nExternal net sales\n$\n1,530.6 \n85.1 \n%\n$\n1,495.8 \n84.0 \n%\n$\n34.8 \n2.3 \n%\nIntersegment net sales\n267.3 \n14.9 \n%\n285.4 \n16.0 \n%\n(18.1)\n(6.3)\n%\nSegment net sales\n1,797.9 \n100.0 \n%\n1,781.2 \n100.0 \n%\n16.7 \n0.9 \n%\nSegment cost of goods sold\n(967.1)\n(53.8)\n%\n(984.0)\n(55.2)\n%\n16.9 \n1.7 \n%\nSegment gross profit\n830.8 \n46.2 \n%\n797.2 \n44.8 \n%\n33.6 \n4.2 \n%\nSegment operating expenses\n(375.6)\n(20.9)\n%\n(364.0)\n(20.5)\n%\n(11.6)\n(3.2)\n%\nSegment operating earnings\n$\n455.2 \n25.3 \n%\n$\n433.2 \n24.3 \n%\n$\n22.0 \n5.1 \n%\nSegment net sales of $1,797.9 million in 2024 represented an increase of $16.7 million, or 0.9%, from 2023 levels, reflecting an $18.1 million, or 1.0%, organic sales gain, partially offset by $1.4 million of unfavorable foreign currency translation. The organic improvement primarily reflects a mid single-digit increase in activity with OEM dealerships, partially offset by a low single-digit decline in sales of undercar equipment.\nSegment gross margin in 2024 improved 140 bps from last year primarily due to increased sales of higher-gross-margin products and savings from the segment’s RCI initiatives.\nSegment operating expenses as a percentage of net sales in 2024 rose 40 bps from \n2023 \nprimarily reflecting increased personnel and other costs.\nAs a result of these factors, segment operating earnings of $455.2 million in 2024 compared to $433.2 million in 2023, an increase of $22.0 million or 5.1%. Operating margin for the Repair Systems & Information Group of 25.3% in 2024 compared to 24.3% last year.\n34\nSNAP-ON INCORPORATED\nFinancial Services\n(Amounts in millions)\n2024\n2023\nChange\nFinancial services revenue\n$\n401.0 \n100.0 \n%\n$\n378.1 \n100.0 \n%\n$\n22.9 \n6.1 \n%\nFinancial services expenses\n(124.1)\n(30.9)\n%\n(107.6)\n(28.5)\n%\n(16.5)\n(15.3)\n%\nSegment operating earnings\n$\n276.9 \n69.1 \n%\n$\n270.5 \n71.5 \n%\n$\n6.4 \n2.4 \n%\nFinancial services revenue is generally dependent on the size of the average financial services portfolio during the period, as well as on the average yield on receivables. Financial services revenue of $401.0 million in 2024 represented an increase of $22.9 million, or 6.1%, from \n2023\n. \nIn both 2024 and 2023, the average yield on finance receivables was 17.7%. In 2024 and \n2023\n, the average yields on contract receivables were 9.0% and \n8.8%\n, respectively. Originations of $1,182.9 million in 2024 represented a decrease of $52.6 million, or 4.3%, from 2023 levels.\nFinancial services expenses primarily include personnel-related and other general and administrative costs, as well as provisions for credit losses. These expenses are generally more dependent on changes in the size of the financial services portfolio than they are on the revenue of the segment. Financial services expenses in 2024 increased primarily due to higher provisions for credit losses as compared to those recorded in 2023.  As a percentage of the average financial services portfolio, financial services expenses were 5.0% in 2024 and 4.5% in 2023.\nAs a result of these factors, segment operating earnings of \n$276.9 million\n in 2024 compared to \n$270.5 million\n in \n2023\n, an increase of $6.4 million, or 2.4%.\nSee Note 1 and Note 4 to the Consolidated Financial Statements for additional information on financial services. \nCorporate\nS\nnap-on’s general corporate expenses in 2024 of $75.8 million compared to $113.2 million recorded in \n2023\n. The year-over-year decrease primarily reflects benefits from the legal payments received in the first six months of 2024 and lower stock-based compensation costs.\nQuarterly Data\n2024 ANNUAL REPORT\n35\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\n(Amounts in millions, except per share data)\nFirst\nQuarter\nSecond\nQuarter\nThird\nQuarter\nFourth\nQuarter\nTotal\n2024\nNet sales\n$\n1,182.3 \n$\n1,179.4 \n$\n1,147.0 \n$\n1,198.7 \n$\n4,707.4 \nGross profit\n596.7 \n597.3 \n587.8 \n596.1 \n2,377.9 \nFinancial services revenue\n99.6 \n100.5 \n100.4 \n100.5 \n401.0 \nFinancial services expenses\n(31.3)\n(30.3)\n(28.7)\n(33.8)\n(124.1)\nNet earnings\n269.6 \n277.6 \n257.5 \n264.2 \n1,068.9 \nNet earnings attributable to Snap-on Incorporated\n263.5 \n271.2 \n251.1 \n258.1 \n1,043.9 \nEarnings per share – basic*\n4.99 \n5.15 \n4.77 \n4.92 \n19.85 \nEarnings per share – diluted*\n4.91 \n5.07 \n4.70 \n4.82 \n19.51 \nCash dividends paid per share\n1.86 \n1.86 \n1.86 \n2.14 \n7.72 \nFirst\nQuarter\nSecond\nQuarter\nThird\nQuarter\nFourth\nQuarter\nTotal\n2023\nNet sales\n$\n1,183.0 \n$\n1,191.3 \n$\n1,159.3 \n$\n1,196.6 \n$\n4,730.2 \nGross profit\n589.6 \n603.7 \n578.2 \n577.6 \n2,349.1 \nFinancial services revenue\n92.6 \n93.4 \n94.9 \n97.2 \n378.1 \nFinancial services expenses\n(26.3)\n(26.5)\n(25.5)\n(29.3)\n(107.6)\nNet earnings\n254.3 \n269.9 \n249.1 \n261.3 \n1,034.6 \nNet earnings attributable to Snap-on Incorporated\n248.7 \n264.0 \n243.1 \n255.3 \n1,011.1 \nEarnings per share – basic*\n4.69 \n4.98 \n4.60 \n4.84 \n19.11 \nEarnings per share – diluted*\n4.60 \n4.89 \n4.51 \n4.75 \n18.76 \nCash dividends paid per share\n1.62 \n1.62 \n1.62 \n1.86 \n6.72 \n*\nAmounts may not total to annual earnings per share because each quarter and year are calculated separately based on basic and diluted weighted-average common shares outstanding during each respective period.\n36\nSNAP-ON INCORPORATED\nFourth Quarter\nResults of operations for the fourth quarters of 2024 and 2023 are as follows:\n \nFourth Quarter\n \n(Amounts in millions)\n2024\n2023\nChange\nNet sales\n$\n1,198.7 \n100.0 \n%\n$\n1,196.6 \n100.0 \n%\n$\n2.1 \n0.2 \n%\nCost of goods sold\n(602.6)\n(50.3)\n%\n(619.0)\n(51.7)\n%\n16.4 \n2.6 \n%\nGross profit\n596.1 \n49.7 \n%\n577.6 \n48.3 \n%\n18.5 \n3.2 \n%\nOperating expenses\n(330.9)\n(27.6)\n%\n(319.7)\n(26.7)\n%\n(11.2)\n(3.5)\n%\nOperating earnings before financial services\n265.2 \n22.1 \n%\n257.9 \n21.6 \n%\n7.3 \n2.8 \n%\nFinancial services revenue\n100.5 \n100.0 \n%\n97.2 \n100.0 \n%\n3.3 \n3.4 \n%\nFinancial services expenses\n(33.8)\n(33.6)\n%\n(29.3)\n(30.1)\n%\n(4.5)\n(15.4)\n%\nOperating earnings from financial services\n66.7 \n66.4 \n%\n67.9 \n69.9 \n%\n(1.2)\n(1.8)\n%\nOperating earnings\n331.9 \n25.5 \n%\n325.8 \n25.2 \n%\n6.1 \n1.9 \n%\nInterest expense\n(12.3)\n(0.9)\n%\n(12.5)\n(1.0)\n%\n0.2 \n1.6 \n%\nOther income (expense) – net\n19.6 \n1.5 \n%\n17.5 \n1.4 \n%\n2.1 \n12.0 \n%\nEarnings before income taxes\n339.2 \n26.1 \n%\n330.8 \n25.6 \n%\n8.4 \n2.5 \n%\nIncome tax expense\n(75.0)\n(5.8)\n%\n(69.5)\n(5.4)\n%\n(5.5)\n(7.9)\n%\nNet earnings\n264.2 \n20.3 \n%\n261.3 \n20.2 \n%\n2.9 \n1.1 \n%\nNet earnings attributable to noncontrolling interests\n(6.1)\n(0.4)\n%\n(6.0)\n(0.5)\n%\n(0.1)\n(1.7)\n%\nNet earnings attributable to Snap-on Inc.\n$\n258.1 \n19.9 \n%\n$\n255.3 \n19.7 \n%\n$\n2.8 \n1.1 \n%\nPercentage Disclosure: All income statement line item percentages below “Operating earnings from financial services” are calculated as a percentage of the sum of Net sales and Financial services revenue.\nNet sales of $1,198.7 million in the fourth quarter of 2024 represented an increase of $2.1 million, or 0.2%, from \n2023\n levels, reflecting a $2.0 million, or 0.2%, organic gain and $2.1 million of acquisition-related sales, partially offset by $2.0 million of unfavorable foreign currency translation.\nGross profit of $596.1 million in the fourth quarter of 2024 compared to $577.6 million last year, an increase of \n$18.5 million\n or \n3.2%\n. Gross margin in the quarter improved 140 bps from the fourth quarter of \n2023\n primarily due to increased sales in higher-gross-margin businesses and benefits from the company’s RCI initiatives.\nOperating expenses of $330.9 million in the fourth quarter of 2024 compared to $319.7 million in 2023. Operating expenses as a percentage of net sales rose 90 bps from last year primarily reflecting increased corporate and other operating costs.\nOperating earnings before financial services of $265.2 million in the fourth quarter of 2024 compared to $257.9 million in \n2023, an increase of $7.3 million or 2.8%.\n As a percentage of net sales, operating earnings before financial services were 22.1% compared to 21.6% last year.\nFinancial services revenue of $100.5 million in the fourth quarter of 2024 compared to $97.2 million last year. Financial services operating earnings of $66.7 million in the period compared to $67.9 million in \n2023\n. \nOperating earnings of $331.9 million in the fourth quarter of 2024 compared to $325.8 million in 2023. As a percentage of revenues, operating earnings were 25.5% in the quarter compared to \n25.2%\n last year.\nInterest expense in the fourth quarter of 2024 decreased $0.2 million from last year\n. \nSee Note 9 to the Consolidated Financial Statements for additional information on debt and credit facilities.\nOther income (expense) – net primarily includes interest income\n, non-service components of net periodic benefit costs, and net gains and losses associated with hedging and currency exchange rate transactions. See Note 17 to the Consolidated Financial \nStatements for additional information on Other income (expense) – net.\n2024 ANNUAL REPORT\n37\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nThe effective income tax rate on earnings attributable to Snap-on in the fourth quarter was 22.5% in 2024 and 21.4% in 2023. See Note 8 to the Consolidated Financial Statements for additional information on income taxes.\nNet earnings attributable to Snap-on of $258.1 million, or $4.82 per diluted share, in the fourth quarter of 2024 \ncompared to\n $255.3 million, or $4.75 per diluted share, in the fourth quarter of \n2023.\nSegment Results\nCommercial & Industrial Group\n \nFourth Quarter\n \n(Amounts in millions)\n2024\n2023\nChange\nExternal net sales\n$\n302.9 \n79.9 \n%\n$\n296.7 \n81.5 \n%\n$\n6.2 \n2.1 \n%\nIntersegment net sales\n76.3 \n20.1 \n%\n67.2 \n18.5 \n%\n9.1 \n13.5 \n%\nSegment net sales\n379.2 \n100.0 \n%\n363.9 \n100.0 \n%\n15.3 \n4.2 \n%\nSegment cost of goods sold\n(223.8)\n(59.0)\n%\n(221.3)\n(60.8)\n%\n(2.5)\n(1.1)\n%\nSegment gross profit\n155.4 \n41.0 \n%\n142.6 \n39.2 \n%\n12.8 \n9.0 \n%\nSegment operating expenses\n(91.9)\n(24.3)\n%\n(88.5)\n(24.3)\n%\n(3.4)\n(3.8)\n%\nSegment operating earnings\n$\n63.5 \n16.7 \n%\n$\n54.1 \n14.9 \n%\n$\n9.4 \n17.4 \n%\nSegment net sales of $379.2 million in the fourth quarter of 2024 represented an increase of $15.3 million, or \n4.2%, fro\nm \n2023\n levels, reflecting a $14.2 million, or 3.9%, organic gain and \n$2.1 million\n of acquisition-related sales, partially offset by $1.0 million of unfavorable foreign currency translation. \nThe organic increase is primarily due to a gain in sales to customers in critical industries, including a high single-digit increase in specialty torque. \nSegment gross margin in the fourth quarter improved 180 bps from 2023, primarily reflecting increased sales volumes in the higher-gross-margin critical industry sectors and savings from the segment’s RCI initiatives.\nSegment operating expenses as a percentage of net sales in the fourth quarter of 2024 was unchanged from last year.\nAs a result of these factors, segment operating earnings of $63.5 million in the fourth quarter of 2024 compared to $54.1 million in \n2023\n, an increase of $9.4 million or \n17.4%\n. Operating margin for the Commercial & Industrial Group of 16.7% in the quarter compared to \n14.9%\n last year.\nSnap-on Tools Group\n \nFourth Quarter\n \n(Amounts in millions)\n2024\n2023\nChange\nSegment net sales\n$\n506.6 \n100.0 \n%\n$\n513.3 \n100.0 \n%\n$\n(6.7)\n(1.3)\n%\nSegment cost of goods sold\n(280.5)\n(55.4)\n%\n(281.2)\n(54.8)\n%\n0.7 \n0.2 \n%\nSegment gross profit\n226.1 \n44.6 \n%\n232.1 \n45.2 \n%\n(6.0)\n(2.6)\n%\nSegment operating expenses\n(119.2)\n(23.5)\n%\n(121.1)\n(23.6)\n%\n1.9 \n1.6 \n%\nSegment operating earnings\n$\n106.9 \n21.1 \n%\n$\n111.0 \n21.6 \n%\n$\n(4.1)\n(3.7)\n%\nSegment net sales of $506.6 million in the fourth quarter of 2024 represented a decrease of $6.7 million, or 1.3%, from \n2023\n levels, reflecting a $7.3 million, or 1.4%, organic sales decline, partially offset by $0.6 million of favorable foreign currency translation. The organic decrease is due to a low single-digit decline in the U.S., partially offset by a mid single-digit gain in the segment’s international operations.\nSegment gross margin in the fourth quarter declined 60 bps from last year primarily due to the decreased volumes and the effects of increased sales of lower-gross-margin products.\nSegment operating expenses as a percentage of net sales in the fourth quarter improved 10 bps from \n2023.\nAs a result of these factors, segment operating earnings of $106.9 million in the fourth quarter of 2024 compared to \n$111.0 million\n in \n2023\n, a decrease of $4.1 million, or 3.7%. Operating margin for the \nSnap‑on\n Tools Group of 21.1% in the quarter compared to 21.6% last year.\n38\nSNAP-ON INCORPORATED\nRepair Systems & Information Group\n \nFourth Quarter\n \n(Amounts in millions)\n2024\n2023\nChange\nExternal net sales\n$\n389.2 \n85.2 \n%\n$\n386.6 \n85.8 \n%\n$\n2.6 \n0.7 \n%\nIntersegment net sales\n67.4 \n14.8 \n%\n64.2 \n14.2 \n%\n3.2 \n5.0 \n%\nSegment net sales\n456.6 \n100.0 \n%\n450.8 \n100.0 \n%\n5.8 \n1.3 \n%\nSegment cost of goods sold\n(242.0)\n(53.0)\n%\n(247.9)\n(55.0)\n%\n5.9 \n2.4 \n%\nSegment gross profit\n214.6 \n47.0 \n%\n202.9 \n45.0 \n%\n11.7 \n5.8 \n%\nSegment operating expenses\n(93.2)\n(20.4)\n%\n(89.6)\n(19.9)\n%\n(3.6)\n(4.0)\n%\nSegment operating earnings\n$\n121.4 \n26.6 \n%\n$\n113.3 \n25.1 \n%\n$\n8.1 \n7.1 \n%\nSegment net sales of $456.6 million in the fourth quarter of 2024 represented an increase of $5.8 million, or 1.3%, from 2023 levels, reflecting a $7.3 million, or 1.6%, organic sales increase, partially offset by $1.5 million of unfavorable foreign currency translation. The organic gain includes a mid single-digit increase in activity with OEM dealerships and a low single-digit gain in sales of diagnostic and repair information products to independent repair shop owners and managers, partially offset by a low single-digit decline in sales of undercar equipment.\nSegment gross margin in the fourth quarter improved 200 bps from last year primarily reflecting increased sales of higher-gross-margin products and benefits from the segment’s RCI initiatives.\nSegment operating expenses as a percentage of net sales in the fourth quarter rose 50 bps from \n2023 \nprimarily due to increased personnel and other costs. \nAs a result of these factors, segment operating earnings of $121.4 million in the fourth quarter of 2024 compared to $113.3 million in 2023, an increase of $8.1 million or 7.1%. Operating margin for the Repair Systems & Information Group of 26.6% in the quarter compared to 25.1% last year.\nFinancial Services\n \n \nFourth Quarter\n \n(Amounts in millions)\n2024\n2023\nChange\nFinancial services revenue\n$\n100.5 \n100.0 \n%\n$\n97.2 \n100.0 \n%\n$\n3.3 \n3.4 \n%\nFinancial services expenses\n(33.8)\n(33.6)\n%\n(29.3)\n(30.1)\n%\n(4.5)\n(15.4)\n%\nSegment operating earnings\n$\n66.7 \n66.4 \n%\n$\n67.9 \n69.9 \n%\n$\n(1.2)\n(1.8)\n%\nFinancial services revenue of $100.5 million in the fourth quarter of 2024 represented an increase of $3.3 million, or 3.4%, from last year. In the fourth quarters of 2024 and 2023, the respective average yields on finance receivables were 17.7% and \n17.8%\n. In the fourth quarters of 2024 and \n2023\n, the average yields on contract receivables were 9.1% and \n8.9%\n, respectively. \nOriginations of $285.1 million in the fourth quarter of 2024 represented a decrease of $18.0 million, or 5.9%, from 2023 levels.\nFinancial services expenses in the fourth quarter of 2024 increased primarily due to higher provisions for credit losses as compared to those recorded last year. As a percentage of the average financial services portfolio, financial services expenses were 1.3% in the fourth quarter of 2024 and 1.2% in 2023.\nAs a result of these factors, segment operating earnings of \n$66.7 million\n in the fourth quarter of 2024 compared to \n$67.9 million\n in 2023, a decrease of $1.2 million, or 1.8%.\nSee Note 1 and Note 4 to the Consolidated Financial Statements for additional information on financial services.\nCorporate\nSnap-on’s fourth quarter 2024 general corporate expenses of $26.6 million compared to $20.5 million last year. The year-over-year increase primarily reflects a benefit from the recovery of costs associated with a legal matter that occurred in the fourth quarter of 2023.  \n2024 ANNUAL REPORT\n39\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nNon-GAAP Supplemental Data\nThe following non-GAAP supplemental data is presented for informational purposes to provide readers with insight into the information used by management for assessing the operating performance of Snap-on’s non-financial services (“Operations”) and Financial Services businesses.\nThe supplemental Operations data reflects the results of operations and financial position of Snap-on’s tools, diagnostics, equipment products, software, and other non-financial services operations with Financial Services presented on the equity method. The supplemental Financial Services data reflects the results of operations and financial position of Snap-on’s U.S. and international financial services operations. The financing needs of Financial Services are met through intersegment borrowings and cash generated from Operations; Financial Services is charged interest expense on intersegment borrowings at market rates. Income taxes are charged to Financial Services on the basis of the specific tax attributes generated by the U.S. and international financial services businesses. Transactions between the Operations and Financial Services businesses are eliminated to arrive at the Consolidated Financial Statements.\nNon-GAAP Supplemental Consolidating Data – Supplemental Statements of Earnings information for 2024 and 2023 is as follows:\n \n \nOperations*\nFinancial Services\n(Amounts in millions)\n2024\n2023\n2024\n2023\nNet sales\n$\n4,707.4 \n$\n4,730.2 \n$\n— \n$\n— \nCost of goods sold\n(2,329.5)\n(2,381.1)\n— \n— \nGross profit\n2,377.9 \n2,349.1 \n— \n— \nOperating expenses\n(1,309.1)\n(1,309.2)\n— \n— \nOperating earnings before financial services\n1,068.8 \n1,039.9 \n— \n— \nFinancial services revenue\n— \n— \n401.0 \n378.1 \nFinancial services expenses\n— \n— \n(124.1)\n(107.6)\nOperating earnings from financial services\n— \n— \n276.9 \n270.5 \nOperating earnings\n1,068.8 \n1,039.9 \n276.9 \n270.5 \nInterest expense\n(49.6)\n(49.9)\n— \n— \nIntersegment interest income (expense) – net\n67.1 \n63.9 \n(67.1)\n(63.9)\nOther income (expense) – net\n76.8 \n67.3 \n0.2 \n0.2 \nEarnings before income taxes and equity earnings\n1,163.1 \n1,121.2 \n210.0 \n206.8 \nIncome tax expense\n(251.7)\n(241.6)\n(52.5)\n(51.8)\nEarnings before equity earnings\n911.4 \n879.6 \n157.5 \n155.0 \nFinancial services – net earnings attributable to Snap-on\n157.5 \n155.0 \n— \n— \nNet earnings\n1,068.9 \n1,034.6 \n157.5 \n155.0 \nNet earnings attributable to noncontrolling interests\n(25.0)\n(23.5)\n— \n— \nNet earnings attributable to Snap-on\n$\n1,043.9 \n$\n1,011.1 \n$\n157.5 \n$\n155.0 \n* Snap-on with Financial Services presented on the equity method. \n40\nSNAP-ON INCORPORATED\nNon-GAAP Supplemental Consolidating Data – Supplemental Balance Sheets Information as of 2024 and 2023 year end is as follows:\n \nOperations*\nFinancial Services\n(Amounts in millions)\n2024\n2023\n2024\n2023\nASSETS\nCurrent assets:\nCash and cash equivalents\n$\n1,360.4 \n$\n1,001.3 \n$\n0.1 \n$\n0.2 \nIntersegment receivables\n15.1 \n15.7 \n— \n— \nTrade and other accounts receivable – net\n815.0 \n790.6 \n0.6 \n0.7 \nFinance receivables – net\n— \n— \n610.3 \n594.1 \nContract receivables – net\n4.8 \n5.5 \n115.2 \n115.3 \nInventories – net\n943.4 \n1,005.9 \n— \n— \nPrepaid expenses and other current assets\n143.8 \n143.2 \n9.4 \n7.4 \nTotal current assets\n3,282.5 \n2,962.2 \n735.6 \n717.7 \nProperty and equipment – net\n540.2 \n536.5 \n2.4 \n2.8 \nOperating lease right-of-use assets\n83.8 \n73.8 \n5.6 \n0.9 \nInvestment in Financial Services\n403.5 \n393.9 \n— \n— \nDeferred income tax assets\n51.8 \n51.3 \n26.2 \n24.7 \nIntersegment long-term notes receivable\n831.8 \n785.6 \n— \n— \nLong-term finance receivables – net\n— \n— \n1,312.0 \n1,284.2 \nLong-term contract receivables – net\n8.4 \n8.3 \n409.9 \n399.6 \nGoodwill\n1,056.8 \n1,097.4 \n— \n— \nOther intangible assets – net\n267.6 \n268.9 \n— \n— \nPension assets\n125.4 \n130.5 \n— \n— \nOther long-term assets\n35.6 \n30.2 \n0.2 \n0.1 \nTotal assets\n$\n6,687.4 \n$\n6,338.6 \n$\n2,491.9 \n$\n2,430.0 \n* Snap-on with Financial Services presented on the equity method. \n \n2024 ANNUAL REPORT\n41\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nNon-GAAP Supplemental Consolidating Data – Supplemental Balance Sheets Information (continued):\n \n \nOperations*\nFinancial Services\n(Amounts in millions)\n2024\n2023\n2024\n2023\nLIABILITIES AND EQUITY\nCurrent liabilities:\nNotes payable\n$\n13.7 \n$\n15.6 \n$\n— \n$\n— \nAccounts payable\n265.4 \n236.2 \n0.5 \n1.8 \nIntersegment payables\n— \n— \n15.1 \n15.7 \nAccrued benefits\n67.2 \n64.4 \n— \n— \nAccrued compensation\n83.5 \n99.9 \n2.6 \n3.0 \nFranchisee deposits\n70.9 \n73.3 \n— \n— \nOther accrued liabilities\n443.6 \n432.2 \n27.7 \n27.4 \nTotal current liabilities\n944.3 \n921.6 \n45.9 \n47.9 \nLong-term debt and intersegment long-term debt\n— \n— \n2,017.3 \n1,970.2 \nDeferred income tax liabilities\n73.5 \n79.2 \n— \n— \nRetiree health care benefits\n19.4 \n21.8 \n— \n— \nPension liabilities\n78.4 \n82.3 \n— \n— \nOperating lease liabilities\n63.0 \n54.0 \n5.6 \n0.6 \nOther long-term liabilities\n91.8 \n86.3 \n19.6 \n17.4 \nTotal liabilities\n1,270.4 \n1,245.2 \n2,088.4 \n2,036.1 \nTotal shareholders’ equity attributable to Snap-on\n5,394.1 \n5,071.3 \n403.5 \n393.9 \nNoncontrolling interests\n22.9 \n22.1 \n— \n— \nTotal equity\n5,417.0 \n5,093.4 \n403.5 \n393.9 \nTotal liabilities and equity\n$\n6,687.4 \n$\n6,338.6 \n$\n2,491.9 \n$\n2,430.0 \n* Snap-on with Financial Services presented on the equity method. \n42\nSNAP-ON INCORPORATED\nLiquidity and Capital Resources\nSnap-on’s growth has historically been funded by a combination of cash provided by operating activities and debt financing. Snap-on believes that its cash from operations and collections of finance receivables, coupled with its sources of borrowings and available cash on hand, are sufficient to fund its currently anticipated requirements for scheduled debt repayments, payments of interest and dividends, new receivables originated by our financial services businesses, capital expenditures, working capital, funding of pension plans, and share repurchases and acquisitions, if and as they arise. \nDue to Snap-on’s credit rating over the years, external funds have been available at an acceptable cost. As of February 7, 2025, Snap-on’s long-term debt and commercial paper were rated, respectively: A2 and P-1 by Moody’s Investors Service; A- and A-2 by Standard & Poor’s; and A and F1 by Fitch Ratings. Snap-on believes that its current credit arrangements are sound and that the strength of its balance sheet affords the company the financial flexibility, including through access to financial markets for potential new financing, to respond to both internal growth opportunities and those available through acquisitions. However, Snap-on cannot provide any assurance that financing will be available in the future on acceptable terms, or that its debt ratings will not decrease.\nThe following discussion focuses on information included in the accompanying Consolidated Balance Sheets.\nAs of 2024 year end, working capital (current assets less current liabilities) of $3,027.9 million represented an increase of $317.5 million from $2,710.4 million as of 2023 year end primarily as a result of the net changes in working capital discussed below. \nThe following represents the company’s working capital position as of 2024 and 2023 year end:\n \n(Amounts in millions)\n2024\n2023\nCash and cash equivalents\n$\n1,360.5 \n$\n1,001.5 \nTrade and other accounts receivable – net\n815.6 \n791.3 \nFinance receivables – net\n610.3 \n594.1 \nContract receivables – net\n120.0 \n120.8 \nInventories – net\n943.4 \n1,005.9 \nPrepaid expenses and other current assets\n139.6 \n138.4 \nTotal current assets\n3,989.4 \n3,652.0 \nNotes payable\n(13.7)\n(15.6)\nAccounts payable\n(265.9)\n(238.0)\nOther current liabilities\n(681.9)\n(688.0)\nTotal current liabilities\n(961.5)\n(941.6)\nWorking capital\n$\n3,027.9 \n$\n2,710.4 \nCash and cash equivalents of $1,360.5 million as of 2024 year end represented an increase of $359.0 million from 2023 year-end levels \nprimarily due to: (i) $1,217.5 million of cash generated from operations; (ii) $837.8 million of cash from collections of finance receivables; and (iii) $92.3 million of cash proceeds from stock purchase plans and stock option exercises. These increases in cash and cash equivalents were partially offset by: (i) the funding of $966.0 million of new finance receivables; (ii) dividend payments to shareholders of $406.4 million; (iii) the repurchase of 952,000 shares of the company’s common stock for $290.0 million; (iv) the funding of $83.5 million for capital expenditures; and (v) net repayments of other short-term borrowings of $1.3 million.\nOf the $1,360.5 million of cash and cash equivalents as of 2024 year end, $494.1 million was held outside of the United States. Snap-on maintains non-U.S. funds in its foreign operations to: (i) provide adequate working capital; (ii) satisfy various regulatory requirements; and/or (iii) take advantage of business expansion opportunities as they arise. Although the Tax Cuts and Jobs Act (“Tax Act”) generally eliminated U.S. federal taxation of dividends from foreign subsidiaries, such dividends may still be subject to state income taxation and foreign withholding taxes. Snap-on periodically evaluates its cash held outside the United States and may pursue opportunities to repatriate certain foreign cash amounts to the extent that it can be accomplished in a tax efficient manner.\n2024 ANNUAL REPORT\n43\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nTrade and other accounts receivable – net of $815.6 million as of 2024 year end represented an increase of $24.3 million from 2023 year-end levels primarily due to an increase in days sales outstanding, partially offset by $21.2 million of foreign currency translation. Days sales outstanding (trade and other accounts receivable – net as of the respective period end, divided by the respective trailing 12 months of sales, times 360 days) was 62 days and 60 days at the respective 2024 and 2023 year ends.\nThe current portions of net finance and contract receivables of $730.3 million as of 2024 year end compared to $714.9 million at 2023 year end. The long-term portions of net finance and contract receivables of $1,730.3 million as of 2024 year end compared to $1,692.1 million at 2023 year end. The combined $53.6 million increase in net current and long-term finance and contract receivables compared to 2023 year-end levels is primarily due to net receivable originations, partially offset by $17.0 million of foreign currency translation.\nInventories – net of $943.4 million as of 2024 year end decreased $62.5 million from 2023 year-end levels primarily due to easing supply chain disruptions and $31.7 million of foreign currency translation. As of 2024 and 2023 year end, inventory turns (trailing 12 months of cost of goods sold, divided by the average of the beginning\n and ending inventory balances for the trailing 12 months) were 2.4 turns and 2.3 turns, respectively. Inventories accounted for using the first-in, first-out (“FIFO”) method as of 2024 and 2023 year end approximated 57% and 59% of total inventories, respectively. All other inventories are accounted for using the last-in, first-out (“LIFO”) method. The company’s LIFO reserve was $122.4 million and $115.9 million at 2024 and 2023 year end, respectively.\nNotes payable of $13.7 million as of 2024 year end compared to $15.6 million as of 2023 year end. Average notes payable outstanding were $14.9 million and $17.5 million in 2024 and 2023, respectively. The 2024 weighted-average interest rate on such borrowings of 10.4% compared with 11.0% in 2023. At 2024 year end, the weighted-average rate on outstanding notes payable of 9.5% compared with 11.1% in 2023.\nAccounts payable of $265.9 million as of 2024 year end represented an increase of $27.9 million from 2023 year-end levels, primarily due to the timing of payments, partially offset by $3.8 million of foreign currency translation.\nOther accrued liabilities of $457.7 million as of 2024 year end represented an increase of $10.3 million from 2023 year-end levels.\nLong-term debt of $1,185.5 million as of 2024 year end consisted of: (i) $300.0 million of unsecured 3.25% notes that mature on March 1, 2027 (the “2027 Notes”); (ii) $400.0 million of unsecured 4.10% notes that mature on March 1, 2048 (“the 2048 Notes”); and (iii) $500.0 million of 3.10% notes that mature on May 1, 2050 (the “2050 Notes”), partially offset by $14.5 million of unamortized debt issuance costs and issuance discounts.\nSnap-on has a $900 million multicurrency revolving credit facility that terminates on September 12, 2028 (the “Credit Facility”). The Credit Facility contains an accordion feature that, subject to certain customary conditions, may allow the maximum commitment to be increased by up to $450 million with the approval of the lenders providing additional commitments. No amounts were borrowed or outstanding under the Credit Facility during the years ended and as of December 28, 2024 or December 30, 2023.\nBorrowings under the Credit Facility bear interest at varying rates based on either: (i) Snap-on’s then-current, long-term debt ratings; or (ii) Snap-on’s then-current ratio of consolidated debt net of certain cash adjustments (“Consolidated Net Debt”) to earnings before interest, taxes, depreciation, amortization and certain other adjustments for the preceding four fiscal quarters then ended (the “Consolidated Net Debt to EBITDA Ratio”). The Credit Facility’s financial covenant requires that Snap-on maintain, as of each fiscal quarter end, either (i) a ratio not greater than 0.60 to 1.00 of Consolidated Net Debt to the sum of Consolidated Net Debt plus total equity and less accumulated other comprehensive income or loss (the “Leverage Ratio”); or (ii) a Consolidated Net Debt to EBITDA Ratio not greater than 3.50 to 1.00. Snap-on may, up to two times during any five-year period during the term of the Credit Facility (including any extensions thereof), elect to increase the maximum Leverage Ratio to 0.65 to 1.00 and/or increase the maximum Consolidated Net Debt to EBITDA Ratio to 4.00 to 1.00 for four consecutive fiscal quarters in connection with certain material acquisitions (as defined in the related credit agreement). As of December 28, 2024, the company’s consolidated cash balance, net of certain adjustments, exceeded consolidated debt resulting in actual ratios of (0.01) and (0.05), respectively. Both ratios are within the permitted ranges set forth in this financial covenant. \nSnap-on generally issues commercial paper to fund its financing needs on a short-term basis and uses the Credit Facility as back-up liquidity to support such commercial paper issuances. There was no commercial paper issued or outstanding during the years ended and as of December 28, 2024 or December 30, 2023.\n44\nSNAP-ON INCORPORATED\nSnap-on’s Credit Facility and other debt agreements also contain certain usual and customary borrowing, affirmative, negative and maintenance covenants. As of 2024 year end, Snap-on was in compliance with all covenants of its Credit Facility and other debt agreements.\nSnap-on believes it has sufficient available cash and access to both committed and uncommitted credit facilities to cover its expected funding needs on both a short-term and long-term basis. Snap-on manages its aggregate short-term borrowings so as not to exceed its availability under the Credit Facility. Snap-on believes that it can access short-term debt markets, predominantly through commercial paper issuances and existing lines of credit, to fund its short-term requirements and to ensure near-term liquidity. Snap-on regularly monitors the credit and financial markets and, if it believes conditions are favorable, it may take advantage of such conditions to issue long-term debt to further improve its liquidity and capital resources. Near-term liquidity requirements for Snap-on include payments of interest and dividends, funding to support new receivables originated by our financial services businesses, capital expenditures, working capital, the funding of pension plans, and funding for share repurchases and acquisitions, if and as they arise. Snap-on intends to make contributions of $4.3 million to its foreign pension plans and $6.5 million to its domestic pension plans in 2025, as required by law. Depending on market and other conditions, Snap-on may make discretionary cash contributions to its pension plans in 2025.\nSnap-on’s long-term financing strategy is to maintain continuous access to the debt markets to accommodate its liquidity needs, including the potential use of commercial paper, additional fixed-term debt and/or securitizations.\nThe following discussion focuses on information included in the accompanying Consolidated Statements of Cash Flows.\nOperating Activities\nNet cash provided by operating activities of $1,217.5 million in 2024 increased $63.3 million from $1,154.2 million in 2023. The increase is primarily due to a $34.3 million increase in net earnings and a $18.0 million change in net operating assets and liabilities. \nDepreciation expense was $72.7 million in 2024 and $72.2 million in 2023. Amortization expense was $25.3 million in 2024 and $27.1 million in 2023. See Note 6 and Note 7 to the Consolidated Financial Statements for information on property and equipment and goodwill and other intangible assets.\nInvesting Activities\nNet cash used by investing activities of $204.1 million in 2024 included additions to finance receivables of $966.0 million, partially offset by collections of $837.8 million. Net cash used by investing activities of $331.8 million in 2023 included additions to finance receivables of $1,029.0 million, partially offset by collections of $833.5 million. Finance receivables are comprised of extended-term installment payment contracts to both technicians and independent shop owners (i.e., franchisees’ customers) to enable them to purchase tools, diagnostics, and equipment products on an extended-term payment plan, with average payment terms of approximately four years.\nNet cash used by investing activities in 2023 also included $42.6 million for the acquisitions of Mountz and SAVTEQ. See Note 3 to the Consolidated Financial Statements for information about acquisitions.\nCapital expenditures in 2024 and 2023 totaled $83.5 million and $95.0 million, respectively. Capital expenditures in both years included continued investments related to the company’s execution of its strategic Value Creation Processes. The company also invested in: (i) new product, efficiency, safety and cost reduction initiatives that are intended to expand and improve its manufacturing and distribution capabilities worldwide; (ii) new production and machine tooling to enhance manufacturing operations, as well as ongoing replacements of manufacturing and distribution equipment, particularly in the United States; and (iii) the ongoing enhancement of the company’s global enterprise resource planning (ERP) management information systems. Snap-on believes that its cash generated from operations, as well as its available cash on hand and funds available from its credit facilities will be sufficient to fund the company’s capital expenditure requirements in 2025.\nFinancing Activities\nNet cash used by financing activities of $649.8 million in 2024 included net repayments of other short-term borrowings of $1.3 million. Net cash used by financing activities of $572.9 million in 2023 included net repayments of other short-term borrowings of $1.7 million.\n2024 ANNUAL REPORT\n45\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nProceeds from stock purchase plans and stock option exercises totaled $92.3 million in 2024 and $113.6 million in 2023. In 2024, Snap-on repurchased 952,000 shares of its common stock for $290.0 million under its previously announced share repurchase programs. Snap-on repurchased 1,126,000 shares of its common stock for $294.7 million in 2023. As of 2024 year end, Snap-on had remaining availability to repurchase up to an additional $429.4 million in common stock pursuant to its Board’s authorizations. The repurchase of Snap-on common stock to offset dilution related to equity plan issuances or for other corporate purposes is at the company’s discretion, subject to prevailing financial and market conditions. Snap-on believes that its cash generated from operations, available cash on hand, and funds available from its credit facilities, will be sufficient to fund the company’s additional share repurchases, if any.\nSnap-on has paid consecutive quarterly cash dividends, without interruption or reduction, since 1939. Cash dividends paid in 2024 and 2023 totaled $406.4 million and $355.6 million, respectively. On November 8, 2024, the company announced that its Board increased the quarterly cash dividend by\n 15.1% to \n$2.14\n per share ($8.56 per share annualized).\n Quarterly dividends in 2024 were $2.14 per share in the fourth quarter and $1.86 per share in the first three quarters ($7.72 per share for the year). Quarterly dividends in 2023 were $1.86 per share in the fourth quarter and $1.62 per share in the first three quarters ($6.72 per share for the year).\n2024\n2023\nCash dividends paid per common share\n$\n7.72 \n$\n6.72 \nCash dividends paid as a percentage of prior-year retained earnings\n5.8 \n%\n5.6 \n%\nSnap-on believes that its cash generated from operations, available cash on hand, and funds available from its credit facilities, will be sufficient to pay dividends in 2025.\nContractual Obligations and Commitments\nSnap-on’s contractual obligations for long-term debt and operating and finance leases are reflected in the Consolidated Balance Sheets; see Note 9 and Note 16 to the Consolidated Financial Statements for information on the company’s long-term debt and leases. Snap-on also enters into contracts for future purchases in the normal course of business. As of year-end 2024, the company had $159.0 million in purchase commitments to be paid in 2025 and $5.1 million to be paid thereafter. \nSnap-on intends to make contributions of $4.3 million to its foreign pension plans and $6.5 million to its domestic pension plans in 2025, as required by law. Depending on market and other conditions, Snap-on may make additional discretionary cash contributions to its pension plans in 2025; see Note 11 and Note 12 to the Consolidated Financial Statements for information on the company’s benefit plans and payments.\nDue to the uncertainty of the timing of settlements with taxing authorities, Snap-on is unable to make reasonably reliable estimates of the period of cash settlement of unrecognized tax benefits totaling $6.6 million for its remaining uncertain tax liabilities. See Note 8 to the Consolidated Financial Statements for information on income taxes.\nEnvironmental Matters\nSnap-on is subject to various federal, state and local government requirements regulating the discharge of materials into the environment or otherwise relating to the protection of the environment. Snap-on’s policy is to comply with these requirements and the company believes that, as a general matter, its policies, practices and procedures are properly designed to prevent unreasonable risk of environmental damage, and of resulting financial liability, in connection with its business. Some risk of environmental damage is, however, inherent in some of Snap-on’s operations and products, as it is with other companies engaged in similar businesses.\nSnap-on is and has been engaged in the handling, manufacture, use and disposal of many substances classified as hazardous or toxic by one or more regulatory agencies. Snap-on believes that, as a general matter, its handling, manufacture, use and disposal of these substances are in accordance with environmental laws and regulations. It is possible, however, that future knowledge or other developments, such as improved capability to detect substances in the environment or increasingly strict environmental laws and standards and enforcement policies, could affect the company’s handling, manufacture, use or disposal of these substances.\n46\nSNAP-ON INCORPORATED\nIn recent years there has been increased public awareness, concern and focus on environmental and sustainability issues, including matters related to climate change.\n \nThe current focus on these matters is resulting in additional and/or more restrictive regulations, disclosure requirements and industry or third-party requirements and standards to reduce or mitigate climate change as well as other environmental or sustainability risks. Snap-on is monitoring developments in this area.\nNew Accounting Standards\nSee Note 1 to the Consolidated Financial Statements for information on new accounting standards.\nCritical Accounting Policies and Estimates\nThe Consolidated Financial Statements and related notes contain information that is pertinent to management’s discussion and analysis. The preparation of financial statements in conformity with accounting principles generally accepted in the United States of America (“GAAP”) requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements, and the reported amounts of revenues and expenses during the reporting period. These estimates are generally based on historical experience, current conditions and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily available from other sources, as well as identifying and assessing our accounting treatment with respect to commitments and contingencies. Actual results could differ from those estimates.\nIn addition to the company’s significant accounting policies described in Note 1 to the Consolidated Financial Statements, Snap-on considers the following policies and estimates to be the most critical in understanding the judgments that are involved in the preparation of the company’s consolidated financial statements and the uncertainties that could impact the company’s financial position, results of operations and cash flows.\nAllowance for Credit Losses on Finance Receivables:\n The allowance for credit losses on finance receivables is maintained at a level management believes is adequate to cover expected losses in Snap-on’s finance receivables portfolio as of the reporting date. The allowance represents management’s estimate of the expected losses in the company’s finance receivables portfolio based on ongoing assessments and evaluations of credit losses over the remaining contractual life of the receivables portfolio considering collectability, historical loss experience, current conditions and future market changes. Determination of the proper level of allowance requires management to exercise judgment about the timing, frequency and severity of credit losses that could materially affect the provision for credit losses and, as a result, net earnings. The allowance takes into consideration numerous quantitative and qualitative factors that include receivable type, historical loss experience, delinquency trends, collection experience, current and future economic conditions and credit risk characteristics. Some of these factors are influenced by items such as the customers’ financial condition, past payment experience, credit bureau and proprietary Snap-on credit model information, as well as the value of the underlying collateral. Changes in economic conditions and assumptions, including the resulting credit quality metrics relative to the performance of the finance receivables portfolio, create uncertainty and could result in changes to both the allowance for credit losses and provision for credit losses.\nManagement utilizes established policies and procedures in an effort to ensure the estimates and assumptions are well controlled, reviewed and consistently applied. As of December 28, 2024, the ratio of the allowance for credit losses to finance receivables was 3.63%. As of December 30, 2023, the allowance ratio was 3.48%.\n \nWhile management believes it exercises prudent judgment and applies reasonable assumptions in establishing its estimates for allowances for finance receivables, there can be no assurance that changes in economic conditions or other factors would not adversely impact the financial health of our customers and result in changes to the estimates used in the allowance calculation. For reference, a 100 bps increase in the allowance ratios for finance receivables as of December 28, 2024, would have increased Snap-on’s 2024 provision for credit losses and related allowance for credit losses by approximately $20.0 million. \nFor additional information on Snap-on’s allowances for credit losses, see Note 1 and Note 4 to the Consolidated Financial Statements.\nImpairment of Goodwill:\n Goodwill is tested for impairment annually or more frequently if events or changes in circumstances indicate that the assets might be impaired. Annual impairment tests are performed by the company in the second quarter of each year using information available as of April month end.\n2024 ANNUAL REPORT\n47\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nSnap-on evaluates the recoverability of goodwill by estimating the future discounted cash flows of the businesses to which the goodwill relates. Estimated cash flows and related goodwill are grouped at the reporting unit level. The company has determined that its reporting units for testing goodwill impairment are its operating segments or components of an operating segment that constitute a business for which discrete financial information is available and for which segment management regularly reviews the operating results. Within its four reportable operating segments, the company has identified 11 reporting units.\nSnap-on evaluates the recoverability of goodwill by utilizing an income approach that estimates the fair value of the future discounted cash flows of the reporting units to which the goodwill relates. The future projections, which are based on both past performance and the projections and assumptions used in the company’s operating plans, are subject to change as a result of changing economic and competitive conditions. This approach reflects management’s internal outlook at the reporting units, which management believes provides the best determination of value due to management’s insight and experience with the reporting units. Significant estimates used by management in the discounted cash flows methodology include estimates of future cash flows based on expected growth rates, price increases, working capital levels, expected benefits from RCI initiatives, and a weighted-average cost of capital that reflects the risk profile of the reporting unit being tested. The company’s methodologies for valuing goodwill are applied consistently on a year-over-year basis; the assumptions used in performing the second quarter 2024 impairment calculations were evaluated in light of then-current market and business conditions. Snap-on continues to believe that the future discounted cash flow valuation model provides the most reasonable and meaningful fair value estimate based upon the reporting units’ projections of future operating results and cash flows and replicates how market participants would value the company’s reporting units in an orderly transaction.\nIn the event the fair value of a reporting unit is less than the carrying value, including goodwill, the company would then record an impairment charge based on the excess of a reporting units carrying amount over its fair value.\nInherent in fair value determinations are significant judgments and estimates, including material assumptions about future revenue, profitability and cash flows, the company’s operational plans and its interpretation of current economic indicators. Should the operations of the businesses with which goodwill is associated incur significant and unanticipated changes in circumstances, such as declines in profitability and cash flow due to long-term deterioration in macroeconomic, industry and market conditions, the loss of key customers, changes in technology or markets, changes in key personnel or litigation, a sustained decrease in share price and/or other events, some or all of the recorded goodwill could be subject to impairment and could result in a material adverse effect on Snap-on’s financial position or results of operations. \nSnap-on completed its annual impairment testing of goodwill in the second quarter of 2024, the results of which did not result in any impairment. As of 2024 year end, the company has no accumulated impairment losses. Although the company consistently uses the same methods in developing the assumptions and estimates underlying the fair value calculations, such estimates are uncertain by nature and can vary from actual results. In performing its annual impairment testing the company performed a sensitivity analysis on the material assumptions used in the discounted cash flow valuation models for each of its 11 reporting units. Based on the company’s second quarter 2024 impairment testing, and assuming a hypothetical 10% decrease in the estimated fair values of each of its 11 reporting units, the hypothetical fair value of each of the company’s 11 reporting units would have been greater than its carrying value. See Note 7 to the Consolidated Financial Statements for additional information about goodwill.\nPension Benefits:\n The pension benefit obligation and related pension expense are calculated in accordance with GAAP and are impacted by certain actuarial assumptions. Changes in these assumptions are primarily influenced by factors outside of      Snap-on’s control, such as changes in economic conditions, and can have a significant effect on the amounts reported in the financial statements. Snap-on believes that the two most critical assumptions are (i) the expected return on plan assets; and (ii) the assumed discount rate.\nSnap-on’s domestic pension plans have a long-term investment horizon and a total return strategy that emphasizes a capital growth objective. In 2024, the long-term investment performance objective for Snap-on’s domestic plans’ assets was to achieve net of expense returns that met or exceeded the 7.5% domestic expected return on plan assets assumption. Snap-on uses a three-year, market-related value asset method of amortizing the difference between actual and expected returns on its domestic plans’ assets. As of 2024 year end, Snap-on’s domestic pension plans’ assets comprised approximately 86% of the company’s worldwide pension plan assets.\n48\nSNAP-ON INCORPORATED\nBased on forward-looking capital market expectations, Snap-on selected an expected return on plan assets assumption for its U.S. pension plans of 7.5%, the same rate used in 2024, to be used in determining pension expense for 2025. In estimating the domestic expected return on plan assets, Snap-on utilizes a nominal returns forecasting method. For each asset class, future returns are estimated by identifying the premium of riskier asset classes over lower risk alternatives. The methodology constructs expected returns using a “building block” approach to the individual components of total return. These forecasts are stated in both nominal and real (after inflation) terms. This process first considers the long-term historical return premium based on the longest set of data available for each asset class. These premiums, calculated using the geometric mean, are then adjusted based on current relative valuation levels, macro-economic conditions, and the expected alpha related to active investment management. The asset return assumption is also adjusted by an implicit expense load for estimated administrative and investment-related expenses. Since asset allocation is a key determinant of expected investment returns, the current and expected mix of plan assets are also considered when setting the assumption.\nPension expense increases as the expected rate of return on plan assets decreases. Lowering the expected rate of return assumption for Snap-on’s\n domestic pension plans’ assets by 50 bps would have increased Snap-on’s 2024 domestic pension expense by approximatel\ny $6.0 million.\nThe objective of Snap-on’s discount rate assumption is to reflect the rate at which the pension benefits could be effectively settled. The domestic discount rate as of 2024 and 2023 year end was selected based on a cash flow matching methodology developed by the company’s outside actuaries that incorporates a review of current economic conditions. This methodology matches the plans’ yearly projected cash flows for benefits and service costs to those of hypothetical bond portfolios using high-quality, AA rated or better, corporate bonds from either Moody’s Investors Service or Standard & Poor’s credit rating agencies available at the measurement date. This technique calculates bond portfolios that produce adequate cash flows to pay the plans’ projected yearly benefits and then selects the portfolio with the highest yield and uses that yield as the recommended discount rate.\nThe selection of the 5.6% weighted-average discount rate for Snap-on’s domestic pension plans as of 2024 year end (compared to 5.5% as of 2023 year end) represents the single rate that produces the same present value of cash flows as the estimated benefit plan payments. Lowering Snap-on’s domestic discount rate assumption by 50 bps would have increased Snap-on’s 2024 domestic pension expense and projected benefit obligation by approximately $3.0 million and $46.4 million, respectively. As of 2024 year end, Snap-on’s domestic projected benefit obligation comprised approximately 85% of Snap-on’s worldwide projected benefit obligation. The weighted-average discount rate for Snap-on’s foreign pension plans of 4.6% (compared to 4.3% as of 2023 year end) represents the single rate that produces the same present value of cash flows as the estimated benefit plan payments. Lowering Snap-on’s foreign discount rate assumption by 50 bps would have increased Snap-on’s 2024 foreign pension expense and projected benefit obligation by approximately $1.0 million and $12.3 million, respectively.\nActuarial gains and losses in excess of 10 percent of the greater of the projected benefit obligation or market-related value of assets are amortized on a straight-line basis over the average remaining service period of active participants or over the average remaining life expectancy for plans with primarily inactive participants. Prior service costs and credits resulting from plan amendments are amortized in equal annual amounts over the average remaining service period of active participants or over the average remaining life expectancy for plans with primarily inactive participants.\nPension income in 2024 was $6.9 million and Snap-on expects to have pension expense of approximately $16.8 million in 2025, primarily reflecting higher amortization of pension actuarial losses. \nThe projected \n2025\n pension expense is based on benefit plan status, weighted average discount rates, expected returns on plan assets, and other factors. \nTo determine the 2025 net periodic benefit cost, Snap-on is using weighted-average discount rates for its domestic and foreign pension plans of 5.6% and 4.6%, respectively, and an expected return on plan assets for its domestic pension plans of 7.5%. The expected returns on plan assets for foreign pension plans ranged from 2.2% to 6.4% as of 2024 year end. See Note 11 to the Consolidated Financial Statements for additional information on pension plans.\n2024 ANNUAL REPORT\n49\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (continued)\nOutlook\nWe believe that our markets and our operations possess and have demonstrated continuing and considerable resilience against the uncertainties of the current environment. In 2025, Snap-on expects to make ongoing progress along its decisive runways for coherent growth, leveraging capabilities already proven in the automotive repair arena, developing and expanding its professional customer base, not only in automotive repair, but in adjacent markets, additional geographies and other areas, including extending in critical industries, where the cost and penalties for failure can be high. In pursuit of these initiatives, we project that capital expenditures in 2025 will approximate\n $100 million.\nSnap-on currently anticipates that its full-year 2025 effective income tax rate will be in the range \nof 22% to 23%.\n50\nSNAP-ON INCORPORATED",
  "item2": null
}