{
  "source_file": "snps-20250731.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThis Quarterly Report on Form 10-Q (this Quarterly Report) includes forward-looking statements, which involve risks, uncertainties and other factors that could cause Synopsys, Inc.'s (Synopsys, we, our or us) actual results, time frames or achievements to differ materially from those expressed or implied in such forward-looking statements. Readers are urged to carefully review and consider the various disclosures regarding these risks and uncertainties made in this Quarterly Report, including those identified below in Part II, Item 1A, Risk Factors, and in other documents we file from time to time with the Securities and Exchange Commission (SEC). Forward-looking statements include any statements that are not statements of historical fact and include, but are not limited to, statements concerning strategies related to our products, technology and services; business and market outlook, opportunities, strategies and technological trends, such as artificial intelligence (AI); acquisitions and their expected impact, such as our recent acquisition of ANSYS, Inc. (Ansys), including unexpected difficulties or expenditures relating thereto, our ability to successfully integrate and to realize the anticipated synergies, on a timely basis or at all, and the diversion of management time on integration-related matters; planned dispositions and their expected impact, including the Regulatory Divestitures (as defined below), and their potential impact on our ability to realize the benefits of the Ansys Merger; the level of, and obligations associated with, our indebtedness, including the debts incurred in connection with the Ansys Merger (as defined below); our plan to reallocate resources in our Design IP segment to higher growth opportunities; the anticipated impact of China export control restrictions, including the Q3 2025 BIS Restrictions (as defined below); the potential impact of the uncertain macroeconomic environment on our financial results, including, but not limited to, the effects of sustained global inflationary pressures and elevated interest rates, potential economic slowdowns or recessions, supply chain disruptions, geopolitical pressures, including, among others, the unknown impact of current and future U.S. and foreign trade regulations, government actions and regulatory changes, such as export control restrictions and tariffs, and regional or global military conflicts, and fluctuations in foreign exchange rates, and associated global economic conditions; customer concentration, demand and market expansion; our planned product releases and capabilities; industry growth rates; the expected realization of our contracted but unsatisfied or partially unsatisfied performance obligations (backlog); software trends; planned stock repurchases; our expected tax rate; and the impact and result of pending legal, administrative and tax proceedings. Forward-looking statements may be identified by words including, but not limited to, “may,” “will,” “could,” “would,” “can,” “should,” “anticipate,” “expect,” “intend,” “believe,” “estimate,” “project,” “continue,” “forecast,” \"likely,\" \"potential,\" \"seek,\" or the negatives of such terms and similar expressions. The information included herein represents our estimates and assumptions as of the date of this filing. Unless required by law, we undertake no obligation to update publicly any forward-looking statements, or to update the reasons actual results could differ materially from those anticipated in these forward-looking statements, even if new information becomes available in the future. All subsequent written or oral forward-looking statements attributable to Synopsys or persons acting on our behalf are expressly qualified in their entirety by these cautionary statements.\nThe following summary and overview of our financial condition and results of operations are qualified in their entirety by the more complete discussions and should be read together with our condensed consolidated financial statements and the related notes thereto contained in Part I, Item 1 of this Quarterly Report, the risk factors set forth in Part II, Item 1A of this Quarterly Report, and with our audited consolidated financial statements and the related notes thereto contained in our Annual Report on Form 10-K for the fiscal year ended October 31, 2024, as filed with the SEC on December 19, 2024 (our Annual Report). \nOverview\nUnless otherwise noted, this Management’s Discussion and Analysis of Financial Condition and Results of Operations relates solely to our continuing operations and does not include the operations of our former Software Integrity business. See Note 3. \nDiscontinued Operations\n of the \nNotes to\n \nCondensed Consolidated Financial Statements \nfor additional information about the sale of our former Software Integrity business (the Software Integrity Divestiture).\nFinancial Performance Summary\nFor the third quarter of fiscal 2025, our results reflect strength in our Design Automation segment, including strong demand for our hardware products, offset by weakness in our Design IP segment, due to several headwinds, including China export control restrictions, such as the Q3 2025 BIS Restrictions, which disrupted customer design starts in China, weaker than expected demand from a major foundry customer, and certain roadmap and resource decisions that did not yield their intended results. In response to this weakness in our Design IP segment, we will be taking actions to sharpen our execution and reallocate resources to the highest growth opportunities. \n39\nThe following table sets forth some of our key quarterly unaudited financial information: \nThree Months Ended July 31,\nNine Months Ended July 31,\n2025*\n2024\n2025*\n2024\n(in millions, except per share amounts)\nRevenue\n$\n1,739.7 \n$\n1,525.7 \n$\n4,799.3 \n$\n4,491.5 \nCost of revenue\n$\n380.6 \n$\n290.7 \n$\n968.9 \n$\n870.3 \nOperating expenses\n$\n1,193.9 \n$\n874.9 \n$\n3,036.9 \n$\n2,576.3 \nOperating income\n$\n165.3 \n$\n360.2 \n$\n793.5 \n$\n1,044.9 \nNet income from continuing operations attributed to Synopsys\n$\n242.5 \n$\n425.9 \n$\n887.4 \n$\n1,162.4 \nNet income (loss) from discontinued operations attributed to Synopsys\n$\n— \n$\n(17.8)\n$\n(3.9)\n$\n(13.2)\nDiluted net income (loss) per share attributed to Synopsys:\nContinuing operations\n$\n1.50 \n$\n2.73 \n$\n5.61 \n$\n7.46 \nDiscontinued operations\n$\n— \n$\n(0.12)\n$\n(0.02)\n$\n(0.09)\n*The operating results of Ansys, which have been included in our financial results for the three and nine months ended July 31, 2025 for the period from July 17, 2025 through July 31, 2025, were not material to our overall results.\nFinancial performance summary for the\n \nthree months ended July 31, 2025 compared to the same period of fiscal 2024: \n•\nRevenues were $1.7 billion, an increase of $214.0 million or 14%, primarily due to revenue growth across a majority of products and geographies, offset by weakness in our Design IP segment due to several headwinds, including China \nexport control restrictions, such as the Q3 2025 BIS Restrictions,\n weaker than expected demand from a major foundry customer, and certain roadmap and resource decisions that did not yield their intended results.\n•\nTotal cost of revenue and operating expenses was $1.6 billion, an increase of $408.9 million or 35%, primarily due to increases of $196.8 million in employee-related costs resulting from headcount increases through organic growth, \n$65.7 million in legal, consulting and other professional fees mainly in connection with the Ansys Merger\n, and $63.7 million of amortization expense related to inta\nngible assets acquired from the Ansys Merg\ner.\nFinancial performance summary for the nine months ended July 31, 2025\n \ncompared to the same period of fiscal 2024: \n•\nRevenues were $4.8 billion, an increase of $307.8 million\n \nor 7%, primarily due to revenue growth across a majority of products and geographies, \npartially \noffset by the\n impact of the extra week in the first quarter of fiscal 2024 of approximately $63.2 million, and weakness in our Design IP segment due to several headwinds, \nincluding\n China export control restrictions, such as the Q3 2025 BIS Restrictions,\n weaker than expected demand from a major foundry customer, and certain roadmap and resource decisions that did not yield their intended results.\n•\nTotal cost of revenue and operating expenses was $4.0 billion, an increase of $559.2 million or 16% primarily due to increases of $330.2 million in employee-related costs resulting from headcount increases through organic growth, $121.3 million in legal, consulting and other professional fees mainly in connection with the Ansys Merger, and $63.7 million of amortization expense related to intangible assets acquired from the Ansys Merger.\nBusiness Summary\nSynopsys delivers industry-leading silicon design, IP, simulation and analysis (S&A) solutions as well as design services. We partner closely with our customers across a wide range of industries to maximize their R&D capability and productivity, powering innovation today that ignites the ingenuity of tomorrow. For more information about our business segments and product groups, see Part I, Item 1, \nBusiness\n in our Annual Report.\n40\nWe have consistently grown our revenue since 2005, despite periods of global economic uncertainty. We achieved these results because of our solid execution, leading technologies and strong customer relationships, and because we generally recognize our revenue for software licenses over the arrangement period, which typically approximates three years. See Note 2. \nSummary of Significant Accounting Policies and Basis of Presentation\n of the \nNotes to Consolidated Financial Statements \nin our Annual Report for a discussion on our revenue recognition policy\n. \nThe revenue we recognize in a particular period generally results from selling efforts in prior periods rather than the current period. As a result, decreases as well as increases in customer spending do not immediately affect our revenue in a significant way. \nOur growth strategy is focused on expanding our total addressable market by maximizing the capabilities of R&D teams across industries spanning semiconductor, high-tech, industrial, aerospace, and more with engineering solutions from silicon to systems. Our priorities are to maintain and expand our technology leadership, drive sustainable growth and efficiently scale to accelerate our strategy. Our revenue growth from period to period is expected to vary based on the mix of our time-based and upfront products. Our upfront products have grown at a faster rate than our time-based products in recent periods, which has resulted in, and may in the future result in, increased fluctuation in our business, operating results and overall financial position on a quarterly basis. Such fluctuation may be more pronounced depending on demand from our larger customers. See Part II, Item 1A,\n Risk Factors, \n\"\nOur operating results may fluctuate in the future, which may adversely affect our stock price\"\n of this Quarterly Report for further discussion on potential fluctuations in our operating results. Based on our leading technologies, customer relationships, business model, diligent expense management, and acquisition strategy, we believe that we will continue to execute our strategies successfully.\nAcquisition of Ansys\nOn July 17, 2025 (the Acquisition Date), we completed our acquisition of ANSYS, Inc. (Ansys) pursuant to the terms of the previously announced Agreement and Plan of Merger, dated as of January 15, 2024 (the Merger Agreement) by and among Synopsys, Ansys and ALTA Acquisition Corp. (Merger Sub), a Delaware corporation and a wholly owned subsidiary of Synopsys (the Ansys Merger). \nSee Note 4. \nAcquisition of Ansys \nof the \nNotes to Condensed Consolidated Financial Statements\n for more information on the Ansys Merger.\nFor more on risks related to the Ansys Merger, see Part II, Item 1A, \nRisk Factors\n, “\nRisks Related to the Ansys Merger\n\" of this Quarterly Report.\nImpact of the Current Macroeconomic and Geopolitical Environment\nUncertainty in the macroeconomic environment, including the effects of, among other things, changes in U.S. and global trade policy, including the recently proposed and enacted tariffs by the U.S. and other governments, sustained global inflationary pressures and elevated interest rates, potential economic slowdowns or recessions, supply chain disruptions, geopolitical pressures, fluctuations in foreign exchange rates, and associated global economic conditions, have resulted in increased volatility in global markets. While we have seen continued strength in the artificial intelligence and high-performance computing sectors, certain industries such as industrial, automotive and consumer electronics have recovered more slowly from recent macroeconomic uncertainty. The current uncertain macroeconomic environment has led some of our customers to postpone their decision-making, delay their drawdowns under non-cancellable commitments, decrease their spending and/or delay their payments to us. \nWe expect growth across our geographies in fiscal 2025 with the exception of China, where we are continuing to experience a challenging economic environment due to the collective impact of macroeconomic factors and Trade Restrictions (as defined below). See the discussion below under the heading \"Developments in Export Control Regulations\" and in Part II, Item 1A, \nRisk Factors, \"We are subject to governmental export and import requirements that could subject us to liability and restrict our ability to sell our products and services, which could impair our ability to compete in international markets\"\n of this Quarterly Report for further discussion of the impact of Trade Restrictions, including export control regulations, on Synopsys.\nWe are also actively monitoring the recent changes in U.S. and global trade policy, such as the recently proposed and enacted tariffs by the U.S. government. Certain countries have responded to the U.S. tariffs by imposing or threatening retaliatory tariffs. There may be additional changes to tariff levels and other aspects of global trade policy in fiscal 2025 in the U.S. and other countries due to global trade negotiations and other factors. While we are actively monitoring these changes in global trade policy and the effects they may have on our business and broader macroeconomic environment, they have not had a material impact on our business, operating results or financial condition to date.\n41\nWe are also monitoring other geopolitical pressures around the world, including, among others, changes in China-Taiwan and U.S.-China relations, the conflicts in Ukraine and the Middle East and other regional or global military conflicts. Any significant disruption caused by these or other geopolitical pressures or conflicts could materially affect our employees, business, operating results, financial condition or customers in those regions of the world. For example, Synopsys has employees, operations, customers and strategic partners in the Middle East. While we are actively monitoring the conflicts in the Middle East, at this time they have not had a material impact on our business, operating results or financial condition to date.\nWhile our time-based model provides stability to our business, operating results and overall financial position, the broader implications of these macroeconomic or geopolitical events, particularly in the long term, remain uncertain. Further, the negative impact of these events or disruptions may be deferred due to our business model. See Part II, Item 1A,\n Risk Factors, \n“\nUncertainty in the macroeconomic environment, and its potential impact on the semiconductor and electronics industries, may negatively affect our business, operating results and financial condition\n” and \"\nOur operating results may fluctuate in the future, which may adversely affect our stock price\"\n of this Quarterly Report for further discussion of the impact of global economic and geopolitical uncertainty on our business, operations and financial condition and potential fluctuations in our operating results, respectively.\nDevelopments in Export Control Regulations\nThe Bureau of Industry and Security of the U.S. Department of Commerce (BIS) has continued to publish changes to U.S. export control regulations (the U.S. Export Regulations), including, among other things, the inclusion of certain Chinese technology companies on the Entity List, restrictions on the export of electronic computer-aided design (ECAD) software specially designed for the development of ICs with Gate-All-Around Field-Effect Transistor structures, as well as controls on ECAD software for advanced semiconductor packaging involving multiple chips or chiplets, and certain other restrictions on China’s access to certain semiconductor and advanced computing technology. U.S.-China relations remain fluid, in particular with respect to trade policy and export restrictions relating to dual-use technologies. For example, on May 29, 2025, Synopsys received a so-called “is-informed” letter from the BIS imposing a license requirement for the export, reexport, or in-country transfer of EDA software and technology classified under export control classification numbers (ECCNs) 3D991 and 3E991 when a party to the transaction is located in China or is a Chinese “military end user,” wherever located (such restrictions, the Q3 2025 BIS Restrictions). The Q3 2025 BIS Restrictions were subsequently rescinded on July 2, 2025. \nChina export control restrictions, including the Q3 2025 BIS Restrictions, have negatively impacted our business in China, including in our Design IP segment, and may continue to impact design starts or other aspects of our business in China in the future. The evolving nature of U.S. Export Regulations, including the potential for new and expanded license requirements of this or similar nature, creates uncertainty regarding the current and future impacts on our business. We anticipate additional changes to the U.S. Export Regulations or other U.S. or non-U.S. export, sanctions, or similar trade requirements (collectively, the Trade Restrictions) in the future, but we cannot forecast the scope or timing of such changes, nor the impact on our business. We will continue to monitor such developments, including potential additional Trade Restrictions, new or expanded license requirements, and other regulatory or policy changes by the U.S. and foreign governments.\nFor more on risks related to government export and import restrictions such as the U.S. government’s Entity List and other U.S. or non-U.S. Export Regulations, see Part I, Item 1A, \nRisk Factors\n, “\nWe are subject to governmental export and import requirements that could subject us to liability and restrict our ability to sell our products and services, which could impair our ability to compete in international markets\n.”\nBusiness Segments\nDesign Automation.\n This segment includes our advanced silicon design, verification products and services, S&A solutions, and system integration products. This segment also includes digital, custom and field programmable gate array (FPGA) integrated circuit (IC) design software, verification software and hardware products, system integration products and services, and manufacturing software products. Designers use our EDA products to accelerate and automate the chip design process, reduce errors and enable more powerful and robust designs, with improved productivity for faster time to market. Engineers use our S&A solutions to virtually test and optimize designs across various physics domains, such as structural analysis, thermal analysis, and computational fluid dynamics (CFD).\nDesign IP.\n This segment includes our interface, foundation, security, and embedded processor IP, IP subsystems, and IP implementation services that serve companies primarily in the semiconductor and electronics industries. We are a leading provider of high-quality, silicon-proven IP solutions for system-on-chips (SoCs). This includes IP that \n42\nhas been optimized to address specific application requirements for the mobile, automotive, digital home, Internet of Things and AI/data center markets, enabling designers to quickly develop SoCs in these areas.\nFiscal Year and Fiscal Quarter End\nHistorically, our fiscal years had been 52- or 53-week periods ending on the Saturday nearest to October 31. Fiscal 2024 was a 53-week year ending on November 2, 2024.\nWe have changed our fiscal year end from the Saturday nearest to October 31 and consisting of 52 or 53 fiscal weeks to a fiscal year end of October 31 each year. The fiscal year change became effective with our fiscal 2025, which began on November 3, 2024. Our fiscal quarters will end on January 31, April 30, July 31 and October 31 of each year.\nThe third quarter of fiscal 2025 and 2024 ended on July 31, 2025 and August 3, 2024, respectively. Our results of operations for the first nine months of fiscal 2025 and fiscal 2024 included 271 days and 280 days, respectively. \nThe extra week in the first quarter of fiscal 2024 resulted in approximately $63.2 million of additional revenue, and approximately $52.5 million of additional expenses, including approximately $10.6 million in stock-based compensation costs from continuing operations. \nFor presentation purposes, this Quarterly Report refers to the closest calendar month end for the third quarter of fiscal 2024.\nCritical Accounting Estimates\nOur condensed consolidated financial statements have been prepared in accordance with U.S. generally accepted accounting principles (U.S. GAAP). In preparing these financial statements, we make estimates and assumptions that can affect the reported amounts of assets, liabilities, revenues and expenses, and net income. On an ongoing basis, we evaluate our estimates based on historical experience and various other assumptions we believe are reasonable under the circumstances. Our actual results may differ from these estimates. \nThe accounting policies that most frequently require us to make estimates and assumptions and therefore are critical to understanding our results of operations, are Revenue Recognition and Business Combinations. We updated our critical accounting estimates for Business Combinations in the third quarter of fiscal 2025. There have been no material changes in our critical accounting estimates other than those related to Business Combinations during the nine months ended July 31, 2025 since our Annual Report for fiscal 2024. \nBusiness Combinations\nWe allocate the purchase price of acquired companies to the tangible assets acquired, liabilities assumed and intangible assets acquired based upon their estimated fair values on the acquisition date with the exception of contract assets and contract liabilities (deferred revenue) which are recognized and measured on the acquisition date in accordance with our \"Revenue Recognition\" policy in Note 2. \nSummary of Significant Accounting Policies and Basis of Presentation\n, as if we had originated the contracts. The excess of the purchase price over the fair values of these net tangible and intangible assets acquired is recorded as goodwill.\nAccounting for business combinations requires management to make significant estimates and assumptions for the valuation of intangible assets. Although we believe the assumptions and estimates we have made are reasonable, they are based in part on historical experience, market conditions and information obtained from management of the acquired companies and are inherently uncertain. Examples of critical estimates in valuing certain of the intangible assets we have acquired or may acquire in the future include, but are not limited to:\n•\nfuture expected cash flows which includes estimates of software license sales, subscriptions, support agreements and consulting contracts;\n•\nprojected expenses which include cost of revenue, research and development and selling, general and administrative expenses (including estimated expenses required to generate the revenues attributable to different intangible assets);\n•\nhistorical and expected customer attrition rates and anticipated growth in revenue from acquired customers;\n•\nroyalty rates applied to acquired developed technology platforms and other intangible assets;\n•\nexpected obsolescence rates and estimated useful lives of technology-related intangible assets;\n43\n•\nthe expected use of the acquired assets; and\n•\ndiscount rates used to discount expected future cash flows to present value, which are typically derived from the implied rate of return on the transaction and a weighted-average cost of capital analysis with adjustments made to reflect inherent risks of the individual assets being valued; \nThe fair value of the definite-lived intangibles was determined using variations of the income approach.\nWith our acquisition of Ansys, the fair value of developed technologies and trade names was determined by applying the relief from royalty method under the income approach. The relief from royalty method applies a royalty rate to projected income to quantify the benefit of owning the intangible asset rather than paying a royalty for use of the asset. The economic useful life for developed technology was determined based on historical technology obsolescence patterns and prospective technological developments. The estimated economic useful life of the trade names was determined based on the expected probability of continued use of the brand asset. We assumed royalty rates ranging from 35.0% to 45.0% for existing technology, and 2.5% for trade names. The present value of operating cash flows from the existing technology and trade names was determined using discount rate of approximately 10.0%.\nCustomer relationships represent the fair value of the existing relationships with the acquired company’s customers. Their fair value was determined using the multi-period excess earnings method under the income approach, which involves isolating the net earnings attributable to the asset being measured based on the present value of the incremental after-tax cash flows (excess earnings) attributable solely to the asset over its remaining useful life. The economic useful life was determined based on historical customer turnover rates. Projected income from existing customer relationships considered customer retention rates (i.e. gross retention and net retention including upsell) ranging from 85.0% to 105.0% for the direct sales channel and 70.0% to 90.0% for the indirect sales channel. The present value of operating cash flows from existing customers was determined using a discount rate of approximately 10.0%.\nContract rights intangible (i.e. order backlog) represents contracted but unsatisfied or partially unsatisfied performance obligations, primarily related to the dollar value of purchase arrangements with customers, effective as of a given point in time, that are based on mutually agreed terms. The fair value was determined by using the multi-period excess earnings method under the income approach. The economic useful life is based on the time to achieve 90.0% of cumulative undiscounted cash flows. The present value of operating cash flows from order backlog was determined using a discount rate of approximately 5.9%. \nWe believe that our preliminary estimates and assumptions related to the fair value of acquired intangible assets are reasonable, but significant judgment is involved. As a result, during the measurement period, which will not exceed one year from the acquisition date, we may record adjustments to the assets acquired and liabilities assumed with the corresponding offset to goodwill. Upon the conclusion of the measurement period or final determination of the fair value of the purchase price of our acquisitions, whichever comes first, any subsequent adjustments are recorded to our Consolidated Statements of Income or Condensed Consolidated Statement of Income.\nResults of Operations\nRevenue\nOur revenues are generated from two business segments: the Design Automation segment and the Design IP segment. See Note 17. \nSegment Disclosure\n of the \nNotes to Condensed Consolidated Financial Statements\n in this Quarterly Report for more information about our reportable segments and revenue by geographic regions. \nFurther disaggregation of the revenues into various products and services within these two segments is summarized as follows:\nDesign Automation Segment\n•\nEDA solutions include digital, custom and FPGA IC design software, verification software and hardware products, system integration products and services, and obligations to provide unspecified updates and support services. EDA products and services are typically sold through Technology Subscription License (TSL) arrangements that grant customers the right to access and use all of the licensed products at the outset of an arrangement; software updates are generally made available throughout the entire term of the arrangement. The duration of our TSL contracts is generally three years, though it may vary for specific arrangements. We have concluded that the software licenses in TSL contracts are \n44\nnot distinct from the obligation to provide unspecified software updates to the licensed software throughout the license term, because the multiple software licenses and support represent inputs to a single, combined offering, and timely, relevant software updates are integral to maintaining the utility of the software licenses. We recognize revenue for the combined performance obligation under TSL contracts ratably over the term of the license. \n•\nIn the case of arrangements involving the sale of hardware products, we generally have two performance obligations. The first performance obligation is to transfer the hardware product, which includes software integral to the functionality of the hardware product. The second performance obligation is to provide maintenance on the hardware and its embedded software, which includes rights to technical support, hardware repairs and software updates that are all provided over the same term and have the same time-based pattern of transfer to the customer. The portion of the transaction price allocated to the hardware product is generally recognized as revenue at the time of shipment because the customer obtains control of the product at that point in time. We have concluded that control generally transfers at that point in time because the customer has the ability to direct the use of the asset and an obligation to pay for the hardware. The portion of the transaction price allocated to the maintenance obligation is recognized as revenue ratably over the maintenance term. \n•\nRevenue from Professional Service contracts is recognized over time, generally using costs incurred or hours expended to measure progress. We have a history of reasonably estimating project status and the costs necessary to complete projects. A number of internal and external factors can affect these estimates, including labor rates, utilization and efficiency variances and specification and testing requirement changes.\n•\nSimulation and analysis (S&A) solutions allow engineers to virtually test and optimize designs across various physics domains, such as structural analysis, thermal analysis, and CFD. S&A software solutions are offered as subscription solutions and also as perpetual licenses. Software subscription arrangements include bundles of time-based software licenses with support services, which includes rights to technical support and software updates that are provided over the support term and are transferred to the customer over time. In such subscription arrangements, the updates to time-based software licenses are not considered integral to maintaining the utility of the software. We consider the license and support services as separate performance obligations. In these instances, we allocate the total consideration received for the revenue arrangement to the separate performance obligations based on the standalone selling prices of the time-based software license and support service. The time-based software license revenue is presented as upfront products revenue, recognized at a point of time upon the later of the delivery date or the beginning of the license period, and the revenue related to the support service is presented as maintenance and service revenue and is recognized over the term of the arrangement. Perpetual license arrangements typically include a perpetual license sold with support services, which includes a stand-ready obligation to provide technical support and software updates over the support term. We allocate the total consideration received for the bundled perpetual and support service arrangements based on the standalone selling prices of the perpetual license and support service. Revenue from perpetual licenses is presented as upfront product revenue and is recognized at a point in time upon the later of the delivery date or the beginning of the license period. Revenue from support service is classified as maintenance and service revenue and is recognized ratably over the term of the contract, as we satisfy the support service performance obligation.\nDesign IP Segment\n•\nDesign IP includes our interface, foundation, security, and embedded processor IP, IP subsystems, and IP implementation services. These arrangements generally have two performance obligations which consist of transferring of the licensed IP and providing related support, which includes rights to technical support and software updates that are provided over the support term and are transferred to the customer over time. Revenue allocated to the IP licenses is recognized at a point in time upon the later of the delivery date or the beginning of the license period, and revenue allocated to support is recognized over the support term. Royalties are recognized as revenue in the quarter in which the applicable customer sells its products that incorporate our IP. Payments for IP contracts are generally received upon delivery of the IP. Revenue related to the customization of certain IP is recognized over time, generally using costs incurred or hours expended to measure progress.\nOur customer arrangements can involve multiple products and various license rights, and our customers negotiate with us over many aspects of these arrangements. For example, they generally request a broader portfolio of \n45\nsolutions, support and services and seek more favorable terms such as expanded license usage, future purchase rights and other unique rights at an overall lower total cost. No single factor typically drives our customers’ buying decisions, and we compete on all fronts to serve customers in highly competitive markets. Customers generally negotiate the total value of the arrangement rather than just unit pricing or volumes.\nTotal Revenue\n \nJuly 31,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(dollars in millions)\nThree months ended\nDesign Automation\n$\n1,312.1 \n$\n1,062.6 \n$\n249.5 \n23 \n%\nDesign IP\n427.6 \n463.1 \n(35.5)\n(8)\n%\nTotal\n$\n1,739.7 \n$\n1,525.7 \n$\n214.0 \n14 \n%\nNine months ended\nDesign Automation\n$\n3,454.6 \n$\n3,103.0 \n$\n351.6 \n11 \n%\nDesign IP\n1,344.7 \n1,388.5 \n(43.8)\n(3)\n%\nTotal\n$\n4,799.3 \n$\n4,491.5 \n$\n307.8 \n7 \n%\nOur revenues are subject to fluctuations, primarily due to customer requirements including customer demand, timing requirements and the value of contract renewals. For example, we experience fluctuations in our revenues due to factors such as the timing of IP product sales, Flexible Spending Account (FSA) drawdowns, royalties, and hardware products sales. As revenues from IP products sales and hardware products sales are recognized upfront, customer demand and timing requirements for such IP products and hardware products could result in increased variability of our total revenues.\nContracted but unsatisfied or partially unsatisfied performance obligations (backlog) as of July 31, 2025 were $10.1 billion, which includes $1.3 billion in non-cancellable FSA commitments from customers where actual product selection and quantities of specific products or services are to be determined by customers at a later date. We have elected to exclude future sales-based royalty payments from the remaining performance obligations. Approximately \n46% of the\n backlog as of July 31, 2025, excluding non-cancellable FSA, is expected to be recognized as revenue over the next 12 months, with the remainder recognized thereafter. The majority of the remaining backlog is expected to be recognized in the following three years.\nThe amount and composition of unsatisfied performance obligations will fluctuate period to period. We do not believe the amount of unsatisfied performance obligations is indicative of future sales or revenue, or that such obligations at the end of any given period correlates with actual sales performance of a particular geography or particular products and services. For more information regarding our revenue during the three and nine months ended July 31, 2025, including our contract balances as of such date, see Note 5. \nRevenue\n of the\n Notes to Condensed Consolidated Financial Statements \nin this Quarterly Report\n.\nThe increase in total revenues for the three and nine months ended July 31, 2025 compared to the same periods in fiscal 2024 was primarily due to revenue growth of our business across a majority of product groups and geographies, offset by weakness in our Design IP segment due to several headwinds, including China \nexport control restrictions, such as the Q3 2025 BIS Restrictions, \nweaker than expected demand from a major foundry customer, and certain roadmap and resource decisions that did not yield their intended results.\n \nThe increase for the nine-month period was also partially offset by \nthe impact of the extra week in the first quarter of fiscal 2024 of approximately $63.2 million.  \nFor a discussion of revenue by geographic areas, see Note 17. \nSegment Disclosure\n of the \nNotes to Condensed Consolidated Financial Statements \nin this Quarterly Report.\n46\nTime-Based Products Revenue\n \nJuly 31,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(dollars in millions)\nThree months ended\n$\n892.4 \n$\n803.1 \n$\n89.3 \n11 \n%\nPercentage of total revenue\n51 \n%\n53 \n%\nNine months ended\n$\n2,548.9 \n$\n2,389.9 \n$\n159.0 \n7 \n%\nPercentage of total revenue\n53 \n%\n53 \n%\nThe increase in time-based products revenue for the three and \nnine \nmonths ended July 31, 2025 compared to the same periods in fiscal 2024 was primarily attributable to an increase in TSL license revenue\n from arrangements booked in prior periods. The increase for the nine-month period was partially offset by the impact of the extra week in the first quarter of fiscal 2024.\nUpfront Products Revenue\n \nJuly 31,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(dollars in millions)\nThree months ended\n$\n516.4 \n$\n442.5 \n$\n73.9 \n17 \n%\nPercentage of total revenue\n30 \n%\n29 \n%\nNine months ended\n$\n1,395.2 \n$\n1,281.3 \n$\n113.9 \n9 \n%\nPercentage of total revenue\n29 \n%\n29 \n%\nChanges in upfront products revenue are generally attributable to normal fluctuations in the extent and timing of customer requirements, which can drive the amount of upfront orders and revenue in any particular period.\nThe increase in upfront products revenue for the \nthree and \nnine months ended July 31, 2025 compared to the same periods in fiscal 2024 was primarily due to an increase in the sale of hardware products, driven by higher demand from customers. \nUpfront products revenue as a percentage of total revenue will likely fluctuate based on the timing of IP and hardware product sales. Such fluctuations will continue to be impacted by the timing of shipments and FSA drawdowns due to customer requirements.\nMaintenance and Service Revenue\n \nJuly 31,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(dollars in millions)\nThree months ended\nMaintenance revenue\n$\n193.6 \n$\n105.8 \n$\n87.8 \n83 \n%\nProfessional service and other revenue\n137.4 \n174.3 \n(36.9)\n(21)\n%\nTotal\n$\n331.0 \n$\n280.1 \n$\n50.9 \n18 \n%\nPercentage of total revenue\n19 \n%\n18 \n%\nNine months ended\nMaintenance revenue\n$\n428.6 \n$\n318.0 \n$\n110.6 \n35 \n%\nProfessional service and other revenue\n426.6 \n502.2 \n(75.6)\n(15)\n%\nTotal\n$\n855.2 \n$\n820.2 \n$\n35.0 \n4 \n%\nPercentage of total revenue\n18 \n%\n18 \n%\nThe increase in maintenance revenue for the three \nand \nnine months ended July 31, 2025 compared to the same periods in fiscal 2024 was primarily due to an increase in the volume of arrangements that include maintenance largely due to contributions from \nAnsys following the completion of \nthe Ansys Merger.\n47\nThe decrease in professional service and other revenue for the three and nine months ended July 31, 2025 compared to the same periods in fiscal 2024 was primarily due to the timing of IP customization projects.\nCost of Revenue\n \nJuly 31,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(dollars in millions)\nThree months ended\nCost of products revenue\n$\n230.9 \n$\n179.5 \n$\n51.4 \n29 \n%\nCost of maintenance and service revenue\n103.3 \n96.6 \n6.7 \n7 \n%\nAmortization of acquired intangible assets\n46.4 \n14.5 \n31.9 \n220 \n%\nTotal\n$\n380.6 \n$\n290.6 \n$\n90.0 \n31 \n%\nPercentage of total revenue\n22 \n%\n19 \n%\nNine months ended\nCost of products revenue\n$\n616.0 \n$\n553.8 \n$\n62.2 \n11 \n%\nCost of maintenance and service revenue\n290.3 \n275.3 \n15.0 \n5 \n%\nAmortization of acquired intangible assets\n62.6 \n41.2 \n21.4 \n52 \n%\nTotal\n$\n968.9 \n$\n870.3 \n$\n98.6 \n11 \n%\nPercentage of total revenue\n20 \n%\n19 \n%\nWe divide cost of revenue into three categories: cost of products revenue, cost of maintenance and service revenue, and amortization of acquired intangible assets.\nCost of products revenue.\n Cost of products revenue includes costs related to products sold and software licensed, hardware-related costs including inventory provisions, allocated operating costs related to product support and distribution, and royalties paid to third-party vendors.\nCost of maintenance and service revenue.\n Cost of maintenance and service revenue includes costs to deliver our maintenance services, such as hotline and on-site support, production services and documentation of maintenance updates.\nAmortization of acquired intangible assets.\n Amortization of acquired intangible assets, included in cost of revenue, consists of the amortization and impairment charges of core/developed technology and certain contract rights intangible assets related to acquisitions.\nThe increase in cost of revenue for the three months ended July 31, 2025 compared to the same period in fiscal 2024 was primarily due to increases of $35.7 million in hardware-related costs including inventory provisions, $31.9 million in amortization of acquired technology-related and contract rights intangible assets mainly in connection with the Ansys Merger, and $24.1 million in employee-related costs as a result of headcount increases from organic growth, partially offset by a decrease of $5.2 million in costs to fulfill IP consulting arrangements.\nThe increase in cost of revenue for the nine months ended July 31, 2025 compared to the same period in fiscal 2024 was primarily due to increases of $53.8 million in employee-related costs as a result of headcount increases from organic growth, $39.5 million in hardware-related costs including inventory provisions, and $21.4 million in amortization of acquired technology-related and contract rights intangible assets mainly in connection with the Ansys Merger, partially offset by decreases of $8.6 million in costs to fulfill IP consulting arrangements, $4.9 million in IT and facility costs, and $2.0 million in the change in the fair value of our executive deferred compensation plan assets.\n48\nOperating Expenses\nResearch and Development\n \nJuly 31,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(dollars in millions)\nThree months ended\n$\n625.3 \n$\n508.9 \n$\n116.4 \n23 \n%\nPercentage of total revenue\n36 \n%\n33 \n%\nNine months ended\n$\n1,732.5 \n$\n1,527.5 \n$\n205.0 \n13 \n%\nPercentage of total revenue\n36 \n%\n34 \n%\nThe increase in research and development expenses for the three months ended July 31, 2025 compared to the same period in fiscal 2024 was primarily due to increases of $82.2 million in employee-related costs as a result of headcount increases from organic growth as we continue to expand and enhance our product portfolio and, to a lesser extent, from the Ansys Merger, $12.2 million in the change in the fair value of our executive deferred compensation plan assets, $11.9 million in IT and facility costs, and $10.7 million in consultant and contractor costs. \nThe increase in research and development expenses for the \nnine\n months ended July 31, 2025 compared to the same period in fiscal 2024 was primarily due to increases of $164.7 million in employee-related costs as a result of headcount increases from organic growth, as we continue to expand and enhance our product portfolio, $28.8 million in IT and facility costs, and $26.3 million in consultant and contractor costs, partially offset by a decrease of $15.4 million in the change in the fair value of our executive deferred compensation plan assets.\nSales and Marketing\n \nJuly 31,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(dollars in millions)\nThree months ended\n$\n259.5 \n$\n211.5 \n$\n48.0 \n23 \n%\nPercentage of total revenue\n15 \n%\n14 \n%\nNine months ended\n$\n683.7 \n$\n640.1 \n$\n43.6 \n7 \n%\nPercentage of total revenue\n14 \n%\n14 \n%\nThe increase in sales and marketing expenses for the three months ended July 31, 2025 compared to the same period in fiscal 2024 was primarily due to increases of $33.5 million in employee-related costs due to headcount increases from organic growth as well as from the Ansys Merger, $8.8 million in IT and facility costs, and $2.6 million in the change in the fair value of our executive deferred compensation plan assets.\nThe increase in sales and marketing expenses for the \nnine\n months ended July 31, 2025 compared to the same period in fiscal 2024 was primarily due to increases of $47.2 million in employee-related costs due to headcount increases from organic growth as well as from the Ansys Merger, and $5.5 million in IT and facility costs, partially offset by a decrease of $12.9 million in the change in the fair value of our executive deferred compensation plan assets.\nGeneral and Administrative\n \nJuly 31,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(dollars in millions)\nThree months ended\n$\n280.6 \n$\n150.4 \n$\n130.2 \n87 \n%\nPercentage of total revenue\n16 \n%\n10 \n%\nNine months ended\n$\n584.1 \n$\n396.5 \n$\n187.6 \n47 \n%\nPercentage of total revenue\n12 \n%\n9 \n%\nThe increase in general and administrative expenses for the three months ended July 31, 2025 compared to the same period in fiscal 2024 was primarily due to increases of $65.7 million in legal, consulting and other professional fees mainly in connection with the Ansys Merger, $57.0 million in employee-related costs primarily related to the \n49\nAnsys Merger, $2.7 million in depreciation and maintenance expense, and $2.1 million in the change in the fair value of our executive deferred compensation plan assets.\nThe increase in general and administrative expenses for the \nnine\n months ended July 31, 2025 compared to the same period in fiscal 2024 was primarily due to increases of $121.3 million in legal, consulting and other professional fees mainly in connection with the Ansys Merger, $64.5 million in employee-related costs primarily related to the Ansys Merger, and $4.6 million in depreciation and maintenance expense, partially offset by a decrease of $3.0 million in the change in the fair value of our executive deferred compensation plan assets.\nAmortization of Acquired Intangible Assets\nAmortization of acquired intangible assets, included in operating expenses, consists of the amortization of trademarks, trade names and customer relationships intangible assets related to acquisitions. \n \nJuly 31,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(dollars in millions)\nThree months ended\n28.6 \n4.1 \n24.5 \n598 \n%\nPercentage of total revenue\n2 \n%\n— \n%\nNine months ended\n36.6 \n12.2 \n24.4 \n200 \n%\nPercentage of total revenue\n1 \n%\n— \n%\nThe increase in amortization of acquired intangible assets for the three and nine months ended July 31, 2025 compared to the same periods in fiscal 2024 was primarily due to amortization expense related to intangible assets acquired from the Ansys Merger. See Note 6. \nGoodwill and Intangible Assets \nof the \nNotes to Condensed Consolidated Financial Statements\n for a schedule of future amortization amounts.\nInterest Expense\nJuly 31,\n2025\n2024\n$ Change\n% Change\n(dollars in millions)\nThree months ended\n(146.5)\n$\n(11.7)\n$\n(134.8)\n1,152 \n%\nPercentage of total revenue\n(8)\n%\n(1)\n%\nNine months ended\n$\n(252.0)\n$\n(20.5)\n$\n(231.5)\n1,129 \n%\nPercentage of total revenue\n(5)\n%\n— \n%\nThe increase in interest expense for the three and nine months ended July 31, 2025 as compared to the same periods in fiscal 2024 was primarily due to interest on the Senior Notes issued in the second quarter of fiscal 2025 and the borrowing under the Term Loan Agreement in the third quarter of fiscal 2025 in connection with the Ansys Merger. See Note 10. \nSenior Notes, Bridge Commitment Letter, Term Loan and Revolving Credit Facilities \nof the \nNotes to Condensed Consolidated Financial Statements \nfor further detail on our debt obligations\n.\n50\nOther Income (Expense), Net\n \nJuly 31,\n \n \n \n2025\n2024\n$ Change\n% Change\n \n(dollars in millions)\nThree months ended\nInterest income\n$\n131.4 \n$\n15.7 \n$\n115.7 \n737 \n%\nGains (losses) on assets related to deferred compensation plan \n43.4 \n25.8 \n17.6 \n68 \n%\nForeign currency exchange gains (losses)\n1.2 \n0.3 \n0.9 \n300 \n%\nGain (loss) on sale of strategic investments\n(1.2)\n— \n(1.2)\n(100)\n%\nOther, net\n(4.3)\n1.7 \n(6.0)\n(353)\n%\nTotal\n$\n170.5 \n$\n43.5 \n$\n127.0 \n292 \n%\nNine months ended\nInterest income\n$\n257.0 \n$\n40.5 \n$\n216.5 \n535 \n%\nGains (losses) on assets related to deferred compensation plan\n42.9 \n76.3 \n(33.4)\n(44)\n%\nForeign currency exchange gains (losses)\n1.1 \n3.4 \n(2.3)\n(68)\n%\nGain (loss) on sale of strategic investments\n(3.6)\n55.1 \n(58.7)\n(107)\n%\nGain on sale of building\n51.4 \n— \n51.4 \n100 \n%\nOther, net\n(13.7)\n(8.7)\n(5.0)\n57 \n%\nTotal\n$\n335.1 \n$\n166.6 \n$\n168.5 \n101 \n%\nThe increase in other income (expense) for the three months ended July 31, 2025 as compared to the same period in fiscal 2024 was primarily due to higher interest income as a result of higher average cash balances and an increase in the change in fair value of\n our executive deferred compensation plan assets.\nThe increase in other income (expense) for the nine months ended July 31, 2025 as compared to the same period in fiscal 2024 was primarily due to higher interest income as a result of higher average cash balances and the gain recognized from the sale of an office building, partially offset by the impact of gain recognized from the sale of strategic investments in the first quarter of fiscal 2024 and a decrease in the change in fair value of\n our executive deferred compensation plan assets\n.\nSegment Operating Results\nWe do not allocate certain operating expenses managed at a consolidated level to our reportable segments. These unallocated expenses consist primarily of amortization of acquired intangible assets\n, \nstock-based compensation expense, \nchanges in the fair value of deferred compensation plan\n, and acquisition/divestiture related items. See Note 17. \nSegment Disclosure\n of the \nNotes to Condensed Consolidated Financial Statements\n in this Quarterly Report for more information.\nDesign Automation Segment\n \nJuly 31,\n \n \n \n2025\n2024\nChange\n% Change\n \n(dollars in millions)\nThree months ended\nAdjusted operating income\n$\n583.8 \n$\n440.9 \n$\n142.9 \n32 \n%\nAdjusted operating margin\n44 \n%\n41 \n%\n3 \n%\n7 \n%\nNine months ended\nAdjusted operating income\n$\n1,447.2 \n$\n1,218.6 \n$\n228.6 \n19 \n%\nAdjusted operating margin\n42 \n%\n39 \n%\n3 \n%\n8 \n%\nThe increase in adjusted operating income for the three and nine months ended July 31, 2025 compared to the same periods in fiscal 2024 was primaril\ny due to an increase in revenue from our hardware business and arrangements booked in prior periods.\n51\nDesign IP Segment\n \nJuly 31,\n \n \n \n2025\n2024\nChange\n% Change\n \n(dollars in millions)\nThree months ended\nAdjusted operating income\n$\n86.0 \n$\n169.7 \n$\n(83.7)\n(49)\n%\nAdjusted operating margin\n20 \n%\n37 \n%\n(17)\n%\n(46)\n%\nNine months ended\nAdjusted operating income\n$\n363.1 \n$\n540.2 \n$\n(177.1)\n(33)\n%\nAdjusted operating margin\n27 \n%\n39 \n%\n(12)\n%\n(31)\n%\nThe decrease in adjusted operating income for the three and nine months ended July 31, 2025 compared to the same periods in fiscal 2024 \nwas primarily due to lower revenue from the impact of China export control restrictions, including the Q3 2025 BIS Restrictions, \nweaker than expected demand from a major foundry customer, and certain roadmap and resource decisions that did not yield their intended results\n, as well as an increase in employee-related costs due to headcount increases.\nIncome Taxes\nOur effective tax rate, decreased in the three months ended July 31, 2025, as compared to the same period in fiscal 2024, primarily due to the tax benefits from a full valuation allowance release against California research credits.\nOur effective tax rate decreased in the nine months ended July 31, 2025, as compared to the same period in fiscal 2024, primarily due to capital loss on the sale of our ownership in OpenLight in the first quarter of 2025 and tax benefits from a full valuation allowance release against California research credits. \nSee Note 19. \nIncome Taxes\n of the \nNotes to Condensed Consolidated Financial Statements \nin this Quarterly Report for further discussion. \nLiquidity and Capital Resources\nOur principal sources of liquidity are funds generated from our business operations and funds that may be drawn down under our revolving credit and term loan facilities. \nAs of July 31, 2025, we held $2.6 billion in cash, cash equivalents and short-term investments. We also held $5.7 million in restricted cash primarily associated with deposits for office leases and employee loan programs. Our cash equivalents consisted primarily of taxable money market mutual funds, time deposits and highly liquid investments with maturities of three months or less. Our short-term investments include U.S. government and municipal obligations, investment-grade available-for-sale debt and asset backed securities with an overall weighted-average credit rating of approximately AA.\nAs of July 31, 2025, approximately $1.3 billion of our cash and cash equivalents were domiciled in various foreign jurisdictions. We have provided for foreign withholding taxes on the undistributed earnings of certain of our foreign subsidiaries to the extent such earnings are no longer considered to be indefinitely reinvested in the operations of those subsidiaries.\nOur debt and liquidity needs increased as a result of completing the Ansys Merger. We funded the Cash Consideration in the Ansys Merger from the issuance of the Senior Notes and the borrowings under the Term Loan Agreement. See Note 10. \nSenior Notes, Bridge Commitment Letter, Term Loan and Revolving Credit Facilities\n of the \nNotes to Condensed Consolidated Financial Statements\n in this Quarterly Report for further discussion.\nAs of July 31, 2025, $194.3 million remained available for future stock repurchases under our stock repurchase program (the Program). In connection with the Ansys Merger, we have suspended the Program until we reduce our debt levels.\nDuring the second quarter of fiscal 2025, we entered into a deferred payment agreement to defer the cash settlement of the 2025 Rate Lock Agreements over a period of 5.5 years. As of July 31, 2025, we had $121.6 million outstanding balance under the deferred payment agreement related to the 2025 Rate Lock agreements. See Note \n52\n8. \nFinancial Assets and Liabilities \nof the \nNotes to Condensed Consolidated Financial Statements\n in this Quarterly Report for further discussion. \nDuring the third quarter of fiscal 2025, we borrowed the full $4.3 billion available under the Term Loan Agreement to fund a portion of the Cash Consideration and to pay transaction fees, premiums and expenses related to the Ansys Merger. As of July 31, 2025, the outstanding balance under the Term Loan Agreement was $4.3 billion. See Note 10. \nSenior Notes, Bridge Commitment Letter, Term Loan and Revolving Credit Facilities\n of the \nNotes to Condensed Consolidated Financial Statements\n in this Quarterly Report for further discussion. \nAs of July 31, 2025, we had $1.4 billion of purchase obligations, with $1.0 billion payable within 12 months. Although open purchase orders are considered enforceable and legally binding, the terms may allow us the option to cancel, reschedule and adjust our requirements based on our business needs prior to the delivery of goods or performance of services. \nThere were no other significant changes to our material cash requirements, including contractual and other obligations, as presented in Part II, Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n included in our Annual Report.\nBased on past performance and current expectations, we believe that our existing cash, cash equivalents and short-term investments and sources of liquidity, as well as the debt financing, will be sufficient to satisfy our cash requirements, including repayment of outstanding debt, over the next twelve-month period and beyond. Our future cash requirements will depend on many factors, including our rate of revenue growth, the expansion of our sales and marketing activities, the timing and extent of our spending to support our research and development efforts, and our investments in or acquisitions of businesses, applications or technologies.\nThe following sections discuss changes in our condensed consolidated statements of cash flows and other commitments of our liquidity and capital resources during the nine months ended July 31, 2025.\nCash Flows\nOur condensed consolidated statements of cash flows include cash flows related to the Software Integrity business. Significant non-cash items and capital expenditures of discontinued operations related to our Software Integrity business are presented separately in Note 3. \nDiscontinued Operations \nof the\n Notes to Condensed Consolidated Financial Statements\n in this Quarterly Report.\n \nNine Months Ended \n July 31,\n \n \n2025\n2024\n$ Change\n \n(dollars in millions)\nCash provided by operating activities\n$\n878.9 \n$\n844.2 \n$\n34.7 \nCash used in investing activities\n(16,445.7)\n(220.0)\n(16,225.7)\nCash provided by (used in) financing activities\n14,191.6 \n(211.4)\n14,403.0 \nCash Provided by Operating Activities\nWe expect cash from our operating activities to fluctuate as a result of a number of factors, including the timing of billings and collections, operating results, and the timing and amount of tax and other liability payments. Cash provided by operations is dependent primarily upon the payment terms of our license agreements. We generally receive cash from upfront arrangements much sooner than from time-based products, in which the license fee is typically paid either quarterly or annually over the term of the license.\nThe increase in cash provided by operating activities \nfor the nine months ended July 31, 2025 compared to\n the same period in fiscal 2024 was primarily due to lower disbursements for operations, including tax payments, partially offset by lower net income of $255.4 million and the unrealized loss from settlement of the interest rate treasury lock of $121.6 million in the\n second quarter of fiscal 2025\n.\nCash Used in Investing Activities\nThe increase in net cash used in investing activities for the nine months ended July 31, 2025 compared to the same period in fiscal 2024 was driven by higher cash paid for acquisitions, net of cash acquired, of $16.5 billion mainly for the Ansys Merger, partially offset by proceeds of $142.5 million received in connection with the Software Integrity \n53\nDivestiture, higher net proceeds of $98.5 million from the sales, purchases and maturities of investments, and proceeds of $74.3 million from the sale of an office building in the second quarter of fiscal year 2025.\nCash Provided by (Used in) Financing Activities\nNet cash provided by financing activities was $14.2 billion for the nine months ended July 31, 2025 compared to net cash used in financing activities of $211.4 million for the same period in fiscal 2024. The cash provided by financing activities for the nine months ended July 31, 2025 was driven by the net proceeds of $14.3 billion from the issuance of Senior Notes and the borrowing under the Term Loan Agreement. The cash used in financing activities for the nine months ended July 31, 2024 was primarily driven by the taxes paid for net share settlements of $278.6 million and the payment of bridge financing costs of $72.3 million, partially offset by the issuance of common stock of $143.1 million.\nBridge Commitment Letter, Term Loan, Revolving Credit Facilities and Senior Notes\nOn January 15, 2024, we entered into the Bridge Commitment Letter with certain financial institutions that committed to provide, subject to the satisfaction of customary closing conditions, the bridge commitment (the Bridge Commitment) for the purpose of financing a portion of the aggregate Cash Consideration in the Ansys Merger and paying related fees and expenses in connection with the Ansys Merger and the other transactions contemplated by the Merger Agreement. On October 3, 2024, we reduced the Bridge Commitment by $1.1 billion to $10.6 billion following the closing of the Software Integrity Divestiture. On March 17, 2025, we further reduced the Bridge Commitment by $9.9 billion following the issuance of the Senior Notes. On the Acquisition Date, we terminated the approximately $690.0 million in remaining Bridge Commitment, reducing total Bridge Commitment to $0.\nOn February 13, 2024, we entered into \na term loan facility credit agreement (\nthe Term Loan Agreement) in connection with the financing of the Ansys Merger. On July 17, 2025, we borrowed the full $4.3 billion available under the Term Loan Agreement to fund a portion of the Cash Consideration and to pay transaction fees, premiums and expenses related to the Ansys Merger.\nThe Term Loan Agreement provides for two tranches of senior unsecured term loans: a $1.45 billion tranche (Tranche 1) that matures on July 17, 2027 and a $2.85 billion tranche (Tranche 2) that matures on July 17, 2028. The outstanding balance under the Term Loan Agreement as of July 31, 2025 was $4.3 billion.\nUnder the Term Loan Agreement, borrowings bear interest on the principal amount outstanding at a floating rate based on, at Synopsys’ election, (i) the Adjusted Term SOFR Rate (as defined in the Term Loan Agreement) plus an applicable margin based on the credit ratings of Synopsys ranging from 0.875% to 1.375% (in the case of Tranche 1) or 1.000% to 1.500% (in the case of Tranche 2) or (ii) the ABR (as defined in the Term Loan Agreement) plus an applicable margin based on the credit ratings of Synopsys ranging from 0.000% to 0.375% (in the case of Tranche 1) or 0.000% to 0.500% (in the case of Tranche 2). \nThe Term Loan Agreement contains a financial covenant requiring that Synopsys maintain a maximum consolidated leverage ratio, as well as other non-financial covenants. As of July 31, 2025, we were in compliance with the financial covenant.\nOn February 13, 2024, we entered into a Sixth Amendment Agreement (the Sixth Amendment), which amended and restated our previous revolving credit agreement, dated as of December 14, 2022 (as amended and restated, the Revolving Credit Agreement).\nUnder the Sixth Amendment, certain amendments became effective on February 13, 2024 and certain additional amendments became effective on the Acquisition Date. The Sixth Amendment amended the financial covenant to allow netting of the cash proceeds of certain debt incurred to finance the Ansys Merger as well as certain other modifications set forth therein. The Sixth Amendment, among other things, also amended: (i) the applicable margin used to determine the interest that accrues on loans and the facility fee payable under the revolving credit facility to be based on our credit ratings, (ii) the financial covenant thresholds under the financial covenant in the Revolving Credit Agreement requiring us to maintain a maximum consolidated leverage ratio and (iii) certain conditions to borrowing, other non-financial covenants and events of default.\nThe Revolving Credit Agreement provides an unsecured $850.0 million committed multicurrency revolving credit facility and an \nunsecured uncommitted incremental revolving loan facility of up to $150.0 million. The maturity date of the revolving credit fac\nility is December 14, 2027, which may be extended at our option. \nThere was \nno\n outstanding balance under the Revolving Credit Agreement as of \nJuly 31, 2025\n.\n54\nInterest under the Revolving Credit Agreement accrues on dollar-denominated loans at a floating rate based on, at Synopsys’ election, (i) the Adjusted Term SOFR Rate plus an applicable margin based on our credit ratings ranging from 0.795% to 1.200% or (ii) the ABR plus an applicable margin based on our credit ratings ranging from 0.000% to 0.200%. In addition to the interest on any outstanding loans, Synopsys is also required to pay a facility fee on the entire portion of the revolving credit facility ranging from 0.080% to 0.175% based on the credit ratings of Synopsys on the daily amount of the revolving commitment.\nThe Revolving Credit Agreement contains a financial covenant requiring us to maintain a maximum consolidated leverage ratio, as well as other non-financial covenants. As of July 31, 2025, we were in compliance with the financial covenant.\nIn July 2018, we entered into a 12-year 220.0 million Renminbi (approximately $33.0 million) credit agreement with a lender in China to support our facilities expansion. Borrowings bear interest at a floating rate based on the 5 year Loan Prime Rate plus 0.74%. As of July 31, 2025, we had $13.0 million outstanding balance under the agreement.\nIn March 2025, we issued $10.0 billion aggregate principal amount of senior notes (the Senior Notes). Our total proceeds were approximately $9.9 billion, net of original issuance discount of $17.0 million and total issuance costs of $70.2 million. The net proceeds of the Senior Notes were used to fund a portion of the Cash Consideration in the Ansys Merger, pay related transaction fees and expenses, as well as repay Ansys' outstanding indebtedness.\nSee Note 10. \nSenior Notes, Bridge Commitment Letter, Term Loan and Revolving Credit Facilities\n of the \nNotes to Condensed Consolidated Financial Statements\n in this Quarterly Report for further discussion.\n55"
}