{
  "item1": "manufacturing solutions include Synopsys technology computer-aided design (TCAD), mask synthesis manufacturing analytics. Synopsys TCAD enables computer-aided simulations develop optimize semiconductor process technologies. also offer Proteus TM Mask Synthesis tools, CATS mask data preparation software, Yield Explorer Odyssey, Yield-Manager yield management solutions QuantumATK TM atomic-scale modeling software. Synopsys enables its customers realize benefits smart manufacturing using advanced techniques AI/ML large data sets.",
  "item7": "(dollars millions) Cash provided operating activities Cash provided (used in) investing activities Cash used financing activities Cash Provided Operating Activities expect cash operating activities fluctuate result number factors, including timing billings collections, operating results, timing amount tax other liability payments. Cash provided operations dependent primarily upon payment terms license agreements. generally receive cash upfront arrangements much sooner than time-based products revenue, which license fee typically paid either quarterly annually over term license. decrease cash provided operating activities primarily due higher federal tax payments $471.0 million, which included $187.0 million fiscal 2023 federal tax payments paid fiscal 2024 result payment deadline extensions due IRS tax relief California winter storms.",
  "item2": "Condensed Consolidated Financial Statements additional information about sale former Software Integrity business (the Software Integrity Divestiture). Financial Performance Summary third quarter fiscal 2025, results reflect strength Design Automation segment, including strong demand hardware products, offset weakness Design IP segment, due several headwinds, including China export control restrictions, such Q3 2025 BIS Restrictions, which disrupted customer design starts China, weaker than expected demand major foundry customer, certain roadmap resource decisions did not yield intended results. response weakness Design IP segment, will taking actions sharpen execution reallocate resources highest growth opportunities. following table sets forth some key quarterly unaudited financial information: Three Months Ended July 31, Nine Months Ended July 31, (in millions, except per share amounts) Net income continuing operations attributed Synopsys Net income (loss) discontinued operations attributed Synopsys Diluted net income (loss) per share attributed Synopsys: Continuing operations Discontinued operations *The operating results Ansys, which been included financial results three nine months ended July 31, 2025 period July 17, 2025 through July 31, 2025, not material overall results."
}