{
  "source_file": "so-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\n BUSINESS\nSouthern Company is a holding company that owns all of the outstanding common stock of three traditional electric operating companies, Southern Power Company, and Southern Company Gas.\n•\nThe traditional electric operating companies – Alabama Power, Georgia Power, and Mississippi Power – are each operating public utility companies providing electric service to retail customers in three Southeastern states in addition to wholesale customers in the Southeast.\n•\nSouthern Power Company is also an operating public utility company. The term \"Southern Power\" when used herein refers to Southern Power Company and its subsidiaries, while the term \"Southern Power Company\" when used herein refers only to the Southern Power parent company. Southern Power develops, constructs, acquires, owns, operates, and manages power generation assets, including renewable energy projects, and sells electricity at market-based rates in the wholesale market.\n•\nSouthern Company Gas is an energy services holding company whose primary business is the distribution of natural gas in four states – Illinois, Georgia, Virginia, and Tennessee – through the natural gas distribution utilities. Southern Company Gas is also involved in several other businesses that are complementary to the distribution of natural gas.\nSouthern Company also owns SCS, Southern Linc, Southern Holdings, Southern Nuclear, PowerSecure, and other direct and indirect subsidiaries. SCS, the system service company, has contracted with Southern Company, each of the Subsidiary Registrants, Southern Nuclear, SEGCO, and other subsidiaries to furnish, at direct or allocated cost and upon request, the following services: general executive and advisory, general and design engineering, operations, purchasing, accounting, finance, treasury, legal, tax, information technology, marketing, auditing, insurance and pension administration, human resources, systems and procedures, digital wireless communications, cellular tower space, and other services with respect to business and operations, construction management, and Southern Company power pool transactions. Southern Linc provides digital wireless communications for use by Southern Company and its subsidiary companies and also markets these services to the public and provides fiber optics services through its subsidiary, Southern Telecom, Inc. Southern Linc's system covers approximately 122,000 square miles in the Southeast. Southern Holdings is an intermediate holding company subsidiary, which invests in various projects. Southern Nuclear operates and provides services to the Southern Company system's nuclear power plants. PowerSecure develops distributed energy and resilience solutions and deploys microgrids for commercial, industrial, governmental, and utility customers.\nSee \"The Southern Company System\" herein for additional information. Also see Note 15 to the financial statements in Item 8 herein for information regarding recent acquisition and disposition activity. Segment information for the Registrants is included in Note 16 to the financial statements in Item 8 herein. Alabama Power, Georgia Power, and Mississippi Power each operate with one reportable business segment, since substantially all of their business is providing electric service to customers. Southern Power also operates its business with one reportable business segment, the sale of electricity in the competitive wholesale market.\nThe Registrants' Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and any amendments to those reports are made available on Southern Company's website, free of charge, as soon as reasonably practicable after such material is electronically filed with or furnished to the SEC. Southern Company's internet address is www.southerncompany.com.\nThe Southern Company System\nTraditional Electric Operating Companies\nThe traditional electric operating companies are vertically integrated utilities that own generation, transmission, and distribution facilities. See PROPERTIES in Item 2 herein for additional information on the traditional electric operating companies' generating facilities. Each company's transmission facilities are connected to the respective company's own generating plants and other sources of power (including certain generating plants owned by Southern Power) and are interconnected with the transmission facilities of the other traditional electric operating companies and SEGCO. For information on the state of Georgia's integrated transmission system, see \"Territory Served by the Southern Company System – Traditional Electric Operating Companies and Southern Power\" herein.\nAgreements in effect with principal neighboring utility systems provide for capacity and energy transactions that may be entered into for reasons related to reliability or economics. Additionally, the traditional electric operating companies have entered into various reliability agreements with certain neighboring utilities, each of which provides for the establishment and periodic review of principles and procedures for planning and operation of generation and transmission facilities, maintenance \nI-1\n    \nTable of Contents\n                                \nIndex to Financial Statements\nschedules, load retention programs, emergency operations, and other matters affecting the reliability of bulk power supply. The traditional electric operating companies have joined with other utilities in the Southeast to form the SERC to augment further the reliability and adequacy of bulk power supply. Through the SERC, the traditional electric operating companies are represented at the North American Electric Reliability Corporation. In 2022, the Southeast Energy Exchange Market (SEEM) began service. SEEM, whose members include the traditional electric operating companies and many of the other electric service providers in the Southeast, is an extension of the existing bilateral market where participants use an automated, intra-hour energy exchange to buy and sell power close to the time the energy is consumed, utilizing available unreserved transmission. In July 2023, the U.S. Court of Appeals for the D.C. Circuit vacated certain FERC orders related to SEEM and remanded the proceeding to the FERC. The ultimate outcome of this matter cannot be determined at this time.\nThe utility assets of the traditional electric operating companies and certain utility assets of Southern Power Company are operated as a single integrated electric system, or Southern Company power pool, pursuant to the IIC. Activities under the IIC are administered by SCS, which acts as agent for the traditional electric operating companies and Southern Power Company. The fundamental purpose of the Southern Company power pool is to provide for the coordinated operation of the electric facilities in an effort to achieve the maximum possible economies consistent with the highest practicable reliability of service. Subject to service requirements and other operating limitations, system resources are committed and controlled through the application of centralized economic dispatch. Under the IIC, each traditional electric operating company and Southern Power Company retains its lowest cost energy resources for the benefit of its own customers and delivers any excess energy to the Southern Company power pool for use in serving customers of other traditional electric operating companies or Southern Power Company or for sale by the Southern Company power pool to third parties. The IIC provides for the recovery of specified costs associated with the affiliated operations thereunder, as well as the proportionate sharing of costs and revenues resulting from Southern Company power pool transactions with third parties.\nSouthern Power and Southern Linc have secured from the traditional electric operating companies certain services which are furnished in compliance with FERC regulations.\nAlabama Power and Georgia Power each have agreements with Southern Nuclear to operate the Southern Company system's existing nuclear plants, Plants Farley, Hatch, and Vogtle. See \"Regulation – Nuclear Regulation\" herein for additional information.\nSouthern Power\nSouthern Power develops, constructs, acquires, owns, operates, and manages power generation assets, including renewable energy projects, and sells electricity at market-based rates (under authority from the FERC) in the wholesale market. Southern Power seeks opportunities to execute its strategy to create value through various transactions including acquisitions, dispositions, and sales of partnership interests, development and construction of new generating facilities, and entry into PPAs, including contracts for differences that provide the owner of a renewable facility a certain fixed price for electricity sold to the grid, primarily with investor-owned utilities, IPPs, municipalities, electric cooperatives, and other load-serving entities, as well as commercial and industrial customers. The electricity from the natural gas generating facilities owned by Southern Power is primarily sold under long-term, fixed-price capacity PPAs both with unaffiliated wholesale purchasers as well as with the traditional electric operating companies. Southern Power has attempted to insulate itself from significant fuel supply, fuel transportation, and electric transmission risks by generally making such risks the responsibility of the counterparties to its PPAs. However, Southern Power's future earnings will depend on the parameters of the wholesale market and the efficient operation of its wholesale generating assets, as well as Southern Power's ability to execute its growth strategy and to develop and construct generating facilities. Southern Power's business activities are not subject to traditional state regulation like the traditional electric operating companies, but the majority of its business activities are subject to regulation by the FERC. For additional information on Southern Power's business activities, see MANAGEMENT'S DISCUSSION AND ANALYSIS – OVERVIEW – \"Business Activities\" in Item 7 herein.\nSouthern Power Company directly owns and manages generation assets primarily in the Southeast, which are included in the Southern Company power pool, and has various subsidiaries whose generation assets are not included in the Southern Company power pool. These subsidiaries were created to own, operate, and pursue power generation facilities, either wholly or in partnership with various third parties. At December 31, 2024, Southern Power's generation fleet, which is owned in part with various partners, totaled 12,648 MWs of nameplate capacity in commercial operation (including 5,268 MWs of nameplate capacity owned by its subsidiaries). See \"Traditional Electric Operating Companies\" herein for additional information on the Southern Company power pool.\nA majority of Southern Power's partnerships in renewable facilities allow for the sharing of cash distributions and tax benefits at differing percentages, with Southern Power being the controlling partner and thus consolidating the assets and operations of the partnerships. At December 31, 2024, Southern Power had eight tax equity partnership arrangements where the tax equity \nI-2\n    \nTable of Contents\n                                \nIndex to Financial Statements\ninvestors receive substantially all of the tax benefits from the facilities, including ITCs and PTCs. In addition, Southern Power holds controlling interests in non-tax equity partnerships with its ownership interests primarily ranging from 51% to 66%.\nSee PROPERTIES in Item 2 herein for additional detail regarding Southern Power's partnership arrangements and Note 15 to the financial statements under \"Southern Power\" in Item 8 herein for additional information regarding Southern Power's acquisitions, dispositions, construction, and development projects.\nSouthern Power calculates an investment coverage ratio for its generating assets, including those owned with various partners, based on the ratio of investment under contract to total investment using the respective facilities' net book value (or expected in-service value for facilities under construction) as the investment amount. With the inclusion of investments associated with facilities under construction, as well as other capacity and energy contracts, Southern Power's average investment coverage ratio at December 31, 2024 was 96% through 2029 and 87% through 2034, with an average remaining contract duration of approximately 12 years. For the year ended December 31, 2024, approximately 46% of contracted MWs were with AAA to A- or equivalent rated counterparties, 46% were with BBB+ to BBB- or equivalent rated counterparties, and 6% were with unrated entities that either have ratemaking authority or have posted collateral to cover potential credit exposure.\nSouthern Power's electricity sales from natural gas generating facilities are primarily through long-term PPAs that consist of two types of agreements. The first type, referred to as a unit or block sale, is a customer purchase from a dedicated plant unit where all or a portion of the generation from that unit is reserved for that customer. Southern Power typically has the ability to serve the unit or block sale customer from an alternate resource. The second type, referred to as requirements service, provides that Southern Power serves the customer's capacity and energy requirements from a combination of the customer's own generating units and from Southern Power resources not dedicated to serve unit or block sales. Southern Power has rights to purchase power provided by the requirements customers' resources when economically viable. Capacity charges that form part of the PPA payments are designed to recover fixed and variable operations and maintenance costs based on dollars-per-kilowatt year and to provide a return on investment.\nSouthern Power's electricity sales from solar and wind generating facilities are also primarily through long-term PPAs; however, these solar and wind PPAs do not have a capacity charge and customers either purchase the energy output of a dedicated renewable facility through an energy charge or provide Southern Power a certain fixed price for the electricity sold to the grid. As a result, Southern Power's ability to recover fixed and variable operations and maintenance expenses is dependent upon the level of energy generated from these facilities, which can be impacted by weather conditions, equipment performance, transmission constraints, and other factors. Generally, under the renewable generation PPAs, the purchasing party retains the right to keep or resell the renewable energy credits.\nSouthern Power actively pursues replacement PPAs prior to the expiration of its current PPAs and anticipates that the revenues attributable to one customer may be replaced by revenues from a new customer; however, the expiration of any of Southern Power's current PPAs without the successful remarketing of a replacement PPA could have a material negative impact on Southern Power's earnings but is not expected to have a material impact on Southern Company's earnings.\nSouthern Company Gas\nSouthern Company Gas is an energy services holding company whose primary business is the distribution of natural gas through the natural gas distribution utilities. Southern Company Gas is also involved in several other businesses that are complementary to the distribution of natural gas, including gas pipeline investments and gas marketing services. Southern Company Gas also has an \"all other\" non-reportable segment that includes segments below the quantitative threshold for separate disclosure. See Note 15 to the financial statements under \"Southern Company Gas\" in Item 8 herein for information regarding Southern Company Gas' recent dispositions.\nGas distribution operations, the largest segment of Southern Company Gas' business, operates, constructs, and maintains approximately 78,500 miles of natural gas pipelines and 14 storage facilities, with total capacity of 157 Bcf, to provide natural gas to residential, commercial, and industrial customers. Gas distribution operations serves approximately 4.4 million customers across four states.\nGas pipeline investments primarily consists of joint ventures in natural gas pipeline investments including a 50% interest in SNG and a 50% joint ownership interest in the Dalton Pipeline. These natural gas pipelines enable the provision of diverse sources of natural gas supplies to the customers of Southern Company Gas. SNG, the largest natural gas pipeline investment, is the owner of a 7,000-mile pipeline connecting natural gas supply basins in Texas, Louisiana, Mississippi, and Alabama to markets in Louisiana, Mississippi, Alabama, Florida, Georgia, South Carolina, and Tennessee. SNG is developing a proposed pipeline project, designed to meet customer demand by increasing SNG's existing pipeline capacity by approximately 1.3 billion cubic feet per day, which the operator of the joint venture anticipates will be completed by 2029. The ultimate outcome of this matter cannot be determined at this time. See MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"Construction Programs\" in Item 7 herein for additional information.\nI-3\n    \nTable of Contents\n                                \nIndex to Financial Statements\nGas marketing services is comprised of SouthStar, which serves approximately 668,000 natural gas commodity customers, markets gas to residential, commercial, and industrial customers and offers energy-related products that provide natural gas price stability and utility bill management in competitive markets or markets that provide for customer choice.\nConstruction Programs\nThe subsidiary companies of Southern Company are engaged in continuous construction programs, including capital expenditures to accommodate existing and estimated future loads on their respective systems and to comply with environmental laws and regulations, as applicable. In 2025, the Southern Company system's construction program is expected to be apportioned approximately as follows:\nSouthern Company\n           system\n(a)(b)(c)(d)\nAlabama\n   Power\n(c)\nGeorgia\n   Power\n(d)\nMississippi Power\n(in billions)\nNew generation\n$\n3.7 \n$\n0.7 \n$\n3.0 \n$\n— \nEnvironmental compliance\n(e)\n0.2 \n0.1 \n0.2 \n— \nGeneration maintenance\n1.3 \n0.4 \n0.8 \n0.1 \nTransmission\n2.6 \n0.5 \n2.1 \n— \nDistribution\n1.9 \n0.4 \n1.4 \n0.1 \nNuclear fuel\n0.3 \n0.1 \n0.2 \n— \nGeneral plant\n1.7 \n0.7 \n1.0 \n0.1 \n11.8 \n2.9 \n8.6 \n0.3 \nSouthern Power\n(f)\n0.9 \nSouthern Company Gas\n(g)\n2.0 \nOther subsidiaries\n0.1 \nTotal\n(a)\n$\n14.8 \n$\n2.9 \n$\n8.6 \n$\n0.3 \n(a)\nTotals may not add due to rounding.\n(b)\nIncludes the Subsidiary Registrants, as well as other subsidiaries.\n(c)\nIncludes $640 million contingent upon approval by the Alabama PSC related to Alabama Power's October 2024 CCN filing. See Note 2 to the financial statements under \"Alabama Power – Petition for Certificate of Convenience and Necessity\" in Item 8 herein for additional information.\n(d)\nIncludes committed expenditures related to generation construction projects Georgia Power has bid through a request for proposals (RFP) as initiated in the 2022 IRP. Excludes all other expenditures not yet approved for Georgia Power-owned proposals in RFPs and related transmission investments. See Note 2 to the financial statements under \"Georgia Power – Integrated Resource Plans\" in Item 8 herein for additional information.\n(e)\nReflects cost estimates for environmental laws and regulations. These estimated expenditures do not include compliance costs associated with the regulation of GHG emissions or costs associated with closure and monitoring of surface impoundments and landfills in accordance with the CCR Rule and the related state rules. See MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"Environmental Matters\" and FINANCIAL CONDITION AND LIQUIDITY – \"Cash Requirements\" in Item 7 herein for additional information. No material capital expenditures are expected for non-environmental government regulations.\n(f)\nIncludes $0.4 billion related to the Millers Branch solar project and $0.3 billion related to the Kay Wind repowering project. Does not include approximately $0.7 billion for planned acquisitions and placeholder growth, which may vary materially due to market opportunities and Southern Power's ability to execute its growth strategy. See Note 15 to the financial statements under \"Southern Power\" in Item 8 herein for additional information regarding the Millers Branch solar project and the Kay Wind repowering project.\n(g)\nIncludes costs for ongoing capital projects associated with infrastructure improvement programs for certain natural gas distribution utilities that have been previously approved by their applicable state regulatory agencies. See Note 2 to the financial statements under \"Southern Company Gas\" in Item 8 herein for additional information. Also includes gas pipeline investment of approximately $0.1 billion. See MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"Construction Programs\" in Item 7 herein for information regarding this project.\nThe construction programs are subject to periodic review and revision, and actual construction costs may vary from these estimates because of numerous factors.\nThe traditional electric operating companies also anticipate continued expenditures associated with closure and monitoring of surface impoundments and landfills in accordance with the CCR Rule and the related state rules, which are reflected in the applicable Registrants' ARO liabilities. Estimated costs for 2025 total $729 million for Southern Company, primarily consisting of $364 million for Alabama Power, $309 million for Georgia Power, and $30 million for Mississippi Power.\nSee MANAGEMENT'S DISCUSSION AND ANALYSIS – FINANCIAL CONDITION AND LIQUIDITY – \"Cash Requirements\" in Item 7 herein for additional information, including estimated expenditures for construction, environmental compliance, and closure and monitoring of surface impoundments and landfills for the years 2026 through 2029.\nI-4\n    \nTable of Contents\n                                \nIndex to Financial Statements\nAlso see MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"Environmental Matters\" in Item 7 herein for additional information with respect to certain existing and proposed environmental requirements and PROPERTIES – \"Electric – Jointly-Owned Facilities\" and – \"Natural Gas – Jointly-Owned Properties\" in Item 2 herein and Note 5 to the financial statements under \"Joint Ownership Agreements\" in Item 8 herein for additional information concerning the Registrants' joint ownership of certain facilities.\nFinancing Programs\nSee MANAGEMENT'S DISCUSSION AND ANALYSIS – FINANCIAL CONDITION AND LIQUIDITY in Item 7 herein and Note 8 to the financial statements in Item 8 herein for information concerning financing programs.\nFuel Supply\nElectric\nThe traditional electric operating companies' and SEGCO's supply of electricity is primarily fueled by natural gas and coal, as well as nuclear for Alabama Power and Georgia Power. Southern Power's supply of electricity is primarily fueled by natural gas. See MANAGEMENT'S DISCUSSION AND ANALYSIS – RESULTS OF OPERATION – \"Southern Company – Electricity Business – Fuel and Purchased Power Expenses\" and MANAGEMENT'S DISCUSSION AND ANALYSIS – RESULTS OF OPERATION under \"Fuel and Purchased Power Expenses\" for each of the traditional electric operating companies in Item 7 herein for information regarding the electricity generated and the average cost of fuel in cents per net KWH generated for the years 2023 and 2024.\nSCS, acting on behalf of the traditional electric operating companies and Southern Power Company, has agreements in place for the natural gas burn requirements of the Southern Company system. For 2025, SCS has contracted for 627 Bcf of natural gas supply under agreements with remaining terms up to 10 years. In addition to natural gas supply, SCS has contracts in place for both firm natural gas transportation and storage. Management believes these contracts provide sufficient natural gas supplies, transportation, and storage to ensure normal operations of the Southern Company system's natural gas generating units. See \"Natural Gas\" herein for information on the natural gas market.\nThe traditional electric operating companies have agreements in place from which they expect to receive substantially all of their 2025 coal burn requirements. These agreements have terms ranging between one and three years. Fuel procurement specifications, emission allowances, environmental control systems, and fuel changes have allowed the traditional electric operating companies to remain within limits set by applicable environmental regulations. As new environmental regulations are proposed that impact the utilization of coal, the traditional electric operating companies' fuel mix will be monitored to help ensure compliance with applicable laws and regulations. Southern Company and the traditional electric operating companies will continue to evaluate the need to purchase additional emissions allowances, the timing of capital expenditures for environmental control equipment, and potential unit retirements and replacements. While none of Southern Company's subsidiaries are currently subject to renewable portfolio standards or similar requirements, management of the traditional electric operating companies is working with applicable regulators through their IRP processes to continue the generating fleet transition in a manner responsible to customers, communities, employees, and other stakeholders. See MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"Environmental Matters\" in Item 7 herein and Note 2 to the financial statements under \"Alabama Power – Environmental Accounting Order,\" \"Georgia Power – Integrated Resource Plans,\" and \"Mississippi Power – Integrated Resource Plans\" in Item 8 herein for additional information, including the Southern Company system's electric generating mix and plans to retire or convert to natural gas certain coal-fired generating capacity.\nAlabama Power and Georgia Power have multiple contracts covering their nuclear fuel needs for uranium, conversion services, enrichment services, and fuel fabrication with remaining terms up to 10 years. Management believes suppliers have sufficient nuclear fuel production capability to permit normal operation of the Southern Company system's nuclear generating units. Alabama Power and Georgia Power also have contracts with the United States, acting through the DOE, that provide for the permanent disposal of spent nuclear fuel. The DOE failed to begin disposing of spent fuel in 1998, as required by the contracts, and Alabama Power and Georgia Power have pursued legal remedies against the government for breach of contract. See Note 3 to the financial statements under \"Nuclear Fuel Disposal Costs\" in Item 8 herein for additional information.\nChanges in fuel prices to the traditional electric operating companies are generally reflected in fuel adjustment clauses contained in rate schedules. See \"Rate Matters – Rate Structure and Cost Recovery Plans\" herein for additional information. Southern Power's natural gas PPAs generally provide that the counterparty is responsible for substantially all of the cost of fuel.\nI-5\n    \nTable of Contents\n                                \nIndex to Financial Statements\nNatural Gas\nNatural gas remains a volatile commodity. Slight supply and demand imbalances can quickly result in significant price moves both up and down. These price movements may be short-lived, but the impacts can be pronounced. Natural gas supplies have continued to grow; however, this growth has been accompanied by LNG export growth. Forward curves project prices will remain in the mid- to high-$3 per mmBtu range through 2030; however, short-term price volatility is expected and future prices could be materially impacted by various factors, including unexpected geopolitical events as well as government policies related to natural gas and energy, including infrastructure development, production, and exports.\nSouthern Company Gas' procurement plans for natural gas supply and transportation to serve regulated utility customers are reviewed and approved by the regulatory agencies in the states where it operates. Southern Company Gas purchases natural gas supplies in the open market by contracting with producers and marketers and, for Atlanta Gas Light and Chattanooga Gas, under asset management agreements approved by the applicable state regulatory agency. Southern Company Gas also contracts for transportation and storage services from interstate pipelines that are regulated by the FERC. When firm pipeline services are temporarily not needed, Southern Company Gas may release the services in the secondary market under FERC-approved capacity release provisions or utilize asset management arrangements, thereby reducing the net cost of natural gas charged to customers for most of the natural gas distribution utilities. Peak-use requirements are met through utilization of company-owned storage facilities, pipeline transportation capacity, purchased storage services, peaking facilities, and other supply sources, arranged by either transportation customers or Southern Company Gas.\nWith the exception of Atlanta Gas Light, the natural gas distribution utilities are authorized by the relevant regulatory agencies in the states in which they serve to use natural gas cost recovery mechanisms that adjust rates to reflect changes in the wholesale cost of natural gas and ensure recovery of all costs prudently incurred in purchasing natural gas for customers. See Note 2 to the financial statements under \"Southern Company Gas – Natural Gas Cost Recovery\" in Item 8 herein for additional information.\nTerritory Served by the Southern Company System\nTraditional Electric Operating Companies and Southern Power\nThe territory in which the traditional electric operating companies provide retail electric service comprises most of the states of Alabama and Georgia, together with southeastern Mississippi. In this territory there are non-affiliated electric distribution systems that obtain some or all of their power requirements either directly or indirectly from the traditional electric operating companies. As of December 31, 2024, the territory had an area of approximately 116,000 square miles and an estimated population of approximately 17 million. Southern Power sells wholesale electricity at market-based rates across various U.S. utility markets, primarily to investor-owned utilities, IPPs, municipalities, and other load-serving entities, as well as commercial and industrial customers.\nAlabama Power is engaged, within the state of Alabama, in the generation, transmission, distribution, and purchase of electricity and the sale of electric service, at retail in approximately 400 cities and towns (including Anniston, Birmingham, Gadsden, Mobile, Montgomery, and Tuscaloosa), as well as in rural areas, and at wholesale to 11 municipally-owned electric distribution systems, all of which are served indirectly through sales to AMEA, and two rural distributing cooperative associations. The sales contract with AMEA will expire on December 31, 2025. In addition, Alabama Power sells, and cooperates with dealers in promoting the sale of, electric appliances and products and also markets and sells outdoor lighting services.\nGeorgia Power is engaged in the generation, transmission, distribution, and purchase of electricity and the sale of electric service within the state of Georgia, at retail in over 530 cities and towns (including Athens, Atlanta, Augusta, Columbus, Macon, Rome, and Savannah), as well as in rural areas, and at wholesale to OPC, MEAG Power, Dalton, various EMCs, and non-affiliated utilities. Georgia Power also markets and sells outdoor lighting services and other customer-focused utility services.\nMississippi Power is engaged in the generation, transmission, distribution, and purchase of electricity and the sale of electric service within 23 counties in southeastern Mississippi, at retail in 123 communities (including Biloxi, Gulfport, Hattiesburg, Laurel, Meridian, and Pascagoula), as well as in rural areas, and at wholesale to one municipality, six rural electric distribution cooperative associations, and one generating and transmitting cooperative.\nI-6\n    \nTable of Contents\n                                \nIndex to Financial Statements\nThe following table provides the number of retail customers served by customer classification for the traditional electric operating companies at December 31, 2024:\nAlabama Power\nGeorgia Power\nMississippi Power\n(a)\nTotal\n(b)\n(in thousands)\nResidential\n1,337 \n2,452 \n158 \n3,947 \nCommercial\n208 \n332 \n35 \n574 \nIndustrial\n6 \n11 \n— \n17 \nOther\n1 \n9 \n— \n10 \nTotal\n(b)\n1,552 \n2,804 \n193 \n4,549 \n(a)\nIncludes 423 industrial retail customers and 105 other retail customers.\n(b)\nTotals may not add due to rounding.\nFor information relating to KWH sales by customer classification for the traditional electric operating companies, see MANAGEMENT'S DISCUSSION AND ANALYSIS – RESULTS OF OPERATIONS in Item 7 herein. Also, for information relating to the sources of revenues for Southern Company, each traditional electric operating company, and Southern Power, see Item 7 herein and Note 1 to the financial statements under \"Revenues – Traditional Electric Operating Companies\" and \" – Southern Power\" and Note 4 to the financial statements in Item 8 herein.\nAs of December 31, 2024, there were 62 electric cooperative distribution systems operating in the territories in which the traditional electric operating companies provide electric service at retail or wholesale.\nPowerSouth is a generating and transmitting cooperative selling power to several distributing cooperatives, municipal systems, and other customers in south Alabama. As of December 31, 2024, PowerSouth owned generating units with more than 2,300 MWs of nameplate capacity, including an undivided 8.16% ownership interest in Alabama Power's Plant Miller Units 1 and 2. See PROPERTIES – \"Electric – Jointly-Owned Facilities\" in Item 2 herein and Note 5 to the financial statements under \"Joint Ownership Agreements\" in Item 8 herein for additional information.\nIn accordance with an agreement executed in 2021, Alabama Power began providing approximately 100 MWs of year-round capacity service to PowerSouth on February 1, 2024.\nIn 2021, Alabama Power and PowerSouth began operations under a coordinated planning and operations agreement, with a minimum term of 10 years. The agreement includes combined operations (including joint commitment and dispatch) and real-time energy sales and purchases and is expected to create energy cost savings and enhanced system reliability for both parties. Projected revenues are expected to offset any increased administrative costs incurred by Alabama Power. Under the agreement, Alabama Power has the right to participate in a portion of PowerSouth's future incremental load growth.\nAlabama Power also has a separate agreement with PowerSouth involving interconnection between their systems. The delivery of capacity and energy from PowerSouth to certain distributing cooperatives in the service territory of Alabama Power is governed by the Southern Company/PowerSouth Network Transmission Service Agreement. The rates for this service to PowerSouth are on file with the FERC.\nOPC is an EMC owned by its 38 retail electric distribution cooperatives, which provide retail electric service to customers in Georgia. OPC provides wholesale electric power to its members through its generation assets, some of which are jointly owned with Georgia Power, and power purchased from other suppliers. OPC and the 38 retail electric distribution cooperatives are members of Georgia Transmission Corporation, an EMC (GTC), which provides transmission services to its members and third parties. See PROPERTIES – \"Electric – Jointly-Owned Facilities\" in Item 2 herein and Note 5 to the financial statements under \"Joint Ownership Agreements\" in Item 8 herein for additional information regarding Georgia Power's jointly-owned facilities.\nMississippi Power has an interchange agreement with Cooperative Energy, a generating and transmitting cooperative, pursuant to which various services are provided. Cooperative Energy also has a 10-year network integration transmission service agreement with SCS for transmission service to certain delivery points on Mississippi Power's transmission system through March 31, 2031. See Note 2 to the financial statements under \"Mississippi Power – Municipal and Rural Associations Tariff\" in Item 8 herein for information on a separate shared service agreement between Mississippi Power and Cooperative Energy.\nAs of December 31, 2024, there were 72 municipally-owned electric distribution systems operating in the territory in which the traditional electric operating companies provide electric service at retail or wholesale.\nAs of December 31, 2024, 48 municipally-owned electric distribution systems and one county-owned system received their requirements through MEAG Power. MEAG Power serves these requirements from self-owned generation facilities, some of which are jointly-owned with Georgia Power, and purchases from other resources. MEAG Power also has a pseudo scheduling and services agreement with Georgia Power. Dalton serves its requirements from self-owned generation facilities, some of \nI-7\n    \nTable of Contents\n                                \nIndex to Financial Statements\nwhich are jointly-owned with Georgia Power, and through purchases from Southern Power through a service agreement. See PROPERTIES – \"Electric – Jointly-Owned Facilities\" in Item 2 herein and Note 5 to the financial statements under \"Joint Ownership Agreements\" in Item 8 herein for additional information.\nGeorgia Power has entered into substantially similar agreements with GTC, MEAG Power, and Dalton providing for the establishment of an integrated transmission system to carry the power and energy of all parties. The agreements require an investment by each party in the integrated transmission system in proportion to its respective share of the aggregate system load. See PROPERTIES – \"Electric – Jointly-Owned Facilities\" in Item 2 herein for additional information.\nSouthern Power has PPAs with Georgia Power, investor-owned utilities, IPPs, municipalities, electric cooperatives, and other load-serving entities, as well as commercial and industrial customers. See \"The Southern Company System – Southern Power\" herein and MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"Southern Power's Power Sales Agreements\" in Item 7 herein for additional information.\nSCS, acting on behalf of the traditional electric operating companies, also has a contract with SEPA providing for the use of the traditional electric operating companies' facilities at government expense to deliver to certain cooperatives and municipalities, entitled by federal statute to preference in the purchase of power from SEPA, quantities of power equivalent to the amounts of power allocated to them by SEPA from certain U.S. government hydroelectric projects.\nSouthern Company Gas\nSouthern Company Gas is engaged in the distribution of natural gas in four states through the natural gas distribution utilities. The natural gas distribution utilities construct, manage, and maintain intrastate natural gas pipelines and distribution facilities. Details of the natural gas distribution utilities at December 31, 2024 are as follows:\nUtility\nState\nNumber of customers\nApproximate miles of pipe\n(in thousands)\nNicor Gas\nIllinois\n2,284 \n34.7 \nAtlanta Gas Light\nGeorgia\n1,717 \n36.1 \nVirginia Natural Gas\nVirginia\n314 \n5.9 \nChattanooga Gas\nTennessee\n72 \n1.8 \nTotal\n4,387 \n78.5 \nFor information relating to the sources of revenue for Southern Company Gas, see Item 7 herein and Note 1 to the financial statements under \"Revenues – Southern Company Gas\" and Note 4 to the financial statements in Item 8 herein.\nCompetition\nElectric \nThe electric utility industry in the United States is continuing to evolve as a result of regulatory and competitive factors. The competition for retail energy sales among competing suppliers of energy is influenced by various factors, including price, availability, technological advancements, service, and reliability. These factors are, in turn, affected by, among other influences, regulatory, political, and environmental considerations, taxation, and supply.\nThe retail service rights of all electric suppliers in the state of Georgia are regulated by the Territorial Electric Service Act of 1973. Pursuant to standards set forth in this Act, the Georgia PSC has assigned substantially all of the land area in the state to a supplier. Notwithstanding such assignments, this Act provides that any new customer locating outside of 1973 municipal limits and having a connected load of at least 900 KWs may exercise a one-time choice for the life of the premises to receive electric service from the supplier of its choice.\nPursuant to the 1956 Utility Act, the Mississippi PSC issued \"Grandfather Certificates\" of public convenience and necessity to Mississippi Power and to six distribution rural cooperatives operating in southeastern Mississippi, then served in whole or in part by Mississippi Power, authorizing them to distribute electricity in certain specified geographically described areas of the state. The six cooperatives serve approximately 325,000 retail customers in a certificated area of approximately 10,300 square miles. In areas included in a \"Grandfather Certificate,\" the utility holding such certificate may extend or maintain its electric system subject to certain regulatory approvals; extensions of facilities by such utility, or extensions of facilities into that area by other utilities, may not be made unless the Mississippi PSC grants a CPCN. Areas included in a CPCN that are subsequently annexed to municipalities may continue to be served by the holder of the CPCN, irrespective of whether it has a franchise in the annexing municipality. On the other hand, the holder of the municipal franchise may not extend service into such newly annexed area without authorization by the Mississippi PSC.\nI-8\n    \nTable of Contents\n                                \nIndex to Financial Statements\nGenerally, the traditional electric operating companies have experienced, and expect to continue to experience, competition in their respective retail service territories in varying degrees from the development and deployment of alternative energy sources such as self-generation (as described below) and distributed generation technologies, as well as other factors. Further technological advancements or the implementation of policies in support of alternative energy sources may result in further competition.\nSouthern Power competes with investor-owned utilities, IPPs, and others for wholesale energy sales across various U.S. utility markets. The needs of these markets are driven by the demands of end users and the generation available. Southern Power's success in wholesale energy sales is influenced by various factors including reliability and availability of Southern Power's plants, availability of transmission to serve the demand, price, and Southern Power's ability to contain costs.\nAs of December 31, 2024, Alabama Power had cogeneration contracts in effect with seven industrial customers. Under the terms of these contracts, Alabama Power purchases excess energy generated by such companies. During 2024, Alabama Power purchased approximately 120 million KWHs from such companies. The related costs were immaterial.\nAs of December 31, 2024, Georgia Power had contracts in effect to purchase alternative energy generation from 40 IPPs within the state of Georgia. During 2024, Georgia Power purchased 6.9 billion KWHs from such companies at a cost of $320 million. Georgia Power also has PPAs for electricity at cogeneration facilities with six industrial customers. Payments are subject to reductions for failure to meet minimum capacity output. During 2024, Georgia Power purchased 767 million KWHs at a cost of $72 million from these facilities.\nAs of December 31, 2024, Mississippi Power had a cogeneration agreement in effect with one of its industrial customers. Under the terms of this contract, Mississippi Power purchases any excess generation. During 2024, Mississippi Power did not make any such purchases.\nNatural Gas\nSouthern Company Gas' natural gas distribution utilities do not compete with other distributors of natural gas in their exclusive franchise territories but face competition from other energy products. Their principal competitors are electric utilities and fuel oil and propane providers serving the residential, commercial, and industrial markets in their service areas for customers who are considering switching to or from a natural gas appliance.\nCompetition for heating as well as general household and small commercial energy needs generally occurs at the initial installation phase when the customer or builder makes decisions as to which types of equipment to install. Customers generally use the chosen energy source for the life of the equipment.\nCustomer demand for natural gas could be affected by numerous factors, including:\n•\nchanges in the availability or price of natural gas and other forms of energy;\n•\ngeneral economic conditions;\n•\nenergy conservation, including state-supported energy efficiency programs;\n•\nlegislation and regulations, including certain bans on the use of natural gas in new or existing construction and electrification initiatives;\n•\nthe cost and capability to convert from natural gas to alternative energy products; and\n•\ntechnological or regulatory changes resulting in displacement or replacement of natural gas appliances.\nSouthern Company Gas has natural gas-related programs that generally emphasize natural gas as the fuel of choice for customers and seek to expand the use of natural gas through a variety of promotional activities. In addition, Southern Company Gas partners with third-party entities to market the benefits of natural gas appliances.\nSeasonality and Demand\nThe demand for electric power and natural gas supply is affected by seasonal differences in the weather. While the electric power sales of some electric utilities peak in the summer, others peak in the winter. In the aggregate, during normal weather conditions, the Southern Company system's electric power sales peak during both the summer and winter. In most of the areas Southern Company Gas serves, natural gas demand peaks during the winter. As a result, the overall operating results of the Registrants in the future may fluctuate substantially on a seasonal basis. In addition, the Subsidiary Registrants have historically sold less power and natural gas when weather conditions are milder.\nSee MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"General\" and – RESULTS OF OPERATIONS – \"Southern Company Gas\" in Item 7 herein for information regarding trends in market demand for electricity and natural gas and the impact of seasonality on Southern Company Gas' business, respectively.\nI-9\n    \nTable of Contents\n                                \nIndex to Financial Statements\nRegulation\nStates\nThe traditional electric operating companies and the natural gas distribution utilities are subject to the jurisdiction of their respective state PSCs or applicable state regulatory agencies. These regulatory bodies have broad powers of supervision and regulation over public utilities operating in the respective states, including their rates, service regulations, sales of securities (except for the Mississippi PSC), and, in the cases of the Georgia PSC and the Mississippi PSC, in part, retail service territories. See \"Territory Served by the Southern Company System\" and \"Rate Matters\" herein for additional information.\nFederal Power Act\nThe traditional electric operating companies, Southern Power Company and certain of its generation subsidiaries, and SEGCO are all public utilities engaged in wholesale sales of energy in interstate commerce and, therefore, are subject to the rate, financial, and accounting jurisdiction of the FERC under the Federal Power Act. The FERC must approve certain financings and allows an \"at cost standard\" for services rendered by system service companies such as SCS and Southern Nuclear. The FERC is also authorized to establish regional reliability organizations which enforce reliability standards, address impediments to the construction of transmission, and prohibit manipulative energy trading practices.\nAlabama Power and Georgia Power are also subject to the provisions of the Federal Power Act or the earlier Federal Water Power Act applicable to licensees with respect to their hydroelectric developments. As of December 31, 2024, among the hydroelectric projects subject to licensing by the FERC are 14 existing Alabama Power generating stations having an aggregate installed capacity of 1.7 million KWs and 17 existing Georgia Power generating stations and one generating station partially owned by Georgia Power, with a combined aggregate installed capacity of 1.1 million KWs.\nIn 2013, the FERC issued a new 30-year license to Alabama Power for Alabama Power's seven hydroelectric developments on the Coosa River (Weiss, Henry, Logan Martin, Lay, Mitchell, Jordan, and Bouldin). Alabama Power filed a petition requesting rehearing of the FERC order granting the relicense seeking revisions to several conditions of the license. In 2016, the FERC issued an order granting in part and denying in part Alabama Power's rehearing request. American Rivers and Alabama Rivers Alliance also filed multiple appeals of the FERC's 2013 order for the new 30-year license, and, in 2018, the U.S. Court of Appeals for the D.C. Circuit vacated the order and remanded the proceeding to the FERC. Alabama Power continues to operate the Coosa River developments under annual licenses issued by the FERC.\nIn 2021, Alabama Power filed an application with the FERC to relicense the Harris Dam project on the Tallapoosa River. The original Harris Dam project license expired on November 30, 2023, and, in December 2023, the FERC issued an annual license for the continued operation of the Harris Dam project. The Harris Dam project will operate under annual licenses until a new long-term license is issued, which is expected by the fourth quarter 2025.\nIn 2018, Georgia Power filed applications to surrender the Langdale and Riverview hydroelectric projects on the Chattahoochee River upon their license expirations on December 31, 2023. Although the projects are not operational, the closure of the projects is subject to the closure requirements to be enforced in accordance with future FERC surrender orders.\nOn September 10, 2024, Georgia Power received a new 40-year FERC license for the Lloyd Shoals project on the Ocmulgee River.\nGeorgia Power and OPC also have a license, expiring in 2026, for the Rocky Mountain project, a pure pumped storage facility of 903,000 KW installed capacity. On December 6, 2024, OPC, as an agent for co-licensees of the project, filed an application with the FERC to relicense the project. See PROPERTIES – \"Electric – Jointly-Owned Facilities\" in Item 2 herein for additional information.\nLicenses for all projects, excluding those discussed above, expire in the years 2034-2066 for Alabama Power's projects and in the years 2034-2060 for Georgia Power's projects.\nUpon or after the expiration of each license, the U.S. government, by act of Congress, may take over the project or the FERC may relicense the project either to the original licensee or to a new licensee. In the event of takeover or relicensing to another, the original licensee is to be compensated in accordance with the provisions of the Federal Power Act, such compensation to reflect the net investment of the licensee in the project, not in excess of the fair value of the property, plus reasonable damages to other property of the licensee resulting from the severance therefrom of the property. The FERC may grant relicenses subject to certain requirements that could result in additional costs.\nThe ultimate outcome of these matters cannot be determined at this time.\nI-10\n    \nTable of Contents\n                                \nIndex to Financial Statements\nNuclear Regulation\nAlabama Power, Georgia Power, and Southern Nuclear are subject to regulation by the NRC. The NRC is responsible for licensing and regulating nuclear facilities and materials and for conducting research in support of the licensing and regulatory process, as mandated by the Atomic Energy Act of 1954, as amended; the Energy Reorganization Act of 1974, as amended; and the Nuclear Nonproliferation Act of 1978, as amended; and in accordance with the National Environmental Policy Act of 1969, as amended, and other applicable statutes. These responsibilities also include protecting public health and safety, protecting the environment, protecting and safeguarding nuclear materials and nuclear power plants in the interest of national security, and assuring conformity with antitrust laws.\nThe NRC licenses for Georgia Power's Plant Hatch Units 1 and 2 expire in 2034 and 2038, respectively. Southern Nuclear has notified the NRC of its intent to seek to renew the plant's licenses for an additional 20 years (through 2054 and 2058 for Units 1 and 2, respectively), with a license renewal application projected to be submitted by the third quarter 2025. The NRC licenses for Alabama Power's Plant Farley Units 1 and 2 expire in 2037 and 2041, respectively. Southern Nuclear has notified the NRC of its intent to seek to renew the plant's licenses for an additional 20 years (through 2057 and 2061 for Units 1 and 2, respectively), with a license renewal application projected to be submitted by the fourth quarter 2026. The NRC licenses for Plant Vogtle Units 1, 2, 3, and 4 expire in 2047, 2049, 2062, and 2063, respectively.\nSee Notes 3 and 6 to the financial statements under \"Nuclear Insurance\" and \"Nuclear Decommissioning,\" respectively, in Item 8 herein for additional information.\nEnvironmental Laws and Regulations\nSee \"Construction Programs\" herein, MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"Environmental Matters\" in Item 7 herein, and Note 3 to the financial statements under \"Environmental Remediation\" and Note 6 to the financial statements in Item 8 herein for information concerning environmental laws and regulations impacting the Registrants.\nRate Matters\nRate Structure and Cost Recovery Plans\nElectric\nThe rates and service regulations of the traditional electric operating companies are uniform for each class of service throughout their respective retail service territories. Rates for residential electric service are generally of the block type based upon KWHs used and include minimum charges. Residential and other rates contain separate customer charges. Rates for commercial service are also of the block type and, for large customers, the billing demand is generally used to determine capacity and minimum bill charges. These large customers' rates are generally based upon usage by the customer and include rates with special features to encourage off-peak usage. Additionally, Alabama Power and Mississippi Power are generally allowed by their respective state PSCs to negotiate the terms and cost of service to large customers, subject to final state PSC approval.\nThe traditional electric operating companies recover certain costs through a variety of forward-looking, cost-based rate mechanisms. Fuel and net purchased energy costs are recovered through specific fuel cost recovery provisions. These fuel cost recovery provisions are adjusted to reflect increases or decreases in such costs as needed or on schedules as required by the respective PSCs. Approved compliance, storm damage, and certain other costs are recovered at Alabama Power and Mississippi Power through specific cost recovery mechanisms approved by their respective PSCs. Certain similar costs at Georgia Power are recovered through various base rate tariffs as approved by the Georgia PSC. Costs not recovered through specific cost recovery mechanisms are recovered at Alabama Power and Mississippi Power through annual, formulaic cost recovery proceedings and at Georgia Power through periodic base rate proceedings.\nSee Note 2 to the financial statements in Item 8 herein for a discussion of rate matters and certain cost recovery mechanisms. Also see \"Integrated Resource Planning\" herein for additional information.\nThe traditional electric operating companies and Southern Power Company and certain of its generation subsidiaries are authorized by the FERC to sell power to non-affiliates, including short-term opportunity sales, at market-based prices. Specific FERC approval must be obtained with respect to a market-based contract with an affiliate.\nMississippi Power provides service under long-term contracts with rural electric cooperative associations and a municipality located in southeastern Mississippi under requirements cost-based electric tariffs which are subject to regulation by the FERC. The contracts with these wholesale customers represented 13.9% of Mississippi Power's total operating revenues in 2024.\nI-11\n    \nTable of Contents\n                                \nIndex to Financial Statements\nNatural Gas\nSouthern Company Gas' natural gas distribution utilities are subject to regulation and oversight by their respective state regulatory agencies. Rates charged to customers vary according to customer class (residential, commercial, or industrial) and rate jurisdiction. These agencies approve rates designed to provide the opportunity to generate revenues to recover all prudently-incurred costs, including a return on rate base sufficient to pay interest on debt and provide a reasonable ROE.\nWith the exception of Atlanta Gas Light, the earnings of the natural gas distribution utilities can be affected by customer consumption patterns that are largely a function of weather conditions and price levels for natural gas. The natural gas distribution utilities have weather or revenue normalization mechanisms that mitigate revenue fluctuations from customer consumption changes. Atlanta Gas Light operates in a deregulated environment in which Marketers rather than a traditional utility sell natural gas to end-use customers and earns revenue by charging rates to its customers based primarily on monthly fixed charges that are set by the Georgia PSC.\nIn addition to natural gas cost recovery mechanisms, other cost recovery mechanisms and regulatory riders, which vary by utility, allow recovery of certain costs, such as those related to infrastructure replacement programs as well as environmental remediation, energy efficiency plans, and bad debts.\nSee Note 2 to the financial statements under \"Southern Company Gas\" in Item 8 herein for a discussion of rate matters and certain cost recovery mechanisms.\nIntegrated Resource Planning\nEach of the traditional electric operating companies continually evaluates its electric generating resources in order to ensure that it maintains a cost-effective and reliable mix of resources to meet the existing and future demand requirements of its customers. In addition, each year the Southern Company system engages in a scenario planning process, developing scenarios which look out over a 30-year horizon. In 2024, scenarios included a wide range of fuel prices, load growth, and CO\n2\n prices starting between $0 and $50 per metric ton of CO\n2\n emitted and escalating over the 30-year horizon. See MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"Environmental Matters\" in Item 7 herein for a discussion of existing and potential environmental regulations that may impact the future generating resource needs of the traditional electric operating companies, as well as a discussion of the Southern Company system's continued generating fleet transition.\nAlabama Power\nTriennially, Alabama Power provides an IRP report to the Alabama PSC. This report overviews Alabama Power's resource planning process and contains information that serves as the foundation for certain decisions affecting Alabama Power's portfolio of supply-side and demand-side resources. The IRP report facilitates Alabama Power's ability to provide reliable and cost-effective electric service to customers, while accounting for the risks and uncertainties inherent in planning for resources sufficient to meet expected customer demand. Under State of Alabama law, a CCN must be obtained from the Alabama PSC before Alabama Power constructs any new generating facility, unless such construction is an ordinary extension of an existing system in the usual course of business. Alabama Power provided its most recent IRP to the Alabama PSC during 2022. On October 30, 2024, Alabama Power filed a petition for a CCN with the Alabama PSC for authorization to procure additional generating capacity through the acquisition of the Lindsay Hill Generating Station. Alabama Power expects to complete the acquisition by the end of the third quarter 2025. See Note 2 to the financial statements under \"Alabama Power – Petition for Certificate of Convenience and Necessity\" in Item 8 herein for additional information.\nGeorgia Power\nTriennially, Georgia Power must file an IRP with the Georgia PSC that specifies how it intends to meet the future electric service needs of its customers through a combination of demand-side and supply-side resources. The Georgia PSC, under state law, must certify any new demand-side or supply-side resources for Georgia Power to receive cost recovery. Once certified, the lesser of actual or certified construction costs and purchased power costs is recoverable through rates. Certified costs may be excluded from recovery only on the basis of fraud, concealment, failure to disclose a material fact, imprudence, or criminal misconduct. In 2022, the Georgia PSC approved Georgia Power's 2022 IRP, as modified by a stipulation among Georgia Power, the staff of the Georgia PSC, and certain intervenors and as further modified by the Georgia PSC. On April 16, 2024, the Georgia PSC approved Georgia Power's updated IRP as modified by a stipulation among Georgia Power, the staff of the Georgia PSC, and certain intervenors. On January 31, 2025, Georgia Power filed its triennial IRP with the Georgia PSC. The ultimate outcome of this matter cannot be determined at this time. See Note 2 to the financial statements under \"Georgia Power – Integrated Resource Plans\" and \" – Rate Plans\" in Item 8 herein for additional information.\nI-12\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMississippi Power\nTriennially, Mississippi Power must file an IRP with the Mississippi PSC, as well as an update at approximately the mid-point of the three-year cycle. The IRP must include long-term plans to best meet the needs of electric utility customers through a combination of demand-side and supply-side resources and considering transmission needs. The IRP filing is not intended to supplant or replace the Mississippi PSC's existing regulatory processes for petition and approval of CPCNs for new generating resources. On April 26, 2024, Mississippi Power filed its 2024 IRP with the Mississippi PSC. The Mississippi PSC did not note any deficiencies within the prescribed 120-day review period; therefore, the filing is concluded. The 2024 IRP included a schedule to retire Plant Watson Unit 4 and Plant Greene County Units 1 and 2 and to retire early Plant Daniel Units 1 and 2, all by the end of 2028, which is consistent with the completion of Mississippi Power's affiliate PPA with Georgia Power. On January 9, 2025, Mississippi Power notified the Mississippi PSC of its intent to extend the retirement date of Plant Daniel Unit 2 and potentially extend the retirement dates of other fossil steam units beyond their current 2028 retirement dates in order to serve recently signed economic development loads of approximately 600 MWs. Mississippi Power must also file an annual report on energy delivery improvements, the latest of which was filed in November 2024. See Note 2 to the financial statements under \"Mississippi Power – Integrated Resource Plans\" and \" – Plant Daniel\" in Item 8 herein for additional information.\nHuman Capital\nSouthern Company system management is committed to attracting, developing, and retaining a sustainable workforce and aims to foster a culture of belonging where all employees feel valued. The Southern Company system's values – safety first, intentional inclusion, act with integrity, and superior performance – guide behavior. The Southern Company system had approximately 28,600 employees on its payroll at December 31, 2024 comprised of the following:\nAt December 31, 2024\n(*)\nAlabama Power\n6,200\nGeorgia Power\n6,800\nMississippi Power\n1,000\nSouthern Power\n500\nSouthern Company Gas\n4,900\nSCS\n4,400\nSouthern Nuclear\n3,700\nPowerSecure and other\n1,100\nTotal Southern Company system\n28,600\n(*)\nNumbers are rounded to 100s.\nAll Southern Company system employees are located within the United States. Part-time employees represent less than 1% of total employees.\nSouthern Company system management values an inclusive and innovative workforce. Southern Company's subsidiaries have policies, programs, and processes to help ensure that all groups are included and fairly treated across all job levels. The Southern Company system encourages different ideas and points of view, and its Code of Ethics affirms its expectation that employees treat each other with fairness, respect, and dignity. The Southern Company Board of Directors and management believe that diverse perspectives and experiences are important to help inform management of risk, business strategy, and innovation. Southern Company management leads the Southern Company system's intentional inclusion initiatives and employee recruitment, retention, and development efforts. The Board, principally through its Compensation and Talent Development Committee, oversees these efforts.\nSouthern Company system management supports various employee-led groups and facilitates mentoring programs to provide formal and informal networks of colleagues that can help promote belonging, improve employee retention, and support development. At December 31, 2024, people of color and women represented 31% and 26%, respectively, of the Southern Company system's workforce.\nSouthern Company system management recognizes the importance of attracting and retaining an appropriately qualified workforce. Southern Company system management uses a variety of strategies to attract and retain talent, including working with high schools, technical schools, universities, and military installations to fill many entry-level positions. The recruiting strategy also includes partnerships with professional associations and local communities to recruit mid-career talent. The addition of external hires augments the existing workforce to meet changing business needs, address any critical skill gaps, and supplement and enhance the Southern Company system's talent pipeline.\nI-13\n    \nTable of Contents\n                                \nIndex to Financial Statements\nThe Southern Company system supports the well-being of its employees through a comprehensive total rewards strategy with three measurable categories: physical, financial, and emotional well-being. The Southern Company system provides competitive salaries, annual incentive awards for nearly all employees, and health, welfare, and retirement benefits. The Southern Company system has a qualified defined benefit, trusteed pension plan and a qualified defined contribution, trusteed 401(k) plan which provides a competitive company-matching contribution. Substantially all Southern Company system employees are eligible to participate in these plans. There are differences between the pension plan benefit formulas based on when and by which subsidiary an employee is hired. See Note 11 to the financial statements in Item 8 herein for additional information. At December 31, 2024, the average age of the Southern Company system employees was 44 and the average tenure with the Southern Company system was 14 years. Turnover rate, calculated as the percent of employees that terminated employment with the Southern Company system, including voluntary and involuntary terminations and retirements, divided by total employees, was 7.2%.\nSouthern Company system management is committed to developing talent and helping employees succeed by providing development opportunities along with purposeful people moves as part of individual development plans and succession planning processes. The Southern Company system has multiple development programs, including programs targeted toward all employees, high potential employees, first-level managers, managers of managers, and executives. Additionally, Southern Company system management strives to deliver consistent needs-based training and solutions as workplace needs evolve.\nSouthern Company system management believes the safety of employees and customers is paramount. The Southern Company system seeks to meet or exceed applicable laws and regulations while continually improving its safety technologies and processes. The Southern Company System Safety and Health Council, which includes leaders from each Registrant, works collectively across the Southern Company system to provide safety leadership, share learning, work collaboratively to address safety-related issues, and govern the consistency of safety programs. The safety programs are focused on the prevention and elimination of life-altering events, serious injuries, and fatalities. These programs include continuous process improvements to put critical controls in place to prevent serious injuries, promote learning, and implement appropriate corrective actions. Southern Company's safety metrics include the serious injury rate and the number of fatalities. The serious injury rate represents the number of incidents per 100 employees and is calculated by taking the number of serious injuries multiplied by 200,000 workhours and dividing by the total employee workhours during the year. In 2024, the Southern Company system had a serious injury rate of 0.05, among its lowest rate in the past five years. Unfortunately, the Southern Company system had two fatalities in 2024. A serious injury is one that is life-threatening or life-changing (temporary or permanent) for the employee. Serious injury examples, as defined by applicable safety regulators, include fatalities, amputations, trauma to organs, certain bone fractures, certain soft tissue injuries, severe burns, and eye injuries.\nThe Southern Company system also has longstanding relationships with labor unions. The traditional electric operating companies, Southern Nuclear, and the natural gas distribution utilities have separate agreements with local unions of the IBEW, which generally apply to operating, maintenance, and construction employees. These agreements cover wages, benefits, terms of the pension plans, working conditions, and procedures for handling grievances and arbitration. The Southern Company system also partners with the IBEW to provide training programs to develop technical skills and career opportunities.\nAt December 31, 2024, approximately 32% of Southern Company system employees were covered by agreements with unions, with agreements expiring between 2025 and 2029.\nI-14\n    \nTable of Contents\n                                \nIndex to Financial Statements",
  "item7": "Item 7.\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nPage\nCombined Management's Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nII-\n3\nResults of Operations\nII-\n7\nSouthern Company\nII-\n7\nAlabama Power\nII-\n16\nGeorgia Power\nII-\n20\nMississippi Power\nII-\n25\nSouthern Power\nII-\n28\nSouthern Company Gas\nII-\n31\nFuture Earnings Potential\nII-\n36\nAccounting Policies\nII-\n46\nFinancial Condition and Liquidity\nII-\n51\nThis section generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 that are not included in this Annual Report on Form 10-K can be found in Item 7 of each Registrant's Annual Report on Form 10-K for the year ended December 31, 2023, which was filed with the SEC on February 14, 2024. The following Management's Discussion and Analysis of Financial Condition and Results of Operations is a combined presentation; however, information contained herein relating to any individual Registrant is filed by such Registrant on its own behalf and each Registrant makes no representation as to information related to the other Registrants.",
  "item2": null
}