{
  "source_file": "so-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations.\nPage\nCombined Management's Discussion and Analysis of Financial Condition and Results of Operations\nOverview\n98\nResults of Operations\n101\nSouthern Company\n101\nAlabama Power\n109\nGeorgia Power\n113\nMississippi Power\n119\nSouthern Power\n123\nSouthern Company Gas\n127\nFuture Earnings Potential\n133\nAccounting Policies\n139\nFinancial Condition and Liquidity\n139\nThe following Management's Discussion and Analysis of Financial Condition and Results of Operations is a combined presentation; however, information contained herein relating to any individual Registrant is filed by such Registrant on its own behalf and each Registrant makes no representation as to information related to the other Registrants.\n97\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS\nOVERVIEW\nSouthern Company is a holding company that owns all of the common stock of three traditional electric operating companies (Alabama Power, Georgia Power, and Mississippi Power), Southern Power, and Southern Company Gas and owns other direct and indirect subsidiaries. The primary businesses of the Southern Company system are electricity sales by the traditional electric operating companies and Southern Power and the distribution of natural gas by Southern Company Gas. Southern Company's reportable segments are the sale of electricity by the traditional electric operating companies, the sale of electricity in the competitive wholesale market by Southern Power, and the sale of natural gas and other complementary products and services by Southern Company Gas. Alabama Power, Georgia Power, and Mississippi Power each operate with one reportable business segment, since substantially all of their business is providing electric service to customers. Southern Power also operates its business with one reportable business segment, the sale of electricity in the competitive wholesale market. Southern Company Gas' reportable segments are gas distribution operations, gas pipeline investments, and gas marketing services. See Note (L) to the Condensed Financial Statements herein for additional information on segment reporting. For additional information on the Registrants' primary business activities, see BUSINESS – \"The Southern Company System\" in Item 1 of the Form 10-K.\nThe Registrants continue to focus on several key performance indicators. For the traditional electric operating companies and Southern Company Gas, these indicators include, but are not limited to, customer satisfaction, plant availability, electric and natural gas system reliability, and execution of major construction projects. Southern Company Gas also continues to focus on several operating metrics, including Heating Degree Days, customer count, and volumes of natural gas sold. For Southern Power, key performance indicators include, but are not limited to, the equivalent forced outage rate and contract availability to evaluate operating results and help ensure its ability to meet its contractual commitments to customers. In addition, Southern Company and the Subsidiary Registrants focus on earnings per share and net income, respectively, as a key performance indicator.\nRecent Developments\nAlabama Power\nOn June 5, 2025, the Alabama PSC approved an order authorizing Alabama Power to implement changes related to the Jurisdictional Separation Study (JSS) under Rate RSE, which allocates costs between retail and other electric services. For 2026, a revised JSS allocation factor will account for system capacity previously allocated to wholesale electric services that will be used for retail electric service starting January 1, 2026. In addition, Alabama Power is authorized to establish a regulatory asset to defer certain costs associated with this capacity for 2026, and those costs are estimated to be approximately $100 million. Beginning in 2027, Alabama Power will amortize the regulatory asset on a levelized basis over a period not exceeding 10 years.\nOn August 13, 2025, the Alabama PSC approved Alabama Power's petition for a certificate of convenience and necessity authorizing Alabama Power to complete the acquisition of Tenaska Alabama Partners, L.P., which had been approved by the FERC on June 6, 2025. The transaction closed on September 30, 2025. See Notes (B) and (K) to the Condensed Financial Statements under \"Alabama Power – Petition for Certificate of Convenience and Necessity\" and \"Alabama Power,\" respectively, herein for additional information.\nOn October 7, 2025, the Alabama PSC issued an order authorizing Alabama Power to establish a regulatory liability for nuclear PTCs received through its nuclear generating facilities pursuant to Internal Revenue Code §45U for tax years 2024 through 2032. For the 2024 tax year, Alabama Power claimed §45U PTCs on Southern Company's consolidated tax return. The base credit amount of $36 million is included in a regulatory liability. Additionally, Alabama Power claimed the prevailing wage multiplier on its 2024 federal income tax return for a total credit claimed of $180 million. The §45U PTCs will be deferred as a regulatory liability until the Alabama PSC provides direction on how to apply them for the benefit of customers. The ultimate outcome of this matter cannot be determined at this time. See Note (B) to the Condensed Financial Statements under \"Alabama Power – Nuclear Production Tax Credits Order\" herein for additional information.\n98\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nGeorgia Power\n2022 ARP\nOn July 1, 2025, the Georgia PSC approved a settlement agreement among Georgia Power, the staff of the Georgia PSC, and certain intervenors to extend the 2022 ARP for an additional three-year term through December 31, 2028 (ARP Extension). Under the ARP Extension, base rates will not be adjusted in 2026, 2027, or 2028 except for reasonable and prudent storm damage costs incurred through December 31, 2025, which will be determined in a separate regulatory proceeding.\nUnder the ARP Extension, Georgia Power's retail ROE set point will continue at 10.50% and its equity ratio will continue at 56%. Additionally, the retail ROE range approved by the Georgia PSC in the 2022 ARP, of 9.50% to 11.90%, will continue.\nSee Note (B) to the Condensed Financial Statements under \"Georgia Power – 2022 ARP\" herein for additional information.\nIntegrated Resource Plans\nOn September 4, 2025, the Georgia PSC approved Georgia Power's June 2025 request to certify a Georgia Power-owned battery energy storage facility with a capacity of 200 MWs and a projected COD in 2027.\nOn July 30, 2025, Georgia Power requested certification from the Georgia PSC, for which a final decision is expected to be rendered in December 2025, for the following resources:\n•\nAs included in the 2022 IRP final order, Georgia Power initiated a request for proposals (RFP) of up to 8,500 MWs of capacity from a variety of resources with projected CODs or delivery commencement dates between 2028 and 2030. The RFP resulted in 18 resources, totaling 7,999 MWs, being selected.\n•\nIn July 2025, Georgia Power extended 50 MWs of an existing 750-MW affiliate PPA with Mississippi Power for an additional year through December 31, 2029.\n•\nAdditionally, in July 2025, Georgia Power executed a 20-year non-affiliate PPA for 930 MWs commencing in 2030 and five 25-year non-affiliate PPAs totaling 646 MWs commencing in 2027.\n•\nGeorgia Power entered into agreements to initiate acquisition of property and construction of a 260-MW Georgia Power-owned battery energy storage facility with a projected COD in 2027 to be paired with an existing non-affiliate solar PPA.\nThe certification requests in June and July 2025 associated with these Georgia Power-owned projects and related transmission investments total approximately $16.7 billion, excluding AFUDC.\nThe ultimate outcome of these matters cannot be determined at this time. See Note (B) to the Condensed Financial Statements under \"Georgia Power – Integrated Resource Plans\" and FINANCIAL CONDITION AND LIQUIDITY – \"Cash Requirements\" herein for additional information.\n2025 IRP\nOn July 15, 2025, the Georgia PSC approved Georgia Power's 2025 IRP, as modified by a stipulation among Georgia Power, the staff of the Georgia PSC, and certain intervenors. In the 2025 IRP decision, the Georgia PSC approved several requests, including the following:\n•\nExtended operation of Plant Scherer Unit 3 (614 MWs based on 75% ownership) through at least December 31, 2035 and Plant Gaston Units 1 through 4 (500 MWs based on 50% ownership through SEGCO) through December 31, 2034.\n•\nInstallation of environmental controls and natural gas co-firing at Plant Bowen Units 1 through 4 (3,160 MWs), Plant Scherer Units 1 and 2 (137 MWs based on 8.4% ownership), and Plant Scherer Unit 3 for compliance with both ELG supplemental rules and GHG rules.\n99\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\n•\nUpgrades to Plant McIntosh Units 10 and 11 (1,319 MWs) for a projected 194 MWs of incremental capacity by 2028 and Plant McIntosh Units 1 through 8 (640 MWs) for a projected 74 MWs of incremental capacity by 2033.\n•\nUpgrades to Plant Vogtle Units 1 and 2 (1,060 MWs based on 45.7% ownership) for a projected 54 MWs of incremental capacity, some of which could be available as early as 2028.\n•\nInvestments related to the continued reliable hydro operations of four facilities, as well as the authority to spend up to $25 million to undertake engineering studies related to two additional hydro facilities.\n•\nRFP for at least 1,100 MWs of utility scale and distributed generation renewable resources.\nSee Note (B) to the Condensed Financial Statements under \"Georgia Power – Integrated Resource Plans\" herein for additional information.\nMississippi Power\nOn April 3, 2025, the FERC approved a settlement agreement filed by Mississippi Power and Cooperative Energy in December 2024, as part of the MRA tariff.\nOn June 17, 2025, the Mississippi PSC approved Mississippi Power's annual retail PEP filing for 2025, resulting in an annual increase in revenues of approximately 4.0%, or $41 million. In accordance with the PEP rate schedule, an increase of 2.0% of total retail revenues, or approximately $22 million, became effective with the first billing cycle of April 2025, and the remaining approximately $19 million became effective with the first billing cycle of July 2025.\nOn June 19, 2025, the Florida PSC issued a final order approving the transfer of FP&L's 50% ownership interest in Plant Daniel Units 1 and 2 to Mississippi Power. On July 30, 2025, Mississippi Power completed the acquisition of FP&L's 50% interest in Plant Daniel Units 1 and 2 and, as part of the acquisition, received approximately $36 million from FP&L, which was recorded as a regulatory liability and is being amortized to offset incremental costs as authorized by the Mississippi PSC.\nSee Note (B) to the Condensed Financial Statements under \"Mississippi Power\" herein for additional information.\nSouthern Power\nDuring the nine months ended September 30, 2025, Southern Power continued the development project to repower 200 MWs of the 299-MW Kay Wind facility and began development projects to repower the full capacity of the 147-MW Grant Plains, the 152-MW Grant Wind, and the 257-MW Wake Wind facilities. The output of the development projects is contracted under new and amended PPAs, with commercial operations projected to occur between the third quarter 2026 and the second quarter 2027. The ultimate outcome of these matters cannot be determined at this time. See Note (K) to the Condensed Financial Statements under \"Southern Power – Wind Repowering Projects\" herein for additional information.\nIn July 2025, Southern Power notified the Class A members of its intent to exercise the option to purchase all Class A membership interests in the SP Wind tax equity partnership on December 31, 2025 under the terms of the limited liability agreement. See Note (E) to the Condensed Financial Statements under \"Southern Power\" herein for additional information.\nAt September 30, 2025, Southern Power's average investment coverage ratio for its generating assets, including those owned with various partners, based on the ratio of investment under contract to total investment using the respective facilities' net book value (or expected in-service value for facilities under construction) as the investment amount was 96% through 2029 and 89% through 2034, with an average remaining contract duration of approximately 12 years.\nSouthern Company Gas\nOn August 12, 2025, Virginia Natural Gas, the Virginia Commission staff, and certain intervenors entered into a stipulation related to Virginia Natural Gas' August 2024 general base rate case filing. The stipulation provides for a \n100\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\n$40 million increase in annual base rate revenues, including the recovery of investments under the SAVE program, an ROE of 9.85%, and an equity ratio of 49.35%. Interim rates became effective January 1, 2025, subject to refund, based on Virginia Natural Gas' original requested increase of approximately $63 million. The Virginia Commission is expected to issue an order on the requested increase in the fourth quarter 2025. The ultimate outcome of this matter cannot be determined at this time.\nRESULTS OF OPERATIONS\nSouthern Company\nNet Income\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$176\n11.5\n$58\n1.5\nConsolidated net income attributable to Southern Company was $1.7 billion ($1.55 per share) in the third quarter 2025 compared to $1.5 billion ($1.40 per share) for the corresponding period in 2024. The increase was primarily due to an increase in retail electric revenues associated with rates and pricing and sales growth, as well as a decrease in taxes other than income taxes, partially offset by an increase in depreciation and amortization.\nFor year-to-date 2025, consolidated net income attributable to Southern Company was $3.93 billion ($3.56 per share) compared to $3.87 billion ($3.53 per share) for the corresponding period in 2024. The increase was primarily due to an increase in retail electric revenues associated with rates and pricing and sales growth and increases in other revenues, allowance for equity funds used during construction, and natural gas revenues associated with base rate increases, partially offset by increases in depreciation and amortization, non-fuel operations and maintenance expenses, and interest expense.\nRetail Electric Revenues\nIn the third quarter 2025, retail electric revenues were $5.7 billion compared to $5.4 billion for the corresponding period in 2024. For year-to-date 2025, retail electric revenues were $15.1 billion compared to $13.8 billion for the corresponding period in 2024. Details of the changes in retail electric revenues were as follows:\n \nThird Quarter 2025 vs. \nThird Quarter 2024\nYear-to-Date 2025 vs.\n Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\nRates and pricing\n$\n218 \n4.1 \n%\n$\n772 \n5.6 \n%\nSales growth\n97 \n1.8 \n172 \n1.2 \nWeather\n(68)\n(1.3)\n(52)\n(0.4)\nFuel and other cost recovery\n94 \n1.8 \n381 \n2.8 \nRetail electric revenues\n$\n341 \n6.4 \n%\n$\n1,272 \n9.2 \n%\nChanges in rates and pricing resulted in a\nn increase \nin revenues in the \nthird quarter\n and year-to-date 2025 when compared to the corresponding periods in 2024 primarily due to base tariff increases and increased ECCR tariff revenues at Georgia Power in accordance with the 2022 ARP and \nan increase in Rate RSE at Alabama Power. Also contributing to the year-to-date 2025 increase were the inclusion of Plant Vogtle Unit 4 in retail rates net of elimination of the NCCR tariff and higher contributions from commercial and industrial customers with variable demand-driven pricing, both at Georgia Power. See Note 2 to the financial statements under \"Alabama Power\" and \"Georgia Power\" in Item 8 of the Form 10-K for additional information.\nChanges in sales resulted in an increase in revenues in the third quarter and year-to-date 2025 when compared to the corresponding periods in 2024. Weather-adjusted residential KWH sales increased 2.7% in the third quarter 2025\n \nprimarily due to increased customer usage and customer growth. Weather-adjusted residential KWH sales increased \n101\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\n1.2% for \nyear-to-date 2025 \nprimarily due to customer growth. Weather-adjusted commercial KWH sales increased 3.5% and 2.6% in the third quarter\n and year-to-date 2025, respectively\n, primarily due to increased customer usage, largely driven by data centers at Georgia Power. Industrial KWH sales increased 1.5% in the third quarter 2025 primarily due to increases in the primary metals and electronics sectors. Industrial KWH sales increased 1.6% for\n year-to-date 2025 \nprimarily due to increases in the primary metals, paper, and electronics sectors, partially offset by decreases in the pipeline and textiles sectors.\nFuel and other cost recovery revenues increased $94 million and $381 million in the third quarter and year-to-date 2025, respectively, compared to the corresponding periods in 2024 primarily due to higher recoverable fuel costs. Electric rates for the traditional electric operating companies include provisions to adjust billings for fluctuations in fuel costs, including the energy component of purchased power costs. Under these provisions, fuel revenues generally equal fuel expenses, including the energy component of PPA costs, and do not affect net income. The traditional electric operating companies each have one or more regulatory mechanisms to recover other costs such as environmental and other compliance costs, storm damage, new plants, and PPA capacity costs. See Note 2 to the financial statements in Item 8 of the Form 10-K and Note (B) to the Condensed Financial Statements herein for additional information.\nWholesale Electric Revenues\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$111\n15.4\n$338\n17.6\nIn the third quarter 2025, wholesale electric revenues were $832 million compared to $721 million for the corresponding period in 2024. For year-to-date 2025, wholesale electric revenues were $2.3 billion compared to $1.9 billion for the corresponding period in 2024. The increases in the third quarter and year-to-date 2025 were primarily due to increases in energy revenues of $118 million and $357 million, respectively, largely driven by an increase in the volume of KWHs sold resulting from higher demand, as well as increases in fuel and purchased power prices.\nWholesale electric revenues consist of revenues from PPAs and short-term opportunity sales. Wholesale electric revenues from PPAs (other than solar and wind PPAs) have both capacity and energy components. Capacity revenues generally represent the greatest contribution to net income and are designed to provide recovery of fixed costs plus a return on investment. Energy revenues will vary depending on fuel prices, the market prices of wholesale energy compared to the Southern Company system's generation, demand for energy within the Southern Company system's electric service territory, and the availability of the Southern Company system's generation. Increases and decreases in energy revenues that are driven by fuel prices are accompanied by an increase or decrease in fuel costs and do not have a significant impact on net income. Energy sales from solar and wind PPAs do not have a capacity charge and customers either purchase the energy output of a dedicated renewable facility through an energy charge or through a fixed price related to the energy. As a result, the ability to recover fixed and variable operations and maintenance expenses is dependent upon the level of energy generated from these facilities, which can be impacted by weather conditions, equipment performance, transmission constraints, and other factors. Wholesale electric revenues at Mississippi Power include FERC-regulated municipal and rural association sales under cost-based tariffs as well as market-based sales. Short-term opportunity sales are made at market-based rates that generally provide a margin above the Southern Company system's variable cost to produce the energy.\n102\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nOther Electric Revenues\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$40\n18.0\n$93\n14.7\nIn the third quarter 2025, other electric revenues were $262 million compared to $222 million for the corresponding period in 2024. The increase was primarily due to increases of $29 million in solar application fees and $24 million in realized gains associated with price stability products for retail customers on variable demand-driven pricing tariffs, both at Georgia Power, partially offset by a decrease of $15 million in pole attachment revenues at Alabama Power and Georgia Power.\nFor year-to-date 2025, other electric revenues were $724 million compared to $631 million for the corresponding period in 2024. The increase was primarily due to increases of $30 million in solar application fees at Georgia Power, $24 million in regulated energy services revenues at Alabama Power and Georgia Power, $20 million in regulated outdoor lighting sales at Georgia Power, and $16 million in realized gains associated with price stability products for retail customers on variable demand-driven pricing tariffs at Georgia Power, partially offset by a decrease of $25 million in pole attachment revenues at Alabama Power and Georgia Power.\nNatural Gas Revenues\nIn the third quarter 2025, natural gas revenues \nwere \n$734 million\n compared to $682 million for the corresponding period in 2024. For \nyear-to-date 2025\n, \nnatural gas revenues were $3.6 billion compared to $3.2 billion for the corresponding period in 2024. Details of the changes in natural gas revenues were as follows:\nThird Quarter 2025 vs.\nThird Quarter 2024\nYear-to-Date 2025 vs. \nYear-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\nRates\n$\n27 \n3.9 \n%\n$\n98 \n3.0 \n%\nGas costs and other cost recovery\n23 \n3.4 \n189 \n5.9 \nGas marketing services\n5 \n0.7 \n40 \n1.2 \nOther\n(3)\n(0.4)\n5 \n0.2 \nNatural gas revenues\n$\n52 \n7.6 \n%\n$\n332 \n10.3 \n%\nChanges in rates resulted in an increase in revenues in the third quarter and year-to-date 2025 compared to the corresponding periods in 2024 primarily due to base rate increases at Atlanta Gas Light and Virginia Natural Gas. See Note 2 to the financial statements under \"Southern Company Gas – Rate Proceedings\" in Item 8 of the Form 10-K for additional information.\nRevenues from gas costs and other cost recovery increased in the third quarter and year-to-date 2025 compared to the corresponding periods in 2024 primarily due to higher natural gas prices and gas volumes. Natural gas distribution rates include provisions to adjust billings for fluctuations in natural gas costs. Therefore, gas costs recovered through natural gas revenues generally equal the amount expensed in cost of natural gas and do not affect net income from the natural gas distribution utilities.\nRevenues from gas marketing services increased in the third quarter and year-to-date 2025 compared to the corresponding periods in 2024 primarily due to higher commodity prices.\n103\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nOther Revenues\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$5\n1.8\n$154\n18.8\nIn the third quarter 2025, other revenues were $288 million compared to $283 million for the corresponding period in 2024. The increase included an increase of $12 million in unregulated sales primarily associated with power delivery construction and maintenance projects at Georgia Power, offset by a decrease of $12 million in revenues at PowerSecure primarily related to distributed infrastructure projects.\nFor year-to-date 2025, other revenues were $974 million compared to $820 million for the corresponding period in 2024. The increase was primarily due to increases of $88 million in unregulated sales primarily associated with power delivery construction and maintenance, resiliency, and renewables projects at Georgia Power and $69 million in revenues at PowerSecure primarily related to distributed infrastructure projects.\nFuel and Purchased Power Expenses\n \nThird Quarter 2025 vs.\nThird Quarter 2024\nYear-to-Date 2025 vs. \nYear-to-Date 2024\n \n(change in millions)\n(% change)\n(change in millions)\n(% change)\nFuel\n$\n199 \n17.4 \n%\n$\n579 \n18.2 \n%\nPurchased power\n10 \n4.0 \n100 \n14.9 \nTotal fuel and purchased power expenses\n$\n209 \n$\n679 \nIn the third quarter 2025, total fuel and purchased power expenses were $1.6 billion compared to $1.4 billion for the corresponding period in 2024. The increase was due to a $122 million increase related to the average cost of fuel and purchased power and a $27 million increase related to the volume of KWHs generated and purchased. Also contributing to the increase was $60 million related to credits recorded at Georgia Power in the third quarter 2024 resulting from litigation related to nuclear fuel disposal costs.\nFor year-to-date 2025, total fuel and purchased power expenses were $4.5 billion compared to $3.8 billion for the corresponding period in 2024. The increase was due to a $464 million net increase related to the average cost of fuel and purchased power and a $155 million increase related to the volume of KWHs generated and purchased. Also contributing to the increase was $60 million related to credits recorded at Georgia Power in the third quarter 2024 resulting from litigation related to nuclear fuel disposal costs.\nSee Note 3 to the financial statements under \"Nuclear Fuel Disposal Costs\" in Item 8 of the Form 10-K for additional information.\nFuel and purchased power energy transactions at the traditional electric operating companies are generally offset by fuel revenues and do not have a significant impact on net income. See Note 2 to the financial statements in Item 8 of the Form 10-K for additional information. Fuel expenses incurred under Southern Power's PPAs are generally the responsibility of the counterparties and do not significantly impact net income.\nEnergy purchases will vary depending on demand for energy within the Southern Company system's electric service territory, the market prices of wholesale energy as compared to the cost of the Southern Company system's generation, and the availability of the Southern Company system's generation.\n104\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nDetails of the Southern Company system's generation and purchased power and the related costs were as follows:\nThird Quarter 2025\nThird Quarter 2024\nYear-to-Date 2025\nYear-to-Date 2024\nTotal generation \n(in billions of KWHs)\n(a)\n53\n53\n144\n145\nTotal purchased power \n(in billions of KWHs)\n6\n5\n16\n13\nSources of generation \n(percent)\n —\nGas\n53\n55\n51\n52\nCoal\n21\n19\n20\n18\nNuclear\n(a)\n19\n18\n19\n19\nHydro\n1\n1\n3\n3\nWind, Solar, and Other\n6\n7\n7\n8\nCost of fuel, generated \n(in cents per net KWH)\n—\nGas\n3.13\n2.47\n3.40\n2.62\nCoal\n3.68\n4.18\n3.81\n4.00\nNuclear\n(a)(b)\n0.84\n0.91\n0.85\n0.87\nAverage cost of fuel, generated \n(in cents per net KWH)\n(a)(b)\n2.78\n2.51\n2.94\n2.53\nAverage cost of purchased power \n(in cents per net KWH)\n(c)\n4.94\n4.87\n5.03\n5.19\n(a)\nExcludes KWHs generated from test period energy at Plant Vogtle Unit 4 prior to being placed in service in April 2024. The related fuel costs were charged to CWIP in accordance with FERC guidance.\n(b)\nExcludes $60 million of credits recorded to nuclear fuel expense in the third quarter 2024 resulting from litigation related to nuclear fuel disposal costs. See Note 3 to the financial statements under \"Nuclear Fuel Disposal Costs\" in Item 8 of the Form 10-K for additional information.\n(c)\nAverage cost of purchased power includes fuel purchased by the Southern Company system for tolling agreements where power is generated by the provider.\nCost of Natural Gas\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$18\n18.4\n$194\n22.8\nExcluding Atlanta Gas Light, which does not sell natural gas to end-use customers, the natural gas distribution utilities' rates include provisions to adjust billings for fluctuations in natural gas costs. Therefore, gas costs recovered through natural gas revenues generally equal the amount expensed in cost of natural gas and do not affect net income from the natural gas distribution utilities. See Note 2 to the financial statements under \"Southern Company Gas – Natural Gas Cost Recovery\" in Item 8 of the Form 10-K for additional information. Cost of natural gas at the natural gas distribution utilities represented 81.9% and 81.5% of the total cost of natural gas in the third quarter and year-to-date 2025, respectively.\nIn the third quarter 2025, cost of natural gas was $116 million compared to $98 million for the corresponding period in 2024. For year-to-date 2025, cost of natural gas was $1.0 billion compared to $0.9 billion for the corresponding period in 2024. The increases reflect higher gas cost recovery as a result of increases of 42.4% and 61.6% in natural gas prices in the third quarter and year-to-date 2025, respectively.\n105\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nCost of Other Sales\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(10)\n(6.0)\n$58\n12.5\nIn the third quarter 2025, cost of other sales was $156 million compared to $166 million for the corresponding period in 2024. The decrease was primarily due to a decrease of $23 million in expenses at PowerSecure primarily related to distributed infrastructure projects, partially offset by an increase of $15 million in expenses associated with unregulated power delivery construction and maintenance projects at Georgia Power.\nFor year-to-date 2025, cost of other sales was $522 million compared to $464 million for the corresponding period in 2024. The increase was primarily related to expenses associated with unregulated power delivery construction and maintenance projects at Georgia Power.\nOther Operations and Maintenance Expenses\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(19)\n(1.1)\n$426\n9.4\nIn the third quarter 2025, other operations and maintenance expenses were $1.6 billion compared to $1.7 billion for the corresponding period in 2024. The decrease was primarily due to a $36 million impairment loss in 2024 associated with Alabama Power discontinuing the development of a multi-use commercial facility, a $33 million credit to income related to the estimated probable loss on Plant Vogtle Units 3 and 4 at Georgia Power, a $30 million decrease in reliability-related transmission, distribution, and generation expenses at Alabama Power, and a $17 million decrease in transmission and distribution expenses primarily due to billing adjustments with integrated transmission system owners at Georgia Power, partially offset by increases of $18 million in certain employee compensation and benefit expenses at the traditional electric operating companies, $17 million in certain technology infrastructure and application production costs, $14 million in expenses at PowerSecure primarily related to distributed infrastructure projects, $11 million in employee compensation and benefit expenses at Southern Company Gas, $11 million related to the injuries and damages reserves, and $10 million in generation expenses primarily due to non-outage maintenance expenses at Georgia Power.\nFor year-to-date 2025, other operations and maintenance expenses were $4.9 billion compared to $4.5 billion for the corresponding period in 2024. The increase was primarily due to a $144 million increase in generation expenses primarily due to non-outage maintenance expenses largely resulting from Plant Vogtle Unit 4 being placed in service in April 2024 at Georgia Power, as well as planned outages at Alabama Power and Southern Power, a $114 million gain from the sale of integrated transmission system assets at Georgia Power recorded in the second quarter 2024, and increases of $58 million in certain employee compensation and benefit expenses at the traditional electric operating companies, $48 million in certain technology infrastructure and application production costs, $35 million in expenses passed through to customers primarily related to bad debt and energy efficiency programs at Southern Company Gas, $34 million in compensation and benefit expenses at Southern Company Gas, and $34 million in expenses at PowerSecure primarily related to distributed infrastructure projects, partially offset by decreases of $36 million related to an impairment loss in 2024 associated with Alabama Power discontinuing the development of a multi-use commercial facility and $30 million in reliability-related transmission, distribution, and generation expenses at Alabama Power.\nSee Note (B) to the Condensed Financial Statements under \"Alabama Power – \nReliability Reserve Accounting Order\n\" and \"Georgia Power – Nuclear Construction\" herein and Notes 1 and 2 to the financial statements under \"Impairment of Long-Lived Assets\" and \"Georgia Power,\" respectively, in Item 8 of the Form 10-K for additional information.\n106\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nDepreciation and Amortization\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$212\n17.5\n$493\n13.9\nIn the third quarter 2025, depreciation and amortization was $1.4 billion compared to $1.2 billion for the corresponding period in 2024. For year-to-date 2025, depreciation and amortization was $4.0 billion compared to $3.5 billion for the corresponding period in 2024. The increases in the third quarter and \nyear-to-date 2025\n were primarily due to increases of $66 million and $207 million, respectively, associated with additional plant in service, $112 million and $181 million, respectively, in accelerated depreciation related to wind repowering projects at Southern Power, and $31 million and $93 million, respectively, in amortization of regulatory assets related to CCR AROs at Georgia Power as approved in the 2025 compliance filing under the terms of the 2022 ARP. See Note (K) to the Condensed Financial Statements under \"Southern Power – Wind Repowering Projects\" herein and Notes 2 and 15 to the financial statements under \"Georgia Power\" and \"Southern Power – Development Projects,\" respectively, in Item 8 of the Form 10-K for additional information.\nTaxes Other Than Income Taxes\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(87)\n(23.2)\n$(19)\n(1.6)\nIn the third quarter 2025, taxes other than income taxes were $288 million compared to $375 million for the corresponding period in 2024. For year-to-date 2025, taxes other than income taxes were $1.14 billion compared to $1.16 billion for the corresponding period in 2024. The decreases in the third quarter and \nyear-to-date 2025 \nwere primarily due to decreases of $103 million and $80 million, respectively, in property taxes primarily resulting from the actualization of prior-year tax assessments at Georgia Power, partially offset by increases of $4 million and $19 million, respectively, in municipal franchise fees resulting from higher retail revenues at Georgia Power and $4 million and $13 million, respectively, in utility license taxes resulting from an increase in the tax base at Alabama Power. Also partially offsetting the \nyear-to-date 2025\n decrease were increases of $14 million in revenue taxes resulting from higher natural gas revenues at Nicor Gas and $8 million in payroll taxes.\nAllowance for Equity Funds Used During Construction\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$32\n55.2\n$76\n45.5\nIn the third quarter 2025, allowance for equity funds used during construction was $90 million compared to $58 million for the corresponding period in 2024. For year-to-date 2025, allowance for equity funds used during construction was $243 million compared to $167 million for the corresponding period in 2024. The increases were primarily associated with increases in capital expenditures subject to AFUDC at Georgia Power and Alabama Power. Partially offsetting the year-to-date 2025 increase was the impact of Plant Vogtle Unit 4 being placed in service in April 2024 at Georgia Power. See Note 2 to the financial statements under \"Georgia Power – Nuclear Construction\" in Item 8 of the Form 10-K for additional information on Plant Vogtle Unit 4.\n107\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nEarnings from Equity Method Investments\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$2\n6.5\n$(31)\n(29.0)\nFor year-to-date 2025, earnings from equity method investments were $76 million compared to $107 million for the corresponding period in 2024. The decrease was primarily due to a decrease of $17 million at Southern Company Gas related to lower rates at SNG and a decrease of $16 million at Southern Holdings related to investment losses. See Note 7 to the financial statements in Item 8 of the Form 10-K and Note (E) to the Condensed Financial Statements under \"Southern Company\" and \"Southern Company Gas\" herein for additional information.\nInterest Expense, Net of Amounts Capitalized\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$63\n9.1\n$293\n14.3\nIn the third quarter 2025, interest expense, net of amounts capitalized was $755 million compared to $692 million for the corresponding period in 2024. The increase was primarily due to increases of approximately $67 million related to higher average outstanding borrowings and $9 million related to higher interest rates, partially offset by an increase of $12 million in capitalized interest and AFUDC debt associated with increased capital expenditures.\nFor year-to-date 2025, interest expense, net of amounts capitalized was $2.34 billion compared to $2.05 billion for the corresponding period in 2024. The increase was primarily due to an increase of approximately $169 million related to higher average outstanding borrowings, a $129 million loss associated with the extinguishment of debt at the parent company, and an increase of $17 million related to higher interest rates, partially offset by an increase of $21 million in capitalized interest and AFUDC debt associated with increased capital expenditures. See Note (F) to the Condensed Financial Statements under \"Convertible Senior Notes\" herein for additional information.\nSee FINANCIAL CONDITION AND LIQUIDITY – \"Sources of Capital\" and \"Financing Activities\" herein for additional information.\nIncome Taxes\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$27\n7.2\n$83\n9.3\nIn the third quarter 2025, income taxes were $404 million compared to $377 million for the corresponding period in 2024. The increase was primarily due to higher pre-tax earnings, partially offset by a $15 million increase in the flowback of certain excess deferred income taxes at the traditional electric operating companies.\nFor year-to-date 2025, income taxes were $973 million compared to $890 million for the corresponding period in 2024. The increase was primarily due to a $78 million increase in charges to a valuation allowance on certain state tax credit carryforwards and $33 million from the recognition of certain state tax positions from amended returns in the second quarter 2024, both at Georgia Power, and higher pre-tax earnings, partially offset by increases of $26 million in the flowback of certain excess deferred income taxes at the traditional electric operating companies, $19 million in the generation of advanced nuclear PTCs at Georgia Power, and $10 million in the flowback of excess state deferred income taxes at Southern Company Gas.\nSee Note (G) to the Condensed Financial Statements herein for additional information.\n108\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nNet Loss Attributable to Noncontrolling Interests\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(4)\nN/M\n$(22)\n(30.1)\nSubstantially all noncontrolling interests relate to renewable projects at Southern Power. For year-to-date 2025, net loss attributable to noncontrolling interests was $95 million compared to $73 million for the corresponding period in 2024. The increase was primarily due to $14 million in higher HLBV loss allocations to Southern Power's tax equity partners and $11 million in lower income allocations to Southern Power's equity partners.\nAlabama Power\nNet Income\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$95\n19.3\n$148\n12.4\nAlabama Power's net income in the third quarter 2025 was $588 million compared to $493 million for the corresponding period in 2024. The increase was primarily due to higher retail electric revenues resulting from changes in rates and pricing and a decrease in non-fuel operations and maintenance expenses, partially offset by weather impacts on retail revenues.\nFor year-to-date 2025, net income was $1.3 billion compared to $1.2 billion for the corresponding period in 2024. The increase was primarily due to higher retail electric revenues resulting from changes in rates and pricing, as well as an increase in other revenues, partially offset by increases in non-fuel operations and maintenance expenses and depreciation and amortization.\nRetail Revenues\nIn the third quarter 2025, retail revenues were $2.0 billion compared to $1.9 billion for the corresponding period in 2024. For year-to-date 2025, retail revenues were $5.5 billion compared to $5.1 billion for the corresponding period in 2024. Details of the changes in retail revenues were as follows:\nThird Quarter 2025 vs.\nThird Quarter 2024\nYear-to-Date 2025 vs.\nYear-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\nRates and pricing\n$\n91 \n4.8 \n%\n$\n246 \n4.8 \n%\nSales growth\n6 \n0.3 \n10 \n0.2 \nWeather\n(16)\n(0.8)\n(12)\n(0.2)\nFuel and other cost recovery\n61 \n3.2 \n126 \n2.4 \nRetail revenues\n$\n142 \n7.5 \n%\n$\n370 \n7.2 \n%\nChanges in rates and pricing resulted in increases in r\nevenues in the \nthird quarter and\n year-to-date 2025 when compared to the corresponding periods in 2024 primari\nly due to an increase in Rate RSE. See Note 2 to the financial statements under \"Alabama Power\" in Item 8 of the Form 10-K for additional information.\nChanges in sales resulted in increases in revenues in the third quarter and year-to-date 2025 when compared to the corresponding periods in 2024. Weather-adjusted residential KWH sales increased 1.6% in the third quarter 2025 primarily due to customer growth and increased customer usage. Weather-adjusted residential KWH sales increased 0.7% for year-to-date 2025 primarily due to customer growth. Weather-adjusted commercial KWH sales increased 0.5% in the third quarter 2025 primarily due to customer growth and increased customer usage. Weather-adjusted commercial KWH sales increased 0.4% for year-to-date 2025 primarily due to customer growth. Industrial KWH \n109\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nsales increased 2.2% and 1.5% in the third quarter and year-to-date 2025, respectively, primarily due to increases in the primary metals sector.\nFuel and other cost recovery reven\nues increased in the third quarter and year-to-date 2025 when compared to the corresponding periods in 2024 primarily as a result of higher recoverable fuel costs.\nElectric rates include provisions to recognize the recovery of fuel costs, purchased power costs, PPAs certificated by the Alabama PSC, and costs associated with the NDR. Under these provisions, fuel and other cost recovery revenues generally equal fuel and other cost recovery expenses and do not affect net income. See Note 2 to the financial statements under \"Alabama Power\" in Item 8 of the Form 10-K for additional information.\nWholesale Revenues \n–\n Non-Affiliates\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$48\n53.9\n$67\n25.9\nIn the third quarter 2025, wholesale revenues from sales to non-affiliates were $137 million compared to $89 million for the corresponding period in 2024. For year-to-date 2025, wholesale revenues from sales to non-affiliates were $326 million compared to $259 million for the corresponding period in 2024. The increases for the third quarter and year-to-date 2025 were primarily due to increases of 36.3% and 8.8%, respectively, in the volume of KWH sales due to higher demand from power sales agreements and 12.0% and 15.6%, respectively, in the price of energy due to an increase in natural gas prices.\nWholesale Revenues \n–\n Affiliates\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(6)\n(17.6)\n$29\n28.2\nIn the third quarter 2025, wholesale revenues from sales to affiliates were $28 million compared to $34 million for the corresponding period in 2024. The decrease was primarily due to a 27.8% decrease in the volume of KWH sales as a result of the availability of other Southern Company system generation, partially offset by an increase of 12.2% in the price of energy due to an increase in natural gas prices.\nFor year-to-date 2025, wholesale revenues from sales to affiliates were $132 million compared to $103 million for the corresponding period in 2024. The increase was primarily due to an increase of 44.0% in the price of energy due to an increase in natural gas prices, partially offset by a 10.4% decrease in the volume of KWH sales as a result of the availability of other Southern Company system generation.\nWholesale revenues from sales to affiliated companies will vary depending on demand and the availability and cost of generating resources at each company. These affiliate sales are made in accordance with the IIC, as approved by the FERC. Energy revenues related to these transactions do not have a significant impact on earnings since this energy is generally sold at marginal cost and energy purchases are generally offset by energy revenues through Alabama Power's energy cost recovery clause.\nOther Revenues\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(4)\n(3.6)\n$29\n9.0\nFor year-to-date 2025, other revenues were $353 million compared to $324 million for the corresponding period in 2024. The increase was primarily due to a $12 million increase in transmission revenue primarily associated with open access transmission tariff sales, an $11 million increase in regulated energy services revenues, $7 million \n110\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nrelated to undistributed customer bill credits associated with nuclear fuel disposal costs litigation, which was offset by an additional NDR accrual within other operations and maintenance expenses, and a $4 million increase in cogeneration revenues primarily related to higher fuel prices. These increases were partially offset by a $14 million decrease in pole attachment revenues. See Note 3 to the financial statements under \"Nuclear Fuel Disposal Costs\" in Item 8 of the Form 10-K for additional information.\nFuel and Purchased Power Expenses\nThird Quarter 2025 vs.\nThird Quarter 2024\nYear-to-Date 2025 vs. \nYear-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\nFuel\n$\n32 \n8.3 \n%\n$\n89 \n8.5 \n%\nPurchased power – non-affiliates\n7 \n14.3 \n32 \n21.6 \nPurchased power – affiliates\n49 \n102.1 \n84 \n62.7 \nTotal fuel and purchased power expenses\n$\n88 \n$\n205 \nIn the third quarter 2025, total fuel and purchased power expenses were $569 million compared to $481 million for the corresponding period in 2024. The increase was primarily due to a $51 million increase related to the average cost of fuel and purchased power and a $37 million net increase related to the volume of KWHs generated and purchased.\nFor year-to-date 2025, total fuel and purchased power expenses were $1.5 billion compared to $1.3 billion for the corresponding period in 2024. The increase was due to a \n$107 million\n increase related to the average cost of fuel and purchased power and a $98 million net increase related to the volume of KWHs generated and purchased.\nFuel and purchased power energy transactions do not have a significant impact on earnings since energy expenses are generally offset by energy revenues through Alabama Power's energy cost recovery clause. See Note 2 to the financial statements under \"Alabama Power – Rate ECR\" in Item 8 of the Form 10-K for additional information.\nEnergy purchases from non-affiliates will vary dep\nending on the market prices of wholesale energy as compared to the cost of the Southern Company system's generation, demand for energy within the Southern Company system's electric service territory, and the availability of the Southern Company system's generation.\nEnergy purchases from affiliates will vary depending on demand for energy and the availability and cost of generating resources at each company within the Southern Company system. These purchases are made in accordance with the IIC or other contractual agreements, as approved by the FERC.\n111\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nDetails of Alabama Power's generation and purchased power and the related costs were as follows:\nThird Quarter 2025\nThird Quarter 2024\nYear-to-Date 2025\nYear-to-Date 2024\nTotal generation \n(in billions of KWHs)\n16\n16\n44\n46\nTotal purchased power \n(in billions of KWHs)\n3\n2\n7\n5\nSources of generation \n(percent)\n —\nCoal\n37\n32\n36\n33\nGas\n36\n41\n35\n37\nNuclear\n24\n24\n22\n24\nHydro\n3\n3\n7\n6\nCost of fuel, generated \n(in cents per net KWH)\n —\nCoal\n3.34\n3.36\n3.29\n3.24\nGas\n3.19\n2.59\n3.29\n2.71\nNuclear\n0.72\n0.74\n0.73\n0.72\nAverage cost of fuel, generated \n(in cents per net KWH)\n2.63\n2.39\n2.69\n2.39\nAverage cost of purchased power \n(in cents per net KWH)\n(*)\n5.52\n4.88\n5.96\n5.88\n(*)\nAverage cost of purchased power includes fuel, energy, and transmission purchased by Alabama Power for tolling agreements where power is generated by the provider.\nOther Operations and Maintenance Expenses\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(59)\n(12.0)\n$35\n2.6\nIn the third quarter 2025, other operations and maintenance expenses were $434 million compared to $493 million for the corresponding period in 2024. Th\ne decrease was primarily due to a $36 million impairment loss in the third quarter 2024 associated with Alabama Power discontinuing the development of a multi-use commercial facility and a $30 million decrease in \nreliability-related transmission, distribution, and generation expenses\n.\nFor year-to-date 2025, other operations and maintenance expenses were $1.37 billion compared to $1.34 billion for the corresponding period in 2024. The increase was primarily due to increases of $47 million in generation expenses primarily associated with planned outages, $21 million in certain employee compensation and benefit expenses, $10 million in certain technology infrastructure and application production costs, $7 million associated with an additional NDR accrual, which is offset within other revenues, and $7 million in vegetation management expenses, partially offset by a $36 million impairment loss in the third quarter 2024 associated with Alabama Power discontinuing the development of a multi-use commercial facility \nand a $30 million decrease in \nreliability-related transmission, distribution, and generation expenses.\nSee Note (B) to the Condensed Financial Statements under \"Alabama Power – \nReliability Reserve Accounting Order\n\" herein and Notes 1 and 3 to the financial statements under \"Impairment of Long-Lived Assets\" and \"Nuclear Fuel Disposal Costs,\" respectively, in Item 8 of the Form 10-K for additional information.\nDepreciation and Amortization\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$14\n3.8\n$30\n2.7\nIn the third quarter 2025, depreciation and amortization was $380 million compared to $366 million for the corresponding period in 2024. For year-to-date 2025, depreciation and amortization was $1.12 billion compared to \n112\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\n$1.09 billion for the corresponding period in 2024. The increases were primarily due to additional plant in service related to transmission and distribution systems.\nTaxes Other Than Income Taxes\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$7\n6.5\n$18\n5.2\nFor year-to-date 2025, taxes other than income taxes were $365 million compared to $347 million for the corresponding period in 2024. The increase was primarily due to an increase in utility license taxes resulting from an increase in the tax base.\nAllowance for Equity Funds Used During Construction\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$3\n20.0\n$14\n35.0\nFor year-to-date 2025, allowance for equity funds used during construction was $54 million compared to $40 million for the corresponding period in 2024. The increase was primarily due to an increase in capital expenditures subject to AFUDC.\nOther Income (Expense), Net\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$8\n22.2\n$12\n10.3\nFor year-to-date 2025, other income (expense), net was $128 million compared to $116 million for the corresponding period in 2024. The increase was primarily due to the receipt of liquidated damages associated with the termination of two solar projects and an increase in interest income.\nIncome Taxes\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$40\n29.6\n$79\n24.5\nIn the third quarter 2025, income taxes were $175 million compared to $135 million for the corresponding period in 2024. For year-to-date 2025, income taxes were $401 million compared to $322 million for the corresponding period in 2024. The increases for the third quarter and year-to-date 2025 were primarily due to higher pre-tax earnings and decreases of $10 million and $29 million, respectively, in the flowback of certain excess deferred income taxes. See Note (G) to the Condensed Financial Statements herein for additional information.\nGeorgia Power\nNet Income\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$198\n18.9\n$203\n9.0\nGeorgia Power's net income in the third quarter 2025 was $1.2 billion compared to $1.1 billion for the corresponding period in 2024. The increase was primarily due to higher retail revenues associated with rates and \n113\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\npricing and sales growth, a decrease in taxes other than income taxes, and an increase in other revenues, partially offset by an increase in depreciation and amortization and weather impacts on retail revenues.\nFor year-to-date 2025, net income was $2.5 billion compared to $2.2 billion for the corresponding period in 2024. The increase was primarily due to higher retail revenues associated with rates and pricing and sales growth and other revenues, partially offset by an increase in non-fuel operations and maintenance expenses, depreciation and amortization, and income taxes.\nRetail Revenues\nIn the third quarter 2025, retail revenues were $3.4 billion compared to $3.2 billion for the corresponding period in 2024. For year-to-date 2025, retail revenues were $8.8 billion compared to $7.9 billion for the corresponding period in 2024. Details of the changes in retail revenues were as follows:\nThird Quarter 2025 vs.\nThird Quarter 2024\nYear-to-Date 2025 vs.\nYear-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\nRates and pricing\n$\n111 \n3.5 \n%\n$\n501 \n6.3 \n%\nSales growth\n89 \n2.8 \n154 \n1.9 \nWeather\n(50)\n(1.6)\n(41)\n(0.5)\nFuel cost recovery\n24 \n0.8 \n203 \n2.6 \nRetail revenues\n$\n174 \n5.5 \n%\n$\n817 \n10.3 \n%\nChanges in rates and pricing resulted in an increase in revenues in the third quarter 2025 when compared to the corresponding period in 2024 primarily due to base tariff increases and increased ECCR tariff revenues in accordance with the 2022 ARP. Changes in rates and pricing resulted in an increase in revenues for year-to-date 2025 when compared to the corresponding period in 2024 primarily due to base tariff increases and increased ECCR tariff revenues in accordance with the 2022 ARP, the inclusion of Plant Vogtle Unit 4 in retail rates net of elimination of the NCCR tariff, and higher contributions from commercial and industrial customers with variable demand-driven pricing. See Note 2 to the financial statements under \"Georgia Power\" in Item 8 of the Form 10-K for additional information.\nChanges in sales resulted in an increase in revenues in the third quarter and year-to-date 2025 when compared to the corresponding periods in 2024. Weather-adjusted residential KWH sales increased 3.3% in the third quarter 2025 primarily due to increased customer usage and customer growth. Weather-adjusted residential KWH sales increased 1.4% for year-to-date 2025 primarily due to customer growth. Weather-adjusted commercial KWH sales increased 5.1% and 3.7% in the third quarter and year-to-date 2025, respectively, primarily due to increased customer usage, primarily driven by data centers. Weather-adjusted industrial KWH sales increased 2.6% in the third quarter 2025 primarily due to increases in the electronics and primary metals sectors, partially offset by a decrease in the chemicals sector. Weather-adjusted industrial KWH sales increased 2.1% for year-to-date 2025 primarily due to increases in the electronics, paper, and transportation sectors, partially offset by decreases in the pipeline and textiles sectors.\nFuel revenues and costs are allocated between retail and wholesale jurisdictions. Retail fuel cost recovery revenues increased in the third quarter and year-to-date 2025 when compared to the corresponding periods in 2024 due to higher recoverable fuel costs. Electric rates include provisions to adjust billings for fluctuations in fuel costs, including the energy component of purchased power costs. Under these fuel cost recovery provisions, fuel revenues generally equal fuel expenses and do not affect net income. See Note (B) to the Condensed Financial Statements herein and Note 2 to the financial statements under \"Georgia Power – Fuel Cost Recovery\" in Item 8 of the Form 10-K for additional information.\n114\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nWholesale Revenues\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$62\n79.5\n$192\n97.0\nIn the third quarter 2025, wholesale revenues were $140 million compared to $78 million for the corresponding period in 2024. For year-to-date 2025, wholesale revenues were $390 million compared to $198 million for the corresponding period in 2024. The increases for the third quarter and year-to-date 2025 were due to increases of $23 million and $86 million, respectively, related to the volume of KWH sales associated with higher market demand, $23 million and $59 million, respectively, related to the average cost per KWH sold due to higher Southern Company system fuel and purchased power prices, and $16 million and $47 million, respectively, related to additional non-fuel revenues from wholesale capacity contracts.\nWholesale revenues from sales to non-affiliates consist of PPAs and short-term opportunity sales. Wholesale revenues from PPAs have both capacity and energy components. Wholesale capacity revenues from PPAs are recognized in amounts billable under the contract terms and provide for recovery of fixed costs and a return on investment. Wholesale revenues from sales to non-affiliates will vary depending on fuel prices, the market prices of wholesale energy compared to the cost of Georgia Power's and the Southern Company system's generation, demand for energy within the Southern Company system's electric service territory, and the availability of the Southern Company system's generation. Increases and decreases in energy revenues that are driven by fuel prices are accompanied by an increase or decrease in fuel costs and do not have a significant impact on net income. Short-term opportunity sales are made at market-based rates that generally provide a margin above Georgia Power's variable cost of energy.\nWholesale revenues from sales to affiliated companies will vary depending on demand and the availability and cost of generating resources at each company. These affiliate sales are made in accordance with the IIC, as approved by the FERC. Energy revenues related to these transactions do not have a significant impact on earnings since this energy is generally sold at marginal cost.\nOther Revenues\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$62\n29.7\n$164\n26.9\nIn the third quarter 2025, other revenues were $271 million compared to $209 million for the corresponding period in 2024. The increase was primarily due to increases of $29 million in solar application fees, $24 million in realized gains associated with price stability products for retail customers on variable demand-driven pricing tariffs, $12 million in unregulated sales primarily associated with power delivery construction and maintenance projects, and $6 million in outdoor lighting sales, partially offset by a decrease of $11 million in pole attachment revenues.\nFor year-to-date 2025, other revenues were $774 million compared to $610 million for the corresponding period in 2024. The increase was primarily due to increases of $88 million in unregulated sales primarily associated with power delivery construction and maintenance, resiliency, and renewables projects, $30 million in solar application fees, $16 million in realized gains associated with price stability products for retail customers on variable demand-driven pricing tariffs, $15 million in outdoor lighting sales, $13 million in regulated sales associated with power delivery construction and maintenance projects, and $9 million in open access transmission tariff sales, partially offset by a decrease of $11 million in pole attachment revenues.\n115\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nFuel and Purchased Power Expenses\nThird Quarter 2025 vs.\nThird Quarter 2024\nYear-to-Date 2025 vs. \nYear-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\nFuel\n$\n116 \n25.7 \n%\n$\n286 \n22.3 \n%\nPurchased power – non-affiliates\n2 \n1.1 \n50 \n10.7 \nPurchased power – affiliates\n(2)\n(1.0)\n97 \n17.1 \nTotal fuel and purchased power expenses\n$\n116 \n$\n433 \nIn the third quarter 2025, total fuel and purchased power expenses were $945 million compared to $829 million for the corresponding period in 2024. The increase was due to a $47 million increase related to the volume of KWHs generated and purchased, a net increase of $9 million related to the average cost of fuel and purchased power, and an increase of $60 million related to credits recorded in the third quarter 2024 resulting from litigation related to nuclear fuel disposal costs.\nFor year-to-date 2025, total fuel and purchased power expenses were $2.7 billion compared to $2.3 billion for the corresponding period in 2024. The increase was due to a $228 million net increase related to the volume of KWHs generated and purchased, an increase of $145 million related to the average cost of fuel and purchased power, and an increase of $60 million related to credits recorded in the third quarter 2024 resulting from litigation related to nuclear fuel disposal costs.\nSee Note 3 to the financial statements under \"Nuclear Fuel Disposal Costs\" in Item 8 of the Form 10-K for additional information.\nFuel and purchased power energy transactions do not have a significant impact on earnings since these fuel expenses are generally offset by fuel revenues through Georgia Power's fuel cost recovery mechanism. See Note 2 to the financial statements under \"Georgia Power – Fuel Cost Recovery\" in Item 8 of the Form 10-K for additional information.\nEnergy purchases from non-affiliates will vary depending on the market prices of wholesale energy as compared to the cost of the Southern Company system's generation, demand for energy within the Southern Company system's electric service territory, and the availability of the Southern Company system's generation.\nEnergy purchases from affiliates will vary depending on the demand and the availability and cost of generating resources at each company within the Southern Company system. These purchases are made in accordance with the IIC or other contractual agreements, all as approved by the FERC. See Note 2 to the financial statements under \"Georgia Power – Integrated Resource Plans\" in Item 8 of the Form 10-K for information regarding two new PPAs with Southern Power.\n116\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nDetails of Georgia Power's generation and purchased power and the related costs were as follows:\nThird Quarter 2025\nThird Quarter 2024\nYear-to-Date 2025\nYear-to-Date 2024\nTotal generation \n(in billions of KWHs)\n(a)\n19\n18\n50\n50\nTotal purchased power \n(in billions of KWHs)\n10\n9\n28\n23\nSources of generation \n(percent)\n —\nGas\n41\n43\n40\n43\nNuclear\n(a)\n33\n31\n35\n33\nCoal\n24\n24\n22\n21\nHydro and other\n2\n2\n3\n3\nCost of fuel, generated \n(in cents per net KWH)\n \n—\nGas\n3.22\n2.76\n3.54\n2.91\nNuclear\n(a)(b)\n0.91\n1.02\n0.92\n0.97\nCoal\n4.02\n5.01\n4.40\n4.90\nAverage cost of fuel, generated \n(in cents per net KWH)\n(a)(b)\n2.64\n2.75\n2.78\n2.67\nAverage cost of purchased power \n(in cents per net KWH)\n(c)\n4.87\n4.62\n5.03\n4.73\n(a)\nExcludes KWHs generated from test period energy at Plant Vogtle Unit 4 prior to being placed in service in April 2024. The related fuel costs were charged to CWIP in accordance with FERC guidance.\n(b)\nExcludes $60 million of credits recorded to nuclear fuel expense in the third quarter 2024 resulting from litigation related to nuclear fuel disposal costs. See Note 3 to the financial statements under \"Nuclear Fuel Disposal Costs\" in Item 8 of the Form 10-K for additional information.\n(c)\nAverage cost of purchased power includes fuel purchased by Georgia Power for tolling agreements where power is generated by the provider.\nOther Operations and Maintenance Expenses\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$3\n0.5\n$332\n21.2\nIn the third quarter 2025, other operations and maintenance expenses were $616 million compared to $613 million for the corresponding period in 2024. The increase was primarily due to increases of $12 million in generation expenses primarily due to non-outage maintenance expenses, $10 million in expenses associated with unregulated power delivery construction and maintenance, energy conservation, and renewables projects, $10 million in certain technology infrastructure and application production costs, $10 million in certain employee compensation and benefit expenses, $7 million in customer service expenses, and $5 million related to the injuries and damages reserve, largely offset by a $33 million credit to income related to the estimated probable loss on Plant Vogtle Units 3 and 4 and a decrease of $19 million in transmission and distribution expenses primarily due to billing adjustments with integrated transmission system owners.\nFor year-to-date 2025, other operations and maintenance expenses were $1.9 billion compared to $1.6 billion for the corresponding period in 2024. The increase was primarily due to a $114 million gain from the sale of integrated transmission system assets in the second quarter 2024 and increases of $68 million in generation expenses primarily due to non-outage maintenance expenses largely resulting from Plant Vogtle Unit 4 being placed in service in April 2024, $62 million in expenses associated with unregulated power delivery construction and maintenance, energy conservation, and renewables projects, $37 million in certain employee compensation and benefit expenses, and $34 million in certain technology infrastructure and application production costs.\nSee Note (B) to the Condensed Financial Statements under \"Georgia Power – Nuclear Construction\" herein and Note 2 to the financial statements under \"Georgia Power\" in Item 8 of the Form 10-K for additional information.\n117\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nDepreciation and Amortization\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$64\n13.9\n$207\n15.5\nIn the third quarter 2025, depreciation and amortization was $526 million compared to $462 million for the corresponding period in 2024. For year-to-date 2025, depreciation and amortization was $1.5 billion compared to $1.3 billion for the corresponding period in 2024. The increases for the third quarter and year-to-date 2025 were primarily due to increases of $35 million and $121 million, respectively, associated with additional plant in service and $31 million and $93 million, respectively, in amortization of regulatory assets related to CCR AROs as approved in the 2025 compliance filing under the terms of the 2022 ARP. See Note 2 to the financial statements under \"Georgia Power – Rate Plans\" in Item 8 of the Form 10-K for additional information.\nTaxes Other Than Income Taxes\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(102)\n(57.6)\n$(71)\n(14.5)\nIn the third quarter 2025, taxes other than income taxes were $75 million compared to $177 million for the corresponding period in 2024. For year-to-date 2025, taxes other than income taxes were $417 million compared to $488 million for the corresponding period in 2024. The decreases for the third quarter and year-to-date 2025 were primarily due to decreases of $108 million and $93 million, respectively, in property taxes primarily resulting from the actualization of prior-year tax assessments, partially offset by increases of $4 million and $19 million, respectively, in municipal franchise fees resulting from higher retail revenues.\nAllowance for Equity Funds Used During Construction\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$30\n81.1\n$63\n58.3\nIn the third quarter 2025, allowance for equity funds used during construction was $67 million compared to $37 million for the corresponding period in 2024. For year-to-date 2025, allowance for equity funds used during construction was $171 million compared to $108 million for the corresponding period in 2024. The increases were primarily due to an increase in capital expenditures subject to AFUDC. Partially offsetting the increase for year-to-date 2025 was the impact of Plant Vogtle Unit 4 being placed in service in April 2024. See Note 2 to the financial statements under \"Georgia Power – Nuclear Construction\" in Item 8 of the Form 10-K for additional information on Plant Vogtle Unit 4.\nInterest Expense, Net of Amounts Capitalized\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$16\n8.7\n$42\n7.7\nIn the third quarter 2025, interest expense, net of amounts capitalized was $200 million compared to $184 million for the corresponding period in 2024. For year-to-date 2025, interest expense, net of amounts capitalized was $585 million compared to $543 million for the corresponding period in 2024. The increases for the third quarter and year-to-date 2025 were primarily associated with increases of approximately $20 million and $43 million, respectively, related to higher average outstanding borrowings, partially offset by increases of $8 million and $10 million, respectively, in AFUDC debt related to increased capital expenditures. Also contributing to the increase for year-to-\n118\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\ndate 2025 was a decrease of $12 million in net deferred financing costs related to Plant Vogtle Unit 3. See Note 2 to the financial statements under \"Georgia Power – Nuclear Construction – Regulatory Matters\" in Item 8 of the Form 10-K and FINANCIAL CONDITION AND LIQUIDITY – \"Sources of Capital\" and \"Financing Activities\" herein for additional information.\nIncome Taxes\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$32\n13.0\n$96\n18.6\nIn the third quarter 2025, income taxes were $278 million compared to $246 million for the corresponding period in 2024. The increase was primarily due to higher pre-tax earnings, partially offset by an increase of $26 million in the flowback of excess state deferred income taxes.\nFor year-to-date 2025, income taxes were $612 million compared to $516 million for the corresponding period in 2024. The increase was primarily due to a $78 million increase in charges to a valuation allowance on certain state tax credit carryforwards, higher pre-tax earnings, and $33 million from the recognition of certain state tax positions from amended returns in the second quarter 2024, partially offset by increases of $60 million in the flowback of excess state deferred income taxes and $19 million in the generation of advanced nuclear PTCs.\nSee Note (G) to the Condensed Financial Statements herein for additional information.\nMississippi Power\nNet Income\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$9\n12.0\n$12\n6.5\nMississippi Power's net income in the third quarter 2025 was $84 million compared to $75 million for the corresponding period in 2024. For year-to-date 2025, net income was $198 million compared to $186 million for the corresponding period in 2024. The increases were primarily due to higher retail revenues primarily resulting from changes in rates and pricing, partially offset by an increase in depreciation and amortization.\nRetail Revenues\nIn the\n \nthird quarter 2025, retail revenues were\n \n$302 million compared to $276 million for the corresponding period in 2024. For \nyear-to-date 2025, retail revenues were \n$824 million\n compared to \n$739 million for the corresponding period in 2024. Details of the changes in retail revenues were as follows:\nThird Quarter 2025 vs.\nThird Quarter 2024\nYear-to-Date 2025 vs.\nYear-to-Date 2024\n \n(change in millions)\n(% change)\n(change in millions)\n(% change)\nRates and pricing\n$\n16 \n5.8 \n%\n$\n25 \n3.4 \n%\nSales growth\n2 \n0.7 \n7 \n1.0 \nWeather\n(1)\n(0.4)\n1 \n0.1 \nFuel and other cost recovery\n9 \n3.3 \n52 \n7.0 \nRetail revenues\n$\n26 \n9.4 \n%\n$\n85 \n11.5 \n%\nChanges in rates and pricing resulted in increases in revenues in the third quarter and year-to-date 2025 when compared to the corresponding periods in 2024 primarily due to new PEP rates that became effective for the first \n119\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nbilling cycle of April 2025. See Note (B) to the Condensed Financial Statements \"Mississippi Power – Performance Evaluation Plan\" for additional information.\nChanges in sales resulted in increases in revenues in the third quarter and year-to-date 2025 when compared to the corresponding periods in 2024. Weather-adjusted residential KWH sales increased 5.5% and 2.1% in the third quarter and year-to-date 2025, respectively, primarily due to increased customer usage. Weather-adjusted commercial KWH sales decreased 1.2% and 0.6% in the third quarter and year-to-date 2025, respectively, primarily due to decreased customer usage. I\nndustrial KWH sale\ns decreased 2.5% in the third quarter 2025 primarily due to decreases in the chemicals, petroleum, and oil and gas extraction sectors. \nIndustrial KWH sales\n increased 1.8% for year-to-date 2025 primarily due to increases in the petroleum and chemicals sectors.\nFuel and other cost recovery revenues increased in the third quarter and year-to-date 2025 when compared to the corresponding periods in 2024 primarily as a result of higher recoverable fuel costs. Recoverable fuel costs include fuel and purchased power expenses reduced by the fuel and emissions portion of wholesale revenues from energy sold to customers outside Mississippi Power's service territory. Electric rates include provisions to adjust billings for fluctuations in fuel costs, including the energy component of purchased power costs. Under these provisions, fuel revenues generally equal fuel expenses, including the energy component of purchased power costs, and do not affect net income. See Note 2 to the financial statements in Item 8 of the Form 10-K for additional information.\nWholesale Revenues – Non-Affiliates\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$6\n9.1\n$26\n14.5\nIn the third quarter 2025, wholesale revenues from sales to non-affiliates were $72 million compared to $66 million for the corresponding period in 2024. The increase was primarily due to a $3 million increase in opportunity sales and a $3 million increase associated with changes in power supply agreements.\nFor year-to-date 2025, wholesale revenues from sales to non-affiliates were $205 million compared to $179 million for the corresponding period in 2024. The increase was primarily due to a $15 million increase associated with MRA customers largely due to higher recoverable fuel costs and an $8 million increase associated with changes in power supply agreements.\nWholesale revenues from sales to non-affiliates will vary depending on fuel prices, the market prices of wholesale energy compared to the cost of Mississippi Power's and the Southern Company system's generation, demand for energy within the Southern Company system's electric service territory, and the availability of the Southern Company system's generation. Increases and decreases in energy revenues that are driven by fuel prices are accompanied by an increase or decrease in fuel costs and\n do not have a significant impact on net income. In \naddition, Mississippi Power provides service under long-term contracts with rural electric cooperative associations and municipalities located in southeastern Mississippi under cost-based electric tariffs which are subject to regulation by the FERC. Short-term opportunity energy sales are also included in sales for resale to non-affiliates. These opportunity sales are made at market-based rates that generally provide a margin above Mississippi Power's variable cost to produce the energy. See Note 2 to the financial statements under \"Mississippi Power – Municipal and Rural Associations Tariff\" in Item 8 of the Form 10-K for additional information.\n120\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nWholesale Revenues – Affiliates\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$37\n64.9\n$64\n38.6\nIn the third quarter 2025, wholesale revenues from sales to affiliates were $94 million compared to $57 million for the corresponding period in 2024. The increase was primarily due to increases of $24 million related to the volume of KWH sales and $12 million related to the price of energy driven by natural gas prices.\nFor year-to-date 2025, wholesale revenues from sales to affiliates were $230 million compared to $166 million for the corresponding period in 2024. The increase was primarily due to increases of $37 million related to the price of energy driven by natural gas prices and $25 million related to the volume of KWH sales.\nWholesale revenues from sales to affiliated companies will vary depending on demand and the availability and cost of generating resources at each company. These affiliate sales are made in accordance with the IIC or other contractual agreements, as approved by the FERC. Energy revenues related to these transactions do not have a significant impact on earnings since this energy is generally sold at marginal cost.\nOther Revenues\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(1)\n(7.7)\n$8\n23.5\nFor year-to-date 2025, other revenues were $42 million compared to $34 million for the corresponding period in 2024. The increase was primarily due to customer charges related to contributions in aid of construction included in rates.\nFuel and Purchased Power Expenses\nThird Quarter 2025 vs.\nThird Quarter 2024\nYear-to-Date 2025 vs. \nYear-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\nFuel\n$\n44 \n35.8 \n%\n$\n116 \n34.7 \n%\nPurchased power\n1 \n9.1 \n9 \n31.0 \nTotal fuel and purchased power expenses\n$\n45 \n$\n125 \nIn the third quarter 2025, total fuel and purchased power expenses were $179 million\n \ncompared to $134 million for the corresponding period in 2024. The\n \nincrease\n \nwas primarily due to a $24 million net increase related to the average cost of fuel and purchased power and a $21 million increase related to the volume of KWHs generated and purchased.\nFor \nyear-to-date 2025, total fuel and purchased power expenses were\n $488 million\n compared to \n$363 million\n for the corresponding period in 2024. The \nincrease\n was due to\n an $89 million net increase related to the average cost of fuel and purchased power and a $36 million increase related to the volume of KWHs generated and purchased.\nFuel and purchased power energy transactions do not have a significant impact on earnings since energy expenses are generally offset by energy revenues through Mississippi Power's fuel cost recovery clause.\nEnergy purchases will vary depending on the market prices of wholesale energy as compared to the cost of the Southern Company system's generation, demand for energy within the Southern Company system's electric service territory, and the availability of the Southern Company system's generation. These purchases are made in accordance with the IIC or other contractual agreements, as approved by the FERC.\n121\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nDetails of Mississippi Power's generation and purchased power and the related costs were as follows:\nThird Quarter 2025\nThird Quarter 2024\nYear-to-Date 2025\nYear-to-Date 2024\nTotal generation \n(in millions of KWHs)\n5,627\n4,905\n14,110\n13,313\nTotal purchased power \n(in millions of KWHs)\n264\n232\n855\n633\nSources of generation \n(percent)\n –\nGas\n88\n89\n89\n91\nCoal\n12\n11\n11\n9\nCost of fuel, generated \n(in cents per net KWH)\n \n–\nGas\n2.95\n2.25\n3.21\n2.37\nCoal\n4.35\n5.39\n4.70\n5.31\nAverage cost of fuel, generated \n(in cents per net KWH)\n3.13\n2.62\n3.39\n2.66\nAverage cost of purchased power \n(in cents per net KWH)\n4.45\n4.71\n4.47\n4.49\nOther Operations and Maintenance Expenses\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$4\n4.4\n$—\n—\nFor year-to-date 2025, other operations and maintenance expenses were flat compared to the corresponding period in 2024. Year-to-date 2025 included $10.9 million of reliability-related expenses that were offset by utilization of the reliability reserve. See Note (B) to the Condensed Financial Statements \"Mississippi Power – Reliability Reserve Accounting Order\" for additional information.\nDepreciation and Amortization\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$5\n10.4\n$16\n11.3\nIn the third quarter 2025, depreciation and amortization was $53 million compared to $48 million for the corresponding period in 2024. For year-to-date 2025, depreciation and amortization was $157 million compared to $141 million for the corresponding period in 2024. The increases were primarily due to an increase in depreciation rates and additional plant in service. See Note (A) to the Condensed Financial Statements under \"Depreciation and Amortization\" herein for additional information.\nTaxes Other Than Income Taxes\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$4\n12.1\n$11\n11.6\nIn the third quarter 2025, taxes other than income taxes were $37 million compared to $33 million for the corresponding period in 2024. For year-to-date 2025, taxes other than income taxes were $106 million compared to $95 million for the corresponding period in 2024. The increases were primarily due to increases in property taxes primarily resulting from an increase in the assessed value of property.\n122\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nOther Income (Expense), Net\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$1\n11.1\n$(7)\n(21.2)\nFor year-to-date 2025, other income (expense), net was $26 million\n compared to \n$33 million\n \nfor\n the corresponding period in 2024.\n The decrease was primarily due to lower customer charges related to contributions in aid of construction.\nIncome Taxes\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$2\n9.1\n$11\n23.4\nFor year-to-date 2025, income taxes were $58 million compared to $47 million for the corresponding period in 2024. The increase was primarily due to higher pre-tax earnings and a decrease of $5 million primarily due to the flowback of certain excess deferred income taxes that ended in 2024.\nSee Note (G) to the Condensed Financial Statements herein for additional information.\nSouthern Power\nNet Income Attributable to Southern Power\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(79)\n(96.3)\n$(123)\n(46.6)\nNet income attributable to Southern Power in the third quarter 2025 was $3 million compared to $82 million for the corresponding period in 2024. The decrease was primarily due to accelerated depreciation related to wind repowering projects.\nNet income attributable to Southern Power for year-to-date 2025 was $141 million compared to $264 million for the corresponding period in 2024. The decrease was primarily due to accelerated depreciation related to wind repowering projects and an increase in other operations and maintenance expenses due to increases in scheduled outage expenses and generation maintenance, partially offset by higher revenues driven by higher market prices of energy and higher HLBV income associated with tax equity partnerships.\nSee Note (K) to the Condensed Financial Statements under \"Southern Power – Wind Repowering Projects\" herein and Note 15 to the financial statements under \"Southern Power – Development Projects\" in Item 8 of the Form 10-K for additional information.\nOperating Revenues\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$13\n2.2\n$129\n8.1\nTotal operating revenues include PPA capacity revenues, which are derived primarily from long-term contracts associated with natural gas facilities, and PPA energy revenues derived from long-term contracts associated with Southern Power's generation facilities. To the extent Southern Power has capacity not contracted under a PPA, it may sell power into an accessible wholesale market, or, to the extent those generation assets are part of the FERC-approved IIC, it may sell power into the Southern Company power pool.\n123\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nNatural Gas Capacity and Energy Revenue\nCapacity revenues generally represent the greatest contribution to operating income and are designed to provide recovery of fixed costs plus a return on investment.\nEnergy is generally sold at variable cost or is indexed to published natural gas indices. Energy revenues will vary depending on the energy demand of Southern Power's customers and their generation capacity, as well as the market prices of wholesale energy compared to the cost of Southern Power's energy. Energy revenues also include fees for support services, fuel storage, and unit start charges. Increases and decreases in energy revenues under PPAs that are driven by fuel or purchased power prices are accompanied by an increase or decrease in fuel and purchased power costs and do not have a significant impact on net income.\nSolar and Wind Energy Revenue\nSouthern Power's energy sales from solar and wind generating facilities are predominantly through long-term PPAs that do not have capacity revenue. Customers either purchase the energy output of a dedicated renewable facility through an energy charge or pay a fixed price related to the energy generated from the respective facility and sold to the grid. As a result, Southern Power's ability to recover fixed and variable operations and maintenance expenses is dependent upon the level of energy generated from these facilities, which can be impacted by weather conditions, equipment performance, transmission constraints, and other factors.\nSee FUTURE EARNINGS POTENTIAL – \"Southern Power's Power Sales Agreements\" in Item 7 of the Form 10-K for additional information regarding Southern Power's PPAs.\nOperating Revenues Details\nDetails of Southern Power's operating revenues were as follows:\nThird Quarter 2025\nThird Quarter 2024\nYear-to-Date 2025\nYear-to-Date 2024\n(in millions)\nPPA capacity revenues \n$\n148\n \n$\n147 \n$\n394\n \n$\n390 \nPPA energy revenues \n397\n \n373 \n1,114\n \n985 \nTotal PPA revenues\n545\n \n520 \n1,508\n \n1,375 \nNon-PPA revenues \n65\n \n71 \n201\n \n191 \nOther revenues\n3\n \n9 \n17\n \n31 \nTotal operating revenues\n$\n613\n \n$\n600 \n$\n1,726\n \n$\n1,597 \nIn the third quarter 2025, total operating revenues were $613 million, reflecting a $13 million, or 2.2%, increase from the corresponding period in 2024. The change in operating revenues was primarily due to the following:\n•\nPPA energy revenues increased $24 million, or 6.4%, due to an increase of $18 million related to the volume of KWHs sold under natural gas PPAs and an increase of $6 million driven by fuel and purchased power prices.\n•\nNon-PPA revenues decreased $6 million, or 8.5%, due to a decrease of of $24 million related to the volume of KWHs sold through short-term sales, largely offset by an increase of $18 million driven by the market price of energy.\nFor year-to-date 2025, total operating revenues were $1.7 billion, reflecting a $129 million, or 8.1%, increase from the corresponding period in 2024. The change in operating revenues was primarily due to the following:\n•\nPPA energy revenues increased $129 million, or 13.1%, primarily due to an increase of $72 million related to the volume of KWHs sold under natural gas PPAs and an increase of $59 million largely driven by fuel and purchased power prices.\n124\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\n•\nNon-PPA revenues increased $10 million, or 5.2%, due to an increase of $54 million driven by the market price of energy, largely offset by a decrease of $44 million related to the volume of KWHs sold through short-term sales.\n•\nOther revenues decreased $14 million, or 45.2%, due to a $22 million decrease associated with transmission revenues, partially offset by an $8 million increase in receipts associated with liquidated damages related to generation facility production guarantees, warranty settlements, and insurance claims.\nFuel and Purchased Power Expenses\nDetails of Southern Power's generation and purchased power were as follows:\n \nThird Quarter 2025\nThird Quarter 2024\nYear-to-Date 2025\nYear-to-Date 2024\n(in billions of KWHs)\nGeneration\n12.5\n12.8\n35.0\n34.2\nPurchased power\n0.7\n0.5\n1.9\n1.7\nTotal generation and purchased power\n13.2\n13.3\n36.9\n35.9\nTotal generation and purchased power\n(excluding solar, wind, fuel cells, and tolling agreements)\n8.2\n8.3\n22.7\n21.5\nSouthern Power's PPAs for natural gas generation generally provide that the purchasers are responsible for either procuring the fuel (tolling agreements) or reimbursing Southern Power for substantially all of the cost of fuel relating to the energy delivered under such PPAs. Consequently, changes in such fuel costs are generally accompanied by a corresponding change in related fuel revenues and do not have a significant impact on net income. Southern Power is responsible for the cost of fuel for generating units that are not covered under PPAs. Power from these generating units is sold into the wholesale market or into the Southern Company power pool for capacity owned directly by Southern Power.\nPurchased power expenses will vary depending on demand, availability, and the cost of generating resources throughout the Southern Company system and other contract resources. Load requirements are submitted to the Southern Company power pool on an hourly basis and are fulfilled with the lowest cost alternative, whether that is generation owned by Southern Power, an affiliate company, or external parties. Such purchased power costs are generally recovered through PPA revenues.\nDetails of Southern Power's fuel and purchased power expenses were as follows:\n \nThird Quarter 2025 vs.\nThird Quarter 2024\nYear-to-Date 2025 vs. \nYear-to-Date 2024\n \n(change in millions)\n(% change)\n(change in millions)\n(% change)\nFuel\n$\n2 \n1.2 \n%\n$\n69 \n15.2 \n%\nPurchased power\n12 \n60.0 \n31 \n51.7 \nTotal fuel and purchased power expenses\n$\n14 \n$\n100 \nIn the third quarter 2025, total fuel and purchased power expenses increased $14 million, or 7.5%, compared to the corresponding period in 2024. Fuel expense increased $2 million due to a $7 million increase associated with the average cost of fuel, largely offset by a $5 million decrease related to the volume of KWHs generated. Purchased power expense increased $12 million due to a $6 million increase associated with the average cost of purchased power and a $6 million increase related to the volume of KWHs purchased.\nFor year-to-date 2025, total fuel and purchased power expenses increased $100 million, or 19.5%, compared to the corresponding period in 2024. Fuel expense increased $69 million due to a $45 million increase associated with the average cost of fuel and a $24 million increase related to the volume of KWHs generated. Purchased power expense increased $31 million primarily due to a $24 million increase associated with the average cost of purchased power.\n125\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nOther Operations and Maintenance Expenses\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$2\n1.6\n$17\n4.6\nFor year-to-date 2025, other operations and maintenance expenses were $384 million compared to $367 million for the corresponding period in 2024. The increase was primarily due to an increase in scheduled outage and generation maintenance expenses, partially offset by lower transmission costs.\nDepreciation and Amortization\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$114\n85.7\n$198\n52.4\nIn the third quarter 2025, depreciation and amortization was $247 million compared to $133 million for the corresponding period in 2024. For year-to-date 2025, depreciation and amortization was $576 million compared to $378 million for the corresponding period in 2024. The increases for the third quarter and year-to-date 2025 were primarily due to accelerated depreciation of $112 million and $181 million, respectively, related to wind repowering projects. See Note (K) to the Condensed Financial Statements under \"Southern Power – Wind Repowering Projects\" herein and Note 15 to the financial statements under \"Southern Power – Development Projects\" in Item 8 of the Form 10-K for additional information.\nInterest Expense, Net of Amount Capitalized\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(5)\n(16.7)\n$(13)\n(14.6)\nFor year-to-date 2025, interest expense, net of amount capitalized was $76 million compared to $89 million for the corresponding period in 2024. The decrease was primarily due to an increase in capitalized interest associated with construction and wind repowering projects.\nIncome Taxes\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(27)\n(81.8)\n$(29)\n(90.6)\nIn the third quarter 2025, income taxes were $6 million compared to $33 million for the corresponding period in 2024. For year-to-date 2025, income taxes were $3 million compared to $32 million for the corresponding period in 2024. The decreases were primarily due to a change in pre-tax earnings attributable to Southern Power, including the impact of accelerated depreciation related to wind repowering projects. See Note (G) to the Condensed Financial Statements and Note (K) to the Condensed Financial Statements under \"Southern Power – Wind Repowering Projects\" herein for additional information.\n126\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nNet Loss Attributable to Noncontrolling Interests\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(4)\nN/M\n$(22)\n(30.1)\nFor year-to-date 2025, net loss attributable to noncontrolling interests was $95 million compared to $73 million for the corresponding period in 2024. The increase was primarily due to $14 million in higher HLBV loss allocations to tax equity partners and $11 million in lower income allocations to equity partners.\nSouthern Company Gas\nSouthern Company Gas uses Heating Degree Days to measure weather and the operational effects on its business. Generally, increased Heating Degree Days results in higher demand for natural gas on Southern Company Gas' distribution system. However, Southern Company Gas has various regulatory mechanisms, such as weather and revenue normalization and straight-fixed-variable rate design, which limits positive or negative impacts to income from exposure to weather changes within typical ranges in each of its utility's respective service territory. Southern Company Gas also utilizes weather hedges to limit the negative income impacts in the event of warmer-than-normal weather in Illinois for gas distribution operations and in Illinois and Georgia for gas marketing services. Therefore, weather typically does not have a significant net income impact.\nDuring the Heating Season, more customers are connected to the gas distribution systems and natural gas usage is higher in periods of colder weather. Southern Company Gas' base operating expenses, excluding cost of natural gas and bad debt expense, are incurred relatively evenly throughout the year. Seasonality also affects the comparison of certain balance sheet items across quarters, including receivables, unbilled revenues, natural gas for sale, and notes payable. However, these items are comparable when reviewing Southern Company Gas' annual results. Thus, Southern Company Gas' operating results for the interim periods presented are not necessarily indicative of annual results and can vary significantly from quarter to quarter as a result of seasonality.\nNet Income\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(13)\n(34.2)\n$(6)\n(1.1)\nSouthern Company Gas' net income in the third quarter 2025 was $25 million compared to $38 million for the corresponding period in 2024. The decrease was primarily due to a $9 million decrease in net income at gas distribution operations, a $5 million increase in net loss at all other, and a $4 million decrease in net income at gas pipeline investments, partially offset by a $5 million increase in net income at gas marketing services.\nFor year-to-date 2025, net income was $549 million compared to $555 million for the corresponding period in 2024. The decrease was primarily due to a $15 million decrease in net income at gas pipeline investments and a $10 million decrease in net income at all other, partially offset by a $14 million increase in net income at gas distribution operations and a $5 million increase in net income at gas marketing services.\n127\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nNatural Gas Revenues\nIn the third quarter 2025, natural gas revenues were $734 million compared to $682 million for the corresponding period in 2024. For year-to-date 2025, natural gas revenues were $3.6 billion compared to $3.2 billion for the corresponding period in 2024. Details of the changes in natural gas revenues were as follows:\nThird Quarter 2025 vs. \nThird Quarter 2024\nYear-to-Date 2025 vs.\n Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\nRates\n$\n27 \n3.9 \n%\n$\n98 \n3.0 \n%\nGas costs and other cost recovery\n23 \n3.4 \n189 \n5.9 \nGas marketing services\n5 \n0.7 \n40 \n1.2 \nOther\n(3)\n(0.4)\n5 \n0.2 \nNatural gas revenues\n$\n52 \n7.6 \n%\n$\n332 \n10.3 \n%\nChanges in rates resulted in an increase in revenues in the third quarter and year-to-date 2025 compared to the corresponding periods in 2024 primarily due to base rate increases at Atlanta Gas Light and Virginia Natural Gas. See Note 2 to the financial statements under \"Southern Company Gas – Rate Proceedings\" in Item 8 of the Form 10-K for additional information.\nRevenues from gas costs and other cost recovery increased in the third quarter and year-to-date 2025 compared to the corresponding periods in 2024 primarily due to higher natural gas prices and gas volumes. See \"Cost of Natural Gas\" herein for additional information.\nRevenues from gas marketing services increased in the third quarter and year-to-date 2025 compared to the corresponding periods in 2024 primarily due to higher commodity prices.\nCost of Natural Gas\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$18\n18.4\n$194\n22.8\nExcluding Atlanta Gas Light, which does not sell natural gas to end-use customers, natural gas distribution rates include provisions to adjust billings for fluctuations in natural gas costs. Therefore, gas costs recovered through natural gas revenues generally equal the amount expensed in cost of natural gas and do not affect net income from gas distribution operations. Cost of natural gas at gas distribution operations represented 81.9% and 81.5% of the total cost of natural gas in the third quarter and year-to-date 2025, respectively. See MANAGEMENT'S DISCUSSION AND ANALYSIS – RESULTS OF OPERATIONS – \"Southern Company Gas – Cost of Natural Gas\" in Item 7 of the Form 10-K and \"Natural Gas Revenues\" herein for additional information.\nIn the third quarter 2025, cost of natural gas was $116 million compared to $98 million for the corresponding period in 2024. For year-to-date 2025, cost of natural gas was $1.0 billion compared to $0.9 billion for the corresponding period in 2024. The increases reflect higher gas cost recovery as a result of increases of 42.4% and 61.6% in natural gas prices in the third quarter and year-to-date 2025, respectively.\n128\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nThe following table details the volumes of natural gas sold during all periods presented:\nThird Quarter\nYear-to-Date\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\nGas distribution operations\n \n(mmBtu in millions)\nFirm\n71\n \n71 \n— \n%\n475\n \n432 \n10.0 \n%\nInterruptible\n21\n \n22 \n(4.5)\n64\n \n69 \n(7.2)\nTotal\n92\n \n93 \n(1.1)\n%\n539\n \n501 \n7.6 \n%\nGas marketing services\n \n(mmBtu in millions)\nFirm:\nGeorgia\n3\n \n3 \n— \n%\n25\n \n25 \n— \n%\nIllinois\n—\n \n— \n— \n4\n \n4 \n— \nOther\n2\n \n2 \n— \n14\n \n11 \n27.3 \nInterruptible large commercial and industrial\n3\n \n3 \n— \n10\n \n11 \n(9.1)\nTotal\n8\n \n8 \n— \n%\n53\n \n51 \n3.9 \n%\nOther Operations and Maintenance Expenses\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$19\n6.4\n$52\n5.9\nIn the third quarter 2025, other operations and maintenance expenses were $314 million compared to $295 million for the corresponding period in 2024. The increase was primarily due to increases of $11 million in employee compensation and benefit expenses, $6 million in expenses passed through to customers primarily related to bad debt and energy efficiency programs at gas distribution operations, and $5 million in legal expenses, partially offset by a decrease of $8 million related to certain deferred expenses.\nFor year-to-date 2025, other operations and maintenance expenses were $929 million compared to $877 million for the corresponding period in 2024. The increase was primarily due to increases of $35 million in expenses passed through to customers primarily related to bad debt and energy efficiency programs at gas distribution operations and $34 million in employee compensation and benefit expenses, partially offset by a decrease of $20 million related to certain deferred expenses.\nDepreciation and Amortization\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$14\n8.6\n$42\n8.8\nIn the third quarter 2025, depreciation and amortization was $176 million compared to $162 million for the corresponding period in 2024. \nFor \nyear-to-date 2025\n, \ndepreciation and amortization was $517 million compared to $475 million for the corresponding period in 2024. The\n \nincreases were primarily due to additional plant in service related to continued investments at the natural gas distribution utilities.\n129\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nTaxes Other Than Income Taxes\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$4\n9.1\n$20\n10.8\nFor year-to-date 2025, taxes other than income taxes were $206 million compared to $186 million for the corresponding period in 2024. The increase was primarily due to an increase of $14 million in revenue taxes as a result of higher natural gas revenues at Nicor Gas. Revenue taxes imposed on Nicor Gas are recoverable from its customers.\nEarnings from Equity Method Investments\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(3)\n(8.8)\n$(17)\n(15.5)\nIn the third quarter 2025, earnings from equity method investments were $31 million compared to $34 million for the corresponding period in 2024. For year-to-date 2025, earnings from equity method investments were $93 million compared to $110 million for the corresponding period in 2024. The decreases were primarily due to lower rates at SNG. See Note 7 to the financial statements under \"Southern Company Gas\" in Item 8 of the Form 10-K and Note (E) to the Condensed Financial Statements under \"Southern Company Gas\" herein for additional information.\nInterest Expense, Net of Amounts Capitalized \nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$10\n11.9\n$27\n10.8\nIn the \nthird quarter 2025, \ninte\nrest expense, net of amounts capitalized was $94 million compared to $84 million for the corresponding period in 2024. For year-to-date 2025, interest expense, net of amounts capitalized was $277 million compared to $250 million for the corresponding period in 2024. The increases were primarily associated with higher average outstanding borrowings. See FINANCIAL CONDITION AND LIQUIDITY – \"Sources of Capital\" and \"Financing Activities\" herein for additional information on borrowings.\nIncome Taxes\nThird Quarter 2025 vs. Third Quarter 2024\nYear-to-Date 2025 vs. Year-to-Date 2024\n(change in millions)\n(% change)\n(change in millions)\n(% change)\n$(5)\n(45.5)\n$(15)\n(8.2)\nIn the third quarter 2025, income taxes were\n \n$6 million\n compared to $11 million for the corresponding period in 2024. The \ndecrease was primarily due to lower pre-tax earnings.\nF\nor \nyear-to-date 2025\n, income taxes\n were $169 million compared to $184 million for the corresponding period in 2024. The decrease was primarily due to an increase of $10 million in the flowback of excess state deferred income taxes and lower pre-tax earnings.\nSee Note (G) to the Condensed Financial Statements herein for additional information.\n130\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nSegment Information\nOperating revenues, operating expenses, and net income for each segment are provided in the table below. See Note (L) to the Condensed Financial Statements under \"Southern Company Gas\" herein for additional information.\n \n2025\n2024\n Operating Revenues\nOperating Expenses\nNet Income (Loss)\n Operating Revenues\nOperating Expenses\nNet Income (Loss)\n(in millions)\nThird Quarter\nGas distribution operations\n$\n668\n \n$\n589\n \n$\n12\n \n$\n616 \n$\n533 \n$\n21 \nGas pipeline investments\n8\n \n2\n \n20\n \n8 \n2 \n24 \nGas marketing services\n58\n \n52\n \n3\n \n53 \n55 \n(2)\nAll other\n1\n \n7\n \n(10)\n6 \n7 \n(5)\nIntercompany eliminations\n(1)\n4\n \n—\n \n(1)\n2 \n— \nConsolidated\n$\n734\n \n$\n654\n \n$\n25\n \n$\n682 \n$\n599 \n$\n38 \nYear-to-Date\nGas distribution operations\n$\n3,122\n \n$\n2,379\n \n$\n417\n \n$\n2,828 \n$\n2,104 \n$\n403 \nGas pipeline investments\n24\n \n7\n \n62\n \n24 \n7 \n77 \nGas marketing services\n403\n \n293\n \n77\n \n358 \n260 \n72 \nAll other\n11\n \n16\n \n(7)\n19 \n18 \n3 \nIntercompany eliminations\n(8)\n3\n \n—\n \n(9)\n1 \n— \nConsolidated\n$\n3,552\n \n$\n2,698\n \n$\n549\n \n$\n3,220 \n$\n2,390 \n$\n555 \nGas Distribution Operations\nThe gas distribution operations segment is the largest component of Southern Company Gas' business and is subject to regulation and oversight by regulatory agencies in each of the states it serves. These agencies approve natural gas rates designed to provide Southern Company Gas with the opportunity to generate revenues to recover the cost of natural gas delivered to its customers and its fixed and variable costs, including depreciation, interest expense, operations and maintenance, taxes, and overhead costs, and to earn a reasonable return on its investments.\nWith the exception of Atlanta Gas Light, Southern Company Gas' second largest utility that operates in a deregulated natural gas market and has a straight-fixed-variable rate design that minimizes the variability of its revenues based on consumption, the earnings of the natural gas distribution utilities can be affected by customer consumption patterns that are a function of price levels for natural gas and general economic conditions that may impact customers' ability to pay for natural gas consumed. Southern Company Gas has various regulatory and other mechanisms, such as weather and revenue normalization mechanisms and weather derivative instruments, that limit its exposure to changes in customer consumption, including weather changes within typical ranges in its natural gas d\nistribution utilities' service territories. See Note 2 to the financial statements under \"Southern Company Gas\" in Item 8 of the Form 10-K for additional information.\nIn the third quarter 2025, net income decreased $9 million, or 42.9%, when compared to the corresponding period in 2024, as described further below:\n•\nOperating revenues increased $52 million primarily due to higher gas cost recovery and base rate increases. Gas costs recovered through natural gas revenues generally equal the amount expensed in cost of natural gas.\n131\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\n•\nOperating expenses increased $56 million primarily due to a $21 million increase in cost of natural gas as a result of higher gas prices and higher volumes sold compared to 2024, a $15 million increase in depreciation primarily due to additional plant in service related to continued investments at the natural gas distribution utilities, a $7 million increase related to employee compensation and benefit expenses, a $6 million increase related to expenses passed through to customers, and a $5 million increase in legal expenses, partially offset by a decrease of $8 million related to certain deferred expenses.\n•\nInterest expense, net of amounts capitalized increased $14 million primarily due to higher average outstanding borrowings.\n•\nIncome taxes decreased $11 million primarily as a result of lower pre-tax earnings and the flowback of excess state deferred income taxes.\nFor year-to-date 2025, net income increased $14 million, or 3.5%, when compared to the corresponding period in 2024, as described further below:\n•\nOperating revenues increased $294 million primarily due to higher gas cost recovery and base rate increases. Gas costs recovered through natural gas revenues generally equal the amount expensed in cost of natural gas.\n•\nOperating expenses increased $275 million primarily due to a $166 million increase in cost of natural gas as a result of higher gas prices and higher volumes sold compared to 2024, a $49 million increase related to expenses passed through to customers, a $43 million increase in depreciation primarily due to additional plant in service related to continued investments at the natural gas distribution utilities, and a $22 million increase related to employee compensation and benefit expenses, partially offset by a decrease of $20 million related to certain deferred expenses.\n•\nInterest expense, net of amounts capitalized increased $23 million primarily due to higher average outstanding borrowings.\n•\nIncome taxes decreased $16 million primarily as a result of the flowback of excess state deferred income taxes and lower pre-tax earnings.\nGas Pipeline Investments\nThe gas pipeline investments segment consists primarily of joint ventures in natural gas pipeline investments including SNG and Dalton Pipeline. See Note (E) to the Condensed Financial Statements under \"Southern Company Gas\" herein for additional information.\nIn the third quarter and year-to-date 2025, net income decreased $4 million and $15 million, respectively, when compared to the corresponding periods in 2024. The decreases were primarily due to lower rates at SNG.\nGas Marketing Services\nThe gas marketing services segment provides energy-related products and services to natural gas markets and participants in customer choice programs that were approved in various states to increase competition. These programs allow customers to choose their natural gas supplier while the local distribution utility continues to provide distribution and transportation services. Gas marketing services is weather sensitive and uses a variety of hedging strategies, such as weather derivative instruments and other risk management tools, to partially mitigate potential weather impacts.\nIn the third quarter 2025, net income was $3 million compared to a net loss of $2 million for the corresponding period in 2024. The change was primarily due to higher retail margins, partially offset by higher income taxes.\nFor year-to-date 2025, net income increased $5 million, or 6.9%, when compared to the corresponding period in 2024 primarily due to higher retail margins, partially offset by an increase in employee compensation and benefits and proceeds from a legal settlement received in 2024.\n132\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nAll Other\nAll other includes a renewable natural gas business, AGL Services Company, and Southern Company Gas Capital, as well as various corporate operating expenses that are not allocated to the reportable segments and interest income (expense) associated with affiliate financing arrangements. See Note 15 to the financial statements in Item 8 of the Form 10-K for additional information.\nIn the third quarter 2025, net loss increased $5 million when compared to the corresponding period in 2024. The change was primarily due to higher interest expense as a result of higher average outstanding borrowings.\nFor year-to-date 2025, net loss was $7 million compared to net income of $3 million for the corresponding period in 2024. The change was primarily due to lower revenue at the renewable natural gas business.\nFUTURE EARNINGS POTENTIAL\nEach Registrant's results of operations are not necessarily indicative of its future earnings potential. The level of the Registrants' future earnings depends on numerous factors that affect the opportunities, challenges, and risks of the Registrants' primary businesses of selling electricity and/or distributing natural gas, as described further herein. The Registrants are unable to predict changes in law, regulations, regulatory guidance, legal interpretations, policy positions, and implementation actions that may result from the presidential administration.\nFor the traditional electric operating companies, these factors include the ability to maintain constructive regulatory environments that allow for the timely recovery of prudently-incurred costs during a time of increasing costs, including those related to projected long-term demand growth, stringent environmental standards, including CCR rules, safety, system reliability and resiliency, fuel, restoration following major storms, and capital expenditures, including constructing new electric generating plants, extending the retirement dates of certain fossil fuel plants, and expanding and improving the transmission and distribution systems; continued customer growth; and the trends of an uncertain inflationary environment and reduced electricity usage per customer, especially in residential and commercial markets.\nEarnings in the electricity business will also depend upon maintaining and growing sales and pricing of large customers such that incremental costs are met with adequate incremental revenues, considering, among other things, recent trends driving projected growth in electricity consumption including the increasing digitization of the economy and growth in data centers, an increase in industrial activity in the Southern Company system's electric service territory, and continued electrification of transportation. Historically, the traditional electric operating companies have entered into large contracts that support economic development and benefit existing customers; since 2023, the traditional electric operating companies have contracts with new customers covering approximately eight gigawatts of such electric load, with each contract individually representing a maximum annual electric load greater than 100 MWs, that have been signed and/or reviewed by the state regulatory commissions. These new contracts fully ramp up over several years after commencement of service. Some of these contracts are already in effect. Service under the contracts is expected to begin through 2028. The contracts contain various terms and conditions, such as minimum duration, minimum bill provisions, contribution by the customer to local construction costs, termination payment requirements, and financial security, to help ensure adequate incremental revenues associated with incremental cost to serve these customers. These growth opportunities may be affected by a variety of factors, such as energy efficiency, reliability and operational factors, customer demand, and government policies, which could increase or decrease the pace of growth associated with these opportunities. See Note (B) to the Condensed Financial Statements under \"Georgia Power – Integrated Resource Plans\" for additional information regarding Georgia Power's related regulatory proceedings.\nEconomic uncertainty and policy uncertainty have increased the volatility of future economic outlooks above historical norms. Significant changes in fiscal, monetary, or trade policies could disrupt anticipated economic outlooks. This uncertainty in economic growth, interest rates, tariffs, and inflation could impact customer demand for energy, access to capital markets, and the cost of doing business. The shifting economic policy variables and weakening of historic relationships among economic activity, prices, and employment have increased the uncertainty of future levels of economic activity, which will directly impact future energy demand and operating \n133\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\ncosts. Weakening economic activity increases the risk of slowing or declining energy sales. See RESULTS OF OPERATIONS herein for information on energy sales in the Southern Company system's service territory during the first nine months of 2025.\nThe level of future earnings for Southern Power's competitive wholesale electric business depends on numerous factors including the parameters of the wholesale market and the efficient operation of its wholesale generating assets; Southern Power's ability to execute its growth strategy through the development, construction, or acquisition of generating facilities and other energy projects while containing costs; regulatory matters; customer creditworthiness; total electric generating capacity available in Southern Power's market areas; Southern Power's ability to successfully remarket capacity as current contracts expire; renewable portfolio standards; continued availability of federal and state ITCs and PTCs under current and future tax legislation and U.S. Treasury guidance; transmission constraints; cost of generation from units within the Southern Company power pool; and operational limitations. See MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"Income Tax Matters\" in Item 7 of the Form 10-K for information regarding the Inflation Reduction Act's expansion of the availability of federal ITCs and PTCs and \"Income Tax Matters – Federal Tax Legislation\" herein for information regarding the One Big Beautiful Bill Act's (OBBB) restrictions on federal ITCs and PTCs. Also see Note (K) to the Condensed Financial Statements under \"Southern Power\" herein for information regarding construction projects.\nThe level of future earnings for Southern Company Gas' primary business of distributing natural gas and its complementary businesses in the gas pipeline investments and gas marketing services sectors depends on numerous factors. These factors include the natural gas distribution utilities' ability to maintain constructive regulatory environments that allow for the timely recovery of prudently-incurred costs, including those related to projected long-term demand growth, safety, system reliability and resiliency, natural gas, and capital expenditures, including expanding and improving the natural gas distribution systems; the completion and subsequent operation of ongoing infrastructure and other construction projects; customer creditworthiness; and certain policies to limit the use of natural gas, such as the potential in Illinois and across certain other parts of the United States for state or municipal bans on the use of natural gas or policies designed to promote electrification. The volatility of natural gas prices has an impact on Southern Company Gas' customer rates, its long-term competitive position against other energy sources, and the ability of Southern Company Gas' gas marketing services business to capture value from locational and seasonal spreads. Additionally, changes in commodity prices, primarily driven by tight gas supplies, geopolitical events, and diminished gas production, subject a portion of Southern Company Gas' operations to earnings variability and may result in higher natural gas prices. Additional economic factors may contribute to this environment. The demand for natural gas may increase, including from large customers, which may cause natural gas prices to rise and drive higher volatility in the natural gas markets on a longer-term basis. Alternatively, a significant drop in oil and natural gas prices could lead to a consolidation of natural gas producers or reduced levels of natural gas production.\nEarnings for both the electricity and natural gas businesses are subject to a variety of other factors. These factors include weather; competition; developing new and maintaining existing energy contracts and associated load requirements with wholesale customers; demand growth in data centers; customer energy conservation practices; the use of alternative energy sources by customers; government incentives to reduce overall energy usage; fuel, labor, and material prices in an environment of heightened inflation and material and labor supply chain disruptions; and the price elasticity of demand. Demand for electricity and natural gas in the Registrants' service territories is primarily driven by the pace of economic growth or decline that may be affected by changes in regional and global economic conditions, which may impact future earnings.\nAs part of its ongoing effort to adapt to changing market conditions, Southern Company continues to evaluate and consider a wide array of potential business strategies. These strategies may include business combinations, partnerships, joint ventures, and acquisitions involving other utility or non-utility businesses or properties, disposition of, or the sale of interests in, certain assets or businesses, internal restructuring, or some combination thereof. Furthermore, Southern Company may engage in new business ventures that arise from competitive and regulatory changes in the utility industry. Pursuit of any of the above strategies, or any combination thereof, may \n134\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nsignificantly affect the business operations, risks, and financial condition of Southern Company. In addition, Southern Power and Southern Company Gas regularly consider and evaluate joint development arrangements as well as acquisitions and/or dispositions of businesses and assets as part of their business strategies. See Note 15 to the financial statements in Item 8 of the Form 10-K, Note (K) to the Condensed Financial Statements herein, and \"Construction Programs\" herein for additional information.\nFor additional information relating to these issues, see RISK FACTORS in Item 1A and MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL in Item 7 of the Form 10-K.\nEnvironmental Matters\nSee MANAGEMENT'S DISCUSSION AND ANALYSIS \n–\n FUTURE EARNINGS POTENTIAL \n–\n \"Environmental Matters\" and – FINANCIAL CONDITION AND LIQUIDITY \n–\n \"Cash Requirements\" in Item 7 and Note 3 to the financial statements under \"Environmental Remediation\" and Note 6 to the financial statements in Item 8 of the Form 10-K, as well as Note (C) to the Condensed Financial Statements under \"General Litigation Matters\" and \"Environmental Remediation\" herein, for additional information.\nEnvironmental Laws and Regulations\nAir Quality\nOn March 12, 2025, the EPA announced its intent to reconsider the 2015 Ozone National Ambient Air Quality Standards (NAAQS) Good Neighbor federal implementation plan (FIP) and to work with states on state implementation plans (SIPs).\nOn March 25, 2025, the U.S. Court of Appeals for the Fifth Circuit vacated and remanded the EPA's disapproval of the Mississippi SIP. The decision protects the State of Mississippi from the requirements of the FIP unless or until the EPA properly disapproves Mississippi's SIP.\nOn April 14, 2025, the U.S. Court of Appeals for the D.C. Circuit granted the EPA's motion to hold in abeyance the FIP litigation.\nOn June 18, 2025, the U.S. Supreme Court issued an opinion holding that the proper venue for reviewing SIP disapprovals are regional appellate courts instead of the U.S. Court of Appeals for the D.C. Circuit.\nThe ultimate impact of the FIP and associated legal matters cannot be determined at this time; however, implementation of the stayed FIP would likely result in increased compliance costs for the traditional electric operating companies.\nWater Quality\nOn March 12, 2025, the EPA announced its intent to reconsider the standards finalized in the 2024 ELG Rule, including the new technology-based ELGs for leachate. On August 28, 2025, the U.S. Court of Appeals for the Eighth Circuit granted the EPA's most recent request to continue to hold the 2024 ELG Rule litigation in abeyance pending rulemaking. The EPA stated in its motion that it anticipates issuing a final rule extending certain 2024 ELG Rule compliance deadlines by the end of 2025 and also that it will issue a second more substantive rulemaking at which time it anticipates that some or all of the petitioners may decide not to continue with this litigation. On October 2, 2025, the EPA published a proposed rule and companion direct final rule to extend certain 2024 ELG Rule compliance deadlines. The ultimate impact of the 2024 ELG Rule and associated legal matters cannot be determined at this time; however, it may result in significant compliance costs.\nAlabama Power has indicated plans to retire Plant Barry Unit 5 (700 MWs) by December 31, 2028. Alabama Power continues with plans to comply with the 2020 ELG rule by permanently ceasing coal combustion at Plant Barry Unit 5 by December 31, 2028. However, the need to operate Plant Barry Unit 5 on natural gas beyond that date remains under consideration. The ultimate outcome of this matter cannot be determined at this time.\n135\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nAlabama Power, as agent for SEGCO, initially indicated plans to retire Plant Gaston Units 1 through 4 (1,000 MWs) by December 31, 2028. However, upon further analysis, Alabama Power, in conjunction with Georgia Power, now expects to operate Plant Gaston Units 1 through 4 through December 31, 2034. On September 17, 2025, Alabama Power submitted an Automatic Transfer Notice of Planned Participation (NOPP) authorizing compliance with the 2020 ELG rule generally applicable limits for bottom ash transport water for Plant Gaston Units 1 through 4 by December 31, 2025.\nOn July 15, 2025, the Georgia PSC approved Georgia Power's request in the 2025 IRP to extend the operation of Plant Scherer Unit 3 (614 MWs based on 75% ownership) through at least December 31, 2035 and Plant Gaston Units 1 through 4 (500 MWs based on 50% ownership through SEGCO) through December 31, 2034. In addition, the approved 2025 IRP assumes operation of Plant Bowen Units 1 and 2 (1,400 MWs) through at least December 31, 2035 and does not impact the scrubber wastewater compliance strategy for Plant Bowen as the scrubber wastewater system is a common environmental control for all four generating units. Georgia Power expects to submit a NOPP indicating plans to pursue compliance with the 2020 ELG rule for Plant Scherer Unit 3 through the voluntary incentive program by December 31, 2028.\nCoal Combustion Residuals\nOn March 12, 2025, the EPA announced its intent to undertake several regulatory actions related to the CCR Rule, including reviewing the 2024 Legacy Rule and evaluating whether to grant short- and long-term relief, such as extending compliance deadlines. On August 14, 2025, the U.S. Court of Appeals for the D.C. Circuit granted the EPA's most recent motion regarding litigation over the 2024 Legacy Rule, requesting further abeyance until December 15, 2025.\nOn July 22, 2025, the EPA published a direct final rule and companion proposed rule extending certain deadlines for compliance for owners and operators of CCR management units. On September 4, 2025, the EPA withdrew the direct final rule. The ultimate impact of any final rule and associated legal matters cannot be determined at this time; however, it may result in significant compliance costs.\nBased on compliance requirements for closure and monitoring of CCR units pursuant to state and federal CCR rules, the traditional electric operating companies have periodically updated, and expect to continue periodically updating, their related cost estimates and ARO liabilities for each CCR unit as additional information related to compliance monitoring, closure methodologies and strategies, schedules, and/or costs becomes available. Some of these updates have been, and future updates may be, material. The cost estimates for Alabama Power are based on closure-in-place for all surface impoundments. The cost estimates for Georgia Power and Mississippi Power are based on a combination of closure-in-place for some surface impoundments and closure by removal for others. Additionally, the closure designs and plans in the States of Alabama and Georgia are subject to approval by environmental regulatory agencies. Absent continued recovery of ARO costs through regulated rates, results of operations, cash flows, and financial condition for Southern Company and the traditional electric operating companies could be materially impacted.\nGreenhouse Gases\nOn April 25, 2025, the U.S. Court of Appeals for the D.C. Circuit granted the EPA's most recent motion requesting a continuing abeyance of the litigation over the 2024 GHG Rules. The EPA states in its motion that the agency will issue a proposed reconsideration rule in spring 2025 and a final reconsideration rule by December 2025. On June 17, 2025, the EPA published a proposed rule that, if finalized, would repeal all or a portion of the 2024 GHG Rules. The proposed rule includes a primary proposal and an alternative proposal. Under the primary proposal, the EPA would repeal all emissions standards promulgated under Section 111 of the Clean Air Act based on a finding that fossil fuel-fired power plants do not contribute significantly to dangerous air pollution. Under the alternative proposal, the EPA would repeal all of the emissions guidelines for existing fossil fuel-fired steam generating units as well as the carbon capture and storage requirement for new base load stationary combustion turbines. The ultimate impact of the final rules and associated legal matters cannot be determined at this time; however, it may result in significant compliance costs.\n136\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nIn 2009, the EPA finalized its determination that concentration of certain GHGs in the atmosphere represent a danger to public health and welfare, and such endangerment finding is a prerequisite for regulation of GHG emissions from electric generating units. On March 21, 2025, the EPA announced its intent to ask for public comment on its reconsideration of this endangerment finding. On July 29, 2025, the EPA released a proposed rule to repeal the 2009 endangerment finding with regard to motor vehicles. In the proposal, the EPA acknowledged that other Clean Air Act rulemakings, including those for electric generating units, have partially relied on the 2009 endangerment finding, and the EPA said it would address any overlapping issues in separate rulemakings. The ultimate impact of this proposal cannot be determined at this time.\nRegulatory Matters\nSee Note 2 to the financial statements in Item 8 of the Form 10-K, OVERVIEW – \"Recent Developments\" herein, and Note (B) to the Condensed Financial Statements herein for a discussion of regulatory matters related to Alabama Power, Georgia Power, Mississippi Power, and Southern Company Gas, including items that could impact the applicable Registrants' future earnings, cash flows, and/or financial condition.\nConstruction Programs\nThe Southern Company system strategy continues to include developing and constructing new electric generating and battery energy storage facilities, expanding and improving the electric transmission and electric and natural gas distribution systems, and undertaking projects to comply with environmental laws and regulations.\nThe traditional electric operating companies are engaged in continuous construction programs to accommodate existing and estimated future loads on their respective systems. Major generation construction projects are subject to state PSC approval in order to be included in retail rates, through which the traditional electric operating companies recover their investment and a return. See Note 2 to the financial statements under \"Georgia Power – Integrated Resource Plans\" in Item 8 of the Form 10-K and Note (B) to the Condensed Financial Statements under \"Georgia Power – Integrated Resource Plans\" and \" – Other Construction\" herein for information regarding Georgia Power's future and current construction projects.\nAlabama Power executed an agreement to build a battery energy storage facility at the former Plant Gorgas site in Walker County, Alabama. The new Gorgas battery facility is designed to have the capacity to store up to 150 MWs of electricity generated by other Alabama Power resources. Construction is expected to begin in the fourth quarter 2025, with estimated completion by 2027.\nSouthern Power's construction program includes the Millers Branch solar project and the Kay Wind, Grant Plains, Grant Wind, and Wake Wind repowering projects. The repowering projects result in accelerated depreciation related to the equipment being replaced that will continue until the commercial operation dates of the projects, which are projected to occur between the third quarter 2026 and the second quarter 2027. At September 30, 2025, the remaining pre-tax accelerated depreciation, net of noncontrolling interest impacts, is projected to total approximately $100 million in 2025, $320 million in 2026, and $25 million in 2027. The ultimate outcome of this matter cannot be determined at this time. See Note (K) to the Condensed Financial Statements under \"Southern Power\" herein for information relating to Southern Power's construction of renewable energy facilities.\nSouthern Company Gas is engaged in various infrastructure improvement programs designed to update or expand the natural gas distribution systems of the natural gas distribution utilities to improve reliability and resiliency, reduce emissions, and meet operational flexibility and growth. The natural gas distribution utilities recover their investment and a return associated with these infrastructure programs through their regulated rates, as approved by their applicable state regulatory agency. See Note 2 to the financial statements in Item 8 of the Form 10-K for additional information on Southern Company Gas' construction program.\nSee FINANCIAL CONDITION AND LIQUIDITY – \"Cash Requirements\" herein for additional information regarding the Registrants' capital requirements for their construction programs.\n137\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nIncome Tax Matters\nSee Note (G) to the Condensed Financial Statements herein and MANAGEMENT'S DISCUSSION AND ANALYSIS – FUTURE EARNINGS POTENTIAL – \"Income Tax Matters\" in Item 7 of the \nForm 10-K for additional information.\nFederal Tax Legislation\nThe OBBB was signed into law on July 4, 2025. It extends many of the Tax Cuts and Jobs Act's provisions that were set to expire and makes some of them permanent. The OBBB includes major changes to tax incentives for renewable energy projects. The legislation restricts the ITCs and PTCs for solar and wind power projects, which were originally set to run through 2032. Such projects must now either begin construction by July 2026 or be fully operational by the end of 2027 in order to claim the applicable tax credits. Nuclear, hydropower, and geothermal energy projects maintain tax credits under the new law. Battery energy storage projects retain their full tax credit through 2033, with a gradual phase-out by 2036. The OBBB adds new restrictions for tax credits for renewable facilities that are owned or influenced by a prohibited foreign entity or receive material assistance from a prohibited foreign entity. Pursuant to an executive order, the U.S. Treasury issued a notice on August 15, 2025, making changes to the start-of-construction guidance for wind and solar projects that begin construction after September 1, 2025. The Southern Company system is implementing the guidance in its plans for future renewable projects. Additionally, the IRS is expected to issue significant guidance on the tax provisions in the OBBB. The Southern Company system is still assessing and will continue to monitor the impacts of the OBBB. The ultimate outcome of this legislation cannot be determined at this time.\nCorporate Alternative Minimum Tax\nOn June 2, 2025 and September 30, 2025, the U.S. Treasury and the IRS issued guidance on the application of the CAMT. Southern Company has filed its consolidated 2024 federal income tax return and determined it was not subject to CAMT. Southern Company is still assessing the issued guidance and is not expecting to be subject to CAMT for the 2025 tax year. The ultimate outcome of this legislation cannot be determined at this time.\nNatural Gas Safe Harbor Method\nIn April 2023, the IRS issued Revenue Procedure 2023-15, which provides a safe harbor tax method of accounting that taxpayers may use to determine whether certain expenditures to maintain, repair, replace, or improve natural gas transmission and distribution property must be capitalized or allowed as repair deductions. The revenue procedure allows multiple alternatives for implementation. In April 2024, the IRS issued Revenue Procedure 2024-23, which gives additional implementation guidance on the natural gas safe harbor tax method of accounting for qualifying repair deductions. Southern Company and Southern Company Gas submitted a tax accounting method change for qualifying expenditures with the filing of its consolidated 2024 federal income tax return. The new tax method of accounting resulted in a material net positive cash flow for Southern Company Gas. This method change did not have an impact on the net income of Southern Company or Southern Company Gas.\nZero-Emission Nuclear Power Production Tax Credit\nAlabama Power and Georgia Power have nuclear generating facilities that qualify for Internal Revenue Code §45U PTCs for the 2024 tax year. The base credit amounts are $75 million, $36 million, and $39 million for Southern Company, Alabama Power, and Georgia Power, respectively, which have been recorded as a regulatory liability. Additionally, each company claimed the prevailing wage multiplier on its consolidated 2024 federal income tax return, for a total credit claimed of $373 million, $180 million, and $193 million for Southern Company, Alabama Power, and Georgia Power, respectively. Southern Company has not received a full acceptance letter from the IRS. The §45U PTC is available for tax years 2024 to 2032 and is subject to a phase-out. As such, Southern Company, Alabama Power, and Georgia Power will each evaluate annually whether it qualifies for the credit. The ultimate outcome of this matter cannot be determined at this time. See Note (B) to the Condensed Financial Statements under \"Alabama Power – Nuclear Production Tax Credits Order\" and \"Georgia Power\n – \n2022 ARP\" and Note (G) to the Condensed Financial Statements under \"Unrecognized Tax Benefits\" herein for additional information.\n138\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nGeorgia State Tax Legislation\nOn April 15, 2025, the State of Georgia enacted tax legislation that reduced the corporate income tax rate from 5.39% to 5.19% effective for the 2025 tax year. This legislation reduced the amount of Southern Company's and certain subsidiaries' income tax expense in the State of Georgia and existing state net accumulated deferred tax liabilities, increased regulatory liabilities at Georgia Power and Southern Company Gas, and reduces Georgia Power's ability to utilize certain state tax credits in the State of Georgia. The legislation did not have a material impact on the net income of the applicable Registrants in 2025.\nGeneral Litigation and Other Matters\nThe Registrants are involved in various matters being litigated and/or regulatory and other matters that could affect future earnings, cash flows, and/or financial condition. The ultimate outcome of such pending or potential litigation against each Registrant and any subsidiaries or regulatory and other matters cannot be determined at this time; however, for current proceedings and/or matters not specifically reported herein or in Notes (B) and (C) to the Condensed Financial Statements herein, management does not anticipate that the ultimate liabilities, if any, arising from such current proceedings and/or matters would have a material effect on such Registrant's financial statements. See Notes (B) and (C) to the Condensed Financial Statements for a discussion of various contingencies, including matters being litigated, regulatory matters, and other matters which may affect future earnings potential.\nACCOUNTING POLICIES\nSee MANAGEMENT'S DISCUSSION AND ANALYSIS – ACCOUNTING POLICIES in Item 7 of the Form 10-K for a complete discussion of the Registrants' critical accounting policies and estimates, as well as recently issued accounting standards.\nApplication of Critical Accounting Policies and Estimates\nThe Registrants prepare their financial statements in accordance with GAAP. Significant accounting policies are described in the notes to the financial statements in Item 8 of the Form 10-K. In the application of these policies, certain estimates are made that may have a material impact on the Registrants' results of operations and related disclosures. Different assumptions and measurements could produce estimates that are significantly different from those recorded in the financial statements.\nRecently Issued Accounting Standards\nIn December 2023, the Financial Accounting Standards Board issued Accounting Standards Update 2023-09, \nIncome Taxes (Topic 740): Improvements to Income Tax Disclosures\n (ASU 2023-09), which requires entities to enhance consistency in income tax disclosures by improving transparency and comparability for stakeholders. Among other changes, ASU 2023-09 requires additional information in the effective tax rate reconciliation, including disaggregation of certain categories, and greater detail about income taxes paid, including disaggregation by jurisdiction. The new standard is effective for annual periods beginning after December 15, 2024. Southern Company will apply the guidance on a retrospective basis. The Registrants are currently evaluating the impact ASU 2023-09 will have on their financial statement disclosures.\nFINANCIAL CONDITION AND LIQUIDITY\nOverview\nSee MANAGEMENT'S DISCUSSION AND ANALYSIS – FINANCIAL CONDITION AND LIQUIDITY \n–\n \"Overview\" in Item 7 of the Form 10-K for additional information. The financial condition of each Registrant remained stable at September 30, 2025. The Registrants intend to continue to monitor their access to short-term and long-term capital markets as well as their bank credit arrangements to meet future capital and liquidity needs. See \"Cash Requirements,\" \"Sources of Capital,\" and \"Financing Activities\" herein for additional information.\n139\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nAt the end of the third quarter 2025, the market price of Southern Company's common stock was $94.77 per share (based on the closing price as reported on the NYSE) and the book value was $31.79 per share, representing a market-to-book ratio of 298%, compared to $82.32, $30.28, and 272%, respectively, at the end of 2024. Southern Company's common stock dividend for the third quarter 2025 was $0.74 per share compared to $0.72 per share in the third quarter 2024.\nCash Requirements\nSee MANAGEMENT'S DISCUSSION AND ANALYSIS – FINANCIAL CONDITION AND LIQUIDITY – \"Cash Requirements\" in Item 7 of the Form 10-K for a description of the Registrants' significant cash requirements.\nThe Registrants' significant cash requirements include estimated capital expenditures associated with their construction programs. The construction programs are subject to periodic review and revision, and actual construction costs may vary from these estimates because of numerous factors. These factors include: changes in business conditions; changes in load projections; changes in environmental laws and regulations; the outcome of any legal challenges to environmental rules; changes in electric generating plants, including unit retirements and replacements and adding or changing fuel sources at existing electric generating units or extending the retirement dates of certain generating plants, to meet regulatory requirements; changes in FERC rules and regulations; state regulatory agency approvals; changes in the expected environmental compliance program; changes in legislation, regulation, and/or tariff policy; the cost, availability, and efficiency of construction labor, equipment, and materials; project scope and design changes; abnormal weather; delays in construction due to judicial or regulatory action; storm impacts; and the cost of capital. In addition, with respect to the traditional electric operating companies and the natural gas distribution utilities, there can be no assurance that any costs related to capital expenditures and AROs will be fully recovered. Additionally, expenditures associated with Southern Power's planned acquisitions may vary due to market opportunities and the execution of its growth strategy.\nIn June and July 2025, Georgia Power requested certification from the Georgia PSC for several Georgia Power-owned projects through various RFPs. Estimated capital expenditures associated with these projects and related transmission investments through 2029 total approximately $14.3 billion, excluding previously committed expenditures and AFUDC. See Note (B) to the Condensed Financial Statements under \"Georgia Power – Integrated Resource Plans\" for additional information.\nDuring the second quarter 2025, Southern Power committed to development projects to repower the Grant Plains, Grant Wind, and Wake Wind facilities. At September 30, 2025, the remaining aggregate construction costs for these projects are expected to be between $685 million and $775 million. See Note (K) to the Condensed Financial Statements under \"Southern Power – Wind Repowering Projects\" herein for additional information.\nLong-term debt maturities and the interest payable on long-term debt each represent a significant cash requirement for the Registrants. See \"Financing Activities\" herein for information on changes in the Registrants' long-term debt balances since December 31, 2024.\nSources of Capital\nSee MANAGEMENT'S DISCUSSION AND ANALYSIS – FINANCIAL CONDITION AND LIQUIDITY – \"Sources of Capital\" in Item 7 of the Form 10-K for additional information. Southern Company intends to meet its future capital needs through operating cash flows, borrowings from financial institutions, and debt, hybrid, and/or equity issuances. Equity capital can be provided from any combination of Southern Company's stock plans, private placements, or public offerings.\nThe Subsidiary Registrants plan to obtain the funds to meet their future capital needs from sources similar to those they used in the past, which were primarily from operating cash flows, external securities issuances, borrowings from financial institutions, and equity contributions from Southern Company. Operating cash flows provide a substantial portion of the Registrants' cash needs.\nThe amount, type, and timing of any financings in 2025, as well as in subsequent years, will be contingent on investment opportunities and the Registrants' capital requirements and will depend upon prevailing market \n140\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nconditions, regulatory approvals (for certain of the Subsidiary Registrants), and other factors. See \"Cash Requirements\" and \"Financing Activities\" herein for additional information.\nBy regulation, Nicor Gas is restricted, up to its retained earnings balance, in the amount it can dividend or loan to affiliates and is not permitted to make money pool loans to affiliates. At September 30, 2025, the amount of subsidiary retained earnings restricted to dividend totaled $1.8 billion. This restriction did not impact Southern Company Gas' ability to meet its cash obligations, nor does management expect such restriction to materially impact Southern Company Gas' ability to meet its currently anticipated cash obligations.\nCertain Registrants' current liabilities frequently exceed their current assets because of long-term debt maturities and the periodic use of short-term debt as a funding source, as well as significant seasonal fluctuations in cash needs. The Registrants generally plan to refinance long-term debt as it matures. The following table shows the amount by which current liabilities exceeded current assets at September 30, 2025 for the applicable Registrants:\nAt September 30, 2025\nSouthern Company\nGeorgia\nPower\nMississippi Power\nSouthern Power\nSouthern Company Gas\n(in millions)\nCurrent liabilities in excess of current assets\n$\n4,099 \n$\n696 \n$\n46 \n$\n447 \n$\n628 \nThe Registrants believe the need for working capital can be adequately met by utilizing operating cash flows, as well as commercial paper, lines of credit, and short-term bank notes, as market conditions permit. In addition, under certain circumstances, the Subsidiary Registrants may utilize equity contributions and/or loans from Southern Company.\nBank Credit Arrangements\nAt September 30, 2025, unused committed credit arrangements with banks were as follows:\nAt September 30, 2025\nSouthern\nCompany\nparent\nAlabama\n   Power\n(a)\nGeorgia\n   Power\n(b)\nMississippi Power\nSouthern\n   Power\n(c)\nSouthern Company\n   Gas\n(d)\nSEGCO\nSouthern\nCompany\n(in millions)\nUnused committed credit\n$\n2,999 \n$\n1,365 \n$\n2,042 \n$\n275 \n$\n600 \n$\n1,598 \n$\n30 \n$\n8,909 \n(a)\nIncludes $15 million at Alabama Property Company, a wholly-owned subsidiary of Alabama Power. Alabama Power is not party to this arrangement.\n(b)\nGeorgia Power had $26 million of letters of credit outstanding under an uncommitted letter of credit facility at September 30, 2025.\n(c)\nAt September 30, 2025, Southern Power also had two continuing letters of credit facilities for standby letters of credit, of which $21 million was unused. In addition, Southern Power Company had $23 million of letters of credit outstanding under an uncommitted letter of credit facility at September 30, 2025. Southern Power's subsidiaries are not parties to its bank credit arrangements or letter of credit facilities.\n(d)\nIncludes $798 million and $800 million at Southern Company Gas Capital and Nicor Gas, respectively.\nSubject to applicable market conditions, the Registrants, Nicor Gas, and SEGCO expect to renew or replace their bank credit arrangements as needed, prior to expiration. In connection therewith, the Registrants, Nicor Gas, and SEGCO may extend the maturity dates and/or increase or decrease the lending commitments thereunder.\nA portion of the unused credit with banks is allocated to provide liquidity support to certain revenue bonds of the traditional electric operating companies and the commercial paper programs of the Registrants, Nicor Gas, and SEGCO. At September 30, 2025, outstanding variable rate demand revenue bonds of the traditional electric operating companies with allocated liquidity support totaled approximately $1.5 billion (comprised of approximately $796 million at Alabama Power, $667 million at Georgia Power, and $58 million at Mississippi Power). In addition, at September 30, 2025, Alabama Power and Georgia Power had approximately $280 million and $384 million, respectively, of fixed rate revenue bonds outstanding that are required to be remarketed within the next 12 months. Alabama Power's $280 million of fixed rate revenue bonds are classified as securities due within \n141\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\none year on its balance sheets as they are not covered by long-term committed credit. All other variable rate demand revenue bonds and fixed rate revenue bonds required to be remarketed within the next 12 months are classified as long-term debt on the balance sheets as a result of available long-term committed credit.\nSee Note 8 to the financial statements in Item 8 of the Form 10-K and Note (F) to the Condensed Financial Statements under \"Bank Credit Arrangements\" herein for additional information.\nShort-term Borrowings\nThe Registrants, Nicor Gas, and SEGCO make short-term borrowings primarily through commercial paper programs that have the liquidity support of the committed bank credit arrangements described above. Southern Power's subsidiaries are not issuers or obligors under its commercial paper program. Commercial paper and short-term bank term loans are included in notes payable in the balance sheets. Details of the Registrants' short-term borrowings were as follows:\n \nShort-term Debt at\nSeptember 30, 2025\nShort-term Debt During the Period\n(*)\n \nAmount\nOutstanding\nWeighted\nAverage\nInterest\nRate\nAverage\nAmount\nOutstanding\nWeighted\nAverage\nInterest\nRate\nMaximum\nAmount\nOutstanding\n \n(in millions)\n(in millions)\n(in millions)\nSouthern Company\n$\n144 \n4.2 \n%\n$\n853 \n4.5 \n%\n$\n1,201 \nAlabama Power\n— \n— \n3 \n4.4 \n75 \nGeorgia Power\n— \n— \n390 \n4.5 \n730 \nMississippi Power\n— \n— \n12 \n4.6 \n55 \nSouthern Power\n— \n— \n120 \n4.5 \n285 \nSouthern Company Gas:\nSouthern Company Gas Capital\n$\n— \n— \n%\n$\n311 \n4.6 \n%\n$\n540 \nNicor Gas\n144 \n4.2 \n15 \n4.3 \n144 \nSouthern Company Gas Total\n$\n144 \n4.2 \n%\n$\n326 \n4.6 \n%\n(*)\nAverage and maximum amounts are based upon daily balances during the three-month period ended September 30, 2025.\nAnalysis of Cash Flows\nNet cash flows provided from (used for) operating, investing, and financing activities for the nine months ended September 30, 2025 and 2024 are presented in the following table:\nNet cash provided from\n(used for):\nSouthern Company\nAlabama Power\nGeorgia\nPower\nMississippi Power\nSouthern Power\nSouthern Company Gas\n(in millions)\nNine Months Ended September 30, 2025\nOperating activities\n$\n7,205\n \n$\n1,800\n \n$\n3,484\n \n$\n299\n \n$\n521\n \n$\n1,378\n \nInvesting activities\n(9,599)\n(2,361)\n(5,189)\n(263)\n(584)\n(1,119)\nFinancing activities\n4,635\n \n519\n \n2,524\n \n(15)\n942\n \n43\n \nNine Months Ended September 30, 2024\nOperating activities\n$\n7,615 \n$\n1,983 \n$\n3,681 \n$\n265 \n$\n607 \n$\n1,407 \nInvesting activities\n(6,678)\n(1,460)\n(3,487)\n(272)\n(199)\n(1,196)\nFinancing activities\n(803)\n(456)\n(205)\n17 \n(357)\n(201)\n142\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nFluctuations in cash flows from financing activities vary from year to year based on capital needs and the maturity or redemption of securities.\nSouthern Company\nNet cash provided from operating activities decreased $410 million for the nine months ended September 30, 2025 as compared to the corresponding period in 2024 primarily due to the timing of vendor payments, decreased retail fuel cost recovery, and the timing of payments for storm restoration costs at Georgia Power, partially offset by the timing of customer receivable collections and materials and supplies purchases. See Note 2 to the financial statements under \"Georgia Power – Storm Damage Recovery\" in Item 8 of the Form 10-K for additional information.\nThe net cash used for investing activities for the nine months ended September 30, 2025 was primarily related to the Subsidiary Registrants' construction programs.\nThe net cash provided from financing activities for the nine months ended September 30, 2025 was primarily related to net issuances of long-term debt, partially offset by common stock dividend payments and a reduction in commercial paper borrowings.\nAlabama Power\nNet cash provided from operating activities decreased $183 million for the nine months ended September 30, 2025 as compared to the corresponding period in 2024 primarily due to a decrease in fuel cost recovery and customer refunds associated with the nuclear fuel disposal cost award. See Note 3 to the financial statements under \"Nuclear Fuel Disposal Cost\" in Item 8 of the Form 10-K for additional information.\nThe net cash used for investing activities for the nine months ended September 30, 2025 was primarily related to gross property additions and the acquisition of the Lindsay Hill Generating Station.\nThe net cash provided from financing activities for the nine months ended September 30, 2025 was primarily related to net issuances of senior notes and capital contributions from Southern Company, partially offset by common stock dividend payments.\nGeorgia Power\nNet cash provided from operating activities decreased $197 million for the nine months ended September 30, 2025 as compared to the corresponding period in 2024 primarily due to the timing of vendor payments and storm restoration costs, partially offset by the timing of customer receivable collections. See Note 2 to the financial statements under \"Georgia Power – Storm Damage Recovery\" in Item 8 of the Form 10-K for additional information relating to storm restoration costs.\nThe net cash used for investing activities for the nine months ended September 30, 2025 was primarily related to gross property additions.\nThe net cash provided from financing activities for the nine months ended September 30, 2025 was primarily related to net issuances of senior notes and capital contributions from Southern Company, partially offset by common stock dividend payments.\nMississippi Power\nN\net cash \nprovided from operating activities increased $34 million\n for the nine months ended September 30, 2025 as compared to the corresponding period in 2024 primarily due to funds received as part of the Plant Daniel acquisition and \nthe timing of fossil fuel stock purchases\n, partially offset by\n decreased fuel cost recovery. See Note (B) to the Condensed Financial Statements \"Mississippi Power – Plant Daniel\" for additional information.\nThe net cash used for investing activities for the nine months ended September 30, 2025 was primarily related to \ngross property additions, partially offset by contributions in aid of construction.\n143\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nThe net cash \nused for financing activities for the nine months ended September 30, 2025 was primarily related to common stock dividend payments and a reduction in commercial paper borrowings, partially offset by issuances of senior notes and capital contributions from Southern Company.\nSouthern Power\nNet cash provided from operating activities decreased $86 million for the nine months ended September 30, 2025 as compared to the corresponding period in 2024 primarily due to a change in the utilization of federal tax credit carryforwards, partially offset by the timing of customer receivable collections.\nThe net cash used for investing activities for the nine months ended September 30, 2025 was primarily related to ongoing construction activities. See Note (K) to the Condensed Financial Statements under \"Southern Power\" herein for additional information.\nThe net cash provided from financing activities for the nine months ended September 30, 2025 was primarily related to issuances of senior notes and capital contributions from Southern Company, partially offset by common stock dividend payments and net distributions to noncontrolling interests.\nSouthern Company Gas\nNet cash provided from operating activities decreased $29 million for the nine months ended September 30, 2025 as compared to the corresponding period in 2024 primarily due to increased income tax payments, the timing of customer receivable collections, and a reduction in natural gas cost recovery, partially offset by the timing of recovery on certain regulatory clauses.\nThe net cash used for investing activities for the nine months ended September 30, 2025 was primarily related to construction of transportation and distribution assets recovered through base rates.\nThe net cash provided from financing activities for the nine months ended September 30, 2025 was primarily related to issuances of senior notes, partially offset by common stock dividend payments, a reduction in commercial paper borrowings, and the maturity of first mortgage bonds.\nSignificant Balance Sheet Changes\nSouthern Company\nSignificant balance sheet changes for the nine months ended September 30, 2025 included:\n•\nan increase of $8.7 billion in long-term debt (including securities due within one year) primarily due to issuances of senior notes and junior subordinated notes, partially offset by repayment of senior notes;\n•\nan increase of $6.2 billion in total property, plant, and equipment primarily related to the Subsidiary Registrants' construction programs;\n•\nan increase of $2.3 billion in cash and cash equivalents, as reflected in the statements of cash flows and discussed further under \"Analysis of Cash Flows – Southern Company\" herein;\n•\nan increase of $1.6 billion in total stockholders' equity primarily related to net income, partially offset by common stock dividend payments;\n•\na decrease of $1.2 billion in notes payable primarily due to a reduction in commercial paper borrowings and repayment of short-term bank debt;\n•\na decrease of $684 million in accounts payable primarily related to the timing of vendor payments;\n•\nan increase of $520 million in accumulated deferred income taxes primarily related to property-related timing differences;\n•\na decrease of $484 million in under recovered fuel clause revenues primarily due to increased fuel cost recovery at Georgia Power; and\n144\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\n•\ndecreases of $480 million and $411 million in AROs and regulatory assets associated with AROs, respectively, primarily related to cost estimate updates at Alabama Power.\nSee \"Financing Activities\" and Note (A) to the Condensed Financial Statements under \"Asset Retirement Obligations\" herein and Note 2 to the financial statements under \"Georgia Power – Fuel Cost Recovery\" in Item 8 of the Form 10-K for additional information.\nAlabama Power\nSignificant balance sheet changes for the nine months ended September 30, 2025 included:\n•\nan increase of $1.2 billion in total property, plant, and equipment primarily related to the construction of transmission and distribution facilities and acquisition of the Lindsay Hill Generating Station;\n•\nan increase of $1.0 billion in common stockholder's equity primarily due to net income and capital contributions from Southern Company, partially offset by dividends paid to Southern Company;\n•\nan increase of $851 million in long-term debt (including securities due within one year) primarily due to net issuances of senior notes;\n•\ndecreases of $348 million and $265 million in AROs and regulatory assets associated with AROs, respectively, primarily related to cost estimate updates;\n•\na decrease of $258 million in other accounts payable primarily due to the timing of vendor payments; and\n•\nan increase of $211 million in accrued taxes primarily due to property tax accruals.\nSee \"Financing Activities – Alabama Power\" and Notes (A) and (K) to the Condensed Financial Statements under \"Asset Retirement Obligations\" and \"Alabama Power,\" respectively, herein for additional information.\nGeorgia Power\nSignificant balance sheet changes for the nine months ended September 30, 2025 included:\n•\nan increase of $3.9 billion in total property, plant, and equipment primarily related to the construction of generation, transmission, and distribution facilities, including costs associated with Plant Yates Units 8, 9, and 10;\n•\nan increase of $2.7 billion in long-term debt (including securities due within one year) primarily due to net issuances of senior notes;\n•\nan increase of $2.5 billion in common stockholder's equity primarily due to net income and capital contributions from Southern Company, partially offset by dividends paid to Southern Company;\n•\nan increase of $840 million in cash and cash equivalents, as reflected in the statements of cash flows and discussed further under \"Analysis of Cash Flows – Georgia Power\" herein;\n•\na decrease of $482 million in under recovered retail fuel clause revenues primarily resulting from increased recovery of deferred fuel expense as ordered in Georgia Power's 2023 fuel cost recovery case;\n•\na decrease of $460 million in accounts payable primarily related to timing of vendor payments; and\n•\nan increase of $397 million in accumulated deferred income taxes primarily related to an increase in property-related timing differences.\nSee \"Financing Activities – Georgia Power\" and Notes (B) and (G) to the Condensed Financial Statements under \"Georgia Power – Other Construction\" and \"Georgia Power,\" respectively, herein and Note 2 to the financial statements under \"Georgia Power – Fuel Cost Recovery\" in Item 8 of the Form 10-K for additional information.\nMississippi Power\nSignificant balance sheet changes for the nine months ended September 30, 2025 included:\n•\nan increase of $118 million in total property, plant, and equipment primarily related to \nthe construction of transmission and distribution facilities;\n145\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\n•\nan increase of $111 million in common stockholder's equity related to net income and capital contributions from Southern Company, partially offset by dividends paid to Southern Company;\n•\nan increase of $88 million in long-term debt (including securities due within one year) primarily due to issuances of senior notes;\n•\na decrease of $46 million in other cost of removal obligations primarily due to an increase in expenditures related to transmission and other production assets; and\n•\nan increase of $45 million in other deferred credits and liabilities primarily due to contributions in aid of construction.\nSee \"Financing Activities – Mississippi Power\" herein for additional information.\nSouthern Power\nSignificant balance sheet changes for the nine months ended September 30, 2025 included:\n•\nan increase of $1.2 billion in long-term debt (including securities due within one year) primarily due to issuances of senior notes;\n•\nan increase of $888 million in cash and cash equivalents, as reflected in the statements of cash flows and discussed further under \"Analysis of Cash Flows – Southern Power\" herein;\n•\nan increase of $143 million in total property, plant, and equipment due to an increase in CWIP primarily related to the continued construction of the Millers Branch solar facility and the wind repowering projects, partially offset by the continued depreciation of assets;\n•\na decrease of $122 million in accumulated deferred income taxes primarily related to a change in the utilization of ITCs; and\n•\na decrease of $105 million in total stockholders' equity primarily due to dividends paid to Southern Company and net distributions to noncontrolling interests, partially offset by capital contributions from Southern Company and net income.\nSee \"Financing Activities – Southern Power\" herein and Note (K) to the Condensed Financial Statements under \"Southern Power\" herein for additional information.\nSouthern Company Gas\nSignificant balance sheet changes for the nine months ended September 30, 2025 included:\n•\nan increase of $821 million in total property, plant, and equipment primarily related to the construction of transportation and distribution assets;\n•\nan increase of $799 million in long-term debt (including securities due within one year) primarily due to issuances of senior notes;\n•\na decrease of $328 million in total accounts receivable primarily related to seasonality;\n•\na decrease of $311 million in notes payable due to a reduction in commercial paper borrowings;\n•\nan increase of $303 million in cash and cash equivalents, as reflected in the statements of cash flows and discussed further under \"Analysis of Cash Flows – Southern Company Gas\" herein; and\n•\nan increase of $196 million in accumulated deferred income taxes primarily due to reversal of CAMT and additional fixed asset tax deductions.\nSee \"Financing Activities – Southern Company Gas\" and FUTURE EARNINGS POTENTIAL – \"Income Tax Matters\" herein for additional information.\n146\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nFinancing Activities\nThe following table outlines long-term debt financing activities for the first nine months of 2025:\nIssuances and Reofferings\nMaturities and Redemptions\nCompany\nSenior\nNotes\nOther Long-\nTerm Debt\nSenior\nNotes\nRevenue\nBonds\nOther Long-\n   Term Debt\n(a)\n(in millions)\nSouthern Company parent\n$\n1,650 \n$\n2,365 \n$\n1,110 \n$\n— \n$\n— \nAlabama Power\n1,100 \n4 \n250 \n— \n1 \nGeorgia Power\n3,100 \n— \n700 \n45 \n91 \nMississippi Power\n100 \n— \n— \n11 \n1 \nSouthern Power\n1,100 \n— \n— \n— \n— \nSouthern Company Gas\n850 \n— \n— \n— \n50 \nOther\n(b)\n— \n— \n— \n— \n12 \nElimination\n(c)\n— \n— \n— \n— \n(13)\nSouthern Company\n$\n7,900 \n$\n2,369 \n$\n2,060 \n$\n56 \n$\n142 \n(a)\nIncludes reductions in finance lease obligations resulting from cash payments under finance leases and, for Georgia Power, principal amortization payments totaling $64 million for FFB borrowings. See Note 8 to the financial statements under \"Long-term Debt – DOE Loan Guarantee Borrowings\" in Item 8 of the Form 10-K for additional information.\n(b)\nIncludes repayment by SEGCO of $10 million of its $100 million principal amount long-term bank loan due November 15, 2025, which is guaranteed by Alabama Power. At September 30, 2025, $70 million of the long-term bank loan remains outstanding. See Note 3 to the financial statements under \"Guarantees\" in Item 8 of the Form 10-K for additional information.\n(c)\nRepresents reductions in affiliate finance lease obligations at Georgia Power, which are eliminated in Southern Company's consolidated financial statements.\nExcept as otherwise described herein, the Registrants used the proceeds of debt issuances for their redemptions and maturities shown in the table above, to repay short-term indebtedness, and for general corporate purposes, including working capital. The Subsidiary Registrants also used the proceeds for their construction programs.\nIn addition to any financings that may be necessary to meet capital requirements and contractual obligations, the Registrants plan to continue, when economically feasible, a program to retire higher-cost securities and replace these obligations with lower-cost capital if market conditions permit.\nSouthern Company\nDuring the first nine months of 2025, Southern Company issued approximately 4.3 million shares of common stock primarily through dividend reinvestment and employee equity compensation and savings plans. Also during the first nine months of 2025, Southern Company entered into forward sale contracts for the issuance of shares of common stock that may be settled through June 2027. See Note (F) to the Condensed Financial Statements under \"Equity Distribution Agreement\" herein for additional information.\nIn January 2025, Southern Company issued $565 million aggregate principal amount of Series 2025A 6.50% Junior Subordinated Notes due March 15, 2085.\nIn February 2025, Southern Company issued $1.8 billion aggregate principal amount of Series 2025B 6.375% Fixed-to-Fixed Reset Rate Junior Subordinated Notes due March 15, 2055.\nIn May 2025, Southern Company issued $1.65 billion aggregate principal amount of Series 2025A 3.25% Convertible Senior Notes due June 15, 2028 in a private offering. Southern Company used a portion of the proceeds from this issuance to repurchase approximately $781.6 million of the $1.725 billion aggregate principal amount outstanding of its Series 2023A 3.875% Convertible Senior Notes due December 15, 2025 and approximately $328.1 million of the $1.5 billion aggregate principal amount outstanding of its Series 2024A 4.50% Convertible \n147\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nSenior Notes due June 15, 2027. See Note (F) to the Condensed Financial Statements under \"Convertible Senior Notes\" herein for additional information.\nSubsequent to September 30, 2025, Southern Company repaid at maturity $500 million aggregate principal amount of its Series 2022A 5.15% Senior Notes.\nAlabama Power\nIn March 2025, Alabama Power issued $500 million aggregate principal amount of Series 2025A 5.10% Senior Notes due April 2, 2035.\nIn April 2025, Alabama Power repaid at maturity $250 million aggregate principal amount of its Series 2015B 2.80% Senior Notes.\nIn June 2025, Alabama Power issued $100 million aggregate principal amount of Series 2025B Floating Rate Senior Notes due August 15, 2075.\nIn September 2025, Alabama Power issued $500 million aggregate principal amount of Series 2025C 4.30% Senior Notes due March 15, 2031.\nGeorgia Power\nIn March 2025, Georgia Power issued $400 million aggregate principal amount of Series 2025A Floating Rate Senior Notes due September 15, 2026, $500 million aggregate principal amount of Series 2025B 4.85% Senior Notes due March 15, 2031, and $700 million aggregate principal amount of Series 2025C 5.20% Senior Notes due March 15, 2035.\nIn May 2025, Georgia Power repaid at maturity $700 million aggregate principal amount of its Series 2023C Floating Rate Senior Notes.\nAlso in May 2025, Georgia Power entered into a $200 million short-term floating rate bank loan bearing interest based on term SOFR.\nIn June 2025, Georgia Power extended both of its short-term floating rate bank loans totaling $400 million to long-term term loans, which mature in June 2026.\nIn July 2025, Georgia Power repaid at maturity its obligations with respect to $45 million aggregate principal amount of Development Authority of Monroe County (Georgia) Pollution Control Revenue Bonds (Georgia Power Company Plant Scherer Project), First Series 1995.\nIn September 2025, Georgia Power issued $250 million aggregate principal amount of additional Series 2025B 4.85% Senior Notes due March 15, 2031, $750 million aggregate principal amount of Series 2025D 4.00% Senior Notes due October 1, 2028, and $500 million aggregate principal amount of Series 2025E 5.50% Senior Notes due October 1, 2055.\nMississippi Power\nIn March 2025, Mississippi Power issued $50 million aggregate principal amount of Series 2025A 5.01% Senior Notes due March 15, 2030 and $50 million aggregate principal amount of Series 2025B 6.03% Senior Notes due March 15, 2055.\nIn July 2025, Mississippi Power repaid at maturity its obligations with respect to approximately $11 million aggregate principal amount of Mississippi Business Finance Corporation Solid Waste Disposal Facilities Revenue Bonds, Series 1995 (Mississippi Power Company Project).\n148\n    \nTable of Contents\n                                \nIndex to Financial Statements\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION\nAND RESULTS OF OPERATIONS (Continued)\nSouthern Power\nIn September 2025, Southern Power issued $550 million aggregate principal amount of Series 2025A 4.25% Senior Notes due October 1, 2030 and $550 million aggregate principal amount of Series 2025B 4.90% Senior Notes due October 1, 2035.\nSubsequent to September 30, 2025, Southern Power redeemed all $500 million aggregate principal amount of its Series 2015C 4.15% Senior Notes due December 1, 2025.\nSouthern Company Gas\nIn September 2025, Nicor Gas repaid at maturity $50 million aggregate principal amount of its 1.42% Series First Mortgage Bonds.\nIn September 2025, Southern Company Gas Capital issued $425 million aggregate principal amount of Series 2025A 4.05% Senior Notes due September 15, 2028 and $425 million aggregate principal amount of Series 2025B 5.10% Senior Notes due September 15, 2035, both guaranteed by Southern Company Gas.\nSubsequent to September 30, 2025, Nicor Gas issued in a private placement $25 million aggregate principal amount of 4.17% Series First Mortgage Bonds due October 1, 2028 and $75 million aggregate principal amount of 4.92% Series First Mortgage Bonds due October 1, 2035. Pursuant to the same agreement, Nicor Gas agreed to issue in a private placement in December 2025 $50 million aggregate principal amount of 5.59% Series First Mortgage Bonds due December 15, 2055 and $50 million aggregate principal amount of 5.69% Series First Mortgage Bonds due December 15, 2065.\nCredit Rating Risk\nAt September 30, 2025, the Registrants did not have any credit arrangements that would require material changes in payment schedules or terminations as a result of a credit rating downgrade.\nThere are certain contracts that could require collateral, but not accelerated payment, in the event of a credit rating change of certain Registrants to BBB and/or Baa2 or below. These contracts are primarily for physical electricity and natural gas purchases and sales, fuel purchases, fuel transportation and storage, energy price risk management, transmission, interest rate management, and equipment purchases related to construction of facilities.\nThe maximum potential collateral requirements under these contracts at September 30, 2025 were as follows:\nCredit Ratings\nSouthern\n   Company\n(*)\nAlabama Power\nGeorgia Power\nMississippi Power\nSouthern\n   Power\n(*)\nSouthern Company Gas\n(in millions)\nAt BBB and/or Baa2\n$\n32 \n$\n1 \n$\n— \n$\n— \n$\n30 \n$\n— \nAt BBB- and/or Baa3\n440 \n2 \n36 \n— \n402 \n— \nAt BB+ and/or Ba1 or below\n3,842 \n419 \n2,602 \n271 \n1,317 \n14 \n(*)\nSouthern Power has PPAs that could require collateral, but not accelerated payment, in the event of a downgrade of Southern Power's credit. The PPAs require credit assurances without stating a specific credit rating. The amount of collateral required would depend upon actual losses resulting from a credit downgrade. Southern Power had $106 million of cash collateral posted related to PPA requirements at September 30, 2025.\nThe amounts in the previous table for the traditional electric operating companies and Southern Power include certain agreements that could require collateral if either Alabama Power or Georgia Power has a credit rating change to below investment grade. Generally, collateral may be provided by a Southern Company guaranty, letter of credit, or cash. Additionally, a credit rating downgrade could impact the ability of the Registrants to access capital markets and would be likely to impact the cost at which they do so.\nOn August 22, 2025, Fitch revised the ratings outlook of Georgia Power to stable from positive.\nOn September 23, 2025, Moody's revised the ratings outlook of Southern Company to negative from stable and the ratings outlook of Georgia Power to stable from positive.\n149\n    \nTable of Contents\n                                \nIndex to Financial Statements"
}