{
  "source_file": "sols-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nBusiness overview\nSolstice Advanced Materials Inc. (“Solstice,” “Solstice Advanced Materials,” “we,” “us,” “our,” or the “Company”) is a global, differentiated advanced materials company and a leading global provider of refrigerants, semiconductor materials, protective fibers and healthcare packaging. We operate through two segments, reported as Refrigerants & Applied Solutions (“RAS”) and Electronic & Specialty Materials (“ESM”). Our business is recognized as an industry innovator as well as a technology and quality leader, supported by some of the industry’s most well-known brands.\nOur RAS segment is a leading manufacturer of low global warming potential (“LGWP”) refrigerants, blowing agents, solvents and aerosol materials. RAS serves the end markets of cooling, air conditioning and refrigeration (“HVAC/R”), automotive, energy, building and appliance insulation, and healthcare. RAS products include, among others, LGWP refrigerants, blowing agents, aerosol propellants, cleaning solvents, high-barrier pharmaceutical packaging materials and alternative energy services. Our products are distributed and sold through well-known brands like Solstice, Genetron, and Aclar. Our ESM segment is a leading provider of electronic materials, high-strength fibers and laboratory life science chemicals. ESM primarily serves the semiconductor, defense, pharmaceutical and construction end markets. ESM products include, among others, sputtering targets, lightweight high-strength fibers and high-purity life science solutions. Our products are distributed and sold through well-known brands like Spectra, Fluka, and Hydranal.\nDuring 2025, we have served over 3,000 customers across a wide range of end markets in approximately 120 countries and territories. Our global presence included 21 manufacturing sites, four R&D sites and approximately 4,000 employees as of September 30, 2025.\nSpin-off from Honeywell\nOn October 8, 2024, Honeywell International Inc. (“Honeywell”) announced its plan to spin-off its Advanced Materials business into an independent, U.S. publicly traded company through a pro rata distribution of all of the outstanding common shares of Solstice Advanced Materials to Honeywell shareholders (the “Spin-off”) that is tax-free for U.S. federal tax purposes.  On October 30, 2025, the Spin-off was consummated by means of a tax-free pro rata distribution (the “Distribution”) of all of the issued and outstanding Solstice Advanced Materials common shares to Honeywell’s shareholders of record as of the close of business on October 17, 2025 (the “Record Date”), at which time each holder of Honeywell's common shares received one Solstice Advanced Materials common share for every four Honeywell common shares held as of the close of business on the Record Date, resulting in the Distribution of 158,727,456 of the Company’s common shares to Honeywell shareholders. Upon completion of the Distribution, on October 30, 2025, the Company commenced “regular way” trading as an independent public company under the ticker symbol “SOLS” on The Nasdaq Stock Market (“Nasdaq”). Following the Distribution, Honeywell does not own any Solstice Advanced Materials common shares and will no longer consolidate Solstice Advanced Materials with Honeywell's financial results. See Note 8. - “Long-Term Debt” and Note 14. - “Subsequent Events” of the Notes to the unaudited Condensed Combined Financial Statements for additional information on the Spin-off and related transactions.\nRelationship with Honeywell\nThe Condensed Combined Financial Statements included herein are derived from Honeywell’s historical accounting records and presented on a standalone basis as if the Company’s operations had been conducted independently from Honeywell. The Condensed Combined Financial Statements are prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”) and Honeywell’s historical accounting policies, by aggregating financial information from the components of Solstice’s and Honeywell’s accounting records directly attributable to Solstice Advanced Materials.\n25\nThe Condensed Combined Financial Statements include all revenues and costs directly attributable to the Solstice business and an allocation of expenses related to certain Honeywell corporate functions. These expenses were allocated to the Solstice business based on a proportion of net sales. Solstice and Honeywell consider these allocations to be a reasonable reflection of the utilization of services or the benefits received. However, the allocations may not be indicative of the actual expense that would have been incurred had Solstice operated as an independent, standalone entity, nor are they indicative of future expenses of Solstice.\nManagement believes that the expense and cost allocations have been determined on a basis that is a reasonable reflection of the utilization of services provided or the benefit received by the Company. The amounts that would have been, or will be incurred, on a stand-alone basis could materially differ from the amounts allocated due to economies of scale, difference in management judgment, a requirement for more or fewer employees, or other factors. Management does not believe, however, that it is practicable to estimate what these expenses would have been had the Company operated as an independent entity, including any expenses associated with obtaining any of these services from unaffiliated entities. In addition, the future results of operations, financial position, and cash flows could differ materially from the historical results presented herein.\nIn connection with the Spin-off, we also entered into certain agreements with Honeywell, including a Separation and Distribution Agreement, a Transition Services Agreement, a Tax Matters Agreement, an Employee Matters Agreement, an Intellectual Property Cross-License Agreement, a Trademark License Agreement and an Accelerator License Agreement, as described in Note 14. - “Subsequent Events” of the Notes to the unaudited Condensed Combined Financial Statements. Under the Transition Services Agreement, we generally expect to be able to utilize Honeywell’s services for a transitional period following the Spin-off before we replace these services over time with services supplied either internally or by third parties. The expenses for the services may vary from the historical costs directly billed and allocated to us for the same services.\nWe have incurred, and expect to continue to incur certain costs in connection with our establishment as a standalone public company (the “Transaction-related costs”). The Transaction-related costs include one-time and non-recurring expenses associated with the separation and stand-up of functions required to operate as a standalone public entity. These non-recurring costs primarily relate to legal, accounting, consulting and other professional service fees, system implementation costs, business and facilities separation, development of our brand and other matters. The Transaction-related costs are expected to continue through at least fiscal year 2026. Additionally, we have incurred, and expect to continue to incur increased costs as a result of becoming an independent, publicly traded company, primarily from establishing or expanding the corporate support for our businesses, including information technology (“IT”), human resources, treasury, tax, internal audit, risk management, stock-based compensation programs, accounting and financial reporting, investor relations, governance, legal, procurement and other services. See “Unaudited Pro Forma Combined Financial Information” in our final Information Statement, dated as of October 17, 2025 (the “Information Statement”) for additional details.\nMacroeconomic Conditions\nWe continue to monitor macroeconomic and geopolitical developments amid heightened trade tensions, economic and trade policy uncertainty, and inflationary risks. The trade policy volatility during 2025—including new tariffs and, in some cases, subsequent rollbacks or suspensions—could adversely impact global growth and contribute to inflationary pressures. Global conflicts, tariffs, labor disruptions, and regulations continue to generate volatility in global markets and can contribute to supply chain vulnerabilities and pricing fluctuations. We remain proactive in our collaboration with suppliers to minimize shortages and mitigate supply chain and pricing volatility.\nMitigation strategies remain crucial to meet customer demand in this evolving environment. Our mitigation strategies include supply chain simplification, continued alignment to local supply sources, pricing actions and dual source strategies, long-term strategies for constrained materials, direct engagement with key suppliers, and new supplier development. Strong relationships with strategic primary and secondary suppliers allow us to collaborate to reliably source key components and raw materials, develop new products, commit our resources to assist certain suppliers, and at times, alter designs of existing products. We believe these mitigation strategies enable us to reduce supply risk, foster new product innovation, and expand our market presence. Additionally, due to the stringent \n26\nquality controls and product qualification we perform on any new or altered product, these mitigation strategies have not impacted, and we do not expect them to impact, product quality or reliability.\nTo date, our strategies have helped minimize our exposure to these conditions. However, if we are not successful in sustaining or executing mitigation strategies, these macroeconomic conditions could have a material adverse effect on our results of operations, cash flows or financial condition.\n27\nRESULTS OF OPERATIONS\nIncome Statement\nFor The Three Months Ended September 30,\nPercentage of Net Sales For The Three Months Ended September 30,\nPercentage Change\n(dollars in millions)\n2025\n2024\n2025\n2024\n2025 vs. 2024\nNet sales\n$\n969\n \n$\n907\n \n100\n \n%\n100\n \n%\n7\n \n%\nCost, expenses and other\nTotal cost of products and services sold\n659 \n575 \n68 \n%\n63 \n%\n15 \n%\nGross profit\n310\n \n332\n \n32\n \n%\n37\n \n%\n(7)\n%\nResearch and development expenses\n26 \n21 \n3 \n%\n2 \n%\n24 \n%\nSelling, general and administrative expenses\n113 \n107 \n12 \n%\n12 \n%\n6 \n%\nTransaction-related costs\n32 \n3 \n3 \n%\n— \n%\nNM\nOther expense (income)\n(36)\n1 \n(4)\n%\n— \n%\nNM\nInterest and other financial charges\n2 \n3 \n— \n%\n— \n%\n(33)\n%\nTotal costs, expenses and other\n796\n \n710\n \n82\n \n%\n78\n \n%\n12\n \n%\nIncome before taxes\n173\n \n197\n \n18\n \n%\n22\n \n%\n(12)\n%\nIncome tax expense\n182 \n49 \n19 \n%\n5 \n%\n271 \n%\nEffective tax rate\n105 \n%\n25 \n%\n— \n%\n— \n%\n323 \n%\nNet (loss) income\n(9)\n148\n \n(1)\n%\n16\n \n%\n(106)\n%\nLess: Net income (loss) attributable to noncontrolling interest\n26 \n(4)\n3 \n%\n— \n%\n(750)\n%\nNet (loss) income attributable to Solstice Advanced Materials\n$\n(35)\n$\n152\n \n(4)\n%\n17\n \n%\n(123)\n%\n______________\nNM - not meaningful \nNet Sales\nFor the Three Months Ended September 30,\nChange in net sales from prior period\n2025 vs 2024\nVolume\n2 \n%\nPrice\n3 \n%\nForeign currency translation\n2 \n%\nTotal % change in net sales\n7\n \n%\nFor the three months ended September 30, 2025 compared with the three months ended September 30, 2024\nNet sales increased due to higher sales volume, favorable pricing and favorable currency movements. The higher sales volume was driven by growth in refrigerants, partially offset by volume declines in healthcare packaging. The price increase was driven by favorable refrigerants pricing. A discussion of Net sales by reportable segment can be found under the “Segment Results” section.\n28\nCost of product and services sold increased by $84 million or 15% driven by volume increases and the overall product mix in both segments; Research and development expenses increased by $5 million or 24% driven by continued investment in innovation across the portfolio of offerings such as the next-gen molecules and Spectra Y; Selling, general and administrative expenses increased by $6 million or 6% driven by an increase in employee related expenses in preparation for the Spin-off, partially offset by the impact of a government reimbursement of certain legal expenses; Transaction-related costs increased by $29 million driven by professional advisory services fees incurred in 2025 in preparation for the Spin-off;  Other expense (income) changed by $37 million driven primarily by the impact of a government reimbursement of certain past legal expenses; Interest and other financial charges decreased by $1 million or 33% driven by certain finance leases being paid off.\nIncome tax expenses - The effective tax rate in 2025 was higher than the effective tax rate in 2024 as a result of incremental frictional tax costs associated with the separation from Honeywell, which increased our effective tax rate by approximately 80% for the three months ended September 30, 2025. See Note 5, “Income Taxes” of the Notes to the unaudited Condensed Combined Financial Statements for additional information on the effective tax rate.\nFor The Nine Months Ended September 30,\nPercentage of Net Sales For The Nine Months Ended September 30,\nPercentage Change\n(dollars in millions)\n2025\n2024\n2025\n2024\n2025 vs. 2024\nNet sales\n$\n2,899\n \n$\n2,857\n \n100\n \n%\n100\n \n%\n1\n \n%\nCost, expenses and other\nTotal cost of products and services sold\n1,907 \n1,856 \n66 \n%\n65 \n%\n3 \n%\nGross profit\n992\n \n1,001\n \n34\n \n%\n35\n \n%\n(1)\n%\nResearch and development expenses\n70 \n62 \n2 \n%\n2 \n%\n13 \n%\nSelling, general and administrative expenses\n309 \n303 \n11 \n%\n11 \n%\n2 \n%\nTransaction-related costs\n90 \n6 \n3 \n%\n— \n%\nNM\nOther expense (income)\n(43)\n(2)\n(1)\n%\n— \n%\nNM\nInterest and other financial charges\n5 \n11 \n— \n%\n— \n%\n(55)\n%\nTotal costs, expenses and other\n2,338\n \n2,236\n \n81\n \n%\n78\n \n%\n5\n \n%\nIncome before taxes\n561\n \n621\n \n19\n \n%\n22\n \n%\n(10)\n%\nIncome tax expense\n330 \n150 \n11 \n%\n5 \n%\n120 \n%\nEffective tax rate\n59 \n%\n24 \n%\n— \n%\n— \n%\n144 \n%\nNet income\n231\n \n471\n \n8\n \n%\n16\n \n%\n(51)\n%\nLess: Net income attributable to noncontrolling interest\n35 \n10 \n1 \n%\n— \n%\n250 \n%\nNet income attributable to Solstice Advanced Materials\n196\n \n461\n \n7\n \n%\n16\n \n%\n(57)\n%\n______________\nNM - not meaningful\n29\nNet Sales\nFor the Nine Months Ended September 30,\nChange in net sales from prior period\n2025 vs 2024\nVolume\n(1)\n%\nPrice\n2 \n%\nForeign currency translation\n— \n%\nTotal % change in net sales\n1\n \n%\nFor the nine months ended September 30, 2025 compared with the nine months ended September 30, 2024\nNet sales increased due to favorable refrigerants volume and pricing, partially offset by lower sales volumes in alternative energy services attributed to certain large sales transactions which occurred in 2024 that did not recur in 2025, as well as lower volumes in healthcare packaging. A discussion of Net sales by reportable segment can be found under the “Segment Results” section.\nCost of product and services sold increased by $51 million or 3% driven by volume increases and the overall product mix in the RAS segment. These volume increases were offset by the aforementioned volume declines in alternative energy services and healthcare packaging. Research and development expenses increased by $8 million or 13% driven by driven by continued investment in innovation across the portfolio of offering such as the next-gen molecules and Spectra Y; Selling, general and administrative expenses increased by $6 million or 2% driven by an increase in employee related expenses in preparation for the Spin-off. Transaction-related costs increased by $84 million driven by professional advisory services fees incurred in 2025 in preparation for the Spin-off; Other expense (income) changed by $41 million driven primarily by the impact of a government reimbursement of certain past legal expenses; Interest and other financial charges decreased by $6 million or 55% driven by certain finance leases being paid off. \nIncome tax expenses - The effective tax rate in 2025 was higher than the effective tax rate in 2024 as a result of incremental frictional tax costs associated with the separation from Honeywell, which increased our effective tax rate by approximately 35% for the nine months ended September 30, 2025. See Note 5, “Income Taxes” of the Notes to the unaudited Condensed Combined Financial Statements for additional information on the effective tax rate. \nSEGMENT RESULTS\nWe manage and report our operating results through two reportable segments: RAS and ESM. The remainder of our operations are presented in Corporate and All Other, which is not a reportable business segment.\nSegment Adjusted EBITDA is the primary measure of segment profitability used by our Chief Operating Decision Maker. We define Segment Adjusted EBITDA as segment net income excluding income taxes, general corporate unallocated expense, depreciation, amortization, interest and other financial charges, stock compensation expense, pension expense (income), transaction-related costs, repositioning charges, asset retirement obligations accretion, and certain other items that are otherwise of an unusual or non-recurring nature, including but not limited to, impairment charges, litigation, and insurance settlements, and gains and losses on disposal of assets.\n30\nRefrigerants & Applied Solutions\nNet Sales\nThe following table sets forth the net sales, Segment Adjusted EBITDA, and Segment Adjusted EBITDA margin amounts for our RAS segment for the three and nine months ended September 30, 2025 and 2024.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\n2025\n2024\n2025\n2024\nNet sales\n$\n687 \n$\n630 \n$\n2,079 \n$\n2,075 \nSegment Adjusted EBITDA\n243 \n250 \n791 \n806 \nSegment Adjusted EBITDA margin\n35.4 \n%\n39.7 \n%\n38.0 \n%\n38.8 \n%\nFor The Three Months Ended September 30,\nFor The Nine Months Ended September 30,\n2025 vs 2024\n2025 vs 2024\nTotal % change in net sales\n9 \n%\n— \n%\nLess: Foreign currency translation\n1 \n%\n1 \n%\nLess: Acquisitions, divestitures and other, net\n— \n%\n— \n%\nOrganic sales percentage\n(1)\n8\n \n%\n(1)\n%\n______________\n(1) See “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Non-GAAP Financial Measures” for definition of Organic sales percentage.\nFor the three months ended September 30, 2025 compared with the three months ended September 30, 2024\nRAS net sales increased by $57 million or 9% due to favorable pricing and volume growth in refrigerants. These increases were offset by a decline in healthcare packaging due to volume.\nSegment Adjusted EBITDA decreased by $7 million or 3% and Segment Adjusted EBITDA margin decreased 4% primarily driven by stationary refrigerants product mix as a result of the ongoing transition to LGWP refrigerants. This decrease was partially offset by volume growth and favorable pricing.\n31\nFor the nine months ended September 30, 2025 compared with the nine months ended September 30, 2024\nRAS net sales increased by $4 million due to volume growth and favorable pricing in refrigerants, offset by a reduction in our alternative energy services offering attributed to large sales transactions which occurred in 2024 that did not recur in 2025, and volume and price reductions in healthcare packaging. \nSegment Adjusted EBITDA decreased by $15 million or 2% and Segment Adjusted EBITDA margin remained relatively flat.\nElectronic & Specialty Materials\nNet Sales\nThe following table sets forth the net sales, Segment Adjusted EBITDA, and Segment Adjusted EBITDA margin amounts for our ESM segment for the three and nine months ended September 30, 2025 and 2024.\nThree Months Ended September 30,\nNine Months Ended September 30,\n(Dollars in millions)\n2025\n2024\n2025\n2024\nNet sales\n$\n282 \n$\n277 \n$\n820 \n$\n782 \nSegment Adjusted EBITDA\n47 \n55 \n152 \n144 \nSegment Adjusted EBITDA margin\n16.7 \n%\n19.9 \n%\n18.5 \n%\n18.4 \n%\nFor The Three Months Ended September 30,\nFor The Nine Months Ended September 30,\n2025 vs 2024\n2025 vs 2024\nTotal % change in net sales\n2 \n%\n5 \n%\nLess: Foreign currency translation\n2 \n%\n1 \n%\nLess: Acquisitions, divestitures and other, net\n— \n%\n— \n%\nOrganic sales percentage\n(1)\n—\n \n%\n4\n \n%\n_____________\n(1)\n See “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Non-GAAP Financial Measures” for definition of Organic sales percentage.\n32\nFor the three months ended September 30, 2025 compared with the three months ended September 30, 2024\nESM net sales increased by $5 million or 2%. The increase was attributable to volume increases in safety and defense and electronic materials offerings along with favorable pricing in our research and performance chemicals offering. These increases were partially offset by volume declines in our research and performance chemicals offering. \nSegment Adjusted EBITDA decreased by $8 million or 15% and Segment Adjusted EBITDA margin decreased 3% driven by anticipated transitory cost items.\nFor the nine months ended September 30, 2025 compared with the nine months ended September 30, 2024\nESM net sales increased by $38 million or 5%. The increase was attributable to demand driven volume increases in electronic materials and research and performance chemicals offerings, along with favorable pricing in our research and performance chemicals offering.\nSegment Adjusted EBITDA increased by $8 million or 6% and Segment Adjusted EBITDA margin remained relatively flat.\nCorporate and All Other\nCorporate and All Other increased by $21 million or 64% and $19 million or 17% for the three and nine months ended September 30, 2025, respectively, compared to the prior year, due to incremental ongoing costs incurred as part of the transition to operate as a new independent company.\nNON-GAAP FINANCIAL MEASURES\nWe use non-GAAP financial measures to supplement the financial measures prepared in accordance with U.S. GAAP. These include (1) Organic sales percentage, (2) Adjusted EBITDA and (3) Adjusted EBITDA margin.\nBelow are definitions and reconciliations of certain non-GAAP financial measures to the most directly comparable financial measures calculated and presented in accordance with U.S. GAAP. Management believes that, when considered together with reported amounts, these measures are useful to investors and management in understanding our ongoing operations and in the analysis of ongoing operating trends. Management believes these non-GAAP financial measures provide investors with a meaningful measure of its performance period to period, align the measures to how management evaluates performance internally, and make it easier for investors to compare our performance to peers. These measures should be considered in addition to, and not as replacements for, the most directly comparable U.S. GAAP measure. The non-GAAP financial measures we use are as follows:\nOrganic sales percentage\n: The Company defines organic sales percentage as the year-over-year change in reported sales relative to the comparable period, excluding the impact on sales from foreign currency translation and acquisitions, net of divestitures, for the first 12 months following the transaction date. We believe this measure is useful to investors and management in understanding our ongoing operations and in analysis of ongoing operating trends.\nFor The Three Months Ended September 30,\nFor The Nine Months Ended September 30,\n2025 vs 2024\n2025 vs 2024\nTotal % change in net sales\n7 \n%\n1 \n%\nLess: Foreign currency translation\n2 \n%\n— \n%\nLess: Acquisitions, divestitures and other, net\n— \n%\n— \n%\nOrganic sales percentage\n5\n \n%\n1\n \n%\nAdjusted EBITDA and Adjusted EBITDA margin\n: The Company defines Adjusted EBITDA as net income excluding income taxes, depreciation, amortization, interest and other financial charges, other expense, stock \n33\ncompensation expense, pension and other postretirement income (expense), transaction-related costs, repositioning charges, asset retirement obligation accretion, and certain other items that are otherwise of an unusual or non-recurring nature (including but not limited to impairment charges, litigation costs and insurance settlements, net of recoveries, and gains and losses on disposal of assets). The Company defines Adjusted EBITDA margin as Adjusted EBITDA divided by Net sales. We believe these measures are useful to investors as they provide transparency with respect to supplemental information used by management in its financial and operational decision making, as well as understanding ongoing operating trends. The table below reconciles Net income, the most directly comparable U.S. GAAP measure, to the Company’s non-GAAP measure of Adjusted EBITDA for the three and nine months ended September 30, 2025 and 2024.\nThree Months Ended September 30,\n2025\n2024\n(Dollars in millions)\nAmount\nPercentage of Net Sales\nAmount\nPercentage of Net Sales\nNet (loss) income attributable to Solstice Advanced Materials (GAAP)\n$\n(35)\n(4)\n%\n$\n152\n17%\nNet income (loss) attributable to noncontrolling interest\n26 \n3 \n%\n(4)\n—%\nNet (loss) income (GAAP)\n$\n(9)\n(1)\n%\n$\n148\n16%\nDepreciation\n46 \n5 \n%\n42\n5%\nAmortization\n4 \n— \n%\n7\n1%\nInterest and other financial charges\n2 \n— \n%\n3\n—%\nOther adjustments\n(1)\n(29)\n(3)\n%\n16\n2%\nStock compensation expense\n8 \n1 \n%\n4\n1%\nTransaction-related costs\n32 \n3 \n%\n3\n—%\nIncome tax expense\n182 \n19\n \n%\n49\n5%\nAdjusted EBITDA (Non-GAAP)\n$\n236\n \n24\n \n%\n$\n272\n30%\nAdjusted EBITDA margin (Non-GAAP)\n24.4\n \n%\n30.0%\n________________\n1.\nOther adjustments primarily consisted of gains and losses from foreign currency, environmental reserves, asset retirement obligations, pensions expenses, and certain legal costs, net of recoveries.\nNine Months Ended September 30,\n2025\n2024\n(Dollars in millions)\nAmount\nPercentage of Net Sales\nAmount\nPercentage of Net Sales\nNet (loss) income attributable to Solstice Advanced Materials (GAAP)\n$\n196\n \n7\n \n%\n$\n461\n \n17\n \n%\nNet income (loss) attributable to noncontrolling interest\n35 \n1 \n%\n10 \n1 \n%\nNet income (GAAP)\n$\n231\n \n8\n \n%\n$\n471\n17%\nDepreciation\n151 \n5 \n%\n126\n4%\nAmortization\n15 \n1 \n%\n35\n1%\nInterest and other financial charges\n5 \n— \n%\n11\n—%\nOther adjustments\n(1)\n(30)\n(1)\n%\n25\n1%\nStock compensation expense\n19 \n1 \n%\n13\n1%\nTransaction-related costs\n90 \n3 \n%\n6\n—%\nIncome tax expense\n330 \n11 \n%\n150\n5%\nAdjusted EBITDA (Non-GAAP)\n$\n811\n \n28\n \n%\n$\n837\n29%\nAdjusted EBITDA margin (Non-GAAP)\n28.0\n \n%\n29.3%\n_________________\n1.\nOther adjustments primarily consisted of gains and losses from foreign currency, environmental reserves, asset retirement obligations, pensions expenses, and certain legal costs, net of recoveries.\n34\nLIQUIDITY AND CAPITAL RESOURCES\nOverview\nHistorically, the Company has generated positive cash flows from operations. Prior to the consummation of the Spin-off, as part of Honeywell the majority of the Company’s cash was transferred to Honeywell daily and the Company was dependent upon Honeywell for all of its working capital and financing requirements. Those arrangements have been settled in cash in conjunction with the Spin-off. \nFollowing our separation from Honeywell on October 30, 2025, we no longer participate in Honeywell’s centralized cash management program. Our future liquidity will depend on operating cash flows, available cash balances, access to credit facilities and our ability to access capital markets. We believe that our existing cash and cash equivalents, combined with our operating cash flows and available credit facilities (as discussed below) will be sufficient to meet our anticipated cash needs for at least the next 12 months.\nSenior Notes\nOn September 30, 2025, the Company issued $1.0 billion of 5.625% Senior Notes (the “Notes”) due September 30, 2033.\n \nThe Notes were sold in private placements to qualified institutional buyers in accordance with Rule 144A under the Securities Act of 1933, as amended (the “Securities Act”), and outside the United States to non-U.S. persons in reliance on Regulation S under the Securities Act. The proceeds of the Notes were held in escrow pending completion of the Spin-off, and such proceeds were released from escrow on October 29, 2025 in connection with the Spin-off.\nThe Notes are senior unsecured obligations of Solstice, guaranteed on a senior unsecured basis by certain of its domestic subsidiaries and, from and after the escrow release date, will be guaranteed on a senior unsecured basis by each of Solstice’s existing and future domestic subsidiaries that guarantee the Company’s Senior Credit Facilities (described below). The Notes are subject to customary affirmative and negative covenants that limit the Company’s ability and the ability of its restricted subsidiaries to incur or guarantee additional indebtedness; pay dividends or distributions on, or redeem or repurchase, capital stock and make other restricted payments; make investments; consummate certain asset sales; engage in certain transactions with affiliates; grant or assume certain liens; and consolidate, merge or transfer all or substantially all of the Company’s assets.\nSenior Credit Facilities\nOn October 29, 2025, the Company entered into a credit agreement (the “Credit Agreement”), which provides for (i) a seven-year senior secured first-lien term B loan facility in an aggregate principal amount of $1.0 billion (the “Term Loan Facility”) and (ii) a five-year senior secured first-lien revolving credit facility with aggregate commitments of $1.0 billion (the “Revolving Credit Facility” and, together with the Term Loan Facility, the “Credit Facilities”).\nThe Company also entered into uncommitted bilateral letter of credit agreements, which provide for uncommitted bilateral letter of credit facilities in an aggregate uncommitted amount of $750 million (the “Sidecar LC Facilities”, and together with the Credit Facilities, the “Senior Credit Facilities”).\nAll obligations under the Senior Credit Facilities are unconditionally guaranteed, jointly and severally, by: (a) the Company and (b) all direct and indirect wholly owned subsidiaries of the Company that are organized under the laws of the United States, any state thereof or the District of Columbia, subject to certain exceptions and limitations (collectively, the “Guarantors”). Subject to certain limitations, the Senior Credit Facilities are secured on a first priority basis by: (x) a perfected security interest in the equity interests of each direct subsidiary of the Company and each Guarantor under the Senior Credit Facilities (subject to certain customary exceptions) and (y) perfected security interests in, and mortgages on, substantially all tangible and intangible personal property and material real property of the Company and each of the Guarantors under the Senior Credit Facilities, subject, in each case, to certain exceptions. \nThe Credit Facilities are subject to an interest rate, at the Company’s option, of either (a) base rate determined by reference to the highest of (1) the rate of interest last quoted by The Wall Street Journal as the “prime rate” in the \n35\nUnited States, (2) the greater of the federal funds effective rate and the overnight bank funding rate, plus 0.5% and (3) the one month adjusted SOFR rate, plus 1.00% per annum (“ABR”) or (b) an adjusted SOFR rate (“SOFR”) (which shall not be less than zero). \nThe applicable margin for the Term Loan Facility is 1.75% per annum (for SOFR loans) and 0.75% per annum (for ABR loans). The applicable margin for the Revolving Credit Facility varies from 1.50% per annum to 2.00% per annum (for SOFR loans) and 0.50% to 1.00% per annum (for ABR loans) based on the Company’s Consolidated First Lien Leverage Ratio (as defined in the Credit Agreement). Accordingly, the interest rates for the Credit Facilities will fluctuate during the term of the Credit Agreement based on changes in the ABR, SOFR or future changes in the Company’s Consolidated First Lien Leverage Ratio. Interest payments with respect to the Credit Facilities are required either on a quarterly basis (for ABR loans) or at the end of each interest period (for SOFR loans) or, if the duration of the applicable interest period exceeds three months, then every three months.\nIn addition to paying interest on outstanding borrowings under the Revolving Credit Facility, the Company is required to pay a quarterly commitment fee based on the unused portion of the Revolving Credit Facility, which is determined by the Company’s Consolidated First Lien Leverage Ratio and ranges from 0.25% to 0.35% per annum.\nThe Company may voluntarily prepay borrowings under the Credit Agreement without premium or penalty, subject to a 1.00% prepayment premium in connection with certain repricing transactions with respect to the Term Loan Facility in the first six months after the effective date of the Credit Agreement and customary “breakage” costs with respect to SOFR loans. The Company may also reduce the commitments under the Revolving Credit Facility, in whole or in part, in each case, subject to certain minimum amounts and increments.\nThe Credit Agreement contains certain affirmative and negative covenants customary for financings of this type that, among other things, limit the Company and its subsidiaries’ ability to incur additional indebtedness or liens, to dispose of assets, to make certain fundamental changes, enter into restrictive agreements, to make certain investments, loans, advances, guarantees and acquisitions, to prepay certain indebtedness and to pay dividends, to make other distributions or redemptions/repurchases, in respect of the Company and its subsidiaries’ equity interests, to engage in transactions with affiliates or amend certain material documents. In addition, the Credit Agreement also contains financial covenants for the benefit of the lenders under the Revolving Credit Facility requiring the maintenance of a Consolidated First Lien Leverage Ratio of not greater than 3.50 to 1.00 (with a temporary step-up following a material acquisition to 4.00 to 1.00), and a Consolidated Interest Coverage Ratio (as defined in the Credit Agreement) of not less than 2.75 to 1.00.\nThe Sidecar LC Facilities provide for maintenance fees which accrue per annum on the aggregate amount of any letter of credit outstanding thereunder, payable quarterly, and fees which range from 0.60% to 0.95%, depending on the issuer and the type of letter of credit. In addition to the maintenance fee, Sidecar LC Facilities also provide for each issuer’s standard fees with respect to the issuance, amendment, renewal or extension of any letter of credit. \nCash Flows\nSummarized cash flow information for the nine months ended September 30, 2025 and 2024 is as follows:\nFor the Nine Months Ended September 30,\n(Dollars in millions)\n2025\n2024\nNet cash provided by operating activities\n$\n289 \n$\n567 \nNet cash used in investing activities\n$\n(228)\n$\n(204)\nNet cash used in financing activities\n$\n(328)\n$\n(325)\nOperating Activities\nNet cash provided by operating activities was $289 million for the nine months ended September 30, 2025, compared to $567 million in the prior-year period. The decrease was due to lower net income and greater working \n36\ncapital outflow, in particular due to higher accounts receivable and inventories partially offset by inflows of deferred revenue as well as increased payables related to purchased services and direct material spend and timing.\nInvesting Activities\nNet cash used in investing activities was $228 million for the nine months ended September 30, 2025, compared to $204 million in the prior-year period. The increase was driven by higher capital expenditures, primarily within our ESM segment, partially offset by proceeds from the sale of assets.\nFinancing Activities\nNet cash used in financing activities was $328 million for the nine months ended September 30, 2025, compared to $325 million in the prior-year period. The increase was driven by an increase in net transfers to Honeywell offset by a decrease in finance lease payments.\nCRITICAL ACCOUNTING ESTIMATES\nThere were no material changes during the three and nine months ended September 30, 2025 to the items disclosed as critical accounting estimates in the section titled “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Information Statement.\n37"
}