{
  "item1": "Solventum Corporation (“Solventum, ), leading global healthcare company developing, manufacturing, commercializing broad portfolio solutions leverages deep material science, data science, digital capabilities address critical customer patient needs. constantly seek enable improvement standards care move healthcare forward innovation powered insights, clinical intelligence, technology, manufacturing expertise. 70+ year history discovering innovating advanced solutions helped us solve customers’ toughest challenges. solutions relied every day within global healthcare industry deliver higher-quality patient care, more efficient processes workflows, improved standards safety accuracy.",
  "item7": "MedSurg (56.2% consolidated sales year ended December 31, 2024 ) Year ended December 31, Net sales (millions) Business segment operating income (millions) Sales MedSurg up 0.1%: Organic sales growth 1.2% driven volumes, primarily due benefits medical OEM products, I.V. site management, single-use negative pressure wound therapy, partially offset declines traditional negative pressure wound therapy sterilization assurance products. Other includes lost sales certain health care businesses retained 3M India connection Spin-Off. Foreign currency translation negatively impacted sales (0.6%).",
  "item2": "Net Sales Geographic Area While Company manages its businesses globally believes its business segment results most relevant measure performance, Company also utilizes geographic area data secondary performance measure. Sales generally reported within geographic area based location customer taking possession products which services rendered. Percent change information compares three nine months ended September 30, 2025 same period prior year, unless otherwise indicated. Three months ended September 30, 2025 % worldwide sales Nine months ended September 30, 2025 Net sales (millions) % worldwide sales Additional information beyond what included preceding table follows: Third quarter 2025 results: United States geographic area, both total sales organic sales increased."
}