{
  "source_file": "spg-20241231x10k.htm",
  "form_type": "10-K",
  "item1": "Item 1.\nBusiness\nSimon Property Group, Inc. is a Delaware corporation that operates as a self-administered and self-managed real estate investment trust, or REIT, under the Internal Revenue Code of 1986, as amended, or the Internal Revenue Code. REITs will generally not be liable for U.S. federal corporate income taxes as long as they distribute not less than 100% of their REIT taxable income. Simon Property Group, L.P. is our majority-owned Delaware partnership subsidiary that owns directly or indirectly all of our real estate properties and other assets. Unless stated otherwise or the context otherwise requires, references to \"Simon\" mean Simon Property Group, Inc. and references to the \"Operating Partnership\" mean Simon Property Group, L.P.  References to \"we,\" \"us\" and \"our\" mean collectively Simon, the Operating Partnership and those entities/subsidiaries owned or controlled by Simon and/or the Operating Partnership. According to the amended and restated Operating Partnership's partnership agreement, the Operating Partnership is required to pay all expenses of Simon.\nWe own, develop and manage premier shopping, dining, entertainment and mixed-use destinations, which consist primarily of malls, Premium Outlets\n®\n, and The Mills\n®\n. As of December 31, 2024, we owned or held an interest in 194 income-producing properties in the United States, which consisted of 92 malls, 70 Premium Outlets, 14 Mills, six lifestyle centers, and 12 other retail properties in 37 states and Puerto Rico. We also own an 88% noncontrolling interest in The Taubman Realty Group, LLC, or TRG, which has an interest in 22 regional, super-regional, and outlet malls in the U.S. and Asia. Internationally, as of December 31, 2024, we had ownership interests in 35 Premium Outlets and Designer Outlet properties primarily located in Asia, Europe and Canada. As of December 31, 2024, we also owned a 22.4% equity stake in Klépierre SA, or Klépierre, a publicly traded, Paris-based real estate company, which owns, or has an interest in, shopping centers located in 14 countries in Europe. We also have interests in investments in retail operations (such as Catalyst Brands LLC); an e-commerce venture (Rue Gilt Groupe, or RGG, which operates shop.simon.com), and Jamestown (a global real estate investment and management company), collectively, our other platform investments.\nFor a description of our operational strategies and developments in our business during 2024, see Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” of this Form 10-K.\nOther Policies\nThe following is a discussion of our investment policies, financing policies, conflict of interest policies and policies with respect to certain other activities. One or more of these policies may be amended or rescinded from time to time without a stockholder vote.\nInvestment Policies\nWhile we emphasize equity real estate investments, we may also provide secured financing to or invest in equity or debt securities of other entities engaged in real estate activities or securities of other issuers consistent with Simon’s qualification as a REIT. However, any of these investments would be subject to the percentage ownership limitations and gross income tests necessary for REIT qualification. These REIT limitations mean that Simon cannot make an investment that would cause its real estate assets and certain other qualifying assets (such as cash) to be less than 75% of its total assets. Simon must also derive at least 75% of its gross income directly or indirectly from investments relating to real property or mortgages on real property, including “rents from real property,” dividends from other REITs and, in certain circumstances, interest from certain types of temporary investments. In addition, Simon must also derive at least 95% of its gross income from such real property investments, and from dividends, interest and gains from the sale or dispositions of stock or securities or from other combinations of the foregoing.\nSubject to Simon’s REIT limitations, we may invest in the securities of other issuers in connection with acquisitions of indirect interests in real estate. Such an investment would normally be in the form of general or limited partnership or membership interests in special purpose partnerships and limited liability companies that own one or more properties. We may, in the future, acquire all or substantially all of the securities or assets of other REITs, management companies or similar entities where such investments would be consistent with our investment policies.  Additionally we have and may in the future make investments in entities engaged in non-real estate activities, primarily through a taxable REIT subsidiary, similar to the investments we currently hold in certain retail operations.\n5\n\n\nTable of Contents\nFinancing Policies\nBecause Simon’s REIT qualification requires Simon to distribute at least 90% of its REIT taxable income, we regularly access the debt markets to raise the funds necessary to finance acquisitions, develop and redevelop properties, and refinance maturing debt. We must comply with the covenants contained in our financing agreements that limit our ratio of debt to total assets or market value, as defined. The Operating Partnership has a $5.0 billion unsecured revolving credit facility, or the Credit Facility, and a $3.5 billion supplemental unsecured revolving credit facility, or Supplemental Facility, or together, the Credit Facilities. The Credit Facilities and the indentures for the Operating Partnership’s debt securities contain covenants that restrict the total amount of debt of the Operating Partnership to 65%, or 60% in relation to certain debt, of total assets, as defined under the related agreements, and secured debt to 50% of total assets. In addition, these agreements contain other covenants requiring compliance with financial ratios. Furthermore, the amount of debt that we may incur is limited as a practical matter by our desire to maintain acceptable ratings for the debt securities of the Operating Partnership. We strive to maintain investment grade ratings at all times for various business reasons, including their effect on our ability to access attractive capital, but we cannot assure you that we will be able to do so in the future.\nIf Simon’s Board of Directors determines to seek additional capital, we may raise such capital by offering equity or incurring debt, creating joint ventures with existing ownership interests in properties, entering into joint venture arrangements for new development projects, retaining cash flows or a combination of these methods. If Simon’s Board of Directors determines to raise equity capital, it may, without stockholder approval, issue additional shares of common stock or other capital stock. Simon’s Board of Directors may issue a number of shares up to the amount of our authorized capital or may issue units in any manner and on such terms and for such consideration as it deems appropriate. We may also raise additional capital by issuing common units of partnership interest in the Operating Partnership, or units. Such securities also may include additional classes of Simon’s preferred stock or preferred units of partnership interest in the Operating Partnership, or preferred units, which may be convertible into common stock or units, as the case may be. Existing stockholders and unitholders have no preemptive right to purchase shares or units in any subsequent issuances of securities by us. Any issuance of equity could dilute a stockholder’s investment in Simon or a limited partner’s investment in the Operating Partnership.\nWe expect most future borrowings will be made through the Operating Partnership or its subsidiaries. We might, however, incur borrowings through other entities that would be reloaned to the Operating Partnership. Borrowings may be in the form of bank borrowings, publicly and privately placed debt instruments, or purchase money obligations to the sellers of properties. Any such indebtedness may be secured or unsecured. Any such indebtedness may also have full or limited recourse to the borrower or be cross-collateralized with other debt, or may be fully or partially guaranteed by the Operating Partnership. We issue unsecured debt securities through the Operating Partnership, but we may issue other debt securities which may be convertible into common or preferred stock or be accompanied by warrants to purchase common or preferred stock. We also may sell or securitize our lease receivables. Although we may borrow to fund the payment of dividends, we currently have no expectation that we will regularly do so.\nThe Credit Facility can be increased in the form of additional commitments in an aggregate amount not to exceed $1.0 billion, for a total aggregate size of $6.0 billion, subject to obtaining additional lender commitments and satisfying certain customary conditions precedent. The initial maturity date of the Credit Facility is June 30, 2027. The Credit Facility can be extended for two additional six-month periods to June 30, 2028, at our sole option, subject to satisfying certain customary conditions precedent. \nBorrowings under the Credit Facility bear interest, at our election, at either (i) (x) for Term Benchmark Loans, the Adjusted Term SOFR Rate, the applicable Local Rate, the Adjusted EURIBOR Rate, or the Adjusted TIBOR Rate, (y) for RFR Loans, if denominated in Sterling, SONIA plus a benchmark adjustment and if denominated in Dollars, Daily Simple SOFR plus a benchmark adjustment, or (z) for Daily SOFR Loans, the Adjusted Floating Overnight Daily SOFR Rate, in each case of clauses (x) through (z) above, plus a margin determined by our corporate credit rating of between 0.650% and 1.400% or (ii) for loans denominated in U.S. Dollars only, the base rate (which rate is equal to the greatest of the prime rate, the federal funds effective rate plus 0.500% or Adjusted Term SOFR Rate for one month plus 1.000%) (the “Base Rate”), plus a margin determined by our corporate credit rating of between 0.000% and 0.400%. The Credit Facility includes a facility fee determined by our corporate credit rating of between 0.100% and 0.300% on the aggregate revolving commitments under the Credit Facility.  Based upon our current credit ratings, the interest rate on the Credit Facility is SOFR plus 72.5 basis points, plus a spread adjustment to account for the transition from LIBOR to SOFR. \nThe Supplemental Facility’s initial borrowing capacity of $3.5 billion may be increased to $4.5 billion during its term subject to obtaining additional lender commitments and satisfying certain customary conditions precedent. The initial maturity date of the Supplemental Facility is January 31, 2029 and can be extended for an additional year to January 31, 2030 at our sole option, subject to our continued compliance with the terms thereof.\n6\n\n\nTable of Contents\nBorrowings under the Supplemental Facility bear interest, at the Company’s election, at either (i) (x) for Term Benchmark Loans, the Adjusted Term SOFR Rate, the applicable Local Rate, the Adjusted EURIBOR Rate, the Adjusted Term CORRA Rate, or the Adjusted TIBOR Rate, (y) for RFR Loans, if denominated in Sterling, SONIA plus a benchmark adjustment, if denominated in Dollars, Daily Simple SOFR plus a benchmark adjustment, and if denominated in Canadian Dollars, Daily Simple CORRA plus a benchmark adjustment or (z) for Daily SOFR Loans, the Adjusted Floating Overnight Daily SOFR Rate, in each case of clauses (x) through (z) above, plus a margin determined by the Company’s corporate credit rating of between 0.650% and 1.400% or (ii) for loans denominated in U.S. Dollars only, the base rate (which rate is equal to the greatest of the prime rate, the NYFRB Rate plus 0.500% or Adjusted Term SOFR Rate for one month plus 1.000%) (the “Base Rate”), plus a margin determined by the Company’s corporate credit rating of between 0.000% and 0.400%. The Supplemental Facility includes a facility fee determined by the Company’s corporate credit rating of between 0.100% and 0.300% on the aggregate revolving commitments under the Supplemental Facility. Based upon our current credit ratings, the interest rate on the Supplemental Facility is SOFR plus 72.5 basis points, plus a spread adjustment to account for the transition from LIBOR to SOFR.\nThe Operating Partnership also has available a global unsecured commercial paper note program, or Commercial Paper program, of $2.0 billion, or the non-U.S. dollar equivalent thereof. The Operating Partnership may issue unsecured commercial paper notes, denominated in U.S. dollars, Euro and other currencies. Notes issued in non-U.S. currencies may be issued by one or more subsidiaries of the Operating Partnership and are guaranteed by the Operating Partnership. Notes are sold under customary terms in the U.S. and Euro commercial paper note markets and rank (either by themselves or as a result of the guarantee described above) \npari passu\n with the Operating Partnership’s other unsecured senior indebtedness. The Commercial Paper program is supported by the Credit Facilities and, if necessary or appropriate, we may make one or more draws under the Credit Facilities to pay amounts outstanding from time to time on the Commercial Paper program.\nWe may also finance our business through the following:\n●\nissuance of shares of common stock or preferred stock or warrants to purchase the same;\n●\nissuance of additional units;\n●\nissuance of preferred units;\n●\nissuance of other securities, including unsecured notes and mortgage debt;\n●\ndraws on our Credit Facilities;\n●\nborrowings under the Commercial Paper program; or\n●\nsale or exchange of ownership interests in properties.\nThe Operating Partnership may also issue units to contributors of properties or other partnership interests which may permit the contributor to defer tax gain recognition under the Internal Revenue Code.\nWe do not have a policy limiting the number or amount of mortgages that may be placed on any particular property. \nMortgage financing instruments, however, typically limit additional indebtedness on such properties. Additionally, the Credit Facilities, our unsecured note indentures and other contracts may limit our ability to borrow and contain limits on mortgage indebtedness we may incur as well as certain financial covenants we must maintain.\nTypically, we invest in or form special purpose entities to assist us in obtaining secured permanent financing at attractive terms. Permanent financing may be structured as a mortgage loan on a single property, or on a group of properties, and generally requires us to provide a mortgage lien on the property or properties in favor of an institutional third party, as a joint venture with a third party, or as a securitized financing. For securitized financings, we create special purpose entities to own the properties. These special purpose entities, which are common in the real estate industry, are structured so that they would not be consolidated in a bankruptcy proceeding involving a parent company. We decide upon the structure of the financing based upon the best terms then available to us and whether the proposed financing is consistent with our other business objectives. For accounting purposes, we include the outstanding securitized debt of special purpose entities owning consolidated properties as part of our consolidated indebtedness.\nConflict of Interest \nPolicies\nWe maintain policies and have entered into agreements designed to reduce or eliminate potential conflicts of interest. Simon has adopted governance principles governing the function, conduct, selection, orientation and duties of its \n7\n\n\nTable of Contents\nsubsidiaries and Simon’s Board of Directors and the Company, as well as written charters for each of the standing Committees of Simon’s Board of Directors. In addition, Simon’s Board of Directors has a Code of Business Conduct and Ethics, which applies to all of its officers, directors, and employees and those of its subsidiaries. At least a majority of the members of Simon’s Board of Directors must qualify, and do qualify, as independent under the listing standards of the New York Stock Exchange, or NYSE, and cannot be affiliated with the Simon family, who are significant stockholders in Simon and/or unitholders in the Operating Partnership. In addition, the Audit and Compensation and Human Capital Committees of Simon’s Board of Directors are comprised entirely of independent members who meet the additional independence and financial expert requirements of the NYSE as required. \nThe sale by the Operating Partnership of any property that it owns may have an adverse tax impact on the Simon family or other limited partners of the Operating Partnership. Any transaction between us and the Simon family, including property acquisitions, service and property management agreements and retail space leases, must be approved by the Company’s Audit Committee.\nIn order to avoid any conflict of interest, the Simon charter requires that at least three-fourths of Simon’s independent directors must authorize and require the Operating Partnership to sell any property it owns. Any such sale is subject to applicable agreements with third parties. A noncompetition agreement executed by Herbert Simon, Simon’s Chairman Emeritus, and a noncompetition agreement executed by David Simon, Simon’s Chairman, Chief Executive Officer and President, which remains in effect notwithstanding the expiration of David Simon’s employment agreement in 2019, contain covenants limiting their ability to participate in certain shopping center activities.\nPolicies With Respect To Certain Other Activities\nWe intend to make investments which are consistent with Simon’s qualification as a REIT, unless Simon’s Board of Directors determines that it is no longer in Simon’s best interests to so qualify as a REIT. Simon’s Board of Directors may make such a determination because of changing circumstances or changes in the REIT requirements. Simon has authority to issue shares of its capital stock or other securities in exchange for property. We also have authority to repurchase or otherwise reacquire Simon’s shares, the Operating Partnership’s units, or any other securities. On May 9, 2022, Simon’s Board of Directors authorized a common stock repurchase plan commencing on May 16, 2022.  Under the program, the Company could purchase up to $2.0 billion of its common stock during the two-year period ending May 16, 2024 in open market or privately negotiated transactions, at prices that the Company deemed appropriate and subject to market conditions, applicable law, and other factors deemed relevant in the Company’s sole discretion.  On February 8, 2024, Simon’s Board of Directors authorized a new common stock repurchase program which replaced the prior repurchase program immediately, where the Company may purchase up to $2.0 billion of its common stock over the next 24 months.  As Simon repurchases shares under these programs, the Operating Partnership repurchases an equal number of units from Simon. Simon may also issue shares of its common stock, or pay cash at its option, to holders of units in future periods upon exercise of such holders’ rights under the partnership agreement of the Operating Partnership. Our policy prohibits us from making any loans to the directors or executive officers of Simon for any purpose. We may make loans to the joint ventures in which we participate. Additionally, we may make or buy interests in loans secured by real estate properties owned by others or make investments in companies that own real estate assets.\nCompetition\nThe retail real estate industry is dynamic and competitive. We compete with numerous merchandise distribution channels, including malls, outlet centers, community/lifestyle centers, and other shopping centers in the United States and abroad. We also compete with internet retailing sites and catalogs, including our tenants, which provide retailers with distribution options beyond existing brick and mortar retail properties. The existence of competitive alternatives could have a material adverse effect on our ability to lease space and on the level of rents we can obtain. This results in competition for both the tenants to occupy the properties that we develop and manage as well as for the acquisition of prime sites (including land for development and operating properties). We believe that there are numerous factors that make our properties highly desirable to retailers, including:\n●\nthe quality, location and variety of tenants of our properties;\n●\nour management and operational expertise;\n●\nour extensive experience and relationships with tenants, lenders and suppliers;\n●\nour marketing initiatives and consumer focused strategic corporate alliances; and\n●\nthe efficiency and immediacy of physical retail.\n8\n\n\nTable of Contents\nCertain Activities\nDuring the past three years, we have:\n●\nissued 57,680 shares of Simon common stock upon the exchange of units in the Operating Partnership;\n●\nissued 871,680 restricted shares of Simon common stock and 689,202 long-term incentive performance units, or LTIP units, net of forfeitures, under the Simon Property Group, L.P. 2019 Stock Incentive Plan, or the 2019 Plan;\n●\npurchased 3,103,755 shares of Simon common stock in the open market at an average price of $103.42 per share for $321.0 million pursuant to our repurchase program;\n●\nissued 3,297,500 units in the Operating Partnership as part of the consideration for the acquisition of additional interests in TRG, bringing our noncontrolling ownership interest in TRG to 88%;\n●\nredeemed 417,331 units in the Operating Partnership for $57.7 million \nat an average price of\n $138.18 per unit in cash; \n●\namended, restated, extended, and increased our existing $4.0 billion unsecured revolving credit facility on March 14, 2023 with a new $5.0 billion unsecured revolving credit facility.\n●\namended, restated, and extended our existing $3.5 billion unsecured revolving credit facility on September 19, 2024;\n●\nborrowed a maximum amount of $325.1 million under the Credit Facilities; the outstanding amount of borrowings under the Credit Facility was $323.7 million as of December 31, 2024. There were no borrowings under the Supplemental Facility as of December 31, 2024;\n●\nthere were no outstanding borrowings of Commercial Paper notes as of December 31, 2024; and\n●\nprovided annual reports containing financial statements audited by our independent registered public accounting firm and quarterly reports containing unaudited financial statements to our security holders. \nHuman Capital\nAt December 31, 2024, we and our affiliates employed approximately 3,000 persons at various properties and offices throughout the United States, of which approximately 400 were part-time. Approximately 1,000 of these employees were located at our corporate headquarters in Indianapolis, Indiana.\nWe believe our employees are the driving force behind our success.  To ensure we continue to attract, develop and retain the best talent across the organization, we invest in our employees and provide equal opportunities. We offer a variety of ongoing talent programs that foster continual development, high performance and overall organizational effectiveness, including a series of leadership development programs. We conduct an annual talent-assessment process for selected business functions within our corporate and field organizations that includes plans for individual employee career development and long-term leadership succession, and also conduct an annual performance appraisal process for all regular employees. \nWe are focused on providing a work environment that is free from any form of discrimination or harassment for any protected class and also embraces a code of conduct. We have an internal policy of targeted solutions for employees and an annual process of assessment, action and evaluation led by our human resources department.\nOur compensation program is designed to, among other things, attract, retain and motivate talented and experienced individuals using a mix of competitive salaries, bonuses, equity based awards and other benefits.\nGovernment Regulations Affecting Our Properties\nWe are subject to federal, state and local environmental regulations that apply generally to the ownership of real property and the operations conducted on real property.  As of December 31, 2024, we are not aware of any environmental conditions or material costs of complying with environmental or other regulations that would have a material adverse effect on our overall business, financial condition, or results of operations.  However, it is possible that we are not aware of, or may become subject to, potential environmental liabilities or material costs of complying with governmental regulations that could be material.  See further discussion in Item 1A. Risk Factors.\n9\n\n\nTable of Contents\nCorporate Headquarters\nOur corporate headquarters are located at 225 West Washington Street, Indianapolis, Indiana 46204, and our telephone number is (317) 636-1600.\nAvailable Information\nSimon is a large accelerated filer (as defined in Rule 12b-2 of the Securities Exchange Act of 1934, as amended, or the Exchange Act) and is required, pursuant to Item 101 of Regulation S-K, to provide certain information regarding our website and the availability of certain documents filed with or furnished to the Securities and Exchange Commission, or the SEC. Our Internet website address is www.simon.com. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act are available or may be accessed free of charge through the “About Simon/Investor Relations” section of our Internet website as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. Our Internet website and the information contained therein or connected thereto are not, and are not intended to be, incorporated into this Annual Report on Form 10-K.\nThe following corporate governance documents are also available through the “About Simon/Investor Relations/ Governance” section of our Internet website or may be obtained in print form by request of our Investor Relations Department: Governance Principles, Code of Business Conduct and Ethics, Audit Committee Charter, Compensation and Human Capital Committees Charter, and Governance and Nominating Committee Charter.\nIn addition, we intend to disclose on our Internet website any amendments to, or waivers from, our Code of Business Conduct and Ethics that are required to be publicly disclosed pursuant to rules of the SEC and the NYSE.\nInformation about our Executive Officers\nThe following table sets forth certain information with respect to Simon’s executive officers as of February 21, 2025.\n​\n​\n​\n​\n​\nName\n    \nAge\n    \nPosition\nDavid Simon\n \n 63\n \nChairman of the Board, Chief Executive Officer and President\nJohn Rulli\n \n 68\n \nChief Administrative Officer\nSteven E. Fivel\n \n 64\n \nGeneral Counsel and Secretary\nBrian J. McDade\n \n 45\n \nExecutive Vice President and Chief Financial Officer\nAdam J. Reuille\n \n 50\n \nSenior Vice President and Chief Accounting Officer\nDonald G. Frey\n​\n 49\n​\nTreasurer and Executive Vice President\nKevin M. Kelly\n​\n 44\n​\nAssistant General Counsel and Assistant Secretary\n​\nThe executive officers of Simon serve at the pleasure of Simon’s Board of Directors.\nMr. Simon has served as the Chairman of Simon’s Board of Directors since 2007, Chief Executive Officer of Simon or its predecessor since 1995 and assumed the position of President in 2019. Mr. Simon has also been a director of Simon or its predecessor since its incorporation in 1993. Mr. Simon was the President of Simon’s predecessor from 1993 to 1996. \nMr. Rulli serves as Simon’s Chief Administrative Officer. Mr. Rulli joined Melvin Simon & Associates, Inc., or MSA, in 1988 and held various positions with MSA and Simon thereafter. Mr. Rulli became Chief Administrative Officer in 2007 and was promoted to Senior Executive Vice President in 2011. \nMr. Fivel serves as Simon’s General Counsel and Secretary. Prior to rejoining Simon in 2011 as Assistant General Counsel and Assistant Secretary, Mr. Fivel served as Executive Vice President, General Counsel and Secretary of Brightpoint, Inc. Mr. Fivel was previously employed by MSA from 1988 until 1993 and then by Simon from 1993 to 1996.  Mr. Fivel was promoted to General Counsel and Secretary in 2017.\nMr. McDade serves as Simon’s Executive Vice President and Chief Financial Officer. Mr. McDade joined Simon in 2007 as the Director of Capital Markets and was promoted to Senior Vice President of Capital Markets in 2013 and Treasurer in 2014.  He was promoted to Executive Vice President and Chief Financial Officer in 2018.\nMr. Reuille serves as Simon’s Senior Vice President and Chief Accounting Officer and prior to that as Simon’s Vice President and Corporate Controller. Mr. Reuille joined Simon in 2009 and was promoted to Senior Vice President and Chief Accounting Officer in 2018.\n10\n\n\nTable of Contents\nMr. Frey serves as Simon’s Treasurer and Executive Vice President.  Mr. Frey joined Simon in 2010 and most recently served as Simon’s Assistant Treasurer and Senior Vice President prior to his current position which he was promoted to in 2022.  Before joining Simon, Mr. Frey was an attorney with Alston & Bird LLP and Dechert LLP.\nMr. Kelly serves as Simon’s Assistant General Counsel and Assistant Secretary.  Mr. Kelly joined Simon in 2015 as Senior Finance Counsel and was promoted to Senior Associate, General Counsel in 2020 prior to his current position which he was promoted to in 2022.  Prior to joining Simon, Mr. Kelly was an attorney with Sidley Austin, LLP and Fried, Frank, Harris, Shriver & Jacobson. \n​",
  "item7": "Item 7.  Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with the consolidated financial statements and notes thereto that are included in this Annual Report on Form 10-K.\nOverview\nSimon Property Group, Inc. is a Delaware corporation that operates as a self-administered and self-managed real estate investment trust, or REIT, under the Internal Revenue Code of 1986, as amended, or the Internal Revenue Code. REITs will generally not be liable for U.S. federal corporate income taxes as long as they distribute not less than 100% of their REIT taxable income. Simon Property Group, L.P. is our majority-owned Delaware partnership subsidiary that owns directly or indirectly all of our real estate properties and other assets. In this discussion, unless stated otherwise or the context otherwise requires, references to \"Simon\" mean Simon Property Group, Inc. and references to the \"Operating Partnership\" mean Simon Property Group, L.P.  References to \"we,\" \"us\" and \"our\" mean collectively Simon, the Operating Partnership and those entities/subsidiaries owned or controlled by Simon and/or the Operating Partnership. According to the amended and restated Operating Partnership's partnership agreement, the Operating Partnership is required to pay all expenses of Simon.\nWe own, develop and manage premier shopping, dining, entertainment and mixed-use destinations, which consist primarily of malls, Premium Outlets\n®\n, and The Mills\n®\n. As of December 31, 2024, we owned or held an interest in 194 income-producing properties in the United States, which consisted of 92 malls, 70 Premium Outlets, 14 Mills, six lifestyle centers, and 12 other retail properties in 37 states and Puerto Rico. We also own an 88% noncontrolling interest in The Taubman Realty Group, LLC, or TRG, which has an interest in 22 regional, super-regional, and outlet malls in the U.S. and Asia. In addition, we have redevelopment and expansion projects, including the addition of anchors, big box tenants, and restaurants, underway at several properties in the North America, Europe and Asia. Internationally, as of December 31, 2024, we had ownership in 35 Premium Outlets and Designer Outlet properties primarily located in Asia, Europe, and Canada. As of December 31, 2024, we also owned a 22.4% equity stake in Klépierre SA, or Klépierre, a publicly traded, Paris-based real estate company, which owns, or has an interest in, shopping centers located in 14 countries in Europe. We also have interests in investments in retail operations (such as Catalyst Brands LLC, or Catalyst); an e-commerce venture (Rue Gilt Groupe, or RGG, which operates shop.simon.com), and Jamestown (a global real estate investment and management company), collectively, our other platform investments.\nWe generate the majority of our lease income from retail, dining, entertainment, and other tenants including consideration received from:\n●\nfixed minimum lease consideration and fixed common area maintenance (CAM) reimbursements, and\n●\nvariable lease consideration primarily based on tenants’ reported sales, as well as reimbursements for real estate taxes, utilities, marketing and certain other items.\nRevenues of our management company, after intercompany eliminations, consist primarily of management fees that are typically based upon the revenues of the property being managed.\nWe invest in real estate properties to maximize total financial return which includes both operating cash flows and capital appreciation. We seek growth in earnings, funds from operations, or FFO, and cash flows by enhancing the profitability and operation of our properties and investments. We seek to accomplish this growth through the following:\n●\nattracting and retaining high quality tenants and utilizing economies of scale to reduce operating expenses,\n●\nexpanding and re-tenanting existing highly productive locations at competitive rental rates,\n●\nselectively acquiring or increasing our interests in high quality real estate assets or portfolios of assets,\n●\ngenerating consumer traffic in our retail properties through marketing initiatives and strategic corporate alliances, and\n●\nselling selective non-core assets.\n60\n\n\nTable of Contents\nWe also grow by generating supplemental revenues from the following activities:\n●\nestablishing our properties as leading market resource providers for retailers and other businesses and consumer-focused corporate alliances, including national marketing alliances, static and digital media initiatives, business development, sponsorship, and events,\n●\noffering property operating services to our tenants and others, including waste handling and facility services, and the provision of energy services,\n●\nselling or leasing land adjacent to our properties, commonly referred to as “outlots” or “outparcels,” and\n●\ngenerating interest income on cash deposits and investments in loans, including those made to related entities\n.\nWe focus on high quality real estate across the retail real estate spectrum. We expand or redevelop properties to enhance profitability and market share of existing assets when we believe the investment of our capital meets our risk-reward criteria. We selectively develop new properties in markets we believe are not adequately served by existing retail properties.\nWe routinely review and evaluate acquisition opportunities based on their ability to enhance our portfolio. Our international strategy includes partnering with established real estate companies and financing international investments with local currency to minimize foreign exchange risk.\nTo support our growth, we employ a three-fold capital strategy:\n●\ngenerate the capital necessary to fund growth,\n●\nmaintain sufficient flexibility to access capital in many forms, both public and private, including but not limited to, having in place, the Operating Partnership’s $5.0 billion unsecured revolving credit facility, or the Credit Facility, its $3.5 billion supplemental unsecured revolving credit facility, or its Supplemental Facility, together, the Credit Facilities and its global unsecured commercial paper note program, or the Commercial Paper program, of $2.0 billion, or the non-U.S. dollar equivalent thereof, and\n●\nmanage our overall financial structure in a fashion that preserves our investment grade credit ratings.\nWe consider FFO, Real Estate FFO, net operating income, or NOI, and portfolio NOI to be key measures of operating performance that are not specifically defined by accounting principles generally accepted in the United States, or GAAP. We use these measures internally to evaluate the operating performance of our portfolio and provide a basis for comparison with other real estate companies. Reconciliations of these measures to the most comparable GAAP measures are included below in this discussion.\nResults Overview\nDiluted earnings per share and diluted earnings per unit increased $0.28 during 2024 to $7.26 as compared to $6.98 in 2023. The increase in diluted earnings per share and diluted earnings per unit was primarily attributable to:\n●\nimproved operating performance and solid core business fundamentals in 2024, as discussed below,\n●\nincreased lease income in 2024 of $225.4 million, or $0.60 per diluted share/unit,\n●\na pre-tax gain during the first quarter of 2024 on the sale of all our remaining interests in Authentic Brands Group, or ABG, of $414.8 million, or $1.10 per diluted share/unit, and a non-cash pre-tax gain of $100.5 million, or $0.27 per diluted share/unit, during the fourth quarter of 2024 related to the acquisition by J.C. Penney of the retail operations of SPARC Group, partially offset by an other-than-temporary impairment charge of $57.0 million, or $0.15 per diluted share/unit, in the fourth quarter of 2024, representing our pre-development costs associated with an unconsolidated joint venture development project, \n●\nincreased other income of $72.3 million, or $0.19 per diluted share/unit, primarily due to increased interest income of $76.4 million, or $0.20 per diluted share/unit, and an increase in land sales of $13.6 million, or $0.03 per diluted share/unit, partially offset by a decrease in distributions and other income of $17.7 million, or $0.05 per diluted share/unit,\n●\ndecreased income and other tax expense of $58.6 million, or $0.16 per diluted share/unit, primarily due to transactional activity and unfavorable year-over-year results of operations from other platform investments,\n61\n\n\nTable of Contents\n●\ndecreased other expenses in 2024 of $38.2 million, or $0.10 per diluted share/unit, partially offset by\n●\npre-tax gains in 2023 due to the disposal, exchange, or revaluation of equity interests of $362.0 million, or $0.96 per diluted share/unit, of which, $204.9 million, or $0.55 per diluted share/unit, was non-cash,\n●\ndecreased income from unconsolidated entities of $168.3 million, or $0.45 per diluted share/unit, the majority of which is due to lower results of operations from other platform investments, partially offset by improved operations and core fundamentals in our other unconsolidated entities,\n●\nincreased interest expense of $51.1 million, or $0.14 per diluted share/unit, primarily due to new USD and EUR bond issuances as well as increases to rates on variable rate mortgages,\n●\nincreased property operating expenses in 2024 of $40.4 million, or $0.11 per diluted share/unit, and\n●\nan unrealized unfavorable change in fair value of publicly traded equity instruments and derivative instrument, net of $29.3 million, or $0.08 per diluted share/unit\n.\nPortfolio NOI increased 4.6% in 2024 as compared to 2023. Average base minimum rent for U.S. Malls and Premium Outlets increased 2.5% to $58.26 psf as of December 31, 2024, from $56.82 psf as of December 31, 2023. Ending occupancy for our U.S. Malls and Premium Outlets increased 0.7% to 96.5% as of December 31, 2024, from 95.8% as of December 31, 2023, primarily due to strong leasing demand.\nOur effective overall borrowing rate at December 31, 2024 on our consolidated indebtedness increased 13 basis points to 3.62% as compared to 3.49% at December 31, 2023. This increase was primarily due to an increase in the effective overall borrowing rate on the fixed rate debt of 14 basis points, due to increasing benchmark rates on new USD and EUR bond issuances. The weighted average years to maturity of our consolidated indebtedness was 8.1 years at December 31, 2024 and 2023.\nOur financing activity for the year ended December 31, 2024 included:\n●\ncompleting, on October 1, 2024, the redemption at par of the Operating Partnerships $900 million 3.38% senior unsecure notes at maturity,\n●\nthe Operating Partnership completing, on September 26, 2024, the issuance of $1.0 billion senior unsecured notes with a fixed interest rate of 4.75% and a maturity date of September 26, 2034,\n●\namending, restating, and extending our Supplemental Facility on September 19, 2024,\n●\ncompleting, on September 13, 2024, the redemption at par of the Operating Partnership’s $1.0 billion 2.00% senior unsecured notes at maturity, and\n●\ncompleting, on February 1, 2024, the redemption at par of the Operating Partnerships $600 million 3.75% senior unsecured notes at maturity.\nUnited States Portfolio Data\nThe portfolio data discussed in this overview includes the following key operating statistics: ending occupancy, and average base minimum rent per square foot. We include acquired properties in this data beginning in the year of acquisition and remove disposed properties in the year of disposition. For comparative information purposes, we separate the information related to The Mills and TRG from our other U.S. operations. We also do not include any information for properties located outside the United States.\n62\n\n\nTable of Contents\nThe following table sets forth these key operating statistics for domestic properties:\n●\nproperties that are consolidated in our consolidated financial statements,\n●\nproperties we account for under the equity method of accounting as joint ventures, and\n●\nthe foregoing two categories of properties on a total portfolio basis.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n%/Basis Point\n​\n​\n​\n​\n%/Basis Point\n​\n​\n​\n​\n    \n2024\n    \nChange (1)\n    \n2023\n    \nChange (1)\n    \n2022\nU.S. Malls and Premium Outlets:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nEnding Occupancy\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nConsolidated\n​\n​\n96.5%\n​\n80 bps\n​\n​\n95.7%\n​\n80 bps\n​\n​\n94.9%\nUnconsolidated\n​\n​\n96.6%\n​\n50 bps\n​\n​\n96.1%\n​\n120 bps\n​\n​\n94.9%\nTotal Portfolio\n​\n​\n96.5%\n​\n70 bps\n​\n​\n95.8%\n​\n90 bps\n​\n​\n94.9%\nAverage Base Minimum Rent per Square Foot\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nConsolidated\n​\n$\n 56.60\n​\n2.0%\n​\n$\n 55.47\n​\n2.8%\n​\n$\n 53.95\nUnconsolidated\n​\n$\n 63.12\n​\n4.2%\n​\n$\n 60.59\n​\n3.8%\n​\n$\n 58.36\nTotal Portfolio\n​\n$\n 58.26\n​\n2.5%\n​\n$\n 56.82\n​\n3.1%\n​\n$\n 55.13\nU.S. TRG:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nEnding Occupancy\n​\n \n94.9%\n​\n-80 bps\n​\n \n95.7%\n​\n120 bps\n​\n \n94.5%\nAverage Base Minimum Rent per Square Foot\n​\n$\n 68.06\n​\n4.7%\n​\n$\n 65.01\n​\n5.3%\n​\n$\n 61.76\nThe Mills:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nEnding Occupancy\n​\n \n98.8%\n​\n100 bps\n​\n \n97.8%\n​\n-40 bps\n​\n \n98.2%\nAverage Base Minimum Rent per Square Foot\n​\n$\n 37.95\n​\n4.3%\n​\n$\n 36.38\n​\n4.3%\n​\n$\n 34.89\n(1)\nPercentages may not recalculate due to rounding. Percentage and basis point changes are representative of the change from the comparable prior period.\nEnding Occupancy Levels and Average Base Minimum Rent per Square Foot.\n  Ending occupancy is the percentage of gross leasable area, or GLA, which is leased as of the last day of the reporting period. We include all company owned space except for mall anchors, mall majors, mall freestanding and mall outlots in the calculation. Base minimum rent per square foot is the average base minimum rent charge in effect for the reporting period for all tenants that would qualify to be included in ending occupancy.\nCurrent Leasing Activities\nDuring the twelve months ended December 31, 2024, we signed 1,149 new leases and 2,549 renewal leases (excluding mall anchors and majors, new development, redevelopment and leases with terms of one year or less) with a fixed minimum rent across our U.S. Malls and Premium Outlets portfolio, comprising approximately 13.5 million square feet, of which 10.4 million square feet related to consolidated properties. During the comparable period in 2023, we signed 1,185 new leases and 1,841 renewal leases with a fixed minimum rent, comprising approximately 10.9 million square feet, of which 8.3 million square feet related to consolidated properties. The average annual initial base minimum rent for new leases was $66.61 per square foot in 2024 and $66.39 per square foot in 2023 with an average tenant allowance on new leases of $60.33 per square foot and $64.31 per square foot, respectively.\nJapan Data\nThe following are selected key operating statistics for our Premium Outlets in Japan. The information used to prepare these statistics has been supplied by the managing venture partner.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n   \nDecember 31, \n   \n%/basis point\n   \nDecember 31, \n   \n%/basis point\n   \nDecember 31, \n​\n​\n2024\n​\nChange\n​\n2023\n​\nChange\n​\n2022\nEnding Occupancy\n​\n​\n99.3%\n​\n-40 bps\n​\n​\n99.7%\n​\n-10 bps\n​\n​\n99.8%\nAverage Base Minimum Rent per Square Foot\n​\n¥\n 5,511\n​\n0.31%\n​\n¥\n 5,494\n​\n-4.93%\n​\n¥\n 5,779\n​\n63\n\n\nTable of Contents\nCritical Accounting Estimates\nThe preparation of financial statements in conformity with U.S. generally accepted accounting principles, or GAAP, requires management to use judgment in the application of accounting policies, including making estimates and assumptions. We base our estimates on historical experience and on various other assumptions believed to be reasonable under the circumstances. These judgments affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities at the dates of the financial statements and the reported amounts of revenue and expenses during the reporting periods. If our judgment or interpretation of the facts and circumstances relating to various transactions had been different, it is possible that different accounting policies would have been applied resulting in a different presentation of our financial statements. From time to time, we reevaluate our estimates and assumptions. In the event estimates or assumptions prove to be different from actual results, adjustments are made in subsequent periods to reflect more current information. Below is a discussion of accounting policies that we consider critical in that they may require complex judgment in their application or require estimates about matters that are inherently uncertain. For a summary of our significant accounting policies, see Note 3 of the notes to the consolidated financial statements.\n●\nWe, as a lessor, primarily under long-term leases, retain substantially all of the risks and benefits of ownership of the investment properties and account for our leases as operating leases. We accrue fixed lease income on a straight-line basis over the terms of the leases, when we believe substantially all lease income, including the related straight-line rent receivable, is probable of collection. Our assessment of collectability, primarily under long-term leases, incorporates available operational performance measures such as reported sales and the aging of billed amounts as well as other publicly available information with respect to our tenant’s financial condition, liquidity and capital resources.  When a tenant seeks to reorganize its operations through bankruptcy proceedings, we assess the collectability of receivable balances including, among other things, the timing of a tenant’s bankruptcy filing and our expectations of the assumption by the tenant in bankruptcy proceeding of leases at the Company’s properties on substantially similar terms.  In the event that we determine accrued receivables are not probable of collection, lease income will be recorded on a cash basis, with the corresponding tenant receivable and straight-line rent receivable charged as a direct write-off against lease income in the period of the change in our collectability determination.  \n●\nWe review investment properties for impairment on a property-by-property basis to identify and evaluate events or changes in circumstances which indicate that the carrying value of investment properties may not be recoverable. These circumstances include, but are not limited to, changes in a property’s operational performance such as declining cash flows, occupancy or total reported sales per square foot, the Company’s intent and ability to hold the related asset, and, if applicable, the remaining time to maturity of underlying financing arrangements. We measure any impairment of investment property when the estimated undiscounted operating income before depreciation and amortization during the anticipated holding period plus its residual value is less than the carrying value of the property. To the extent impairment has occurred, we charge to income the excess of carrying value of the property over our estimate of its fair value. We also review our investments, including investments in unconsolidated entities, to identify and evaluate whether events or changes in circumstances indicate that the carrying amount of our investments may not be recoverable. We will record an impairment charge if we determine the fair value of the investments are less than their carrying value and such impairment is other-than-temporary. Our evaluation of changes in economic or operating conditions and whether an impairment is other-than-temporary may include developing estimates of fair value, forecasted cash flows or operating income before depreciation and amortization. We estimate undiscounted cash flows and fair value, if applicable, using observable and unobservable data such as operating income, hold periods, estimated capitalization rates, or relevant market multiples, leasing prospects and local market information and whether certain impairments are other-than-temporary. Changes in economic and operating conditions, including changes in the financial condition of our tenants, and changes to our intent and ability to hold the related asset, that occur subsequent to our review of recoverability of investment property and other investments could impact the assumptions used in that assessment and could result in future charges to earnings if assumptions regarding those investments differ from actual results.\n●\nTo maintain Simon’s status as a REIT, Simon must distribute at least 90% of its REIT taxable income in any given year and meet certain asset and income tests. We monitor our business and transactions that may potentially impact Simon’s REIT status. In the unlikely event that we fail to maintain Simon’s REIT status, and available relief provisions do not apply, Simon would be required to pay U.S. federal income taxes at regular corporate income tax rates during the period Simon did not qualify as a REIT. If Simon lost its REIT status, it could not elect to be taxed as a REIT for four taxable years following the year during which qualification was lost unless its failure was \n64\n\n\nTable of Contents\ndue to reasonable cause and certain other conditions were met. As a result, failing to maintain REIT status would result in a significant increase in the income tax expense recorded and paid during those periods.\n●\nIn the period of a significant acquisition of real estate, we make estimates as part of our valuation of the purchase price of asset acquisitions (including the components of excess investment in joint ventures) to the various components of the acquisition based upon the relative fair value of each component. The most significant components of our real estate valuations are typically the determination of relative fair value to the buildings as-if-vacant, land and market value of in-place leases. In the case of the fair value of buildings and fair value of land and other intangibles, our estimates of the values of these components will affect the amount of depreciation or amortization we record over the estimated useful life of the property acquired or the remaining lease term. In the case of the market value of in-place leases, we make our best estimates of the tenants’ ability to pay rents based upon the tenants’ operating performance at the property, including the competitive position of the property in its market as well as sales psf, rents psf, and overall occupancy cost for the tenants in place at the acquisition date. Our assumptions affect the amount of future revenue that we will recognize over the remaining lease term for the acquired in-place leases.   \nResults of Operations\nThe following acquisitions, dispositions, and openings of consolidated properties affected our consolidated results in the comparative periods:\n●\nDuring the fourth quarter of 2024, we acquired the remaining interest in Smith Haven Mall from a joint venture partner, resulting in the consolidation of this property.\n●\nDuring the fourth quarter of 2024, we disposed of our interests in two consolidated retail properties.\n●\nOn August 15, 2024, we opened Tulsa Premium Outlets, a 338,472 square foot center in Tulsa, Oklahoma. We own 100% of this center.\n●\nOn February 6, 2024, we acquired an additional interest in Miami International Mall from a joint venture partner, resulting in the consolidation of this property.\n●\nOn April 27, 2023, we opened Paris-Giverny Designer Outlet, a 228,000 square foot center in Vernon, France. We own a 74% interest in this center.\n●\nOn June 17, 2022, we acquired an additional interest in Gloucester Premium Outlets from a joint venture partner, resulting in the consolidation of this property.\n●\nDuring the second quarter of 2022, we disposed of one retail property.\nThe following acquisitions, dispositions, and openings of noncontrolling interests in joint venture entities affected our income from unconsolidated entities in the comparative periods:\n●\nOn December 19, 2024, J.C. Penney acquired the retail operations of SPARC Group and was renamed Catalyst Brands post transaction. As a result, we recognized a non-cash pre-tax gain of $100.5 million. After the transaction, we own a 31.3% noncontrolling interest in Catalyst. Additionally, we continue to hold a 33.3% noncontrolling interest in SPARC Holdings, the former owner of SPARC Group, which now primarily holds a 25% interest in Catalyst.\n●\nDuring the fourth quarter of 2024, we acquired additional 4% ownership in TRG for approximately $266.7 million by issuing 1,572,500 units in the Operating Partnership, bringing our noncontrolling interest in TRG to 88%.\n●\nDuring the first quarter of 2024, we disposed all of our remaining interest in ABG.\n●\nDuring 2023, ABG completed multiple capital transactions which resulted in the dilution of our ownership and multiple deemed disposals of a proportional interest of our investment.  In addition, we sold a portion of our interest in ABG on November 29, 2023.  These transactions reduced our ownership from 12.3% to 9.6% as of December 31, 2023.\n●\nDuring the third quarter of 2023, we disposed of our interest in one unconsolidated retail property through foreclosure in satisfaction of its $114.8 million non-recourse loan. We recognized no gain or loss in connection with this disposal.\n65\n\n\nTable of Contents\n●\nDuring the third quarter of 2023, we acquired an additional 4% ownership in TRG for approximately $199.6 million by issuing 1,725,000 units in the Operating Partnership, bringing our noncontrolling ownership interest in TRG to 84%.\n●\nDuring the third quarter of 2023, SPARC Group issued equity to a third party resulting in the dilution of our ownership to 33.3% and a deemed disposal of a proportional interest of our investment. As a result, we recognized a non-cash pre-tax gain on the deemed disposal of $145.8 million.\n●\nDuring the fourth quarter of 2022, we disposed of one retail property.\n●\nDuring the fourth quarter of 2022, we sold to ABG all of our interests in the licensing venture of Eddie Bauer for additional interests in ABG. Our noncontrolling interest in ABG was approximately 12.3% after this transaction.\n●\nOn December 19, 2022, we completed the acquisition of a 50% noncontrolling legal ownership interest in Jamestown, a global real estate investment and asset management company, as well as separate interests in certain real estate and working capital, for total cash consideration of $173.4 million.\n●\nOn November 3, 2022, we opened Fukaya-Hanazono Premium Outlets, a 296,300 square foot center in Fukaya City, Japan. We own a 40% interest in this center.\n●\nDuring the third quarter of 2022, we disposed of one retail property.\nFor the purposes of the following comparisons between the years ended December 31, 2024 and 2023 and the years ended December 31, 2023 and 2022, the above transactions are referred to as the property transactions. In the following discussions of our results of operations, “comparable” refers to properties we owned and operated in both years in the year to year comparisons.\nYear Ended December 31, 2024 vs. Year Ended December 31, 2023\nLease income increased $225.4 million, primarily due to an increase in fixed minimum lease consideration, higher occupancy, and the consolidation of two properties during 2024.  \nOther income increased $72.3 million, primarily due to a $76.4 million increase in interest income and a $13.6 million increase in land sale activity, partially offset by a decrease in franchise operations of $27.9 million.\nProperty operating expense increased $40.4 million as a result of inflationary cost increases and the consolidation of two properties.\nReal estate taxes decreased $33.1 million primarily due to successful property tax appeals, the majority of which relates to prior years.\nAdvertising and promotion expense increased $17.2 million primarily due to increased programming expenses.\nHome and regional office costs increased $15.7 million due to increased personnel and compensation costs.\nOther expenses decreased $38.2 million primarily due to a decrease in franchise operations.\nInterest expense increased $51.1 million primarily related to an increase of $81.8 million due to new USD unsecured bond issuances, an increase of $35.0 million due to the Euro exchangeable bond issuance in 2023, an increase of $6.1 million on secured debt and the effect of the balance increase of the Credit Facility during 2023 of $1.4 million, partially offset by a decrease of $46.1 million due to USD unsecured bond payoffs during 2024 and 2023, and a decrease of $27.1 million due to the Supplemental Facility repayment during 2023. \nGain due to disposal, exchange or revaluation of equity interests, net, increased $89.1 million primarily due to an increase of $414.8 million as a result of selling our remaining interest in ABG during 2024, a non-cash pre-tax $100.5 million gain due to the acquisition by J.C. Penney of the retail operations of SPARC Group, offset by the non-cash pre-tax gains on the deemed disposal of a portion of our investment in ABG of $59.1 million and SPARC Group of $145.8 million and our share of the gain on the sale of a portion of our ABG interest of $157.1 million during 2023, the other-than-temporary impairment charge of $57.0 million in 2024 representing pre-development costs associated with an unconsolidated joint venture development project, and a reduction in the carrying value of certain equity investments of $7.0 million in 2024.\nIncome and other tax expense decreased $58.6 million primarily due to results of operations from our other platform investments and transactions within our TRS, partially offset by the aforementioned ABG, J.C. Penney, and SPARC Group transactions which increased tax expense of $37.8 million year-over-year.\n66\n\n\nTable of Contents\nIncome from unconsolidated entities decreased $168.3 million primarily due to lower results of operations from our other platform investments, partially offset by strong results and improved performance by our joint venture properties. \nWe recorded net non-cash unrealized losses of $17.4 million in 2024 compared to net non-cash unrealized gains of $11.9 million in 2023, as a result of mark-to-market activity on publicly traded equity instruments and the change in fair value of a derivative instrument.\nDuring 2024, we recorded a net loss of $75.8 million, which is primarily related to the disposition of two retail properties for a net loss of $69.8 million, an impairment on a joint venture investment of $19.3 million and a $4.1 million loss on the disposition of certain assets by Klépierre, partially offset by a gain from the disposition of a property held in our TRG portfolio, our share of which was $10.6 million and a $4.6 million gain on excess insurance proceeds.  During 2023, we recorded an $11.2 million loss on the disposition of certain assets by Klépierre and an impairment on a joint venture property, our share of which was $8.6 million, partially offset by an $8.7 million gain on the disposition of certain assets by a joint venture investment and an $8.1 million gain on excess insurance proceeds.  \nSimon’s net income attributable to noncontrolling interests increased $24.2 million due to an increase in the net income of the Operating Partnership.\nYear Ended December 31, 2023 vs. Year Ended December 31, 2022\nLease income increased $259.2 million, due to an increase in fixed lease income of $286.7 million primarily due to an increase in fixed minimum lease consideration and higher occupancy, partially offset by a decrease in variable lease income based on tenant reported sales of $27.5 million.  \nTotal other income increased $99.1 million, primarily due to a $56.6 million increase in interest income, a $52.0 million increase in mixed use and franchise operations income, a $13.1 million increase in dividend and distribution income and a $3.7 million increase in Simon Brand Ventures, fee and other income, partially offset by a $17.0 million decrease in lease settlement income and a $9.3 million decrease in land sale activity.\nHome and regional office costs increased $23.0 million primarily due to increased personnel and compensation costs.\nOther expense increased $35.6 million primarily due to increased mixed use and franchise operations expenses of $50.8 million, partially offset by the 2022 write-off of $13.4 million in development costs related to an international development project in Germany we no longer intended to pursue.\nInterest expense increased $93.4 million primarily related to new USD bond issuances during 2023 of $69.5 million, activity with regards to the Credit Facilities of $24.5 million and $8.8 million from increased variable rates, partially offset by a USD bond payoff during 2023 of $14.7 million and a Euro bond payoff during 2022 of $9.8 million.\nDuring 2023, SPARC Group issued equity to a third party resulting in the dilution of our ownership to 33.3% and a deemed disposal of a proportional interest of our investment. As a result, we recognized a non-cash pre-tax gain on the deemed disposal of $145.8 million. During 2023, ABG completed multiple capital transactions which resulted in the dilution of our ownership and multiple deemed disposals of a proportional interest of our investment. As a result, we recognized non-cash pre-tax gains on the deemed disposals of $59.1 million. During 2023, we also recorded our share of the gain on the sale of a portion of our ABG interests of $157.1 million.  During 2022, we recorded a $159.0 million non-cash gain as a result of the sale to ABG of all of our interests in the Eddie Bauer licensing venture for additional interests in ABG, partially offset by a loss of $37.8 million on the revaluation or disposal of other investments.\nIncome and other tax expense decreased $1.6 million primarily related to the 2022 Eddie Bauer licensing transaction noted above of $39.7 million and an overall lower tax expense on our share of operating results from our other platform investments of approximately $27.2 million, partially offset by the tax impact of the SPARC and ABG transactions in 2023 noted above of $69.3 million.\nIncome from unconsolidated entities decreased $272.3 million primarily due to lower results of operations from our other platform investments. \nDuring 2023, we recorded an $11.2 million loss on the disposition of certain assets by Klépierre and an impairment on a joint venture property, our share of which was $8.6 million, partially offset by an $8.7 million gain on the disposition of certain assets by a joint venture investment and an $8.1 million gain on excess insurance proceeds.  During 2022, we recorded a $19.9 million gain on the disposition of one unconsolidated property, a $2.1 million gain related to excess insurance proceeds and a $1.3 million gain on the disposition of certain assets by Klépierre, partially offset by a $17.7 million loss primarily related to the disposition of one consolidated property.  \n67\n\n\nTable of Contents\nSimon’s net income attributable to noncontrolling interests increased $21.0 million due to an increase in the net income of the Operating Partnership.    \nLiquidity and Capital Resources\nBecause we own long-lived income-producing assets, our financing strategy relies primarily on long-term fixed rate debt. Floating rate debt comprised 0.9% of our total consolidated debt at December 31, 2024. We also enter into interest rate protection agreements from time to time to manage our interest rate risk. We derive most of our liquidity from positive net cash flow from operations and distributions of capital from unconsolidated entities that totaled $4.1 billion in the aggregate during 2024. The Credit Facilities and the Commercial Paper program provide alternative sources of liquidity as our cash needs vary from time to time. Borrowing capacity under these sources may be increased as discussed further below.\nOur balance of cash and cash equivalents increased $231.4 million during 2024 to $1.4 billion as of December 31, 2024 as further discussed below.\nOn December 31, 2024, we had an aggregate available borrowing capacity of approximately $8.2 billion under the Credit Facilities, net of letters of credit of $8.6 million. For the year ended December 31, 2024, the maximum aggregate outstanding balance under the Credit Facilities was $325.1 million and the weighted average outstanding balance was $311.1 million. The weighted average interest rate was 5.29% for the year ended December 31, 2024. \nSimon has historically had access to public equity markets and the Operating Partnership has historically had access to private and public, short and long-term unsecured debt markets and access to secured debt and private equity from institutional investors at the property level.\nOur business model and Simon’s status as a REIT require us to regularly access the debt markets to raise funds for acquisition, development and redevelopment activity, and to refinance maturing debt. Simon may also, from time to time, access the equity capital markets to accomplish our business objectives. We believe we have sufficient cash on hand and availability under the Credit Facilities and the Commercial Paper program to address our debt maturities and capital needs through 2025.\nCash Flows\nOur net cash flow from operating activities and distributions of capital from unconsolidated entities totaled $4.1 billion during 2024. In addition, we had net repayments of debt from our debt financing and repayment activities of $1.9 billion in 2024. These activities are further discussed below under “Financing and Debt.” During 2024, we also:\n●\npaid stockholder dividends and unitholder distributions totaling approximately $3.0 billion and preferred unit distributions totaling $4.9 million,\n●\nfunded consolidated capital expenditures of $755.6 million (including development and other costs of $75.3 million, redevelopment and expansion costs of $320.8 million, and tenant costs and other operational capital expenditures of $359.5 million),\n●\nfunded the redemption of $42.3 million Operating Partnership units,\n●\nfunded investments in unconsolidated entities of $112.7 million, \n●\nreceived net proceeds from the redemption of short-term investments of $1.0 billion,\n●\nreceived proceeds from the sale of equity instruments of $1.2 billion.\nIn general, we anticipate that cash generated from operations will be sufficient to meet operating expenses, monthly debt service, recurring capital expenditures, and dividends to stockholders and/or distributions to partners necessary to maintain Simon’s REIT qualification on a long-term basis.  In addition, we expect to be able to generate or obtain capital for nonrecurring capital expenditures, such as acquisitions, major building redevelopments and expansions, as well as for scheduled principal maturities on outstanding indebtedness, from the following, however a severe and prolonged disruption and instability in the global financial markets, including the debt and equity capital markets, may affect our ability to access necessary capital:\n●\nexcess cash generated from operating performance and working capital reserves,\n●\nborrowings on the Credit Facilities and Commercial Paper program,\n68\n\n\nTable of Contents\n●\nadditional secured or unsecured debt financing, or\n●\nadditional equity raised in the public or private markets.\nWe expect to generate positive cash flow from operations in 2025, and we consider these projected cash flows in our sources and uses of cash. These cash flows are principally derived from rents paid by our tenants. A significant deterioration in projected cash flows from operations, could cause us to increase our reliance on available funds from the Credit Facilities and Commercial Paper program, further curtail planned capital expenditures, or seek other additional sources of financing.\nFinancing and Debt\nUnsecured Debt\nAt December 31, 2024, our unsecured debt consisted of $19.1 billion of senior unsecured notes of the Operating Partnership and $323.7 million outstanding under the Credit Facility.  \nThe Credit Facility can be increased in the form of additional commitments in an aggregate not to exceed $1.0 billion, for a total aggregate size of $6.0 billion, subject to obtaining additional lender commitments and satisfying certain customary conditions precedent.  Borrowings may be denominated in U.S. dollars, Euro, Yen, Pounds, Sterling, Canadian dollars and Australian dollars. Borrowings in currencies other than the U.S. dollar are limited to 97% of the maximum revolving credit amount, as defined. The initial maturity date of the Credit Facility is June 30, 2027. The Credit Facility can be extended for two additional six-month periods to June 30, 2028, at our sole option, subject to satisfying certain customary conditions precedent. \nBorrowings under the Credit Facility bear interest, at our election, at either (i) (x) for Term Benchmark Loans, the Adjusted Term SOFR Rate, the applicable Local Rate, the Adjusted EURIBOR Rate, or the Adjusted TIBOR Rate, (y) for RFR Loans, if denominated in Sterling, SONIA plus a benchmark adjustment and if denominated in Dollars, Daily Simple SOFR plus a benchmark adjustment, or (z) for Daily SOFR Loans, the Adjusted Floating Overnight Daily SOFR Rate, in each case of clauses (x) through (z) above, plus a margin determined by our corporate credit rating of between 0.650% and 1.400% or (ii) for loans denominated in U.S. Dollars only, the base rate (which rate is equal to the greatest of the prime rate, the federal funds effective rate plus 0.500% or Adjusted Term SOFR Rate for one month plus 1.000%) (the “Base Rate”), plus a margin determined by our corporate credit rating of between 0.000% and 0.400%. The Credit Facility includes a facility fee determined by our corporate credit rating of between 0.100% and 0.300% on the aggregate revolving commitments under the Credit Facility.  Based upon our current credit ratings, the interest rate on the Credit Facility is SOFR plus 72.5 basis points, plus a spread adjustment to account for the transition from LIBOR to SOFR. \nThe Supplemental Facility, has a borrowing capacity of $3.5 to $4.5 billion during its term subject to obtaining additional lender commitments and satisfying certain customary conditions precedent and provides for borrowings denominated in U.S. dollars, Euro, Yen, Pounds, Sterling, Canadian dollars and Australian dollars. Borrowings in currencies other than the U.S. dollar are limited to 100% of the maximum revolving credit amount, as defined. The initial maturity date of the Supplemental Facility is January 31, 2029 and can be extended for an additional year to January 31, 2030 at our sole option, subject to satisfying certain customary conditions precedent.\nBorrowings under the Supplemental Facility bear interest, at the Company’s election, at either (i) (x) for Term Benchmark Loans, the Adjusted Term SOFR Rate, the applicable Local Rate, the Adjusted EURIBOR Rate, the Adjusted Term CORRA Rate, or the Adjusted TIBOR Rate, (y) for RFR Loans, if denominated in Sterling, SONIA plus a benchmark adjustment, if denominated in Dollars, Daily Simple SOFR plus a benchmark adjustment, and if denominated in Canadian Dollars, Daily Simple CORRA plus a benchmark adjustment or (z) for Daily SOFR Loans, the Adjusted Floating Overnight Daily SOFR Rate, in each case of clauses (x) through (z) above, plus a margin determined by the Company’s corporate credit rating of between 0.650% and 1.400% or (ii) for loans denominated in U.S. Dollars only, the base rate (which rate is equal to the greatest of the prime rate, the NYFRB Rate plus 0.500% or Adjusted Term SOFR Rate for one month plus 1.000%) (the “Base Rate”), plus a margin determined by the Company’s corporate credit rating of between 0.000% and 0.400%. The Supplemental Facility includes a facility fee determined by the Company’s corporate credit rating of between 0.100% and 0.300% on the aggregate revolving commitments under the Supplemental Facility. Based upon our current credit ratings, the interest rate on the Supplemental Facility is SOFR plus 72.5 basis points, plus a spread adjustment to account for the transition from LIBOR to SOFR.\nOn December 31, 2024 we had an aggregate available borrowing capacity of $8.2 billion under the Credit Facilities. The maximum aggregate outstanding balance under the Facilities during the year ended December 31, 2024 was $325.1 \n69\n\n\nTable of Contents\nmillion and the weighted average outstanding balance was $311.1 million. Letters of credit of $8.6 million were outstanding under the Facilities as of December 31, 2024.\nUnder the Commercial Paper program, the Operating Partnership may issue unsecured commercial paper notes, denominated in U.S. dollars, Euro and other currencies. Notes issued in non-U.S. currencies may be issued by one or more subsidiaries of the Operating Partnership and are guaranteed by the Operating Partnership.  Notes will be sold under customary terms in the U.S. and Euro commercial paper note markets and rank (either by themselves or as a result of the guarantee described above) \npari passu\n with the Operating Partnership's other unsecured senior indebtedness.  The Commercial Paper program is supported by the Credit Facilities, and if necessary or appropriate, we may make one or more draws under either of the Credit Facilities to pay amounts outstanding from time to time on the Commercial Paper program. On December 31, 2024, we had no outstanding balance under the Commercial Paper program.  Borrowings under the Commercial Paper program reduce amounts otherwise available under the Credit Facilities.\nOn January 10, 2023, the Operating Partnership completed interest rate swap agreements with a combined notional value at €750.0 million to swap the interest rate of the Euro denominated borrowings outstanding under the Supplemental Facility to an all-in fixed rate of 3.81%. These interest rate swaps were terminated in connection with the repayment of these borrowings on November 14, 2023.\nOn March 8, 2023, the Operating Partnership completed the issuance of the following senior unsecured notes: $650 million with a fixed interest rate 5.50%, and $650 million with a fixed interest rate of 5.85%, with maturity dates of March 8, 2033 and March 8, 2053, respectively. The Operating Partnership used a portion of the net proceeds of the offering to fund the optional redemption of its $500 million floating rate notes due January 2024 on March 13, 2023.\nOn April 28, 2023 the Operating Partnership completed a borrowing of $180.0 million under the Credit Facility and subsequently unencumbered two properties. \nOn June 1, 2023, the Operating Partnership completed the redemption, at par, of its $600 million 2.75% notes at maturity.\nOn  November 9, 2023, the Operating Partnership completed the issuance of the following senior unsecured notes: $500 million with a fixed interest rate of 6.25% and $500 million with a fixed interest rate of 6.65%, with maturity dates of January 15, 2034 and January 15, 2054, respectively. The proceeds were used to redeem, at par, its $600 million 3.75% notes at maturity on February 1, 2024.\nOn November 14, 2023, the Operating Partnership completed the issuance of €750.0 million senior unsecured bonds ($808.0 million U.S. dollar equivalent) with a maturity date of November 14, 2026 and a fixed interest rate of 3.50%.  The bonds are exchangeable into shares of Klépierre at the option of the holder of the bond at an initial common price of €27.2092.  We may elect to settle the exchange with cash instead of shares.  The proceeds were used to repay €750.0 million ($815.4 million U.S. dollar equivalent) outstanding under the Supplemental Facility on November 17, 2023. The exchangeable option within the bonds has been determined to meet the criteria for bifurcation.\nOn February 1, 2024, the Operating Partnership completed the redemption, at par, of its $600 million 3.75% senior unsecured notes at maturity.\nOn September 13, 2024, the Operating Partnership completed the redemption, at par, of its $1.0 billion 2.00% senior unsecured notes at maturity.\nOn September 26, 2024, the Operating Partnership completed the issuance of $1.0 billion senior unsecured notes with a fixed interest rate of 4.75% and a maturity date of September 26, 2034.\nOn October 1, 2024, the Operating Partnership completed the redemption, at par, of its $900.0 million 3.38% senior unsecured notes at maturity.\nMortgage Debt\nTotal mortgage indebtedness was $5.0 billion and $5.2 billion at December 31, 2024 and 2023, respectively.\nCovenants\nOur unsecured debt agreements contain financial covenants and other non-financial covenants. If we were to fail to comply with these covenants, after the expiration of the applicable cure periods, the debt maturity could be accelerated or other remedies could be sought by the lender, including adjustments to the applicable interest rate. As of December 31, 2024, we were in compliance with all covenants of our unsecured debt.\n70\n\n\nTable of Contents\nAt December 31, 2024, our consolidated subsidiaries were the borrowers under 35 non-recourse mortgage notes secured by mortgages on 38 properties and other assets, including two separate pools of cross-defaulted and cross-collateralized mortgages encumbering a total of five properties. Under these cross-default provisions, a default under any mortgage included in the cross-defaulted pool may constitute a default under all mortgages within that pool and may lead to acceleration of the indebtedness due on each property within the pool. Certain of our secured debt instruments contain financial and other non-financial covenants which are specific to the properties that serve as collateral for that debt. If the applicable borrower under these non-recourse mortgage notes were to fail to comply with these covenants, the lender could accelerate the debt and enforce its rights against their collateral. At December 31, 2024, the applicable borrowers under these non-recourse mortgage notes were in compliance with all covenants where non-compliance could individually or in the aggregate, giving effect to applicable cross-default provisions, have a material adverse effect on our financial condition, liquidity or results of operations.\nSummary of Financing\nOur consolidated debt, adjusted to reflect outstanding derivative instruments, and the effective weighted average interest rates as of December 31, 2024 and 2023, consisted of the following (dollars in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n​\n​\n    \nEffective\n    \n​\n​\n    \nEffective\n \n​\n​\nAdjusted Balance\n​\nWeighted\n​\nAdjusted \n​\nWeighted\n \n​\n​\nas of\n​\nAverage\n​\nBalance as of\n​\nAverage\n \nDebt Subject to\n​\nDecember 31, 2024\n \nInterest Rate(1)\n​\nDecember 31, 2023\n \nInterest Rate(1)\n​\nFixed Rate\n​\n$\n 24,035,060\n \n3.61%\n​\n$\n 25,705,396\n \n3.47%\n​\nVariable Rate\n​\n \n 229,435\n \n5.47%\n​\n \n 328,027\n \n5.91%\n​\n​\n​\n$\n 24,264,495\n \n3.62%\n​\n$\n 26,033,423\n \n3.49%\n​\n(1)\nEffective weighted average interest rate excludes the impact of net discounts and debt issuance costs.\nContractual Obligations and Off-balance Sheet Arrangements\nIn regards to long-term debt arrangements, the following table summarizes the material aspects of these future obligations on our consolidated indebtedness as of December 31, 2024, and subsequent years thereafter (dollars in thousands) assuming the obligations remain outstanding through initial maturities:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2025\n    \n2026-2027\n    \n2028-2029\n    \nAfter 2029\n    \nTotal\n \nLong Term Debt (1)\n​\n$\n 2,680,925\n​\n$\n 7,347,478\n​\n$\n 2,971,502\n​\n$\n 11,410,002\n​\n$\n 24,409,907\n​\nInterest Payments (2)\n​\n \n 861,872\n​\n \n 1,301,214\n​\n \n 1,009,746\n​\n \n 5,103,252\n​\n \n 8,276,084\n​\nLease Commitments (3)\n​\n \n 36,358\n​\n \n 72,773\n​\n \n 72,885\n​\n \n 923,037\n​\n \n 1,105,053\n​\n(1)\nRepresents principal maturities only and, therefore, excludes net discounts and debt issuance costs.\n(2)\nVariable rate interest payments are estimated based on the SOFR or other applicable rate at December 31, 2024.\n(3)\nRepresents only the minimum non-cancellable lease period, excluding applicable lease extension and renewal options, unless reasonably certain of exercise.\nOur off-balance sheet arrangements consist primarily of our investments in joint ventures which are common in the real estate industry and are described in Note 6 of the notes to the consolidated financial statements. Our joint ventures typically fund their cash needs through secured non-recourse debt financings obtained by and in the name of the joint venture entity. The joint venture debt is secured by a first mortgage, is without recourse to the joint venture partners, and does not represent a liability of the partners, except to the extent the partners or their affiliates expressly guarantee the joint venture debt. As of December 31, 2024, the Operating Partnership guaranteed joint venture-related mortgage indebtedness of $109.8 million. Mortgages guaranteed by the Operating Partnership are secured by the property of the joint venture which could be sold in order to satisfy the outstanding obligation and which has an estimated fair value in excess of the guaranteed amount. We may elect to fund cash needs of a joint venture through equity contributions (generally on a basis proportionate to our ownership interests), advances or partner loans, although such fundings are not required contractually or otherwise.\n71\n\n\nTable of Contents\nAcquisitions and Dispositions\nBuy-sell, marketing rights, and other exit mechanisms are common in real estate partnership agreements. Most of our partners are institutional investors who have a history of direct investment in retail real estate. We and our partners in our joint venture properties may initiate these provisions (subject to any applicable lock up or similar restrictions). If we determine it is in our best interests for us to purchase the joint venture interest and we believe we have adequate liquidity to execute the purchase without hindering our cash flows, then we may initiate these provisions or elect to buy our partner’s interest. If we decide to sell any of our joint venture interests, we expect to use the net proceeds to reduce outstanding indebtedness or to reinvest in development, redevelopment, or expansion opportunities.\nAcquisitions.  \nOn January 30, 2025, we completed the acquisition of a 100% interest in two luxury outlet destinations in Italy, one in Leccio, nearby Florence, and the other in Sanremo, on the Italian riviera.  The acquisition price was €350.0 million, subject to customary working capital adjustments. \nDuring the fourth quarter of 2024, we acquired the remaining interest in Smith Haven Mall from a joint venture partner, resulting in the consolidation of this property.  The cash consideration for this transaction was $56.1 million, which includes cash acquired of $35.8 million. The property was subject to a $160.8 million 8.10% variable rate mortgage loan.  This mortgage loan was paid off prior to December 31, 2024.  \nOn February 6, 2024 we acquired an additional interest in Miami International Mall from a joint venture partner, resulting in the consolidation of this property.  The cash consideration for this transaction was de minimis.  The property is subject to a $158.0 million 6.92% fixed rate mortgage loan.\nOn June 17, 2022, we acquired an additional interest in Gloucester Premium Outlets from a joint venture partner for $14.0 million in cash consideration, including a pro-rata share of working capital, resulting in the consolidation of this property. The property is subject to an $85.7 million 3.29% variable rate mortgage loan. We accounted for this transaction as an asset acquisition and substantially all of our investment has been determined to relate to investment property.  \nDispositions.\n  We may continue to pursue the disposition of properties that no longer meet our strategic criteria or that are not a primary retail venue within their trade area.\nDuring 2024, we disposed of our interests in two consolidated properties and one unconsolidated entity.  The combined total proceeds from these transactions were $55.2 million, resulting in a net loss of $67.2 million.\nDuring 2023, we disposed of our interest in one unconsolidated retail property through foreclosure in satisfaction of the $114.8 million non-recourse mortgage loan.  We recognized no gain or loss in connection with this disposal.\nDuring 2022, we disposed of our interest in one consolidated retail property. The proceeds from this transaction were $59.0 million, resulting in a loss of $15.6 million. We also recorded a non-cash gain of $19.9 million related to the disposition of one unconsolidated retail property in satisfaction of its $99.6 million non-recourse mortgage loan. These are included in (loss) gain on acquisition of controlling interest, sale or disposal of, or recovery on, assets and interest in unconsolidated entities and impairment, net in the accompanying consolidated statement of operations and comprehensive income.\n​\nJoint Venture Formation Activity and Other Investment Activity\nDuring the fourth quarter of 2024, J.C. Penney completed an all-equity transaction where it acquired the retail operations of SPARC Group, resulting in the recognition of a non-cash pre-tax gain by SPARC Holdings, our share of which, after eliminations, was $100.5 million, which is included in gain due to disposal, exchange, or revaluation of equity interests, net in the consolidated statement of operations and comprehensive income. The combined business was renamed Catalyst post transaction. This non-cash investment activity is excluded from our consolidated statement of cash flows. In connection with this transaction, we recorded deferred taxes of $25.1 million, which is included in income and other tax expense in the consolidated statement of operations and comprehensive income. As of December 31, 2024, we own a 31.3% noncontrolling interest in Catalyst. Additionally, we continue to hold a 33.3% noncontrolling interest in SPARC Holdings, the former owner of SPARC Group, which now primarily holds a 25% interest in Catalyst.\nDuring the second quarter of 2024, we participated in the formation of a joint venture, Phoenix Retail, LLC, to acquire the Express Retail Company from the previous owner on June 21, 2024, in a bankruptcy proceeding, and operate Express \n72\n\n\nTable of Contents\nand Bonobos direct-to-consumer business in the United States. There was no cash consideration transferred for our 39.4%, non-controlling interest and non-cash consideration was de minimis.\nDuring the first quarter of 2024, we sold all of our remaining interest in ABG for cash proceeds of $1.2 billion, resulting in a pre-tax gain of $414.8 million, which is included in gain due to disposal, exchange, or revaluation of equity interests, net, in the consolidated statement of operations. In connection with this transaction, we recorded tax expense of $103.7 million, which is included in income and other expense in the consolidated statement of operations.\nDuring the fourth quarter of 2023, we sold a portion of our interest in ABG, resulting in a pre-tax gain of $157.1 million, which is included in gain due to disposal, exchange, or revaluation of equity interests, net, in the consolidated statement of operations. In connection with this transaction, we recorded tax expense of $39.3 million which is included in income and other tax expense in the consolidated statement of operations and comprehensive income. Concurrently, ABG completed a capital transaction resulting in the dilution of our ownership to approximately 9.6% and a deemed disposal of a proportional interest of our investment. As a result, we recognized a non-cash pre-tax gain on the deemed disposal of $10.3 million, which is included in gain due to disposal, exchange, or revaluation of equity interests, net in the consolidated statement of operations and comprehensive income. This non-cash investing activity is excluded from our consolidated statement of cash flows. In connection with this transaction, we recorded deferred taxes of $2.6 million, which is included in income and other tax expense in the consolidated statement of operations and comprehensive income.\nDuring the fourth quarter of 2024, we acquired an additional 4% ownership in TRG for approximately $266.7 million by issuing 1,572,500 units in the Operating Partnership, bringing our noncontrolling ownership interest in TRG to 88%. In the third quarter of 2023, we acquired an additional 4% ownership in TRG for approximately $199.6 million by issuing 1,725,000 units in the Operating Partnership.  Neither transaction included or resulted in any change to the rights and obligations or decision making authority of the members of the TRG partnership.\nDuring the third quarter of 2023, ABG completed a capital transaction resulting in the dilution of our ownership from approximately 11.8% to approximately 11.7% and a deemed disposal of a proportional interest of our investment. As a result, we recognized a non-cash pre-tax gain on the deemed disposal of $12.4 million, which is included in gain due to disposal, exchange, or revaluation of equity interests, net in the consolidated statement of operations and comprehensive income. This non-cash investing activity is excluded from our consolidated statement of cash flows. In connection with this transaction, we recorded deferred taxes of $3.1 million, which is included in income and other tax expense in the consolidated statement of operations and comprehensive income. \nDuring the second quarter of 2023, ABG completed a capital transaction resulting in a dilution of our ownership and a deemed disposal of a proportional interest of our investment. As a result, we recognized a non-cash pre-tax gain on the deemed disposal of $36.4 million, which is included in gain due to disposal, exchange, or revaluation of equity interests, net in the consolidated statement of operations and comprehensive income. This non-cash investing activity is excluded from our consolidated statement of cash flows. In connection with this transaction, we recorded deferred taxes of $9.1 million, which is included in income and other tax expense in the consolidated statement of operations and comprehensive income.\nDuring the third quarter of 2023, SPARC Group issued equity to a third party resulting in the dilution of our ownership to 33.3% and a deemed disposal of a proportional interest of our investment. As a result, we recognized a non-cash pre-tax gain on the deemed disposal of $145.8 million, which is included in gain due to disposal, exchange, or revaluation of equity interests, net in the consolidated statement of operations and comprehensive income. This non-cash investing activity is excluded from our consolidated statement of cash flows. In connection with this transaction, we recorded deferred taxes of $36.9 million, which is included in income and other tax expense in the consolidated statement of operations and comprehensive income.\nOn December 19, 2022, we completed the acquisition of a 50% noncontrolling legal ownership interest in Jamestown, a global real estate investment and asset management company, as well as separate interests in certain real estate and working capital, for total cash consideration of $173.4 million.\nDuring the fourth quarter of 2022, we sold to ABG our interests in the licensing venture of Eddie Bauer for additional interests in ABG. As a result, in the fourth quarter of 2022, we recognized a non-cash pre-tax gain of $159.0 million, representing the difference between the fair value of the interests received and the $98.8 million carrying value of the intellectual property licensing venture less costs to sell. On July 1, 2021, we sold to ABG all of our interests in both the Forever 21 and Brooks Brothers licensing ventures for additional interests in ABG. As a result, in the third quarter of 2021, we recognized a non-cash pre-tax gain of $159.8 million, representing the difference between the fair value of the interests received and the $102.7 million carrying value of the intellectual property licensing ventures less costs to sell. On \n73\n\n\nTable of Contents\nDecember 20, 2021, we sold a portion of our interest in ABG, resulting in a pre-tax gain of $18.8 million. In connection with this transaction, we recorded tax expense of $8.0 million which is included in income and other tax expense in the consolidated statement of operations and comprehensive income. Subsequently, we acquired additional interests in ABG for cash consideration of $100.0 million. \nDuring the first quarter of 2022, SPARC Group acquired certain assets and operations of Reebok and entered into a long-term strategic partnership with ABG to become the core licensee and operating partner for Reebok in the United States.\nDevelopment Activity\nWe routinely incur costs related to construction for significant redevelopment and expansion projects at our properties. Redevelopment and expansion projects, including the addition of anchors, big box tenants, and restaurants are underway at several properties in North America, Europe, and Asia.\nConstruction continues on certain redevelopment and new development projects in the U.S. and internationally that are nearing completion.  Our share of the costs of all new development, redevelopment and expansion projects currently under construction is approximately $1.3 billion.  Simon’s share of remaining net cash funding required to complete the new development and redevelopment projects currently under construction is approximately $552 million.  We expect to fund these capital projects with cash flows from operations. We seek a stabilized return on invested capital in the range of 8-10% for all of our new development, expansion and redevelopment projects.\nSummary of Capital Expenditures.\n  The following table summarizes total capital expenditures on consolidated properties on a cash basis (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\n    \n2022\n \nNew Developments\n​\n$\n 75\n​\n$\n 156\n​\n$\n 108\n​\nRedevelopments and Expansions\n​\n \n 321\n​\n \n 328\n​\n \n 283\n​\nTenant Allowances\n​\n \n 191\n​\n \n 209\n​\n \n 207\n​\nOperational Capital Expenditures\n​\n \n 169\n​\n \n 100\n​\n \n 52\n​\nTotal\n​\n$\n 756\n​\n$\n 793\n​\n$\n 650\n​\n​\n​\nInternational Development Activity\n  \nWe typically reinvest net cash flow from our international joint ventures to fund future international development activity. We believe this strategy mitigates some of the risk of our initial investment and our exposure to changes in foreign currencies. We have also funded most of our foreign investments with local currency-denominated borrowings that act as a natural hedge against fluctuations in exchange rates. Our consolidated net income exposure to changes in the volatility of the Euro, Yen, Peso, Won, and other foreign currencies is not material. We expect our share of estimated committed capital for international development projects to be completed with projected delivery in 2025 or 2026 is $12 million, primarily funded through reinvested joint venture cash flow and construction loans.\nThe following table describes recently completed and new development and expansion projects as well as our share of the estimated total cost as of December 31, 2024 (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nGross\n​\nOur\n​\nOur Share of\n​\nOur Share of\n​\nProjected/Actual\n​\n​\n​\n​\nLeasable\n​\nOwnership\n​\nProjected Net Cost\n​\nProjected Net Cost\n​\nOpening\nProperty\n   \nLocation\n   \nArea (sqft)\n   \nPercentage\n   \n(in Local Currency)\n   \n(in USD) (1)\n   \nDate\nNew Development Projects:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nJakarta Premium Outlets\n​\nJakarta, Indonesia\n​\n 300,000\n​\n50%\n​\nIDR\n 931,782\n​\n$\n 57.5\n​\nMar. - 2025\nExpansion:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nBusan Premium Outlet Phase 2\n​\nBusan, South Korea\n​\n 184,000\n​\n50%\n​\nKRW\n 72,933\n​\n$\n 49.4\n​\nOpened Sep. - 2024\n(1)\nUSD equivalent based upon December 31, 2024 foreign currency exchange rates.\nDividends, Distributions and Stock Repurchase Program\nSimon paid a common stock dividend of $2.10 per share in the fourth quarter of 2024 and $8.10 per share for the year ended December 31, 2024. The Operating Partnership paid distributions per unit for the same amounts. In 2023, Simon paid dividends of $1.90 and $7.45 per share for the three and twelve month periods ended December 31, 2023, \n74\n\n\nTable of Contents\nrespectively. The Operating Partnership paid distributions per unit for the same amounts. On February 4, 2025, Simon’s Board of Directors declared a quarterly cash dividend for the first quarter of 2025 of $2.10 per share, payable on March 31, 2025 to shareholders of record on March 10, 2025.  The distribution rate on units is equal to the dividend rate on common stock. In order to maintain its status as a REIT, Simon must pay a minimum amount of dividends. Simon’s future dividends and the Operating Partnership’s future distributions will be determined by Simon’s Board of Directors, in its sole discretion, based on actual and projected financial condition, liquidity and results of operations, cash available for dividends and limited partner distributions, cash reserves as deemed necessary for capital and operating expenditures, financing covenants, if any, and the amount required to maintain Simon’s status as a REIT.\nOn May 9, 2022, Simon’s Board of Directors authorized a common stock repurchase plan commencing on May 16, 2022.  Under the program, the Company could purchase up to $2.0 billion of its common stock during the two-year period ending May 16, 2024 in open market or privately negotiated transactions, at prices that the Company deemed appropriate and subject to market conditions, applicable law, and other factors deemed relevant in the Company’s sole discretion.  During the year ended December 31, 2023, Simon purchased 1,273,733 shares at an average price of $110.38 per share.  During the year ended December 31, 2022, Simon purchased 1,830,022 shares at an average price of $98.57 per share.  As Simon repurchased shares under this program, the Operating Partnership repurchased an equal number of units from Simon.    \nOn February 8, 2024, Simon’s Board of Directors authorized a new common stock repurchase program which immediately replaced the prior repurchase program, where the Company may purchase up to $2.0 billion of its common stock over the next 24 months.  As of December 31, 2024, no shares had been purchased under the plan.  As Simon repurchases shares under this program, the Operating Partnership repurchases an equal number of units from Simon.   \nForward-Looking Statements\nCertain statements made in this annual report on Form 10-K may be deemed \"forward–looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995. Although the Company believes the expectations reflected in any forward–looking statements are based on reasonable assumptions, the Company can give no assurance that its expectations will be attained, and it is possible that the Company's actual results may differ materially from those indicated by these forward–looking statements due to a variety of risks, uncertainties, and other factors. Such factors include, but are not limited to: the intensely competitive market environment in the retail industry, including e-commerce; the inability to renew leases and relet vacant space at existing properties on favorable terms;  the inability to collect rent due to the bankruptcy or insolvency of tenants or otherwise; the potential loss of anchor stores or major tenants; an increase in vacant space at our properties; the loss of key management personnel; changes in economic and market conditions that may adversely affect the general retail environment, including but not limited to those caused by inflation, recessionary pressures, wars, escalating geopolitical tensions as a result of the war in Ukraine and the conflicts in the Middle East, and supply chain disruptions; the potential for violence, civil unrest, criminal activity or terrorist activities at our properties;  the availability of comprehensive insurance coverage; security breaches that could compromise our information technology or infrastructure; changes in market rates of interest; our international activities subjecting us to risks that are different from or greater than those associated with our domestic operations, including changes in foreign exchange rates; the impact of our substantial indebtedness on our future operations, including covenants in the governing agreements that impose restrictions on us that may affect our ability to operate freely; any disruption in the financial markets that may adversely affect our ability to access capital for growth and satisfy our ongoing debt service requirements; any change in our credit rating; our continued ability to maintain our status as a REIT; changes in tax laws or regulations that result in adverse tax consequences; risks associated with the acquisition, development, redevelopment, expansion, leasing and management of properties; the inability to lease newly developed properties on favorable terms; risks relating to our joint venture properties, including guarantees of certain joint venture indebtedness; reducing emissions of greenhouse gases; environmental liabilities; natural disasters; uncertainties regarding the impact of pandemics, epidemics or public health crises, and the associated governmental restrictions on our business, financial condition, results of operations, cash flow and liquidity; and general risks related to real estate investments, including the illiquidity of real estate investments.  The Company discusses these and other risks and uncertainties under the heading \"Risk Factors\" in Part 1, Item 1A of this Annual Report on Form 10-K.  The Company may update that discussion in subsequent other periodic reports, but except as required by law, the Company undertakes no duty or obligation to update or revise these forward-looking statements, whether as a result of new information, future developments, or otherwise.  \nNon-GAAP Financial Measures\nIndustry practice is to evaluate real estate properties in part based on performance measures such as FFO, real estate FFO, diluted FFO per share, real estate FFO per share, NOI, beneficial interest of combined NOI and portfolio NOI. We believe that these non-GAAP measures are helpful to investors because they are widely recognized measures of the \n75\n\n\nTable of Contents\nperformance of REITs and provide a relevant basis for comparison among REITs. We also use these measures internally to measure the operating performance of our portfolio. We are providing different components of NOI, such as Portfolio NOI (a component of beneficial interest of combined NOI that relates to the operational performance of our global real estate portfolio), to provide investors with disaggregated information to further differentiate our global real estate portfolio performance from corporate and other platform investments.\nWe determine FFO based upon the definition set forth by the National Association of Real Estate Investment Trusts (“NAREIT”) Funds From Operations White Paper – 2018 Restatement.  Our main business includes acquiring, owning, operating, developing, and redeveloping real estate in conjunction with the rental of real estate.  Gains and losses of assets incidental to our main business are included in FFO.  We determine FFO to be our share of consolidated net income computed in accordance with GAAP:\n●\nexcluding real estate related depreciation and amortization,\n●\nexcluding gains and losses from extraordinary items,\n●\nexcluding gains and losses from the acquisition of controlling interest, sale, disposal or property insurance recoveries of, or any impairment related to, depreciable retail operating properties,\n●\nplus the allocable portion of FFO of unconsolidated joint ventures based upon economic ownership interest, and\n●\nall determined on a consistent basis in accordance with GAAP.\nWe determine real estate FFO utilizing the definition of FFO as stated above excluding the impact of operations from\n●\nother platform investments, net of tax,\n●\ngain due to disposal, exchange, or revaluation of equity interests, net of tax, and\n●\nunrealized gains or losses in fair value of publicly traded equity instruments and derivative instrument.\nYou should understand that our computations of these non-GAAP measures might not be comparable to similar measures reported by other REITs and that these non-GAAP measures:\n●\ndo not represent cash flow from operations as defined by GAAP,\n●\nshould not be considered as an alternative to net income determined in accordance with GAAP as a measure of operating performance, and\n●\nare not an alternative to cash flows as a measure of liquidity.\n76\n\n\nTable of Contents\nThe following schedule reconciles total FFO and real estate FFO to consolidated net income and, for Simon, diluted net income per share to diluted FFO per share and real estate FFO per share.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n        \n2024\n    \n2023\n    \n2022\n​\n​\n​\n(in thousands)\nConsolidated Net Income\n​\n​\n$\n 2,729,021\n​\n$\n 2,617,018\n​\n$\n 2,452,385\nAdjustments to Arrive at FFO:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDepreciation and amortization from consolidated properties\n​\n​\n \n 1,250,440\n​\n \n 1,250,550\n​\n \n 1,214,441\nOur share of depreciation and amortization from unconsolidated entities, including Klépierre, TRG and other corporate investments\n​\n​\n \n 848,188\n​\n \n 841,862\n​\n \n 845,784\nLoss (gain) on acquisition of controlling interest, sale or disposal of, or recovery on, assets and interests in unconsolidated entities and impairment, net \n​\n​\n \n 75,818\n​\n \n 3,056\n​\n \n (5,647)\nNet loss (income) attributable to noncontrolling interest holders in properties\n​\n​\n \n 1,641\n​\n \n 1,336\n​\n \n (2,738)\nNoncontrolling interests portion of depreciation and amortization, gain on consolidation of properties, and gain on disposal of properties\n​\n​\n \n (23,367)\n​\n \n (22,719)\n​\n \n (18,234)\nPreferred distributions and dividends\n​\n​\n \n (4,897)\n​\n \n (5,237)\n​\n \n (5,252)\nFFO of the Operating Partnership\n​\n​\n$\n 4,876,844\n​\n$\n 4,685,866\n​\n$\n 4,480,739\nFFO allocable to limited partners\n​\n​\n​\n 640,886\n​\n​\n 597,727\n​\n​\n 564,946\nDilutive FFO allocable to common stockholders\n​\n​\n$\n 4,235,958\n​\n$\n 4,088,139\n​\n$\n 3,915,793\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFFO of the Operating Partnership\n​\n​\n​\n 4,876,844\n​\n​\n 4,685,866\n​\n​\n 4,480,739\nGain due to disposal, exchange, or revaluation of equity interests, net of tax\n​\n​\n​\n (386,417)\n​\n​\n (271,009)\n​\n​\n (88,314)\nOther platform investments, net of tax\n​\n​\n​\n 88,902\n​\n​\n 6,166\n​\n​\n (181,262)\nUnrealized losses (gains) in fair value of publicly traded equity instruments and derivative instrument, net\n​\n​\n​\n 17,392\n​\n​\n (11,892)\n​\n​\n 61,204\nReal Estate FFO\n​\n​\n$\n 4,596,721\n​\n$\n 4,409,131\n​\n$\n 4,272,367\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDiluted net income per share to diluted FFO per share reconciliation:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDiluted net income per share\n​\n​\n$\n 7.26\n​\n$\n 6.98\n​\n$\n 6.52\nDepreciation and amortization from consolidated properties and our share of depreciation and amortization from unconsolidated entities, including Klépierre, TRG and other corporate investments, net of noncontrolling interests portion of depreciation and amortization\n​\n​\n \n 5.53\n​\n \n 5.52\n​\n \n 5.44\nLoss (gain) on acquisition of controlling interest, sale or disposal of, or recovery on, assets and interests in unconsolidated entities and impairment, net\n​\n​\n \n 0.20\n​\n \n 0.01\n​\n \n (0.01)\nDiluted FFO per share\n​\n​\n$\n 12.99\n​\n$\n 12.51\n​\n$\n 11.95\nGain due to disposal, exchange, or revaluation of equity interests, net of tax\n​\n​\n​\n (1.03)\n​\n​\n (0.72)\n​\n$\n (0.24)\nOther platform investments, net of tax\n​\n​\n​\n 0.23\n​\n​\n 0.02\n​\n​\n (0.48)\nUnrealized losses (gains) in fair value of publicly traded equity instruments and derivative instrument, net\n​\n​\n​\n 0.05\n​\n​\n (0.03)\n​\n​\n 0.16\nReal Estate FFO per share\n​\n​\n$\n 12.24\n​\n$\n 11.78\n​\n$\n 11.39\nBasic and Diluted weighted average shares outstanding\n​\n​\n \n 326,097\n​\n \n 326,808\n​\n \n 327,817\nWeighted average limited partnership units outstanding\n​\n​\n \n 49,338\n​\n \n 47,782\n​\n \n 47,295\nBasic and Diluted weighted average shares and units outstanding\n​\n​\n \n 375,435\n​\n \n 374,590\n​\n \n 375,112\n​\n77\n\n\nTable of Contents\nThe following schedule reconciles consolidated net income to our beneficial share of NOI.\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the Year\n​\n​\nEnded December 31, \n​\n \n   \n2024\n \n   \n2023\n​\n​\n(in thousands)\nReconciliation of NOI of consolidated entities:\n​\n​\n \n    \n​\n​\nConsolidated Net Income\n​\n$\n 2,729,021\n​\n$\n 2,617,018\nIncome and other tax expense\n​\n \n 23,262\n​\n \n 81,874\nGain due to disposal, exchange, or revaluation of equity interests, net\n​\n​\n (451,172)\n​\n​\n (362,019)\nInterest expense\n​\n \n 905,797\n​\n \n 854,648\nIncome from unconsolidated entities\n​\n \n (207,322)\n​\n \n (375,663)\nUnrealized losses (gains) in fair value of publicly traded equity instruments and derivative instrument, net\n​\n \n 17,392\n​\n \n (11,892)\nLoss on acquisition of controlling interest, sale or disposal of, or recovery on, assets and interests in unconsolidated entities and impairment, net\n​\n \n 75,818\n​\n \n 3,056\nOperating Income Before Other Items\n​\n \n 3,092,796\n​\n \n 2,807,022\nDepreciation and amortization\n​\n \n 1,265,340\n​\n \n 1,262,107\nHome and regional office costs\n​\n​\n 223,277\n​\n​\n 207,618\nGeneral and administrative\n​\n​\n 44,743\n​\n​\n 38,513\nOther expenses (1)\n​\n​\n 818\n​\n​\n 320\nNOI of consolidated entities\n​\n$\n 4,626,974\n​\n$\n 4,315,580\nLess: Noncontrolling interest partners share of NOI\n​\n​\n (32,605)\n​\n​\n (30,918)\nBeneficial NOI of consolidated entities\n​\n$\n 4,594,369\n​\n$\n 4,284,662\nReconciliation of NOI of unconsolidated entities:\n​\n​\n​\n​\n​\n​\nNet Income\n​\n$\n 707,246\n​\n$\n 853,986\nInterest expense\n​\n \n 711,402\n​\n \n 685,193\nLoss (gain) on sale or disposal of, or recovery on, assets and interests in unconsolidated entities, net\n​\n \n 36,536\n​\n \n (20,529)\nOperating Income Before Other Items\n​\n \n 1,455,184\n​\n \n 1,518,650\nDepreciation and amortization\n​\n \n 636,218\n​\n \n 656,089\nOther expenses (2)\n​\n​\n 73,152\n​\n​\n 143\nNOI of unconsolidated entities\n​\n$\n 2,164,554\n​\n$\n 2,174,882\nLess: Joint Venture partners share of NOI\n​\n​\n (1,134,573)\n​\n​\n (1,132,334)\nBeneficial NOI of unconsolidated entities\n​\n$\n 1,029,981\n​\n$\n 1,042,548\nAdd: \nBeneficial interest of NOI from TRG\n​\n​\n 533,009\n​\n​\n 503,858\nAdd: Beneficial interest of NOI from other platform investments and investments\n​\n​\n 208,043\n​\n​\n 399,341\nBeneficial interest of Combined NOI\n​\n$\n 6,365,402\n​\n$\n 6,230,409\nLess: Beneficial interest of Corporate and Other NOI Sources (3)\n​\n \n 319,090\n​\n \n 319,830\nLess: Beneficial interest of NOI from other platform investments (4)\n​\n​\n (33,977)\n​\n​\n 91,303\nLess: Beneficial interest of NOI from Investments (5)\n​\n​\n 239,063\n​\n​\n 232,919\nBeneficial interest of Portfolio NOI\n​\n$\n 5,841,226\n​\n$\n 5,586,357\nBeneficial interest of Portfolio NOI Change\n​\n​\n 4.6\n%  \n​\n​\n(1)\nRepresents the write-off of pre-development costs in consolidated entities.   \n(2)\nRepresents the gross amount of write-offs at unconsolidated entities of pre-development costs, our share of which was $57.0 million and $0.1 million, including costs that SPG has capitalized outside of the venture, for the year ended December 31, 2024 and 2023, respectively.\n(3)\nIncludes income components excluded from portfolio NOI and domestic property NOI (domestic lease termination income, interest income, land sale gains, straight line lease income, above/below market lease adjustments), Simon \n78\n\n\nTable of Contents\nmanagement company revenues, foreign exchange impact, and other assets. \n(4)\nOther platform investments include retail operations (Catalyst), an e-commerce company (Rue Gilt Groupe, or RGG), and a global real estate investment and management company (Jamestown).\n(5)\nIncludes our share of NOI of Klépierre (at constant currency) and other corporate investments.",
  "item2": null
}