{
  "source_file": "spgi-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (Unaudited)\nThe following Management’s Discussion and Analysis (“MD&A”) provides a narrative of the results of operations and financial condition of S&P Global Inc. (together with its consolidated subsidiaries, “S&P Global,” the “Company,” “we,” “us” or “our”) for the three and nine months ended September 30, 2025. The MD&A should be read in conjunction with the consolidated financial statements, accompanying notes and MD&A included in our Form 10-K for the year ended December 31, 2024 (our “Form 10-K”), which have been prepared in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”). The MD&A includes the following sections:\n•\nOverview\n•\nResults of Operations — Comparing the Three and Nine Months Ended September 30, 2025 and 2024 \n•\nLiquidity and Capital Resources\n•\nReconciliation of Non-GAAP Financial Information\n•\nCritical Accounting Estimates\n•\nRecently Issued or Adopted Accounting Standards\n•\nForward-Looking Statements\n \nOVERVIEW\n \nWe are a provider of credit ratings, benchmarks, analytics and workflow solutions in the global capital, commodity and automotive \nmarkets. The capital markets include asset managers, investment banks, commercial banks, insurance companies, exchanges, trading firms and issuers; the commodity markets include producers, consumers, traders and intermediaries within energy, chemicals, shipping, metals, carbon and agriculture; and the automotive markets include manufacturers, suppliers, dealerships, service shops and customers. \nOur operations consist of five reportable segments: S&P Global Market Intelligence (“Market Intelligence”), S&P Global Ratings (“Ratings”), S&P Global Commodity Insights (“Commodity Insights”), S&P Global Mobility (“Mobility”) and S&P Dow Jones Indices (“Indices”).\n•\nMarket Intelligence is a global provider of multi-asset-class data and analytics integrated with purpose-built workflow solutions.\n•\nRatings is an independent provider of credit ratings, research, and analytics, offering investors and other market participants information, ratings and benchmarks.\n•\nCommodity Insights is a leading independent provider of information and benchmark prices for the commodity and energy markets.\n•\nMobility is a leading provider of solutions serving the full automotive value chain including vehicle manufacturers (Original Equipment Manufacturers or OEMs), automotive suppliers, mobility service providers, retailers, consumers, and finance and insurance companies. \n•\nIndices is a global index provider maintaining a wide variety of valuation and index benchmarks for investment advisors, wealth managers and institutional investors.\nOn April 29, 2025, we announced that our Board of Directors decided to pursue a full separation of our Mobility segment, creating a new publicly traded company. The transaction, which would be implemented through the spin-off of shares of the new company to S&P Global shareholders, is expected to be tax-free for U.S. federal income tax purposes for S&P Global shareholders and is expected to be completed over the 12 to 18 months from its announcement, subject to the satisfaction of customary legal and regulatory requirements and approvals.\n33\nKey results for the periods ended September 30 are as follows:\n(in millions, except per share amounts)\nThree Months\nNine Months\n2025\n2024\n% Change \n1\n2025\n2024\n% Change \n1\nRevenue\n$\n3,888 \n$\n3,575 \n9%\n$\n11,420 \n$\n10,616 \n8%\nOperating profit \n2\n$\n1,675 \n$\n1,434 \n17%\n$\n4,804 \n$\n4,271 \n12%\nOperating margin %\n43 \n%\n40 \n%\n42 \n%\n40 \n%\nDiluted earnings per share from net income\n$\n3.86 \n$\n3.11 \n24%\n$\n10.90 \n$\n9.50 \n15%\n1 \n    \n% changes in the tables throughout the MD&A are calculated off of the actual number, not the rounded number presented. \n2\n  Operating profit for the \nthree and nine\n months ended September 30, 2025 includes employee severance charges of $23 million and $105 million, respectively, acquisition-related costs of $18 million and $39 million, respectively, legal costs of $10 million and $39 million, respectively, disposition-related costs of $7 million and $12 million, respectively, Executive Leadership Team transition costs of $6 million and $23 million, respectively and lease impairments of $6 million and $14 million, respectively. Operating profit for the three and nine months ended September 30, 2024 includes IHS Markit merger costs of $31 million and $102 million, respectively, a gain on disposition of $21 million, a statutorily required bonus accrual adjustment of $7 million, employee severance charges of $4 million and $50 million, respectively, acquisition-related costs of $3 million and net acquisition-related costs of $4 million, respectively, and an asset write-off of $1 million and $2 million, respectively. Operating profit for the nine months ended September 30, 2024 includes legal costs of $20 million, disposition-related costs of $3 million and recovery of lease-related costs of $1 million. Operating profit also includes amortization of intangibles from acquisitions of $280 million and $285 million for the three months ended September 30, 2025 and 2024, respectively, and $843 million and $845 million for the nine months ended September 30, 2025 and 2024, respectively.\nThree Months\nRevenue increased 9% driven by increases at all of our reportable segments. The increase at Ratings was driven by growth in both transaction and non-transaction revenue. Transaction revenue increased primarily due to growth in corporate bond ratings revenue and structured finance revenue driven by increases in issuance volumes. Non-transaction revenue increased primarily due to an increase in surveillance revenue and an increase in revenue at our Crisil subsidiary. The increase at Market Intelligence was primarily due to subscription revenue growth in Data, Analytics & Insights, growth for work flow solutions in Enterprise Solutions and growth in RatingsXpress® and RatingsDirect®, partially offset by the unfavorable impact of the sale of Fincentric in August of 2024. The increase at Indices was primarily due to higher asset-linked fees revenue and higher data subscription revenue. The increase at Commodity Insights was primarily due to continued demand for market data and market insights products driven by expanded product offerings to our existing customers under enterprise use contracts and an increase in sales usage-based royalties revenue. The increase at Mobility was primarily due to growth within the Dealer and Financial businesses driven by continued new business growth within the Dealer business, strong underwriting volumes and market share growth within the Financial business, and the favorable impact of improved contract terms. Foreign exchange rates had a favorable impact of 1 percentage point.\nOperating profit increased 17%. Excluding the impact of higher IHS Markit merger costs in 2024 of 1 percentage point, operating profit increased 16%. The increase was primarily due to revenue growth and decreased incentives, partially offset by higher compensation costs driven by annual merit increases and additional headcount, and investments in strategic initiatives. Foreign exchange rates had a favorable impact of 2 percentage points.\nNine Months\nRevenue increased 8% driven by increases at all of our reportable segments. The increase at Ratings was driven by growth in both non-transaction and transaction revenue. Non-transaction revenue increased primarily due to an increase in surveillance revenue and an increase in revenue at our Crisil subsidiary. Transaction revenue increased due to higher corporate bond ratings revenue, partially offset by lower bank loan ratings revenue. The increase at Market Intelligence was primarily due to subscription revenue growth in Data, Analytics & Insights which was favorably impacted by the acquisition of Visible Alpha in May of 2024, growth for work flow solutions in Enterprise Solutions and growth in RatingsXpress® and RatingsDirect®, partially offset by the unfavorable impact of the sale of Fincentric in August of 2024. The increase at Indices was primarily due to higher asset-linked fees revenue, higher exchange-traded derivative revenue and higher data subscription revenue. The increase at Commodity Insights was primarily due to continued demand for market data and market insights products driven by expanded product offerings to our existing customers under enterprise use contracts, an increase in conference revenue driven by increased attendance at CERAWeek in 2025 and an increase in sales usage-based royalties revenue. The increase at Mobility was primarily due to growth within the Dealer and Financial businesses driven by continued new business growth within the \n34\nDealer business, strong underwriting volumes and market share growth within the Financial business and the favorable impact of  improved contract terms. Foreign exchange rates had a favorable impact of 1 percentage point.\nOperating profit increased 12%. Excluding the impact of higher IHS Markit merger costs in 2024 of 2 percentage points, partially offset by the impact of higher employee severance charges in 2025 of 1 percentage, operating profit increased 11%. The increase was primarily due to revenue growth and decreased incentives, partially offset by higher compensation costs driven by annual merit increases and additional headcount, and investments in strategic initiatives. Foreign exchange rates had an favorable impact of less than 1 percentage point.\nOur Strategy\nWe are a provider of credit ratings, benchmarks, analytics and workflow solutions in the global capital, commodity and automotive markets. Our purpose is to accelerate progress. We seek to deliver on this purpose in line with our core values of integrity, discovery and partnership.\nPowering Global Markets is the framework for our forward-looking business strategy. Through this framework, we seek to deliver an exceptional, differentiated customer experience by enhancing our foundational capabilities, evolving and growing our core businesses, and pursuing growth via adjacencies. In 2025, we are striving to deliver on our strategic priorities in the following key areas:\nFinancial\n•\nMeeting or exceeding our 2025 enterprise financial and sustainability goals; and\n•\nDelivering targeted capital return to shareholders.\nCustomer at the Core\n•\nEnhancing customer support and seamless user experience with an enterprise mindset and focus on ease of discoverability, distribution, and delivery of our product and services and integrated cross-divisional capabilities; \n•\nGenerating value from technology consolidation projects; and\n•\nExpanding value for targeted strategic accounts.\nGrow and Innovate\n•\nProtecting and growing revenue by integrating generative artificial intelligence (“AI”) into product and creating new products; and\n•\nAccelerating growth in transformational adjacencies.\nData and Technology\n•\nMaximizing the value of our data estate for our internal and external customers at scale to drive efficiency, leveraging cutting edge tools and technologies; and\n•\nDriving speed and efficiency by integrating AI into internal workflows and processes.\nLead and Inspire\n•\nMaintaining our enterprise engagement through appropriate actions, messaging and ongoing activities;\n•\nSustaining an inclusive culture where every individual feels valued, respected and empowered; and\n•\nContinuing to promote AI skills development for all employees.\n35\nExecute and Deliver\n•\nEnhancing our capital allocation framework to assess and reallocate capital to the highest value opportunities across S&P Global; \n•\nDriving continuous commitment to risk management, compliance, and control across the Enterprise and strengthening and standardizing first line risk management; and \n•\nCreating a more sustainable impact.\nThere can be no assurance that we will achieve success in implementing any one or more of these strategies as a variety of factors could unfavorably impact operating results, including prolonged difficulties in the global credit markets and a change in the regulatory environment affecting our businesses. See Item 1A, \nRisk Factors\n in this Form 10-Q and our most recently filed Annual Report on Form 10-K.\n36\nRESULTS OF OPERATIONS — COMPARING THE THREE AND NINE MONTHS ENDED SEPTEMBER 30, 2025 AND 2024\n \nConsolidated Review\n(in millions)\nThree Months\nNine Months\n2025\n2024\n% Change\n2025\n2024\n% Change\nRevenue\n$\n3,888 \n$\n3,575 \n9%\n$\n11,420 \n$\n10,616 \n8%\nTotal Expenses:\nOperating-related expenses \n1,121 \n1,065 \n5%\n3,393 \n3,254 \n4%\nSelling and general expenses\n805 \n815 \n(1)%\n2,372 \n2,270 \n4%\nDepreciation and amortization\n294 \n293 \n—%\n882 \n873 \n1%\nTotal expenses\n2,220 \n2,173 \n2%\n6,647 \n6,397 \n4%\nGain on dispositions, net\n— \n(21)\nN/M\n(3)\n(21)\n(85)%\nEquity in income on unconsolidated subsidiaries \n(7)\n(11)\n(39)%\n(28)\n(31)\n(6)%\nOperating profit\n1,675 \n1,434 \n17%\n4,804 \n4,271 \n12%\nOther income, net\n(2)\n2 \nN/M\n(25)\n(10)\nN/M\nInterest expense, net\n79 \n72 \n10%\n233 \n227 \n3%\nProvision for taxes on income\n333 \n313 \n6%\n1,000 \n854 \n17%\nNet income\n1,265 \n1,047 \n21%\n3,596 \n3,200 \n12%\nLess: net income attributable to noncontrolling interests\n(89)\n(76)\n(16)%\n(259)\n(228)\n(13)%\nNet income attributable to S&P Global Inc.\n$\n1,176 \n$\n971 \n21%\n$\n3,337 \n$\n2,972 \n12%\n \nN/M – Represents a change equal to or in excess of 100% or not meaningful\n37\nRevenue\nThe following table provides consolidated revenue information for the periods ended September 30:\n(in millions)\nThree Months\nNine Months\n2025\n2024\n% Change\n2025\n2024\n% Change\nRevenue\n$\n3,888 \n$\n3,575 \n9%\n$\n11,420 \n$\n10,616 \n8%\nSubscription revenue\n1,986 \n1,864 \n6%\n5,837 \n5,464 \n7%\nNon-subscription / transaction revenue\n812 \n735 \n11%\n2,406 \n2,305 \n4%\nNon-transaction revenue\n521 \n466 \n12%\n1,505 \n1,365 \n10%\nAsset-linked fees\n303 \n266 \n14%\n876 \n756 \n16%\nSales usage-based royalties\n108 \n102 \n6%\n329 \n296 \n11%\nRecurring variable\n158 \n142 \n11%\n467 \n430 \n8%\n% of total revenue:\n     Subscription revenue\n51 \n%\n52 \n%\n51 \n%\n51 \n%\n     Non-subscription / transaction revenue\n21 \n%\n21 \n%\n21 \n%\n22 \n%\n     Non-transaction revenue\n13 \n%\n13 \n%\n13 \n%\n13 \n%\n     Asset-linked fees\n8 \n%\n7 \n%\n8 \n%\n7 \n%\n     Recurring variable\n4 \n%\n4 \n%\n4 \n%\n4 \n%\n     Sales usage-based royalties\n3 \n%\n3 \n%\n3 \n%\n3 \n%\nU.S. revenue\n$\n2,362 \n$\n2,176 \n9%\n$\n6,973 \n$\n6,478 \n8%\nInternational revenue:\n     European region\n885 \n802 \n10%\n2,596 \n2,407 \n8%\n     Asia\n430 \n388 \n11%\n1,221 \n1,111 \n10%\n     Rest of the world\n211 \n209 \n1%\n630 \n620 \n2%\nTotal international revenue\n$\n1,526 \n$\n1,399 \n9%\n$\n4,447 \n$\n4,138 \n7%\n% of total revenue:\n     U.S. revenue\n61 \n%\n61 \n%\n61 \n%\n61 \n%\n     International revenue\n39 \n%\n39 \n%\n39 \n%\n39 \n%\n \n \n \n \n38\n \nThree Months\nRevenue increased 9% as compared to the three months ended September 30, 2024. Subscription revenue increased in the three month period primarily due to growth in Data, Analytics & Insights, growth for work flow solutions in Enterprise Solutions and growth in RatingsXpress®, RatingsDirect®, partially offset by the unfavorable impact of the sale of Fincentric in August of 2024 at Market Intelligence; continued demand for Commodity Insights market data and market insights products; new business growth within the Dealer business, strong underwriting volumes and market share growth within the Financial business, and the favorable impact of improved contract terms at Mobility; and higher data subscription revenue at Indices. Non-subscription / transaction revenue increased driven by growth in corporate bond ratings revenue and structured finance revenue at Ratings. Non-transaction revenue increased primarily due to an increase in surveillance revenue and an increase in revenue at our Crisil subsidiary at Ratings. Asset linked fees increased at Indices primarily due to higher levels of assets under management for ETFs and mutual funds. The increase in sales-usage based royalties was driven by higher exchange-traded derivative revenue at Indices and the licensing of our proprietary market data to commodity exchanges at Commodity Insights. Recurring variable revenue at Market Intelligence increased due to increased volumes. See “Segment Review” below for further information. \n \nThe favorable impact of foreign exchange rates increased revenue by 1 percentage point. This impact refers to constant currency comparisons estimated by recalculating current year results of foreign operations using the average exchange rate from the prior year.\nNine Months\nRevenue increased 8% as compared to the nine months ended September 30, 2024. Subscription revenue increased in the nine month period primarily due to growth in Data, Analytics & Insights which was favorably impacted by the acquisition of Visible Alpha in May of 2024, growth for work flow solutions in Enterprise Solutions and growth in RatingsXpress®, RatingsDirect®, partially offset by the unfavorable impact of the sale of Fincentric in August of 2024 at Market Intelligence; continued demand for Commodity Insights market data and market insights products; new business growth within the Dealer business, strong underwriting volumes and market share growth within the Financial business and the favorable impact of improved contract terms at Mobility; and higher data subscription revenue at Indices. Non-subscription / transaction revenue increased primarily due to higher corporate bond ratings revenue, partially offset by lower bank loan ratings revenue at Ratings, and an increase in conference revenue at Commodity Insights. Non-transaction revenue increased primarily due to an increase in surveillance revenue and an increase in revenue at our Crisil subsidiary at Ratings. Asset linked fees increased at Indices primarily due to higher levels of assets under management for ETFs and mutual funds. The increase in sales-usage based royalties was driven by higher exchange-traded derivative revenue at Indices and the licensing of our proprietary market data to commodity exchanges at Commodity Insights. Recurring variable revenue at Market Intelligence increased due to increased volumes. See “Segment Review” below for further information. \n \nThe favorable impact of foreign exchange rates increased revenue by 1 percentage point. This impact refers to constant currency comparisons estimated by recalculating current year results of foreign operations using the average exchange rate from the prior year.\n \n39\nTotal Expenses\n \nThe following tables provide an analysis by segment of our operating-related expenses and selling and general expenses for the  \nperiods ended September 30: \nThree Months\n(in millions)\n2025\n2024\n% Change\nOperating-\nrelated expenses\nSelling and\ngeneral expenses\nOperating-\nrelated expenses\nSelling and\ngeneral expenses\nOperating-\nrelated expenses\nSelling and\ngeneral expenses\nMarket Intelligence\n 1\n$\n513 \n$\n289 \n$\n497 \n$\n297 \n3%\n(3)%\nRatings\n \n2\n268 \n145 \n258 \n168 \n4%\n(14)%\nCommodity Insights\n 3\n170 \n116 \n163 \n115 \n4%\n2%\nMobility \n4\n133 \n115 \n118 \n118 \n13%\n(4)%\nIndices\n 5\n69 \n65 \n62 \n62 \n11%\n6%\nIntersegment eliminations\n 6\n(51)\n— \n(48)\n— \n(6)%\nN/M\nTotal segments\n1,102 \n730 \n1,050 \n760 \n5%\n(4)%\nCorporate Unallocated expense\n 7\n19 \n75 \n15 \n55 \n25%\n35%\nTotal\n$\n1,121 \n$\n805 \n$\n1,065 \n$\n815 \n5%\n(1)%\nN/M – Represents a change equal to or in excess of 100% or not meaningful\n1\n In 2025, selling and general expenses include employee severance charges of $11 million, acquisition-related costs of $2 million and disposition-related costs of $4 million and Executive Leadership Team transition costs of $1 million. In 2024, selling and general expenses include IHS Markit merger costs of $10 million.\n2\n In 2025, selling and general expenses include legal costs of $12 million. In 2024, selling and general expenses include a statutorily required bonus accrual adjustment of $6 million.\n3\n  In 2024, selling and general expenses include employee severance charges of $4 million and IHS Markit merger costs of $2 million.\n4\n In 2025, selling and general expenses include employee severance charges of $6 million, an Executive Leadership Team transition benefit of $4 million, a legal settlement recovery of $3 million and acquisition related costs of $1 million. In 2024, selling and general expenses include IHS Markit merger costs of $1 million.\n5\n In 2025, selling and general expenses include employee severance charges of $1 million and acquisition related costs of $1 million. In 2024, selling and general expenses include IHS Markit merger costs of $1 million.\n6\n Intersegment eliminations primarily relate to a royalty charged to Market Intelligence for the rights to use and distribute content and data developed by Ratings.\n7\n  In 2025, selling and general expenses include acquisition-related costs of $14 million, Executive Leadership Team transition costs of $9 million, a lease impairments of $6 million, employee severance charges of $5 million, disposition-related costs of $4 million and legal costs of $1 million. In 2024, selling and general expenses include IHS Markit merger costs of $16 million, acquisition-related costs of $2 million and an asset write-off of $1 million.  \nOperating-Related Expenses\nOperating-related expenses increased 5% primarily driven by higher compensation costs driven by annual merit increases and additional headcount.\nIntersegment eliminations primarily relate to a royalty charged to Market Intelligence for the rights to use and distribute content and data developed by Ratings.\nSelling and General Expenses\nSelling and general expenses decreased 1%. Selling and general expenses decreased 5% excluding the impact in 2025 of higher employee severance charges of 3 percentage points, acquisition-related costs of 2 percentage points, disposition-related costs of 1 percentage point, legal costs of 1 percentage point, lease impairments of 1 percentage point, Executive Leadership Team transition costs of 1 percentage point, partially offset by IHS Markit merger costs in 2024 of 4 percentage points and a statutorily required bonus accrual adjustment in 2024 of 1 percentage point. The decrease was primarily driven by a decrease in incentive costs, partially offset by higher compensation costs driven by annual merit increases and additional headcount, and an \n40\nincrease in strategic initiatives.\nDepreciation and Amortization\nDepreciation and amortization of $294 million in 2025 remained relatively unchanged compared to 2024.  \nNine Months\n(in millions)\n2025\n2024\n% Change\nOperating-\nrelated expenses\nSelling and\ngeneral expenses\nOperating-\nrelated expenses\nSelling and\ngeneral expenses\nOperating-\nrelated expenses\nSelling and\ngeneral expenses\nMarket Intelligence\n 1\n$\n1,549 \n$\n876 \n$\n1,515 \n$\n851 \n2%\n3%\nRatings\n \n2\n790 \n432 \n763 \n434 \n3%\n—%\nCommodity Insights\n 3\n554 \n342 \n524 \n329 \n6%\n4%\nMobility \n4\n398 \n358 \n362 \n351 \n10%\n2%\nIndices\n 5\n198 \n181 \n178 \n166 \n11%\n10%\nIntersegment eliminations\n 6\n(147)\n— \n(138)\n— \n(7)%\nN/M\nTotal segments\n3,342 \n2,189 \n3,204 \n2,131 \n4%\n3%\nCorporate Unallocated expense\n 7\n51 \n183 \n50 \n139 \n3%\n32%\nTotal\n$\n3,393 \n$\n2,372 \n$\n3,254 \n$\n2,270 \n4%\n4%\nN/M – Represents a change equal to or in excess of 100% or not meaningful\n1\n In 2025, selling and general expenses include employee severance charges of $44 million, acquisition-related costs of $12 million, disposition-related costs of $6 million and Executive Leadership Team transition costs of $5 million. In 2024, selling and general expenses include IHS Markit merger costs of $30 million, employee severance charges of $35 million and a net acquisition-related benefit of $8 million.\n2\n In 2025, selling and general expenses include legal costs of $39 million and employee severance charges of $10 million. In 2024, selling and general expenses include legal costs of $20 million, a statutorily required bonus accrual adjustment of $6 million and employee severance charges of $2 million.\n3\n In 2025, selling and general expenses include employee severance charges of $10 million. In 2024, selling and general expenses include IHS Markit merger costs of $12 million, employee severance charges of $4 million, an asset write-off of $1 million and disposition-related costs of $1 million.\n4\n In 2025, selling and general expenses include employee severance charges of $11 million, Executive Leadership Team transition benefit of $4 million, legal settlement recovery of $3 million and acquisition related costs of $1 million. In 2024, selling and general expenses include employee severance charges of $7 million, IHS Markit merger costs of $2 million and acquisition-related costs of $1 million.\n5\n  In 2025, selling and general expenses include employee severance charges of $1 million and acquisition related costs of $1 million. In 2024, selling and general expenses include IHS Markit merger costs of $4 million and employee severance charges of $1 million.\n6\n Intersegment eliminations primarily relate to a royalty charged to Market Intelligence for the rights to use and distribute content and data developed by Ratings.\n7\n  In 2025, selling and general expenses include employee severance charges of $28 million, Executive Leadership Team transition costs of $22 million, acquisition-related costs of $24 million, a lease impairments of $14 million, disposition-related costs of $6 million, legal costs of $3 million and an asset write-off of $1 million. In 2024, selling and general expenses include IHS Markit merger costs of $54 million, acquisition-related costs of $10 million, disposition-related costs of $3 million, employee severance charges of $2 million, recovery of lease-related costs of $1 million and an asset write-off of $1 million.\nOperating-Related Expenses\nOperating-related expenses increased 4% primarily driven by higher compensation costs driven by annual merit increases and additional headcount and higher outside services expenses.\nIntersegment eliminations primarily relate to a royalty charged to Market Intelligence for the rights to use and distribute content and data developed by Ratings.\nSelling and General Expenses\n41\nSelling and general expenses increased 4%. Selling and general expenses increased 3% excluding the impact in 2025 of higher employee severance charges of 2 percentage points, Executive Leadership Team transition costs of 1 percentage point, acquisition-related costs of 1 percentage point and legal costs of 1 percentage point, partially offset by IHS Markit merger costs in 2024 of 4 percentage points. The increase was primarily driven by higher compensation costs driven by annual merit increases and additional headcount, and an increase in strategic initiatives, partially offset by decreased incentive costs.\nDepreciation and Amortization\nDepreciation and amortization of $882 million in 2025 remained relatively unchanged compared to 2024.  \nGain on Dispositions\nDuring the \nnine months\n ended \nSeptember 30, 2025\n, we recorded a pre-tax gain\n of $3 million ($2 million after-tax) in G\nain on dispositions  in the consolidated statements of income related to the sale of Fincentric in August of 2024. During the three and nine months ended \nSeptember 30, 2024\n, we recorded a pre-tax gain of $21 million ($12 million after-tax) in Gain on dispositions in the consolidated statement of income related to the sale of Fincentric in our Market Intelligence segment.\nOperating Profit\nWe consider operating profit to be an important measure for evaluating our operating performance and we evaluate operating profit for each of the reportable business segments in which we operate. \nWe internally manage our operations by reference to operating profit with economic resources allocated primarily based on each segment’s contribution to operating profit. Segment operating profit is defined as operating profit before Corporate Unallocated expense and Equity in Income on Unconsolidated Subsidiaries. \nThe tables below reconcile segment operating profit to total operating profit for the periods ended September 30:\n \nThree Months\n(in millions)\n2025\n2024\n% Change\nMarket Intelligence \n1\n$\n277 \n$\n230 \n20%\nRatings \n2\n819 \n676 \n21%\nCommodity Insights \n3\n235 \n211 \n11%\nMobility \n4\n117 \n97 \n21%\nIndices \n5\n317 \n282 \n12%\nTotal segment operating profit\n1,765 \n1,496 \n18%\nCorporate Unallocated expense \n6\n(97)\n(73)\n(33)%\nEquity in income on unconsolidated subsidiaries\n \n7\n7 \n11 \n(39)%\nTotal operating profit\n$\n1,675 \n$\n1,434 \n17%\n1\n  2025 includes employee severance charges of $11 million, acquisition-related costs of $2 million, disposition-related costs of $4 million and Executive Leadership Team transition costs of $1 million. 2024 includes a gain on disposition of $21 million and IHS Markit merger costs of $10 million. 2025 and 2024 include amortization of intangibles from acquisitions of $146 million and $151 million, respectively.\n2\n    2025 includes legal costs of $12 million. 2024 includes a statutorily required bonus accrual adjustment of $6 million. 2025 and 2024 include amortization of intangibles from acquisitions of $1 million and $2 million, respectively.\n3    \n2024 includes employee severance charges of $4 million and IHS Markit merger costs of $2 million. 2025 and 2024 include amortization of intangibles from acquisitions of $32 million.\n4\n    2025 includes employee severance charges of $6 million, an Executive Leadership Team transition benefit of $4 million and a legal settlement recovery of $3 million. 2024 includes IHS Markit merger costs of $1 million. 2025 and 2024 include amortization of intangibles from acquisitions of $76 million. \n5\n    2025 includes employee severance charges of $1 million and acquisition-related costs of $1 million. 2024 includes IHS Markit merger costs of $1 million. 2025 and 2024 include amortization of intangibles from acquisitions of $9 million. \n6\n    2025 includes acquisition-related costs of $14 million, Executive Leadership Team transition costs of $9 million, lease impairments of $6 million, employee severance charges of $5 million, disposition-related costs of $4 million and legal costs of $1 million. 2024 includes \n42\nIHS Markit merger costs of $16 million, acquisition-related costs of $2 million and an asset write-off of $1 million. 2025 and 2024 include amortization of intangibles from acquisitions of $1 million.\n7\n    2025 and 2024 include amortization of intangibles from acquisitions of  $14 million.\nSegment Operating Profit —\n Segment operating profit increased 18% as compared to 2024. Excluding the impact of a gain on disposition in 2024 of 2 percentage points, higher employee severance charges in 2025 of 1 percentage point, legal costs in 2025 of 1 percentage point, partially offset by IHS Markit merger costs in 2024 of 1 percentage point, a statutorily required bonus accrual adjustment of 1 percentage point and higher amortization of intangibles from acquisitions in 2025 of 1 percentage point, operating profit increased 16% primarily due to revenue growth and decreased incentive costs, partially offset by higher compensation costs driven by annual merit increases and additional headcount, and investments in strategic initiatives. See “Segment Review” below for further information.\n \nCorporate Unallocated Expense —\n Corporate Unallocated expense includes costs for corporate functions, select initiatives, unoccupied office space and Kensho, included in selling and general expenses. Corporate Unallocated expense increased 33% compared to 2024. Excluding the impact of higher acquisition-related costs in 2025 of 16 percentage points, Executive Leadership Team transition costs in 2025 of 12 percentage points, lease impairments in 2025 of 9 percentage points, employee severance changes in 2025 of 7 percentage points, disposition-related costs in 2025 of 4 percentage points, legal costs in 2025 of 2 percentage points, partially offset by IHS merger costs in 2024 of 21 percentage points and an asset write-off in 2024 of 1 percentage point, Corporate Unallocated expense increased 5% primarily due to higher compensation costs in 2025.\nEquity in Income on Unconsolidated Subsidiaries —\n \nAs of September 30, 2025, the Company holds an investment in a 50/50 joint venture arrangement with shared control with CME Group that combines each company’s post-trade services into a joint venture, OSTTRA. The joint venture provides trade processing and risk mitigation operations and incorporates CME’s optimization businesses (Traiana, TriOptima, and Reset) and the Company’s MarkitSERV business. The combination is intended to increase operating efficiencies of both businesses to more effectively service clients with enhanced platforms and services for OTC markets across interest rate, FX, equity, and credit  asset classes.  Equity in Income on Unconsolidated Subsidiaries includes the OSTTRA joint venture. Equity in Income on Unconsolidated Subsidiaries was $7 million for the three months ended September 30, 2025 compared to $11 million for the three months ended September 30, 2024.\nForeign exchange rates had a favorable impact on operating profit of 2 percentage points. This impact refers to currency comparisons and the remeasurement of monetary assets and liabilities. Currency impacts are estimated by re-calculating current year results of foreign operations using the average exchange rate from the prior year. Remeasurement impacts are based on the variance between current-year and prior-year foreign exchange rate fluctuations on assets and liabilities denominated in currencies other than the individual business’s functional currency. \nNine Months\n(in millions)\n2025\n2024\n% Change\nMarket Intelligence \n1\n$\n756 \n$\n649 \n16%\nRatings \n2\n2,291 \n2,080 \n10%\nCommodity Insights \n3\n723 \n643 \n13%\nMobility \n4\n307 \n247 \n24%\nIndices \n5\n941 \n816 \n15%\nTotal segment operating profit\n5,018 \n4,435 \n13%\nCorporate Unallocated expense \n6\n(242)\n(195)\n(24)%\nEquity in income on unconsolidated subsidiaries\n \n7\n28 \n31 \n(6)%\nTotal operating profit\n$\n4,804 \n$\n4,271 \n12%\n1\n  2025 includes employee severance charges of $44 million, acquisition-related costs of $12 million, Executive Leadership Team transition costs of $5 million, disposition-related costs of $6 million and a gain on disposition of $3 million. 2024 includes a gain on disposition of $21 million, employee severance charges of $35 million, IHS Markit merger costs of $30 million and a net acquisition-related benefit of $8 million. 2025 and 2024 include amortization of intangibles from acquisitions of $443 million and $439 million, respectively. \n2\n    2025 includes legal costs of $39 million and employee severance charges of $10 million. 2024 includes legal costs of $20 million, a statutorily required bonus accrual adjustment of $6 million and employee severance charges of $2 million. 2025 and 2024 include amortization of intangibles from acquisitions of $5 million and $11 million, respectively.\n43\n3   \n2025 includes employee severance charges of $10 million. 2024 includes IHS Markit merger costs of $12 million, employee severance charges of $4 million, an asset write-off of $1 million and disposition-related costs of $1 million. 2025 and 2024 include amortization of intangibles from acquisitions of $98 million and $97 million, respectively. \n4\n    2025 includes employee severance charges of $11 million, an Executive Leadership Team transition benefit of $4 million, a legal settlement recovery of $3 million and acquisition related costs of $1 million. 2024 includes employee severance charges of $7 million, IHS Markit merger costs of $2 million and acquisition-related costs of $1 million. 2025 and 2024 include amortization of intangibles from acquisitions of $228 million and $227 million.\n5\n    2025 includes employee severance charges of $1 million and acquisition related costs of $1 million. 2024 includes IHS Markit merger costs of $4 million, a loss on disposition of $1 million and employee severance charges of $1 million. 2025 and 2024 include amortization of intangibles from acquisitions of $27 million.\n6\n    2025 includes employee severance charges of $28 million, Executive Leadership Team transition costs of $22 million, disposition-related costs of $6 million, lease impairments of $14 million, acquisition-related costs of $24 million, legal costs of $3 million and an asset write-off of $1 million. 2024 includes IHS Markit merger costs of $54 million, acquisition-related costs of $10 million, disposition-related costs of $3 million, employee severance charges of $2 million, a gain on disposition of $2 million, recovery of lease-related costs of $1 million and an asset write-off of $1 million. 2025 and 2024 include amortization of intangibles from acquisitions of  $2 million.\n7\n    2025 and 2024 include amortization of intangibles from acquisitions of  $40 million and $42 million, respectively. \nSegment Operating Profit —\n Segment operating profit increased 13% as compared to 2024. Excluding the impact of a higher gain on dispositions in 2024 of 1 percentage point, higher employee severance charges in 2025 of 1 percentage point, legal costs in 2025 of 1 percentage point and  higher acquisition-related costs in 2025 of 1 percentage point, partially offset by IHS Markit merger costs in 2024 of 3 percentage points, segment operating profit increased 12%. The increase was primarily due to revenue growth and decreased incentive costs, partially offset by higher compensation costs driven by annual merit increases and additional headcount, and investments in strategic initiatives. See “Segment Review” below for further information.\n \nCorporate Unallocated Expense —\n Corporate Unallocated expense includes costs for corporate functions, select initiatives, unoccupied office space and Kensho, included in selling and general expenses. Corporate Unallocated expense increased 24% compared to 2024. Excluding the impact of higher employee severance charges in 2025 of 10 percentage points, Executive Leadership Team transition costs in 2025 of 9 percentage points, higher acquisition-related costs in 2025 of 6 percentage points, lease impairments in 2025 of 6 percentage points, disposition-related costs in 2025 of 1 percentage point, legal costs in 2025 of 1 percentage point and a gain on disposition in 2024 of 1 percentage point, partially offset by IHS merger costs in 2024 of 21 percentage points, Corporate Unallocated expense increased 11% primarily due to higher compensation costs in 2025 and disposition-related income in 2024.\nEquity in Income on Unconsolidated Subsidiaries —\n \nAs of September 30, 2025, the Company holds an investment in a 50/50 joint venture arrangement with shared control with CME Group that combines each company’s post-trade services into a joint venture, OSTTRA. The joint venture provides trade processing and risk mitigation operations and incorporates CME’s optimization businesses (Traiana, TriOptima, and Reset) and the Company’s MarkitSERV business.  The combination is intended to increase operating efficiencies of both businesses to more effectively service clients with enhanced platforms and services for OTC markets across interest rate, FX, equity, and credit  asset classes.  Equity in Income on Unconsolidated Subsidiaries includes the OSTTRA joint venture. Equity in Income on Unconsolidated Subsidiaries was $28 million for the nine months ended September 30, 2025 compared to $31 million for the nine months ended September 30, 2024.\nOn October 10, 2025, the Company and CME Group completed the sale of OSTTRA to Kohlberg Kravis Roberts & Co. (“KKR”), a leading global investment firm. The terms of the deal for OSTTRA equaled total enterprise value at $3.1 billion, subject to customary purchase price adjustments, which will be divided evenly between the Company and CME Group pursuant to the 50/50 joint venture. We received proceeds from the sale of $1.5 billion in cash, subject to purchase price adjustments, which we expect to result in approximately $1.4 billion of after-tax proceeds. We anticipate the sale to result in a pre-tax gain of approximately $270 million ($180 million after-tax) for the Company, including the impact of accumulated other comprehensive income related to our investment.\nForeign exchange rates had a favorable impact on operating profit of less than 1 percentage point. This impact refers to currency comparisons and the remeasurement of monetary assets and liabilities. Currency impacts are estimated by re-calculating current year results of foreign operations using the average exchange rate from the prior year. Remeasurement impacts are based on the variance between current-year and prior-year foreign exchange rate fluctuations on assets and liabilities denominated in currencies other than the individual business’s functional currency.    \n44\nOther Income, net\nOther income, net includes gains and losses on our mark-to-market investments and the net periodic benefit cost for our retirement and post retirement plans. Other income, net was $2 million for the three months ended September 30, 2025 compared to other expense, net of $2 million for the three months ended September 30, 2024 due to higher losses on our mark-to-market investments in 2024. Other income, net was $25 million for the nine months ended September 30, 2025 compared to $10 million for the nine months ended September 30, 2024 primarily due to gains on our mark-to-market investments in 2025 compared to losses in 2024.\nInterest Expense, net\nInterest expense, net increased compared to the three months ended September 30, 2024 and nine months ended September 30, 2024 primarily due to an increase in interest expense related to uncertain tax liabilities, partially offset by higher interest income from invested cash due to a more favorable interest rate environment combined with a benefit from our net investment hedge program.\nProvision for Income Taxes\nThe effective income tax rate was 20.8% and 21.8% for the three and nine months ended September 30, 2025, respectively and 23.0% and 21.1% for the three and nine months ended September 30, 2024, respectively. The higher rate for the three months ended September 30, 2024 was primarily due to the tax charge on divestitures and change in the profit mix. The lower rate for the nine months ended September 30, 2024 was primarily due to a combination of discrete adjustments.  \nOn July 4, 2025, President Trump signed into law the One Big Beautiful Bill Act (“OBBBA”). The OBBBA makes permanent key elements of the Tax Cuts and Jobs Act, as well as modifying certain international tax provisions. We do not anticipate material impact to our 2025 financial statements as a result of the enacted OBBBA provisions.  \nThe Organization for Economic Co-operation and Development (“OECD”) introduced an international tax framework under Pillar Two which includes a global minimum tax of 15%. This framework has been implemented by several jurisdictions, including jurisdictions in which we operate, with effect from January 1, 2024, and many other jurisdictions, including jurisdictions in which we operate, are in the process of implementing it. The effect of enacted Pillar Two taxes has been included in the results disclosed and did not have a significant impact on our consolidated financial statements.\nIn June 2025, G7 reached an agreement with the U.S. regarding the application of the OECD global minimum tax rules to U.S. companies, which would exempt U.S. companies from OECD’s global minimum tax rules, and in return the U.S. withdrew proposed section 899 from OBBBA, which would have imposed retaliatory taxes on non-U.S. businesses. We are continuing to monitor implementation dates of this agreement and will be evaluating the impact on our financial statements once more details are available.\nSegment Review\nMarket Intelligence\nMarket Intelligence is a global provider of multi-asset-class data and analytics integrated with purpose-built workflow solutions. Market Intelligence’s portfolio of capabilities are designed to help trading and investment professionals, government agencies, corporations and universities track performance, generate alpha, identify investment ideas, understand competitive and industry dynamics, perform valuations and manage credit risk.\n45\nOn October 15, 2025, we entered into an agreement to acquire With Intelligence from Motive Partners for $1.8 billion. With Intelligence is expected to be integrated into our Market Intelligence segment. Combining With Intelligence's proprietary data, benchmarks and workflow solutions with S&P Global’s trusted expertise and brand in private markets intelligence and analytics, the company will create one of the most comprehensive data offerings for alternatives and private markets participants. The transaction is expected to close in 2025, or early 2026, subject to customary closing conditions, including receipt of certain regulatory approvals. \nOn June 6, 2025, we completed the acquisition of TeraHelix, a privately held financial technology firm. TeraHelix helps solve complex, enterprise-scale data challenges by providing frameworks that structure data models for smooth interoperability across platforms, systems and storage architectures. This acquisition is part of our Market Intelligence segment and strengthens our customer-centric approach to data, technology, and AI by meaningfully enhancing the ability to link datasets across classes and platforms. The acquisition of TeraHelix is not material to our consolidated financial statements.\nOn April 24, 2025, we entered into an agreement to acquire the Automatic Identification System (AIS) data services business of ORBCOMM Inc. The AIS business is a leading provider of satellite data services used to track and monitor vessels, enhancing maritime visibility and delivering critical insights that support business intelligence and decision-making for government and commercial clients worldwide. The AIS business is expected to be integrated within our Market Intelligence segment. We also expect to enter into a strategic alliance with ORBCOMM. Under this strategic alliance, the two organizations expect to develop a range of differentiated supply chain data and insight offerings and we will make an equity investment in ORBCOMM, underscoring our commitment to further investing in this sector while helping customers navigate the complex supply chain environment. The proposed acquisition is subject to customary closing conditions, including receipt of certain regulatory approvals and is expected to close during 2025. The proposed acquisition is not expected to be material to our consolidated financial statements.\nMarket Intelligence includes the following business lines:\n•\nData, Analytics & Insights \n— \na desktop product suite that provides data, analytics and third-party research for global finance and corporate professionals, which includes the Capital IQ platforms (which are inclusive of S&P Capital IQ Pro, Capital IQ, Office and Mobile products) and a broad range of research, reference data, market data, derived analytics and valuation services covering both the public and private capital markets, delivered through flexible feed-based or API delivery mechanisms. This also includes issuer solutions for public companies, a range of products for the maritime & trade market, data and insight into Financial Institutions, the telecoms, technology and media space as well as ESG and supply chain data analytics;\n•\nEnterprise Solutions \n—\n software and workflow solutions that help our customers manage and analyze data; identify risk; reduce costs; and meet global regulatory requirements. The portfolio includes industry leading financial technology solutions like Wall Street Office, Enterprise Data Manager, Information Mosaic, and iLevel. Our Global Markets Group offering delivers bookbuilding platforms across multiple assets including municipal bonds, equities and fixed income; and\n•\nCredit & Risk Solutions \n— \ncommercial arm that sells Ratings' credit ratings and related data and research, advanced analytics, and financial risk solutions which includes subscription-based offerings, RatingsXpress®, RatingsDirect® and Credit Analytics.\nSubscription revenue at Market Intelligence is primarily derived from distribution of data, valuation services, analytics, third party research, and credit ratings-related information through both feed and web-based channels. Subscription revenue also includes software and hosted product offerings which provide maintenance and continuous access to our platforms over the contract term.  Recurring variable revenue at Market Intelligence represents revenue from contracts for services that specify a fee based on, among other factors, the number of trades processed, assets under management, or the number of positions  valued. Non-subscription revenue at Market Intelligence is primarily related to certain advisory, pricing conferences and events, and analytical services.\n46\nThe following table provides revenue and segment operating profit information for the periods ended September 30:\n(in millions)\nThree Months\nNine Months\n2025\n2024\n% Change\n2025\n2024\n% Change\nRevenue\n$\n1,236 \n$\n1,162 \n6%\n$\n3,653 \n$\n3,459 \n6%\nSubscription revenue\n$\n1,035 \n$\n981 \n5%\n$\n3,045 \n$\n2,893 \n5%\nRecurring variable revenue\n$\n158 \n$\n142 \n11%\n$\n467 \n$\n430 \n8%\nNon-subscription revenue\n$\n43 \n$\n39 \n13%\n$\n141 \n$\n136 \n4%\n% of total revenue:\n     Subscription revenue\n84 \n%\n85 \n%\n83 \n%\n84 \n%\n     Recurring variable revenue\n13 \n%\n12 \n%\n13 \n%\n12 \n%\n     Non-subscription revenue\n3 \n%\n3 \n%\n4 \n%\n4 \n%\nU.S. revenue\n$\n732 \n$\n691 \n6%\n$\n2,178 \n$\n2,068 \n5%\nInternational revenue\n$\n504 \n$\n471 \n7%\n$\n1,475 \n$\n1,391 \n6%\n% of total revenue:\n     U.S. revenue\n59 \n%\n59 \n%\n60 \n%\n60 \n%\n     International revenue\n41 \n%\n41 \n%\n40 \n%\n40 \n%\nOperating profit\n 1\n$\n277 \n$\n230 \n20%\n$\n756 \n$\n649 \n16%\nOperating margin %\n22 \n%\n20 \n%\n21 \n%\n19 \n%\n1\n \nOperating profit for the \nthree and nine\n months ended September 30, 2025 includes employee severance charges of $11 million and $44 million, respectively, acquisition-related costs of $2 million and $12 million, respectively, disposition-related costs of $4 million and $6 million, respectively and Executive Leadership Team transition costs of $1 million and $5 million, respectively. Operating profit for the \nnine months\n ended September 30, 2025 includes a gain on disposition of $3 million. Operating profit for the \nthree and nine\n months ended September 30, 2024 includes a gain on disposition of $21 million and IHS Markit merger costs of $10 million and $30 million, respectively. Operating profit for the nine months ended September 30, 2024 includes employee severance charges of $35 million and a net acquisition-related benefit of $8 million. Additionally, operating profit includes amortization of intangibles from acquisitions of $146 million and $151 million for the three months ended September 30, 2025 and 2024, respectively, and $443 million and $439 million for the nine months ended September 30, 2025 and 2024, respectively.\nThree Months\nRevenue increased 6% primarily due to subscription revenue growth in Data, Analytics & Insights, growth for work flow solutions in Enterprise Solutions, and growth in RatingsXpress® and RatingsDirect®, partially offset by the unfavorable impact of the sale of Fincentric in August of 2024. An increase in recurring variable revenue due to increased volumes also contributed to revenue growth. Foreign exchange rates had a favorable impact of less than 1 percentage point.\nOperating profit increased 20%. Excluding the impact of a gain on disposition in 2024 of 2 percentage points and higher employee severance charges in 2025 of 1 percentage point, partially offset by IHS merger costs in 2024 of 1 percentage point, operating profit increased 18% primarily due to revenue growth and decreased incentive costs, partially offset by higher compensation costs driven by annual merit increases and an increase in strategic investments. Foreign exchange rates had a favorable impact of 2 percentage points.  \nNine Months\nRevenue increased 6% primarily due to subscription revenue growth in Data, Analytics & Insights which was favorably impacted by the acquisition of Visible Alpha in May of 2024, growth for work flow solutions in Enterprise Solutions, and growth in RatingsXpress® and RatingsDirect®, partially offset by the unfavorable impact of the sale of Fincentric in August of 2024. An increase in recurring variable revenue due to increased volumes also contributed to revenue growth. Foreign exchange rates had a favorable impact of 1 percentage point. \nOperating profit increased 16%. Excluding the impact of a gain on disposition in 2024 of 3 percentage points, higher net acquisition-related costs in 2025 of 2 percentages points, higher disposition-related costs in 2025 of 1 percentage point, higher employee severance charges in 2025 of 1 percentage point and higher amortization of intangibles from acquisitions in 2025 of 1 percentage point, partially offset by IHS merger costs in 2024 of 4 percentage points, operating profit increased 12% primarily \n47\ndue to revenue growth and lower outside services expenses, partially offset by higher compensation costs driven by annual merit increases and additional headcount and expenses associated with the acquisition of Visible Alpha. Foreign exchange rates had a favorable impact of 1 percentage point.  \nFor a further discussion of competitive and other risks inherent in our Market Intelligence business, see Item 1A,\n Risk Factors \nin this Form 10-Q and our most recently filed Annual Report on Form 10-K. For a further discussion of the legal and regulatory matters see Note 12 – \nCommitments and Contingencies \nto the consolidated financial statements of this Form 10-Q. \nRatings\n \nRatings is an independent provider of credit ratings, research, and analytics, offering investors and other market participants information, ratings and benchmarks. Credit ratings are one of several tools investors can use when making decisions about purchasing bonds and other fixed income investments. They are opinions about credit risk and our ratings express our opinion about the ability and willingness of an issuer, such as a corporation or state or city government, to meet its financial obligations in full and on time. Our credit ratings can also relate to the credit quality of an individual debt issue, such as a corporate or municipal bond, and the relative likelihood that the issue may default.\nOn September 24, 2025, Crisil, included within our Ratings segment, agreed to acquire McKinsey PriceMetrix Co., a leading provider of performance benchmarking and data-driven insights for the wealth management industry. This acquisition expands Crisil’s benchmarking offerings across the Wealth Management value chain. The transaction is expected to be completed over the coming months, subject to customary closing conditions. The proposed acquisition is not expected to be material to our consolidated financial statements.\nRatings disaggregates its revenue between transaction and non-transaction. Transaction revenue primarily includes fees associated with:\n•\nratings related to new issuance of corporate and government debt instruments, as well as structured finance debt instruments; and\n•\nbank loan ratings.\nNon-transaction revenue primarily includes fees for surveillance of a credit rating, annual fees for customer relationship-based pricing programs, fees for entity credit ratings and global research and analytics at Crisil. Non-transaction revenue also includes an intersegment royalty charged to Market Intelligence for the rights to use and distribute content and data developed by Ratings. Royalty revenue was $44 million and $128 million for the three and nine months ended September 30, 2025, respectively and $41 million and $120 million for the three and nine months ended September 30, 2024, respectively.\n48\nThe following table provides revenue and segment operating profit information for the periods ended September 30:\n(in millions)\nThree Months\nNine Months\n2025\n2024\n% Change\n2025\n2024\n% Change\nRevenue\n$\n1,240 \n$\n1,110 \n12%\n$\n3,537 \n$\n3,307 \n7%\nTransaction revenue\n$\n668 \n$\n597 \n12%\n$\n1,885 \n$\n1,804 \n4%\nNon-transaction revenue\n$\n572 \n$\n513 \n12%\n$\n1,652 \n$\n1,503 \n10%\n% of total revenue:\n     Transaction revenue\n \n54 \n%\n54 \n%\n53 \n%\n55 \n%\n     Non-transaction revenue \n46 \n%\n46 \n%\n47 \n%\n45 \n%\nU.S. revenue\n$\n729 \n$\n644 \n13%\n$\n2,051 \n$\n1,900 \n8%\nInternational revenue\n$\n511 \n$\n466 \n10%\n$\n1,486 \n$\n1,407 \n6%\n% of total revenue:\n     U.S. revenue\n59 \n%\n58 \n%\n58 \n%\n57 \n%\n     International revenue\n41 \n%\n42 \n%\n42 \n%\n43 \n%\nOperating profit\n 1\n$\n819 \n$\n676 \n21%\n$\n2,291 \n$\n2,080 \n10%\nOperating margin %\n66 \n%\n61 \n%\n65 \n%\n63 \n%\n1\nOperating profit for the three and nine months ended September 30, 2025 includes legal costs of $12 million and $39 million, respectively. Operating profit for the nine months ended September 30, 2025 includes employee severance charges $10 million. Operating profit for the three and nine months ended September 30, 2024 includes a statutorily required bonus accrual adjustment of $6 million. Operating profit for the nine months ended September 30, 2024 includes legal costs of $20 million and employee severance charges of $2 million. Additionally, operating profit includes amortization of intangibles from acquisitions of $1 million and $2 million, respectively for the three months ended September 30, 2025 and 2024, and $5 million and $11 million for the nine months ended September 30, 2025 and 2024, respectively.\nThree Months\n \nRevenue increased 12%, with a favorable impact from foreign exchange rates of 2 percentage points. Transaction revenue increased primarily due to growth in corporate bond ratings revenue and structured finance revenue driven by increases in issuance volumes. Non-transaction revenue increased primarily due to an increase in surveillance revenue and an increase in revenue at our Crisil subsidiary. Transaction and non-transaction revenue also benefited from improved contract terms across product categories. \nOperating profit increased 21%. Excluding the impact of higher legal costs in 2025 of 1 percentage point, operating profit increased 22% due to revenue growth and decreased incentive costs, partially offset by higher compensation costs driven by annual merit increases and additional headcount, and an increase in strategic investments. Foreign exchange rates had a favorable impact of 2 percentage points.\nNine Months\nRevenue increased 7%, with a favorable impact from foreign exchange rates of 1 percentage point. Non-transaction revenue increased primarily due to an increase in surveillance revenue and an increase in revenue at our Crisil subsidiary. Transaction revenue increased due to higher corporate bond ratings revenue, partially offset by lower bank loan ratings revenue. Transaction and non-transaction revenue also benefited from improved contract terms across product categories. \nOperating profit increased 10%. Excluding the impact of higher legal costs in 2025 of 1 percentage point, operating profit increased 11%\n \nprimarily due to revenue growth and decreased incentive costs, partially offset by higher compensation costs driven by annual merit increases and additional headcount, and an increase in strategic investments. Foreign exchange rates had a favorable impact of less than 1 percentage point.\n49\nBilled Issuance Volumes\nWe monitor billed issuance volumes regularly within Ratings. Billed issuance excludes items that do not impact transaction revenue, such as issuance from frequent issuer programs, unrated debt, and most international public finance to more effectively correlate issuance activity to movements in transaction revenue. \nThe following table provides billed issuance levels based on Ratings’ internal data feeds for the periods ended September 30:\nThree Months\nNine Months\n(in billions)\n2025\n2024\n% Change\n2025\n2024\n% Change\nInvestment-grade billed issuance\n* \n$\n392 \n$\n395 \n(1)%\n$\n1,261 \n$\n1,242 \n2%\nHigh-yield billed issuance *\n$\n185 \n$\n129 \n44%\n$\n446 \n$\n383 \n16%\nOther billed issuance \n** \n$\n563 \n$\n481 \n17%\n$\n1,533 \n$\n1,435 \n7%\nTotal billed issuance\n$\n1,140 \n$\n1,004 \n13%\n$\n3,240 \n$\n3,060 \n6%\nNote - Totals presented may not sum due to rounding.\n*     \nIncludes Corporates, Financial Services and Infrastructure.\n** \n \nIncludes Bank Loans, Structured Finance and Government.\n \nThird quarter billed issuance was up due to increases in high yield and structured finance. Tightening borrowing spreads drove refinancing in high yield. Structured finance billed issuance increases were driven primarily by new CLO issuance. \nFor a further discussion of competitive and other risks inherent in our Ratings business, see Item 1A,\n Risk Factors \nin this Form 10-Q and our most recently filed Annual Report on Form 10-K. For a further discussion of the legal and regulatory matters see Note 12 – \nCommitments and Contingencies \nto the consolidated financial statements of this Form 10-Q. \nCommodity Insights\nCommodity Insights is a leading independent provider of information and benchmark prices for the commodity and energy markets. Commodity Insights provides essential price data, analytics, industry insights and software & services, enabling the commodity and energy markets to perform with greater transparency and efficiency.\nCommodity Insights includes the following business lines:\n•\nEnergy & Resources Data & Insights \n— \nincludes data, news, insights, and analytics for petroleum, gas, power & renewables, petrochemicals, metals & steel, agriculture, and other commodities;\n•\nPrice Assessments \n—\n includes price assessments and benchmarks, and forward curves;\n•\nUpstream Data & Insights — includes exploration & production data and insights, software and analytics; and\n•\nAdvisory & Transactional Services \n— \nincludes consulting services, conferences, events and global trading services. \nCommodity Insights’ revenue is generated primarily through the following sources:\n•\nSubscription revenue \n—\n primarily from subscriptions to our market data and market insights (price assessments, market reports and commentary and analytics) along with other information products and software term licenses;\n•\nSales usage-based royalties \n—\n primarily from licensing our proprietary market price data and price assessments to commodity exchanges; and\n•\nNon-subscription revenue \n—\n conference sponsorship, consulting engagements, events, and perpetual software licenses.\n50\nThe following table provides revenue and segment operating profit information for the periods ended September 30:\n \n(in millions)\nThree Months\nNine Months\n2025\n2024\n% Change\n2025\n2024\n% Change\nRevenue\n$\n556 \n$\n522 \n6%\n$\n1,722 \n$\n1,597 \n8%\nSubscription revenue\n$\n507 \n$\n478 \n6%\n$\n1,493 \n$\n1,387 \n8%\nSales usage-based royalties\n$\n31 \n$\n26 \n19%\n$\n90 \n$\n77 \n17%\nNon-subscription revenue\n$\n18 \n$\n18 \n(1)%\n$\n139 \n$\n133 \n5%\n% of total revenue:\n     Subscription revenue\n91 \n%\n92 \n%\n87 \n%\n87 \n%\n     Sales usage-based royalties\n6 \n%\n5 \n%\n5 \n%\n5 \n%\n     Non-subscription revenue\n3 \n%\n3 \n%\n8 \n%\n8 \n%\nU.S. revenue\n$\n195 \n$\n192 \n1%\n$\n671 \n$\n634 \n6%\nInternational revenue\n$\n361 \n$\n330 \n9%\n$\n1,051 \n$\n963 \n9%\n% of total revenue:\n     U.S. revenue\n35 \n%\n37 \n%\n39 \n%\n40 \n%\n     International revenue\n65 \n%\n63 \n%\n61 \n%\n60 \n%\nOperating profit\n \n1\n$\n235 \n$\n211 \n11%\n$\n723 \n$\n643 \n13%\nOperating margin %\n42 \n%\n40 \n%\n42 \n%\n40 \n%\n1\nOperating profit for the nine months ended September 30, 2025 includes employee severance charges of $10 million. Operating profit for the three and nine months ended September 30, 2024 includes employee severance charges of $4 million and IHS Markit merger costs of $2 million and $12 million, respectively. Operating profit for the nine months ended September 30, 2024 includes an asset write-off of $1 million and disposition-related costs of $1 million. Additionally, operating profit includes amortization of intangibles from acquisitions of $32 million for the three months ended September 30, 2025 and 2024, and $98 million and $97 million for the nine months ended September 30, 2025 and 2024, respectively.\nThree Months\nRevenue increased 6% primarily due to continued demand for market data and market insights products driven by expanded product offerings to our existing customers under enterprise use contracts. An increase in sales usage-based royalties from the licensing of our proprietary market data to commodity exchanges due to increased trading volumes for Platts based contracts across all commodity sectors. The Energy & Resources Data & Insights, Price Assessments and Advisory & Transactional Services businesses contributed to revenue growth in the third quarter of 2025. Revenue at the Upstream Data & Insights business decreased in the third quarter of 2025 due to increased cancellations and lower one-time transactional sales. Foreign exchange rates had a favorable impact of less than 1 percentage point.\nOperating profit increased 11%. Excluding the impact of higher employee severance charges in 2024 of 3 percentage points and IHS Markit merger costs in 2024 of 1 percentage points, operating profit increased 7%. The increase was primarily due to revenue growth, partially offset by higher compensation costs driven by annual merit increases and additional headcount and investment in strategic initiatives. Foreign exchange rates had an unfavorable impact of 1 percentage point.\nNine Months\nRevenue increased 8% primarily due to continued demand for market data and market insights products driven by expanded product offerings to our existing customers under enterprise use contracts and an increase in conference revenue driven by increased attendance at CERAWeek in 2025. An increase in sales usage-based royalties from the licensing of our proprietary market data to commodity exchanges due to increased trading volumes for Platts based contracts across all commodity sectors also contributed to revenue growth. All four business lines contributed to revenue growth in the first nine months of 2025 with the Energy & Resources Data & Insights and Price Assessments businesses being the most significant drivers, followed by the Advisory & Transactional Services and Upstream Data & Insights businesses. Foreign exchange rates had an unfavorable impact of less than 1 percentage point.\n51\nOperating profit increased 13%. Excluding the impact of IHS Markit merger costs in 2024 of 5 percentage points, partially offset by higher employee severance charges in 2025 of 2 percentage points, operating profit increased 10%. The increase was primarily due to revenue growth, partially offset by higher compensation costs driven by annual merit increases and additional headcount, investment in strategic initiatives and expenses associated with the acquisition of World Hydrogen Leaders. Foreign exchange rates had an unfavorable impact of less than 1 percentage point.\nFor a further discussion of competitive and other risks inherent in our Commodity Insights business, see Item 1A,\n Risk Factors \nin this Form 10-Q and our most recently filed Annual Report on Form 10-K. For a further discussion of the legal and regulatory matters see Note 12 – \nCommitments and Contingencies \nto the consolidated financial statements of this Form 10-Q.\n \nMobility\n \nMobility is a leading provider of solutions serving the full automotive value chain including vehicle manufacturers (Original Equipment Manufacturers or OEMs), automotive suppliers, mobility service providers, retailers, consumers, and finance and insurance companies.\nMobility includes the following business lines:\n•\nDealer \n—\n includes analytics to predict future buyers, targeted marketing, and vehicle history data to allow people to shop, buy, service and sell used cars;\n•\nManufacturing \n—\n includes insights, forecasts and advisory services spanning the entire automotive value chain, from product planning to marketing, sales and the aftermarket; and\n•\nFinancial  \n—\n includes reports and data feeds to support lenders and insurance companies\n.\nMobility’s revenue is generated primarily through the following sources:\n•\nSubscription revenue \n—\n Mobility’s core information products provide critical information and insights to all global OEMs, most of the world’s leading suppliers, and the majority of North American dealerships. Mobility operates across both the new and used car markets. Mobility provides data and insight on future vehicles sales and production, including detailed forecasts on technology and vehicle components; supplies car makers and dealers with market reporting products, predictive analytics and marketing automation software; and supports dealers with vehicle history reports, used car listings and service retention services. Mobility also sells a range of services to financial institutions, to support their marketing, insurance underwriting and claims management activities; and\n•\nNon-subscription revenue \n— \ntransactional sales of data that are non-cyclical in nature – and that are usually tied to underlying business metrics such as OEM marketing spend or safety recall activity – as well as consulting and advisory services.  \n52\nThe following table provides revenue and segment operating profit information for the periods ended September 30:\n \n(in millions)\nThree Months\nNine Months\n2025\n2024\n% Change\n2025\n2024\n% Change\nRevenue\n$\n445 \n$\n412 \n8%\n$\n1,303 \n$\n1,198 \n9%\nSubscription revenue\n$\n362 \n$\n331 \n9%\n$\n1,062 \n$\n966 \n10%\nNon-subscription revenue\n$\n83 \n$\n81 \n2%\n$\n241 \n$\n232 \n4%\n% of total revenue:\n     Subscription revenue\n81 \n%\n80 \n%\n81 \n%\n81 \n%\n     Non-subscription revenue\n19 \n%\n20 \n%\n19 \n%\n19 \n%\nU.S. revenue\n$\n367 \n$\n338 \n9%\n$\n1,081 \n$\n986 \n10%\nInternational revenue\n$\n78 \n$\n74 \n4%\n$\n221 \n$\n212 \n4%\n% of total revenue:\n     U.S. revenue\n82 \n%\n82 \n%\n83 \n%\n82 \n%\n     International revenue\n18 \n%\n18 \n%\n17 \n%\n18 \n%\nOperating profit \n1\n$\n117 \n$\n97 \n21%\n$\n307 \n$\n247 \n24%\nOperating margin %\n26 \n%\n23 \n%\n24 \n%\n21 \n%\n1\n  Operating profit for the three and nine months ended September 30, 2025 includes employee severance charges of $6 million and $11 million, respectively, an Executive Leadership Team transition benefit of $4 million, a legal settlement recovery of $3 million and acquisition-related costs of $1 million. Operating profit for the three and nine months ended September 30, 2024 includes IHS Markit merger costs of $1 million and $2 million, respectively. Operating profit for the nine months ended September 30, 2024 includes employee severance charges of $7 million and acquisition-related costs of $1 million. Additionally, operating profit includes amortization of intangibles from acquisitions of $76 million for the three months ended September 30, 2025 and 2024, and $228 million and $227 million for the nine months ended September 30, 2025 and 2024, respectively. \nThree Months \nRevenue increased 8% primarily due to growth within the Dealer and Financial businesses driven by continued new business growth within the Dealer business and strong underwriting volumes and market share growth within the Financial business. Additionally, the Dealer and Financial businesses were favorably impacted by improved contract terms. Non-subscription revenue was unfavorably impacted by the tightening of Manufacturing businesses’ discretionary budgets due to market conditions around tariffs and uncertainty around EV adoption; together with lower recall activity. Foreign exchange rates had a favorable impact of less than 1 percentage point.\nOperating profit increased 21%. Excluding the impact of an Executive Leadership Team transition benefit in 2025 of 23 percentage points, a legal settlement recovery in 2025 of 16 percentage points and IHS Markit merger costs in 2024 of 5 percentage points, partially offset by higher employee severance costs in 2025 of 31 percentage points and higher acquisition-related costs in 2025 of 3 percentage points, operating profit increased 11%. The increase was primarily driven by revenue growth, partially offset by higher compensation costs driven by annual merit increases and additional headcount and an increase in advertising and promotion costs. Foreign exchange rates had a favorable impact of 4 percentage points.\nNine Months\nRevenue increased 9% primarily due to growth within the Dealer and Financial businesses driven by continued new business growth within the Dealer business, strong underwriting volumes and market share growth within the Financial business. Additionally, the Dealer and Financial businesses were favorably impacted by favorably impacted by improved contract terms. Non-subscription revenue was unfavorably impacted by the tightening of Manufacturing businesses’ discretionary budgets due to market conditions around tariffs and uncertainty around EV adoption; together with lower recall activity. Foreign exchange rates had an unfavorable impact of less than 1 percentage point.\n53\nOperating profit increased 24%. Excluding the impact of an Executive Leadership Team transition benefit in 2025 of 11 percentage points, a legal settlement recovery in 2025 of 8 percentage points and IHS Markit merger costs in 2024 of 6 percentage points, partially offset by higher employee severance costs in 2025 of 11 percentage points and higher amortization of intangibles from acquisitions in 2025 of 1 percentage point, operating profit increased 11%. The increase was primarily driven by revenue growth, partially offset by higher compensation costs driven by annual merit increases and additional headcount, an increase in advertising and promotion costs and an increase in strategic investments. Foreign exchange rates had a favorable impact of less than 1 percentage point.\n \nFor a further discussion of competitive and other risks inherent in our Mobility business, see Item 1A,\n Risk Factors \nin this Form 10-Q and our most recently filed Annual Report on Form 10-K. For a further discussion of the legal and regulatory matters see Note 12 – \nCommitments and Contingencies \nto the consolidated financial statements of this Form 10-Q.\nIndices\n \nIndices is a global index provider maintaining a wide variety of valuation and index benchmarks for investment advisors, wealth managers and institutional investors. Indices’ mission is to provide transparent benchmarks to help with decision making, collaborate with the financial community to create innovative products, and provide investors with tools to monitor world markets.  \nOn October 1, 2025, we completed the acquisition of ARC Research, a subsidiary of ARC Group, the leading independent provider of investment performance data, benchmarking capabilities and insights in the private wealth market. The acquisition is part of our Indices segment and expands our capabilities to deliver innovative, high-quality benchmarks and data solutions tailored to the evolving needs of wealth managers, private banks, and financial advisers. The acquisition of ARC Research is not expected to be material to our consolidated financial statements.\nIndices derives revenue from asset-linked fees when investors direct funds into its proprietary designed or owned indexes, sales usage-based royalties of its indices, as well as data subscription arrangements. Specifically, Indices generates revenue from the following sources:\n•\nInvestment vehicles \n—\n asset-linked fees such as ETFs and mutual funds, that are based on the S&P Dow Jones Indices’ benchmarks that generate revenue through fees based on assets and underlying funds;\n•\nExchange traded derivatives \n—\n generate sales usage-based royalties based on trading volumes of derivatives contracts listed on various exchanges;\n•\nIndex-related licensing fees \n—\n fixed or variable annual and per-issue asset-linked fees for over-the-counter derivatives and retail-structured products; and\n•\nData and customized index subscription fees \n—\n fees from supporting index fund management, portfolio analytics and research.\n \n54\nThe following table provides revenue and segment operating profit information for the periods ended September 30:\n \n(in millions)\nThree Months\nNine Months\n2025\n2024\n% Change\n2025\n2024\n% Change\nRevenue\n$\n462 \n$\n416 \n11%\n$\n1,352 \n$\n1,193 \n13%\nAsset-linked fees\n$\n303 \n$\n266 \n14%\n$\n876 \n$\n756 \n16%\nSubscription revenue\n$\n82 \n$\n74 \n10%\n$\n237 \n$\n218 \n9%\nSales usage-based royalties\n$\n77 \n$\n76 \n1%\n$\n239 \n$\n219 \n9%\n% of total revenue:\n     Asset-linked fees\n65 \n%\n64 \n%\n65 \n%\n63 \n%\n     Subscription revenue\n18 \n%\n18 \n%\n17 \n%\n18 \n%\n     Sales usage-based royalties\n17 \n%\n18 \n%\n18 \n%\n19 \n%\nU.S. revenue\n$\n372 \n$\n339 \n10%\n$\n1,087 \n$\n970 \n12%\nInternational revenue\n$\n90 \n$\n77 \n16%\n$\n265 \n$\n223 \n19%\n% of total revenue:\n     U.S. revenue\n81 \n%\n81 \n%\n80 \n%\n81 \n%\n     International revenue\n19 \n%\n19 \n%\n20 \n%\n19 \n%\nOperating profit \n1\n$\n317 \n$\n282 \n12%\n$\n941 \n$\n816 \n15%\nLess: net operating profit attributable to noncontrolling interests\n83 \n70 \n238 \n208 \nNet operating profit\n$\n234 \n$\n212 \n11%\n$\n703 \n$\n608 \n16%\nOperating margin %\n69 \n%\n68 \n%\n70 \n%\n68 \n%\nNet operating margin %\n51 \n%\n51 \n%\n52 \n%\n51 \n%\n1\n  Operating profit for the three and nine months ended September 30, 2025 includes employee severance charges of $1 million and acquisition-related costs of $1 million. Operating profit for the three and nine months ended September 30, 2024 includes IHS Markit merger costs of $1 million and $4 million, respectively. Operating profit for the nine months ended September 30, 2024 includes a loss on disposition of $1 million and employee severance charges of $1 million. Additionally, operating profit includes amortization of intangibles from acquisitions of $9 million for the three months ended September 30, 2025 and 2024 and $27 million for the nine months ended September 30, 2025 and 2024.\nThree Months\nRevenue at Indices increased 11% primarily due to an increase in asset linked fees revenue driven by higher levels of assets under management (“AUM”) for ETFs and mutual funds and higher data subscription revenue. Ending AUM for ETFs increased 24% to $5.172 trillion compared to September 30, 2024 and average levels of AUM for ETFs increased 26% to $4.937 trillion compared to the three months ended September 30, 2024. Foreign exchange rates had a favorable impact of less than 1 percentage point.\nOperating profit increased 12% due to revenue growth and decreased incentive costs, partially offset by higher compensation costs driven by annual merit increases, and an increase in strategic investments. Foreign exchange rates had an unfavorable impact of 1 percentage point.\nNine Months\nRevenue at Indices increased 13% primarily due to an increase in asset linked fees revenue driven by higher levels of AUM for ETFs and mutual funds, higher exchange-traded derivative revenue and higher data subscription revenue. Ending AUM for ETFs increased 24% to $5.172 trillion compared to September 30, 2024 and average levels of AUM for ETFs increased 25% to $4.592 trillion compared to the nine months ended September 30, 2024. Foreign exchange rates had a favorable impact of less than 1 percentage point.\n55\nOperating profit increased 15%. Excluding the impact of IHS Markit merger costs in 2024 of 1 percentage point, operating profit increased 14% due to revenue growth and decreased incentive costs, partially offset by higher compensation costs driven by annual merit increases, and an increase in strategic investments. Foreign exchange rates had an unfavorable impact of less than 1 percentage point.\nFor a further discussion of competitive and other risks inherent in our Indices business, see Item 1A,\n Risk Factors \nin this Form 10-Q and our most recently filed Annual Report on Form 10-K. For a further discussion of the legal and regulatory matters see Note 12 – \nCommitments and Contingencies \nto the consolidated financial statements of this Form 10-Q. \nLIQUIDITY AND CAPITAL RESOURCES\nWe continue to maintain a strong financial position. Our primary source of funds for operations is cash from our businesses. Cash on hand, cash flows from operations and availability under our existing credit facility are expected to be sufficient to meet any additional operating and recurring cash needs into the foreseeable future. We use our cash for a variety of needs, including but not limited to: ongoing investments in our businesses, strategic acquisitions, share repurchases, dividends, repayment of debt, capital expenditures and investment in our infrastructure.\nCash Flow Overview\nCash, cash equivalents, and restricted cash were $1,672 million as of September 30, 2025, an increase of $6 million from December 31, 2024.\nThe following table provides cash flow information for the nine months ended September 30:\n(in millions)\n2025\n2024\n% Change\nNet cash provided by (used for):\nOperating activities\n$\n3,903 \n$\n3,949 \n(1)%\nInvesting activities\n$\n(232)\n$\n(262)\n(11)%\nFinancing activities\n$\n(3,728)\n$\n(3,280)\n14%\nIn the first nine months of 2025, free cash flow decreased $125 million to $3,520 million compared to $3,645 million in the first nine months of 2024. The decrease is primarily due to a decrease in operating activities as discussed below and an increase in cash used for capital expenditures and distributions to noncontrolling interest holders. Free cash flow is a non-GAAP financial measure and reflects our cash flow provided by operating activities less capital expenditures and distributions to noncontrolling interest holders. Capital expenditures include purchases of property and equipment and additions to technology projects. See “Reconciliation of Non-GAAP Financial Information” below for a reconciliation of cash flow provided by operating activities, the most directly comparable U.S. GAAP financial measure, to free cash flow.\nOperating activities\nCash provided by operating activities decreased $46 million to $3,903 million for the first nine months of 2025 compared to 2024. This is primarily attributable to higher compensation payments in 2025, higher tax payments in 2025 and proceeds received from the termination of interest rate swaps in 2024, partially offset by higher operating results in 2025.\nThe OECD introduced an international tax framework under Pillar Two which includes a global minimum tax of 15%. This framework has been implemented by several jurisdictions, including jurisdictions in which we operate, with effect from January 1, 2024, and many other jurisdictions, including jurisdictions in which we operate, are in the process of implementing it. The effect of enacted Pillar Two taxes has been included in the results disclosed and did not have a significant impact on our consolidated financial statements.\nIn June 2025, G7 reached an agreement with the U.S. regarding the application of the OECD global minimum tax rules to U.S. companies, which would exempt U.S. companies from OECD’s global minimum tax rules, and in return the U.S. withdrew proposed section 899 from OBBBA, which would have imposed retaliatory taxes on non-U.S. businesses. We are continuing to monitor implementation dates of this agreement and will be evaluating the impact on our financial statements once more details are available.\n56\nInvesting activities    \nOur cash outflows from investing activities are primarily for acquisitions and capital expenditures, while cash inflows are primarily proceeds from dispositions.\nCash used for investing activities decreased to $232 million for the first nine months of 2025 compared to $262 million in the first nine months of 2024, primarily due to higher cash paid for acquisitions in 2024, partially offset by higher proceeds from dispositions in 2024, higher capital expenditures and cash paid for short- term investments in 2025.\nFinancing activities\nOur cash outflows from financing activities consist primarily of share repurchases, dividends to shareholders and repayments of short-term and long-term debt, while cash inflows are primarily attributable to the borrowing of short-term and long-term debt.\nCash used for financing activities increased $448 million to $3,728 million for the first nine months of 2025. The increase is primarily attributable to an increase in cash used for share repurchases in 2025. \nDuring the nine months ended September 30, 2025, we purchased a total of 4.3 million shares for $2.5 billion of cash. During the nine months ended September 30, 2024, we purchased a total of 3.8 million shares for $2 billion of cash. See Note 8 \n—\n \nEquity \nto the consolidated financial statements of this Form 10-Q for further discussion.\nAdditional Financing\nWe have the ability to borrow a total of $2.0 billion through our commercial paper program, which is supported by our $2.0 billion five-year credit agreement (our “credit facility”) that will terminate on December 17, 2029. As of September 30, 2025, and December 31, 2024, we had no outstanding commercial paper. \nCommitment fees for the unutilized commitments under the credit facility and applicable margins for borrowings thereunder are linked to the Company achieving three environmental sustainability performance indicators related to emissions, tested annually. We currently pay a commitment fee of 8 basis points. There will be no sustainability pricing adjustment to our commitment fees or our margins under the credit facility for the approximately year-long period beginning April 7, 2025 as a result of our emissions performance for the year ended December 31, 2024. The credit facility contains customary affirmative and negative covenants and customary events of default. The occurrence of an event of default could result in an acceleration of the obligations under the credit facility.\nT\nhe only financial covenant in our credit facility is a requirement that our indebtedness to cash flow ratio, as defined in our credit facility, is not greater than 4 to 1, and this ratio\n has never been exceeded.\nDividends\nOn January 28, 2025, the Board of Directors approved a quarterly common stock dividend of $0.96 per share. \nSupplemental Guarantor Financial Information\nThe senior notes described below were issued by S&P Global Inc. and are fully and unconditionally guaranteed by Standard & Poor's Financial Services LLC, a 100% owned subsidiary of the Company. \n•\nOn August 22, 2024, S&P Global Inc. issued $746 million of 5.25% Senior Notes due 2033 that have been registered with the SEC and guaranteed by Standard & Poor’s Financial Services LLC in exchange for unregistered senior notes of like principal amounts and terms that were originally issued on September 12, 2023.\n•\nOn March 1, 2023, S&P Global Inc. issued new senior notes that have been registered with the SEC and guaranteed by Standard & Poor’s Financial Services LLC in exchange for the following series of unregistered senior notes of like principal amount and terms:\n•\n$700 million of 4.75% Senior Notes due 2028 that were originally issued on March 2, 2022;\n•\n$921 million of 4.25% Senior Notes due 2029 that were originally issued on March 2, 2022;\n•\n$1,237 million of 2.45% Senior Notes due 2027 that were originally issued on March 18, 2022;\n•\n$1,227 million of 2.70% Sustainability-Linked Senior Notes due 2029 that were originally issued on March 18, 2022;\n•\n$1,492 million of 2.90% Senior Notes due 2032 that were originally issued on March 18, 2022;\n57\n•\n$974 million of 3.70% Senior Notes due 2052 that were originally issued on March 18, 2022; and\n•\n$500 million of 3.90% Senior Notes due 2062 that were originally issued on March 18, 2022.\n•\nOn August 13, 2020, we issued $600 million of 1.25% senior notes due in 2030 and $700 million of 2.3% senior notes due in 2060. \n•\nOn November 26, 2019, we issued $500 million of 2.5% senior notes due in 2029 and $600 million of 3.25% senior notes due in 2049.\n•\nOn May 17, 2018, we issued $500 million of 4.5% senior notes due in 2048.\n•\nOn September 22, 2016, we issued $500 million of 2.95% senior notes due in 2027. \n•\nOn November 2, 2007, we issued $400 million of 6.55% Senior Notes due 2037.\nThe notes above are unsecured and unsubordinated and rank equally and ratably with all of our existing and future unsecured and unsubordinated debt. The guarantees are the subsidiary guarantor’s unsecured and unsubordinated debt and rank equally and ratably with all of the subsidiary guarantor’s existing and future unsecured and unsubordinated debt.\nThe guarantees of the subsidiary guarantor may be released and discharged upon (i) a sale or other disposition (including by way of consolidation or merger) of the subsidiary guarantor or the sale or disposition of all or substantially all the assets of the subsidiary guarantor (in each case other than to the Company or a person who, prior to such sale or other disposition, is an affiliate of the Company); (ii) upon defeasance or discharge of any applicable series of the notes, as described above; or (iii) at such time as the subsidiary guarantor ceases to guarantee indebtedness for borrowed money, other than a discharge through payment thereon, under any Credit Facility of the Company, other than any such Credit Facility of the Company the guarantee of which by the subsidiary guarantor will be released concurrently with the release of the subsidiary guarantor’s guarantees of the notes.\n \nOther subsidiaries of the Company do not guarantee the registered debt securities of either S&P Global Inc. or Standard & Poor's Financial Services LLC (the  “Obligor Group”) which are referred to as the “Non-Obligor Group”.\nThe following tables set forth the summarized financial information of the Obligor Group on a combined basis. This  summarized financial information excludes the Non-Obligor Group. Intercompany balances and transactions between members of the Obligor Group have been eliminated. This information is not intended to present the financial position or results of operations of the Obligor Group in accordance with U.S. GAAP.\n \nSummarized results of operations for the periods ended September 30, 2025 are as follows: \n(in millions)\nThree Months\nNine Months\nRevenue\n$\n1,173 \n$\n3,333 \nOperating Profit \n879 \n2,463 \nNet Income \n565 \n1,873 \nNet income attributable to S&P Global Inc. \n565 \n1,873 \nSummarized balance sheet information as of September 30, 2025 and December 31, 2024 is as follows:\n(in millions)\nSeptember 30, \nDecember 31, \n2025\n2024\nCurrent assets (excluding intercompany from Non-Obligor Group)\n$\n1,031 \n$\n1,400 \nNon-current assets\n766 \n782 \nCurrent liabilities (excluding intercompany to Non-Obligor Group)\n361 \n339 \nNon-current liabilities \n11,467 \n11,541 \nIntercompany payables to Non-Obligor Group \n17,698 \n16,100 \nRECONCILIATION OF NON-GAAP FINANCIAL INFORMATION\nFree cash flow is a non-GAAP financial measure and reflects our cash flow provided by operating activities less capital expenditures and distributions to noncontrolling interest holders. Capital expenditures include purchases of property and equipment and additions to technology projects. Our cash flow provided by operating activities is the most directly comparable U.S. GAAP financial measure to free cash flow. \nWe believe the presentation of free cash flow allows our investors to evaluate the cash generated from our underlying operations in a manner similar to the method used by management. We use free cash flow to conduct and evaluate our business \n58\nbecause we believe it typically presents a more conservative measure of cash flows since capital expenditures and distributions to noncontrolling interest holders are considered a necessary component of ongoing operations. Free cash flow is useful for management and investors because it allows management and investors to evaluate the cash available to us to prepay debt, make strategic acquisitions and investments and repurchase stock.\nThe presentation of free cash flow is not intended to be considered in isolation or as a substitute for the financial information prepared and presented in accordance with U.S. GAAP. Free cash flow, as we calculate it, may not be comparable to similarly titled measures employed by other companies. The following table presents a reconciliation of our cash flow provided by operating activities to free cash flow for the nine months ended September 30:\n \n(in millions)\n2025\n2024\n% Change\nCash provided by operating activities\n$\n3,903 \n$\n3,949 \n(1)%\nCapital expenditures\n(149)\n(91)\nDistributions to noncontrolling interest holders\n(234)\n(213)\nFree cash flow\n$\n3,520 \n$\n3,645 \n(3)%\n(in millions)\n2025\n2024\n% Change\nCash used for investing activities\n(232)\n(262)\n(11)%\nCash used for financing activities\n(3,728)\n(3,280)\n14%\nCRITICAL ACCOUNTING ESTIMATES\nOur accounting policies are described in Note 1 \n—\n \nAccounting Policies\n to the consolidated financial statements in our most recent Form 10-K. As discussed in Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n, in our most recent Form 10-K, we consider an accounting estimate to be critical if it required assumptions to be made that were uncertain at the time the estimate was made and changes in the estimate or different estimates could have a material effect on our results of operations. These critical estimates include those related to revenue recognition, business combinations, allowance for doubtful accounts, valuation of long-lived assets, goodwill and other intangible assets, pension plans, incentive compensation and stock-based compensation, income taxes, contingencies and redeemable noncontrolling interests. We base our estimates on historical experience, current developments and on various other assumptions that we believe to be reasonable under these circumstances, the results of which form the basis for making judgments about carrying values of assets and liabilities that cannot readily be determined from other sources. There can be no assurance that actual results will not differ from those estimates. Since the date of our most recent Form 10-K, there have been no material changes to our critical accounting estimates.\nRECENTLY ISSUED OR ADOPTED ACCOUNTING STANDARDS\nSee Note 13 – \nRecently Issued or Adopted Accounting Standards\n to the consolidated financial statements of this Form 10-Q for further information.\n59\nFORWARD-LOOKING STATEMENTS\nThis report contains “forward-looking statements,” as defined in the Private Securities Litigation Reform Act of 1995.  These statements, which express management’s current views concerning future events, trends, contingencies or results, appear at various places in this report and use words like “anticipate,” “assume,” “believe,” “continue,” “estimate,” “expect,” “forecast,” “future,” “intend,” “plan,” “potential,” “predict,” “project,” “strategy,” “target” and similar terms, and future or conditional tense verbs like “could,” “may,” “might,” “should,” “will” and “would.” For example, management may use forward-looking statements when addressing topics such as: the outcome of contingencies; future actions by regulators; changes in the Company’s business strategies and methods of generating revenue; the development and performance of the Company’s services and products; the expected impact of acquisitions and dispositions; the Company’s effective tax rates; the Company’s cost structure, dividend policy, cash flows or liquidity; and the anticipated separation of Mobility into a standalone public company.\nForward-looking statements are subject to inherent risks and uncertainties. Factors that could cause actual results to differ materially from those expressed or implied in forward-looking statements include, among other things:\n•\nworldwide economic, financial, political, and regulatory conditions (including slower GDP growth or recession, restrictions on trade (e.g., tariffs), instability in the banking sector and inflation), and factors that contribute to uncertainty and volatility (e.g., supply chain risk), natural and man-made disasters, civil unrest, public health crises (e.g., pandemics), geopolitical uncertainty (including military conflict), and conditions that result from legislative, regulatory, trade and policy changes, including from the U.S. administration;\n•\nthe volatility and health of debt, equity, commodities, energy and automotive markets, including credit quality and spreads, the composition and mix of credit maturity profiles, the level of liquidity and future debt issuances, equity flows from active to passive, fluctuations in average asset prices in global equities, demand for investment products that track indices and assessments and trading volumes of certain exchange traded derivatives;\n•\nthe demand and market for credit ratings in and across the sectors and geographies where the Company operates;\n•\nthe Company’s ability to maintain adequate physical, technical and administrative safeguards to protect the security of confidential information and data, and the potential for a system or network disruption that results in regulatory penalties and remedial costs or improper disclosure of confidential information or data;\n•\nthe outcome of litigation, government and regulatory proceedings, investigations and inquiries;\n•\nconcerns in the marketplace affecting the Company’s credibility or otherwise affecting market perceptions of the integrity or utility of independent credit ratings, benchmarks, indices and other services;\n•\nthe level of merger and acquisition activity in the United States and abroad;\n•\nthe level of the Company’s future cash flows and capital investments;\n•\nthe effect of competitive products (including those incorporating generative artificial intelligence (\"AI\")) and pricing, including the level of success of new product developments and global expansion;\n•\nthe impact of customer cost-cutting pressures;\n•\na decline in the demand for our products and services by our customers and other market participants;\n•\nour ability to develop new products or technologies, to integrate our products with new technologies (e.g., AI), or to compete with new products or technologies offered by new or existing competitors;\n•\nour ability to attract, incentivize and retain key employees, especially in a competitive business environment;\n•\nour ability to successfully navigate key organizational changes, including among our executive leadership;\n•\nthe Company’s exposure to potential criminal sanctions or civil penalties for noncompliance with foreign and U.S. laws and regulations that are applicable in the jurisdictions in which it operates, including sanctions laws relating to countries such as Iran, Russia and Venezuela, anti-corruption laws such as the U.S. Foreign Corrupt Practices Act and the U.K. Bribery Act of 2010, and local laws prohibiting corrupt payments to government officials, as well as import and export restrictions;\n•\nthe continuously evolving regulatory environment in Europe, the United States and elsewhere around the globe affecting each of our businesses and the products they offer, and our compliance therewith;\n•\nthe Company’s ability to make acquisitions and dispositions and successfully integrate the businesses we acquire;\n•\nconsolidation of the Company’s customers, suppliers or competitors;\n•\nthe introduction of competing products or technologies by other companies; \n•\nthe ability of the Company, and its third-party service providers, to maintain adequate physical and technological infrastructure;\n•\nthe Company’s ability to successfully recover from a disaster or other business continuity problem, such as an earthquake, hurricane, flood, civil unrest, protests, military conflict, terrorist attack, outbreak of pandemic or contagious diseases, security breach, cyber attack, data breach, power loss, telecommunications failure or other natural or man-made event;\n•\nthe impact on the Company’s revenue and net income caused by fluctuations in foreign currency exchange rates;\n•\nthe impact of changes in applicable tax or accounting requirements on the Company;\n•\nthe separation of Mobility not being consummated within the anticipated time period or at all;\n60\n•\nthe ability of the separation of Mobility to qualify for tax-free treatment for U.S. federal income tax purposes;\n•\nany disruption to the Company’s business in connection with the proposed separation of Mobility; \n•\nany loss of synergies from separating the businesses of Mobility and the Company that adversely impact the results of operations of both businesses, or the companies resulting from the separation of Mobility not realizing all of the expected benefits of the separation; and\n•\nfollowing the separation of Mobility, the combined value of the common stock of the two publicly-traded companies not being equal to or greater than the value of the Company’s common stock had the separation not occurred.\nThe factors noted above are not exhaustive. The Company and its subsidiaries operate in a dynamic business environment in which new risks emerge frequently. Accordingly, the Company cautions readers not to place undue reliance on any forward-looking statements, which speak only as of the dates on which they are made. The Company undertakes no obligation to update or revise any forward-looking statement to reflect events or circumstances arising after the date on which it is made, except as required by applicable law. Further information about the Company’s businesses, including information about factors that could materially affect its results of operations and financial condition, is contained in the Company’s filings with the SEC, including Item 1A, \nRisk Factors\n in this Form 10-Q and Item 1A, \nRisk Factors\n in our most recently filed Annual Report on Form 10-K.\n61"
}