{
  "source_file": "sre-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nPage\nOverview\n96\nResults of Operations by Registrant\n97\nSempra\n97\nSDG&E\n110\nSoCalGas\n113\nCapital Resources and Liquidity\n117\nCritical Accounting Estimates\n134\nNew Accounting Standards\n134\nOVERVIEW\nThis combined MD&A includes the operational and financial results of the following three Registrants: \n▪\nSempra\n is a California-based holding company with energy infrastructure investments in North America. Our businesses invest in, develop and operate energy infrastructure, and provide electric and gas services to customers.\n▪\nSDG&E\n is a regulated public utility that provides electric service to San Diego and southern Orange counties and natural gas service to San Diego County.\n▪\nSoCalGas\n is a regulated public natural gas distribution utility, serving customers throughout most of Southern California and part of central California.\nThis combined MD&A should be read in conjunction with the Condensed Consolidated Financial Statements and the Notes thereto in this report, and the Consolidated Financial Statements and the Notes thereto, “Part I – Item 1A. Risk Factors” and “Part II – Item 7. MD&A” in the Annual Report.\nSempra has the following three reportable segments, which reflect how the CODM oversees operational and financial performance:\n▪\nSempra California\n▪\nSempra Texas Utilities\n▪\nSempra Infrastructure\nSDG&E and SoCalGas each has one reportable segment.\n96\nTable of Contents\nRESULTS OF OPERATIONS BY REGISTRANT\nThroughout this MD&A, our references to earnings represent earnings attributable to common shares. Variance amounts presented are the after-tax earnings impact (based on applicable statutory tax rates unless otherwise noted) and after NCI but before foreign currency and inflation effects, where applicable.\nWe discuss herein Sempra’s results of operations and significant changes in earnings, revenues and costs by segment, as well as Parent and other, for the three months (Q3) and nine months (YTD) ended September 30, 2025 compared to the same periods in 2024. We also discuss herein the impact of foreign currency and inflation rates on Sempra’s results of operations.\nDue to the delay in the issuance of the CPUC’s FD in the SDG&E and SoCalGas 2024 GRC, Sempra California recorded revenues in the first three quarters of 2024 based on levels authorized for 2023 under the 2019 GRC. In December 2024, the CPUC approved an FD in the 2024 GRC, effective retroactive to January 1, 2024, for which Sempra California recorded the retroactive impacts in the fourth quarter of 2024. Sempra California’s authorized base revenues in the first three quarters of 2025 are based on the revenues authorized for the 2024 test year plus the amount authorized for attrition for 2025. We provide additional information on the 2024 GRC FD in Note 4 of the Notes to Condensed Consolidated Financial Statements in this report and in Note 4 of the Notes to Consolidated Financial Statements in the Annual Report.\nRESULTS OF OPERATIONS\nRESULTS OF OPERATIONS\n(Dollars and shares in millions, except per share amounts)\nEARNINGS (LOSSES) BY SEGMENT\n \n(Dollars in millions)\n \n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n2025\n2024\nSempra:\nSempra California\n$\n370 \n$\n247 \n$\n1,353 \n$\n1,145 \nSempra Texas Utilities\n306 \n261 \n660 \n646 \nSempra Infrastructure\n(580)\n230 \n(362)\n652 \nSegment earnings attributable to common shares\n96 \n738 \n1,651 \n2,443 \nParent and other\n(19)\n(100)\n(207)\n(291)\nEarnings attributable to common shares\n$\n77 \n$\n638 \n$\n1,444 \n$\n2,152 \n97\nTable of Contents\nSempra California\nSempra California’s earnings are comprised of SDG&E and SoCalGas. Because changes in SDG&E’s and SoCalGas’ cost of natural gas and/or electricity are recovered in rates, changes in these costs are offset in the changes in revenues and therefore do not impact earnings, other than potential impacts related to the GCIM for SoCalGas that we describe below. In addition to the changes in cost or market prices, natural gas or electric revenues recorded during a period are impacted by the difference between customer billings and recorded or CPUC-authorized amounts. These differences are required to be balanced over time, resulting in over- and undercollected regulatory balancing accounts. We discuss balancing accounts and their effects further in Note 4 of the Notes to Condensed Consolidated Financial Statements in this report and in Note 4 of the Notes to Consolidated Financial Statements in the Annual Report.\nIn the three months ended September 30, 2025 compared to the same period in 2024, the increase in earnings of $123 million (50%) was primarily due to:\n▪\n$92 million higher income tax benefits primarily from flow-through items, including impacts from the election to accelerate self-developed software deductions, and from the resolution of prior year income tax items\n▪\n$47 million higher CPUC base operating margin, net of operating expenses including higher depreciation and $9 million lower authorized cost of capital. In the first three quarters of 2024, Sempra California recorded CPUC-authorized base revenues based on 2023 authorized levels\nOffset by:\n▪\n$16 million higher net interest expense\nIn the nine months ended September 30, 2025 compared to the same period in 2024, the increase in earnings of $208 million (18%) was primarily due to:\n▪\n$134 million higher income tax benefits primarily from flow-through items, including gas repairs tax benefits (which in the first three quarters of 2024 were recorded as a regulatory liability that was released in the fourth quarter of 2024 as a result of the 2024 GRC FD) and impacts from the election to accelerate self-developed software deductions, and from the resolution of prior year income tax items\n▪\n$119 million higher CPUC base operating margin, net of operating expenses including higher depreciation and $31 million lower authorized cost of capital. In the first three quarters of 2024, Sempra California recorded CPUC-authorized base revenues based on 2023 authorized levels\n▪\n$10 million regulatory award approved by the CPUC in 2025\n▪\n$7 million higher net regulatory interest income\n▪\n$7 million higher electric transmission margin\nOffset by:\n▪\n$48 million higher net interest expense\n▪\n$25 million from disallowed regulatory recovery of COVID-19 costs\nSempra Texas Utilities\nIn the three months ended September 30, 2025 compared to the same period in 2024, the increase in earnings of $45 million (17%) was primarily due to higher equity earnings from Oncor Holdings driven by:\n▪\noverall higher revenues primarily attributable to:\n◦\nrate updates to reflect increases in invested capital\n◦\nincrease due to Oncor’s SRP and the UTM\nOffset by:\n▪\nhigher interest expense and depreciation expense associated with increases in invested capital\n▪\nhigher O&M\n98\nTable of Contents\nIn the nine months ended September 30, 2025 compared to the same period in 2024, the increase in earnings of $14 million (2%) was primarily due to higher equity earnings from Oncor Holdings driven by:\n▪\noverall higher revenues primarily attributable to:\n◦\nrate updates to reflect increases in invested capital\n◦\nincrease due to Oncor’s SRP and the establishment of the UTM\n◦\ncustomer growth\nOffset by:\n▪\nhigher interest expense and depreciation expense associated with increases in invested capital\n▪\nhigher O&M\nSempra Infrastructure\n \nIn the three months ended September 30, 2025 compared to the same period in 2024, losses were $580 million compared to earnings of $230 million primarily due to:\n▪\n$705 million income tax expense in 2025 to adjust deferred income tax liabilities related to outside basis differences in our investment in SI Partners as a result of management’s decision to classify the asset as held for sale\n▪\n$100 million unfavorable impact from foreign currency and inflation effects on our monetary positions in Mexico, comprised of a $32 million unfavorable impact in 2025 compared to a $68 million favorable impact in 2024\n▪\n$26 million unfavorable impact related to a customer’s early termination of firm transportation agreements, including interest expense\n▪\n$18 million lower income tax benefit primarily from outside basis differences\n▪\n$10 million higher O&M in 2025 from higher provisions for expected credit losses\nOffset by:\n▪\n$26 million from asset and supply optimization driven by higher optimization of transport and storage contracts offset by unrealized losses on commodity derivatives in 2025 compared to unrealized gains on commodity derivatives in 2024 due to changes in natural gas prices\n▪\n$9 million higher revenues driven by satisfaction of performance obligations related to customer payments received in advance from a contract modification in December 2024 on an LNG storage and regasification agreement\nIn the nine months ended September 30, 2025 compared to the same period in 2024, losses were $362 million compared to earnings of $652 million primarily due to:\n▪\n$731 million income tax expense in 2025 as a result of management’s decision to classify SI Partners and Ecogas as held for sale, comprised of the following:\n◦\n$705 million income tax expense to adjust deferred income tax liabilities related to outside basis differences in our investment in SI Partners\n◦\n$26 million income tax expense due to the recognition of a deferred tax liability on our outside basis difference in Ecogas\n▪\n$302 million unfavorable impact from foreign currency and inflation effects on our monetary positions in Mexico, comprised of a $122 million unfavorable impact in 2025 compared to a $180 million favorable impact in 2024\n▪\n$26 million unfavorable impact related to a customer’s early termination of firm transportation agreements, including interest expense\n▪\n$17 million from TdM driven by lower volumes and lower power prices and unrealized losses in 2025 compared to unrealized gains in 2024 on commodity derivatives due to changes in power prices\n▪\n$16 million lower income tax benefit primarily from outside basis differences\n▪\n$9 million interest expense from unrealized losses in 2025 on interest rate swaps related to the PA LNG Phase 1 project\nOffset by:\n▪\n$26 million higher revenues driven by satisfaction of performance obligations related to customer payments received in advance from a contract modification in December 2024 on an LNG storage and regasification agreement\n▪\n$22 million from asset and supply optimization driven by higher optimization of transport and storage contracts and higher LNG diversion fees offset by higher unrealized losses on commodity derivatives due to changes in natural gas prices\n▪\n$12 million higher net interest income from a change in the fair value of the Support Agreement and higher capitalization of interest expense in 2025 from projects under construction\n▪\n$7 million higher revenues due to the commencement of commercial operations at the Topolobampo marine terminal in June 2024\n99\nTable of Contents\nParent and Other\nIn the three months ended September 30, 2025 compared to the same period in 2024, the decrease in losses of $81 million was primarily due to:\n▪\n$191 million net income tax benefit in 2025 from changes to a valuation allowance against certain tax credit carryforwards offset by changes in state income tax apportionment as a result of management’s decision to classify SI Partners as held for sale\n▪\n$22 million income tax benefit in 2025 from the impacts of the OBBBA \n▪\n$17 million income tax expense in 2024 from changes to a valuation allowance against certain tax credit carryforwards\nOffset by: \n▪\n$78 million income tax expense in 2025 from changes to a valuation allowance against foreign tax credits that were carried forward from the implementation of the TCJA\n▪\n$30 million higher net interest expense\n▪\n$13 million higher income tax expense from the interim period application of an annual forecasted consolidated ETR\n▪\n$11 million preferred deemed dividends related to the notice of redemption of series C preferred stock in September 2025\n▪\n$10 million lower net investment gains on dedicated assets in support of our employee nonqualified benefit plan and deferred compensation plan\nIn the nine months ended September 30, 2025 compared to the same period in 2024, the decrease in losses of $84 million (29%) was primarily due to:\n▪\n$191 million net income tax benefit in 2025 from changes to a valuation allowance against certain tax credit carryforwards offset by changes in state income tax apportionment as a result of management’s decision to classify SI Partners as held for sale\n▪\n$22 million income tax benefit in 2025 from the impacts of the OBBBA\n▪\n$17 million income tax expense in 2024 from changes to a valuation allowance against certain tax credit carryforwards\nOffset by: \n▪\n$78 million income tax expense in 2025 from changes to a valuation allowance against foreign tax credits that were carried forward from the implementation of the TCJA\n▪\n$70 million higher net interest expense\n▪\n$11 million preferred deemed dividends related to the notice of redemption of series C preferred stock in September 2025 \n100\nTable of Contents\nSIGNIFICANT CHANGES IN REVENUES AND COSTS\nThe regulatory framework permits SDG&E and SoCalGas to recover certain program expenditures and other costs authorized by the CPUC (referred to as “refundable programs”).\nUtilities: Natural Gas Revenues and Cost of Natural Gas\nOur utilities revenues include natural gas revenues at Sempra California and Sempra Infrastructure, which includes Ecogas. Intercompany revenues are eliminated in Sempra’s Condensed Consolidated Statements of Operations. \nSDG&E and SoCalGas operate under a regulatory framework that permits the cost of natural gas purchased for core customers to be passed through to customers in rates substantially as incurred and without markup. The GCIM provides for SoCalGas to share in the savings and/or costs from buying natural gas for its core customers at prices below or above monthly market-based benchmarks. This mechanism permits full recovery of costs incurred when average purchase costs are within a price range around the benchmark price. Any higher costs incurred or savings realized outside this range are shared between SoCalGas and its core customers. We provide further discussion in Note 3 of the Notes to Consolidated Financial Statements in the Annual Report.\nUTILITIES: NATURAL GAS REVENUES AND COST OF NATURAL GAS\n(Dollars in millions)\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n2025\n2024\nSempra:\nNatural gas revenues:\n \n \nSempra California\n$\n1,353 \n$\n1,186 \n$\n5,152 \n$\n4,750 \nSempra Infrastructure\n15 \n15 \n59 \n63 \nSegment totals\n1,368 \n1,201 \n5,211 \n4,813 \nEliminations and adjustments\n(5)\n(6)\n(16)\n(15)\nTotal\n$\n1,363 \n$\n1,195 \n$\n5,195 \n$\n4,798 \nCost of natural gas\n(1)\n:\n \nSempra California\n$\n205 \n$\n97 \n$\n871 \n$\n777 \nSempra Infrastructure\n6 \n4 \n21 \n18 \nSegment totals\n211 \n101 \n892 \n795 \nEliminations and adjustments\n(1)\n(2)\n(6)\n(5)\nTotal\n$\n210 \n$\n99 \n$\n886 \n$\n790 \n(1)    \nExcludes depreciation and amortization, which are presented separately on Sempra’s Condensed Consolidated Statements of Operations. \nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra’s natural gas revenues increased by $168 million (14%) driven by Sempra California, which included:\n▪\n$122 million higher CPUC-authorized base revenues, including certain incremental and balanced capital projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD offset by $7 million lower authorized cost of capital\n▪\n$108 million increase in cost of natural gas sold, which we discuss below\n▪\n$58 million higher regulatory revenues, including gas repairs tax benefits, which are offset in income tax (expense) benefit. Gas repairs tax benefits in the first three quarters of 2024 were recorded as a regulatory liability that was released in the fourth quarter of 2024 as a result of the 2024 GRC FD\nOffset by:\n▪\n$65 million lower revenues from incremental and balanced capital projects, including those that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD and lower authorized cost of capital\n▪\n$51 million lower regulatory revenues associated with impacts from the election to accelerate self-developed software deductions, which are offset in income tax (expense) benefit\nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra’s cost of natural gas increased by $111 million driven by Sempra California, primarily due to higher average natural gas prices. \n101\nTable of Contents\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s natural gas revenues increased by $397 million (8%) driven by Sempra California, which included:\n▪\n$430 million higher CPUC-authorized base revenues, including certain incremental and balanced capital projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD offset by $28 million lower authorized cost of capital\n▪\n$103 million higher regulatory revenues, including gas repairs tax benefits, which are offset in income tax (expense) benefit. Gas repairs tax benefits in the first three quarters of 2024 were recorded as a regulatory liability that was released in the fourth quarter of 2024 as a result of the 2024 GRC FD\n▪\n$94 million increase in cost of natural gas sold, which we discuss below\n▪\n$67 million higher revenues associated with refundable programs, which are fully offset in O&M \n▪\n$14 million regulatory award approved by the CPUC in 2025\n▪\n$14 million higher revenues from higher non-service components of net periodic benefit cost, which fully offsets in other income, net\nOffset by:\n▪\n$206 million lower revenues from incremental and balanced capital projects, including those that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD and lower authorized cost of capital\n▪\n$51 million lower regulatory revenues associated with impacts from the election to accelerate self-developed software deductions, which are offset in income tax (expense) benefit \n▪\n$29 million lower revenues from disallowed regulatory recovery of COVID-19 costs\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s cost of natural gas increased by $96 million (12%) driven by Sempra California, which included:\n▪\n$112 million higher average natural gas prices\nOffset by:\n▪\n$18 million lower volumes driven by weather\nUtilities: Electric Revenues and Cost of Electric Fuel and Purchased Power\nOur utilities revenues include electric revenues at Sempra California, substantially all of which is at SDG&E. Intercompany revenues are eliminated in Sempra’s Condensed Consolidated Statements of Operations.\nSDG&E operates under a regulatory framework that permits it to recover the actual cost incurred to generate or procure electricity based on annual estimates of the cost of electricity supplied to customers. The differences in cost between estimates and actual are recovered or refunded in subsequent periods through rates.\nUtility cost of electric fuel and purchased power includes utility-owned generation, power purchased from third parties, and net power purchases and sales to/from the California ISO.\nUTILITIES: ELECTRIC REVENUES AND COST OF ELECTRIC FUEL AND PURCHASED POWER\n(Dollars in millions)\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n2025\n2024\nSempra:\nElectric revenues:\nSempra California\n$\n1,260 \n$\n1,070 \n$\n3,352 \n$\n3,272 \nEliminations and adjustments\n— \n(1)\n(2)\n(3)\nTotal\n$\n1,260 \n$\n1,069 \n$\n3,350 \n$\n3,269 \nCost of electric fuel and purchased power\n(1)\n:\nSempra California\n$\n135 \n$\n(5)\n$\n314 \n$\n277 \nEliminations and adjustments\n(13)\n(13)\n(49)\n(50)\nTotal\n$\n122 \n$\n(18)\n$\n265 \n$\n227 \n(1)\n    \nExcludes depreciation and amortization, which are presented separately on Sempra’s Condensed Consolidated Statements of Operations.\n102\nTable of Contents\nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra’s electric revenues increased by $191 million (18%) driven by Sempra California, which included:\n▪\n$140 million increase in cost of electric fuel and purchased power, which we discuss below\n▪\n$40 million higher CPUC-authorized base revenues, including certain incremental and balanced capital projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD offset by $6 million lower authorized cost of capital\n▪\n$15 million higher revenues from incremental and balanced capital projects offset by certain projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD and lower authorized cost of capital\n▪\n$12 million higher revenues from transmission operations\nOffset by:\n▪\n$19 million lower regulatory revenues associated with impacts from the election to accelerate self-developed software deductions, which are offset in income tax (expense) benefit\n▪\n$7 million lower regulatory revenues from higher ITCs from standalone energy storage projects, which are offset in income tax (expense) benefit\nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra’s cost of electric fuel and purchased power increased by $140 million driven by Sempra California, which included:\n▪\n$140 million higher purchased power primarily due to change in excess capacity sales and tolling agreements\n▪\n$30 million lower sales to the California ISO due to lower market prices\nOffset by: \n▪\n$28 million lower purchased power from the California ISO due to lower market prices and lower customer demand from departing load now served by CCAs\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s electric revenues increased by $81 million (2%) driven by Sempra California, which included:\n▪\n$87 million higher CPUC-authorized base revenues, including certain incremental and balanced capital projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD offset by $15 million lower authorized cost of capital\n▪\n$37 million increase in cost of electric fuel and purchased power, which we discuss below\n▪\n$29 million higher revenues from incremental and balanced capital projects offset by certain projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD and lower authorized cost of capital\n▪\n$25 million higher revenues from transmission operations\nOffset by:\n▪\n$74 million lower regulatory revenues from higher ITCs from standalone energy storage projects, which are offset in income tax (expense) benefit\n▪\n$19 million lower regulatory revenues associated with impacts from the election to accelerate self-developed software deductions, which are offset in income tax (expense) benefit\n▪\n$9 million lower revenues associated with refundable programs, which are fully offset in O&M\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s cost of electric fuel and purchased power increased by $38 million (17%) driven by Sempra California, which included:\n▪\n$67 million higher purchased power primarily due to tolling agreements and change in excess capacity sales\n▪\n$45 million lower sales to the California ISO due to lower market prices\nOffset by:\n▪\n$72 million lower purchased power from the California ISO due to lower market prices and lower customer demand from departing load now served by CCAs\n103\nTable of Contents\nEnergy-Related Businesses: Revenues and Cost of Sales\nENERGY-RELATED BUSINESSES: REVENUES AND COST OF SALES\n(Dollars in millions)\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n2025\n2024\nSempra:\nRevenues:\n \n \nSempra Infrastructure\n$\n540 \n$\n523 \n$\n1,452 \n$\n1,403 \nParent and other\n(1)\n(12)\n(11)\n(44)\n(43)\nTotal\n$\n528 \n$\n512 \n$\n1,408 \n$\n1,360 \nCost of sales\n(2)\n:\n \n \nSempra Infrastructure\n$\n117 \n$\n134 \n$\n321 \n$\n297 \n(1)\n    Includes eliminations of intercompany activity.\n(2)    \nExcludes depreciation and amortization, which are presented separately on Sempra’s Condensed Consolidated Statements of Operations.\nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra’s revenues from energy-related businesses increased by $16 million (3%) primarily due to:\n▪\n$39 million from asset and supply optimization from contracts to sell natural gas and LNG to third parties, including: \n◦\n$90 million driven by higher natural gas prices and higher volumes associated with optimization of transport and storage contracts\nOffset by: \n◦\n$60 million from $50 million unrealized losses in 2025 compared to $10 million unrealized gains in 2024 on commodity derivatives\n▪\n$18 million higher revenues driven by satisfaction of performance obligations related to customer payments received in advance from a contract modification in December 2024 on an LNG storage and regasification agreement\nOffset by:\n▪\n$30 million lower transportation revenues driven by a customer’s early termination of firm transportation agreements\n▪\n$8 million from TdM due to lower power prices and lower volumes\nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra’s cost of sales from energy-related businesses decreased by $17 million (13%) primarily due to $19 million lower LNG purchases offset by higher natural gas purchases related to asset and supply optimization.\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s revenues from energy-related businesses increased by $48 million (4%) primarily due to:\n▪\n$53 million higher revenues driven by satisfaction of performance obligations related to customer payments received in advance from a contract modification in December 2024 on an LNG storage and regasification agreement\n▪\n$51 million from asset and supply optimization from contracts to sell natural gas and LNG to third parties, including: \n◦\n$75 million driven by higher natural gas prices and higher volumes associated with optimization of transport and storage contracts\n◦\n$22 million primarily from higher diversion fees due to higher natural gas prices \nOffset by:\n◦\n$45 million from higher unrealized losses on commodity derivatives\n▪\n$15 million higher revenues in 2025 due to the commencement of commercial operations at the Topolobampo marine terminal in June 2024\nOffset by:\n▪\n$30 million lower transportation revenues driven by a customer’s early termination of firm transportation agreements\n▪\n$15 million from TdM mainly due to lower volumes and lower power prices\n▪\n$13 million from lower power prices from solar power generation assets and lower volumes from wind power generation assets\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s cost of sales from energy-related businesses increased by $24 million (8%) primarily due to $24 million driven by higher natural gas purchases offset by lower LNG purchases related to asset and supply optimization.\n104\nTable of Contents\nOperation and Maintenance\nOPERATION AND MAINTENANCE\n(Dollars in millions)\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n2025\n2024\nSempra:\nSempra California\n$\n1,047 \n$\n1,080 \n$\n3,222 \n$\n3,190 \nSempra Texas Utilities\n1 \n— \n4 \n4 \nSempra Infrastructure\n257 \n218 \n644 \n616 \nSegment totals\n1,305 \n1,298 \n3,870 \n3,810 \nParent and other\n(1)\n44 \n28 \n61 \n61 \nTotal\n$\n1,349 \n$\n1,326 \n$\n3,931 \n$\n3,871 \n(1)\n    \nIncludes eliminations of intercompany activity.\nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra’s O&M increased by $23 million (2%) primarily due to:\n▪\n$39 million increase at Sempra Infrastructure due to:\n◦\n$18 million from higher provisions for expected credit losses\n◦\n$17 million primarily due to higher expenses in 2025 in advance of ECA LNG Phase 1 commencing commercial operations and higher maintenance expenses\n◦\n$8 million higher development costs and certain non-capitalized expenses from projects under construction\n▪\n$16 million increase at Parent and other primarily due to non-recoverable insurance claims in 2025\nOffset by:\n▪\n$33 million decrease at Sempra California primarily due to lower non-refundable operating costs\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s O&M increased by $60 million (2%) primarily due to:\n▪\n$32 million increase at Sempra California due to:\n◦\n$58 million higher expenses associated with refundable programs, which costs are recovered in revenue\nOffset by:\n◦\n$29 million lower non-refundable operating costs\n▪\n $28 million increase at Sempra Infrastructure due to:\n◦\n$22 million primarily due to higher expenses in 2025 in advance of ECA LNG Phase 1 commencing commercial operations and higher maintenance expenses\n◦\n$12 million higher development costs and certain non-capitalized expenses from projects under construction\n▪\nParent and other was consistent with the prior year due to: \n◦\n$22 million due to non-recoverable insurance claims in 2025\nOffset by:\n◦\n$10 million from $5 million compensation benefit in 2025 compared to $5 million compensation expense in 2024\n◦\n$4 million due to lower deferred compensation expense\nOther Income, Net\nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra’s other income, net, decreased by $16 million (25%) to $49 million primarily due to: \n▪\n$19 million higher non-service components of net periodic benefit cost primarily at Sempra California \n▪\n$7 million lower investment gains on dedicated assets in support of our employee nonqualified benefit plan and deferred compensation plan at Parent and other\nOffset by:\n▪\n$7 million from $3 million gains in 2025 compared to $4 million losses in 2024 from impacts associated with interest rate and foreign exchange instruments and foreign currency transactions driven by other foreign currency transactional effects at Sempra Infrastructure \n105\nTable of Contents\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s other income, net, increased by $5 million (3%) to $199 million primarily due to:\n▪\n$16 million higher AFUDC equity at Sempra Infrastructure\n▪\n$12 million from $8 million gains in 2025 compared to $4 million losses in 2024 from impacts associated with interest rate and foreign exchange instruments and foreign currency transactions driven by other foreign currency transactional effects primarily at Sempra Infrastructure\n▪\n$9 million higher net interest income on regulatory balancing accounts at Sempra California\nOffset by:\n▪\n$23 million higher non-service components of net periodic benefit cost primarily at Sempra California \n▪\n$7 million reduction in regulatory interest from disallowed regulatory recovery of COVID-19 costs at Sempra California\nInterest Income\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s interest income increased by $18 million (38%) to $65 million primarily due to a $14 million change in the fair value of the Support Agreement at Sempra Infrastructure.\nInterest Expense\nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra’s interest expense increased by $75 million (23%) to $403 million primarily due to: \n▪\n$39 million at Parent and other from higher debt balances from debt issuances\n▪\n$21 million at Sempra California from higher debt balances from debt issuances\n▪\n$16 million at Sempra Infrastructure primarily from higher interest expense related to a customer’s early termination of firm transportation agreements\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s interest expense increased by $251 million (27%) to $1.2 billion due to:\n▪\n$104 million at Parent and other from higher debt balances from debt issuances offset by higher capitalization of interest expense in 2025 from projects under construction at Sempra Infrastructure\n▪\n$87 million at Sempra Infrastructure primarily from $60 million in unrealized losses in 2025 on interest rate swaps related to the PA LNG Phase 1 project and higher interest expense related to a customer’s early termination of firm transportation agreements offset by higher capitalization of interest expense in 2025 from projects under construction\n▪\n$60 million at Sempra California from higher debt balances from debt issuances\nIncome Taxes\nINCOME TAX EXPENSE (BENEFIT) AND EFFECTIVE INCOME TAX RATES\n(Dollars in millions)\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nSempra:\nIncome tax expense (benefit)\n$\n482 \n$\n(105)\n$\n711 \n$\n(63)\nIncome before income taxes and equity earnings\n$\n160 \n$\n200 \n$\n1,109 \n$\n1,213 \nEquity earnings, before income tax\n(1)\n133 \n132 \n443 \n426 \nPretax income\n$\n293 \n$\n332 \n$\n1,552 \n$\n1,639 \nEffective income tax rate\n165 \n%\n(32)\n%\n46 \n%\n(4)\n%\n(1)\n    We discuss how we recognize equity earnings in Note 5 of the Notes to Consolidated Financial Statements in the Annual Report.\nWe report as part of our pretax results the income or loss attributable to NCI. However, we do not record income taxes for a portion of this income or loss, as some of our entities with NCI are currently treated as partnerships for U.S. income tax purposes, and thus we are only liable for income taxes on the portion of the earnings that are allocated to us. Our pretax income, however, includes 100% of these entities. If our entities with NCI grow, and if we continue to invest in such entities, the impact on our ETR may become more significant.\n106\nTable of Contents\nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra had an income tax expense in 2025 compared to an income tax benefit in 2024 primarily due to:\n▪\n$514 million net income tax expense in 2025 as a result of management’s decision to classify SI Partners as held for sale, comprised of the following:\n◦\n$705 million income tax expense to adjust deferred income tax liabilities primarily related to outside basis differences in our investment in SI Partners \n◦\n$153 million income tax expense for changes in state income tax apportionment\nOffset by:\n◦\n$344 million income tax benefit from changes to a valuation allowance against certain tax credit carryforwards \n▪\n$123 million from $45 million income tax expense in 2025 compared to $78 million income tax benefit in 2024 from foreign currency and inflation effects on our monetary positions in Mexico\n▪\n$78 million income tax expense in 2025 from changes to a valuation allowance against foreign tax credits that were carried forward from the implementation of the TCJA\n▪\n$30 million income tax benefit in 2024 from an outside basis difference in a domestic partnership investment\nOffset by:\n▪\nhigher income tax benefit from flow-through items, including $73 million income tax benefit in 2025 from the election to accelerate self-developed software deductions, which we discuss in Note 1 of the Notes to Condensed Consolidated Financial Statements \n▪\nhigher income tax benefit in 2025 from higher ITCs from standalone energy storage projects\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra had an income tax expense in 2025 compared to an income tax benefit in 2024 primarily due to:\n▪\n$552 million net income tax expense in 2025 as a result of management’s decision to classify SI Partners and Ecogas as held for sale, comprised of the following:\n◦\n$705 million income tax expense to adjust deferred income tax liabilities primarily related to outside basis differences in our investment in SI Partners \n◦\n$153 million income tax expense for changes in state income tax apportionment\n◦\n$38 million income tax expense due to the recognition of a Mexican deferred tax liability on our outside basis differences in Ecogas\nOffset by:\n◦\n$344 million income tax benefit from changes to a valuation allowance against certain tax credit carryforwards \n▪\n$368 million from $157 million income tax expense in 2025 compared to $211 million income tax benefit in 2024 from foreign currency and inflation effects on our monetary positions in Mexico\n▪\n$78 million income tax expense in 2025 from changes to a valuation allowance against foreign tax credits that were carried forward from the implementation of the TCJA\n▪\n$30 million income tax benefit in 2024 from an outside basis difference in a domestic partnership investment\nOffset by:\n▪\nhigher income tax benefit from flow-through items, including $73 million income tax benefit in 2025 from the election to accelerate self-developed software deductions \n▪\nhigher income tax benefit in 2025 from higher ITCs from standalone energy storage projects\nWe discuss the impact of foreign currency exchange rates and inflation on income taxes below in “Impact of Foreign Currency and Inflation Rates on Results of Operations.” See Note 1 of the Notes to Condensed Consolidated Financial Statements in this report and Notes 1 and 7 of the Notes to Consolidated Financial Statements in the Annual Report for further details about our accounting for income taxes and items subject to flow-through treatment.\n107\nTable of Contents\nEquity Earnings\nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra’s equity earnings increased by $18 million (4%) to $472 million primarily due to:\n▪\n$45 million at Oncor Holdings driven by:\n◦\noverall higher revenues primarily attributable to:\n•\nrate updates to reflect increases in invested capital\n•\nincrease due to Oncor’s SRP and the UTM\nOffset by:\n◦\nhigher interest expense and depreciation expense associated with increases in invested capital\n◦\nhigher O&M\nOffset by:\n▪\n$24 million at IMG due to an income tax expense in 2025 compared to an income tax benefit in 2024 primarily from foreign currency and inflation effects\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s equity earnings decreased by $45 million (4%) remaining at $1.2 billion primarily due to:\n▪\n$74 million at IMG due to an income tax expense in 2025 compared to an income tax benefit in 2024 primarily from foreign currency and inflation effects\nOffset by:\n▪\n$19 million at Cameron LNG JV primarily from higher maintenance revenues and lower interest expense\n▪\n$15 million at Oncor Holdings driven by:\n◦\noverall higher revenues primarily attributable to:\n•\nrate updates to reflect increases in invested capital\n•\nincrease due to Oncor’s SRP and the establishment of the UTM\n•\ncustomer growth\nOffset by:\n◦\nhigher interest expense and depreciation expense associated with increases in invested capital\n◦\nhigher O&M\nEarnings Attributable to Noncontrolling Interests\nIn the three months ended September 30, 2025 compared to the same period in 2024, Sempra’s earnings attributable to NCI decreased by $55 million to $55 million primarily due to a decrease in SI Partners subsidiaries’ net income driven by foreign currency and inflation effects on our monetary positions in Mexico.\nIn the nine months ended September 30, 2025 compared to the same period in 2024, Sempra’s earnings attributable to NCI decreased by $222 million to $103 million primarily due to a decrease in SI Partners subsidiaries’ net income driven by foreign currency and inflation effects on our monetary positions in Mexico and unrealized losses in 2025 from interest rate swaps related to the PA LNG Phase 1 project.\nIMPACT OF FOREIGN CURRENCY AND INFLATION RATES ON RESULTS OF OPERATIONS\nBecause our natural gas distribution utility in Mexico, Ecogas, uses its local currency as its functional currency, its revenues and expenses are translated into U.S. dollars at average exchange rates for the period for consolidation in Sempra’s results of operations. We discuss further the impact of foreign currency and inflation rates on results of operations, including impacts on income taxes and related hedging activity, in “Part II – Item 7. MD&A – Impact of Foreign Currency and Inflation Rates on Results of Operations” in the Annual Report.\nForeign Currency Translation \nAny difference in average exchange rates used for the translation of income statement activity from year to year can cause a variance in Sempra’s comparative results of operations. In the three months and nine months ended September 30, 2025 compared to the same periods in 2024, the change in our earnings as a result of foreign currency translation rates was lower by $1 million.\n108\nTable of Contents\nTransactional Impacts\nIncome statement activities at our foreign operations and their equity method investments are also impacted by transactional gains and losses, a summary of which is shown in the table below:\nTRANSACTIONAL GAINS (LOSSES) FROM FOREIGN CURRENCY AND INFLATION EFFECTS\n(Dollars in millions)\n \nTotal reported amounts\nTransactional gains (losses) included in reported amounts\n \nThree months ended September 30,\n \n2025\n2024\n2025\n2024\nOther income, net\n$\n49 \n$\n65 \n$\n3 \n$\n(4)\nIncome tax (expense) benefit\n(482)\n105 \n(45)\n78 \nEquity earnings\n472 \n454 \n(6)\n26 \nNet income\n150 \n759 \n(48)\n100 \nEarnings attributable to noncontrolling interests\n(55)\n(110)\n16 \n(33)\nEarnings attributable to common shares\n77 \n638 \n(32)\n67 \n \nNine months ended September 30,\n \n2025\n2024\n2025\n2024\nOther income, net\n$\n199 \n$\n194 \n$\n8 \n$\n(4)\nIncome tax (expense) benefit\n(711)\n63 \n(157)\n211 \nEquity earnings\n1,190 \n1,235 \n(33)\n56 \nNet income\n1,588 \n2,511 \n(182)\n263 \nEarnings attributable to noncontrolling interests\n(103)\n(325)\n61 \n(85)\nEarnings attributable to common shares\n1,444 \n2,152 \n(121)\n178 \n109\nTable of Contents\nWe discuss herein SDG&E’s results of operations and significant changes in earnings, revenues and costs for the \nthree months (Q3) and nine months (YTD) ended September 30, 2025\n compared to the same period in 2024.\nDue to the delay in the issuance of the CPUC’s FD in the SDG&E 2024 GRC, SDG&E recorded revenues in the first three quarters of 2024 based on levels authorized for 2023 under the 2019 GRC. In December 2024, the CPUC approved an FD in the 2024 GRC, effective retroactive to January 1, 2024, for which SDG&E recorded the retroactive impacts in the fourth quarter of 2024. SDG&E’s authorized base revenues for the first three quarters of 2025 are based on the revenues authorized for the 2024 test year plus the amount authorized for attrition for 2025. We provide additional information on the 2024 GRC FD in Note 4 of the Notes to Condensed Consolidated Financial Statements in this report and in Note 4 of the Notes to Consolidated Financial Statements in the Annual Report.\nRESULTS OF OPERATIONS\nRESULTS OF OPERATIONS\n(Dollars in millions)\nIn the three months ended September 30, 2025 compared to the same period in 2024, the increase in earnings of $63 million (24%) was primarily due to:\n▪\n$53 million higher income tax benefits primarily from flow-through items, including impacts from the election to accelerate self-developed software deductions, and from the resolution of prior year income tax items\n▪\n$15 million higher CPUC base operating margin, net of operating expenses including higher depreciation and $5 million lower authorized cost of capital. In the first three quarters of 2024, SDG&E recorded CPUC-authorized base revenues based on 2023 authorized levels\n▪\n$4 million higher electric transmission margin\n▪\n$4 million higher net regulatory interest income\nOffset by:\n▪\n$8 million higher net interest expense\n110\nTable of Contents\nIn the nine months ended September 30, 2025 compared to the same period in 2024, the increase in earnings of $110 million (16%) was primarily due to:\n▪\n$60 million higher income tax benefits primarily from flow-through items, including impacts from the election to accelerate self-developed software deductions and gas repairs tax benefits (which in the first three quarters of 2024 were recorded as a regulatory liability that was released in the fourth quarter of 2024 as a result of the 2024 GRC FD), and from the resolution of prior year income tax items\n▪\n$49 million higher CPUC base operating margin, net of operating expenses including higher depreciation and $14 million lower authorized cost of capital. In the first three quarters of 2024, SDG&E recorded CPUC-authorized base revenues based on 2023 authorized levels\n▪\n$10 million higher net regulatory interest income\n▪\n$7 million higher electric transmission margin\nOffset by:\n▪\n$22 million higher net interest expense\nSIGNIFICANT CHANGES IN REVENUES AND COSTS\nElectric Revenues and Cost of Electric Fuel and Purchased Power\nIn the three months ended September 30, 2025 compared to the same period in 2024, SDG&E’s electric revenues increased by $191 million (18%) to $1.3 billion primarily due to:\n▪\n$140 million increase in cost of electric fuel and purchased power, which we discuss below\n▪\n$40 million higher CPUC-authorized base revenues, including certain incremental and balanced capital projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD offset by $6 million lower authorized cost of capital\n▪\n$15 million higher revenues from incremental and balanced capital projects offset by certain projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD and lower authorized cost of capital\n▪\n$12 million higher revenues from transmission operations\nOffset by:\n▪\n$19 million lower regulatory revenues associated with impacts from the election to accelerate self-developed software deductions, which are offset in income tax benefit (expense)\n▪\n$7 million lower regulatory revenues from higher ITCs from standalone energy storage projects, which are offset in income tax benefit (expense)\nIn the three months ended September 30, 2025 compared to the same period in 2024, SDG&E’s cost of electric fuel and purchased power increased by $140 million to $135 million primarily due to:\n▪\n$140 million higher purchased power primarily due to change in excess capacity sales and tolling agreements\n▪\n$30 million lower sales to the California ISO due to lower market prices\nOffset by:\n▪\n$28 million lower purchased power from the California ISO due to lower market prices and lower customer demand from departing load now served by CCAs\nIn the nine months ended September 30, 2025 compared to the same period in 2024, SDG&E’s electric revenues increased by $80 million (2%) to $3.4 billion primarily due to:\n▪\n$87 million higher CPUC-authorized base revenues, including certain incremental and balanced capital projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD offset by $15 million lower authorized cost of capital\n▪\n$37 million increase in cost of electric fuel and purchased power, which we discuss below\n▪\n$29 million higher revenues from incremental and balanced capital projects offset by certain projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD and lower authorized cost of capital\n▪\n$25 million higher revenues from transmission operations\nOffset by:\n▪\n$74 million lower regulatory revenues from higher ITCs from standalone energy storage projects, which are offset in income tax benefit (expense)\n▪\n$19 million lower regulatory revenues associated with impacts from the election to accelerate self-developed software deductions, which are offset in income tax benefit (expense)\n▪\n$9 million lower revenues associated with refundable programs, which are fully offset in O&M\n111\nTable of Contents\nIn the nine months ended September 30, 2025 compared to the same period in 2024, SDG&E’s cost of electric fuel and purchased power increased by $37 million (13%) to $314 million primarily due to:\n▪\n$67 million higher purchased power primarily due to tolling agreements and change in excess capacity sales\n▪\n$45 million lower sales to the California ISO due to lower market prices\nOffset by:\n▪\n$72 million lower purchased power from the California ISO due to lower market prices and lower customer demand from departing load now served by CCAs\nNatural Gas Revenues and Cost of Natural Gas\nIn the three months ended September 30, 2025 and 2024, SDG&E’s average cost of natural gas per thousand cubic feet was $6.30 and $5.61, respectively. In the nine months ended September 30, 2025 and 2024, SDG&E’s average cost of natural gas per thousand cubic feet was $5.16 and $5.19, respectively. The average cost of natural gas sold at SDG&E is impacted by market prices, as well as transportation, tariff and other charges.\nIn the three months ended September 30, 2025 compared to the same period in 2024, SDG&E’s natural gas revenues increased by $46 million (27%) to $216 million primarily due to:\n▪\n$25 million higher revenues associated with refundable programs, which are fully offset in O&M\n▪\n$16 million higher regulatory revenues, including gas repairs tax benefits, which are offset in income tax benefit (expense). Gas repairs tax benefits in the first three quarters of 2024 were recorded as a regulatory liability that was released in the fourth quarter of 2024 as a result of the 2024 GRC FD\n▪\n$15 million higher CPUC-authorized base revenues, including certain incremental and balanced capital projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD offset by $1 million lower authorized cost of capital\n▪\n$6 million increase in cost of natural gas sold, which we discuss below\nOffset by:\n▪\n$13 million lower revenues from incremental and balanced capital projects, including those that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD and lower authorized cost of capital\nIn the three months ended September 30, 2025 compared to the same period in 2024, SDG&E’s cost of natural gas increased by $6 million (16%) to $44 million primarily due to higher average natural gas prices.\nIn the nine months ended September 30, 2025 compared to the same period in 2024, SDG&E’s natural gas revenues increased by $105 million (15%) to $800 million primarily due to:\n▪\n$65 million higher CPUC-authorized base revenues, including certain incremental and balanced capital projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD offset by $4 million lower authorized cost of capital\n▪\n$44 million higher revenues associated with refundable programs, which are fully offset in O&M\n▪\n$24 million higher regulatory revenues, including gas repairs tax benefits, which are offset in income tax benefit (expense). Gas repairs tax benefits in the first three quarters of 2024 were recorded as a regulatory liability that was released in the fourth quarter of 2024 as a result of the 2024 GRC FD \nOffset by:\n▪\n$27 million lower revenues from incremental and balanced capital projects, including those that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD and lower authorized cost of capital\nOperation and Maintenance\nIn the three months and nine months ended September 30, 2025 compared to the same periods in 2024, SDG&E’s O&M increased by $31 million (7%) to $451 million and $40 million (3%) remaining at $1.3 billion, respectively, primarily due to higher expenses associated with refundable programs, which costs are recovered in revenue.\nOther Income, Net\nIn the three months and nine months ended September 30, 2025 compared to the same periods in 2024, SDG&E’s other income, net, increased by $2 million (7%) to $32 million and $17 million (20%) to $103 million, respectively, primarily due to higher net interest income on regulatory balancing accounts.\n112\nTable of Contents\nIncome Taxes\nINCOME TAX EXPENSE (BENEFIT) AND EFFECTIVE INCOME TAX RATES\n(Dollars in millions)\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n2025\n2024\nSDG&E:\nIncome tax (benefit) expense\n$\n(33)\n$\n15 \n$\n(12)\n$\n89 \nIncome before income taxes\n$\n291 \n$\n276 \n$\n768 \n$\n759 \nEffective income tax rate\n(11)\n%\n5 \n%\n(2)\n%\n12 \n%\nIn the three months and nine months ended September 30, 2025 compared to the same periods in 2024, SDG&E had an income tax benefit in 2025 compared to an income tax expense in 2024, respectively, primarily due to:\n▪\nhigher income tax benefit from flow-through items, including $26 million income tax benefit in 2025 from the election to accelerate self-developed software deductions, which we discuss in Note 1 of the Notes to Condensed Consolidated Financial Statements \n▪\nhigher income tax benefit in 2025 from higher ITCs from standalone energy storage projects\nWe discuss herein SoCalGas’ results of operations and significant changes in earnings (losses), revenues and costs for the three months (Q3) and nine months (YTD) ended September 30, 2025 compared to the same period in 2024.\nDue to the delay in the issuance of the CPUC’s FD in the SoCalGas 2024 GRC, SoCalGas recorded revenues in the first three quarters of 2024 based on levels authorized for 2023 under the 2019 GRC. In December 2024, the CPUC approved an FD in the 2024 GRC, effective retroactive to January 1, 2024, for which SoCalGas recorded the retroactive impacts in the fourth quarter of 2024. SoCalGas’ authorized base revenues for the first three quarters of 2025 are based on the revenues authorized for the 2024 test year plus the amount authorized for attrition for 2025. We provide additional information on the 2024 GRC FD in Note 4 of the Notes to Condensed Consolidated Financial Statements in this report and in Note 4 of the Notes to Consolidated Financial Statements in the Annual Report.\nRESULTS OF OPERATIONS\nRESULTS OF OPERATIONS\n(Dollars in millions)\n113\nTable of Contents\nIn the three months ended September 30, 2025 compared to the same period in 2024, SoCalGas’ earnings were $46 million compared to losses of $14 million primarily due to:\n▪\n$39 million higher income tax benefits primarily from the resolution of prior year income tax items and from flow-through items, including impacts from the election to accelerate self-developed software deductions\n▪\n$32 million higher CPUC base operating margin, net of operating expenses including higher depreciation and $4 million lower authorized cost of capital. In the first three quarters of 2024, SoCalGas recorded CPUC-authorized base revenues based on 2023 authorized levels\nOffset by:\n▪\n$8 million higher net interest expense\nIn the nine months ended September 30, 2025 compared to the same period in 2024, the increase in earnings of $98 million (21%) was primarily due to:\n▪\n$74 million higher income tax benefits primarily from flow-through items, including gas repairs tax benefits (which in the first three quarters of 2024 were recorded as a regulatory liability that was released in the fourth quarter of 2024 as a result of the 2024 GRC FD) and impacts from the election to accelerate self-developed software deductions, and from the resolution of prior year income tax items\n▪\n$70 million higher CPUC base operating margin, net of operating expenses including higher depreciation and $17 million lower authorized cost of capital. In the first three quarters of 2024, SoCalGas recorded CPUC-authorized base revenues based on 2023 authorized levels\n▪\n$10 million regulatory award approved by the CPUC in 2025\nOffset by:\n▪\n$26 million higher net interest expense\n▪\n$25 million from disallowed regulatory recovery of COVID-19 costs\nSIGNIFICANT CHANGES IN REVENUES AND COSTS\nNatural Gas Revenues and Cost of Natural Gas\nIn the three months ended September 30, 2025 and 2024, SoCalGas’ average cost of natural gas per thousand cubic feet was $3.96 and $1.82, respectively. In the nine months ended September 30, 2025 and 2024, SoCalGas’ average cost of natural gas per thousand cubic feet was $3.65 and $3.14, respectively. The average cost of natural gas sold at SoCalGas is impacted by market prices, as well as transportation and other charges. \nIn the three months ended September 30, 2025 compared to the same period in 2024, SoCalGas’ natural gas revenues increased by $127 million (12%) to $1.2 billion primarily due to:\n▪\n$107 million higher CPUC-authorized base revenues, including certain incremental and balanced capital projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD offset by $6 million lower authorized cost of capital\n▪\n$100 million increase in cost of natural gas sold, which we discuss below\n▪\n$42 million higher regulatory revenues, including gas repairs tax benefits, which are offset in income tax benefit (expense). Gas repairs tax benefits in the first three quarters of 2024 were recorded as a regulatory liability that was released in the fourth quarter of 2024 as a result of the 2024 GRC FD\nOffset by:\n▪\n$52 million lower revenues from incremental and balanced capital projects, including those that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD and lower authorized cost of capital\n▪\n$48 million lower regulatory revenues associated with impacts from the election to accelerate self-developed software deductions, which are offset in income tax benefit (expense)\n▪\n$24 million lower revenues associated with refundable programs, which are fully offset in O&M\n114\nTable of Contents\nIn the three months ended September 30, 2025 compared to the same period in 2024, SoCalGas’ cost of natural gas increased by $100 million to $182 million primarily due to higher average natural gas prices.\nIn the nine months ended September 30, 2025 compared to the same period in 2024, SoCalGas’ natural gas revenues increased by $301 million (7%) to $4.5 billion primarily due to:\n▪\n$365 million higher CPUC-authorized base revenues, including certain incremental and balanced capital projects that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD offset by $24 million lower authorized cost of capital\n▪\n$88 million increase in cost of natural gas sold, which we discuss below\n▪\n$79 million higher regulatory revenues, including gas repairs tax benefits, which are offset in income tax benefit (expense). Gas repairs tax benefits in the first three quarters of 2024 were recorded as a regulatory liability that was released in the fourth quarter of 2024 as a result of the 2024 GRC FD\n▪\n$23 million higher revenues associated with refundable programs, which are fully offset in O&M\n▪\n$14 million regulatory award approved by the CPUC in 2025\n▪\n$13 million higher revenues from higher non-service components of net periodic benefit cost, which fully offsets in other (expense) income, net\nOffset by:\n▪\n$179 million lower revenues from incremental and balanced capital projects, including those that are now in CPUC-authorized base revenues as a result of the 2024 GRC FD and lower authorized cost of capital\n▪\n$48 million lower regulatory revenues associated with impacts from the election to accelerate self-developed software deductions, which are offset in income tax benefit (expense)\n▪\n$29 million lower revenues from disallowed regulatory recovery of COVID-19 costs\nIn the nine months ended September 30, 2025 compared to the same period in 2024, SoCalGas’ cost of natural gas increased by $88 million (13%) to $749 million due to: \n▪\n$105 million higher average natural gas prices\nOffset by:\n▪\n$17 million lower volumes driven by weather\nOperation and Maintenance\nIn the three months ended September 30, 2025 compared to the same period in 2024, SoCalGas’ O&M decreased by $55 million (8%) to $623 million due to:\n▪\n$31 million lower non-refundable operating costs\n▪\n$24 million lower expenses associated with refundable programs, which costs are recovered in revenue\nIn the nine months ended September 30, 2025 compared to the same period in 2024, SoCalGas’ O&M increased by $4 million remaining at $2.0 billion due to:\n▪\n$23 million higher expenses associated with refundable programs, which costs are recovered in revenue\nOffset by:\n▪\n$19 million lower non-refundable operating costs\nOther (Expense) Income, Net\nIn the three months ended September 30, 2025 compared to the same period in 2024, SoCalGas had $3 million of other expense, net, in 2025 compared to $13 million of other income, net, in 2024 primarily due to higher non-service components of net periodic benefit cost. \nIn the nine months ended September 30, 2025 compared to the same period in 2024, SoCalGas’ other income, net, decreased by $36 million (49%) to $37 million primarily due to:\n▪\n$22 million higher non-service components of net periodic benefit cost\n▪\n$7 million reduction in regulatory interest from disallowed regulatory recovery of COVID-19 costs\n▪\n$5 million lower net interest income on regulatory balancing accounts\n115\nTable of Contents\nIncome Taxes\nINCOME TAX EXPENSE (BENEFIT) AND EFFECTIVE INCOME TAX RATES \n(Dollars in millions)\n \nThree months ended September 30,\nNine months ended September 30,\n \n2025\n2024\n2025\n2024\nSoCalGas:\nIncome tax (benefit) expense\n$\n(95)\n$\n(52)\n$\n(51)\n$\n1 \n(Loss) income before income taxes\n$\n(49)\n$\n(66)\n$\n523 \n$\n477 \nEffective income tax rate\n194 \n%\n79 \n%\n(10)\n%\n— \n%\nIn the three months ended September 30, 2025 compared to the same period in 2024, SoCalGas’ income tax benefit increased by $43 million primarily due to:\n▪\nhigher income tax benefit from flow-through items, including $47 million income tax benefit in 2025 from the election to accelerate self-developed software deductions, which we discuss in Note 1 of the Notes to Condensed Consolidated Financial Statements \nOffset by:\n▪\n$19 million lower income tax benefit from the resolution of prior year income tax items, including benefits that are flowed to customers and recorded as a regulatory liability\nIn the nine months ended September 30, 2025 compared to the same period in 2024, SoCalGas had an income tax benefit in 2025 compared to an income tax expense in 2024 primarily due to:\n▪\nhigher income tax benefit from flow-through items, including $47 million income tax benefit in 2025 from the election to accelerate self-developed software deductions \nOffset by:\n▪\n$19 million lower income tax benefit from the resolution of prior year income tax items, including benefits that are flowed to customers and recorded as a regulatory liability\n116\nTable of Contents\nCAPITAL RESOURCES AND LIQUIDITY\nOVERVIEW\nSempra\nCapital Recycling Program\nWe regularly review our portfolio of assets with a view toward allocating capital to the businesses we believe can further improve shareholder value. Following a comprehensive strategic review of our businesses and asset portfolio by our board of directors and management over the past year, in September 2025, we entered into an agreement to sell a 45% equity interest in SI Partners to the KKR Partners for $9.99 billion, subject to adjustments. Also in June 2025, we committed to a formal plan to sell Ecogas and are actively marketing and pursuing the sale of these assets. We expect to complete the sales in the second or third quarter of 2026. We discuss these sales further in Note 6 of the Notes to Condensed Consolidated Financial Statements and below in “Sempra Infrastructure.”\nLiquidity\nWe expect to meet our cash requirements through: \n▪\ncash flows from operations\n▪\nunrestricted cash and cash equivalents\n▪\nborrowings under or supported by our credit facilities\n▪\nother incurrences of debt which may include issuing debt securities and obtaining term loans\n▪\nselling assets or equity interests in our subsidiaries or development projects, including the planned sale of a portion of our equity interest in SI Partners\n▪\nissuing equity securities under our ATM program or other offerings\n▪\nfunding from NCI or CRNCI owners\nWe believe that these cash flow sources, combined with available funds, will be adequate to fund our operations in both the short-term and long-term, including to:\n▪\nfinance capital expenditures\n▪\nrepay debt\n▪\nfund dividends\n▪\nfund contractual and other obligations and otherwise meet liquidity requirements\n▪\nfund capital contribution requirements\n▪\nfund new business or asset acquisitions\nSempra, SDG&E and SoCalGas currently have reasonable access to the money markets and capital markets and are not currently constrained in their ability to borrow or otherwise raise money at market rates from commercial banks, under existing revolving credit facilities, through public offerings of debt or equity securities (including under our ATM program or other offerings), or through private placements of debt supported by our revolving credit facilities in the case of commercial paper. However, our ability to access these markets or obtain credit from commercial banks outside of our committed revolving credit facilities could become materially constrained if economic conditions worsen or disruptions to or volatility in these markets increase. In addition, our financing activities, actions by credit rating agencies and prevailing interest rates, as well as many other factors, could negatively affect the availability and cost of both short-term and long-term debt and equity financing. Also, cash flows from operations may be impacted by the timing and outcomes of regulatory proceedings, commencement and completion of, and potential cost overruns for, large projects and other material events. If cash flows from operations were to be significantly reduced or we were unable to borrow or obtain other financing under acceptable terms, we would likely first reduce or postpone discretionary capital expenditures (not related to safety/reliability) and investments in new businesses. We monitor our ability to finance the needs of our operating, investing and financing activities in a manner consistent with our goal to maintain our investment-grade credit ratings.\n117\nTable of Contents\nRedemption of Series C Preferred Stock\nAs we discuss in Note 11 of the Notes to Condensed Consolidated Financial Statements, in September 2025, we provided notice of the redemption of all 900,000 issued and outstanding shares of our series C preferred stock for a redemption price in cash of $1,000 per share. On October 15, 2025, we effected and paid $900 million for the redemption using proceeds received from our August 2025 issuance of junior subordinated notes and short-term debt, which we discuss in Note 7 of the Notes to Condensed Consolidated Financial Statements.\nATM Program and Forward Sales Agreements\nIn November 2024, we established an ATM program providing for the offer and sale of shares of Sempra common stock having an aggregate gross sales price of up to $3.0 billion through agents acting as our sales agents or as forward sellers or directly to the agents as principals. The shares may be offered and sold in amounts and at times to be determined by us from time to time.\nSince establishing the ATM program, an aggregate of 4,996,591 shares have been sold under the forward sale agreements described below with an average initial forward price of $83.175. Such average initial forward price is weighted to take into account the number of shares sold under each forward sale agreement.\nIn the fourth quarter of 2024, we entered into a forward sale agreement under the ATM program for the sale of 2,909,274 shares of Sempra common stock that remain subject to future settlement. At the initial forward price of $92.1546 per share, the net proceeds from this forward sale agreement if we elect full physical settlement would be approximately $268 million. At September 30, 2025, a total of 2,909,274 shares of Sempra common stock remain subject to future settlement under this forward sale agreement, which may be settled on one or more dates specified by us no later than June 30, 2026.\nIn the first quarter of 2025, we entered into a forward sale agreement under the ATM program for the sale of 2,087,317 shares of Sempra common stock that remain subject to future settlement. At the initial forward price of $70.6593 per share, the net proceeds from this forward sale agreement if we elect full physical settlement would be approximately $147 million. At September 30, 2025, a total of 2,087,317 shares of Sempra common stock remain subject to future settlement under this forward sale agreement, which may be settled on one or more dates specified by us no later than March 31, 2027. \nWe did not initially receive any proceeds from the sale of shares pursuant to the forward sale agreements. Although we may settle the forward sale agreements entirely by the physical delivery of shares of our common stock in exchange for cash proceeds, we may, subject to certain conditions, elect cash settlement or net share settlement for all or a portion of our obligations under the forward sale agreements. \nAt September 30, 2025, approximately $2.6 billion of common stock remained available for sale under the ATM program.\nWe further discuss these activities, including the intended use of proceeds and effect on diluted EPS, in Note 11 of the Notes to Condensed Consolidated Financial Statements.\nAvailable Funds\nOur committed lines of credit provide liquidity and support commercial paper. Sempra, SDG&E and SoCalGas each has a committed line of credit expiring in 2030. Sempra Infrastructure has five committed lines of credit expiring on various dates from 2026 through 2030 and an uncommitted line of credit expiring in 2026, which are included in the held for sale disposal group but remain legally accessible and a source of available credit until the sale of a portion of our equity interest in SI Partners closes.\nAVAILABLE FUNDS AT SEPTEMBER 30, 2025\n(Dollars in millions)\n \nSempra\nSDG&E\nSoCalGas\nUnrestricted cash and cash equivalents\n(1)\n$\n131 \n$\n— \n$\n— \nAvailable unused credit\n(2)\n8,632 \n1,473 \n789 \n(1)\n    Sempra includes $69 held in non-U.S. jurisdictions, which is included in $126 that is classified as Assets Held for Sale in the Sempra Condensed Consolidated Balance Sheet. We discuss repatriation in Note 7 of the Notes to Consolidated Financial Statements in the Annual Report.\n(2)\n    Available unused credit is the total available on committed and uncommitted lines of credit that we discuss in Note 7 of the Notes to Condensed Consolidated Financial Statements. Because our commercial paper programs are supported by these lines, we reflect the amount of commercial paper outstanding and any letters of credit outstanding as a reduction to the available unused credit.\n118\nTable of Contents\nShort-Term Borrowings\nWe use short-term debt primarily to meet liquidity requirements, fund shareholder dividends, and temporarily finance capital expenditures or acquisitions. SDG&E and SoCalGas use short-term debt primarily to meet working capital needs or to help fund event-specific costs. Commercial paper, term loans and lines of credit were our primary sources of short-term debt funding in the first nine months of 2025.\nWe discuss our short-term debt activities in Note 7 of the Notes to Condensed Consolidated Financial Statements and below in “Sources and Uses of Cash.”\nLong-Term Debt Activities\nSignificant issuances of and payments on long-term debt in the first nine months of 2025 included the following:\nLONG-TERM DEBT ISSUANCES AND PAYMENTS\n(Dollars in millions)\nIssuances:\nAmount at issuance\nMaturity\nSempra 6.375% junior subordinated notes\n$\n800 \n2056\nSDG&E 5.40% first mortgage bonds\n850 \n2035\nSoCalGas 5.45% first mortgage bonds\n600 \n2035\nSoCalGas 6.00% first mortgage bonds\n500 \n2055\nSempra Infrastructure variable rate notes (ECA LNG Phase 1 project)\n392 \n2027\nSempra Infrastructure variable rate term loan (PA LNG Phase 1 project)\n2,130 \n2030\nSempra Infrastructure 6.27% senior secured notes (PA LNG Phase 1 project)\n750 \n2042\nSempra Infrastructure 6.32% senior secured notes (PA LNG Phase 1 project)\n250 \n2042\nPayments:\nPayments\nMaturity\nSoCalGas 3.20% first mortgage bonds\n$\n350 \n2025\nSempra 3.30% notes\n750 \n2025\nSempra Infrastructure variable rate notes (ECA LNG Phase 1 project)\n236 \n2027\nSempra Infrastructure variable rate term loan (PA LNG Phase 1 project)\n983 \n2030\nSempra Infrastructure loan at variable rates (4.03% after floating-to-fixed rate swap effective 2019) payable June 15, 2022 through November 19, 2034\n25 \n2034\nWe discuss our long-term debt activities, including the use of proceeds on long-term debt issuances, in Note 7 of the Notes to Condensed Consolidated Financial Statements.\nCredit Ratings\nWe provide additional information about the credit ratings of Sempra, SDG&E and SoCalGas in “Part I – Item 1A. Risk Factors” and “Part II – Item 2. MD&A – Capital Resources and Liquidity” in the Annual Report.\nThe credit ratings of Sempra, SDG&E and SoCalGas remained at investment grade levels in the first nine months of 2025. \nCREDIT RATINGS AT SEPTEMBER 30, 2025\n \n \n \nSempra\nSDG&E\nSoCalGas\nMoody’s\nBaa2 with a negative outlook\nA3 with a stable outlook\nA2 with a stable outlook\nS&P\nBBB+ with a negative outlook\nBBB+ with a stable outlook\nA- with a stable outlook\nFitch\nBBB+ with a stable outlook\nBBB+ with a stable outlook\nA with a stable outlook\nA downgrade of Sempra’s or any of its subsidiaries’ credit ratings or rating outlooks may, depending on the severity, result in the imposition of new financial or other burdensome covenants or a requirement for collateral to be posted in the case of certain financing arrangements and may materially and adversely affect the market prices of their equity and debt securities, the rates at which borrowings are made and commercial paper is issued, and the various fees on their outstanding credit facilities. This could make it more costly for Sempra, SDG&E, SoCalGas and Sempra’s other subsidiaries to issue debt or equity securities, to borrow under credit facilities and to raise certain other types of financing. We provide additional information about our credit ratings at Sempra, SDG&E and SoCalGas in “Part I – Item 1A. Risk Factors” in the Annual Report.\n119\nTable of Contents\nSempra has agreed that, if the credit rating of Oncor’s senior secured debt by any of the three major rating agencies falls below BBB (or the equivalent), Oncor will suspend dividends and other distributions (except for contractual tax payments), unless otherwise allowed by the PUCT. Oncor’s senior secured debt was rated A2, A and A at Moody’s, S&P and Fitch, respectively, at September 30, 2025.\nPillar Two\nThe Organization for Economic Cooperation and Development has introduced a framework known as “Pillar Two” to implement a global minimum effective tax rate of 15% in every jurisdiction (generally, every country) in which a company does business. Many aspects of the Pillar Two framework became effective beginning in 2024. While it is uncertain whether the U.S. or Mexico will enact legislation to adopt the Pillar Two framework, other countries are in the process of introducing and enacting legislation to implement Pillar Two. We do not currently expect the Pillar Two framework to have a material effect on Sempra’s, SDG&E’s or SoCalGas’ results of operations, financial condition and/or cash flows.\nSempra\n \nCalifornia \nSDG&E’s and SoCalGas’ operations have historically provided relatively stable earnings and liquidity. Their future performance and liquidity will depend primarily on the ratemaking and regulatory process, environmental regulations, economic conditions, actions by legislatures, litigation and the changing energy marketplace, as well as other matters described in this report and the Annual Report. SDG&E and SoCalGas expect that the available unused funds from their credit facilities described above, which also supports their commercial paper programs, cash flows from operations, and other incurrences of debt including issuing debt securities and obtaining term loans will continue to be adequate to fund their respective current operations and planned capital expenditures. SDG&E and SoCalGas manage their capital structures and pay dividends when appropriate and as approved by their respective boards of directors. On October 1, 2025, SDG&E declared dividends, and on October 3, 2025, paid dividends of $200 million to Enova Corporation and Enova Corporation paid corresponding dividends to Sempra.\nSDG&E and SoCalGas have regulatory mechanisms to recover credit losses and thus record changes in the allowances for credit losses related to Accounts Receivable – Trade that are probable of recovery in regulatory accounts. Although SDG&E and SoCalGas have regulatory mechanisms to recover credit losses, delay in payments by customers impacts the timing of their cash flows.\nAs we discuss in Note 4 of the Notes to Condensed Consolidated Financial Statements, changes in regulatory balancing accounts for significant costs at SDG&E and SoCalGas, particularly a change between over- and undercollected status, may have a significant impact on cash flows. These changes generally represent the difference between when costs are incurred and when they are ultimately recovered or refunded in rates through billings to customers. \nCPUC GRC\nAs we discuss in Note 4 of the Notes to Condensed Consolidated Financial Statements, in December 2024, the CPUC approved an FD in the 2024 GRC for SDG&E and SoCalGas that authorizes SDG&E’s and SoCalGas’ revenue requirements for 2024 and attrition year adjustments for 2025 through 2027, inclusively.\nSince the GRC FD is effective retroactive to January 1, 2024, SDG&E and SoCalGas recorded the retroactive impacts in the fourth quarter of 2024. The incremental revenue requirements associated with the period from January 1, 2024 through January 31, 2025 are being recovered in rates over an 18-month period that began on February 1, 2025.\nExisting and Anticipated Requests for Recovery of Specified Safety, Maintenance and Reliability Investments.\n The GRC also provides SDG&E and SoCalGas with numerous mechanisms to seek cost recovery of specified projects and programs. We expect that the requests for cost recovery of these projects and programs, which remain subject to CPUC approval, may result in additional amounts of authorized revenue requirement. These projects and programs include (i) the Track 2 and Track 3 requests that we describe below, (ii) the ability to file advice letters to implement the revenue requirements associated with the costs of SDG&E’s Moreno compressor station project and SoCalGas’ Honor Rancho compressor station and customer information system replacement projects, which projects were all approved by the CPUC subject to applicable cost caps, and (iii) the opportunity to file separate applications for cost recovery of mobile home park and gas integrity management programs at both SDG&E and SoCalGas, advanced metering infrastructure replacements at SDG&E, and other projects and programs.\n2024 GRC Track 2.\n In October 2023, SDG&E submitted a separate request to the CPUC in its 2024 GRC, known as a Track 2 request. This request seeks review and recovery of $1.5 billion of wildfire mitigation plan costs incurred from 2019 through 2022 that were in addition to amounts authorized in the 2019 GRC and not addressed in the 2024 GRC FD. SDG&E expects to receive a proposed decision for its Track 2 request by the end of 2025.\n120\nTable of Contents\nRevenue requirements associated with the Track 2 request have been recorded in a regulatory account. In February 2024, the CPUC approved an interim cost recovery mechanism that permits SDG&E to recover in rates $194 million and $96 million of this regulatory account balance in 2024 and 2025, respectively. Such recovery of SDG&E’s wildfire mitigation plan regulatory account balance will be subject to refund, contingent on the reasonableness review decision for its Track 2 request.\n2024 GRC Track 3.\n \nIn April 2025, SDG&E and SoCalGas each submitted additional requests to the CPUC in the 2024 GRC, known as Track 3 requests. SDG&E submitted a request seeking review and recovery of $417 million of its wildfire mitigation plan costs incurred in 2023 that were in addition to the amounts authorized in the 2019 GRC and not addressed in the 2024 GRC. Additionally, SDG&E and SoCalGas submitted a combined request seeking review and recovery of $240 million and $499 million, respectively, of PSEP costs incurred from 2014 through 2019 and 2015 through 2020, respectively. SDG&E and SoCalGas expect to receive proposed decisions for their Track 3 requests in the first half of 2026. \nRevenue requirements associated with the Track 3 requests have been recorded in regulatory accounts. SDG&E and SoCalGas are authorized interim rate recovery of up to 50% of the recorded PSEP regulatory account balance at the end of each year. Such interim rate recovery is subject to refund, contingent on the reasonableness review decision for their Track 3 requests.\nCPUC Cost of Capital\nIn March 2025, SDG&E and SoCalGas each filed applications with the CPUC seeking to update their cost of capital for 2026 through 2028, subject to the CCM. SDG&E and SoCalGas expect to receive an FD by the end of 2025. We further discuss the cost of capital and CCM in Note 4 of the Notes to Condensed Consolidated Financial Statements.\nSDG&E\nWildfire Fund and Continuation Account\n2019 Wildfire Legislation\n. We describe the 2019 Wildfire Legislation and SDG&E’s commitment to make annual shareholder contributions to the Wildfire Fund through 2028 in Note 1 of the Notes to Consolidated Financial Statements in the Annual Report.\nSDG&E is exposed to the risk that the participating California electric IOUs may incur third-party wildfire costs for which they will seek recovery from the Wildfire Fund with respect to wildfires that have occurred since enactment of the 2019 Wildfire Legislation in July 2019. In such a situation, SDG&E may recognize a reduction of its Wildfire Fund asset and record accelerated amortization against earnings when available coverage is reduced due to recoverable claims from any of the participating IOUs. The carrying value of SDG&E’s Wildfire Fund asset totaled $264 million at September 30, 2025.\nIn October 2025, a participating IOU publicly disclosed that it has received, or expects to receive, approximately $1.2 billion in aggregate reimbursements from the Wildfire Fund for eligible claims related to wildfires that occurred in 2019 and 2021. In the three months and nine months ended September 30, 2025, SDG&E reduced its Wildfire Fund asset by recording $2 million of accelerated amortization in O&M on Sempra’s and SDG&E’s Condensed Consolidated Statements of Operations.\nAlso in October 2025, another participating IOU publicly disclosed its intent to seek reimbursement from the Wildfire Fund for losses incurred and expected to be incurred in connection with a wildfire that remains under investigation, and for which the cause has not yet been conclusively determined. The administrator of the Wildfire Fund has confirmed that this wildfire qualifies as a “covered wildfire” for purposes of accessing the fund. The participating IOU has stated that it is currently unable to reasonably estimate a range of potential losses associated with this event. Accordingly, SDG&E is unable to estimate a range of potential loss resulting from any reduction in available coverage from the Wildfire Fund. \nFor existing claims or new claims based on any California electric IOUs’ assets determined to be a cause of fires, including fires of the size and scope of the Eaton fire, payments of these claims could have a material adverse effect on the Wildfire Fund, including potentially exhausting the fund, and on SDG&E’s and Sempra’s financial condition and results of operations up to the carrying value of our Wildfire Fund asset, with additional potential material exposure if SDG&E’s equipment is determined to be a cause of a fire.\n121\nTable of Contents\n2025 Wildfire Legislation.\n We describe the 2025 Wildfire Legislation that was signed into law in September 2025 in Note 1 of the Notes to Condensed Consolidated Financial Statements. The 2025 Wildfire Legislation established, among other things, the Continuation Account, a new state-administered account with up to $18.0 billion of additional liquidity to reimburse catastrophic wildfire-related claims incurred by large California electric IOUs, including SDG&E, if the Wildfire Fund is depleted. The funds in the account would only be available for claims arising from wildfires that ignited on or after September 19, 2025. The 2025 Wildfire Legislation preserves key elements of the 2019 Wildfire Legislation, including cost recovery standards and requirements, a cap on liability in the event of a finding of imprudence by the CPUC, and continued access to wildfire claims liquidity through the new Continuation Account. All of California’s large electric IOUs, including SDG&E, have elected to participate in the Continuation Account.\nIf the Continuation Account becomes operative, it would be funded with a combination of $9.0 billion from ratepayer contributions and $9.0 billion from electric IOU shareholder contributions. Electric IOU shareholder contributions totaling $5.1 billion would be obtained through fixed annual contributions of $300 million from 2029 through 2045, plus an additional $3.9 billion in contingent shareholder contributions payable in annual installments of $780 million. SDG&E’s proportionate share of the aggregate shareholder contribution amount through 2045 is expected to be $387 million, comprising (i) $219.3 million of fixed contributions of $12.9 million annually for 17 years, and (ii) $167.7 million of contingent contributions of $33.5 million annually for five years.\nThe 2025 Wildfire Legislation establishes a multi-stakeholder task force, coordinated by the Wildfire Fund’s administrator, to prepare and submit to the California legislature and Governor of California on or before April 1, 2026, a report that evaluates and sets forth recommendations on new models to complement or replace the Wildfire Fund. If the Wildfire Fund and the Continuation Account, if it becomes operative, are materially diminished, exhausted or terminated, SDG&E would lose the protection afforded by these funds, and as a consequence, a fire in any California electric IOUs’ service territory could have a material adverse effect on SDG&E’s and Sempra’s results of operations, financial condition, cash flows and/or prospects.\nFERC Rate Matters\nSDG&E files separately with the FERC for its authorized transmission revenue requirement and ROE on FERC-regulated electric transmission operations and assets.\nTO5 Settlement. \nSDG&E’s authorized TO5 settlement provided for an ROE of 10.60%, consisting of a base ROE of 10.10% plus the California ISO adder. In December 2024, the FERC issued an order, which SDG&E has appealed, finding that SDG&E is not eligible for the California ISO adder and that the TO5 adder refund provision had been triggered, requiring SDG&E to refund customers the California ISO adder retroactively from June 1, 2019.\nTO6 Filing. \nIn October 2024, SDG&E submitted its TO6 filing to the FERC and requested it to be effective January 1, 2025. SDG&E’s TO6 filing proposes, among other items, an increase to SDG&E’s currently authorized base ROE from 10.10% to 11.75% plus the California ISO adder, for a total ROE of 12.25%. In December 2024, the FERC accepted SDG&E’s TO6 filing, subject to refund; suspended the effective date to June 1, 2025; established hearing and settlement judge procedures; and disallowed the inclusion of the California ISO adder, the last of which SDG&E has appealed.\nOff-Balance Sheet Arrangements\nSDG&E has entered into PPAs and tolling agreements that are variable interests in unconsolidated entities. We discuss variable interests in Note 1 of the Notes to Condensed Consolidated Financial Statements.\nSoCalGas\nCatastrophic Events Cost Recovery\nIn July 2025, the CPUC issued an FD that authorizes partial recovery of costs recorded in SoCalGas’ Catastrophic Event Memorandum Account. The FD authorizes the recovery of $19 million out of the requested $55 million, denying recovery of COVID-19 costs included in the Catastrophic Event Memorandum Account. In the nine months ended September 30, 2025, SoCalGas recorded a write-off of $36 million ($25 million after tax) in disallowed costs, comprising a $29 million reduction in Utilities: Natural Gas Revenues and a $7 million reduction in regulatory interest in Other (Expense) Income, Net, on Sempra’s and SoCalGas’ Condensed Consolidated Statements of Operations. SoCalGas has filed a request with the CPUC for a rehearing of the FD. SoCalGas expects to receive a post-rehearing FD in the first half of 2026.\n122\nTable of Contents\nLA Fires\nThe LA Fires burned in SoCalGas’ service territory. The California Department of Forestry and Fire Protection estimated that the Palisades and Eaton fires destroyed approximately 16,200 structures and damaged approximately 2,000 structures. SoCalGas’ infrastructure in the fire-affected areas that is underground, which constitutes most of its infrastructure in these areas, remains undamaged by the fires and we believe safe to continue serving customers as they return to their homes and businesses. To date, natural gas service has been restored to almost 16,000 customers in the Eaton and Palisades fire areas, and crews will continue that work as customers return to their properties.\nAliso Canyon Natural Gas Storage Facility\nLitigation. \nFrom October 23, 2015 through February 11, 2016, SoCalGas experienced the Leak, which we discuss in Note 13 of the Notes to Condensed Consolidated Financial Statements in this report and in “Part I – Item 1A. Risk Factors” in the Annual Report. As of October 31, 2025, there are three outstanding plaintiffs who have not agreed to a settlement in principle.\nOperations and Reliability. \nNatural gas withdrawn from storage is important to help maintain service reliability during peak demand periods, including consumer heating needs in the winter and peak electric generation needs in the summer. The Aliso Canyon natural gas storage facility is the largest SoCalGas storage facility and an important component of SoCalGas’ delivery system. Subject to future CPUC biennial reviews and potential additional proceedings, the CPUC determined that the Aliso Canyon natural gas storage facility is currently necessary for natural gas and electric reliability and affordable rates and authorized it to continue operating at a maximum working natural gas storage level of 68.6 bcf.\nLabor Relations\nField, technical and most clerical employees at SoCalGas are represented by the Utility Workers Union of America or the International Chemical Workers Union Council. The collective bargaining agreement for these employees covering wages, hours, working conditions, and medical and other benefit plans was due to expire on September 30, 2024, but was extended by mutual agreement while SoCalGas and the unions continued negotiations. A new collective bargaining agreement was ratified on March 31, 2025 and is scheduled to expire on September 30, 2028.\nSempra Texas Utilities\nOncor relies on external financing as a significant source of liquidity for its capital requirements. In the event that Oncor fails to meet its capital requirements, access sufficient capital, or raise capital on favorable terms to finance its ongoing needs, we may elect to make additional capital contributions to Oncor (as our commitments to the PUCT prohibit us from making loans to Oncor), which could be substantial and reduce the cash available to us for other purposes, increase our indebtedness and ultimately materially adversely affect our results of operations, financial condition, cash flows and/or prospects. Oncor’s ability to make distributions may be limited by factors such as its credit ratings, regulatory capital requirements, increases in its capital plan, debt-to-equity ratio approved by the PUCT and other restrictions and considerations. In addition, Oncor will not make distributions if a majority of Oncor’s independent directors or any minority member director determines it is in the best interests of Oncor to retain such amounts to meet expected future requirements.\nOncor\n2025 Comprehensive Base Rate Review.\n In June 2025, Oncor filed a request for a comprehensive base rate review with the PUCT and the 210 cities in its service territory that have retained original jurisdiction over rates. The base rate review test year is based on calendar year 2024 results with certain adjustments. The base rate review includes a request for an average increase over test year adjusted annualized revenue of approximately 13%, and if approved as requested, would result in an aggregate annualized revenue increase of approximately $834 million over current adjusted rates. The base rate review also requests a revised regulatory capital structure ratio of 55% debt to 45% equity, an authorized ROE of 10.55%, and a 4.94% authorized cost of debt. Oncor’s current authorized regulatory capital structure ratio is 57.5% debt to 42.5% equity, a 9.7% authorized ROE and 4.39% authorized cost of debt.\nPUCT rules permit the filing of a request for interim rates while a base rate proceeding is pending. In July 2025, Oncor filed a request for an interim rate review. In September 2025, the administrative law judge approved a settlement agreement among the parties relating to interim rates. That order provides that, if the base rate proceeding is still pending as of January 1, 2026 and not otherwise subject to a PUCT-approved settlement of the base proceeding, Oncor’s existing rates will be deemed interim rates subject to refund or surcharge back to January 1, 2026, based on the final rates approved by the PUCT in the base rate proceeding.\n123\nTable of Contents\n2023 Comprehensive Base Rate Review Order.\n The PUCT issued a final order in Oncor’s comprehensive base rate proceeding in April 2023, and rates implementing that order went into effect on May 1, 2023. In June 2023, the PUCT issued an order on rehearing in response to the motions for rehearing filed by Oncor and certain intervening parties in the proceeding. The order on rehearing made certain technical and typographical corrections to the final order but otherwise affirmed the material provisions of the final order and did not require modification of the rates that went into effect on May 1, 2023. In September 2023, Oncor filed an appeal in Travis County District Court seeking judicial review of certain rate base disallowances and related expense effects of those disallowances in the PUCT’s order on rehearing. In February 2024, the court dismissed the appeal for lack of jurisdiction. In March 2024, Oncor appealed the court’s dismissal with the Fifteenth Court of Appeals in Texas. On August 14, 2025, the court issued its opinion in favor of the PUCT and dismissed Oncor’s appeal. Oncor has elected not to pursue a further appeal.\nUnified Tracker Mechanism. \nIn June 2025, Texas House Bill 5247 was signed into law and became effective. The bill establishes what is known as the UTM, which creates an alternative method, available through 2035, for qualifying electric utilities to apply for interim rate adjustments once annually using a comprehensive regulatory filing for cost recovery of certain transmission and distribution capital expenditures.\nA qualifying utility electing to use the UTM is permitted to defer all or a portion of the costs associated with its eligible transmission and distribution capital investments placed into service during the period covered by the UTM, including depreciation expense and carrying costs, as a regulatory asset. Texas House Bill 5247 provides that the PUCT must review a UTM filing within 120 days, and if a final order is not issued by the PUCT within 165 days after the UTM filing is submitted, the utility can place the requested rates into effect on a temporary basis and refund or credit against future customer bills any difference between such temporary rates and the final approved rates.\nOncor expects to make its first comprehensive UTM filing in the first half of 2026 with a view toward recovering the costs associated with eligible transmission and distribution investments that were placed into service after December 31, 2024 and that are not currently reflected in rates. Since the June 2025 effective date of the bill, Oncor has recognized revenues and corresponding regulatory assets for recoverable costs related to UTM-eligible transmission and distribution capital investments that were placed into service from January 1, 2025 through September 30, 2025, including depreciation expense, carrying costs on unrecovered balances and related taxes. Oncor expects to continue recognizing revenues and corresponding regulatory assets as UTM-eligible transmission and distribution capital investments are placed into service.\nSharyland Utilities \nOn May 1, 2025, Sharyland Utilities filed its 2025 rate case using a test year based on calendar year 2024 with certain adjustments. Sharyland Utilities is seeking a revenue requirement of $55 million, which is an approximately 14% increase over adjusted test-year revenues. Sharyland Utilities is also requesting a rate of return of 7.32%, which is based on a proposed capital structure ratio of 55% debt to 45% equity; a proposed ROE of 10.75%; and a proposed long-term cost of debt of 4.52%. \nOn September 16, 2025, Sharyland Utilities, the PUCT Staff and Texas Industrial Energy Consumers reached a unanimous settlement. Under the settlement, Sharyland Utilities’ total revenue requirement would be set at $53 million, with a capital structure ratio of 59% debt to 41% equity; an ROE of 9.60%; and a long-term cost of debt of 4.52%. Although the administrative law judge had prepared a draft order for the Commission’s consideration, the PUCT typically considers cases directly when they are settled unanimously, making a formal recommendation from the judge on the merits unnecessary. Sharyland Utilities continues to expect a final order in the fourth quarter of 2025, with rates, if approved, going into effect in December 2025.\nOff-Balance Sheet Arrangement \nOur investment in Oncor Holdings is a variable interest in an unconsolidated entity. We discuss variable interests in Note 1 of the Notes to Condensed Consolidated Financial Statements.\nSempra Infrastructure\nSempra Infrastructure expects to fund capital expenditures, investments and operations in part with available funds, including existing credit facilities, and cash flows from operations from the Sempra Infrastructure businesses. We expect Sempra Infrastructure will require additional funding for the development and expansion of its portfolio of projects, which may be financed through a combination of funding from the parent and NCI owners, bank financing, issuances of debt, project financing, partnering in JVs and asset sales.\nIn the nine months ended September 30, 2025 and 2024, Sempra Infrastructure distributed $131 million and $235 million, respectively, to its NCI owners, and NCI owners contributed $137 million and $1,121 million, respectively, to Sempra Infrastructure.\n124\nTable of Contents\nSempra Infrastructure is in various stages of development or construction of natural gas liquefaction projects, pipeline and terminal projects, and renewable power generation and sequestration projects, which we describe below. The successful development and/or construction of these projects is subject to numerous risks and uncertainties.\nWith respect to projects in development, these risks and uncertainties include, as applicable depending on the project, any failure to:\n▪\nsecure binding customer commitments\n▪\nidentify suitable project and equity partners\n▪\nobtain sufficient financing\n▪\nreach agreement with project partners or other applicable parties to proceed\n▪\nobtain, modify, and/or maintain permits and regulatory approvals, including LNG export applications to non-FTA countries\n▪\nnegotiate, complete and maintain suitable commercial agreements, which may include EPC, tolling, equity acquisition, governance, LNG sales, gas supply and transportation contracts\n▪\nreach a positive FID\nWith respect to projects under construction, these risks and uncertainties include, in addition to the risks described above as applicable to each project, construction delays, unforeseen design flaws, cost overruns and other construction-related issues.\nAn unfavorable outcome with respect to any of these factors could have a material adverse effect on (i) the development and construction of the applicable project, including a potential impairment of all or a substantial portion of the capital costs invested in the project to date, which could be material, and (ii) for any project that has reached a positive FID, Sempra’s results of operations, financial condition, cash flows and/or prospects. For a further discussion of these risks, see “Part I – Item 1A. Risk Factors” in the Annual Report.\nThe descriptions below discuss several HOAs, MOUs and other non-binding development agreements with respect to Sempra Infrastructure’s various development projects. These arrangements do not commit any party to enter into definitive agreements or otherwise participate in the applicable project, and the ultimate participation by the parties remains subject to negotiation and finalization of definitive agreements, among other factors.\nSI Partners\nAs we discuss in Note 6 of the Notes to Condensed Consolidated Financial Statements, in September 2025, we entered into an agreement to sell a 45% equity interest in SI Partners to the KKR Partners for $9.99 billion, subject to adjustments. We expect the sale to close in the second or third quarter of 2026, subject to expiration of the waiting period under the Hart-Scott-Rodino Act; receipt of applicable regulatory approvals, such as antitrust approvals in Mexico and approval by the FERC; receipt of certain other third-party consents or waivers; the absence of a material adverse effect on SI Partners; the absence of specific downgrade events under certain financing arrangements; and other customary closing conditions. As a result of satisfying all applicable criteria, we classified SI Partners’ assets and liabilities as held for sale and ceased depreciation and amortization.\nSubject to adjustments described in Note 6 of the Notes to Condensed Consolidated Financial Statements, the purchase price will be paid to Sempra as follows:\n▪\n$4.65 billion in cash at closing;\n▪\n$4.14 billion plus interest compounded quarterly at 7.5% per annum (totaling $4.72 billion with principal and accrued interest unless paid early) due December 31, 2027 under instruments backed by equity commitment letters; and\n▪\n$1.2 billion plus interest compounded quarterly at 8.5% per annum before January 1, 2031 and 10.0% per annum thereafter (totaling $2.29 billion with principal and accrued interest unless paid early) due seven years and 91 days after closing under promissory notes.\nSubject to closing, the KKR Partners will own 65% of SI Partners, Sempra will retain a 25% interest and ADIA will retain a 10% interest, and we will deconsolidate SI Partners and account for our 25% interest in SI Partners under the equity method within the existing Sempra Infrastructure segment.\n125\nTable of Contents\nAdditionally, upon closing, we expect Sempra’s ownership interests in the following LNG projects to change as follows:\nOWNERSHIP INTERESTS\nPre-sale\nPost-sale\nSempra:\nCameron LNG Phase 1 facility\n35.1 \n%\n12.6 \n%\nECA LNG Phase 1 project\n(1)\n58.4 \n%\n20.9 \n%\nPA LNG Phase 1 project\n(1)\n19.6 \n%\n7.0 \n%\nPA LNG Phase 2 project\n35.1 \n%\n12.5 \n%\n(1)    \nSI Partners will continue to be subject to substantially the same funding obligations post-sale as it is pre-sale for cost overruns in the construction of this project.\nLNG\nCameron LNG Phase 2 Project. \nCameron LNG JV is developing a proposed expansion project that would add one electric drive liquefaction train with an expected maximum production capacity of approximately 6.75 Mtpa and would increase the production capacity of the existing three trains at the Cameron LNG Phase 1 facility by up to approximately 1 Mtpa through debottlenecking activities. The Cameron LNG JV site can accommodate additional trains beyond the proposed Cameron LNG Phase 2 project.\nCameron LNG JV has received major permits, which have been amended to allow the use of electric drives for a one-train electric drive expansion along with other design enhancements, and FTA and non-FTA approvals associated with the potential expansion. The non-FTA approval for the proposed Cameron LNG Phase 2 project includes, among other things, a May 2026 deadline to commence commercial exports. In October 2025, we filed a request with the FERC and DOE to extend the construction deadlines associated with our construction authorization and non-FTA authorizations, respectively. Those requests seek an extension of the relevant deadlines until the first quarter of 2033.\nSempra Infrastructure and the other Cameron LNG JV members, namely affiliates of TotalEnergies SE, Mitsui & Co., Ltd. and Japan LNG Investment, LLC, a company jointly owned by Mitsubishi Corporation and Nippon Yusen Kabushiki Kaisha, have entered into a non-binding HOA for the potential development of the Cameron LNG Phase 2 project. The non-binding HOA provides a commercial framework for the proposed project, including the contemplated allocation to SI Partners of 50.2% of the fourth train production capacity and 25% of the debottlenecking capacity from the project under tolling agreements. The non-binding HOA contemplates the remaining capacity to be allocated equally to the existing Cameron LNG Phase 1 facility customers.\nEntergy Louisiana, LLC, a subsidiary of Entergy Corporation, and Cameron LNG JV have an electricity service agreement (and related ancillary agreements) for the supply to Cameron LNG JV of up to 950 MW of power from new renewable sources in Louisiana.\nCameron LNG JV concluded additional value engineering work on the proposed project in December 2024, which improved the overall anticipated value of the project and enabled evaluation of another potential EPC contractor. In collaboration with our partners, we continue to evaluate the results of this work as well as the full scope of the proposed project.\nUnder the Cameron LNG JV equity agreements, the expansion of the project requires the unanimous consent of all the members, including with respect to the equity investment obligation of each member. Expansion of the Cameron LNG Phase 1 facility beyond the first three trains is also subject to certain restrictions and conditions under the JV project financing agreements, including among others, scope restrictions on expansion of the project unless appropriate prior consent is obtained from the existing project lenders. An FID remains subject to, among other things, securing these consents of the members and project lenders, satisfactory conclusion on the EPC process, negotiation and finalization of definitive offtake agreements and completion of all related financing and permitting activities.\nECA LNG Phase 1 Project.\n ECA LNG Phase 1 is constructing a one-train natural gas liquefaction facility at the site of Sempra Infrastructure’s existing ECA Regas Facility with a nameplate capacity of 3.25 Mtpa and an initial offtake capacity of 2.5 Mtpa. We do not expect the construction or operation of the ECA LNG Phase 1 project to disrupt operations at the ECA Regas Facility. SI Partners owns an 83.4% interest in ECA LNG Phase 1, resulting in Sempra Infrastructure holding a 58.4% interest in the project. An affiliate of TotalEnergies SE owns the remaining 16.6% interest in the project.\n126\nTable of Contents\nWe received authorizations from the DOE to export U.S.-produced natural gas to Mexico and to re-export LNG to non-FTA countries from the ECA LNG Phase 1 project. In September 2025, we submitted a filing with the DOE to extend the construction deadline associated with our non-FTA permits until the end of summer 2026. ECA LNG Phase 1 has definitive 20-year SPAs with an affiliate of TotalEnergies SE for approximately 1.7 Mtpa of LNG and with Mitsui & Co., Ltd. for approximately 0.8 Mtpa of LNG. The customers have a termination right if the ECA LNG Phase 1 project does not commence commercial operations under the SPAs by February 24, 2026, subject to certain additional conditions, for which we have requested an extension.\nWe have an EPC contract with TP Oil & Gas Mexico, S. De R.L. De C.V., an affiliate of Technip Energies N.V., to construct the ECA LNG Phase 1 project. We estimate the total price of the EPC contract to be approximately $1.6 billion, with capital expenditures approximating $2.5 billion including capitalized interest at the project level and project contingency. The actual cost of the EPC contract and the actual amount of these capital expenditures may differ substantially from our estimates. We expect the ECA LNG Phase 1 project to produce LNG cargoes for sale in the spring of 2026 and sales under the long-term SPAs to begin shortly after substantial completion when the facility commences commercial operations, which is targeted in the summer of 2026. Reaching substantial completion under the EPC contract is subject to various milestones, including achieving certain performance tests and functionality.\nECA LNG Phase 1 has a loan agreement with a syndicate of external lenders that was set to mature in December 2025 and was originally for an aggregate principal amount of up to $1.3 billion. As we discuss in Note 7 of the Notes to Condensed Consolidated Financial Statements, in July 2025, ECA LNG Phase 1 amended the loan agreement, which included extending the maturity date to December 2027 and increasing the aggregate borrowing capacity to $1.5 billion. At September 30, 2025 and December 31, 2024, $1.2 billion and $1.1 billion, respectively, of borrowings were outstanding under the loan agreement, with a weighted-average interest rate of 6.39% and 7.29%, respectively. Proceeds from the loan are being used to finance the cost of construction of the ECA LNG Phase 1 project.\nWith respect to the ECA LNG Phase 1 and Phase 2 projects, recent and proposed changes to the Mexican Constitution and certain laws in Mexico and an unfavorable resolution of a land dispute and permit challenges, in each case that we discuss in Note 13 of the Notes to Condensed Consolidated Financial Statements, could have a material adverse effect on the development and construction of these projects.\nECA LNG Phase 2 Project.\n Sempra Infrastructure is developing a second, large-scale natural gas liquefaction project at the site of its existing ECA Regas Facility. We expect the proposed ECA LNG Phase 2 project to be comprised of two trains and one LNG storage tank and produce approximately 12 Mtpa of export capacity. The ECA Regas Facility currently has firm storage service agreements and nitrogen injection service agreements with Shell México Gas Natural, S. de R.L. de C.V. and SEFE Marketing & Trading México S. de R.L. de C.V. that expire in May 2028 and December 2025, respectively. We expect that future construction of the proposed ECA LNG Phase 2 project would conflict with the current operations at the ECA Regas Facility to the extent those agreements have not expired or have not been earlier terminated at the time of such construction.\nWe received authorizations from the DOE to export U.S.-produced natural gas to Mexico and to re-export LNG to non-FTA countries from the proposed ECA LNG Phase 2 project. In October 2025, we submitted a request with the DOE seeking clarification with the agency that the construction deadline associated with the project will be December 2029, as we requested in our prior application. Alternatively, we requested that the agency extend the deadline to that date for good cause shown.\nWe have non-binding MOUs and/or HOAs with Mitsui & Co., Ltd., an affiliate of TotalEnergies SE, and ConocoPhillips that provide a framework for their potential offtake of LNG from the proposed ECA LNG Phase 2 project and potential acquisition of an equity interest in ECA LNG Phase 2.\nPA LNG Phase 1 Project.\n Sempra Infrastructure is constructing a natural gas liquefaction project on a greenfield site that it owns in the vicinity of Port Arthur, Texas, located along the Sabine-Neches waterway. The PA LNG Phase 1 project will consist of two liquefaction trains, two LNG storage tanks, a marine berth and associated loading facilities and related infrastructure necessary to provide liquefaction services with a nameplate capacity of approximately 13 Mtpa and an initial offtake capacity of approximately 10.5 Mtpa. At September 30, 2025, SI Partners, KKR Denali and an affiliate of ConocoPhillips own a 28%, 42% and 30% interest, respectively, in the PA LNG Phase 1 project. Sempra Infrastructure holds a 19.6% interest in the project.\nSempra Infrastructure has received authorizations from the DOE that permit the LNG to be produced from the PA LNG Phase 1 project to be exported to all current and future FTA and non-FTA countries. In April 2019, the FERC approved the siting, construction and operation of the PA LNG Phase 1 project. Port Arthur LNG I has received authorization from the FERC, subsequently extended in October 2025 to include the PA LNG Phase 2 Project, to increase its work force and implement a 24-hours-per-day construction schedule to further enhance construction efficiency while reducing temporal impacts to the community and environment in the vicinity of the project. The authorization provides the EPC contractor with more optionality to meet or exceed the project’s construction schedule.\n127\nTable of Contents\nThe PA LNG Phase 1 project holds two Clean Air Act, Prevention of Significant Deterioration permits issued by the TCEQ, which we refer to as the “2016 Permit” and the “2022 Permit.” The 2022 Permit also governs emissions for the PA LNG Phase 2 project. In November 2023, a panel of the U.S. Court of Appeals for the Fifth Circuit issued a decision to vacate and remand the 2022 Permit to the TCEQ for additional explanation of the agency’s permit decision. In February 2024, the court withdrew its opinion and referred the case to the Supreme Court of Texas to resolve the question of the appropriate standard to be applied by the TCEQ. In February 2025, the Supreme Court of Texas adopted Port Arthur LNG I’s interpretation of the standard. In August 2025, the U.S. Court of Appeals for the Fifth Circuit applied the standard adopted by the Supreme Court of Texas and denied the petitioner’s argument under the case, resulting in the continued effectiveness of the 2022 Permit. The petitioners have until November 10, 2025 to file a petition for writ of certiorari with the U.S. Supreme Court; however, the Supreme Court does not have to grant review. The 2022 Permit is effective during the pending litigation. The 2016 Permit was not the subject of, and is unaffected by, the pending litigation of the 2022 Permit. Construction of the PA LNG Phase 1 project is proceeding uninterrupted under existing permits, and we do not currently anticipate the pending litigation to materially impact the PA LNG Phase 1 project cost, schedule or expected commercial operations at this stage.\nSempra Infrastructure has definitive SPAs for LNG offtake from the PA LNG Phase 1 project with:\n▪\nan affiliate of ConocoPhillips for a 20-year term for 5 Mtpa of LNG, as well as a natural gas supply management agreement whereby an affiliate of ConocoPhillips will manage the feed gas supply requirements for the PA LNG Phase 1 project.\n▪\nRWE Supply & Trading GmbH, a subsidiary of RWE AG, for a 15-year term for 2.25 Mtpa of LNG.\n▪\nINEOS Energy Trading Limited, a subsidiary of INEOS Limited, for a 20-year term for approximately 1.4 Mtpa of LNG.\n▪\nPolski Koncern Naftowy Orlen S.A. for a 20-year term for approximately 1 Mtpa of LNG.\n▪\nENGIE S.A. for a 15-year term for approximately 0.875 Mtpa of LNG.\nWe have an EPC contract with Bechtel to construct the PA LNG Phase 1 project, which has an estimated price of approximately $10.8 billion, including change orders contemplated in project contingency. Estimated capital expenditures for the PA LNG Phase 1 project remain unchanged at approximately $13 billion including capitalized interest at the project level and project contingency. The actual cost of the EPC contract and the actual amount of these capital expenditures may differ materially from our estimates, including as a result of the imposition of tariffs. We expect the first and second trains of the PA LNG Phase 1 project to commence commercial operations in 2027 and 2028, respectively.\nAs we discuss in Note 13 of the Notes to Condensed Consolidated Financial Statements, in April 2025, an incident occurred at the site of the PA LNG Phase 1 project that resulted in the deaths of three Bechtel employees and injuries to two Bechtel employees. OSHA opened inspections with respect to Bechtel and Sempra Infrastructure but has released the site. Bechtel is continuing construction of the PA LNG Phase 1 project while the cause of the incident remains under investigation. As of October 31, 2025, there are two pending lawsuits filed by 17 plaintiffs. Bechtel is providing indemnity pursuant to the terms of Port Arthur LNG I’s EPC contract.\nAs we discuss in Note 11 of the Notes to Condensed Consolidated Financial Statements, SI Partners and ConocoPhillips have provided guarantees relating to their respective affiliate’s commitment to make its pro rata equity share of capital contributions to fund 110% of the development budget of the PA LNG Phase 1 project, in an aggregate amount of up to $9.0 billion. SI Partners’ guarantee covers 70% of this amount plus enforcement costs of its guarantee. As of September 30, 2025, an aggregate amount of $2.7 billion has been paid by SI Partners’ subsidiary in satisfaction of its commitment to fund its portion of the development budget of the PA LNG Phase 1 project.\nPort Arthur LNG I has a seven-year term loan facility for an aggregate principal amount of approximately $6.8 billion and an initial working capital facility for up to $200 million, each of which matures in March 2030. At September 30, 2025, $2.2 billion of borrowings were outstanding under the term loan facility agreement. Proceeds from the loan are being used to finance the cost of construction of the PA LNG Phase 1 project.\nIn January 2025, Port Arthur LNG I issued senior secured notes for an aggregate principal amount of $750 million and received proceeds of $742 million (net of debt issuance costs of $8 million). In April 2025, Port Arthur LNG I issued senior secured notes for an aggregate principal amount of $250 million and received proceeds of $248 million (net of debt issuance costs of $2 million). The notes mature in December 2042. The net proceeds were used to repay borrowings and accrued interest under the existing Port Arthur LNG I term loan facility.\nPA LNG Phase 2 Project. \nSince reaching a positive FID in September 2025, Sempra Infrastructure has commenced construction of a second phase of the Port Arthur natural gas liquefaction project that we expect will be a similar size to the PA LNG Phase 1 project. The PA LNG Phase 2 project will consist of two liquefaction trains, one LNG storage tank, and associated facilities with a nameplate capacity of approximately 13 Mtpa.\n128\nTable of Contents\nSempra Infrastructure has received authorizations from the DOE that permit the export of LNG from the PA LNG Phase 2 project to all current and future FTA and non-FTA countries. In September 2023, the FERC approved the siting, construction and operation of the PA LNG Phase 2 project. In September 2025, the FERC approved the start of site preparation work.\nAs we discuss above, a U.S. federal court previously issued and subsequently withdrew a decision that would have vacated and remanded the 2022 Permit authorizing emissions from the PA LNG Phase 1 and Phase 2 projects to the TCEQ for additional explanation of the agency’s permit decision. The U.S. Court of Appeals for the Fifth Circuit applied the standard adopted by the Supreme Court of Texas and denied the petitioner’s argument under the case, resulting in the continued effectiveness of the 2022 Permit. The ruling is subject to further appeal before it becomes final. The 2022 Permit is effective during the pending litigation.\nSempra Infrastructure has entered into a non-binding HOA for a 20-year SPA with Aramco International Gas Holding Co B.V. (Aramco) for 5 Mtpa of LNG offtake from the PA LNG Phase 2 project. The HOA further contemplates Aramco’s 25% participation in the project-level equity of the PA LNG Phase 2 project.\nSempra Infrastructure has definitive SPAs for LNG offtake from the PA LNG Phase 2 project with:\n▪\nConocoPhillips for a 20-year term for 4 Mtpa of LNG on a free-on-board basis\n▪\nEQT Corporation for a 20-year term for 2 Mtpa of LNG on a free-on-board basis\n▪\nJERA Co. Inc. for a 20-year term for 1.5 Mtpa of LNG on a free-on-board basis\nIn addition, SI Partners has a definitive SPA with the project for a 20-year term for 2.5 Mtpa of LNG and has entered into offtake agreements for excess quantities of LNG, which includes an offtake agreement for a 30-year term to the extent of incremental amounts produced above 10 Mtpa up to an additional 0.75 Mtpa.\nWe have an EPC contract with Bechtel to construct the PA LNG Phase 2 project. In September 2025, we issued a full notice to proceed under the EPC contract, which has an estimated price of approximately $9.0 billion, including change orders contemplated in project contingency. The total currently estimated capital expenditures for the project are approximately $14 billion, including, among other items, project contingency and a $1.9 billion true-up payment to the PA LNG Phase 1 project to acquire a 50% interest in the shared common facilities. The actual cost of the EPC contract and the actual amount of these capital expenditures may differ substantially from our estimates. We expect the third and fourth trains of the Port Arthur LNG liquefaction project to commence commercial operations in 2030 and 2031, respectively.\nTo secure gas supply for the PA LNG Phase 2 project, Sempra Infrastructure entered into a natural gas transportation agreement with a third-party pipeline developer. The transportation capacity commitment is subject to completion of pipeline construction by a third-party developer that is expected to occur by early 2029. Sempra Infrastructure holds a contractual option to acquire the third party’s interest in the pipeline if certain construction milestones are not met, which would release Sempra Infrastructure from the associated capacity commitment. In September 2025, we provided certain equity commitments related to the Mustang Express Pipeline but, in October 2025, we transferred the full amount of these commitments to third parties. \nAs we discuss in Note 10 of the Notes to Condensed Consolidated Financial Statements, in September 2025, PA2 JVCo issued 49.9% of its equity interests to Blackstone for $3.4 billion in cash at closing and a commitment to fund an additional $3.6 billion of capital contributions on a pre-determined funding schedule whereby Blackstone’s capital contributions are scheduled prior to SI Partners capital contributions. SI Partners holds the remaining 50.1% of equity interests in PA2 JVCo, and has committed to fund up to $7.8 billion to PA2 JVCo to support its share of the budgeted PA LNG Phase 2 project construction costs. SI Partners will continue to consolidate PA2 JVCo and direct the activities related to the construction and future operation and maintenance of the PA LNG Phase 2 project. Blackstone’s equity interest is subject to redemption and exit rights that are outside the control of SI Partners and Blackstone. As a result, we account for Blackstone’s NCI as being contingently redeemable, which is presented as mezzanine equity in our Condensed Consolidated Balance Sheet.\nVista Pacifico LNG Liquefaction Project.\n Sempra Infrastructure is developing the Vista Pacifico LNG project, a mid-scale natural gas liquefaction export facility proposed to be located in the vicinity of the Port of Topolobampo in Sinaloa, Mexico. In June 2024, we extended the non-binding development agreement with the CFE through December 2025. We continue to progress with the CFE on the negotiation of definitive agreements, including a natural gas supply agreement. The proposed LNG export terminal would be supplied with U.S. natural gas and would use excess capacity on existing pipelines in Mexico with the intent of helping to meet growing demand for natural gas and LNG in the Mexican and Pacific markets.\nSempra Infrastructure received authorization from the DOE to permit the export of U.S.-produced natural gas to Mexico and for LNG produced from the proposed Vista Pacifico LNG facility to be re-exported to all current and future FTA countries and non-FTA countries.\n129\nTable of Contents\nIn March 2022, TotalEnergies SE and Sempra Infrastructure entered into a non-binding MOU that contemplates TotalEnergies SE potentially contracting approximately one-third of the long-term export production of the proposed Vista Pacifico LNG project and potentially participating as a minority partner in the project.\nAsset and Supply Optimization.\n As we discuss in “Part II – Item 7A. Quantitative and Qualitative Disclosures About Market Risk” in the Annual Report, Sempra Infrastructure enters into hedging transactions to help mitigate commodity price risk and optimize the value of its LNG, natural gas pipelines and storage, and power-generating assets. Some of these derivatives that we use as economic hedges do not meet the requirements for hedge accounting, or hedge accounting is not elected, and as a result, the changes in fair value of these derivatives are recorded in earnings. Consequently, significant changes in commodity prices have in the past and could in the future result in earnings volatility, which may be material, as the economic offset of these derivatives may not be recorded at fair value.\nOff-Balance Sheet Arrangements.\n Our investment in Cameron LNG JV is a variable interest in an unconsolidated entity. We discuss variable interests in Note 1 of the Notes to Condensed Consolidated Financial Statements.\nIn February 2025, SI Partners entered into a credit support agreement, which constitutes a guarantee, for the benefit of a third-party financial institution with a maximum exposure to loss of $85 million. The guarantee will terminate in May 2026. We discuss this guarantee in Note 13 of the Notes to Condensed Consolidated Financial Statements.\nIn June 2021, Sempra provided a promissory note, which constitutes a guarantee, for the benefit of Cameron LNG JV with a maximum exposure to loss of $165 million. The guarantee will terminate upon full repayment of Cameron LNG JV’s debt, scheduled to occur in 2039, or replenishment of the amount withdrawn by Sempra Infrastructure from the SDSRA. We discuss this guarantee in Note 13 of the Notes to Condensed Consolidated Financial Statements.\nIn July 2020, Sempra entered into a Support Agreement, which contains a guarantee and represents a variable interest, for the benefit of CFIN with a maximum exposure to loss of $979 million. The guarantee will terminate upon full repayment of the guaranteed debt by 2039, including repayment following an event in which the guaranteed debt is put to Sempra. We discuss this guarantee in Notes 1, 9 and 13 of the Notes to Condensed Consolidated Financial Statements.\nEnergy Networks \nEcogas.\n As we discuss in Note 6 of the Notes to Condensed Consolidated Financial Statements, in June 2025, management committed to a formal plan to market and sell Ecogas, a natural gas regulated distribution utility that operates in three separate distribution zones in Mexicali, Chihuahua and La Laguna-Durango, Mexico. We expect to complete the sale in the second or third quarter of 2026. As a result of satisfying all applicable criteria, we classified Ecogas’ assets and liabilities as held for sale and ceased depreciation and amortization. Successful completion of a sale and the timing of such sale is subject to a number of risks and uncertainties, including reaching agreement on acceptable pricing and other terms, securing required regulatory and other approvals, finalizing definitive contracts and other factors and considerations.\nSonora Pipeline.\n Sempra Infrastructure’s Sonora natural gas pipeline consists of two pipeline segments, the Sasabe-Puerto Libertad-Guaymas segment and the Guaymas-El Oro segment. Each segment has its own service agreement with the CFE. Following the start of commercial operations of the Guaymas-El Oro segment, Sempra Infrastructure reported damage to the pipeline in the Yaqui territory that has made that section inoperable since August 2017 because it was not able to be repaired due to legal challenges, which were resolved in March 2023, by some members of the Yaqui tribe.\nIn September 2019, Sempra Infrastructure and the CFE reached an agreement to modify the tariff structure and extend the term of the contract by 10 years. Under the revised agreement, the CFE will resume making payments only when the damaged section of the Guaymas-El Oro segment of the Sonora pipeline is back in service.\nSempra Infrastructure and the CFE have agreed to an amendment to their transportation services agreement and to re-route the portion of the pipeline that is in the Yaqui territory, whereby the CFE would pay for the re-routing with a new tariff. This amendment will terminate if certain conditions are not met, and Sempra Infrastructure retains the right to terminate the transportation services agreement and seek to recover its reasonable and documented costs and lost profit. Sempra Infrastructure continues to acquire and pursue the necessary rights-of-way and permits for the portion of the pipeline that needs to be re-routed.\nThe Guaymas-El Oro segment of the Sonora pipeline currently constitutes a Sole Risk Project under the terms of the SI Partners limited partnership agreement, which means that Sempra Infrastructure holds a 100% interest in the project. Sole Risk Projects are separated from other SI Partners projects and are conducted at Sempra’s sole cost, expense and liability and Sempra Infrastructure receives, through the acquisition of Sole Risk Interests, any economic and other benefits from such projects. The Guaymas-El Oro segment will continue to be owned by and a Sole Risk Project of Sempra after closing the sale of a portion of our equity interest in SI Partners, which we discuss in Note 6.\n130\nTable of Contents\nAt September 30, 2025, Sempra Infrastructure has $391 million of PP&E, net, related to the Guaymas-El Oro segment of the Sonora pipeline, which could be subject to impairment if, among other things, Sempra Infrastructure is unable to re-route a portion of the pipeline and resume operations or if Sempra Infrastructure terminates the contract and is unable to obtain recovery, which in each case could have a material adverse effect on Sempra’s business, results of operations, financial condition, cash flows and/or prospects.\nPort Arthur Pipeline Louisiana Connector. \nSempra Infrastructure is constructing the Port Arthur Pipeline Louisiana Connector, a 72-mile pipeline connecting the PA LNG Phase 1 project to Gillis, Louisiana. In April 2019, the FERC approved the siting, construction and operation of the Port Arthur Pipeline Louisiana Connector, which will be used to supply feed gas to the PA LNG Phase 1 project. Sempra Infrastructure received FERC approval to implement construction process enhancements and minor modifications to several discrete sections of the Port Arthur Pipeline Louisiana Connector. These modifications are intended to decrease environmental impacts, accommodate landowner routing requests and enhance construction procedures. We expect the Port Arthur Pipeline Louisiana Connector to be ready for service ahead of the PA LNG Phase 1 project’s gas requirements. We estimate the capital expenditures for the project will be approximately $1 billion, including capitalized interest at the project level and project contingency. The actual amount of capital expenditures may differ substantially from our estimates.\nLouisiana Storage.\n Sempra Infrastructure is constructing Louisiana Storage, a 12.5-Bcf salt dome natural gas storage facility to support the PA LNG Phase 1 project. The construction includes an 11-mile pipeline that will connect to the Port Arthur Pipeline Louisiana Connector. In September 2022, the FERC approved the development of the project. We expect Louisiana Storage to be ready for service in time to support the needs of the PA LNG Phase 1 project. We estimate the capital expenditures for the project will be approximately $400 million, including capitalized interest at the project level and project contingency. The actual amount of capital expenditures may differ substantially from our estimates.\nLow Carbon Solutions\nCimarrón Wind.\n Sempra Infrastructure has reached a positive FID to construct the Cimarrón Wind project, an approximately 320-MW wind generation facility in Baja California, Mexico. Sempra Infrastructure has a 20-year PPA with Silicon Valley Power for the long-term supply of renewable energy to the City of Santa Clara, California. Cimarrón Wind will utilize one of Sempra Infrastructure’s existing cross-border high voltage transmission lines to interconnect and deliver clean energy to the East County substation in San Diego County. We estimate the capital expenditures for the project will be approximately $550 million, including capitalized interest at the project level and project contingency. The actual amount of capital expenditures may differ substantially from our estimates. The Cimarrón Wind project began generating energy in October 2025 and we expect commercial operations to commence in the first half of 2026.\nHackberry Carbon Sequestration Project.\n Sempra Infrastructure is developing the potential Hackberry Carbon Sequestration project near Hackberry, Louisiana, together with TotalEnergies SE, Mitsui & Co., Ltd. and Mitsubishi Corporation. This proposed project is designed to permanently sequester carbon dioxide from the Cameron LNG Phase 1 facility, the proposed Cameron LNG Phase 2 project and potentially other sources. In April 2025, the Louisiana Department of Energy and Natural Resources (LDENR) issued a draft Class VI carbon injection well construction permit and held the required public hearing. In September 2025, LDENR issued the final permit to construct a Class VI carbon injection well, subject to a 60-day appeal process.\nLegal and Regulatory Matters\nSee Note 13 of the Notes to Condensed Consolidated Financial Statements in this report and “Part I – Item 1A. Risk Factors” in the Annual Report for discussions of the following legal and regulatory matters affecting our operations in Mexico and risks associated with Mexican laws, policies and government influence:\nEnergía Costa Azul\n▪\nLand Disputes\n▪\nEnvironmental and Social Impact Permits\nOne or more unfavorable conclusions on these land disputes or environmental and social impact permit challenges could materially adversely affect our existing natural gas regasification operations and proposed natural gas liquefaction projects at the site of the ECA Regas Facility and have a material adverse effect on Sempra’s business, results of operations, financial condition, cash flows and/or prospects.\n131\nTable of Contents\nRegulatory and Other Actions by the Mexican Government\nIn 2021, the Mexican government amended the LIE and LH to empower Mexican regulators to, among other things, revoke or suspend permits under certain circumstances. In 2024, the Mexican government adopted changes to the Mexican Constitution to reinforce state control over strategic sectors by granting a central role to government entities like the CFE and PEMEX, which have been converted from for-profit state-owned enterprises into public state-owned enterprises. Following these constitutional reforms, in March 2025, the Mexican government adopted energy-related laws (2025 Energy Laws), including the ESL, which repealed the LIE, and the HSL, which repealed the LH. The 2025 Energy Laws increase the government’s control and participation in the energy sector and may create novel challenges for infrastructure development and operations. Like the LIE and LH, the ESL and HSL give Mexican authorities broad discretion to revoke or suspend permits under certain circumstances. In October 2025, the Mexican government enacted new regulations regarding the ESL and HSL, which provide further detail on the legal and regulatory framework of the energy sector. These new regulations provide state-owned companies preferential treatment regarding open access, increase oversight by regulators and obligations for private companies and reduce the maximum term of certain permits for new projects. For the power sector, the new regulations provide for state prevalence and additional requirements for private projects, increase oversight by regulators and sanctions and establish that self-supply permits remain valid and can migrate voluntarily to the wholesale electricity market.\nAlthough the new laws, regulations, and certain general administrative provisions in the energy sector have been published, the extent of the impact of the 2025 Energy Laws is still uncertain. These laws and future implementation of existing and any new regulations could adversely affect Sempra Infrastructure’s ability to operate its existing assets at their current levels, result in increased costs to Sempra Infrastructure and its customers, adversely impact Sempra Infrastructure’s ability to develop new projects in Mexico, result in decreased revenues and/or cash flows, and negatively impact Sempra Infrastructure’s ability to recover the carrying values of its investments in Mexico, any of which could have a material adverse impact on Sempra’s business, results of operations, financial condition, cash flow and/or prospects.\nSOURCES AND USES OF CASH\nThe following tables include only significant changes in cash flow activities for each of the Registrants.\nCASH FLOWS FROM OPERATING ACTIVITIES\n(Dollars in millions)\nNine months ended September 30,\nSempra\nSDG&E\nSoCalGas\n2025\n$\n3,376 \n$\n1,343 \n$\n1,426 \n2024\n3,542 \n1,443 \n1,370 \nChange\n$\n(166)\n$\n(100)\n$\n56 \nChange in regulatory accounts, current and noncurrent\n$\n(534)\n$\n(215)\n$\n(319)\nChange in accounts receivable\n(331)\n(133)\n(58)\nIncrease in income taxes payable, net\n(92)\nChange in net margin posted, current and noncurrent\n(84)\nChange in inventories\n(32)\nChange in GHG obligations, current and noncurrent\n23 \n42 \nHigher accruals in interest payable\n50 \n17 \nCustomer\n’\ns early termination of firm transportation agreements\n52 \nHigher net income, adjusted for noncash items included in earnings\n87 \n68 \n71 \nChange in accrued franchise fees\n92 \n76 \n16 \nChange in GHG allowances, current and noncurrent\n105 \n86 \n41 \nChange in fixed-price contracts and other derivatives, current and noncurrent\n134 \n133 \nHigher distributions from Oncor Holdings\n158 \nChange in accounts payable\n183 \n28 \n130 \nOther\n(9)\n5 \n \n$\n(166)\n$\n(100)\n$\n56 \n132\nTable of Contents\nCASH FLOWS FROM INVESTING ACTIVITIES\n(Dollars in millions)\nNine months ended September 30,\nSempra \nSDG&E\nSoCalGas\n2025\n$\n(8,605)\n$\n(1,762)\n$\n(1,523)\n2024\n(6,296)\n(1,793)\n(1,491)\nChange\n$\n(2,309)\n$\n31 \n$\n(32)\n(Increase) decrease in capital expenditures\n$\n(1,436)\n$\n27 \n$\n(32)\nHigher contributions to Oncor Holdings\n(912)\nOther\n39 \n4 \n \n$\n(2,309)\n$\n31 \n$\n(32)\nCASH FLOWS FROM FINANCING ACTIVITIES \n(Dollars in millions)\nNine months ended September 30,\nSempra\nSDG&E\nSoCalGas\n2025\n$\n6,661 \n$\n419 \n$\n85 \n2024\n3,066 \n315 \n121 \nChange\n$\n3,595 \n$\n104 \n$\n(36)\nContributions from contingently redeemable noncontrolling interest, net of transaction costs\n$\n3,212 \nHigher issuances of long-term debt\n1,864 \n$\n254 \nChange in borrowings and repayments of short-term debt, net\n759 \n(774)\n$\n1,020 \nHigher (lower) issuances of short-term debt with maturities greater than 90 days\n591 \n(500)\nProceeds from investor equity subscription\n106 \nLower distributions to NCI\n104 \n(Higher) lower common dividends paid\n(74)\n225 \nHigher payments on short-term debt with maturities greater than 90 days\n(485)\n(700)\nLower contributions from NCI\n(984)\n(Higher) lower payments on long-term debt and finance leases\n(1,441)\n400 \n148 \nOther\n(57)\n(1)\n(4)\n$\n3,595 \n$\n104 \n$\n(36)\nCapital Expenditures for PP&E and Investments\nCAPITAL EXPENDITURES FOR PP&E AND INVESTMENTS\n(Dollars in millions)\nNine months ended September 30,\n \n2025\n2024\nSempra:\nSempra California\n(1)\n$\n3,334 \n$\n3,329 \nSempra Texas Utilities\n1,490 \n578 \nSempra Infrastructure\n3,865 \n2,443 \nSegment totals\n8,689 \n6,350 \nParent and other\n4 \n3 \nTotal Sempra\n$\n8,693 \n$\n6,353 \n(1)    \nIncludes capital expenditures for PP&E of $1,811\n \nand $1,838 at SDG&E and $1,523 and $1,491 at SoCalGas for 2025 and 2024, respectively.\nWe expect capital expenditures for PP&E and investments in 2025 to total $13.3 billion, which is an increase from the $12.5 billion projected in “Part II – Item 7. MD&A – Capital Resources and Liquidity” in the Annual Report. The increase is primarily attributable to capital expenditures for the PA LNG Phase 2 project, which reached a positive FID in September 2025. When (i) including Sempra’s proportionate ownership interest in expected capital expenditures for PP&E at unconsolidated equity method investees while excluding Sempra’s expected capital contributions to those unconsolidated equity method investees and (ii) excluding NCI’s proportionate ownership interest in expected capital expenditures for PP&E at Sempra and at unconsolidated equity method investees, we expect capital expenditures for PP&E in 2025 to total $12.9 billion. \n133\nTable of Contents\nOncor expects to announce a new five-year base capital plan for the years 2026 through 2030 in the first half of 2026, following the conclusion of its base rate review, and currently expects that capital expenditure plan to be at least 30% higher than Oncor’s 2025 through 2029 base capital plan of $36 billion. Oncor also anticipates significant potential capital expenditure opportunities incremental to the 2026 through 2030 base capital plan. Changes in Oncor’s capital expenditures plan could result in corresponding changes to our capital expenditures plan based on our ownership interest in Oncor. \nOur level of capital expenditures for PP&E and investments will depend on, among other things, the cost and availability of financing, regulatory approvals, changes in tax law and business opportunities providing desirable rates of return, among various other factors described in this MD&A and in “Part I – Item 1A. Risk Factors” in the Annual Report. We aim to finance our capital expenditures for PP&E and investments in a manner that will maintain our investment-grade credit ratings and capital structure, but there is no guarantee that we will be able to do so.\nCRITICAL ACCOUNTING ESTIMATES\nManagement views certain accounting estimates as critical because their application is the most relevant, judgmental and/or material to our financial position and results of operations, and/or because they require the use of material judgments and estimates. We discuss critical accounting estimates in “Part II – Item 7. MD&A” in the Annual Report.\nNEW ACCOUNTING STANDARDS\nWe discuss any recent accounting pronouncements that have had or may have a significant effect on our financial statements and/or disclosures in Note 2 of the Notes to Condensed Consolidated Financial Statements."
}