{
  "source_file": "ste-20250331.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS\nINTRODUCTION \nSTERIS is a leading global provider of products and services that support patient care with an emphasis on infection prevention.  WE HELP OUR CUSTOMERS CREATE A HEALTHIER AND SAFER WORLD by providing innovative healthcare and life science products and services around the globe. We offer our Customers a unique mix of innovative products and services. These include: consumable products, such as detergents, endoscopy accessories, barrier products, instruments and tools; services, including equipment installation and maintenance, microbial reduction of medical devices, instrument and scope repair, laboratory testing, and outsourced reprocessing; capital equipment, such as sterilizers, surgical tables, and automated endoscope reprocessors; and connectivity solutions such as operating room (“OR”) integrati\non.\nWe operate and report our financial information in three reportable business segments: Healthcare, Applied Sterilization Technologies (\"AST\"), and Life Sciences.\n \nPreviously, we had four reportable business segments; however, as a result of the divestiture of our Dental segment, Dental is presented as discontinued operations. Historical information has been retrospectively adjusted to exclude discontinued operations for comparability, as required. For more information, refer to Note 4 to our consolidated financial statements titled, \"Discontinued Operations.\" Non-allocated operating costs that support the entire Company and items not indicative of operating trends are excluded from segment operating income. We describe our business segments in the section that follows, titled \"Information Related to Business Segments\" and Note 13 to our consolidated financial statements titled, \"Business Segment Information.\"\nThe\n bulk of our revenues are derived from healthcare, medical device and pharmaceutical Customers. Much of the growth in these industries is driven by the aging of the population throughout the world, as an increasing number of individuals are entering their prime healthcare consumption years, and is dependent upon advancement in healthcare delivery, acceptance of new technologies, government policies, and general economic conditions.  \nIn\n addition, there is increased demand for medical procedures, including preventive screenings such as endoscopies and colonoscopies; and a desire by our Customers to operate more efficiently, all of which are driving increased demand for many of our products and services.\nINFORMATION RELATED TO BUSINESS SEGMENTS \nOur chief operating decision maker is our President and Chief Executive Officer (“CEO”). The CEO is responsible for performance assessment and resource allocation. The CEO regularly receives discrete financial information about each reportable segment and uses this information to assess performance and allocate resources. The accounting policies of the reportable segments are the same as those described in Note 1 to our consolidated financial statements titled, “Nature of Operations and Summary of Significant Accounting Policies,” of this Annual Report.\nHEALTHCARE SEGMENT\nDescription of Busi\nness.\n  Our Healthcare segment provides a comprehensive offering for healthcare providers worldwide, focused on sterile processing departments and procedural centers, such as operating rooms and endoscopy suites. Our products and services range from infection prevention consumables and capital equipment, as well as services to maintain that equipment, to the repair of re-usable procedural instruments, to outsourced instrument reprocessing services. In addition, our procedural products also include endoscopy accessories, instruments, and capital equipment infrastructure used primarily in operating rooms, ambulatory surgery centers, endoscopy suites, and other procedural areas.\nProducts Offered.\n Our products include cleaning chemistries and sterility assurance products, automated endoscope reprocessing systems and tracking products, endoscopy accessories, instruments, washers, sterilizers and other pieces of capital equipment essential to the operations of a sterile processing department and equipment used directly in the procedure rooms, including surgical tables, lights, equipment management services, and connectivity solutions.\nServices Offered. \nOur Healthcare segment service employees install, maintain, upgrade, repair, and troubleshoot capital equipment throughout the world. We offer various preventive maintenance programs and repair services to support the effective operation of capital equipment over its lifetime. Our Healthcare segment also provides comprehensive instrument, devices, and endoscope repair and maintenance services (on-site or at one of our dedicated facilities), custom process improvement consulting and outsourced instrument sterile processing (on-site at the hospital and in off-site reprocessing centers). \n3\nTable of Contents\nCustomer Concentration.\n Our Healthcare segment sells consumables, services and capital equipment to Customers in many countries throughout the world. For the year ended March 31, 2025, no Customer represented more than 10% of the Healthcare segment's total revenues.\nCompetition.\n \nWe compete with a number of large companies that have significant product portfolios and global reach, as well as a number of small companies with very limited product offerings and operations in one or a limited number of countries. On a product basis, competitors include 3M, Baxter, Boston Scientific, Belimed, Ecolab, Fortive, Getinge, Karl Storz, Olympus, Ruhof, SteelCo, Stryker, Skytron and Wassenburg. On a service line basis, competitors include BBraun, Crothall, Olympus and Pentax.\nAST SEGMENT\nDescription of Business. \nOur AST segment supports medical device and pharmaceutical manufacturers through a global network of contract sterilization and laboratory testing facilities, and integrated sterilization equipment and control systems. Our technology-neutral offering supports Customers every step of the way, from testing through sterilization.\nServices Offered.\n We offer a wide range of sterilization modalities and an array of testing services that complement the manufacturing of single-use, sterile products. Our facilities are located in regions with a concentration of medical device and pharmaceutical manufacturing throughout the Americas, Europe, and Asia. Our technical professionals support Customers in all phases of product development, materials testing, and process validation. In addition, we manufacture and supply integrated sterilization equipment and control systems to medical device manufacturers and research institutions.\nProducts Offered. \nWe support Customers with process controls and monitoring systems, and integrated sterilization equipment, including accelerators, product handling, and automation.\nCustomer Concentration.\n  Our AST segment’s services are offered to Customers throughout the world. For the year ended March 31, 2025, no Customer represented more than 10% of the segment’s revenues.\nCompetition. \nAST operates in a highly regulated industry and competes with Sterigenics International, Inc., other smaller contract sterilization companies, other manufacturers of sterilization equipment and control systems, and manufacturers that sterilize products in-house.\nLIFE SCIENCES SEGMENT\nDescription of Business. \n Our Life Sciences segment provides a comprehensive offering of products and services designed to support biopharmaceutical and medical device manufacturing facilities, in particular those focused on aseptic manufacturing. Our portfolio includes a full suite of consumable products, equipment maintenance, specialty services, and capital equipment. \nProducts Offered. \n Our products include pharmaceutical detergen\nts, cleanroom disinfectants and sterilants, pharmaceutical grade and research sterilizers and washers, sterility assurance and maintenance products, vaporized hydrogen peroxide room decontamination systems and sterilizers, and high purity water and pure steam generators. \nServices Offered.  \nOur Life Sciences segment service employees install, maintain, upgrade, repair, and troubleshoot equipment throughout the world. We offer various preventive maintenance programs and repair services to support the effective operation of capital equipment over its lifetime. \nCustomer Concentration.\n  Our Life Sciences segment sells consumables, services and capital equipment to Customers globally. For the year ended March 31, 2025, no Customer represented more than 10% of the Life Sciences segment’s total revenues.\nCompetition.\n  Our Life Sciences segment operates in highly regulated environments where the most intense competition results from technological innovations, product performance, convenience and ease of use, and overall cost-effectiveness. We compete for pharmaceutical Customers with a number of large companies that have significant product portfolios and global reach, as well as a number of small companies with very limited product offerings and operations in one or a limited number of countries. Competitors include Belimed, Contec, Ecolab, Fedegari, Getinge, and Stilmas.\nINFORMATION WITH RESPECT TO OUR BUSINESS IN GENERAL\nSources and Availability of Raw Materials. \n We purchase raw materials, sub-assemblies, components, and other supplies needed in our operations from numerous suppliers in the United States and internationally. The principal raw materials and supplies used in our operations include stainless and carbon steel, organic and inorganic chemicals, fuel, and plastic components. These raw materials and supplies are generally available from several suppliers and in sufficient quantities. We have long-term supply contracts for certain materials for which there are few suppliers, or those that are single-sourced in certain regions of the world, such as ethylene oxide (\"EO\") and radioisotope cobalt-60 (\"cobalt-60\"), which are necessary to our AST operations. In addition, we continue to expand our irradiation processing capacity with accelerator-based technologies, in order to help mitigate the potential cobalt-60 supply risk. \n4\nTable of Contents\nInflation.  \nHistorically, our business has not been significantly impacted by the overall effects of inflation.\n However, during fiscal 2023 and 2024, we experienced a rise in supply chain and labor costs, which moderated in fiscal 2025.\n Changes to trade policy, including tariff measures introduced in early calendar year 2025, may drive new inflation risks in our supply chain for materials as well as the costs of other goods and services important to our operations. The U.S. measures and the response from other countries continue to evolve, creating uncertainty in trade and economic dynamics. We \nmonitor the prices we charge for our products and services on an ongoing basis and plan to adjust those prices to take into account future changes in the rate of inflation.\nIntellectual Property. \n We protect our technology and products by, among other means, obtaining United States and foreign patents. There can be no assurance, however, that any patent will provide adequate protection for the technology, system, product, service, or process it covers. In addition, the process of obtaining and protecting patents can be long and expensive. We also rely upon trade secrets, technical know-how, and continuing technological innovation to develop and maintain our co\nmpetitive position.\nAs of March 31, 2025, we held \n607 United States patents and 2,315 patents in other jurisdictions and had 90 United States patent applications and 289 patent applications pending in other jurisdictions. \nPatents for individual products extend for varying periods according to the date of filing or grant and legal term of patents in various countries where a patent is obtained. The actual protection a patent provides varies from country to country and depends in part upon the type of patent, the scope of its coverage, and the availability of legal remedies in each country.\nOur products are sold around the world under various brand names and trademarks. We consider our brand names and trademarks to be valuable in the marketing of our products. As of March 31, 2025, we had a total of approximately 2,145 \ntrademark registrations worldwide.\nQuality Assurance. \n We manufacture, assemble, and package products in several countries. Each of our production facilities are dedicated to particular processes and products. Our success depends upon Customer confidence in the quality of our production process and the integrity of the data that supports our product safety and effectiveness. We have implemented quality assurance procedures to support the quality and integrity of scientific information and production processes. \nContinuous Improvement. \nContinuous improvement is fundamental to how we operate at STERIS. We apply Lean principles across manufacturing, service operations, back office, and support functions through our Minimum Standard of Lean (MSoL) framework. MSoL establishes a consistent foundation for problem solving, standard work, and performance management while enabling local ownership and innovation. It assesses maturity across core dimensions—including continuous improvement training and development, routine management and strategic alignment, 5S, value stream mapping, kaizen management, lean tools and systems, and integration with new product development (NPD).  \nOur efforts are designed to deliver better outcomes for Customers, Shareholders, and employees. By targeting key areas, we strengthen performance, agility, and value. In manufacturing and service operations, we apply flow and cellular production concepts and cross-train employees to increase flexibility and throughput. We also assess opportunities to in-source, outsource, or adopt technology to drive value.  \nWe extend these principles to back office and support functions where Lean tools streamline workflows, reduce waste, and improve service delivery.  \nA dedicated Continuous Improvement team partners with the business to coach, build capability, and accelerate results. Through kaizen events, tiered daily management, and employee-led initiatives, we foster a culture where employees are empowered to drive change. This mindset is supported at all levels of the organization, reinforcing alignment, engagement, and long-term performance.\nGovernment Regulation. \n Our business is subject to various degrees of governmental regulation in the countries in which we operate. In the United States, the Food and Drug Administration (“FDA”), the Environmental Protection Agency (“EPA”), the Occupational Safety and Health Administration (\"OSHA\"), the Nuclear Regulatory Commission, and other governmental authorities regulate the development, manufacture, sale, and distribution of our products and services. Our international operations also are subject to a significant amount of government regulation, including country-specific rules and regulations and U.S. regulations applicable to our international operations. Government regulations require detailed inspection of, and controls over, research and development, clinical investigations, product approvals and manufacturing, marketing and promotion, sampling, distribution, record-keeping, storage, and disposal practices.\nCompliance with applicable regulations is a significant expense for us. Past, current or future regulations, their interpretation, or their application could have a material adverse impact on our operations. Also, additional governmental regulation may be passed that could prevent, delay, revoke, or result in the rejection of regulatory clearance of our products. We cannot predict the effect on our operations resulting from current or future governmental regulation or the interpretation or application of these regulations.\n5\nTable of Contents\nIf we fail to comply with any applicable regulatory requirements, penalties could be imposed on us. For more information about the risks we face regarding regulatory requirements, see Part I, Item 1A of this Annual Report titled, \"Risk Factors.\" We are subject to extensive regulatory requirements and must receive and maintain regulatory clearance or approval for many products and operations. Failure to receive or maintain, or delays in receiving, clearance or approvals may hurt our revenues, profitability, financial condition, or value.\nIn the past, we have received warning letters, paid civil penalties, conducted product recalls and field corrections, and been subject to other regulatory penalties. We believe that we are currently compliant in all material respects with applicable regulatory requirements. However, there can be no assurance that future or current regulatory, governmental, or private action will not have a material adverse effect on us or on our performance, results, or financial condition.\nEnvironmental Matters.\n  We are subject to various laws and governmental regulations concerning environmental matters and employee safety and health in Ireland, the United States and other countries. We have made, and continue to make, significant investments to comply with these laws and regulations. We cannot predict the future capital expenditures or operating costs required to comply with environmental laws and regulations. We believe that we are currently compliant with applicable environmental, health, and safety requirements in all material respects. However, there can be no assurance that future or current regulatory, governmental, or private action will not have a material adverse effect on our performance, results, or financial condition. Please refer to Note 12 to our consolidated financial statements titled, \"Commitments and Contingencies\" for further information.\nIn the future, if a loss contingency related to environmental matters, employee safety, health or conditional asset retirement obligations which is estimable and probable is significantly greater than the current recorded amount, we would record an additional liability for the obligation and it may result in a material impact on net income for the annual or interim period during which the liability is recorded. The investigation and remediation of environmental obligations generally occur over an extended period of time, and therefore we do not know if these events would have a material adverse effect on our financial condition, liquidity, or cash flow, nor can there be any assurance that such liabilities would not have a material adverse effect on our performance, results, or financial condition.\nCompetition.\n  The markets in which we operate are highly competitive and generally highly regulated. Competition is intense in all of our business segments and includes many large and small competitors. Brand, design, quality, safety, ease of use, serviceability, price, product features, warranty, delivery, service, and technical support are important competitive factors to us. We expect to face continued competition in the future as new infection prevention, sterile processing, contamination control, gastrointestinal and surgical support products and services enter the market. We believe many organizations are working with a variety of technologies and sterilizing agents.\nWe believe that our long-term competitive position depends on our success in discovering, developing, and marketing innovative, cost-effective products and services. We devote significant resources to research and development efforts, and we believe STERIS is positioned as a global competitor in the search for technological innovations. In addition to research and development, we invest in quality control, Customer training programs, distribution systems, technical services, and other information services. In addition to organic opportunities, acquisitions are a key part of our long-term strategy for growth.\nThere can be no assurance that we will develop significant new products or services, or that the new products or services we provide or develop in the future will be more commercially successful than those provided or developed by our competitors. In addition, some of our existing or potential competitors may have greater resources than us. Therefore, a competitor may succeed in developing and commercializing products more rapidly than we do. Competition, as it relates to our business segments and product categories, is discussed in more detail in the section above titled, “Information Related to Business Segments.”\nMethods of Distribution. \n Sales and service activities are supported by a staff of regionally based clinical specialists, system planners, corporate account managers, and in-house Customer service and field support departments. We also contract with distributors and dealers.\nCustomer training is important to our business. We provide a variety of courses at Customer locations, at our training and education centers, and over the internet. Our training programs help Customers understand the science, technology, and operation of our products and services. Many of our operator training programs are approved by professional certifying organizations and offer continuing education credits to eligible course participants.\nSeasonality.\n  Our financial results have, from time to time, exhibited seasonal patterns. In particular, capital equipment revenues within our Healthcare segment have historically been higher in the fourth quarter of our fiscal year. However, we cannot guarantee that these patterns will persist.\nBacklog.\n  We define backlog as the amount of unfilled capital equipment purchase orders at a point in time. At March 31, 2025, we had a backlog of $452.9 million. Of this amount, $369.2 million and $83.7 million related to our Healthcare and Life Sciences segments, respectively. At March 31, 2024, we had backlog orders of $425.2 million. Of this amount, $353.8 million \n6\nTable of Contents\nand $71.4 million\n \nrelated to our Healthcare and Life Sciences segments, respectively. Backlog increased in fiscal 2025 as a result of higher Customer orders. \nAvailability of Securities and Exchange Commission Filings.\n  We make available free of charge on or through our website our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, and Current Reports on Form 8-K, and amendments to these reports, as soon as reasonably practicable after we electronically file such material with, or furnish such material to, the Securities and Exchange Commission (“SEC”). You may access these documents, as well as other SEC filings related to the Company, on the Investor Relations page of our website at \nhttp://www.steris-ir.com\n. You may also obtain copies of these documents by accessing the SEC’s website at \nhttp://www.sec.gov\n. The content on or accessible through any website referred to in this Annual Report on Form 10-K is not incorporated by reference into this Form 10-K unless expressly noted.\nWe also make available free of charge on our website our Corporate Governance Guidelines, our Director Code of Ethics, and our Code of Business Conduct, as well as the Charters of the Audit Committee, the Compensation and Organization Development Committee, the Nominating and Governance Committee, and the Compliance and Technology Committee of the Company’s Board of Directors.\nCORPORATE RESPONSIBILITY \nIntroduction\n WE HELP OUR CUSTOMERS CREATE A HEALTHIER AND SAFER WORLD by providing innovative healthcare and life science products and services around the globe. \nInspired by our Customers’ efforts to create a healthier and safer world, and guided by our legacy of leadership and innovation, we strive to be a Great Company. To STERIS, this means we will make a difference by providing world-class products and services for our Customers, safe and rewarding work for our People, and superior returns for our Shareholders. \nWe have an Enterprise Risk Management process (\"ERM\") to manage risk, which is led by our Chief Compliance Officer. Identifying and managing key risks to our business operations are essential to our future growth, profitability, and successful execution of strategic plans. We are committed to understanding and managing these risks through a consistent approach to risk assessment, monitoring, reporting, and mitigation. Key management sponsors are responsible for participating in the risk assessment process, including a periodic review with the Board of Directors. The objective of ERM is to identify key risks, the potential impacts of compliance failure, identify key mitigating activities, develop potential improvements for managing the risks, and to ensure execution of oversight activities on a monthly, annual or as needed basis. \n \n  Our Corporate Responsibility function is led by the Vice President of Environmental, Social, and Governance (\"ESG\"). The Corporate Responsibility function, with support from our CEO, General Counsel and other senior executives, works to actively develop and refine our ESG strategies, programs, and policies. The Corporate Responsibility function works closely with our Global Sustainability Steering Committee to build ESG values and implement strategies, programs, and policies across the Company. The Global Sustainability Steering Committee is a cross-functional team of senior leadership, subcommittee chairs, and subject matter experts spanning our businesses and Legal, Investor Relations, Human Resources, Continuous Improvement, Compliance, Facilities, and Health, Safety and Environment functions. The Corporate Responsibility team regularly updates the Nominating and Governance Committee of our Board of Directors regarding its activities, \nincluding evaluating carbon emissions, preparing for regulatory requirements, reporting ESG metrics, and reviewing ESG ratings.\nKey performance indicators and metrics have been established for those areas we believe to be relevant and potentially significant to our business. Certain of these disclosures relate to Sustainability Accounting Standards Board (\"SASB\") Standards for Medical Equipment & Supplies that we have identified to be closely aligned with our business. Our reporting against the SASB Standards is a voluntary disclosure aligned with our focus on financial materiality. We seek to provide investors with useful, relevant and meaningful sustainability information and have selected metrics under the SASB Standards. We describe below how we continuously monitor and track our policies and activities in the areas of ethical business practices, energy and environmental conservation, employees and human capital management, and quality. \nETHICAL BUSINESS PRACTICES\n \nCode of Business Conduct.\n \nOur Code of Business Conduct sets the standard for legal and ethical behavior, addressing topics such as bribery and corruption, supply chain transparency, proper behavior in the workplace, and avoiding conflicts of interest. \nAnti-Bribery and Anti-Corruption.\n \nWe are committed to conducting our business fairly, honorably, with integrity and in compliance with the law in all jurisdictions where we operate. Our policy prohibits bribery and corruption in any form, and we explain our commitment in our Statement on Anti-Corruption Policies and Procedures. As an ongoing due diligence measure, we have established a program to recognize those sales and marketing intermediaries who demonstrate an elevated commitment to compliance. Through this Commercial Compliance Program, we acknowledge organizations that have not only met STERIS's standard ethical requirements for inclusion in our network but have also taken additional steps, such as adopting their own code of conduct and training their employees on their own firm's ethical values, to ensure compliant behavior.\n In 2025, STERIS incurred no monetary losses as a result of legal proceedings associated with bribery or corruption.\n7\nTable of Contents\nSupplier Code of Conduct.\n Our expectations for ethical behavior extend beyond STERIS to our Suppliers as well.  Our Supplier Code of Conduct defines the minimum requirements and expectations for all Suppliers and their subcontractors. Suspicions of supplier non-compliance are promptly investigated and addressed. We believe in conducting business with integrity and honesty and in accordance with all applicable laws and regulations of the countries in which we operate. We expect our suppliers to comply with the laws of the countries in which they operate, including but not limited to the European Union Customs Code, the EU Restriction of Hazardous Substances Directive, the UK Modern Slavery Act, the US Foreign Corrupt Practices Act, the UK Bribery Act, the US Dodd-Frank Conflict Minerals Rules, applicable data privacy laws, and all applicable local labor and employment laws. \nConflict Minerals Sourcing Policy\n.\n We file reports with the SEC disclosing our use of tin, tantalum, tungsten, and gold (\"conflict minerals\" or \"3TG\") in products sold anywhere in the world.\n \nIn accordance with these legal requirements and as a part of the overall commitment to responsible sourcing, we are working with our suppliers to ensure transparency to the smelter/refining source for 3TG materials used in our products. Furthermore, we seek to identify the countries of origin of the 3TG in our products and the smelter/refiners that process the 3TG in our products. We undertake this effort to promote responsible sourcing. Because of our general downstream position in the supply chain, we rely on our suppliers for information. We expect suppliers to respond to our requests for complete transparency about the sources whose 3TG materials are used in our products and to conduct due diligence measures to ensure the information provided is accurate, up-to-date and complete. This Policy applies to all suppliers of products and materials to the Company and to all our affiliates. We will consider taking various progressive actions with respect to suppliers who do not make reasonable efforts to cooperate with our requests for information or requests to take corrective actions to enable us to identify smelters and refiners in our supply chains. \nRisks and Prevention\n.\n \nWe regularly assess the risks associated with our business, including the risk of potential corruption or bribery in the environments where we do business, and we have designed our management systems to respond accordingly. As part of our anti-corruption program, our employees and third-party intermediaries are subject to mandatory comprehensive anti-bribery and anti-corruption training online. The training covers the various forms that corruption can take, red flags, and individuals’ roles in our anti-bribery and anti-corruption efforts.\n \nIn accordance with our policy, we engage a third-party due diligence firm to perform background checks, including bribery and corruption, before entering into commercial relationships with sales and marketing intermediaries, and other service providers.\nWe communicate our bribery and corruption policies and expectations to our officers, Directors, employees, dealers, distributors and agents. It is the expectation of the Company that all of the aforementioned individuals comply with the requirements set forth in our policy and relevant rules and regulations. \nManaging Compliance and Ethics\n.\n \nWe require all employees to be lawful and ethically responsible in all business practices.  We expect all employees to comply with all Company policies, applicable laws, and the principles outlined in our Code of Business Conduct. \nSenior members of STERIS’s leadership team are involved in numerous industry associations that focus on setting the standards and driving change. We hold seats and actively participate on the boards of AdvaMed and the Medical Device Manufacturers Association (\"MDMA\"). We are also an active member of the Association for the Advancement of Medical Instrumentation (\"AAMI\") and MedTech Europe. AdvaMed has over 500 member companies and promotes policies that foster the highest ethical standards, timely patient access to safe and effective products, and economic policies that reward value creation. The AdvaMed Code of Ethics on Interactions with Health Care Professionals (\"AdvaMed Code\") facilitates ethical interactions between MedTech companies and health care professionals to ensure that medical decisions are based on the best interests of the patient. \nSTERIS has adopted and requires compliance with the AdvaMed Code.\nMDMA is the leading voice representing the interests of innovative and entrepreneurial medical technology companies. MDMA's goal is to provide patients and clinicians with timely access to safe and effective medical technologies that improve the quality of life. AAMI is a nonprofit organization founded in 1967. It is a diverse community of more than 11,000 healthcare technology professionals united by one important mission-supporting the healthcare community in the development, management, and use of safe and effective healthcare technology. MedTech Europe is the European trade association for the medical technology industry including diagnostics, medical devices and digital health. MedTech Europe’s purpose is to make innovative medical technology available to more people, while helping healthcare systems move towards a more sustainable path. The MedTech Europe Code of Ethical Business Practice regulates all aspects of the industry’s relationship with Healthcare Professionals and Healthcare Organizations, to ensure that all interactions are ethical and professional at all times and to maintain the trust of regulators and patients. STERIS has adopted and requires compliance with the MedTech Europe Code of Ethical Business Practice. \nUsing the STERIS Integrity Helpline or Webline, employees can anonymously report potential Code of Conduct concerns. A management Ethics Committee meets monthly to monitor and investigate reports of Code of Business Conduct violations and provides quarterly reporting to the Board of Directors' Compliance and Technology Committee. With respect to financial \n8\nTable of Contents\nmatters, reports are provided to the Board of Directors' Audit Committee. With respect to human resources related matters, reports are provided to the Board of Dir\nectors' Compensation and Organization Development Committee.\nThe STERIS Code of Business Conduct covers ethical marketing and off-label promotion. In fiscal 2025, STERIS incurred no monetary losses as a result of legal proceedings associated with false marketing claims.\nENERGY, GHG EMISSIONS AND ENVIRONMENTAL CONSERVATION \nWe are subject to various laws and governmental regulations concerning environmental matters and employee safety and health in Ireland, the United States and other countries. We have made, and continue to make, significant investments to comply with these laws and regulations. Our Continuous Improvement objectives include efforts to improve energy and water efficiency and reduce or eliminate certain chemicals used in, and wastes generated from, our operations thereby reducing the impact of our operations on the environment. \n \nSTERIS tracks greenhouse gas (\"GHG\") emissions, and we complete the annual Carbon Disclosure Project (\"CDP\") questionnaire. CDP is an internationally recognized nonprofit organization that collects and reports environmental metrics. Currently, we report our direct (Scope 1) and indirect (Scope 2) energy use and emissions. We recognize that a significant portion of our carbon impact is as a result of our value chain, outside of electricity and energy consumption at our global sites. We also report aggregate Scope 3 (upstream and downstream) emissions in our most recent CDP response and on our website. \nWe have a broad and comprehensive portfolio of sterilization and disinfection products that support the procedural spaces within hospitals, endoscopy and surgery centers as well as pharmaceutical and medical device Customers. When we think about new products or next generation products, part of our effort is to reduce the environmental impact of what we do.\n That can include anything from reformulating chemistries to eliminating metals-based ingredients or reducing the effluence produced as a result of the use of our products, to creating ultra-concentrate chemistries such as Prolystica® Ultra Concentrate Cleaning Chemistries, which offer 10 times the uses per container. \nThat means 5 and 10-liter containers of concentrate replace 114-liter drums, creating benefits from safer lifting, elimination of packaging waste, and less frequent deliveries with smaller trucks.  We also work to utilize containers that can be recycled and build products with materials that can be recycled at the end of their life.\n \nIn Fiscal 2023, the European Commission’s Corporate Sustainability Reporting Directive (\"CSRD\") became effective. The CSRD expands the number of companies required to publicly report ESG-related information and defines the ESG-related information that companies are required to report in accordance with European Sustainability Reporting Standards (\"ESRS\"). Although the European Parliament voted to postpone the application dates, STERIS continues to prepare for the upcoming CSRD disclosure requirement. We are making significant efforts in gathering baseline information, strengthening our internal controls, and evaluating our current ESG data.  As part of this project, we continue to evaluate our ability to report in accordance with the Task Force on Climate-Related Financial Disclosures (\"TCFD\") framework and in light of evolving regulatory disclosure requirements. We completed TCFD aligned climate scenario analysis in fiscal 2025. We are evaluating how this information will inform global reporting requirements. \nRisks and Prevention. \nWe actively monitor and take steps to manage the risks associated with environmental matters, none of which we consider material at this time. \nEMPLOYEES AND HUMAN CAPITAL MANAGEMENT\nStrategy and Overview. \nPeople are the key to our success, which is reflected in our two core values of people and teamwork.\n \nWe are committed to the safety and success of our people. We expect the performance of every person to continually improve with personal initiative and proper support. We expect our people to treat each other with mutual respect. Our ideal business team is engaged, diverse, inclusive and talented, and we create programs and policies in support of these goals.\nWe believe unity of purpose and teamwork enables us to do far more together than we could individually. We draw strength from each other and encourage communication with fairness, candor, respect and courage. Our collaboration turns interesting ideas into great products and services for our Customers.\nOur senior management team and Board receive regular updates on our people, including data and metrics on retention, engagement and safety which are used to determine our human resources priorities, programs and training.\nWe are committed to upholding human rights in all our operations globally and respect human rights as recognized by the principles of the United Nations Global Compact. We strongly oppose all forms of slavery, servitude, forced labor, child labor and human trafficking.\nEmployees by Segment.\n \nDuring the course of fiscal \n2025, we averaged approximately 18,000 employees throughout the world of which less than 11% are represented by work councils or labor unions. \nWe believe we generally have good relations with our \nemployees.\nThe average number of persons employed by STERIS plc and its subsidiaries during each of the following fiscal years was as follows:\n9\nTable of Contents\nFiscal 2025\nFiscal 2024\nHealthcare \n12,341 \n11,419 \nAST\n3,502 \n3,340 \nLife Sciences\n834 \n999 \nCorporate \n1,110 \n1,010 \nTotal employees \n(1)\n17,787 \n16,768 \n \n(1)\n Excludes Dental segment divested on May 31, 2024.\nWe strive to recruit the best available people who are aligned with and embody our core values. We are committed to equality and assessing candidates based on qualifications. We believe that our success is dependent on attracting and retaining people from a cross-section of our communities who understand their markets, and in doing so we continue to create a competitive advantage for STERIS.\nOur success depends on our ability to attract and retain talented employees, and we do so without regard to race, color, social or economic status, religion, national origin, marital status, age, veteran status, sexual orientation, gender identity, or any protected status. It is the policy of the Company to make all decisions regarding employment, including hiring, compensation, training, promotions, transfers, or lay-offs, based on the job requirements and skills of the individuals and utilizing the principle of equal employment opportunity without discrimination.\n We have\n \nbiennial\n training on anti-harassment, except where required annually.\nTotal directors and employees distribution by gender is shown in the table below:\nMarch 31, 2025\nMarch 31, 2024\nMale\nFemale\nMale\nFemale\nNon-Executive Directors \n6 \n3 \n6 \n3 \nSenior Managers\n718 \n289 \n742 \n291 \nOther employees of the Company\n11,282 \n5,730 \n11,009 \n5,575 \nDirectors and United States employees by race is shown in the table below:\nMarch 31, 2025\nMarch 31, 2024\nWhite\nMinority\n (1)\nWhite\nMinority\n (1)\nNon-Executive Directors\n67%\n33%\n67%\n33%\nSenior Managers\n86%\n14%\n87%\n13%\nOther employees of the Company\n60%\n40%\n61%\n39%\n(1)\n A minority person is defined as a person who identifies as American Indian/Alaskan Native, Asian, Black or African American, Hispanic or Latino, Native Hawaiian or Other Pacific Island, or two or more races.\nHealth, Safety & Environment.\n \nWe realize the importance of Health, Safety & Environment (\"HSE\") to the well-being of our Customers, employees, community, the environment, and ultimately our shareholders. To that end, our HSE teams and management are committed to supporting HSE programs with ongoing involvement through our continuous improvement process. Our ultimate goal is to be an incident-free company. The cornerstone of this initiative is the belief that incidents result from unsafe acts or conditions, both of which are preventable. We apply OSHA recordkeeping practices worldwide. Key metrics for purposes of benchmarking performance include \nTotal Recordable Incident Rate (\"TRIR\") and Lost-time Incident Rate (\"LTIR\") injury and illness incident rates, both of which are presented in the table below:\nSTERIS \nIndustry Benchmarks \n(2)\nFiscal 2025\nFiscal 2024\nAverage\nBest in Class\nTotal Recordable Incident Rate \n(1)\n1.11\n1.17\n2.50\n1.43\n Lost-time Incident Rate \n(1)\n0.38\n0.43\n1.25\n0.42\n(1\n) \n We apply OSHA recordkeeping practices worldwide. All rates are based on 100 full-time employees (\"FTE\") working one year. 100 FTEs equals 200,000 work hours.  TRIR includes work-related injuries or illnesses requiring medical attention beyond first-aid. LTIR includes work-related injuries or illnesses that cause an employee to be away from work at least one full day after the date of the incident.\n(2)\n Our external benchmarks include the OSHA average and 1st Quartile injury/illness rates which are derived from \n2022 Bureau of Labor Statistics data.\n10\nTable of Contents\nOur annual workplace injury prevention results are within the manufacturing sector's best-in-class performance as defined by the Bureau of Labor Statistics.\nWe have chosen to align our environmental management system with the ISO 14001 standard, which sets out the criteria that a company or organization can follow to establish an effective environmental management system. Designed for any type of organization, regardless of its activity or sector, it can provide assurance that environmental impact is being measured, controlled and improved in a holistic manner. We currently have three facilities that are 14001 and 45001 accredited locations. Our HSE teams and management are committed to supporting HSE programs with ongoing involvement in aligning HSE management systems to ISO 14001 and ISO 45001 standards, internal compliance reviews, and developing HSE training content and platforms.\nThe OSHA Voluntary Protection Program (\"VPP\") Star Award recognizes employers who have implemented effective safety and health management systems and maintain injury and illness rates below national Bureau of Labor Statistics averages for their industry. We currently have 13 locations that hold the OSHA VPP Star Award. \nWe utilize internal HSE management systems and compliance audits designed to identify percent compliance of our global operations against our standards. \nEmployee Engagement and Development. \nWe believe that engaged employees are more productive, innovative, and satisfied in their work. Examples of how we engage our employees include quarterly video updates, a robust intranet for communication with our global teams and various communications efforts within each department. In addition, our global human resources team has programs focused on career development and training for employees at all levels. \nOur employee turnover rate \nwas 16% and 15% for fiscal 2025 and 2024, r\nespectively, and we are continuously working towards a goal of achieving a rate of 10% or less, excluding retirements and reductions in force. Although reductions in force are sometimes necessary, we work to avoid them, and they must always be approved by executive management. We encourage all employees to participate in our regular engagement survey which is administered by a third party on a confidential basis. This process has been valuable in helping us recognize what we do well and foster an open conversation about how we can make STERIS an even better place to work. We are pleased to report that \n88% of our employees completed our pulse survey in fiscal 2025. \nThe pulse survey results are grouped around four key themes: Employee Engagement; Leadership Effectiveness; Inclusion and Belonging; and Job and Work Experience.\n \nThe results indicate strong favorability in each of these areas. Moreover, this initial pulse survey sets a baseline from which we can track progress over time.\n \n \nCompensation and Benefits. \nOur total rewards offerings include an array of programs to support our employees' financial, physical, and mental well-being, including providing competitive salaries, variable performance pay, healthcare benefits, tuition assistance, paid time off, annual merit increases, and incentive plans based on the national norms of employees' location of employment. Total employee compensation is presented in the table below:  \n \n(dollars in thousands)\nFiscal 2025\nFiscal 2024\nWages and salaries\n$\n1,273,381 \n$\n1,187,970 \nCommission and incentive plans\n210,498 \n199,859 \nSocial security costs\n111,032 \n98,310 \nShare-based compensation expense\n57,397 \n52,849 \nPension and post-retirement benefits expense\n43,631 \n38,492 \nOther, primarily employee benefits\n154,605 \n140,684 \nTotal employee costs\n$\n1,850,544 \n$\n1,718,164 \nQUALITY\nWe are subject to strict regulatory compliance and quality standards to ensure the safety and supply of our products and services. The quality and regulatory systems are broad in scope and designed to achieve quality from incoming materials through the design, development, manufacture, storage, handling and distribution of our products and delivery of services. To monitor compliance with these standards, internal and third-party assessments of our quality and regulatory systems are conducted. FDA conducts inspections of our manufacturing and contract sterilization facilities on a periodic basis to confirm compliance. In connection with an inspection, the FDA may initiate warning letters and/or consent decrees, which list conditions or practices that may indicate a violation of the FDA’s requirements.\n In fiscal 2025, STERIS did not receive any warning letters, seizures, or consent decrees. Additionally, STERIS had zero products listed in the FDA’s MedWatch Safety Alerts for Human Medical Products database.\nWe have in place processes to monitor and support compliance with product and service regulations worldwide, including design controls, product changes, labeling and advertising, marketing materials, good manufacturing practices, and adverse event reporting requirements. We take prompt action whenever we are alerted to regulatory or field-safety issues with a STERIS product. Following immediate assessment, we take corrective action, including voluntary product recalls, when \n11\nTable of Contents\nneeded. We examine underlying issues and root cause and work to resolve these to avoid recurrence.\n STERIS had no Class I recalls in fiscal 2025, 2024 or 2023.\n \nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\n \nThe following table presents certain information regarding our executive officers at March 31, 2025. All executive officers serve at the pleasure of the Board of Directors.\nName\nAge\nPosition\nKaren L. Burton\n57\nVice President and Chief Accounting Officer\nDaniel A. Carestio\n52\nPresident and CEO\nMary Clare Fraser\n54\nSenior Vice President and Chief Human Resources Officer\nKenneth E. Kohler\n62\nSenior Vice President and General Manager, AST\nJulia K. Madsen \n60\nSenior Vice President and General Manager, Life Sciences\nCary L. Majors\n50\nSenior Vice President and President, Healthcare\nRenato G. Tamaro\n56\nVice President and Corporate Treasurer\nMichael J. Tokich\n56\nSenior Vice President and Chief Financial Officer\nJ. Adam Zangerle\n58\nSenior Vice President, General Counsel, and Company Secretary\nThe following discussion provides a summary of each executive officer's recent business experience through March 31, 2025:\nKaren L. Burton \nserves as Vice President and Chief Accounting Officer. She assumed this role in January 2017. Previously, Ms. Burton also served as Controller from January 2017 until December 2023.\nDaniel A. Carestio\n serves as President and CEO. He assumed this role in July 2021. From August 2018 to July 2021, he served as Senior Vice President and Chief Operating Officer. From February 2018 to August 2018, he served as Senior Vice President, Sterilization and Disinfection. From August 2015 to February 2018, he served as Senior Vice President, STERIS AST and Life Sciences. \nMary Clare Fraser \nserves as Senior Vice President and Chief Human Resources Officer. She assumed this role in May 2022.\n \nShe joined STERIS in July 2020 as the Vice President and Chief Human Resources Officer. From February 2003 to July 2020, she held various positions with Parker-Hannifin Corporation, a global motion control technologies company, serving most recently from September 2019 to July 2020, as Vice President Human Resources of its Aerospace Group and from March 2017 to September 2019 as its Corporate Director of Human Resources.\nKenneth E. Kohler\n serves as Senior Vice President and General Manager, AST.\n \nHe assumed this role in February 2024. Previously, Mr. Kohler served from November 2015 to February 2024 as Vice President and General Manager of AST Americas.\nJulia K. Madsen \nserves as Senior Vice President and General Manager, Life Sciences. She assumed this role in July 2020. From August 2015 to July 2020, she served as Vice President and General Manager Life Sciences, Consumables.\nCary L. Majors \nserves as Senior Vice President and President, Healthcare.\n \nHe assumed this role in August 2022.\n \nFrom August 2019 to August 2022, he served as Senior Vice President, Americas Commercial Operations. From April 2014 to August 2019 he\n \nserved as Vice President, North America Commercial Operations.\nRenato G. Tamaro\n serves as Vice President and Corporate Treasurer. He assumed this role in August 2017. From March 2006 to July 2017, he served as Assistant Treasurer.  \nMichael J. Tokich\n serves as Senior Vice President and Chief Financial Officer. He assumed this role in August 2017. From February 2014 to July 2017, he served as Senior Vice President, Chief Financial Officer and Treasurer. \nJ. Adam Zangerle\n serves as Senior Vice President, General Counsel, and Company Secretary. He assumed this role in July 2018. From July 2013 to July 2018, he served as Vice President, General Counsel, and Secretary. \n12\nTable of Contents",
  "item7": "Item 7\n \nManagement's Discussion and Analysis of Financial Condition and Results of Operation\n29\n \nIntroduction\n29\n \nFinancial Measures\n29\n \nRevenues-Defined\n30\n \nGeneral Overview and Executive Summary\n30\nNon-GAAP Financial Measures\n32\n \nResults of Operations\n32\n \nLiquidity and Capital Resources\n37\n \nCapital Expenditures\n41\n \nMaterial Future Cash Obligations and Commercial Commitments\n41\n \nSupplemental Guarantor Financial Information\n42\nCritical Accounting Estimates and Assumptions\n43\n \nForward-Looking Statements\n48",
  "item2": null
}