{
  "source_file": "stld-20241231x10k.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.       BUSINESS\n \n​\n​\n​\nSteel Dynamics, Inc. is one of the largest domestic steel producers and metal recyclers in the United States, based on estimated steelmaking and steel coating capacity of approximately 16 million tons and actual metals recycling volumes as of December 31, 2024, with one of the most diversified product and end market portfolios in the domestic steel industry, combined with meaningful downstream steel fabrication operations. The company is currently investing in its aluminum operations to further diversify its end markets with plans to supply aluminum flat rolled products with high recycled content to the countercyclical sustainable beverage can industry, in addition to the automotive and industrial sectors. Primary sources of revenue are currently from the manufacture and sale of steel products, the processing and sale of recycled ferrous and nonferrous metals, and the fabrication and sale of steel joists and deck products.\nWe refer to our founding principles as our six core strategic pillars. They bring us together with a common focus, and they provide the foundation upon which we operate and grow. Our unique entrepreneurial culture and business model benefit us operationally, financially, and through the responsible use of our resources in diverse economic environments. Innovation in all forms is essential to our success, and our teams focus on how to do things “smarter” within our current operations, as well as how we continue to grow. This means creating solutions for our teammates, customers, suppliers, and other stakeholders. It also includes finding ways to “do business” with fewer resources and less environmental impact.  Our six strategic pillars and the team’s execution of them each day has driven our success and sustainability.\n​\n●\nHealth & Safety – \nSafety is our primary focus and core value. Nothing surpasses the importance of creating and maintaining a safe work environment.  Our goal is zero injuries—no accidents.    \n●\nEntrepreneurial Culture –\n Fosters a team of energetic, positive, driven, innovative and diverse individuals by utilizing open communication and meaningful performance-based compensation aligned to our strategic focus.\n●\nCustomer Commitment – \nWe focus on being a preferred partner of our customers by providing quality products and unique supply chain solutions to meet their current and future needs. \n●\nStrategic Sustainable Growth – \nWe focus on strategic growth with intentional margin expansion and consistency through-the-cycle. \n●\nInnovation – \nThrough individual creativity and ingenuity, our teams drive innovation to improve safety, quality, productivity, and resource sustainability. We strive to provide unique, superior products, customer supply chain solutions, and next-generation technologies and processes.\n●\nFinancial Strength –\n Through our adaptable value-added product diversification, vertically connected businesses model, coupled with our highly variable operating cost structure and performance-based incentive compensation, along with our continued operating innovations and efficiency, we achieve higher utilization and lower costs, which provide strong cash flow generation through both strong and weak market cycles.  \nDifferentiated Model - Uniquely Steel Dynamics\nCompetitively advantaged differentiation in everything we do is core to our long-term value creation strategy. We distinguish ourselves in every aspect of our business through an overarching spirit of excellence.  \n​\n3\n\n\nTable of Contents\nUnique Entrepreneurial Culture\nOur entrepreneurial culture is the foundation of our success and is driven by our extensive, performance-based incentive compensation philosophy for those on the plant floor to our senior leadership team. Over 60% of a production team member’s total potential compensation is “at risk” to both quality production and cost-effectiveness metrics. Over 85% of our senior leadership team’s total potential compensation is “at risk” to companywide financial performance metrics that encourage long-term value creation, including return on equity, growth, cash generation, and return on invested capital measures. We believe diversity within our teams enhances broad-based thinking, innovation, and value creation. Our common goal of consistently achieving excellence in all we do is reflected in the esprit de corps that permeates our team.\n​\nDiversified, Value-Added Product Offerings and Supply-Chain Solutions \nWe have one of the most diversified, high-margin product offerings within the domestic steel industry. We have a track record of profitable growth, driving diversification in both end markets and value-added product offerings to sustain higher volume and profitability through varying market environments. Over 70% of our steel and steel fabrication sales are considered value-added.  Throughout our history and today, we seek to provide unique supply-chain alternatives for our customers to increase efficiency, reduce time and costs, and promote decarbonization opportunities.  Growing with our customers in this manner has proven to be invaluable in creating long-lasting relationships and product development.\n​\nThe majority of our steelmaking operations are in locations near sustainable sources of scrap metals and near our customer base, allowing us to realize freight savings for inbound scrap as well as for outbound steel products destined for our customers. This also allows us to provide consistent on-time delivery to our customer base with relatively short lead times, further solidifying our customer relationships.  \n​\nThis diversified portfolio of products enables us to access a broad range of markets, serve a large customer base, and helps mitigate our market exposure to any one product or sector, resulting in increased through-cycle steel mill utilization. In addition, our value-added product offerings help to balance our exposure to commodity grade products supplied by other manufacturers. We will continue to seek additional opportunities, such as entering the recycled aluminum flat rolled products market, and collaborating with our customers to anticipate their future needs by further expanding our range of products and offerings. In 2024, we began operations on our four new value-added flat roll steel coating lines comprised of an additional paint line and galvanizing line located onsite at our Southwest-Sinton Flat Roll Division and a paint line and galvanizing line at our Heartland Flat Roll Division. As with all our growth initiatives, we seek to competitively differentiate ourselves through service, product capability and quality, and supply-chain solutions. \nVertically Connected Businesses and Pull-Through Volume Advantage\nOur vertically connected businesses contribute to our higher through-cycle steel production and overall profitability. Our internal manufacturing businesses are a significant competitive advantage supporting higher and more stable through-cycle earnings and cash flow generation. Our steel fabrication operations and downstream processing locations use a significant amount of steel in their operations. During weaker steel demand environments, we can source their steel needs internally, and during strong steel demand environments, we have the option to also purchase their steel needs externally. Ultimately, we optimize our companywide profitability and minimize earnings volatility. In 2024, our own steel consuming businesses purchased 1.7 million tons of steel from our steel mills, representing 14% of our total 2024 steel shipments.\nA strategic and synergistic relationship also exists between our electric arc furnace (EAF) steel mills and metals recycling operations. Our metals recycling platform is the largest supplier of recycled ferrous scrap to our steel operations and is expected to be the largest supplier of recycled aluminum scrap to our aluminum operations. This allows us to reduce companywide working capital, as lower scrap inventory volume is required at our steel mills. We are also able to source higher-quality scrap for our steel mills, increasing availability, optimizing costs, and improving quality. \n​\n4\n\n\nTable of Contents\nTechnologically Advanced, Low-Cost, Highly Efficient Operations\nWe operate some of the most technologically advanced and environmentally responsible steel mills in the world. Our steel mills generate a fraction of the greenhouse gas (GHG) emissions per ton of steel produced as compared to traditional blast furnace steel production and the average global steel industry. Our value-added product diversification, circular manufacturing model, and performance-based incentive compensation programs support our efficient, environmentally responsible, and competitively advantaged footprint. Coupled with our low, highly variable cost structure and our continued operating innovation and efficiency, we are one of the most profitable and lowest-cost domestic steel producers.\nTransformational Growth  / New Recycled Aluminum Flat Rolled Strategic Investments\nWe are nearing the completion of our lower-carbon-emitting, recycled aluminum flat rolled products mill. Our investment includes a 650,000-metric ton recycled aluminum flat rolled products mill in Columbus, Mississippi, and two supporting satellite recycled aluminum slab centers. We are bringing our culture and related operating efficiencies to the flat rolled aluminum industry. This investment will allow us to broaden our ability to serve our existing customers as well as new customers by adding high-quality, lower-carbon flat rolled aluminum to our product portfolio. A significant number of our existing carbon flat rolled steel customers also consume, or process aluminum flat rolled products for automotive, appliance, construction, and other applications. We are developing our property to allow customers to locate on-site, with one customer already committed to co-locating and others expected to co-locate at the rolling mill site in Columbus, enhancing cost efficiencies and reducing emissions across the supply chain. The product mix from the flat rolled products mill is expected to be approximately 45% sustainable beverage packaging, 35% automotive, and 20% common alloy and industrial use. The state-of-the-art recycled aluminum flat rolled products mill will utilize a significant amount of aluminum scrap, and as such is also a complementary extension of the company’s metals recycling platform. The product offering will be supported by various value-added finishing lines, including two CASH (continuous annealing solutions heat treating) lines, a coating line, and downstream processing and packaging lines. We plan to begin shipments mid-year 2025. Our unique performance-based operating culture, coupled with our experience in successfully constructing and operating cost-effective, highly profitable flat roll steel mills and coating lines, positions us exceptionally well to execute this significant strategic investment.\n​\nSustainability \nOur commitment to all aspects of sustainability is embedded in our founding principles – valuing our people, our partners, our communities, and our environment. These strategic principles drive long-term value creation for all of us. We are committed to operating our business in an environmentally responsible manner and have been since our founding. Our steel mills exclusively use EAF technology, which uses recycled ferrous scrap as the primary raw material, producing lower-carbon emission quality steel products for our customers and driving returns for our shareholders. Our sustainability and decarbonization strategy is an ongoing journey, and we plan to use our entrepreneurial, innovative spirit to continue to be a leader in the industry.\nWe intentionally developed a circular manufacturing model.  Our metals recycling platform collects and processes scrap, which is then sold to end users for reuse, including our EAF steel mills and our aluminum operations. Our products are then sold to consumers that both further process and manufacture end products.  We sell a meaningful amount of steel to our own manufacturing businesses that in turn sell finished products to consumers.  Scrap, from the industrial manufacturing process, and from when these products ultimately reach the end of their lives, can be collected and used again in our steel and aluminum operations, creating our circular manufacturing model.\nWhile we believe we operate some of the most efficient steel operations in the world, we recognize the need for continuous improvement. In 2023, we began construction of a biocarbon production facility located in Columbus, Mississippi. The facility will use high-temperature pyrolysis to convert sustainably sourced biomass to high-purity biocarbon. We will use this biocarbon as a renewable replacement for anthracite in our steelmaking operations, which could result in as much as a 35% reduction in our steel mills’ Scope 1 GHG absolute emissions. The facility is projected to begin operations in the first half of 2025. This investment represents a significant step toward the decarbonization of our steel mills. \n5\n\n\nTable of Contents\nExperienced Leadership Team / Fosters an Entrepreneurial Culture\nOur senior leadership team is highly experienced and has a proven track record in the steel, metals recycling, and steel fabrication industries, as well as in the construction and start-up of new operations, such as our recycled aluminum flat rolled products mill. Our leadership objectives are closely aligned with our shareholders through meaningful stock ownership positions and performance-based incentive compensation programs that are correlated to the company’s profitability and operational performance in relationship to our steel manufacturing peers. We emphasize decentralized operational decision making and responsibility, while continuing to maintain appropriate corporate governance and risk oversight. We reward teamwork, innovation, and operating efficiency, and focus on maintaining the effectiveness of our performance-driven incentive bonus plans that are designed to maximize overall productivity and align the interests of our leadership and teams with our shareholders.\n​\n​\n​\n​\n​\nName\n​\nAge\n​\nPosition\nMark D. Millett\n​\n65\n​\nCo-founder, Chairman, and Chief Executive Officer\nTheresa E. Wagler\n​\n54\n​\nExecutive Vice President, Chief Financial Officer, and Corporate Secretary\nBarry T. Schneider\n​\n56\n​\nPresident and Chief Operating Officer\nMiguel Alvarez \n​\n57\n​\nSenior Vice President, Metals Recycling\nJames S. Anderson\n​\n64\n​\nSenior Vice President, Long Products Steel Group\nChris A. Graham\n​\n60\n​\nSenior Vice President, Flat Roll Steel Group\nRichard A. Poinsatte\n​\n58\n​\nSenior Vice President and Treasurer\nGlenn A. Pushis\n​\n59\n​\nSenior Vice President, Special Projects\nChad Bickford\n​\n45\n​\nVice President, Steel Fabrication\n​\nMark D. Millett\n co-founded the Company in 1993. Mr. Millett has been our Board Chair since May 2021 and has been our Chief Executive Officer since January 2012.  Prior to that, he has held various positions within the Company, including President and Chief Operating Officer, Executive Vice President of Metals Recycling and Ferrous Resources, and Executive Vice President of Flat Roll Operations. \nMr. Millett was responsible for the design, construction, and start-up operation of all of our steel mills, including our Butler, Indiana flat roll, melting, and casting operations. Mr. Millett earned his bachelor’s degree in metallurgy from the University of Surrey, England.  Mr. Millett is a Past Chairman of the Steel Manufacturers Association (SMA). In 2019, Mr. Millett was named the recipient of the James F. Collins Achievement in Advocacy Award by the SMA. In 2014 and 2022, Mr. Millet was named Steelmaker of the Year by the Association for Iron & Steel Technology. In 2024, Mr. Millett received the Willy Korf / Ken Iverson Steel Vision Award for his significant contributions to the steel industry while promoting goodwill and integrity. \nTheresa E. Wagler\n has been our Executive Vice President, Chief Financial Officer, and Corporate Secretary since May 2007. Ms. \nWagler joined the Steel Dynamics corporate finance team in 1998, and has held various finance and accounting positions, including Chief Accounting Officer and Vice President and Corporate Controller. She is responsible for and oversees accounting and taxation, treasury, risk management, legal, information technology and cybersecurity, human resources, decarbonization strategy, and strategic business development functions, as well as, financial planning and analysis, investor relations, and corporate communications. Ms. Wagler also has various operational responsibilities directly overseeing several joint ventures.  Prior to joining Steel Dynamics, Ms. Wagler was a certified public accountant with Ernst & Young LLP. She graduated cum laude from Taylor University with a bachelor’s degree in accounting and systems analysis. In addition, Ms. Wagler serves as a Director, Chair of the Audit Committee, and a member of the environmental sustainability and community committee of CF Industries Holdings, Inc., a public company, and also serves as a trustee for Trine University and a Director for the Metals Service Center Institute.\nBarry T. Schneider\n has been our President and Chief Operating Officer since March 2023. Mr. Schneider is responsible for the company’s steel platform, steel fabrication platform, and metals recycling platform. Before that, Mr. Schneider served as our Senior Vice President, Flat Roll Steel Group, between March 2016 and February 2023, responsible for the company’s entire flat roll steel operations, including the company’s three flat roll steel mills and numerous flat rolled processing, coating, and distribution operations. Before that, Mr. Schneider served in various \n6\n\n\nTable of Contents\noperational and leadership roles within the company’s steel operations, including our Engineered Bar Products Division and Butler Flat Roll Division.  He was also a part of the team that constructed the company’s first steel mill in Butler, Indiana in 1994. Mr. Schneider earned a bachelor's degree in mechanical engineering and a master of science in engineering management from Rose-Hulman Institute of Technology. He also received an executive certificate in Technology, Operations, and Value Chain Management from the MIT Sloan School of Management. In addition, Mr. Schneider served as a Past President for the Association for Iron & Steel Technology. \nMiguel Alvarez \nhas been our Senior Vice President, Metals Recycling since March 2022. Mr. Alvarez is responsible for OmniSource’s ferrous and nonferrous metals recycling operations, including marketing, trading and logistics activities. Prior to that, Mr. Alvarez served as Senior Vice President, Southwest United States and Mexico and was responsible for the comprehensive business development and partnerships in the regions, encompassing both steel and recycled metals. Prior to joining Steel Dynamics, Mr. Alvarez served in leadership positions at BlueScope; this included leading BlueScope’s North American metal buildings business with manufacturing facilities in the United States and Mexico, and being responsible for BlueScope’s only North American electric arc furnace flat roll steel mill as President of North Star BlueScope Steel. Mr. Alvarez earned a bachelor’s degree in industrial engineering and an MBA from Tecnológico de Monterrey, México. \nJames S. Anderson\n has been our Senior Vice President, Long Products Steel Group since May 2024. Mr. Anderson is responsible for the company’s four long product steel mills, along with a downstream finishing operation and the company’s copper rod manufacturing facility. Prior to that, Mr. Anderson served as our Senior Vice President, Steel Fabrication and was responsible for the company’s steel fabrication operations, comprised of seven steel joist and deck manufacturing facilities located throughout the U.S. and Mexico. Before that, Mr. Anderson held numerous operational and leadership roles including Vice President, Steel Fabrication, Chief Operating Officer of New Millennium Building Systems, and general manager of The Techs three flat roll steel galvanizing lines. Mr. Anderson earned a bachelor's degree in metallurgical engineering from Grove City College and an MBA from the University of Pittsburgh.\nChristopher A. Graham\n has been our Senior Vice President, Flat Roll Steel Group since October 2023. Mr. Graham is responsible for the company’s entire flat roll steel operations, including three flat roll steel mills and numerous flat roll steel processing, coating, and distribution operations. Before that, Mr. Graham served as our Senior Vice President, Long Products Steel Group. In this role, Mr. Graham was responsible for the company’s four long product steel mills, along with a downstream finishing operation and the company’s copper rod manufacturing facility. Prior to that, Mr. Graham served as Senior Vice President, Downstream Manufacturing and President of New Millennium Building Systems, responsible for the company’s steel fabrication and downstream manufacturing operations, and other operational and leadership roles. Mr. Graham was also a part of the team that constructed the company’s first steel mill in Butler, Indiana in 1994. Mr. Graham earned a bachelor's degree in business management from Western Governors University and an MBA from the University of Saint Francis. In addition, Mr. Graham completed the Harvard Advanced Management Program in 2017. \nRichard A. Poinsatte \nhas been our Senior Vice President and Treasurer since October 2023. Mr. Poinsatte is responsible for the areas of treasury, legal, business development, and risk. Mr. Poinsatte joined Steel Dynamics in 2000, as the Chief Financial Officer of one of the company’s joint venture businesses, which is now part of the steel fabrication platform. During his time with Steel Dynamics, he has held positions of increasing responsibility, including the operating position of General Manager of the company’s Florida steel fabrication plant. Since 2008, he has served as Vice President and Treasurer and has been responsible for the company’s treasury, risk,\n \nand legal applications. Mr. Poinsatte earned a bachelor of business administration with a concentration in accounting from the University of Notre Dame, and he is a certified public accountant. In addition, Mr. Poinsatte serves as the Chairman of the Board of Trustees for the University of Saint Francis. \nGlenn A. Pushis \nhas been our Senior Vice President, Special Projects, since February 2019. Mr. Pushis is responsible for the successful design and construction of the company’s new 650,000-metric ton state-of-the-art lower-carbon, recycled aluminum flat rolled products mill in Columbus, Mississippi with two satellite recycled aluminum slab centers in the Southwestern United States and San Luis Potosi, Mexico. From 2019 until 2022, Mr. Pushis was responsible for the successful design and construction of the Company’s new Southwest-Sinton Flat Roll Division, developed to serve the Southwestern United States and Mexico. He has extensive experience in this capacity and has \n7\n\n\nTable of Contents\nbeen instrumental in numerous construction projects for Steel Dynamics since its founding. Prior to that, Mr. Pushis served as Senior Vice President, Long Products Steel Group, responsible for the company’s four long product steel mills. Mr. Pushis has been with Steel Dynamics since 1994, holding various operational and leadership roles, including roles within the Engineered Bar Products Division and the Butler Flat Roll Division. He was also a part of the team that constructed the company’s first steel mill in Butler, Indiana, in 1994. Mr. Pushis earned a bachelor’s degree in mechanical engineering from Purdue University and his MBA from Indiana University. In addition, Mr. Pushis served as a Past President of the Association for Iron & Steel Technology Foundation.\n​\nChad Bickford\n was appointed Vice President, Steel Fabrication in May 2024. Mr. Bickford is responsible for the company’s steel fabrication operations, New Millennium Building Systems, comprised of seven steel joist and deck manufacturing facilities located throughout the United States and Mexico. Prior to that, Mr. Bickford served as General Manager for the company’s Butler Flat Roll Division. Mr. Bickford has been with Steel Dynamics since 2003, holding various operational and leadership roles with increasing responsibility in both steel and steel fabrication operations, including General Manager for the company’s Engineered Bar Products Division and General Manager of the Virginia steel fabrication facility. Mr. Bickford earned a bachelor’s degree in civil engineering from Ohio University. \n​\nHuman Capital / Valuing People\nWe value the dedicated people whose passion, innovation, and spirit of excellence have helped successfully grow our company and serve our customers. We have a culture of trust, fostered through individual empowerment and accountability that drives decision-making throughout our business. We empower our teams with performance goals, align their interests with the company’s long-term strategy, provide them with the right tools and resources, and watch them succeed. Our performance-based incentive compensation programs align with the interests of our strategic long-term growth, our customers, communities, and shareholders. We know our teams will do what is right and that trust comes from effective communication and transparency. The Steel Dynamics team consisted of approximately 13,000 full-time team members at December 31, 2024.\n​\nHealth and Safety\nValuing people includes providing a healthy and safe work environment, and creating a culture of safety that extends beyond the workplace, into our homes and communities. Safety is, and always will be, our primary focus and core value. We intend for each individual to arrive at the workplace safely and return home safely each day. This is achievable when we all work together. It requires commitment from leadership and team members at every level to take ownership and responsibility for their safety and the safety of others. Under no circumstance does the desire to maximize production or earnings override the value of individual safety. \n​\nSafety is our first core strategic pillar — it is the foundation of our decision making. Safety is always at the forefront and is discussed regularly across the company, whether led by a team member from the plant floor, a supervisor, or a manager. Leadership is engaged and continuously evaluates where we can improve. We believe having every individual engaged in safety will lead to zero injuries.  We are committed to achieving world-class safety performance throughout our operations. This commitment is foundational and integral to our culture. \n​\n​\n8\n\n\nTable of Contents\nOur total recordable injury rate compared to industry benchmarks and lost time injury rates for 2024 are as follows:\n​\n​\n​\n​\n​\n1\n Total Recordable Injury Rate is defined as OSHA recordable incidents x 200,000 / hours worked. Lost Time Injury Rate is defined as OSHA days away from work cases x 200,000 / hours worked. \n2\n Source: 2023 U.S. DOL Bureau of Labor Statistics released in 2024\n​\nCompensation Structure\nWe believe in empowering our teams and rewarding them for their achievements through a four-tiered, performance-based compensation framework.  The various components of our compensation programs promote a balance of high-return growth, effective capital investment, low-cost operations, and risk mitigation.  By rewarding our teams based on their performance as an individual, as a team, as a company, and based on shareholder interests, we believe we have the ultimate alignment with our external constituents. \n9\n\n\nTable of Contents\nThis is achieved through the following methods:\n​\n●\nIndividual performance awards consist of an individual’s base compensation, which is determined by their individual superior performance, responsibilities, and skill level. \n​\n●\nTeam performance awards, such as quality production, return on assets, and conversion bonuses, are based on departmental results, focusing on productivity, cost control, and efficient use of assets. \n​\n●\nCompanywide performance awards unite everyone through our profit-sharing program, which is based on consolidated pretax profitability, and our 401(k) match, which is based on consolidated return on assets.\n​\n●\nAlignment with our shareholders and the pursuit of long-term value creation is fostered through the issuance of restricted stock units. Each full-time, non-union, United States-based team member receives annual equity awards. These awards generally have a two-year vesting period, supporting retention and companywide strategy alignment.\n​\nOur team-based culture and competitive pay structure support continued high retention. In 2024, our companywide team retention was approximately 79%, with U.S.-based teams retention of 89%. Our compensation framework helps ensure that we remain strong with best-in-class performance and retain top talent even in economic downturns.  We all share in the company’s successes, as well as the challenges.\n​\nTalent Development and Educational Opportunities\nOur people represent the foundation of our six strategic pillars. \nTheir continued education and talent development are paramount to our success.  Our educational assistance and development programs encourage personal growth so individuals can remain current in their areas of responsibility, as well as develop new skills for advancement.  Senior leadership plays a key role in our development programs, linking our culture to critical, proven leadership concepts.  As we continue to grow, building talent, retaining team members with relevant industry and technical experience, and creating opportunities within our teams are some of our most important tasks and are critical to our long-term success. \nWorkplace Philosophy\nOur people are the foundation of our success and are our most important resource. Our culture safeguards all people and requires each person to be treated fairly and with dignity. We have equal employment opportunity, and all job-related considerations are based on merit and ability. We do not tolerate harassment or disrespect of any kind. We respect human rights, which includes providing safe work environments for our people, providing fair compensation based on job responsibilities and performance, and ensuring all team members meet minimum age requirements and eligible working status to qualify for employment. Our leadership receives recurring training on these critical topics. \n​\nWe recognize the value of having a business that reflects a variety of backgrounds and experiences. We work together as a unified team and respect each other as individuals. Our team-based compensation structure reinforces this philosophy. We strive to create a welcoming and open environment, ensuring the best ideas are heard and valued regardless of the position or the individual. We believe these ideals will continue to drive our success. Our team member population is representative of our industry and the communities where we live and work. \n​\nSegments\nIn the fourth quarter 2024, results from an entity previously reported within the metals recycling operations were moved to the aluminum operations segment, consistent with how the company’s chief operating decision maker currently manages the business. Segment information provided within this Form 10-K has been recast for all prior periods presented, consistent with the current reportable segment presentation. Refer to Notes 1 and 12 in the notes to consolidated financial statements in Part II, Item 8 of this Form 10-K for additional segment information.\n​\n10\n\n\nTable of Contents\nSteel Operations Segment\n​\nSteel operations consist of our EAF steel mills, producing steel from ferrous scrap and scrap substitutes, utilizing continuous casting and automated rolling mills, and numerous steel coating, processing lines and warehouse operations. Our steel operations sell directly to end-users, steel processors, steel fabricators, and service centers. These products are used in numerous industry sectors, including the construction, automotive, manufacturing, transportation, heavy and agriculture equipment, energy, and pipe and tube (including OCTG) markets. Our steel operations accounted for 69%, 67%, and 65% of our consolidated net sales during 2024, 2023, and 2022, respectively. We are predominantly a domestic steel company. Export sales represented 6%, 8%, and 5% of our steel segment net sales during 2024, 2023, and 2022, respectively.\nOur steel operations consist primarily of steelmaking and numerous coating operations. In 2024, we had approximately 9.4 million tons of flat roll steel annual production capacity. We have an additional 2.0 million tons of flat roll steel processing capacity through The Techs and our Heartland Flat Roll Division, as well as distribution of metallic coated and pre-painted products through United Steel Supply (USS). We have annual flat roll galvanizing capability of 5.5 million tons and painting capability of 2.0 million tons. We also have approximately 4.6 million tons of long product steel capacity at our long products divisions.\nCapacities represent maximum estimated manufacturing capabilities based on steel mill configuration and related team member support. These capacities do not represent expected volumes in a given year. In addition, estimates of steel mill capacity are highly dependent on the specific product mix manufactured. Each of our steel mills can and do roll many different types and sizes of products; therefore, our capacity estimates assume a typical product mix.\n​\n11\n\n\nTable of Contents\nThe following chart summarizes our steel operations primary products and the estimated percentage of tons sold by end market:\n12\n\n\nTable of Contents\nSHEET STEEL PRODUCTS\nOur sheet steel products, consisting of hot rolled, cold rolled and coated steel products are currently produced by our Butler, Columbus, and Sinton Flat Roll Divisions, and our numerous downstream coating lines, including The Techs, Heartland Flat Roll Division, and USS (Steel Processing divisions). Our sheet steel operations represented 72%, 68%, and 77% of steel operations net sales in 2024, 2023, and 2022, respectively. We produced 9.5 million tons of sheet steel at these facilities in 2024, 9.2 million tons in 2023, and 8.3 million tons in 2022.\nWe shipped the following sheet steel products volumes at the following facilities (net tons):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024\n​\n2023\n​\n2022\n​\n​\n​\nButler, Columbus, and Sinton\n7,702,731\n​\n7,459,023\n​\n6,772,162\n​\n​\n​\nFlat Roll divisions\n​\n​\n​\n​\n​\n​\n​\n​\nSteel Processing divisions\n1,779,429\n​\n1,731,911\n​\n1,673,967\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThe following chart summarizes the types of sheet steel products sold by sales dollars, during the respective years, with cold rolled and coated products representing value-added products: \n​\nCustomers. \nSteel processors and service centers typically act as intermediaries between primary sheet steel producers and the many end-user manufacturers that require further processing of hot roll coils. The additional processing performed by the intermediate steel processors and service centers include pickling, galvanizing, cutting to length, slitting to size, leveling, blanking, shape correcting, edge rolling, shearing, and stamping. We believe that our intermediate steel processor and service center customers will remain an integral part of our customer base. The Columbus and Sinton Flat Roll Divisions allow us to capitalize on the industrial markets in the Southern United States and Mexico, as well as further expand our customer base in painted, line pipe, and other pipe products. Galvanized flat rolled products produced by our Butler, Columbus, and Sinton Flat Roll Divisions are similar and are sold to a similar customer base. The Techs and Heartland Flat Roll Division specialize in the galvanizing of specific types of flat roll steels in primarily non-automotive applications, servicing a variety of customers in the heating, ventilation and air conditioning (HVAC), construction, agriculture, and consumer goods markets. USS adds a complementary distribution channel for metallic coated and pre-painted flat roll steel coils to the roll-former market, serving the roofing and siding industry. This connects us to an industry sector with customers that have not historically purchased steel directly from a steel producer. Our sheet steel operations also provide a substantial portion (64% in 2024) of the sheet steel utilized in our steel fabrication operations.\n13\n\n\nTable of Contents\nThe following chart summarizes the types of end customers who purchased our sheet steel products, by sales dollars, during the respective years: \n​\n​\nLONG PRODUCTS\nOur long steel products consist of a wide array of differentiating products produced by our four mills and Vulcan Threaded Products, Inc. (Vulcan), a downstream finishing operation. \nStructural and Rail Division \nproduces a variety of parallel flange beams and channel sections, as well as large unequal leg angles, and reinforcing steel bar including custom cut-to-length, smooth bar, and coiled. We also produce standard strength carbon, intermediate alloy hardness, and premium grade rails in 40 to 320 feet length for the railroad industry. Our state-of-the art heat treating system allows us to produce high quality premium rail, which has been certified by all Class I railroads. In addition, our rail-welding facility has the ability to weld (Continuous Welded Rail) in lengths up to 1,650 feet, which offers substantial savings to the railroads both in terms of initial capital cost and through reduced maintenance. We also utilize our Structural and Rail Division’s excess capacity to supply our Engineered Bar Products Division with pull-through volume of billets to utilize its excess rolling capacity.\nEngineered Bar Products Division\n produces a broad range of engineered special-bar-quality (SBQ), merchant-bar-quality (MBQ), and other engineered round steel bars.  We also have a bar finishing facility, which provides various downstream finishing operations for SBQ steel bars, including turning, polishing, straightening, chamfering, precision saw-cutting, and heat-treating capabilities. Vulcan produces threaded rod products, and cold drawn and heat-treated bar, creating strategic pull-through demand of our Engineered Bar Products Division’s special-bar-quality products.\nRoanoke Bar Division\n produces merchant products, including channels, angles, flats, merchant rounds, and reinforcing steel bars. Excess steel billet production is sold to mills without sufficient melting capacities, including our Steel of West Virginia facility. Our steel fabrication operations also purchase angles from our Roanoke Bar Division.\nSteel of West Virginia\n produces a wide array of specialty shapes and light structural steel and frequently performs fabrication and finishing operations on those products, such as cutting to length, additional straightening, hole punching, shot blasting, plasma cutting, welding, galvanizing, and coating. Through this array of products and additional finishing, we create custom finished products that are generally placed directly into our customers’ assembly operations.\n14\n\n\nTable of Contents\nWe shipped the following long products volumes at each of these facilities (net tons):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024\n​\n2023\n​\n2022\n​\n​\n​\nStructural and Rail Division\n1,625,913\n​\n1,851,349\n​\n1,865,405\n​\n​\n​\n      Rail shipments (included above)\n254,203\n​\n319,241\n​\n299,795\n​\n​\n​\nEngineered Bar Products Division\n714,509\n​\n836,179\n​\n894,374\n​\n​\n​\nRoanoke Bar Division \n516,258\n​\n564,776\n​\n589,449\n​\n​\n​\nSteel of West Virginia\n321,647\n​\n378,515\n​\n363,832\n​\n​\n​\nCustomers.\n The principal customers for our structural steel products are steel service centers, steel fabricators and various manufacturers. Service centers provide key distribution channels for the mills and value-add services to the end-user. The steel rail marketplace in the United States, Canada, and Mexico is specialized and defined, with seven Class I railroads and a large distribution network.\nSBQ products are principally consumed by cold finishers, forgers, intermediate processors, OEM manufacturers, steel service centers, and distributors, as well as pull-through volume to Vulcan. Our MBQ products are sold primarily to steel service centers, as well as reinforcing steel bar distributors, joist producers (such as our New Millennium Building Systems), and OEMs. Some of the excess steel billet production at the Roanoke Bar Division is sold to mills without sufficient melting capacities, including our Steel of West Virginia facility. Our steel fabrication operations also purchase angles from Roanoke Bar Division. Steel of West Virginia’s customers are primarily OEMs producing solar panel structures, truck trailers, industrial lift trucks, merchant products, guardrail posts, manufactured housing, mining, and off-highway construction equipment. Steel of West Virginia’s flexible manufacturing capabilities enable us to meet demand for a variety of custom-ordered and designed products. Many of these products are produced in small quantities for low volume end-uses resulting in a wide variety of customers, the largest of which are in the truck trailer and industrial lift truck industries.\nSteel Operations Segment Competition\n \nThe markets in which we conduct business are highly competitive with an abundance of competition in the carbon steel industry from North American and foreign integrated and mini-mill steelmaking and processing operations. We compete in numerous industry sections, most significantly tied to the construction, automotive, and other manufacturing sectors. In many applications within these industry sections, steel competes with other materials, such as aluminum, cement, composites, plastics, carbon fiber, glass, and wood. Some of our products are commodities, subject to their own cyclical fluctuations in supply and demand. However, we are focused on providing a broad range of diversified value-added products that de-emphasize commodity steel. The primary competitive influences on products we sell are price, quality, and value-added services.\n​\n15\n\n\nTable of Contents\nMetals Recycling Operations Segment\n​\nMetals Recycling operations include both ferrous and nonferrous scrap metal processing, transportation, marketing, brokerage, and scrap management services, strategically located in close proximity to our steel mills and other end-user scrap consumers, throughout \nthe United States and Mexico.  Our metals recycling operations accounted for 11% of our consolidated net sales during 2024 and 2023 and 9% during 2022. Export sales represented 17%, 19%, and 14% of metals recycling segment net sales during 2024, 2023, and 2022, respectively.\nWe shipped the following from our metals recycling operations:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024\n​\n2023\n​\n2022\n​\n​\n​\nFerrous metal total (gross tons)\n5,850,544\n​\n5,792,484\n​\n5,314,318\n​\n​\n​\n      Shipments to our steel mills\n3,656,034\n​\n3,593,328\n​\n3,488,206\n​\n​\n​\n      Percent of total to our steel mills\n62%\n​\n62%\n​\n66%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNonferrous metals (thousands of pounds)\n965,491\n​\n970,445\n​\n923,319\n​\n​\n​\nWe sell various grades of processed ferrous scrap primarily to steel mills and foundries. Ferrous scrap metal is the primary raw material for EAFs, including our steel mills. In addition, we sell various grades of nonferrous metals including copper, brass, aluminum, and stainless steel, to smelters, refineries, alloy manufacturers, specialty mills and other consumers, including our aluminum operations.\nWe purchase processed and unprocessed ferrous and nonferrous scrap metals in a variety of forms for our metals recycling facilities.\nFerrous scrap comes from two primary sources:\n●\nManufacturing industrial facilities, metal fabrication plants, and machine shops, which generate ferrous scrap referred to as prompt or industrial scrap, and\n●\nScrap dealers, retail individuals, auto wreckers, demolition firms and others who provide steel and iron scrap, referred to as obsolete scrap. Obsolete scrap includes scrap recycled from end-of-life items, such as automobiles, appliances, and machinery.\nNonferrous scrap comes from three primary sources:\n●\nManufacturers and other nonferrous scrap sources, which generate or sell scrap aluminum, copper, stainless steel, and other nonferrous metals,\n●\nProducers of items such as electric wire, telecommunication service providers, aerospace, defense, and recycling companies that generate nonferrous scrap consisting primarily of copper wire, aluminum beverage cans, and various other metals and alloys, and\n●\nRetail transactions conducted with the general public who sell material directly to our facilities, collected from a variety of sources.\nWe do not purchase a significant amount of scrap metal from a single source or from a limited number of major sources. Market demand and the composition, quality, size, weight, and location of the materials are the primary factors that determine prices.\nProducts. \nOur metals recycling operations primarily involve the purchase, processing, and resale of ferrous and nonferrous scrap metals into reusable forms and grades. We process an array of ferrous products through a variety of methods, including sorting, shredding, shearing, cutting, bailing, and breaking. Our major ferrous products include heavy \n16\n\n\nTable of Contents\nmelting steel, busheling, bundled scrap, shredded scrap, and other scrap metal products, such as steel turnings and cast iron. These products vary in properties or attributes related to cleanness, size of individual pieces, and residual alloys. The necessary characteristics of the ferrous products are determined by the specific needs and requirements of the consumer and affect the individual product’s relative value. We process numerous grades of nonferrous products, including aluminum, brass, copper, stainless steel, and other nonferrous metals. Additionally, we provide transportation logistics (truck, rail, and river barge), marketing, brokerage, and scrap management services, providing competitive price and cost advantages to our suppliers and customers. We design, install, and manage customized scrap management programs for industrial manufacturing companies.\nCustomers. \nWe sell various grades of processed ferrous scrap to end-users, such as EAF steel mills, integrated steelmakers, foundries, secondary smelters, and metal brokers, who aggregate materials for other large users. Ferrous scrap metal is the primary raw material for EAFs, including our steel mills. Most of our ferrous scrap customers purchase processed scrap through negotiated spot sales contracts which establish a quantity purchase for the month. The price we charge for ferrous scrap depends upon market demand, composition, size, weight, and transportation costs, as well as the quality and grade of the scrap. We sell various grades of processed nonferrous scrap to end-users such as aluminum sheet and ingot manufacturers, brass and bronze ingot makers, copper refineries, mills, including our new recycled aluminum flat rolled products mill, smelters, specialty steelmakers, alloy manufacturers, wire and cable producers, and utilities. The price we charge for nonferrous scrap also depends upon market demand and pricing, transportation costs, as well as the quality and grade of the scrap.\nCompetition. \nScrap is a global commodity influenced by conditions in a number of industrialized and emerging markets throughout Asia, Europe, and North America. The markets for scrap metals are highly competitive, both in the purchase of raw or unprocessed scrap, and the sale of processed scrap. With regard to the purchase of unprocessed scrap, we compete with numerous independent recyclers, as well as smaller scrap companies engaged only in collecting obsolete scrap. In many cases, we also purchase unprocessed scrap metal from smaller scrap dealers and other processors. Successful procurement of materials is determined primarily by the price offered by the purchaser for the raw scrap and the proximity of our processing facility to the source of the raw scrap. Both ferrous and nonferrous scrap sell as a commodity in both domestic and international markets, which are affected, sometimes significantly, by relative economic conditions, currency fluctuations, and the availability and cost of transportation. Competition for sales of processed scrap is based primarily on the price, quality, and location of the scrap metals, as well as the level of service provided in terms of reliability and timing of delivery.\nWe also face potential competition for sales of processed scrap from other producers of steel products, such as EAFs and integrated steel mills, some of which, like us, are also vertically connected in the scrap metals recycling business. In addition, other steel mills may compete with us in attempting to secure scrap supply through direct purchasing from our scrap suppliers. Scrap metal processors also face competition from substitutes for prepared ferrous scrap, such as pig iron, pelletized iron, hot briquetted iron (HBI), direct reduced iron (DRI), and other forms of processed iron.\nThe industry is highly fragmented with many small, regional, national, and global companies, which have multiple locations in areas in which our metals recycling operations operate. No single scrap metals recycler has a significant market share in the domestic market.\n​\n17\n\n\nTable of Contents\nSteel Fabrication Operations Segment\n​\nOur steel fabrication operations include seven New Millennium Building Systems plants that primarily serve the non-residential construction industry throughout the United States. We have a national operating footprint that allows us to serve the entire domestic non-residential construction market including large retail chains and e-commerce distribution channels.\nSteel fabrication operations accounted for 10%, 15%, and 19% of our consolidated net sales during 2024, 2023, and 2022, respectively. We sold 607,000, 663,000, and 856,000 tons of joist and deck products during 2024, 2023, and 2022, respectively. \nProducts. \nOur steel fabrication operations produce steel non-residential building components, including steel joists,  girders, and steel deck. Our joist products include bowstring, arched, scissor, double-pitched, and single-pitched joists. Our deck products include a full range of steel decking: roof, form, cellular, composite floor, specialty architectural, floor systems, and bridge deck.\nCustomers and Markets\n. \nOur primary steel fabrication operations customers are non-residential steel fabricators, metal building companies, general construction contractors, developers, owners, brokers, and governmental entities. Our customers are located throughout the United States, including national accounts. Our steel fabrication operations maintain approximately one-third of the total domestic steel joist and deck market for bookings, of approximately 1.7 million tons, 1.8 million tons, and 2.1 million tons during 2024, 2023, and 2022, respectively. \nCompetition. \nWe compete with other North American joist and steel deck producers primarily on the basis of price, quality, customer service, and proximity to the customer. Our national footprint allows us to service the entire domestic non-residential construction market, as well as national accounts such as large retail chains, including their distribution warehouse facilities, and certain specialty deck customers.\n​\n18\n\n\nTable of Contents\n​\n​\n​\nOther Information\n​\nSources, Availability, and Cost of Steel and Other Operations’ Raw Materials\nScrap Metals.\n The principal raw material of our EAF steel operations is recycled ferrous scrap derived from, among other sources, \"home scrap,” generated internally at our steel mills themselves; industrial scrap, generated as a by-product of manufacturing; obsolete scrap, recycled from end-of-life automobiles, appliances, and machinery; and demolition scrap, recycled from obsolete structures, containers, and machines.\nRecycled ferrous scrap typically comprises more than 80% of the metallic melt mix in EAF steelmaking, in contrast to integrated mill steelmaking, where the proportion of scrap has traditionally been approximately 25% to 35%. Depending upon the scrap substitute material that may be available from time to time, and the relative cost of such material, the percentage of scrap used in our steelmaking operations could be increased or reduced in our metallic melt mix.\nMany variables can impact ferrous scrap prices, all of which reflect the pushes and pulls of the supply-demand equation. These factors include the level of domestic steel production (high quality, low-residual scrap is a by-product of manufacturing activity), the level of exports of scrap from the United States, and the amount of obsolete scrap recycled. In addition, historical domestic ferrous scrap prices typically have a strong correlation and spread to global pig iron pricing. Generally, as domestic steel production increases, so does scrap demand and resulting scrap prices. The reverse is also normally, but not always, true with scrap prices following steel prices downward when supply exceeds demand. When scrap prices greatly accelerate, this can challenge one of the principal elements of an EAF based steel mill’s traditional lower cost structure—the cost of its metallic raw material. ​\nIron Units.\n In addition to scrap, pig iron, DRI, HBI, and internally sourced liquid pig iron are used in our EAF steel mill production. During 2024 and 2023 we consumed 13.0 million tons and during 2022 we consumed 12.0 million tons of metallic materials in our steelmaking furnaces, of which iron units other than scrap represented approximately 15% of the tons in 2024 and 2023, and 13% of the tons in 2022.\nEnergy Resources\nElectricity. \nElectricity is a significant input required in our EAF steel operations, representing approximately 4% of steel production costs of goods sold in 2024, 2023, and 2022. We have entered into fixed price electricity contracts for the Butler Flat Roll Division, Columbus Flat Roll Division, Roanoke Bar Division and Steel of West Virginia, while our Engineered Bar Products Division has a combination of fixed pricing and market pricing for the various components of the electrical services (demand charge, energy charge, riders, etc.). Our Sinton Flat Roll Division purchases electricity at current market prices. Our Structural and Rail Division purchases electricity at current market prices and through fixed price forward contracts.\nResearch and Development\nOur research and development activities have consisted of efforts to expand, develop, and improve our products and operating processes, such as our Sinton Flat Roll Division, and our efforts to develop and improve renewable product alternatives, such as our construction of a biocarbon production facility. Most of these research and development efforts have been conducted in-house by our team members.  \n19\n\n\nTable of Contents\nEnvironmental Matters\nOur operations are subject to substantial and evolving environmental, health and safety laws and regulations concerning, among other things, emissions to the air, discharges to surface and ground water and to sewer systems, and the generation, handling, storage, transportation, treatment and disposal of solid and hazardous wastes and secondary materials. Our operations are dependent upon permits regulating discharges into the environment or the use and handling of by-products in order to operate our facilities. We dedicate considerable resources aimed at achieving compliance with applicable laws concerning the environment. While we do not currently believe that our future compliance efforts with such provisions will have a material adverse effect on our results of operations, cash flows, or financial condition, this is subject to change in the ever-evolving regulatory environment in which we operate.\nSince the interpretation and enforcement of environmental laws and regulations that may be enacted from time to time can be subject to changing social or political norms, our environmental capital expenditures and costs for environmental compliance may increase in the future. In addition, due to the possibility of unanticipated regulatory or other developments, the amount and timing of future environmental expenditures may vary substantially from those currently anticipated. The cost of current and future environmental compliance may also place our operations at a competitive disadvantage with respect to foreign producers, which may not be required to undertake equivalent costs in their operations.\nPursuant to the Resource Conservation and Recovery Act (RCRA), which governs the handling, recycling and disposal of solid and hazardous wastes and hazardous secondary materials, the United States Environmental Protection Agency (United States EPA) and authorized state or local environmental agencies may conduct inspections to identify alleged violations or areas where there may have been releases of solid or hazardous constituents into the environment and require the facilities to pay penalties and/or take corrective action to address any such releases. RCRA also allows citizens in certain situations to bring claims against regulated facilities for potential damages and cleanup. Many states have statutes and regulatory authorities similar to RCRA that can also apply. Many of our facilities generate wastes and secondary materials subject to these requirements. Some of these materials, for example EAF dust, may be categorized as hazardous waste, requiring special handling for disposal or for the recovery of metallics. While we cannot predict the future actions of the regulators or other interested parties, the potential exists for required corrective action, the costs of which could be substantial.\n​\nUnder the Comprehensive Environmental Response Compensation and Liability Act, known as CERCLA or Superfund, the United States EPA, state agencies and, in some instances, private parties have the authority to assert joint and several liability for the remediation of contaminated properties upon generators of hazardous substances, current and former site owners and operators, transporters, and other potentially responsible parties, regardless of fault or the legality of the original disposal activity. Many states have statutes and regulatory authorities similar to CERCLA that can also apply. We have a number of material handling agreements with various contractors to properly dispose of or recycle our EAF dust and other by-products of our operations. However, we cannot assure that, even if there has been no fault by us, we may not still be cited as a hazardous substances generator by reason of an environmental cleanup at one of our facilities or a site to which our by-products were transported.\nThe Clean Water Act and similar state and local laws apply to aspects of our operations and impose regulatory restrictions related to the discharge of wastewater, storm water, and dredged or fill material. The United States EPA, state agencies and, in certain instances, local governments and private parties have the ability to bring claims alleging violations and seeking penalties and injunctive relief. These legal provisions can also require new or expanded water treatment investments to be made and can limit or even prohibit certain current or planned activities at our operations.\nThe Clean Air Act and analogous state and local laws require many of our facilities to obtain and maintain air permits in order to operate. Air permits can impose new or expanded obligations to limit or prevent current or future emissions and to add costly pollution control equipment. Claims for alleged violations can be brought by the United States EPA, state agencies, and in certain instances local governments and private parties, and can result in penalties and injunctive relief.\n20\n\n\nTable of Contents\nIn addition, there are a number of other environmental, health and safety laws and regulations that apply to our facilities and may affect our operations. By way of example and not of limitation, certain portions of the federal Toxic Substances Control Act, Oil Pollution Act, Safe Drinking Water Act, and Emergency Planning and Community Right-to-Know Act, as well as state and local laws and regulations implemented by the regulatory agencies, apply to aspects of our facilities’ operations. Our operations in Mexico are similarly subject to environmental requirements applicable to those operations. In some instances, we may also be subject to other foreign governments’ regulations and international treaties and laws. Many of these laws allow both the governments and citizens in certain situations to bring claims against regulated facilities for alleged environmental violations. Finally, our operations could in certain situations be subject to toxic tort claims brought by third parties alleging causes of action such as nuisance, negligence, trespass, infliction of emotional distress, or other claims alleging personal injury, property damage, or other harms.\nAvailable Information\nOur internet website address is \nwww.steeldynamics.com\n. We make available on our internet website, under \"Investors,” free of charge, as soon as reasonably practicable after such materials are electronically filed with, or furnished to, the Securities and Exchange Commission, our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports, as well as press releases, ownership reports pursuant to Section 16(a) of the Securities Act of 1933, our Code of Ethics for Principal Executive Officers and Senior Financial Officers, our Code of Business Conduct and Ethics, and any amendments thereto or waivers thereof, as well as our Audit, Compensation, and Corporate Governance and Nominating Committee Charters. The contents of our or any other website are not incorporated into this report.\n \nThese reports are also available publicly on the Securities and Exchange Commission website, \nwww.sec.gov.\n​\n21\n\n\nTable of Contents",
  "item7": "ITEM 7.        MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-Looking Statements\nThis report contains some predictive statements about future events, including statements related to conditions in domestic or global economies, conditions in steel, aluminum, and recycled metals market places, Steel Dynamics' revenues, costs of purchased materials, future profitability and earnings, and the operation of new, existing or planned facilities. These statements, which we generally precede or accompany by such typical conditional words as \"anticipate\", \"intend\", \"believe\", \"estimate\", \"plan\", \"seek\", \"project\", or \"expect\", or by the words \"may\", \"will\", or \"should\", are intended to be made as \"forward-looking\", subject to many risks and uncertainties, within the safe harbor protections of the Private Securities Litigation Reform Act of 1995. These statements speak only as of this date and are based upon information and assumptions, which we consider reasonable as of this date, concerning our businesses and the environments in which they operate. Such predictive statements are not guarantees of future performance, and we undertake no duty to update or revise any such statements. Some factors that could cause such forward-looking statements to turn out differently than anticipated include: (1) domestic and global economic factors; (2) global steelmaking overcapacity and imports of steel, together with increased scrap prices; (3) pandemics, epidemics, widespread illness or other health issues; (4) the cyclical nature of the steel industry and the industries we serve; (5) volatility and major fluctuations in prices and availability of scrap metal, scrap substitutes and supplies, and our potential inability to pass higher costs on to our customers; (6) cost and availability of electricity, natural gas, oil, and other energy resources are subject to volatile market conditions; (7) increased environmental, greenhouse gas emissions and sustainability considerations from our customers and investors or related regulations; (8) compliance with and changes in environmental and remediation requirements; (9) significant price and other forms of competition from other steel and aluminum producers, scrap processors and alternative materials; (10) availability of an adequate source of supply of scrap for our metals recycling operations; (11) cybersecurity threats and risks to the security of our sensitive data and information technology; (12) the implementation of our growth strategy; (13) our ability to retain, develop and attract key personnel; (14) litigation and legal compliance; (15) unexpected equipment downtime or shutdowns; (16) governmental agencies may refuse to grant or renew some of our licenses and permits; (17) our senior unsecured credit facility contains, and any future financing agreements may contain, restrictive covenants that may limit our flexibility; and (18) the impacts of impairment charges.\nMore specifically, we refer you to our more detailed explanation of these and other factors and risks that may cause such predictive statements to turn out differently, as set forth in the sections titled \nSpecial Note Regarding Forward-Looking Statements\n at the beginning of Part I of this Report and Item 1A. \nRisk Factors\n, as well as in other subsequent reports we file with the Securities and Exchange Commission. These reports are available publicly on the Securities and Exchange Commission website, \nwww.sec.gov\n, and on our website, \nwww.steeldynamics.com \nunder “Investors – SEC Filings.”\nOperating Statement Classifications\nNet Sales\n. Net sales from our operations are a factor of volumes shipped, product mix, and related pricing. We charge premium prices for certain grades of steel, product dimensions, certain smaller volumes, and for value-added processing or coating of our steel products. Except for the steel fabrication operations, we recognize revenues from sales and the allowance for estimated returns and claims from these sales at the point in time control of the product transfers to the customer, upon shipment or delivery. Our steel fabrication operations recognize revenues over time based on completed fabricated tons to date as a percentage of total tons required for each contract.\nCosts of Goods Sold\n. Our costs of goods sold represent all direct and indirect costs associated with the manufacture of our products. The principal elements of these costs are scrap and scrap substitutes (which represent the most significant single component of our consolidated costs of goods sold), steel substrate, direct and indirect labor and related benefits, alloys, zinc, transportation and freight, repairs and maintenance, utilities such as electricity and natural gas, and depreciation.\n38\n\n\nTable of Contents\nSelling, General and Administrative Expenses\n. Selling, general and administrative expenses consist of all costs associated with our sales, finance and accounting, and administrative departments, including, among other items, labor and related benefits, and professional services. \nCompanywide profit sharing and amortization of intangible assets are each separately presented in the statements of income.\nInterest Expense, net of Capitalized Interest\n. Interest expense consists of interest associated with our senior credit facilities and other debt, net of interest costs that are required to be capitalized during the construction period of certain capital investment projects.\nOther (Income) Expense, net\n. Other income consists of interest income earned on our temporary cash deposits, short-term and other investments, and any other non-operating income activity, including income from investments in unconsolidated affiliates accounted for under the equity method. Other expense consists of any non-operating costs, such as certain acquisition and financing expenses.\n2024 Overview\nDuring 2024 we achieved steel shipments of 12.7 million tons, our second highest annual volume behind 2023’s 12.8 million tons. Underlying domestic steel demand was stable during 2024, but imports of certain steel products, most notably coated flat rolled steels, caused pricing pressure for flat rolled steel products. While facing a challenging pricing environment throughout much of the year, our metals recycling teams maintained consistent volumes during 2024 compared to 2023. A solid non-residential construction market during 2024 benefited our steel fabrication operations, as the segment achieved historically strong volumes and average selling prices, compared to pre-Covid levels. Consolidated net sales were $17.5 billion during 2024, with cash flow from operations of $1.8 billion. Metal spread compression in our steel and, particularly, steel fabrication segments resulted in significantly lower operating income in 2024 compared to 2023.\nConsolidated operating income for 2024 decreased $1.2 billion, or 38%, to $1.9 billion, compared to $3.2 billion in 2023. Net income attributable to Steel Dynamics, Inc. for 2024 decreased $913.7 million, or 37%, to $1.5 billion, compared to 2023. Diluted earnings per share attributable to Steel Dynamics, Inc. was $9.84 for 2024, compared to $14.64 for 2023. \nRefer to Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations \nin Part II of our Annual Report on Form 10-K for the year ended December 31, 2023, for additional information regarding results of operations for the year ended December 31, 2023, as compared to the year ended December 31, 2022, and segment operating results for 2023 as compared to 2022. Our 2024 change in reportable segments did not change the discussion previously provided. Refer to the Aluminum Operations segment discussion for additional information.  \n​\n39\n\n\nTable of Contents\nSegment Operating Results (\ndollars in thousands\n)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n Years Ended December 31,\n​\n​\n​\n2024\n​\n% Change\n​\n2023\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet sales\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSteel Operations \n$\n 12,527,066\n​\n(4)%\n​\n$\n 13,067,622\n​\n​\nMetals Recycling Operations \n​\n 4,136,913\n​\n(1)%\n​\n​\n 4,158,588\n​\n​\nSteel Fabrication Operations \n​\n 1,771,795\n​\n(37)%\n​\n​\n 2,806,777\n​\n​\nAluminum Operations \n​\n 318,689\n​\n11% \n​\n​\n 285,907\n​\n​\nOther\n​\n 1,451,723\n​\n24% \n​\n​\n 1,171,901\n​\n​\n​\n​\n 20,206,186\n​\n​\n​\n​\n 21,490,795\n​\n​\nIntra-company\n​\n (2,665,796)\n​\n​\n​\n​\n (2,695,479)\n​\n​\n​\n$\n 17,540,390\n​\n(7)%\n​\n$\n 18,795,316\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nOperating income (loss)\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSteel Operations \n$\n 1,582,374\n​\n(16)%\n​\n$\n 1,881,600\n​\n​\nMetals Recycling Operations\n​\n 76,807\n​\n61% \n​\n​\n 47,735\n​\n​\nSteel Fabrication Operations \n​\n 666,984\n​\n(58)%\n​\n​\n 1,593,261\n​\n​\nAluminum Operations \n​\n (72,331)\n​\n(522)%\n​\n​\n 17,146\n​\n​\nOther \n​\n (317,408)\n​\n20% \n​\n​\n (394,577)\n​\n​\n​\n​\n 1,936,426\n​\n​\n​\n​\n 3,145,165\n​\n​\nIntra-company\n​\n 6,611\n​\n​\n​\n​\n 6,016\n​\n​\n​\n$\n 1,943,037\n​\n(38)%\n​\n$\n 3,151,181\n​\n​\n​\n40\n\n\nTable of Contents\n​\nSteel Operations Segment\n​\nSteel operations include our EAF steel mills, including Butler Flat Roll Division, Columbus Flat Roll Division, Southwest-Sinton Flat Roll Division, Structural and Rail Division, Engineered Bar Products Division, Roanoke Bar Division, Steel of West Virginia, steel coating and processing operations at The Techs, Heartland Flat Roll Division, United Steel Supply, Vulcan Threaded Products, Inc., warehouse operations in Mexico, and SDI Biocarbon Solutions, LLC, a joint venture to construct and operate a biocarbon production facility. Steel operations accounted for 69% and 67% of our consolidated net sales during 2024 and 2023, respectively. See Item 1. \nBusiness\n for further information on Steel Operations segment operations.\nSteel Operations Shipments (tons):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n Years Ended December 31, \n​\n​\n​\n2024\n​\n% Change\n​\n2023\n​\n​\nTotal shipments\n 12,660,487\n​\n(1)%\n​\n 12,821,753\n​\n​\nIntra-segment shipments\n (1,306,364)\n​\n​\n​\n (1,449,832)\n​\n​\nSteel Operations Segment shipments\n 11,354,123\n​\n-\n​\n 11,371,921\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nExternal shipments\n 10,929,453\n​\n-\n​\n 10,976,707\n​\n​\n​\nSegment Results 2024 vs. 2023\nDuring 2024, our steel operations achieved annual shipments of 12.7 million tons (11.4 million excluding intra-segment), slightly less than 2023 total record shipments. Customer order activity and steel demand were stable during 2024, with the construction, automotive, industrial, and energy sectors leading demand. In spite of strong market demand, average selling prices were lower during 2024 compared to 2023, as total steel segment average selling prices decreased 4%, or $46 per ton, compared to 2023. Net sales for the steel operations segment were 4% lower in 2024 when compared to 2023, due to lower average steel selling prices on consistent volumes.\n​\n41\n\n\nTable of Contents\nMetallic raw materials used in our electric arc furnaces represent our single most significant steel manufacturing cost, generally comprising approximately 55% to 65% of our steel mill operations’ manufacturing costs. Our metallic raw material cost consumed in our steel mills decreased $28 per net ton, or 7%, in 2024 compared to 2023, consistent with overall decreased domestic scrap pricing noted below in the metals recycling operations segment discussion.\n​\nAs a result of average selling prices decreasing more than scrap costs, specifically for long products, metal spread (which we define as the difference between average steel mill selling prices and the cost of ferrous scrap consumed in our steel mills) decreased 3% in 2024 compared to 2023. Due to metal spread compression, operating income for the steel operations decreased 16% to $1.6 billion in 2024 compared to 2023.\nMetals Recycling Operations Segment\n​\nMetals recycling operations include our OmniSource ferrous and nonferrous processing, transportation, marketing, brokerage, and scrap management services primarily throughout the United States and Mexico. Our steel mills utilize a large portion of the ferrous scrap sold by our metals recycling operations as raw material in our steelmaking operations, and the remainder is sold to other consumers, such as other steel manufacturers and foundries. In 2024 and 2023, 62% of metals recycling operations ferrous scrap was sold to our own steel mills, while our steel mill utilization remained consistent at 81% and 82% in 2024 and 2023, respectively. Metals recycling operations accounted for 11% of our consolidated net sales during 2024 and 2023.\nMetals Recycling Operations Shipments:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYears Ended December 31,\n​\n​\n​\n​\n2024\n​\n% Change\n​\n2023\n​\n​\nFerrous metal (gross tons)\n​\n​\n​\n​\n​\n​\n​\n​\nTotal\n​\n 5,850,544\n​\n1% \n​\n 5,792,484\n​\n​\nInter-company\n​\n (3,656,034)\n​\n​\n​\n (3,593,328)\n​\n​\nExternal shipments\n​\n 2,194,510\n​\n-\n​\n 2,199,156\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNonferrous metal (thousands of pounds)\n​\n​\n​\n​\n​\n​\n​\n​\nTotal\n​\n 965,491\n​\n(1)%\n​\n 970,445\n​\n​\nInter-company\n​\n (171,915)\n​\n​\n​\n (207,866)\n​\n​\nExternal shipments\n​\n 793,576\n​\n4% \n​\n 762,579\n​\n​\nSegment Results 2024 vs. 2023\nDuring 2024, our metals recycling operations continued to benefit from solid domestic steel industry demand, resulting in consistent ferrous and nonferrous scrap shipments compared to 2023. Net sales for our metals recycling operations in 2024 were comparable to 2023 based on consistent shipments. Due to a challenging pricing environment throughout much of 2024, ferrous average selling prices decreased 7% while nonferrous average selling prices increased 10% during 2024 compared to 2023.\n​\nFerrous metal spread (which we define as the difference between average selling prices and the cost of purchased scrap) was flat and nonferrous metal spread increased 13% during 2024 compared to 2023. As a result of the overall increased metals spreads, metals recycling operations operating income increased 61% to $76.8 million in 2024 compared to 2023.\n​\n42\n\n\nTable of Contents\nSteel Fabrication Operations Segment\n​\nSteel fabrication operations include the company’s New Millennium Building Systems’ joist and deck plants located throughout the United States, and in Northern Mexico. Revenues from these plants are generated from the fabrication of girders, steel joists and steel deck used within the non-residential construction industry. Steel fabrication operations accounted for 10% and 15% of our consolidated net sales during 2024 and 2023, respectively.\n​\n​\nSegment Results 2024 vs. 2023\nNet sales for the steel fabrication operations decreased 37% during 2024 compared to 2023, as average selling prices decreased 31% and volumes decreased 8% compared to 2023. Our steel fabrication operations benefited from a solid non-residential construction market, as evidenced by historically solid order backlog that extends deep into the first half of 2025 at attractive pricing levels.\n \nThe continued onshoring of manufacturing, coupled with the robust U.S. infrastructure and Inflation Reduction Act programs, supports consistent strong demand for steel joist and deck products.\nThe purchase of various steel products is the largest single cost of production for our steel fabrication operations, historically representing approximately two-thirds of the total cost of manufacturing. The average cost of steel consumed decreased 5% in 2024, as compared to 2023. Due to decreased selling prices per ton more than offsetting decreased steel input costs per ton, metal spread (which we define as the difference between average selling prices and the cost of purchased steel) contracted 41% in 2024 compared to 2023. Metal spread compression coupled with decreased volume resulted in operating income decreasing 58% to $667.0 million in 2024, compared to $1.6 billion in 2023.\n43\n\n\nTable of Contents\nAluminum Operations Segment\n​\nAluminum operations include the recycled aluminum flat rolled products mill nearing completion of construction in Columbus, Mississippi, two satellite recycled aluminum slab centers in the southwest United States (US) and Central Mexico, and an entity with aluminum operations, formerly included in the results of our metals recycling operations segment. The aluminum flat rolled products mill and the Mexico and US recycled aluminum slab centers are expected to begin operations in mid to late 2025. Net sales relate to an entity with aluminum operations, previously reported as part of our metals recycling operations. The results of this segment largely consist of construction and start-up costs recorded in selling, general, and administrative expenses, which continued to increase during 2024, consistent with increased headcount and start-up costs. \n \nOther Operations\n​\nConsolidated Results 2024 vs. 2023\nSelling, General and Administrative Expenses. \nSelling, general and administrative expenses of $664.1 million during 2024 increased 13% from $588.6 million during 2023 primarily due to an increase in payroll and benefits expense related to the growth of the aluminum operations segment during 2024. Selling, general and administrative expenses represented 3.8% and 3.1% of net sales during 2024 and 2023, respectively. \nProfit sharing expense during 2024 of $164.9 million decreased 39% from $272.0 million during 2023, consistent with decreased pretax earnings. This decrease in profit sharing expense was the primary driver of decreased operating loss for other operations of 20% in 2024 compared to 2023. Profit sharing expense for eligible employees is 8% of consolidated pretax income excluding noncontrolling interests and other items. Refer to Note 10. \nRetirement Plans\n to the consolidated financial statements elsewhere in this report for further information.\nInterest Expense, net of Capitalized Interest. \nDuring 2024, interest expense of $56.3 million decreased 26% from $76.5 million during 2023. The lower interest expense in 2024 compared to 2023 is due to higher capitalized interest in 2024 ($66.8 million, compared to $33.0 million in 2023) related to our ongoing expansion projects, most notably within Aluminum Operations.\nOther (Income) Expense, net. \n Net other income was $96.2 million in 2024, compared to $144.2 million in 2023, due primarily to the impact of foreign currency exchange rate losses of $18.7 million in 2024 compared to gains of $10.5 million in 2023, as well as a $21.8 million reduction in interest income on investments in 2024 compared to 2023 due to a decrease in the balance of invested cash during 2024.\nIncome Tax Expense. \nDuring 2024, income tax expense of $432.9 million, at an effective income tax rate of 21.8%, decreased 42% compared to the $751.6 million, at an effective income tax rate of 23.3%, during 2023, consistent with decreased pretax earnings. Our effective tax rate decrease was due primarily to certain discrete tax adjustments during the third quarter and fourth quarters of 2024. Refer to Note 4. \nIncome Taxes\n to the consolidated financial statements elsewhere in this report for additional information.\nIncluded in the balance of unrecognized tax benefits at December 31, 2024, are potential benefits of $26.4 million that, if recognized, would affect the effective tax rate. We recognize interest and penalties related to our tax contingencies on a net-of-tax basis in income tax expense. During the year ended December 31, 2024, we recognized expense from the increase of interest expense and penalties of $710,000, net of tax. In addition to the unrecognized tax benefits noted above, we had $4.2 million accrued for the payment of interest and penalties at December 31, 2024.\nWe file income tax returns in the United States federal jurisdiction as well as income tax returns in various state jurisdictions. The tax years 2021 through 2023 remain open to examination by the Internal Revenue Service and various state and local jurisdictions. At this time, we do not believe there will be any significant examination adjustments that would result in a material change to our financial position, results of operations or cash flows. It is reasonably possible that the amount of unrecognized tax benefits could change in the next twelve months in an amount ranging from zero to $12.0 million, as a result of the expiration of the statute of limitations and other federal and state income tax audits.\n44\n\n\nTable of Contents\nLiquidity and Capital Resources\nCapital Resources and Long-term Debt. \nOur business is capital intensive and requires substantial expenditures for, among other things, the purchase and maintenance of equipment used in our operations, and to remain in compliance with environmental laws. Our short-term and long-term liquidity needs arise primarily from working capital requirements, capital expenditures, including expansion projects, principal and interest payments related to our outstanding indebtedness, dividends to our shareholders, potential stock repurchases and acquisitions or investments. We have met and intend to continue to meet these liquidity requirements primarily with available cash and cash provided by operations, long-term borrowings, and we also have availability under our unsecured Revolver. Our liquidity at December 31, 2024, is as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nCash and equivalents\n​\n$\n 589,464\n​\n​\n​\n​\n​\n​\nShort-term and other investments\n​\n​\n 388,563\n​\n​\n​\n​\n​\n​\nUnsecured revolver availability\n​\n​\n 1,190,741\n​\n​\n​\n​\n​\n​\nTotal liquidity\n​\n$\n 2,168,768\n​\n​\n​\n​\nOur total outstanding debt of $3.2 billion increased $160.0 million compared to December 31, 2023, due to our issuance of $600.0 million of senior unsecured notes in July 2024 as described in Note 3, the proceeds of which were used for general corporate purposes, including the repayment of our 2.800% senior notes due December 2024, working capital, capital expenditures, advances for or investments in subsidiaries, acquisitions, redemption and repayment of other outstanding indebtedness, and purchases of the company’s common stock. Our total long-term debt to capitalization ratio (representing our long-term debt, including current maturities, divided by the sum of our long-term debt, redeemable noncontrolling interests, and our total stockholders’ equity) was 26.5% and 25.8% at December 31, 2024 and 2023, respectively.\nOur unsecured credit agreement has a senior unsecured revolving credit facility (Facility)\n, which provides a $1.2 billion Revolver and matures in July 2028. Subject to certain conditions, we have the ability to increase the Facility size by $500.0 million. The unsecured Revolver is available to fund working capital, capital expenditures, and other general corporate purposes. The Facility contains financial covenants and other covenants pertaining to our ability to incur indebtedness and permit liens on certain assets. Our ability to borrow funds within the terms of the unsecured Revolver is dependent upon our continued compliance with the financial and other covenants. At December 31, 2024, we had $1.2 billion of availability on the Revolver, $9.3 million of outstanding letters of credit and other obligations which reduce availability, and there were no borrowings outstanding.\nThe financial covenants under our Facility state that we must maintain an interest coverage ratio of not less than 2.50:1.00. Our interest coverage ratio is calculated by dividing our last-twelve-months (LTM) consolidated Adjusted EBITDA as defined in the Facility (earnings before interest, taxes, depreciation, amortization, and certain other non-cash transactions as defined in the Facility) by our LTM gross interest expense, less amortization of financing fees. In addition, a debt to capitalization ratio of not more than 0.60:1.00 must be maintained. At December 31, 2024, our interest coverage ratio and debt to capitalization ratio were 21.68:1.00 and 0.27:1.00, respectively. We were, therefore, in compliance with these covenants at December 31, 2024, and we anticipate we will continue to be in compliance during the next twelve months.\nWorking Capital (representing excess of current assets over current liabilities). \nWe generated cash flow from operations of $1.8 billion in 2024 compared to $3.5 billion in 2023. Working capital decreased $1.2 billion, or 26%, during 2024 to $3.3 billion at December 31, 2024, due primarily to a $1.4 billion decrease in cash and equivalents and short-term investments in support of our capital investments within our aluminum and steel operations.\n45\n\n\nTable of Contents\nCapital Investments. \nDuring 2024, we invested $1.9 billion in property, plant and equipment, primarily within our aluminum operations and steel operations segments, compared with $1.7 billion invested during 2023. \nWe are currently executing our plan to invest $2.7 billion in a new state-of-the-art lower-carbon recycled aluminum flat rolled products mill with two new supporting satellite recycled aluminum slab centers, which are being funded by available cash and cash flow from operations. Related expenditures began in the third quarter of 2022 and are expected to continue through 2025.\n Our liquidity of $2.2 billion and anticipated future operating cash flow generation is sufficient to provide for our planned 2025 capital requirements. \nCash Dividends. \nAs a reflection of continued confidence in our current and future cash flow generation capability and financial position, we increased our quarterly cash dividend by 8% to $0.46 per share in the first quarter of 2024 (from $0.425 per share for each quarter in 2023), resulting in declared cash dividends of $284.1 million during 2024, compared to $280.5 million in 2023. We paid cash dividends of $282.6 million and $271.3 million during 2024 and 2023, respectively. Our board of directors, along with executive management, approves the payment of dividends on a quarterly basis. The determination to pay cash dividends in the future is at the discretion of our board of directors, after taking into account various factors, including our financial condition, results of operations, outstanding indebtedness, current and anticipated cash needs and growth plans.\nOther. \nOur board of directors has authorized share repurchase programs during prior years, the most recent of which occurred in November 2023 for a program of up to $1.5 billion of the company’s common stock. In February 2025, our board of directors authorized an additional share repurchase program of up to $1.5 billion of our common stock. Under the share repurchase programs, purchases take place as and when we determine in open market or private transactions made based upon the market price of our common stock, the nature of other investment opportunities or growth projects, our cash flows from operations, and general economic conditions. The share repurchase programs do not require us to acquire any specific number of shares, and may be modified, suspended, extended, or terminated by us at any time. The share repurchase programs do not have an expiration date. There were $1.2 billion and $1.5 billion of share repurchases during 2024 and 2023, respectively. As of December 31, 2024, we had $193.5 million remaining available to purchase under the November 2023 share repurchase program. See Part II, Item 5. \nMarket for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\n for additional information.\nOur ability to meet our debt service obligations and reduce our total debt will depend upon our future performance which, in turn, will depend upon general economic, financial, and business conditions, along with competition, legislation and regulatory factors that are largely beyond our control. In addition, we cannot assure that our operating results, cash flows, access to credit markets and capital resources will be sufficient for repayment of our indebtedness in the future. We believe that based upon current levels of operations and anticipated growth, cash flows from operations, together with other available sources of funds, including borrowings under our Facility, if necessary, will be adequate for the next twelve months for making required payments of principal and interest on our indebtedness, funding working capital requirements, and funding anticipated capital expenditures.\nContractual Obligations and Other Long-Term Liabilities\nWe have the following minimum commitments under contractual obligations, including purchase obligations, as defined by the Securities and Exchange Commission. A “purchase obligation” is defined as an agreement to purchase goods or services that is enforceable and legally binding and that specifies all significant terms, including fixed or minimum quantities to be purchased; fixed, minimum or variable price provisions; and the approximate timing of the transaction.\nLong-term debt and estimated interest. \nRefer to Note 3. \nLong-Term Debt\n to the consolidated financial statements elsewhere in this report for our long-term debt maturities. Estimated interest payments on our senior unsecured notes were determined based on their outstanding balances through maturity at their contractual interest rates, as detailed in Note 3. Estimated interest payments also include a 0.175% commitment fee on our available Revolver, and an average interest rate of 6.23% on our other debt of $28.8 million. Our estimated interest payments are $116.4 million, $109.4 million, $89.0 million, $83.4 million, and $82.2 million, for the years 2025 through 2029, respectively, and $442.4 million thereafter.\n46\n\n\nTable of Contents\nPurchase obligations.\n We have commitments for the purchase of commodities such as electricity, water, natural gas and its transportation services, fuel, air products, zinc, and electrodes. Refer to Note 8. \nCommitments and Contingencies\n to the consolidated financial statements elsewhere in this report for this information.\nConstruction commitments.\n We have firm contracts with various vendors for the completion of certain construction projects at our various divisions at December 31, 2024. Refer to Note 8. \nCommitments and Contingencies\n to the consolidated financial statements elsewhere in this report for this information.\nLease commitments.\n \nWe have entered into operating leases relating principally to transportation and other equipment, and some real estate. Refer to Note 11. \nLeases\n to the consolidated financial statements elsewhere in this report for this information.\nUnrecognized tax benefits.\n We expect to make cash outlays in the future related to our unrecognized tax benefits; however, due to the uncertainty of the timing, we are unable to make reasonably reliable estimates regarding the period of cash settlement with the respective taxing authorities. Refer to Note 4. \nIncome Taxes \nto the consolidated financial statements elsewhere in this report for this information.\n​\nOther Matters\nEnvironmental and Other Contingencies\nWe have incurred, and in the future will continue to incur, capital expenditures and operating expenses for matters relating to environmental control, remediation, monitoring, and compliance. During 2024, we incurred costs related to the monitoring and compliance of environmental matters in the amount of approximately $60.2 million and capital expenditures related to environmental compliance of approximately $4.3 million. Of the costs incurred during 2024 for monitoring and compliance, approximately 74% were related to the normal transportation of certain types of by-products produced in our steelmaking processes and other facilities in accordance with legal requirements. We incurred combined environmental remediation costs of approximately $4.9 million at all of our facilities during 2024. We have an accrual of $3.8 million recorded for environmental remediation related to our metals recycling operations, $2.6 million related to our idled Minnesota ironmaking operations, and $712,000 related to our steel operations. We believe, apart from our dependence on environmental construction and operating permits for our existing and any future manufacturing facilities, that compliance with current environmental laws and regulations is not likely to have a materially adverse effect on our financial condition, results of operations, or liquidity. However, environmental laws and regulations evolve and change, and we may become subject to more stringent environmental laws and regulations in the future, such as the impact of various governmental legislatures and agencies introducing regulatory changes in response to the potential of climate change. \nCritical Accounting Estimates\nManagement’s Discussion and Analysis of Our Financial Condition and Results of Operations is based upon our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States. We review the accounting estimates we use in reporting our financial results on a regular basis. The preparation of these financial statements requires us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosure of contingent liabilities. We evaluate the appropriateness of these estimations and judgments on an ongoing basis. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying value of assets and liabilities that are not readily apparent from other sources. Results may differ from these estimates due to actual outcomes being different from those on which we based our assumptions. We believe the following critical accounting estimates affect our more significant judgments and estimates used in the preparation of our consolidated financial statements.\n47\n\n\nTable of Contents\nImpairments of Long-Lived Tangible and Definite-Lived Intangible Assets. \nWe review long-lived assets for impairment whenever events or changes in circumstances indicate the carrying amount of such assets may not be fully recoverable. Impairment losses are recorded on long-lived assets used in operations when indicators of impairment are present and the undiscounted cash flows estimated to be generated by those assets are less than the assets’ carrying amounts. The impairment loss is measured by comparing the fair value of the asset to its carrying amount. We consider various factors and determine whether an impairment test is necessary, including by way of examples, a significant and prolonged deterioration in operating results and/or projected cash flows, significant changes in the extent or manner in which an asset is used, technological advances with respect to assets which would potentially render them obsolete, our strategy and capital planning, and the economic environment in markets to be served. When determining future cash flows, and, if necessary, fair value, we must make judgments as to the expected utilization of assets and estimated future cash flows related to those assets. We consider historical and anticipated future results, general economic and market conditions, the impact of planned business and operational strategies, and all other available information at the time the estimates are made. Those estimates and judgments may or may not ultimately prove accurate. There were no indicators of impairment or impairment charges recorded during 2024, 2023, or 2022. \nGoodwill.\nOur goodwill, relating to various business combinations, consisted of the following at December 31, 2024 and 2023 (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSteel Operations Segment\n​\n$\n 272,133\n​\n​\n​\nAluminum Operations Segment\n​\n​\n 14,000\n​\n​\n​\nMetals Recycling Operations Segment\n​\n​\n 189,413\n​\n​\n​\nSteel Fabrication Operations Segment \n​\n​\n 1,925\n​\n​\n​\n​\n​\n$\n 477,471\n​\n​\n​\nAt least once annually (as of October 1), or when indicators of impairment exist, we perform a goodwill impairment analysis. Goodwill is allocated to various reporting units, which are generally one level below the company’s operating segments. If the fair value exceeds the carrying value of the reporting unit, there is no impairment. If the carrying amount exceeds the fair value, we recognize an impairment loss in the amount by which the carrying value of the net assets assigned to the reporting unit exceeds the fair value of the reporting unit, with the impairment loss not to exceed the amount of goodwill allocated to the reporting unit. We have the option to consider qualitative factors to assess if it is more likely than not that the fair value of a reporting unit exceeds its carrying value. If we elect to bypass the qualitative assessment or if indications of a potential impairment exist, we perform a quantitative test.\nWhen conducting a qualitative assessment, we consider the impact of several factors on the company overall and each reporting unit individually including the timing and results of prior quantitative tests performed, changes in the carrying amount of the reporting unit, macroeconomic conditions (including changes in interest and discount rates), industry and market conditions, recent and projected financial performance, the company’s competitive position and other factors.  Significant judgment is involved in evaluating the totality of all factors to determine whether it is more likely than not that the fair value of the reporting unit exceeds its carrying value. \nWhen conducting a quantitative test, the fair value of the reporting unit is determined by using an estimate of future cash flows utilizing a risk-adjusted discount rate to calculate the net present value of future cash flows (income approach), and for some years by using a market approach based upon an analysis of valuation metrics of comparable peer companies, using Level 3 fair value inputs as provided for under ASC 820. Key assumptions used to determine the estimated fair value of each reporting unit under the discounted cash flows method (income approach) include: (a) expected cash flows for the five-year period following the testing date (including market share, sales volumes and prices, costs to produce and estimated capital needs); (b) an estimated terminal value using a terminal year growth rate determined based on the growth prospects of the reporting unit; and (c) a risk-adjusted discount rate based on management’s best estimate of market participants’ after-tax weighted average cost of capital and market risk premiums. Key assumptions used to determine the estimated fair value of each reporting unit under the market approach include the expected revenues and cash flows in the next year. We consider historical and anticipated future results, general \n48\n\n\nTable of Contents\neconomic and market conditions, the impact of planned business and operational strategies and all available information at the time the fair values of reporting units are estimated. Those estimates and judgments may or may not ultimately prove accurate.\nGoodwill acquired in past transactions is naturally more susceptible to impairment, primarily due to the fact that they are recorded at fair value based on operating plans and economic conditions at the time of acquisition. Consequently, if operating results and/or economic conditions deteriorate after an acquisition, it could result in the impairment of the acquired asset. A deterioration of economic conditions may not only negatively impact the estimated operating cash flows used in our cash flow models but may also negatively impact other assumptions used in our analyses, including, but not limited to, the estimated cost of capital and/or discount rates. Additionally, we are required to ensure that assumptions used to determine fair value in our analyses are consistent with the assumptions a hypothetical marketplace participant would use. As a result, the cost of capital and/or discount rates used in our analyses may increase or decrease based on market conditions and trends, regardless of whether our actual cost of capital has changed. Therefore, we may recognize an impairment in spite of realizing actual cash flows that are approximately equal to or greater than our previously forecasted amounts. Accordingly, our qualitative assessments consider changes in interest rates and our quantitative tests include discount rate scenario analysis to evaluate the impact on estimated reporting unit fair values. \nOur fourth quarter 2024, 2023, and 2022 annual goodwill impairment analyses did not result in any impairment charges. During 2024, we performed a qualitative assessment and performed quantitative tests in 2023 and 2022.  Management does not believe that it is reasonably likely that our reporting units will fail the goodwill impairment test in the near term, given the results of our most recent qualitative assessment and the determined fair value of the reporting units with goodwill from our most recent quantitative test exceeded their carrying value by more than an insignificant amount. Changes in judgments and estimates underlying our analysis of goodwill for possible impairment, including expected future operating cash flows and discount rate, could decrease the estimated fair value of our reporting units in the future and could result in an impairment of goodwill.\nIncome Taxes. \nWe are required to estimate our income taxes as a part of the process of preparing our consolidated financial statements. This requires us to estimate our actual current tax exposure together with assessing temporary differences resulting from differing treatments of items for tax and accounting purposes. These differences result in deferred tax assets and liabilities, which are included within our consolidated balance sheet. We must then assess the likelihood that our deferred tax assets will be recovered from future taxable income and, to the extent we believe that recovery is not likely, we must establish a valuation allowance. We also establish reserves to reduce some or all of the tax benefit of any of our tax positions at the time we determine that the positions become uncertain. We adjust these reserves, including any impact on the related interest and penalties, in light of changing facts and circumstances, such as the progress of a tax audit. A number of years may elapse before a particular matter for which we have established a reserve is audited by a taxing authority and finally resolved. The number of years with open tax audits varies depending on the tax jurisdiction. A tax benefit that has been previously reserved because of a failure to meet the \"more likely than not\" recognition threshold would be recognized in our income tax expense in the first interim period when the uncertainty disappears. Settlement of any particular issue would usually require the use of cash.\n​\n​\n49\n\n\nTable of Contents",
  "item2": null
}