{
  "source_file": "stz-20250228.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nTable of Contents\nItem 1. Business\nIntroduction\nWe are an international producer and marketer of beer, wine, and spirits with operations in the U.S., Mexico, New Zealand, and Italy with powerful, consumer-connected, high-quality brands like Modelo Especial, Corona Extra, Pacifico, Robert Mondavi Winery, Kim Crawford, The Prisoner Wine Company, High West, Casa Noble, and Mi CAMPO. In the U.S., we are one of the top growth contributors at retail among beverage alcohol suppliers. We are also the second-largest beer company and have the #1 beer brand, Modelo Especial, in dollar sales in the U.S. We continued to strengthen our leadership position in the U.S. beer market as the #1 share gainer in the high-end beer segment and the overall U.S. beer market. Within wine and spirits, we have implemented a multi-year strategy to reposition this business to a portfolio of exclusively higher-end brands that we believe will generate higher growth and higher margins, aligned to our focus on consumer-led premiumization trends, and we continue to progressively expand our supply channels through DTC and international markets. The strength of our brands makes us a supplier of choice to many of our consumers and our customers, which include wholesale distributors, retailers, and on-premise locations. We conduct our business through entities we wholly own as well as through a variety of joint ventures and other entities.\nOur mission is to build brands that people love because we believe elevating human connections is Worth Reaching For. It is worth our dedication, hard work, and calculated risks to anticipate market trends and deliver more for our consumers, stockholders, employees, and industry. This dedication is what has driven us to become one of the fastest-growing, large CPG companies in the U.S. at retail.\nHeadquartered in Rochester, New York, we are a Delaware corporation incorporated in 1972, as the successor to a business founded in 1945.\nStrategy\nOur overall strategic vision is to consistently deliver industry-leading total stockholder returns over the long-term through a focus on these key pillars:\n•\ncontinue building strong brands people love with advantaged routes to market;\n•\nbuild a culture that is consumer-obsessed and leverages robust innovation capabilities to stay on the forefront of consumer trends;\n•\ndeploy capital in line with disciplined and balanced priorities;\n•\ndeliver on impactful ESG initiatives that we believe are not only good business, but also good for the world; and\n•\nempower the whole enterprise to achieve best-in-class operational efficiency.\nWe will continue to strive for success by ensuring consumer-led decision making drives all aspects of our business; building a strong talent pipeline with best-in-class people development; investing in infrastructure that supports and enables our business, including data systems and architecture; and exemplifying intentional and proactive fiscal management. We place focus on positioning our portfolio on higher-margin, higher-growth categories of the beverage alcohol industry to align with our strategy to address consumer-led premiumization, product, and purchasing trends, which we anticipate will continue to drive faster relative growth rates across beer, wine, and spirits. To continue capitalizing on consumer-led premiumization trends, become more competitive, and grow our business, we have employed a strategy dedicated to organic growth and supplemented by targeted investments and acquisitions. We intend for our multi-year Digital Business Acceleration initiative to enable us to drive results by enhancing our technology capabilities in key areas. In Fiscal 2025, we focused on end-to-end digital supply chain planning, logistics, procurement, and revenue growth management. In Fiscal 2026, we plan to expand this initiative to include consumer insights and analytics. We believe our continued focus on maintaining a strong balance sheet provides a solid financial foundation to support our broader strategic initiatives. As a result of this strategy, we have realized impacts on each segment of our business.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    1\nPART I\nITEM 1. BUSINESS\nTable of Contents\nIn our beer business, we focus on upholding our leadership position in the U.S. beer market, including the high-end segment, and continuing to grow our high-end imported beer brands through maintenance of leading margins, enhancements to our results of operations and operating cash flow, and exploring new avenues for growth. In Fiscal 2026, we intend to increase distribution for key brands, optimize growth through differentiated brand positioning, price pack architecture, and market prioritization, as well as continue to invest in the next phase of modular capacity additions necessary to support our ongoing growth. We remain focused on consumer-led innovation by creating new line extensions behind celebrated, trusted brands and package formats, as well as new to world brands, that are intended to meet emerging needs.\nIn our wine and spirits business, we continue to focus on delivering growth and improving margins beyond Fiscal 2026 by driving our higher-end brands and operating efficiencies. We have reshaped our portfolio through a series of strategic acquisitions and divestitures to drive our enhanced (and following the anticipated completion of the 2025 Wine Divestitures Transaction, exclusive) focus on higher-end wine and spirits brands that we believe will generate higher growth and higher margins, aligned with our strategy to address consumer-led premiumization trends and meet the evolving needs of our consumers. We remain a key supplier in U.S. 3-tier brick-and-mortar distribution. In addition, we are advancing our aim to become a global, omni-channel competitor in line with consumer preferences as we continue our efforts to progressively expand into DTC channels (including hospitality), 3-tier eCommerce, and international markets.\nFor further information on our strategy, including factors that could impact our future results of operations and/or financial condition, see “Overview” within MD&A.\nDivestitures, acquisitions, and investments\nIn connection with executing our strategy as outlined above, during Fiscal 2025 we completed the following transactions:\nDate\nDescription\nBeer segment\nMexicali Brewery\nJuly\n2024\nSale of the remaining assets at the canceled brewery construction project located in Mexicali, Baja California, Mexico.\nWine and Spirits segment\nSVEDKA Divestiture\nJanuary\n2025\nDivestiture of the SVEDKA brand and related assets, primarily including inventory and equipment; supported our focus on consumer-led premiumization trends and meeting the evolving needs of consumers.\nNelson’s Green Brier investment\nOctober\n2024\nPurchase of the remaining 25% noncontrolling interest of Tennessee-based craft bourbon and whiskey products; supported our focus on consumer-led premiumization trends and meeting the evolving needs of consumers.\nSea Smoke acquisition\nJune\n2024\nAcquisition of a luxury wine brand and vineyards; supported our focus on consumer-led premiumization trends and meeting the evolving needs of consumers.\nCorporate Operations and Other segment\nCanopy Exchangeable Shares\nApril\n2024\nWe elected to convert our Canopy common shares into and exchange, in part, our 2023 Canopy Promissory Note for Exchangeable Shares.\nFor further information about our significant Fiscal 2025, Fiscal 2024, and Fiscal 2023 transactions, refer to (i) “Overview” within MD&A and (ii) Note 2.\nBusiness segments\nWe report our operating results in \nthree\n segments: (i) Beer, (ii) Wine and Spirits, and (iii) Corporate Operations and Other. The business segments reflect how our operations are managed, how resources are \nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    2\nPART I\nITEM 1. BUSINESS\nTable of Contents\nallocated, how operating performance is evaluated by senior management, and the structure of our internal financial reporting.\nWe report net sales in two reportable segments, as follows:\nFor the Years Ended\nFebruary 28,\n2025\nFebruary 29,\n2024\n(in millions)\nBeer\n$\n8,539.8 \n$\n8,162.6 \nWine and Spirits:\nWine\n1,450.1 \n1,552.1 \nSpirits\n218.8 \n247.1 \nTotal Wine and Spirits\n1,668.9 \n1,799.2 \nConsolidated Net Sales\n$\n10,208.7 \n$\n9,961.8 \nBeer segment\nWe are the #1 brewer and seller of imported beer in the U.S. market. We are also the leader in the high-end segment of the U.S. beer market, which includes the imported and ABA categories. We have the exclusive right to import, market, and sell our Mexican beer brands in all 50 states of the U.S., which include the following:\nModelo Brand Family\nCorona Brand Family\nPacifico\nBrand\nVictoria\nBrand Family\nModelo Especial\nModelo Oro\nCorona Extra\nCorona Non-Alcoholic\nPacifico\nVictoria\nModelo Chelada\nModelo Spiked Aguas Frescas\nCorona Familiar\nCorona Premier\nVicky Chamoy\nModelo Negra\nCorona Light\nCorona Sunbrew\nNotable achievements in the U.S. include the following: (i) we had 5 of the top 15 share gaining brands across the total beer category, (ii) Modelo Especial was the best-selling beer overall, (iii) Corona Extra was the second largest imported beer and fifth best-selling beer overall, and (iv) Pacifico and Victoria were the top two fastest growing major imported beer brands.\nDuring Fiscal 2025, we spent nearly $940 million on (i) planned expansions and execution of optimization initiatives and (ii) ongoing construction of the Veracruz Brewery. Expansion, optimization, and/or construction activities continue at our breweries in Mexico to support expected future business needs. We expect to spend approximately $2 billion over Fiscal 2026 through Fiscal 2028 largely on such activities. We believe these investments allow us the opportunity to further expand our leadership position in the high-end segment of the \nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    3\nPART I\nITEM 1. BUSINESS\nTable of Contents\nU.S. beer market. For further information about our Mexico Beer Projects, refer to (i) “Production” below, (ii) MD&A, and (iii) Note 5.\nWe are also building on the success of our leading import brand families through our innovation strategy. For example, our Modelo Chelada brands have become an important contributor to our portfolio as the leading chelada in the U.S. beer market. In Fiscal 2025, we continued to build on our successful innovation platform with the launch of new products aligned with our focus on consumer-led premiumization, betterment, and flavor trends, including: (i) two additional pack sizes of Modelo Oro, a light and lower-calorie Mexican beer, to build on its launch in Fiscal 2024, (ii) Modelo Chelada Fresa Picante, a strawberry and chile pepper michelada-style beer, (iii) Modelo Chelada Negra con Chile, our first Modelo Negra chelada flavor launched in select markets, and (iv) Corona Sunbrew, a beer brewed with real citrus peels and a splash of real citrus juice, also launched in select markets. In Fiscal 2026, we launched Corona Sunbrew nationwide.\nWine and Spirits segment\nWe are a higher-end wine and spirits company in the U.S. market, with a portfolio that we believe will generate higher growth and higher margins. Our wine portfolio is supported by grapes purchased from independent growers, primarily in the U.S. and New Zealand, and vineyard holdings in the U.S., New Zealand, and Italy. Our wine and spirits are primarily marketed in the U.S. and also sold in Australia, Canada, Italy, New Zealand, and other major world markets.\nIn the U.S., we had 6\n \nof the 100 top-selling higher-end wine brands, with Kim Crawford achieving the 10\nth\n spot \n(1)\n. Some of our well-known wine and spirits brands and portfolio of brands include:\nWine Brands \n(1)\nWine Portfolio of Brands\nSpirits Brands\nKim Crawford\nRuffino\nMy Favorite Neighbor\nAustin Cocktails\nMi CAMPO\nMount Veeder\nSea Smoke\nSchrader Cellars\nCasa Noble\nNelson’s Green Brier\nRobert Mondavi Winery\nThe Prisoner Wine Company\nHigh West\n(1)\nExcludes brands that are part of the 2025 Wine Divestitures Transaction, including Meiomi and SIMI, which each ranked in the 100 top-selling higher-end wine brands in the U.S.\nIn Fiscal 2025, the broader wine category continued to experience deceleration in both the U.S. wholesale and international markets, particularly in the lower price point segments of the category. As a result, we have been actively working to address these continued headwinds. The U.S. wholesale decline was partially offset by muted net sales growth in our international markets and DTC channel, which represented 16% of total Wine and Spirits net sales in Fiscal 2025. We continue to believe that beyond Fiscal 2026 our wine and spirits business will return to net sales growth supported by our continued efforts to better align our portfolio with our focus on broader consumer-led premiumization trends, expand our omni-channel capabilities, and extend into select international markets. In April 2025, we entered into a definitive agreement to fully divest and, in certain instances, exclusively license the trademarks of a portion of our wine and spirits business, primarily centered around our remaining mainstream wine brands and associated inventory, wineries, vineyards, offices, and facilities. For further information about this transaction, refer to “Recent Development” in MD&A and Note 2.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    4\nPART I\nITEM 1. BUSINESS\nTable of Contents\nCorporate Operations and Other segment\nThe Corporate Operations and Other segment includes traditional corporate-related items including costs of corporate communications, corporate development, corporate finance, corporate strategy and growth, executive management, human resources, internal audit, investor relations, IT, legal, and public affairs, as well as our Canopy investment and investments made through our corporate venture capital function.\nFor further information regarding net sales and operating income (loss) of our business segments and geographic areas, refer to (i) MD&A and (ii) Note 22.\nMarketing and distribution\nTo focus on their respective product categories, build brand equity, and increase sales, we employ full-time, in-house marketing, sales, and customer service functions for our (i) Beer and (ii) Wine and Spirits segments. These functions engage in a range of marketing activities and strategies, including market research, consumer and trade advertising, price promotions, point-of-sale materials, event sponsorship, on-premise activations, and public relations.\nWhen we advertise our products to consumers, we use a combination of methods to forecast the number of advertising impressions made on individuals at or above the legal drinking age. Through our media placement agencies, we leverage recognized audience measurement services such as Nielsen and ComScore to measure audience composition data on a regular and frequent basis. This data helps us to ensure that our advertising placements are purchased in media outlets and audience buying platforms (i.e., programmatic digital buys) that are primarily targeted toward legal drinking age consumers and, when appropriate, specifically targeted to audiences that are age-verified as of the legal drinking age. Our Global Code of Responsible Practices for Beverage Alcohol Advertising and Marketing provides the fundamental framework for responsible brand advertising and marketing that helps ensure our messages are directed at legal drinking age consumers. \nWe are a corporate member of Responsibility.org, a national not-for-profit that aims to empower adults to make a lifetime of responsible alcohol choices. As part of our efforts to promote responsible beverage alcohol consumption, our brand websites redirect a visitor who self-identifies as being under the legal drinking age to Responsibility.org for information on prevention of underage drinking, ending drunk driving, and drinking responsibly.\nIn the U.S., our products are primarily distributed by wholesale distributors, and we generally use separate distribution networks for (i) our beer portfolio and (ii) our wine and spirits portfolio. In addition, in states where the government acts as the distributor, we distribute our products through state alcohol beverage control agencies, which set the retail prices of our products. As is the case with all other beverage alcohol companies, products sold through these agencies are subject to obtaining and maintaining listings to sell our products in that agency’s state. State governments can also affect prices paid by consumers for our products through the imposition of taxes.\nTrademarks and distribution agreements\nTrademarks are an important aspect of our business. We sell products under a number of trademarks, which we own or use under license. We also have various licenses and distribution agreements for the sale, or the production and sale, of our products and products of others. These licenses and distribution agreements have varying terms and durations.\nWithin the Beer segment, we have an exclusive sub-license to use trademarks related to our Mexican beer brands in the U.S. This sub-license agreement is perpetual.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    5\nPART I\nITEM 1. BUSINESS\nTable of Contents\nCompetition\nThe beverage alcohol industry is highly competitive. We compete on the basis of quality, price, brand recognition and reputation, and distribution strength. Our beverage alcohol products compete with other alcoholic and non-alcoholic beverages for consumer purchases, as well as shelf space in retail stores, restaurant presence, and wholesaler attention. We compete with numerous multinational producers and distributors of beverage alcohol products, some of which have greater resources than we do. Our principal competitors include:\nBeer\nAnheuser-Busch InBev, The Boston Beer Company, Heineken, Mark Anthony, Molson Coors\nWine\nDeutsch Family Wine & Spirits, Duckhorn Portfolio, GALLO, Ste. Michelle Wine Estates, Treasury Wine Estates, Trinchero Family Estates, The Wine Group\nSpirits\nBacardi USA, Brown-Forman, Diageo, Fifth Generation, GALLO, Pernod Ricard, Sazerac Company, Suntory Global Spirits\nProduction\nAs of February 28, 2025, our production capacity at our Mexican breweries was approximately 48 million hectoliters. By the end of Fiscal 2028, we expect to increase our capacity in Mexico to approximately\n \n55 million hectoliters to support the growth of our high-end beer brands through continued expansion, optimization, and/or construction activities at our Mexican breweries. For further information on these expansion, optimization, and/or construction activities, refer to (i) MD&A and (ii) Note 5.\nIn the U.S., we currently operate 12 wineries using many varieties of grapes grown principally in the Napa, Sonoma, Monterey, and San Joaquin regions of California as well as the Willamette Valley region of Oregon. Following the anticipated completion of the 2025 Wine Divestitures Transaction, we expect to operate nine U.S. wineries. We also operate two wineries in New Zealand and five wineries in Italy. Grapes are normally harvested and crushed in August through November in the U.S. and Italy, and in February through May in New Zealand and stored as wine until packaged for sale under our brand names or sold in bulk. The inventories of wine are usually at their highest levels during and after the crush of each year’s grape harvest and are reduced as sold throughout the year. We currently operate four distilleries in the U.S. for the production of our spirits. Certain of our wines and spirits must be aged for multiple years. Therefore, our inventories of wines and spirits may be larger in relation to sales and total assets than in many other businesses.\nResources and availability of production materials\nThe principal components in the production of our Mexican beer brands include water; agricultural products, such as yeast and grains; and packaging materials, which include glass, aluminum, and cardboard.\nFor our Mexican beer brands, packaging materials are the largest cost component of production, with glass bottles representing the largest cost component of our packaging materials. We aim to reduce operational waste and enhance our use of returnable, recyclable, or renewable packaging.\nFor Fiscal 2025, the package format mix of our Mexican beer volume sold in the U.S. was as follows:\nAs part of our long-term beer glass sourcing strategy, we are a partner in an equally-owned joint venture with Owens-Illinois, one of the leading manufacturers of glass containers in the world. The joint venture owns a state-of-the-art Glass Plant adjacent to our Nava Brewery in Mexico. The Glass Plant supplies nearly 60% of the total annual glass bottle supply for our Mexican beer brands. We also have long-term glass supply agreements with other glass producers.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    6\nPART I\nITEM 1. BUSINESS\nTable of Contents\nThe current Mexican breweries each receive water originating from separate and distinct aquifers. We believe we have adequate access to water to support these breweries’ ongoing requirements, as well as future requirements after the completion of planned expansion, optimization, and/or construction activities at our breweries. These breweries employ comprehensive water management practices that focus on water efficiency and wastewater treatment operations to reuse water consumed as part of the production process.\nThe principal components in the production of our wine and spirits products are agricultural products, such as grapes and grain, and packaging materials, primarily glass.\nMost of our annual grape requirements are satisfied by grower purchases from each year’s harvest. During Fiscal 2025, we received grapes from approximately 350 independent growers located in the U.S. and 35 independent growers located in New Zealand and Italy. We enter into purchase agreements with a majority of these growers with pricing that generally varies year-to-year and is largely based on then-current market prices.\nAs of February 28, 2025, we owned or leased approximately 18,000 acres of land and vineyards, either fully bearing or under development, in the U.S., New Zealand, and Italy. This acreage supplied only a small percentage of our overall total grape needs for wine production. However, most of this acreage was used to supply a large portion of the grapes used for the production of certain of our higher-end wines. Following the anticipated completion of the 2025 Wine Divestitures Transaction, we expect to own or lease approximately 11,400 acres of land and vineyards.\nAll of our owned and leased vineyards in California routinely adhere to documented water management plans as required by Sustainable Grape Growing Certifications including the California Sustainable Winegrowing Alliance and Fish Friendly Farming. We use the guidance of these plans to identify the designated beneficial use of the water body based on grape growing goals set before the growing season that account for soil types, slopes, irrigation water availability and quality, and energy efficiency.\nWe believe that we have adequate sources of grape supplies to meet our sales expectations. However, when demand for certain wine products exceeds expectations, we look to source the extra requirements from the bulk wine markets around the world.\nThe distilled spirits manufactured and imported by us require various agricultural products, neutral grain spirits, and bulk spirits, which we fulfill through purchases from various sources by contractual arrangement and through purchases on the open market. We believe that adequate supplies of the aforementioned products are available at the present time.\nWe utilize glass and polyethylene terephthalate bottles and other materials such as caps, corks, capsules, labels, and cardboard cartons in the bottling and packaging of our wine and spirits products. After grape purchases, glass bottles are the largest component of our cost of product sold, comprising more than 95% of our package format mix of our wine and spirits portfolio volume sold for Fiscal 2025. In the U.S., the glass bottle industry is highly concentrated with only a small number of producers. We have traditionally obtained, and continue to obtain, our glass requirements from a limited number of producers under long-term supply arrangements. Currently, one producer supplies most of our glass container requirements for our U.S. operations. We have been able to satisfy our requirements with respect to the foregoing and consider our sources of supply to be adequate at this time.\nTo enhance our use of sustainable packaging, we have activated multiple projects designed to optimize material consumption, decrease packaging weights, and enable reductions in consumer waste.\nGovernment regulations\nWe are subject to a range of laws and regulations in the countries in which we operate. Where we produce products, we are subject to environmental laws and regulations, and may be required to obtain environmental and alcohol beverage permits and licenses to operate our facilities. Where we market and sell products, we may be subject to laws and regulations on brand registration, packaging, labeling, and recycling, \nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    7\nPART I\nITEM 1. BUSINESS\nTable of Contents\ndistribution methods and relationships, pricing and price changes, sales promotions, advertising, and public relations. The countries in which we operate impose duties, excise taxes, and other taxes on beverage alcohol products, and on certain raw materials used to produce our beverage alcohol products, in varying amounts. We are also subject to rules and regulations relating to changes in officers or directors, ownership, or control.\nWe believe we are in compliance in all material respects with all applicable governmental laws and regulations in the countries in which we operate. We also believe that the cost of administration and compliance with, and liability under, such laws and regulations does not have, and is not expected to have, a material adverse impact on our financial condition, results of operations, and/or cash flows.\nSeasonality\nThe beverage alcohol industry is subject to seasonality in each major category. As a result, in response to wholesaler and retailer demand which precedes consumer purchases, our beer sales have historically been highest during the first and second quarters of our fiscal year, which correspond to the Spring and Summer periods in the U.S. Our wine and spirits sales have generally been highest during the third quarter of our fiscal year, primarily due to seasonal holiday buying.\nEnvironmental sustainability and CSR\nWe believe our environmental sustainability and CSR strategies and aspirations enable us to better create and protect value for our business in support of our longer-term business strategy, reflect our Company values, and help address needs that are important to our stockholders, communities, consumers, and employees. We focus on: (i) serving as good stewards of our environment, (ii) investing in our communities, and (iii) promoting responsible beverage alcohol consumption.\nAs part of our brewery expansion efforts and commitment to making a positive impact on the communities where we operate, we plan to continue working with local authorities and community-based organizations on sustainability initiatives that benefit local residents. Critical local projects are identified through community collaboration and input and guidance from third-party water restoration organizations. This is in addition to other benefits we provide, including local job creation and fueling economic development.\nHuman capital resources\nAs of February 28, 2025, we had approximately 10,600 employees, including approximately 1,300 employees through our equally-owned joint venture with Owens-Illinois. The number of employees will change throughout the year, such as when we employ additional workers during the grape crushing seasons, and due to anticipated reductions in connection with the 2025 Wine Divestitures Transaction and the 2025 Restructuring Initiative within Fiscal 2026.\nEmployee geographic data is as follows:\nApproximately 20% of the employees are covered by collective bargaining agreements. Collective bargaining agreements expiring within one year are minimal. We consider our employee relations generally to be good.\nWorkforce inclusive culture\nTo achieve our mission of building brands that people love, we believe it is essential to cultivate a workforce that reflects the consumers and communities we serve. We also believe that building an inclusive culture where all employees can come together and develop strong relationships rooted in mutual understanding, respect, and trust is important to developing a high-performing team, winning with an evolving consumer base, and achieving our strategic ambitions.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    8\nPART I\nITEM 1. BUSINESS\nTable of Contents\nCompensation and benefits\nWe strive to provide pay, benefits, and services that meet the needs of our employees. The main components of compensation are: (i) base pay, (ii) long-term incentives dependent on a number of factors such as geographic location, market prevalence, and level which can include restricted stock units, stock options, and performance share units, (iii) short-term incentives, and (iv) recognition awards. Base and incentive compensation is reviewed on an annual basis, seeking to ensure it is competitive in the market and giving employees opportunities to earn more for exceeding expectations. Our total rewards program also offers valuable benefits, tools, and resources designed to help employees stay healthy and well, while achieving security, growth, satisfaction, and success.\nProfessional development\nBuilding strong talent pipelines, delivering best-in-class people development, and championing professional advancement are key components of our human capital strategy which is designed to position our business for long-term growth. We are committed to offering programs, resources, and experiences that empower employees to grow their careers. The University of Constellation Brands, our learning and development center, allows employees to find opportunities to grow, develop, gain new skills and insights, explore, and expand interests through regularly updated curricula. In Fiscal 2025, we (i) spent over $17 million in development and training costs, including the delivery of six executive, leadership, and other development programs as well as\n \nleadership coaching workshops for nearly 350 of our people leaders and (ii) produced approximately 400 matched relationships under our formal career development mentoring program.\nSuccession planning\nWe have a comprehensive succession planning process, led by our human resources team and overseen by the Human Resources Committee of our Board of Directors. In addition to the Human Resources Committee’s enhanced focus on executive, senior leader, and high-potential employee succession, our full Board of Directors is also involved in Chief Executive Officer succession planning as well as succession and people development for the broader employee population. As part of the succession planning process, we review and discuss potential successors to key roles and examine backgrounds, capabilities, and appropriate developmental opportunities.\nEmployee engagement\nWe assess employee engagement through global engagement and targeted pulse surveys, which provide feedback on a variety of topics, such as belonging, teamwork, recognition, enablement, and well-being. During Fiscal 2025, we conducted a company-wide global culture and engagement survey where we had a response rate of 83% and a favorable engagement measurement of 86% across our surveyed population.\nSafety\nWe are committed to ensuring the safety of our employees. Our global EHS policy describes our dedication to providing a safe and healthy working environment and developing and maintaining a culture where all employees take responsibility for their own safety as well as the safety of others while minimizing our impact on the environment in the communities where we live and work. With a focus on continuous improvement, we are developing more robust EHS management systems, strengthening employee awareness and training, and ensuring senior leadership engagement on safety. Work-related injuries resulting from the production of our beer, wine, and spirits products are well below industry average. Our recordable incident rate as compared to the industry average is as follows:\nThe recordable incident rate is defined as total number of worldwide CBI work-related injuries (cases beyond first aid) per 100 full-time employees. The industry average is calculated by taking the weighted average of the most recent (2022) U.S. Bureau of Labor Statistics data for wineries, breweries, and distilleries based on our portfolio mix in February 2025, February 2024, and February 2023 for the years ended February 28, 2025, February 29, 2024, and February 28, 2023, respectively.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    9\nPART I\nITEM 1. BUSINESS\nTable of Contents\nEmpowering our employees to give back\nGiving back to our communities is a value instilled by our founder, Marvin Sands, and remains core to our Company’s DNA. We empower our employees to engage in the communities where they live and work in a variety of ways, including volunteering time and through a charitable matching program available to all U.S. employees.\nWe match donations ranging from a maximum of $5,000 to $50,000 per year, depending on employee level, to charitable organizations.\n$8.0 million\nFiscal 2025 corporate charitable contributions, including Company match of employee donations\nInformation about our Executive Officers\nExecutive officers of the Company are generally chosen or elected to their positions annually and hold office until the earlier of their removal or resignation or until their successors are chosen and qualified. Information with respect to our executive officers as of April 23, 2025, is as follows:\nWilliam A. Newlands\nAge 66\nPresident and Chief Executive Officer\nMr. Newlands has served as Chief Executive Officer of the Company and as a director since March 2019 and as President since February 2018. He served as Chief Operating Officer from January 2017 through February 2019 and as Executive Vice President from January 2015 until February 2018. From January 2016 to January 2017 he performed the role of President, Wine and Spirits Division and from January 2015 through January 2016 he performed the role of Chief Growth Officer. Mr. Newlands joined the Company in January 2015. Prior to that he served from October 2011 until August 2014 as Senior Vice President and President, North America of Beam Inc.; as Senior Vice President and President, North America of Beam Global Spirits & Wine, Inc. from December 2010 to October 2011; and as Senior Vice President and President, USA of Beam Global Spirits & Wine, Inc. from February 2008 to December 2010. Beam Inc., a producer and seller of branded distilled spirits products, merged with a subsidiary of Suntory Holding Limited, a Japanese company, in 2014. Prior to October 2011, Beam Global Spirits & Wine, Inc. was the spirits operating segment of Fortune Brands, Inc., which was a leading consumer products company that made and sold branded consumer products worldwide in the distilled spirits, home and security, and golf markets.\nJames O. Bourdeau\nAge 60\nExecutive Vice President and Chief Legal Officer\nMr. Bourdeau is the\n \nExecutive Vice President and Chief Legal Officer of the Company, having served in the role since December 2017 and as the Company’s Secretary since April 2017. Prior to that he served as the Company’s Senior Vice President and General Counsel, Corporate Development from September 2014 until December 2017. Before joining the Company, Mr. Bourdeau was an attorney with the law firm of Nixon Peabody LLP from July 2000 through September 2014, and a partner from February 2005 through September 2014. Mr. Bourdeau was associated with another law firm from 1995 to 2000.\nPaula K. Erickson\nAge 56\nExecutive Vice President and Chief Human Resources Officer\nMs. Erickson is the Executive Vice President and Chief Human Resources Officer of the Company, having served in the role since April 2025. Before joining the Company, Ms. Erickson served as Senior Vice President, Chief People, Culture, and Communications Officer with Beam Suntory Inc. (now known as Suntory Global Spirits) from January 2023 until April 2024; as Senior Vice President, Chief Human Resources Officer from November 2014 until December 2022; and as Vice President, Global Communications and Public Relations from 2008 until November 2014. Prior to that, she worked for Ace Hardware Corporation from 1991 to 2008 in various leadership positions across advertising, brand development, communications, and public relations.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    10\nPART I\nITEM 1. BUSINESS\nTable of Contents\nSamuel Glaetzer\nAge 50\nExecutive Vice President and President, Wine and Spirits Division\nMr. Glaetzer is the Executive Vice President and President, Wine and Spirits Division of the Company, having served in the role since\n \nMarch 2024. Prior to that he served as the Company’s Senior Vice President, Global Operations and International Sales for the Wine and Spirits Division from March 2021 until March 2024; Senior Vice President, Global Operations, Wine and Spirits from September 2018 until March 2021; Senior Vice President, Production, Wine and Spirits from May 2016 until September 2018; and President and Managing Director, New Zealand and Australia from March 2014 until May 2016. Before joining the Company, Mr. Glaetzer served in roles of increasing responsibility with Treasury Wine Estates and its predecessors from 1996 until 2014.\nGarth Hankinson\nAge 57\nExecutive Vice President and Chief Financial Officer\nMr. Hankinson is the Executive Vice President and Chief Financial Officer of the Company, having served in the role since January 2020. Prior to that he served as the Company’s Senior Vice President, Corporate Development from February 2016 until January 2020; Vice President, Corporate Development from October 2009 until February 2016; Vice President, Business Development for Constellation’s prior Canadian business from October 2007 until October 2009; and Director of Corporate Development from March 2004 until October 2007.\nMichael McGrew\nAge 51\nExecutive Vice President, Chief Communications, CSR, and Inclusion Officer\nMr. McGrew is the Executive Vice President, Chief Communications, CSR, and Inclusion Officer of the Company. He has been an Executive Vice President of the Company since April 2020 when he was promoted to Executive Vice President, Chief Communications and CSR Officer. Mr. McGrew also served as Chief Strategy Officer from December 2023 to October 2024 in addition to his other roles. He joined Constellation in September 2014 as Senior Director, Communications – Beer Division and held a number of progressive leadership roles within the Company prior to becoming an Executive Vice President. Before joining the Company, he held a number of roles with increasing responsibility at Grainger, then a $9 billion global provider of industrial supplies and equipment. While at Grainger, from 2011 to 2013 Mr. McGrew served as Director, U.S. Business Communications; from January 2013 to October 2013 he served as Senior Director, U.S. Business & Global Supply Chain Communications; and from October 2013 to September 2014 he served as Senior Director, Communications – Americas, among other roles.\nMallika Monteiro\nAge 46\nExecutive Vice President, Managing Director, Beer Brands and Interim Chief Growth and Strategy Officer\nMs. Monteiro is the Executive Vice President, Managing Director, Beer Brands and Interim Chief Growth and Strategy Officer of the Company, having served in the roles since October 2024 and March 2025 (with respect to her Interim role). Prior to that she served as the Company’s Executive Vice President, Chief Growth and Digital Officer and Managing Director, Beer Brands from December 2023 to October 2024; Executive Vice President, Chief Growth, Strategy, and Digital Officer from March 2021 to November 2023; Executive Vice President, Chief Growth and Strategy Officer from October 2019 to February 2021; and Senior Vice President, Chief Growth Officer from October 2018 to September 2019. She joined Constellation in October 2016 as Vice President, Beer Innovation and was given additional responsibilities as Chief of Staff to the Company’s Executive Management Committee in July 2018. Before joining the Company, from July 2014 to September 2016, Ms. Monteiro was a Senior Marketing Director at Anheuser Busch InBev. Prior to joining Anheuser Busch InBev, she served in roles of increasing responsibility with Beam Suntory Inc., including as Associate Brand Manager – Jim Beam from July 2007 to June 2009, Brand Manager – Cognac from July 2009 to December 2011, and Senior Brand Manager – Vodka from January 2012 to June 2014.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    11\nPART I\nITEM 1. BUSINESS\nTable of Contents\nJames A. Sabia, Jr.\nAge 63\nExecutive Vice President and President, Beer Division\nMr. Sabia is the Executive Vice President and President, Beer Division of the Company, having served in the roles since January 2022 and February 2022, respectively. Prior to that he served as Executive Vice President, Managing Director, Beer Division from March 2021 until January 2022; Executive Vice President, Chief Marketing Officer from May 2018 until March 2021; Chief Marketing Officer of the Company’s Beer Division from 2009 until May 2018; and Vice President, Marketing of the Company’s spirits business from 2007 until 2009. Before joining the Company, Mr. Sabia was with Molson Coors Brewing Company for 17 years.\nCompany Information\nOur website is https://www.cbrands.com, and our investor relations website is https://ir.cbrands.com. Our filings with the SEC, including our Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports, filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act, are accessible free of charge on our investor relations website as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. The SEC maintains a website, https://www.sec.gov, that contains reports, proxy and information statements, and other information regarding issuers, such as ourselves, that file electronically with the SEC.\nOur Chief Executive Officer and Senior Financial Executive Code of Ethics specifically applies to our chief executive officer, our principal financial officer, and our controller, and is available on our investor relations website. This Chief Executive Officer and Senior Financial Executive Code of Ethics meets the requirements as set forth in the Exchange Act, Item 406 of Regulation S-K. Our Code of Business Conduct and Ethics applies to all employees, directors, and officers, including each person who is subject to the Chief Executive Officer and Senior Financial Executive Code of Ethics. The Code of Business Conduct and Ethics, together with our Global Code of Responsible Practices for Beverage Alcohol Advertising and Marketing, is available on our website under “Our Policies.” Copies of these materials are available in print to any stockholder who requests them. Stockholders should direct such requests in writing to Investor Relations Department, Constellation Brands, Inc., 50 East Broad Street, Rochester, New York 14614, or by telephoning our Investor Center at 1-888-922-2150.\nOur Board of Directors Corporate Governance Guidelines and the Charters of the Board’s Audit Committee, Human Resources Committee (which serves as the Board’s compensation committee), and Corporate Governance, Nominating, and Responsibility Committee are accessible on our investor relations website. Amendments to, and waivers granted to our directors and executive officers under, our codes of ethics, if any, will be posted in this area of our investor relations website.\nThe information regarding our websites and their content is for your convenience only. The content of our websites is not deemed to be incorporated by reference in this Form 10-K or filed with the SEC.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    12\nPART I",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nIntroduction\nWe have elected to omit discussion on the earliest of the three years covered by the consolidated financial statements presented. Refer to Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and “Liquidity and Capital Resources” located in our Form 10-K for the fiscal year ended February 29, 2024, filed on April 23, 2024, for reference to discussion of the fiscal year ended February 28, 2023, the earliest of the three fiscal years presented. This MD&A, which should be read in conjunction with our Financial Statements, is organized as follows:\nOverview.\n    This section provides a general description of our business and brief descriptions of recent goodwill and trademarks impairments, which we believe is important in understanding the results of our operations, financial condition, and potential future trends.\nStrategy\n.\n    This section provides a description of our strategy and a discussion of a recent development, and significant divestitures, acquisitions, and investments.\nResults of operations.\n    This section provides an analysis of our results of operations presented on a business segment basis. In addition, a brief description of significant transactions and other items that affect the comparability of the results is provided.\nLiquidity and capital resources.\n    This section provides an analysis of our cash flows, outstanding debt, liquidity position, and commitments. Included in the analysis of outstanding debt is a discussion of the financial capacity available to fund our on-going operations and future commitments, as well as a discussion of other financing arrangements.\nCritical accounting policies and estimates.\n    This section identifies accounting policies that are considered important to our results of operations and financial condition, require significant judgment, and involve significant management estimates. Our significant accounting policies, including those considered to be critical accounting policies, are summarized in Note 1.\nOverview\nOur internal management financial reporting consists of two\n business divisions: (i) Beer and (ii) Wine and Spirits and \nwe report our operating results in three\n segments: (i)\n \nBeer, (ii)\n \nWine and Spirits, and (iii) Corporate Operations and Other. \nIn the Beer segment, our portfolio consists of high-end imported beer brands and ABAs. We have an exclusive perpetual brand license to produce our Mexican beer portfolio and to import, market, and sell such portfolio in the U.S. In the Wine and Spirits segment, \nwe sell a portfolio that includes higher-end wine brands \ncomplemented by certain higher-end spirits brands. Amounts included in the Corporate Operations and Other segment consist of costs of corporate communications, corporate development, corporate finance, corporate strategy \nand growth\n, executive management, human resources, internal audit, investor relations, IT, legal, and public affairs, \nas well as our Canopy investment and investments made through our corporate venture capital function\n. All costs included in the Corporate Operations and Other segment are general costs that are applicable to the consolidated group and are, therefore, not allocated to the other reportable segments. All costs reported within the Corporate Operations and Other segment are not included in our CODM’s evaluation of the operating income (loss) performance of the other reportable segments. \nThe business segments reflect how our operations are managed, how resources are allocated, how operating performance is evaluated by senior management, and the structure of our internal financial reporting.\nGoodwill impairment\nIn connection with continued negative trends within our Wine and Spirits business primarily attributable to our U.S. wholesale market, driven by declines in both the overall wine market and in our mainstream and premium wine brands, management updated its Fiscal 2025 outlook and latest financial projections for this reporting unit. Based on the aforementioned factors, we performed an interim quantitative assessment, as of August 31, 2024, and an annual quantitative assessment for goodwill impairment which resulted in a $2,740.7 \nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    32\nPART II\nITEM 7. MD&A\nTable of Contents\nmillion total goodwill impairment and the carrying value being written down to zero. This loss from impairment was included in goodwill and intangible assets impairment within our consolidated results for Fiscal 2025. See Notes 7, 8, and 13 for further discussion.\nTrademarks impairment\nIn connection with the assessment of the same events and circumstances that resulted in the wine and spirits goodwill carrying value being written down to zero, we completed a quantitative assessment of our wine trademarks. As a result, we recognized a $57.0 million trademark impairment on certain held for sale wine brands. This loss was included in goodwill and intangible assets impairment within our consolidated results of operations for Fiscal 2025. See Note 7 for further discussion.\nStrategy\nOur business strategy for the Beer segment focuses on upholding our leadership position in the U.S. beer market, including the high-end segment, and continuing to grow our high-end imported beer brands through maintenance of leading margins, enhancements to our results of operations and operating cash flow, and exploring new avenues for growth. In Fiscal 2026, we intend to increase distribution for key brands, optimize growth through differentiated brand positioning, price pack architecture, and market prioritization, as well as continue to invest in the next phase of modular capacity additions necessary to support our ongoing growth. Expansion, optimization, and/or construction activities continue under our Mexico Beer Projects to align with our anticipated future growth expectations, and we expect to spend approximately $2 billion over Fiscal 2026 through Fiscal 2028 largely on these activities. See “Capital Expenditures” below. Additionally, we continue to focus on consumer-led innovation by creating new line extensions behind celebrated, trusted brands and package formats, as well as new to world brands, that are intended to meet emerging needs.\nOur business strategy for the Wine and Spirits segment continues to focus on delivering growth and improving margins beyond Fiscal 2026 by driving our higher-end brands and operating efficiencies. We are repositioning this business to a portfolio of exclusively higher-end wine and spirits brands that we believe will generate higher growth and higher margins, including through the recently announced 2025 Wine Divestitures Transaction. We remain a key supplier in U.S. 3-tier brick-and-mortar distribution. In addition, we are advancing our aim to become a global, omni-channel competitor in line with evolving consumer preferences as we continue our efforts to progressively expand into international markets, DTC channels (including hospitality), and 3-tier eCommerce. We have a contractual arrangement with Southern Glazer’s Wine and Spirits which consolidated our U.S. distribution and currently represents approximately 60% of our U.S. branded wine and spirits volume.\nMarketing, sales, and distribution of our products are primarily managed on a geographic basis allowing us to leverage leading market positions. In addition, market dynamics and consumer trends vary across each of our markets. Within our primary market in the U.S., we offer a range of beverage alcohol products across the imported beer, ABA, and branded wine and spirits categories, with generally separate distribution networks utilized for (i)\n \nour beer portfolio and (ii)\n \nour wine and spirits portfolio. The environment for our products is competitive in each of our markets.\nWe remain committed to our long-term financial model of: growing sales, expanding margins, and increasing cash flow in order to continue to achieve comparable earnings per share growth as well as our target ratios for (i) comparable net leverage and (ii) dividend payout; investing to support the growth of our business; and delivering additional returns to stockholders through periodic share repurchases. Our results of operations and financial condition have been affected by an evolving consumer demand environment largely driven by what we believe to be non-structural socioeconomic factors. These factors include subdued spend, value-seeking behaviors, and reductions in the discretionary income available to purchase our products among consumers, elevated unemployment, changing prices, inflation, other unfavorable global and regional economic conditions, demographic trends in the U.S., global supply chain disruptions and constraints, and geopolitical events, as well as retailer destocking impacting our Wine and Spirits segment.\nRecent developments in international trade relations, including significant changes in U.S. trade policy and actions which include threatened, new, and increased tariffs on other countries and retaliatory tariffs and actions \nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    33\nPART II\nITEM 7. MD&A\nTable of Contents\nimposed on certain U.S. goods have produced heightened uncertainty with respect to trade and tariff policies and regulations affecting trade between the U.S. and other countries, which could continue to alter the global trade environment. For example, the U.S. government has imposed tariffs on product imports from certain countries (such as Mexico, the European Union including Italy, and New Zealand) and certain other countries have implemented tariffs on U.S. goods, such as the tariffs on certain product imports originating from the U.S. imposed by the Canadian government, although some of these tariffs were subsequently modified or delayed.\nWe expect some or all of these market conditions and their impacts to continue into Fiscal 2026 which could have a material impact on our results of operations and financial condition. We intend to continue to monitor the evolving consumer demand and economic environments and their impacts on our business. In addition, we have implemented the 2025 Restructuring Initiative, which is an enterprise-wide cost savings and restructuring initiative designed to help optimize the performance of our business, including through enhanced organizational efficiency and optimized expenditures across our organization. We also intend to continue our commodity and foreign exchange hedging programs. However, there can be no assurance that we will be able to adequately respond to softer consumer demand trends or fully mitigate rising costs, including as a result of new or increased tariffs, through increased selling prices, cost savings, productivity, efficiency, and inventory management initiatives, optimized marketing plans, and/or our commodity and foreign exchange hedging programs. Furthermore, to the extent severe weather events that impact our business, such as wildfires, droughts, floods, extreme heat, and/or late frosts, or other weather conditions that constrain purchasing occasions for our consumers, continue to occur or accelerate in future periods, it could have a material impact on our results of operations and financial condition.\nRecent Development\n2025 Wine Divestitures Transaction\nIn April 2025, we entered into a definitive agreement to fully divest and, in certain instances, exclusively license the trademarks of a portion of our wine and spirits business, primarily centered around our remaining mainstream wine brands and associated inventory, wineries, vineyards, offices, and facilities for $900 million, subject to certain adjustments. The 2025 Wine Divestitures Transaction is subject to the satisfaction of certain closing conditions, including receipt of required regulatory approval, and is expected to close immediately following the end of our first quarter of Fiscal 2026. We expect to use the net cash proceeds from the 2025 Wine Divestitures Transaction for general corporate purposes. This transaction supports our strategic focus on consumer-led premiumization trends and meeting the evolving needs of our consumers.\nThe 2025 Wine Divestitures Transaction largely resulted in both (i) $879.8 million of wine and spirits net assets being reclassified to held for sale as of February 28, 2025, and (ii) a $478.0 million assets held for sale impairment. The impairment loss was included in assets held for sale impairment within our consolidated results of operations for Fiscal 2025.\nFor additional information on this transaction, refer to Note 2.\nSelected financial information included in our results of operations for the portion of the Wine and Spirits business that we expect will no longer be part of our consolidated results is as follows:\nNet Sales\nGross Profit\nMarketing \n(1)\n(in millions)\nFiscal 2025\n2025 Wine Divestitures Transaction\n$\n796.6 \n$\n317.5 \n$\n48.2 \nSVEDKA Divestiture\n$\n98.3 \n$\n39.3 \n$\n4.4 \n(1)\nIncluded in selling, general, and administrative expenses within our consolidated results of operations.\n2025 Restructuring Initiative\nWe have implemented the 2025 Restructuring Initiative which is expected to yield over $200 million in net annualized cost savings by Fiscal 2028. The majority of the work associated with the 2025 Restructuring Initiative is \nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    34\nPART II\nITEM 7. MD&A\nTable of Contents\nexpected to be completed within Fiscal 2026 and is estimated to result in $80 million to $100 million of cumulative pre-tax costs once all phases are fully implemented. In connection with the 2025 Restructuring Initiative, we recognized $46.9 million of pre-tax employee termination costs and $2.8 million of pre-tax consulting services costs in Fiscal 2025 and we anticipate incurring an additional approximately $40 million of pre-tax consulting services, employee termination, and other costs during Fiscal 2026. The Fiscal 2025 costs were included in selling, general, and administrative costs within our consolidated results. For additional information on the 2025 Restructuring Initiative, see Note 2.\nDivestitures, Acquisitions, and Investments\nBeer segment\nMexicali Brewery sale\nIn July 2024, we sold the remaining assets classified as held for sale at the canceled Mexicali Brewery.\nCraft Beer Divestitures\nIn June 2023, we completed the Craft Beer Divestitures. Accordingly, our consolidated results of operations include the results of operations of such craft beer brands through the dates of these divestitures. The Craft Beer Divestitures are consistent with our strategic focus on continuing to grow our high-end imported beer brands through maintenance of leading margins and enhancements to our results of operations.\nDaleville Facility sale\nIn May 2023, we sold the Daleville Facility in connection with our decision to exit the craft beer business.\nWine and Spirits segment\nSVEDKA Divestiture\nOn January 6, 2025, we sold the SVEDKA brand and related assets, primarily including inventory and equipment. We received $409.2 million of cash proceeds, subject to certain post-closing adjustments, which were used for general corporate purposes, including funding share repurchases, capital expenditures, and repayment of debt. Prior to the completion of the SVEDKA Divestiture, we recorded the results of operations of the SVEDKA brand in the Wine and Spirits segment. For Fiscal 2025, we recognized a $266.0 million net gain in connection with this divestiture which was included in gain (loss) on sale of business within our consolidated results.\nNelson’s Green Brier investment\nIn October 2024, we purchased the remaining 25% noncontrolling interest in Nelson’s Green Brier, a portfolio of Tennessee-based craft bourbon and whiskey products.\nSea Smoke acquisition\nIn June 2024, we acquired the Sea Smoke business, including a California-based luxury wine brand, vineyards, and a production facility. This transaction also included the acquisition of goodwill, inventory, and a trademark. The results of operations of Sea Smoke are reported in the Wine and Spirits segment and have been included in our consolidated results of operations from the date of acquisition.\nThese Wine and Spirits segment activities support our strategic focus on consumer-led premiumization trends and meeting the evolving needs of our consumers.\nCorporate Operations and Other segment\nCorporate ventures investments\nAs of February 28, 2025, August 31, 2024, November 30, 2023, and August 31, 2023, we evaluated certain equity method investments and other securities measured at fair value, made through our corporate venture capital function, and determined there were other-than-temporary impairments due to business underperformance for the respective periods. These losses from impairment and on securities measured at fair value were included in income (loss) from unconsolidated investments within our consolidated results for the respective periods. In October 2023, we exited one of these equity method investments in exchange for a note receivable.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    35\nPART II\nITEM 7. MD&A\nTable of Contents\nCanopy investment\nWe have an investment in Canopy, a North American cannabis and CPG company providing medical and adult-use cannabis products, which provides us an investment interest in a business in adjacent categories.\nExchangeable Shares —\nIn April 2024, we elected to convert our 17.1 million Canopy common shares into Exchangeable Shares on a one-for-one basis. Additionally, in April 2024, we exchanged C$81.2 million of the principal amount of our 2023 Canopy Promissory Note for 9.1 million Exchangeable Shares and forgave all accrued but unpaid interest together with the remaining principal amount of the note. As a result of these transactions, we (i) have 26.3 million Exchangeable Shares and (ii) recognized an $83.3 million net gain based on the fair value of Exchangeable Shares on the date of the conversion and exchange for Fiscal 2025.\nAdditionally, as of November 30, 2024, we evaluated the Exchangeable Shares for impairment primarily due to the business and industry factors that led to the decline in Canopy’s common share price since the date of conversion and exchange. We concluded that an impairment did exist and wrote down the Exchangeable Shares to their estimated fair value. Due to the continued decline in Canopy’s common share price, as of February 28, 2025, we evaluated the Exchangeable Shares for an additional impairment. We concluded an impairment did exist, and accordingly, the Exchangeable Shares were written down to their estimated fair value, resulting in a $76.1 million total impairment for Fiscal 2025.\nThe Exchangeable Share activity for Fiscal 2025 resulted in a total net gain of $7.2 million which was included in income (loss) from unconsolidated investments within our consolidated results.\nCanopy Equity Method Investment —\nWe evaluated our then-existing Canopy Equity Method Investment as of May 31, 2023, and determined there was an other-than-temporary impairment. Our conclusion was based on several contributing factors, including: (i) the fair value being less than the carrying value and the uncertainty surrounding Canopy’s stock price recovering in the near-term, (ii) Canopy recorded significant costs in its fourth quarter of fiscal 2023 results designed to align its Canadian cannabis operations and resources in response to continued unfavorable market trends, (iii) the substantial doubt about Canopy’s ability to continue as a going concern, as disclosed by Canopy, and (iv) Canopy’s identification of material misstatements in certain of its previously reported financial results related to sales in its BioSteel Sports Nutrition Inc. reporting unit that were accounted for incorrectly, including the recording of a goodwill impairment during its restated second quarter of fiscal 2023. As a result, the Canopy Equity Method Investment with a $266.2 million carrying value was written down to $142.7 million, its estimated fair value, resulting in a $123.5 million impairment. This loss from impairment was included in income (loss) from unconsolidated investments within our consolidated results for Fiscal 2024. We no longer apply the equity method to our investment in Canopy following the April 2024 conversion of our Canopy common shares to Exchangeable Shares.\nOther Canopy investments —\nIn April 2023, we extended the maturity of the remaining C$100.0 million principal amount of our then-existing Canopy Debt Securities by exchanging them for the 2023 Canopy Promissory Note. The fair value of the Canopy Debt Securities was $69.6 million as of February 28, 2023. As of May 31, 2023, we determined that the 2023 Canopy Promissory Note did not have future economic value and, accordingly, the fair value was reduced to zero.\nFor additional information on these divestitures, acquisitions, and investments, refer to Notes 2, 5, 7, and 10.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    36\nPART II\nITEM 7. MD&A\nTable of Contents\nResults of Operations\nFinancial Highlights\nReferences to organic throughout the following discussion exclude the impact of the SVEDKA Divestiture, as appropriate.\nFiscal 2025 compared to \nFiscal 2024\n•\nNet sales increased 2%\n largely due to an increase in Beer net sales driven primarily by shipment volume growth and favorable impact from pricing, partially offset by a decline in organic Wine and Spirits net sales driven primarily by a decrease in branded shipment volume.\n•\nOperating income decreased 89%\n largely due to (i) the Fiscal 2025 wine and spirits goodwill and wine trademark assets impairments and (ii) an impairment of assets held for sale largely in connection with the 2025 Wine Divestitures Transaction, partially offset by (i) improvements within the Beer segment as the net sales growth and successful execution of cost savings initiatives outpaced higher marketing spend and (ii) a net gain related to the SVEDKA Divestiture.\n•\nNet income (loss) attributable to CBI\n and \ndiluted\n \nnet income (loss) per common share attributable to CBI each decreased 105%\n \nlargely due to the\n items discussed above, partially offset by (i) a benefit from income taxes as compared to a provision for income taxes for Fiscal 2024, (ii) no longer recognizing equity losses from Canopy’s results following the conversion of our Canopy common shares to Exchangeable Shares, and (iii) a Fiscal 2024 impairment of our then-existing Canopy Equity Method Investment.\nComparable Adjustments\nManagement excludes items that affect comparability from its evaluation of the results of each operating segment as these Comparable Adjustments are not reflective of core operations of the segments. Segment operating performance and the incentive compensation of segment management are evaluated based on core segment operating income (loss) which does not include the impact of these Comparable Adjustments.\nAs more fully described herein and in the related Notes, the Comparable Adjustments that impacted comparability in our segment results for each period are as follows:\nFiscal\n2025\nFiscal\n2024\n(in millions)\nCost of product sold\nSettlements of undesignated commodity derivative contracts\n$\n26.8 \n$\n15.0 \nStrategic business reconfiguration costs\n(10.7)\n— \nFlow through of inventory step-up\n(10.2)\n(3.6)\nNet gain (loss) on undesignated commodity derivative contracts\n(0.3)\n(44.2)\nOther gains (losses)\n0.6 \n— \nComparable Adjustments, Cost of product sold\n6.2 \n(32.8)\nSelling, general, and administrative expenses\nRestructuring and other strategic business reconfiguration costs\n(79.3)\n(46.3)\nTransition services agreements activity\n(22.6)\n(24.9)\nTransaction, integration, and other acquisition-related costs\n(1.2)\n(0.6)\nInsurance recoveries\n— \n55.1 \nOther gains (losses)\n(13.4)\n(11.2)\nComparable Adjustments, Selling, general, and administrative expenses\n(116.5)\n(27.9)\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    37\nPART II\nITEM 7. MD&A\nTable of Contents\nFiscal\n2025\nFiscal\n2024\n(in millions)\nGoodwill and intangible assets impairment\n(2,797.7)\n— \nAssets held for sale impairment\n(478.0)\n— \nGain (loss) on sale of business\n266.0 \n(15.1)\nComparable Adjustments, Operating income (loss)\n$\n(3,120.0)\n$\n(75.8)\nComparable Adjustments, Income (loss) from unconsolidated investments\n$\n(49.3)\n$\n(478.0)\nCost of product sold\nUndesignated commodity derivative contracts\nNet gain (loss) on undesignated commodity derivative contracts represents a net gain (loss) from the changes in fair value of undesignated commodity derivative contracts. The net gain (loss) is reported outside of segment operating results until such time that the underlying exposure is recognized in the segment operating results. At settlement, the net gain (loss) from the changes in fair value of the undesignated commodity derivative contracts is reported in the appropriate operating segment, allowing the results of our operating segments to reflect the economic effects of the commodity derivative contracts without the resulting unrealized mark to fair value volatility.\nStrategic business reconfiguration costs\nWe recognized costs primarily in connection with losses on write-downs of excess inventory resulting from our initiatives to streamline, increase efficiencies, and reduce our cost structure primarily within our Wine and Spirits segment.\nFlow through of inventory step-up\nIn connection with acquisitions, the allocation of purchase price in excess of book value for certain inventories on hand at the date of acquisition is referred to as inventory step-up. Inventory step-up represents an assumed manufacturing profit attributable to the acquired business prior to acquisition.\nSelling, general, and administrative expenses\nRestructuring and other strategic business reconfiguration costs\nWe recognized costs in connection with certain activities, which are intended to streamline, increase efficiencies, and reduce our cost structure primarily within our Wine and Spirits segment, as well as those associated with the 2025 Restructuring Initiative.\nTransition services agreements activity\nWe recognized costs in connection with transition services agreements related to the previous sale of a portion of our wine and spirits business\n.\nTransaction, integration, and other acquisition-related costs\nWe recognized costs in connection with our investments, acquisitions, and divestitures.\nInsurance recoveries\nWe recognized business interruption and other recoveries largely related to severe winter weather events. For additional information, refer to Note 16.\nOther gains (losses)\nWe recognized other gains (losses) primarily from (i) a net loss on foreign currency as a result of the resolution of various tax examinations and assessments (Fiscal 2025), (ii) net \ndecreases in estimated fair values of contingent liabilities associated with prior period acquisitions\n, and (iii) a net loss from changes in the indemnification of liabilities associated with prior period divestitures (Fiscal 2024).\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    38\nPART II\nITEM 7. MD&A\nTable of Contents\nGoodwill and intangible assets impairment\nWe recognized goodwill and intangible assets impairments in connection with continued negative trends within our Wine and Spirits business primarily attributable to our U.S. wholesale market, driven by declines in both the overall wine market and in our mainstream and premium wine brands. For additional information, refer to Notes 7, 8, and 13.\nAssets held for sale impairment\nWe recognized an impairment largely in connection with the 2025 Wine Divestitures Transaction. For additional information, refer to Note 2.\nGain (loss) on sale of business\nWe recognized a net gain (loss) from the (i) SVEDKA Divestiture (Fiscal 2025), (ii) Craft Beer Divestitures (Fiscal 2024), and (iii) sale of the Daleville Facility (Fiscal 2024). For additional information, refer to Note 2.\nIncome (loss) from unconsolidated investments\nWe recognized income (loss) primarily from (i) unrealized net losses from the changes in fair value of our securities measured at fair value, (ii) impairments of certain other equity method investments, (iii) a net gain in connection with Exchangeable Shares (Fiscal 2025), (iv) comparable adjustments to equity in losses from Canopy’s results (Fiscal 2024), and (v) an impairment of our then-existing Canopy Equity Method Investment (Fiscal 2024). For additional information, refer to Notes 7 and 10.\nBusiness Segments\nNet sales\nFiscal\n2025\nFiscal\n2024\nDollar\nChange\nPercent\nChange\n(in millions)\nBeer\n$\n8,539.8 \n$\n8,162.6 \n$\n377.2 \n5 \n%\nWine and Spirits:\nWine\n1,450.1 \n1,552.1 \n(102.0)\n(7 \n%)\nSpirits\n218.8 \n247.1 \n(28.3)\n(11 \n%)\nTotal Wine and Spirits\n1,668.9 \n1,799.2 \n(130.3)\n(7 \n%)\nConsolidated net sales\n$\n10,208.7 \n$\n9,961.8 \n$\n246.9 \n2 \n%\nBeer segment\nFiscal\n2025\nFiscal\n2024\nDollar\nChange\nPercent\nChange\n(in millions, branded product, 24-pack, 12-ounce case equivalents)\nNet sales\n$\n8,539.8 \n$\n8,162.6 \n$\n377.2 \n5 \n%\nShipments\n431.8 \n418.1 \n3.3 \n%\nDepletions \n(1)\n2.9 \n%\n(1)\nIncludes an adjustment to remove volumes associated with the Craft Beer Divestitures for the period March 1, 2023, through May 31, 2023.\nThe increase in Beer net sales is due to (i) $264.2 million of shipment volume growth and (ii) $168.1 million of favorable impact from pricing in select markets, partially offset by $55.1 million of unfavorable product mix primarily from a shift in package types.\n \nWhile our shipment volume growth benefited from continued consumer demand, we believe it was suppressed due to the non-structural socioeconomic factors discussed above. We expect shipment volume to generally align with depletion volume for Fiscal 2026.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    39\nPART II\nITEM 7. MD&A\nTable of Contents\nWine and Spirits segment\nFiscal\n2025\nFiscal\n2024\nDollar\nChange\nPercent\nChange\n(in millions, branded product, 9-liter case equivalents)\nNet sales\n$\n1,668.9 \n$\n1,799.2 \n$\n(130.3)\n(7 \n%)\nShipments\nTotal\n22.1 \n23.8 \n(7.1 \n%)\nOrganic \n(1)\n22.1 \n23.2 \n(4.7 \n%)\nU.S. Wholesale\n19.2 \n21.0 \n(8.6 \n%)\nOrganic U.S. Wholesale \n(1)\n19.2 \n20.4 \n(5.9 \n%)\nDepletions \n(1)\n(9.3 \n%)\n(1)\nIncludes adjustments to remove volumes associated with the SVEDKA Divestiture for the period January 6, 2024, through February 29, 2024.\nThe decrease in Wine and Spirits net sales is due to a $107.7 million decrease in organic net sales and $22.6 million from the SVEDKA Divestiture that are no longer part of our business. The decrease in organic net sales is driven by (i) a $93.5 million decrease in branded wine and spirits shipment volume, (ii) a $30.1 million decrease in non-branded net sales led by a decline in bulk wine sales, and (iii) a $16.1 million decrease from pricing actions in certain markets,\n \npartially offset by $29.9 million of higher contractual distributor payments as compared to Fiscal 2024. The decrease in branded wine and spirits shipment volume is attributable to our U.S. wholesale market, primarily driven by declines in both the overall wine market and in our mainstream and premium wine brands, as well as retailer inventory destocking. For Fiscal 2026, we expect depletion volume to outpace shipment volume, most notably during the first quarter.\nGross profit\nFiscal\n2025\nFiscal\n2024\nDollar\nChange\nPercent\nChange\n(in millions)\nBeer\n$\n4,566.1 \n$\n4,214.2 \n$\n351.9 \n8 \n%\nWine and Spirits\n742.3 \n836.1 \n(93.8)\n(11 \n%)\nComparable Adjustments\n6.2 \n(32.8)\n39.0 \nNM\nConsolidated gross profit\n$\n5,314.6 \n$\n5,017.5 \n$\n297.1 \n6 \n%\nThe increase in Beer gross profit is primarily due to (i) the $168.1 million of favorable impact from pricing, (ii) $141.5 million of shipment volume growth, and (iii) $75.8 million of reduced cost of product sold, partially offset by $33.5 million of unfavorable product mix. The reduced cost of product sold is primarily due to (i) \n$41.0 million of favorable fixed cost absorption related to increased production levels as compared to \nFiscal 2024, (ii) $38.8 million of decreased transportation costs, (iii) $21.6 million of costs related to the Fiscal 2024 write-off of an indirect tax receivable, (iv) $16.3 million of lower material costs, including cartons, wooden pallets, aluminum, lumber, and glass each driven by efficiency initiatives, tempered by higher malt costs, and (v) $13.7 million of costs related to a Fiscal 2024 voluntary product recall of select kegs, partially offset by (i) a $33.0 million increase in brewery costs, including compensation and benefits, and (ii) $26.8 million of higher depreciation expense resulting from the Mexico Beer Projects. To partially offset the expected increases in cost of product sold we executed initiatives focused largely on logistics and procurement that resulted in over $200 million of cost savings for \nFiscal 2025\n.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    40\nPART II\nITEM 7. MD&A\nTable of Contents\nThe decrease in Wine and Spirits gross profit is due to a $83.1 million decrease in organic gross profit and $10.7 million from the SVEDKA Divestiture that are no longer part of the business. The decrease in organic gross profit is attributable to (i) a $58.7 million decrease in branded wine and spirits shipment volume, (ii) $28.7 million of unfavorable product mix from lower-margin net sales, (iii) the $16.1 million of unfavorable pricing, and (iv) $12.2 million of increased cost of product sold, partially offset by the $29.9 million from higher contractual distributor payments. The increase in cost of product sold was largely attributable to unfavorable fixed cost absorption related to decreased production levels as compared to Fiscal 2024 and increased materials costs, including grapes, partially offset by lower transportation and warehousing costs.\nGross profit as a percent of net sales increased to 52.1% for Fiscal 2025 compared with 50.4% for Fiscal 2024. This increase was largely due to (i) approximately 80 basis points of favorable impact from Beer pricing, (ii) 75 basis points of rate growth from lower cost of product sold within the Beer segment, (iii) a favorable change in Comparable Adjustments, contributing approximately 40 basis points, and (iv) 15 basis points of rate growth from the decline in bulk wine net sales, partially offset by approximately 30 basis points of rate decline resulting from unfavorable product mix within the Wine and Spirits segment.\nSelling, general, and administrative expenses\nFiscal\n2025\nFiscal\n2024\nDollar\nChange\nPercent\nChange\n(in millions)\nBeer\n$\n1,171.7 \n$\n1,119.8 \n$\n51.9 \n5 \n%\nWine and Spirits\n417.2 \n437.4 \n(20.2)\n(5 \n%)\nCorporate Operations and Other\n244.6 \n247.6 \n(3.0)\n(1 \n%)\nComparable Adjustments\n116.5 \n27.9 \n88.6 \nNM\nConsolidated selling, general, and administrative expenses\n$\n1,950.0 \n$\n1,832.7 \n$\n117.3 \n6 \n%\nThe increase in Beer selling, general, and administrative expenses is largely driven by $80.5 million of additional marketing spend primarily led by increased media investment to support our high-end imported beer brands\n, partially offset by $27.6 million of decreased general and administrative expenses. The decrease in general and administrative expenses is primarily due to (i) lower short-term incentive accruals, (ii) decreased legal expenses, and (iii) favorable foreign currency impact, partially offset by higher other compensation and benefits, including stock-based compensation expense.\nThe decrease in Wine and Spirits selling, general, and administrative expenses is largely driven by $17.5 million and $2.8 million of decreased general and administrative expenses and marketing spend, respectively. The decrease in general and administrative expenses is primarily due to lower (i)\n \nlitigation expenses, (ii) consulting services, and (iii) depreciation expense as compared to Fiscal 2024.\nCorporate Operations and Other selling, general, and administrative expenses remained relatively flat as lower short-term incentive accruals and a tax credit resulting from our June 2024 corporate headquarters relocation were offset by higher (i) stock-based compensation, (ii) consulting services, (iii) other payroll expenses, and (iv) depreciation expense driven by the headquarters relocation.\nSelling, general, and administrative expenses as a percent of net sales increased to 19.1%\n for \nFiscal 2025 as compared with 18.4% for Fiscal 2024. The increase is largely driven by an unfavorable change in Comparable Adjustments, contributing approximately 85 basis points of rate growth, partially offset by approximately 15 basis points of rate decline as the increase in Beer net sales exceeded the increase in selling, general, and administrative expenses.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    41\nPART II\nITEM 7. MD&A\nTable of Contents\nOperating income (loss)\nFiscal\n2025\nFiscal\n2024\nDollar\nChange\nPercent\nChange\n(in millions)\nBeer\n$\n3,394.4 \n$\n3,094.4 \n$\n300.0 \n10 \n%\nWine and Spirits\n325.1 \n398.7 \n(73.6)\n(18 \n%)\nCorporate Operations and Other\n(244.6)\n(247.6)\n3.0 \n1 \n%\nComparable Adjustments\n(3,120.0)\n(75.8)\n(3,044.2)\nNM\nConsolidated operating income (loss)\n$\n354.9 \n$\n3,169.7 \n$\n(2,814.8)\n(89 \n%)\nThe increase in Beer operating income is largely attributable to the favorable impact from pricing, shipment volume growth, and reduced cost of product sold, led by cost savings initiatives, partially offset by the increased marketing spend and unfavorable product mix, as described above.\nThe decrease in Wine and Spirits operating income is largely attributable to the decline in organic branded wine and spirits shipment volume, unfavorable product mix and pricing, and the SVEDKA Divestiture, partially offset by the higher contractual distributor payments and decreased general, and administrative expenses, as described above.\nAs previously discussed, the Corporate Operations and Other operating loss remained relatively flat as lower net compensation and benefits impacts and the tax credit were offset by higher consulting services and depreciation expense.\nIncome (loss) from unconsolidated investments\nFiscal\n2025\nFiscal\n2024\nDollar\nChange\nPercent\nChange\n(in millions)\nNet gain in connection with Exchangeable Shares\n$\n7.2 \n$\n— \n$\n7.2 \nNM\nEquity method investments impairment\n(8.7)\n(136.1)\n127.4 \n94 \n%\nUnrealized net gain (loss) on securities measured at fair value\n(47.9)\n(85.4)\n37.5 \n44 \n%\nEquity in earnings (losses) from Canopy and related activities\n— \n(321.3)\n321.3 \nNM\nEquity in earnings (losses) from other equity method investees and related activities\n23.1 \n31.0 \n(7.9)\n(25 \n%)\n$\n(26.3)\n$\n(511.8)\n$\n485.5 \n95 \n%\nInterest expense, net\nInterest expense, net decreased to $411.4 million for Fiscal 2025 as compared to $436.1 million for Fiscal 2024. This decrease of $24.7 million, or 6%, is largely due to (i) approximately $275 million of lower average borrowings and (ii) an increase in capitalized interest in connection with the Mexico Beer Projects as compared to Fiscal 2024. For additional information, refer to Note 12.\n(Provision for) benefit from income taxes\nThe (provision for) benefit from income taxes increased to $51.7 million for Fiscal 2025 from $(456.6) million for Fiscal 2024. Our effective tax rate for Fiscal 2025 was 62.4% as compared with 20.6% for Fiscal 2024. In comparison to prior year, our effective tax rate was impacted primarily by:\n•\nthe net income tax impacts resulting from \nFiscal 2025 \nWine and Spirits-related impairments including the non-deductible portion of the wine and spirits goodwill impairment; and\n•\nthe net income tax expense resulting from (i) the SVEDKA Divestiture and (ii) adjustments to certain other valuation allowances; partially offset by\n•\na Fiscal 2025 net income tax benefit recognized following the resolution of various tax examinations and assessments related to prior periods.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    42\nPART II\nITEM 7. MD&A\nTable of Contents\nThe OECD introduced a framework under Pillar Two which includes a 15% global minimum tax rate. The current legislation did not have a material impact on our consolidated financial statements. We continue to monitor developments for potential future impacts. Additionally, we provide for taxes that may be payable if undistributed earnings of foreign subsidiaries were to be remitted to the U.S., except for those earnings that we consider to be indefinitely reinvested.\nFor additional information, refer to Note 13.\nWe expect our reported effective tax rate for Fiscal 2026 to be in the range of 17% to 19%.\nNet income (loss) attributable to CBI\nNet income (loss) attributable to CBI decreased to $(81.4) million for Fiscal 2025 from $1,727.4 million for Fiscal 2024. This decrease of $1,808.8 million, or 105%, is largely attributable to Fiscal 2025 Wine and Spirits-related impairments, including (i) wine and spirits goodwill, (ii) wine trademarks, and (iii) assets held for sale, partially offset by the (i) benefit from income taxes as compared to a provision for income taxes for Fiscal 2024, (ii) favorable impact from income (loss) from unconsolidated investments, driven by Fiscal 2024 Canopy-related activities, (iii) Fiscal 2025 improvements within the Beer segment, and (iv) the net gain related to the SVEDKA Divestiture.\nLiquidity and Capital Resources\nGeneral\nOur primary source of liquidity has been cash flow from operating activities. Our ability to consistently generate robust cash flow from our operations is one of our most significant financial strengths. It enables us to invest in our people and our brands, make capital investments and strategic acquisitions, provide a cash dividend program, and repurchase shares of our common stock. Our largest use of cash in our operations is for purchasing and carrying inventories and carrying seasonal accounts receivable. Historically, we have used this cash flow to repay our short-term borrowings and fund capital expenditures. Additionally, our commercial paper program is used to fund our short-term borrowing requirements and to maintain our access to the capital markets. We use our short-term borrowings, including our commercial paper program, to support our working capital requirements and capital expenditures, among other things.\nWe seek to maintain adequate liquidity to meet working capital requirements, fund capital expenditures, and repay scheduled principal and interest payments on debt. Absent deterioration of market conditions, we believe that cash flows from operating and financing activities will provide adequate resources to satisfy our working capital, scheduled principal and interest payments on debt, anticipated dividend payments, periodic share repurchases, and planned capital expenditure requirements for both our short-term and long-term capital needs.\nWe have an agreement with a financial institution for payment services and to facilitate a voluntary supply chain finance program through this participating financial institution. The program is available to certain of our suppliers allowing them the option to manage their cash flow. We are not a party to the agreements between the participating financial institution and the suppliers in connection with the program. Our rights and obligations to our suppliers, including amounts due and scheduled payment terms, are not impacted. For additional information, refer to Note 16.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    43\nPART II\nITEM 7. MD&A\nTable of Contents\nCash Flows\nFiscal\n2025\nFiscal\n2024\nDollar\nChange\n(in millions)\nNet cash provided by (used in):\nOperating activities\n$\n3,152.2 \n$\n2,780.0 \n$\n372.2 \nInvesting activities\n(974.8)\n(1,285.9)\n311.1 \nFinancing activities\n(2,261.8)\n(1,474.6)\n(787.2)\nEffect of exchange rate changes on cash and cash equivalents\n0.1 \n(0.6)\n0.7 \nNet increase (decrease) in cash and cash equivalents\n$\n(84.3)\n$\n18.9 \n$\n(103.2)\nOperating activities\nThe increase in net cash provided by (used in) operating activities consists of:\nFiscal\n2025\nFiscal\n2024\nDollar\nChange\n(in millions)\nNet income (loss)\n$\n(31.1)\n$\n1,765.2 \n$\n(1,796.3)\nDeferred tax provision (benefit)\n(210.3)\n147.9 \n(358.2)\nEquity in (earnings) losses of equity method investees and related activities, net of distributed earnings\n(5.4)\n321.2 \n(326.6)\nEquity method investments impairment\n8.7 \n136.1 \n(127.4)\nAssets held for sale impairment\n478.0 \n— \n478.0 \n(Gain) loss on sale of business\n(266.0)\n15.1 \n(281.1)\nGoodwill and intangible assets impairment\n2,797.7 \n— \n2,797.7 \nOther non-cash adjustments\n514.8 \n682.3 \n(167.5)\nChange in operating assets and liabilities, net of effects from purchase and sale of business\n(134.2)\n(287.8)\n153.6 \nNet cash provided by (used in) operating activities\n$\n3,152.2 \n$\n2,780.0 \n$\n372.2 \nThe $153.6 million net change in operating assets and liabilities was largely driven by lower accounts payable resulting from beer cost-savings initiatives and the timing of payments as well as higher inventory levels for both the beer and the wine and spirits segments. Certain of our inventory was reclassified to assets held for sale, largely in connection with the 2025 Wine Divestitures Transaction, as of February 28, 2025. Additionally, net cash provided by operating activities was positively impacted by lower Fiscal 2025 income tax payments as compared to Fiscal 2024.\nInvesting activities\nNet cash used in investing activities decreased to $974.8 million for Fiscal 2025 from $1,285.9 million for Fiscal 2024. This decrease of $311.1 million, or 24%, was primarily due to (i) $403.8 million of increased proceeds from the sale of business, driven by the SVEDKA Divestiture, and (ii) $55.0 million of reduced capital expenditures for Fiscal 2025 as compared to Fiscal 2024. The decrease in net cash used in investing activities was partially offset by a $151.2 million increase in business acquisitions, driven by the Sea Smoke acquisition. Business acquisitions and divestitures consist primarily of the following:\nAcquisitions\nDivestitures\nFiscal 2025\n•\nSea Smoke\n•\nSVEDKA Divestiture\nFiscal 2024\n•\nDomaine Curry\n•\nCraft Beer Divestitures\nFor additional information on these acquisitions and divestitures, refer to Notes 2 and 8.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    44\nPART II\nITEM 7. MD&A\nTable of Contents\nFinancing activities\nThe increase in net cash provided by (used in) financing activities consists of:\nFiscal\n2025\nFiscal\n2024\nDollar\nChange\n(in millions)\nNet proceeds from (payments of) debt, current and long-term, and related activities\n$\n(391.8)\n$\n(596.9)\n$\n205.1 \nDividends paid\n(731.8)\n(653.8)\n(78.0)\nPurchases of treasury stock\n(1,123.8)\n(249.7)\n(874.1)\nNet cash provided by stock-based compensation activities\n60.0 \n93.3 \n(33.3)\nDistributions to noncontrolling interests\n(57.5)\n(52.6)\n(4.9)\nPayment of contingent consideration\n(0.7)\n(14.9)\n14.2 \nPurchase of noncontrolling interest\n(16.2)\n— \n(16.2)\nNet cash provided by (used in) financing activities\n$\n(2,261.8)\n$\n(1,474.6)\n$\n(787.2)\nDebt\nTotal debt outstanding as of February 28, 2025, amounted to $11,497.7 million, a decrease of $381.6 million, or 3%, from February 29, 2024. This decrease consisted of:\nDebt repayment\nDebt issuance\nBank facilities\nThe Company, CB International, the Administrative Agent, and certain other lenders are parties to the 2022 Credit Agreement. The October 2022 Credit Agreement Amendment revised certain defined terms and covenants in the 2022 Credit Agreement and became effective in April 2024 following the (i) amendment by Canopy of its Articles of Incorporation, (ii) conversion of our Canopy common shares into Exchangeable Shares, and (iii) resignation of our nominees from the board of directors of Canopy.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    45\nPART II\nITEM 7. MD&A\nTable of Contents\nGeneral\nThe majority of our outstanding borrowings as of February 28, 2025, consisted of fixed-rate senior unsecured notes, with maturities ranging from calendar 2025 to calendar 2050, as follows:\nAdditionally, we have a commercial paper program which provides for the issuance of up to an aggregate principal amount of $2.25 billion of commercial paper. Our commercial paper program is backed by unused commitments under our revolving credit facility under our 2022 Credit Agreement. Accordingly, outstanding borrowings under our commercial paper program reduce the amount available under our revolving credit facility.\nWe do not have purchase commitments from buyers for our commercial paper and, therefore, our ability to issue commercial paper is subject to market demand. If the commercial paper market is not available to us for any reason when commercial paper borrowings mature, we expect to utilize unused commitments under our revolving credit facility under our 2022 Credit Agreement to repay commercial paper borrowings. We do not expect that fluctuations in demand for commercial paper will affect our liquidity given our borrowing capacity available under our revolving credit facility.\nWe had the following remaining borrowing capacity available under our 2022 Credit Agreement:\nFebruary 28,\n2025\nApril 16,\n2025\n(in millions)\nRevolving credit facility \n(1)\n$\n1,430.7 \n$\n1,531.0 \n(1)\nNet of outstanding revolving credit facility borrowings and outstanding letters of credit under our 2022 Credit Agreement and outstanding borrowings under our commercial paper program (excluding unamortized discount) of $808.0 million and $707.7 million as of February 28, 2025\n,\n and April 16, 2025, respectively.\nThe financial institutions participating in our 2022 Credit Agreement have complied with prior funding requests and we believe they will comply with any future funding requests. However, there can be no assurances that any particular financial institution will continue to do so.\nAs of February 28, 2025, we and our subsidiaries were subject to covenants that are contained in our 2022 Credit Agreement, including those restricting the incurrence of additional subsidiary indebtedness, additional liens, mergers and consolidations, transactions with affiliates, and sale and leaseback transactions, in each case subject to numerous conditions, exceptions, and thresholds. The financial covenants are limited to a minimum interest coverage ratio and a maximum net leverage ratio, both as defined in our 2022 Credit Agreement. As of \nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    46\nPART II\nITEM 7. MD&A\nTable of Contents\nFebruary 28, 2025, under our 2022 Credit Agreement, the minimum interest coverage ratio was 2.5x and the maximum net leverage ratio was 4.0x.\nOur indentures relating to our outstanding senior notes contain certain covenants, including, but not limited to: (i) a limitation on liens on certain assets, (ii) a limitation on certain sale and leaseback transactions, and (iii) restrictions on mergers, consolidations, and the transfer of all or substantially all of our assets to another person.\nAs of February 28, 2025, we were in compliance with our covenants under our 2022 Credit Agreement and our indentures, and have met all debt payment obligations.\nFor further discussion and presentation of our borrowings and available sources of borrowing, refer to Note 12.\nCommon Stock Dividends\nOn April 9, 2025, our Board of Directors declared a quarterly cash dividend of $1.02 per share of Class A Stock and $0.92 per share of Class 1 Stock payable on May 15, 2025, to stockholders of record of each class as of the close of business on April 29, 2025. We expect to return approximately $720 million to stockholders in Fiscal 2026 through cash dividends.\nWhile we currently expect to continue to pay a regular quarterly cash dividend to stockholders of our common stock in the future, such payments are subject to approval of our Board of Directors and are dependent upon our financial condition, results of operations, capital requirements, and other factors, including those set forth under Item 1A. “Risk Factors” of this Form 10-K.\nShare Repurchase Program\nIn each of January 2021 and November 2023, our Board of Directors authorized the repurchase of up to $2.0 billion of our publicly traded common stock. The 2021 Authorization was fully utilized during Fiscal 2025, and the 2023 Authorization, of which approximately $1.5 billion remained unused, was canceled during Fiscal 2026. In April 2025, our Board of Directors authorized a repurchase of up to $4.0 billion of our publicly traded common stock under the 2025 Authorization, which expires in February 2028 and replaced the 2023 Authorization in its entirety.\nDuring Fiscal 2025, we repurchased 5,252,003 shares of Class A Stock pursuant to the 2021 Authorization and the 2023 Authorization through open market transactions at an aggregate cost of $1,123.8 million, excluding the impact of Federal excise tax owed pursuant to the IRA, or an average cost of $213.98 per share. We used cash on hand, primarily generated by cash flow from operations and proceeds from the SVEDKA Divestiture, to fund our Fiscal 2025 share repurchases. Subsequent to February 28, 2025, we repurchased 494,094 shares of Class A Stock pursuant to the 2025 Authorization at an aggregate cost of $91.7 million, excluding the impact of Federal excise tax owed pursuant to the IRA, through open market transactions. We primarily used cash on hand to pay the purchase price for the repurchased shares.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    47\nPART II\nITEM 7. MD&A\nTable of Contents\nAs of April 23, 2025, total shares repurchased under the 2021 Authorization, the 2023 Authorization, and the 2025 Authorization are as follows:\nClass A Stock\nRepurchase Authorization\nDollar Value of Shares Repurchased\nNumber of Shares Repurchased\n(in millions, except share data)\n2021 Authorization (fully utilized during Fiscal 2025)\n$\n2,000.0 \n$\n2,000.0 \n8,337,547\n2023 Authorization (canceled during Fiscal 2026)\n$\n2,000.0 \n$\n510.1 \n2,789,732\n2025 Authorization \n(1)\n$\n4,000.0 \n$\n91.7 \n494,094\n(1)\nAs of April 23, 2025, $3,908.3 million remains available for future share repurchases, excluding the impact of Federal excise tax owed pursuant to the IRA.\nShare repurchases under the\n \n2025 Authorization may be accomplished at management’s discretion from time to time based on market conditions, our cash and debt position, and other factors as determined by management. Shares may be repurchased through open market or privately negotiated transactions. We may fund future share repurchases with cash generated from operations, proceeds from borrowings, and/or divestiture proceeds. Any repurchased shares will become treasury shares, including shares previously repurchased under the 2021 Authorization, the 2023 Authorization, and the 2025 Authorization.\nWe currently expect to return $4.0 billion in share repurchases to stockholders over the next three fiscal years, but such repurchases are dependent upon our financial condition, results of operations, capital requirements, and other factors, including those set forth under Item 1A. “Risk Factors” of this Form 10-K.\nFor additional information, refer to Note 17.\nCapital Resources\nWe have maintained adequate liquidity to meet working capital requirements, fund capital expenditures, and repay scheduled principal and interest payments on debt. Absent deterioration of market conditions, we believe that cash flows from operating and financing activities will provide adequate resources to satisfy our working capital, scheduled principal and interest payments on debt, anticipated dividend payments, periodic share repurchases, and planned capital expenditure requirements for both our short-term and long-term capital needs.\nThe following sets forth information about our outstanding obligations at February 28, 2025. For a detailed discussion of the items noted in the following table, refer to Notes 11 through 16.\nShort-term payments\nLong-term payments\nTotal\n(in millions)\nContractual obligations:\nShort-term borrowings\n$\n806.7 \n$\n— \n$\n806.7 \nInterest payments on short-term debt\n$\n2.5 \n$\n— \n$\n2.5 \nLong-term debt (excluding unamortized debt issuance costs and unamortized discounts)\n$\n1,404.1 \n$\n9,354.6 \n$\n10,758.7 \nInterest payments on long-term debt\n (1)\n$\n418.2 \n$\n3,174.2 \n$\n3,592.4 \nOperating leases\n$\n113.6 \n$\n714.6 \n$\n828.2 \nOther long-term liabilities\n (2)\n$\n236.5 \n$\n181.0 \n$\n417.5 \nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    48\nPART II\nITEM 7. MD&A\nTable of Contents\nShort-term payments\nLong-term payments\nTotal\n(in millions)\nPurchase obligations\nRaw materials and supplies\n$\n1,431.0 \n$\n4,447.5 \n$\n5,878.5 \nContract services\n$\n176.1 \n$\n287.6 \n$\n463.7 \nCapital expenditures \n(3)\n$\n122.2 \n$\n83.3 \n$\n205.5 \nIn-process and finished goods inventories\n$\n24.4 \n$\n30.3 \n$\n54.7 \n(1)\nInterest payments on long-term debt do not include interest related to finance lease obligations as amounts are not material.\n(2)\nOther long-term liabilities do not include payments for unrecognized tax benefit liabilities of $264.0 million due to the uncertainty of the timing of future cash flows associated with these unrecognized tax benefit liabilities. In addition, other long-term liabilities do not include expected payments for interest and penalties associated with unrecognized tax benefit liabilities as amounts are not material. For a detailed discussion of these items, refer to Note 13.\n(3)\nContracts to purchase equipment and services primarily related to the Mexico Beer Projects. For further information about these purchase obligations, refer to “Capital Expenditures” below.\nCapital Expenditures\nDuring Fiscal 2025, we incurred $1,214.1 million for capital expenditures, including $991.5 million for the Beer segment primarily for the Mexico Beer Projects. We plan to spend approximately $1.2 billion for capital expenditures in Fiscal 2026, including approximately $1.0 billion for the Beer segment associated primarily with the Mexico Beer Projects. The remaining planned Fiscal 2026 capital expenditures consist of improvements to existing operating facilities and replacements of existing equipment and/or buildings. Management reviews the capital expenditure program periodically and modifies it as required to meet current and projected future business needs.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in accordance with GAAP requires us to make estimates and assumptions that affect amounts reported in our consolidated financial statements. Estimates are based on historical experience, observance of trends in the industry, information provided by our customers, and information available from other outside sources, as appropriate. We review estimates to ensure that they appropriately reflect changes in our business on an ongoing basis. Certain policies are particularly important to the portrayal of our financial position and results of operations and require the application of significant judgment by management to determine appropriate assumptions to be used in certain estimates; as a result, they are subject to an inherent degree of uncertainty. See Note 1 for a description of our significant accounting policies. Our critical accounting estimates include:\n•\nGoodwill and other intangible assets.\n \nGoodwill and other intangible assets are classified into three categories: (i) goodwill, (ii) intangible assets with definite lives subject to amortization, and (iii) intangible assets with indefinite lives not subject to amortization. For intangible assets with definite lives, impairment testing is required if conditions exist that indicate the carrying value may not be recoverable. For intangible assets with indefinite lives and for goodwill, impairment testing is required at least annually or more frequently if events or changes in circumstances indicate that these assets might be impaired. We may perform a qualitative evaluation prior to a quantitative test to determine if an impairment exists. However, if the results of the qualitative evaluation are inconclusive or suggest an impairment may exist, we must proceed to the quantitative test. The qualitative evaluation is an assessment of factors, including market conditions, industry changes, actual results as compared to forecasted results, or the timing of recent acquisitions and/or \nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    49\nPART II\nITEM 7. MD&A\nTable of Contents\ndivestitures. The quantitative test estimates the fair value utilizing assumptions and projections regarding items such as future cash flows, revenues, earnings, and other factors. The factors and assumptions used reflect our estimates and are based on historical trends, projections, and assumptions, including expectations of future economic and competitive conditions that are used in current strategic operating plans; however, these are subject to change as a result of changing market conditions. If these estimates or their related assumptions change in the future, we may be required to recognize an impairment loss for these assets. The recognition of any resulting impairment loss could have a material adverse impact on our financial statements.\nWe perform annual impairment tests and re-evaluate the useful lives of other intangible assets with indefinite lives at the annual impairment test measurement date of January 1 or when circumstances arise that indicate a possible impairment or change in useful life might exist.\nGoodwill – Our reporting units with goodwill include the Beer segment and the Wine and Spirits segment. In the fourth quarter of Fiscal 2025, we performed our annual goodwill impairment analysis using both the qualitative and quantitative assessments. No indication of impairment was noted for our Beer reporting unit utilizing the qualitative assessment, as the estimated fair value of goodwill exceeded its carrying value.\nDuring the second quarter of fiscal 2025, in connection with continued negative trends within our Wine and Spirits business primarily attributable to our U.S. wholesale market, driven by declines in both the overall wine market and in our mainstream and premium wine brands, management updated its Fiscal 2025 outlook for this reporting unit. The updated forecast indicated it was more likely than not the fair value of the Wine and Spirits reporting unit might be below its carrying value. Accordingly, we performed an interim quantitative assessment for goodwill impairment. This assessment indicated the carrying value of the Wine and Spirits reporting unit exceeded its estimated fair value, resulting in a $2,250.0 million goodwill impairment. During the fourth quarter of fiscal 2025, we performed our annual impairment analysis and updated our estimate of the Wine and Spirits reporting unit fair value to reflect the latest financial projections and an increase in the discount rate. As a result, we recognized an additional $490.7 million goodwill impairment to write-off the remaining goodwill balance for the Wine and Spirits reporting unit as of February 28, 2025.\nWhen performing a quantitative assessment for impairment of goodwill, we measure the amount of impairment by calculating the amount by which the carrying value exceeds its estimated fair value. The estimated fair value of our reporting units are determined based on the discounted cash flow model. The most significant assumptions used in the discounted cash flow model for the Wine and Spirits reporting unit were: (i) a 9% discount rate (for the interim assessment) and a 10% discount rate (for the annual assessment), (ii) a 1.5% expected long-term growth rate, and (iii) the annual cash flow projections.\nFor Fiscal 2024 and Fiscal 2023, as a result of our annual goodwill impairment analyses, we concluded that there were no indications of impairment for either of our reporting units, however, we closely monitored broader industry and market conditions and our expectations for future performance as it related to our wine and spirits goodwill.\nOther intangible assets – Our intangible assets consist primarily of customer relationships and trademarks obtained through business acquisitions. Customer relationships are amortized over their estimated useful lives. The trademarks that were determined to have indefinite useful lives are not amortized. Using the quantitative assessment, our trademarks are evaluated for impairment by comparing the carrying value of the trademarks to their estimated fair value. The estimated fair value of trademarks is calculated based on an income approach using the relief from royalty method.\nIn connection with our annual trademark analysis, we performed a qualitative assessment for the imported beer and spirits trademarks and concluded that there were no indications of impairment for these trademark units. We re-evaluated the wine units of account in contemplation of the 2025 Wine Divestitures Transaction and determined it was appropriate to have two reporting \nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    50\nPART II\nITEM 7. MD&A\nTable of Contents\nunits, (i) held for sale brands and (ii) remaining brands. We performed a quantitative impairment test for the held for sale brands and remaining brands trademark units as certain continued negative trends indicated the fair value may not exceed its carrying value. When using the quantitative assessment, the estimated fair value of the trademarks is calculated based on an income approach using the relief from royalty method.\nThe most significant assumptions used in the relief from royalty method to determine the estimated fair value of intangible assets with indefinite lives in connection with this impairment testing were: (i) a 3% royalty rate (held for sale brands trademark unit) and a 7% royalty rate (remaining brands trademark unit), (ii) an 11% discount rate, (iii) a 1.5% expected long-term growth rate, and (iv) the annual revenue projections. This assessment indicated (i) the carrying value of the held for sale brands trademark unit exceeded its estimated fair value, resulting in a $57.0 million trademark impairment as of February 28, 2025, and (ii) the estimated fair value of the remaining brands trademark unit exceeded its carrying value. We proceeded to perform sensitivities in our impairment testing of the remaining brands trademarks by (i) decreasing the royalty rate 50 basis points, (ii) increasing the discount rate 50 basis points, (iii) decreasing the expected long-term growth rate 50 basis points, and (iv) decreasing the annual revenue projections 100 basis points. None of these sensitivities individually would have resulted in a conclusion that the trademarks in our remaining brands reporting unit were impaired.\nWe performed quantitative assessments in both Fiscal 2024 and Fiscal 2023 for the imported beer, wine, and spirits trademarks. There were no indications of impairment for any of our trademarks for Fiscal 2024. In the fourth quarter of Fiscal 2023, certain continued negative trends within our Funky Buddha and Four Corners craft beer portfolios, including ongoing negative cash flows, resulted in our decision to revise our long-term financial forecasts for these portfolios. Accordingly, the Beer segment’s Funky Buddha and Four Corners craft beer businesses recognized $9.0 million and $4.0 million impairment losses, respectively, in connection with the write-off of their trademark assets. In Fiscal 2024, we completed the Craft Beer Divestitures.\nDivestitures – When some, but not all of a reporting unit that constitutes a business is disposed of, some of the goodwill of the reporting unit should be allocated to the portion of the reporting unit being disposed of. The allocation of goodwill is based on the relative fair values of the portion of the reporting unit being disposed of and the portion of the reporting unit remaining. This approach requires a determination of the fair value of both the business being disposed and the businesses retained within the reporting unit.\nFor Fiscal 2025 and \nFiscal 2023, o\nur estimate of fair value for the SVEDKA Divestiture and the 2022 Wine Divestiture, respectively, were determined based on the expected proceeds from the applicable transaction. The components sold were a part of the Wine and Spirits segment and were included in that reporting unit through the date of divestiture. Goodwill was allocated to the assets based on the relative fair value of the business being sold compared to the relative fair value of the reporting unit. Goodwill not allocated to assets associated with the divestiture remained in the wine and spirits reporting unit.\nFor additional information on our goodwill and intangible assets refer to Notes 2, 7, 8, 9, and 13.\n•\nAccounting for income taxes. \nWe estimate our deferred tax assets and liabilities, income taxes payable, provision for income taxes, and unrecognized tax benefit liabilities based upon various factors including, but not limited to, historical pretax operating income, future estimates of pretax operating income, differences between book and tax treatment of various items of income and expense, interpretation of tax laws, and tax planning strategies. We are subject to income taxes in Italy, Mexico, New Zealand, Switzerland, the U.S., and other jurisdictions. We are regularly audited by federal, state, and foreign tax authorities, but a number of years may elapse before an uncertain tax position is audited and finally resolved.\nWe believe all tax positions are fully supported. We recognize tax assets and liabilities in accordance with the FASB guidance for income tax accounting. Accordingly, we recognize a tax benefit from an uncertain tax position when it is more likely than not the position will be sustained upon examination \nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    51\nPART II\nITEM 7. MD&A\nTable of Contents\nbased on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate settlement. Due to the complexity of some of these uncertainties, the ultimate resolution may result in a payment that is materially different from our current estimate of the unrecognized tax benefit liabilities. In addition, changes in existing tax laws or rates could significantly change our current estimate of our unrecognized tax benefit liabilities. These differences will be reflected as increases or decreases to income tax expense in the period in which they are determined. Changes in current estimates, if significant, could have a material adverse impact on our financial statements.\nWe recognize our deferred tax assets and liabilities based upon the expected future tax outcome of amounts recognized in our results of operations. If necessary, we recognize a valuation allowance on deferred tax assets when it is more likely than not they will not be realized. We evaluate our ability to realize the tax benefits associated with deferred tax assets by assessing the adequacy of future expected taxable income, historical and projected operating results, and the availability of prudent and feasible tax planning strategies. The realization of deferred tax assets is evaluated by jurisdiction and the realizability of these assets can vary based on the character of the tax attribute and the carryforward periods specific to each jurisdiction. We believe it is more likely than not the results of future operations will generate sufficient taxable income to realize our existing deferred tax assets, net of valuation allowances. Changes in the realizability of our deferred tax assets will be reflected in our effective tax rate in the period in which they are determined.\nChange in Accounting Guidance\nAccounting guidance adopted for Fiscal 2025 did not have a material impact on our consolidated financial statements. For information on recently adopted accounting guidance and accounting guidance not yet adopted, see Note 1.\nConstellation Brands, Inc. FY 2025 Form 10-K\n#WORTHREACHINGFOR \n   I\n    52\nPART II",
  "item2": null
}