{
  "source_file": "smur-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\n \nOverview\nSmurfit Westrock was created in July 2024 as a strategic combination between Smurfit Kappa Group plc (“Smurfit Kappa”), one of\n \nthe leading integrated corrugated packaging manufacturers in Europe, with a large-scale pan-regional presence in Latin America, and\n \nWestRock Company (“WestRock”), one of the leaders in North America in corrugated and consumer packaging solutions and a\n \nmultinational provider of sustainable fiber-based paper and packaging solutions.\n  \nWe are a global leader in \nsustainable, paper-based packaging\n with extensive scale, quality products and geographic reach and\n \ndiversity. \n \nWe aim to create the ‘go-to’ packaging partner of choice, bringing together highly complementary portfolios and sets of\n \ncapabilities benefiting customers, employees and shareholders.\nBackground\nSmurfit Westrock was incorporated and registered in Ireland on July 6, \n2017,\n under the Irish Companies Act as a private company\n \nlimited by shares with registered number 607515, with the name “Cepheidway Limited.” On September 12, 2023, Smurfit Kappa and\n \nWestRock announced entry into a transaction agreement pursuant to which the companies would execute a strategic combination (the\n \n“Combination”). Prior to the Combination, Smurfit Westrock re-registered as an Irish public limited company pursuant to Part 20 of\n \nthe Companies Act 2014 of Ireland, as amended (the “\nIrish \nCompanies Act”) and was renamed “Smurfit Westrock plc.”.\n \nUpon\n \ncompletion of the Combination, Smurfit Kappa and WestRock each became wholly owned subsidiaries of Smurfit Westrock, and\n \nSmurfit Westrock continued as the new holding company of the combined group of Smurfit Kappa and WestRock. As a result of the\n \nCombination, former Smurfit Kappa shareholders and WestRock shareholders became holders of Smurfit Westrock ordinary shares.\n \nSmurfit Westrock had no historical operations nor traded or carried out any business of its own since its incorporation until just prior\n \nto consummation of the Combination.\nSmurfit Westrock has a dual listing on the New York Stock Exchange (“NYSE”) and the \nequity shares (international commercial\n \ncompanies secondary listing) category \nof the Official List of the UK Financial Conduct Authority (“FCA”), and Smurfit Westrock\n \nordinary shares trade on the NYSE and the London Stock Exchange’s main market for listed securities.\nProducts\nOur primary products fall into a number of categories, as further described below. Primarily, we produce paper-based packaging\n \nproducts. Our vertically integrated system provides raw materials of wood or recovered fiber, which are used to manufacture various\n \ngrades of board, which are then converted into packaging products. Our main categories of packaging are corrugated containers,\n \nmanufactured from containerboard; and consumer packaging, manufactured from paperboard. We also produce other grades of board,\n \nsuch as solidboard, kraft paper, and graphic board, as well as other packaging products such as solidboard packaging, paper sacks and\n \nbag-in-box\n.\n       Containerboard and Corrugated Containers\n \nContainerboard is the general term that describes the intermediate materials used to manufacture corrugated sheet, namely linerboard\n \nand medium.\n \nLinerboard is used to form the inner and outer layers of the corrugated sheet. Linerboard can be manufactured from virgin fiber\n \n(known as “kraftliner”) or recovered paper (known as “testliner”).  The recycling of old corrugated cases (“OCC”) provides the\n \nprimary source of recovered paper. In general, kraftliner is of higher quality and more versatile than testliner. Linerboard can be\n \nsurface treated to improve the printing quality through the use of white, mottled or fully bleached pulp as the top layer.\n \nMedium is used to form the inner layer of the corrugated sheet. It is primarily manufactured from recovered paper but can also be\n \nmanufactured from virgin fiber.\n \n7\nWe feed linerboard and corrugating medium into a corrugator that flutes the medium to specified sizes, glues the linerboard and fluted\n \nmedium together, and slits and cuts the resulting corrugated paperboard into corrugated sheets whose dimensions fit ultimate customer\n \nspecifications, and are subsequently converted into corrugated packaging.\nCorrugated packaging refers to the conversion of corrugated sheets through the production and the sale of corrugated containers and\n \nother corrugated products including displays. Corrugated packaging is used to provide protective packaging for shipment and\n \ndistribution of food, paper, health and beauty, and other household, consumer, commercial and industrial products. Corrugated\n \npackaging may also be graphically enhanced for retail sale, particularly in club store locations. Our corrugated packaging operations\n \nmanufactures primarily corrugated sheets, corrugated packaging and preprinted linerboard for sale to consumer and industrial products\n \nmanufacturers and corrugated box manufacturers. We produce a wide range of high-quality corrugated containers designed to protect,\n \nship, store, promote and display products made to our customers’ specifications.\n       \nPaperboard and Consumer Packaging\nPaperboard is a general term that describes the intermediate materials used primarily to produce folding cartons and other consumer\n \npackaging products. There are a number of different types of paperboard, that can be manufactured using virgin fiber or recovered\n \npaper, or\n \na recycled basestock that is laminated with kraftliner. Paperboard can be unbleached, coated or fully bleached, and\n \nmanufactured primarily using either wood or recovered fiber as a primary raw material. These are used primarily to manufacture\n \nfolding cartons and can have specialty characteristics such as grease masking and microwaveability.\nConsumer packaging is used mainly as primary packaging for products, providing convenience, marketing support and protection for\n \nproducts, and can consist of folding cartons, carriers and other containers. Our folding cartons are used to package items for industries\n \nsuch as food, paper, beverages, dairy products, confectionery, health and beauty and other household consumer, commercial and\n \nindustrial products, primarily for retail sale. Our folding cartons are also used by our customers to attract consumer attention at the\n \npoint-of-sale. We also manufacture express mail packages for the overnight courier industry, provide inserts and labels, as well as\n \nrigid packaging and other printed packaging products, such as transaction cards (e.g., credit, debit, etc.), brochures, product literature,\n \nmarketing materials (such as booklets, folders, inserts, cover sheets and slipcases) and grower tags and plant stakes for the\n \nhorticultural market. For the global healthcare market, we manufacture paperboard packaging for over-the-counter and prescription\n \ndrugs.\n       Solidboard and Solid Board Packaging\nSolidboard is a layered form of paperboard. It has an outer layer of linerboard, which is laminated onto a solid layer of recycled paper,\n \nproducing a product that is heavier and more resistant to moisture and cold than corrugated containers. Solidboard is better suited for\n \ncertain more demanding packaging applications which may be exposed to wet conditions and freezing temperatures, such as the\n \ntransportation of fresh products, including fruit, vegetables, fish, meat, poultry and dairy products. Solidboard sheets are produced in\n \npaper mills and converted into Solidboard packaging in converting units.\n      \n Graphic board\n \nGraphic board is a heavyweight type of solidboard with distinct properties, including rigidity and stability, which makes it suitable for\n \nprocessing into different applications, such as book covers, game boards, jigsaw puzzles and lever arch files, onto which sophisticated\n \ngraphics can be laminated.\n       Kraft Paper and Paper Sacks\nKraft paper is a grade of paper made primarily from wood which is used in different applications, the key one being in paper sack\n \nproduction, with the grade being known as sack kraft. Sack kraft is either converted into sacks for industrial use, transporting building\n \nmaterials, agriculture, chemicals, minerals and animal feed, or bags subject to high quality graphics for more sophisticated packaging\n \nend uses such as pet food and retail carrier bags. Other kraft paper has a large number of uses such as but not limited to paper bags,\n \nwrapping, and interleaving products.\n8\n       \nBag-In-Box\nBag-in-box is a form of packaging where a liquid is packed in a flexible plastic film or “bag” with a tap attached, which is then\n \ngenerally inserted into a corrugated container.\n \nGeographical Footprint\nWe maintain operations in \n40\n countrie\ns, primarily in \nNorth America, Latin America and Europe,\n and with some operations in Asia,\n \nAfrica and \nAustralia\n. In North America, we are a leader in corrugated and consumer packaging, containerboard and paperboard. \nIn\n \nEurope\n, we are one of the leading companies by production volume in corrugated packaging, containerboard and bag-in-box, and one\n \nof the leading producers of consumer packaging. In \nLatin America\n, we are a large-scale pan-regional player in corrugated packaging\n \nand containerboard.\n \nWe currently operate \n62\n \npaper mills\n (40 of which produce containerboard only, and 10 of which produce paperboard only, \nwith \nfive\n \nproducing both, four producing containerboard\n and another grade, one producing paperboard and another grade and two producing\n \nkraft paper only\n), \n459\n \nconverting plants (306\n \nof which convert containerboard into corrugated containers, 88 of which convert\n \npaperboard into consumer \npackaging or manufacture leaflets or labels for consumer packaging, five sack \nplants \nand 60 other\n \nconversion facilities\n), \n63 recovered fiber facilities, \ntwo\n wood procurement operations in Europe (which together provide raw material\n \nfor our mills in Europe), two forestry operation in Latin America \nand 58 distribution facilities in North America, and 31\n other\n \nproduction facilities carrying on other related activities. In addition, we own approximately\n 301,000\n acres of forest plantations in Latin\n \nAmerica, which support mill operations in addition to propagating trees for planting. Our footprint allows us to better serve customers\n \nin close proximity to our corrugated box plants.\nOur geographic reach is organized around three segments:\n•\nSmurfit Westrock North America (including the U.S., Canada and Mexico);\n•\nSmurfit Westrock \nEurope, Middle East and Africa (“MEA”) and Asia-Pacific (“APAC”); and\n•\nSmurfit Westrock Latin America (“\nLATAM”\n).\nThe North America, Europe, MEA \nand\n APAC and LATAM segments are each highly integrated within the segment and there are\n \nmany interdependencies within these operations. They each include a system of mills and plants that primarily produce a number of\n \ngrades of containerboard that is converted into corrugated containers within each segment, or is sold to third parties.\nIn addition, the North America segment also produces paperboard, kraft paper and market pulp\n;\n other paper-based packaging, such as\n \nfolding cartons, inserts, labels and displays and also engages in the assembly of displays as well as the distribution of packaging\n \nproducts.\n \nThe Europe, MEA and APAC segment also produces other types of paper, such as solidboard, graphic board, sack kraft paper and\n  \nmachine glazed paper (together known as kraft paper) and graphic paper; and other paper-based packaging, such as honeycomb,\n \nsolidboard packaging, folding cartons, inserts and labels; and bag-in-box packaging (the latter with operations located in Europe,\n \nArgentina, Canada, Mexico and the U.S., but managed under the Europe, MEA \nand \nAPAC segment).\n \nThe LATAM segment also comprises forestry; other types of paper, such as paperboard and kraft paper; and paper-based packaging,\n \nsuch as folding cartons and paper sacks.\n \nOur\n global corporate headquarters are located in Dublin, \nIreland, \nour North American operations are headquartered in Atlanta,\n \nGeorgia, U.S., our Europe, MEA and APAC operations are headquartered in Amsterdam, the Netherlands and our Latin American\n \noperations are headquartered \nin\n \nFlorida,\n U.S.\n9\nBusiness Strategy\nOur business strategy combines the key strategic priorities of both Smurfit Kappa and \nWestRock\n, with a continuing focus on the\n \nsuccessful integration of the two businesses.\n       \nOur Vision\nOur vision is to be a globally admired business, dynamically and sustainably delivering secure and superior returns for all\n \nstakeholders, comprising shareholders, employees, customers, local communities and suppliers.\n•\nGlobally Admired Business\n. \nWe strive\n to operate\n a globally admired business, underpinned by the following;\n (1) our values\n \nof \nsafety at work, loyalty, integrity and respect; (2) being an employer of choice; (3) providing a demonstrably differentiated\n \noffering to our\n \ncustomers; (4) being a leader in sustainability in the industry; and (5) being valued in excess of our peers.\n•\nDynamically and Sustainably Delivering\n. With a performance-led culture and a diverse workforce that is both driven and\n \nengaged, we seek to seize internal and external growth opportunities by engaging in disciplined and focused capital allocation\n \nin order to present a highly differentiated and sustainable offering to customers.\n•\nSecure and Superior Returns\n. In seeking secure and superior returns, we focus on strong cash generation, balance sheet\n \nstrength with significant financial flexibility and low-cost operations, and an optimum level of vertical integration to mitigate\n \ncyclical risk while maximizing the performance of our assets. We aim to have a team of dedicated and engaged employees\n \ncontinually innovating across our product range.\nOur vision guides our strategic objective of maintaining and deepening long-term customer relationships by seeking to provide\n \ncustomers with innovative and differentiated sustainable packaging solutions \nthat aim to enhance\n customers’ prospects of success in\n \ntheir end markets.\nTo achieve this objective, we have identified three key areas of focus through our integrated system:\n•\nConverting.\n Capitalize on differentiation to drive growth. This differentiation encompasses our paper-based packaging\n \nofferings corrugated and consumer packaging across our segments, along with other specialist product offerings such as bag-\nin-\nbox\n and paper sacks. The offerings are supported by our innovation initiatives.\n•\nPaper.\n Drive the optimization of our paper system to service the growth of the downstream converting businesses, taking into\n \naccount the dynamics of the marketplace. This is a particular focus in light of the enlarged paper system that was created\n \nthrough the Combination.\n•\nIntegration.\n Bring together the best of Smurfit Kappa and WestRock into a culturally aligned, customer-focused and\n \nmotivated organization.\nBased on these focus areas, we have developed the following six strategic priorities:\n1.\nIntegrating Smurfit Kappa and WestRock’s businesses, administration and cultures, and achieving synergies arising\n \nfrom the Combination;\n2.\nExpanding market positions through focused growth, including in particular driving the sustainability agenda;\n3.\nContinuing Smurfit Kappa’s and WestRock’s focus on customer engagement and innovation to become the supplier/\npartner of choice for our customers;\n4.\nEnhancing operational excellence through the continuous upgrade of customer offerings and service;\n5.\nRecruiting, retaining, developing and motivating the best people; and\n6.\nEfficiently allocating capital.\n10\nSegment Overview\nA\n)\n \nNorth \nAmerica\n Segment\nOur \nNorth American\n operations are in the U.S., Canada and Mexico.\nSales of our \nNorth America\n segment accounted for\n \n47%\n of our\n \nnet sales\n to external customers in 2024. \nThis percentage is expected \nto\n \nbe higher in 2025 as a result of the full-year inclusion of combined \nCompany\n results.\n See “Note \n3.   Segment Information\n” of the\n \nNotes to Consolidated Financial Statements, as well as Item 7. “Management’s Discussion and Analysis of Financial Condition and\n \nResults of Operations”, for additional information.\n       Products\nWe are one of the largest integrated producers of linerboard, white-top linerboard and containerboard and kraft paper in North\n \nAmerica \n(including the U.S., Canada and Mexico)\n, and we serve primarily corrugated packaging markets. We are one of the largest\n \nproducers of paperboard in North America, and we operate both integrated virgin and recycled fiber mills. Our mill system\n \nmanufactures paper for our converting system that utilizes the paper in the manufacture and sale of packaging products to our external\n \npackaging customers, together with sales of paper to external paper customers.\n \n               \nMills\nOur mill operations consist of both integrated virgin and recycled fiber mills, that produce containerboard, paperboard and specialty\n \ngrades, including kraft paper and market pulp. The majority of the output of the mill system is used in our own converting operations.\n \nWe have recycling operations in the segment whose business is conducted as a procurement function, focusing on the procurement of\n \nlow cost, high quality recycled fiber for our mill system. See Item 2. “Properties” for additional information on our annual production\n \ncapacity and types of containerboard and paperboard we manufacture, and Item 1. “Business — Sales and Marketing” for additional\n \ninformation on our vertical integration.\nIn the year ended \nDecember 31, 2024\n our containerboard mills in North America produced approximately \n8.2 million \ntons, including\n \ntons produced by WestRock before the Combination\n. In the \nyear\n ended \nDecember 31, 2024\n, our paperboard mills in North America\n \nproduced approximately \n3.1\n \nmillion tons, including tons produced by WestRock before the Combination\n.\nAny paper not used in our own operations is sold through our commercial paper operations, generating revenues primarily from the\n \nsale of containerboard, paperboard and specialty grades to external customers, and we serve primarily corrugated packaging, folding\n \ncarton, food service, liquid packaging, tobacco and commercial print markets. We sell our products globally to customers who value\n \nour scale, wide range of products, and service.\n \n              Corrugated Packaging\n \nWe convert corrugated sheets into corrugated products ranging from one-color protective cartons to graphically brilliant point-of-\npurchase packaging. Our corrugated container plants serve local customers and regional and large national accounts. We provide\n \ncustomers with innovative packaging solutions to help them promote and sell their products. We provide structural and graphic design,\n \nengineering services and custom, proprietary and standard automated packaging machines, offering customers turn-key installation,\n \nautomation, line integration and packaging solutions. We offer a machinery solution that creates pouches that replace single-use\n \nplastics, including bubble mailers.\n \n11\nWe design, manufacture and, in certain cases, pack temporary displays for sale to consumer products companies and retailers. These\n \ndisplays are used as marketing tools to support new product introductions and specific product promotions in mass merchandising\n \nstores, supermarkets, convenience stores, home improvement stores and other retail locations. We also design, manufacture and, in\n \nsome cases, pre-assemble permanent displays for these customers. We make temporary displays primarily from corrugated\n \npaperboard. Unlike temporary displays, permanent displays are restocked with our customers’ product; therefore, they are constructed\n \nprimarily from metal, plastic, wood and other durable materials. We manufacture and distribute point of sale material utilizing litho,\n \nscreen and digital printing technologies. We manufacture lithographic laminated packaging for sale to our customers that require\n \npackaging with high quality graphics and strength characteristics.\nWe also have distribution operations that generate revenues primarily from the distribution of packaging products and assembly of\n \ndisplay products. We distribute corrugated packaging materials and other specialty packaging products, including stretch film, void\n \nfill, carton sealing tape and other specialty tapes, through our network of warehouses and distribution facilities. We also provide\n \ncontract packing services, such as multi-product promotional packing and product manipulation, such as multipacks and onpacks.\nWe are the one of the largest manufacturers of corrugated packaging in North America, with operations in the U.S., Canada and\n \nMexico. In the year ended \nDecember 31, 2024\n \nour corrugated operations in North America produced approximately \n83.9 billion\n \nsquare feet, including square feet produced by WestRock before the \nCombination\n.\n \n              Consumer Packaging\n \nOur consumer packaging operations generate revenues primarily from the sale of consumer packaging products such as folding\n \ncartons, inserts and labels. We are one of the largest manufacturers of folding cartons in North America, with operations in the U.S.,\n \nCanada and Mexico. Our customers generally use our inserts and labels to provide customer product information either inside a\n \nsecondary package (e.g., a folding carton) or affixed to the outside of a primary package (e.g., a bottle). Folding cartons typically\n \nprotect customers’ products during shipment and distribution, and employ graphics to promote them at retail. We print, coat, die-cut\n \nand glue the cartons to customer specifications and ship finished cartons to customers for assembling, filling and sealing. We employ a\n \nbroad range of offset, flexographic, gravure, backside printing, coating and finishing technologies, as well as iridescent, holographic,\n \ntextured and dimensional effects to provide differentiated packaging products, and support our customers with new package\n \ndevelopment, innovation and design services and package testing services.\n \nB) Europe, MEA and APAC\n Segment\nOur Europe, MEA and APAC segment includes a system of mills and box plants that primarily produce a full line of containerboard\n \nthat is converted into corrugated containers. We operate in 23 countries across western and eastern Europe. Our main European\n \noperations are in Germany, France, the Netherlands, Italy, the United Kingdom, Spain, Sweden and Austria. \nOur Europe, MEA and\n \nAPAC operational management manage a number of operations outside Europe, including \nfour (non-European) facilities that\n \nmanufacture bag-in-box, located in \nArgentina\n, Canada\n,\n Mexico and the United States, a recently inaugurated \ncorrugated plant in\n \nMorocco, Africa, a containerboard mill and corrugated plant in India, and consumer packaging operations in China, Japan and\n \nAustralia and therefore such operations are included in the Europe, MEA and APAC segments.\n \nSales of our Europe, MEA and APAC segment accounted for \n45%\n of our \nnet sales\n \nto our external customers in \n2024\n. See “Note \n3.\n   \nSegment Information\n” of the Notes to Consolidated Financial Statements, as well as Item 7. “Management’s Discussion and Analysis\n \nof Financial Condition and Results of Operations”, for additional information.\n       \nProducts\nWe are one of the European leaders in terms of capacity in corrugated packaging, containerboard, consumer packaging and bag-in-\nbox. We also operate in several other packaging and paper market segments, such as sack kraft paper, \nmachine\n glazed paper, graphic\n \nboard, solidboard, solidboard packaging \nand\n boxboard\n.\nOur operations in the \nEurope\n, MEA and APAC\n \nsegment are highly integrated, with the total production of the mills in 2024\n \napproximately matching the volume of the containerboard that is converted into corrugated containers in our converting plants.\n \n12\n            Containerboard and Corrugated Containers\nWe operate 14 recycled containerboard mills throughout Europe (two in France, three in Germany, two in each of the United\n \nKingdom, the Netherlands and Italy, and one in each of Spain, the Czech Republic and Serbia).  Our three kraftliner mills, located at\n \nPiteå (Sweden), Facture (France), and Nettingsdorfer (Austria), are among the largest and, we believe, the lowest cost kraftliner mills\n \nin Western Europe.\n \nIn the year ended December 31, 2024, our containerboard mills in  Europe, MEA and APAC produced approximately \n6.2 million tons\n.\n \nWe are one of the leading producers of corrugated containers in Europe by capacity, with 190 production facilities (comprising\n \ncorrugated plants, sheet feeders, sheet plants and other specialized facilities). We have an extensive geographic presence in western\n \nEurope and a growing presence in eastern and southeastern Europe. We also have a containerboard mill and corrugated conversion\n \nfacility in \nIndia\n. \nIn 2024, our corrugated operations in Europe, MEA and APAC produced approximately 97.5 billion square feet.\n              Consumer Packaging\n \nWe operate \n40\n consumer packaging plants in Europe in 12 countries which primarily manufacture folding cartons, labels and leaflets\n \nfor consumer packaging markets. We are one of the largest producers in Europe. We also have operations in China, Japan and\n \nAustralia in consumer packaging.\n              Other Paperboard and Other Paper\nIn the year ended \nDecember 31, 2024\n we produced \napproximately\n 0.7 million tons of other paperboard, comprising sack kraft,\n \nmachine glazed paper, graphic board, solidboard and boxboard in five mills located in Germany and Spain. We are one of the leading\n \nmanufacturers of both solidboard and solidboard packaging in Europe.\nOur containerboard mill in the Netherlands also produces graphic paper for use in inserts. Its production in the year ended\n \nDecember 31, 2024\n was approximately 0.2\n m\nillion tons.\n              Bag-in-box\nWe are one of the largest European manufacturers in the high growth bag-in-box market, a leading European supplier of bags for bag-\nin-box packaging (primarily packaged in corrugated boxes) for the wine market, and a significant global supplier for taps for bag-in-\nbox packaging for the wine market. We have sales offices and agencies across more than 25 countries and nine bag-in-box or tap\n \nmanufacturing facilities located in \nFrance, Spain, Italy, Canada, Argentina, Mexico, Germany and the United States.\nC) \nLatin America Segment\nWe are a leading business in containerboard and corrugated containers in Latin America.\nIn Latin America, we are one of the largest producers of corrugated containers and containerboard, by volume, with corrugated\n \noperations in nine countries. Our largest operations in Latin America are in Brazil and Colombia, with other corrugated operations in\n \nArgentina, the Dominican Republic, Costa Rica, Chile and Peru, and other operations in Ecuador and El Salvador. We have operated\n \ncontinuously in Latin America since 1986.\nReliable third-party data on Latin America is not available and, therefore, statements in relation to our market position in Latin\n \nAmerica are based on management estimates.\nSales of our Latin American segment accounted for \n8%\n of our \nnet sales\n \nin 2024\n. See “Note \n3.   Segment Information\n” of the Notes to\n \nConsolidated Financial Statements, as well as Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of\n \nOperations”, for additional information.\n13\n       Products\nOur Latin American segment mill operations consist of 9 mills in three countries (Brazil, Colombia and Argentina) producing\n \ncontainerboard, consumer packaging board and sack kraft paper, with combined productions of around 1.5 million tons the year ended\n \nDecember 31, 2024\n (of which containerboard represented around 1.3\n \nmillion tons).\nThe Latin American segment also has 28 corrugated plants in 9 countries – Brazil, Colombia, Argentina, Dominican Republic, Costa\n \nRica, El Salvador, Peru, Chile and Puerto Rico. Production for the Latin American segment for the year ended \nDecember 31, 2024\n was\n \napproximately 23 billion square feet of corrugated containers.\nWe also have folding cartons operations\n in Costa Rica and El Salvador and the Dominican Republic, paper \nsack\n operations in\n \nColombia, Ecuador, Costa Rica and the Dominican Republic, and a recycling plant in Nicaragua.\n       Sales and Marketing\nW\ne provide packaging products for the transportation of a diverse range of consumer and industrial goods, such as processed and fresh\n \nfood, agricultural pr\noducts, beverages, industrial and consumer electronics, chemicals and pharmaceuticals, and a range of other\n \nproducts, as well as higher value-added corrugated products, such as those featuring enhanced graphics used for point of sale displays\n \nand consumer and shelf-ready packaging. During 2024, the majority of our products were sold to the fast-moving consumer goods\n \nsector.\n \nNo individual customer accounted for more than 10% of our net sales in 2024. \nWe generally manufacture our products pursuant to our\n \ncustomers’ orders. We believe that we have good relationships with our customers.\nA\n \n proportion of our customers are considered pan-regional, and we have\n teams devoted to managing and servicing \nthe requirements\n \nof these customers. These teams work in conjunction with local operations. \nAnother\n proportion of our customers are multi-national\n \naccounts, serviced in more than one country (or state, in the case of the U.S.) but not across a full region. We have also built teams to\n \nservice their requirements. The remaining customers are considered either multi-site national accounts within a single country or local\n \naccounts, and marketing and sales activity for these customers is primarily undertaken by local businesses. The dual approach to sales\n \nand marketing allows us to remain close to our customers irrespective of size while also\n \nstaying\n updated \non competitors’ offerings\n and\n \nlocal market developments.\nWe market our products\n th\nrough our own sales force. We also market a number of our product\ns, primarily paper, \nthrough independent\n \nsales representatives and independent distributors. We generally pay our sales personnel a combination of base salary, commissions\n \nand annual bonus. We pay our independent sales representatives on a commission basis. Orders from our customers generally do not\n \nhave significant lead times. We discuss net sales to unaffiliated customers through our foreign operations and other financial\n \ninformation in “Note \n3.   Segment Information\n” of the Notes to Consolidated Financial Statements.\nA considerable portion of our converted product sales are made under customer contracts with terms ranging from one to three years.\n \nThese agreements typically provide that the customer will source a specified percentage of its total product requirements from us on an\n \nexclusive basis, and \ntypically allow for raw material cost movements to be passed through to end pricing.\n \nOur marketing strategy focuses on product quality, design differentiation and high caliber customer service. Through continuous\n \ncommunication with customers, our goal is to improve\n our\n service quality and proactively anticipate or respond to customers’ needs.\nThe marketing strategy for our mills is to profitably match the sale of appropriate paper and containerboard to the demand\n \nrequirements of both internal and external converters located within an economically reasonable shipping distance from each mill,\n \nthereby minimizing logistics costs. Our strategy for the corrugated container and other converting plants focuses on both customized\n \nproducts tailored to fit customers’ needs and high-volume sales of commodity products, such as transport packaging for predominantly\n \nlocal markets. Most sales of converted products are made on the basis of short-term orders for specified volumes at market rates.\n \n14\nThese orders are priced based on a number of factors such as currency, volume, weight, applications (printing, die-cutting and\n \nlamination) and geographic area. We seek to maintain a broad customer base for each market to avoid customer concentration.\nSince all of our businesses operate in highly competitive industry segments, we regularly discuss sales opportunities for new business\n \nor for renewal of existing business with customers. Our packaging products compete with packaging made from other materials,\n \nincluding plastics. The primary competitive factors we face include price, design, product innovation, quality, service and\n \nsustainability, with varying emphasis on these factors depending on the product line and customer preferences. Our machinery\n \nsolutions represent one example of how we compete by providing differentiated solutions that create value for our customers. We\n \nbelieve that we compete effectively with respect to each of these factors and we obtain feedback on our performance with periodic\n \ncustomer surveys, among other means.\n       Competition\nWe operate in a competitive global marketplace. The industries in which we operate are highly competitive, and no single company\n \ndominates any of those industries.\nIn North America, our containerboard and paperboard operations compete with integrated and non-integrated national and regional\n \ncompanies operating primarily in North America, and to a limited extent, manufacturers outside of North America. Our competitors\n \ninclude large and small, vertically integrated companies and numerous smaller non-integrated companies. In the corrugated packaging\n \nand folding carton markets, we compete with a significant number of national, regional and local packaging suppliers in North\n \nAmerica. In the promotional point-of-purchase display and converted paperboard products markets, we primarily compete with a\n \nsmaller number of national, regional and local companies offering highly specialized products.\nIn Europe,\n there are different types of companies operating in the vertically integrated containerboard and corrugated container\n \nindustry; some are vertically integrated, having both containerboard and corrugated container capacity, while others may be in only\n \none of those businesses. There are also a number of companies which have a presence in more than one country, while others operate\n \nin a single geography. Our key competitors for containerboard and corrugated containers in western and eastern Europe are the other\n \nleading pan-continental producers of containerboard and corrugated containers. As containerboard and corrugated containers products\n \nare largely standardized products, competition is primarily based on price. Our key competitors for consumer packaging board and\n \nconsumer packaging are also pan-continental players.\nIn Latin America, our key competitors for containerboard and corrugated containers in Latin America are regional or national\n \ncompanies\n \nwithin the countries in which we operate, as there are few pan-continental \nor international producer\ns of containerboard and\n \ncorrugated containers. As containerboard and corrugated containers products are largely standardized products, competition is\n \nprimarily based on price. O\nur\n key competitors for consumer packaging board and consumer packaging are also pan-continental\n \nplayers.\n       Seasonality\nWhile our businesses are not materially impacted by seasonality, there is some variability in demand that occurs from quarter to\n \nquarter, \nwith net sales in the first quarter of each year typically being the lowest\n.\n Generally, we expect more of our earnings and cash\n \nflows to be generated in the second half of the year than in the first half of the fiscal year due to these variations and other factors\n.\n       Raw Materials\nThe primary raw materials used by our mill operations are recycled fiber at our recycled containerboard and paperboard mills and\n \nvirgin fiber from hardwoods and softwoods at our virgin containerboard and paperboard mills. Certain of our virgin containerboard is\n \nmanufactured with some recycled fiber content.\n15\nIn Europe, the principal raw materials for the recycled containerboard, recycled consumer packaging board, solidboard and graphic\n \nboard mills are various grades of recovered papers and, in particular, OCC. In Europe, we source recovered paper in a number of\n \ndifferent ways, which we refer to as “grip” levels, through sources we\n \ndirectly control or with whom we\n \nhave contracts, with the\n \nr\nemainder being acquired primarily under spot purchases. We believe this security of supply to be a significant benefit at times when\n \nrecovered fiber is in short \nsupply\n.\n \nFrom a price perspective, most of our requirements in Europe are linked to official reference prices and are therefore based on market\n \nprices.\nOur kraftliner mills and sack kraft mill require virgin fiber as their principal raw material. We purchase virgin fiber on the open market\n \nthrough contractual arrangements and, in some cases, \ncooperate \nwith landowners to develop forest resources. We are not reliant on any\n \none supplier for a substantial portion of our raw materials sourced from third parties.\nOur overall fiber sourcing for all of our mills in \nNorth America is approximately 55\n% virgin and 45%\n recycled\n. Recycled fiber prices\n \nand virgin fiber prices can fluctuate significantly. We source virgin fiber from third party sources, and recycled fiber through a\n \ncombination of our own depots, long and short term contracts and from the open \nmarket\n.\nOur overall fiber sourcing for our mills in Europe, MEA and APAC is approximately 24% virgin and 76% recycled. Recycled fiber\n \nprices in particular can fluctuate significantly, and may not necessarily move in the same direction or quantum as in other regions. We\n \nsource virgin fiber in Europe from third party sources, and \nrecycled\n fiber through a combination of our own depots, long and short\n \nterm contracts and on the open market.\nOur overall fiber sourcing for our mills in Latin America is approximately 58\n% virgin and 42% recycled\n. Recycled prices in particular\n \ncan fluctuate significantly and vary from country to country in Latin America. We source virgin fiber primarily from our own forestry\n \nbases in Colombia and Brazil, but also from the market. We source recycled fiber through a combination of our own depots, long and\n \nshort term contracts and from the open market.\nContainerboard and paperboard are the primary raw materials used by our corrugated and consumer packaging converting operations\n \nin our operating segments. Our converting operations use many different grades of containerboard and paperboard. We supply\n \nsubstantially all of our converting operations' needs for containerboard and paperboard from our own mills and through the use of\n \ntrade swaps with other manufacturers. These arrangements allow us to optimize our mill system and reduce freight costs. Because\n \nthere are other suppliers that produce the necessary grades of containerboard and paperboard used in our converting operations, we\n \nbelieve we would be able to source significant replacement quantities from other suppliers in the event that we incur production\n \ndisruptions for recycled or virgin containerboard and paperboard.\nEnergy\nWe incur energy costs in our mill operations and the cost of natural gas, oil, electricity and purchased biomass fuel is subject to\n \nfluctuations. In our recycled mills, we primarily use natural gas and electricity, supplemented at certain mills with fuel oil. In our\n \nvirgin fiber mills, we primarily use biomass and natural gas, supplemented at times with fuel oil, and, at a limited number of facilities,\n \ncoal, to generate steam used in the pulping and paper making processes and to generate some or all the electricity used on site. We\n \nprimarily use purchased electricity and natural gas to operate our converting facilities. We generally purchase these products from\n \nsuppliers at market or tariff rates. We use commodity contracts to hedge energy exposures.\n See Item 1. “Business — Governmental\n \nRegulation — Environmental” and Item 7A. “Quantitative and Qualitative Disclosures About Market Risk — “Energy” for additional\n \ninformation.\nTransportation\nWe also incur costs of inbound and outbound freight in our business. Factors that influence our freight expense are distance between\n \nshipping and delivery locations, distance from our facilities to customers and suppliers, mode of transportation (rail, truck, intermodal\n \nand ocean) and freight rates, which are influenced by supply and demand and fuel costs. The principal markets for our products are in\n \nNorth America, Europe and Latin America\n.\n16\nInnovation\nOur approach \nto innovation focuses on helping customers save more, sell more, and optimize packaging solutions to improve\n \nconsumer experience.\nOur innovation model prioritizes agility for faster innovation and smarter testing, promoting global innovation with local relevance,\n \nfostering end-to-end circular packaging innovation, and enabling quicker, better decision making with market-leading capabilities.\nWe emphasize local implementation and strong coordination to optimize efficiency and effectiveness across all operations and\n \ncustomer interactions. To help achieve this, we have 30 interconnected customer-centric Innovation and Experience centers,\n \nstrategically positioned throughout the organization. These hubs are responsible for bringing to life a “local” approach by aligning the\n \nglobal vision with local customization influenced by the culture, trends and customer needs. Additionally, \nour\n European innovation\n \nteam focuses on \ncustomer focused\n initiatives, backed by market-leading capabilities. We also have an innovation center in Richmond,\n \nVirginia which focuses on solutions for converted products, paper and processes.\nWe\n have a suite of tools to support\n our\n innovation and selling efforts. The strength of these tools is the fact that they are internally\n \ndeveloped and are equally available to all operations.\n \nDemonstrating our industry leadership, in 2024, we won 106 awards across a host of categories, including design, safety,\n \nsustainability, community engagement and as a top employer. We were recognized for our technical innovation and creativity by\n \nwinning 16\n \nawards at the Flexographic Industry Association UK awards in addition to 13 WorldStar 2024 awards, more than any other\n \nentrant. We were also the proud winner of PepsiCo’s “Supplier of the Year” award, as well as Mondelez’ “Supplier of the Year”\n \naward.\nOur “Better Planet \nPackaging\n” initiative aims to develop our\n \nsustainable packaging to positively impact global supply chains, \nimprove\n \nour packaging environmental footprint and reduce packaging traces on the planet. Characteristics of Better Planet Packaging include:\n•\noptimized and fit-for-purpose materials;\n•\nreduced carbon footprint;\n•\ndesigned to be recyclable and are actually recycled;\n•\nmanufactured with recycled material when possible, and sustainably sourced virgin material when needed; and\n•\nnaturally biodegradab\nle.\n \nTo support the market in developing and implementing innovative packaging solutions more rapidly, reliably and collaboratively, we\n \nlaunched our Design2Market concept in 2022. With over 80 successful projects executed for leading brands, our customers benefit\n \nfrom a streamlined testing process, reduced risk and sustainable packaging options, all aligned with our commitment to innovation and\n \nsustainability through the Better Planet Packaging initiative.\nSustainability\n       \nCommitment to Sustainability Matters\nAt Smurfit Westrock we are committed to creating packaging solutions that protect what we all care about. We believe this\n \ncommitment is evident in our culture and behaviors at all levels and across all areas of our business, informing our strategic business\n \ndecisions and actions, now and into the future.\n \nAs a global leader in \nsustainable, paper-based packaging\n, we are proud to create solutions from renewable and recyclable materials,\n \nthat help deliver a better future for all. Together, we are committed to being an impactful business and supporting a greener, bluer\n \nplanet.\n \n17\nThere is strong oversight of sustainability and related matters within the Company. The Sustainability Committee of the Company’s\n \nBoard of Directors (the “Board”) has been in place since the completion of the Combination and met on three occasions in 2024.\n \nClimate change is a regular agenda ite\nm\n \nat Board Committee meetings, where the Sustainability Committee reviews various aspects of\n \nthe Company’s climate strategy, stakeholder expectations and the evolving regulatory landscape. The Company’s chief executive\n \nofficer (the “CEO”), through his overall responsibility for the day-to-day oversight of the Company’s business and the implementation\n \nof the Company strategy and policies, is directly responsible for actions governing sustainability, including areas such as climate\n \nchange. He is also responsible for providing that the Company’s purpose, values and culture are instilled throughout the Company.\n \nThe CEO is also a Director of the Board.\n \nAs a responsible company, operating globally, we provide products that are\n \nsustainable, driven by a culture with strong values of\n \nloyalty, integrity, respect and safety at work\n. We understand the challenges facing both our business and the planet and are committed\n \nto doing our part in resolving these critical issues. Our ambition is to deliver sustainable growth for the benefit of all our stakeholders\n \nbased on three pillars: Planet, People and Impactful Business.\n \n       \nPlanet\nThe circular economy has long been the core of our business. We use renewable, recyclable, \nand \nrecycled materials to create\n \ninnovative, sustainable packaging solutions. As a leading consumer of recycled fiber, we play our part in the circular economy by\n \nrecycling\n old paper-based packaging\n.\n The virgin wood fiber we use is sourced from responsibly managed forests and all our fiber-\nbased manufacturing facilities have been chain of custody certified to internationally recognized standards. We work with our\n \ncustomers to help them deliver on their sustainability goals.\n      \n \nPeople and Communities\nHaving engaged employees is critical for the success of our business. We are committed to providing an inclusive and safe place to\n \nwork for the talented people in our globally and culturally diverse organization. Our commitment also extends to all of the\n \ncommunities in which we operate.\n       Impactful Business\nThrough our activities, we aim to create sustainable value for our customers, investors, employees, suppliers and the communities in\n \nwhich we are privileged to operate. We innovate and partner with our customers to create packaging solutions that can replace less\n \nsustainable materials and reduce their carbon footprint. We aim to do this with the highest ethical business standards.\nOur sustainability report is expected to be made available on our website in the second quarter of 2025 at\n \nwww.\nsmurfitwestrock.com/\nsustainability\n. The information contained in our sustainability reports is not incorporated by reference \ninto\n this Form 10-K and should\n \nnot be considered part of this or any other report that we file with or furnish to the SEC.\n       Climate-Related Disclosures\nWe recognize the need for climate-related disclosures as part of our commitment to sustainability and responsible corporate\n \ncitizenship. We plan to publish an overview of our approach to climate risk management in the \nfirst\n half of 2025 which will take into\n \nconsideration the recommendations of the Task Force on Climate-related Financial \nDisclosures \nas part of our sustainability reporting\n \nfor 2024.\n       Sustainability Performance\nDue to the mid-year merger of Smurfit Kappa Group and WestRock, consolidated targets and data are not yet available but are\n \nexpected to form an integral part of our reporting on the 2025 financial year.\n \nFor our 2024 calendar year reporting, we plan to report\n \non a selection of each of the legacy company’s key sustainability metrics.\n \n18\n       Environmental Regulations\nWe may incur additional compliance costs and burdens resulting from the enactment of new laws and regulations aimed at reducing\n \ncarbon emissions, which could take the form of cap-and-trade, carbon taxes or a greenhouse gas (“GHG”) reduction mandate.\nWe may also incur higher prices for certain raw materials and fuels, including biomass and natural gas, related to the transition to a\n \nlower-carbon economy or the enactment of GHG reduction mandates. Also, new climate rules and regulations that result in fuel\n \nefficiency standards could increase our transportation costs.\nCertain jurisdictions in which we have manufacturing facilities or other investments have already taken actions to address climate\n \nchange.\nWe also operate in countries or regions that have already adopted GHG emissions trading schemes such as the European Union where\n \nwe are subject to the impact on energy prices and compliance from the\n E\nU\n Emission Trading \nScheme\n Directive.\nHuman Capital Resources\n \nPeople are our priority. Our primary objective is to provide a great place to work for all our colleagues guided by our commitment to\n \nequal employment opportunity for all. We understand that our success is driven by our highly valued and motivated, diverse teams\n \nacross the world.\n \nBy building a safe and inclusive work environment that empowers and inspires our global workforce, our people will\n \nbe able to thrive and grow our business. Our responsibility as an employer is to create a workplace where people can earn a fair living,\n \nwhere they will be safe and can return home to their families every day, and to provide the conditions where they feel valued and\n \nrespected.\nAs of December 31, 2024, we employed approximately 100,000 people in the \n40\n countries in which we operate\n, of which\n \napproximately 52,500 were in the \nNorth America segment, approximately 37,000 in Europe, MEA and APAC, and approximately\n \n10,500 in the Latin America segment. \nOur businesses can be seasonal in nature which results in peaks and troughs in employment\n \nnumbers across certain sections of our workforce. These changes are managed through fair and flexible hiring practices in accordance\n \nwith applicable laws.\nAs of December 31, 2024, approximately 54% of our hourly employees in the U.S.\n worked pursuant to collective bargaining\n \nagreemen\nts and \n60%\n of our employees in Europe were covered by collective labor agreements. The majority of our unionized\n \nemployees are represented by the United Steel Workers. During 2025, we expect to negotiate for renewal or extension of 27 contracts\n \n(27% of total contracts) that have recently expired or that will expire during the year. During 2024, we experienced no work\n \nstoppages, and we believe we have satisfactory labor relations with our employees.\n \n       Safety, Health and Well-Being\n \nWe promote a strong culture of safety and well-being. The safety and well-being of our employees, contractors and other stakeholders\n \nis paramount to us, and is a core value for Smurfit Westrock. Operating safely is a non-negotiable, and our ‘Safety for Life’ Program is\n \nembedded across many of our operations; this will continue to be deployed in our expanded organization and facilities.\n \nWe strive\n \nevery day to ensure that each of our colleagues return home safely.\n  \nSmurfit Westrock invests substantial time, effort and financial resources to comply with applicable regulations and ensure a safe\n \nworkplace. In 2024, we achieved a lost time incident rate of 0.27, and a global Total Recordable Incident Rate of 0.58 for the\n \ncombined group, based on the number of incidents per 200,000 work hours for employees and contractors globally. Beyond reporting\n \nof incidents, we proactively invest in initiatives, tools, technology and safety programs across the group, to make incident reporting\n \neasier, to ensure the right safety conversations are happening, and to better control and mitigate potential risks.\n \n19\n       An Employer of Choice\nWe are truly a diverse organization with approximately 100,000 colleagues from across the \n40\n countries in which we operate. We are\n \ncommitted to fostering a safe, respectful and inclusive workplace where everyone has a real sense of belonging and can be their\n \nauthentic selves at work every day. We strive for a culture and a workplace where all our employees feel valued, respected, and\n \nempowered to thrive. Our people priorities, which are designed to help us develop a sustainable business, includes a focus on\n \nemployee engagement, people development and social support to our communities.\nWe have a number of communications coordinators and Employee Resource Groups\n \nin each region which focus on the topics that\n \nmatter most locally.\n \nThese groups have been established on a voluntary basis, are employee-led based on common interests and\n \nbackgrounds, and have executive sponsorship to help with momentum, profile and resourcing.\n  \nWe are deeply committed to our communities and collaborating with them. We encourage our local teams to connect with their\n \ncommunities through social and environmental initiatives.\n \nOur Open Community initiatives cover all aspects of our involvement with\n \nour communities around the world, with almost 200 projects in flight centered on four pillars:\n \nEmpowering\n \nCommunities,\n \nEncouraging Wellbeing, Inspiring Our Future and Protecting Our Planet.\n \n       Culture & Engagement\n \nOur culture is rooted in our values, which expects each employee, leader and function to live our values of safety, integrity, respect\n \nand loyalty. We infuse our values through our ways of working and communication across the organization.\n I\nn addition to engagement\n \nand pulse surveys (we anticipate carrying out the first Smurfit Westrock global employee engagement survey in the first half of 2025),\n \nwe also encourage regular, live communication across the organization and host quarterly global town halls with our senior leadership\n \nthat include business updates and employee question-and-answer sessions. In addition, regional business town halls are held on a\n \nregular basis.\n       \nLearning and Development\n \nFor employees, across all levels and businesses in our Company, our learning and development programs equip employees with the\n \nrelevant skills to be effective in their current roles and also to prepare them for the future, both within and outside of Smurfit\n \nWestrock.\n  \nAs a business with a strong track record of \ndeveloping\n talent internally, our talent planning initiatives and programs help our business\n \nto ensure we have the right people, with the right experience ready to progress in their careers as critical roles and talent needs arise.\n  \nThrough our talent cycle of talent identification, succession planning and talent development, we have been able to ensure talent\n \nmobility across the organization in a timely manner into key vacancies.\n  \nThrough our Smurfit Westrock Learning Academy, we have a number of key management development programs which take place\n \nannually\n, including\n Regional Graduate Programs, \nAdvanced Management Development Progra\nm\n and Global Manager Program. These\n \nserve to ensure that we retain, motivate and develop employees, allowing us to have a robust talent pipeline at all career stages.\n \nWe\n \npartner with leading academic \ninstitutions\n,\n including Harvard and INSEAD, which allow us to leverage global best practice in this\n \narea. Since 2016 our flagship leadership development program, Open Leadership, runs in partnership with INSEAD business school\n \nand has seen more than 500 of our senior leaders attend this year long three-module program.\n \nThis investment in our leadership\n \ncommunity is based on the belief that business performance is linked to human behavior.\n20\n       Compensation & Benefits\nWe believe our compensation packages provide the appropriate incentives to attract, retain and motivate our employees, and\n \nultimately to grow our business. Our compensation programs are designed to re-enforce performance, our business growth and our\n \ntalent strategy. We provide base pay that is market relevant and competitive and that aligns with employee positions, skill levels, and\n \nexperience. In addition to base pay, we provide opportunity for employees to receive annual performance-based incentive awards for\n \ncertain jobs and job levels. Our employee benefits packages, which vary by country and region, are competitive and local market\n \nrelevant.\n \nWe continue to evolve our medical and welfare benefits programs to ensure we provide for employees’ health and well-being,\n \nincluding\n employee assistance programs. Additionally, to foster a strong sense of accountability and ownership, and align the interests\n \nof managers with shareholders, we grant stock-based incentives to our most senior manager levels.\nWe are committed to equal pay for equal work. To deliver on that commitment we conduct frequent pay analysis, global pay equity\n \nbenchmarking and job analysis, and review our pay practices annually.\nPatents and Other Intellectual Property\nWe hold a substantial number of foreign and domestic trademarks, trademark applications, trade names, patents, patent applications\n \nand licenses relating to our business, our products and our production processes. Our patent portfolio consists primarily of utility\n \npatents relating to our products and manufacturing operations, including proprietary automated packaging systems. Our company\n \nname and logo, and certain of our products and services, are protected by domestic and foreign trademarks. Our patents, trademarks\n \nand other intellectual property rights, particularly those relating to our manufacturing operations, are important to our operations as a\n \nwhole. Our intellectual property has various expiration dates.\nGovernmental Regulation\n       Health and Safety\nOur business involves the use of heavy equipment, machinery and chemicals and requires the performance of activities that create\n \nsafety exposures. Safeguarding the health, safety and overall welfare of our team is core to how we operate and critical to attracting\n \nand retaining the best talent, while also playing a pivotal role in realizing our business and sustainability objectives. We implement our\n \nhealth and safety requirements through comprehensive safety management systems that include global policies, performance\n \nstandards, implementation tools, guidance documents, standardized forms, best practice sharing and operational learning. We seek to\n \nreduce exposures and eliminate life changing events through engagement, execution of targeted, results-driven activities, and\n \nimplementation of systems that promote continuous improvement.\nWe are subject to a broad range of foreign, federal, state and local laws and regulations relating to occupational health and safety, and\n \nour safety program includes measures required for compliance. We have incurred, and will continue to incur, operating costs and\n \ncapital expenditures to meet our health and safety compliance requirements, as well as to continually improve our safety systems. We\n \nbelieve that future compliance with occupational health and safety laws and regulations will not have a material adverse effect on our\n \nresults of operations, financial condition or cash flows.\nCertain governmental authorities in locations where we do business have established asbestos standards for the workplace. Although\n \nwe do not use asbestos in manufacturing our products, asbestos containing material (“ACM”) is present in some of the facilities we\n \nown or lease. For those facilities where ACM is present and ACM is subject to regulation, we have established procedures for properly\n \nmanaging it.\n21\n       Environmental\nEnvironmental compliance requirements are a significant factor affecting our business. Our manufacturing processes involve the use\n \nof natural resources, such as virgin wood fiber and fresh water, discharges to water, air emissions and waste handling and disposal\n \nactivities. T\nhese processes are subject to numerous federal, state, local and international environmental laws and regulations, as well as\n \nthe requirements of environmental permits and similar authorizations issued by various governmental authorities.\nWe invested approximately $127 millio\nn of capital expenditure during fiscal 2024 on matters relating to environmental compliance.\n \nThis is the combined amount between Smurfit Kappa and \nWestRock;\n however, it is an approximation as the same definitions and\n \nmethodology were not used by the respective companies in calculating it and this number remains subject to review and adjustments\n \nas we refine our methodology post-combination.\nAvailable Information\nOur website address is www.smurfitwestrock.com, and our investor relations website is https://investors.smurfitwestrock.com. We\n \npromptly make available on our investor relations website, free of charge, the reports that we file or furnish with the SEC, corporate\n \ngovernance information (including our Code of Conduct and Code of Ethical Conduct for Directors and Senior Financial Officers) and\n  \nselect press releases. None of the information on our website is incorporated into this Annual Report on Form 10-K or any other\n \nfilings  the Company makes with the SEC. We file annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on\n \nForm 8-K, proxy and information statements, and amendments to reports filed or furnished pursuant to Sections 13(a), 14, and 15(d)\n \nof the Exchange Act. The SEC maintains a website at www.sec.gov that contains reports, proxy and information statements, and other\n \ninformation regarding Smurfit Westrock and other issuers that file electronically with the SEC.\n \nFrom time to time, we have used, and expect in the future to use, our website as a means of disclosing material information to the\n \npublic in a broad, non-exclusionary manner, including for purposes of the SEC’s Regulation Fair Disclosur\ne\n. Financial and other\n \nmaterial information regarding the Company is routinely posted on our website and accessible at \nhttps://\ninvestors.smurfitwestrock.com\n. In order to receive notifications regarding new postings to our website, investors are encouraged to\n \nenroll on our website to receive automatic email alerts.\nInformation About Our Executive Officers\nOur executive officers as of the date of this Annual Report on Form 10-K are as follows:\nAnthony Smurfit,\n 61,\n \nserves as our President \n&\n Group Chief Executive Officer, a position he held since 2024 and as director of\n \nSmurfit Westrock since 2023. He served as a director of Smurfit Kappa, our now subsidiary, and its predecessors from 1989 until the\n \nCombination closed on July 5, 2024 and as Group Chief Executive Officer of Smurfit Kappa between 2015 and July 5, 2024. Prior to\n \nt\nhat\n, he served as Group Chief Operations Officer of Smurfit Kappa from 2002 until 2015. He was Chief Executive of Smurfit Europe\n \nfrom October 1999 to 2002 prior to which he was Deputy Chief Executive of Smurfit Europe and previously Chief Executive Officer\n \nof Smurfit France.\nKen Bowles\n, 53, serves as our Executive Vice Pr\nesident & Grou\np Chief Financial Officer, a position he held since 2024 and as\n \ndirector of Smurfit Westrock since 2023. He joined a predecessor of Smurfit Kappa, our now subsidiary, in 1994 and occupied a\n \nnumber of finance roles in various parts of Smurfit Kappa and its predecessors. He was appointed Group Chief Financial Officer of\n \nSmurfit Kappa in 2016, prior to which he was the Financial Controller between 2010 and 2016. He served as a director of Smurfit\n \nKappa between 2016 and the completion of the Combination on July 5, 2024. Previously, he served as Smurfit Kappa’s Head of Tax\n \nfrom 2007 to 2010, prior to which he was appointed as the first Head of Compliance in 2004.\nLaurent Sellier, \n56,\n serves as our President &\n C\nhief Executive Officer, North America (including\n Mexico\n), a position he held since\n \nthe completion of the Combination on July 5, 2024. He joined Smurfit Kappa, our now subsidiary, in 1994 as an internal auditor, and\n \nsince then has worked in several positions across Smurfit Kappa in France, the United Kingdom, Spain and the Netherlands. Mr.\n \nSellier was appointed Chief Executive Officer of Smurfit Kappa Americas in January 2022. Mr. Sellier was formerly the Chief\n \nOperating Officer of the Smurfit Kappa Europe Paper and Board\n Division.\n22\nSaverio Mayer, \n59\n,\n \nserves as our President \n&\n Chief Executive Officer, Europe, MEA and APAC, a position he held since the\n \ncompletion of the Combination on July 5, 2024. He joined Smurfit Kappa, our now subsidiary, in 1986 and since then has held a\n \nnumber of commercial and operational roles. Mr. Mayer was appointed Chief Executive Officer, Europe, at Smurfit Kappa in April\n \n2017. \nFormerly\n Mr. Mayer was Head of Pan European Sales in 1996, before taking up the position of Chief Executive Officer of\n \nSmurfit Kappa Italy in 2001. In conjunction with his role in Italy, Mr. Mayer also served as the Chief Executive Officer of Smurfit\n \nKappa Russia from 2007 to 2009, Chief Executive Officer of Smurfit Kappa Poland from 2007 to 2011 and since 2011 was\n \nresponsible for the Bag-in-Box (“BIB”) Division. In September 2015, he was appointed Chief Operations Officer of Corrugated and\n \nConverting Europe and was responsible for the operational, sales, and financial performance of the corrugated plants and BIB\n \nDivision.\nAlvaro Henao\n, 59,\n \ncurrently serves as our President &\n \nChief Executive Officer, LATAM, a position he held since February 1, 2025.\n \nPrior to this role, Mr. Henao served as the Company’s Senior Vice President of Integration, the role he has held since 2024.\n \nPreviously, over the course of 36 years, he held various positions of increased responsibility at Smurfit Kappa, our now subsidiary.\n \nMost recently, between 2013 and 2023, he served as Chief Executive Officer, Central \nCluster\n, at Smurfit Kappa.\nBen Garren\n, 63, serves as our EVP \n& Group General Counsel, a position he held since July 8, 2024. Prior to his current position, Mr.\n \nGarren worked for The Coca-Cola Company, a multinational beverage corporation, for more than 24 years, during which he held a\n \nnumber of senior legal roles, including most recently serving as General Counsel, International between 2018 and 2021, overseeing\n \nlegal operations for EMEA, LATAM and APAC Groups, and prior to that, he served as General Counsel, North America. Before\n \njoining The Coca-Cola Company, Mr. Garren practiced law in New York as a litigation associate with leading law firms Baker Botts\n \nLLP and Cravath, Swaine & Moore LLP.",
  "item7": "Item 7. Management’s Discussion and Analysis \nof F\ninancial Condition and Results of Operations\nMANAGEMENT\n’S DISCUSSION AND ANALYSIS OF THE FINANCIAL CONDITION AND RESULTS OF \nOPERATIONS OF SMURFIT WESTROCK\nThe following discussion and analysis of Smurfit Westrock’s financial condition and results of operations should be read in\n \nconjunction with \nSmurfit Westrock’s audited Consolidated Financial Statements and their related \nnotes\n for the  year ended December\n \n31, 2024\n, \nour audited Consolidated Financial Statements and their related notes for the year ended December 31, \n2023\n and Smurfit\n \nKappa’s audited Consolidated Financial Statements and their related notes for the year ended December 31, 2023\n, as well as the\n \ninformation under the heading “Management’s Discussion and Analysis of the Financial Condition and Results of Operations of\n \nSmurfit Kappa” that were disclosed in Smurfit Westrock’s Registration Statement on Form S-4 (file number 333-278185) which was\n \ndeclared effective on April 26, 2024 (as supplemented by the prospectus filed with the SEC on April 26, 2024, the “Registration\n \nStatement”). This discussion contains forward-looking statements that involve risks and uncertainties. Smurfit Westrock’s future\n \nresults could differ materially from the results discussed below. Factors that could cause or contribute to such differences include, but\n \nare not limited to, those identified below and those discussed in the Item 1A. Risk Factors. Please refer to the sectio\nn\n \nabove\n \nentitled\n \n“Cautionary Note Regarding Forward-Looking Statements\" for additional \ninformation\n.\nSmurfit Kappa was determined to be the accounting acquirer in the Combination; therefore, the historical consolidated financial\n \nstatements of Smurfit Kappa for periods prior to the Combination were also considered to be the historical financial statements of the\n \nCompany. Unless otherwise specified or the context otherwise requires, all references to the “Company” and “Smurfit Kappa” refer\n \nto Smurfit Kappa Group plc and its subsidiaries and their operations when referring to periods prior to the closing of the\n \nCombination, and references to the “Company” and “Smurfit Westrock” refer to the combined company, Smurfit Westrock and its\n \nsubsidiaries, including, among others, Smurfit Kappa and WestRock, when referring \nto\n periods after the Combination.\nOVERVIEW\nSmurfit Westrock is one of the world's largest integrated manufacturers of paper-based packaging products in terms of volumes and\n \nsales, with operations in North America, South America, Europe, Asia, Africa, and Australia. Smurfit Westrock partners with its\n \ncustomers to provide differentiated, sustainable paper and packaging solutions that enhance its customers’ prospects of success in their\n \nmarkets.\n \n  \nTransaction Agreement and Combination with WestRock\nOn September 12, 2023, Smurfit Kappa, a public company incorporated in Ireland, and WestRock, a public company incorporated in\n \nDelaware, United States, announced they had reached a definitive agreement on the terms of a proposed combination.\nAs described elsewhere in this report, the Combination closed on July 5, 2024. Pursuant to the \nTransaction Agreement, on the Closi\nng\n \nDate each issued ordinary share, par value €0.001 per share, of Smurfit Kappa (a “Smurfit Kappa Share”) was exchanged for one\n \nordinary share, par value $0.001 per share, of Smurfit Westrock (a “Smurfit Westrock Share”) and, in exchange for the net assets of\n \nWestRock acquired throu\ngh t\nhe Merge\nr,\n each share of common stock, par value $0.01 per share, of WestRock (the “WestRock\n \nCommon Stock”), was converted into the right to receive one Smurfit Westrock Share and $5.00 in cash (the “Merger Consideration”)\n \nfor an aggregate cash consideration of $1,291 million (the “Cash Consideration”) and issuance of 258,228,403 shares to WestRock\n \nshareholders. \n \nUpon completion of the Combination, Smurfit Kappa and WestRock each became wholly owned subsidiaries of Smurfit Westrock\n \nwith Smurfit Kappa shareholders owning approximately 50.3% and WestRock shareholders owning approximately 49.7%. Prior to the\n \nclosing of the Combination, Smurfit Westrock had no operations other than activities related to its formation and the Combination.\n \nGiven the non-operational nature of the Company prior to the Combination, the Smurfit Kappa Share Exchange is not considered a\n \nbusiness combination and does not give rise to any goodwill or adjustments to accounting basis.\n54\nThe consolidated financial statements of Smurfit Westrock following the Smurfit Kappa Share Exchange are a continuation of the\n \nfinancial statements of Smurfit Kappa and therefore, the historical consolidated financial information for periods prior to the\n \nCombinati\non,\n \ninc\nluding the comparatives presented, reflect the pre-Combination carrying values of Smurfit Kappa except for the\n \nretrospective adjustment to reflect the Company’s legal share capital as the successor after giving effect to the Smurfit Kappa Share\n \nExchange.\nThe Merger is recognized as a business combination under Accounting Standards Codification (“ASC”) 805, “Business\n \nCombinations” (“ASC 805”). Smurfit Kappa was determined to be the accounting acquirer of WestRock. Accordingly,\n as noted\n \nabove, \nthe financial statements reflected in these Consolidated Financial Statements and the discussions below include WestRock's\n \nfinancial position and results of operations for the period subsequent to the completion of the Combination on July 5, 2024.\n \nConsequently, the\n results reported for the twelve months ended December 31, 2024 do not include WestRock’s financial results for the\n \nfirst five days of July or any prior periods.\nRefer to “Note \n2. Acquisitions\n” of the Consolidated Financial Statements for additional information related to the accounting for the\n \nCombination.\nFollowing the completion of the Combination, Smurfit Westrock reassessed the Company’s reportable segments due to changes in\n \norganizational structure and how the Company’s chief operating decision maker (“CODM”) makes key operating decisions, allocates\n \nresources and assesses the performance of the business. Consequently, subsequent to the Combination, Smurfit Westrock began to\n \nmanage the combined business as three reportable segments: (1) North America, \n(2) \nEurope, the Middle East and Africa (“MEA”),\n \na\nnd Asia-Pacific (“APAC”),\n and (3) Latin America (“LATAM”). As a result of the change in reportable segments, certain prior year\n \namounts have been \nrecast\n \nto conform to the current year presentation. Throughout this \nAnnual Report on \nForm 10-K, unless otherwise\n \nindicated, amounts and activity reflect reclassifications related to the Company's change in reportable segments. Refer to “\nNote \n3.\n \nSegment Information\n” of the Consolidated Financial Statements for further discussion of the Company’s segment reporting structure\n.\nE\nXECUTIVE SUMMARY\nS\nmurfit Westrock’s net sales \nincreased\n by $\n9,016\n million, to $\n21,109\n million in the year ended \nDecember 31, 2024\n, from \n$12,093\n \nmillion\n in the year ended \nDecember 31, 2023\n. \nThis increase was primarily due to the acquisition of WestRock and a positive volume\n \nimpact partially offset by a lower selling/price mix\n.\nNet income attributable to common shareholders \ndecreased\n by \n$506 million\n, to $\n319\n million in the year ended \nDecember 31, 2024\n,\n \nfrom \n$825 million\n in the year ended \nDecember 31, 2023\n. \nThis decrease was primarily driven by an increase of \n$317 million\n in\n \ntransaction and integration-related expenses associated with the Combination, an increase of \n$259 million\n in interest expense, net, and\n \na charge of \n$224 million\n for the amortization of the fair value step up on inventory recognized on WestRock’s inventory acquired. \nThe\n \nincreases in expenses\n were partially offset by the positive\n impact of the Combination\n.\n Refer to “Results of Operations” for a detailed\n \nreview of Smurfit Westrock’s performance.\nNet\n cash provided by operating activities \ndecreased\n by \n$76\n million, to $\n1,483\n million in the year ended \nDecember 31, 2024\n, from\n \n$\n1,559\n million in the year ended \nDecember 31, 2023\n, primarily due to a \n$508\n million increase in the outflow in the change in\n \noperating assets and liabilities driven by\n additional operating cash flow activity as a result of the Combination,\n higher\n \nvo\nlumes\n \n(excluding acquisitions) in the Europe, MEA and APAC\n segmen\nt\n, and an increased outflow for \ncreditors\n in the North America\n \nsegment\n.\n \nThe\n increase in the \ncash outflows\n from changes in operating assets and liabilities was partially offset by the \n$432\n million\n \nincrease in net income adjusted for non-cash items, \nincluding depreciation, depletion and amortization, cash surrender value increase\n \nin excess of premiums paid, \nimpairment charges on \nassets other than goodwill\n, share-based compensation expense, deferred tax\n \n(benefit) expense, and pension and other post-retirement funding \nmore \nthan cost\n, resulting in a net decrease in cash flows from\n \noperating activities. \nDuring the year ended \nDecember 31, 2024\n, Smurfit Westrock invested $\n1,466\n million in capital expenditures and\n \npaid $\n719\n million in cash for purchase of businesses, net of cash acquired. \nThe Company’s net \ncash inflow from changes in debt\n \nwas\n \n$1,367 million\n,\n \na\nnd it paid $\n650\n million of cash dividends to shareholders.\n \nSee\n the section entitled “Liquidity and Capital Resources”\n \nbelow for additional information.\n55\nSIGNIFICANT\n \nFACTORS AND TRENDS AFFECTING SMURFIT WESTROCK’S \nRESULTS\nSmurfit Westrock’s operations have been, and will continue to be, affected by many factors, some of which are beyond the Company’s\n \ncontrol. Smurfit Westrock’s net sales are primarily derived from the sale of containerboard, corrugated containers, paperboard,\n \nconsumer packaging, and other paper-based packaging products. As such, Smurfit Westrock’s\n net sales\n during any period are largely\n \ninfluenced by volumes, prices and costs of the corrugated containers and consumer packaging products that Smurfit Westrock sells\n \nduring that period.\nVolumes\n \nIn general, demand for corrugated containers and consumer packaging is closely correlated with overall economic growth and activity.\n \nIt also directionally correlates with levels of industrial production and is impacted by the trends affecting the choice of medium (paper,\n \nplastic, glass, metal, or wood) used in the packaging of these products. As a result, demand is driven by the need for: (i) packaging\n \nproducts for consumer and industrial goods, (ii) higher value-added corrugated products used for point-of-sale displays and consumer\n \nand shelf-ready packaging, and (iii) packaging of pharmaceutical products and the growth of related industries. Normal patterns of\n \ndemand growth can be disrupted by other macroeconomic trends, including inflation, pandemics (including the COVID-19 pandemic\n \nand related lockdowns), and global economic and geopolitical developments, among others.\nConsumer patterns also play a significant role in demand for corrugated packaging and consumer packaging. In recent years, shifting\n \nconsumer behaviors have accelerated, particularly with the rise of e-commerce and increased awareness of unsustainable packaging\n \nsolutions. These trends have, to date, been beneficial for paper-based packaging, \nwhich is typically made from renewable, recyclable\n \nmaterials.\n Changing demographics can also influence demand trends in the pharmaceutical industry, a major user of consumer\n \npackaging.\nPrices and Costs\nPrices of corrugated containers and consumer packaging are primarily a function of the cyclical nature of Smurfit Westrock’s industry,\n \ncapacity and competition in the markets it operates in, prevailing raw material prices, and other operating costs, such as energy,\n \nchemicals, and transportation, overlaying supply and demand balances.\n \nAs paper costs generally represent a large portion of the cash cost of production for corrugated containers or consumer packaging,\n \ncontainerboard price movements tend to impact the prices of corrugated containers. In turn, the cost of paper is influenced by\n \nmovements in the price of its major raw materials—wood or recycled paper—along with other supply and demand factors. Smurfit\n \nWestrock’s production processes are energy-intensive, making production costs also sensitive to the price of energy (primarily gas and\n \nelectricity), which have historically been volatile. Other key cost drivers include employee benefit expenses, largely determined by\n \nworkforce size, and shipping and handling costs, which are generally affected by fuel prices and overall labor inflation.\nWhile many of Smurfit Westrock’s customer contracts include price adjustment clauses that allow cost increases to be passed on to\n \ncustomers, these clauses may not in all cases be effective to offset rising costs. \nAdditionally\n, for corrugated and consumer packaging\n \nproducts, \neven\n when Smurfit Westrock is able to implement price increases, there is typically a three- to six-month lag between raw\n \nmaterial price hikes and the realization of higher pricing from customers.\nForeign\n Currency Effects\nSmurfit Westrock operates in multiple countries across North America, Europe, MEA, APAC, and LATAM. As a result, currency\n \nfluctuations can have both direct and indirect impacts on its financial statements, which are presented in U.S. dollars.\n56\nRESULTS OF OPERATION\nS\nThe following table summarizes Smurfit Westrock’s consolidated results for the three years ended \nDecember 31, 2024\n, \nDecember 31,\n \n2023\n and \nDecember 31, 2022\n:\n($ in millions)\n2024\n2023\n2022\nNet sales\n$\n21,109\n$\n12,093\n$\n13,509\nCost of goods sold\n(16,914)\n(9,039)\n(10,237)\nGross profit\n4,195\n3,054\n3,272\nSelling, general and administrative expenses\n(2,793)\n(1,604)\n(1,543)\nGoodwill impairment\n—\n—\n(12)\nImpairment of other assets\n—\n—\n(159)\nTransaction and integration-related expenses associated with the Combination\n(395)\n(78)\n—\nOperating profit\n1,007\n1,372\n1,558\nPension and other postretirement non-service expense, net\n(24)\n(49)\n(8)\nInterest expense, net\n(398)\n(139)\n(139)\nOther (expense) income, net\n(25)\n(46)\n15\nIncome before income taxes\n560\n1,138\n1,426\nIncome tax expense\n(241)\n(312)\n(391)\nNet income\n319\n826\n1,035\nLess: Net income attributable to noncontrolling interests\n—\n(1)\n(1)\nNet income attributable to common shareholders\n$\n319\n$\n825\n$\n1,034\n57\nResults of operations for the year ended \nDecember 31, 2024\n, compared to the year ended \nDecember 31, 2023\nNet Sales\nNet sales \nincreased\n by \n$9,016 million\n, t\no \n$21,109 million\n in the year ended \nDecember 31, 2024\n, from \n$12,093 million\n in the year\n \nended \nDecember 31, 2023\n. This increase\n was primarily due to t\nhe impact of\n \n$9,381 million\n related to the acquisition of WestRock.\n \nExcluding the impact of this acquisition, net sales decreased by $365 million primarily resulting from\n \na $715\n \nmillion impact due to a\n \nlower selling/price mix, partially offset by a positive volume impact of \n$377 \nmillion. \nSee “Segment Information” below for more\n \ndetail on Smurfit Westrock’s segment results.\n \nCost of Goods Sold\nCost of goods sold \nincreased\n by \n$\n7,875\n mi\nllion, to \n$16,914 million\n in the year ended \nDecember 31, 2024\n, from \n$9,039 million\n in the\n \nyear ended \nDecember 31, 2023\n. The increase in cost of goods sold was primarily due to the impact of the acquisition of WestRock of\n \n$7,997 million, which included an expense of\n \n$224 million\n for the amortization of the fair value step up on inventory recognized on\n \nWestRock’s inventory acquired. Excluding the impact of this acquisition, cost of goods sold decreased by $122 million primarily due\n \nto \nlower input prices partly offset by higher volumes.\nSelling, General and Administrative (“SG&A”) Expenses\nSG&A expenses \nincreased\n b\ny $\n1,189\n million, to \n$2,793 million\n i\nn the year ended \nDecember 31, 2024\n, from \n$1,604 million\n in the year\n \nended \nDecember 31, 2023\n. \nThe increase in SG&A expenses of \n$\n1,189\n million was primarily due to additional SG&A expenses of\n \n$1,189 million related to the acquisition of WestRock.\n \nTransaction and Integration-related Expenses Associated with the Combination\nThe Company incurred transaction and integration-related expenses associated with the Combination o\nf\n \n$395\n \nmillion and \n$78 million\n \nin the years ended \nDecember 31, 2024\n and 2023, respectively.\nTransaction-related expenses associated with the Combination were \n$202 million\n and \n$78 million\n in the years ended \nDecember 31,\n \n2024\n and 2023, respectively. Transaction-related costs associated with the Combination comprised of banking and financing related\n \ncosts as well as legal and other professional services which were directly attributable to the Combination and retention payments that\n \nwere contractually committed to and associated with the successful completion of the Combination.\nIntegration-related expenses associated with the Combination \nwere \n$193 million\n \nin the year ended \nDecember 31, 2024\n. \nWe incur\n \nintegration costs post-acquisition that reflect work performed to facilitate merger and acquisition integration and primarily consist of\n \nprofessional services and personnel and related expenses, such as work associated with information systems.\nPension and Other Postretirement Non-Service Expense, Net\n \nPension and other postretirement non-service expense, net\n \ndecreased\n by $\n25\n million, to\n \n$24\n million in the year ended \nDecember 31,\n \n2024\n, from \n$49 million\n in the year ended \nDecember 31, 2023\n.\n This \ndecrease\n was primarily due to\n a \n$170 million increase in the return\n \non plan assets primarily due to acquired net pension assets in connection with the Combination, that was \npartially\n offset by an increase\n \nin interest costs of\n $128 \nmillion primarily due to acquired net pension assets in connection with the Combination; a $12 million\n \nincrease in one-time settlement expenses and a $7 million increase in the net actuarial \nloss.\nInterest Expense, Ne\nt\nInterest expense, net \nincreased\n by \n$259 million\n to \n$398\n million in the year ended \nDecember 31, 2024\n, from \n$139 million\n in the year\n \nended \nDecember 31, 2023\n.\n \nThe increase was primari\nly the \nresult of interest on\n debt assumed as part of the Combination and the\n \n$2,750 million April \nNotes \nOffering\n (as hereinafter defined)\n \nin connection with the Combination\n. The increase was partially offset by\n \nhigher interest income o\nf \n$96 million\n primarily due to increased average cash balances in the period. \nSee “Note \n14.   Debt\n” of the\n \nNotes to Consolidated Financial Statements for details of the April \nNotes Offering\n.\n58\nOther (Expense) Income, Net\nOther (expense) income, \nnet\n \ndecreased\n by \n$\n21\n million\n, to a net \nexpense\n of \n$25 million\n \nin the year ended \nDecember 31, 2024\n, from a \nnet expense of \n$46 million\n in the \nyear\n ended\n \nDecember 31, 2023\n. This \ndecrease\n was primarily due to a $30 million net positive impact \nfrom foreign currency translation \nof monetary assets and liabilities \nand a $10 million increase in income from equity method \ninvestments. This was partially offset by a $23 million expense recorded in the year ended \nDecember 31, 2024\n in connection with the \nsale of receivables under an accounts receivable monetization program acquired as a result of the Combination.\nIncome Tax Expense\nIncome tax expense \ndecreased\n by $\n71\n million, to \n$241 million\n (consisting of current tax expense of \n$378 million\n and deferred tax\n \nbenefit of \n$137 million\n) in the year ended \nDecember 31, 2024\n, from \n$312 million\n (consisting of current tax expense of $\n340\n million\n \nand deferred tax benefit of $\n28\n million) in the year ended \nDecember 31, 2023\n.\nThe net \nincrease\n of $\n38\n million in current tax expense was primarily due to the tax impact of the acquired U.S. operations resulting\n \nfrom the Combination and from lower profitability elsewhere. The net \nincrease\n of $\n109\n million in deferred tax benefit largely relates\n \nto the amortization of differences arising in the acquisition accounting for the Combination.\nResults of operations for the year ended \nDecember 31, 2023\n, compared to the year ended \nDecember 31, 2022\nNet Sales\nNet sales \ndecreased\n by \n$1,416 million\n, to \n$12,093 million\n in the year ended \nDecember 31, 2023\n, from \n$13,509 million\n in the year\n \nended \nDecember 31, 2022\n. This decrease was primarily due to a reduction of $842 million due to lower volumes, as well as a lower\n \nselling price/mix of $789 million. In addition, there was a net negative impact of $142 million from acquisitions and disposals,\n \nprimarily due to the disposal of our Russian operations. \nThese\n \ndecreases were partially offset by a net positive foreign currency impact\n \nof $390 million, primarily due to the weakening of the U.S. dollar against the euro. See “Segment Information” below for more detail\n \non Smurfit Westrock’s segment results.\nCost of Goods Sold\nCost of goods sold \ndecreased\n by \n$1,198 million\n, to \n$9,039 million\n in the year ended \nDecember 31, 2023\n, from \n$10,237 million\n in the\n \nyear ended \nDecember 31, 2022\n. The decrease in cost of goods sold was primarily due to lower input prices, lower volumes and the net\n \nimpact of acquisitions and disposals, partly offset by the impact of \nnet \nnegative foreign currency.\nSG&A\n Expenses\nSG&A expenses \nincreased\n by \n$61 million\n, to \n$1,604 million\n in the year ended \nDecember 31, 2023\n, from \n$1,543 million\n in the year\n \nended \nDecember 31, 2022\n. This increase was primarily due to an increase in wages and salaries,\n redundancy and reorganization and\n IT\n \ncosts.\nGoodwill Impairment\nIn the year ended \nDecember 31, 2022\n \nthe Company recorded a pre-tax, non-cash goodwill impairment in the LATAM segment of\n \n$12 million\n to fully impair the goodwill balance in its \nPeru reporting unit\n as a result of continued difficult economic conditions\n.\n59\nImpairment of Other Assets\n \nIn the year ended \nDecember 31, 2022\n, the Company recorded an impairment charge of \n$159 million\n in the Europe, MEA and APAC\n \nsegment on the assets relating to its Russian operations upon their classification as assets held for\n sale.\nTransaction and Integration-related Expenses Associated with the Combination\nIn the year ended \nDecember 31, 2023\n, the Company incurred \n$78 million\n of transaction-related expenses associated with the\n \nCombination, which included legal and financial advisory, accounting, and consulting costs as well as bond consent fees incurred in\n \nconnection with the Combination.\n \nPension and Other Postretirement Non-Service Expense, Net\n \nPension and other postretirement non-service expense, net \nincreased\n by \n$41 million\n, to \n$49 million\n in the year ended \nDecember 31,\n \n2023\n, from \n$8 million\n in the year ended \nDecember 31, 2022\n. This increase was primarily due to an increase in interest costs of $48\n \nmillion due to higher discount rates. The increase in costs was partially offset by an increase in the expected return on assets of $15\n \nmillion. In addition, there was a net settlement loss of $8 million in the year ended \nDecember 31, 2023\n compared to a net settlement\n \ngain of $1 million in the year ended \nDecember 31, 2022\n.\nInterest\n Expense, Net\nInterest expense, net was \n$139 million\n in both the years ended \nDecember 31, 2023\n and \nDecember 31, 2022\n. The Company incurred\n \nincremental costs of $10 million in the year ended \nDecember 31, 2023\n \nrelated\n to bridge facility fees \nassociated with the Combination\n \nwhich was offset by a $10 million decrease in the net interest expense excluding the bridge facility fees, primarily due to additional\n \ninterest income earned on the Company’s deposits as a result of the higher interest environment, partially offset by higher interest\n \ncosts on the Company’s variable debt.\nOther (Expense) Income, Net\nOther (expense) income, net \ndecreased\n by \n$\n61\n million\n, to a net expense of \n$46 million\n in the year ended \nDecember 31, 2023\n, from net\n \nincome of \n$15 million\n in the year ended\n \nDecember 31, 2022\n. This \ndecrease\n was primarily due to a $50 million increase in loss on\n \nforeign currency transactions, mainly driven by the devaluation of the Argentine Peso, as well as a $5 million decrease in net gain on\n \nthe disposal of businesses and assets in the year ended \nDecember 31, 2023\n.\nIncome Tax Expense\n \nIncome tax expense \ndecreased\n by $\n79\n million, to \n$312 million\n (consisting of current tax expense of \n$340 million\n and deferred tax\n \nbenefit of \n$28 million\n) in the year ended \nDecember 31, 2023\n, from \n$391 million\n (consisting of current tax expense of $\n350\n million\n \nand deferred tax expense of $\n41\n million) in the year ended \nDecember 31, 2022\n.\nThe net \ndecrease\n of $\n10\n million in current tax expense was primarily due to lower profitability. The net \ndecrease\n of $\n69\n million in\n \ndeferred tax\n \nexpense\n was largely due to: the effects of timing differences on which deferred tax was previously recognized; the impact\n \nof deferred tax on certain unremitted earnings where the Company was not availing of a permanent reinvestment assertion; and the\n \nrecognition of other tax benefits and credits.\n60\nSEGMENT INFORMATION \nSmurfit Westrock has identified its operating segments based on how the\n CODM\n makes key operating decisions, allocates resources\n \nand assesses performance of the Company’s business. Effective the third quarter of 2024 Smurfit Westrock has identified three\n \noperating segments:\n (i) North America, which includes operations in the U.S., Canada and Mexico,\n (ii) Europe, MEA and APAC and\n \n(iii) LATAM, which includes operations in Central America and Caribbean, Argentina, Brazil, Chile, Colombia, Ecuador and Peru.\n \nNo operating segments have been aggregated for disclosure purposes. Prior period comparatives have been \nrecast\n to reflect the change\n \nin segments.\nSegment results include items directly attributable to a segment as well as those that can be allocated on a reasonable basis, but\n \nexclude certain central costs such as corporate costs, including executive costs, and costs of Smurfit Westrock’s legal, company\n \nsecretarial, pension administration, tax, treasury and controlling functions and other administrative costs.\n \nSegment profitability is\n \nmeasured based on Adjusted EBITDA, defined as \nincome before income taxes\n, \nunallocated corporate costs\n, \ndepreciation, depletion\n \nand amortization\n, \ninterest expense, net\n, \npension and other postretirement non-service expense, net\n, \nshare-based compensation expense\n,\n \nother (expense) income, net\n, impairment of goodwill and other assets, \namortization of fair value step up on inventory\n, \ntransaction and\n \nintegration-related expenses associated with the Combination\n and other specific items that management believes are not indicative of\n \nthe ongoing operating results of the business.\n \nThe following table contains selected financial information for Smurfit Westrock’s segments for the years ended \nDecember 31, 2024\n,\n \n2023\n \nand \n2022\n:\n($ in millions)\n2024\n2023\n2022\nNet sales (aggregate):\n(1)\nNorth America\n$\n10,092\n$\n1,624\n$\n1,720\nEurope, MEA and APAC\n9,577\n9,193\n10,451\nLATAM\n1,711\n1,344\n1,397\nSegment Adjusted EBITDA:\nNorth America\n$\n1,610\n$\n281\n$\n281\nEurope, MEA and APAC\n1,529\n1,684\n1,920\nLATAM\n378\n274\n280\n(1)\n Ne\nt sales before intersegment eliminations\nThe year ended \nDecember 31, 2024\n, compared to the year ended \nDecember 31, 2023\nNorth America Segment\nNet Sales\nNet sales before intersegment eliminations for the North \nAmerica segment\n \nincreased\n by $\n8,468\n million\n, to $\n10,092\n million in the year\n \nended \nDecember 31, 2024\n, from \n$1,624 million\n in the year ended \nDecember 31, 2023\n. This \nincrease\n \nwas primarily due to the positive\n \nimpact of $8,481 million from the acquisition of WestRock.\nAdjusted EBITDA\nAdjusted EBITDA for the North America segment \nincreased\n by $\n1,329\n million, to \n$1,610\n million in the year ended \nDecember 31,\n \n2024\n, from \n$281 million\n in the year ended \nDecember 31, 2023\n. This \nincrease\n was primarily due to the positive impact of $1,380\n \nmillion from the acquisition of WestRock.\n61\nEurope, MEA and APAC Segment\nNet Sales\nNet sales before intersegment eliminations for the Europe, MEA and APAC segment \nincreased\n by $\n384\n million, to $\n9,577\n million in\n \nthe year ended \nDecember 31, 2024\n, from \n$9,193 million\n in the year ended \nDecember 31, 2023\n. This \nincrease\n was primarily due to \nthe\n \nimpact of $740 million which related to the acquisition of WestRock.\n Excluding the impact of this acquisition, net sales before\n \nintersegment eliminations decreased by $356 million primarily due to a lower selling/price mix of $732 million, partially offset by a\n \npositive volume impact of $352 million\n \nand net foreign currency impact of $36 million primarily due to the weakening of the U.S.\n \ndollar against th\ne euro, \npound\n sterling and Polish zloty\n.\nAdjusted EBITDA\nAdjusted EBITDA for the Europe, MEA and APAC segment \ndecreased\n by $\n155\n million, to \n$1,529\n million in the year ended\n \nDecember 31, 2024\n, from \n$1,684 million\n in the year ended \nDecember 31, 2023\n. There was a $63 million positive impact from the\n \nacquisition of WestRock. Excluding the impact of this acquisition, \nA\ndjusted EBITDA decreased by $218 million mainly due to\n a\n \nlower selling price/mix impact of $732 million, partly offset by lower input prices of $449 million and a positive impact of $67 million\n \ndue to higher volumes\n.\nLATAM Segment\n \nNet Sales\nNet sales before intersegment eliminations for the LATAM segment \nincreased\n by \n$367 million\n, to \n$1,711 million\n in the year ended\n \nDecember 31, 2024\n, from \n$1,344 million\n in the year ended \nDecember 31, 2023\n. This \nincrease\n \nwas primarily due to the positive impact\n \nof $363 million from the acquisition of WestRock.\nAdjusted EBITDA\nAdjusted EBITDA for the LATAM segment \nincreased\n by \n$104 million\n, to \n$378 million\n in the year ended \nDecember 31, 2024\n, from\n \n$274 million\n in the year ended \nDecember 31, 2023\n. This \nincrease\n \nwas primarily due to the positive impact of $106 million from the\n \nacquisition of WestRock.\n \nThe year ended \nDecember 31, 2023\n, compared to the year ended \nDecember 31, 2022\nNorth America Segment\nNet Sales\nNet sales before intersegment eliminations for the North America segment \ndecreased\n by \n$96 million\n, to \n$1,624 million\n in the year\n \nended \nDecember 31, 2023\n, from \n$1,720 million\n in the year ended \nDecember 31, 2022\n. This \ndecrease\n was primarily due to the impact\n \nof lower volumes of \n$110\n \nmillion, as well as the impact of a \nlower\n selling price/mix of \n$\n21\n \nmillion, partially offset by a net positive\n \nforeign currency impact of\n \n$35 \nmillion.\nAdjusted EBITDA\nAdjusted EBITDA for the North America segment was \n$281 million\n in the years ended \nDecember 31, 2023\n and 2022\n,\n primarily due to\n \nthe impact of lower volumes, offset by lower input prices.\n62\nEurope, MEA and APAC Segment\nNet Sales\nNet sales before intersegment eliminations for the Europe, MEA and APAC segment \ndecreased\n by\n \n$1,258 million\n, to $\n9,193\n million \nin\n \nthe year ended \nDecember 31, 2023\n, from \n$10,451 million\n in the year ended \nDecember 31, 2022\n.\n This \ndecrease\n was primarily due to a\n \nlower selling price/mix of\n $779 mi\nllion\n,\n as well as a decrease in volumes (excluding the impact of acquisitions and disposals), which\n \nreduced net sales by \n$632\n million. In addition, there was a net negative impact of $168 million from acquisitions and disposals. \nThese\n \ndecreases were partially offset by a net positive foreign currency impact of $321 million, primarily due to the weakening of the U.S.\n \ndollar against the euro.\n \nAdjusted EBITDA\nAdjusted EBITDA for the Europe, MEA and APAC segment \ndecreased\n by \n$236 million\n, to \n$1,684 million\n in the year ended\n \nDecember 31, 2023\n, from \n$1,920 million\n in the year ended \nDecember 31, 2022\n. \nThe decrease was primarily due to a lower selling\n \nprice/mix which had an impact of $779 million along with a lower volume impact of $293 million, partly offset by lower input prices\n \nof $694 million and a net positive foreign currency impact of $127 million.\nLATAM Segment\n \nNet Sales\nNet sales before intersegment eliminations for the LATAM segment \ndecreased\n by \n$53 million\n, to \n$1,344 million\n in the year ended\n \nDecember 31, 2023\n, from \n$1,397 million\n in the year ended \nDecember 31, 2022\n. This \ndecrease\n was primarily due to the impact of\n \nlower volumes of\n \n$89 \nmillion, as well as the impact of lower selling price/mix of\n \n$24\n \nmillion, partially offset by\n \na positive impact of\n \n$25 million from \nacquisitions and a net positive foreign currency impact of $35 million\n.\nAdjusted EBITDA\nAdjusted EBITDA for the LATAM segment \ndecreased\n by \n$6 million\n, to \n$274 million\n in the year ended \nDecember 31, 2023\n, from\n \n$280 million\n in the year ended \nDecember 31, 2022\n. \nThe \ndecrease\n was primarily due to \na\n lower selling price/mix and lower volumes,\n \npartly offset by a lower input price\ns.\n63\nLIQUIDITY AND CAPITAL RESOURCES\nSources and Uses of Cash\nSmurfit Westrock’s primary sources of liquidity are the cash flows generated from\n its\n operations, its commercial paper program, and\n \ncommitted credit lines. The uncommitted commercial paper program is supported by the \n$4,500 million\n revolving loan facility with a\n \nseparate swingline sub-facility which allows for same-day drawing in U.S.\n dollar\n. The amount of commercial paper outstanding does\n \nnot reduce available capacity under the revolving loan facility. The primary uses of this liquidity are to fund Smurfit Westrock’s day-\nto-day operations, capital \nexpenditures\n, debt service, dividends and other investment activity, including acquisitions.\nAs of \nDecember 31, 2024\n, Smurfit Westrock held cash and cash equivalents of $\n855\n million, of which $426 million were held in euro,\n \n$169 million were held in U.S. dollars and $260 million were held in other currencies. At \nDecember 31, 2024\n, the Company had\n \n$5,079 million in undrawn committed facilities available under the New RCF and receivables securitization facilities. The weighted\n \naverage period until maturity of undrawn committed facilities was 4.4 years as of \nDecember 31, 2024\n. Combined with cash and cash\n \nequivalents of \n$855\n million, the Company had $5,934 million of available liquidity.\nOn June 28, 2024, \nconditional upon the closing of the Combination, \nthe Company entered into the Multicurrency Term and Revolving\n \nFacilities Agreement (the \"\nN\new Credit Agreement\")\n with certain lenders and Wells Fargo Bank, National Association, as agent,\n \nproviding for (i) the $600 million Term Loan Facility, (ii) a multicurrency revolving loan facility in an aggregate principal amount of\n \n$4,500 million including a swingline sub-facility in an aggregate principal amount of $500 million (together,\n the “New RC\nF”\n). On\n \nJuly 2, 2024, the Term Loan Facility of $600 million under the New Credit Agreement was cancelled prior to any drawdown and no\n \nearly termination penalties were incurred as a result of the cancellation. \nOn July 5, 2024, the Company cancelled the €1,350 million\n \nRevolving Credit Facility (that was due to mature in January 2026) (the “Existing RCF”)\n \nas part of the conditions of the New Credit\n \nAgreement upon the closing of the Combination on the Closing Date. As of \nDecember 31, 2024\n, there were no amounts outstanding\n \nunder the New RCF.\nAs of \nDecember 31, 2024\n, Smurfit Westrock had $\n13,658\n million of debt, excluding debt issuance costs, of which $\n1,053\n million was\n \ncurrent. The carrying amount of the Company’s debt includes a fair value adjustment related to debt assumed through mergers and\n \nacquisitions. At \nDecember 31, 2024\n the unamortized fair value market adjustment was \n$48 million\n. Included within the carrying value\n \nof Smurfit Westrock’s borrowings as of \nDecember 31, 2024\n are deferred debt issuance costs of $\n63\n million, of which $\n8\n million is\n \ncurrent, all of which will be recognized in interest expense in Smurfit Westrock’s Consolidated Statements of Operations using the\n \neffective interest rate method over the remaining life of the borrowings. \n \n See “Note \n14.   Debt\n” for a discussion of the Company’s\n \nadditional debt-related information, including bond issuance and repayments throughout the year.\nThe Company believes that the cash flows generated from its operations, cash on hand, its commercial paper program, available\n \nborrowings under its committed credit lines and available capital through access to capital market\ns\n \nw\nill be adequate to meet the\n \nCompany's  liquidity and capital requirements, including payments of any declared\n \ndividends\n, \nfor the next 12 months and for the\n \nforeseeable future\n.\nSmurfit Westrock uses a variety of working capital management strategies including supply chain financing (“SCF”) programs,\n \nvendor financing and commercial card programs, monetization facilities where we sell short-term receivables to a group of third-party\n \nfinancial institutions and receivables securitization facilities. The programs are described below.\nThe Company engages in certain customer-based SCF programs to accelerate the receipt of payment for outstanding accounts\n \nreceivables from certain customers. Certain costs of these programs are borne by the customer or the Company. Receivables\n \ntransferred under these customer-based SCF programs generally meet the requirements to be accounted for as sales in accordance with\n \nguidance under “Transfers and Servicing” (“ASC 860”), resulting in derecognition of such receivables from the Company’s\n \nConsolidated Balance Sheets. Receivables involved with these customer-based SCF programs constitute approximately 6% of the\n \nCompany’s accounts receivable balance at December 31, 2024\n.\n In addition, Smurfit Westrock has monetization facilities that sell to\n \nthird-party financial institutions all of the short-term receivables generated from certain customer trade accounts. See “Note \n13. Fair\n \nValue Measurement\n” for a discussion of the Company’s monetization facilities.\n64\nSmurfit Westrock’s working capital management strategy includes working with its suppliers to revisit terms and conditions, including\n \nthe extension of payment terms. The Company’s current payment terms with the majority of its suppliers generally range from payable\n \nupon receipt to 120 days and vary for items such as the availability of cash discounts. The Company does not believe its payment\n \nterms will be shortened significantly in the near future, and does not expect its net cash provided by operating activities to be\n \nsignificantly impacted by additional extensions of payment terms. Certain financial institutions offer voluntary SCF programs that\n \nenable the Company’s suppliers, at their sole discretion, to sell their receivables from Smurfit Westrock to the financial institutions on\n \na non-recourse basis at a rate that leverages the Company’s credit rating and thus might be more beneficial to the Company’s\n \nsuppliers. Smurfit Westrock and its suppliers agree on commercial terms for the goods and services we procure, including prices,\n \nquantities and payment terms, regardless of whether the supplier elects to participate in SCF programs. The suppliers sell Smurfit\n \nWestrock goods or services and issue the associated invoices based on the agreed-upon contractual terms. The due dates of the\n \ninvoices are not extended due to the supplier’s participation in SCF programs. Smurfit Westrock suppliers, at their sole discretion if\n \nthey choose to participate in a SCF program, determine which invoices, if any, they want to sell to the financial institutions. No\n \nguarantees are provided by the Company under SCF programs, and it has no economic interest in a supplier’s decision to participate in\n \nthe SCF program. Therefore, amounts due to the Company’s suppliers that elect to participate in SCF programs are included in the\n \n“Accounts payable” line item in the Company’s\n Consolidated Balance Sheets\n and the activity is reflected in “Net cash provided by\n \noperating activities” in the Company’s C\nonsolidated Statements of Cash Flows\n. Based on correspondence with the financial\n \ninstitutions that are involved with Smurfit \nWestrock\n’s two primary SCF programs, while the amount suppliers elect to sell to the\n \nfinancial institutions varies from period to period, the amount generally averages \napproximately \n13.7%\n of the Company’s accounts\n \npayable balance. The outstanding payment obligations to financial institutions under these programs were \n$450 million\n as of\n \nDecember 31, 2024\n.\nSmurfit Westrock also participates in certain vendor financing and commercial card programs to support travel and entertainment\n \nexpenses and smaller vendor purchases. Amounts outstanding under these programs are classified as debt primarily because the\n \nCompany receives the benefit of extended payment terms and a rebate from the financial institution that would not have otherwise\n \nbeen received without the financial institution's involvement. Smurfit Westrock also has receivables securitization facilities that allows\n \nfor borrowing availability based on underlying accounts receivable eligibility and compliance with certain covenants. See “Note \n14.\n \nDebt\n” and “Note \n22. Variable Interest Entities\n” of the Notes to Consolidated Financial Statements for a discussion of the receivables\n \nsecuritization facilities and the amount outstanding under the Company’s vendor financing and commercial card programs.\nSmurfit Westrock is a party to enforceable and legally binding contractual obligations involving commitments to make payments to\n \nthird parties. These obligations impact Smurfit Westrock’s short-term and long-term liquidity and capital resource needs. Certain\n \ncontractual obligations are reflected on Smurfit Westrock’s Consolidated Balance Sheets as of \nDecember 31, 2024\n, while others are\n \nconsidered future obligations. Smurfit Westrock’s contractual obligations primarily consist of items such as long-term debt, including\n \ncurrent portion, lease obligations, purchase obligations and other obligations. See “Contractual Obligations and Commitments” for\n \nmore information.\nCash Flow Activity\nThe following table contains selected financial information from Smurfit Westrock’s Consolidated Statements of Cash Flows for the\n \nyears ended \nDecember 31, 2024\n, \n2023\n \nand \n2022\n:\nYears ended December 31,\n($ in millions) \n2024\n2023\n2022\nNet cash provided by operating activities\n$\n1,483\n$\n1,559\n$\n1,433\nNet cash used for investing activities\n$\n(2,114)\n$\n(931)\n$\n(1,020)\nNet cash provided by (used for) financing activities\n$\n607\n$\n(479)\n$\n(431)\n65\nNet cash \nprovided by\n operating activities \ndecreased\n by $\n76\n million, or \n4.9%\n, to $\n1,483\n million in the year ended \nDecember 31, 2024\n \nfrom $\n1,559\n million in the year ended \nDecember 31, 2023\n, primarily due to \na \n$508\n million increase in the outflow in the change in\n \noperating assets and liabilities driven by additional operating cash flow activity as a \nresult of\n the Combination\n,\n higher \nvolumes\n \n(excluding acquisitions) in the Europe, MEA and APAC segment, and an increased outflow for creditors in the North America\n \nsegment. The increase in the cash outflows from changes in operating assets and liabilities includes proceeds of $\n62\n million resulting\n \nfrom the sale of accounts receivables in connection with monetization agreements. The increase in \nth\ne\n cash outflows from changes in\n \noperating assets and liabilities \nwas partially offset by the\n \n$432\n million increase in net income adjusted for non-cash items, including\n \ndepreciation, depletion and amortization, cash surrender value increase in excess of premiums paid, impairment charges on assets\n \nother than goodwill\n,\n share-based compensation expense, deferred tax (benefit) expense, and \npension and other post-retirement funding\n \nmore than cost\n, resulting in a net decrease in cash flows from operating \nactivities.\n \nNet cash \nprovided by\n operating activities \nincreased\n by $\n126\n million, or \n8.8%\n, to $\n1,559\n million in the year ended \nDecember 31, 2023\n \nfrom $\n1,433\n million in the year ended \nDecember 31, 2022\n, primarily due to an increase in \nthe cash inflow in the change in operating\n \nassets and liabilities\n, partially offset by a \ndecrease\n of $\n350\n million in net income adjusted for non-cash items, including depreciation,\n \ndepletion and amortization, \nimpairment charges for goodwill and other assets\n, share-based compensation expense, deferred tax\n \n(benefit) expense, and \npension and other post-retirement funding more than cost\n resulting in a net \nincrease\n in cash flows from\n \noperating activities.\nNet cash \nused for\n investing activities of \n$2,114 million\n in the year ended \nDecember 31, 2024\n consisted primarily of capital\n \nexpenditures of \n$1,466\n million and cash paid for purchase of businesses, net of cash acquired of\n \n$719\n million, partially offset by\n \nproceeds from sale of property, plant and equipment of $\n61\n million\n. Net cash \nused for\n investing activities of \n$931\n million in the year\n \nended \nDecember 31, 2023\n consisted primarily of capital expenditures of \n$929\n million and cash paid for purchase of businesses, net of\n \ncash acquired of\n \n$29\n million. Net cash \nused for\n investing activities of \n$1,020\n million in the year ended \nDecember 31, 2022\n consisted\n \nprimarily of capital expenditures of \n$930\n million and cash paid for purchase of businesses, net of cash acquired of \n$93\n million.\n \nNet cash \nprovided by\n financing activities of \n$607 million\n in the year ended \nDecember 31, 2024\n consisted primarily of cash \ninflows\n \nfrom a net increase in debt of \n$1,367 million\n, partially offset by cash dividends paid to shareholders of \n$650\n million and debt issuance\n \ncosts of \n$63 million\n. Net cash \nused for\n financing activities of \n$479\n million in the year ended \nDecember 31, 2023\n consisted primarily of\n \ncash \noutflows\n from net \nrepayments of debt \nof \n$55 million\n and cash dividends paid to shareholders of \n$391 million\n. Net cash \nused for\n \nfinancing activities of $\n431\n million in the year ended \nDecember 31, 2022\n consisted primarily of cash \noutflows\n from repayments of\n \ndebt net of additions to debt of \n$7 million\n and cash dividends paid to shareholders of \n$349 million\n.\nContractual Obligations and Commitments\n \nSmurfit Westrock’s\n primary cash\n requirements from contractual obligations and commitments include:\n•\nDebt obligations. \nSee “Note \n14. Debt\n,” of the Notes to the Consolidated Financial Statements included elsewhere in this\n \nAnnual Report on Form 10-K for more information on Smurfit Westrock’s debt obligations and timing of expected future\n \npayments.\n•\nOperating and finance leases. See “Note \n12. Leases\n,” of the Notes to the Consolidated Financial Statements included\n \nelsewhere in this Annual Report on Form 10-K for more information on Smurfit Westrock’s operating and finance lease\n \nobligations and timing of expected future payments.\n•\nPension liabilities. See “Note \n18. Retirement Plans\n,” of the Notes to the Consolidated Financial Statements included\n \nelsewhere in this Annual Report on Form 10-K for more information on Smurfit Westrock’s pension liabilities and the timing\n \nof expected future benefit payments under its pension plans and postretirement plans.\n•\nCapital commitments. See “Note \n21. Commitments and Contingencies\n,” of the Notes to the Consolidated Financial\n \nStatements included elsewhere in this Annual Report on Form 10-K for more information on Smurfit Westrock’s future\n \nspending for property, plant and equipment that Smurfit Westrock is obligated to purchase.\n•\nPurchase commitments. See “Note \n21. Commitments and Contingencies\n,” of the Notes to the Consolidated Financial\n \nStatements included elsewhere in this Annual Report on Form 10-K for more information on Smurfit Westrock’s purchase\n \ncommitments and the timing of the expected future payments.\n66\nOff-Balance Sheet Arrangements\nAs of \nDecember 31, 2024\n, Smurfit \nWestrock\n did not have any off-balance sheet arrangements.\nNON-GAAP FINANCIAL MEASURES\nDefinitions\n \nNon-GAAP Financial Measures\n \nSmurfit Westrock reports its financial results in accordance with generally accepted accounting principles in the U.S. (“GAAP”).\n \nHowever, management believes certain non-GAAP financial measures, as discussed below, provide Smurfit Westrock’s Board of\n \ndirectors, investors, potential investors, securities analysts and others with additional meaningful financial information that should be\n \nconsidered when assessing its ongoing performance. Smurfit Westrock management also uses these non-GAAP financial measures in\n \nmaking financial, operating and planning decisions, and in evaluating company performance. Non-GAAP financial measures are not\n \nintended to be considered in isolation of or as a substitute for, or superior to, financial information prepared and presented in\n \naccordance with GAAP and should be viewed in addition to, and not as an alternative for, the GAAP results. The non-GAAP financial\n \nmeasures Smurfit Westrock presents may differ from similarly captioned measures presented by other companies. Smurfit Westrock\n \nuses the non-GAAP financial measures “Adjusted EBITDA,” “Adjusted Net Income,” and “Adjusted Earnings Per Share - Basic.”\nA\ndjusted EBITDA\nSmurfit Westrock uses the non-GAAP financial measure “Adjusted EBITDA” to evaluate its overall performance. The composition of\n \nAdjusted EBITDA is not addressed or prescribed by GAAP. Smurfit Westrock \ndefines\n Adjusted EBITDA as net income before\n \nincome tax expense\n, \ndepreciation, depletion and amortization\n, \ninterest expense, net\n, \npension and other postretirement non-service\n \nexpense, net\n, \nshare-based compensation expense\n, \nother (expense) income, net\n, impairment of goodwill and other assets, \namortization\n \nof fair value step up on inventory\n, \ntransaction and integration-related expenses associated with the Combination\n and other specific\n \nitems that management believes are not indicative of the ongoing operating results of the business.\n Smurfit Westrock views Adjusted\n \nEBITDA as an appropriate and useful measure to compare financial performance between periods.\n \nManagement believes that the most directly comparable GAAP measure to Adjusted EBITDA is “Net income”. Management believes\n \nthis measure provides Smurfit Westrock’s management, Board of directors, investors, potential investors, securities analysts and\n \nothers with useful information to evaluate Smurfit Westrock’s performance because, in addition to income tax expense, depreciation,\n \ndepletion and amortization, interest expense, net, pension and other postretirement non-service expense, net, share-based\n \ncompensation \nexpense and other expense (income), net\n, Adjusted EBITDA also excludes impairment of goodwill and other assets,\n \namortization of fair value step up on inventory\n, \ntransaction and integration-related expenses associated with the Combination\n, and\n \nother specific items that management believes are not indicative of the operating results of the business. Smurfit Westrock and its\n \nBoard of directors use this information in making financial, operating and planning decisions and when evaluating Smurfit Westrock’s\n \nperformance relative to other periods.\n  \n67\nSet forth below is a reconciliation of the non-GAAP financial measure Adjusted EBITDA to Net income, the most directly comparable\n \nGAAP measure, for the periods indicated.\nYears ended December 31,\n($ in millions)\n2024\n2023\n2022\nNet income\n$\n319\n$\n826\n$\n1,035\nIncome tax expense\n241\n312\n391\nDepreciation, depletion and amortization\n1,464\n580\n564\nGoodwill impairment\n—\n—\n12\nImpairment of other assets\n—\n—\n159\nTransaction and integration-related expenses associated with the \nCombination\n395\n78\n—\nAmortization of fair value step up on inventory\n224\n—\n—\nInterest expense, net\n398\n139\n139\nPension and other postretirement non-service expense, net\n24\n49\n8\nShare-based compensation expense\n206\n66\n68\nOther expense (income), net\n25\n46\n(15)\nOther adjustments\n90\n32\n29\nAdjusted EBITDA\n$\n3,386\n$\n2,128\n$\n2,390\nFor the year ended \nDecember 31, 2022\n, impairment of other assets in the table above is made up of the impairment of Russian\n \noperations of \n$159 million\n, included in the \nEurope, MEA and APAC\n segment. See “Note \n20. Disposal of Russian Operations\n” for\n \nadditional information on the impairment of the Russian operations.\nOther adjustments in the table above include restructuring costs of \n$56 million\n for the year ended \nDecember 31, 2024\n (\n$32 million\n and\n \n$29 million\n for the years ended \nDecember 31, 2023\n and \n2022\n, respectively), a non-recurring\n,\n non-cash currency translation adjustment\n \nin Argentina of \n$42 million\n and losses at closed facilities of \n$10 million\n partially offset by a reimbursement of a fine from the Italian\n \nCompetition Authority of \n$18 million\n.\n68\nAdjusted Net Income and Adjusted Earnings per Share - Basic\nSmurfit Westrock uses the non-GAAP financial measures “Adjusted Net Income” and “Adjusted Earnings Per Share - Basic”.\n \nManagement believes these measures provide Smurfit Westrock’s management, Board of directors, investors, potential investors,\n \nsecurities analysts and others with useful information to evaluate Smurfit Westrock’s performance because they exclude \namortization\n \nof fair value step up on inventory\n, \nimpairment of goodwill and other assets,\n transaction and integration-related expenses associated\n \nwith the Combination\n and other specific items that management believes are not indicative of the operating results of the business.\n \nSmurfit Westrock and its Board of directors use this information when making financial, operating and planning decisions and when\n \nevaluating Smurfit Westrock’s performance relative to other periods. Smurfit Westrock believes that the most directly comparable\n \nGAAP measures to Adjusted Net Income and Adjusted Earnings Per Share - Basic are Net \nincome\n attributable to common\n \nshareholders and basic earnings per share attributable to common shareholders (“Earnings per share - \nBasic\n”).\n \nSet forth below is a reconciliation of the non-GAAP financial measure Adjusted Net Income to Net income attributable to common\n \nshareholders and \nEarnings per share to Adjusted Earnings per Share, \nthe most directly comparable GAAP measures for the periods\n \nindicated.\nYears ended December 31,\n($ in millions, except per share data)\n2024\n2023\n2022\nNet income attributable to common shareholders\n$\n319\n$\n825\n$\n1,034\nTransaction and integration-related expenses associated with the Combination\n395\n78\n—\nAmortization of fair value step up on inventory\n224\n—\n—\nBridge facility fees\n—\n10\n—\nGoodwill impairment\n—\n—\n12\nImpairment of other assets\n—\n—\n159\nLoss on debt extinguishment\n13\n—\n—\nOther adjustments\n90\n32\n29\nIncome tax on items listed above\n(137)\n(8)\n(21)\nAdjusted Net Income\n$\n904\n$\n937\n$\n1,213\nEarnings per share - Basic\n$\n0.83\n$\n3.19\n$\n4.00\nTransaction and integration-related expenses associated with the Combination\n1.02\n0.30\n—\nAmortization of fair value step up on inventory\n0.58\n—\n—\nBridge facility fees\n—\n0.04\n—\nGoodwill impairment\n—\n—\n0.05\nImpairment of other assets\n—\n—\n0.62\nLoss on debt extinguishment\n0.03\n—\n—\nOther adjustments\n0.23\n0.13\n0.11\nIncome tax on items listed above\n(0.35)\n(0.03)\n(0.09)\nAdjusted Earnings Per Share – Basic\n$\n2.34\n$\n3.63\n$\n4.69\nFor the year ended \nDecember 31, 2022\n, impairment of other assets in the table above is made up of the impairment of Russian\n \noperations of \n$159 million\n, included in the \nEurope, MEA and APAC\n segment. See “Note \n20. Disposal of Russian Operations\n” for\n \nadditional information on the impairment of the Russian operations.\nOther adjustments in the table above include restructuring costs of \n$56 million\n for the year ended \nDecember 31, 2024\n (\n$32 million\n and\n \n$29 million\n for the years ended \nDecember 31, 2023\n and \n2022\n, respectively), \na non-recurring\n,\n non-cash currency translation adjustment\n \nin Argentina of \n$42 million\n and losses at closed facilities of \n$10 million\n \npartially offset by a reimbursement of a fine from the Italian\n \nCompetition Authority\n o\nf \n$18 million\n.\n69\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nSmurfit Westrock\n has prepared the accompanying\n Consolidated Financial Statements in conformity with GAAP, which requires\n \nmanagement to make estimates that affect the amounts of revenues, expenses, assets and liabilities reported. Significant accounting\n \npolicies are described in “Note \n1. Description of Business and Summary of Significant Accounting Policies\n” in the accompanying\n \nConsolidated Financial Statements.\nThese critical accounting policies are both important to the portrayal of Smurfit Westrock’s financial condition and results of\n \noperations and require some of management’s most subjective and complex judgments. The accounting for these matters involves the\n \nmaking of estimates based on current facts, circumstances and assumptions that, in management’s judgment, could change in a manner\n \nthat would materially affect management’s future estimates with respect to such matters and, accordingly, could cause Smurfit\n \nWestrock’s future reported financial condition and results of operations to differ materially from those that it is currently reporting\n \nbased on management’s current estimates.\nSmurfit Westrock believes the following are critical accounting policies and estimates used in the preparation of its Consolidated\n \nFinancial Statements:\nBusiness Combinations\nFrom time to time, Smurfit Westrock may enter into business combinations, such as the Combination with WestRock which closed on\n \nJuly 5, 2024\n. As described further in “Note \n2. Acquisitions\n” to the Consolidated Financial Statements,\n Smurfit Westrock \nallocated the\n \n$13,461 million\n aggregate merger consideration\n \nto the preliminary fair values of WestRock assets acquired and liabilities assumed as\n \nof the Closing Date \nusing currently available information\n. The excess of the purchase price over the fair value of net assets acquired\n \nhas been allocated to goodwill. \n \nThe purchase price allocation for the Merger is preliminary and is subject to revision as additional information about the acquisition-\ndate fair value of assets and liabilities becomes \navailable during the measurement period (a period not to exceed 12 months from the\n \nClosing Date)\n. The Company is still evaluating the fair value of acquired property, plant and equipment, intangible assets and certain\n \nincome tax related items in addition to ensuring all other assets and liabilities and contingencies have been identified and recorded.\n \nThe acquisition method of accounting requires significant estimates and assumptions regarding the fair values of the elements of a\n \nbusiness combination. The most significant assumptions related to the fair value estimates of plant and machinery assets acquired as\n \npart of property, plant and equipment.\n \nThe company prepared estimates and engaged third-party valuation specialists to assist in the\n \nvaluation of plant and machinery assets, which required significant judgements and assumptions inherent in the estimates regarding\n \nitems such as deriving the effective age, economic lives, residual values and other factors, including estimating future cash flows that\n \nSmurfit Westrock expects to generate from the acquired assets.\nIf the subsequent actual results and updated projections of the underlying business activity change compared with the assumptions and\n \nprojections used to develop these values, we could record future impairment charges. In addition, we have estimated the economic\n \nlives of certain acquired assets, and these lives are used to calculate depreciation and amortization expense. If the Company’s\n \nestimates of the economic lives change, depreciation or amortization expenses could be increased or decreased, or the acquired asset\n \ncould be imp\naired.\nSee “Note \n1. Description of Business and Summary of Significant Accounting Policies\n — \nBusiness Combinations\n” and “Note \n2.\n \nAcquisitions\n” to the Consolidated Financial Statements for Smurfit Westrock’s accounting policy on business combinations and more\n \ninformation on the Combination with WestRock.\n70\nGoodwill Impairment\nSmurfit Westrock reviews the carrying value of its goodwill annually during the \nfourth quarter\n,\n or more often if events or changes in\n \ncircumstances indicate that the carrying amount may exceed fair value as set forth in ASC 350, “Intangibles — Goodwill and Other” \n(“ASC 350”). Smurfit Westrock tests goodwill for impairment at the reporting unit level. During the third quarter of 2024, following\n \nthe completion of the Combination, the Company changed its reportable segments and reassessed its reporting units\n.\n As a result of this\n \nreassessment, the \nComp\nan\ny identified\n the following reporting unit\ns\n:\n \n(1) North America, which includes operations in the U.S. and\n \nCanada, (2) Europe, MEA and APAC, (3) Mexico, (4) Argentina and Chile, (5) Colombia & Central Cluster, and (6) Brazil.\n See “Note\n \n1.   Description of Business and Summary of Significant Accounting Policies\n — \n1.12.   Goodwill and Non-current Assets\n” and “Note\n \n9. Goodwill\n” to the Consolidated Financial Statements for Smurfit Westrock’s \naccounting policy on goodwill\n and more information\n \non the change in reporting units\n.\nDuring the fourth quarter of the year ended \nDecember 31, 2024\n, Smurfit Westrock completed its annual goodwill impairment testing\n \nfor each of the Company’s reporting units by performing a qualitative assessment. Multiple factors were evaluated to assess whether it\n \nwas more likely than not that the estimated fair value of any reporting unit was below its carrying value. These factors included, but\n \nwere not limited to, its expectations for macroeconomic conditions, industry and market considerations, and financial performance,\n \nincluding planned net sales and earnings of each reporting unit. The qualitative assessment also considered changes since a\n \nquantitative test across all of the Company’s reporting units was last performed in 2023.\nAs a result of the qualitative assessment, Smurfit Westrock determined that it was more likely than not that the estimated fair value of\n \neach reporting unit with goodwill exceeded its respective carrying value. Therefore, the Company determined that goodwill for each\n \nreporting unit was not impaired and that a quantitative goodwill test was not required. See “\nNote \n9. Goodwill\n”\n to the C\nonsolidated\n \nFinancial Statements\n for further information about the Company’s annual assessment of goodwill for impairment.\nAlthough the Company believes all relevant factors were considered in the qualitative impairment analysis to reach the conclusion that\n \ngoodwill was not impaired, significant changes in any one of the assumptions, estimates and market factors underlying Smurfit\n \nWestrock’s fair value determinations could produce a significantly different result potentially leading to the recording of an\n \nimpairment that could have significant impacts on the results of operations and financial position of the Company. \nSmurfit Westrock\n \nhas not made any material changes to its impairment loss assessment methodology during the past three fiscal years.\nAccounting\n for Income Ta\nxes\nSmurfit Westrock’s income tax expense, deferred tax assets and liabilities, and liabilities for unrecognized tax benefits, reflect\n \nmanagement’s best assessment of estimated current and future taxes to be paid. Significant judgements and estimates are required in\n \ndetermining the consolidated income tax expense. In evaluating its ability to recover deferred tax assets and establishing or reducing a\n \nvaluation allowance in the jurisdiction from which they arise, Smurfit Westrock considers all available positive and negative evidence,\n \nincluding future reversals of existing taxable temporary differences, projected future taxable income, tax planning strategies and the\n \neffect of enacted tax rates expected to apply in the periods in which the deferred tax assets or liabilities are anticipated to be settled or\n \nrealized. A high degree of judgment is required to assess the impact of possible future outcomes on Smurfit Westrock’s current and\n \ndeferred tax positions.\nAs a result of this evaluation, Smurfit Westrock recorded valuation allowances of \n$372 million\n as of \nDecember 31, 2024\n and \n$67\n \nmillion\n as of \nDecember 31, 2023\n, related to certain deferred tax assets, primarily tax loss carryforwards, where there is uncertainty as\n \nto the ultimate realization of a benefit. Smurfit Westrock regularly reviews the recoverability of deferred tax assets for adjustments to\n \ntaxable income, changes in tax laws or interpretations thereof and tax rates, as all of these could impact its effective tax rate.\n71\nSmurfit Westrock is subject to routine tax audits and examinations. It uses significant judgement in (i) determining whether a tax\n \nposition, based solely on its technical merits, is “more likely than not” to be sustained upon examination and (ii) measuring the tax\n \nbenefit as the largest amount of benefit that is “more likely than not” to be realized upon settlement. Smurfit Westrock does not record\n \nany benefit for tax positions that do not meet the “more likely than not” recognition threshold at the balance sheet date. Resolutions of\n \ncurrent uncertain tax positions are not expected to have a material adverse effect on the effective tax rate or on cashflows. Smurfit\n \nWestrock has a progressive dividend strategy which means that it will remit earnings from some of its overseas subsidiaries to the\n \nparent company in Ireland. Its foreign earnings are generally taxed at rates that are higher than in Ireland and so no incremental tax\n \nshould arise there, due to the availability of foreign tax credits. However, some earnings may be subject to limited additional foreign\n \ntaxes upon repatriation. Smurfit Westrock continues to indefinitely reinvest its foreign earnings as part of its wider capital allocation\n \nstrategy. To the extent that it cannot assert indefinite reinvestment of earnings, it records a deferred tax liability on its foreign earnings\n \nat the applicable tax rate if it is not otherwise possible to remit earnings without additional tax.\nAs of \nDecember 31, 2024\n and \n2023\n, Smurfit Westrock recognized a deferred tax liability of \n$179 million\n and \n$126 million\n,\n \nrespectively, on unremitted earnings, in respect of foreign income taxes or withholding taxes for expected or assumed repatriation,\n \nrespectively\n. As Smurfit Westrock can decide which subsidiaries should pay dividends, it is does not expect that this deferred tax\n \nliability will have a material impact on its cash flows in the foreseeable future.\nThe determination of the amount of unrecognized deferred tax liability related to indefinitely invested foreign earnings not subject to\n \nadditional outside basis difference taxes is not practicable. A 1% change in the effective tax rate would increase or decrease Smurfit\n \nWestrock’s income tax expense for the year ended \nDecember 31, 2024\n by \n$6 million\n.\nIn 2021, political agreement was reached by the OECD Inclusive Framework on a two-pillar approach to international tax reform. This\n \nincludes the commitment to introduce a minimum effective tax rate of 15% for companies with revenue above €750 million (‘Pillar\n \nTwo’). The agreement has been enacted in most of the countries where Smurfit Westrock has business activities. The law was enacted\n \nin Ireland with an effective date \nJanuary 1, 2024\n, and it was broadly in line with the OECD Inclusive Framework. For the year ended\n \nDecember 31, 2024\n, a Pillar Two assessment was performed\n.  The impact of Pillar Two was not significant.\nThe \nCompany\n has made accounting policy elections to account for the income tax effect(s) of U.S. Global Intangible Low-Taxed\n \nIncome (GILTI) as a period cost and to account for the income tax effect(s) of investment tax credits under the flow-through method.\n \nPension and Other Postretirement Obligations\nThe determination of pension obligations and pension expense requires various assumptions that can significantly affect liability and\n \nexpense amounts, such as the expected long-term rate of return on plan assets, discount rates, projected future compensation increases\n \nand mortality rates for each of Smurfit Westrock’s plans. These assumptions are determined annually in conjunction with Smurfit\n \nWestrock’s \nactuary\n. The accounting for these matters involves the making of estimates based on current facts, circumstances and\n \nassumptions that, in management’s judgment, could change in a manner that would materially affect management’s future estimates\n \nwith respect to such matters and, accordingly, could cause Smurfit Westrock’s future reported financial condition and results of\n \noperations to differ materially from those that Smurfit Westrock is currently reporting based on management’s current estimates.\nA 50-basis point change in the discount rate, compensation level and expected long-term rate of return on plan assets, factoring in our\n \ncorridor as appropriate, would have had the following effect on Smurfit Westrock’s pension expense for the year ended \nDecember 31,\n \n2024\n, (in millions):\nPension Plans\n50 Basis Point \nIncrease\n50 Basis Point \nDecrease\nDiscount rate\n$\n2\n$\n(1)\nCompensation level\n1\n(1)\nExpected long-term rate of return on plan assets\n(9)\n9\n72\nNEW ACCOUNTING STANDARDS\nSee “Note \n1. Description of Business and Summary of Significant Accounting Policies\n” of the Notes to t\nhe Consolidated Financial\n \nStatements\n \nincluded elsewhere in this Annual Report on Form 10-K \nfor a full description of recent accounting pronouncements,\n \nincluding the respective expected dates of adoption and expected effects on Smurfit \nWestrock\n’s results of operations and financial\n \ncondition.",
  "item2": null
}