{
  "source_file": "smur-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis \nof Financial Condition and Results of Operations\nThe following discussion and analysis of Smurfit Westrock’s financial condition and results of operations should be read in\n \nconjunction with Smurfit Westrock’s Unaudited Condensed Consolidated Financial Statements and their related notes included\n \nelsewhere in this Quarterly Report on Form 10-Q and our audited Consolidated Financial Statements and their related notes for the\n \nyear ended December 31, 2024, as well as the information under the heading “Management’s Discussion and Analysis of the\n \nFinancial Condition and Results of Operations” that were disclosed in the Form 10-K for the year ended December 31, 2024, as filed\n \nwith the U.S. Securities and Exchange Commission (the “SEC”) on March 7, 2025 (the “2024 Form 10-K”). This discussion contains\n \nforward-looking statements that involve risks and uncertainties. Smurfit Westrock’s future results could differ materially from the\n \nresults discussed below. More information regarding these risks and uncertainties and other important factors that could cause actual\n \nresults to differ materially from those in the forward-looking statements is set forth under the heading “Risk Factors” in Part I, Item\n \n1A. in the 2024 Form 10-K, and as may be updated in this and other subsequent Quarterly Reports on Form 10-Q. Please also refer to\n \nthe section above entitled “Cautionary Note Regarding Forward-Looking Statements” for additional information.\nSmurfit Kappa was determined to be the accounting acquirer in the Combination; therefore, the historical consolidated financial\n \nstatements of Smurfit Kappa for periods prior to the Combination were also considered to be the historical financial statements of the\n \nCompany. Unless otherwise specified or the context otherwise requires, all references to the “Company” and “Smurfit Kappa” refer\n \nto Smurfit Kappa Group plc and its subsidiaries and their operations when referring to periods prior to the closing of the\n \nCombination, and references to the “Company” and “Smurfit Westrock” refer to the combined company, Smurfit Westrock and its\n \nsubsidiaries, including, among others, Smurfit Kappa and WestRock, when referring to periods after the Combination.\nOVERVIEW\nSmurfit Westrock is one of the world's largest integrated manufacturers of paper-based packaging products in terms of volumes and\n \nsales, with operations in North America, South America, Europe, Asia, Africa, and Australia. Smurfit Westrock partners with its\n \ncustomers to provide differentiated, sustainable paper and packaging solutions that enhance its customers’ prospects of success in their\n \nmarkets. For additional information, see “Part I, Item 1. Business” included in the Company’s Annual Report on Form 10-K.\nTransaction Agreement and Combination with WestRock\nThe Combination closed on July 5, 2024.\n \nThe consolidated financial statements of Smurfit Westrock following the Smurfit Kappa Share Exchange are a continuation of the\n \nfinancial statements of Smurfit Kappa and therefore, the historical consolidated financial information for periods prior to the\n \nCombination, including the comparatives presented, reflect the pre-Combination carrying values of Smurfit Kappa except for the\n \nretrospective adjustment to reflect the Company’s legal share capital as the successor after giving effect to the Smurfit Kappa Share\n \nExchange.\nSee “Note \n2. Acquisitions\n” of the \n2024 Consolidated Financial Statements\n for additional information related to the accounting for the\n \nCombination.\n38\nRecent Developments\nCapacity Reduction and Facility Closures\nOn April 30, 2025, we filed an 8-K that announced our plan to permanently close our coated recycled paperboard (“CRB”) mill in St.\n \nPaul, Minnesota, U.S. and discontinue production at our containerboard mill in Forney, Texas, U.S. The Company also initiated\n \nconsultations with local works councils in Germany with a view to permanently closing two converting facilities there. We stopped\n \nproduction at these two U.S. mills in June 2025 and May 2025, respectively. The mill closures reduced our capacity by over 500,000\n \ntons. In the third quarter of 2025, we reached agreements with the local works councils in Germany and are in the process of closing\n \nthose two converting facilities. The mill closures and two converting facility closures are not expected to have a significant impact on\n \nour net sales as we aim to match our supply with customer demand. See “Note \n5. Impairment and Restructuring Costs\n” of the\n \nCondensed\n Consolidated Financial Statements for additional information. Excluding associated impairment and restructuring costs,\n \nthe elimination of corresponding fixed costs is anticipated to increase overall profitability.\nEXECUTIVE SUMMARY\nSmurfit Westrock’s net sales \nincreased\n by \n$332 million\n, to \n$8,003 million\n in the three\n months ended\n \nSeptember 30, 2025\n, from\n \n$7,671 million\n in the three\n months ended\n \nSeptember 30, 2024\n. The three months ended \nSeptember 30, 2025\n included an extra five\n \ndays compared to the prior year period since the Combination closed on July 5, 2024. Net sales \nincreased\n by \n$10,029 million\n, to\n \n$23,599 million\n in the \nnine months ended\n \nSeptember 30, 2025\n, from \n$13,570 million\n in the \nnine months ended\n \nSeptember 30, 2024\n.\n \nAs described in “Results of Operations” below, the increase \nin \nboth periods was primarily due to the acquisition of WestRock which\n \ncontributed approximately \n$270 million\n in the three months ended \nSeptember 30, 2025\n and \n$9,845 million\n in the \nnine months ended\n \nSeptember 30, 2025\n.\nNet income (loss) attributable to common shareholders\n \nincreased\n by \n$396 million\n, due to an \nincome\n of \n$246 million\n in the three\n \nmonths ended\n \nSeptember 30, 2025\n, compared to a \nloss\n of \n$150 million\n in the three\n months ended\n \nSeptember 30, 2024\n. \nNet income\n \n(loss) attributable to common shareholders\n \nincreased\n by \n$429 million\n, to \nincome\n of \n$602 million\n in the \nnine months ended\n \nSeptember 30, 2025\n, compared to \nincome\n of \n$173 million\n in the \nnine months ended\n \nSeptember 30, 2024\n. The \nincrease\n in both the\n \nthree\n and \nnine months ended\n \nSeptember 30, 2025\n was primarily due to the Combination. In the three and \nnine months ended\n \nSeptember 30, 2025\n, we incurred higher impairment and restructuring costs. In the three\n and \nnine months ended\n \nSeptember 30, 2024\n \nwe incurred higher transaction and integration-related expenses associated with the Combination and \n$227 million\n for the amortization\n \nof the fair value step up on inventory recognized on WestRock’s inventory. In addition, the positive impact of the acquired operations\n \nwas partially offset by higher interest expense post Combination. \nSee “Note \n5. Impairment and Restructuring Costs\n” and “Note \n6.\n \nTransaction and Integration-related Expenses Associated with the Combination\n” of the \nCondensed\n Consolidated Financial Statements\n \nfor additional information.\nNet cash provided by operating activities \nincreased\n by \n$1,495 million\n, to \n$2,197 million\n in the \nnine months ended\n \nSeptember 30,\n \n2025\n, from \n$702 million\n in the \nnine months ended\n \nSeptember 30, 2024\n, primarily due to a \n$1,525 million\n increase in net income\n \nadjusted for non-cash items, primarily including depreciation, depletion and amortization, impairment charges, cash surrender value\n \nincrease in excess of premiums paid, share-based compensation expense, \ndeferred income tax benefit\n, and pension and other\n \npostretirement funding more than cost. The increase in net income adjusted for non-cash items was partially offset by the \n$30 million\n \nincrease\n in the cash outflows from changes in operating assets and liabilities. During the \nnine months ended\n \nSeptember 30, 2025\n,\n \nSmurfit Westrock invested \n$1,609 million\n in capital expenditures. The Company’s net cash \ninflow\n from changes in debt was\n \n$74 million\n, and it paid \n$675 million\n of cash dividends to shareholders. See the section entitled “Liquidity and Capital Resources”\n \nbelow for additional information.\nRefer to “Results of Operations” for a detailed review of Smurfit Westrock’s performance.\n39\nSIGNIFICANT FACTORS AND TRENDS AFFECTING SMURFIT WESTROCK’S RESULTS\nSmurfit Westrock’s operations have been, and will continue to be, affected by many factors, some of which are beyond the Company’s\n \ncontrol. Smurfit Westrock’s net sales are primarily derived from the sale of containerboard, corrugated containers, paperboard,\n \nconsumer packaging, and other paper-based packaging products. As such, Smurfit Westrock’s net sales during any period are largely\n \ninfluenced by volumes, prices and costs of the corrugated containers and consumer packaging products that Smurfit Westrock sells\n \nduring that period.\n \nVolumes\n \nIn general, demand for corrugated containers and consumer packaging is closely correlated with overall economic growth and activity.\n \nIt also directionally correlates with levels of industrial production and is impacted by the trends affecting the choice of medium (paper,\n \nplastic, glass, metal, or wood) used in the packaging of these products. As a result, demand is driven by the need for: (i) packaging\n \nproducts for consumer and industrial goods, (ii) higher value-added corrugated products used for point-of-sale displays and consumer\n \nand shelf-ready packaging, and (iii) packaging of pharmaceutical products and the growth of related industries. Normal patterns of\n \ndemand growth can be disrupted by other macroeconomic trends, including inflation, pandemics (such as the COVID-19 pandemic\n \nand related lockdowns), and global economic and geopolitical developments (including tariffs or other trade restrictions), among\n \nothers. For instance, current U.S. tariff policies have introduced uncertainty and may negatively impact demand from the Company’s\n \ncustomers and overall volumes.\nConsumer patterns also play a significant role in demand for corrugated packaging and consumer packaging. In recent years, shifting\n \nconsumer behaviors have accelerated, particularly with the rise of e-commerce and increased awareness of unsustainable packaging\n \nsolutions. These trends have, to date, been beneficial for paper-based packaging, which is typically made from renewable, recyclable\n \nmaterials. Changing demographics can also influence demand trends in the pharmaceutical industry, a major user of consumer\n \npackaging.\n \nPrices and Costs\nPrices of corrugated containers and consumer packaging are primarily a function of the cyclical nature of Smurfit Westrock’s industry,\n \ncapacity and competition in the markets it operates in, prevailing raw material prices, and other operating costs, such as energy,\n \nchemicals, and transportation, overlaying supply and demand balances.\n  \nAs paper costs generally represent a large portion of the cash cost of production for corrugated containers or consumer packaging,\n \ncontainerboard price movements tend to impact the prices of corrugated containers. In turn, the cost of paper is influenced by\n \nmovements in the price of its major raw materials—wood or recycled paper—along with other supply and demand factors. Smurfit\n \nWestrock’s production processes are energy-intensive, making production costs also sensitive to the price of energy (primarily gas and\n \nelectricity), which have historically been volatile. Other key cost drivers include employee benefit expenses, largely determined by\n \nworkforce size, and shipping and handling costs, which are generally affected by fuel prices and overall labor inflation.\n \nWhile many of Smurfit Westrock’s customer contracts include price adjustment clauses that allow cost increases to be passed on to\n \ncustomers, these clauses may not in all cases be effective to offset rising costs. Additionally, for corrugated and consumer packaging\n \nproducts, even when Smurfit Westrock is able to implement price increases, there is typically a three- to six-month lag between raw\n \nmaterial price hikes and the realization of higher pricing from customers.\n \nForeign Currency Effects\nSmurfit Westrock operates in multiple countries across North America, South America, Europe, Asia, Africa, and Australia. As a\n \nresult, currency fluctuations can have both direct and indirect impacts on its financial statements, which are presented in U.S. dollars.\n \n40\nRESULTS OF OPERATIONS\nThe following table summarizes Smurfit Westrock’s consolidated results for the periods presented ($ in millions):\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nNet sales\n$\n8,003\n$\n7,671\n$\n23,599\n$\n13,570\nCost of goods sold\n(6,434)\n(6,321)\n(18,938)\n(10,817)\nGross profit\n1,569\n1,350\n4,661\n2,753\nSelling, general and administrative expenses\n(963)\n(1,007)\n(2,899)\n(1,776)\nImpairment and restructuring costs\n(65)\n(21)\n(360)\n(21)\nTransaction and integration-related expenses associated with \nthe Combination\n(15)\n(267)\n(72)\n(350)\nOperating profit\n526\n55\n1,330\n606\nPension and other postretirement non-service income \n(expense), net\n8\n8\n24\n(31)\nInterest expense, net\n(177)\n(167)\n(526)\n(225)\nOther expense, net\n(21)\n(13)\n(44)\n(13)\nIncome (loss) before income taxes\n336\n(117)\n784\n337\nIncome tax expense\n(91)\n(33)\n(183)\n(164)\nNet income (loss)\n245\n(150)\n601\n173\nNet loss attributable to noncontrolling interests\n1\n—\n1\n—\nNet income (loss) attributable to common shareholders\n$\n246\n$\n(150)\n$\n602\n$\n173\nResults of operations for the three and \nnine months ended\n \nSeptember 30, 2025\n, compared to the three and \nnine months ended\n \nSeptember 30, 2024\nNet Sales\nNet sales \nincreased\n by \n$332 million\n, to \n$8,003 million\n in the three\n months ended\n \nSeptember 30, 2025\n, from \n$7,671 million\n in the three\n \nmonths ended\n \nSeptember 30, 2024\n. This \nincrease\n included an extra five days compared to the prior year period since the Combination\n \nclosed on July 5, 2024, or approximately \n$270 million\n. \nExcluding the impact of the WestRock acquisition for the extra five days, net\n \nsales increased by $62\n million primarily resulting from a positive impact of $216 million due to a higher selling price mix and a $196\n \nmillion net positive foreign currency impact, partly offset by a negative volume impact of $350 million.\n \nNet sales \nincreased\n by \n$10,029 million\n, to \n$23,599 million\n in the \nnine months ended\n \nSeptember 30, 2025\n, from \n$13,570 million\n in the\n \nnine months ended\n \nSeptember 30, 2024\n. This \nincrease\n was primarily due to the impact of \n$9,845 million\n \nrelated to the acquisition of\n \nWestRock. Excluding the impact of this acquisition, net sales increased by $184 million primarily resulting from a $450 million\n \npositive impact due to a higher selling price mix and a $143 million net positive foreign currency impact, partly offset by a negative\n \nvolume impact of $408 million.\nSee “\nSegment Information\n” below for more detail on Smurfit Westrock’s segment results.\nCost of Goods Sold\nCost of goods sold \nincreased\n by \n$113 million\n, to \n$6,434 million\n in the three\n months ended\n \nSeptember 30, 2025\n, from \n$6,321 million\n in\n \nthe three\n months ended\n \nSeptember 30, 2024\n. This \nincrease\n included an extra five days compared to the prior year period since the\n \nCombination closed on July 5, 2024, or approximately $229 million. \nExcluding the impact of the acquisition of WestRock for the\n \nextra five days\n, cost of goods sold decreased by $116 million primarily due to an expense of $227 million included in the three\n months\n \nended\n \nSeptember 30, 2024\n for the amortization of the fair value step up on inventory recognized on WestRock’s inventory acquired.\n41\nCost of goods sold \nincreased\n by \n$8,121 million\n, to \n$18,938 million\n in the \nnine months ended\n \nSeptember 30, 2025\n, from\n \n$10,817 million\n in the \nnine months ended\n \nSeptember 30, 2024\n. The \nincrease\n in cost of goods sold was primarily due to the impact of\n \nthe acquisition of WestRock of $8,240 million. Excluding the impact of this acquisition, cost of goods sold decreased $119 million\n \nprimarily due to an expense of $227 million for the amortization of the fair value step up on inventory recognized on WestRock’s\n \ninventory acquired in the \nnine months ended\n \nSeptember 30, 2024\n.\n \nSelling, General and Administrative (“SG&A”) Expenses\nSG&A expenses \ndecreased\n by \n$44 million\n, to \n$963 million\n in the three\n months ended\n \nSeptember 30, 2025\n, from \n$1,007 million\n in the\n \nthree\n months ended\n \nSeptember 30, 2024\n. This decrease included an extra five days compared to the prior year period since the\n \nCombination closed on July 5, 2024, or approximately $30 million. \nExcluding the impact of the WestRock acquisition for the extra\n \nfive days\n, the \ndecrease\n in SG&A expenses was primarily due to a lower share-based payment expense of $88 million in the three\n \nmonths ended\n \nSeptember 30, 2025\n.\n \nSG&A expenses \nincreased\n by \n$1,123 million\n, to \n$2,899 million\n in the \nnine months ended\n \nSeptember 30, 2025\n, from \n$1,776 million\n in\n \nthe \nnine months ended\n \nSeptember 30, 2024\n. The \nincrease\n in SG&A expenses was primarily due to additional SG&A expenses of\n \n$1,126 million related to the acquisition of WestRock.\n \nImpairment and Restructuring Costs\nImpairment and restructuring costs\n \nincreased\n by \n$44 million\n, to \n$65 million\n in the \nthree months ended\n \nSeptember 30, 2025\n, from\n \n$21 million\n in the \nthree months ended\n \nSeptember 30, 2024\n. In the three months ended \nSeptember 30, 2025\n, impairment and\n \nrestructuring costs consisted of \n$58 million\n of impairment charges and \n$7 million\n of restructuring costs. In the three months ended\n \nSeptember 30, 2024\n, impairment and restructuring costs consisted of \n$2 million\n of impairment charges and \n$19 million\n of\n \nrestructuring costs.\n \nImpairment and restructuring costs\n \nincreased\n by \n$339 million\n, to \n$360 million\n in the \nnine months ended\n \nSeptember 30, 2025\n, from\n \n$21 million\n in the \nnine months ended\n \nSeptember 30, 2024\n. In the nine months ended September 30, 2025, impairment and\n \nrestructuring costs consisted of \n$242 million\n of impairment charges and \n$118 million\n of restructuring costs. In the \nnine months ended\n \nSeptember 30, 2024\n, impairment and restructuring costs consisted of \n$2 million\n of impairment charges and \n$19 million\n of\n \nrestructuring costs. The \nincrease\n in impairment and restructuring costs was primarily due to our \nannounced plan to permanently close\n \nour CRB mill in St. Paul, Minnesota, U.S., discontinue production at our containerboard mill in Forney, Texas, U.S., and costs\n \nassociated with two converting facilities in Germany that are in the process of closing. We stopped production at these two U.S. mills\n \nin June 2025 and May 2025, respectively.\nSee “Note \n5. Impairment and Restructuring Costs\n” of the \nCondensed\n Consolidated Financial Statements for additional information.\nTransaction and Integration-related Expenses Associated with the Combination\nThe Company incurred transaction and integration-related expenses associated with the Combination of\n \n$15 million\n and \n$267 million\n \nin the three\n months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively. In the three\n months ended\n \nSeptember 30, 2025\n, transaction and\n \nintegration-related expenses consisted primarily of \n$17 million\n of integration-related expenses associated with the Combination. In the\n \nthree\n months ended \nSeptember 30, 2024\n, transaction and integration-related expenses consisted of \n$128 million\n of transaction-related\n \nexpenses and \n$139 million\n of integration-related expenses \nassociated with the Combination.\nThe Company incurred transaction and integration-related expenses associated with the Combination of\n \n$72 million\n and \n$350 million\n \nin the \nnine months ended\n \nSeptember 30, 2025\n and \n2024\n, respectively. In the \nnine months ended\n \nSeptember 30, 2025\n, \ntransaction and\n \nintegration-related expenses consisted primarily of i\nntegration-related expenses associated with the Combination of \n$74 million\n. In the\n \nnine months ended\n \nSeptember 30, 2024\n, \ntransaction and integration-related expenses consisted of t\nransaction-related expenses of\n \n$211 million\n and \n$139 million\n of integration-related expenses associated with the Combination\n.\n42\nTransaction-related costs associated with the Combination were comprised of banking and financing related costs as well as legal and\n \nother professional services which were directly attributable to the Combination and retention payments that were contractually\n \ncommitted to and associated with the successful completion of the Combination. \nWe incur integration expenses post-acquisition that\n \nreflect work performed to facilitate merger and acquisition integration and primarily consist of professional services and personnel and\n \nrelated expenses, such as work associated with information systems.\nSee “Note \n6. Transaction and Integration-related Expenses Associated with the Combination\n” of the \nCondensed\n Consolidated\n \nFinancial Statements for additional information.\nPension and Other Postretirement Non-Service Income (Expense), Net\n \nPension and other postretirement non-service income (expense), net\n was flat year on year with \nincome\n of \n$8 million\n in the three\n \nmonths ended\n \nSeptember 30, 2025\n and \nincome\n of \n$8 million\n in the three\n months ended\n \nSeptember 30, 2024\n. This was primarily due to\n \na \n$1 million\n \nincrease\n in the expected return on assets primarily due to acquired pension assets in connection with the Combination,\n \nfully offset by an \nincrease\n in interest costs of \n$1 million\n primarily due to acquired pension liabilities in connection with the\n \nCombination.\nPension and other postretirement non-service income (expense), net\n \ndecreased\n by \n$55 million\n, to \nincome\n of \n$24 million\n in the \nnine\n \nmonths ended\n \nSeptember 30, 2025\n, from \nexpense\n of \n$31 million\n in the \nnine months ended\n \nSeptember 30, 2024\n. This \ndecrease\n was\n \nprimarily due to a \n$164 million\n \nincrease\n in the expected return on assets primarily due to acquired pension assets in connection with\n \nthe Combination and a \ndecrease\n in net settlement loss of \n$19 million\n, partially offset by an \nincrease\n in interest costs of \n$133 million\n \nprimarily due to acquired pension liabilities in connection with the Combination.\nInterest Expense, Net\nInterest expense, net \nincreased\n by \n$10 million\n to \n$177 million\n in the three\n months ended\n \nSeptember 30, 2025\n, from \n$167 million\n in the\n \nthree\n months ended\n \nSeptember 30, 2024\n. This \nincrease\n was primarily due to additional interest expense in 2025 due to our November\n \n2024 debt refinancing and the inclusion of an additional five days of interest expense, net compared to the prior year period as the\n \nCombination closed on July 5, 2024\n.\nInterest expense, net \nincreased\n by \n$301 million\n to \n$526 million\n in the \nnine months ended\n \nSeptember 30, 2025\n, from \n$225 million\n in\n \nthe \nnine months ended\n \nSeptember 30, 2024\n. The \nincrease\n was primarily the result of interest on debt assumed and debt issued in\n \nconnection with the Combination.\nSee “Note \n2. Acquisitions\n” and “Note \n14. Debt\n” of the \n2024 Consolidated Financial Statements\n for additional information on the debt\n \nassumed and debt issued in connection with the Combination.\nOther (Expense) Income, Net\nOther expense, net\n \nincreased\n by\n \n$8 million\n to \nexpense\n of \n$21 million\n \nin the three\n months ended\n \nSeptember 30, 2025\n, from \nexpense\n of\n \n$13 million\n in the three\n months ended \nSeptember 30, 2024\n primarily due to a\n $7 million\n net negative impact from foreign currency\n \ntranslation of monetary assets and liabilities and a $4 million decrease in income from equity method investments, which were\n \npartially offset by a \n$3\n million decrease in the expense recorded in connection with the sale of receivables under an accounts\n \nreceivable monetization program acquired as a result of the Combination.\nOther expense, net\n \nincreased\n by\n \n$31 million\n to \nexpense\n of \n$44 million\n in the \nnine months ended\n \nSeptember 30, 2025\n, from \nexpense\n of\n \n$13 million\n in the \nnine months ended\n \nSeptember 30, 2024\n primarily due to an $\n17\n million increase in the expense recorded in\n \nconnection with the sale of receivables under an accounts receivable monetization program acquired as a result of the Combination\n \nand a $12 million net negative impact from foreign currency translation of monetary assets and liabilities.\n43\nIncome Tax Expense\nIncome tax expense was \n$91 million\n in the three months ended \nSeptember 30, 2025\n, compared to an income tax expense of\n \n$33 million\n in the three months ended \nSeptember 30, 2024\n. The effective tax rate for the three months ended \nSeptember 30, 2025\n, was\n \n27.1%\n, while the effective tax rate for the three months ended \nSeptember 30, 2024\n, was \n(28.2)%\n.\nIncome tax expense was \n$183 million\n in the \nnine months ended\n \nSeptember 30, 2025\n, compared to an income tax expense of\n \n$164 million\n in the \nnine months ended\n \nSeptember 30, 2024\n. The effective tax rate for the \nnine months ended\n \nSeptember 30, 2025\n, was\n \n23.3%\n, while the effective tax rate for the \nnine months ended\n \nSeptember 30, 2024\n, was \n48.7%\n.\n \nSee “Note \n13. Income Taxes\n” of the \nCondensed\n Consolidated Financial Statements for the primary factors impacting our effective tax\n \nrates.\nOn July 4, 2025, U.S. tax legislation was enacted that included a broad range of tax reform provisions affecting businesses, including\n \nextending and modifying certain existing international and domestic provisions. The financial statement impacts were considered in\n \nthe third quarter, with no discrete period tax impacts of the change in tax law arising. Impacts from the legislation are either not\n \napplicable or immaterial to the financial statements. Certain changes may impact current or future cash tax obligations, but are not\n \nanticipated to impact the total tax expense.\nSEGMENT INFORMATION \nSmurfit Westrock has identified \nthree\n operating segments based on how the CODM makes key operating decisions, allocates resources\n \nand assesses the performance of the Company’s business. These operating segments are as follows: (i) North America, which includes\n \noperations in the U.S., Canada and Mexico, (ii) Europe, MEA and APAC and (iii) LATAM, which includes operations in Central\n \nAmerica and the Caribbean, Argentina, Brazil, Chile, Colombia, Ecuador and Peru. No operating segments have been aggregated for\n \ndisclosure purposes.\nSegment results include items directly attributable to a segment as well as those that can be allocated on a reasonable basis, but\n \nexclude certain central costs such as corporate costs, including executive costs, and costs of Smurfit Westrock’s legal, company\n \nsecretarial, pension administration, tax, treasury and controlling functions and other administrative costs. \nSegment profitability is\n \nmeasured based on Adjusted EBITDA, defined as \nincome (loss) before income taxes\n, \nunallocated corporate costs\n, \ndepreciation,\n \ndepletion and amortization\n, \ninterest expense, net\n, \npension and other postretirement non-service income (expense), net\n, \nshare-based\n \ncompensation expense\n, \nother expense, net\n, \nimpairment and restructuring costs\n, \ntransaction and integration-related expenses associated\n \nwith the Combination\n, \namortization of fair value step up on inventory\n a\nnd other specific items that management believes are not\n \nindicative of the ongoing operating results of the business.\nThe following table contains selected financial information for Smurfit Westrock’s segments for the periods presented\n ($ in millions):\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nNet sales (aggregate):\n(1)\nNorth America\n$\n4,721\n$\n4,649\n$\n14,145\n$\n5,499\nEurope, MEA and APAC\n2,831\n2,651\n8,191\n7,056\nLATAM\n545\n506\n1,576\n1,187\nSegment Adjusted EBITDA:\nNorth America\n$\n810\n$\n780\n$\n2,347\n$\n900\nEurope, MEA and APAC\n419\n411\n1,180\n1,158\nLATAM\n116\n116\n354\n257\n(1)\n Net sales before intersegment eliminations\n44\nThe three and \nnine months ended\n \nSeptember 30, 2025\n, compared to the three and \nnine months ended\n \nSeptember 30, 2024\nNorth America Segment\nNet Sales\nNet sales before intersegment eliminations for the North America segment \nincreased\n by \n$72 million\n, to \n$4,721 million\n in the three\n \nmonths ended \nSeptember 30, 2025\n, from \n$4,649 million\n in the three\n months ended\n \nSeptember 30, 2024\n. This \nincrease\n was primarily\n \ndue to the inclusion of an extra five days compared to the prior year period since the Combination closed on July 5, 2024, or\n \napproximately $247 million, and a $181 million impact of a higher sales price mix, partly offset by $358 million due to lower\n \nvolumes\n.\nNet sales before intersegment eliminations for the North America segment \nincreased\n by \n$8,646 million\n, to \n$14,145 million\n in the \nnine\n \nmonths ended\n \nSeptember 30, 2025\n, from \n$5,499 million\n in the \nnine months ended\n \nSeptember 30, 2024\n. This \nincrease\n was primarily\n \ndue to the positive impact of $8,877 million from the acquisition of WestRock. Excluding the impact of this acquisition, net sales\n \nbefore intersegment eliminations decreased by $231 million primarily due t\no a $392 million im\npact of lower volumes and a net\n \nnegative foreign currency impact of $71 million, partly offse\nt by a $235 million i\nmpact from a higher sales price mix.\nAdjusted EBITDA\nAdjusted EBITDA for the North America segment \nincreased\n by \n$30 million\n, to \n$810 million\n in the \nthree months ended\n \nSeptember 30,\n \n2025\n, from \n$780 million\n in the three\n months ended\n \nSeptember 30, 2024\n. This \nincrease\n included an extra five days compared to the\n \nprior year period since the Combination closed on July 5, 2024, or approximately $38 million. Excluding the impact of the WestRock\n \nacquisition for the extra five days, Adjusted EBITDA decreased by $8 million due to lower volumes of $85 million,\n higher costs of\n \n$104 million\n, partly offset by a higher sales price mix of $181 million.\nAdjusted EBITDA for the North America segment \nincreased\n by \n$1,447 million\n, to \n$2,347 million\n in the \nnine months ended\n \nSeptember 30, 2025\n, from \n$900 million\n in the \nnine months ended\n \nSeptember 30, 2024\n. This \nincrease\n was primarily due to the positive\n \nimpact of $1,446 million from the acquisition of WestRock. Excluding the impact of this acquisition, Adjusted EBITDA was\n \nessentially flat year on year with a higher sales price mix of $235 million fully offset by higher costs of $151 million, lower volumes\n \nof $75 million and net negative foreign currency impact of $9 million.\nEurope, MEA and APAC Segment\nNet Sales\nNet sales before intersegment eliminations for the Europe, MEA and APAC segment \nincreased\n by \n$180 million\n, to \n$2,831 million\n in\n \nthe \nthree months ended\n \nSeptember 30, 2025\n, from \n$2,651 million\n in the three\n months ended\n \nSeptember 30, 2024\n. This \nincrease\n \nincluded approximately $23 million for the extra five days in the quarter compared to the prior year period since the Combination\n \nclosed on July 5, 2024. Excluding the impact of the WestRock acquisition for the extra five days, net sales before intersegment\n \neliminations increased by $157 million. This \nincrease\n was p\nrimarily due to the net positive foreign currency impact of $197 million\n \ndue to the strengthening of the euro against the U.S. dollar, partly offset by lower volumes of $37 million.\nNet sales before intersegment eliminations for the Europe, MEA and APAC segment \nincreased\n by \n$1,135 million\n, to \n$8,191 million\n in\n \nthe \nnine months ended\n \nSeptember 30, 2025\n, from \n$7,056 million\n in the \nnine months ended\n \nSeptember 30, 2024\n. This \nincrease\n was\n \nprimarily due to the impact of $808 million which related to the acquisition of WestRock. Excluding the impact of this acquisition, net\n \nsales before intersegment eliminations increased by $327 million primarily due to a net positive foreign currency impact of $236\n \nmillion primarily due to the strengthening of the euro against the U.S. dollar, a higher selling price mix of $147 million, partly offset\n \nby a negative volume impact of $70 million.\n \n45\nAdjusted EBITDA\nAdjusted EBITDA for the Europe, MEA and APAC segment \nincreased\n by \n$8 million\n, to \n$419 million\n in the \nthree months ended\n \nSeptember 30, 2025\n, from \n$411 million\n in the \nthree months ended\n \nSeptember 30, 2024\n.\n The increase was primarily due to a\n $25\n \nmillion net positive foreign currency impact, partly offset by lower volumes of $12 million.\n \nAdjusted EBITDA for the Europe, MEA and APAC segment \nincreased\n by \n$22 million\n, to \n$1,180 million\n in the \nnine months ended\n \nSeptember 30, 2025\n, from \n$1,158 million\n in the \nnine months ended\n \nSeptember 30, 2024\n. There was an $84 million positive impact\n \nfrom the acquisition of WestRock. Excluding the impact of this acquisition, Adjusted EBITDA decreased by $62 million primarily due\n \nto higher costs of $225 million, partly offset by a higher selling price mix impact of $147 million.\nLATAM Segment\n \nNet Sales\nNet sales before intersegment eliminations for the LATAM segment \nincreased\n by \n$39 million\n, to \n$545 million\n in the three months\n \nended \nSeptember 30, 2025\n, from \n$506 million\n in the three months ended \nSeptember 30, 2024\n. This \nincrease\n \nwas primarily du\ne to the\n \ninclusion of an extra five days compared to the prior year period since the Combination closed on July 5, 2024, or approximately $12\n \nmillion. \nExcluding the impact of the WestRock acquisition for the extra five days, net sales before intersegment eliminations increased\n \nby $27 million primarily due to a\n higher sales price mix of $39 million, partly offset by lower volumes of $4 million.\nNet sales before intersegment eliminations for the LATAM segment \nincreased\n by \n$389 million\n, to \n$1,576 million\n in the \nnine months\n \nended\n \nSeptember 30, 2025\n, from \n$1,187 million\n in the \nnine months ended\n \nSeptember 30, 2024\n. This \nincrease\n \nwas primarily due to the\n \npositive impact of $375 million from the acquisition of WestRock.\n \nAdjusted EBITDA\nAdjusted EBITDA for the LATAM segment was \n$116 million\n in the three months ended \nSeptember 30, 2025\n and \n$116 million\n in the\n \nthree months ended \nSeptember 30, 2024\n.\n The results were primarily impacted by a higher sales price mix of $39 million that was more\n \nthan offset by higher costs of $45 million.\nAdjusted EBITDA for the LATAM segment \nincreased\n by \n$97 million\n, to \n$354 million\n in the \nnine months ended\n \nSeptember 30, 2025\n,\n \nfrom \n$257 million\n in the \nnine months ended\n \nSeptember 30, 2024\n. This \nincrease\n \nwas primarily due to the positive impact of $117\n \nmillion from the acquisition of WestRock. Excluding this acquisition, Adjusted EBITDA decreased by $20 million primarily due to\n \nhigher costs of $84 million, partly offset by a higher selling price mix of $65 million.\nLIQUIDITY AND CAPITAL RESOURCES\nSources and Uses of Cash\nSmurfit Westrock’s primary sources of liquidity are the cash flows generated from its operations, its commercial paper program, and\n \ncommitted credit lines. The uncommitted commercial paper program is supported by the \n$4,500 million\n revolving loan facility with a\n \nseparate swingline sub-facility which allows for same-day drawing in U.S. dollar. The revolving credit facility had an original term of\n \nfive years, with two one-year extension options. In June 2025, the Group exercised the first extension option, extending the maturity\n \ndate to June 28, 2030. The amount of commercial paper outstanding does not reduce available capacity under the revolving loan\n \nfacility. The primary uses of this liquidity are to fund Smurfit Westrock’s day-to-day operations, capital expenditures, debt service,\n \ndividends and other investment activity, including acquisitions.\nAs of \nSeptember 30, 2025\n, Smurfit Westrock held cash and cash equivalents of \n$851 million\n, of which $234 million were held in euro,\n \n$309 million were held in U.S. dollars and $308 million were held in other currencies. At \nSeptember 30, 2025\n, the Company had\n \n$\n4,73\n9 million in undrawn committed facilities available under the revolving loan facility and receivables securitization facilities. The\n \nweighted average period until maturity of undrawn committed facilities was 4.6 years as of \nSeptember 30, 2025\n. Combined with cash\n \nand cash equivalents of \n$851 million\n, the Company had $\n5,590\n million of available liquidity.\n46\nAs of \nSeptember 30, 2025\n, Smurfit Westrock had \n$14,171 million\n of debt, excluding debt issuance costs. As of \nSeptember 30, 2025\n,\n \nthe carrying amount of current debt was \n$798 million\n. In the \nnine months ended\n \nSeptember 30, 2025\n, total debt \nincreased\n by\n \n$516 million\n, \n$74 million\n of which was due to a net \nincrease\n in borrowings and the remainder was primarily due to translation\n \nadjustments. \nThe carrying amount of the Company’s debt includes a fair value adjustment related to debt assumed through mergers\n \nand acquisitions. At \nSeptember 30, 2025\n, the unamortized fair value market adjustment was \n$39 million\n. Included within the carrying\n \nvalue of Smurfit Westrock’s borrowings as of \nSeptember 30, 2025\n are deferred debt issuance costs of \n$60 million\n, of which \n$8 million\n \nis current, all of which will be recognized in interest expense in Smurfit Westrock’s Condensed Consolidated Statements of\n \nOperations using the effective interest rate method over the remaining life of the borrowings. \nSee “Note \n12. Debt\n” \nof the \nCondensed\n \nConsolidated Financial Statements \nfor a discussion of the Company’s additional debt-related information.\nThe Company believes that the cash flows generated from its operations, cash on hand, its commercial paper program, available\n \nborrowings under its committed credit lines and available capital through access to capital markets will be adequate to meet the\n \nCompany's liquidity and capital requirements, including payments of any declared dividends, for the next 12 months and for the\n \nforeseeable future.\nSmurfit Westrock uses a variety of working capital management strategies including supply chain financing (“SCF”) programs,\n \nvendor financing and commercial card programs, monetization facilities where we sell short-term receivables to a group of third-party\n \nfinancial institutions, and receivables securitization facilities. The programs are described below.\nThe Company engages in certain customer-based SCF programs to accelerate the receipt of payment for outstanding accounts\n \nreceivables from certain customers. Certain costs of these programs are borne by the customer or the Company. Receivables\n \ntransferred under these customer-based SCF programs generally meet the requirements to be accounted for as sales in accordance with\n \nguidance under “Transfers and Servicing” (“ASC 860”), resulting in derecognition of such receivables from the Company’s\n \nCondensed Consolidated Balance Sheets. Receivables involved with these customer-based SCF programs generally averages\n \napproximately 5% of the Company’s accounts receivable balance. In addition, Smurfit Westrock has monetization facilities that sell to\n \nthird-party financial institutions all of the short-term receivables generated from certain customer trade accounts. See “Note \n11. Fair\n \nValue Measurement\n” of the \nCondensed\n Consolidated Financial Statements for a discussion of the Company’s monetization facilities.\nSmurfit Westrock’s working capital management strategy includes working with its suppliers to revisit terms and conditions, including\n \nthe extension of payment terms. The Company’s current payment terms with the majority of its suppliers generally range from payable\n \nupon receipt to 120 days and vary for items such as the availability of cash discounts. The Company does not believe its payment\n \nterms will be shortened significantly in the near future, and does not expect its net cash provided by operating activities to be\n \nsignificantly impacted by additional extensions of payment terms. Certain financial institutions offer voluntary SCF programs that\n \nenable the Company’s suppliers, at their sole discretion, to sell their receivables from Smurfit Westrock to the financial institutions on\n \na non-recourse basis at a rate that leverages the Company’s credit rating and thus might be more beneficial to the Company’s\n \nsuppliers. Smurfit Westrock and its suppliers agree on commercial terms for the goods and services procured, including prices,\n \nquantities and payment terms, regardless of whether the supplier elects to participate in SCF programs. The suppliers sell Smurfit\n \nWestrock goods or services and issue the associated invoices based on the agreed-upon contractual terms. The due dates of the\n \ninvoices are not extended due to the supplier’s participation in SCF programs. Smurfit Westrock suppliers, at their sole discretion if\n \nthey choose to participate in a SCF program, determine which invoices, if any, they want to sell to the financial institutions. No\n \nguarantees are provided by the Company under SCF programs, and it has no economic interest in a supplier’s decision to participate in\n \nthe SCF program. Therefore, amounts due to the Company’s suppliers that elect to participate in SCF programs are included in the\n \n“Accounts payable” line item in the Company’s Condensed Consolidated Balance Sheets and the activity is reflected in “Net cash\n \nprovided by operating activities” in the Company’s Condensed Consolidated Statements of Cash Flows. Based on correspondence\n \nwith the financial institutions that are involved with Smurfit Westrock’s two primary SCF programs, while the amount suppliers elect\n \nto sell to the financial institutions varies from period to period, the amount generally averages approximately \n11\n-\n14%\n of the\n \nCompany’s accounts payable balance. The outstanding payment obligations to financial institutions under these programs were\n \n$367 million\n as of \nSeptember 30, 2025\n.\n47\nSmurfit Westrock also participates in certain vendor financing and commercial card programs to support travel and entertainment\n \nexpenses and smaller vendor purchases. Amounts outstanding under these programs are classified as debt primarily because the\n \nCompany receives the benefit of extended payment terms and a rebate from the financial institution that would not have otherwise\n \nbeen received without the financial institution's involvement. Smurfit Westrock also has receivables securitization facilities that allows\n \nfor borrowing availability based on underlying accounts receivable eligibility and compliance with certain covenants. See “Note \n12.\n \nDebt\n” and “Note \n18. Variable Interest Entities\n” of the \nCondensed\n Consolidated Financial Statements for a discussion of the\n \nreceivables securitization facilities and the amount outstanding under the Company’s vendor financing and commercial card programs.\nCash Flow Activity\nThe following table contains selected financial information from Smurfit Westrock’s Condensed Consolidated Statements of Cash\n \nFlows for the periods presented ($ in millions):\nNine months ended September 30,\n2025\n2024\nNet cash provided by operating activities\n$\n2,197\n$\n702\nNet cash used for investing activities\n$\n(1,564)\n$\n(1,595)\nNet cash (used for) provided by financing activities\n$\n(674)\n$\n869\nNet cash \nprovided by\n operating activities \nincreased\n by \n$1,495 million\n to \n$2,197 million\n in the \nnine months ended\n \nSeptember 30, 2025\n \nfrom \n$702 million\n in the \nnine months ended\n \nSeptember 30, 2024\n, primarily due to a \n$1,525 million\n increase in net income adjusted for\n \nnon-cash items, primarily including depreciation, depletion and amortization, impairment charges, cash surrender value increase in\n \nexcess of premiums paid, share-based compensation expense, \ndeferred income tax benefit\n, and \npension and other postretirement\n \nfunding more than cost. \nThe increase in net income adjusted for non-cash items was partially offset by the \n$30 million\n \nincrease\n in the\n \ncash outflows from changes in operating assets and liabilities. The increase in the cash outflows from changes in operating assets and\n \nliabilities was inclusive of \ncash payments\n to financial institutions of \n$47 million\n in connection with the Company’s accounts\n \nreceivable monetization agreements in the \nnine months ended\n \nSeptember 30, 2025\n, compared to \ncash proceeds\n of \n$49 million\n in the\n \nprior year period. See “Note \n11. Fair Value Measurement\n” of the \nCondensed\n Consolidated Financial Statements for additional\n \ninformation.\nNet cash \nused for\n investing activities of \n$1,564 million\n in the \nnine months ended\n \nSeptember 30, 2025\n consisted primarily of capital\n \nexpenditures of \n$1,609 million\n. Net cash \nused for\n investing activities of \n$1,595 million\n in the \nnine months ended\n \nSeptember 30, 2024\n \nconsisted primarily of capital expenditures of \n$897 million\n and \n$716 million\n \nof cash paid for purchase of businesses, net of cash\n \nacquired.\n \nNet cash \nused for\n financing activities of \n$674 million\n in the \nnine months ended\n \nSeptember 30, 2025\n consisted primarily of cash\n \noutflows from cash dividends paid to shareholders of \n$675 million\n, tax paid in connection with shares withheld from employees of\n \n$68 million\n and debt issuance costs of \n$8 million\n, partially offset by\n a net \nincrease\n in debt of \n$74 million\n. Net cash \nprovided by\n \nfinancing activities of \n$869 million\n in the \nnine months ended\n \nSeptember 30, 2024\n consisted of cash inflows from a net \nincrease\n in debt\n \nof \n$1,455 million\n, partially offset by cash outflows from dividends paid to shareholders of \n$493 million\n, \ndebt issuance costs of\n \n$44 million\n, \npurchases of treasury stock of \n$27 million\n, and tax paid in connection with shares withheld from employees of\n \n$21 million\n.\nContractual Obligations and Commitments\n \nSmurfit Westrock is a party to enforceable and legally binding contractual obligations involving commitments to make payments to\n \nthird parties. These obligations impact Smurfit Westrock’s short-term and long-term liquidity and capital resource needs. Certain\n \ncontractual obligations are reflected on Smurfit Westrock’s Condensed Consolidated Balance Sheets as of \nSeptember 30, 2025\n, while\n \nothers are considered future obligations. Smurfit Westrock’s contractual obligations primarily consist of items such as long-term debt,\n \nincluding current portion, lease obligations, purchase obligations and other obligations.\n \nThere have been no material changes to the contractual obligations and commitments disclosed in “Management’s Discussion and\n \nAnalysis of Financial Condition and Results of Operations” of the Form 10-K for the fiscal year ended December 31, 2024.\n48\nOff-Balance Sheet Arrangements\nAs of \nSeptember 30, 2025\n, Smurfit \nWestrock\n did not have any off-balance sheet arrangements.\nNON-GAAP FINANCIAL MEASURE\nDefinitions\n \nNon-GAAP Financial Measure\nSmurfit Westrock reports its financial results in accordance with generally accepted accounting principles in the U.S. (“GAAP”).\n \nHowever, management believes “Adjusted EBITDA”, a non-GAAP financial measure discussed below, provides Smurfit Westrock’s\n \nBoard of Directors, investors, potential investors, securities analysts and others with additional meaningful financial information that\n \nshould be considered when assessing its ongoing performance \nrelative to other periods because it adjusts out non-recurring items that\n \nmanagement believes are not indicative of the ongoing results of the business\n. Smurfit Westrock management also uses this non-\nGAAP financial measure in making financial, operating and planning decisions, and in evaluating company performance. Non-GAAP\n \nfinancial measures are not intended to be considered in isolation of or as a substitute for, or superior to, financial information prepared\n \nand presented in accordance with GAAP and should be viewed in addition to, and not as an alternative for, the GAAP results. The\n \nnon-GAAP financial measure Smurfit Westrock presents may differ from similarly captioned measures presented by other companies.\n \nAdjusted EBITDA\nSmurfit Westrock uses the non-GAAP financial measure “Adjusted EBITDA” to evaluate its overall performance. The composition of\n \nAdjusted EBITDA is not addressed or prescribed by GAAP. Smurfit Westrock defines \nAdjusted EBITDA as \nnet income (loss)\n \nbefore\n \nincome tax expense, \ndepreciation, depletion and amortization\n, \ninterest expense, net\n, \npension and other postretirement non-service\n \nincome (expense), net\n, \nshare-based compensation expense\n, \nother expense, net\n, \nimpairment and restructuring costs\n, \ntransaction and\n \nintegration-related expenses associated with the Combination\n, \namortization of fair value step up on inventory\n a\nnd other specific items\n \nthat management believes are not indicative of the ongoing operating results of the business.\nManagement believes that the most directly comparable GAAP measure to Adjusted EBITDA is “\nNet income (loss)\n”.\nSet forth below is a reconciliation of the non-GAAP financial measure Adjusted EBITDA to \nNet income (loss)\n, the most directly\n \ncomparable GAAP measure, for the periods presented ($ in millions).\nThree months ended September 30,\nNine months ended September 30,\n2025\n2024\n2025\n2024\nNet income (loss)\n$\n245\n$\n(150)\n$\n601\n$\n173\nIncome tax expense\n91\n33\n183\n164\nDepreciation, depletion and amortization\n659\n564\n1,875\n872\nImpairment and restructuring costs\n65\n21\n360\n21\nTransaction and integration-related expenses associated with \nthe Combination\n15\n267\n72\n350\nAmortization of fair value step up on inventory\n—\n227\n—\n227\nInterest expense, net\n177\n167\n526\n225\nPension and other postretirement non-service (income) \nexpense, net\n(8)\n(8)\n(24)\n31\nShare-based compensation expense\n35\n123\n114\n154\nOther expense, net\n21\n13\n44\n13\nOther adjustments\n2\n8\n16\n(10)\nAdjusted EBITDA\n$\n1,302\n$\n1,265\n$\n3,767\n$\n2,220\nSee “Note \n3. Segment Information\n” \nof the \nCondensed\n Consolidated Financial Statements for additional information regarding “Other\n \nadjustments” in the table above.\n49\nGUARANTOR SUMMARIZED FINANCIAL INFORMATION\nOn April 3, 2024, Smurfit Kappa Treasury Unlimited Company (“SKT”) completed a private offering of \n$750 million\n aggregate\n \nprincipal amount of 5.200% Senior Notes due 2030, \n$1,000 million\n aggregate principal amount of 5.438% Senior Notes due 2034 and\n \n$1,000 million\n aggregate principal amount of 5.777% Senior Notes due 2054, which we refer to as the “Original SKT Notes”, and on\n \nNovember 26, 2024, Smurfit Westrock Financing Designated Activity Company (“SWF” and together with SKT, the “Issuers”)\n \ncompleted a private offering of \n$850 million\n aggregate principal amount of 5.418% Senior Notes due 2035, which we refer to as the\n \n“Original SWF Notes” (and, together with the Original SKT Notes, the “Original Notes”). As part of those offerings, the Issuers and\n \nthe Guarantors (as hereinafter defined) of the Original Notes entered into registration rights agreements with the initial purchasers\n \nthereof in which we agreed to use commercially reasonable efforts to complete exchange offers for such Original Notes in compliance\n \nwith applicable securities laws. In connection with the registration rights agreements, on May 23, 2025, following an exchange offer\n \nprocess, certain holders of the Original Notes, exchanged their notes for newly issued registered notes (the “New Notes”). The New\n \nNotes are substantially identical to the Original Notes, except that the New Notes are registered under the United States Securities Act\n \nof 1933, as amended, and will not have any transfer restrictions, registration rights or additional interest provisions. \nThe Guarantees\nThe Original Notes and the New Notes are subject to any limitations under applicable law, fully and unconditionally guaranteed,\n \njointly and severally, on a senior unsecured basis by each of Smurfit Westrock plc and the following wholly-owned subsidiaries of\n \nSmurfit Westrock plc (the “Subsidiary Guarantors”): Smurfit Kappa Group plc, Smurfit Kappa Investments Limited, Smurfit Kappa\n \nAcquisitions Unlimited Company, Smurfit Kappa Treasury Funding Designated Activity Company, Smurfit International B.V.,\n \nSmurfit WestRock US Holdings Corporation, WestRock Company, WRKCo Inc., WestRock MWV, LLC and WestRock RKT, LLC.\n \nIn addition, SWF fully and unconditionally guarantees SKT’s obligations under the Original Notes and the New Notes, and SKT fully\n \nand unconditionally guarantees SWF’s obligations under the Original Notes and the New Notes. SKT and SWF are both wholly-\nowned subsidiaries of Smurfit Westrock plc. Smurfit Westrock plc and the Subsidiary Guarantors are collectively referred to herein as\n \nthe “Guarantors”, and the Issuers and the Guarantors are collectively referred to herein as the “Obligor Group”.\nOperations are conducted almost entirely through Smurfit Westrock plc’s subsidiaries other than the Issuers and the Subsidiary\n \nGuarantors. Accordingly, the Obligor Group’s cash flow and ability to service its debt, including the New Notes, are dependent upon\n \nthe earnings of Smurfit Westrock plc’s other non-obligor subsidiaries (the “Non-Obligor Subsidiaries”) and the distribution of those\n \nearnings to the Obligor Group, whether by dividends, loans or otherwise. Holders of the New Notes have a direct claim only against\n \nthe Obligor Group.\nBasis of Preparation of the Summarized Financial Information\nThe tables below present summarized financial information provided in conformity with Rule 13-01 of the SEC’s Regulation S-X. The\n \nsummarized financial information of the Obligor Group is presented on a combined basis, excluding intercompany balances and\n \ntransactions between entities in the Obligor Group. The Obligor Group’s investment balances in Non-Obligor Subsidiaries have been\n \nexcluded. The Obligor Group’s amounts due from, amounts due to, and transactions with Non-Obligor Subsidiaries have been\n \npresented separately. The summarized financial information below should be read in conjunction with the Company’s Condensed\n \nConsolidated Financial Statements contained herein, as the summarized financial information may not necessarily be indicative of the\n \nresults of operations or financial position had the subsidiaries operated as independent entities ($ in millions).\n50\nSUMMARIZED STATEMENT OF OPERATIONS\nNine months ended \nSeptember 30,\n2025\nNet sales to unrelated parties\n \n$\n1,100\nNet sales to Non-Obligor Subsidiaries\n \n909\nGross profit\n \n697\nInterest expense, net with unrelated parties\n(464)\nInterest expense, net with Non-Obligor Subsidiaries\n(253)\nNet income and net income attributable to the Obligor Group\n291\nSUMMARIZED BALANCE SHEETS\nSeptember 30,\nDecember 31,\n2025\n2024\nASSETS\nCurrent amounts due from Non-Obligor Subsidiaries\n$\n5,617\n$\n4,925\nOther current assets\n920\n1,049\nTotal current assets\n$\n6,537\n$\n5,974\nNon-current amounts due from Non-Obligor Subsidiaries\n \n$\n2,938\n$\n2,848\nOther non-current assets\n384\n370\nTotal non-current assets\n \n$\n3,322\n$\n3,218\nLIABILITIES\nCurrent amounts due to Non-Obligor Subsidiaries\n \n$\n8,320\n$\n9,681\nOther current liabilities\n \n999\n1,122\nTotal current liabilities\n \n$\n9,319\n$\n10,803\nNon-current amounts due to Non-Obligor Subsidiaries\n \n$\n6,467\n$\n6,604\nOther non-current liabilities\n11,683\n9,644\nTotal non-current liabilities\n \n$\n18,150\n$\n16,248\n51\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThere have been no material changes during the \nnine months ended\n \nSeptember 30, 2025\n to Smurfit Westrock’s critical accounting\n \npolicies and estimates as identified in Smurfit Westrock’s Annual Report on Form 10-K for the year ended December 31, 2024.\n \nNEW ACCOUNTING STANDARDS\nSee “Note \n1. Description of Business and Summary of Significant Accounting Policies\n” of the \nCondensed\n Consolidated Financial\n \nStatements \nfor a full description of recent accounting pronouncements, including the respective expected dates of adoption and\n \nexpected effects on Smurfit \nWestrock\n’s results of operations and financial condition."
}