{
  "item1": "offerings corrugated consumer packaging across segments, along other specialist product offerings such bag- paper sacks. offerings supported innovation initiatives. Drive optimization paper system service growth downstream converting businesses, taking into carton, food service, liquid packaging, tobacco commercial print markets. sell products globally customers who value Combination; Expanding market positions through focused growth, including particular driving sustainability agenda; Continuing Smurfit Kappa’s WestRock’s focus customer engagement innovation become supplier/ partner choice customers; Enhancing operational excellence through continuous upgrade customer offerings service; Recruiting, retaining, developing motivating best people; Efficiently allocating capital.",
  "item7": "increases expenses partially offset positive impact Combination Refer “Results Operations” detailed estimates economic lives change, depreciation amortization expenses could increased decreased, acquired asset Selling, general administrative expenses Impairment other assets Transaction integration-related expenses associated Combination Pension other postretirement non-service expense, net Interest expense, net Other (expense) income, net Income before income taxes Less: Net income attributable noncontrolling interests Net income attributable common shareholders Results operations year ended , compared year ended Item 7. Management’s Discussion Analysis inancial Condition Results Operations MANAGEMENT ’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS SMURFIT WESTROCK following discussion analysis Smurfit Westrock’s financial condition results operations should read workforce size, shipping handling costs, which generally affected fuel prices overall labor inflation. While many Smurfit Westrock’s customer contracts include price adjustment clauses allow cost increases passed increase one-time settlement expenses $7 million increase net actuarial Interest Expense, Ne Interest expense, net million year ended million due higher discount rates. increase costs partially offset increase expected return assets $15 additional outside basis difference taxes not practicable.",
  "item2": "results discussed below. More information regarding these risks uncertainties other important factors could cause actual forward-looking statements involve risks uncertainties. Smurfit Westrock’s future results could differ materially RESULTS OPERATIONS following table summarizes Smurfit Westrock’s consolidated results periods presented ($ millions): Three months ended September 30, Nine months ended September 30, Selling, general administrative expenses Impairment restructuring costs Transaction integration-related expenses associated Pension other postretirement non-service income Interest expense, net Income (loss) before income taxes Net loss attributable noncontrolling interests Net income (loss) attributable common shareholders Results operations three comparable GAAP measure, periods presented ($ millions). Three months ended September 30, Nine months ended September 30, Depreciation, depletion amortization Impairment restructuring costs Transaction integration-related expenses associated Amortization fair value step up inventory Interest expense, net Pension other postretirement non-service (income) Share-based compensation expense 3."
}