{
  "source_file": "swk-20250927.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion contains statements reflecting the Company's views about its future performance that constitute “forward-looking statements” under the Private Securities Litigation Reform Act of 1995. There are a number of important factors that could cause actual results to differ materially from those indicated by such forward-looking statements. Please read the information under the caption entitled “Cautionary Statement Concerning Forward-Looking Statements.\"\nThroughout this Management's Discussion and Analysis (“MD&A”), references to Notes refer to the \"Notes To Unaudited Condensed Consolidated Financial Statements\" in Part 1, Item 1 of this Quarterly Report on Form 10-Q, unless otherwise indicated.\nBUSINESS OVERVIEW \nStrategy\nThe Company is a global provider of hand tools, power tools, outdoor products and related accessories, as well as a leading provider of engineered fastening solutions. The Company continues to execute its long-term business strategy focused on organic growth in excess of the market and industry, geographic and customer diversification to foster sustainable revenue, earnings and cash flow growth. In recent years, the Company has re-shaped its portfolio to focus on its leading positions in the tools & outdoor and engineered fastening markets. Leveraging the benefits of a more focused portfolio, the Company initiated a business transformation in mid-2022 that includes reinvestment for faster growth as well as a $2.0 billion Global Cost Reduction Program through 2025. The Company’s primary areas of multi-year strategic focus remain unchanged as follows:\n•\nAdvancing innovation, electrification and global market penetration to achieve mid-single digit organic revenue growth (2 to 3 times the market);\n•\nStreamlining and simplifying the organization, and investing in initiatives that more directly impact the Company's customers and end users;\n•\nReturning adjusted gross margins to historical 35%+ levels by accelerating the operations and supply chain transformation to improve fill rates and better match inventory with customer demand; and\n•\nPrioritizing cash flow generation and inventory optimization.\nIn terms of capital allocation, the Company remains committed, over time, to returning excess capital to shareholders through a strong and growing dividend as well as a preference toward opportunistically repurchasing shares. In the near term, the Company intends to direct any capital in excess of the quarterly dividend on its common stock toward debt reduction and internal growth investments.\nRepurchases Of Securities Other Than Common Stock\nIn April 2021, the Board of Directors approved repurchases by the Company of its outstanding securities, other than its common stock, up to an aggregate amount of $3.0 billion (the “April 2021 Authorization”). Repurchases of $1.1 billion were made under the April 2021\n \nAuthorization, and as of September 27, 2025, $1.9 billion remained available for future repurchases under the April 2021 Authorization. In October 2025, the Board of Directors terminated the April 2021 Authorization including any amounts remaining available for repurchase thereunder, and approved repurchases by the Company of its outstanding securities, other than its common stock, up to an aggregate amount of $3.0 billion. No repurchases have been executed pursuant to this authorization to date.\nDivestitures\nOn April 1, 2024, the Company sold its Infrastructure business comprised of the attachment and handheld hydraulic tools business to Epiroc AB for net proceeds of $728.5 million. The Company used the net proceeds to reduce debt in the second quarter of 2024. Refer to \nNote Q, Divestitures\n, for further discussion.\nGlobal Cost Reduction Program\nIn mid-2022, the Company launched a program comprised of a series of initiatives designed to generate cost savings by resizing the organization and reducing inventory with the ultimate objective of driving long-term growth, improving profitability and generating strong cash flow. These initiatives are expected to optimize the cost base as well as provide a platform to fund investments to accelerate growth in the core businesses. The program consists of a selling, general, and administrative (\"SG&A\") planned pre-tax run-rate cost savings of $500 million and a supply chain transformation expected to deliver $1.5 \n33\nTable of Contents\n \nbillion of pre-tax run-rate cost savings by the end of 2025 and facilitate the achievement of projected 35%+ adjusted gross margins.\nThe SG&A cost savings were generated by simplifying the corporate structure, optimizing organizational spans and layers and reducing indirect spend. These savings will help fund $300 million to $500 million of innovation and commercial investments through 2025 designed to accelerate organic growth. \nThe $1.5 billion of pre-tax run-rate cost savings from the supply chain transformation has been, and continues to be, driven by the following value streams:\n•\nMaterial Productivity: Implementing capabilities to source in a more efficient and integrated manner across all of the Company’s businesses and leveraging contract manufacturing;\n•\nOperational Excellence: Redesigning in-plant operations following footprint rationalization to deliver incremental efficiencies, simplified organizational design and inventory optimization leveraging a standard operating model and LEAN principles;\n•\nFootprint Rationalization: Transforming the Company’s manufacturing and distribution network from a decentralized and inefficient system of sites built through years of acquisitions to a strategically focused supply chain, inclusive of site closures, transformations of existing sites into manufacturing centers of excellence and re-configuration of the distribution network; and\n•\nComplexity Reduction: Reducing complexity through platforming products and implementing initiatives to drive a SKU reduction.\nDuring the first nine months of 2025 and since inception of the program, the Company has generated approximately $400 million and $1.9 billion, respectively, of pre-tax run-rate savings, driven by lower headcount, indirect spend reductions and the supply chain transformation. These savings are comprised of supply chain efficiency benefits, which support gross margin improvements as the benefits turn through inventory, and SG&A savings. The Company believes that it is on track to grow to approximately $2 billion of pre-tax run-rate savings by year-end 2025.\nThe cash investment required to achieve the estimated $1.5 billion of pre-tax run-rate supply chain cost savings is expected to be approximately $0.6 billion. Of the total estimated cash investment, approximately 30% is expected to be capital expenditures. Through 2024, the Company has made approximately $0.5 billion of total cash investments. The Company intends to continue prioritizing capital expenditures consistent with its existing approach and expects total capital expenditures, inclusive of the supply chain transformation, to approximate $0.3 billion in 2025 and 2.5% to 3.0% of net sales annually over the long term.\nThe charges associated with the ongoing execution of the supply chain transformation are reflected in the Non-GAAP adjustments detailed below in \"Results From Operations\" and the full year estimate of Non-GAAP adjustments detailed below in \"2025 Planning Assumptions.\" In addition, although the program is expected to be completed by the end of 2025, the Company expects to incur additional charges and make cash investments beyond 2025 relating to footprint actions to support the ongoing network transformation and reposition its supply chain, as necessary.\nSegments\nThe Company’s operations are classified into two reportable business segments: Tools & Outdoor and Engineered Fastening. In the first quarter of 2025, the Industrial segment was renamed “Engineered Fastening” as a result of a more focused portfolio following recent divestitures. The Engineered Fastening segment name change is to the name only and had no impact on the Company’s consolidated financial statements or segment results. Both reportable segments have significant international operations and are exposed to translational and transactional impacts from fluctuations in foreign currency exchange rates. \nTools & Outdoor\nThe Tools & Outdoor segment is comprised of the Power Tools Group (\"PTG\"), Hand Tools, Accessories & Storage (\"HTAS\"), and Outdoor Power Equipment (\"Outdoor\") product lines. Annual revenues in the Tools & Outdoor segment were $13.3 billion in 2024, representing 87% of the Company’s total revenues.\nThe PTG product line includes both professional and consumer products. Professional products, primarily under the DEWALT® brand, include professional grade corded and cordless electric power tools and equipment including drills, impact wrenches and drivers, grinders, saws, routers, sanders, and concrete prep and placement tools as well as pneumatic tools and fasteners including nail guns, nails, staplers and staples, and concrete and masonry anchors. DIY and tradesperson focused products include corded and cordless electric power tools sold primarily under the CRAFTSMAN® and STANLEY® brands, \n34\nTable of Contents\n \nand consumer home products such as household power tools, hand-held vacuums, and small appliances primarily under the BLACK+DECKER® brand. \nThe HTAS product line sells hand tools, power tool accessories and storage products primarily under the DEWALT®, CRAFTSMAN® and STANLEY® brands. Hand tools include measuring, leveling and layout tools, planes, hammers, demolition tools, clamps, vises, knives, saws, chisels, material handling, and industrial and automotive tools. Power tool accessories include drill bits, screwdriver bits, router bits, abrasives, saw blades and threading products. Storage products include tool boxes, sawhorses, cabinets and engineered storage solution products. \nThe Outdoor product line primarily sells corded and cordless electric lawn and garden products, including hedge trimmers, string trimmers, lawn mowers, pressure washers and related accessories, and gas powered lawn and garden products, including lawn tractors, zero turn ride on mowers, walk behind mowers, snow blowers, residential robotic mowers, hand-held outdoor power equipment, garden tools, and parts and accessories to professionals and consumers under the DEWALT®, CRAFTSMAN®, CUB CADET®, BLACK+DECKER®, and HUSTLER® brand names.\nEngineered Fastening\nThe Engineered Fastening segment is comprised of the Engineered Fastening business and included the Infrastructure business prior to its sale in April 2024. Annual revenues in the Engineered Fastening segment, inclusive of the Infrastructure business, were $2.1 billion in 2024, representing 13% of the Company’s total revenues. \nThe Engineered Fastening business primarily sells highly engineered components such as fasteners, fittings and various engineered products, which are designed for specific application across multiple verticals. The product lines include externally threaded fasteners, blind rivets and tools, blind inserts and tools, drawn arc weld studs and systems, engineered plastic and mechanical fasteners, self-piercing riveting systems, precision nut running systems, micro fasteners, high-strength structural fasteners, axel swage, latches, heat shields, pins, and couplings.\n35\nTable of Contents\n \nRESULTS OF OPERATIONS\nCertain Items Impacting Earnings and Non-GAAP Financial Measures\nThe Company has provided a discussion of its results both inclusive and exclusive of certain gains and charges. The results and measures, including gross profit, SG&A, Other, net, Income taxes, segment profit, and corporate overhead, on a basis excluding certain gains and charges, free cash flow, organic revenue and organic growth are Non-GAAP financial measures. These Non-GAAP financial measures are defined and reconciled to their most directly comparable GAAP financial measures below. The Company considers the use of Non-GAAP financial measures relevant to aid analysis and understanding of the Company’s results and business trends aside from the material impact of certain gains and charges and ensures appropriate comparability to operating results of prior periods. Supplemental Non-GAAP information should not be considered in isolation or as a substitute for the related GAAP financial measures. Non-GAAP financial measures presented herein may differ from similar measures used by other companies. \nThe Company provides expectations for the non-GAAP financial measures of full-year 2025 adjusted EPS, presented on a basis excluding certain gains and charges, as well as 2025 free cash flow. Forecasted full-year 2025 adjusted EPS is reconciled to forecasted full-year 2025 GAAP EPS under the section entitled \"2025 Planning Assumptions\" below. Consistent with past methodology, forecasted full-year 2025 GAAP EPS excludes the impacts of potential acquisitions and divestitures, potential future regulatory changes or strategic shifts that could impact the Company's contingent liabilities or intangible assets, respectively, potential future cost actions in response to external factors that have not yet occurred, and any other items not specifically referenced under “2025 Planning Assumptions.” A reconciliation of forecasted 2025 free cash flow to its most directly comparable GAAP estimate is not available without unreasonable effort due to high variability and difficulty in predicting items that impact cash flow from operations, which could be material to the Company’s results in accordance with U.S. GAAP. The Company believes such a reconciliation would also imply a degree of precision that is inappropriate for this forward-looking measure.\nThe Company also provides multi-year strategic goals for the non-GAAP financial measures of adjusted gross margin, presented on a basis excluding certain gains and charges, as well as organic revenue growth. A reconciliation for these non-GAAP measures is not available without unreasonable effort due to the inherent difficulty of forecasting the timing and/or amount of various items that have not yet occurred, including the high variability and low visibility with respect to certain gains or charges that would generally be excluded from non-GAAP financial measures and which could be material to the Company’s results in accordance with U.S. GAAP. Additionally, estimating such GAAP measures and providing a meaningful reconciliation consistent with the Company’s accounting policies for future periods requires a level of precision that is unavailable for these future multi-year periods and cannot be accomplished without unreasonable effort. The Company believes such a reconciliation would also imply a degree of precision that is inappropriate for these forward-looking measures. \nThe Company’s operating results at the consolidated level as discussed below include and exclude certain gains and charges impacting gross profit, SG&A, Other, net, and Income taxes. The Company’s business segment results as discussed below include and exclude certain gains and charges impacting gross profit and SG&A. Corporate overhead as discussed below includes and excludes certain gains and charges. These amounts for the third quarter and year-to-date periods of 2025 and 2024 are as follows:\nThird Quarter 2025\n(Millions of Dollars)\nGAAP\nNon-GAAP Adjustments\n2\nNon-GAAP\nGross profit\n$\n1,179.1\n \n$\n8.0\n \n$\n1,187.1\n \nSelling, general and administrative\n1\n791.0\n \n(4.1)\n786.9\n \nEarnings from continuing operations before income taxes\n35.6\n \n217.6\n \n253.2\n \nIncome taxes on continuing operations\n3\n(15.8)\n51.3\n \n35.5\n \nNet earnings from continuing operations \n51.4\n \n166.3\n \n217.7\n \nDiluted earnings per share of common stock - Continuing operations\n$\n0.34\n \n$\n1.09\n \n$\n1.43\n \n36\nTable of Contents\n \nYear-To-Date 2025\n(Millions of Dollars)\nGAAP\nNon-GAAP Adjustments\n2\nNon-GAAP\nGross profit\n$\n3,366.4\n \n$\n44.7\n \n$\n3,411.1\n \nSelling, general and administrative\n1\n2,531.1\n \n(78.7)\n2,452.4\n \nEarnings from continuing operations before income taxes\n189.9\n \n332.1\n \n522.0\n \nIncome taxes on continuing operations\n3\n(53.8)\n80.6\n \n26.8\n \nNet earnings from continuing operations \n243.7\n \n251.5\n \n495.2\n \nDiluted earnings per share of common stock - Continuing operations\n$\n1.61\n \n$\n1.65\n \n$\n3.26\n \nThird Quarter 2024\n(Millions of Dollars)\nGAAP\nNon-GAAP Adjustments\n2\nNon-GAAP\nGross profit\n$\n1,120.6 \n$\n24.8 \n$\n1,145.4 \nSelling, general and administrative\n1\n797.1 \n(15.1)\n782.0\nEarnings from continuing operations before income taxes\n89.5 \n105.9 \n195.4 \nIncome taxes on continuing operations\n3\n(1.6)\n12.0 \n10.4 \nNet earnings from continuing operations\n91.1 \n93.9 \n185.0 \nDiluted earnings per share of common stock - Continuing operations\n$\n0.60 \n$\n0.62 \n$\n1.22 \nYear-To-Date 2024\n(Millions of Dollars)\nGAAP\nNon-GAAP Adjustments\n2\nNon-GAAP\nGross profit\n$\n3,370.3 \n$\n72.7 \n$\n3,443.0 \nSelling, general and administrative\n1\n2,477.5 \n(62.8)\n2,414.7 \nEarnings from continuing operations before income taxes\n115.7 \n416.7 \n532.4 \nIncome taxes on continuing operations\n3\n24.3 \n74.4 \n98.7 \nNet earnings from continuing operations \n91.4 \n342.3 \n433.7 \nDiluted earnings per share of common stock - Continuing operations\n$\n0.60 \n$\n2.27 \n$\n2.87 \n1\n Includes provision for credit losses\n2\n Refer to table below for additional detail of the Non-GAAP adjustments\n3\n Income taxes attributable to Non-GAAP adjustments are determined by calculating income taxes on pre-tax earnings, both inclusive and exclusive of Non-GAAP adjustments, taking into consideration the nature of the Non-GAAP adjustments and the applicable statutory income tax rates.\n \n37\nTable of Contents\n \nBelow is a summary of the pre-tax Non-GAAP adjustments for the third quarter and year-to-date periods of 2025 and 2024. \nThird Quarter\nYear-to-Date\n(Millions of Dollars)\n2025\n2024\n2025\n2024\nSupply Chain Transformation Costs:\n     Footprint Rationalization\n1\n$\n4.6\n \n$\n25.4 \n$\n16.6\n \n$\n57.8 \n     Material Productivity & Operational Excellence\n3.9\n \n(1.0)\n11.9\n \n12.4 \nVoluntary retirement program\n2\n—\n \n— \n11.9\n \n— \nOther (gains) charges\n(0.5)\n0.4 \n4.3\n \n2.5 \n     Gross profit\n$\n8.0\n \n$\n24.8 \n$\n44.7\n \n$\n72.7 \nSupply Chain Transformation Costs:\n     Footprint Rationalization\n1\n$\n4.0\n \n$\n13.4 \n$\n15.1\n \n$\n34.0 \n     Complexity Reduction & Operational Excellence\n3\n4.4\n \n2.0 \n24.9\n \n6.2 \nTransition services costs related to previously divested businesses\n—\n \n4.6 \n8.4\n \n14.8 \nVoluntary retirement program\n2\n—\n \n— \n33.5\n \n(0.1)\nOther (gains) charges\n(4.3)\n(4.9)\n(3.2)\n7.9 \n     Selling, general and administrative\n$\n4.1\n \n$\n15.1 \n$\n78.7\n \n$\n62.8 \nIncome related to providing transition services to previously divested businesses\n$\n—\n \n$\n(4.6)\n$\n(10.3)\n$\n(14.8)\nVoluntary retirement program\n2\n—\n \n— \n6.2\n \n— \nEnvironmental charges\n4\n—\n \n(1.7)\n(1.1)\n152.1 \nDeal-related costs and other\n5\n4.3\n \n3.3 \n(7.6)\n4.6 \n     Other, net\n$\n4.3\n \n$\n(3.0)\n$\n(12.8)\n$\n141.9 \nLoss on sale of business\n$\n—\n \n$\n— \n$\n0.3\n \n$\n— \nAsset impairment charges\n6\n169.1\n \n46.9 \n169.1\n \n72.4 \nRestructuring charges\n7\n32.1\n \n22.1 \n52.1\n \n66.9 \n     Non-GAAP adjustments before income taxes\n$\n217.6\n \n$\n105.9 \n$\n332.1\n \n$\n416.7 \n1\nFootprint Rationalization costs primarily relate to site transformation and re-configuration costs of $26.7 million and $31.3 million in 2025 and 2024, respectively, as well as accelerated depreciation of manufacturing and distribution center equipment of $45.2 million in 2024. Facility exit costs related to site closures are reported in Restructuring charges.\n2\nIn June 2025, the Company implemented a voluntary retirement program (“VRP”) to right-size the Company’s corporate and support functions to align with a more focused portfolio following recent divestitures and more streamlined operations as part of the supply chain transformation. The costs associated with the VRP relate to separation benefits provided to eligible employees who voluntarily retired from the Company. \n3\nComplexity Reduction & Operational Excellence costs in 2025 primarily relate to third-party consulting fees to provide expertise in identifying business model changes and quantifying related cost savings opportunities within the Company’s Engineered Fastening business, developing a detailed program and related governance, and assisting the Company with the implementation of actions necessary to achieve the identified objectives.\n4\nThe $152.1 million pre-tax environmental charges in 2024 related primarily to a reserve adjustment for the non-active Centredale Superfund site as a result of regulatory changes and revisions to remediation alternatives.\n5\nIncludes an $8.1 million gain on sale of a distribution center in the second quarter of 2025 as part of the supply chain transformation.\n6\nThe asset impairment charges in 2025 were primarily driven by updates to the Company's brand prioritization strategy impacting the Lenox, Troy-Bilt, and Irwin trade names and the write down of certain minority investments pertaining to legacy corporate ventures. The asset impairment charges in 2024 were primarily related to the Lenox trade name and the Infrastructure business.\n7\nRefer to \"Restructuring Activities\" below for further discussion.\n38\nTable of Contents\n \nBelow is a summary of the Company’s operating results at the consolidated level, followed by an overview of business segment performance. Organic growth is utilized to describe the Company's results excluding the impacts of foreign currency fluctuations, acquisitions during their initial 12 months of ownership, divestitures, and transfers of product lines between segments.\nConsolidated Results\nNet Sales:\n \nNet sales were $3.756 billion in the third quarter of 2025 in line with prior year sales of $3.751 billion in the third quarter of 2024, as a 5% increase in price and a 1% increase from foreign currency were offset by a 6% decrease in volume. Tools & Outdoor net sales were in line with the third quarter of 2024 as a 5% increase in price, a 1% increase from foreign currency, and a 1% increase from a product line transfer from Engineered Fastening were offset by a 7% decrease in volume. Engineered Fastening net sales increased 3% compared to the third quarter of 2024 as a 4% increase in volume, a 1% increase in price, and a 1% increase from foreign currency were partially offset by a 3% decrease from a product line transfer to Tools & Outdoor.\nNet sales were $11.446 billion in the first nine months of 2025 compared to $11.645 billion in the first nine months of 2024, representing a decrease of 2% as a 2% increase in price was more than offset by a 3% decrease in volume and a 1% decrease from the Infrastructure divestiture. Tools & Outdoor net sales decreased 1% compared to the first nine months of 2024 as a 2% increase in price was more than offset by a 3% decrease in volume. Engineered Fastening net sales decreased 8% compared to the first nine months of 2024 as a 1% increase in price was more than offset by a 6% decrease from the Infrastructure divestiture and a 3% decrease from a product line transfer to Tools & Outdoor.\nCost of Sales and Gross Profit: \nThe Company reported cost of sales of $2.577 billion in the third quarter of 2025 compared to $2.631 billion in the third quarter of 2024. The year-over-year change in cost of sales was primarily driven by lower volume and the supply chain transformation efficiencies, partially offset by the impact from tariffs and inflation. Gross profit, defined as sales less cost of sales, was $1.179 billion, or 31.4% of net sales, in the third quarter of 2025 compared to $1.121 billion, or 29.9% of net sales, in the third quarter of 2024. Non-GAAP adjustments, which increased cost of sales and reduced gross profit, were $8.0 million, or 0.2% of net sales, for the three months ended September 27, 2025 and $24.8 million, or 0.6% of net sales, for the three months ended September 28, 2024. Excluding these adjustments, gross profit was 31.6% of net sales, for the three months ended September 27, 2025, compared to 30.5% of net sales, for the three months ended September 28, 2024. The year-over-year change in gross profit as a percent of sales and adjusted gross profit as a percent of sales was primarily due to benefits from pricing strategies and supply chain transformation efficiencies, partially offset by tariffs, lower volume and inflation.\nThe Company reported cost of sales of $8.079 billion in the first nine months of 2025 compared to $8.275 billion in the first nine months of 2024. The year-over-year change in cost of sales was primarily driven by the same factors discussed above that impacted the third quarter of 2025. Gross profit, defined as sales less cost of sales, was $3.366 billion, or 29.4% of net sales, in the first nine months of 2025 compared to $3.370 billion, or 28.9% of net sales, in the first nine months of 2024. Non-GAAP adjustments, which increased cost of sales and reduced gross profit, were $44.7 million, or 0.4% of net sales, for the nine months ended September 27, 2025 and $72.7 million, or 0.7% of net sales, for the nine months ended September 28, 2024. Excluding these adjustments, gross profit was 29.8% of net sales, for the nine months ended September 27, 2025, compared to 29.6% of net sales, for the nine months ended September 28, 2024. The year-over-year change in gross profit as a percent of sales and adjusted gross profit as a percent of sales was primarily driven by the same factors discussed above that impacted the third quarter of 2025.\nSelling, general and administrative: \nSG&A, inclusive of the provision for credit losses, was $791.0 million, or 21.1% of net sales, in the third quarter of 2025, compared to $797.1 million, or 21.2% of net sales, in the third quarter of 2024. Within SG&A, Non-GAAP adjustments totaled $4.1 million, or 0.1% of net sales, for the three months ended September 27, 2025 and $15.1 million, or 0.4% of net sales, for the three months ended September 28, 2024. Excluding these adjustments, SG&A was 21.0% of net sales for the three months ended September 27, 2025, compared to 20.8% for the three months ended September 28, 2024. SG&A as a percent of sales and adjusted SG&A as a percent of sales are relatively flat year-over-year, as the Company continues to fund growth investments while exercising disciplined and targeted cost management.  \nSG&A, inclusive of the provision for credit losses, was $2.531 billion, or 22.1% of net sales, in the first nine months of 2025, compared to $2.478 billion, or 21.3% of net sales, in the first nine months of 2024. Within SG&A, Non-GAAP adjustments totaled $78.7 million, or 0.7% of net sales, for the nine months ended September 27, 2025 and $62.8 million, or 0.6% of net sales, for the nine months ended September 28, 2024. Excluding these adjustments, SG&A was 21.4% of net sales for the nine months ended September 27, 2025, compared to 20.7% for the nine months ended September 28, 2024. The year-over-year change in SG&A as a percent of sales and adjusted SG&A as a percent of sales was driven by growth investments, which were partially offset by targeted cost management.\n39\nTable of Contents\n \nDistribution center costs (i.e. warehousing and fulfillment facility and associated labor costs) are classified within SG&A. This classification may differ from other companies who may report such expenses within cost of sales. Due to diversity in practice, to the extent the classification of these distribution costs differs from other companies, the Company’s gross margins may not be comparable. Such distribution costs classified in SG&A amounted to $130.3 million and $390.4 million for the three and nine months ended September 27, 2025, respectively, and $134.4 million and $396.7 million for the three and nine months ended September 28, 2024, respectively.\nOther, net:\n Other, net totaled $72.2 million in the third quarter of 2025 compared to $86.4 million in the third quarter of 2024. Excluding Non-GAAP adjustments, Other, net totaled $67.9 million and $89.4 million in the third quarter of 2025 and 2024, respectively. The year-over-year decrease in Other, net, both inclusive and exclusive of Non-GAAP adjustments, is primarily driven by lower environmental remediation costs and lower intangible asset amortization.\nOther, net totaled $187.4 million in the first nine months of 2025 and $392.9 million in the first nine months of 2024. The year-over-year decrease is primarily driven by a $142.3 million environmental remediation reserve adjustment related to the Centredale site and write-downs on certain investments in 2024, as well as lower intangible asset amortization in 2025. Excluding Non-GAAP adjustments, Other, net totaled $200.2 million and $251.0 million for the first nine months of 2025 and 2024, respectively.  The year-over-year decrease in Other, net, excluding Non-GAAP adjustments, is primarily driven by lower environmental remediation costs and intangible asset amortization in 2025, and write-downs on certain investments in 2024.\nLoss on Sale of Business\n: During the first nine months of 2025, the Company reported a pre-tax loss of $0.3 million related to the divestiture of a small business in the Engineered Fastening segment. \nAsset Impairment Charges\n: During the third quarter of 2025, in conjunction with its annual long-term strategic planning, the Company recorded pre-tax, non-cash asset impairment charges of $169.1 million primarily driven by updates to the Company’s brand prioritization strategy impacting the Lenox, Troy-Bilt, and Irwin trade names, as well as its ongoing portfolio assessment and the strategic decision to exit most of its minority investments that are mainly associated with legacy corporate ventures.  \nDuring the third quarter of 2024, the Company recorded pre-tax, non-cash asset impairment charges of $46.9 million primarily related to the Lenox trade name. During the first quarter of 2024, the Company recorded a pre-tax impairment charge of $25.5 million related to the Infrastructure business.\nRefer to \nNote K, Fair Value Measurements\n, for additional information on the third quarter 2025 impairment charges related to the trade names and minority investments. Refer to \nNote Q, Divestitures\n, for additional information on the divestiture of the Infrastructure business completed in the second quarter of 2024.\nInterest, net:\n Net interest expense was $79.1 million in the third quarter of 2025 compared to $78.6 million in the third quarter of 2024. On a year-to-date basis, net interest expense was $236.5 million in 2025 and $244.9 million in 2024, primarily driven by higher interest income.\nIncome Taxes: \nFor the three and nine months ended September 27, 2025, the Company recognized an income tax benefit of $15.8 million and $53.8 million, respectively, resulting in effective tax rates of (44.4)% and (28.3)%, respectively. Excluding the tax effect on Non-GAAP adjustments, for the three and nine months ended September 27, 2025, the Company recognized income tax expense of $35.5 million and $26.8 million, respectively, resulting in effective tax rates of 14.0% and 5.1%, respectively. These effective tax rates for the three and nine months ended September 27, 2025 differ from the U.S. statutory tax rate of 21% primarily due to the remeasurement of uncertain tax positions, partially offset by non-deductible expenses. \nFor the three and nine months ended September 28, 2024, the Company recognized an income tax benefit of $1.6 million and income tax expense of $24.3 million, respectively, resulting in effective tax rates of (1.8)% and 21.0%, respectively. Excluding the tax effect on Non-GAAP adjustments, for the three and nine months ended September 28, 2024, the Company recognized income tax expense of $10.4 million and $98.7 million, respectively, resulting in effective tax rates of 5.3% and 18.5%, respectively. These effective tax rates for the three months ended September 28, 2024 differ from the U.S. statutory tax rate of 21% primarily due to the recognition of previously unrecognized foreign deferred tax assets, remeasurement of uncertain tax positions, tax credits, and state income taxes, partially offset by non-deductible expenses and U.S. tax on foreign earnings. For the nine months ended September 28, 2024, the primary drivers are consistent with those discussed above, which in aggregate result in effective tax rates that approximate the U.S. statutory tax rate of 21%.\nRefer to \nNote M, Income Taxes\n, for additional information on the impacts in interim periods of changes in the estimated annual effective income tax rate.\n40\nTable of Contents\n \nOn December 20, 2021, the Organization for Economic Cooperation and Development published a proposal for the establishment of a global minimum tax rate of 15% (“Pillar Two\"). The Pillar Two rules provide a template that jurisdictions can translate into domestic law, to assist with the implementation within an agreed upon timeframe and in a coordinated manner. Certain countries in which the Company operates have enacted legislation effective January 1, 2024, while other jurisdictions are in various stages of implementation.\nThe Company has performed an assessment of the potential impact to its income taxes as a result of Pillar Two. The assessment of the potential impact is based on the most recent tax filings, country-by-country reporting, and financial statements of affected subsidiaries. Based on results of the assessment, the Company believes it can avail itself of the transitional safe harbor rules in most jurisdictions in which the Company operates. There are, however, a limited number of jurisdictions where the transitional safe harbor relief does not apply. The Company expects the Pillar Two tax impact from these jurisdictions to be immaterial to its estimated annual tax rate for 2025. The Company continues to assess the potential impact of Pillar Two and monitor developments in legislation, regulation, and interpretive guidance in this area.   \nOn July 4, 2025, the U.S. government enacted the One Big Beautiful Bill Act (“OBBBA”), which includes a broad range of tax reform provisions affecting businesses, including extending and modifying certain Tax Cuts & Jobs Act provisions and accelerating the phase-out of certain Inflation Reduction Act incentives. The OBBBA includes provisions modifying net interest deduction limitations, expensing of U.S.-based research and development expenses, and tax depreciation methods, as well as international tax provisions modifying global intangible low-taxed income (GILTI), foreign-derived intangible income (FDII), base erosion and anti-abuse tax (BEAT), and foreign tax credits. The Company evaluated the impacts of the OBBBA and does not expect it to have a material impact on the Company’s current year consolidated financial statements. The Company will continue to assess the potential impact of the OBBBA and monitor developments in legislation, regulation, and interpretive guidance in this area. \nBusiness Segment Results\nThe Company’s reportable segments represent businesses that have similar products, services and end markets, among other factors. The Company utilizes segment profit which is defined as net sales minus cost of sales and SG&A inclusive of the provision for credit losses (aside from corporate overhead expense), and segment profit as a percentage of net sales to assess the profitability of each segment. \nThe Company’s operations are classified into two reportable business segments: Tools & Outdoor and Engineered Fastening. \nTools & Outdoor:\n \nThird Quarter\nYear-to-Date\n(Millions of Dollars)\n2025\n2024\n2025\n2024\nNet sales\n$\n3,255.5\n \n$\n3,263.3 \n$\n9,997.8\n \n$\n10,076.6 \nSegment profit\n$\n383.2\n \n$\n327.5 \n$\n910.5\n \n$\n899.3 \n% of Net sales\n11.8\n \n%\n10.0 \n%\n9.1\n \n%\n8.9 \n%\nTools & Outdoor net sales decreased $7.8 million in the third quarter of 2025 compared to the third quarter of 2024 as a 5% increase in price, a 1% increase from foreign currency, and a 1% increase from a product line transfer from Engineered Fastening were offset by a 7% decrease in volume. Organic revenue decreased 2%, driven by expected tariff related promotional reductions and a soft consumer backdrop, partially offset by continued DEWALT® growth. Total revenue decreased 2% in North America, increased 6% in Europe, and decreased 1% in the rest of the world. Excluding the impact from foreign currency, organic revenue decreased 2% in North America, remained flat in Europe, and decreased 1% in the rest of the world.\nTools & Outdoor net sales decreased $78.8 million, or 1%, in the first nine months of 2025 compared to the first nine months of 2024 as a 2% increase in price was more than offset by a 3% decrease in volume. Total revenue decreased 1% in North America, increased 3% in Europe, and decreased 4% in the rest of the world. Excluding the impact from foreign currency, organic revenue decreased 1% in all regions.\nSegment profit for the third quarter of 2025 was $383.2 million, or 11.8% of net sales, compared to $327.5 million, or 10.0% of net sales, in the third quarter of 2024. Excluding Non-GAAP adjustments, which primarily related to footprint actions associated with the supply chain transformation in both periods, of $6.8 million, or 0.2% of net sales, and $35.5 million, or 1.1% of net sales, for the three months ended September 27, 2025 and September 28, 2024, respectively, segment profit was 12.0% of net sales in the third quarter of 2025 and 11.1% of net sales in the third quarter of 2024. The year-over-year change in \n41\nTable of Contents\n \nsegment profit as a percent of sales and adjusted segment profit as a percent of sales was primarily due to price and supply chain transformation efficiencies, partially offset by tariffs, lower volume and inflation.\nSegment profit for the first nine months of 2025 was $910.5 million, or 9.1% of net sales, compared to $899.3 million, or 8.9% of net sales, in the first nine months of 2024. Excluding Non-GAAP adjustments, which primarily related to a voluntary retirement program in 2025 and footprint actions associated with the supply chain transformation in both periods, of $70.2 million, or 0.7% of net sales, and $111.0 million, or 1.1% of net sales, for the nine months ended September 27, 2025 and September 28, 2024, respectively, segment profit was 9.8% of net sales in the first nine months of 2025 and 10.0% of net sales in the first nine months of 2024. The year-over-year change in segment profit as a percent of sales and adjusted segment profit was relatively flat as the impact of supply chain transformation efficiencies, price and cost control were offset by the impact from tariffs, lower volume, and investments in growth initiatives. \nEngineered Fastening:\n \nThird Quarter\nYear-to-Date\n(Millions of Dollars)\n2025\n2024\n2025\n2024\nNet sales\n$\n500.5\n \n$\n488.0 \n$\n1,448.0\n \n$\n1,568.6 \nSegment profit\n$\n59.8\n \n$\n70.2 \n$\n133.8\n \n$\n202.2 \n% of Net sales\n11.9\n \n%\n14.4 \n%\n9.2\n \n%\n12.9 \n%\nEngineered Fastening net sales increased $12.5 million, or 3%, in the third quarter of 2025 compared to the third quarter of 2024, as a 4% increase in volume, a 1% increase in price, and a 1% increase from foreign currency were partially offset by a 3% decrease from a product line transfer to Tools & Outdoor. Engineered Fastening organic revenues increased 5%, supported by the stronger than anticipated automotive market and continued strength in aerospace, partially offset by lower industrial volume. \nEngineered Fastening net sales decreased $120.6 million, or 8%, in the first nine months of 2025 compared to the first nine months of 2024, as a 1% increase in price was more than offset by a 6% decrease from the Infrastructure divestiture and a 3% decrease from a product line transfer to Tools & Outdoor. Engineered Fastening organic revenues increased 1%, driven by strength in aerospace, partially offset by declines in industrial and automotive.\nEngineered Fastening segment profit for the third quarter of 2025 totaled $59.8 million, or 11.9% of net sales, compared to $70.2 million, or 14.4% of net sales, in the corresponding 2024 period. Excluding a Non-GAAP charge of $4.1 million, or 0.9% of net sales, for the three months ended September 27, 2025 and a Non-GAAP gain of $2.6 million, or 0.5% of net sales, for the three months ended September 28, 2024, which primarily related to the supply chain transformation in both periods, segment profit amounted to 12.8% of net sales in the third quarter of 2025 compared to 13.9% of net sales in the third quarter of 2024. The year-over-year change in segment profit as a percent of sales and adjusted segment profit as a percent of sales was primarily due to elevated production costs in relation to a tough prior year comparable.\nEngineered Fastening segment profit for the first nine months of 2025 totaled $133.8 million, or 9.2% of net sales, compared to $202.2 million, or 12.9% of net sales, in the corresponding 2024 period. Excluding Non-GAAP adjustments of $29.1 million, or 2.1% of net sales, for the nine months ended September 27, 2025, which related to a voluntary retirement program and costs associated with the supply chain transformation, and $3.4 million, or 0.2% of net sales, for the nine months ended September 28, 2024, segment profit amounted to 11.3% of net sales in the first nine months of 2025 compared to 13.1% of net sales in the first nine months of 2024. The year-over-year change in segment profit as a percent of sales and adjusted segment profit as a percent of sales were primarily due to lower volume in the higher-margin automotive business. \nCorporate overhead:\nThe corporate overhead element of SG&A, which is not allocated to the business segments for purposes of determining segment profit, consists of the costs associated with the executive management team and expenses related to centralized functions that benefit the entire Company but are not directly attributable to the business segments, such as legal and corporate finance functions, as well as expenses for the world headquarters facility. \n42\nTable of Contents\n \nCorporate overhead amounted to $54.9 million and $74.2 million in the third quarter of 2025 and 2024, respectively. Excluding Non-GAAP adjustments of $1.2 million for the three months ended September 27, 2025 and $7.0 million for the three months ended September 28, 2024, which primarily consisted of transition services costs related to previously divested businesses, the corporate overhead element of SG&A was $53.7 million and $67.2 million for the three months ended September 27, 2025 and September 28, 2024, respectively.\nOn a year-to-date basis, corporate overhead amounted to $209.0 million and $208.7 million in the first nine months of 2025 and 2024, respectively. Excluding Non-GAAP adjustments, which primarily consisted of a voluntary retirement program in 2025 and transition services costs related to previously divested businesses in both periods, of $24.1 million for the nine months ended September 27, 2025 and $21.1 million for the nine months ended September 28, 2024, the corporate overhead element of SG&A was $184.9 million and $187.6 million for the nine months ended September 27, 2025 and September 28, 2024, respectively.\n \nRESTRUCTURING ACTIVITIES \nA summary of the restructuring reserve activity from December 28, 2024 to September 27, 2025 is as follows:\n \n(Millions of Dollars)\nDecember 28,\n2024\nNet Additions\nUsage\nCurrency\nSeptember 27,\n2025\nSeverance and related costs\n$\n25.3 \n$\n50.9 \n$\n(44.2)\n$\n(1.1)\n$\n30.9\n \nFacility closures and other\n20.1 \n1.2 \n(16.2)\n— \n5.1\n \nTotal\n$\n45.4 \n$\n52.1 \n$\n(60.4)\n$\n(1.1)\n$\n36.0\n \nFor the three and nine months ended September 27, 2025, the Company recognized net restructuring charges of $32.1 million and $52.1 million, respectively, primarily driven by severance costs and related pension charges associated with reorganizations of the Company’s corporate and support functions and supply chain resources, as well as facility exit costs related to footprint actions associated with the supply chain transformation. The Company expects to achieve annual net cost savings of approximately $90 million by the end of 2026 related to the restructuring costs incurred during the nine months ended September 27, 2025. The majority of the $36.0 million of reserves remaining as of September 27, 2025 is expected to be utilized within the next 12 months.\nSegments:\n \nThe $52.1 million of net restructuring charges for the nine months ended September 27, 2025 includes: $38.8 million in the Tools & Outdoor segment; $1.9 million in the Engineered Fastening segment; and $11.4 million in Corporate.\nThe $32.1 million of net restructuring charges for the three months ended September 27, 2025 includes: $29.5 million in the Tools & Outdoor segment; $0.3 million in the Engineered Fastening segment; and $2.3 million in Corporate.\nThe anticipated annual net cost savings of approximately $90 million related to the 2025 restructuring actions include: $58 million in the Tools & Outdoor segment; $4 million in the Engineered Fastening segment; and $28 million in Corporate.\nTARIFF POLICY IMPLICATIONS\nIn response to the United States’ recent policy actions and to safeguard gross margins, the Company is continuing to execute its plan with the objective to position the business for success with a focus on achieving its long-term financial objectives.  \nThe Company's guiding principles:\n•\nServe its end users and customers during a dynamic period;\n•\nMinimize cost increases through supply chain moves with a focus on leveraging the Company’s North American footprint and reducing China production for the United States by 2026 or early 2027;  \n•\nImplement price increases with a long-term perspective and to protect cash flow; and  \n•\nContinue to proactively engage with the U.S. administration. \nRefer to \"2025 Planning Assumptions\" below for more information.\n43\nTable of Contents\n \n2025 PLANNING ASSUMPTIONS\nThis discussion of certain planning assumptions is intended to provide broad insight into the Company's near-term earnings and cash flow generation prospects. The Company's planning assumptions for 2025 are for diluted earnings per share on a GAAP basis to be $2.55 to $2.70 (from $3.45 (+/-$0.10)) incorporating the third quarter pre-tax non-cash asset impairment charges of $169 million. The Company expects diluted earnings per share excluding Non-GAAP adjustments to be approximately $4.55, revised from approximately $4.65, reflecting higher production costs that the Company expects to adjust back to targeted levels during the fourth quarter. The Company is targeting free cash flow to approximate $600 million, unchanged from the second quarter of 2025.\nThe difference between the planning assumptions for 2025 diluted earnings per share on a GAAP basis and diluted earnings per share excluding Non-GAAP adjustments is approximately $1.85 to $2.00, consisting primarily of charges related to the supply chain transformation under the Global Cost Reduction Program, non-cash asset impairment charges and other cost actions.\nFINANCIAL CONDITION\nLiquidity, Sources and Uses of Capital:\n The Company’s primary sources of liquidity are cash flows generated from operations and available lines of credit under various credit facilities. \nOperating Activities: \nCash flows provided by operations were $221.2 million in the third quarter of 2025 compared to $285.8 million in the corresponding period of 2024, primarily driven by lower earnings. Year-to-date cash flows provided by operations were $15.5 million in 2025 compared to $427.8 million in the corresponding period of 2024, as higher earnings were more than offset by changes in working capital.\nFree Cash Flow: \nFree cash flow, as defined in the table below, was an inflow of $155.3 million and $199.3 million in the third quarter of 2025 and 2024, respectively. On a year-to-date basis, free cash flow was an outflow of $195.0 million in 2025 and an inflow of $188.4 million in 2024. The year-over-year change in free cash flow was due to the same factors discussed above in operating activities, as well as lower planned capital expenditures in 2025. Management considers free cash flow an important indicator of its liquidity and capital efficiency, as well as its ability to fund future growth and provide dividends to shareowners, and is useful information for investors. Free cash flow does not include deductions for mandatory debt service, other borrowing activity, discretionary dividends on the Company’s common stock and business acquisitions, among other items. \n \nThird Quarter\nYear-to-Date\n(Millions of Dollars)\n2025\n2024\n2025\n2024\nNet cash provided by operating activities\n$\n221.2\n \n$\n285.8 \n$\n15.5\n \n$\n427.8 \nLess: capital and software expenditures\n(65.9)\n(86.5)\n(210.5)\n(239.4)\nFree cash flow \n$\n155.3\n \n$\n199.3 \n$\n(195.0)\n$\n188.4 \nInvesting Activities: \nCash flows used in investing activities totaled $65.1 million and $85.4 million in the third quarter of 2025 and 2024, respectively, primarily due to capital and software expenditures of $65.9 million and $86.5 million in 2025 and 2024, respectively.\nCash flows used in investing activities totaled $190.0 million in the first nine months of 2025, primarily due to capital and software expenditures of $210.5 million. Cash flows provided by investing activities totaled $500.8 million in the first nine months of 2024, primarily due to net proceeds from sales of businesses of $735.6 million, partially offset by capital and software expenditures of $239.4 million. \nFinancing Activities: \nCash flows used in financing activities totaled $188.1 million in the third quarter of 2025, primarily driven by payments on long term-debt of $350.1 million and cash dividend payments on common stock of $125.8 million, partially offset by short-term commercial paper borrowings of $287.9 million. Cash flows used in financing activities totaled $234.3 million in the third quarter of 2024, primarily driven by cash dividend payments on common stock of $123.6 million and net short-term commercial paper repayments of $121.5 million\nCash flows provided by financing activities totaled $90.9 million in the first nine months of 2025, primarily driven by net short-term commercial paper borrowings of $1.326 billion, partially offset by payments on long-term debt of $850.4 million and cash dividend payments on common stock of $374.3 million. Cash flows used in financing activities totaled $1.054 billion in the first nine months of 2024, primarily driven by net short-term commercial paper repayments of $692.3 million and cash dividend payments on common stock of $367.2 million.\n44\nTable of Contents\n \nCredit Ratings & Liquidity: \nThe Company maintains investment grade credit ratings from the major U.S. rating agencies on its senior unsecured debt (S&P BBB+, Fitch BBB+, Moody's Baa3), as well as its commercial paper program (S&P A-2, Fitch F2, Moody's P-3). In the third quarter of 2025, S&P downgraded the Company’s senior unsecured debt credit rating from A- to BBB+. Failure to maintain investment grade rating levels could adversely affect the Company’s cost of funds, liquidity and access to capital markets, but would not have an adverse effect on the Company’s ability to access its existing committed credit facilities. \nCash and cash equivalents totaled $268.3 million and $290.5 million as of September 27, 2025 and December 28, 2024, respectively, which was primarily held in foreign jurisdictions.\nAs a result of the Tax Cuts and Jobs Act (the \"Act\"), the Company's tax liability related to the one-time transition tax associated with unremitted foreign earnings and profits totaled $2 million at September 27, 2025. The Act permits a U.S. company to elect to pay the net tax liability interest-free over a period of up to eight years. \nIn August 2025, the Company redeemed its $350 million 6.272% notes at par prior to maturity. The redemption was funded through the issuance of commercial paper at a lower prevailing interest rate. The Company recognized a pre-tax loss of $0.3 million from the redemption related to the write-off of unamortized deferred financing fees. \nThe Company has a $3.5 billion commercial paper program which includes Euro denominated borrowings in addition to U.S. Dollars. As of September 27, 2025, the Company had commercial paper borrowings outstanding of $1.4 billion, of which $552.4 million in Euro denominated commercial paper was designated as a net investment hedge. As of December 28, 2024, the Company had no commercial paper borrowings outstanding. Refer to \nNote H, Financial Instruments\n, for further discussion.  \nIn June 2024, the Company amended and restated its existing five-year $2.5 billion committed credit facility with the concurrent execution of a new five year $2.25 billion committed credit facility (the “5-Year Credit Agreement”). Borrowings under the 5-Year Credit Agreement may be made in U.S. Dollars, Euros or Pounds Sterling. A sub-limit of an amount equal to the Euro equivalent of $800.0 million is designated for swing line advances. Borrowings bear interest at a floating rate plus an applicable margin dependent upon the denomination of the borrowing and specific terms of the 5-Year Credit Agreement. The Company must repay all advances under the 5-Year Credit Agreement by the earlier of June 28, 2029 or upon termination. The 5-Year Credit Agreement is designated to be a liquidity back-stop for the Company's $3.5 billion U.S. Dollar and Euro commercial paper program. In June 2025, the 5-Year Credit Agreement was amended to include the covenants listed below. As of September 27, 2025 and December 28, 2024, the Company had not drawn on its five-year committed credit facility. \nIn June 2025, the Company terminated its 364-Day $1.25 billion committed credit facility (\"the 2024 Syndicated 364-Day Credit Agreement\") dated June 2024. There were no outstanding borrowings under the 2024 Syndicated 364-Day Credit Agreement upon termination and as of December 28, 2024. Contemporaneously, the Company entered into a new $1.25 billion syndicated 364-Day Credit Agreement (the \"2025 Syndicated 364-Day Credit Agreement\") which is a revolving credit loan. The borrowings under the 2025 Syndicated 364-Day Credit Agreement may be made in U.S. Dollars or Euros and bear interest at a floating rate plus an applicable margin dependent upon the denomination of the borrowing and pursuant to the terms of the 2025 Syndicated 364-Day Credit Agreement. The Company must repay all advances under the 2025 Syndicated 364-Day Credit Agreement by the earlier of June 22, 2026 or upon termination. The Company may, however, convert all advances outstanding upon termination into a term loan that shall be repaid in full no later than the first anniversary of the termination date provided that the Company, among other things, pays a fee to the administrative agent for the account of each lender. The 2025 Syndicated 364-Day Credit Agreement serves as part of the liquidity back-stop for the Company’s $3.5 billion U.S. Dollar and Euro commercial paper program. As of September 27, 2025, the Company had not drawn on its 2025 Syndicated 364-Day Credit Agreement\n.\nThe 5-Year Credit Agreement and the 2025 Syndicated 364-Day Credit Agreement, as described above, contain customary affirmative and negative covenants, including but not limited to, maintenance of an interest coverage ratio. The interest coverage ratio tested for covenant compliance compares adjusted Earnings Before Interest, Taxes, Depreciation and Amortization to adjusted net Interest Expense (\"Adjusted EBITDA\"/\"Adjusted Net Interest Expense\"). The Company must maintain, for each period of four consecutive fiscal quarters of the Company, an interest coverage ratio of not less than 3.50 to 1.00, provided that the Company is only required to maintain an interest coverage ratio of not less than 2.50 to 1.00 for any four fiscal quarter period ending on or before the end of the Company’s second fiscal quarter of 2026. For purposes of calculating the Company’s compliance with the interest coverage ratio, the Company is permitted to increase EBITDA by an amount equal to the Applicable Adjustment Addbacks (as defined in the 2025 Syndicated 364-Day Credit Agreement), provided that the sum \n45\nTable of Contents\n \nof the Applicable Adjustment Addbacks incurred in any four consecutive fiscal quarter periods ending on or before the end of the Company’s second fiscal quarter of 2026 shall not exceed $250,000,000 in the aggregate.\nIn March 2015, the Company entered into a forward share purchase contract with a financial institution counterparty for 3,645,510 shares of common stock. The contract obligates the Company to pay $350 million, plus an additional amount related to the forward component of the contract. In September 2025, the Company amended the forward share purchase contract and updated the final settlement date to June 2028, or earlier at the Company's option.\nRefer to \nNote G, Long-Term Debt and Financing Arrangements\n, for further discussion of the Company's financing arrangements.\n46\nTable of Contents\n \nOTHER MATTERS\nCritical Accounting Estimates\nDuring the third quarter of 2025, in conjunction with its annual long-term strategic planning, the Company updated its brand prioritization strategy to transition targeted product categories to its major brands, while leveraging certain of its specialty brands on more focused product categories and regions where those brands hold more meaningful market positions and value to end users. As a result of these strategic decisions, and in connection with the preparation of its financial statements for the quarter ended September 27, 2025, the Company tested its indefinite-lived trade names for impairment utilizing a discounted cash flow valuation model. The key assumptions used included discount rates, royalty rates, and perpetual growth rates applied to updated sales projections. The Company determined that the fair values of its indefinite-lived trade names exceeded their respective carrying amounts, with the exception of the Lenox, Troy-Bilt, and Irwin trade names. The Company recognized a pre-tax, non-cash impairment charge of $108.4 million related to these trade names in the third quarter of 2025. Subsequent to this impairment charge, the carrying value for the Lenox, Troy-Bilt, and Irwin trade names totaled $119.6 million. These trade names, which the Company intends to continue utilizing indefinitely in a more focused manner as described above, represented approximately 6% of 2024 net sales for the Tools & Outdoor segment. \nRefer to \nNote K, Fair Value Measurements\n, for further discussion.\nThere have been no other changes in the Company’s critical accounting estimates during the third quarter of 2025. Refer to the \n“Other Matters”\n section of \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n in the Company’s Annual Report on Form 10-K for the year ended December 28, 2024 for a discussion of the Company’s critical accounting estimates."
}