{
  "source_file": "swks-20251003.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS.\nSkyworks Solutions, Inc., together with its consolidated subsidiaries (“Skyworks” or the “Company”), is a leading developer, manufacturer and provider of analog and mixed-signal semiconductor products and solutions for numerous applications, including aerospace, automotive, broadband, cellular infrastructure, connected home, defense, entertainment and gaming, industrial, medical, smartphone, tablet, and wearables. \nOver the past two decades, Skyworks has made important investments to address key network technologies, from cellular to advanced Wi-Fi\n®\n, enhanced GPS, and Bluetooth\n®\n, among others. Capitalizing on both organic growth and strategic acquisitions, we are targeting high-growth verticals, while at the same time, seeking to diversify our revenue and customer set. \nTargeted investments in next-generation technology and solutions, technical talent, and fabrication capabilities have created the opportunity to expand into high-growth market segments, including electric and hybrid vehicles, industrial and motor control, power supply, 5G wireless infrastructure, optical data communication, data center, automotive, smart home, and several other applications.\nOur key customers include Amazon, Apple Inc. (“Apple”), Arcadyan, Arris, Bose, Ciena, Cisco, Ericsson, Fibocom, Garmin, Gemalto (a Thales company), General Electric, Google, Honeywell, Itron, Lenovo, LG Electronics, Microsoft, Motorola, NETGEAR, Nokia, Northrop Grumman, OPPO, Rockwell Collins, Sagemcom, Samsung, Schneider Electric, Sierra Wireless, Sonos, Sony, Technicolor, Telit, Tesla, TP-Link, VIVO, and Xiaomi. Our competitors include Analog Devices, Broadcom, Cirrus Logic, Murata Manufacturing, NXP Semiconductors, Qorvo, Qualcomm, and Texas Instruments.\nWe operate worldwide with engineering, manufacturing, sales, and service facilities throughout Asia, Europe, and North America. Our Internet address is www.skyworksinc.com. We make available free of charge on our website our Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. The information contained on our website is not incorporated by reference in this Annual Report on Form 10-K and the inclusion of our website address in this report is an inactive textual reference only. Our SEC filings are also available to the public at www.sec.gov.\nIndustry Background\nWireless connectivity is expanding on a global basis. A widening range of use cases is driving the high demand for wireless data across a broad array of applications. The advancement of 5G adoption, IoT, connectivity for everyone, automotive electrification and safety, as well as augmented reality and virtual reality technology, all demand faster speeds, increased bandwidth and capacity, significantly lower latency, and more reliable and secure wireless connectivity. \nThe speed and ultra-low latency characteristics inherent in 5G technology are dramatically altering wireless connectivity, creating a market for diverse and transformative applications, and changing how individuals live, work, play, and learn. Most of the world’s largest economies have implemented commercial 5G networks, and the world’s leading smartphone manufacturers have launched multiple generations of 5G-enabled devices.\nWe expect to see a continued expansion in data consumption, dependent on seamless and reliable wireless connectivity. A few statistics illustrate this point. According to the 2025 Ericsson Mobility Report, global mobile data for 5G subscriptions are forecast to reach 6.3 billion by the end of 2030, driven by new users, innovative services, and the convergence of artificial intelligence (“AI”) and 5G technology, and the total number of global IoT connections is now forecast to reach approximately 43 billion by 2030, including connected cars, machines, meters, sensors, point-of-sale terminals, consumer electronics and wearables. Connected cars are forecasted by McKinsey to make up 90% of new vehicles sold globally by 2030. \nSkyworks helps facilitate these opportunities with highly customized solutions that support a broad set of wireless systems and protocols including cellular (such as 5G), Wi-Fi\n®\n, GPS, Bluetooth\n®\n, Accutime™, HD-Radio™, LoRa\n®\n, Thread\n®\n, Wi-Sun\n®\n, and Zigbee\n®\n. Additionally, Wi-Fi\n®\n 8, the next generation of Wi-Fi\n®\n technology, complements 5G by providing high-speed wireless connectivity in local environments. Faster data rates and improved efficiency cater to the growing number of devices reliant on wireless networks.\nWe believe AI can be a catalyst for more efficient and effective wireless communications. From endpoint devices to data centers, generative AI applications will drive the need for higher speed and higher bandwidth networks, while increasing the requirements for our precision timing solutions.\n6\nTable of Contents\nThe first wave of AI-capable phones is reaching scale, and early demand signals are encouraging. As AI capabilities become more intuitive and integrated, we believe this could drive an inflection in upgrade cycles, leading to a potential tailwind to volumes and content over time.\nFinally, with the rapid transition towards electrification and advanced safety in vehicles, we are focused on high growth segments and content opportunities, including (i) power isolation chips for on-board chargers, powertrain, and battery management systems in electric vehicles, (ii) connectivity, with telematics and other solutions being enabled by 4G/5G cellular engines, Wi-Fi\n®\n, Bluetooth\n®\n, Ultra-wide band, Ethernet, and GPS, and (iii) in-vehicle infotainment systems, driven by digital radio coprocessors, and solutions supporting advanced driver-assistance systems and autonomous driving. \nSolving Connectivity Challenges\nHighly integrated semiconductor solutions are pivotal in deploying next-generation standards, resolving analog, mixed-signal, and RF complexities that challenge existing hardware and network infrastructure. Addressing these design challenges requires diverse competencies including signal transmission, seamless hand-offs between multiple standards, power management, voltage regulation, battery charging, advanced filtering, and tuning.\nWe are at the forefront of this new era of connectivity, delivering the solutions that help enable the true potential of 5G and IoT. We have a rich heritage in analog systems design and have spent years investing in key technologies and resources. Our strength is underpinned by world-class performance and scale across a broad array of capabilities that include advanced TC-SAW and BAW filters, an expanded family of MIMO, ultra-high band, and diversity receive modules, timing devices, and digital power isolators. From our breakthrough Sky5\n®\n unifying platform to our 5G small cell solutions, our approach across both infrastructure and user equipment facilitates powerful, high-speed, end-to-end 5G connectivity.\nSkyworks’ Strategy\nMajor elements of our strategy include:\nIndustry-Leading Technology\nAs the industry migrates to more complex 5G architectures across a multitude of wireless applications, we are poised to help our customers handle growing levels of system complexity across both the transmit and receive chains. The trend towards increasing front-end and analog design challenges in smartphones and other platforms plays directly into our core strengths. Additionally, accelerating AI trends could catalyze the smartphone transformation with incremental content driving unprecedented functional and physical densities. These advancements will deliver more bandwidth, faster speeds, and enable applications like virtual reality, augmented reality, live video streaming, and seamless IoT connectivity. Crucially, they aim to bring us closer to achieving reliable low latency, ideal for massive machine communications, and introduces non-terrestrial networks that enable satellite connectivity for emergency applications. \nWe believe that we offer the broadest portfolio of radio and analog solutions from the transceiver to the antenna as well as all required manufacturing process technologies. We are also a leader in passive devices, advanced integration, including proprietary shielding and 3-D die stacking, as well as SAW, TC-SAW, and BAW filters. Our product portfolio is reinforced by a library of approximately 5,200 worldwide issued patents and other intellectual property that we own and control. Together, our industry-leading technology enables us to deliver the highest levels of product performance and integration.\nCustomer Relationships\nGiven our scale and technology leadership, we are engaged with leading original equipment manufacturers (“OEMs”), smartphone providers, and baseband reference design partners in the analog and mixed-signal semiconductor industry. Our customers value the scale of our global supply chain, our innovative technology, our ability to curate and deliver unique solutions, and our system engineering expertise, resulting in deep customer loyalty. We partner with our customers to support their long-term product road maps and are valued as a system solutions provider rather than just a discrete product vendor.\nDiversification\nWe are diversifying the reach of our business by expanding our addressable markets and broadening our product portfolio to serve a wider array of global customers. With the increasing adoption of 5G and the opportunity to enable more applications, we are growing our business beyond mobile devices (where we support leading top-tier manufacturers, including the leading smartphone suppliers and key baseband vendors) into additional high-performance analog markets, including automotive, home and factory automation, data center, solar, wireless infrastructure, aerospace and defense, medical, smart energy, and wireless \n7\nTable of Contents\nnetworking. In these markets we leverage our scale, intellectual property, and worldwide distribution network, which spans approximately 6,900 customers and 4,900 unique products.\nDelivering Operational Excellence\nThrough advanced supply chain management, we combine our highly specialized internal manufacturing capabilities with alliances and strategic relationships for leading-edge technologies. This hybrid manufacturing model allows us to better balance our manufacturing capacity with the demand of the marketplace.\nAdditionally, we continue to drive reductions in product design and manufacturing cycle times and further improve product yields. The combination of agile, flexible capacity, and world-class module manufacturing and scale advantage allows us to achieve low product costs while integrating multiple technologies into highly sophisticated multi-chip modules and helping to ensure stable supply to our global customer base.\nMaintaining a Performance-Driven Culture\nWe consider our people and corporate culture to be a competitive advantage and a key component of our corporate strategy, aligning employee efforts and responsibilities with performance measurement. Accountability is paramount, and we compensate our employees through a pay-for-performance methodology.\nGenerating Superior Operating Results and Stockholder Returns\nWe believe our manufacturing scale, broad product portfolio, strong profitability, and consistent cash flow generation position us to provide superior results and strong returns to our stockholders.\nOur Product Portfolio\nOur extensive product portfolio includes:\n•\nAmplifiers: the modules that strengthen the signal so that it has sufficient energy to reach a base station\n•\nAntenna Tuners: aperture and impedance tuning products that improve antenna performance across frequencies \n•\nAttenuators: circuits that allow a known source of power to be reduced by a predetermined factor (usually expressed as decibels)\n•\nAutomotive Tuners and Digital Radios: tuners, data receivers, and digital radio coprocessors used in automotive infotainment systems \n•\nWireless ASoC: an intelligent 2.4 GHz and 5GHz wireless radio integrated circuit that includes all the analog and digital functions optimized for building cognitive wireless audio headsets, headphones, and wireless speaker systems\n•\nDC/DC Converters: an electronic circuit which converts a source of direct current from one voltage level to another\n•\nDemodulators: a device or an RF block used in receivers to extract the information that has been modulated onto a carrier or from the carrier itself\n•\nDetectors: devices used to measure and control RF power in wireless systems\n•\nDigital Power Isolators: energy efficient solutions used in industrial control, solar inverters and hybrid/electric automotive drive trains\n•\nDiodes: semiconductor devices that pass current in one direction only\n•\nDirectional Couplers: transmission coupling devices for separately sampling the forward or backward wave in a transmission line\n•\nDiversity Receive Modules: devices used to improve receiver sensitivity in high data rate applications\n•\nFilters: devices for recovering and separating mixed and modulated data in RF stages, including SAW, TC-SAW, and BAW filters\n•\nFront-end Modules: two or more functions co-packaged to optimize the performance, cost, and application suitability in products, including intermediate or radio frequency signal paths\n•\nHybrid: a type of directional coupler used in radio and telecommunications\n•\nLED Drivers: devices which regulate the current through a light-emitting diode or string of diodes for the purpose of creating light\n•\nLow-Noise Amplifiers: devices used to reduce system noise figure in the receive chain\n•\nMixers: devices that enable signals to be converted to a higher or lower frequency signal and thereby allowing the signals to be processed more effectively\n•\nModulators: devices that take a baseband input signal and output a radio frequency modulated signal\n•\nOptocouplers/Optoisolators: semiconductor devices that allow signals to be transferred between circuits or systems while ensuring that the circuits or systems are electrically isolated from each other\n8\nTable of Contents\n•\nPhase Locked Loops: closed-loop feedback control system that maintains a generated signal in a fixed phase relationship to a reference signal\n•\nPhase Shifters: designed for use in power amplifier distortion compensation circuits in base station applications\n•\nPower Dividers/Combiners: utilized to equally split signals into in-phase signals as often found in balanced signal chains and local oscillator distribution networks\n•\nPower over Ethernet: enables both data and power to be sent over standard ethernet cable.\n•\nPower Isolators: digital, analog isolators, and isolated gate drivers used in industrial control, solar inverters, hybrid/electric automotive systems and charging stations\n•\nProSLIC\n®\n family of subscriber line interface circuits: provides complete analog telephone interfaces for premise equipment and enterprise\n•\nReceivers: electronic devices that change a radio signal from a transmitter into useful information (including broadcast receivers)\n•\nSystem In Package: complete system in a package, including modem, RF front-end, filtering, matching, timing generation – typically, fully certified by regulatory bodies, industry bodies and multi-service operators\n•\nSwitches: components that perform the change between the transmit and receive function, as well as the band function for cellular handsets\n•\nSynthesizers: devices that provide ultra-fine frequency resolution, fast switching speed, and low phase-noise performance\n•\nTiming Devices: clock generators, oscillators, jitter attenuators, and buffers used in optical networking, data center, wireless base stations, industrial, and automotive applications \n•\nVoltage Controlled Oscillators/Synthesizers: fully integrated, high performance signal source for high dynamic range transceivers\n•\nVoltage Regulators: generate a fixed level which ideally remains constant over varying input voltage or load conditions\nWe believe we possess broad technology capabilities and one of the most complete wireless communications product portfolios in the industry.\nMarketing and Distribution\nOur products are sold globally through a direct sales force, electronic component distributors, and independent sales representatives. As is customary in the semiconductor industry, our distributors may also market other products that compete with ours.\nOur sales engagement begins at the earliest stages of the design of an existing or potential customer’s product. We collaborate technically with our customers and reference design partners at the inception of new programs. These relationships allow our team to facilitate customer-driven solutions, which leverage the unique strength of our intellectual property and product portfolio while providing high value and greatly reducing time-to-market.\nWe believe the technical and complex nature of our products and markets demand an extraordinary commitment to maintain close ongoing relationships with our customers. We also employ a collaborative approach in developing these relationships by combining the support of our design teams, applications engineers, manufacturing personnel, sales and marketing staff, and senior management. Lastly, we leverage our customer relationships with cross-selling opportunities across product lines in order to maximize revenue.\nWe believe that maintaining frequent and interactive contact with our customers is paramount to our continuous efforts to provide world-class sales and service support. By listening and responding to feedback, we are able to mobilize resources to raise our level of customer satisfaction, improve our ability to anticipate future product needs, and enhance our understanding of key market dynamics. We are confident that diligently following this path positions us to participate in numerous opportunities for growth in the future.\nCustomer Concentration\nA small number of OEMs historically has accounted for a significant portion of our net revenue. In each of the fiscal years ended October 3, 2025 (“fiscal 2025”), September 27, 2024 (“fiscal 2024”), and September 29, 2023 (“fiscal 2023”), Apple, through sales to multiple distributors and contract manufacturers for multiple applications including smartphones, tablets, desktop and notebook computers, watches, and other devices, constituted more than ten percent of our net revenue. Further, the Company’s three largest accounts receivable balances comprised 82% and 80% of aggregate gross accounts receivable as of \n9\nTable of Contents\nOctober 3, 2025 and September 27, 2024, respectively. For further information regarding customer concentrations, see Note 14 to Item 8 of this Annual Report on Form 10-K.\nIntellectual Property and Proprietary Rights\n \nWe own or have a license to use numerous United States and foreign patents and patent applications related to our products and our manufacturing operations and processes. In addition, we own a number of trademarks and service marks applicable to certain of our products and services. We believe that our intellectual property, including patents, patent applications, trade secrets, and trademarks, is of material importance to our business. We rely on patent, copyright, trademark, trade secret, and other intellectual property laws, as well as non-disclosure and confidentiality agreements and other methods, to protect our confidential and proprietary technologies, designs, devices, algorithms, processes, and other intellectual property. Our efforts may not meaningfully protect our intellectual property, or others may independently develop substantially equivalent or superior proprietary technologies, designs, devices, algorithms, processes, or other intellectual property. In addition, the laws of some foreign countries do not protect proprietary rights to the same extent as the laws of the United States, and effective copyright, patent, trademark, and trade secret protection may not be available in those jurisdictions. In addition to protecting our intellectual property, we strive to strengthen our intellectual property portfolio to enhance our ability to obtain cross-licenses of intellectual property from others, to obtain access to intellectual property we do not possess, and to more favorably resolve potential intellectual property claims against us. Due to rapid technological changes in the industry, we believe establishing and maintaining a technological leadership position depends primarily on our ability to develop new, innovative products through the technical competence of our engineering personnel.\nCompetitive Conditions \nThe competitive environment in the semiconductor industry is in a constant state of flux, with new products continually emerging and existing products approaching technological obsolescence. We compete on the basis of time-to-market, new product innovation, quality, performance, price, compliance with industry standards, strategic relationships with customers and baseband vendors, personnel resources, and protection of our intellectual property. We participate in highly competitive markets against numerous competitors that may be able to adapt more quickly to new or emerging technologies and changes in customer requirements, or may be able to devote greater resources to the development, promotion, and sale of their products.\nResearch and Development\n \nOur products and markets demand rapid technological advancements requiring a continuous effort to enhance existing products and develop new products and technologies. Accordingly, we maintain a high level of research and development activity. We invested $785.5 million, $631.7 million, and $606.8 million in research and development during fiscal 2025, fiscal 2024, and fiscal 2023, respectively. The level of research and development expenses were the result of increases in our internal product designs and product development activity for our target markets in each of these fiscal years. Our research and development expenses include new product development and innovations in integrated circuit design, investment in advanced semiconductor manufacturing processes, development of new packaging and test capabilities, and research on next-generation technologies and product opportunities. We maintain close collaborative relationships with many of our customers to help identify market demands and target our development efforts to meet those demands.\nRaw Materials \nRaw materials for our products and manufacturing processes are generally available from several sources. It is our intent not to depend on a sole source of supply unless market or other conditions dictate otherwise. However, there are limited situations where we procure certain components and services for our products from single or limited sources, and we are currently dependent on a limited number of sole-source suppliers. We purchase materials and services primarily pursuant to individual purchase orders. However, we have entered into certain supply agreements for the purchase of raw materials or other manufacturing-related services that specify minimum prices and purchase quantity based on our anticipated future requirements. Certain of our suppliers consign raw materials to us at our manufacturing facilities to which we take title as needed in our manufacturing process. We have taken strategic action with suppliers located around the world to secure sourcing of the raw materials and components necessary for our manufacturing.\nBacklog and Inventory \nOur sales are primarily from the sale of semiconductor products under individual customer purchase orders, some of which have underlying master sales agreements that specify terms governing the product sales. In the absence of a sales agreement, the Company’s standard terms and conditions apply. Due to industry practice, which allows customers to cancel orders with limited advance notice to us prior to shipment, and with little or no penalty, we believe that backlog as of any particular date may not be a reliable indicator of our future revenue levels. The cancellation or deferral of product orders, the return of previously sold \n10\nTable of Contents\nproducts, or overproduction due to a change in anticipated order volume could result in a reduction in revenue and us holding excess or obsolete inventory, which could result in inventory write-downs and, in turn, could have a material adverse effect on our financial condition.\nGovernment Regulations\nWe are subject to international, federal, state, and local legislation, regulations, and other requirements relating to the discharge of substances into the environment; the treatment, transport, and disposal of hazardous wastes; recycling and product packaging; worker health and safety; and other activities affecting the environment, our workforce, and the management of our manufacturing operations. In addition, most of our customers have mandated that our operations and our products comply with various sustainability initiatives and workers’ rights initiatives initiated by such customers, industry groups in which such customers participate, or the jurisdictions in which such customers operate. We believe that our operations and facilities comply in all material respects with applicable environmental laws and worker health and safety laws. Our efforts to comply with environmental laws and worker health and safety laws could have material impacts on our capital expenditures, competitive position, or financial condition, though the magnitude and duration of such impacts are uncertain and difficult to quantify.\nWe are also subject to import/export controls, tariffs, and other trade-related regulations and restrictions in the countries in which we have operations or otherwise do business. These controls, tariffs, regulations, and restrictions (including those discussed below in Item 1A, Risk Factors) have had, and we believe may continue to have, a material impact on our business, including our ability to sell products and to manufacture or source components.\nGovernment regulations are subject to change in the future, and accordingly we are unable to assess the possible effect of compliance with future requirements or whether our compliance with such regulations will materially impact our business, results of operations, or financial condition.\nSeasonality \nSales of our products are subject to seasonal fluctuation and periods of increased demand in end-user consumer applications, such as smartphones and tablet computing devices. The highest demand for our products generally occurs in our first fiscal quarter ending in December and the fourth fiscal quarter ending in September. The lowest demand for our products generally occurs in our second fiscal quarter ending in March and the third fiscal quarter ending in June.\nEmployees\nOur workforce consists of approximately 10,000 employees located around the world, more than 99% of whom are full-time employees. As of October 3, 2025:\n•\nOur workforce was distributed geographically approximately as follows: 54% in Mexico, 24% in the United States, 20% in Asia, 1% in Canada, and less than 1% in Europe.\n•\nOur workforce was distributed by function approximately as follows: 39% in individual contributor manufacturing roles, 36% in engineering or technician roles, 12% in managerial roles, and 13% in professional or other administrative roles.\n•\nApproximately 3,260 of our employees in Mexico, 550 of our employees in Singapore, and 460 of our employees in Japan were covered by collective bargaining and other union agreements.\nWe focus on attracting and retaining employees by providing compensation and benefits packages that are competitive within the applicable market for each position. Nearly all full-time employees across the globe are eligible to participate in one of the Company’s incentive plans, under which payments are tied to pre-established performance goals, as well as to purchase shares of the Company’s common stock at a discount from its market price pursuant to the Company’s employee stock purchase plans. In addition, we believe that developing our employees’ skill sets and decision-making abilities—through challenging project assignments, formal training, mentorship, and recognition—is key not only to our employees’ job satisfaction and our retention efforts, but also to maintaining a strong leadership pipeline.\n11\nTable of Contents",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS\n \nOF OPERATIONS.\nThe following discussion and analysis of our financial condition and results of\n \noperations should be read in conjunction with our consolidated financial\n \nstatements and related notes that appear elsewhere in this Annual Report on\n \nForm 10-K. In addition to historical information, the following discussion contains forward-looking statements that are subject to risks and uncertainties. Actual results may differ substantially and adversely from those referred to herein due to a number of factors, including, but not limited to, those described below and in Item 1A “Risk Factors” and elsewhere in this Annual Report on Form 10-K.\nOVERVIEW\nWe, together with our consolidated subsidiaries, are a leading developer, manufacturer and provider of analog and mixed-signal semiconductor products and solutions for numerous applications, including aerospace, automotive, broadband, cellular infrastructure, connected home, defense, entertainment and gaming, industrial, medical, smartphone, tablet, and wearables. \nPending Combination With Qorvo\nOn October 27, 2025, we entered into the Merger Agreement with Qorvo, a provider of connectivity and power solutions, to combine Qorvo and Skyworks in a cash-and-stock transaction that values the combined company at approximately $\n22.0\n billion as of the market close on October 27, 2025.\nUnder the terms of the Merger Agreement, at the effective time of the Mergers, each share of Qorvo common stock issued and outstanding immediately prior thereto (with certain exceptions set forth in the Merger Agreement) will be converted into the right to receive \n0.960\n (the “Exchange Ratio”) of a share of Skyworks common stock and $\n32.50\n in cash, without interest, subject to applicable withholding taxes. The Exchange Ratio is expected to result in Qorvo equityholders and Skyworks equityholders owning approximately 37% and 63%, respectively, of the combined company on a pro forma basis following the closing. The Merger Agreement also provides for Skyworks’ assumption of certain Qorvo equity awards, subject to certain adjustments thereto in respect of, among other things, performance-based vesting conditions. \nPursuant to the Merger Agreement, immediately following the closing, the Board of Directors will be comprised of 11 directors, consisting of (i) the Chief Executive Officer of Skyworks, who will be the Chief Executive Officer of Skyworks following the closing, (ii) seven directors designated by Skyworks and (iii) three directors designated by Qorvo who are reasonably acceptable to Skyworks, each of whom will hold office until the next annual meeting of stockholders of Skyworks. Promptly following the closing, the Board of Directors will also designate a Chairman. Robert Bruggeworth, Qorvo’s current President, Chief Executive Officer and director, will be one of Qorvo’s designees upon the closing.\nThe Mergers, which are anticipated to close early in calendar year 2027, are subject to the satisfaction or waiver of customary closing conditions, including adoption of the Merger Agreement by Qorvo’s stockholders and the approval by Skyworks’ stockholders of the issuance of Skyworks common stock included in the consideration to be paid to Qorvo stockholders, the expiration or early termination of the waiting period under the Hart-Scott-Rodino Antitrust Improvement Act of 1976, as amended, and other regulatory approvals under certain antitrust and foreign investment regimes, the absence of any order, injunction or law of such jurisdictions prohibiting the Mergers, and the effectiveness of a registration statement on Form S-4 to be filed by us. \nWe and Qorvo each have termination rights under the Merger Agreement. Under specified circumstances, including termination by a party to accept a superior proposal or termination by the other party upon a change in such party’s board of directors’ recommendation to its stockholders, each of Qorvo and us will be required to pay the other party a termination fee of $\n298.7\n million, as more fully described in the Merger Agreement. Alternatively, under certain specified circumstances, including termination following an injunction arising in connection with certain antitrust or foreign investment laws, or failure to receive certain required regulatory approvals of specified governmental authorities, we will be required to pay Qorvo a termination fee of $\n100.0\n million, as more fully described in the Merger Agreement. \nIn connection with the execution of the Merger Agreement, we entered into a commitment letter (“Bridge Commitment Letter”) on October 27, 2025, with Goldman Sachs Bank USA, which committed to provide, subject to the satisfaction of customary closing conditions, up to $\n3,050.0\n million of senior unsecured bridge term loans for the purpose of financing a portion of the cash portion of the consideration to be paid to Qorvo stockholders, paying related fees and expenses in connection with the Mergers and the other transactions contemplated by the Merger Agreement and, in certain circumstances, to refinance certain of Qorvo’s senior notes. The receipt of financing by us is not a condition to our obligation to consummate the Mergers.\n36\nTable of Contents\nConcurrently with the execution of the Merger Agreement, we and certain stockholders of Qorvo affiliated with Starboard Value (“SBV”), an affiliate of Peter Feld, a member of the board of directors of Qorvo so designated by SBV (each, a “SBV Stockholder”), entered into a Voting and Support Agreement (the “VSA”), pursuant to which each SBV Stockholder has agreed to vote its shares of Qorvo common stock in favor of the adoption of the Merger Agreement. As of October 24, 2025, the SBV Stockholders collectively held approximately 8% of Qorvo’s issued and outstanding shares. Each SBV Stockholder has also agreed, for a limited period of time not exceeding nine months from the date of the VSA, not to sell or transfer its shares of Qorvo common stock, subject to certain exceptions as specified in the VSA, and has agreed not to solicit any competing acquisition proposal. The VSA will terminate, as to each SBV Stockholder, upon the earliest to occur of (a) the closing, (b) the termination of the Merger Agreement, (c) the date of any Qorvo Triggering Event or Skyworks Triggering Event (each, as defined in the Merger Agreement) and (d) the written consent of Skyworks, Qorvo and the applicable SBV Stockholder.\nFor more on risks related to the Mergers, see Part I, Item 1A, Risk Factors, “Risks Associated with the Proposed Transaction with Qorvo” of this Annual Report on Form 10-K.\nRESULTS OF OPERATIONS\nFiscal Years Ended October 3, 2025, September 27, 2024, and September 29, 2023\nThe following table sets forth the results of our operations expressed as a percentage of net revenue. See Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended September 27, 2024, filed with the SEC on November 15, 2024, as amended by Amendment No. 1 to such Annual Report on Form 10-K, filed with the SEC on January 24, 2025 (the “2024 10-K”), for Management’s Discussion and Analysis of Financial Condition and Results of Operations for the fiscal year ended September 29, 2023.\nFiscal Years Ended\nOctober 3, 2025\nSeptember 27, 2024\nSeptember 29, 2023\nNet revenue\n100.0 \n%\n100.0 \n%\n100.0 \n%\nCost of goods sold\n58.8 \n58.8 \n55.8 \nGross profit\n41.2 \n41.2 \n44.2 \nOperating expenses:\nResearch and development\n19.2 \n15.1 \n12.7 \nSelling, general, and administrative\n9.1 \n7.2 \n6.6 \nAmortization of intangibles\n— \n— \n0.7 \nRestructuring, impairment, and other charges\n0.6 \n3.6 \n0.6 \nTotal operating expenses\n28.9 \n25.9 \n20.6 \nOperating income\n12.2 \n15.3 \n23.6 \nInterest expense\n(0.7)\n(0.7)\n(1.3)\nOther income, net\n1.3 \n0.7 \n0.4 \nIncome before income taxes\n12.9 \n15.2 \n22.6 \nProvision for income taxes\n1.2 \n1.0 \n2.0 \nNet income\n11.7 \n%\n14.3 \n%\n20.6 \n%\nGeneral\nDuring the fiscal year ended October 3, 2025, the following key factors contributed to our overall results of operations, financial position, and cash flows:\n•\nNet revenue decreased 2.2% to $4,086.9 million in fiscal 2025, as compared to $4,178.0 million in fiscal 2024, driven primarily by a decrease in market share at a significant customer, partially offset by an increase in demand for our mobile and Wi-Fi products.\n•\nOur ending cash, cash equivalents, and marketable securities balance decreased 11.8% to $1,388.4 million in fiscal 2025, as compared to $1,574.1 million in fiscal 2024. The decrease in cash, cash equivalents, and marketable securities during fiscal 2025 was primarily due to share repurchases of $830.2 million, dividend payments of $432.6 million, and capital expenditures of $195.0 million, partially offset by cash generated from operations of $1,300.8 million.\n37\nTable of Contents\n•\nOn February 4, 2025, the Board of Directors appointed Philip Brace as the President and Chief Executive Officer of the Company and as a director, effective February 17, 2025.\n•\nOn May 7, 2025, the Board of Directors appointed Todd Lepinski as Senior Vice President, Sales and Marketing, effective as of June 2, 2025.\n•\nOn August 23, 2025, the Board of Directors appointed Philip Carter as Senior Vice President and Chief Financial Officer of the Company, effective as of September 8, 2025.\nNet Revenue\nFiscal Years Ended\n(dollars in millions)\nOctober 3, 2025\nChange\nSeptember 27, 2024\nChange\nSeptember 29, 2023\nNet revenue\n$\n4,086.9 \n(2.2)%\n$\n4,178.0 \n(12.5)%\n$\n4,772.4 \nWe market and sell our products indirectly through electronic components distributors and directly to OEMs of communications and electronics products, third-party original design manufacturers, and contract manufacturers. We generally experience seasonal peaks during our fourth and first fiscal quarters (which correspond to the second half of the calendar year), primarily as a result of increased worldwide production of consumer electronics in anticipation of holiday sales, whereas our second and third fiscal quarters are typically lower and in line with seasonal industry trends.\nThe decrease in net revenue in fiscal 2025, as compared to fiscal 2024, was driven primarily by a decrease in market share at a significant customer, partially offset by an increase in demand for our mobile and Wi-Fi products.\nFor information regarding net revenue by geographic region and customer concentration, see Note 14 to Item 8 of this Annual Report on Form 10-K. \nGross Profit\nFiscal Years Ended\n(dollars in millions)\nOctober 3, 2025\nChange\nSeptember 27, 2024\nChange\nSeptember 29, 2023\nGross profit\n$\n1,682.1 \n(2.2)%\n$\n1,720.8 \n(18.3)%\n$\n2,107.3 \n% of net revenue\n41.2 \n%\n41.2 \n%\n44.2 \n%\nGross profit represents net revenue less cost of goods sold. Our cost of goods sold consists primarily of purchased materials, labor, and overhead (including depreciation, share-based compensation expense, and amortization of acquisition intangibles) associated with product manufacturing. Erosion of average selling prices of established products is typical of the semiconductor industry. Consistent with trends in the industry, we anticipate that average selling prices for our established products will continue to decline over time. As part of our normal course of business, we intend to improve gross profit with efforts to increase unit volumes, improve manufacturing efficiencies, lower manufacturing costs of existing products, and by introducing new and higher value-added products.\nThe decrease in gross profit in fiscal 2025, as compared to fiscal 2024, was primarily the result of unfavorable product mix, lower average selling prices, and an increase in costs associated with facility consolidation and closure, partially offset by higher unit volumes.\nResearch and Development\nFiscal Years Ended\n(dollars in millions)\nOctober 3, 2025\nChange\nSeptember 27, 2024\nChange\nSeptember 29, 2023\nResearch and development\n$\n785.5 \n24.3%\n$\n631.7 \n4.1%\n$\n606.8 \n% of net revenue\n19.2 \n%\n15.1 \n%\n12.7 \n%\n38\nTable of Contents\nResearch and development expenses consist primarily of direct personnel costs including share-based compensation expense, costs for pre-production evaluation units and testing of new devices, non-production masks, engineering prototypes, and design tool costs.\nThe increase in research and development expenses in fiscal 2025, as compared to fiscal 2024, was primarily related to increases in headcount-related expenses, including share-based compensation and costs for engineering prototypes as a result of our increased investment in developing new technologies and products.\nSelling, General, and Administrative \nFiscal Years Ended\n(dollars in millions)\nOctober 3, 2025\nChange\nSeptember 27, 2024\nChange\nSeptember 29, 2023\nSelling, general, and administrative\n$\n371.5 \n23.5%\n$\n300.8 \n(4.2)%\n$\n314.0 \n% of net revenue\n9.1 \n%\n7.2 \n%\n6.6 \n%\nSelling, general, and administrative expenses include legal and related costs, accounting, treasury, human resources, information systems, customer service, bad debt expense, sales commissions, share-based compensation expense, advertising, marketing, costs associated with business combinations completed or contemplated during the period, and other costs.\nThe increase in selling, general, and administrative expenses in fiscal 2025, as compared to fiscal 2024, was primarily related to increases in headcount-related expenses, including share-based compensation and increases in professional services costs.\nAmortization of Intangibles\nFiscal Years Ended\n(dollars in millions)\nOctober 3, 2025\nChange\nSeptember 27, 2024\nChange\nSeptember 29, 2023\nAmortization of intangibles\n$\n0.9 \n—%\n$\n0.9 \n(97.3)%\n$\n33.2 \n% of net revenue\n— \n%\n— \n%\n0.7 \n%\nAmortization of intangible assets was consistent in fiscal 2025, as compared to fiscal 2024.\nRestructuring, Impairment, and Other Charges\nFiscal Years Ended\n(dollars in millions)\nOctober 3, 2025\nChange\nSeptember 27, 2024\nChange\nSeptember 29, 2023\nRestructuring, impairment, and other charges\n$\n24.2 \n(83.9)%\n$\n150.0 \n430.0%\n$\n28.3 \n% of net revenue\n0.6 \n%\n3.6 \n%\n0.6 \n%\nRestructuring, impairment, and other charges in fiscal 2025 was primarily due to certain management severance costs incurred in connection with Chief Executive Officer transition.\nRestructuring, impairment, and other charges in fiscal 2024 was primarily due to the abandonment or delay of previously capitalized in-process research and development (“IPR&D”) projects of $147.9 million and employee severance costs.\nInterest Expense\nFiscal Years Ended\n(dollars in millions)\nOctober 3, 2025\nChange\nSeptember 27, 2024\nChange\nSeptember 29, 2023\nInterest expense\n$\n27.1 \n(11.7)%\n$\n30.7 \n(52.3)%\n$\n64.4 \n% of net revenue\n0.7 \n%\n0.7 \n%\n1.3 \n%\nThe decrease in interest expense in fiscal 2025, as compared to fiscal 2024, was due to certain debt repayments in prior periods that reduced the amount of outstanding indebtedness.\n39\nTable of Contents\nOther Income, Net\nFiscal Years Ended\n(dollars in millions)\nOctober 3, 2025\nChange\nSeptember 27, 2024\nChange\nSeptember 29, 2023\nOther income, net\n$\n53.8 \n81.1%\n$\n29.7 \n63.2%\n$\n18.2 \n% of net revenue\n1.3 \n%\n0.7 \n%\n0.4 \n%\nThe increase in other income, net in fiscal 2025, as compared to fiscal 2024, was primarily due to an increase in interest income generated from cash, cash equivalents, and marketable securities. \nProvision for Income Taxes\nFiscal Years Ended\n(dollars in millions)\nOctober 3, 2025\nChange\nSeptember 27, 2024\nChange\nSeptember 29, 2023\nProvision for income taxes\n$\n49.6 \n22.8%\n$\n40.4 \n(57.9)%\n$\n96.0 \n% of net revenue\n1.2 \n%\n1.0 \n%\n2.0 \n%\nWe recorded a provision for income taxes of $49.6 million (which consisted of a benefit of $35.5 million and a provision of $0.1 million related to United States federal and state income taxes, respectively, and a provision of $85.0 million related to foreign income taxes) and $40.4 million (which consisted of benefits of $41.5 million and $0.3 million related to United States federal and state income taxes, respectively, and a provision of $82.2 million related to foreign income taxes) in fiscal 2025 and fiscal 2024, respectively. \nThe increase in income tax expense in fiscal 2025, as compared to fiscal 2024, was primarily due to higher foreign taxes including the tax impact of remeasuring existing net deferred tax liabilities in Singapore and a lower Foreign-Derived Intangible Income (“FDII”) benefit, partially offset by a decrease in Global Intangible Low-Taxed Income (“GILTI”), net of foreign tax credits and an increase in research and development credits.\nIn December 2021, the Organization for Economic Co-operation and Development’s (“OECD”) Inclusive Framework on Base Erosion and Profit Shifting (“BEPS”) released Global Anti-Base Erosion (“GloBE”) rules under Pillar Two. Many countries have implemented laws based on Pillar Two, which became effective for us beginning in fiscal 2025. The tax impact associated with Pillar Two was immaterial to the financial statements for fiscal 2025. We continue to evaluate the impact of proposed and enacted legislative changes as new guidance becomes available. \nIn July 2025, the U.S. government enacted the One Big Beautiful Bill Act (“OBBBA”). The OBBBA did not have a material impact to the financials for fiscal 2025. We continue to evaluate the impact of the OBBBA on our business for future periods.\nSee Note 8 to Item 8 of this Annual Report on Form 10-K for additional information regarding income taxes. \nLIQUIDITY AND CAPITAL RESOURCES\nFiscal Years Ended\n(in millions)\nOctober 3, 2025\nSeptember 27, 2024\nSeptember 29, 2023\nCash and cash equivalents at beginning of period\n$\n1,368.6 \n$\n718.8 \n$\n566.0 \nNet cash provided by operating activities\n1,300.8 \n1,824.7 \n1,856.4 \nNet cash used in investing activities\n(234.0)\n(355.9)\n(224.4)\nNet cash used in financing activities\n(1,274.1)\n(819.0)\n(1,479.2)\nCash and cash equivalents at end of period\n$\n1,161.3 \n$\n1,368.6 \n$\n718.8 \nCash provided by operating activities:\nCash provided by operating activities consists of net income for the period adjusted for certain non-cash items and changes in certain operating assets and liabilities. The $523.9 million decrease in cash provided by operating activities for fiscal 2025, as compared to fiscal 2024, was primarily related to a decrease in working capital of $370.7 million, due primarily to inventory and accounts receivable, and lower net income.\n40\nTable of Contents\nCash used in investing activities:\nCash used in investing activities consists primarily of cash paid to purchase marketable securities, capital expenditures, and cash paid to acquire intangible assets, partially offset by cash received related to the sale or maturity of marketable securities. The $121.9 million decrease in cash used in investing activities for fiscal 2025, as compared to fiscal 2024, was primarily related to an increase of $531.8 million in the sale or maturity of marketable securities, partially offset by an increase of $362.6 million in purchases of marketable securities and an increase of $38.0 million in capital expenditures.\nCash used in financing activities:\nCash used in financing activities consists primarily of cash transactions related to equity and proceeds and payments related to our long-term borrowings. The $455.1 million increase in cash used in financing activities for fiscal 2025, as compared to fiscal 2024, was primarily related to an increase of $752.9 million in share repurchases, partially offset by a decrease of $300.0 million for the repayment of debt.\nLiquidity:\nCash, cash equivalents, and marketable securities totaled $1,388.4 million as of October 3, 2025, representing a decrease of $185.7 million from September 27, 2024. \nWe have outstanding $500.0 million of Notes Due 2026 and $500.0 million of Notes Due 2031 (the “Notes”). During fiscal 2024 and 2023, we repaid $300.0 million and $900.0 million of outstanding borrowings, respectively. We have a Revolving Credit Agreement (the “Revolving Credit Agreement”) under which we may borrow up to $750.0 million for general corporate purposes and working capital needs of the Company and its subsidiaries. As of October 3, 2025, there were no borrowings outstanding under the revolving credit facility (the “Revolver”). The Revolving Credit Agreement expires July 26, 2026.\nIn connection with the execution of the Merger Agreement, we entered into a commitment letter on October 27, 2025, with Goldman Sachs Bank USA, which committed to provide, subject to the satisfaction of customary closing conditions, up to $3,050.0 million of senior unsecured bridge term loans for the purpose of financing a portion of the cash portion of the consideration to be paid to Qorvo stockholders, paying related fees and expenses in connection with the Mergers and the other transactions contemplated by the Merger Agreement and, in certain circumstances, to refinance certain of Qorvo’s senior notes. \nFor a description of contractual obligations, such as taxes, leases, purchase commitments, and debt, see Note 8, Note 10, Note 11, and Note 16 to Item 8 of this Annual Report on Form 10-K, respectively. \nBased on our historical results of operations, we expect that our cash, cash equivalents, and marketable securities on hand, the cash we expect to generate from operations, and funds from our Revolver, will be sufficient to fund our short-term and long-term liquidity requirements primarily arising from: research and development, capital expenditures, potential acquisitions, working capital, quarterly cash dividend payments (if such dividends are declared by the Board of Directors), share repurchases, outstanding commitments, and other liquidity requirements associated with existing operations. However, we cannot be certain that our cash, cash equivalents, and marketable securities on hand, cash generated from operations, and funds from our Revolver will be available in the future to fund all of our capital and operating requirements. In addition, any future strategic investments and significant acquisitions may require additional cash and capital resources. If we are unable to obtain sufficient cash or capital to meet our needs on a timely basis and on favorable terms, our business and operations could be materially and adversely affected.\nOur invested cash balances primarily consist of highly liquid marketable securities that are available to meet near-term cash requirements including: money market funds, U.S. Treasury and government securities, corporate bonds and notes, and municipal bonds.\nCRITICAL ACCOUNTING ESTIMATES\nThe discussion and analysis of our financial condition and results of operations are based upon our consolidated financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles (“GAAP”). The preparation of these financial statements requires us to make estimates and judgments in applying our most critical accounting policies that can have a significant impact on the results we report in our financial statements. The SEC has defined critical accounting estimates as those that are both most important to the portrayal of our financial condition and results and which require our most difficult, complex, or subjective judgments or estimates. Based on this definition, our most critical accounting estimates include revenue recognition, which impacts the recording of net revenue; inventory valuation, which impacts the cost of goods sold and gross margin; and income taxes, which impacts the income tax provision. These policies and significant \n41\nTable of Contents\njudgments involved are discussed further below. We have other significant accounting policies that do not generally require subjective estimates or judgments or would not have a material impact on our results of operations. Our significant accounting policies are described in Note 2 to Item 8 of this Annual Report on Form 10-K.\nRevenue Recognition. \nWe recognize revenue in accordance with the Financial Accounting Standards Board’s (“FASB”) Accounting Standards Codification (“ASC”) 606 \nRevenue from Contracts with Customers \nnet of estimated reserves\n. \nOur revenue reserves contain uncertainties because they require management to make assumptions and to apply judgment to estimate the value of future credits to customers for product returns, price protection, price adjustments, and stock rotation for products sold to certain electronic component distributors. We base these estimates on the expected value method considering all reasonably available information, including our historical experience and current expectations, and are reflected in the transaction price when sales are recorded. Changes in actual demand or market conditions could adversely or beneficially impact our reserve calculations. \nInventory Valuation\n. \nWe value our inventory at the lower of cost or net realizable value. Reserves for excess and obsolete inventory are established on a quarterly basis and are based on a detailed analysis of aged material, salability of our inventory, market conditions, and product life cycles. Once reserves are established, write-downs of inventory are considered permanent adjustments to the cost basis of inventory. Our reserves contain uncertainties because the calculation requires management to make assumptions and to apply judgment regarding historical experience, market conditions, and technological obsolescence. Changes in actual demand or market conditions could adversely impact our reserve calculations. \nIncome Taxes. \nThe application of tax laws and regulations to calculate our tax liabilities is subject to legal and factual interpretation, judgment, and uncertainty in a multitude of jurisdictions. Tax laws and regulations themselves are subject to change as a result of changes in fiscal policy, changes in legislation, the evolution of regulations, and court rulings. We recognize potential liabilities for anticipated tax audit issues in the United States and other tax jurisdictions based on our estimate of whether, and the extent to which, additional taxes and interest will be due. We record an amount as an estimate of probable additional income tax liability at the largest amount that we feel is more likely than not, based upon the technical merits of the position, to be sustained upon audit by the relevant tax authority.",
  "item2": null
}