{
  "item1": "2024 continued full commercial launch Triathlon Hinge revision knee system. Triathlon Hinge received approval August 2023 now released U.S., Ca nada New Zealand. also continued delivering growth total hip arthroplasty, particularly primary segment where Direct Anterior Reconstructive Technology Mako Total Hip can help reduce, if not eliminate, surgeon's use intraoperative fluoroscopy during direct anterior hip procedures. acquisition SERF SAS, strengthened distribution key European markets continue scale differentiated solutions such Novae monolithic dual mobility cup engineered deliver greater hip stability reduce dislocation risk.",
  "item7": "increase MedSurg Neurotechnology operating income percentage net sales 2024 2023 primarily driven higher unit volumes, higher prices decrease selling, general administrative expenses percentage sales partially offset higher manufacturing supply chain costs. increase MedSurg Neurotechnology operating income percentage net sales 2023 2022 primarily driven higher unit volumes, higher prices lower manufacturing supply chain costs due supply chain challenges impacting capital products MedSurg businesses 2022 which improved 2023 partially offset higher selling, general administrative expenses percentage sales due continued investments including sales growth incentives more normalized cadence travel meetings. increase Orthopaedics operating income percentage net sales 2024 2023 primarily driven higher sales volumes decrease selling, general administrative expenses percentage sales partially offset higher manufacturing supply chain costs. decrease Orthopaedics operating income percentage net sales 2023 2022 primarily driven higher higher manufacturing supply chain costs primarily due increased inventory reserves partially offset higher unit volumes.",
  "item2": "EPS Reported percent net sales Acquisition integration-related costs: Inventory stepped-up fair value Other acquisition integration-related (a) Amortization purchased intangible assets Structural optimization other special charges (b) Goodwill other impairments (c) Medical device regulations (d) Recall-related matters (e) Regulatory legal matters (f) Adjusted percent net sales (a) Charges represent certain acquisition integration-related costs associated acquisitions, including: Employee retention workforce reductions Changes fair value contingent consideration Manufacturing integration costs Stock compensation payments upon change control Other integration-related activities Adjustments Operating Income Other income taxes related acquisition integration-related costs Adjustments Income Taxes Adjustments Net Earnings (b) Structural optimization other special charges represent costs associated with: Employee retention workforce reductions Closure/transfer manufacturing other facilities Termination sales relationships certain countries Adjustments Operating Income Adjustments Other Income (Expense), Net Adjustments Income Taxes Adjustments Net Earnings (c) Goodwill other impairments represent costs associated with: Certain long-lived intangible asset write-offs impairments Product line exits (e.g., long-lived asset specifically-identified intangible asset write-offs) Adjustments Operating Income Adjustments Income Taxes Adjustments Net Earnings (d) Charges represent costs specific updating quality system, product labeling, asset write-offs product remanufacturing comply medical device reporting regulations other requirements new medical device regulations European Union. (e) Charges represent changes best estimate probable loss, minimum range probable losses when best estimate within range not known, resolve certain recall-related matters. (f) Charges represent changes best estimate probable loss, minimum range probable losses when best estimate within range not known, resolve certain regulatory other legal matters amount favorable awards settlements. Dollar amounts millions except per share amounts otherwise specified."
}