{
  "source_file": "syy-20250927.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThis discussion should be read in conjunction with our consolidated financial statements as of June 28, 2025, and for the fiscal year then ended, and Management’s Discussion and Analysis of Financial Condition and Results of Operations, both contained in our fiscal 2025 Form 10-K, as well as the consolidated financial statements (unaudited) and notes to the consolidated financial statements (unaudited) contained in this report. \nHighlights\nOur first quarter of fiscal 2026 results included sales growth of 3.2% as compared to the first quarter of fiscal 2025, driven by increased sales in our U.S. Foodservice Operations, International Foodservice Operations, and SYGMA segments. Our gross profit increased 3.9% compared to the first quarter of fiscal 2025, due to product cost savings driven by strategic sourcing initiatives. Operating income decreased 1.0% compared to the first quarter of fiscal 2025, due to increased restructuring and transformational project costs and acquisition-related costs. We consider these “Certain Item” expenses (as defined below). Excluding Certain Item expenses, adjusted operating income increased 2.9% as compared to the first quarter of fiscal 2025. Our net earnings for the first quarter of fiscal 2026 decreased 2.9% as compared to the first quarter of fiscal 2025. Excluding Certain Item expenses, adjusted net earnings increased by 2.0% as compared to the first quarter of fiscal 2025. See below for a comparison of our fiscal 2026 results to our fiscal 2025 results, both including and excluding Certain Items. \nComparisons of results from the first quarter of fiscal 2026 to the first quarter of fiscal 2025 are presented below:\n•\nSales:\n◦\nincreased 3.2%, or $664 million, to $21.1 billion;\n•\nOperating income:\n◦\ndecreased 1.0%, or $8 million, to $800 million;\n◦\nadjusted operating income increased 2.9%, or $25 million, to $898 million;\n•\nNet earnings:\n◦\ndecreased 2.9%, or $14 million, to $476 million;\n◦\nadjusted net earnings increased 2.0%, or $11 million, to $551 million;\n•\nBasic earnings per share:\n◦\ndecreased 1.0%, or $0.01, to $0.99 per share;\n•\nDiluted earnings per share:\n◦\nunchanged, at $0.99 per share;\n◦\nadjusted diluted earnings per share increased 5.5%, or $0.06, to $1.15 per share;\n•\nEBITDA:\n◦\ndecreased 3.1%, or $32 million, to $1.0 billion; and\n◦\nadjusted EBITDA increased 0.1%, or $1 million, to $1.1 billion.\nThe discussion of our results includes certain non-GAAP financial measures, including EBITDA and adjusted EBITDA, that we believe provide important perspective with respect to underlying business trends. Other than EBITDA and free cash flow, any non-GAAP financial measures will be denoted as adjusted measures to remove: (1) restructuring charges; (2) expenses associated with our various transformation initiatives; (3) severance charges; and (4) acquisition-related costs consisting of (a) intangible amortization expense and (b) acquisition costs and due diligence costs related to our acquisitions.\nThe fiscal 2026 and fiscal 2025 items discussed above are collectively referred to as “Certain Items.” The results of our operations can be impacted by changes in exchange rates applicable to converting from local currencies to U.S. dollars. We measure our results on a constant currency basis. \n23\nTrends\nEconomic and Industry Trends\n \nFoot traffic to restaurant trends experienced a sequential improvement of 60 basis points for the first quarter of fiscal 2026 as compared to foot traffic to restaurant trends experienced in the fourth quarter of fiscal 2025. Our U.S. Foodservice Operations local case growth trends experienced a sequential improvement of 120 basis points during the same time period, outpacing the industry’s foot traffic improvement trends. The macroeconomic environment was similar in the first quarter of fiscal 2026 as compared to the two prior fiscal quarters, which has continued to adversely impact consumer sentiment. Despite the current macroeconomic landscape, we expect to grow both sales and net earnings per share in fiscal 2026. We believe the food-away-from-home sector is a healthy, long-term growth market, and Sysco is diversified and well positioned as a market leader in food service.\nSales and Gross Profit Trends\nSales increased 3.2% in the first quarter of fiscal 2026 as compared to the first quarter of fiscal 2025. Our sales and gross profit performance are influenced by multiple factors, including price, volume, inflation, customer mix and product mix. We experienced a 0.1% increase in U.S. Foodservice Operations case volume in the first quarter of fiscal 2026, as compared to the first quarter of fiscal 2025. Our volume growth trends were attributable to national case volume increasing 0.7% and local volume decreasing 0.2% in the first quarter of fiscal 2026 as compared to the first quarter of fiscal 2025. Our volume reflects our broadline and specialty businesses. Beginning in fiscal 2026, we are now including volumes from our specialty meat business for all periods presented. \nWe experienced inflation at a rate of 3.4% in the first quarter of fiscal 2026, at the total enterprise level, primarily driven by inflation in the meat and seafood categories. We continue to manage inflation by successfully passing on cost increases to our customers in a timely manner. Gross margin increased 13 basis points in the first quarter of fiscal 2026, as compared to the first quarter of fiscal 2025, primarily due to benefits from our strategic sourcing initiatives.\nOperating Expense Trends\nTotal operating expenses were $3.1 billion in the first quarter of fiscal 2026, a 5.3% increase compared to the first quarter of fiscal 2025. Total adjusted operating expenses were $3.0 billion in the first quarter of fiscal 2026, a 4.3% increase as compared to the first quarter of fiscal 2025. Operating expenses increased primarily due to sales headcount investments, higher incentive compensation, and costs associated with expanded building capacity, including depreciation expense related to new facilities. Adjusted operating expenses were 14.2% of sales during the first quarter of fiscal 2026, which represents a 14-basis point increase as compared to the first quarter of fiscal 2025, as a result of planned investments in higher growth areas of the business with sales headcount, fleet, and building expansions. \nMergers and Acquisitions\nIn October 2025, we acquired Fairfax Meadow, a leading specialty meat supplier based in the United Kingdom. This acquisition follows our acquisition of Campbells Prime Meat last fiscal year and positions our team in the United Kingdom to achieve additional growth by leveraging additional specialty meat capabilities geographically. This company’s results will be included within International Foodservice Operations and are not expected to be material to our results of operations.\nStrategy\nOur purpose is “Connecting the World to Share Food and Care for One Another.” Purpose-driven companies are believed to perform better. We believe our purpose will assist us to grow substantially faster than the foodservice distribution industry and deliver profitable growth through our Recipe for Growth transformation. This growth transformation is supported by strategic pillars that we believe will allow us to better serve our customers, including our digital, products and solutions, supply chain, customer teams, and future horizons strategies.\nOur business transformation initiatives are progressing, which include promoting our specialty programs for produce, protein and Italian products, and our customer growth initiatives. From these actions, as a part of our Recipe for Growth, the benefits of our developing capabilities are apparent in the new customers we are winning and in the progress we are making toward increasing market share. We expect that, as our Recipe for Growth matures, the impact on our top-line growth will deliver profitable and consistent growth. \n24\nResults\n \nof Operations\nThe following table sets forth the components of our consolidated results of operations expressed as a percentage of sales for the periods indicated:\n \n13-Week Period Ended\n \nSep. 27, 2025\nSep. 28, 2024\nSales\n100.0 \n%\n100.0 \n%\nCost of sales\n81.6 \n81.7 \nGross profit\n18.4 \n18.3 \nOperating expenses\n14.6 \n14.4 \nOperating income\n3.8 \n3.9 \nInterest expense\n0.8 \n0.8 \nOther expense (income), net\n0.2 \n— \nEarnings before income taxes\n2.8 \n3.1 \nIncome taxes\n0.5 \n0.7 \nNet earnings\n2.3 \n%\n2.4 \n%\n25\nThe following table sets forth the change in the components of our consolidated results of operations expressed as a percentage increase or decrease over the comparable period in the prior year:\n \n13-Week Period Ended\nSep. 27, 2025\nSales\n3.2 \n%\nCost of sales\n3.1 \nGross profit\n3.9 \nOperating expenses\n5.3 \nOperating income\n(1.0)\nInterest expense\n7.5 \nOther expense (income), net \n(1)\n366.7 \nEarnings before income taxes\n(6.5)\nIncome taxes\n(18.4)\nNet earnings\n(2.9)\n%\nBasic earnings per share\n(1.0)\n%\nDiluted earnings per share\n— \nAverage shares outstanding\n(2.7)\nDiluted shares outstanding\n(2.7)\n(1)\nOther expense (income), net was expense of $28 million and $6 million in the first quarter of fiscal 2026 and fiscal 2025, respectively.\nThe following tables represent our results by reportable segments:\n \n13-Week Period Ended Sep. 27, 2025\n \nU.S. Foodservice Operations\nInternational Foodservice Operations\nSYGMA\nOther\nGlobal Support Center\nConsolidated\nTotals\n \n(In millions)\nSales\n$\n14,780 \n$\n3,966 \n$\n2,129 \n$\n273 \n$\n— \n$\n21,148 \nSales increase (decrease)\n2.9 \n%\n4.5 \n%\n4.1 \n%\n(3.2)\n%\n3.2 \n%\nPercentage of total\n69.9 \n%\n18.8 \n%\n10.1 \n%\n1.2 \n%\n100.0 \n%\nOperating income (loss)\n$\n880 \n$\n114 \n$\n25 \n$\n4 \n$\n(223)\n$\n800 \nOperating income (loss) increase (decrease)\n(3.1)\n%\n12.9 \n%\n38.9 \n%\n(55.6)\n%\n(2.2)\n%\n(1.0)\n%\nPercentage of total segments \n86.0 \n%\n11.1 \n%\n2.4 \n%\n0.5 \n%\n100.0 \n%\nOperating income as a percentage of sales\n6.0 \n%\n2.9 \n%\n1.2 \n%\n1.5 \n%\n3.8 \n%\n \n13-Week Period Ended Sep. 28, 2024\n \nU.S. Foodservice Operations\nInternational Foodservice Operations\nSYGMA\nOther\nGlobal Support Center\nConsolidated\nTotals\n \n(In millions)\nSales\n$\n14,362 \n$\n3,794 \n$\n2,046 \n$\n282 \n$\n— \n$\n20,484 \nPercentage of total\n70.1 \n%\n18.5 \n%\n10.0 \n%\n1.4 \n%\n100.0 \n%\nOperating income (loss)\n$\n908 \n$\n101 \n$\n18 \n$\n9 \n$\n(228)\n$\n808 \nPercentage of total segments\n87.7 \n%\n9.7 \n%\n1.7 \n%\n0.9 \n%\n100.0 \n%\nOperating income as a percentage of sales\n6.3 \n%\n2.7 \n%\n0.9 \n%\n3.2 \n%\n3.9 \n%\n26\nBased on information in Note 13, “Business Segment Information,” in the Notes to Consolidated Financial Statements in Item 1 of Part I of this Form 10-Q, U.S. Foodservice Operations and International Foodservice Operations, collectively, represented approximately 88.7% of Sysco’s overall sales in the first 13 weeks of fiscal 2026. U.S. Foodservice Operations and International Foodservice Operations, collectively, represented approximately 97.1% of total segment operating income, in the first 13 weeks of fiscal 2026. This illustrates that these segments represent a substantial majority of our total segment results when compared to other reportable segments.\nResults of U.S. Foodservice Operations\nThe following table sets forth a summary of the components of operating income expressed as a percentage increase or decrease over the comparable period in the prior year:\n \n13-Week Period Ended Sep. 27, 2025\n13-Week Period Ended Sep. 28, 2024\nChange in Dollars\n% Change\n \n(Dollars in millions)\nSales\n$\n14,780 \n$\n14,362 \n$\n418 \n2.9 \n%\nGross profit\n2,823 \n2,747 \n76 \n2.8 \nOperating expenses\n1,943 \n1,839 \n104 \n5.7 \nOperating income\n$\n880 \n$\n908 \n$\n(28)\n(3.1)\n%\nGross profit\n$\n2,823 \n$\n2,747 \n$\n76 \n2.8 \n%\nAdjusted operating expenses (Non-GAAP)\n1,907 \n1,822 \n85 \n4.7 \nAdjusted operating income (Non-GAAP)\n$\n916 \n$\n925 \n$\n(9)\n(1.0)\n%\nSales\nThe following table sets forth the percentage and dollar value increase or decrease in the major factors impacting sales as compared to the corresponding prior year period in order to demonstrate the cause and magnitude of change:\nIncrease (Decrease)\n13-Week Period\n(Dollars in millions)\nCause of change\nPercentage\nDollars\nCase volume \n(1)\n0.1 \n%\n$\n18 \nInflation\n2.6 \n373 \nOther\n0.2 \n27 \nTotal change in sales\n2.9 \n%\n$\n418 \n(1)\nCase volumes increased 0.1% compared to the first quarter of fiscal 2025. This volume increase resulted in a 0.1% increase in the dollar value of sales compared to the first quarter of fiscal 2025. \nThe sales growth in our U.S. Foodservice Operations was primarily driven by higher inflation. Case volumes from our U.S. Foodservice Operations increased 0.1% in the first quarter of fiscal 2026, as compared to the first quarter of fiscal 2025. This includes a 0.7% increase in national case volume, partially offset by a 0.2% decrease in local customer case volume in the first quarter of fiscal 2026 as compared to the first quarter of fiscal 2025.\nOperating Income\nThe decrease in operating income for the first quarter of fiscal 2026 as compared to the first quarter of fiscal 2025 was driven by an increase in operating expenses, partially offset by gross profit dollar growth and case volume growth.\nGross profit dollars increased in the first quarter of fiscal 2026 as compared to the first quarter of fiscal 2025, primarily as a result of improvements in our strategic sourcing initiatives and the effective management of product cost fluctuations. The estimated change in product costs, an internal measure of inflation or deflation, increased in the first quarter of fiscal 2026. \n27\nGross margin, which is gross profit as a percentage of sales, was 19.10% in the first quarter of fiscal 2026, for our U.S. Foodservice Operations, which was a decrease of 3 basis points compared to gross margin of 19.13% in the first quarter of fiscal 2025. This decrease is primarily driven by customer mix, as national case sales volumes outpaced local case sales volumes.\nThe increase in operating expenses for the first quarter of fiscal 2026, as compared to the first quarter of fiscal 2025, was primarily driven by increases in colleague-related costs, bad debt expense, and other miscellaneous costs.\nResults of International Foodservice Operations\nThe following table sets forth a summary of the components of operating income and adjusted operating income expressed as a percentage increase or decrease over the comparable period in the prior year:\n \n13-Week Period Ended Sep. 27, 2025\n13-Week Period Ended Sep. 28, 2024\nChange in Dollars\n% Change\n \n(Dollars in millions)\nSales\n$\n3,966 \n$\n3,794 \n$\n172 \n4.5 \n%\nGross profit\n826 \n774 \n52 \n6.7 \nOperating expenses\n712 \n673 \n39 \n5.8 \nOperating income\n$\n114 \n$\n101 \n$\n13 \n12.9 \n%\nGross profit\n$\n826 \n$\n774 \n$\n52 \n6.7 \n%\nAdjusted operating expenses (Non-GAAP)\n679 \n644 \n35 \n5.4 \nAdjusted operating income (Non-GAAP)\n$\n147 \n$\n130 \n$\n17 \n13.1 \n%\nSales on a constant currency basis (Non-GAAP)\n$\n3,875 \n$\n3,794 \n$\n81 \n2.1 \n%\nGross profit on a constant currency basis (Non-GAAP)\n802 \n774 \n28 \n3.6 \nAdjusted operating expenses on a constant currency basis (Non-GAAP)\n656 \n644 \n12 \n1.9 \nAdjusted operating income on a constant currency basis (Non-GAAP)\n$\n146 \n$\n130 \n$\n16 \n12.3 \n%\nSales\nThe following table sets forth the percentage and dollar value increase or decrease in the major components impacting sales as compared to the corresponding prior year period in order to demonstrate the cause and magnitude of change.\nIncrease (Decrease)\n13-Week Period\n(Dollars in millions)\nCause of change\nPercentage\nDollars\nInflation\n4.5 \n%\n$\n173 \nForeign currency\n2.4 \n91 \nCase volume\n0.6 \n15 \nImpact of divestiture\n(3.4)\n(117)\nOther\n0.4 \n10 \nTotal change in sales\n4.5 \n%\n$\n172 \nSales for the first quarter of fiscal 2026 increased 4.5% as compared to the first quarter of fiscal 2025, primarily due to higher inflation, the impact of foreign currency translation, and local case growth. Excluding the impact of the Mexico joint venture, which was divested in the second quarter of fiscal 2025, sales increased 7.9% in the first quarter of fiscal 2026 as compared to the first quarter of fiscal 2025. \n28\nOperating Income\nThe increase in operating income for the first quarter of fiscal 2026, as compared to the first quarter of fiscal 2025, was primarily due to growth in local case volumes and success in our strategic sourcing program, partially offset by increases in operating expenses.\nThe increase in gross profit dollars in the first quarter of fiscal 2026, as compared to the first quarter of fiscal 2025, was primarily attributable to increases in local case volumes and benefits from our strategic sourcing efforts. Local case volumes increased approximately 5% in the first quarter of fiscal 2026 compared to the first quarter of fiscal 2025.\nThe increase in operating expenses in the first quarter of fiscal 2026 as compared to the first quarter of fiscal 2025 was primarily due to increases in colleague-related costs and the impact of foreign currency translation.\nResults of SYGMA and Other Segment\nSYGMA segment sales were 4.1% higher in the first quarter of fiscal 2026, as compared to the first quarter of fiscal 2025, primarily driven by the growth of new customers. We expect SYGMA’s sales growth rates to moderate in fiscal 2026 as we reach the one-year anniversary mark of fiscal 2025’s substantial customer additions. Operating income increased $7 million in the first quarter of fiscal 2026 as compared to the first quarter of fiscal 2025, primarily due to the growth of new customers and operating efficiencies.\nFor the operations that are grouped within Other, operating income decreased $5 million in the first quarter of fiscal 2026, as compared to the first quarter of fiscal 2025. The operations of this group primarily consist of our hospitality business, Guest Worldwide.\nGlobal Support Center Expenses\nOur Global Support Center generally includes all expenses of the corporate office and Sysco’s shared service operations. These expenses in the first quarter of fiscal 2026 increased $12 million, or 5.3%, as compared to the first quarter of fiscal 2025, primarily due to increases in colleague-related costs and higher incentive compensation, partially offset by decreases in insurance costs. \nIncluded in Global Support Center expenses are Certain Items that totaled $29 million in the first quarter of fiscal 2026, as compared to $19 million in the first quarter of fiscal 2025. Certain Items impacting the first quarter of fiscal 2026 were primarily expenses associated with our business technology transformation initiatives and expenses associated with acquisitions. Certain Items impacting the first quarter of fiscal 2025 were primarily expenses associated with our business technology transformation initiatives and expenses associated with acquisitions.\nInterest Expense\nInterest expense increased $12 million for the first quarter of fiscal 2026, as compared to the first quarter of fiscal 2025. The increase was primarily due to interest on new senior notes that were issued in the third quarter of fiscal 2025.\nOther Income and Expense\nOther expense increased $22 million for the first quarter of fiscal 2026, as compared to the first quarter of fiscal 2025, primarily due to foreign exchange losses incurred in the first quarter of fiscal 2026. We expect other expense to approximate $65 million for fiscal year 2026.\nNet Earnings\nNet earnings decreased 2.9% in the first quarter of fiscal 2026 as compared to the first quarter of fiscal 2025, primarily due to the items noted above for operating income, and interest expense, as well as items impacting our income taxes that are discussed in Note 11, “Income Taxes,” in the Notes to Consolidated Financial Statements in Item 1 of Part I of this Form 10-Q. Adjusted net earnings, excluding Certain Items, increased 2.0% in the first quarter of fiscal 2026 as compared to the first quarter of fiscal 2025, primarily due to the effective management of product cost fluctuations.\n29\nEarnings Per Share\nBasic earnings per share in the first quarter of fiscal 2026 were $0.99, a 1.0% decrease from the comparable prior year period amount of $1.00 per share. Diluted earnings per share in the first quarter of fiscal 2026 were $0.99, unchanged from the comparable prior year period amount of $0.99 per share. Adjusted diluted earnings per share, excluding Certain Items, in the first quarter of fiscal 2026 were $1.15, a 5.5% increase from the comparable prior year amount of $1.09 per share.\nNon-GAAP Reconciliations\nThe discussion of our results includes certain non-GAAP financial measures, including EBITDA and adjusted EBITDA, that we believe provide important perspective with respect to underlying business trends. Other than EBITDA and free cash flow, any non-GAAP financial measures will be denoted as adjusted measures to remove: (1) restructuring charges; (2) expenses associated with our various transformation initiatives; (3) severance charges; and (4) acquisition-related costs consisting of (a) intangible amortization expense and (b) acquisition costs and due diligence costs related to our acquisitions.\nThe results of our operations can be impacted due to changes in exchange rates applicable in converting local currencies to U.S. dollars. We measure our results on a constant currency basis. Constant currency operating results are calculated by translating current-period local currency operating results with the currency exchange rates used to translate the financial statements in the comparable prior-year period to determine what the current-period U.S. dollar operating results would have been if the currency exchange rate had not changed from the comparable prior-year period. We also measure our sales growth excluding the impact of our joint venture in Mexico which was divested in the second quarter of fiscal 2025.\nManagement believes that adjusting its operating expenses, operating income, operating margin, net earnings and diluted earnings per share to remove these Certain Items, presenting its results on a constant currency basis, and adjusting its sales results to exclude the impact of its joint venture in Mexico provides an important perspective with respect to our underlying business trends and results. It provides meaningful supplemental information to both management and investors that (1) is indicative of the performance of the company’s underlying operations and (2) facilitates comparisons on a year-over-year basis.\nSysco has a history of growth through acquisitions and excludes from its non-GAAP financial measures the impact of acquisition-related intangible amortization, acquisition costs and due diligence costs for those acquisitions. We believe this approach significantly enhances the comparability of Sysco’s results for fiscal year 2026 and fiscal year 2025.\nSet forth on the following page is a reconciliation of sales, operating expenses, operating income, net earnings and diluted earnings per share to adjusted results for these measures for the periods presented. Individual components of diluted earnings per share may not be equal to the total presented when added due to rounding. Adjusted diluted earnings per share is calculated using adjusted net earnings divided by diluted shares outstanding.\n \n13-Week Period Ended Sep. 27, 2025\n13-Week Period Ended Sep. 28, 2024\nChange in Dollars\n%/bps  Change\nSales (GAAP)\n$\n21,148 \n$\n20,484 \n$\n664 \n3.2 \n%\nImpact of Mexico joint venture sales\n— \n(117)\n117 \n0.6 \nComparable sales excluding Mexico joint venture (Non-GAAP)\n$\n21,148 \n$\n20,367 \n$\n781 \n3.8 \n%\nSales (GAAP)\n$\n21,148 \n$\n20,484 \n$\n664 \n3.2 \n%\nImpact of currency fluctuations \n(1)\n(91)\n(91)\n(0.4)\nComparable sales using a constant currency basis (Non-GAAP)\n$\n21,057 \n$\n20,484 \n$\n573 \n2.8 \n%\nCost of sales (GAAP)\n$\n17,247 \n$\n16,731 \n$\n516 \n3.1 \n%\n30\n13-Week Period Ended Sep. 27, 2025\n13-Week Period Ended Sep. 28, 2024\nChange in Dollars\n%/bps  Change\nGross profit (GAAP)\n$\n3,901 \n$\n3,753 \n$\n148 \n3.9 \n%\nImpact of currency fluctuations \n(1)\n(24)\n(24)\n(0.6)\nComparable gross profit adjusted for Certain Items using a constant currency basis (Non-GAAP)\n$\n3,877 \n$\n3,753 \n$\n124 \n3.3 \n%\nGross margin (GAAP)\n18.45 \n%\n18.32 \n%\n13 bps\nImpact of currency fluctuations \n(1)\n(0.04)\n-4 bps\nComparable gross margin adjusted for Certain Items using a constant currency basis (Non-GAAP)\n18.41 \n%\n18.32 \n%\n9 bps\nOperating expenses (GAAP)\n$\n3,101 \n$\n2,945 \n$\n156 \n5.3 \n%\nImpact of restructuring and transformational project costs \n(2)\n(56)\n(27)\n(29)\nNM\nImpact of acquisition-related costs \n(3)\n(42)\n(38)\n(4)\n(10.5)\nOperating expenses adjusted for Certain Items (Non-GAAP)\n3,003 \n2,880 \n123 \n4.3 \nImpact of currency fluctuations \n(1)\n(23)\n(23)\n(0.8)\nComparable operating expenses adjusted for Certain Items using a constant currency basis (Non-GAAP)\n$\n2,980 \n$\n2,880 \n$\n100 \n3.5 \n%\nOperating expense as a percentage of sales (GAAP)\n14.66 \n%\n14.38 \n%\n28 bps\nImpact of certain item adjustments\n(0.46)\n(0.32)\n-14 bps\nAdjusted operating expense as a percentage of sales (Non-GAAP)\n14.20 \n%\n14.06 \n%\n14 bps\nOperating income (GAAP)\n$\n800 \n$\n808 \n$\n(8)\n(1.0)\n%\nImpact of restructuring and transformational project costs \n(2)\n56 \n27 \n29 \nNM\nImpact of acquisition-related costs \n(3)\n42 \n38 \n4 \n10.5 \nOperating income adjusted for Certain Items (Non-GAAP)\n898 \n873 \n25 \n2.9 \nImpact of currency fluctuations \n(1)\n(1)\n(1)\n(0.2)\nComparable operating income adjusted for Certain Items using a constant currency basis (Non-GAAP)\n$\n897 \n$\n873 \n$\n24 \n2.7 \n%\nOperating margin (GAAP)\n3.78 \n%\n3.94 \n%\n-16 bps\nOperating margin adjusted for Certain Items (Non-GAAP)\n4.25 \n%\n4.26 \n%\n-1 bps\nOperating margin adjusted for Certain Items using a constant currency basis (Non-GAAP)\n4.26 \n%\n4.26 \n%\n0 bps\nNet earnings (GAAP)\n$\n476 \n$\n490 \n$\n(14)\n(2.9)\n%\nImpact of restructuring and transformational project costs \n(2)\n56 \n27 \n29 \nNM\nImpact of acquisition-related costs \n(3)\n42 \n38 \n4 \n10.5 \nTax impact of restructuring and transformational project costs \n(4)\n(13)\n(6)\n(7)\nNM\nTax impact of acquisition-related costs \n(4)\n(10)\n(9)\n(1)\n(11.1)\nNet earnings adjusted for Certain Items (Non-GAAP)\n$\n551 \n$\n540 \n$\n11 \n2.0 \n%\nDiluted earnings per share (GAAP)\n$\n0.99 \n$\n0.99 \n$\n— \n— \n%\n31\n13-Week Period Ended Sep. 27, 2025\n13-Week Period Ended Sep. 28, 2024\nChange in Dollars\n%/bps  Change\nImpact of restructuring and transformational project costs \n(2)\n0.12 \n0.05 \n0.07 \nNM\nImpact of acquisition-related costs \n(3)\n0.09 \n0.08 \n0.01 \n12.5 \nTax impact of restructuring and transformational project costs \n(4)\n(0.03)\n(0.01)\n(0.02)\nNM\nTax impact of acquisition-related costs \n(4)\n(0.02)\n(0.02)\n— \n— \nDiluted earnings per share adjusted for Certain Items (Non-GAAP) \n(5)\n$\n1.15 \n$\n1.09 \n$\n0.06 \n5.5 \n%\n(1)\nRepresents a constant currency adjustment, which eliminates the impact of foreign currency fluctuations on the current year results. \n(2)\nFiscal 2026 includes $10 million related to restructuring and severance charges and $46 million related to various transformation initiative costs, primarily consisting of supply chain transformation costs and changes to our business technology strategy. Fiscal 2025 includes $4 million related to restructuring and severance charges and $23 million related to various transformation initiative costs, primarily consisting of supply chain transformation costs and changes to our business technology strategy.\n(3)\nFiscal 2026 includes $31 million of intangible amortization expense and $11 million in acquisition and due diligence costs. Fiscal 2025 includes $32 million of intangible amortization expense and $6 million in acquisition and due diligence costs. \n(4)\nThe tax impact of adjustments for Certain Items are calculated by multiplying the pretax impact of each Certain Item by the statutory rates in effect for each jurisdiction where the Certain Item was incurred. \n(5)\nIndividual components of diluted earnings per share may not equal the total presented when added due to rounding. Total diluted earnings per share is calculated using adjusted net earnings divided by diluted shares outstanding.\nNM\nRepresents that the percentage change is not meaningful.\n32\n13-Week Period Ended Sep. 27, 2025\n13-Week Period Ended Sep. 28, 2024\nChange in Dollars\n%/bps Change\nU.S. FOODSERVICE OPERATIONS\nOperating expenses (GAAP)\n$\n1,943 \n$\n1,839 \n$\n104 \n5.7 \n%\nImpact of restructuring and transformational project costs\n (1)\n(7)\n(5)\n(2)\n(40.0)\nImpact of acquisition-related costs \n(2)\n(29)\n(12)\n(17)\nNM\nOperating expenses adjusted for Certain Items (Non-GAAP)\n$\n1,907 \n$\n1,822 \n$\n85 \n4.7 \n%\nOperating income (GAAP)\n$\n880 \n$\n908 \n$\n(28)\n(3.1)\n%\nImpact of restructuring and transformational project costs \n(1)\n7 \n5 \n2 \n40.0 \nImpact of acquisition-related costs \n(2)\n29 \n12 \n17 \nNM\nOperating income adjusted for Certain Items (Non-GAAP)\n$\n916 \n$\n925 \n$\n(9)\n(1.0)\n%\nINTERNATIONAL FOODSERVICE OPERATIONS\nSales (GAAP)\n$\n3,966 \n$\n3,794 \n$\n172 \n4.5 \n%\nImpact of Mexico joint venture sales\n— \n(117)\n117 \n3.4 \nComparable sales excluding Mexico joint venture (Non-GAAP)\n$\n3,966 \n$\n3,677 \n$\n289 \n7.9 \n%\nSales (GAAP)\n$\n3,966 \n$\n3,794 \n$\n172 \n4.5 \n%\nImpact of currency fluctuations \n(3)\n(91)\n(91)\n(2.4)\nComparable sales using a constant currency basis (Non-GAAP)\n$\n3,875 \n$\n3,794 \n$\n81 \n2.1 \n%\nGross profit (GAAP)\n$\n826 \n$\n774 \n$\n52 \n6.7 \n%\nImpact of currency fluctuations \n(3)\n(24)\n(24)\n(3.1)\nComparable gross profit using a constant currency basis (Non-GAAP)\n$\n802 \n$\n774 \n$\n28 \n3.6 \n%\nGross margin (GAAP)\n20.83 \n%\n20.40 \n%\n43 bps\nImpact of currency fluctuations \n(3)\n(0.13)\n-13 bps\nComparable gross margin using a constant currency basis (Non-GAAP)\n20.70 \n%\n20.40 \n%\n30 bps\nOperating expenses (GAAP)\n$\n712 \n$\n673 \n$\n39 \n5.8 \n%\nImpact of restructuring and transformational project costs \n(4)\n(23)\n(12)\n(11)\n(91.7)\nImpact of acquisition-related costs \n(5)\n(10)\n(17)\n7 \n41.2 \nOperating expenses adjusted for Certain Items (Non-GAAP)\n679 \n644 \n35 \n5.4 \nImpact of currency fluctuations \n(3)\n(23)\n(23)\n(3.5)\nComparable operating expenses adjusted for Certain Items using a constant currency basis (Non-GAAP)\n$\n656 \n$\n644 \n$\n12 \n1.9 \n%\nOperating income (GAAP)\n$\n114 \n$\n101 \n$\n13 \n12.9 \n%\nImpact of restructuring and transformational project costs \n(4)\n23 \n12 \n11 \n91.7 \nImpact of acquisition-related costs \n(5)\n10 \n17 \n(7)\n(41.2)\nOperating income adjusted for Certain Items (Non-GAAP)\n147 \n130 \n17 \n13.1 \nImpact of currency fluctuations \n(3)\n(1)\n(1)\n(0.8)\nComparable operating income adjusted for Certain Items using a constant currency basis (Non-GAAP)\n$\n146 \n$\n130 \n$\n16 \n12.3 \n%\nSYGMA\nOperating expenses (GAAP)\n$\n145 \n$\n145 \n$\n— \n— \n%\nOperating income (GAAP)\n25 \n18 \n7 \n38.9 \nOTHER\nOperating expenses (GAAP)\n$\n64 \n$\n63 \n$\n1 \n1.6 \n%\nOperating income (GAAP)\n4 \n9 \n(5)\n(55.6)\n33\n13-Week Period Ended Sep. 27, 2025\n13-Week Period Ended Sep. 28, 2024\nChange in Dollars\n%/bps Change\nGLOBAL SUPPORT CENTER\nGross profit (loss) (GAAP)\n$\n14 \n$\n(3)\n$\n17 \nNM\nOperating expenses (GAAP)\n$\n237 \n$\n225 \n$\n12 \n5.3 \n%\nImpact of restructuring and transformational project costs \n(6)\n(26)\n(10)\n(16)\nNM\nImpact of acquisition-related costs \n(7)\n(3)\n(9)\n6 \n66.7 \nOperating expenses adjusted for Certain Items (Non-GAAP)\n$\n208 \n$\n206 \n$\n2 \n1.0 \n%\nOperating loss (GAAP)\n$\n(223)\n$\n(228)\n$\n5 \n2.2 \n%\nImpact of restructuring and transformational project costs \n(6)\n26 \n10 \n16 \nNM\nImpact of acquisition-related costs \n(7)\n3 \n9 \n(6)\n(66.7)\nOperating loss adjusted for Certain Items (Non-GAAP)\n$\n(194)\n$\n(209)\n$\n15 \n7.2 \n%\n \n(1)\nPrimarily represents severance and transformation initiative costs.\n(2)\nFiscal 2026 and fiscal 2025 include intangible amortization expense and acquisition costs. \n(3)\nRepresents a constant currency adjustment, which eliminates the impact of foreign currency fluctuations on current year results.\n(4)\nIncludes restructuring and transformation costs primarily in Europe.\n(5)\nPrimarily represents intangible amortization expense and acquisition costs.\n(6)\nIncludes various transformation initiative costs, primarily consisting of changes to our business technology strategy.\n(7)\nRepresents due diligence costs.\nNM\nRepresents that the percentage change is not meaningful.\n34\nEBITDA and Adjusted EBITDA\nEBITDA and adjusted EBITDA should not be used as a substitute for the most comparable GAAP measure in assessing Sysco’s overall financial performance for the periods presented. An analysis of any non-GAAP financial measure should be used in conjunction with results presented in accordance with GAAP. See Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Key Performance Indicators” contained in our fiscal 2025 Form 10-K for discussions regarding this non-GAAP performance metric. Set forth below is a reconciliation of actual net earnings to EBITDA and to adjusted EBITDA results for the periods presented (dollars in millions): \n13-Week Period Ended Sep. 27, 2025\n13-Week Period Ended Sep. 28, 2024\nChange in Dollars\n% Change\nNet earnings (GAAP)\n$\n476 \n$\n490 \n$\n(14)\n(2.9)\n%\nInterest (GAAP)\n172 \n160 \n12 \n7.5 \nIncome taxes (GAAP)\n124 \n152 \n(28)\n(18.4)\nDepreciation and amortization (GAAP)\n233 \n235 \n(2)\n(0.9)\nEBITDA (Non-GAAP)\n$\n1,005 \n$\n1,037 \n$\n(32)\n(3.1)\n%\nCertain Item adjustments:\nImpact of restructuring and transformational project costs \n(1)\n$\n54 \n$\n26 \n$\n28 \nNM\nImpact of acquisition-related costs \n(2)\n11 \n6 \n5 \n83.3 \nEBITDA adjusted for Certain Items (Non-GAAP) \n(3)\n$\n1,070 \n$\n1,069 \n$\n1 \n0.1 \n%\nOther expense (income), net \n28 \n6 \n22 \nNM\nDepreciation and amortization, as adjusted (Non-GAAP) \n(4)\n(200)\n(202)\n2 \n1.0 \nOperating income adjusted for Certain Items (Non-GAAP) \n$\n898 \n$\n873 \n$\n25 \n2.9 \n%\n(1)\nFiscal 2026 and fiscal 2025 include charges related to restructuring and severance, as well as various transformation initiative costs, primarily consisting of supply chain transformation costs and changes to our business technology strategy, excluding charges related to accelerated depreciation. \n(2)\nFiscal 2026 and fiscal 2025 include acquisition and due diligence costs.\n(3)\nIn arriving at adjusted EBITDA, Sysco does not adjust out interest income of $6 million and $7 million or non-cash stock compensation expense of $31 million and $30 million in fiscal 2026 and fiscal 2025, respectively.\n(4)\nFiscal 2026 includes $233 million in GAAP depreciation and amortization expense, less $33 million of Non-GAAP depreciation and amortization expense primarily related to acquisitions. Fiscal 2025 includes $235 million in GAAP depreciation and amortization expense, less $33 million of Non-GAAP depreciation and amortization expense primarily related to acquisitions.\nNM\nRepresents that the percentage change is not meaningful.\nLiquidity and Capital Resources\nHighlights \nWe produced negative free cash flow of $50 million in the first 13 weeks of fiscal 2026, as compared to positive free cash flow of $8 million in the first 13 weeks of fiscal 2025. The decrease in free cash flow is attributable to a decrease in proceeds from sales of plant and equipment and an increase in capital expenditures, partially offset by an increase in cash provided by operating activities. In the table that follows, free cash flow for each period presented is reconciled to net cash provided by operating activities and comparisons of the significant cash flows from the first 13 weeks of fiscal 2026 to the first 13 weeks of fiscal 2025 are provided. \n35\n \n13-Week Period Ended Sep. 27, 2025\n13-Week Period Ended Sep. 28, 2024\nSource of cash (use of cash)\n(In millions)\nNet cash provided by operating activities (GAAP)\n$\n86 \n$\n53 \nAdditions to plant and equipment\n(160)\n(122)\nProceeds from sales of plant and equipment\n24 \n77 \nFree Cash Flow (Non-GAAP) \n(1)\n$\n(50)\n$\n8 \nDebt borrowings (repayments), net\n$\n36 \n$\n199 \nStock repurchases\n— \n(108)\nDividends paid\n(259)\n(251)\n(1)\nFree cash flow should not be used as a substitute for the most comparable GAAP measure in assessing the company’s liquidity for the periods presented. An analysis of any non-GAAP financial measure should be used in conjunction with results presented in accordance with GAAP. See Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Key Performance Indicators” contained in our fiscal 2025 Form 10-K for discussions regarding this non-GAAP performance metric.\nSources and Uses of Cash\nSysco generates cash in the U.S. and internationally. As of September 27, 2025, we had $844 million in cash and cash equivalents, approximately 70% of which was held by our international subsidiaries. Sysco’s strategic objectives are funded primarily by cash from operations and external borrowings. Traditionally, our operations have produced significant cash flow. Due to our strong financial position, we believe we will continue to be able to effectively access capital markets, as needed. Cash is generally allocated to working capital requirements, investments compatible with our overall growth strategy (organic and inorganic), debt management, and shareholder return. The remaining cash balances are invested in high-quality, short-term instruments. \nWe believe our cash flow from operations, the availability of liquidity under our commercial paper programs and our revolving credit facility, and our ability to access capital from financial markets will be sufficient to meet our anticipated cash requirements for more than the next 12 months, while maintaining sufficient liquidity for normal operating purposes. \nCash Flows\nOperating Activities\nWe generated $86 million in cash flows from operations in the first 13 weeks of fiscal 2026, compared to cash flows from operations of $53 million in the first 13 weeks of fiscal 2025. In the first 13 weeks of fiscal 2026, these amounts included year-over-year favorable comparisons on working capital of $85 million due to favorable comparisons on accounts receivable and accounts payable, partially offset by an unfavorable comparison in inventory. Accrued expenses also had a favorable comparison, primarily related to lower payments of accrued incentive compensation in the first 13 weeks of fiscal 2026 in comparison to the first 13 weeks of fiscal 2025. Income tax payments negatively impacted cash flows from operations, as estimated payments made in the first 13 weeks of fiscal 2026 were higher compared to the first 13 weeks of fiscal 2025. \nInvesting Activities\nOur capital expenditures in the first 13 weeks of fiscal 2026 consisted primarily of investments in buildings and building improvements, technology equipment, warehouse equipment, and fleet. Our capital expenditures in the first 13 weeks of fiscal 2026 were $38 million higher than in the first 13 weeks of fiscal 2025, primarily due to timing of capital spending. Proceeds from sales of plant and equipment were $24 million in the first 13 weeks of fiscal 2026, as compared to $77 million in the first 13 weeks of fiscal 2025.\n36\nFinancing Activities\nEquity Transactions\nProceeds from exercises of share-based compensation awards were $43 million in the first 13 weeks of fiscal 2026, as compared to $29 million in the first 13 weeks of fiscal 2025. The level of option exercises, and thus proceeds, will vary from period to period and is largely dependent on movements in our stock price and the time remaining before option grants expire.\nIn May 2021, our Board of Directors approved a share repurchase program to authorize the repurchase of up to $5.0 billion of the company’s common stock, which will remain available until fully utilized. We repurchased no shares during the first 13 weeks of fiscal 2026. As of September 27, 2025, we had a remaining authorization of approximately $1.5 billion. We repurchased no additional shares under our authorization from the end of our fiscal first quarter through October 10, 2025.\nDividends paid in the first 13 weeks of fiscal 2026 were $259 million, or $0.54 per share, as compared to $251 million, or $0.51 per share, in the first 13 weeks of fiscal 2025. In August 2025, we declared our regular quarterly dividend for the first quarter of fiscal 2026 of $0.54 per share, which was paid in October 2025.  \nDebt Activity and Borrowing Availability\nOur debt activity, including issuances and repayments, if any, and our borrowing availability are described in Note 7, “Debt,” in the Notes to Consolidated Financial Statements in Item 1 of Part I of this Form 10-Q. Our outstanding borrowings as of September 27, 2025 are also disclosed within that note.\nGuarantor Summarized Financial Information\nOn January 19, 2011, the wholly owned U.S. Broadline subsidiaries of Sysco Corporation, which distribute a full line of food products and a wide variety of non-food products, entered into full and unconditional guarantees of all outstanding senior notes and debentures of Sysco Corporation. All subsequent issuances of senior notes and debentures in the U.S. and borrowings under the company’s $3.0 billion long-term revolving credit facility have also been guaranteed by these subsidiaries. As of September 27, 2025, Sysco had a total of $11.8 billion in senior notes, debentures and borrowings under the long-term revolving credit facility that were guaranteed by these subsidiary guarantors. Our remaining consolidated subsidiaries (non-guarantor subsidiaries) are not obligated under the senior notes indenture, debentures indenture or our long-term revolving credit facility. See Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Liquidity and Capital Resources” contained in our fiscal 2025 Form 10-K for additional information regarding the terms of the guarantees.\nBasis of Preparation of the Summarized Financial Information \nThe summarized financial information of Sysco Corporation (issuer), and certain wholly owned U.S. Broadline subsidiaries (guarantors) (together, the obligor group) is presented on a combined basis with intercompany balances and transactions between entities in the obligor group eliminated. Investments in and equity in the earnings of our non-guarantor subsidiaries, which are not members of the obligor group, have been excluded from the summarized financial information. The obligor group’s amounts due to, amounts due from and transactions with non-guarantor subsidiaries have been presented in separate line items, if they are material to the obligor financials.\n \nThe following tables include summarized financial information of the obligor group for the periods presented.\n37\nCombined Parent and Guarantor Subsidiaries Summarized Balance Sheet\nSep. 27, 2025\nJun. 28, 2025\n(In millions)\nASSETS\nReceivables due from non-obligor subsidiaries\n$\n384 \n$\n377 \nCurrent assets\n6,348 \n6,015 \nTotal current assets\n$\n6,732 \n$\n6,392 \nNotes receivable from non-obligor subsidiaries \n$\n62 \n$\n20 \nOther noncurrent assets\n5,266 \n5,211 \nTotal noncurrent assets\n$\n5,328 \n$\n5,231 \nLIABILITIES\nPayables due to non-obligor subsidiaries \n$\n55 \n$\n61 \nOther current liabilities \n4,166 \n3,214 \nTotal current liabilities\n$\n4,221 \n$\n3,275 \nNotes payable to non-obligor subsidiaries\n$\n405 \n$\n334 \nLong-term debt\n10,898 \n11,890 \nOther noncurrent liabilities\n1,634 \n1,538 \nTotal noncurrent liabilities\n$\n12,937 \n$\n13,762 \nCombined Parent and Guarantor Subsidiaries Summarized Results of Operations\n13-Week Period Ended Sep. 27, 2025\n(In millions)\nSales\n$\n12,921 \nGross profit\n2,314 \nOperating income\n615 \nInterest expense from non-obligor subsidiaries\n35 \nNet earnings\n401 \nCritical Accounting Estimates\nCritical accounting estimates are those that are most important to the portrayal of our financial position and results of operations. These require our most subjective or complex judgments, often employing the use of estimates about the effect of matters that are inherently uncertain. We have reviewed with the Audit Committee of the Board of Directors the development and selection of the critical accounting estimates and this related disclosure. Our most critical accounting estimates pertain to goodwill and intangible assets, income taxes and company-sponsored pension plans, which are described in Item 7 of our fiscal 2025 Form 10-K.\nForward-Looking Statements\nCertain statements made herein that look forward in time or express management’s expectations or beliefs with respect to the occurrence of future events are forward-looking statements under the Private Securities Litigation Reform Act of 1995. Forward-looking statements provide current expectations of future events based on certain assumptions and include any statement that does not directly relate to any historical or current fact. Forward-looking statements can also be identified by words such as “future,” “anticipates,” “believes,” “estimates,” “expects,” “intends,” “plans,” “predicts,” “will,” “would,” “could,” “can,” “may,” “projected,” “continues,” “continuously,” variations of such terms, and similar terms and phrases denoting anticipated or expected occurrences or results. This report contains various statements relating to future financial performance and results, business strategy, plans, goals and objectives, including certain outlook, business trends, our dividend and share repurchase programs, our expectation of future macroeconomic conditions and other statements that are not historical facts.\n38\nThese statements are based on management’s current expectations and estimates; actual results may differ materially due in part to the risk factors set forth below, those within Part II, Item 1A of this Form 10-Q and those discussed in Item 1A of our fiscal 2025 Form 10-K:\n•\nthe risk that if sales from our locally managed customers do not grow at the same rate as sales from multi-unit customers, our gross margins may decline; \n•\nthe risk that economic uncertainties can negatively impact consumer confidence and negatively impact foot traffic to restaurants;\n•\nperiods of significant or prolonged inflation or deflation and their impact on our product costs and profitability generally, and our inability to predict inflation over the long term;\n•\nthe risk that our efforts to modify truck routing in order to reduce outbound transportation costs may be unsuccessful;\n•\nthe risk that we that we may not realize anticipated benefits from our operating cost reduction efforts, including our ability to accelerate and/or identify additional administrative cost savings; \n•\nrisks related to unfavorable conditions in the Americas and Europe and the impact on our results of operations and financial condition;\n•\nthe risks related to our efforts to implement our transformation initiatives and meet our other long-term strategic objectives, including the risk that these efforts may not provide the expected benefits in our anticipated time frame, if at all, and may prove costlier than expected;\n•\nthe risk that competition in our industry and the impact of GPOs may adversely impact our margins and our ability to retain customers and make it difficult for us to maintain our market share, growth rate and profitability;\n•\nthe risk that our relationships with long-term customers may be materially diminished or terminated; \n•\nthe risk that changes in consumer eating habits could materially and adversely affect our business, financial condition, or results of operations;\n•\nthe impact and effects of public health crises, pandemics and epidemics, and the adverse impact thereof on our business, financial condition and results of operations;\n•\nthe risk that we may not be able to fully compensate for increases in fuel costs, and forward purchase commitments intended to contain fuel costs could result in above market fuel costs;\n•\nthe risk of interruption of supplies and increase in product costs as a result of conditions beyond our control;\n•\nthe potential impact on our reputation and earnings of adverse publicity or lack of confidence in our products;\n•\nrisks related to unfavorable changes to the mix of locally managed customers versus corporate-managed customers;\n•\ndifficulties in successfully expanding into international markets and complimentary lines of business;\n•\nthe potential impact of product liability claims;\n39\n•\nthe risk that we fail to comply with requirements imposed by applicable law or government regulations, including but not limited to those related to environmental and tax and accounting laws, rules and regulations;\n•\nrisks related to our ability to effectively finance and integrate acquired businesses;\n•\nrisks related to our access to borrowed funds in order to grow and any default by us under our indebtedness that could have a material adverse impact on cash flow and liquidity;\n•\nour level of indebtedness and the terms of our indebtedness could adversely affect our business and liquidity position;\n•\nthe risk that we may not be able to effectively execute our capital allocation framework;\n•\nthe risk that divestiture of one or more of our businesses may not provide the anticipated effects on our operations;\n•\nrisks related to our ability to return capital to stockholders, including those related to the timing and amounts (including any plans or commitments in respect thereof) of any dividends and share repurchases; \n•\ndue to our reliance on technology, any technology disruption or delay in implementing new technology could have a material negative impact on our business;\n•\nthe risk of negative impacts to our business and our relationships with customers from a cybersecurity incident and/or other technology disruptions;\n•\nrisks related to our ability to attract, motivate and retain employees, including key personnel;\n•\nrisks related to labor issues, including the renegotiation of union contracts and shortage of qualified labor; and\n•\nthe risk that the exclusive forum provisions in our amended and restated bylaws could limit our stockholders’ ability to obtain a favorable judicial forum for disputes with us or our directors, officers or employees.\nIn light of the significant risks and uncertainties inherent in the forward-looking statements included herein, the inclusion of such information should not be regarded as a representation by us or any other person that such results will be achieved, and readers are cautioned not to place undue reliance on such forward-looking statements, which speak only as of the date hereof. Except as required by law, we undertake no obligation to revise the forward-looking statements contained herein to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events. You should read this Form 10-Q, our fiscal 2025 Form 10-K and the documents we file with the SEC, with the understanding that our actual future results, levels of activity, performance and achievements may be materially different from what we expect. We qualify all of our forward-looking statements by the cautionary statements referenced above."
}