{
  "item1": "Sysco Corporation, acting through its subsidiaries divisions, largest global distributor food related products primarily foodservice food-away-from-home industry. purpose “Connecting World Share Food Care One Another.” provided products related services approximately 730,000 customer locations, including restaurants, healthcare educational facilities, lodging establishments other foodservice customers during fiscal 2025. Founded 1969, Sysco commenced operations public company March 1970 when stockholders nine companies exchanged stock Sysco common stock. Since formation, grown $115 million all-time high $81.4 billion annual sales fiscal 2025, both through internal expansion existing operations acquisitions.",
  "item7": "(Dollars millions) Adjusted operating expenses (Non-GAAP) Adjusted operating income (Non-GAAP) Comparable sales using constant currency basis (Non-GAAP) Comparable gross profit using constant currency basis (Non-GAAP) Comparable operating expenses adjusted Certain Items using constant currency basis (Non-GAAP) Comparable operating income adjusted Certain Items using constant currency basis (Non-GAAP) See “Non-GAAP Reconciliations” below. following table sets forth percentage dollar value increase decrease sales over comparable prior year period order demonstrate cause magnitude change. (Dollars millions) Impact divestiture Total change sales Sales increased 2.4% fiscal 2025 compared fiscal 2024, primarily due higher inflation local case growth. Excluding impact Mexico joint venture, which divested during second quarter fiscal 2025, sales increased 4.8% fiscal 2025 compared fiscal 2024.",
  "item2": "following tables include summarized financial information obligor group periods presented. Combined Parent Guarantor Subsidiaries Summarized Balance Sheet ASSETS Receivables due non-obligor subsidiaries Total current assets Notes receivable non-obligor subsidiaries Other noncurrent assets Total noncurrent assets LIABILITIES Payables due non-obligor subsidiaries Other current liabilities Total current liabilities Notes payable non-obligor subsidiaries Other noncurrent liabilities Total noncurrent liabilities Combined Parent Guarantor Subsidiaries Summarized Results Operations 13-Week Period Ended Sep. 27, 2025 Interest expense non-obligor subsidiaries Critical Accounting Estimates Forward-Looking Statements Certain statements made herein look forward time express management’s expectations beliefs respect occurrence future events forward-looking statements under Private Securities Litigation Reform Act 1995. Forward-looking statements provide current expectations future events based certain assumptions include any statement does not directly relate any historical current fact."
}