{
  "source_file": "t-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nDollars in millions except per share amounts\nOVERVIEW\nAT&T Inc. is referred to as “we,” “AT&T” or the “Company” throughout this document. AT&T products and services are provided or offered by subsidiaries and affiliates of AT&T Inc. under the AT&T brand and not by AT&T Inc., and the names of the particular subsidiaries and affiliates providing the services generally have been omitted. AT&T is a holding company whose subsidiaries and affiliates operate worldwide in the telecommunications and technology industries. You should read this discussion in conjunction with the consolidated financial statements and accompanying notes (Notes).\nWe have two reportable segments: Communications and Latin America. Our segment results presented in Note 4 and discussed below follow our internal management reporting. Percentage increases and decreases that are not considered meaningful are denoted with a dash.\n \nThird Quarter\nNine-Month Period\n \n \n \nPercent\n \n \nPercent\n \n2025\n2024\nChange\n2025\n2024\nChange\nOperating Revenues\n \n \n \n \n \n \nCommunications\n$\n29,516\n \n$\n29,074 \n1.5 \n%\n$\n88,775\n \n$\n86,513 \n2.6 \n%\nLatin America\n1,095\n \n1,022 \n7.1 \n3,120\n \n3,188 \n(2.1)\nCorporate\n98\n \n117 \n(16.2)\n287\n \n337 \n(14.8)\nAT&T Operating Revenues\n$\n30,709\n \n$\n30,213 \n1.6 \n%\n$\n92,182\n \n$\n90,038 \n2.4 \n%\nOperating Income (Loss)\n \n \n \n \nCommunications\n$\n7,096\n \n$\n7,156 \n(0.8)\n%\n$\n21,152\n \n$\n20,906 \n1.2 \n%\nLatin America\n22\n \n10 \n— \n111\n \n19 \n— \nSegment Operating Income\n7,118\n \n7,166 \n(0.7)\n21,263\n \n20,925 \n1.6 \nCorporate\n(564)\n(654)\n13.8 \n(1,868)\n(2,119)\n11.8 \nCertain significant items\n(435)\n(4,396)\n90.1 \n(1,021)\n(5,083)\n79.9 \nAT&T Operating Income\n$\n6,119\n \n$\n2,116 \n— \n%\n$\n18,374\n \n$\n13,723 \n33.9 \n%\nThe \nCommunications segment\n provides services to businesses and consumers located in the U.S. and businesses globally. Our business strategies reflect integrated product offerings that cut across product lines and utilize shared assets. This segment contains the following business units:\n•\nMobility\n provides nationwide wireless service and equipment.\n•\nBusiness Wireline\n provides advanced ethernet-based fiber services, fixed wireless services, IP Voice and managed professional services, as well as legacy voice and data services and related equipment, to business customers.\n•\nConsumer Wireline\n provides broadband services, including fiber connections that provide multi-gig services, and AT&T Internet Air (AIA) services, to residential customers in select locations. Consumer Wireline also provides legacy telephony voice communication services.\nThe \nLatin America segment\n provides wireless services and equipment in Mexico.\n28\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nRESULTS OF OPERATIONS\n \nConsolidated Results\n Our financial results are summarized in the discussions that follow. Additional analysis is discussed in our “Segment Results” section. \n \nThird Quarter\nNine-Month Period\n \n \n \nPercent\n \n \nPercent\n \n2025\n2024\nChange\n2025\n2024\nChange\nOperating Revenues\n \n \n \n \n \n \nService\n$\n25,336\n \n$\n25,134 \n0.8 \n%\n$\n75,766\n \n$\n74,982 \n1.0 \n%\nEquipment\n5,373\n \n5,079 \n5.8 \n16,416\n \n15,056 \n9.0 \nTotal Operating Revenues\n30,709\n \n30,213 \n1.6 \n92,182\n \n90,038 \n2.4 \nOperating Expenses\n \n \n \n \nOperations and support\n19,273\n \n23,010 \n(16.2)\n58,050\n \n61,109 \n(5.0)\nDepreciation and amortization\n5,317\n \n5,087 \n4.5 \n15,758\n \n15,206 \n3.6 \nTotal Operating Expenses\n24,590\n \n28,097 \n(12.5)\n73,808\n \n76,315 \n(3.3)\nOperating Income\n6,119\n \n2,116 \n— \n18,374\n \n13,723 \n33.9 \nInterest expense\n1,700\n \n1,675 \n1.5 \n5,013\n \n5,098 \n(1.7)\nEquity in net income (loss) of affiliates\n(20)\n272 \n— \n1,905\n \n915 \n— \nOther income (expense) — net\n6,254\n \n717 \n— \n7,476\n \n1,850 \n— \nIncome Before Income Taxes\n10,653\n \n1,430 \n— \n22,742\n \n11,390 \n99.7 \nNet Income\n9,677\n \n145 \n— \n19,230\n \n7,845 \n— \nNet Income (Loss) Attributable\nto AT&T\n9,314\n \n(174)\n— \n18,165\n \n6,868 \n— \nNet Income (Loss) Attributable to\nCommon Stock\n$\n9,278\n \n$\n(226)\n— \n%\n$\n18,137\n \n$\n6,715 \n— \n%\nOperating revenues\n increased in the third quarter and for the first nine months of 2025, \nreflecting higher Mobility and Consumer Wireline revenues, partially offset by declines in Business Wireline. Operating revenues in Mexico were higher in the third quarter but lower for the first nine months, reflecting unfavorable foreign exchange impacts during the first half of 2025\n.\nOperations and support expenses\n decreased in the third quarter and for the first nine months of 2025, primarily due to a $4,422 noncash goodwill impairment recorded in 2024. Also contributing to lower operating expenses were expense declines from our continued transformation efforts, lower content licensing fees and lower year-to-date restructuring costs. Partially offsetting these declines were higher Mobility equipment costs resulting from increased wireless equipment sales volumes, higher network-related costs and approximately $440 of apportioned legal settlements during the third quarter of 2025.\nDepreciation and amortization\n expense increased in the third quarter and for the first nine months of 2025, primarily due to ongoing capital spending for strategic initiatives such as fiber and network upgrades, partially offset by lower depreciation impacts from our Open RAN network modernization efforts. We expect fourth-quarter 2025 depreciation expense to be lower than the comparable prior-year quarter, and full-year expense to be consistent with the prior year as certain legacy assets become fully depreciated.\nOperating income\n increased in the third quarter and for the first nine months of 2025. Our operating income margin in the third quarter increased from 7.0% in 2024 to 19.9% in 2025 and for the first nine months increased from 15.2% in 2024 to 19.9% in 2025.\nInterest expense \nincreased in the third quarter and decreased for the first nine months of 2025. The increase in the third quarter was primarily due to lower capitalized interest associated with spectrum acquisitions. The decrease for the first nine months was \n29\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nprimarily due to lower average debt balances, partially offset by lower capitalized interest associated with spectrum acquisitions.\nEquity in net income (loss) of affiliates\n decreased in the third quarter and increased for the first nine months of 2025. The decrease for the quarter is primarily due to the sale of our interest in DIRECTV to TPG Capital on July 2, 2025. The increase for the first nine months is attributable to the cash distributions received by AT&T in excess of the carrying amount of our investment in DIRECTV prior to disposition (see Note 9).\nOther income (expense) – net\n increased in the third quarter and for the first nine months of 2025. The increase in the quarter was primarily due to a gain of approximately $5,500 recognized on the sale of our interest in DIRECTV (see Note 9). For the first nine months, the increase was also driven by a second-quarter 2025 gain on a prior disposition and first-quarter 2024 noncash impairment charges for a held-for-sale business and our SKY Mexico equity investment. Partially offsetting the increases in the quarter and for the first nine months were lower pension and postretirement benefit credits and lower returns on other benefit-related investments. \nIncome tax expense\n decreased in the third quarter and for the first nine months of 2025, primarily due to a lower effective tax rate driven by a tax-free gain on sale of DIRECTV in 2025 and a goodwill impairment in 2024, which is not deductible for tax purposes.\nOur effective tax rate was 9.2% in the third quarter and 15.4% for the first nine months of 2025, versus 89.9% and 31.1% in the comparable periods in the prior year, reflecting the nonrecognition of income taxes on the DIRECTV gain and larger discrete state tax benefits in 2025, and the goodwill impairment in 2024, which was not deductible for tax purposes.\nSegment Results \nOur segments are comprised of strategic business units or other operations that offer products and services to different customer segments over various technology platforms and/or in different geographies that are managed accordingly. We evaluate segment performance based on operating income as well as EBITDA and/or EBITDA margin. See “Discussion and Reconciliation of Non-GAAP Measures” for a reconciliation of EBITDA and EBITDA margin to the most comparable financial measures calculated and presented in accordance with U.S. generally accepted accounting principles (GAAP).\nCOMMUNICATIONS SEGMENT\nThird Quarter\nNine-Month Period\n \n \n \nPercent\n \n \nPercent\n \n2025\n2024\nChange\n2025\n2024\nChange\nSegment Operating Revenues\n \n \n \n \n \n \nMobility\n$\n21,713\n \n$\n21,052 \n3.1 \n%\n$\n65,128\n \n$\n62,126 \n4.8 \n%\nBusiness Wireline\n4,248\n \n4,606 \n(7.8)\n13,029\n \n14,274 \n(8.7)\nConsumer Wireline\n3,555\n \n3,416 \n4.1 \n10,618\n \n10,113 \n5.0 \nTotal Segment Operating Revenues\n$\n29,516\n \n$\n29,074 \n1.5 \n%\n$\n88,775\n \n$\n86,513 \n2.6 \n%\nSegment Operating Income (Loss)\n \n \n \n \nMobility\n$\n7,125\n \n$\n7,003 \n1.7 \n%\n$\n20,796\n \n$\n20,190 \n3.0 \n%\nBusiness Wireline\n(354)\n(43)\n— \n(653)\n123 \n— \nConsumer Wireline\n325\n \n196 \n65.8 \n1,009\n \n593 \n70.2 \nTotal Segment Operating Income\n$\n7,096\n \n$\n7,156 \n(0.8)\n%\n$\n21,152\n \n$\n20,906 \n1.2 \n%\nOperating revenues\n increased in the third quarter and for the first nine months of 2025, primarily driven by increases in our Mobility and Consumer Wireline business units, partially offset by declines in our Business Wireline business unit, which reflects lower demand for legacy services.\n \nOperating income \ndecreased in the third quarter and increased for the first nine months of 2025. Our Communications segment operating income margin in the third quarter decreased from 24.6% in 2024 to 24.0% in 2025 and for the first nine months decreased from 24.2% in 2024 to 23.8% in 2025. Our Communications EBITDA margin in the third quarter remained consistent at 41.2% in 2024 and 2025 and for the first nine months increased from 40.7% in 2024 to 40.8% in 2025. \n30\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nCommunications Business Unit Discussion\nMobility Results\n \n \n \n \n \n \n \nThird Quarter\nNine-Month Period\n \n \n \nPercent\n \n \nPercent\n \n2025\n2024\nChange\n2025\n2024\nChange\nOperating revenues\n \n \n \n \n \n \nService\n$\n16,926\n \n$\n16,539 \n2.3 \n%\n$\n50,430\n \n$\n48,810 \n3.3 \n%\nEquipment\n4,787\n \n4,513 \n6.1 \n14,698\n \n13,316 \n10.4 \nTotal Operating Revenues\n21,713\n \n21,052 \n3.1 \n65,128\n \n62,126 \n4.8 \nOperating expenses\n \n \n \n \nOperations and support\n12,011\n \n11,559 \n3.9 \n36,673\n \n34,483 \n6.4 \nDepreciation and amortization\n2,577\n \n2,490 \n3.5 \n7,659\n \n7,453 \n2.8 \nTotal Operating Expenses\n14,588\n \n14,049 \n3.8 \n44,332\n \n41,936 \n5.7 \nOperating Income\n$\n7,125\n \n$\n7,003 \n1.7 \n%\n$\n20,796\n \n$\n20,190 \n3.0 \n%\nThe following tables highlight other key measures of performance for Mobility:\nSubscribers\n \n \n \n \nSeptember 30,\nPercent\n(in 000s)\n2025\n2024\nChange\nPostpaid\n90,255\n \n88,384 \n2.1 \n%\nPostpaid phone\n73,801\n \n72,285 \n2.1 \nPrepaid\n \n18,544\n \n19,200 \n(3.4)\nReseller\n10,183\n \n8,482 \n20.1 \nTotal Mobility Subscribers\n1\n118,982\n \n116,066 \n2.5 \n%\n1\nWireless subscribers and net additions exclude customers with free lines provided under promotional pricing until such lines are converted to paying lines.\n31\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nMobility Net Additions\n \n \n \n \n \n \n \nThird Quarter\nNine-Month Period\n \n \n \nPercent\n \n \nPercent\n(in 000s)\n2025\n2024\nChange\n2025\n2024\nChange\nPostpaid Phone Net Additions\n405\n \n403 \n0.5 \n%\n1,130\n \n1,171 \n(3.5)\n%\nTotal Phone Net Additions\n322\n \n358 \n(10.1)\n993\n \n1,162 \n(14.5)\nPostpaid\n1\n328\n \n429 \n(23.5)\n1,097\n \n1,411 \n(22.3)\nPrepaid\n(167)\n(49)\n— \n(353)\n34 \n— \nReseller\n587\n \n237 \n— \n413\n \n910 \n(54.6)\nMobility Net Subscriber Additions\n2, 3\n748\n \n617 \n21.2 \n%\n1,157\n \n2,355 \n(50.9)\n%\nPostpaid Churn\n4\n1.07\n \n%\n0.93 \n%\n14 \nBP\n1.03\n \n%\n0.89 \n%\n14 \nBP\nPostpaid Phone-Only Churn\n4\n0.92\n \n%\n0.78 \n%\n14 \nBP\n0.87\n \n%\n0.73 \n%\n14 \nBP\n1\nIn addition to postpaid phones, includes tablets and wearables and other. Tablet net adds (losses) were (45) and (21) for the quarters ended September 30, 2025 and 2024 and 14 and 31 for the nine months ended September 30, 2025 and 2024. Wearables and other net adds (losses) were (32) and 47 for the quarters ended September 30, 2025 and 2024 and (47) and 209 for the nine months ended September 30, 2025 and 2024. \n2\nExcludes migrations between wireless subscriber categories, including connected devices, and acquisition-related activity during the period.\n3\nWireless subscribers and net additions exclude customers with free lines provided under promotional pricing until such lines are converted to paying lines.\n4\nCalculated by dividing the aggregate number of wireless subscribers who canceled service during a month by the total number of wireless subscribers at the beginning of that month. The churn rate for the period is equal to the average of the churn rate for each month of that period.\nService\n revenue increased in the third quarter and for the first nine months of 2025, largely due to subscriber gains partially offset by promotional activity. Revenue comparisons in the third quarter were also impacted by approximately $90 of one-time noncash revenues related to administrative fees in 2024.\nARPU\nAverage revenue per subscriber (ARPU) decreased in the third quarter and increased for the first nine months of 2025. The decrease in the quarter includes the impact of one-time revenues related to administrative fees in 2024, as well as promotional activity and our success in attracting customers in underpenetrated segments with lower ARPUs, but attractive lifetime values, such as age 55-plus in our “value customers.” The increase for the first nine months was pressured by growth in our base of converged customers, who are typically eligible for service discounts.\n \nChurn\nThe effective management of subscriber churn is critical to our ability to maximize revenue growth and to maintain and improve margins. Postpaid churn and postpaid phone-only churn were higher in the third quarter and for the first nine months of 2025, partially driven by an increase in our customer base that reached the end of device financing periods, which normalized as we exited the quarter. The increase in churn in the quarter was primarily driven by increased competition.\n \nEquipment \nrevenue increased in the third quarter and for the first nine months of 2025, primarily driven by higher wireless device sales volumes.\n \nOperations and support\n expenses increased in the third quarter and for the first nine months of 2025, primarily due to higher equipment costs driven by higher wireless sales volumes. The increase also reflected higher advertising due to the launch of a new campaign in the first quarter, and higher network costs that were partially offset by lower content licensing fees and expense declines from transformation efforts.\n32\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nDepreciation\n expense increased in the third quarter and for the first nine months of 2025, primarily due to ongoing capital spending for network upgrades and expansion, partially offset by lower depreciation impacts from our network modernization efforts.\nOperating income\n increased in the third quarter and for the first nine months of 2025. Our Mobility operating income margin in the third quarter decreased from 33.3% in 2024 to 32.8% in 2025 and for the first nine months decreased from 32.5% in 2024 to 31.9% in 2025. Our Mobility EBITDA margin in the third quarter decreased from 45.1% in 2024 to 44.7% in 2025 and for the first nine months decreased from 44.5% in 2024 to 43.7% in 2025, driven by the increase in low margin equipment revenues.\nBusiness Wireline Results\n \n \n \n \n \n \n \nThird Quarter\nNine-Month Period\n \n \n \nPercent\n \n \nPercent\n \n2025\n2024\nChange\n2025\n2024\nChange\nOperating revenues\n \n \n \n \n \n \nLegacy and other transitional services\n$\n2,208\n \n$\n2,669 \n(17.3)\n%\n$\n7,032\n \n$\n8,505 \n(17.3)\n%\nFiber and advanced connectivity\nservices\n1,853\n \n1,748 \n6.0 \n5,426\n \n5,183 \n4.7 \nEquipment\n187\n \n189 \n(1.1)\n571\n \n586 \n(2.6)\nTotal Operating Revenues\n4,248\n \n4,606 \n(7.8)\n13,029\n \n14,274 \n(8.7)\nOperating expenses\n \n \n \n \nOperations and support\n3,067\n \n3,250 \n(5.6)\n9,128\n \n10,004 \n(8.8)\nDepreciation and amortization\n1,535\n \n1,399 \n9.7 \n4,554\n \n4,147 \n9.8 \nTotal Operating Expenses\n4,602\n \n4,649 \n(1.0)\n13,682\n \n14,151 \n(3.3)\nOperating Income (Loss)\n$\n(354)\n$\n(43)\n— \n%\n$\n(653)\n$\n123 \n— \n%\nLegacy and other transitional services\n revenues decreased in the third quarter and for the first nine months of 2025, driven by lower demand for legacy and VPN services, which we expect to continue. These revenue declines were partially offset by targeted pricing actions in the first quarter of 2025.\nFiber and advanced connectivity services\n revenues increased in the third quarter and for the first nine months of 2025, driven by higher fiber and fixed wireless revenues.\nEquipment\n revenues decreased in the third quarter and for the first nine months of 2025.\n \nOperations and support\n expenses decreased in the third quarter and for the first nine months of 2025, primarily driven by lower personnel and customer support costs associated with ongoing transformation initiatives, which were partially offset by favorable vendor settlements in the prior-year third quarter. As part of our transformation activities, we expect operations and support expense improvements through the remainder of 2025 as we further right size our operations in alignment with the strategic direction of the business.\nDepreciation\n expense increased in the third quarter and for the first nine months of 2025, primarily due to ongoing capital investment for strategic initiatives such as fiber, which we expect to continue through the remainder of 2025.\nOperating income\n decreased in the third quarter and for the first nine months of 2025. Our Business Wireline operating income margin in the third quarter decreased from (0.9)% in 2024 to (8.3)% in 2025 and for the first nine months decreased from 0.9% in 2024 to (5.0)% in 2025. Our Business Wireline EBITDA margin in the third quarter decreased from 29.4% in 2024 to 27.8% in 2025 and for the first nine months remained consistent at 29.9% in 2024 and 2025.\n33\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nConsumer Wireline Results\n \n \n \n \n \n \n \nThird Quarter\nNine-Month Period\n \n \n \nPercent\n \n \nPercent\n \n2025\n2024\nChange\n2025\n2024\nChange\nOperating revenues\n \n \n \n \n \n \nBroadband\n$\n3,070\n \n$\n2,838 \n8.2 \n%\n$\n9,082\n \n$\n8,301 \n9.4 \n%\nLegacy voice and data services\n243\n \n307 \n(20.8)\n794\n \n972 \n(18.3)\nOther service and equipment\n242\n \n271 \n(10.7)\n742\n \n840 \n(11.7)\nTotal Operating Revenues\n3,555\n \n3,416 \n4.1 \n10,618\n \n10,113 \n5.0 \nOperating expenses\n \n \n \n \nOperations and support\n2,266\n \n2,296 \n(1.3)\n6,738\n \n6,801 \n(0.9)\nDepreciation and amortization\n964\n \n924 \n4.3 \n2,871\n \n2,719 \n5.6 \nTotal Operating Expenses\n3,230\n \n3,220 \n0.3 \n9,609\n \n9,520 \n0.9 \nOperating Income\n$\n325\n \n$\n196 \n65.8 \n%\n$\n1,009\n \n$\n593 \n70.2 \n%\nThe following tables highlight other key measures of performance for Consumer Wireline:\nBroadband Connections\n \n \n \n \n \n \n \n \n \n \nSeptember 30,\nPercent\n(in 000s)\n \n \n \n2025\n2024\nChange\nBroadband\n1\n14,494\n \n13,864 \n4.5 \n%\nFiber Broadband Connections\n10,123\n \n9,024 \n12.2 \n%\n1\nIncludes AIA.\nBroadband Net Additions\nThird Quarter\nNine-Month Period\nPercent\nPercent\n(in 000s)\n2025\n2024\nChange\n2025\n2024\nChange\nBroadband Net Additions\n1, 2\n232\n \n28 \n— \n%\n519\n \n135 \n— \n%\nFiber Broadband Net Additions\n288\n \n226 \n27.4 \n%\n792\n \n717 \n10.5 \n%\n1\nIncludes AIA.\n2\nExcludes the impact of subscriber disconnections resulting from the termination of AIA services in areas with unfavorable regulatory requirements in the first quarter of 2025. \nBroadband \nrevenues increased in the third quarter and for the first nine months of 2025, driven by increases in fiber revenues of 16.8% and 18.2%. Higher fiber revenues reflect an increase in fiber customers, which we expect to continue as we invest further in building our fiber footprint, and higher ARPU. This increase also includes growth in AIA revenues and was partially offset by declines in copper-based broadband services. \nLegacy voice and data services\n revenues decreased in the third quarter and for the first nine months of 2025, reflecting the continued decline in demand for these services in favor of other technologies, such as wireless and fiber services.\nOther service and equipment \nrevenues decreased in the third quarter and for the first nine months of 2025, reflecting the continued decline in the number of VoIP customers. \nOperations and support \nexpenses decreased in the third quarter and for the first nine months of 2025, primarily driven by lower customer support costs and content licensing fees, largely offset by higher network-related costs and higher marketing costs.\n34\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nDepreciation\n expense increased in the third quarter and for the first nine months of 2025, primarily due to ongoing capital spending for strategic initiatives such as fiber and network upgrades and expansion, which we expect to continue through the remainder of 2025.\nOperating income\n increased in the third quarter and for the first nine months of 2025. Our Consumer Wireline operating income margin in the third quarter increased from 5.7% in 2024 to 9.1% in 2025 and for the first nine months increased from 5.9% in 2024 to 9.5% in 2025. Our Consumer Wireline EBITDA margin in the third quarter increased from 32.8% in 2024 to 36.3% in 2025 and for the first nine months increased from 32.7% in 2024 to 36.5% in 2025.\nLATIN AMERICA SEGMENT\nThird Quarter\nNine-Month Period\n \n2025\n2024\nPercent Change\n2025\n2024\nPercent Change\nSegment Operating Revenues\n \n \n \n \n \n \nService\n$\n696\n \n$\n645 \n7.9 \n%\n$\n1,973\n \n$\n2,034 \n(3.0)\n%\nEquipment\n399\n \n377 \n5.8 \n1,147\n \n1,154 \n(0.6)\nTotal Segment Operating Revenues\n1,095\n \n1,022 \n7.1 \n3,120\n \n3,188 \n(2.1)\nSegment Operating Expenses\nOperations and support\n896\n \n854 \n4.9 \n2,527\n \n2,662 \n(5.1)\nDepreciation and amortization\n177\n \n158 \n12.0 \n482\n \n507 \n(4.9)\nTotal Segment Operating Expenses\n1,073\n \n1,012 \n6.0 \n3,009\n \n3,169 \n(5.0)\nOperating Income\n$\n22\n \n$\n10 \n— \n%\n$\n111\n \n$\n19 \n— \n%\nThe following tables highlight other key measures of performance for Mexico:\nSubscribers\n \n \n \n \nSeptember 30,\nPercent\n(in 000s)\n \n \n \n2025\n2024\nChange\nPostpaid\n \n \n \n6,423\n \n5,633 \n14.0 \n%\nPrepaid\n \n \n \n17,508\n \n16,996 \n3.0 \nReseller\n \n \n \n218\n \n282 \n(22.7)\nTotal Mexico Wireless Subscribers\n \n \n \n24,149\n \n22,911 \n5.4 \n%\nMexico Wireless Net Additions\n \nThird Quarter\nNine-Month Period\n \n \n \nPercent\n \n \nPercent\n(in 000s)\n2025\n2024\nChange\n2025\n2024\nChange\nPostpaid\n243\n \n139 \n74.8 \n%\n586\n \n397 \n47.6 \n%\nPrepaid\n68\n \n187 \n(63.6)\n22\n \n333 \n(93.4)\nReseller\n(5)\n(51)\n90.2 \n(35)\n(135)\n74.1 \nTotal Mexico Wireless Net Additions\n306\n \n275 \n11.3 \n%\n573\n \n595 \n(3.7)\n%\nService\n revenues increased in the third quarter and decreased for the first nine months of 2025. The increase in the quarter was primarily due to growth in subscribers and favorable foreign exchange impacts. The decrease for the first nine months reflects unfavorable foreign exchange impacts in the first half of 2025, partially offset by growth in subscribers and ARPU. \nEquipment\n revenues increased in the third quarter and decreased for the first nine months of 2025. The increase in the quarter was primarily due to higher equipment sales and favorable foreign exchange impacts. The decrease for the first nine months reflects unfavorable foreign exchange impacts in the first half of 2025, partially offset by higher equipment sales. \n35\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nOperations and support\n expenses increased in the third quarter and decreased for the first nine months of 2025. The increase in the quarter was primarily due to higher equipment costs, bad debt expense from higher sales and unfavorable exchange rates. The decrease for the first nine months was primarily due to favorable foreign exchange impacts, partially offset by increased equipment and selling costs.\nDepreciation and amortization\n expense increased in the third quarter and decreased for the first nine months of 2025. The increase in the quarter was primarily due to accelerated depreciation on certain network assets. The decrease for the first nine months was primarily due to foreign exchange impacts.\nOperating income\n increased in the third quarter and for the first nine months of 2025. Our Mexico operating income margin in the third quarter increased from 1.0% in 2024 to 2.0% in 2025 and for the first nine months increased from 0.6% in 2024 to 3.6% in 2025. Our Mexico EBITDA margin in the third quarter increased from 16.4% in 2024 to 18.2% in 2025 and for the first nine months increased from 16.5% in 2024 to 19.0% in 2025.\nCOMPETITIVE AND REGULATORY ENVIRONMENT\nOverview \nAT&T subsidiaries operating within the United States are subject to federal and state regulations. AT&T subsidiaries operating outside the United States are subject to the jurisdiction of national and supranational regulations in the markets where service is provided. Complying with these regulations may affect our results of operations and cash flow, and compliance may be very costly. \nOn July 4, 2025, the One Big Beautiful Bill Act was enacted, which restores or makes permanent certain expiring business tax provisions from the Tax Cuts and Jobs Act of 2017. The legislation did not materially impact our income tax expense, but we expect that it will result in a material decrease to cash taxes paid relative to our expectations.\nFor further discussion of regulations impacting AT&T and its subsidiaries, please see “Management’s Discussion and Analysis of Financial Condition and Results of Operation—Regulatory Landscape” in our Annual Report on Form 10-K for the year-ended December 31, 2024.\nLIQUIDITY AND CAPITAL RESOURCES\n \nFor nine months ended September 30,\n2025\n2024\nCash provided by operating activities \n$\n28,964\n \n$\n26,875 \nCash used in investing activities \n(14,433)\n(12,127)\nCash provided by (used in) financing activities \n2,391\n \n(18,855)\nSeptember 30,\nDecember 31,\n2025\n2024\nCash and cash equivalents\n$\n20,272\n \n$\n3,298 \nTotal debt\n139,468\n \n123,532 \nWe had $20,272 in cash and cash equivalents available at September 30, 2025, increasing $16,974 since December 31, 2024. Cash and cash equivalents included cash of $4,359 and money market funds and other cash equivalents of $15,913. Approximately $1,497 of our cash and cash equivalents were held in accounts outside of the U.S. and may be subject to restrictions on repatriation. Our cash and cash equivalents at September 30, 2025 was elevated in anticipation of the consummation of announced transactions (see Note 11).\nFor the first nine months of 2025, cash inflows were primarily provided by cash receipts from operations, including cash from our sale and transfer of our receivables to third parties, and distributions from DIRECTV. These inflows exceeded cash used to meet the needs of the business, including, but not limited to, payment of operating expenses, including higher device payments from higher sales volumes. The cash generated\n \nfrom operating activities was primarily used to fund capital improvements, make dividend payments to stockholders, repurchase preferred and common stock, and repay long-term debt. We maintain availability under our credit facilities and our commercial paper program to meet our short-term liquidity requirements.\n36\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nCash Provided by Operating Activities\nDuring the first nine months of 2025, cash provided by operating activities was $28,964, compared to $26,875 for the first nine months of 2024, with increases resulting from higher cash flows related to DIRECTV, including a first-quarter 2025 dividend of $1,138, and operational growth. Partially offsetting this increase and lowering cash from operations during the first nine months of 2025, were advanced cash payments of approximately $1,000 for wholesale access which can be utilized on invoices over future periods.\nWe actively manage the timing of our supplier payments for operating items to optimize the use of our cash. Among other things, we seek to make payments on 90-day or greater terms, while providing the suppliers with access to bank facilities that permit earlier payments at their cost (referred to as supplier financing program). In addition, for payments to suppliers of handset inventory, as part of our working capital initiatives, we have arrangements that allow us to extend the stated payment terms by up to 90 days at an additional cost to us (referred to as direct supplier financing). The net impact of direct supplier financing, including principal and interest payments, was to decrease cash from operating activities approximately $2,430 and $3,648 for the nine months ended September 30, 2025 and 2024, respectively. All supplier financing payments are due within one year. (See Note 10)\nCash Used in Investing Activities\nFor the first nine months of 2025, cash used in investing activities totaled $14,433 and consisted primarily of $14,061 (including interest during construction) for capital expenditures. \nDuring the first nine months of 2025, investing activities also included $110 of FirstNet sustainability payments net of reinvestment, and $620 for our investment in a new strategic partner related to wireline network transformation accounted for under the equity method of accounting. \nOn July 2, 2025, we completed the sale of our interest in DIRECTV to TPG and recorded a current note receivable of approximately $3,600, which we expect to receive the majority of by the end of 2025, and a long-term note receivable of $500. As of September 30, 2025, we have collected approximately $320 of the current note receivable. \nWe enter into multi-year software licensing arrangements, which are typically paid over the license terms of two to five years and referred to as vendor financing. Additionally, for capital improvements, we have negotiated favorable vendor payment terms of 120 days or more with some of our vendors, which are also referred to as vendor financing. Vendor financing is excluded from capital expenditures and reported as financing activities. For the first nine months of 2025, vendor financing payments were $823, compared to $1,571 for the first nine months of 2024. Capital expenditures for the first nine months of 2025 were $14,061, and when including $823 cash paid for vendor financing, capital investment was $14,884 ($107 lower than the prior-year comparable period).\nThe vast majority of our capital expenditures are spent on our networks, including product development and related support systems. During the first nine months of 2025, we placed $1,014 of productive assets in service under vendor financing arrangements (compared to $581 in the prior-year comparable period). The amount of capital expenditures is influenced by demand for services and products, capacity needs and network enhancements. \nIn November 2024, we agreed to purchase select spectrum licenses from United States Cellular Corporation (UScellular) for approximately $1,000, subject to closing conditions, including the consummation of UScellular’s sale of its wireless operations and select spectrum assets to T-Mobile US, Inc, which was closed on August 1, 2025.\nOn May 21, 2025, we agreed to acquire substantially all of Lumen’s mass markets fiber business for $5,750 cash, subject to purchase price adjustments. At the time of signing, the pending acquisition covered approximately one million fiber customers, and also included fiber network assets that reached more than four million fiber locations. The transaction is expected to close in early 2026, pending regulatory approval and other customary closing conditions.\nOn August 25, 2025, we agreed to purchase FCC licenses in the 600 MHz and 3.45 GHz bands from EchoStar Corporation for approximately $23,000, subject to certain adjustments. The transaction is expected to close in the first half of 2026 and is subject to regulatory approval and other closing conditions. The FCC licenses will be used to expand our 5G network, meet future capacity demands and support future wireless communications services. We signed a short-term spectrum manager lease on the 3.45 GHz spectrum. We expect these licenses will be deployed in cell sites covering nearly two-thirds of the U.S. population by mid-November 2025.\n37\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nCash Provided by or Used in Financing Activities\nFor the first nine months of 2025, cash provided by financing activities totaled $2,391 and was primarily comprised of issuances of long-term debt and preferred interests, offset by dividend payments, preferred and common stock repurchases, debt repayments and vendor financing payments.\nA tabular summary of our debt activities for the nine months ended September 30, 2025 is as follows:\nFirst\nQuarter\nSecond \nQuarter\nThird \nQuarter\nNine months ended September 30, 2025\nIssuance of Notes and Debentures:\nEUR notes\n$\n2,956 \n$\n— \n$\n2,639 \n$\n5,595 \nUSD notes\n— \n3,473 \n4,959 \n8,432 \nDebt Issuances\n$\n2,956 \n$\n3,473 \n$\n7,598 \n$\n14,027 \nRepayments \nEUR notes\n$\n(1,321)\n$\n(32)\n$\n— \n$\n(1,353)\nOther\n(205)\n(62)\n(229)\n(496)\nRepayments of long-term debt\n$\n(1,526)\n$\n(94)\n$\n(229)\n$\n(1,849)\nThe weighted average interest rate of our long-term debt portfolio, including credit agreement borrowings and the impact of derivatives, was approximately 4.2% as of September 30, 2025 and as of December 31, 2024. We had $138,090 of total notes and debentures outstanding at September 30, 2025. This also included Euro, British pound sterling, Canadian dollar, Swiss franc and Australian dollar denominated debt that totaled approximately $38,496.\nAt September 30, 2025, we had $11,378 of long-term debt maturing within one year. We had no outstanding commercial paper or other short-term borrowings on September 30, 2025.\nFor the first nine months of 2025, we paid $823 of cash under our vendor financing program, compared to $1,571 in the prior-year comparable period. Total vendor financing payables included in our September 30, 2025 consolidated balance sheet were $1,674, with $908 due within one year (in “Accounts payable and accrued liabilities”) and the remainder predominantly due within five years (in “Other noncurrent liabilities”).\nDuring the first nine months of 2025, we repurchased approximately 87 million shares totaling $2,444 under our $10,000 common stock repurchase authorization approved by the Board of Directors in December 2024, excluding brokerage fees and the one percent excise tax imposed by the Inflation Reduction Act of 2022. At September 30, 2025, we had approximately $7,556 remaining under this repurchase authorization. \nWe paid dividends on common and preferred shares of $6,168 during the first nine months of 2025, compared with $6,171 for the first nine months of 2024.\nDividends on common stock declared by our Board of Directors totaled $0.8325 per share in the first nine months of 2025 and 2024. Our dividend policy considers the expectations and requirements of stockholders, capital funding requirements of AT&T and long-term growth opportunities.\nFinancing activities in the first nine months of 2025 also included the issuance of $2,250 of nonconvertible cumulative preferred interests in Telco LLC, with the funds used to redeem all outstanding Series B preferred stock for $2,075 (see Note 11). \nWe also received approximately $850 in upfront cash proceeds from a structured sale-leaseback of real estate.\nCredit Facilities\nThe following summary of our various credit and loan agreements does not purport to be complete and is qualified in its entirety by reference to each agreement filed as exhibits to our Annual Report on Form 10-K.\nWe use credit facilities as a tool in managing our liquidity status. We currently have one $12,000 revolving credit agreement that terminates on November 18, 2029 (Revolving Credit Agreement). No amount was outstanding under the Revolving Credit Agreement as of September 30, 2025.\n38\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nWe also utilize other external financing sources, which include various credit arrangements supported by government agencies to support network equipment purchases as well as a commercial paper program.\nOur Revolving Credit Agreement contains covenants that are customary for an issuer with investment grade senior debt credit rating as well as a net debt-to-EBITDA financial ratio covenant requiring AT&T to maintain, as of the last day of each fiscal quarter, a ratio of not more than 3.75-to-1. As of September 30, 2025, we were in compliance with the covenants for our credit facilities.\nCollateral Arrangements\nMost of our counterparty collateral arrangements require cash collateral posting by AT&T only when derivative market values exceed certain thresholds. Under these arrangements, which cover the majority of our approximate $39,142 derivative portfolio, counterparties are still required to post collateral. During the first nine months of 2025, we received $218 of cash collateral, on a net basis. Cash postings under these arrangements vary with changes in credit ratings and netting agreements. (See Note 7)\nOther\nOur total capital consists of debt (long-term debt and debt maturing within one year), redeemable noncontrolling interest and stockholders’ equity. Our capital structure does not include debt issued by our equity method investments. At September 30, 2025, our debt ratio was 52.0%, compared to 52.2% at September 30, 2024 and 50.7% at December 31, 2024. The debt ratio is affected by the same factors that affect total capital, and reflects our recent debt issuances, repayments and reclassifications related to redemption of noncontrolling interests.\n39\nAT&T INC.\nSEPTEMBER 30, 2025\n \nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations- Continued\nDollars in millions except per share amounts\nDISCUSSION AND RECONCILIATION OF NON-GAAP MEASURES\nWe also evaluate segment and business unit performance based on EBITDA, which is defined as operating income excluding depreciation and amortization, and/or EBITDA margin, which is defined as EBITDA divided by total revenue. EBITDA is used as part of our management reporting, and we believe EBITDA to be a relevant and useful measurement to our investors as it measures the cash generation potential of our business units. EBITDA does not give effect to depreciation and amortization expenses incurred in operating income nor is it burdened by cash used for debt service requirements and thus does not reflect available funds for distributions, reinvestment or other discretionary uses. There are material limitations to using these non-GAAP financial measures. EBITDA and EBITDA margin, as we have defined them, may not be comparable to similarly titled measures reported by other companies. \nThird Quarter\nNine-Month Period\nPercent\nPercent\n2025\n2024\nChange\n2025\n2024\nChange\nCommunications Segment\nOperating income\n$\n7,096\n \n$\n7,156 \n(0.8)\n%\n$\n21,152\n \n$\n20,906 \n1.2 \n%\nAdd: Depreciation and amortization\n5,076\n \n4,813 \n5.5 \n15,084\n \n14,319 \n5.3 \nEBITDA\n$\n12,172\n \n$\n11,969 \n1.7 \n%\n$\n36,236\n \n$\n35,225 \n2.9 \n%\nOperating income margin\n24.0\n \n%\n24.6 \n%\n23.8\n \n%\n24.2 \n%\nEBITDA margin\n41.2\n \n%\n41.2 \n%\n40.8\n \n%\n40.7 \n%\nMobility\nOperating income\n$\n7,125\n \n$\n7,003 \n1.7 \n%\n$\n20,796\n \n$\n20,190 \n3.0 \n%\nAdd: Depreciation and amortization\n2,577\n \n2,490 \n3.5 \n7,659\n \n7,453 \n2.8 \nEBITDA\n$\n9,702\n \n$\n9,493 \n2.2 \n%\n$\n28,455\n \n$\n27,643 \n2.9 \n%\nOperating income margin\n32.8\n \n%\n33.3 \n%\n31.9\n \n%\n32.5 \n%\nEBITDA margin\n44.7\n \n%\n45.1 \n%\n43.7\n \n%\n44.5 \n%\nBusiness Wireline\nOperating income (loss)\n$\n(354)\n$\n(43)\n— \n%\n$\n(653)\n$\n123 \n— \n%\nAdd: Depreciation and amortization\n1,535\n \n1,399 \n9.7 \n4,554\n \n4,147 \n9.8 \nEBITDA\n$\n1,181\n \n$\n1,356 \n(12.9)\n%\n$\n3,901\n \n$\n4,270 \n(8.6)\n%\nOperating income margin\n(8.3)\n%\n(0.9)\n%\n(5.0)\n%\n0.9 \n%\nEBITDA margin\n27.8\n \n%\n29.4 \n%\n29.9\n \n%\n29.9 \n%\nConsumer Wireline\nOperating income\n$\n325\n \n$\n196 \n65.8 \n%\n$\n1,009\n \n$\n593 \n70.2 \n%\nAdd: Depreciation and amortization\n964\n \n924 \n4.3 \n2,871\n \n2,719 \n5.6 \nEBITDA\n$\n1,289\n \n$\n1,120 \n15.1 \n%\n$\n3,880\n \n$\n3,312 \n17.1 \n%\nOperating income margin\n9.1\n \n%\n5.7 \n%\n9.5\n \n%\n5.9 \n%\nEBITDA margin\n36.3\n \n%\n32.8 \n%\n36.5\n \n%\n32.7 \n%\nLatin America Segment\nOperating income\n$\n22\n \n$\n10 \n— \n%\n$\n111\n \n$\n19 \n— \n%\nAdd: Depreciation and amortization\n177\n \n158 \n12.0 \n482\n \n507 \n(4.9)\nEBITDA\n$\n199\n \n$\n168 \n18.5 \n%\n$\n593\n \n$\n526 \n12.7 \n%\nOperating income margin\n2.0\n \n%\n1.0 \n%\n3.6\n \n%\n0.6 \n%\nEBITDA margin\n18.2\n \n%\n16.4 \n%\n19.0\n \n%\n16.5 \n%\n40\nAT&T INC.\nSEPTEMBER 30, 2025"
}