{
  "source_file": "tdg-20250628.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nForward-looking Statements\nThe following discussion of the Company’s financial condition and results of operations should be read together with TD Group’s condensed consolidated financial statements and the related notes included elsewhere in this Quarterly Report on Form 10-Q. References in this section to “TransDigm,” “the Company,” “we,” “us,” “our,” and similar references refer to TD Group, TransDigm Inc. and TransDigm Inc.’s subsidiaries, unless the context otherwise indicates.\nThis Quarterly Report on Form 10-Q contains both historical and “forward-looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), and 27A of the Securities Act of 1933, as amended. All statements other than statements of historical fact included that address activities, events or developments that we expect, believe or anticipate will or may occur in the future are forward-looking statements, including, in particular, the statements about our plans, objectives, strategies and prospects regarding, among other things, our financial condition, results of operations and business. We have identified some of these forward-looking statements with words like “believe,” “may,” “will,” “should,” “expect,” “intend,” “plan,” “predict,” “anticipate,” “estimate” or “continue” and other words and terms of similar meaning. These forward-looking statements may be contained throughout this Quarterly Report on Form 10-Q. These forward-looking statements are based on current expectations about future events affecting us and are subject to uncertainties and factors relating to, among other things, our operations and business environment, all of which are difficult to predict and many of which are beyond our control. Although we believe that the expectations reflected in these forward-looking statements are reasonable, we do not know whether our expectations will prove correct. They can be affected by inaccurate assumptions we might make or by known or unknown risks and uncertainties, including the risks described in Item 1A, “Risk Factors,” of the Annual Report on Form 10-K. Since our actual results, performance or achievements could differ materially from those expressed in, or implied by, these forward-looking statements, we cannot give any assurance that any of the events anticipated by these forward-looking statements will occur or, if any of them does occur, what impact they will have on our business, results of operations and financial condition. You are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date they are made. We do not undertake any obligation to update these forward-looking statements or the risk factors contained in this Quarterly Report on Form 10-Q to reflect new information, future events or otherwise, except as may be required under federal securities laws.\nImportant factors that could cause actual results to differ materially from the forward-looking statements made in this Quarterly Report on Form 10-Q include but are not limited to: the sensitivity of our business to the number of flight hours that our customers’ planes spend aloft and our customers’ profitability, both of which are affected by general economic conditions; supply chain constraints; increases in raw material costs, taxes and labor costs that cannot be recovered in product pricing; failure to complete or successfully integrate acquisitions; our indebtedness; current and future geopolitical or other worldwide events, including, without limitation, wars or conflicts and public health crises; cybersecurity threats; risks related to the transition or physical impacts of climate change and other natural disasters or meeting sustainability-related voluntary goals or regulatory requirements; our reliance on certain customers; the United States (“U.S.”) defense budget and risks associated with being a government supplier including government audits and investigations; failure to maintain government or industry approvals; risks related to changes in laws and regulations, including increases in compliance costs and potential changes in trade policies and tariffs; potential environmental liabilities; liabilities arising in connection with litigation; risks and costs associated with our international sales and operations; and other factors. Refer to Part II, Item 1A included in this Quarterly Report on Form 10-Q and to Part I, Item 1A of the Annual Report on Form 10-K for additional information regarding the foregoing factors that may affect our business. \nOverview\nWe believe we are a leading global designer, producer and supplier of highly engineered proprietary aerospace components with significant aftermarket content. We seek to develop highly customized products to solve specific needs for aircraft operators and manufacturers. We attempt to differentiate ourselves based on engineering, service and manufacturing capabilities. We believe that our products have strong brand names within the industry and that we have a reputation for high quality, reliability and strong customer support. We believe we have achieved steady, long-term growth in sales and improvements in operating performance we believe that due to our competitive strengths and through execution of our value-driven operating strategy. More specifically, focusing our businesses on our value-driven operating strategy of obtaining profitable new business, carefully controlling the cost structure via productivity and cost improvements and pricing our highly engineered value-added products to fairly reflect the value we provide and the resources required to do so has historically resulted in improvements in gross profit and income from operations over the long-term.\n27\nTable of Contents\nOur business is well diversified due to the broad range of products that we offer to our customers. Our major product offerings, substantially all of which are ultimately provided to end-users in the aerospace industry, include mechanical/electromechanical actuators and controls, ignition systems and engine technology, specialized pumps and valves, power conditioning devices, specialized AC/DC electric motors and generators, batteries and chargers, engineered latching and locking devices, engineered rods, engineered connectors and elastomer sealing solutions, databus and power controls, cockpit security components and systems, specialized and advanced cockpit displays, engineered audio, radio and antenna systems, specialized lavatory components, seat belts and safety restraints, engineered and customized interior surfaces and related components, advanced sensor products, switches and relay panels, thermal protection and insulation, lighting and control technology, parachutes, high performance hoists, winches and lifting devices, cargo loading, handling and delivery systems, specialized flight, wind tunnel and jet engine testing services and equipment, electronic components used in the generation, amplification, transmission and reception of microwave signals and equipment and complex testing and instrumentation solutions. Each of our product offerings is composed of many individual products that are typically customized to meet the needs of a particular aircraft platform or customer.\nFor the third quarter of fiscal 2025, we generated net sales of $2,237 million and net income attributable to TD Group of $492 million. EBITDA As Defined was $1,217 million, or 54.4% of net sales. Refer to the “Non-GAAP Financial Measures” section for certain information regarding EBITDA and EBITDA As Defined, including reconciliations of EBITDA and EBITDA As Defined to net income and net cash provided by operating activities. \nFor the thirty-nine week period ended June 28, 2025, demand for air travel remained strong both domestically and internationally though recent RPK statistics indicate a softening in the growth rate, particularly in North America and in domestic passenger markets. Commercial aftermarket sales increased for the thirty-nine week period ended June 28, 2025 compared to fiscal 2024 primarily due to the overall strong demand for air travel resulting in higher flight hours and utilization of passenger and freight aircraft as global air traffic continues to surpass pre-pandemic levels. We continue to closely monitor the economic environment, including its impact on airline capacity. At this time, we are seeing minimal impact on our commercial aftermarket. \nOur commercial transport original equipment manufacturer (“OEM”) shipments and revenues generally run ahead of aircraft delivery schedules. Consistent with prior years, our fiscal 2025 shipments are a function of, among other things, the estimated 2025 and 2026 commercial aircraft production rates for Boeing and Airbus. Airline demand for new aircraft remains high and the OEMs are working to increase aircraft production. However, aircraft production rates remain well below pre-pandemic levels as the struggles in the OEM supply chain and labor challenges persist. Additional factors such as the recent tariff actions and potentially weakening economic environment, and the Boeing machinist strike, which affected its 737 MAX, 767 and 777 production lines, make it difficult to accurately predict the OEM build rates for the balance of fiscal 2025, though progress continues to be made in the build rates. Airbus has also encountered difficulties in ramping up production. For the thirty-nine week period ended June 28, 2025, the impact across TransDigm's operating units has been uneven and varied, resulting in consolidated commercial OEM sales decreasing compared to fiscal 2024.   \nOur defense business fluctuates from year-to-year, and is dependent, to a degree, on government budget constraints, the timing of orders, macro and micro dynamics with respect to the U.S. Department of Defense (“DOD”) procurement policy and the extent of global conflicts, such as the ongoing geopolitical conflicts. Likewise, delays in government spending outlays and government funding reprioritization can impact demand. For a variety of reasons, the military spending outlook is very uncertain, though recent DOD budgets have trended upwards due to recent geopolitical challenge and conflicts, and current military modernization efforts. Defense sales for the thirty-nine week period ended June 28, 2025 increased compared to fiscal 2024 primarily due to continued improving United States Government (“U.S. Government”) defense spend outlays.\nAt various points in 2025, the U.S. Government has announced new or higher tariffs on goods imported into the U.S. from numerous countries resulting in multiple countries countering with reciprocal tariffs and other actions in response. Negotiations between the U.S. and other countries regarding the tariffs are ongoing and their status continues to evolve. TransDigm is primarily a domestic manufacturer as the majority of its operations are in the U.S. and mainly sources in the U.S. for its U.S.-based production. Because of this and other factors such as the applicability of the United States-Mexico-Canada Agreement, we do not expect the tariffs to have a significant impact on our fiscal 2025 operating results. We continue to monitor the developments on tariffs and other changes in trade policy for its potential impact on the economic environment and on our business and operating results.\n28\nTable of Contents\nCritical Accounting Policies and Estimates\nThe preparation and fair presentation of the consolidated unaudited interim financial statements and accompanying notes included in this report are the responsibility of management. The financial statements and footnotes have been prepared in conformity with generally accepted accounting principles in the United States (“U.S. GAAP”) for interim financial statements and contain certain amounts that were based upon management’s best estimates, judgments and assumptions that were believed to be reasonable under the circumstances. On an ongoing basis, we evaluate the accounting policies and estimates used to prepare financial statements. Estimates are based on historical experience, judgments and assumptions believed to be reasonable under current facts and circumstances. Actual amounts and results could differ from these estimates used by management. \nA comprehensive discussion of the Company’s critical accounting policies and management estimates and significant accounting policies followed in the preparation of the financial statements is included in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended September 30, 2024, filed on November 7, 2024. Refer to Note 1, “Basis of Presentation,” in the notes to the condensed consolidated financial statements included herein for further disclosure of accounting standards recently adopted or required to be adopted in the future. \nAcquisitions\nRecent acquisitions are described in Note 2, “Acquisitions,” in the notes to the condensed consolidated financial statements included herein.\n29\nTable of Contents\nResults of Operations \nThe following table sets forth, for the periods indicated, certain operating data of the Company, including presentation of the amounts as a percentage of net sales (amounts in millions, except per share data):\nThirteen Week Periods Ended \nJune 28, 2025\n% of Net Sales\nJune 29, 2024\n% of Net Sales\nNet sales\n$\n2,237 \n100.0 \n%\n$\n2,046 \n100.0 \n%\nCost of sales\n905 \n40.5 \n%\n826 \n40.4 \n%\nSelling and administrative expenses\n242 \n10.8 \n%\n248 \n12.1 \n%\nAmortization of intangible assets\n51 \n2.3 \n%\n38 \n1.8 \n%\nIncome from operations\n1,039 \n46.4 \n%\n934 \n45.7 \n%\nInterest expense-net\n397 \n17.7 \n%\n316 \n15.4 \n%\nRefinancing costs\n7 \n0.3 \n%\n30 \n1.5 \n%\nOther income\n— \n— \n%\n(14)\n(0.7)\n%\nIncome tax provision\n142 \n6.3 \n%\n141 \n6.9 \n%\nIncome from continuing operations\n493 \n22.0 \n%\n461 \n22.6 \n%\nLess: Net income attributable to noncontrolling interests\n(1)\n— \n%\n— \n— \n%\nNet income attributable to TD Group\n$\n492 \n22.0 \n%\n$\n461 \n22.6 \n%\nNet income applicable to TD Group common stockholders\n$\n492 \n(1)\n22.0 \n%\n$\n461 \n(1)\n22.6 \n%\nEarnings per share attributable to TD Group common stockholders:\nBasic and diluted\n$\n8.47\n(2)\n$\n7.96\n(2)\nWeighted-average shares outstanding—basic and diluted\n58.1 \n57.9 \nOther Data:\nEBITDA\n$\n1,123 \n(3)\n$\n995 \n(3)\nEBITDA As Defined\n$\n1,217 \n(3)\n54.4 \n%\n$\n1,091 \n(3)\n53.3 \n%\n \n(1)\nNet income applicable to TD Group common stockholders represents net income attributable to TD Group less special dividends declared or paid on participating securities, including dividend equivalents. No special dividends were declared or paid on participating securities, including dividend equivalent payments, for the thirteen week periods ended June 28, 2025 and June 29, 2024.\n(2)\nEarnings per share is calculated by dividing net income applicable to TD Group common stockholders by the basic and diluted weighted average common shares outstanding. \n(3)\nRefer to “Non-GAAP Financial Measures” in this discussion and analysis for additional information and limitations regarding these non-GAAP financial measures, including a reconciliation to the comparable U.S. GAAP financial measure.\n30\nTable of Contents\nThirty-Nine Week Periods Ended\nJune 28, 2025\n% of Net Sales\nJune 29, 2024\n% of Net Sales\nNet sales\n$\n6,394 \n100.0 \n%\n$\n5,754 \n100.0 \n%\nCost of sales\n2,553 \n39.9 \n%\n2,341 \n40.7 \n%\nSelling and administrative expenses\n689 \n10.8 \n%\n715 \n12.4 \n%\nAmortization of intangible assets\n148 \n2.3 \n%\n110 \n1.9 \n%\nIncome from operations\n3,004 \n47.0 \n%\n2,588 \n45.0 \n%\nInterest expense-net\n1,152 \n18.0 \n%\n943 \n16.4 \n%\nRefinancing costs\n7 \n0.1 \n%\n59 \n1.0 \n%\nOther income\n(31)\n(0.5)\n%\n(24)\n(0.4)\n%\nIncome tax provision\n411 \n6.4 \n%\n362 \n6.3 \n%\nIncome from continuing operations\n1,465 \n22.9 \n%\n1,248 \n21.7 \n%\nLess: Net income attributable to noncontrolling interests\n(1)\n— \n%\n(2)\n— \n%\nNet income attributable to TD Group\n$\n1,464 \n22.9 \n%\n$\n1,246 \n21.7 \n%\nNet income applicable to TD Group common stockholders\n$\n1,415 \n(1)\n22.1 \n%\n$\n1,145 \n(1)\n19.9 \n%\nEarnings per share attributable to TD Group common stockholders:\nBasic and diluted\n$\n24.31\n(2)\n$\n19.81\n(2)\nCash dividends declared per common share\n$\n— \n$\n35.00 \nWeighted-average shares outstanding—basic and diluted\n58.2 \n57.8 \nOther Data:\nEBITDA\n$\n3,299 \n(3)\n$\n2,772 \n(3)\nEBITDA As Defined\n$\n3,441 \n(3)\n53.8 \n%\n$\n3,023 \n(3)\n52.5 \n%\n \n(1)\nNet income applicable to TD Group common stockholders represents net income attributable to TD Group less special dividends declared or paid on participating securities, including dividend equivalent payments of $49 million and $101 million for the thirty-nine week periods ended June 28, 2025 and June 29, 2024, respectively.\n(2)\nEarnings per share is calculated by dividing net income applicable to TD Group common stockholders by the basic and diluted weighted average common shares outstanding.\n(3)\nRefer to “Non-GAAP Financial Measures” in this discussion and analysis for additional information and limitations regarding these non-GAAP financial measures, including a reconciliation to the comparable U.S. GAAP financial measure.\n31\nTable of Contents\nChanges in Results of Operations\nThirteen week period ended June 28, 2025 compared with the thirteen week period ended June 29, 2024 \nTotal Company\n•\nNet Sales\n.\n Net organic sales and acquisition sales and the related dollar and percentage changes for the thirteen week periods ended June 28, 2025 and\n \nJune 29, 2024 were as follows (amounts in millions): \nThirteen Week Periods Ended \n% Change\nNet Sales\nJune 28, 2025\nJune 29, 2024\nChange\nOrganic sales\n$\n2,164 \n$\n2,035 \n$\n129 \n6.3 \n%\nAcquisition sales\n73 \n11 \n62 \n3.0 \n%\nNet sales\n$\n2,237 \n$\n2,046 \n$\n191 \n9.3 \n%\nOrganic sales represent net sales from existing businesses owned by the Company, excluding sales from acquisitions. Acquisition sales represent net sales from acquired businesses for the period up to one year from the respective acquisition date. We believe this measure provides investors with a supplemental understanding of underlying sales trends by providing sales growth on a consistent basis. Refer to Note 2, “Acquisitions,” in the notes to the condensed consolidated financial statements included herein for information on the Company's recent acquisitions.  \nThe increase in organic sales of $129 million for the thirteen week period ended June 28, 2025 compared to the thirteen week period ended June 29, 2024 is primarily related to increases in defense sales ($122 million, an increase of 15.4%) and commercial aftermarket sales ($35 million, an increase of 5.7%), partially offset by a decrease in commercial OEM sales ($33 million, a decrease of 7.0%). The increase in defense sales is primarily attributable to continued improving U.S. Government defense spend outlays. The increase in commercial aftermarket sales is primarily attributable to the strong demand for air travel resulting in higher flight hours and utilization of aircraft. The decrease in commercial OEM sales is primarily attributable to the prolonged supply chain and labor challenges being encountered by aircraft manufacturers and resulting production delays of new aircraft.\nThe increase in acquisition sales for the thirteen week period ended June 28, 2025 is primarily attributable to the fiscal 2024 acquisitions of Raptor Scientific, the Electron Device Business of Communications & Power Industries (“CPI's Electron Device Business”) and SEI Industries LTD (“SEI”).   \n•\nCost of Sales and Gross Profit\n.\n Cost of sales increased by $79 million, or 9.6%, to $905 million for the thirteen week period ended June 28, 2025 compared to $826 million for the thirteen week period ended June 29, 2024. Cost of sales and the related percentage of net sales for the thirteen week periods ended June 28, 2025 and June 29, 2024 were as follows (amounts in millions):\nThirteen Week Periods Ended \nJune 28, 2025\nJune 29, 2024\nChange\n% Change\nCost of sales - excluding costs below\n$\n884 \n$\n825 \n$\n59 \n7.2 \n%\n% of net sales\n39.5 \n%\n40.3 \n%\nForeign currency losses (gains)\n21 \n(2)\n23 \n1,150.0 \n%\n% of net sales\n0.9 \n%\n(0.1)\n%\nNon-cash stock and deferred compensation expense\n5 \n5 \n— \n— \n%\n% of net sales\n0.2 \n%\n0.2 \n%\nInventory step-up amortization\n2 \n5 \n(3)\n(60.0)\n%\n% of net sales\n0.1 \n%\n0.2 \n%\nLoss contract amortization\n(7)\n(7)\n— \n— \n%\n% of net sales\n(0.3)\n%\n(0.3)\n%\nTotal cost of sales\n$\n905 \n$\n826 \n$\n79 \n9.6 \n%\n% of net sales\n40.5 \n%\n40.4 \n%\nGross profit (Net sales less Total cost of sales)\n$\n1,332 \n$\n1,220 \n$\n112 \n9.2 \n%\nGross profit percentage (Gross profit / Net sales)\n59.5 \n%\n59.6 \n%\n32\nTable of Contents\nCost of sales during the thirteen week period ended June 28, 2025 slightly increased as a percentage of net sales. This was driven by foreign currency losses recognized in the third quarter of fiscal 2025 as foreign exchange rates, particularly the U.S. dollar compared to the British pound and the euro, weakened in the third quarter of fiscal 2025 compared to fiscal 2024. Excluding the impact of foreign currency losses (gains), cost of sales during the thirteen week period ended June 28, 2025 decreased as a percentage of net sales. This was primarily driven by the application of our three core value-driven operating strategy (obtaining profitable new business, continually improving our cost structure and providing highly engineered value-added products to customers) coupled with fixed overhead costs incurred being spread over a higher production volume.\n•\nSelling and Administrative Expenses.\n Selling and administrative expenses decreased by $6 million, or 2.4%, to $242 million for the thirteen week period ended June 28, 2025, compared to $248 million, or 12.1% of net sales, for the thirteen week period ended June 29, 2024. Selling and administrative expenses and the related percentage of net sales for the thirteen week periods ended June 28, 2025 and June 29, 2024 were as follows (amounts in millions):\nThirteen Week Periods Ended \nJune 28, 2025\nJune 29, 2024\nChange\n% Change\nSelling and administrative expenses - excluding costs below\n$\n190 \n$\n184 \n$\n6 \n3.3 \n%\n% of net sales\n8.5 \n%\n9.0 \n%\nNon-cash stock and deferred compensation expense\n46 \n43 \n3 \n7.0 \n%\n% of net sales\n2.1 \n%\n2.1 \n%\nAcquisition integration costs\n6 \n3 \n3 \n100.0 \n%\n% of net sales\n0.3 \n%\n0.1 \n%\nAcquisition transaction-related expenses\n— \n18 \n(18)\n(100.0)\n%\n% of net sales\n— \n%\n0.9 \n%\nTotal selling and administrative expenses\n$\n242 \n$\n248 \n$\n(6)\n(2.4)\n%\n% of net sales\n10.8 \n%\n12.1 \n%\nSelling and administrative expenses as a percentage of net sales for the thirteen week period ended June 28, 2025 decreased  compared to the thirteen week period ended June 29, 2024 primarily due to the decrease in acquisition transaction-related expenses. Acquisition transaction-related expenses decreased due to a lower volume of business combinations completed quarter-to-date compared to fiscal 2024.  \n•\nAmortization of Intangible Assets.\n Amortization of intangible assets was $51 million for the thirteen week period ended June 28, 2025 compared to $38 million for the thirteen week period ended June 29, 2024. The increase in amortization expense of $13 million was primarily due to the amortization expense recognized on intangible assets from the fiscal 2024 acquisitions. \n•\nInterest Expense-net.\n Interest expense-net includes interest on borrowings outstanding, amortization of debt issuance costs and original issue discount, revolving credit facility fees, finance leases, interest income and the impact of interest rate swaps and caps designated and qualifying as cash flow hedges. Interest expense-net increased $81 million, or 25.6%, to $397 million for the thirteen week period ended June 28, 2025 from $316 million for the comparable thirteen week period in the prior fiscal year. The increase in interest expense-net was primarily due to an increase in outstanding borrowings and a $25 million decrease in interest income. The weighted average interest rate for cash interest payments on total borrowings outstanding was 6.2% for the thirteen week periods ended June 28, 2025 and June 29, 2024.\n•\nRefinancing Costs. \nRefinancing costs of $7 million incurred for the thirteen week period ended June 28, 2025 were primarily related to the write-off of unamortized debt issuance costs recorded in conjunction with the redemption of the 5.50% subordinated notes due 2027 (“5.50% 2027 Notes”), which was completed during the thirteen week period ended June 28, 2025. Refinancing costs of $30 million incurred for the thirteen week period ended June 29, 2024 were primarily related to the write-off of unamortized debt issuance costs recorded in conjunction with the redemption of the 6.25% secured notes due 2026 (“2026 Secured Notes”), which was completed during the thirteen week period ended June 29, 2024.\n•\nOther Income.\n Other income of less than $1 million was recorded for the thirteen week period ended June 28, 2025, which primarily related to royalty and other income and the non-service related components of benefit costs on the Company's benefit plans. Other income of $14 million was recorded for the thirteen week period ended June 29, 2024, which primarily related to royalty and other income and the non-service related components of benefit costs on the Company's benefit plans. \n33\nTable of Contents\n•\nIncome Tax Provision.\n Income tax expense as a percentage of income before income taxes was approximately 22.4% for the thirteen week period ended June 28, 2025 compared to 23.4% for the thirteen week period ended June 29, 2024. The Company’s lower effective tax rate for the thirteen week period ended June 28, 2025 was primarily due to a more significant discrete benefit associated with share-based payments along with a less significant increase in the valuation allowance applicable to the Company's net interest deduction limitation compared to the prior period. \n•\nNet Income Attributable to TD Group\n.\n Net income attributable to TD Group increased $31 million, or 6.7%, to $492 million for the thirteen week period ended June 28, 2025 compared to net income attributable to TD Group of $461 million for the thirteen week period ended June 29, 2024, primarily as a result of the factors referenced above.\n•\nEarnings per Share.\n Basic and diluted earnings per share was $8.47 for the thirteen week period ended June 28, 2025 and $7.96 for the thirteen week period ended June 29, 2024. \nBusiness Segments\n•\nSegment Net Sales\n.\n Net sales by segment for the thirteen week periods ended June 28, 2025 and June 29, 2024 were as follows (amounts in millions):\nThirteen Week Periods Ended \nJune 28, 2025\n% of Net Sales\nJune 29, 2024\n% of Net Sales\nChange\n% Change\nPower & Control\n$\n1,139 \n50.9 \n%\n$\n1,029 \n50.3 \n%\n$\n110 \n10.7 \n%\nAirframe\n1,058 \n47.3 \n%\n974 \n47.6 \n%\n84 \n8.6 \n%\nNon-aviation\n40 \n1.8 \n%\n43 \n2.1 \n%\n(3)\n(7.0)\n%\n    Net sales\n$\n2,237 \n100.0 \n%\n$\n2,046 \n100.0 \n%\n$\n191 \n9.3 \n%\nNet sales for the Power & Control segment increased $110 million, an increase of 10.7%, for the thirteen week period ended June 28, 2025 compared to the thirteen week period ended June 29, 2024. The sales increase resulted primarily from increases in organic sales in defense ($49 million, an increase of 10.1%) and commercial aftermarket ($9 million, an increase of 3.0%). The increase in defense sales is primarily attributable to continued improving U.S. Government defense spend outlays. The increase in commercial aftermarket sales is primarily attributable to the strong demand for air travel resulting in higher flight hours and utilization of aircraft.\nNet sales for the Airframe segment increased $84 million, an increase of 8.6%, for the thirteen week period ended June 28, 2025 compared to the thirteen week period ended June 29, 2024. The sales increase resulted primarily from increases in organic sales in defense ($74 million, an increase of 24.6%) and commercial aftermarket ($26 million, an increase of 8.1%). The increase in defense sales and commercial aftermarket sales for the Airframe segment is attributable to the same factors described in the paragraph above for the Power & Control segment. \nAcquisition sales for the Power & Control and Airframe segments contributed approximately $62 million in the aggregate to the increase in net sales. Acquisition sales represent net sales from acquired businesses for the period up to one year from the respective acquisition date.\nThe change in Non-aviation net sales compared to the thirteen week period in the prior fiscal year was not material. \n•\nEBITDA As Defined\n.\n Refer to “Non-GAAP Financial Measures” in this discussion and analysis for additional information and limitations regarding these non-GAAP financial measures, including a reconciliation to the comparable U.S. GAAP financial measure. EBITDA As Defined by segment for the thirteen week periods ended June 28, 2025 and June 29, 2024 were as follows (amounts in millions):\n \nThirteen Week Periods Ended \n \n \n \nJune 28, 2025\n% of  Segment\nNet Sales\nJune 29, 2024\n% of  Segment\nNet Sales\nChange\n% Change\nPower & Control\n$\n646 \n56.7 \n%\n$\n591 \n57.4 \n%\n$\n55 \n9.3 \n%\nAirframe\n569 \n53.8 \n%\n503 \n51.6 \n%\n66 \n13.1 \n%\nNon-aviation\n17 \n42.5 \n%\n18 \n41.9 \n%\n(1)\n(5.6)\n%\nTotal segment EBITDA As Defined\n1,232 \n55.1 \n%\n1,112 \n54.3 \n%\n120 \n10.8 \n%\nLess: Unallocated corporate EBITDA As Defined\n15 \n0.7 \n%\n(1)\n21 \n1.0 \n%\n(1)\n(6)\n(28.6)\n%\nTotal Company EBITDA As Defined\n$\n1,217 \n54.4 \n%\n(1)\n$\n1,091 \n53.3 \n%\n(1)\n$\n126 \n11.5 \n%\n \n(1)\nCalculated as a percentage of consolidated net sales.\n34\nTable of Contents\nEBITDA As Defined for the Power & Control segment increased approximately $55 million, an increase of 9.3%, resulting primarily from the higher organic sales in commercial aftermarket and defense. Also contributing to the increase in EBITDA As Defined was the application of our three core value-driven operating strategy and positive leverage on our fixed overhead costs spread over a higher production volume. \nEBITDA As Defined for the Airframe segment increased approximately $66 million, an increase of 13.1%. The increase in EBITDA As Defined for the Airframe segment is attributable to the same factors described in the paragraph above for the Power & Control segment.  \nEBITDA As Defined from acquisitions for the Power & Control and Airframe segments, in the aggregate, was not material to the increase in EBITDA as Defined. EBITDA As Defined from acquisitions represents EBITDA As Defined from acquired businesses for the period up to one year from the respective acquisition date.\nThe change in Non-aviation EBITDA As Defined compared to the thirteen week period in the prior fiscal year was not material. \nCorporate expenses consist primarily of compensation, benefits, professional services and other administrative costs incurred by the corporate offices. An immaterial amount of corporate expenses is allocated to the operating segments.\nThirty-nine week period ended June 28, 2025 compared with the thirty-nine week period ended June 29, 2024 \nTotal Company\n•\nNet Sales\n.\n Net organic sales and acquisition sales and the related dollar and percentage changes for the thirty-nine week periods ended June 28, 2025 and June 29, 2024 were as follows (amounts in millions):\nThirty-Nine Week Periods Ended\n% Change\nNet Sales\nJune 28, 2025\nJune 29, 2024\nChange\nOrganic sales\n$\n6,092 \n$\n5,712 \n$\n380 \n6.6 \n%\nAcquisition sales\n302 \n42 \n260 \n4.5 \n%\nNet sales\n$\n6,394 \n$\n5,754 \n$\n640 \n11.1 \n%\nOrganic sales represent net sales from existing businesses owned by the Company, excluding sales from acquisitions. Acquisition sales represent net sales from acquired businesses for the period up to one year from the respective acquisition date. We believe this measure provides investors with a supplemental understanding of underlying sales trends by providing sales growth on a consistent basis. Refer to Note 2, “Acquisitions,” in the notes to the condensed consolidated financial statements included herein for information on the Company's recent acquisitions. \nThe increase in organic sales of $380 million for the thirty-nine week period ended June 28, 2025 compared to the thirty-nine week period ended June 29, 2024 is primarily related to increases in defense sales ($271 million, an increase of 12.3%) and commercial aftermarket sales ($168 million, an increase of 9.5%), partially offset by a decrease in commercial OEM sales ($50 million, a decrease of 3.9%). The increase in defense sales is primarily attributable to continued improving U.S. Government defense spend outlays. The increase in commercial aftermarket sales is primarily attributable to the strong demand for air travel resulting in higher flight hours and utilization of aircraft. The decrease in commercial OEM sales is primarily attributable to the prolonged supply chain and labor challenges being encountered by aircraft manufacturers and resulting production delays of new aircraft.\nThe increase in acquisition sales for the thirty-nine week period ended June 28, 2025 is primarily attributable to the fiscal 2024 acquisitions of Raptor Scientific, CPI's Electron Device Business, SEI and FPT Industries LLC (“FPT”).\n35\nTable of Contents\n•\nCost of Sales and Gross Profit\n.\n Cost of sales increased by $212 million, or 9.1%, to $2,553 million for the thirty-nine week period ended June 28, 2025 compared to $2,341 million for the thirty-nine week period ended June 29, 2024. Cost of sales and the related percentage of net sales for the thirty-nine week periods ended June 28, 2025 and June 29, 2024 were as follows (amounts in millions):\nThirty-Nine Week Periods Ended\nJune 28, 2025\nJune 29, 2024\nChange\n% Change\nCost of sales - excluding costs below\n$\n2,553 \n$\n2,337 \n$\n216 \n9.2 \n%\n% of net sales\n39.9 \n%\n40.6 \n%\nNon-cash stock and deferred compensation expense\n12 \n16 \n(4)\n(25.0)\n%\n% of net sales\n0.2 \n%\n0.3 \n%\nForeign currency losses\n11 \n3 \n8 \n266.7 \n%\n% of net sales\n0.2 \n%\n0.1 \n%\nInventory step-up amortization\n9 \n8 \n1 \n12.5 \n%\n% of net sales\n0.1 \n%\n0.1 \n%\nAcquisition integration costs\n6 \n1 \n5 \n500.0 \n%\n% of net sales\n0.1 \n%\n— \n%\nLoss contract amortization\n(38)\n(24)\n(14)\n(58.3)\n%\n% of net sales\n(0.6)\n%\n(0.5)\n%\nTotal cost of sales\n$\n2,553 \n$\n2,341 \n$\n212 \n9.1 \n%\n% of net sales\n39.9 \n%\n40.7 \n%\nGross profit (Net sales less Total cost of sales)\n$\n3,841 \n$\n3,413 \n$\n428 \n12.5 \n%\nGross profit percentage (Gross profit / Net sales)\n60.1 \n%\n59.3 \n%\nCost of sales during the thirty-nine week period ended June 28, 2025 decreased as a percentage of net sales. This was primarily driven by the application of our three core value-driven operating strategy (obtaining profitable new business, continually improving our cost structure and providing highly engineered value-added products to customers) coupled with fixed overhead costs incurred being spread over a higher production volume.  \n•\nSelling and Administrative Expenses.\n Selling and administrative expenses decreased by $26 million to $689 million, or 10.8% of net sales, for the thirty-nine week period ended June 28, 2025 from $715 million, or 12.4% of net sales, for the thirty-nine week period ended June 29, 2024. Selling and administrative expenses and the related percentage of net sales for the thirty-nine week periods ended June 28, 2025 and June 29, 2024 were as follows (amounts in millions):\nThirty-Nine Week Periods Ended\nJune 28, 2025\nJune 29, 2024\nChange\n% Change\nSelling and administrative expenses - excluding costs below\n$\n561 \n$\n539 \n$\n22 \n4.1 \n%\n% of net sales\n8.8 \n%\n9.4 \n%\nNon-cash stock and deferred compensation expense\n112 \n142 \n(30)\n(21.1)\n%\n% of net sales\n1.8 \n%\n2.5 \n%\nAcquisition integration costs\n14 \n5 \n9 \n180.0 \n%\n% of net sales\n0.2 \n%\n0.1 \n%\nAcquisition transaction-related expenses\n2 \n29 \n(27)\n(93.1)\n%\n% of net sales\n— \n%\n0.5 \n%\nTotal selling and administrative expenses\n$\n689 \n$\n715 \n$\n(26)\n(3.6)\n%\n% of net sales\n10.8 \n%\n12.4 \n%\nSelling and administrative expenses as a percentage of net sales for the thirty-nine week period ended June 28, 2025 decreased compared to the thirty-nine week period ended June 29, 2024 primarily due to the decrease in non-cash stock and deferred compensation expense and acquisition-transaction related expenses. The decrease in non-cash stock and deferred compensation expense is primarily attributable to the appreciation of the stock price at a higher rate during the first nine months of fiscal 2024 compared to the first nine months of fiscal 2025, as the stock price is a key input used to determine the Black-Scholes fair value for the non-cash stock compensation expense, and lower deferred compensation expense. Acquisition transaction-related expenses decreased due to a lower volume of business combinations completed year-to-date compared to fiscal 2024.\n36\nTable of Contents\n•\nAmortization of Intangible Assets.\n Amortization of intangible assets was $148 million for the thirty-nine week period ended June 28, 2025 compared to $110 million for the thirty-nine week period ended June 29, 2024. The increase in amortization expense of $38 million was primarily due to the amortization expense recognized on intangible assets from the fiscal 2024 acquisitions.  \n•\nInterest Expense-net.\n Interest expense-net includes interest on borrowings outstanding, amortization of debt issuance costs and original issue discount, revolving credit facility fees, finance leases, interest income and the impact of interest rate swaps and caps designated and qualifying as cash flow hedges. Interest expense-net increased $209 million, or 22.2%, to $1,152 million for the thirty-nine week period ended June 28, 2025 from $943 million for the comparable thirty-nine week period in the prior fiscal year. The increase in interest expense-net was primarily due to an increase in outstanding borrowings and a $62 million decrease in interest income. The weighted average interest rate for cash interest payments on total borrowings outstanding was 6.2% for the thirty-nine week period ended June 28, 2025 compared to 6.1% for the thirty-nine week period ended June 29, 2024.\n•\nRefinancing Costs. \nRefinancing costs of $7 million incurred for the thirty-nine week period ended June 28, 2025 were primarily related to the write-off of unamortized debt issuance costs recorded in conjunction with the redemption of the 5.50% 2027 Notes. Refinancing costs of $59 million incurred for the thirty-nine week period ended June 29, 2024 were primarily related to the write-off of unamortized debt issuance costs recorded in conjunction with the redemption of the 2026 Secured Notes.\n•\nOther Income.\n Other income was $31 million for the thirty-nine week period ended June 28, 2025 compared to $24 million recorded for the thirty-nine week period ended June 29, 2024. Other income for the thirty-nine week period ended June 28, 2025 primarily related to a gain on sale of business, royalty and other income and the non-service related components of benefit costs on the Company's benefit plans. Other income for the thirty-nine week period ended June 29, 2024 primarily related to royalty and other income and the non-service related components of benefit costs on the Company's benefit plans.\n•\nIncome Tax Provision.\n Income tax expense as a percentage of income before income taxes was approximately 21.9% for the thirty-nine week period ended June 28, 2025 compared to 22.5% for the thirty-nine week period ended June 29, 2024. The Company’s lower effective tax rate for the thirty-nine week period ended June 28, 2025 was primarily due to a less significant increase in the valuation allowance applicable to Company's net interest deduction limitation, and a lower effective tax rate on non-U.S. earnings, slightly offset by a less significant benefit associated with share-based payments when compared to the same period in 2024. \n•\nNet Income Attributable to TD Group\n.\n Net income attributable to TD Group increased $218 million, or 17.5%, to $1,464 million for the thirty-nine week period ended June 28, 2025 compared to net income attributable to TD Group of $1,246 million for the thirty-nine week period ended June 29, 2024, primarily as a result of the factors referenced above. \n•\nEarnings per Share.\n Basic and diluted earnings per share was $24.31 for the thirty-nine week period ended June 28, 2025 and $19.81 for the thirty-nine week period ended June 29, 2024. Net income attributable to TD Group for the thirty-nine week period ended June 28, 2025 of $1,464 million was decreased by dividend equivalent payments of $49 million, or $0.83 per share, resulting in net income applicable to TD Group common stockholders of $1,415 million. Net income attributable to TD Group for the thirty-nine week period ended June 29, 2024 of $1,246 million was decreased by dividend equivalent payments of $101 million, or $1.75 per share, resulting in net income applicable to TD Group common stockholders of $1,145 million.\nBusiness Segments\n•\nSegment Net Sales\n.\n Net sales by segment for the thirty-nine week periods ended June 28, 2025 and June 29, 2024 were as follows (amounts in millions):\nThirty-Nine Week Periods Ended\nJune 28, 2025\n% of Net Sales\nJune 29, 2024\n% of Net Sales\nChange\n% Change\nPower & Control\n$\n3,274 \n51.2 \n%\n$\n2,838 \n49.3 \n%\n$\n436 \n15.4 \n%\nAirframe\n3,007 \n47.0 \n%\n2,795 \n48.6 \n%\n212 \n7.6 \n%\nNon-aviation\n113 \n1.8 \n%\n121 \n2.1 \n%\n(8)\n(6.6)\n%\n    Net sales\n$\n6,394 \n100.0 \n%\n$\n5,754 \n100.0 \n%\n$\n640 \n11.1 \n%\n37\nTable of Contents\nNet sales for the Power & Control segment increased $436 million, an increase of 15.4%, for the thirty-nine week period ended June 28, 2025 compared to the thirty-nine week period ended June 29, 2024. The sales increase resulted primarily from increases in organic sales in defense ($136 million, an increase of 10.2%) and commercial aftermarket ($80 million, an increase of 9.2%). The increase in defense sales is primarily attributable to continued improving U.S. Government defense spend outlays. The increase in commercial aftermarket sales is primarily attributable to the strong demand for air travel resulting in higher flight hours and utilization of aircraft.  \nNet sales for the Airframe segment increased $212 million, an increase of 7.6%, for the thirty-nine week period ended June 28, 2025 compared to the thirty-nine week period ended June 29, 2024. The sales increase resulted primarily from increases in organic sales in defense ($137 million, an increase of 15.7%) and commercial aftermarket ($88 million, an increase of 9.9%). The increase in defense sales and commercial aftermarket sales for the Airframe segment is attributable to the same factors described in the paragraph above for the Power & Control segment. \nAcquisition sales for the Power & Control and Airframe segments contributed approximately $260 million in aggregate to the increase in net sales. Acquisition sales represent net sales from acquired businesses for the period up to one year from the respective acquisition date.\nThe change in Non-aviation net sales compared to the thirty-nine week period in the prior fiscal year was not material.\n•\nEBITDA As Defined\n.\n Refer to “Non-GAAP Financial Measures” in this discussion and analysis for additional information and limitations regarding these non-GAAP financial measures, including a reconciliation to the comparable U.S. GAAP financial measure. EBITDA As Defined by segment for the thirty-nine week periods ended June 28, 2025 and June 29, 2024 were as follows (amounts in millions):\n \nThirty-Nine Week Periods Ended\n \n \n \nJune 28, 2025\n% of  Segment\nNet Sales\nJune 29, 2024\n% of  Segment\nNet Sales\nChange\n% Change\nPower & Control\n$\n1,868 \n57.1 \n%\n$\n1,626 \n57.3 \n%\n$\n242 \n14.9 \n%\nAirframe\n1,613 \n53.6 \n%\n1,443 \n51.6 \n%\n170 \n11.8 \n%\nNon-aviation\n45 \n39.8 \n%\n48 \n39.7 \n%\n(3)\n(6.3)\n%\nTotal segment EBITDA As Defined\n3,526 \n55.1 \n%\n3,117 \n54.2 \n%\n409 \n13.1 \n%\nLess: Unallocated corporate EBITDA As Defined\n85 \n1.3 \n%\n(1)\n94 \n1.7 \n%\n(1)\n(9)\n(9.6)\n%\nTotal Company EBITDA As Defined\n$\n3,441 \n53.8 \n%\n(1)\n$\n3,023 \n52.5 \n%\n(1)\n$\n418 \n13.8 \n%\n \n(1)\nCalculated as a percentage of consolidated net sales.\nEBITDA As Defined for the Power & Control segment increased approximately $242 million, an increase of 14.9%, resulting primarily from higher organic sales in defense and commercial aftermarket. Also contributing to the increase in EBITDA As Defined was the application of our three core value-driven operating strategy and positive leverage on our fixed overhead costs spread over a higher production volume. \nEBITDA As Defined for the Airframe segment increased approximately $170 million, an increase of 11.8%. The increase in EBITDA As Defined for the Airframe segment is attributable to the same factors described in the paragraph above for the Power & Control segment. \nEBITDA As Defined from acquisitions for the Power & Control and Airframe segments, in the aggregate, was not material to the increase in EBITDA As Defined. EBITDA As Defined from acquisitions represents EBITDA As Defined from acquired businesses for the period up to one year from the respective acquisition date.\nThe change in Non-aviation EBITDA As Defined compared to the thirty-nine week period in the prior fiscal year was not material. \nCorporate expenses consist primarily of compensation, benefits, professional services and other administrative costs incurred by the corporate offices. An immaterial amount of corporate expenses is allocated to the operating segments.\n38\nTable of Contents\nLiquidity and Capital Resources \nWe have historically maintained a capital structure comprising a mix of equity and debt financing. We vary our leverage both to optimize our equity return and to pursue acquisitions. We expect to meet our current debt obligations as they come due through internally generated funds from current levels of operations and/or through refinancing in the debt markets prior to the maturity dates of our debt.\nThe following tables present selected balance sheet, cash flow and other financial data relevant to the liquidity or capital resources of the Company for the periods specified below (amounts in millions):\nJune 28, 2025\nSeptember 30, 2024\nSelected Balance Sheet Data:\nCash and cash equivalents\n$\n2,792 \n$\n6,261 \nWorking capital (Total current assets less total current liabilities)\n4,704 \n3,690 \nTotal assets\n22,700 \n25,586 \nTotal debt \n(1)\n25,012 \n24,880 \nTD Group stockholders’ deficit\n(5,004)\n(6,290)\n \n(1)\nIncludes debt issuance costs and original issue discount. Reference Note 8, “Debt,” in the notes to the condensed consolidated financial statements included herein for additional information.\nThirty-Nine Week Periods Ended\nJune 28, 2025\nJune 29, 2024\nSelected Cash Flow and Other Financial Data:\nCash flows provided by (used in):\nOperating activities\n$\n1,531 \n$\n1,473 \nInvesting activities\n(349)\n(1,739)\nFinancing activities\n(4,669)\n152 \nCapital expenditures\n156 \n124 \nRatio of earnings to fixed charges \n(1)\n2.6x\n2.7x\n \n(1)\nFor purposes of computing the ratio of earnings to fixed charges, earnings consist of income from continuing operations before income taxes plus fixed charges. Fixed charges consist of interest expense, amortization of debt issuance costs and original issue discount and the “interest component” of rental expense.\nSignificant Transactions\n \nof Fiscal 2025\n•\nOn October 18, 2024, the Company paid the special cash dividend of $75.00 per outstanding share of common stock declared in September 2024, totaling $4,216 million, and $131 million in cash dividend equivalent payments on vested options outstanding under its stock option plans associated with the September 2024 dividend declaration. \n•\nFor the thirty-nine week period ended June 28, 2025, the Company repurchased 401,036 shares of common stock at an average price of $1,246.71 per share for a total amount of $500 million. Whether the Company undertakes additional share repurchases or other aforementioned activities will depend on prevailing market conditions, the Company's liquidity requirements, contractual restrictions and other factors.\n•\nOn May 20, 2025, the Company completed the issuance of $2,650 million in 6.375% senior subordinated notes due 2033, which the net proceeds of approximately $2,615 million, along with existing cash on hand, were used to redeem all of its outstanding $2,650 million in 5.50% senior subordinated notes due 2027. The redemption occurred on June 20, 2025. \n•\nOn June 30, 2025, the Company entered into a definitive agreement to acquire all the outstanding stock of the Simmonds Precision Products, Inc. Business (“Simmonds”) of Goodrich Corporation from RTX Corporation for approximately $765 million in cash. The acquisition is subject to regulatory approvals in the United States and customary closing conditions.\n•\nOn July 1, 2025, the Company acquired Servotronics, Inc. (“Servotronics”) via a tender offer for $47.00 per share in cash. The total purchase price was approximately $133 million in cash.\n39\nTable of Contents\n•\nOn July 11, 2025, the Company amended its trade receivable securitization facility (the “Securitization Facility”) to, among other things, (i) increase the borrowing capacity from $650 million to $725 million; and (ii) extend the maturity date to July 10, 2026 at an interest rate of Term SOFR plus 1.35% compared to an interest rate of Term SOFR plus 1.45% that applied prior to the amendment. Prior to the amendment, the Securitization Facility was fully drawn.\n* * * * * \nIf the Company has excess cash, it generally prioritizes allocating the excess cash in the following manner: (1) capital spending at existing businesses, (2) acquisitions of businesses, (3) payment of a special dividend and/or repurchases of our common stock and (4) prepayment of indebtedness or repurchase of debt.\nThe Company’s ability to make scheduled interest payments on, or to refinance, the Company’s indebtedness, or to fund non-acquisition related capital expenditures and research and development efforts, will depend on the Company’s ability to generate cash in the future. This is subject to general economic, financial, competitive, legislative, regulatory and other factors that are beyond its control.\nThe Company's objective is to maintain an allocation of at least 75% fixed rate and 25% variable rate debt thereby limiting its exposure to changes in near-term interest rates. Interest rate swaps, caps and collars used to hedge and offset, respectively, the variable interest rates on our term loans are further described in Note 11, “Derivatives and Hedging Activities,” in the notes to the condensed consolidated financial statements included herein.\n As of June 28, 2025, approximately 75% of our gross debt was fixed rate.\nAs of June 28, 2025, the Company has significant cash liquidity as illustrated in the table presented below (in millions): \nAs of June 28, 2025\nCash and cash equivalents\n$\n2,792 \nAvailability on revolving credit facility\n856 \nCash liquidity\n$\n3,648 \nWe believe our significant cash liquidity will allow us to meet our anticipated funding requirements. We expect to meet our short-term cash liquidity requirements (including interest obligations and capital expenditures) through net cash from operating activities, cash on hand and, if needed, draws on the revolving credit facility. Long-term cash liquidity requirements consist primarily of obligations under our long-term debt agreements. There is no maturity on any tranche of term loans or notes until August 2028.\nIn connection with the continued application of our three core value-driven operating strategy (obtaining profitable new business, continually improving our cost structure and providing highly engineered value-added products to customers), we expect our efforts will continue to generate strong margins and provide sufficient cash provided by operating activities to meet our interest obligations and liquidity needs. We believe our cash provided by operating activities and available borrowing capacity will enable us to make strategic business acquisitions, pay dividends to our shareholders and make opportunistic investments in our own stock, subject to any restrictions in our existing credit agreement and market conditions.  \nThe Company may issue additional debt if prevailing market conditions are favorable to doing so. In addition, the Company may increase its borrowings in connection with acquisitions, if cash flow from operating activities becomes insufficient to fund current operations or for other short-term cash needs or for common stock repurchases or dividends. Our future leverage will also be impacted by the then current conditions of the credit markets.\nOperating Activities.\n The Company generated $1,531 million of net cash from operating activities during the thirty-nine week period ended June 28, 2025 compared to $1,473 million during the thirty-nine week period ended June 29, 2024. \nThe change in accounts receivable during the thirty-nine week period ended June 28, 2025 was a use of cash of $126 million compared to a use of cash of $22 million during the thirty-nine week period ended June 29, 2024. The increase in the use of cash of $104 million is primarily attributable to the timing of cash receipts. The Company continues to actively manage its accounts receivable, the related agings and collection efforts.\nThe change in inventories during the thirty-nine week period ended June 28, 2025 was a use of cash of $167 million compared to a use of cash of $140 million during the thirty-nine week period ended June 29, 2024.  The slight increase in the use of cash is due to an increase in raw materials to support the expected higher fourth quarter sales activity compared to prior year. The Company continues to actively and strategically manage inventory levels in response to the ongoing supply chain challenges.  \nThe change in accounts payable during the thirty-nine week period ended June 28, 2025 was a source of cash of $1 million compared to a use of cash of $9 million during the thirty-nine week period ended June 29, 2024. The change is due to the timing of payments to suppliers. \n40\nTable of Contents\nInvesting Activities\n. Net cash used in investing activities was $349 million during the thirty-nine week period ended June 28, 2025, consisting primarily of acquisitions of certain product lines completed during the first nine months of fiscal 2025 for $239 million and capital expenditures of $156 million; partially offset by other investing transactions inflows of $46 million. \nNet cash used in investing activities was $1,739 million during the thirty-nine week period ended June 29, 2024, consisting of $1,686 million from the acquisitions of CPI's Electron Device Business, SEI, FPT and certain product lines completed during the first nine months of fiscal 2024, capital expenditures of $124 million; partially offset by other investing transactions inflows of $71 million.\nFinancing Activities.\n Net cash used in financing activities was $4,669 million during the thirty-nine week period ended June 28, 2025. The use of cash was primarily attributable to dividend and dividend equivalent payments of $4,396 million, repurchases of common stock of $500 million and principal payments on the term loans of $44 million; primarily offset by proceeds from stock option exercises of $147 million and the net proceeds of short-term and long-term debt transactions, including fees, of $128 million.\nNet cash provided by financing activities was $152 million during the thirty-nine week period ended June 29, 2024. The source of cash was primarily attributable to the net proceeds of short-term and long-term debt transactions, including fees, of $2,004 million, plus proceeds from stock option exercises of $213 million; primarily offset by dividend and dividend equivalent payments of $2,038 million and principal payments on the term loans of $27 million.\nContractual Obligations\nWe have future obligations under various contracts relating to debt and interest payments, finance and operating leases, pension and post-retirement benefit plans and purchase obligations. During the thirty-nine week period ended June 28, 2025, other than the financing activities further described in Note 8, “Debt,” in the notes to the condensed consolidated financial statements included herein, there were no material changes to these obligations as reported in our Annual Report on Form 10-K for the fiscal year ended September 30, 2024.\nDescription of Senior Secured Term Loans and Indentures\nSenior Secured Term Loans Facilities\nAs of June 28, 2025, TransDigm has $8,659 million in fully drawn term loans (the “Term Loans Facility”) and a $910 million revolving credit facility. The Term Loans Facility consists of four tranches of term loans as follows (aggregate principal amount disclosed is as of June 28, 2025): \nTerm Loans Facility\nAggregate Principal\nMaturity Date\nInterest Rate\nTranche I\n$1,862 million\nAugust 24, 2028\nTerm SOFR plus 2.75%\nTranche J\n$3,614 million\nFebruary 28, 2031\nTerm SOFR plus 2.50%\nTranche K\n$1,691 million\nMarch 22, 2030\nTerm SOFR plus 2.75%\nTranche L\n$1,492 million\nJanuary 19, 2032\nTerm SOFR plus 2.50%\nThe Term Loans Facility requires quarterly aggregate principal payments of $22 million. The revolving commitments consist of two tranches which include up to $139 million of multicurrency revolving commitments. At June 28, 2025, the Company had $54 million in letters of credit outstanding and $856 million in borrowings available under the revolving commitments. Draws on the revolving commitments are subject to an interest rate of Term SOFR plus 2.25%. The unused portion of the revolving commitments is subject to a fee of 0.5% per annum. The maturity date of the revolving credit facility is February 27, 2029.\nThe interest rates per annum applicable to the Term Loans Facility under the Second Amended and Restated Credit Agreement dated as of June 4, 2014 (the “Credit Agreement”) are, at TransDigm’s option, equal to either an alternate base rate or an adjusted Term SOFR for one, three or six-month interest periods chosen by TransDigm, in each case plus an applicable margin percentage. The adjusted Term SOFR related to the Term Loans Facility are not subject to a floor. Refer to Note 11, “Derivatives and Hedging Activities,” in the notes to the condensed consolidated financial statements included herein for information about how our interest rate swap, cap and collar agreements are used to hedge and offset, respectively, the variable interest rate portion of our debt.\n41\nTable of Contents\nIndentures\nThe following table represents the senior subordinated and secured notes outstanding as of June 28, 2025:\nDescription\nAggregate Principal\nMaturity Date\nInterest Rate\n2028 Secured Notes\n$2,100 million\nAugust 15, 2028\n6.75%\n4.625% 2029 Notes\n$1,200 million\nJanuary 15, 2029\n4.625%\n2029 Secured Notes\n$2,750 million\nMarch 1, 2029\n6.375%\n4.875% 2029 Notes\n$750 million\nMay 1, 2029\n4.875%\n2030 Secured Notes\n$1,450 million\nDecember 15, 2030\n6.875%\n2031 Secured Notes\n$1,000 million\nDecember 1, 2031\n7.125%\n2032 Secured Notes\n$2,200 million\nMarch 1, 2032\n6.625%\n2033 Secured Notes\n$1,500 million\nJanuary 15, 2033\n6.00%\n6.375% 2033 Notes\n$2,650 million\nMay 31, 2033\n6.375%\nThe 4.625% 2029 Notes and the 4.875% 2029 Notes were issued at a price of 100.00% of the principal amount. The 6.375% 2033 Notes (which, along with the 4.625% 2029 Notes and the 4.875% 2029 Notes, are collectively referred to as the “Subordinated Notes”) were issued at a price of 99.225% of the principal amount. The 2030 Secured Notes, 2032 Secured Notes and 2033 Secured Notes (which, along with the 2028 Secured Notes, 2029 Secured Notes and 2031 Secured Notes, are collectively referred to as the “Secured Notes”) were issued at a price of 100.00% of its principal amount. The initial $1,000 million offering and the subsequent $1,100 million offering of the 6.75% senior secured notes due 2028 (collectively, the “2028 Secured Notes”) in the second quarter of fiscal 2023 were issued at a price of 100.00% and 99.00%, respectively, of their principal amount, resulting in gross proceeds of $2,089 million. The 2031 Secured Notes were issued at a price of 99.25% of its principal amount, resulting in gross proceeds of $993 million. The initial $2,200 million offering and subsequent $550 million offering of the 6.375% senior secured notes due 2029 (collectively, the “2029 Secured Notes”) were issued at a price of 100.00% and 99.75%, respectively, of their principal amount, resulting in gross proceeds of $2,749 million. \nThe Subordinated Notes and Secured Notes do not require principal payments prior to their maturity. Interest under the Subordinated Notes and Secured Notes are payable semi-annually. The Subordinated Notes represent our unsecured obligations ranking subordinate to our senior debt, as defined in the applicable indentures. The Secured Notes represent our secured obligations ranking equally to all existing and future senior debt, as defined in the applicable indentures. The Subordinated Notes and Secured Notes contain many of the restrictive covenants included in the Credit Agreement. TransDigm is in compliance with all of the covenants contained in the Subordinated Notes and Secured Notes.\nGuarantor Information\nThe Subordinated Notes are subordinated to all of our existing and future senior secured debt, including indebtedness under TransDigm’s existing senior secured credit facilities, rank equally with all of our existing and future senior subordinated debt and rank senior to all of our future debt that is expressly subordinated to the Subordinated Notes. The 4.625% 2029 Notes and the 4.875% 2029 Notes are fully and unconditionally guaranteed on a senior subordinated unsecured basis by TD Group, TransDigm UK and TransDigm Inc.’s Domestic Restricted Subsidiaries (as defined in the applicable indentures). The 6.375% 2033 Notes are guaranteed, on a senior subordinated basis, by TransDigm Group and each of TransDigm Inc.’s direct and indirect restricted subsidiaries that is a borrower or guarantor under TransDigm’s senior secured credit facilities or that issues or guarantees any capital markets indebtedness of TransDigm or any of the guarantors in an aggregate principal amount of at least $200 million. The table set forth in Exhibit 22.1 filed with this Form 10-Q details the primary obligors and guarantors. The guarantees of the Subordinated Notes are subordinated to all of the guarantors’ existing and future senior debt, rank equally with all of their existing and future senior subordinated debt and rank senior to all of their future debt that is expressly subordinated to the guarantees of the Subordinated Notes. The Subordinated Notes are structurally subordinated to all of the liabilities of TD Group’s non-guarantor subsidiaries.\n42\nTable of Contents\nThe Secured Notes are senior secured debt of TransDigm and rank equally in right of payment with all of TransDigm’s existing and future senior secured debt, including indebtedness under TransDigm’s existing senior secured credit facilities, and are senior in right of payment to all of TransDigm’s existing and future senior subordinated debt, including the Subordinated Notes. The 2028 Secured Notes are guaranteed on a senior secured basis by TD Group, TransDigm UK and TransDigm Inc.’s Domestic Restricted Subsidiaries (as defined in the applicable indentures). The 2029 Secured Notes, 2030 Secured Notes, 2031 Secured Notes, 2032 Secured Notes and 2033 Secured Notes are guaranteed on a senior secured basis by TD Group and each of TransDigm Inc.’s direct and indirect Restricted Subsidiaries (as defined in the applicable indenture) that is a borrower or guarantor under TransDigm’s senior secured credit facilities or that issues or guarantees any capital markets indebtedness of TransDigm Inc. or any of the guarantors in an aggregate principal amount of at least $200 million. As of the date of this Form 10-Q, the guarantors of the 2029 Secured Notes, 2030 Secured Notes, 2031 Secured Notes, 2032 Secured Notes and 2033 Secured Notes are the same as the guarantors of the 2028 Secured Notes. The table set forth in Exhibit 22.1 filed with this Form 10-Q details the primary obligors and guarantors. The guarantees of the Secured Notes rank equally in right of payment with all of the guarantors’ existing and future senior secured debt and are senior in right of payment to all of their existing and future senior subordinated debt. The Secured Notes are structurally subordinated to all of the liabilities of TransDigm’s non-guarantor subsidiaries.\nSeparate financial statements of TransDigm Inc. are not presented because the Subordinated Notes and Secured Notes are fully and unconditionally guaranteed on a senior subordinated unsecured basis (if Subordinated Notes) and senior secured basis (if Secured Notes) by TD Group, TransDigm UK and all of TransDigm Inc.'s Domestic Restricted Subsidiaries. TD Group has no significant operations or assets separate from its investment in TransDigm Inc.\nThe financial information presented is that of TD Group, TransDigm Inc. and the other Guarantors, which includes TransDigm UK, on a combined basis and the financial information of non-issuer and non-guarantor subsidiaries has been excluded. Intercompany balances and transactions between TD Group, TransDigm Inc. and the other Guarantors have been eliminated, and amounts due from, amounts due to, and transactions with non-issuer and non-guarantor subsidiaries have been presented separately.\n(in millions)\nAs of June 28, 2025\nCurrent assets\n$\n4,118 \nGoodwill\n8,250 \nOther non-current assets\n3,961 \nCurrent liabilities\n1,039 \nNon-current liabilities\n25,123 \nAmounts due (from) to subsidiaries that are non-issuers and non-guarantors-net\n(2,083)\nThirty-Nine Week Period Ended\n(in millions)\nJune 28, 2025\nNet sales\n$\n5,043 \nSales to subsidiaries that are non-issuers and non-guarantors\n25 \nCost of sales\n1,954 \nExpense from subsidiaries that are non-issuers and non-guarantors-net\n48 \nIncome from operations\n1,008 \nNet income attributable to TD Group\n1,008 \nCertain Restrictive Covenants in Our Debt Documents\nThe Credit Agreement and the Indentures governing the Notes and Secured Notes contain restrictive covenants that, among other things, limit the incurrence of additional indebtedness, the payment of special dividends, transactions with affiliates, asset sales, acquisitions, mergers and consolidations, liens and encumbrances, and prepayments of certain other indebtedness.\nThe restrictive covenants included in the Credit Agreement are subject to amendments executed periodically. The most recent amendment that impacted the restrictive covenants contained in the Credit Agreement is Amendment No. 15, executed on March 22, 2024.  \nUnder the terms of the Credit Agreement, TransDigm is entitled, on one or more occasions, to request additional term loans or additional revolving commitments to the extent that the existing or new lenders agree to provide such incremental term loans or additional revolving commitments provided that, among other conditions, our consolidated net leverage ratio would be no greater than 7.25x and the consolidated secured net debt ratio would be no greater than 5.00x, in each case, after giving effect to such incremental term loans or additional revolving commitments.\n43\nTable of Contents\nIf any such default occurs, the lenders under the Credit Agreement and the holders of the Notes and Secured Notes may elect to declare all outstanding borrowings, together with accrued interest and other amounts payable thereunder, to be immediately due and payable. The lenders under the Credit Agreement also have the right in these circumstances to terminate any commitments they have to provide further borrowings. In addition, following an event of default under the Credit Agreement, the lenders thereunder and the holders of the Secured Notes will have the right to proceed against the collateral granted to them to secure the debt, which includes our available cash, and they will also have the right to prevent us from making debt service payments on the Notes.\nWith the exception of the revolving credit facility, the Company has no maintenance covenants in its existing term loan and indenture agreements. Under the Credit Agreement, if the usage of the revolving credit facility exceeds 40% (or, currently, $364 million) of the total revolving commitments, the Company is required to maintain a maximum consolidated net leverage ratio of net debt to trailing four-quarter EBITDA As Defined of 7.50x (or, solely with respect to the first four fiscal quarters ending after the consummation of any material acquisition, 8.00x) as of the last day of the fiscal quarter.  \nAs of June 28, 2025, the Company was in compliance with all of its debt covenants and expects to remain in compliance with its debt covenants in subsequent periods. \nTrade Receivable Securitization Facility\nDuring fiscal 2014, the Company established a trade receivable securitization facility (the “Securitization Facility”). The Securitization Facility effectively increases the Company’s borrowing capacity depending on the amount of the domestic operations’ trade accounts receivable. The Securitization Facility is collateralized by substantially all of the Company’s domestic operations’ trade accounts receivable. The Securitization Facility includes the right for the Company to exercise annual one year extensions as long as there have been no termination events as defined by the agreement. The Company uses the proceeds from the Securitization Facility as an alternative to other forms of debt, effectively reducing borrowing costs. \nDuring the first quarter of fiscal 2025, the Company drew the remaining $163 million available under the Securitization Facility, bringing the total drawn to $650 million. At June 28, 2025, the total drawn remained at $650 million and the applicable interest rate was 5.73%. \nOn July 11, 2025, the Company amended the Securitization Facility to, among other things, (i) increase the borrowing capacity from $650 million to $725 million; and (ii) extend the maturity date to July 10, 2026 at an interest rate of Term SOFR plus 1.35% compared to an interest rate of Term SOFR plus 1.45% that applied prior to the amendment.\nDividend and Dividend Equivalent Payments\nPursuant to the Fourth Amended and Restated TransDigm Group Incorporated 2006 Stock Incentive Plan Dividend Equivalent Plan, the Amended and Restated 2014 Stock Option Plan Dividend Equivalent Plan and the 2019 Stock Option Plan Dividend Equivalent Plan, all of the vested options granted under the existing stock option plans, except for grants to the members of the Board of Directors, are entitled to certain dividend equivalent payments in the event of the declaration of a dividend by the Company. In August 2022, all members of the Board of Directors at that time executed amendments to their option agreements resulting in the directors no longer receiving dividend equivalent payments in cash, but rather for dividends declared after June 1, 2022, dividends result in a reduction of strike price. \nNo dividends were declared in the thirty-nine week period ended June 28, 2025. In September 2024, TransDigm's Board of Directors authorized and declared a special cash dividend of $75.00 on each outstanding share of common stock. On October 18, 2024, the Company paid the special cash dividend, totaling $4,216 million. Dividend equivalent payments are made during the Company's first fiscal quarter each year and also upon payment of any dividends declared. Total dividend equivalent payments in the first quarter of fiscal 2025 were approximately $180 million, $131 million of which was associated with the September 2024 special dividend declaration. \nAny future declaration of special cash dividends on our common stock will be at the discretion of our Board of Directors and will depend upon our results of operations, earnings, capital requirements, financial condition, future prospects, contractual restrictions under the Credit Agreement and indentures governing the Notes, the availability of surplus under Delaware law and other factors deemed relevant by our Board of Directors. TD Group is a holding company and conducts all of its operations through direct and indirect subsidiaries. Unless TD Group receives dividends, distributions, advances, transfers of funds or other payments from our subsidiaries, TD Group will be unable to pay any dividends on our common stock in the future. The ability of any subsidiaries to take any of the foregoing actions is limited by the terms of our Term Loans Facility and indentures and may be limited by future debt or other agreements that we may enter into.\nOff-Balance Sheet Arrangements\nThe Company utilizes letters of credit to back certain payment and performance obligations. Letters of credit are subject to limits based on amounts outstanding under the Company’s revolving credit facility. As of June 28, 2025, the Company had $54 million in letters of credit outstanding.\n44\nTable of Contents\nNon-GAAP Financial Measures\nWe present below certain financial information based on our EBITDA and EBITDA As Defined. References to “EBITDA” mean earnings before interest, taxes, depreciation and amortization, and references to “EBITDA As Defined” mean EBITDA plus, as applicable for each relevant period, certain adjustments as set forth in the reconciliations of net income to EBITDA and EBITDA As Defined and the reconciliations of net cash provided by operating activities to EBITDA and EBITDA As Defined presented below.\nNeither EBITDA nor EBITDA As Defined is a measurement of financial performance under U.S. GAAP. We present EBITDA and EBITDA As Defined because we believe they are useful indicators for evaluating operating performance and liquidity.\nOur management believes that EBITDA and EBITDA As Defined are useful as indicators of liquidity because securities analysts, investors, rating agencies and others use EBITDA to evaluate a company’s ability to incur and service debt. In addition, EBITDA As Defined is useful to investors because the revolving credit facility under our senior secured credit facility requires compliance under certain circumstances, on a pro forma basis, with a financial covenant that measures the ratio of the amount of our secured indebtedness to the amount of our Consolidated EBITDA defined in the same manner as we define EBITDA As Defined herein.\nIn addition to the above, our management uses EBITDA As Defined to review and assess the performance of the management team in connection with employee incentive programs and to prepare its annual budget and financial projections. Moreover, our management uses EBITDA As Defined to evaluate acquisitions.\nAlthough we use EBITDA and EBITDA As Defined as measures to assess the performance of our business and for the other purposes set forth above, the use of these non-GAAP financial measures as analytical tools has limitations, and you should not consider any of them in isolation, or as a substitute for analysis of our results of operations as reported in accordance with U.S. GAAP. Some of these limitations are:\n•\nneither EBITDA nor EBITDA As Defined reflects the significant interest expense, or the cash requirements, necessary to service interest payments on our indebtedness;\n•\nalthough depreciation and amortization are non-cash charges, the assets being depreciated and amortized will often have to be replaced in the future, and neither EBITDA nor EBITDA As Defined reflects any cash requirements for such replacements;\n•\nthe omission of the substantial amortization expense associated with our intangible assets further limits the usefulness of EBITDA and EBITDA As Defined;\n•\nneither EBITDA nor EBITDA As Defined includes the payment of taxes, which is a necessary element of our operations; and\n•\nEBITDA As Defined excludes the cash expense we have incurred to integrate acquired businesses into our operations, which is a necessary element of certain of our acquisitions.\nBecause of these limitations, EBITDA and EBITDA As Defined should not be considered as measures of discretionary cash available to us to invest in the growth of our business. Management compensates for these limitations by not viewing EBITDA or EBITDA As Defined in isolation and specifically by using other U.S. GAAP measures, such as net income, net sales and operating profit, to measure our operating performance. Neither EBITDA nor EBITDA As Defined is a measurement of financial performance under U.S. GAAP, and neither should be considered as an alternative to net income or cash flow from operations determined in accordance with U.S. GAAP. Our calculation of EBITDA and EBITDA As Defined may not be comparable to the calculation of similarly titled measures reported by other companies.\n45\nTable of Contents\nThe following table sets forth a reconciliation of net income to EBITDA and EBITDA As Defined (in millions):\n \nThirteen Week Periods Ended \nThirty-Nine Week Periods Ended\n \nJune 28, 2025\nJune 29, 2024\nJune 28, 2025\nJune 29, 2024\nNet Income\n$\n493 \n$\n461 \n$\n1,465 \n$\n1,248 \nAdjustments:\nDepreciation and amortization expense\n91 \n77 \n271 \n219 \nInterest expense-net\n397 \n316 \n1,152 \n943 \nIncome tax provision\n142 \n141 \n411 \n362 \nEBITDA\n1,123 \n995 \n3,299 \n2,772 \nAdjustments:\nAcquisition transaction and integration-related expenses \n(1)\n9 \n27 \n32 \n43 \nNon-cash stock and deferred compensation expense \n(2)\n51 \n47 \n124 \n158 \nRefinancing costs \n(3)\n7 \n30 \n7 \n59 \nOther, net \n(4)\n27 \n(8)\n(21)\n(9)\nEBITDA As Defined\n$\n1,217 \n$\n1,091 \n$\n3,441 \n$\n3,023 \n \n(1)\nRepresents costs incurred to integrate acquired businesses into TD Group’s operations; facility relocation costs and other acquisition-related costs; transaction and valuation-related costs for acquisitions comprising deal fees, legal, financial and tax due diligence expenses; and amortization expense of inventory step-up recorded in connection with the purchase accounting of acquired businesses.\n(2)\nRepresents the compensation expense recognized by TD Group under our stock option plans and deferred compensation plans.\n(3)\nRepresents costs expensed related to debt financing activities, including new issuances, extinguishments, refinancings and amendments to existing agreements.\n(4)\nPrimarily represents foreign currency transaction gains or losses, payroll withholding taxes related to dividend equivalent payments and stock option exercises, non-service related pension costs, deferred compensation payments and other miscellaneous income or expense, such as gain on sale of business.\n46\nTable of Contents\nThe following table sets forth a reconciliation of net cash provided by operating activities to EBITDA and EBITDA As Defined (in millions): \nThirty-Nine Week Periods Ended\nJune 28, 2025\nJune 29, 2024\nNet cash provided by operating activities\n$\n1,531 \n$\n1,473 \nAdjustments:\n Changes in assets and liabilities, net of effects from acquisitions and sales of businesses\n326 \n218 \nInterest expense-net \n(1)\n1,124 \n912 \nIncome tax provision-current\n414 \n362 \nAmortization of inventory step-up\n(9)\n(8)\nLoss contract amortization\n38 \n24 \nRefinancing costs \n(2)\n(7)\n(59)\nGain on sale of businesses, net\n17 \n11 \nNon-cash stock and deferred compensation expense \n(3)\n(124)\n(158)\nForeign currency exchange losses\n(11)\n(3)\nEBITDA\n3,299 \n2,772 \nAdjustments:\nAcquisition transaction and integration-related expenses \n(4)\n32 \n43 \nNon-cash stock and deferred compensation expense \n(3)\n124 \n158 \nRefinancing costs \n(2)\n7 \n59 \nOther, net \n(5)\n(21)\n(9)\nEBITDA As Defined\n$\n3,441 \n$\n3,023 \n \n(1)\nRepresents interest expense, net of interest income, excluding the amortization of debt issuance costs and discount on debt.\n(2)\nRepresents costs expensed related to debt financing activities, including new issuances, extinguishments, refinancings and amendments to existing agreements.\n(3)\nRepresents the compensation expense recognized by TD Group under our stock option plans and deferred compensation plans.\n(4)\nRepresents costs incurred to integrate acquired businesses into TD Group’s operations; facility relocation costs and other acquisition-related costs; transaction and valuation-related costs for acquisitions comprising deal fees, legal, financial and tax due diligence expenses; and amortization expense of inventory step-up recorded in connection with the purchase accounting of acquired businesses.\n(5)\nPrimarily represents foreign currency transaction gains or losses, payroll withholding taxes related to dividend equivalent payments and stock option exercises, non-service related pension costs, deferred compensation payments and other miscellaneous income or expense, such as gain on sale of business.\n47\nTable of Contents"
}