{
  "source_file": "tech-20250630x10k.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nOVERVIEW\nBio-Techne and its subsidiaries, collectively doing business as Bio-Techne Corporation (Bio-Techne, we, our, us or the Company), develop, manufacture and sell life science reagents, instruments and services for the research, diagnostics and bioprocessing markets worldwide. Our broad product portfolio and application expertise enables scientific investigations into biological processes and molecular diagnostics, revealing the nature, diagnosis, etiology and progression of specific diseases. Our products aid in drug discovery efforts and provide the means for accurate clinical tests and diagnoses.\nWe manage the business in two operating segments – our Protein Sciences segment and our Diagnostics and Spatial Biology segment. Our Protein Sciences segment is a leading developer and manufacturer of high-quality biological reagents used in all aspects of life science research, diagnostics and cell and gene therapy. This segment also includes proteomic analytical tools, both manual and automated, that offer researchers and pharmaceutical manufacturers efficient and streamlined options for protein analysis, automated western blot, and multiplexed ELISA workflows. Our Diagnostics and Spatial Biology segment develops and manufactures diagnostic products, including controls, calibrators, and diagnostic assays for the regulated diagnostics market, exosome-based molecular diagnostic assays, advanced tissue-based in-situ hybridization assays and instrumentation for spatial genomic and tissue biopsy analysis, and genetic and oncology kits for research and clinical applications.\nWe are a Minnesota corporation with our global headquarters in Minneapolis, Minnesota. We were founded in 1976 as Research and Diagnostic Systems, Inc. We became a publicly traded company in 1985 through a merger with Techne Corporation, now Bio-Techne Corporation. Our common stock is listed on the NASDAQ under the symbol “TECH.” We operate globally, with offices in many locations throughout North America, Europe and Asia. Today, our product lines include hundreds of thousands of diverse products, most of which we manufacture ourselves in multiple locations in North America, as well as locations in the U.K., Canada, Switzerland and China.\nWe have implemented a disciplined strategy to accelerate growth in part by acquiring businesses and product portfolios that leveraged and diversified our existing product lines, filled portfolio gaps with differentiated high growth businesses, and expanded our geographic scope. Recent examples include the investment in Spear Bio at the beginning of fiscal 2025 and the acquisition of Lunaphore SA (“Lunaphore”) at the beginning of fiscal 2024. We also completed a 19.9% investment in Wilson Wolf Corporation (“Wilson Wolf”) in fiscal 2023, and will acquire the remaining ownership in Wilson Wolf by the end of calendar year 2027, if not earlier due to its achievement of revenue or earnings before interest, taxes, depreciation, and amortization (“EBITDA”) targets. Recognizing the importance of an integrated, global approach to meeting our mission and accomplishing our strategies, we have maintained many of the brands of the companies we have acquired, but unified under a single global brand -- Bio-Techne.\nWe are committed to providing the life sciences community with innovative, high-quality scientific tools that allow our customers to make extraordinary discoveries and treat and diagnose diseases. We intend to build on Bio-Techne’s past accomplishments, high product quality reputation and sound financial position by executing strategies that position us to serve as the standard for biological content in the research market, and to leverage that leadership position to enter the diagnostics and other adjacent markets. Our strategic pillars include:\nGrow & Leverage the Core. \nThrough collaborations with key opinion leaders, participation in scientific discussions and societies, and leveraging our internal talent we expect to be able to convert our continued significant investment in our research and development activities to be first-to-market with quality products that are at the leading edge of life science researchers’ needs.\nCapitalize on High Potential Markets.\n We will continue to leverage our strong balance sheet to gain access to new and differentiated technologies and products that improve our competitiveness in the current market, meet customers’ expanding workflow needs and allow us to enter adjacent markets.\nMarket Expansion Through Innovation & Acquisition. \nWe will leverage our existing portfolio to expand our product offerings into novel research fields and further penetrate diagnostics and therapeutics markets. \n4\n\n\nTable of Contents\nAcquisitions have, and will likely continue to play, an important role in our efforts to expand our portfolio of innovative tools and bioactive reagents, and support our initiatives to enter adjacent markets.\nDeliver Best-in-Class Customer Experience. \nWe will continue to expand our sales staff and distribution channels globally in order to increase our global presence and make it easier for customers to transact with us. We strive for every interaction to be seamless, personalized, and exceeding expectations. We aim to deeply understand customers’ wants and needs while simultaneously offering high-quality service at every touchpoint. \nDevelop People Through a Transofrmative Culture. \nAs we continue to grow both organically and through acquisition, we are intentionally fostering an “EPIC” culture based on the ideals of Empowerment, Passion, Innovation and Collaboration. We strive to recruit, train and retain the most talented staff, who share these EPIC ideals to effectively implement our global strategies.\nPROTEIN SCIENCES SEGMENT\nProtein Sciences Segment Products and Markets\nThe Protein Sciences segment is the larger of our two segments, representing approximately 72% of our net sales in fiscal 2025. It is comprised of two divisions with complementary product offerings serving many of the same customers – the Reagent Solutions division and the Analytical Solutions division.\nThe Reagent Solutions division consists of specialized proteins, such as cytokines and growth factors, antibodies, small molecules, tissue culture sera and cell selection technologies traditionally used by researchers to further their life science experimental activities and by companies developing next generation diagnostics and therapeutics, including cell- and gene-based therapeutics. We believe we are the world leader in providing high quality proteins, both for research use and under current Good Manufacturing Practices, or cGMP. Key product brands include R&D Systems, Tocris Biosciences and Novus Biologicals. Our combined chemical and biological reagents portfolio provides high quality tools that customers can use in solving complex biological pathways and glean knowledge that may lead to a more complete understanding of biological processes, and, ultimately, to the development of novel therapeutic strategies to address different pathologies. In recent years, we have made several acquisitions and investments that have expanded our product offerings for the cell and gene therapy market. These include a significant investment in state-of-the art facilities for production of both proteins and small molecules in large quantities manufactured in accordance with cGMP, as well as a 19.9% investment in, and eventual acquisition of , Wilson Wolf, a leading provider of cell culture devices for cell-based therapies. Through a collaborative marketing venture with Wilson Wolf and another company, we have leveraged the products we have or are developing to provide a more complete offering for the cell and gene therapy market.\nThe Analytical Solutions division includes manual and automated protein analysis instruments and immunoassays that are used in quantifying proteins in a variety of biological fluids. Products in this division include traditional manual plate-based immunoassays, fully automated multiplex immunoassays on various instrument platforms, and automated western blotting and isoelectric focusing analysis of complex protein samples. Key product brands include R&D Systems and ProteinSimple. A number of our products have been demonstrated to have the potential to serve as predictive biomarkers and therapeutic targets for a variety of human diseases and conditions including cancer, autoimmunity, diabetes, hypertension, obesity, inflammation, neurological disorders, and kidney failure. Immunoassays can also be useful in clinical diagnostics. In fact, we have received Food and Drug Administration (FDA) marketing clearance for a few of our immunoassays for use as \nin vitro\n diagnostic devices. \nProtein Sciences Segment Customers and Distribution Methods\nOur customers for this segment include researchers in academia and industry (chiefly pharmaceutical and biotech companies as well as contract research organizations). This segment also sells to diagnostic/companion diagnostic and therapeutic customers, including those engaged in the development of cell- and gene-based therapies. Our biologics line of products in the Analytical Solutions division is used chiefly by production and quality control departments at biotech and pharmaceutical companies. We sell our products directly to customers who are primarily located in North America, Europe and China, as well as through a distribution agreement with Thermo Fisher Scientific. We also sell through third \n5\n\n\nTable of Contents\nparty distributors in China, Japan, certain eastern European countries and the rest of the world. Our sales are widely distributed, and no single end-user customer accounted for more than 10% of the Protein Sciences segment’s net sales during fiscal 2025, 2024, or 2023.\nDIAGNOSTICS AND SPATIAL BIOLOGY SEGMENT\nThe Diagnostics and Spatial Biology segment, representing approximately 28% of our net revenues in fiscal 2025, includes three divisions and is focused primarily on the diagnostic and research markets and includes spatial biology, liquid biopsy, molecular diagnostics kits and products, and diagnostics reagents.\nDiagnostics and Spatial Biology Segment Products\nThe Spatial Biology division products sold under the Advanced Cell Diagnostics, or ACD, brand, are novel \nin-situ\n hybridization (ISH) assays for transcriptome, DNA copy, and structural variation analysis within intact cells, providing highly sensitive and specific spatial information at single cell resolution. Since these products preserve spatial context, they are particularly useful for complex tissue profiling. In the first quarter of fiscal 2024, we closed on the acquisition of Lunaphore, a leading developer of fully automated spatial biology solutions using precision microfluidic technology capable of revealing hyperplex proteomic and transcriptomic biomarkers in tumors and other tissues at single-cell and subcellular resolution. Lunaphore’s COMET instrument automates ACD’s RNAscope assays and utilizies antibodies to enable simultaneous hyperplex detection of protein and RNA biomarkers on the same slide at single-cell resolution.\nThe Molecular Diagnostics division markets and sells products and services under the Exosome Diagnostics and Asuragen brands. The Exosome Diagnostics brand is based on exosome-based liquid biopsy techniques that analyze genes or their transcripts. It includes the ExoDx Prostate test, which is a urine-based assay for early detection of high-grade prostate cancer used as an aid in deciding the need for biopsy in men with grey-zone prostate specific antigen (PSA) scores. ExoDX Prostate is offered by Exosome Diagnostics as a lab-developed test. We have also licensed exclusively the ExoTRU kidney transplant rejection test to Thermo Fisher Scientific. We also sell products for genetic carrier screening, oncology diagnostics, molecular controls, and research under the Asuragen brand. \nThe Diagnostic Reagents division consists of regulated products traditionally used as calibrators and controls in the clinical setting. Also included are instrument and process control products for hematology, blood chemistry, blood gases, coagulation controls and reagents used in various diagnostic applications. We often manufacture these reagents on a custom basis, tailored to a customer’s specific diagnostic assay technology. We supply these reagents in various formats including liquid, frozen, or in lyophilized form. Most of these products are sold on an Original Equipment Manufacturer (OEM) basis to instrument manufacturers, with most products being FDA-cleared.\nDiagnostics and Spatial Biology Segment Customers and Distribution Methods\nThe customers for the Spatial Biology division include researchers in academia as well as investigators in pharmaceutical and biotech companies. We sell our products directly to those customers who are primarily located in North America, Europe, and China, and through distributors elsewhere. In addition to being useful research tools, our DNA and RNA \nin situ \nhybridization (ISH) assays have diagnostics applications, and several are cleared or currently under review by the FDA in partnership with diagnostics instrument manufacturers and pharmaceutical companies. \nIn the United States, we offer the ExosomeDx Prostate test to physicians using our lab-developed non-invasive urine-based assay for prostate cancer detection. Our diagnostic laboratory is certified under and regulated by the State of Massachusetts pursuant to the Clinical Laboratory Improvement Amendments, or CLIA. We reach our customers through physicians prescribing such tests for their patients. This test is also available in Europe as a CE-marked product. The Asuragen-branded products are sold primarily to laboratories for use in lab-developed tests or in kit form as regulated diagnostic tests.\nThe majority of Diagnostic Reagents Division’s sales are through OEM agreements, but we sell some of our diagnostic reagent products directly to customers and, in Europe and Asia, also through distributors. \nNo customer accounted for 10% or more of the reporting segment’s consolidated net sales during fiscal 2025, 2024 or 2023.\n6\n\n\nTable of Contents\nMANUFACTURING AND MATERIALS\nOur manufacturing operations use a wide variety of raw materials and components, including electronic components, chemicals and biological materials. No single supplier is material, although for some components that require particular specifications or regulatory or other qualifications there may be a single supplier or a limited number of suppliers that can readily provide such components. We utilize a number of techniques to address potential disruption in and other risks relating to our supply chain, which in certain cases includes the use of safety stock, alternative materials, and qualification of multiple supply sources.\nThe majority of our products are shipped within one day of receipt of the customers’ orders, other than our instruments and related cartridges, which are typically shipped within one to two weeks of receipt of an order. There was no significant backlog of orders for our products as of the date of this Annual Report on Form 10-K or as of a comparable date. For additional discussion of risks relating to supply chain and manufacturing, refer to “Item 1A. Risk Factors.”\nCOMPETITION\nAlthough our segments both generally operate in highly competitive markets, it is difficult to determine our competitive position, either in the aggregate or by segment, since none of our competitors offer all of the same product and service lines or serve all of the same markets as the Company, or any of its segments, does. Because of the range of the products and services we sell, we encounter a wide variety of competitors, including a number of large, global companies or divisions of such companies with substantial capabilities and resources, as well a number of smaller, niche competitors with specialized product offerings. We have seen increased competition in a number of our markets as a result of the entry of new companies into certain markets, the entry of competitors based in low-cost manufacturing locations, and increasing consolidation in particular markets. The number of competitors varies by product line. Key competitive factors vary among the Company’s businesses, but include the specific factors noted above with respect to each particular business and typically also include price, quality and safety, performance, delivery speed, application expertise, service and support, technology and innovation, distribution network, breadth of product, service and software offerings, and brand name recognition. We believe our competitive position is strong due to the unique aspects of many of our products and our product quality. For a discussion of risks related to competition, refer to “Item 1A. Risk Factors.”\nSEASONALITY OF BUSINESS\nBio-Techne believes there is some seasonality as a result of vacation and academic schedules of its worldwide customer base, particularly for the Protein Sciences segment.\nThere is also some seasonality for the ExosomeDx Prostate test, as patients tend to avoid scheduling medical appointments during the summer and other holidays. A majority of Diagnostics Reagents division products are manufactured in large bulk lots and sold on a schedule set by the customer. Consequently, sales for that division can be unpredictable, and not necessarily based on seasonality. As a result, we can experience material and sometimes unpredictable fluctuations in our revenue from the Diagnostics and Spatial Biology segment.\nGOVERNMENT CONTRACTS\nAlthough the Company transacts business with various government entities, no government contract is of such magnitude that renegotiation of profits or termination of the contract at the election of the government entity would have a material adverse effect on the Company’s financial results. As a party to these contracts, Bio-Techne does have to comply with certain regulations that apply to companies doing business with governments. For a discussion of risks related to government contracting requirements, see “Item 1A. Risk Factors.” \nNEW PRODUCTS AND RESEARCH AND DEVELOPMENT\nWe believe that our future success depends, to a large extent, on our ability to keep pace with changing technologies and market needs. Bio-Techne is engaged in continuous research and development in all of our major product lines. We also carry out research to develop new products that build upon and expand the technologies we acquire through our acquisition strategy. In fiscal 2025, we introduced over 400 new products. While this is an area of focus for the Company, there is no \n7\n\n\nTable of Contents\nassurance that any of the products in the research and development phases can be successfully completed or, if completed, can be successfully introduced into the marketplace. \nHUMAN CAPITAL\n \nThrough its subsidiaries, Bio-Techne employed approximately 3,100 full-time and part-time employees as of June 30, 2025, of whom approximately 2,300 were employed in the United States and approximately 800 outside the United States. None of the United States employees are unionized. Outside the United States, the Company has government-mandated collective bargaining arrangements or work councils in certain countries.\nBio-Techne is committed to attracting, developing, engaging, and retaining the best people possible from around the world to sustain and grow our leadership position in life sciences tools and diagnostics. We strive to create an employee experience that allows each to achieve their full potential. This is demonstrated by our EPIC values of Empowerment, Passion, Innovation and Collaboration. We continuously build on our people-first culture, led by uncompromising integrity, hosting a place of belonging, granting access to innovation and respecting human rights around the globe.\nOur people strategy spans multiple key dimensions, including the following:\nCulture and Governance\nOur four EPIC values of Empowerment, Passion, Innovation and Collaboration are the backbone for the way we approach the leadership and direction of our work force. Employees are empowered to realize their potential. Our culture supports and encourages a collaborative approach to working with each other and with our customers. We encourage innovation to continually improve our products, services and processes, and our passions for science and the missions of our customers are our guiding lights.\nOur EPIC values are embedded in our culture and practices. To further amplify our desired behaviors, we have an annual employee recognition program in which we ask for nominations and recognize winning individuals and teams across our business who have best demonstrated our EPIC values.\nBio-Techne’s Board of Directors reviews management succession planning at least annually, and its Compensation Committee reviews the Company’s people strategy periodically in connection with significant initiatives and acquisitions, as well as part of its oversight of our executive and equity compensation programs. At the management level, our Chief Human Resources Officer, who reports directly to our President and CEO, is responsible for the development and execution of the Company’s people strategy.\nEngagement and Belonging\nOur engagement strategy focuses on developing the best workplace and best people leaders to meet our employees’ needs. We believe that strong employee engagement helps enable higher retention and better business performance. We assess our engagement performance through regular consultation with our managers. We also engage more formally via an annual engagement survey that assesses our employees’ overall experience. In 2025, two-thirds of our global workforce participated, and 75% of those who responded provided favorable feedback. While these responses were positive, our management used the responses to inform and shape our future employee-focused initiatives. These initiatives in the past have resulted in changes in programs and policies, including expansion of our management and leadership development programs, expansion of a parental leave program, introduction of flexible working, addition of an internal communications function, leadership engagement focused on transparency and stronger feedback follow-up, and expansion of the breadth and resources of our Employee Resource Groups (ERGs). In fiscal 2025, we empowered work/life integration through hybrid work models wherever feasible, continued to cultivate belonging and inclusion, and paved the path for career growth through the personalized development and individual action plans. \nWe believe a culture of belonging is central to drive innovation, fuel growth and help ensure our technologies and products effectively serve a global customer base. The Company’s executive-sponsored Belonging initiative is focused on providing a welcoming working environment for all employees, continued education, broadening our candidate pools, and implementing and sustaining programs. Under the guidance of our executive-sponsored Employee Resource Group \n8\n\n\nTable of Contents\nCouncil, ERGs offer mentorship, support and engagement to help our employees succeed and thrive. As of June 30, 2025, we had 11 ERGs operating globally. \nAs of June 30, 2025, 48% of our total employee population was female, and 43% of our managerial employees were female. 39% of our total employee population identified as nonwhite and 28% of our managerial employees identified as nonwhite.\nRecruitment and Retention \nBio-Techne believes that sustaining its profitable growth will require a continued focus on recruiting and retaining top talent. We engage in a variety of recruiting strategies intended to locate and identify qualified candidates and create a talent pipeline. The Company offers competitive pay and benefits, from flexible work to financial planning resources to an employee stock purchase plan. In recent years, we bolstered our recruitment and retention efforts by expanding eligibility to receive stock options deeper into the organization and expanded our Long-Term Incentive program strategy to include a combination of stock options and restricted stock units. Bio-Techne continues to offer a referral bonus with the understanding that this is one of our most successful sourcing methods. \nIn addition to pay and benefits, Bio-Techne believes that the ability to retain employees requires an environment where they can work productively and where there are opportunities to grow and advance. The Company therefore seeks to cultivate a culture of empowerment and collaboration, where employees can observe the impact of their efforts, and where they see opportunities both laterally and vertically. \nThe last fiscal year continued to see considerable employee mobility across all industries, including the biotechnology industry, but we nonetheless significantly reduced our attrition rate to maintain durable stability across our enterprise. We believe that Bio-Techne’s sustained efforts on recruitment and retention will fortify our resilience in the face of increased employee mobility and economic challenges.\nTalent Development and Learning and Development\nBio-Techne invests in people development in the belief that growing and promoting employees from within the Company creates a more sustainable organization. High potential employees are identified through our annual talent review process, as well as through leadership development programs designed to cultivate future leaders. Employees identified as high potential are elevated to the attention of senior management for consideration for additional development, growth opportunities, and career advancement.\nOur global Learning and Development program delivers a wide range of initiatives including a validated suite of compliance training, and soft, technical, business, interpersonal and career skills. Bio-Techne also encourages and supports employees who wish to supplement their growth through external training and education. As a company that regularly acquires other businesses, we believe it is important for employees to be trained in the skills and mindsets that enable them to respond positively to change. This initiative allows individuals to deal with change more easily and reduces the need to run large scale change management programs.\nWell-Being and Safety\nThe Company is committed to protecting the physical health, safety, and psychological well-being of our employees by providing a safe work environment and permitting hybrid work schedules wherever feasible. We actively monitor and adjust our crisis management plan and response protocol to protect our employees. Bio-Techne trains all employees on foundational safety principles and requires more rigorous safety and hazard awareness training where appropriate based on function, role, or team. At Bio-Techne, all employees are empowered and encouraged to maintain and create a safe workplace. In addition, we offer internal and external resources to provide for the psychological and emotional security of employees, including employee resource programs, mental health benefit coverage, and flexible work for many roles.\nCommunity\nThe Company believes in giving back and in supporting the local communities in which we live and work. The Company and its employees donate financially and by giving their time and energy. Most sites or departments engage in local \n9\n\n\nTable of Contents\ncharitable causes and activities. In some of our sites, employees are encouraged to give through regular payroll deductions and through the annual campaign week where employee contributions are matched by the Company. In addition, United States employees receive a paid day off to participate in local opportunities to give back to the community as part of our volunteer time off benefit.\nINTELLECTUAL PROPERTY\nOur success depends in part upon our ability to protect our core technologies and intellectual property. To accomplish this, we rely on a combination of intellectual property rights, including patents, trade secrets and trademarks, as well as customary contractual protections in our terms and conditions and other sales-related documentation.\nAs of June 30, 2025, we had rights to approximately 1,340 granted patents and approximately 270 pending patent applications. Products in the Analytical Solutions and the Spatial Biology divisions are protected primarily through pending patent applications and issued patents. In addition, certain of our products are covered by licenses from third parties to supplement our own patent portfolio. Patent protection, if granted, generally has a life of 20 years from the date of the patent application or patent grant. We cannot provide assurance that any of our pending patent applications will result in the grant of a patent, whether the examination process will require us to narrow our claims, and whether our claims will provide adequate coverage of our competitors’ products or services.\nIn addition to pursuing patents on our products, we also preserve much of our innovation as trade secrets, particularly in the Reagent Solutions division of our Protein Sciences segment. Where appropriate, we use trademarks or registered trademarks in connection with our products. We have taken steps to protect our intellectual property and proprietary technology, in part by entering into confidentiality agreements and intellectual property assignment agreements with our employees, consultants, corporate partners and, when needed, our advisors. See the description of risks associated with the Company’s intellectual property in “Item 1A. Risk Factors.”\nWe can give no assurance that Bio-Techne’s products do not infringe upon patents or proprietary rights owned or claimed by others. Bio-Techne has not conducted a patent infringement study for each of its products. Where we have been contacted by patent holders with certain intellectual property rights, Bio-Techne typically has entered into licensing agreements with patent holders under which it has the exclusive and/or non-exclusive right to use patented technology as well as the right to manufacture and sell certain patented products to the research and/or diagnostics markets.\nAll trademarks, trade names, product names, graphics, and logos of Bio-Techne contained herein are trademarks and registered trademarks of Bio-Techne or its subsidiaries, as applicable, in the United States and/or other countries. Solely for convenience, we may refer to trademarks in this Annual Report on Form 10-K without the ™ or ® symbols. Such references are not intended to indicate that we will not assert our full rights to our trademarks.\nLAWS AND REGULATIONS\nOur operations, and some of the products we offer, are subject to a number of complex laws and regulations governing the production, marketing, handling, transportation, and distribution of our products and services. The following sections describe certain significant regulations pertinent to the Company. These are not the only laws and regulations applicable to the Company’s business. For a description of risks related to laws and regulations to which we are subject, refer to “Item 1A. Risk Factors.”\nMedical Device Regulations\nA number of our products are classified as medical devices and are subject to restrictions under domestic and foreign laws, rules, regulations, self-regulatory codes and orders, including but not limited to the U.S. Food, Drug and Cosmetic Act (the “FDCA”). The FDCA requires these products, when sold in the United States, to be safe and effective for their intended uses and to comply with the regulations administered by the U.S. Food and Drug Administration (“FDA”). The FDA regulates the design, development, testing, manufacture, advertising, labeling, packaging, marketing, distribution, import and export and record keeping for such products. Many medical device products are also regulated by comparable agencies in non-U.S. countries in which they are produced or sold.\n10\n\n\nTable of Contents\nAny medical devices we manufacture and distribute are subject to pervasive and continuing regulation by the FDA and certain state and non-U.S. agencies. As a medical device manufacturer, our manufacturing facilities are subject to inspection on a routine basis by the FDA. We are required to adhere to the Current Good Manufacturing Practices (“cGMP”) requirements, as set forth in the Quality Systems Regulation (“QSR”), which require manufacturers, including third-party manufacturers, to follow stringent design, testing, control, documentation and other quality assurance procedures during all phases of the design and manufacturing process.\nWe must also comply with post-market surveillance regulations, including medical device reporting (“MDR”), requirements which require that we review and report to the FDA any incident in which our products may have caused or contributed to a death or serious injury. We must also report any incident in which our product has malfunctioned if that malfunction would likely cause or contribute to a death or serious injury it if were to recur.\nLabeling and promotional activities are subject to scrutiny by the FDA and, in certain circumstances, by the Federal Trade Commission. Medical devices approved or cleared by the FDA may not be promoted for unapproved or uncleared uses, otherwise known as “off-label” promotion. The FDA and other agencies actively enforce the laws and regulations prohibiting the promotion of off-label uses.\nIn the European Union (“EU”), our products are subject to the medical device laws of the various member states, which are currently based on a Directive of the European Commission. Additionally, the EU has adopted the In Vitro Diagnostic Regulation (the “EU IVDR”), which imposes stricter requirements for the marketing and sale of in vitro diagnostic medical devices, including in the area of clinical evaluation requirements, quality systems and post-market surveillance. Manufacturers of in vitro diagnostics medical devices that have been marketed and sold under the prior regulatory regime now have to comply with some of the new EU IVDR requirements, while the effective date of other requirements have been delayed. Complying with EU IVDR may require material modifications to our quality management systems, additional resources in certain functions, updates to technical files and additional clinical data in some cases, among other changes.\nOne of our products under our Exosome Diagnostics brand is offered as a test by a certified laboratory under CLIA. Our Asuragen business also maintains a CLIA certification. Consequently, we must comply with state licensing regulations applicable to laboratories regulated under CLIA, governing laboratory practices and procedures.\nOther Healthcare Laws\nSome of the products and services we sell, predominantly in our Diagnostics and Spatial Biology segment, are subject to various health care related laws regulating fraud and abuse, research and development, pricing and sales and marketing practices, and the privacy and security of health information, including, among others:\n●\nU.S. federal regulations regarding quality and cost by the U.S. Department of Health and Human Services (“HHS”), including the Centers for Medicare & Medicaid Services (“CMS”), as well as comparable state and non-U.S. agencies responsible for reimbursement and regulation of healthcare goods and services, including laws and regulations related to kickbacks, false claims, self-referrals and healthcare fraud.\n​\n●\nU.S. Federal Anti-Kickback Statute prohibits persons from knowingly and willfully soliciting, offering, receiving or providing remuneration (including any kickback or bribe), directly or indirectly, in exchange for or to induce either the referral of an individual, or the furnishing or arranging for a good or service, for which payment may be made in whole or in part under a federal health care program, such as Medicare or Medicaid.\n​\n●\nComparable laws and regulations similar to, and in some cases more stringent than, the U.S. federal regulations discussed above and below, including the UK Bribery Act and similar anti-bribery laws.\n​\n●\nThe Health Insurance Portability and Accountability Act of 1996 (“HIPAA”), which prohibits knowingly and willfully (1) executing, or attempting to execute, a scheme to defraud any health care benefit program, including private payors, or (2) falsifying, concealing or covering up a material fact or making any materially false, fictitious or fraudulent statement in connection with the delivery of or payment for health care benefits, items or services. In addition, HIPAA, as amended by the Health Information Technology for Economic and Clinical Health Act of 2009, also restricts the use and disclosure of patient identifiable health information, \n11\n\n\nTable of Contents\nmandates the adoption of standards relating to the privacy and security of patient identifiable health information and requires the reporting of certain security breaches with respect to such information.\n​\n●\nThe False Claims Act, which imposes liability on any person or entity that, among other things, knowingly presents, or causes to be presented, a false or fraudulent claim for payment by a federal health care program, knowingly makes, uses or causes to be made or used, a false record or statement material to a false or fraudulent claim, or knowingly makes a false statement to avoid, decrease or conceal an obligation to pay money to the U.S. federal government.\n​\n●\nThe Open Payments Act requires manufacturers of medical devices covered under Medicare to, in certain circumstances, record payments and other transfers of value to a broad range of healthcare providers and teaching hospitals and to report this data as well as ownership and investment interests held by the physicians described above and their immediate family members to HHS for subsequent public disclosure, as well as similar reporting requirements in some states and in other countries.\n​\nFor a discussion of risks related to regulation by the FDA and comparable agencies of other countries, and the other regulatory regimes referenced above, please refer to section entitled “Item 1A. Risk Factors.”\nData Privacy and Security Laws\nAs a global organization, we are subject to data privacy and security laws, regulations, and customer-imposed controls in numerous jurisdictions as a result of having access to and processing confidential, personal and/or sensitive data in the course of our business. In addition to the U.S. HIPAA privacy and security rules mentioned above, which impact some parts of our business, individual states also regulate data breach and security requirements, and multiple governmental bodies assert authority over aspects of the protection of personal privacy. In particular, a broad privacy law in California, the California Consumer Privacy Act (“CCPA”), came into effect in January 2020. The CCPA has some of the same features as the GDPR (discussed below) and has already prompted several other states to follow with similar laws. The EU General Data Protection Regulation that became effective in May 2018 (“GDPR”) has imposed significantly stricter requirements in how we collect, transmit, process, and retain personal data, including, among other things, in certain circumstances a requirement for almost immediate notice of data breaches to supervisory authorities and prompt notice to data subjects with significant fines for non-compliance. Several other countries in which we do business have passed, and other countries are considering passing, laws that require personal data relating to their citizens to be maintained on local servers and impose additional data transfer restrictions. For a discussion of risks related to improper disclosure of private information particularly as a result of cyber security incidents, please refer to section entitled “Item 1A. Risk Factors.”\nEnvironmental Health and Safety Laws\nWe are also subject to various environmental health and safety laws and regulations both within and outside the U.S. Like other companies in our industry, our manufacturing and research activities involve the use and transportation of substances regulated under environmental health and safety laws including those relating to the transportation of hazardous materials.\nOther Laws and Regulations Governing Our Sales, Marketing and Shipping Activities\nWe are subject to the U.S. Foreign Corrupt Practices Act and various other similar anti-corruption and anti-bribery acts, which are particularly relevant to our operations in countries where the customers are government entities or are controlled by government officials. Both directly and indirectly through our distributors, we must comply with such laws when interacting with those entities.\nAs Bio-Techne’s businesses also include export and import activities, we are subject to pertinent laws enforced by the U.S. Departments of Commerce, State and Treasury. Other nations’ governments have implemented similar export/import control and economic sanction regulations, which may affect the Company’s operations or transactions subject to their jurisdictions.\nIn addition, under U.S. laws and regulations, U.S. companies and their subsidiaries and affiliates outside the United States are prohibited from participating or agreeing to participate in unsanctioned foreign boycotts in connection with certain business activities, including the sale, purchase, transfer, shipping or financing of goods or services within the United States or between the United States and countries outside of the United States. If we, or certain third parties through which we sell or provide goods or services, violate anti-boycott laws and regulations, we may be subject to civil or criminal enforcement action and varying degrees of liability.\n12\n\n\nTable of Contents\nWe are subject to laws and regulations governing government contracts, and failure to address these laws and regulations or comply with government contracts could cause a reduction in revenue associated with these customers. We have agreements relating to the sale of our products to government entities and, as a result, we are subject to various statutes and regulations that apply to companies doing business with the government. We are also subject to investigation for compliance with the regulations governing government contracts. A failure to comply with these regulations could result in suspension of these contracts, criminal, civil and administrative penalties or debarment.\nFor a discussion of risks related to the above-referenced regulations, particularly with respect to our international operations, please refer to section entitled “Item 1A. Risk Factors.”\nINVESTOR INFORMATION\nWe are subject to the information requirements of the Securities Exchange Act of 1934 (the Exchange Act). Therefore, we file periodic reports, proxy statements, and other information with the Securities and Exchange Commission (SEC). The SEC maintains an internet site (http://www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically.\nFinancial and other information about us is available on our web site (https://investors.bio-techne.com/). We make available on our web site copies of our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13 or 15(d) of the Exchange Act as soon as reasonably practicable after filing such material electronically or otherwise furnishing it to the SEC.\nEXECUTIVE OFFICERS OF THE REGISTRANT\nAs of the date of this Annual Report, the names, ages, positions and periods of service of each executive officer of the Company are as follows:\n​\n​\n​\n​\n​\n​\n​\n​\nName\n    \nAge\n    \nPosition\n    \nOfficer Since\n​\n​\n​\n​\n​\n​\n​\nKim Kelderman\n \n58\n \nPresident, Chief Executive Officer and Director\n \n2018\nJames Hippel\n \n54\n \nExecutive Vice President and Chief Financial Officer\n \n2014\nWilliam Geist \n \n56\n \nPresident, Protein Sciences\n \n2022\nMatthew McManus\n​\n56\n \nPresident, Diagnostics and Spatial Biology\n \n2024\nShane Bohnen\n \n50\n \nSenior Vice President, General Counsel & Corp. Secretary\n \n2023\n​\nSet forth below is information regarding the business experience of each executive officer. There are no family relationships among any of the officers named, nor is there any arrangement or understanding pursuant to which any person was selected as an officer.\nKim Kelderman was promoted to President and Chief Executive Officer of the Company on February 1, 2024 and has been an executive officer of the Company since joining the Company in 2018. Prior to joining the Company, he served as an executive at Thermo Fisher Scientific and as a Senior Segment Leader at Becton Dickinson.\nJames Hippel has been Chief Financial Officer of the Company since April 1, 2014. Prior to joining the Company, Mr. Hippel served as Senior Vice President and Chief Financial Officer for Mirion Technologies, Inc and as Vice President, Finance at Thermo Fisher Scientific, and in financial roles at Honeywell International. Mr. Hippel started his career with KPMG LLP.\nMatthew McManus joined Bio-Techne on January 8, 2024 as President, Diagnostics and Spatial Biology. Prior to Bio-Techne, Mr. McManus most recently served as Chief Operating Officer for Azenta Life Sciences and served as Chief Executive Officer of Asuragen prior to the Bio-Techne acquisition.\nWilliam Geist has been President of the Protein Sciences segment since January 3, 2022. Prior to Bio-Techne, \nMr. Geist most recently served as Chief Operating Officer for Quanterix, and before that in senior management roles at Thermo Fisher Scientific and QuantaBiosciences, a QIAGEN company.\n​\nShane Bohnen was promoted to General Counsel and Corporate Secretary on March 3, 2023, and has been an attorney on the Company’s legal team since July 2019. Prior to joining Bio-Techne, Mr. Bohnen spent 10 years in private practice as a life sciences litigator, followed by seven years as in-house corporate counsel with an expansive breadth of responsibility and global scope.\n​\n13\n\n\nTable of Contents",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL\nCONDITION AND RESULTS OF OPERATIONS\nThe following management discussion and analysis (“MD&A”) provides information that we believe is useful in understanding our operating results, cash flows and financial condition. We provide quantitative information about the material sales drivers including the effect of acquisitions and changes in foreign currency at the corporate and segment level. We also provide quantitative information about discrete tax items and other significant factors we believe are useful for understanding our results. The MD&A should be read in conjunction with the consolidated financial information and related notes included in this Form 10-K. This discussion contains various “Non-GAAP Financial Measures” and also contains various “Forward-Looking Statements” within the meaning of the Private Securities Litigation Reform Act of 1995. We refer readers to the statements entitled “Non-GAAP Financial Measures” located at the end of this MD&A and “Forward-Looking Information and Cautionary Statements” and “Risk Factors” within Items 1 and 1A of this Form 10-K.\nOVERVIEW\nBio-Techne develops, manufactures and sells life science reagents, instruments and services for the research and clinical diagnostic markets worldwide. With our deep product portfolio and application expertise, we sell integral components of scientific investigations into biological processes and molecular diagnostics, revealing the nature, diagnosis, etiology and progression of specific diseases. Our products aid in drug discovery efforts and provide the means for accurate clinical tests and diagnoses.\nWe manage the business in two operating segments – our Protein Sciences segment and our Diagnostics and Spatial Biology segment. Our Protein Sciences segment is a leading developer and manufacturer of high-quality biological reagents used in all aspects of life science research, diagnostics and cell and gene therapy. This segment also includes proteomic analytical tools, both manual and automated, that offer researchers and pharmaceutical manufacturers efficient and streamlined options for automated western blot and multiplexed ELISA workflow. Our Diagnostics and Spatial Biology segment develops and manufactures diagnostic products, including controls, calibrators, and diagnostic assays for the regulated diagnostics market, exosome-based molecular diagnostic assays, advanced tissue-based in-situ hybridization assays and instrumentation for spatial genomic and tissue biopsy analysis, and genetic and oncology kits for research and clinical applications.\nRECENT ACQUISITIONS\nA key component of the Company's strategy is to augment internal growth at existing businesses with complementary acquisitions. As disclosed in Note 4, the Company completed the acquisition of Lunaphore in fiscal 2024 for $169.7 million, in a cash-free, debt-free acquisition. We also purchased a 19.9% investment in Wilson Wolf in fiscal 2023 and, as disclosed in Note 1, will acquire the remaining shares in Wilson Wolf by the end of calendar year 2027, or earlier depending on the achievement of certain future milestones.\nOVERALL RESULTS\nOperational Update\nFor fiscal 2025, consolidated net sales increased 5% to $1.2 billion as compared to fiscal 2024. Organic growth was 5%, and foreign currency translation and a business held-for-sale did not have a material impact. Organic revenue growth was primarily driven by strong commercial execution in our Protein Sciences segment\n.\n​\nConsolidated net earnings for fiscal 2025 decreased 56% compared to fiscal 2024. The decrease in earnings was impacted by a non-recurring loss on an arbitration award, impairment of assets held-for-sale, and restructuring and restructuring-related charges. After adjusting for cost recognized upon sale of acquired inventory, intangibles amortization, acquisition-related costs, certain litigation charges, gain on sale of investments, stock-based compensation, restructuring and restructuring-related costs, impairment of assets held-for-sale, and impact of business held-for-sale, adjusted net earnings \n33\n\n\nTable of Contents\nincreased 8% in fiscal 2025 as compared to fiscal 2024. Adjusted net earnings was primarily impacted by favorable volume leverage within Protein Sciences. \nFor fiscal 2024, consolidated net sales increased 2% as compared to fiscal 2023. Organic growth was 1%, with acquisitions having a favorable impact of 1%. Foreign currency translation and a business held-for-sale did not have a material impact. Organic revenue growth was primarily driven by strong commercial execution in our Diagnostics and Spatial Biology segment\n.\n \nConsolidated net earnings for fiscal 2024, including non-controlling interest, decreased 41% compared to fiscal 2023. The decrease in earnings was driven by a non-recurring gain on the sale of our ChemoCentryx, Inc. (CCXI) investment, a non-recurring gain on the sale of our investment in Eminence, and a non-recurring benefit related to the fair value of contingent consideration during fiscal 2023.\n​\nRESULTS OF OPERATIONS\nNet Sales\nConsolidated organic net sales exclude the impact of companies acquired during the first 12 months post-acquisition and the effect of the change from the prior year in exchange rates used to convert sales in foreign currencies (primarily the euro, British pound sterling, Chinese yuan, and Swiss franc) into U.S. dollars.\n​\nConsolidated net sales growth was as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nYear Ended June 30, \n \n​\n    \n2025\n    \n2024\n    \n2023\n \n​\n​\n​\n​\n​\n​\n​\n​\nOrganic sales growth\n \n5\n%  \n1\n%  \n5\n%  \nAcquisitions sales growth\n \n0\n%  \n1\n%  \n0\n%  \nImpact of foreign currency fluctuations\n \n0\n%  \n0\n%  \n (2)\n%  \nImpact of business held for sale\n​\n0\n%  \n0\n%  \n —\n%  \nConsolidated net sales growth\n \n5\n%  \n2\n%  \n3\n%\n​\nConsolidated net sales by segment were as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nYear Ended June 30, \n​\n    \n2025\n    \n2024\n    \n2023\nProtein Sciences\n​\n$\n 870,245\n​\n$\n 830,902\n​\n$\n 845,747\nDiagnostics and Spatial Biology\n​\n \n 346,263\n​\n \n 326,392\n​\n \n 292,602\nOther revenue\n(1)\n​\n​\n 4,152\n​\n​\n 4,153\n​\n​\n —\nIntersegment\n​\n \n (1,025)\n​\n \n (2,387)\n​\n \n (1,647)\nConsolidated net sales\n​\n$\n 1,219,635\n​\n$\n 1,159,060\n​\n$\n 1,136,702\n(1)\nSince December 31, 2023, the Company has a business that has met the held-for-sale criteria. The years ended June 30, 2025 and 2024 include the twelve and six month results, respectively, while the business has met the held-for-sale criteria.\n​\nIn fiscal 2025, Protein Sciences segment net sales increased 5% compared to fiscal 2024. A business within the Protein Sciences Segment met the criteria as held-for-sale since December 31, 2023. The exclusion of fiscal 2025 sales related to the held-for-sale business did not have a material impact on sales. Organic revenue for the segment increased 5% for the \n34\n\n\nTable of Contents\nfiscal year, and foreign currency exchange did not have a material impact on revenue growth. Segment revenue was driven  by strong proteomic analytical solutions and cell therapy performance and commercial execution. \nIn fiscal 2025, Diagnostics and Spatial Biology segment net sales increased 6% compared to fiscal 2024. Organic growth for the segment was 6% and foreign currency exchange did not have a material impact on revenue growth. Segment growth was driven by broad based molecular diagnostics performance and Lunaphore’s organic growth.\nIn fiscal 2024, Protein Sciences segment net sales decreased 2% compared to fiscal 2023. A business within the Protein Sciences Segment met the criteria as held-for-sale since December 31, 2023. The exclusion of third and fourth quarter of fiscal 2024 sales related to a held-for-sale business reduced sales by 1%. Organic revenue for the segment declined 2% for the fiscal year, with foreign currency exchange having a favorable impact of 1% on revenue. Segment revenue was impacted by broad based headwinds.\n \nIn fiscal 2024, Diagnostics and Spatial Biology segment net sales increased 12% compared to fiscal 2023. Organic growth for the segment was 6% with acquisitions having a 5% impact and foreign currency exchange having a favorable impact of 1% on revenue growth. Segment growth was driven by broad based molecular diagnostics performance and Lunaphore.\n​\nGross Margins\nConsolidated gross margins were 64.8%, 66.4%, and 67.7% in fiscal 2025, 2024, and 2023. Consolidated gross margin in fiscal year 2025 was impacted by the reinstatement of incentive accruals and product mix. Excluding the impact of acquired inventory sold, amortization of intangibles, stock compensation expense, restructuring and restructuring-related costs, impact of business held-for-sale, and the impact of partially-owned consolidated subsidiaries, adjusted gross margins were 70.4%, 71.0%, and 71.7% in fiscal 2025, 2024, and 2023, respectively. Fiscal 2025 consolidated gross margin was impacted by the resinstatement of incentive accruals and an unfavorable product mix when compared to the prior period. Fiscal 2024 consolidated gross margin was impacted by the Lunaphore acquisition when compared to the prior period. Fiscal 2023 consolidated gross margin was unfavorably impacted by foreign currency exchange and strategic growth investments including the Namocell acquisition.\n35\n\n\nTable of Contents\nA reconciliation of the reported consolidated gross margin percentages, adjusted for acquired inventory sold, intangible amortization included in Cost of sales, restructuring and restructuring-related expenses, and impact of business held-for-sale is as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n​\n​\nYear Ended June 30, \n​\n​\n    \n​\n2025\n    \n​\n2024\n    \n​\n2023\n \nTotal consolidated net sales\n \n$\n 1,219,635\n​\n$\n 1,159,060\n​\n$\n 1,136,702\n​\nBusiness held-for-sale\n(2)\n \n​\n 4,152\n​\n​\n 4,153\n​\n​\n —\n​\nRevenue from recurring operations\n \n$\n 1,215,483\n​\n$\n 1,154,907\n​\n$\n 1,136,702\n​\n​\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\nGross margin - GAAP\n​\n$\n 790,272\n​\n$\n 769,725\n​\n$\n 769,815\n​\nGross margin percentage - GAAP\n​\n​\n 64.8\n%\n​\n 66.4\n%\n​\n 67.7\n%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nIdentified adjustments:\n​\n​\n  \n​\n​\n  \n​\n​\n  \n​\nCosts recognized upon sale of acquired inventory\n \n$\n 751\n​\n$\n 729\n​\n$\n 400\n​\nAmortization of intangibles\n​\n​\n 44,035\n​\n​\n 46,609\n​\n​\n 44,337\n​\nStock-based compensation, inclusive of employer taxes\n​\n​\n 1,298\n​\n​\n 825\n​\n​\n 948\n​\nRestructuring and restructuring-related costs\n​\n​\n 20,094\n​\n​\n 3,348\n​\n​\n —\n​\nImpact of partially-owned consolidated subsidiaries\n(1)\n​\n​\n —\n​\n​\n —\n​\n​\n (1,457)\n​\nImpact of business held-for-sale\n(2)\n​\n​\n (147)\n​\n​\n (943)\n​\n​\n —\n​\nAdjusted gross margin\n​\n$\n 856,303\n​\n$\n 820,293\n​\n$\n 814,043\n​\nAdjusted gross margin percentage\n(3)\n​\n​\n 70.4\n%\n​\n 71.0\n%\n​\n 71.7\n%\n(1)\nIncludes the quarterly results of the partially-owned consolidated subsidiary prior to the sale of this partially-owned consolidated subsidiary to a third party in the first fiscal quarter of 2023.\n​\n(2)\nSince December 31, 2023, the Company has a business that has met the held-for-sale criteria. The years ended June 30, 2025 and 2024 include the twelve and six month results, respectively, while the business has met the held-for-sale criteria.\n​\n(3)\nAdjusted gross margin percentage excludes the revenue and the gross margin of the business held-for-sale. \n​\nFluctuations in adjusted gross margins, as a percentage of net sales, have primarily resulted from changes in foreign currency exchange rates and changes in product mix. We expect that, in the future, gross margins will continue to be impacted by the mix of our portfolio growing at different rates as well as future acquisitions.\nManagement uses adjusted operating results to monitor and evaluate performance of the Company’s two segments. Segment gross margins, as a percentage of net sales, were as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nYear Ended June 30, \n \n​\n​\n2025\n   \n2024\n   \n2023\n \n​\n​\n​\n​\n​\n​\n​\n​\nProtein Sciences\n \n 75.6\n%  \n 75.7\n%  \n 75.3\n%\nDiagnostics and Spatial Biology\n \n 57.3\n%  \n 58.7\n%  \n 61.2\n%\n​\nThe decrease in the Protein Sciences segment’s gross margin percentage for fiscal 2025 as compared to fiscal 2024 was primarily attributable to the mix of product sales within the segment. The change in the Protein Sciences segment’s gross margin percentage for fiscal 2024 compared to fiscal 2023 was primarily attributable to the exclusion of a business held-for-sale.\nThe decrease in the Diagnostics and Spatial Biology segment’s gross margin percentage for fiscal 2025 as compared to fiscal 2024 is primarily attributable to reinstatement of incentive accruals and an unfavorable mix of product sales within the segment. The change in the Diagnostics and Spatial Biology segment’s gross margin percentage for fiscal 2024 as compared to fiscal 2023 is due to the Lunaphore acquisition. \n36\n\n\nTable of Contents\nSelling, General and Administrative Expenses\nSelling, general and administrative expenses increased $122.1 million (26%) in fiscal 2025 when compared to fiscal 2024. Selling, general, and administrative expenses increased primarily due to a non-recurring arbitration award and impairment of assets held-for-sale. \nSelling, general and administrative expenses increased $88.0 million (23%) in fiscal 2024 when compared to fiscal 2023. Selling, general, and administrative expenses increased primarily due to the Lunaphore acquisition, impairment of assets held-for-sale, certain litigation charges, restructuring and restructuring-related charges, and CEO transition charges.\nConsolidated Selling, general and administrative expenses were composed of the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nYear Ended June 30, \n​\n​\n2025\n​\n2024\n​\n2023\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nProtein Sciences\n​\n$\n 230,046\n​\n$\n 217,595\n​\n$\n 203,834\nDiagnostics and Spatial Biology\n​\n \n 136,103\n​\n \n 127,131\n​\n \n 101,805\nTotal segment expenses\n​\n \n 366,149\n​\n \n 344,726\n​\n \n 305,639\nAmortization of intangibles\n​\n \n 31,285\n​\n \n 31,710\n​\n \n 32,076\nAcquisition related expenses\n​\n \n 11,672\n​\n \n 6,980\n​\n \n (9,965)\nCertain litigation charges\n​\n​\n 41,827\n​\n​\n 3,506\n​\n​\n —\nRestructuring and restructuring-related costs\n​\n \n 8,137\n​\n \n 8,896\n​\n \n 3,829\nStock-based compensation\n​\n \n 40,860\n​\n \n 39,452\n​\n \n 40,269\nImpairment of assets held-for-sale\n​\n​\n 80,503\n​\n​\n 21,963\n​\n​\n —\nCorporate selling, general and administrative expenses\n​\n \n 8,088\n​\n \n 9,142\n​\n \n 6,530\nTotal selling, general and administrative expenses\n​\n$\n 588,521\n​\n$\n 466,375\n​\n$\n 378,378\n​\nResearch and Development Expenses\nResearch and development expenses increased $2.8 million (3%) and $4.2 million (5%) in fiscal 2025 and 2024, respectively, as compared to prior year periods. The increase in research and development expenses in fiscal 2025 and fiscal 2024 compared to the prior periods was primarily attributable to strategic growth investments including the acquisition of Lunaphore in fiscal 2024. \nConsolidated research and development expenses were composed of the following (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nYear Ended June 30, \n​\n​\n2025\n​\n2024\n​\n2023\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nProtein Sciences\n​\n$\n 58,607\n​\n$\n 56,911\n​\n$\n 58,251\nDiagnostics and Spatial Biology\n​\n \n 40,889\n​\n \n 39,753\n​\n \n 34,242\nTotal research and development expenses\n​\n$\n 99,496\n​\n$\n 96,664\n​\n$\n 92,493\n​\nNet Interest Income / (Expense)\nNet interest income/(expense) for fiscal 2025, 2024, and 2023 was ($4.6) million, ($12.4) million, and ($7.8) million, respectively. During fiscal 2025, average monthly outstanding debt was lower than fiscal 2024 leading to decreased interest expense compared to fiscal 2024. \nNet interest expense in fiscal 2024 increased when compared to fiscal 2023 as average monthly outstanding debt was higher than fiscal 2023, leading to increased interest expense compared to fiscal 2023. \n37\n\n\nTable of Contents\nOther Non-Operating Income / (Expense), Net\nOther non-operating income/(expense), net, consists of foreign currency transaction gains and losses, rental income, building expenses related to rental property and the Company’s gains and losses on investments as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \nYear Ended June 30, \n​\n​\n2025\n​\n2024\n​\n2023\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nForeign currency gains (losses)\n​\n$\n 1,447\n​\n$\n (726)\n​\n$\n 676\nRental income\n​\n \n 356\n​\n \n 305\n​\n \n 426\nReal estate taxes, depreciation and utilities\n​\n \n (1,590)\n​\n \n (1,630)\n​\n \n (1,810)\nGain (Loss) on investment\n​\n \n —\n​\n \n 283\n​\n \n 49,328\nGain (Loss) on equity method investment\n​\n​\n 938\n​\n​\n (6,841)\n​\n​\n (1,143)\nMiscellaneous (expense) income\n​\n \n (320)\n​\n \n 25\n​\n \n 43\nOther non-operating income (expense), net\n​\n$\n 831\n​\n$\n (8,584)\n​\n$\n 47,520\n​\nDuring fiscal 2025, the Company recognized a gain of $0.9 million related to our equity method investment in Wilson Wolf. \nDuring fiscal 2024, the Company recognized losses of $6.8 million related to our equity method investment in Wilson Wolf. \nDuring fiscal 2023, the Company recognized gains of $37 million related to the sale of our CCXI investment, $11.7 million related to the sale of our Eminence investment, and a gain of $0.4 million related to the change in fair value of our exchange traded bond funds. Additionally, the Company recognized losses of $1.1 million related to our equity method investment in Wilson Wolf. \nIncome Taxes\nIncome taxes for fiscal 2025, 2024, and 2023 were at effective rates of 25.5%, 9.5%, and 15.7%, respectively, of consolidated earnings before income taxes. The change in the effective tax rate for fiscal 2025 compared to fiscal 2024 was driven by share-based compensation as the number of stock option exercises increased compared to the prior year comparative period. The Company had share-based compensation excess tax benefits of $4.5 million in fiscal 2025. The Company’s discrete tax benefits in fiscal 2024 primarily related to share-based compensation excess tax benefits of $18.4 million. The Company’s discrete tax benefits in fiscal 2023 primarily related to share-based compensation excess tax benefits of $12.3 million. \n​\n38\n\n\nTable of Contents\nNet Earnings\nNon-GAAP adjusted consolidated net earnings and earnings per share are as follows (in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n​\nYear Ended June 30, \n​\n​\n​\n2025\n​\n2024\n​\n2023\n \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet earnings before taxes - GAAP\n​\n$\n 98,463\n​\n$\n 185,689\n​\n$\n 338,659\n​\nIdentified adjustments attributable to Bio-Techne:\n​\n \n​\n​\n \n​\n​\n \n  \n​\nCosts recognized upon sale of acquired inventory\n​\n \n 751\n​\n \n 729\n​\n \n 400\n​\nAmortization of intangibles\n​\n \n 75,321\n​\n \n 78,318\n​\n \n 76,413\n​\nAmortization of Wilson Wolf intangible assets and acquired inventory \n​\n​\n 9,959\n​\n​\n 15,686\n​\n​\n 2,805\n​\nAcquisition related expenses and other\n​\n \n 12,738\n​\n \n 7,564\n​\n \n (9,147)\n​\nCertain litigation charges\n​\n​\n 41,827\n​\n​\n 3,506\n​\n​\n —\n​\nGain on sale of partially-owned consolidated subsidiaries\n​\n​\n —\n​\n​\n —\n​\n​\n (11,682)\n​\nStock based compensation, inclusive of employer taxes\n​\n \n 42,158\n​\n \n 40,277\n​\n \n 41,217\n​\nRestructuring and restructuring-related costs\n​\n \n 28,231\n​\n \n 12,245\n​\n \n 3,829\n​\nInvestment gain and other non-operating\n​\n \n —\n​\n \n (283)\n​\n \n (37,646)\n​\nImpairment of assets held-for-sale\n​\n​\n 80,503\n​\n​\n 21,963\n​\n​\n —\n​\nImpact of partially-owned subsidiaries\n(1)\n​\n \n —\n​\n \n —\n​\n \n (420)\n​\nImpact of business held-for-sale\n(2)\n​\n​\n 479\n​\n​\n (525)\n​\n​\n —\n​\nEarnings before taxes - Adjusted\n(1,2)\n​\n$\n 390,430\n​\n$\n 365,169\n​\n$\n 404,428\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNon-GAAP tax rate\n​\n \n 21.5\n%  \n \n 22.0\n%  \n \n 20.5\n%\nNon-GAAP tax expense\n​\n$\n 83,973\n​\n$\n 80,420\n​\n$\n 82,948\n​\nNon-GAAP adjusted net earnings attributable to Bio-Techne\n(1,2)\n​\n$\n 306,457\n​\n$\n 284,749\n​\n$\n 321,480\n​\nEarnings per share - diluted - Adjusted\n(1,2)\n​\n$\n 1.92\n​\n$\n 1.77\n​\n$\n 1.99\n​\n(1)\nIncludes the quarterly results of the partially-owned consolidated subsidiary prior to the sale of this partially-owned consolidated subsidiary to a third party in the first fiscal quarter of 2023.\n​\n(2)\nSince December 31, 2023, the Company has a business that has met the held-for-sale criteria. The years ended June 30, 2025 and 2024 include the twelve and six month results, respectively, while the business has met the held-for-sale criteria.\n​\nDepending on the nature of discrete tax items, our reported tax rate may not be consistent on a period to period basis. The Company independently calculates a non-GAAP adjusted tax rate considering the impact of discrete items and \n39\n\n\nTable of Contents\njurisdictional mix of the identified non-GAAP adjustments. The following table summarizes the reported GAAP tax rate and the effective Non-GAAP adjusted tax rate for fiscal 2025, 2024, and 2023.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n​\nYear Ended June 30, \n​\n​\n​\n2025\n​\n2024\n​\n2023\n \n​\n​\n​\n​\n​\n​\n​\n​\nGAAP effective tax rate\n​\n 25.5\n%  \n 9.5\n%  \n 15.7\n%\nDiscrete items\n​\n 0.8\n \n 14.0\n \n 3.4\n​\nImpact of non-taxable net gain\n​\n —\n​\n —\n​\n 0.7\n​\nLong-term GAAP tax rate\n​\n 26.3\n%  \n 23.5\n%  \n 19.8\n%\n​\n​\n​\n​\n​\n​\n​\n​\nRate impact items\n​\n  \n \n  \n \n  \n​\nStock based compensation\n​\n (3.1)\n%  \n (2.5)\n%  \n (1.4)\n%  \nOther\n​\n (1.7)\n \n 1.0\n \n 2.1\n​\nTotal rate impact items\n​\n (4.8)\n%  \n (1.5)\n%  \n 0.7\n%\nNon-GAAP adjusted tax rate\n​\n 21.5\n%  \n 22.0\n%  \n 20.5\n%\n​\nRefer to Note 12 for additional discussion relating to the change in discrete tax items between fiscal 2025 and fiscal 2024.\nLIQUIDITY AND CAPITAL RESOURCES\nCash, cash equivalents and available-for-sale investments at June 30, 2025 were $162.2 million compared to $152.9 million at June 30, 2024. Included in the available-for-sale investments were certificates of deposit that have contractual maturity dates within one year of $1.1 million as of June 30, 2024. There were no certificiates of deposit as of June 30, 2025. \nAt June 30, 2025, approximately 34% of the Company’s cash and cash equivalent account balances of $55.2 million were located in the U.S., with the remainder located in primarily in Canada, China, the U.K. and other European countries.\nAt June 30, 2025, we had $346.0 million in borrowings under the revolving credit facility, resulting in $654.0 million of unutilized availability under our revolving credit facility. \nThe Company has either paid U.S. taxes on its undistributed foreign earnings or intends to indefinitely reinvest the undistributed earnings in the foreign operations or expects the earnings will be remitted in a tax neutral transaction. Management of the Company expects to be able to meet its cash and working capital requirements for operations, facility expansion, capital additions, and cash dividends for the foreseeable future, and at least the next 12 months, through currently available funds, including funds available through our line-of-credit and cash generated from operations.\nFuture acquisition strategies may or may not require additional borrowings under the line-of-credit facility or other outside sources of funding.\nCash Flows From Operating Activities\nThe Company generated cash from operations of $287.6 million, $299.0 million, and $254.4 million in fiscal 2025, 2024, and 2023, respectively. The decrease in cash generated from operating activities in fiscal 2025 as compared to fiscal 2024 was mainly a result of changes in the timing of cash payments on certain operating assets and liabilities. The increase in cash generated from operating activities in fiscal 2024 as compared to fiscal 2023 was mainly a result of changes in the timing of cash payments on certain operating assets and liabilities. \nCash Flows From Investing Activities\nWe continue to make investments in our business, including capital expenditures to enable revenue growth. \n40\n\n\nTable of Contents\nDuring fiscal 2024, the Company acquired Lunaphore for $169.7 million in cash-free, debt-free acquisition. During fiscal 2023, the Company acquired Namocell for $101.2 million, net of cash acquired. There were no acquisitions in fiscal 2025. \nDuring fiscal 2025, the Company invested $15.0 million into Spear Bio. Additionally in fiscal 2025, the Company received $2.4 million from the sale of assets held-for-sale. There were no comparable activities in fiscal 2024 and 2023. \nDuring the first fiscal quarter of 2023, the Company sold its remaining shares in Eminence, its partially-owned consolidated subsidiary, for $17.8 million. There were no sales of businesses in fiscal 2025 or 2024. \nIn the first fiscal quarter of 2023, the Company sold its remaining shares in its investment in CCXI for $73.2 million. There were no comparable activities in fiscal 2025 and 2024.\nThe Company’s net proceeds from the purchase, sale and maturity of available-for-sale investments in fiscal 2025, 2024, and 2023 were $1.1 million, $22.6 million, and $14.7 million, respectively. During fiscal 2025, the Company’s proceeds in available-for-sale investments relates to our certificates of deposits maturing. During fiscal 2024, the Company’s proceeds in available-for-sale investments relates to the sale of our exchange traded investment grade bond funds. The proceeds during fiscal 2023 relates to the sale of excess cash in certificates of deposit that matured. The Company’s investment policy is to place excess cash in certificates of deposit with the objective of obtaining the highest possible return while minimizing risk and keeping the funds accessible.\nCapital additions in fiscal 2025, 2024, and 2023 were $31.0 million, $62.9 million, and $38.2 million. Fiscal 2025 capital expenditures related to investments in new buildings, machinery, construction in progress, and IT equipment. Fiscal 2024 capital expenditures related to investments in new buildings, machinery, construction in progress, and IT equipment. Fiscal 2023 capital expenditures related to investments in new buildings, machinery, and IT equipment. Capital additions planned for fiscal 2026 are approximately $42 million and are expected to be financed through currently available cash and cash generated from operations.\nDuring fiscal 2022, the Company paid $25 million to enter into a two-part forward contract which requires the Company to purchase the full equity interest in Wilson Wolf if certain annual revenue or EBITDA thresholds are met. During fiscal 2023, Wilson Wolf met the EBITDA target and the Company paid an additional $232 million to acquire 19.9% of Wilson Wolf. Since the first part of the forward contract has been triggered, the second part of the forward contract will automatically trigger, which requires the Company to acquire the remaining 80.1% of Wilson Wolf on December 31, 2027. The second part of the contract would be accelerated in advance of December 31, 2027 if Wilson Wolf meets certain financial milestones. As of June 30, 2025, the second milestones have not been met. The second option payment of approximately $1 billion plus potential contingent consideration is forecasted to occur between fiscal 2026 and fiscal 2028. During fiscal 2025 and 2024, the Company received distributions from Wilson Wolf of $7.3 million and $7.0 million, repectively. \nCash Flows From Financing Activities\nIn fiscal 2025, 2024, and 2023, the Company paid cash dividends of $50.4 million, $50.4 million, $50.3 million, respectively. The Board of Directors periodically considers the payment of cash dividends.\nThe Company received $51.7 million, $60.9 million, $29.8 million, for the exercise of options for 1,209,000, 2,240,000, and 1,578,000 shares of common stock in fiscal 2025, 2024 and 2023, respectively.\nDuring fiscal 2025, 2024, and 2023, the Company repurchased $275.7 million, $80.0 million, and $19.6 million, respectively, in share repurchases included as a cash outflow within Financing Activities.\nDuring fiscal 2025, 2024, and 2023, the Company drew $104.0 million, $225.0 million, and $619.7 million, respectively, under its revolving line-of-credit facility. Repayments of $77.0 million, $256.0 million, and $525.7 million were made on its line-of-credit in fiscal 2025, 2024, and 2023, respectively.\nDuring fiscal 2025, 2024 and 2023, the Company paid $6.5 million, $21.9 million and $28.9 million, respectively, for taxes remitted on behalf of participants in net share settlement transactions, restricted stock, and restricted stock units. \n41\n\n\nTable of Contents\nThe other financing activity during fiscal 2023 is primarily related to fees for the amended Credit Agreement that occurred in the first fiscal quarter. There was no comparable activity in fiscal 2025 or fiscal 2024. \nCRITICAL ACCOUNTING POLICIES\nManagement’s discussion and analysis of the Company’s financial condition and results of operations are based upon the Company’s Consolidated Financial Statements, which have been prepared in accordance with accounting principles generally accepted in the United States of America (U.S. GAAP). The preparation of these financial statements requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. On an ongoing basis, management evaluates its estimates. Management bases its estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nThe Company has identified the policies outlined below as critical to its business operations and an understanding of results of operations. The listing is not intended to be a comprehensive list of all accounting policies; investors should also refer to Note 1 to the Consolidated Financial Statements included in Item 8 of this Annual Report on Form 10-K.\nBusiness Combinations\nWe allocate the purchase price of acquired businesses to the estimated fair values of the assets acquired and liabilities assumed as of the date of the acquisition. The calculations used to determine the fair value of the long-lived assets acquired, primarily intangible assets, can be complex and require significant judgment. We weigh many factors when completing these estimates including, but not limited to, the nature of the acquired company’s business; its competitive position, strengths, and challenges; its historical financial position and performance; estimated customer retention rates; discount rates; and future plans for the combined entity. We may also engage independent valuation specialists, when necessary, to assist in the fair value calculations for significant acquired long-lived assets.\nThe fair value of acquired technology is generally the primary asset identified and therefore estimated using the multi-period excess earnings method. The multi-period excess earnings method model estimates revenues and cash flows derived from the primary asset and then deducts portions of the cash flow that can be attributed to supporting assets, such as trade names and in-process research and development, that contributed to the generation of the cash flows. The resulting cash flow, which is attributable solely to the primary asset acquired, is then discounted at a rate of return commensurate with the risk of the asset to calculate a present value. The trade name fair value is generally calculated using the relief from royalty method, which calculates the cost savings associated with owning rather than licensing the technology. Assumed royalty rates are applied to the projected revenues for the remaining useful life of the technology to estimate the royalty savings. In-process research and development assets are valued using the multi-period excess earnings method when the cash flows from the in-process research and development assets are separately identifiable from the primary asset. In circumstances that customer relationship assets are identified that are not the primary asset, they are valued using the distributor model income approach, which isolates revenues and cash flow associated with the sales and distribution function of the entity and attributable to customer-related assets, which are then discounted at a rate of return commensurate with the risk of the asset to calculate a present value.\nWe estimate the fair value of liabilities for contingent consideration by discounting to present value the probability weighted contingent payments expected to be made. For potential payments related to financial performance based milestones, projected revenue and/or EBITDA amounts, volatility and discount rates assumptions are included in the estimated amounts. For potential payments related to product development milestones, the fair value is based on the probability of achievement of such milestones. The excess of the purchase price over the estimated fair value of the net assets acquired is recorded as goodwill. Goodwill is not amortized, but is subject to impairment testing on at least an annual basis.\nWe are also required to estimate the useful lives of the acquired intangible assets, which determines the amount of acquisition-related amortization expense we will record in future periods. Each reporting period, we evaluate the remaining \n42\n\n\nTable of Contents\nuseful lives of our amortizable intangibles to determine whether events or circumstances warrant a revision to the remaining period of amortization.\nWhile we use our best estimates and assumptions, our fair value estimates are inherently uncertain and subject to refinement. As a result, during the measurement period, which may be up to one year from the acquisition date, we may record adjustments to the assets acquired and liabilities assumed, with the corresponding offset to goodwill. Any adjustments required after the measurement period are recorded in the Consolidated Statements of Earnings.\nThe judgments required in determining the estimated fair values and expected useful lives assigned to each class of assets and liabilities acquired can significantly affect net income. For example, different classes of assets will have useful lives that differ. Consequently, to the extent a longer-lived asset is ascribed greater value than a shorter-lived asset, net income in a given period may be higher. Additionally, assigning a lower value to amortizable intangibles would result in a higher amount assigned to goodwill. As goodwill is not amortized, this would benefit net income in a given period, although goodwill is subject to annual impairment analysis.\nImpairment of Goodwill\nGoodwill\nGoodwill was $980.9 million as of June 30, 2025, which represented 38% of total assets. Goodwill is tested for impairment on an annual basis in the fourth quarter of each year, or more frequently if events occur or circumstances change that could indicate a possible impairment.\nTo analyze goodwill for impairment, we must assign our goodwill to individual reporting units. Identification of reporting units includes an analysis of the components that comprise each of our operating segments, which considers, among other things, the manner in which we operate our business and the availability of discrete financial information. Components of an operating segment are aggregated to form one reporting unit if the components have similar economic characteristics. We periodically review our reporting units to ensure that they continue to reflect the manner in which we operate our business.\nThe Company tests goodwill for impairment by either performing a qualitative evaluation or a quantitative test. The qualitative evaluation for goodwill is an assessment of factors including reporting unit specific operating results as well as industry and market conditions, overall financial performance, and other relevant events and factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount, including goodwill. The Company may elect to bypass the qualitative assessment for its reporting units and perform a quantitative test. \nThe quantitative impairment test requires us to estimate the fair value of our reporting units based on the income approach. The income approach is a valuation technique under which we estimate future cash flows using the reporting unit’s financial forecast from the perspective of an unrelated market participant. Using historical trending and internal forecasting techniques, we project revenue and apply our fixed and variable cost experience rate to the projected revenue to arrive at the future cash flows. A terminal value is then applied to the projected cash flow stream. Future estimated cash flows are discounted to their present value to calculate the estimated fair value. The discount rate used is the value-weighted average of our estimated cost of capital derived using both known and estimated customary market metrics. In determining the estimated fair value of a reporting unit, we are required to estimate a number of factors, including projected operating results, terminal growth rates, economic conditions, anticipated future cash flows, the discount rate and the allocation of shared or corporate items. \nFor fiscal 2025, we elected to perform a quantitative analysis for all five reporting units. The Company determined, after performing the quantitative analysis, there was no evidence that it is more likely than not that the fair value was less than the carrying amounts. During the fourth quarter of fiscal 2025, as part of restructuring actions, certain assets and liabilities associated with a disposal group in our Diagnostics and Spatial Biology segment were classified as held-for-sale as of May 31, 2025. Given the upcoming divestiture, the Company identified a triggering event and performed impairment testing during May 2025. The impairment test resulted in a total impairment charge of $83.1 million, which includes the allocated goodwill, which we have further described within Note 14. The Company did not identify any additional triggering events \n43\n\n\nTable of Contents\nafter our annual goodwill impairment analysis through June 30, 2025, the date of our Consolidated Balance Sheets, that would require an additional goodwill impairment assessment to be performed.\nFor fiscal 2024, we elected to perform a qualitative analysis for all five reporting units. The Company determined, after performing the qualitative analysis, there was no evidence that it is more likely than not that the fair value was less than the carrying amounts, therefore, it was not necessary to perform a quantitative impairment test in fiscal 2024. During the second quarter of fiscal 2024, as part of restructuring actions, certain assets and liabilities associated with a disposal group in our Protein Sciences segment were classified as held-for-sale as of December 31, 2023. Given the upcoming divestiture, the Company identified a triggering event and performed impairment testing during the second half of fiscal 2024. The impairment test resulted in a total impairment charge of $22.0 million, which includes the allocated goodwill, which we have further described within Note 14. The Company did not identify any triggering events after our annual goodwill impairment analysis through June 30, 2024, the date of our Consolidated Balance Sheets, that would require an additional goodwill impairment assessment to be performed.\nFor fiscal 2023, we elected to perform a qualitative analysis for all five reporting units. The Company determined, after performing the qualitative analysis, there was no evidence that it was more likely than not that the fair value was less than the carrying amounts, therefore, it was not necessary to perform a quantitative impairment test in fiscal 2023. The Company did not identify any triggering events after our annual goodwill impairment analysis through June 30, 2023, the date of our Consolidated Balance Sheets, that would require an additional goodwill impairment assessment to be performed.\nNEW ACCOUNTING PRONOUNCEMENTS\nInformation regarding the accounting policies adopted during fiscal 2025 and those not yet adopted can be found under caption “Note 1: Description of Business and Summary of Significant Accounting Policies” of the Notes to the Consolidated Financial Statements appear in Item 8 of this report.\nSUBSEQUENT EVENTS\nOn August 5, 2025, the Company announced the execution of a definitive agreement to sell the Exosome Diagnostics business for $15 million including $5 million of stock of the acquiring company at closing with the remainder received over the following four years. The transaction is expected to close during the first quarter of fiscal 2026.\nNON-GAAP FINANCIAL MEASURES\nThis Annual Report on Form 10-K, including “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Item 7, contains financial measures that have not been calculated in accordance with accounting principles generally accepted in the U.S. (GAAP). These non-GAAP measures include:\n●\nOrganic growth\n●\nAdjusted gross margin\n●\nAdjusted operating margin\n●\nAdjusted net earnings\n●\nAdjusted effective tax rate\n​\nWe provide these measures as additional information regarding our operating results. We use these non-GAAP measures internally to evaluate our performance and in making financial and operational decisions, including with respect to incentive compensation. We believe that our presentation of these measures provides investors with greater transparency with respect to our results of operations and that these measures are useful for period-to-period comparison of results.\n44\n\n\nTable of Contents\nOur non-GAAP financial measure of organic revenue represents revenue growth excluding revenue from acquisitions within the preceding 12 months, the impact of foreign currency, the impact of businesses held-for-sale, as well as the impact of partially-owned consolidated subsidiaries. Excluding these measures provides more useful period-to-period comparison of revenue results as it excludes the impact of foreign currency exchange rates, which can vary significantly from period to period, and revenue from acquisitions that would not be included in the comparable prior period. Revenues from businesses held-for-sale are excluded from our organic revenue calculation starting on the date they become held-for-sale as those revenues will not be comparative in future periods. Revenues from partially-owned subsidiaries consolidated in our financial statements are also excluded from our organic revenue calculation, as those revenues are not fully attributable to the Company. There was no revenue from partially-owned consolidated subsidiaries in fiscal 2025 and 2024 due to the sale of Eminence in the first quarter of fiscal 2023. Revenue from partially-owned consolidated subsidiaries was $2.0 million for fiscal 2023.\nOur non-GAAP financial measures for adjusted gross margin, adjusted operating margin, and adjusted net earnings, in total and on a per share basis, exclude stock-based compensation, which is inclusive of the employer portion of payroll taxes on those stock awards, the costs recognized upon the sale of acquired inventory, amortization of acquisition intangibles, restructuring and restructuring-related costs, and other non-recurring items including non-recurring costs, goodwill and long-lived asset impairments, and gains. Stock-based compensation is excluded from non-GAAP adjusted net earnings because of the nature of this charge, specifically the varying available valuation methodologies, subjection assumptions, variety of award types, and unpredictability of amount and timing of employer related tax obligations. The Company excludes amortization of purchased intangible assets, purchase accounting adjustments, including costs recognized upon the sale of acquired inventory and acquisition-related expenses inclusive of the changes in fair value contingent consideration, and other non-recurring items including gains or losses on goodwill and long-lived asset impairment charges, and one-time assessments from this measure because they occur as a result of specific events, and are not reflective of our internal investments, the costs of developing, producing, supporting and selling our products, and the other ongoing costs to support our operating structure. We also exclude certain litigation charges which are facts and circumstances specific including costs to resolve litigation and legal settlement (gains and losses). In some cases, these costs may be a result of litigation matters at acquired companies that were not probable, inestimable, or unresolved at the time of acquisition. Costs related to restructuring and restructuring-related activities, including reducing overhead and consolidating facilities, are excluded because we believe they are not indicative of our normal operating costs. Additionally, these amounts can vary significantly from period to period based on current activity. The Company also excludes revenue and expense attributable to partially-owned consolidated subsidiaries as well as revenue and expense attributable to businesses held-for-sale in the calculation of our non-GAAP financial measures.\nThe Company’s non-GAAP adjusted operating margin and adjusted net earnings, in total and on a per share basis, also excludes acquisition related expenses inclusive of the changes in fair value of contingent consideration, gain and losses from investments, as they are not part of our day-to-day operating decisions (excluding our equity method investment in Wilson Wolf as it is certain to be acquired in the future), certain adjustments to income tax expense, and other non-recurring items including certain costs related to the transition to a new CEO. Additionally, gains and losses from investments that are either isolated or cannot be expected to occur again with any predictability are excluded. The Company independently calculates a non-GAAP adjusted tax rate to be applied to the identified non-GAAP adjustments considering the impact of discrete items on these adjustments and the jurisdictional mix of the adjustments. In addition, the tax impact of other discrete and non-recurring charges which impact our reported GAAP tax rate are adjusted from net earnings. We believe these tax items can significantly affect the period-over-period assessment of operating results and not necessarily reflect costs and/or income associated with historical trends and future results.\nThe Company periodically reassesses the components of our non-GAAP adjustments for changes in how we evaluate our performance, changes in how we make financial and operational decisions, and considers the use of these measures by our competitors and peers to ensure the adjustments are still relevant and meaningful.\nReaders are encouraged to review the reconciliations of the adjusted financial measures used in management’s discussion and analysis of the financial condition of the Company to the most directly comparable GAAP financial measures provided within the Company’s Consolidated Financial Statements.\n​\n45\n\n\nTable of Contents",
  "item2": null
}