{
  "source_file": "tel-20250627x10q.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM \n2.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our Condensed Consolidated Financial Statements and the accompanying notes included elsewhere in this Quarterly Report on Form 10-Q. The following discussion may contain forward-looking statements that reflect our plans, estimates, and beliefs. Our actual results could differ materially from those discussed in these forward-looking statements as a result of many factors, including but not limited to those under the heading “Forward-Looking Information” and “Part II. Item 1A. Risk Factors.”\nOur Condensed Consolidated Financial Statements have been prepared in United States (“U.S.”) dollars, in accordance with accounting principles generally accepted in the U.S. (“GAAP”).\nThe following discussion includes organic net sales growth (decline) which is a non-GAAP financial measure. See “Non-GAAP Financial Measure” for additional information regarding this measure.\nOverview\nTE Connectivity plc (“TE Connectivity” or the “Company,” which may be referred to as “we,” “us,” or “our”) is a global industrial technology leader creating a safer, sustainable, productive, and connected future. Our broad range of connectivity and sensor solutions enable the distribution of power, signal, and data to advance next-generation transportation, energy networks, automated factories, data centers, medical technology, and more.\nChange in Place of Incorporation\nAt the beginning of fiscal 2025, our jurisdiction of incorporation changed from Switzerland to Ireland. We do not anticipate any material changes in our operations or financial results as a result of the change in place of incorporation. See additional information in Note 1 to the Condensed Consolidated Financial Statements.\nNew Segment Structure\nEffective for fiscal 2025, we reorganized our management and segments to align the organization around our current strategy. We now operate through two reportable segments: Transportation Solutions and Industrial Solutions. Prior period segment results have been recast to conform to the new segment structure. See additional information in Note 1 to the Condensed Consolidated Financial Statements.\nSummary of Performance\n●\nOur net sales increased 13.9% in the third quarter of fiscal 2025 due to sales growth in the Industrial Solutions segment and, to a lesser degree, the Transportation Solutions segment. In the first nine months of fiscal 2025, our net sales increased 6.2% due to sales growth in the Industrial Solutions segment, partially offset by sales declines in the Transportation Solutions segment. Richards Manufacturing Co. (“Richards Manufacturing”), which was acquired in April 2025, contributed net sales of $73 million. On an organic basis, our net sales increased 9.1% and 4.8% in the third quarter and first nine months of fiscal 2025, respectively, as compared to the same periods of fiscal 2024.\n●\nOur net sales by segment were as follows:\n●\nTransportation Solutions\n—Our net sales increased 2.8% in the third quarter of fiscal 2025 due primarily to sales increases in the automotive end market and, to a lesser degree, the commercial transportation end market. In the first nine months of fiscal 2025, our net sales declined 2.5% as a result of sales declines in all end markets. \n26\n\n\nTable of Contents\n●\nIndustrial Solutions\n—Our net sales increased 30.0% and 19.7% in the third quarter and first nine months of fiscal 2025, respectively, as a result of sales growth in the digital data networks; energy; aerospace, defense, and marine; and automation and connected living end markets, partially offset by sales declines in the medical end market.\n●\nIn June 2025, our board of directors declared a regular quarterly dividend of $0.71 per ordinary share, payable on September 12, 2025, to shareholders of record on August 22, 2025.\n●\nNet cash provided by operating activities was $2,718 million in the first nine months of fiscal 2025.\n●\nWe acquired Richards Manufacturing, a U.S.-based producer of overhead and underground electrical and gas distribution products, in the third quarter of fiscal 2025. \nOutlook\nIn the fourth quarter of fiscal 2025, we expect our net sales to be approximately $4.55 billion, as compared to $4.07 billion in the fourth quarter of fiscal 2024. This increase is due primarily to sales growth in the Industrial Solutions segment, which will benefit from the recently completed acquisition of Richards Manufacturing. In the fourth quarter of fiscal 2025, we expect diluted earnings per share from continuing operations to be approximately $2.18 per share. This outlook reflects the positive impact of foreign currency exchange rates on net sales and earnings per share of approximately $111 million and $0.03 per share, respectively, in the fourth quarter of fiscal 2025 as compared to the same period of fiscal 2024 and includes the impact of currently enacted tariffs which we expect to largely mitigate through pricing actions and sourcing changes. Also, this outlook is based on foreign currency exchange rates and commodity prices that are consistent with current levels.\nAcquisitions\nAs discussed above, on April 1, 2025, we acquired 100% of Richards Manufacturing for cash of approximately $2.3 billion, net of cash acquired. The acquired business has been reported as part of the energy business within our Industrial Solutions segment from the date of acquisition.\nDuring the first nine months of fiscal 2025, we acquired two additional businesses for a combined cash purchase price of $321 million, net of cash acquired. The acquired businesses have been reported as part of our Industrial Solutions segment from the date of acquisition. \nSee Note 3 to the Condensed Consolidated Financial Statements for additional information regarding acquisitions.\nResults of Operations\nNet Sales\nThe following table presents our net sales and the percentage of total net sales by segment:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\n​\nFor the \n​\n​\n​\n​\nQuarters Ended\n​\n​\nNine Months Ended\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n    \n2025\n    \n    \n2024\n    \n    \n2025\n    \n    \n2024\n    \n    \n​\n \n($ in millions)\n \nTransportation Solutions\n​\n$\n 2,418\n​\n 53\n%  \n​\n$\n 2,351\n​\n 59\n%  \n​\n$\n 6,975\n​\n 56\n%  \n​\n$\n 7,151\n​\n 61\n%  \n​\nIndustrial Solutions\n​\n \n 2,116\n \n 47\n​\n​\n \n 1,628\n \n 41\n​\n​\n \n 5,538\n \n 44\n​\n​\n \n 4,626\n \n 39\n​\n​\nTotal\n​\n$\n 4,534\n \n 100\n%  \n​\n$\n 3,979\n \n 100\n%  \n​\n$\n 12,513\n \n 100\n%  \n​\n$\n 11,777\n \n 100\n%  \n​\n27\n\n\nTable of Contents\nThe following table provides an analysis of the change in our net sales by segment:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nChange in Net Sales for the Quarter Ended June 27, 2025\n​\nChange in Net Sales for the Nine Months Ended June 27, 2025\n​\n​\nversus Net Sales for the Quarter Ended June 28, 2024\n​\nversus Net Sales for the Nine Months Ended June 28, 2024\n​\n​\nNet Sales\n​\nOrganic Net Sales\n​\n​\n​\n​\n​\n​\n​\nNet Sales\n​\nOrganic Net Sales\n​\n​\n​\n​\nAcquisitions\n​\n​\nGrowth\n​\nGrowth\n​\nTranslation\n​\nAcquisitions\n    \nGrowth (Decline)\n​\nGrowth (Decline)\n    \nTranslation\n    \n(Divestiture)\n    \n​\n($ in millions)\n \nTransportation Solutions\n$\n 67\n \n 2.8\n%  \n$\n 29\n \n 1.1\n%  \n$\n 38\n​\n$\n —\n​\n$\n (176)\n \n (2.5)\n%  \n$\n (136)\n \n (1.9)\n%  \n$\n (28)\n​\n$\n (12)\n​\nIndustrial Solutions\n \n 488\n \n 30.0\n​\n \n 332\n \n 20.5\n​\n \n 30\n​\n \n 126\n​\n \n 912\n \n 19.7\n​\n \n 702\n \n 15.2\n​\n \n (2)\n​\n \n 212\n​\nTotal\n$\n 555\n \n 13.9\n%  \n$\n 361\n \n 9.1\n%  \n$\n 68\n​\n$\n 126\n​\n$\n 736\n \n 6.2\n%  \n$\n 566\n \n 4.8\n%  \n$\n (30)\n​\n$\n 200\n​\nNet sales increased $555 million, or 13.9%, in the third quarter of fiscal 2025 as compared to the third quarter of fiscal 2024 due to organic net sales growth of 9.1%, the positive impact of 3.1% from acquisitions, and the positive impact of foreign currency translation of 1.7% due to the strengthening of certain foreign currencies. Richards Manufacturing, which was acquired on April 1, 2025, contributed net sales of $73 million in the third quarter of fiscal 2025. Net pricing actions positively affected organic net sales by $28 million in the third quarter of fiscal 2025.\nIn the first nine months of fiscal 2025, net sales increased $736 million, or 6.2%, as compared to the first nine months of fiscal 2024 due primarily to organic net sales growth of 4.8% and the net positive impact of 1.7% from acquisitions and a divestiture. Richards Manufacturing contributed net sales of $73 million in the first nine months of fiscal 2025. Net pricing actions positively affected organic net sales by $8 million in the first nine months of fiscal 2025.\nSee further discussion of net sales below under “Segment Results.”\nNet Sales by Geographic Region.  \nOur business operates in three geographic regions—Europe/Middle East/Africa (“EMEA”), Asia–Pacific, and the Americas—and our results of operations are influenced by changes in foreign currency exchange rates. Increases or decreases in the value of the U.S. dollar, compared to other currencies, will directly affect our reported results as we translate those currencies into U.S. dollars at the end of each fiscal period.\nApproximately 60% of our net sales were invoiced in currencies other than the U.S. dollar in the first nine months of fiscal 2025.\nThe following table presents our net sales and the percentage of total net sales by geographic region\n(1)\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\n​\nFor the \n​\n​\n​\n​\nQuarters Ended\n​\n​\nNine Months Ended\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n    \n2025\n    \n    \n2024\n    \n    \n2025\n    \n    \n2024\n    \n    \n​\n​\n($ in millions)\n​\nEMEA\n​\n$\n 1,545\n​\n 34\n%  \n​\n$\n 1,466\n​\n 37\n%  \n​\n$\n 4,187\n​\n 34\n%  \n​\n$\n 4,429\n​\n 37\n%  \n​\nAsia–Pacific\n​\n​\n 1,660\n \n 37\n​\n​\n​\n 1,333\n \n 33\n​\n​\n​\n 4,805\n \n 38\n​\n​\n​\n 3,969\n \n 34\n​\n​\nAmericas\n​\n \n 1,329\n \n 29\n​\n​\n \n 1,180\n \n 30\n​\n​\n \n 3,521\n \n 28\n​\n​\n \n 3,379\n \n 29\n​\n​\nTotal\n​\n$\n 4,534\n \n 100\n%  \n​\n$\n 3,979\n \n 100\n%  \n​\n$\n 12,513\n \n 100\n%  \n​\n$\n 11,777\n \n 100\n%  \n​\n(1)\nNet sales to external customers are attributed to individual countries based on the legal entity that records the sale.\n​\n28\n\n\nTable of Contents\nThe following table provides an analysis of the change in our net sales by geographic region:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nChange in Net Sales for the Quarter Ended June 27, 2025\n​\nChange in Net Sales for the Nine Months Ended June 27, 2025\n​\n​\n​\nversus Net Sales for the Quarter Ended June 28, 2024\n​\nversus Net Sales for the Nine Months Ended June 28, 2024\n​\n​\n​\nNet Sales\n​\nOrganic Net Sales\n​\n​\n​\n​\n​\n​\n​\nNet Sales\n​\nOrganic Net Sales\n​\n​\n​\n​\nAcquisitions\n​\n​\n    \nGrowth\n    \nGrowth\n    \nTranslation\n    \nAcquisitions\n    \nGrowth (Decline)\n    \nGrowth (Decline)\n​\nTranslation\n​\n(Divestiture)\n    \n​\n​\n($ in millions)\n \nEMEA\n​\n$\n 79\n \n 5.4\n%  \n$\n 8\n \n 0.6\n%  \n$\n 63\n​\n$\n 8\n​\n$\n (242)\n \n (5.5)\n%  \n$\n (280)\n​\n (6.3)\n%  \n$\n 17\n​\n$\n 21\n​\nAsia–Pacific\n​\n​\n 327\n​\n 24.5\n​\n​\n 312\n​\n 23.1\n​\n​\n 12\n​\n​\n 3\n​\n​\n 836\n \n 21.1\n​\n​\n 829\n \n 20.9\n​\n​\n (8)\n​\n​\n 15\n​\nAmericas\n​\n \n 149\n \n 12.6\n​\n \n 41\n \n 3.7\n​\n \n (7)\n​\n \n 115\n​\n \n 142\n \n 4.2\n​\n \n 17\n \n 0.5\n​\n \n (39)\n​\n \n 164\n​\nTotal\n​\n$\n 555\n \n 13.9\n%  \n$\n 361\n \n 9.1\n%  \n$\n 68\n​\n$\n 126\n​\n$\n 736\n \n 6.2\n%  \n$\n 566\n​\n 4.8\n%  \n$\n (30)\n​\n$\n 200\n​\nCost of Sales and Gross Margin\nThe following table presents cost of sales and gross margin information:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\n​\n​\n​\n​\nFor the \n​\n​\n​\n​\n​\n​\n​\nQuarters Ended\n​\n​\n​\n​\n​\nNine Months Ended\n​\n​\n​\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n​\n​\n    \n2025\n    \n    \n2024\n    \n    \nChange\n     \n2025\n    \n    \n2024\n    \n    \nChange\n    \n​\n​\n($ in millions)\n​\nCost of sales\n​\n$\n 2,934\n​\n​\n$\n 2,593\n​\n​\n$\n 341\n​\n$\n 8,094\n​\n​\n$\n 7,704\n​\n​\n$\n 390\n​\nAs a percentage of net sales\n​\n \n 64.7\n%\n​\n \n 65.2\n%\n​\n \n  \n​\n \n 64.7\n%\n​\n \n 65.4\n%\n​\n \n  \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nGross margin\n​\n$\n 1,600\n​\n​\n$\n 1,386\n​\n​\n$\n 214\n​\n$\n 4,419\n​\n​\n$\n 4,073\n​\n​\n$\n 346\n​\nAs a percentage of net sales\n​\n \n 35.3\n%\n​\n \n 34.8\n%\n​\n \n  \n​\n \n 35.3\n%\n​\n \n 34.6\n%\n​\n \n  \n​\nGross margin increased $214 million and $346 million in the third quarter and first nine months of fiscal 2025, respectively, as compared to the same periods of fiscal 2024 due primarily to higher volume and improved manufacturing productivity. \nWe use a wide variety of raw materials in the manufacture of our products. Cost of sales and gross margin are subject to variability in raw material prices, which continue to fluctuate for many of the raw materials we use. The following table presents the average prices incurred related to copper, gold, silver, and palladium:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\nFor the \n​\n​\n​\n​\n​\nQuarters Ended\n​\nNine Months Ended\n​\n​\n​\n​\n​\nJune 27,\n​\nJune 28,\n​\nJune 27,\n​\nJune 28,\n​\n​\n    \nMeasure\n    \n2025\n    \n2024\n    \n2025\n    \n2024\n    \nCopper\n \nLb.\n​\n$\n 4.32\n​\n$\n 3.98\n \n$\n 4.21\n​\n$\n 3.88\n \nGold\n \nTroy oz.\n​\n \n 2,715\n​\n \n 2,048\n \n \n 2,498\n​\n \n 1,986\n \nSilver\n​\nTroy oz.\n​\n​\n 29.80\n​\n​\n 25.71\n​\n​\n 28.43\n​\n​\n 24.06\n​\nPalladium\n \nTroy oz.\n​\n \n 1,019\n​\n \n 1,418\n \n \n 1,073\n​\n \n 1,470\n \nWe expect to purchase approximately 190 million pounds of copper, 110,000 troy ounces of gold, 1.7 million troy ounces of silver, and 13,000 troy ounces of palladium in fiscal 2025.\n29\n\n\nTable of Contents\nOperating Expenses\nThe following table presents operating expense information:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\n​\n​\n​\n​\nFor the \n​\n​\n​\n​\n​\n​\n​\nQuarters Ended\n​\n​\n​\n​\n​\nNine Months Ended\n​\n​\n​\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n​\n​\n    \n2025\n    \n    \n2024\n    \n    \nChange\n     \n2025\n    \n    \n2024\n    \n    \nChange\n    \n​\n​\n($ in millions)\n​\nSelling, general, and administrative expenses\n​\n$\n 491\n​\n​\n$\n 431\n​\n​\n$\n 60\n​\n$\n 1,372\n​\n​\n$\n 1,299\n​\n​\n$\n 73\n​\nAs a percentage of net sales\n​\n \n 10.8\n%\n​\n \n 10.8\n%\n​\n \n  \n​\n \n 11.0\n%\n​\n \n 11.0\n%\n​\n \n  \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAcquisition and integration costs\n​\n$\n 27\n​\n​\n$\n 5\n​\n​\n$\n 22\n​\n$\n 41\n​\n​\n$\n 16\n​\n​\n$\n 25\n​\nRestructuring and other charges, net\n​\n​\n 14\n​\n​\n​\n 6\n​\n​\n​\n 8\n​\n​\n 109\n​\n​\n​\n 67\n​\n​\n​\n 42\n​\nSelling, General, and Administrative Expenses.  \nSelling, general, and administrative expenses increased $60 million in the third quarter of fiscal 2025 compared to the third quarter of fiscal 2024 due primarily to increased selling expenses to support higher sales levels, higher incentive compensation costs, and incremental expenses attributable to recently acquired businesses, partially offset by savings attributable to restructuring actions. In the first nine months of fiscal 2025, selling, general, and administrative expenses increased $73 million as compared to the first nine months of fiscal 2024 due primarily to increased selling expenses to support higher sales levels, higher incentive compensation costs, and incremental expenses attributable to recently acquired businesses, partially offset by savings attributable to restructuring actions and the release of reserves associated with trade compliance matters.\nAcquisition and Integration Costs.  \nDuring the first nine months of fiscal 2025, we incurred acquisition and integration costs of $41 million, of which $25 million related to the acquisition of Richards Manufacturing. See Note 3 to the Condensed Consolidated Financial Statements for additional information regarding this acquisition.\nRestructuring and Other Charges, Net.  \nWe are committed to continuous productivity improvements, and we evaluate opportunities to simplify our global manufacturing footprint, migrate facilities to lower-cost regions, reduce fixed costs, and eliminate excess capacity. These initiatives are designed to help us maintain our competitiveness in the industry, improve our operating leverage, and position us for future growth.\nDuring fiscal 2025, we initiated a restructuring program associated with footprint consolidation and cost structure improvements in both of our segments. We incurred net restructuring charges of $97 million during the first nine months of fiscal 2025, of which $80 million related to the fiscal 2025 restructuring program. Annualized cost savings related to the fiscal 2025 actions commenced during the first nine months of fiscal 2025 are expected to be approximately $70 million and are expected to be fully realized by the end of fiscal 2026. Cost savings will be reflected primarily in cost of sales and selling, general, and administrative expenses. For fiscal 2025, we expect total restructuring charges to be approximately $110 million and total cash spend, which will be funded with cash from operations, to be approximately $200 million.\nDuring both the first nine months of fiscal 2025 and 2024, we incurred costs of $11 million related to our change in place of incorporation from Switzerland to Ireland. See Note 1 to the Condensed Consolidated Financial Statements for additional information regarding the change.\nSee Note 2 to the Condensed Consolidated Financial Statements for additional information regarding net restructuring and other charges. \n30\n\n\nTable of Contents\nOperating Income\nThe following table presents operating income and operating margin information:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\n​\n​\n​\n​\nFor the \n​\n​\n​\n​\n​\n​\n​\nQuarters Ended\n​\n​\n​\n​\n​\nNine Months Ended\n​\n​\n​\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n​\n​\n    \n2025\n    \n    \n2024\n    \n    \nChange\n     \n2025\n    \n    \n2024\n    \n    \nChange\n    \n​\n​\n($ in millions)\n​\nOperating income\n​\n$\n 857\n​\n​\n$\n 755\n​\n​\n$\n 102\n​\n$\n 2,295\n​\n​\n$\n 2,145\n​\n​\n$\n 150\n​\nOperating margin\n​\n \n 18.9\n%\n​\n \n 19.0\n%\n​\n \n  \n​\n \n 18.3\n%\n​\n \n 18.2\n%\n​\n \n  \n​\nOperating income included the following:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\nFor the \n​\n​\n​\nQuarters Ended\n​\nNine Months Ended\n​\n​\n​\nJune 27,\n​\nJune 28,\n​\nJune 27,\n​\nJune 28,\n​\n​\n    \n2025\n    \n2024\n    \n2025\n    \n2024\n    \n​\n​\n(in millions)\n​\nAcquisition-related charges:\n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n​\nAcquisition and integration costs\n​\n$\n 27\n​\n$\n 5\n​\n$\n 41\n​\n$\n 16\n​\nCharges associated with the amortization of acquisition-related fair value adjustments\n​\n \n 3\n​\n \n —\n​\n \n 6\n​\n \n —\n​\n​\n​\n \n 30\n​\n \n 5\n​\n \n 47\n​\n \n 16\n​\nRestructuring and other charges, net\n​\n \n 14\n​\n \n 6\n​\n \n 109\n​\n \n 67\n​\nTaxes (non-income tax) recorded in selling, general, and administrative expenses\n​\n​\n —\n​\n​\n —\n​\n​\n —\n​\n​\n 4\n​\nTotal\n​\n$\n 44\n​\n$\n 11\n​\n$\n 156\n​\n$\n 87\n​\nSee discussion of operating income below under “Segment Results.”\nNon-Operating Items\nThe following table presents select non-operating information:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\n​\n​\n​\n​\nFor the \n​\n​\n​\n​\n​\n​\n​\nQuarters Ended\n​\n​\n​\n​\n​\nNine Months Ended\n​\n​\n​\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n​\n​\n    \n2025\n    \n    \n2024\n    \n    \nChange\n     \n2025\n    \n    \n2024\n    \n    \nChange\n    \n​\n​\n($ in millions)\n​\nIncome tax expense (benefit)\n​\n$\n 208\n​\n​\n$\n 181\n​\n​\n$\n 27\n​\n$\n 1,128\n​\n​\n$\n (778)\n​\n​\n$\n 1,906\n​\nEffective tax rate\n​\n \n 24.6\n%\n​\n \n 24.0\n%\n​\n \n  \n​\n \n 48.9\n%\n​\n \n (36.4)\n%\n​\n \n  \n​\nIncome Taxes.  \nSee Note 12 to the Condensed Consolidated Financial Statements for discussion of income taxes.\n​\n31\n\n\nTable of Contents\nSegment Results\nTransportation Solutions\nNet Sales.  \nThe following table presents the Transportation Solutions segment’s net sales and the percentage of total net sales by industry end market\n(1)\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\n​\nFor the \n​\n​\n​\n​\nQuarters Ended\n​\n​\nNine Months Ended\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n    \n2025\n    \n    \n2024\n    \n    \n2025\n    \n    \n2024\n    \n    \n​\n​\n($ in millions)\n​\n​\nAutomotive\n​\n$\n 1,805\n    \n 74\n%  \n​\n$\n 1,748\n    \n 74\n%  \n​\n$\n 5,262\n​\n 75\n%  \n​\n$\n 5,316\n​\n 74\n%  \n​\nCommercial transportation\n​\n \n 377\n \n 16\n​\n​\n \n 363\n \n 16\n​\n​\n \n 1,046\n \n 15\n​\n​\n \n 1,103\n \n 16\n​\n​\nSensors\n​\n \n 236\n \n 10\n​\n​\n \n 240\n \n 10\n​\n​\n \n 667\n \n 10\n​\n​\n \n 732\n \n 10\n​\n​\nTotal\n​\n$\n 2,418\n \n 100\n%  \n​\n$\n 2,351\n \n 100\n%  \n​\n$\n 6,975\n \n 100\n%  \n​\n$\n 7,151\n \n 100\n%  \n​\n(1)\nIndustry end market information is presented consistently with our internal management reporting and may be revised periodically as management deems necessary.\nThe following table provides an analysis of the change in the Transportation Solutions segment’s net sales by industry end market:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nChange in Net Sales for the Quarter Ended June 27, 2025\n​\nChange in Net Sales for the Nine Months Ended June 27, 2025\n​\n​\n​\n versus Net Sales for the Quarter Ended June 28, 2024\n​\n versus Net Sales for the Nine Months Ended June 28, 2024\n​\n​\n    \nNet Sales\n    \nOrganic Net Sales\n    \n​\n​\n    \nNet Sales\n    \nOrganic Net Sales\n    \n​\n​\n    \n​\n​\n    \n​\n​\nGrowth (Decline)\n​\nGrowth (Decline)\n​\nTranslation\n​\nDecline\n​\nDecline\n​\nTranslation\n​\nDivestiture\n \n​\n​\n($ in millions)\n \nAutomotive\n​\n$\n 57\n​\n 3.3\n%  \n$\n 28\n​\n 1.5\n%  \n$\n 29\n​\n$\n (54)\n​\n (1.0)\n%  \n$\n (21)\n​\n (0.4)\n%  \n$\n (21)\n    \n$\n (12)\n​\nCommercial transportation\n​\n \n 14\n \n 3.9\n​\n \n 10\n \n 2.7\n​\n \n 4\n​\n \n (57)\n \n (5.2)\n​\n \n (51)\n \n (4.6)\n​\n \n (6)\n​\n \n —\n​\nSensors\n​\n \n (4)\n \n (1.7)\n​\n \n (9)\n \n (3.8)\n​\n \n 5\n​\n \n (65)\n \n (8.9)\n​\n \n (64)\n \n (8.7)\n​\n \n (1)\n​\n \n —\n​\nTotal\n​\n$\n 67\n \n 2.8\n%  \n$\n 29\n \n 1.1\n%  \n$\n 38\n​\n$\n (176)\n \n (2.5)\n%  \n$\n (136)\n \n (1.9)\n%  \n$\n (28)\n​\n$\n (12)\n​\nNet sales in the Transportation Solutions segment increased $67 million, or 2.8%, in the third quarter of fiscal 2025 from the third quarter of fiscal 2024 due to the positive impact of foreign currency translation of 1.7% and organic net sales growth of 1.1%. Our organic net sales by industry end market were as follows:\n●\nAutomotive—\nOur organic net sales increased 1.5% in the third quarter of fiscal 2025 as a result of growth of 10.5% in the Asia–Pacific region, partially offset by declines of 6.6% in the Americas region and 4.8% in the EMEA region. Our organic net sales growth in the Asia–Pacific region was due to increased content per vehicle as well as vehicle production growth. In the Americas and EMEA regions, our organic net sales were impacted by declines in vehicle production.\n●\nCommercial transportation—\nOur organic net sales increased 2.7% in the third quarter of fiscal 2025 due to growth in the Asia–Pacific and EMEA regions, partially offset by declines in the Americas region.\n●\nSensors—\nOur organic net sales decreased 3.8% in the third quarter of fiscal 2025 as a result of market weakness in both industrial and transportation applications.\n​\n32\n\n\nTable of Contents\nIn the first nine months of fiscal 2025, net sales in the Transportation Solutions segment decreased $176 million, or 2.5%, from the first nine months of fiscal 2024 due primarily to organic net sales declines of 1.9%. Our organic net sales by industry end market were as follows: \n●\nAutomotive\n—Our organic net sales were flat in the first nine months of fiscal 2025 as declines of 11.3% in the EMEA region and 7.6% in the Americas region were largely offset by growth of 11.7% in the Asia–Pacific region. In the EMEA and Americas regions, our organic net sales were impacted by declines in vehicle production and a shift in platform mix consistent with consumer demand. Our organic net sales growth in the Asia–Pacific region resulted from increased content per vehicle as well as vehicle production growth.\n●\nCommercial transportation\n—Our organic net sales decreased 4.6% in the first nine months of fiscal 2025 as a result of declines in the Americas and EMEA regions, partially offset by growth in the Asia–Pacific region.\n●\nSensors\n—Our organic net sales decreased 8.7% in the first nine months of fiscal 2025 due to market weakness in both transportation and industrial applications.\nOperating Income.  \nThe following table presents the Transportation Solutions segment’s operating income and operating margin information:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\n​\n​\n​\nFor the \n​\n​\n​\n​\n​\n​\nQuarters Ended\n​\n​\n​\n​\nNine Months Ended\n​\n​\n​\n​\n​\n​\nJune 27,\n​\nJune 28,\n​\n​\n​\n​\nJune 27,\n​\nJune 28,\n​\n​\n​\n​\n​\n    \n2025\n    \n2024\n    \nChange\n     \n2025\n    \n2024\n    \nChange\n    \n​\n​\n($ in millions)\n​\nOperating income\n​\n$\n 462\n​\n$\n 506\n​\n$\n (44)\n​\n$\n 1,353\n​\n$\n 1,470\n​\n$\n (117)\n​\nOperating margin\n​\n \n 19.1\n%\n \n 21.5\n%\n \n​\n​\n \n 19.4\n%\n \n 20.6\n%\n \n​\n​\nOperating income in the Transportation Solutions segment decreased $44 million and $117 million in the third quarter and first nine months of fiscal 2025, respectively, as compared to the same periods of fiscal 2024. Excluding the items below, operating income decreased in the third quarter of fiscal 2025 primarily as a result of net price erosion. Excluding the items below, operating income decreased in the first nine months of fiscal 2025 primarily as a result of net price erosion and lower volume.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\nFor the \n​\n​\n​\nQuarters Ended\n​\nNine Months Ended\n​\n​\n​\nJune 27,\n​\nJune 28,\n​\nJune 27,\n​\nJune 28,\n​\n​\n    \n2025\n    \n2024\n    \n2025\n    \n2024\n    \n​\n​\n(in millions)\n​\nRestructuring and other charges (credits), net\n​\n$\n 7\n​\n$\n (8)\n​\n$\n 72\n​\n$\n 25\n​\nTaxes (non-income tax) recorded in selling, general, and administrative expenses\n​\n​\n —\n​\n​\n —\n​\n​\n —\n​\n​\n 3\n​\nTotal\n​\n$\n 7\n​\n$\n (8)\n​\n$\n 72\n​\n$\n 28\n​\n33\n\n\nTable of Contents\nIndustrial Solutions\nNet Sales.  \nThe following table presents the Industrial Solutions segment’s net sales and the percentage of total net sales by industry end market\n(1)\n:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\n​\nFor the \n​\n​\n​\n​\nQuarters Ended\n​\n​\nNine Months Ended\n​\n​\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\nJune 27,\n​\n​\nJune 28,\n​\n​\n​\n    \n2025\n    \n    \n2024\n    \n    \n2025\n    \n    \n2024\n    \n    \n​\n​\n($ in millions)\n​\n​\nAutomation and connected living\n​\n$\n 571\n \n 27\n%  \n​\n$\n 519\n \n 32\n%  \n​\n$\n 1,562\n \n 28\n%  \n​\n$\n 1,483\n \n 32\n%  \n​\nAerospace, defense, and marine\n​\n​\n 374\n​\n 18\n​\n​\n​\n 345\n​\n 21\n​\n​\n​\n 1,082\n​\n 20\n​\n​\n​\n 977\n​\n 21\n​\n​\nDigital data networks\n​\n​\n 606\n​\n 29\n​\n​\n​\n 329\n​\n 20\n​\n​\n​\n 1,501\n​\n 27\n​\n​\n​\n 881\n​\n 19\n​\n​\nEnergy\n​\n \n 384\n \n 18\n​\n​\n \n 226\n \n 14\n​\n​\n \n 879\n \n 16\n​\n​\n \n 665\n \n 14\n​\n​\nMedical\n​\n​\n 181\n \n 8\n​\n​\n​\n 209\n​\n 13\n​\n​\n​\n 514\n​\n 9\n​\n​\n​\n 620\n​\n 14\n​\n​\nTotal\n​\n$\n 2,116\n \n 100\n%  \n​\n$\n 1,628\n \n 100\n%  \n​\n$\n 5,538\n \n 100\n%  \n​\n$\n 4,626\n \n 100\n%  \n​\n(1)\nIndustry end market information is presented consistently with our internal management reporting and may be revised periodically as management deems necessary.\nThe following table provides an analysis of the change in the Industrial Solutions segment’s net sales by industry end market:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nChange in Net Sales for the Quarter Ended June 27, 2025\n​\nChange in Net Sales for the Nine Months Ended June 27, 2025\n​\n​\n​\n versus Net Sales for the Quarter Ended June 28, 2024\n​\n versus Net Sales for the Nine Months Ended June 28, 2024\n​\n​\n​\nNet Sales\n​\nOrganic Net Sales\n​\n​\n​\n​\n​\n​\nNet Sales\n​\nOrganic Net Sales\n​\n​\n​\n​\n​\n​\n​\n​\n    \nGrowth (Decline)\n    \nGrowth (Decline)\n    \nTranslation\n    \nAcquisitions\n    \nGrowth (Decline)\n    \nGrowth (Decline)\n    \nTranslation\n    \nAcquisitions\n    \n​\n​\n($ in millions)\n \nAutomation and connected living\n​\n$\n 52\n \n 10.0\n%  \n$\n 26\n \n 5.0\n%  \n$\n 10\n​\n$\n 16\n​\n$\n 79\n \n 5.3\n%  \n$\n 13\n​\n 0.9\n%  \n$\n (2)\n​\n$\n 68\n​\nAerospace, defense, and marine\n​\n \n 29\n​\n 8.4\n​\n​\n 21\n​\n 6.2\n​\n​\n 8\n​\n​\n —\n​\n \n 105\n​\n 10.7\n​\n​\n 103\n​\n 10.5\n​\n​\n 2\n​\n​\n —\n​\nDigital data networks\n​\n​\n 277\n​\n 84.2\n​\n​\n 269\n​\n 81.9\n​\n​\n 8\n​\n​\n —\n​\n​\n 620\n​\n 70.4\n​\n​\n 616\n​\n 69.9\n​\n​\n 4\n​\n​\n —\n​\nEnergy\n​\n​\n 158\n \n 69.9\n​\n \n 45\n \n 20.2\n​\n \n 3\n​\n \n 110\n​\n​\n 214\n \n 32.2\n​\n \n 77\n​\n 11.6\n​\n \n (7)\n​\n​\n 144\n​\nMedical\n​\n \n (28)\n \n (13.4)\n​\n \n (29)\n \n (13.5)\n​\n \n 1\n​\n \n —\n​\n \n (106)\n \n (17.1)\n​\n \n (107)\n​\n (17.2)\n​\n \n 1\n​\n​\n —\n​\nTotal\n​\n$\n 488\n \n 30.0\n%  \n$\n 332\n \n 20.5\n%  \n$\n 30\n​\n$\n 126\n​\n$\n 912\n​\n 19.7\n%  \n$\n 702\n \n 15.2\n%  \n$\n (2)\n​\n$\n 212\n​\nIn the Industrial Solutions segment, net sales increased $488 million, or 30.0%, in the third quarter of fiscal 2025 as compared to the third quarter of fiscal 2024 due primarily to organic net sales growth of 20.5% and the positive impact of 7.7% from acquisitions. Richards Manufacturing, which was acquired on April 1, 2025, contributed net sales of $73 million in the third quarter of fiscal 2025. Our organic net sales by industry end market were as follows:\n●\nAutomation and connected living—\nOur organic net sales increased 5.0% in the third quarter of fiscal 2025 due to growth in the appliances market and factory automation applications.\n●\nAerospace, defense, and marine—\nOur organic net sales increased 6.2% in the third quarter of fiscal 2025 primarily as a result of growth in the commercial aerospace and the defense markets.\n●\nDigital data networks\n—Our organic net sales increased 81.9% in the third quarter of fiscal 2025 due primarily to growth in artificial intelligence applications.\n●\nEnergy—\nOur organic net sales increased 20.2% in the third quarter of fiscal 2025 as a result of growth in the Americas region with strength in renewable energy and grid hardening applications and, to a lesser degree, growth in the EMEA and Asia–Pacific regions.\n34\n\n\nTable of Contents\n●\nMedical—\nOur organic net sales decreased 13.5% in the third quarter of fiscal 2025 due primarily to reduced demand resulting from inventory corrections in the supply chain.\nNet sales in the Industrial Solutions segment increased $912 million, or 19.7%, in the first nine months of fiscal 2025 as compared to the first nine months of fiscal 2024 due primarily to organic net sales growth of 15.2% and the positive impact of 4.6% from acquisitions. Richards Manufacturing contributed net sales of $73 million in the first nine months of fiscal 2025. Our organic net sales by industry end market were as follows:\n●\nAutomation and connected living—\nOur organic net sales increased 0.9% in the first nine months of fiscal 2025 as a result of strength in the appliances market, partially offset by weakness in factory automation applications.\n●\nAerospace, defense, and marine—\nOur organic net sales increased 10.5% in the first nine months of fiscal 2025 primarily as a result of growth in the commercial aerospace and the defense markets.\n●\nDigital data networks\n—Our organic net sales increased 69.9% in the first nine months of fiscal 2025 due primarily to growth in artificial intelligence and cloud applications.\n●\nEnergy—\nOur organic net sales increased 11.6% in the first nine months of fiscal 2025 due to growth in the Americas region driven by renewable energy and grid hardening applications and, to a lesser degree, growth in the EMEA and Asia–Pacific regions.\n●\nMedical—\nOur organic net sales decreased 17.2% in the first nine months of fiscal 2025 primarily as a result of reduced demand resulting from inventory corrections in the supply chain.\nOperating Income.  \nThe following table presents the Industrial Solutions segment’s operating income and operating margin information:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the\n​\n​\n​\n​\nFor the \n​\n​\n​\n​\n​\n​\nQuarters Ended\n​\n​\n​\n​\nNine Months Ended\n​\n​\n​\n​\n​\n​\nJune 27,\n​\nJune 28,\n​\n​\n​\n​\nJune 27,\n​\nJune 28,\n​\n​\n​\n​\n​\n    \n2025\n    \n2024\n    \nChange\n     \n2025\n    \n2024\n    \nChange\n    \n​\n​\n($ in millions)\n​\nOperating income\n​\n$\n 395\n​\n$\n 249\n​\n$\n 146\n​\n$\n 942\n​\n$\n 675\n​\n$\n 267\n​\nOperating margin\n​\n \n 18.7\n%\n \n 15.3\n%\n \n  \n​\n \n 17.0\n%\n \n 14.6\n%\n \n  \n​\nOperating income in the Industrial Solutions segment increased $146 million and $267 million in the third quarter and first nine months of fiscal 2025, respectively, as compared to the same periods of fiscal 2024. Excluding the items below, operating income increased in the third quarter and first nine months of fiscal 2025 primarily as a result of higher volume.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\nFor the \n​\n​\n​\nQuarters Ended\n​\nNine Months Ended\n​\n​\n​\nJune 27,\n​\nJune 28,\n​\nJune 27,\n​\nJune 28,\n​\n​\n    \n2025\n    \n2024\n    \n2025\n    \n2024\n    \n​\n​\n(in millions)\n​\nAcquisition-related charges:\n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \nAcquisition and integration costs\n​\n$\n 27\n​\n$\n 5\n​\n$\n 41\n​\n$\n 16\n​\nCharges associated with the amortization of acquisition-related fair value adjustments\n​\n \n 3\n​\n \n —\n​\n \n 6\n​\n \n —\n​\n​\n​\n \n 30\n​\n \n 5\n​\n \n 47\n​\n \n 16\n​\nRestructuring and other charges, net\n​\n \n 7\n​\n \n 14\n​\n \n 37\n​\n \n 42\n​\nTaxes (non-income tax) recorded in selling, general, and administrative expenses\n​\n​\n —\n​\n​\n —\n​\n​\n —\n​\n​\n 1\n​\nTotal\n​\n$\n 37\n​\n$\n 19\n​\n$\n 84\n​\n$\n 59\n​\n​\n​\n35\n\n\nTable of Contents\nLiquidity and Capital Resources\nOur ability to fund our future capital needs will be affected by our ongoing ability to generate cash from operations and may be affected by our access to capital markets, money markets, or other sources of funding, as well as the capacity and terms of our financing arrangements. We believe that cash generated from operations and, to the extent necessary, these other sources of potential funding will be sufficient to meet our anticipated capital needs for the foreseeable future, including the repayment of $500 million of 4.50% senior notes and $350 million of 3.70% senior notes, both due in February 2026. Also, we may use funds to acquire strategic businesses or product lines, reduce our outstanding debt, or return cash to shareholders through dividends on our ordinary shares or purchases of our ordinary shares pursuant to our authorized share repurchase program. The cost or availability of future funding may be impacted by financial market conditions. We will continue to monitor financial markets and respond as necessary to changing conditions. We believe that we have sufficient financial resources and liquidity which will enable us to meet our ongoing working capital and other cash flow needs.\nCash Flows from Operating Activities\nIn the first nine months of fiscal 2025, net cash provided by operating activities increased $283 million to $2,718 million from $2,435 million in the first nine months of fiscal 2024. The increase resulted primarily from a reduction in net income tax payments and higher pre-tax income, partially offset by the impact of changes in working capital levels. The amount of income taxes paid, net of refunds, during the first nine months of fiscal 2025 and 2024 was $184 million and $384 million, respectively.\nCash Flows from Investing Activities\nCapital expenditures were $665 million and $467 million in the first nine months of fiscal 2025 and 2024, respectively. We expect fiscal 2025 capital spending levels to be approximately 5% of net sales. We believe our capital funding levels are adequate to support new programs, and we continue to invest in our manufacturing infrastructure to further enhance productivity and manufacturing capabilities.\nDuring the first nine months of fiscal 2025, we acquired Richards Manufacturing for $2.3 billion, net of cash acquired. Also during the first nine months of fiscal 2025, we acquired two additional businesses for a combined cash purchase price of $321 million, net of cash acquired. We acquired one business for a cash purchase price of $339 million, net of cash acquired, during the first nine months of fiscal 2024. See Note 3 to the Condensed Consolidated Financial Statements for additional information regarding acquisitions.\nDuring the first nine months of fiscal 2024, we received net cash proceeds of $59 million related to the sale of one business. See Note 2 to the Condensed Consolidated Financial Statements for additional information.\nCash Flows from Financing Activities and Capitalization\nTotal debt at June 27, 2025 and September 27, 2024 was $5,697 million and $4,203 million, respectively. See Note 7 to the Condensed Consolidated Financial Statements for additional information regarding debt.\nDuring the third quarter of fiscal 2025, Tyco Electronics Group S.A. (“TEGSA”), our wholly-owned subsidiary, issued €500 million aggregate principal amount of 2.50% senior notes due in May 2028, $450 million aggregate principal amount of 4.50% senior notes due in February 2031, and $450 million aggregate principal amount of 5.00% senior notes due in May 2035. In connection with the issuance of these senior notes, we voluntarily elected to terminate the $1.5 billion 364-day credit agreement, dated as of March 14, 2025. The net proceeds from these senior notes were used for general corporate purposes, including the repayment of indebtedness incurred in connection with the acquisition of Richards Manufacturing. See Note 3 to the Condensed Consolidated Financial Statements for additional information regarding this acquisition.\nDuring the first nine months of fiscal 2025, TEGSA issued €750 million aggregate principal amount of 3.25% senior notes due in January 2033. \n36\n\n\nTable of Contents\nThe notes issued during the third quarter and first nine months of fiscal 2025 are TEGSA’s unsecured senior obligations and rank equally in right of payment with all existing and any future senior indebtedness of TEGSA and senior to any subordinated indebtedness that TEGSA may incur.\nDuring the first nine months of fiscal 2025, TEGSA repaid, at maturity, €550 million of 0.00% senior notes due in February 2025.\nAt September 27, 2024, TEGSA had $255 million of commercial paper outstanding at a weighted-average interest rate of 4.95%. TEGSA had no commercial paper outstanding at June 27, 2025.\nTEGSA has a five-year unsecured senior revolving credit facility (“Credit Facility”) with a maturity date of April 2029 and aggregate commitments of $1.5 billion. TEGSA had no borrowings under the Credit Facility at June 27, 2025 or September 27, 2024.\nThe Credit Facility contains a financial ratio covenant providing that if, as of the last day of each fiscal quarter, our ratio of Consolidated Total Debt to Consolidated EBITDA (as defined in the Credit Facility) for the then most recently concluded period of four consecutive fiscal quarters exceeds 3.75 to 1.0, an Event of Default (as defined in the Credit Facility) is triggered. The Credit Facility and our other debt agreements contain other customary covenants. None of our covenants are presently considered restrictive to our operations. As of June 27, 2025, we were in compliance with all of our debt covenants and believe that we will continue to be in compliance with our existing covenants for the foreseeable future.\nIn addition to the Credit Facility, TEGSA is the borrower under our senior notes and commercial paper. Payment obligations under TEGSA’s senior notes, commercial paper, and Credit Facility are fully and unconditionally guaranteed on an unsecured basis by TEGSA’s parent, TE Connectivity Switzerland Ltd., and its parent, TE Connectivity plc.\nPayments of ordinary/common share dividends to shareholders were $594 million and $564 million in the first nine months of fiscal 2025 and 2024, respectively.\nIn June 2025, our board of directors declared a regular quarterly dividend of $0.71 per ordinary share, payable on September 12, 2025, to shareholders of record on August 22, 2025.\nDuring the first nine months of fiscal 2025, our board of directors authorized an increase of $2.5 billion in our share repurchase program. We repurchased approximately six million of our ordinary shares for $916 million and approximately nine million of our common shares for $1,235 million under the share repurchase program during the first nine months of fiscal 2025 and 2024, respectively. At June 27, 2025, we had $1.8 billion of availability remaining under our share repurchase authorization.\n​\n37\n\n\nTable of Contents\nSummarized Guarantor Financial Information\nAs discussed above, our senior notes, commercial paper, and Credit Facility are issued by TEGSA and are fully and unconditionally guaranteed on an unsecured basis by TEGSA’s parent, TE Connectivity Switzerland Ltd., and its parent, TE Connectivity plc. In addition to being the issuer of our debt securities, TEGSA owns, directly or indirectly, all of our operating subsidiaries. The following tables present summarized financial information, excluding investments in and equity in earnings of our non-guarantor subsidiaries, for TE Connectivity plc, TE Connectivity Switzerland Ltd., and TEGSA on a combined basis.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nJune 27,\n​\nSeptember 27,\n​\n​\n    \n2025\n    \n2024\n    \n​\n​\n(in millions)\n​\nBalance Sheet Data:\n​\n​\n​\n​\n​\n​\n​\nTotal current assets\n​\n$\n 628\n​\n$\n 1,164\n​\nTotal noncurrent assets\n(1)\n​\n \n 2,978\n​\n \n 2,377\n​\n​\n​\n​\n​\n​\n​\n​\n​\nTotal current liabilities\n​\n \n 1,320\n​\n \n 1,362\n​\nTotal noncurrent liabilities\n(2)\n​\n​\n 11,020\n​\n​\n 10,738\n​\n(1)\nIncludes $2,969 million and $2,368 million as of June 27, 2025 and September 27, 2024, respectively, of intercompany loans receivable from non-guarantor subsidiaries.\n(2)\nIncludes $5,925 million and $7,309 million as of June 27, 2025 and September 27, 2024, respectively, of intercompany loans payable to non-guarantor subsidiaries.\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFor the \n​\nFor the \n​\n​\n​\nNine Months Ended\n​\nFiscal Year Ended\n​\n​\n​\nJune 27,\n​\nSeptember 27,\n​\n​\n    \n2025\n    \n2024\n    \n​\n​\n(in millions)\n​\nStatement of Operations Data:\n​\n​\n​\n​\n​\n​\n​\nLoss from continuing operations\n​\n$\n (238)\n​\n$\n (271)\n​\nNet loss\n​\n \n (238)\n​\n \n (271)\n​\nGuarantees\nIn certain instances, we have guaranteed the performance of third parties and provided financial guarantees for uncompleted work and financial commitments. The terms of these guarantees vary with end dates ranging from fiscal 2025 through the completion of such transactions. The guarantees would be triggered in the event of nonperformance, and the potential exposure for nonperformance under the guarantees would not have a material effect on our results of operations, financial position, or cash flows.\nIn disposing of assets or businesses, we often provide representations, warranties, and/or indemnities to cover various risks including unknown damage to assets, environmental risks involved in the sale of real estate, liability for investigation and remediation of environmental contamination at waste disposal sites and manufacturing facilities, and unidentified tax liabilities and legal fees related to periods prior to disposition. We do not expect that these uncertainties will have a material adverse effect on our results of operations, financial position, or cash flows.\nAt June 27, 2025, we had outstanding letters of credit, letters of guarantee, and surety bonds of $217 million.\n​\n38\n\n\nTable of Contents\nCommitments and Contingencies\nLegal Proceedings\nIn the normal course of business, we are subject to various legal proceedings and claims, including patent infringement claims, product liability matters, employment disputes, disputes on agreements, other commercial disputes, environmental matters, antitrust claims, and tax matters, including non-income tax matters such as value added tax, sales and use tax, real estate tax, and transfer tax. Although it is not feasible to predict the outcome of these proceedings, based upon our experience, current information, and applicable law, we do not expect that the outcome of these proceedings, either individually or in the aggregate, will have a material effect on our results of operations, financial position, or cash flows. \nCritical Accounting Policies and Estimates\nThe preparation of the Condensed Consolidated Financial Statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities, and the reported amounts of revenue and expenses.\nOur accounting policies for revenue recognition, goodwill and other intangible assets, income taxes, and pension plans are based on, among other things, judgments and assumptions made by management. For additional information regarding these policies and the underlying accounting assumptions and estimates used in these policies, refer to “Part II. Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations—Critical Accounting Policies and Estimates” and the Consolidated Financial Statements and accompanying notes contained in our Annual Report on Form 10-K for the fiscal year ended September 27, 2024. There were no significant changes to this information during the first nine months of fiscal 2025. \nAccounting Pronouncement\nSee Note 1 to the Condensed Consolidated Financial Statements for additional information regarding a recently issued accounting pronouncement.\nNon-GAAP Financial Measure\nOrganic Net Sales Growth (Decline)\nWe present organic net sales growth (decline) as we believe it is appropriate for investors to consider this adjusted financial measure in addition to results in accordance with GAAP. Organic net sales growth (decline) represents net sales growth (decline) (the most comparable GAAP financial measure) excluding the impact of foreign currency exchange rates, and acquisitions and divestitures that occurred in the preceding twelve months, if any. Organic net sales growth (decline) is a useful measure of our performance because it excludes items that are not completely under management’s control, such as the impact of changes in foreign currency exchange rates, and items that do not reflect the underlying growth of the company, such as acquisition and divestiture activity.\nOrganic net sales growth (decline) provides useful information about our results and the trends of our business. Management uses this measure to monitor and evaluate performance. Also, management uses this measure together with GAAP financial measures in its decision-making processes related to the operations of our reportable segments and our overall company. It is also a significant component in our incentive compensation plans. We believe that investors benefit from having access to the same financial measures that management uses in evaluating operations. The tables presented in “Results of Operations” and “Segment Results” provide reconciliations of organic net sales growth (decline) to net sales growth (decline) calculated in accordance with GAAP.\nOrganic net sales growth (decline) is a non-GAAP financial measure and should not be considered a replacement for results in accordance with GAAP. This non-GAAP financial measure may not be comparable to similarly-titled measures reported by other companies. The primary limitation of this measure is that it excludes the financial impact of items that would otherwise either increase or decrease our reported results. This limitation is best addressed by using organic net sales growth (decline) in combination with net sales growth (decline) to better understand the amounts, character, and impact of any increase or decrease in reported amounts.\n39\n\n\nTable of Contents\nForward-Looking Information\nCertain statements in this Quarterly Report on Form 10-Q are “forward-looking statements” within the meaning of the U.S. Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Exchange Act. These statements are based on our management’s beliefs and assumptions and on information currently available to our management. Forward-looking statements include, among others, the information concerning our possible or assumed future results of operations, business strategies, financing plans, competitive position, potential growth opportunities, potential operating performance improvements, acquisitions, divestitures, the effects of competition, and the effects of future legislation or regulations. Forward-looking statements include all statements that are not historical facts and can be identified by the use of forward-looking terminology such as the words “believe,” “expect,” “plan,” “intend,” “anticipate,” “estimate,” “predict,” “potential,” “continue,” “may,” and “should,” or the negative of these terms or similar expressions.\nForward-looking statements involve risks, uncertainties, and assumptions. Actual results may differ materially from those expressed in these forward-looking statements. Investors should not place undue reliance on any forward-looking statements. We do not have any intention or obligation to update forward-looking statements after we file this report except as required by law.\nThe following and other risks, which are described in greater detail in “Part I. Item 1A. Risk Factors,” in our Annual Report on Form 10-K for the fiscal year ended September 27, 2024, and in this report, could cause our results to differ materially from those expressed in forward-looking statements:\n●\nconditions in the global or regional economies and global capital markets, and cyclical industry conditions, including recession, inflation, tariffs, and higher interest rates;\n●\nconditions affecting demand for products in the industries we serve, particularly the automotive industry;\n●\nrisk of future goodwill impairment;\n●\npricing pressure and competition, including competitive risks associated with the pace of technological change;\n●\nmarket acceptance of our new product introductions and product innovations and product life cycles;\n●\nraw material availability, quality, and cost;\n●\nproduct liability, warranty, and product recall claims and our ability to defend such claims;\n●\nfluctuations in foreign currency exchange rates and impacts of offsetting hedges;\n●\nfinancial condition and consolidation of customers and vendors;\n●\nreliance on third-party suppliers;\n●\nrisks associated with current and future acquisitions and divestitures;\n●\nglobal risks of business interruptions due to natural disasters or other disasters which have impacted and could continue to negatively impact our results of operations as well as customer behaviors, business, and manufacturing operations as well as our facilities and the facilities of our suppliers, and other aspects of our business;\n●\nglobal risks of political, economic, and military instability, including the continuing military conflicts in certain parts of the world, and volatile and uncertain economic conditions and the evolving regulatory system in China;\n40\n\n\nTable of Contents\n●\nrisks associated with cybersecurity incidents and other disruptions to our information technology infrastructure, including as a result of artificial intelligence;\n●\nrisks related to compliance with current and future environmental and other laws and regulations, including those related to climate change;\n●\nrisks related to the increasing scrutiny and expectations regarding environmental, social, and governance matters;\n●\nrisks associated with compliance with applicable antitrust or competition laws or applicable trade regulations;\n●\nour ability to protect our intellectual property rights;\n●\nrisks of litigation, regulatory actions, and compliance issues;\n●\nour ability to operate within the limitations imposed by our debt instruments;\n●\nthe possible effects on us of various non-U.S. and U.S. legislative proposals and other initiatives that could materially increase our worldwide corporate effective tax rate, increase global cash taxes, and negatively impact our U.S. government contracts business;\n●\nrequirements related to chemical usage, hazardous material content, recycling, and other circular economy initiatives;\n●\nvarious risks associated with being an Irish corporation;\n●\nthe impact of fluctuations in the market price of our shares; and\n●\nthe impact of certain provisions of our articles of association on unsolicited takeover proposals.\nThere may be other risks and uncertainties that we are unable to predict at this time or that we currently do not expect to have a material adverse effect on our business."
}