{
  "source_file": "tfc-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nTruist Financial Corporation is a purpose-driven financial services company committed to inspiring and building better lives and communities. Headquartered in Charlotte, North Carolina, Truist has leading market share in many of the high-growth markets in the U.S. and offers a wide range of products and services through wholesale and consumer businesses, including consumer and small business banking, commercial and corporate banking, investment banking and capital markets, wealth management, payments, and specialized lending businesses.\nTruist Bank, the largest subsidiary of Truist Financial Corporation, was chartered in 1872 and is the oldest bank headquartered in North Carolina. Truist Bank is one of the 10 largest commercial banks in the U.S. and provides banking and trust services for clients through 1,928 offices as of December 31, 2024 and its digital platform.\nProduct and Services\nTruist offers commercial and consumer clients an array of products and services to respond to their financial needs. Examples of these products and services include:\nTable 1: Products and Services\n \nConsumer Services:\n \nWholesale Services:\nAsset management\nAsset based lending\nAutomobile lending\nAsset management\nCredit card lending\nCommercial deposit and treasury services\nConsumer finance\nCommercial lending\nHome equity and other direct retail lending\nFloor plan lending\nHome mortgage lending\nDerivatives\nInvestment brokerage services\nInstitutional trust services\nMobile/online banking\nInsurance premium finance\nPayment solutions\nInternational banking\nPoint-of-sale lending\nInvestment banking and capital markets services\nRetail and small business deposit products\nLeasing\nSmall business lending\nMerchant services\nMortgage warehouse lending\nPayment solutions\nReal estate lending\nSupply chain financing\nWealth management/private banking\nMarket Area\nThe following table details Truist Bank’s deposit market share and branch locations by state:\nTable 2: Deposit Market Share and Branch Locations by State\n \n% of Truist’s Deposits\n(2)\nDeposit Market Share Rank\n(2)\nNumber of Branches\n(3)\nFlorida\n23 \n%\n4th\n441\nGeorgia\n19 \n1st\n202\nVirginia\n15 \n1st\n260\nNorth Carolina\n(1)\n13 \n2nd\n276\nMaryland\n7 \n3rd\n138\nTennessee\n5 \n5th\n98\nPennsylvania\n4 \n12th\n136\nSouth Carolina\n4 \n3rd\n95\nTexas\n3 \n20th\n96\nWest Virginia\n2 \n2nd\n42\nKentucky\n2 \n4th\n53\nWashington, D.C.\n1 \n5th\n18\nAlabama\n1 \n6th\n49\nNew Jersey\n1 \n25th\n20\nOther states\nNA\nNA\n4\n(1)\nDeposit market share rank excludes home office deposits.\n(2)\nSource: FDIC.gov data as of June 30, 2024.\n(3)\nAs of December 31, 2024.\n4   Truist Financial Corporation\nCompetition\nThe financial services industry is intensely competitive and constantly evolving. Management believes that Truist’s purpose, mission, and values, including a caring client-first approach, are a competitive advantage that strengthens the Company’s ability to provide financial products and services to businesses and individuals in its markets. The Company has recently made significant investments to develop its digital platform, including enhancements to its mobile and online applications to meet its clients’ digital expectations. Legislative, regulatory, economic, and technological changes, as well as continued consolidation within the industry, have resulted in increased competition from new and existing market participants, which is expected to continue in the future. Truist competes actively with national, regional, and local financial services providers, including banks, thrifts, credit unions, investment advisers, asset managers, securities brokers and dealers, private-equity funds, hedge funds, mortgage-banking companies, finance companies, and financial technology companies. At the same time, non-banking entities, including financial technology companies, have increased competition by providing financial products and services directly to customers and indirectly through partnerships.\nMany of our competitors have substantial positions nationally or in the markets in which we operate. Some also have greater scale, financial and operational resources, investment capacity, product and service offerings, and brand recognition. Our competitors may be subject to different and, in some cases, less stringent legislative, regulatory, and supervisory regimes than Truist. Certain competitors differ from us in their strategic and tactical priorities and, for example, may be willing to suffer meaningful financial losses in the pursuit of disruptive innovation and client growth or to accept more aggressive business, compliance, and other risks in the pursuit of higher returns and market valuations. Competition affects every aspect of our business, including product and service offerings, rates, pricing and fees, credit limits, and client service. Successfully competing in our markets also depends on our ability to innovate, to invest in technology and infrastructure, to execute transactions reliably and efficiently, to maintain and enhance our reputation, and to attract, retain, and motivate talented teammates, all while effectively managing risks and expenses. We expect that competition will only intensify in the future.\nPurpose, Mission, and Values\nOur purpose is to inspire and build better lives and communities.\nOur mission is to:\n•\nProvide clients with distinctive, secure, and successful experiences through touch and technology;\n•\nCreate an inclusive and energizing environment that empowers teammates to learn, grow, and have meaningful careers; and\n•\nOptimize long-term value for stakeholders through safe, sound, and ethical practices.\nOur values are: \n•\nTrustworthy – we serve with integrity\n•\nCaring – everyone and every moment matters\n•\nOne Team – together we can accomplish anything\n•\nSuccess – when our clients win, we all win\n•\nHappiness – positive energy changes lives\nStrategy\nOur strategic direction is to build the top super regional bank that grows with our clients with care. Our 2025 strategic objectives are to:\n•\nLeverage our capital position by growing and capturing additional share within our high growth markets and existing client base in key focus areas in WB and CSBB and in areas, markets, and client solutions where we have invested significantly and have momentum.\n•\nIn WB, deepen and grow existing client relationships in areas like Payments and Wealth, enhance the client digital experience, continue our momentum in Investment Banking and Trading, and capture more share of the commercial middle market.\n•\nIn CSBB, grow core deposits, deepen existing relationships with Premier clients, enhance the client digital experience, and drive additional fee and loan growth through our differentiated consumer lending solutions.\n•\nContinue to invest in important areas like new and existing talent, technology, risk, and cybersecurity, while maintaining our expense discipline with a goal of driving positive operating leverage.\n•\nMaintain our credit and risk discipline.\n•\nReturn capital to shareholders through our common stock dividend and share repurchase authorization.\nTruist Financial Corporation   5\nAlthough mergers and acquisitions are not a top capital deployment priority for Truist, the Company will assess opportunities when strategic and business objectives, profitability, cultural fit, market and regulatory conditions, capital and liquidity, and risk-management considerations favorably align.\nChallenges and unforeseen events could have an adverse impact on Truist’s financial condition, results of operations, and strategy. See the sections titled “Forward-Looking Statements” and “Risk Factors” for examples of such challenges and events.\nRegulatory and Supervisory Considerations\nWe are subject to significant regulatory frameworks that affect the products and services that we may offer and the manner in which we may offer them, the risks that we may take, the ways in which we may operate, and the corporate and financial actions that we may take.\nVarious governmental agencies and self-regulatory organizations oversee our business activities and therefore supervise and periodically examine us. These agencies and organizations generally have broad authority and discretion in restricting and otherwise affecting our businesses and operations and may take formal or informal supervisory, enforcement, and other actions against us when, in the applicable agency’s or organization’s judgment, our businesses or operations fail to comply with applicable law, comport with safe and sound practices, or meet supervisory expectations.\nThe regulatory and supervisory framework applicable to banking organizations is intended primarily for the protection of depositors and other customers, the DIF, the broader economy, and the stability of the U.S. financial system, rather than for the protection of shareholders and non-deposit creditors. In addition to banking statutes, regulations, and other laws, Truist is subject to various other laws that directly or indirectly affect its business and operations, including its ability to make distributions to shareholders. Governmental agencies and self-regulatory organizations also issue policy statements, interpretive letters, guidance, and other documents and communications that similarly impact Truist. The scope, complexity, intensity, and interpretation of these laws, documents, communications, and actions can vary based on such factors as the state of the economy, the prevailing political environment, and the performance of businesses and operations by us and other financial institutions.\nThe scope of the laws, documents, communications, and actions, including the intensity of the supervision to which the banking industry is subject, have increased in recent years. Regulatory enforcement and fines have also increased across the banking and financial services sector. Truist expects to remain subject to extensive regulation and supervision.\nThis section summarizes some relevant provisions of the principal statutes, regulations, and other laws that apply to us. These descriptions, however, are qualified in their entirety by the full text and judicial or administrative interpretations of those laws. This summary also does not cover all possible or proposed changes in laws applicable to us.\nGeneral\nAs a BHC, Truist is subject to the BHCA and to regulation, supervision, and examination by the FRB. Truist Bank, a North Carolina state-chartered commercial bank that is not a member of the Federal Reserve System, is subject to regulation, supervision, and examination by the NCCOB and the FDIC. Truist Bank and its affiliates are also subject to examination by the CFPB for compliance with most federal consumer financial protection laws.\nTruist and certain of its subsidiaries and affiliates, including those that engage in derivatives transactions, securities underwriting, market making, brokerage, and investment advisory activities, are subject to other federal and state laws and regulations, as well as supervision and examination by other federal and state regulatory agencies and other regulatory authorities, including the SEC, CFTC, FINRA, and NFA. Truist Bank is subject to additional state and federal laws, as well as various regulations, which govern its activities, the investments it may make, and the aggregate amount of loans that may be granted to one borrower.\nExaminations by regulators consider not only compliance with applicable laws, regulations, and supervisory policies of the agency, but also capital levels, asset quality, risk management effectiveness, the ability and performance of management and the Board, the effectiveness of internal controls, earnings, liquidity, and various other factors. Following examinations by banking supervisors, Truist and Truist Bank may receive supervisory findings and ultimately are assigned supervisory ratings. Examination reports, supervisory ratings, and other actions under this supervisory framework, which are considered confidential supervisory information, can impact the conduct, growth, and profitability of Truist’s operations, possibly to a significant degree. Refer to Item 1A, “Risk Factors” for more information on legal, regulatory, and compliance risks.\n6   Truist Financial Corporation\nUnder the FRB’s Large Financial Institution Rating System, component ratings are assigned for capital planning and positions, liquidity risk management, and governance and controls. To be considered “well managed” under this rating system, a firm must be rated “broadly meets expectations” or “conditionally meets expectations” for each of its three component ratings.\nDepending on the results of examinations of Truist, federal or state bank regulators can impose significant limitations on our activities and growth. These regulatory agencies generally have broad enforcement authority and discretion to impose restrictions and limitations on the operations of a regulated entity. Examples of restrictions and limitations include the imposition of substantial monetary penalties and nonmonetary requirements where the relevant agency determines that the operations of the regulated entity or any of its subsidiaries fail to comply with applicable laws or regulations, are conducted in an unsafe or unsound manner, engage in an unfair, deceptive, abusive act or practice, or do not meet supervisory expectations. The intensity of supervision has increased in recent years.\nFHC Regulation\nTruist has elected to be treated as a FHC, which allows it to engage in a broader range of activities than would otherwise be permissible for a BHC, including activities that are financial in nature or incidental thereto, such as securities underwriting or merchant banking. Although FHCs may engage in certain acquisitions of nonbank companies without prior approval of the FRB, any acquisition of a nonbank company or voting shares of a nonbank company with total consolidated assets of $10 billion or more would require prior approval of the FRB. To maintain its standing as a FHC, Truist and its affiliated IDI must be well-capitalized and well managed and Truist Bank must have at least a satisfactory CRA rating. If the FRB determines that a FHC is not well-capitalized or well managed, the FRB may impose corrective capital and managerial requirements on the FHC. In such a situation, the FRB may also place limitations on the ability of an FHC to conduct certain business activities that FHCs are generally permitted to conduct, as well as the FHC’s ability to make certain acquisitions. If the failure to meet these standards persists, a FHC may be required to divest its IDI subsidiaries or cease all activities other than those activities that may be conducted by BHCs that are not FHCs. Furthermore, if an IDI subsidiary of a FHC has not maintained a satisfactory CRA rating, the FHC would not be able to commence any new financial activities or acquire a company that engages in such activities, although the FHC would still be allowed to engage in activities closely related to banking and make investments in the ordinary course of conducting banking activities. Federal regulations require a FHC to act as a source of financial and managerial strength for its subsidiary banks. In times of severe financial stress, the obligation to serve as a source of strength could cause Truist to commit significant resources to supporting Truist Bank that otherwise would be available to Truist’s creditors and shareholders.\nResolution Planning\nAs a Category III banking organization, Truist is required to submit to the FRB and FDIC a resolution plan every three years with submissions alternating between a full resolution plan and a targeted resolution plan (a “165(d) Resolution Plan”). Upon review of the plan, the agencies may jointly determine that a resolution plan is not credible or would not facilitate an orderly resolution under the U.S. Bankruptcy Code. Upon making this determination, the agencies would provide a joint notice identifying one or more deficiencies that could undermine the feasibility of the resolution plan. If Truist receives such a notice and fails to submit a timely revised resolution plan or a revised resolution plan that fails to adequately address the deficiencies, the agencies could subject Truist to more stringent capital, leverage, or liquidity requirements, or restrictions on growth, activities, or operations. Truist submitted its inaugural resolution plan to the FRB and FDIC in September 2021. On September 30, 2022, the FRB and FDIC announced that they did not identify any shortcomings or deficiencies in Truist’s resolution plan. Truist’s next full 165(d) Resolution Plan is due October 1, 2025.\nIn addition, Truist Bank, as an IDI, is required by FDIC regulation to file a separate bank level resolution plan every three years (an “IDI Resolution Plan”). Truist Bank submitted its inaugural IDI Resolution Plan to the FDIC in November 2022. In 2024, the FDIC adopted a final rule that significantly modified the required frequency and informational content of IDI Resolution Plans. As a result of the rule, Truist Bank must submit a full IDI Resolution Plan to the FDIC every three years and an interim supplement in the years in which a full IDI Resolution Plan is not due. Further, the final rule introduces a new credibility standard for evaluating the adequacy of IDI Resolution Plan submissions, including increased engagement and capabilities testing. The application of this new credibility standard may require the exercise of a meaningful degree of judgment by the FDIC. A failure by Truist Bank to satisfy the credibility standard, or any other provision of the rule, may cause the FDIC to require Truist Bank to reconsider portions of its IDI Resolution Plan or result in an enforcement action by the FDIC. Truist Bank’s first interim supplement is due July 1, 2025, and its full IDI Resolution Plan submission is due July 1, 2026.\nEnhanced Prudential Standards and Regulatory Tailoring Rules\nU.S. BHCs, including Truist, are subject to a range of prudential standards based on their size and complexity. Truist is subject to more stringent liquidity and capital requirements, leverage limits, stress testing, single-counterparty credit limits, resolution planning, and enhanced risk management standards than those applicable to smaller institutions, while certain larger banking organizations are subject to even more enhanced prudential standards than Truist.\nTruist Financial Corporation   7\nUnder the Tailoring Rules, Truist is subject to the standards applicable to Category III banking organizations, which generally include BHCs with greater than $250 billion, but less than $700 billion, in total consolidated assets and less than $75 billion in certain risk-related exposures.\nCapital Requirements\nTruist and Truist Bank are subject to certain risk-based and leverage capital ratio requirements. These are established by the FRB, for Truist, and by the FDIC, for Truist Bank. These requirements are based on the capital framework developed by the BCBS for strengthening the regulation, supervision, and risk management of banks under Basel III rules, as well as certain provisions of the Dodd-Frank Act. These quantitative calculations prescribe minimum capital levels, and the FRB and FDIC may determine that a banking organization, based on its size, complexity, or risk profile, must maintain a higher level of capital to operate in a safe and sound manner. Failure to be well-capitalized or to meet minimum capital requirements could result in certain mandatory and discretionary actions by regulators that, if undertaken, could have an adverse material effect on our operations or financial condition. These actions could include requiring Truist to commit capital to Truist Bank in abnormal operating conditions which would otherwise be available to Truist’s creditors and shareholders. Failure to be well-capitalized or to meet minimum capital requirements could also result in restrictions on Truist’s or Truist Bank’s ability to pay dividends or otherwise distribute capital or to receive regulatory approval for acquisitions.\nUnder the regulatory capital rules, Truist’s and Truist Bank’s assets, exposures, and certain off-balance sheet items are subject to risk weights under the standardized approach used to determine the institutions’ risk-weighted assets. These risk-weighted assets are used to calculate the following minimum capital ratios for Truist and Truist Bank:\n•\nCET1 Risk-Based Capital Ratio, equal to the ratio of CET1 capital to risk-weighted assets. CET1 capital primarily includes common shareholders’ equity subject to certain regulatory adjustments and deductions, including with respect to goodwill, intangible assets, certain deferred tax assets, and AOCI.\n•\nTier 1 Risk-Based Capital Ratio, equal to the ratio of Tier 1 capital to risk-weighted assets. Tier 1 capital is primarily comprised of CET1 capital, perpetual preferred stock, and certain qualifying capital instruments.\n•\nTotal Risk-Based Capital Ratio, equal to the ratio of total capital, including CET1 capital, Tier 1 capital, and Tier 2 capital, to risk-weighted assets. Tier 2 capital primarily includes qualifying subordinated debt and qualifying ALLL. Tier 2 capital also includes, among other things, certain trust preferred securities.\nUnder the FRB’s capital framework for BHCs, Truist is subject to capital requirements, including the SCB, that are determined from the supervisory stress test results. The SCB is equal to the greater of (i) the difference between Truist’s starting and minimum projected CET1 capital ratios under the severely adverse scenario in the supervisory stress test, plus the sum of the dollar amount of its planned common stock dividends for each of the fourth through seventh quarters of the planning horizon as a percentage of risk-weighted assets, or (ii) 2.5%. The FRB assigned Truist an SCB of 2.8%, which is effective from October 1, 2024 to September 30, 2025, at which point a revised SCB will be calculated and provided to Truist. Truist is required to describe its planned capital actions in its CCAR capital plan, but is no longer required to seek prior approval if it makes capital distributions in excess of those included in its CCAR capital plan. Instead, Truist is subject to automatic distribution limitations if its capital ratios fall below its buffer requirements, which include the SCB.\nFor certain large banking organizations, the SCB could be supplemented by a countercyclical capital buffer of up to an additional 2.5% of risk-weighted assets. This buffer is currently set at zero. An FRB policy statement establishes the framework and factors the FRB would use in setting and adjusting the amount of the countercyclical capital buffer. Covered banking organizations would generally have 12 months after the announcement of any increase in the countercyclical capital buffer to meet the increased buffer requirement, unless the FRB determines to establish an earlier effective date. If the full countercyclical buffer amount is implemented, Truist would be required to maintain a CET1 capital ratio of at least 9.8%, a Tier 1 capital ratio of at least 11.3%, and a Total capital ratio of at least 13.3% to avoid limitations on capital distributions and certain discretionary incentive compensation payments. In addition, Truist Bank would be required to maintain a CET1 capital ratio of at least 9.5%, a Tier 1 capital ratio of at least 11.0%, and a Total capital ratio of at least 13.0%.\nCertain large banking organizations with trading assets and liabilities above certain thresholds, including Truist, are subject to the Market Risk Rule and must adjust their risk-based capital ratios to reflect the market risk of their trading activities. Refer to the “Market Risk” section of the MD&A for additional disclosures related to market risk management.\nTruist and Truist Bank are subject to a Tier 1 leverage ratio, equal to the ratio of Tier 1 capital to quarterly average assets, net of goodwill, certain other intangible assets, and certain other deductions. Category III banking organizations are also subject to a minimum 3.0% supplementary leverage ratio. The supplementary leverage ratio is calculated by dividing Tier 1 capital by total leverage exposure, which takes into account on-balance sheet assets as well as certain off-balance sheet items, including loan commitments and potential future exposure of derivative contracts.\n8   Truist Financial Corporation\nThe FRB has not yet revised the well-capitalized standard for BHCs to reflect capital requirements imposed under the Basel III Rules. For purposes of certain FRB rules, including determining whether a BHC meets the requirements to be a FHC, BHCs, such as Truist, must maintain a Tier 1 Risk-Based Capital Ratio of 6.0% or greater and a Total Risk-Based Capital Ratio of 10.0% or greater to meet the well-capitalized minimum. The FRB may require BHCs, including Truist, to maintain capital ratios in excess of mandated minimum levels, depending upon general economic conditions and a BHC’s particular condition, risk profile, and growth plans.\nIn July 2023, the U.S. banking regulators issued a proposal to revise the risk-based capital standards applicable to Truist and Truist Bank. This proposal would introduce new approaches for credit risk, operational risk, market risk, and credit valuation adjustment risk that generally align with the approaches for these risks under the global Basel Accord adopted by the Basel Committee. The proposal would introduce a new measure of risk-weighted assets, which would reflect the proposed new standardized approaches for credit risk, operational risk, and credit valuation adjustment risk, as well as a proposed new measure for market risk that would be based on both internal models and standardized supervisory models of market risk. In addition, the proposal requires Category III and IV financial institutions to include certain components of AOCI in the calculation of regulatory capital, as well as change the calculation of certain deductions consistent with standards in place for Category I and II financial institutions. The FRB has indicated the intent to re-propose the revised risk-based capital standards. The potential impacts on Truist and Truist Bank of a final rule remains uncertain.\nRefer to the “Capital” section in MD&A for disclosures containing the minimum regulatory capital ratios and well-capitalized minimum ratios applicable to Category III banking organizations.\nCapital Planning and Stress Testing Requirements\nIn addition to the regulatory capital requirements, under the FRB’s CCAR process and related capital plan rule, Truist must submit an annual capital plan to the FRB that reflects its projected financial performance under hypothetical macro-economic scenarios, including stress scenarios designed by Truist and a supervisory severely adverse scenario provided by the FRB.\nThe FRB’s CCAR framework and the Dodd-Frank Act stress testing framework also require BHCs subject to Category III standards, such as Truist, to conduct company-run stress tests and submit to supervisory stress tests conducted by the FRB. The company-run stress tests employ stress scenarios provided by the FRB and incorporate the Dodd-Frank Act capital actions, which are intended to normalize capital distribution assumptions across large U.S. BHCs. In addition, Truist is required to conduct annual stress tests using internally-developed scenarios intended to stress the unique risk profile of the institution. The FRB also conducts CCAR and Dodd-Frank Act supervisory stress tests employing internal supervisory models on the supervisory stress scenarios. As a Category III banking organization, Truist is subject to supervisory stress testing on an annual basis and company-run stress testing on a biennial basis.\nTruist is required to submit its next capital plan and the results of its own stress tests to the FRB by April 5, 2025. The FRB is required to announce the results of its supervisory stress tests by June 30, 2025.\nIn addition to the CCAR stress testing for Truist, Truist Bank conducts company-run stress tests on an annual basis, though those tests are only required biennially. Truist and Truist Bank also conduct periodic company-run stress tests that are not related to supervisory stress testing requirements.\nLiquidity Requirements\nCertain BHCs and their bank subsidiaries, including Truist and Truist Bank, are subject to a minimum LCR and NSFR. The LCR rule requires that banking organizations maintain an amount of eligible HQLA that is sufficient within the parameters of the rule to meet estimated total net cash outflows over a prospective 30 calendar-day period of stress. The NSFR rule defines a minimum amount of stable, long-term funding that banking organizations must maintain in relation to their asset composition and off-balance sheet activities. The NSFR, calculated as the ratio of available stable funding to required stable funding, must exceed 1.0x. Available stable funding represents a weighted measure of a company’s funding sources over a one-year time horizon, calculated by applying standardized weightings to the company’s equity and liabilities based on their expected stability. Required Stable Funding is calculated by applying standardized weightings to assets, derivatives exposures, and certain other items based on their liquidity characteristics. As a Category III banking organization, Truist and Truist Bank are subject to LCR and NSFR requirements equal to 85% of the full requirement.\nTruist also is subject to FRB rules that require certain large BHCs to conduct internal liquidity stress tests over a range of time horizons, maintain a buffer of highly liquid assets sufficient to meet projected net outflows under the BHC’s 30-day liquidity stress test, and maintain a contingency funding plan that meets certain requirements.\nTruist Financial Corporation   9\nLong-Term Debt and Clean Holding Company Requirements\nIn 2023, the U.S. banking regulators proposed a rule that would require banking organizations with $100 billion or more in total assets to comply with long-term debt requirements and clean holding company requirements that currently apply only to GSIBs. This proposal would also impose a long-term debt requirement on certain categories of insured depository institutions, including insured depository institutions with $100 billion or more in total assets, such as Truist Bank. If adopted, this proposal would require Truist and Truist Bank to each maintain a minimum outstanding eligible long-term debt amount equal to the largest of (i) 6% of risk-weighted assets, (ii) 2.5% of total leverage exposure, and (iii) 3.5% of average total consolidated assets. Truist Bank would be required to issue the minimum amount of eligible long-term debt to Truist, and Truist would be required to issue the minimum amount of eligible long-term debt externally. In addition, if adopted as proposed, the clean holding company requirement would limit or prohibit Truist from entering into certain transactions that could impede its orderly resolution, including, for example, prohibiting Truist from entering into transactions that could spread losses to subsidiaries and third parties, as well as limiting the amount of Truist’s liabilities that are not eligible long-term debt. The timing and form of any final rule implementing the long-term debt requirements and clean holding company requirements remains uncertain.\nPayment of Dividends\nThe Parent Company is a legal entity separate and distinct from its subsidiaries, and it depends in part upon dividends received from its direct and indirect subsidiaries, including Truist Bank, to fund its activities, including its ability to make capital distributions, such as paying dividends or repurchasing shares. Under federal law, there are various limitations on the extent to which Truist Bank can declare and pay dividends to the Parent Company, including those related to regulatory capital requirements, general regulatory oversight to prevent unsafe or unsound practices, and federal banking law requirements concerning the payment of dividends out of net profits, surplus, and available earnings. Certain contractual restrictions also may limit the ability of Truist Bank to pay dividends to the Parent Company. No assurances can be given that Truist Bank will, in any circumstances, pay dividends to the Parent Company.\nThe Parent Company’s ability to declare and pay dividends is similarly limited by federal banking law and FRB regulations and policy. The FRB has authority to prohibit BHCs from making capital distributions if they would be deemed to be an unsafe or unsound practice. The FRB has indicated generally that it may be an unsafe or unsound practice for BHCs to pay dividends unless a BHC’s net income is sufficient to fund the dividends and the expected rate of earnings retention is consistent with the organization’s capital needs, asset quality, and overall financial condition. In addition, the Parent Company’s ability to make capital distributions, including paying dividends and repurchasing shares, is subject to the FRB’s automatic restrictions on capital distributions under the FRB’s capital rules. Truist’s risk-based capital and leverage ratio requirements are discussed above in the “Capital Requirements” section.\nNorth Carolina law provides that, as long as a bank does not make distributions that reduce its capital below its applicable required capital, the board of directors of a bank chartered under the laws of North Carolina may declare such distributions as the directors deem proper.\nPrompt Corrective Action\nThe federal banking agencies are required to take “prompt corrective action” with respect to FDIC-insured depository institutions that do not meet minimum capital requirements. The law establishes five categories for this purpose: “well-capitalized,” “adequately capitalized,” “undercapitalized,” “significantly undercapitalized,” and “critically undercapitalized.” To be considered “well-capitalized,” an IDI must maintain minimum capital ratios and must not be subject to any order or written directive to meet and maintain a specific capital level for any capital measure. An institution that fails to remain well-capitalized becomes subject to a series of restrictions that increase in severity as its capital condition weakens. Such restrictions may include a prohibition on capital distributions, restrictions on asset growth, or restrictions on the ability to receive regulatory approval of applications. The regulations apply only to banks and not to BHCs. However, the FRB is authorized to take appropriate action at the holding company level, based on the undercapitalized status of the holding company’s subsidiary banking institutions. In certain instances relating to an undercapitalized banking institution, the BHC, in its capacity as a source of strength would be required to guarantee the performance of the undercapitalized subsidiary’s capital restoration plan and could be liable for civil money damages for failure to fulfill those guarantee commitments.\nIn addition, failure to meet capital requirements may cause an institution to be directed to raise additional capital. Federal law further mandates that the agencies adopt safety and soundness standards generally relating to operations and management, asset quality, and executive compensation; and authorizes administrative action against an institution that fails to meet such standards. Failure to meet capital guidelines may subject a banking organization to a variety of other enforcement remedies, including additional substantial restrictions on its operations and activities, termination of deposit insurance by the FDIC and, under certain conditions, the appointment of a conservator or receiver.\n10   Truist Financial Corporation\nTransactions with Affiliates\nThere are various legal restrictions on the extent to which Truist and its nonbank subsidiaries may borrow or otherwise engage in certain types of transactions with Truist Bank. Under the Federal Reserve Act and FRB regulations, Truist Bank and its subsidiaries are subject to quantitative and qualitative limits on extensions of credit, purchases of assets, and certain other transactions involving its nonbank affiliates. In addition, transactions between Truist Bank and its nonbank affiliates are required to be on arm’s length terms and must be consistent with standards of safety and soundness.\nAcquisitions\nTruist is subject to numerous laws that may require regulatory approval for acquisitions. For example, under the BHCA, a BHC may not directly or indirectly acquire ownership or control of more than 5% of the voting shares or substantially all of the assets of any BHC or bank or merge or consolidate with another BHC without the prior approval of the FRB. The BHCA and other federal laws enumerate the factors the FRB must consider when reviewing the merger of BHCs, the acquisition of banks or the acquisition of voting securities of a bank or BHC. These factors include the competitive effects of the proposal in the relevant geographic markets; the financial and managerial resources and future prospects of the companies and banks involved in the transaction; the effect of the transaction on the financial stability of the U.S.; the organizations’ compliance with anti-money laundering laws and regulations; the convenience and needs of the communities to be served; and the records of performance under the CRA of the IDIs involved in the transaction.\nFederal law authorizes interstate acquisitions of banks and BHCs without geographic limitation, and a bank headquartered in one state is authorized to merge with a bank headquartered in another state, subject to market share limitations, regulatory approvals, and any state requirement that the target bank shall have been in existence and operating for a minimum period of time. The market share limitations impose conditions that the acquiring BHC, after and as a result of the acquisition, control no more than 10% of the total amount of deposits of IDIs in the U.S. and no more than 30%, subject to variation by state law, of such deposits in applicable states. FRB rules also prohibit a FHC from combining with another company if the resulting company’s liabilities would exceed 10% of the aggregate consolidated liabilities of all financial companies.\nAfter a bank has established branches in a state through an interstate merger transaction, the bank may establish and acquire additional branches at any location in the state where a bank headquartered in that state could have established or acquired branches under applicable federal or state law. These regulatory considerations are applicable to privately negotiated acquisition transactions.\nThe standards by which bank and financial institution acquisitions are evaluated have been undergoing review and change by the federal agencies. As a result, it is uncertain how these new policies will be applied.\nIn July 2024, the FDIC released a proposed rule to amend its regulations under the Change in Bank Control Act, which generally provides that no person may directly or indirectly acquire control of an insured depository institution unless the person has given the appropriate federal banking agency prior notice of the proposed transaction and the agency has not disapproved it. The FDIC’s regulations contain a rebuttable presumption that the acquisition of voting securities of a holding company like Truist that directly or indirectly controls an insured state nonmember bank like Truist Bank constitutes such an acquisition of control requiring prior notice to the FDIC if, immediately after the transaction, the acquiring person will own, control, or hold with power to vote 10% or more of any class of voting securities of the holding company and other specified conditions are met. The proposed rule removes an explicit exemption for transactions where the FRB reviews a notice under the Change in Bank Control Act. We continue to evaluate this proposal and its potential impacts, if adopted as proposed, on Truist and Truist Bank.\nIn September 2024, the FDIC adopted a final statement of policy regarding its review of Bank Merger Act applications. The final policy statement addresses, among other things, the scope of transactions subject to FDIC approval, a more rigorous FDIC process for evaluating Bank Merger Act applications, and the FDIC Board’s heightened expectations with respect to the Bank Merger Act’s statutory factors. As a result, Bank Merger Act applications to the FDIC will now require additional information and transactions that would result in a bank with $100 billion or more in total consolidated assets will be subject to heightened scrutiny. It is unclear whether and how the FDIC will implement its final statement of policy on bank mergers.\nIn addition, the U.S. DOJ clarified that it will assess competition considerations in connection with bank and bank holding company mergers using its 2023 Merger Guidelines, which is the general merger review framework the U.S. DOJ now uses to evaluate transactions in all segments of the economy, and a newly-issued 2024 Banking Addendum (“2024 Banking Addendum”). Previously the U.S. DOJ assessed bank and bank holding company mergers under the 1995 Bank Merger Guidelines, which focused primarily on concentrations of deposits and branches. Since the 2024 Banking Addendum allows for consideration of theories of harm and relevant markets not considered in the 1995 Bank Merger Guidelines, it remains uncertain how the U.S. DOJ will ultimately apply this new merger review framework to bank mergers.\nTruist Financial Corporation   11\nOther Safety and Soundness Regulations\nThe FRB has supervisory and enforcement powers over BHCs and their non-banking subsidiaries. The FRB has authority to prohibit activities that represent unsafe or unsound practices or constitute violations of law, rule, regulation, administrative order, or written agreement with a federal regulator. These powers may be exercised through the issuance of confidential supervisory actions, cease and desist orders, civil monetary penalties, or other actions.\nThere also are a number of obligations and restrictions imposed on BHCs and their IDI subsidiaries by federal law and regulatory policy that are designed to reduce potential loss exposure to depositors and the DIF in the event the IDI is insolvent or is in danger of becoming insolvent. For example, the FRB requires a BHC to serve as a source of financial strength to its subsidiary IDIs and to commit financial resources to support such institutions in circumstances where it might not do so otherwise.\nBanking regulators also have broad supervisory and enforcement powers over Truist Bank, including the power to impose confidential supervisory actions, fines and other civil and criminal penalties, and to appoint a receiver in order to conserve the assets of Truist Bank for the benefit of depositors and other creditors. The NCCOB also has the authority to take possession of a North Carolina state bank in certain circumstances, including when it appears that such bank has violated its charter or any applicable laws, is conducting its business in an unauthorized or unsafe manner, is in an unsafe or unsound condition to transact its business or has an impairment of its capital stock.\nDIF Assessments\nTruist Bank’s deposits are insured by the FDIC up to the applicable limits, which is currently $250,000 per account ownership type. The FDIC imposes a risk-based deposit premium assessment system that determines assessment rates for an IDI based on an assessment rate calculator, which is based on a number of elements to measure the risk each IDI poses to the DIF. The assessment rate is applied to total average assets less tangible equity, as defined under the Dodd-Frank Act. The assessment rate schedule can change from time to time at the discretion of the FDIC, subject to certain limits. Under the current system, premiums are assessed quarterly.\nThe FDIC implemented a special assessment to recoup losses to the DIF associated with bank failures in 2023. The assessment is based on an insured depository institution’s estimated uninsured deposits reported as of December 31, 2022. The special assessment for Truist Bank was $64 million and $507 million for the years ended December 31, 2024 and 2023, respectively. Truist Bank may be subject to additional adjustments due to change in the estimated relevant losses to the DIF reported by the FDIC. In June 2024, the FDIC provided notification that the collection period will be extended an additional two quarters beyond the initial eight quarterly installments. The special assessment will be paid in ten quarterly installments, which began in the second quarter of 2024. The ultimate amount of expenses associated with the special assessment will also be impacted by the finalization of the losses incurred by the FDIC in the resolutions of Silicon Valley Bank, Signature Bank, and First Republic Bank, which could result in additional expense.\nConsumer Protection Laws and Regulations\nIn connection with its lending and leasing activities, Truist Bank is subject to federal and state laws designed to protect borrowers and promote lending to various sectors of the economy and population. The CFPB examines Truist and Truist Bank for compliance with a broad range of federal consumer financial laws and regulations, including the laws and regulations that relate to deposit products, credit card, mortgage, automobile, student, and other consumer loans, and other consumer financial products and services offered. The federal consumer financial protection laws that are subject to the CFPB’s supervision and enforcement powers include, among others, the Truth in Lending Act, Truth in Savings Act, Home Mortgage Disclosure Act, Fair Credit Reporting Act, Electronic Funds Transfer Act, Real Estate Settlement Procedures Act, Fair Debt Collection Practices Act, and Equal Credit Opportunity Act. The CFPB also has authority to take enforcement actions to prevent and remedy acts and practices relating to consumer financial products and services that it deems to be unfair, deceptive, or abusive, and to impose new disclosure requirements for any consumer financial product or service.\n12   Truist Financial Corporation\nIn October 2024, the CFPB finalized a rule under the Dodd-Frank Act, which requires certain entities, including Truist and Truist Bank, to, among other things, make available to a consumer, upon request, information in its control or possession concerning the consumer financial product or service that the consumer obtained from that entity. The rule also requires data providers holding a consumer account, such as Truist Bank, to establish a developer interface satisfying certain data security specifications and other standards, through which the data provider can receive requests for, and provide, specific types of data covered by the rule in electronic, usable form to authorized third parties, including data aggregators. Data providers are prohibited from charging consumers or third parties fees for processing these consumer data requests. The rule also places certain data security, authorization, and other obligations on third parties accessing covered data from data providers, which could include Truist and Truist Bank when acting in certain capacities. The rule also requires such third parties to limit their collection, use, and retention of the data received from the applicable data provider to only what is reasonably necessary to provide the applicable consumer’s requested product or service, including uses that are reasonably necessary to improve the product or service. The compliance date for a data provider that is a depository institution with over $250 billion in total assets is April 1, 2026; however, the final rule is subject to ongoing litigation that could impact whether and when Truist and Truist Bank are required to comply with the rule. We continue to evaluate the final rule and the potential impacts on Truist and Truist Bank.\nThe CFPB may issue additional regulations that impact products and services offered by Truist or Truist Bank. The regulations could reduce the fees that Truist and Truist Bank receives, alter the way products and services are provided, or increase the risk of private litigation or regulatory enforcement action.\nBSA and Patriot Act\nFinancial institutions, including Truist Bank, are subject to the anti-money laundering and countering the financing of terrorism requirements of the BSA and its implementing regulations. The BSA was amended by the Patriot Act to strengthen the ability of U.S. law enforcement agencies and intelligence communities to cooperate in the prevention, detection, and prosecution of international money laundering and the financing of terrorism and was further amended by the Anti-Money Laundering Act of 2020. The BSA, as amended, contains anti-money laundering measures affecting IDIs, broker-dealers and certain other financial institutions. The BSA requires those financial institutions to implement policies and procedures to combat money laundering and the financing of terrorism and grants the Secretary of the U.S. Treasury broad authority to issue regulations and to impose requirements and restrictions on financial institutions’ operations. The BSA further imposes substantial obligations on financial institutions to maintain appropriate policies, procedures, and processes to detect, prevent, and report money laundering, terrorist financing, and other financial crimes. Failure to comply with these regulations may result in fines, penalties, lawsuits, regulatory sanctions, reputational damage, or restrictions on business. In addition, the Patriot Act requires the federal bank regulatory agencies to consider the effectiveness of a financial institution’s anti-money laundering activities when reviewing bank mergers and BHC acquisitions.\nBSA/AML and Sanctions\nFinancial institutions that are subject to the BSA are subject to examinations and ongoing monitoring to assess compliance with BSA/AML and OFAC laws and regulations. These laws and regulations are designed to protect the financial system, consumers, and financial institutions from bad actors and illicit activities by requiring financial institutions to develop and implement BSA/AML programs designed to deter and when possible detect and prevent the use of the financial system to facilitate the funding of criminal activities. In addition, financial institutions are also required to comply with sanctions programs administered by OFAC and the U.S. Department of State, which prohibit financial transactions involving certain individuals, entities, countries, and territories and impose other restrictions on certain investments and dealings.\nFederal law grants substantial enforcement powers to federal financial institution regulators, OFAC, and the U.S. DOJ, among other government agencies, with respect to AML and OFAC laws and regulations. This enforcement authority includes, among other things, the ability to assess significant civil or criminal monetary penalties, fines, or restitution; to issue cease and desist or prohibition orders; and to initiate injunctive actions against financial institutions and institution-affiliated parties. These enforcement actions may be initiated for violations of laws and regulations, or for unsafe and unsound practices.\nPrivacy, Data Protection, and Cybersecurity\nVarious federal and state laws and regulations contain extensive data privacy, data protection and cybersecurity provisions, and the regulatory framework for data privacy, data protection, and cybersecurity is rapidly evolving. The FRB, FDIC, and other bank regulatory agencies have adopted guidelines for safeguarding confidential, personal customer information. These guidelines require each financial institution, under the supervision and ongoing oversight of its board of directors or an appropriate committee thereof, to create, implement, and maintain a comprehensive written information security program designed to support the security and confidentiality of customer information, protect against any anticipated threats or hazards to the security or integrity of such information and protect against unauthorized access to or use of such information that could result in substantial harm or inconvenience to any customer. In addition, various U.S. regulators, including the FRB and the SEC, have increased their focus on cybersecurity through guidance, examinations, and regulations.\nTruist Financial Corporation   13\nAt the federal level, the Gramm-Leach-Bliley Act requires financial institutions to, among other things, implement policies and procedures regarding the disclosure of nonpublic personal information about consumers to non-affiliated third parties. In general, the statute requires that financial institutions provide explanations to consumers on their policies and procedures regarding the disclosure of such nonpublic personal information and, except as otherwise required by law, prohibits disclosing such personal information except as provided in the financial institution’s policies and procedures.\nA joint regulation from the FRB, OCC, and FDIC requires a banking organization to notify its primary federal regulators as soon as possible and within 36 hours after identifying a “computer-security incident” that the banking organization believes in good faith has materially disrupted or degraded, or is reasonably likely to materially disrupt or degrade its business or operations in a manner that would, among other things, jeopardize the viability of its operations, result in customers being unable to access their deposit and other accounts, result in a material loss of revenue, profit or stock price, or pose a threat to the financial stability of the U.S.\nIn addition, once implementing regulations are finalized, the Cyber Incident Reporting for Critical Infrastructure Act (“CIRCIA”) will require, among other things, covered entities to report significant cyber incidents, including ransomware attacks, to the Cybersecurity and Infrastructure Security Agency (“CISA”) within 72 hours from the time the covered entity reasonably believes the incident occurred (and within 24 hours of making a ransom payment as a result of a ransomware attack). The CISA proposed a rule under the CIRCIA in April 2024 that would clarify the scope of cyber incidents to be reported and would further define covered entities subject to the CIRCIA to include banking organizations like Truist.\nTruist’s nonbank subsidiaries are also subject to rules and regulations issued by the Federal Trade Commission, which regulates unfair or deceptive acts or practices, including with respect to data privacy, data protection, and cybersecurity. Moreover, the U.S. Congress has recently considered, and is expected to continue to consider various proposals for, more comprehensive data privacy, data protection, and cybersecurity legislation.\nLike other lenders, Truist Bank uses credit bureau data in its underwriting activities. The Fair Credit Reporting Act regulates reporting information to credit bureaus, prescreening individuals for credit offers, sharing of information between affiliates, and using affiliate data for marketing purposes. Similar state laws may impose additional requirements on Truist Bank.\nStates are also increasingly proposing or enacting legislation that relates to data privacy, data protection, and cybersecurity such as the California Consumer Privacy Act as amended by the California Privacy Rights Act. Truist may be subject to similar laws in other states where Truist does business or in states where Truist may collect personal information of residents. In addition, laws in all 50 U.S. states generally require businesses to provide notice under certain circumstances to individuals whose personal information has been disclosed as a result of a data breach.\nMoreover, the New York Department of Financial Services Cybersecurity Regulation is driving significant cybersecurity compliance activities for Truist. This regulation includes phased compliance periods as well as attestation of compliance by certain Truist entities.\nTruist has undertaken significant efforts to comply with these laws and regulations and continues to assess their requirements and applicability to Truist. These laws and regulations, as well as proposed legislation and regulation, are subject to revision or formal guidance and may be interpreted or applied in a manner inconsistent with the Company’s understanding, which may result in further uncertainty and require Truist to incur additional costs to comply. Refer to Item 1A, “Risk Factors” for more information on the risks related to compliance with applicable privacy laws and regulations.\nCRA\nThe CRA requires the FDIC to assess the bank’s record in meeting the credit needs of the communities served by the bank, including low- and moderate-income neighborhoods and persons. Institutions are assigned one of four ratings: “Outstanding,” “Satisfactory,” “Needs to Improve,” or “Substantial Noncompliance.” This assessment is considered for any bank that applies to merge or consolidate with or acquire the assets or assume the liabilities of an IDI, or to open or relocate a branch office. The CRA record of each subsidiary bank of a FHC also is assessed by the FRB in connection with the review of any proposed acquisition or merger application. For its most recent CRA examination period, Truist Bank received the highest possible overall rating of “Outstanding” from the FDIC.\n14   Truist Financial Corporation\nIn October 2023, the FRB, FDIC, and OCC issued a final rule to amend their regulations implementing the CRA. The rule materially revises the current CRA framework, including the assessment areas in which a bank is evaluated to include activities associated with online and mobile banking, the tests used to evaluate the bank in its assessment areas, new methods of calculating credit for lending, investment, and service activities, and additional data collection and reporting requirements. The rule was expected to result in a significant increase in the thresholds for large banks to receive “Outstanding” ratings in the future. The rule was expected to take effect on April 1, 2024, with most of the provisions becoming applicable on January 1, 2026. Reporting of the collected data will not be required until 2027. Several banking industry groups filed a lawsuit seeking to invalidate the CRA final rule, in which they argued that the federal banking agencies exceeded their statutory authority. In March 2024, a federal judge granted an injunction to extend the CRA final rule’s effective date. The effective date will be extended each day the injunction remains in place, pending the resolution of the lawsuit. It is unknown whether and when the CRA final rule will become effective.\nAutomated Overdraft Payment Regulation\nThere are federal consumer protection laws related to automated overdraft payment programs offered by financial institutions. The CFPB prohibits financial institutions from charging consumers fees for paying overdrafts on automated teller machine and one-time debit card transactions, unless a consumer consents, or opts in, to the overdraft service. Financial institutions must also provide consumers with a notice that explains the financial institution’s overdraft services, including the associated fees and the consumer’s choices. In addition, FDIC-supervised institutions must monitor overdraft payment programs for “excessive or chronic” client use and undertake “meaningful and effective” follow-up action with clients that overdraw their accounts more than six times during a rolling 12-month period. Financial institutions must also impose daily limits on overdraft charges, review and modify check-clearing procedures, prominently distinguish account balances from available overdraft coverage amounts, and provide for board and management oversight regarding overdraft payment programs. In response to direct client feedback, Truist offers checking accounts that are not subject to overdraft fees.\nIn December 2024, the CFPB issued a final rule to financial institutions with more than $10 billion in assets to either limit the cost of overdraft services to the amount of their costs and losses, or adhere to a fee cap of $5. The rule was expected to take effect on October 1, 2025. Several banking industry groups seeking to invalidate the rule through litigation are arguing, among other things, that the CFPB did not have the statutory authority to issue the rule under the Truth in Lending Act. It is unknown whether the litigation or other government actions in the future will impact the effective date or substance of the rule.\nVolcker Rule\nTruist is prohibited under the Volcker Rule from (i) engaging in proprietary trading activities, and (ii) having certain ownership interests in and relationships with covered private funds. The fundamental prohibitions of the Volcker Rule apply to banking entities of any size, including Truist and its affiliates. The Volcker Rule regulations contain exemptions or exclusions, including for market-making, hedging, underwriting, trading in U.S. government and agency obligations, and also permit certain ownership interests in certain types of funds. They also permit the offering and sponsoring of funds under certain conditions. Truist maintains compliance programs in response to the significant compliance obligations mandated by the Volcker Rule regulations.\nRegulatory Regime for Swaps\nThe Dodd-Frank Act established a comprehensive regulatory regime for the OTC swaps market, aimed at increasing transparency, and reducing systemic risk in the derivatives markets, including requirements for central clearing, exchange trading, capital adequacy, margin, reporting, and recordkeeping. The Dodd-Frank Act requires that certain swap dealers and security-based swap dealers register with one or both of the SEC and CFTC, depending on the nature of the swaps business. Truist Bank is registered with the CFTC as a swap dealer and is conditionally registered with the SEC as a security-based swap dealer, subjecting Truist Bank to requirements under the CFTC’s and SEC’s regulatory regimes. This includes trade reporting and recordkeeping requirements, business conduct requirements (including daily valuations, disclosure of material risks associated with swaps and disclosure of material incentives and conflicts of interest), and mandatory clearing and exchange trading requirements for certain standardized swaps designated by the CFTC. The NFA is the primary self-regulatory organization for Truist’s swap dealer. Truist Bank’s uncleared swaps and security-based swaps are subject to variation margin and initial margin requirements.\nTruist Financial Corporation   15\nBroker-Dealer and Investment Adviser Regulation\nTruist’s broker-dealer and investment adviser subsidiaries are subject to regulation by the SEC. FINRA is the primary self-regulatory organization for Truist’s registered broker-dealer subsidiaries. Truist’s broker-dealer and investment adviser subsidiaries also are subject to additional regulation by states or local jurisdictions. The SEC and FINRA have active enforcement functions that oversee broker-dealers and investment advisers and can bring actions that result in fines, restitution, a limitation on permitted activities, disqualification to continue to conduct certain activities and an inability to rely on certain favorable exemptions. Certain types of infractions and violations also can affect Truist’s ability to issue new securities expeditiously. In addition, certain changes in the activities of a broker-dealer require approval from FINRA, and FINRA takes into account a variety of considerations in acting upon applications for such approval, including internal controls, capital levels, management experience and quality, prior enforcement and disciplinary history, and supervisory concerns.\nFDIC Recordkeeping Requirements\nTruist is subject to certain enhanced deposit insurance recordkeeping requirements adopted by the FDIC. To facilitate prompt payment of FDIC-insured deposits when large IDIs fail, FDIC rules require IDIs with two million or more deposit accounts to maintain complete and accurate data on each depositor’s ownership interest by right and capacity and to develop the capability to calculate the insured and uninsured amounts for each deposit owner by ownership right and capacity.\nOther Regulatory Matters\nTruist is subject to examinations by federal and state banking regulators, as well as the SEC, CFTC, FINRA, NFA, various taxing authorities, and various state securities regulators. Truist periodically receives requests for information on business and accounting practices from regulatory authorities in various states, including state attorneys general, securities regulators, and other regulatory authorities. Such requests are considered incidental to the normal conduct of business.\nHuman Capital\nTruist works as One Team—unified by its purpose, mission, and values—to meet clients’ needs, uplift communities, empower teammates, and promote effective risk management and controls to drive performance. Truist recognizes that attracting the best talent, making investments in teammates, caring to better understand their backgrounds and experiences, and helping to bolster their career trajectories ultimately leads to more engaged and productive teammates, which can contribute to better client service and business outcomes for Truist overall.\nTruist’s Compensation and Human Capital Committee oversees Truist’s compensation and benefit programs consistent with its compensation philosophy. This committee provides oversight of Truist’s human capital strategy that supports attracting, developing, and retaining qualified teammates.\nTruist strives to provide rigorous and dynamic talent practices, which develop teammates for success in a broad set of roles. Our talent practices include performance, succession, and progression planning.\nTruist’s Enterprise Ethics Office manages the standards for ethical conduct, conduct risks, and related teammate concerns. The Enterprise Ethics Office also facilitates the Board’s review and approval of the Code of Ethics. Through its risk monitoring and oversight routines, the Enterprise Ethics Office identifies trends and insights related to organizational culture and control environment, which are reported to the Executive-level Enterprise Risk Committee and the Board.\nThe following table presents a summary of teammates as of December 31, 2024:\nTable 3: Teammate Summary\n# of Teammates\n% of Population\nFull-Time\n36,769\n95.9 \n%\nPart-Time\n1,566\n4.1 \nTotal\n38,335\n100.0 \n%\nTruist also leverages a contingent workforce, which is not reflected in the table, as an important part of the Company’s overall workforce strategy.\n16   Truist Financial Corporation\nTruist aspires to foster a performance-based culture that is reinforced by belonging and inclusivity. Furthering a sense of belonging drives our teammate mission of creating an inclusive and energizing environment that empowers teammates to learn, grow, and have meaningful careers. Through inclusivity we strive for business settings where every teammate is respected, everyone matters and has a voice, and everyone feels welcome and empowered to make meaningful contributions. Collectively, this approach helps us to be competitive in meeting the needs of our clients and communities.\nThe following table presents a summary of teammate statistics as of December 31, 2023, using the category classifications on the U.S. Equal Employment Opportunity Commission’s EEO-1 report, which differ from those recognized internally by Truist.\nTable 4: Teammate Composition\n(1)\nGender\nRace / Ethnicity\nFemale\nMale\nCaucasian\nBlack/African American\nHispanic or Latino\nAsian\nAmerican Indian/Alaska Native\nNative Hawaiian/Other Pacific Islander\nTwo or More Races\nExecutive management & senior leaders\n27.8 \n%\n72.2 \n%\n81.2 \n%\n9.0 \n%\n3.8 \n%\n4.6 \n%\n0.3 \n%\n— \n%\n1.1 \n%\nFirst / mid-level managers\n53.9 \n46.1 \n69.0 \n14.1 \n8.0 \n6.5 \n0.4 \n0.1 \n1.9 \nProfessionals\n48.9 \n51.1 \n65.1 \n15.6 \n6.3 \n10.5 \n0.5 \n0.2 \n1.8 \nAll others\n75.4 \n24.6 \n54.3 \n23.2 \n14.5 \n4.0 \n0.8 \n0.3 \n2.9 \nAll teammates\n62.7 \n37.3 \n60.5 \n19.1 \n10.6 \n6.6 \n0.6 \n0.2 \n2.4 \n(1)\nSource: EEO-1 data as of December 31, 2023. All others include sales workers and administrative support EEO-1 job categories. Includes TIH teammates.\nTalent Practices\nTruist utilizes a suite of talent practices providing insight into the state of our talent. Talent practices underpin and strengthen executive leader decisions, which are informed by data and insights. These practices include:\n•\nPerformance management - goal planning, feedback, check-ins, and performance evaluation.\n•\nSuccession planning - tools that identify potential interim, near- and longer-term internal successors designed to allow for optionality and business continuity.\n•\nTalent assessment - manager evaluation of the forward-looking potential of eligible teammates through the lens of their ability, agility, and aspiration as well as consideration of retention risk.\n•\nProgression planning - helps teammates and managers chart a path for teammates to learn, grow, and have meaningful careers.\n•\nEnterprise strategic workforce planning and skill assessments – a practice enabling the business to plan for the appropriate workforce capability and capacity in target job profiles.\nTalent Development\nTruist teammates have access to extensive programs and benefits for career advancement. Teammates can partner with a certified coach to help them identify and focus on potential career paths, create clear goals, and remain accountable in achieving those goals. For teammates who qualify, Truist also provides tuition assistance so teammates can continue formal education by seeking degrees that align with career goals or develop needed emerging skills through our Future Skills program. Truist offers career and job transparency through a set of resources including career discovery and career planning online services. Truist seeks to achieve a career destination culture through career mobility and pipeline strategies and programs, including through Truist’s Leadership Institute, which leverages developmental experiences, team optimization, executive coaching, and leadership development.\nIn addition to career development opportunities, Truist provides learning experiences to new and existing teammates to help build the skills needed now and in the future, including role skill preparedness, upskilling for the future, and access to skill building content for teammate-led learning. Truist Learning and Development also prioritizes and integrates regulatory-related training to mitigate risk across the organization. Truist has invested in innovative talent marketplace and learning technologies and believes that skill development leads to healthy and robust career mobility, which furthers our teammate value proposition and retention efforts\n.\nCompensation and Total Rewards\nTruist’s Compensation and Total Rewards enable its purpose, mission, and values, specifically Truist’s mission to create an inclusive and energizing environment that empowers teammates. Truist provides market competitive total rewards to attract and retain talent while enabling Truist’s short- and long-term performance. Truist provides compensation and rewards that aim to achieve positive business results, are based on market and internal assessments, and are aligned with risk management principles. Truist conducts an annual pay equity study, factoring teammates’ roles, levels of experience, and geography.\nTruist Financial Corporation   17\nTruist’s benefits program for qualified teammates includes a company-funded defined benefit pension plan, a 401(k) plan, an employee stock purchase plan, Truist Momentum financial well-being education, healthcare and insurance benefits, Lifeforce physical well-being program, mental well-being support, paid time off, teammate and family resources such as access to backup child-care centers and family care resources, tuition assistance, and on-site services such as health centers and fitness centers.\nWebsite Access to Truist’s Filings with the SEC\nTruist’s electronic filings with the SEC, including the Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to these reports filed or furnished pursuant to Sections 13(a) or 15(d) of the Exchange Act are made available at no cost on the Company’s Investor Relations website, \nIR.Truist.com\n, as soon as reasonably practicable after Truist files such material with, or furnishes it to, the SEC. Truist’s SEC filings are also available through the SEC’s website at \nsec.gov\n.\nTruist may use its website to distribute Company information, including as a means of disclosing material, non-public information and for complying with its disclosure obligations under Regulation FD. Truist routinely posts and makes accessible financial and other information, including corporate responsibility and sustainability information, regarding Truist on its website. Investors should monitor Truist’s website, including the Investor Relations portion, in addition to its press releases, SEC filings, public conference calls, and webcasts. The information on our website is not incorporated by reference into this report.\nCorporate Governance\nInformation with respect to Truist’s Board of Directors, Executive Officers, and corporate governance policies and principles is presented on Truist’s Investor Relations website, \nIR.Truist.com\n. Specifically, the Company makes available on its Investor Relations website, under the heading “Governance & Responsibility” (i) its Code of Ethics for the Board, senior financial officers, and teammates, (ii) its Corporate Governance Guidelines, and (iii) the charters of the Company’s standing Board committees. If the Company makes changes in, or provides waivers from, the provisions of its Code of Ethics that the SEC requires it to disclose, the Company intends to disclose these events in the “Governance & Responsibility” section of its Investor Relations website. The information on our website is not incorporated by reference into this report.\n18   Truist Financial Corporation\nExecutive Officers\nExecutive Officer\nRecent Work Experience\nYears of Service\nAge\nWilliam H. Rogers, Jr.\nChairman and Chief Executive Officer\nChairman since March 2022. Chief Executive Officer since September 2021. President and Chief Operating Officer from December 2019 to September 2021. Previously SunTrust Chairman and Chief Executive Officer from January 2012 to December 2019.\n44\n67\nMichael B. Maguire\nSenior Executive Vice President and Chief Financial Officer\nChief Financial Officer since September 2022. Chief National Consumer Finance Services and Payments Officer from September 2021 to September 2022. Head of National Consumer Finance and Payments from December 2019 to August 2021. Previously SunTrust Enterprise Partnerships and Investments Executive.\n22\n46\nBrad Bender\nSenior Executive Vice President and Chief Risk Officer\nChief Risk Officer since November 2024. Interim Chief Information Officer from April 2024 to November 2024. Head of Enterprise Operational Services from November 2023 to April 2024. Head of Consumer Finance Solutions and Enterprise Operations and Global Services from May 2023 to November 2023. Head of Consumer Finance Solutions from September 2022 to May 2023. Head of Home Improvement Lending from August 2021 to September 2022. Head of Consumer Credit Risk and Policy Management from December 2019 to August 2021.\n20\n44\nScott A. Stengel\nSenior Executive Vice President, Chief Legal Officer, and Head of Government Affairs\nChief Legal Officer and Head of Government Affairs since December 2023. General Counsel at Ally Financial Inc. from May 2016 to December 2023.\n1\n53\nKristin Lesher\nSenior Executive Vice President and Chief Wholesale Banking Officer\nChief Wholesale Banking Officer since February 2024. Executive Vice President and Head of Commercial Banking Coverage at Wells Fargo from October 2021 to November 2023. Head of East Region Commercial Banking Coverage at Wells Fargo from November 2018 to October 2021. Previously, Co-Head of Investment Banking Coverage.\n1\n52\nDontá L. Wilson\nSenior Executive Vice President and Chief Consumer & Small Business Banking Officer\nChief Consumer & Small Business Banking Officer since November 2023. Chief Retail & Small Business Banking Officer from March 2022 to November 2023. Chief Digital and Client Experience Officer from November 2018 to March 2022. Chief Client Experience Officer from August 2016 to November 2018.\n26\n48\nTruist Financial Corporation   19",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nMD&A is intended to assist readers in their analysis of the accompanying Consolidated Financial Statements and supplemental financial information. It should be read in conjunction with the Consolidated Financial Statements, the accompanying Notes to the Consolidated Financial Statements in this Form 10-K, and other information contained in this document. For discussion of 2023 results as compared to 2022 results, see “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the Annual Report on Form 10-K for the year ended December 31, 2023, which was updated by Exhibit 99.1 to our Current Report on Form 8-K filed with the SEC on May 10, 2024, to reflect the discontinued operations of TIH and the segment realignment. Refer to “Note 21. Operating Segments” for additional disclosures related to Truist’s operating segments and “Note 2. Discontinued Operations” for additional information related to discontinued operations.\nA description of certain factors that may affect our future results and risk factors is set forth in Part I, Item 1A-Risk Factors of this report.\nExecutive Overview\n2024 was an important year for Truist. We added new clients and deepened existing relationships, invested in our core banking business, made enhancements to our technology and risk infrastructure, and maintained our credit and expense discipline.\nWe executed on several important strategic initiatives, including the sale of TIH and the repositioning of our balance sheet. On May 6, 2024, we completed the divestiture of TIH. Refer to “Note 2. Discontinued Operations” for additional information. Following the sale of TIH, Truist executed a strategic balance sheet repositioning of a portion of its AFS investment securities portfolio by selling lower-yielding investment securities, resulting in an after-tax loss of $5.1 billion in 2024, allowing Truist to reinvest a portion of the proceeds in higher yielding securities.\nThese actions increased our capital and further enhanced our ability to support the growth needs of clients, while also returning capital to shareholders. We returned $3.8 billion of capital to our common shareholders through $2.8 billion of common stock dividends and $1.0 billion of common share repurchases during 2024. As of December 31, 2024, we have $4.0 billion remaining under our $5.0 billion common share repurchase authorization through the end of 2026.\nIn addition, Truist redeemed all outstanding shares of its perpetual preferred stock series L and the corresponding depositary shares representing fractional interests in such series for $750 million.\nIn July 2024, we successfully completed the sale of Sterling Capital Management LLC, an asset management business. Cash proceeds and the gain recognized on the sale were not material.\nClarke R. Starnes III retired from his position as CRO and Vice Chair. Brad Bender, a 20-year Truist veteran who previously served as Truist’s Head of Enterprise Operational Services and interim Chief Information Officer, succeeded Starnes as CRO.\nHugh S. “Beau” Cummins III, Vice Chair and Chief Operating Officer of Truist, resigned from his position, effective January 13, 2025. Following Mr. Cummins’ departure, management of the enterprise payments business transitioned to Kristin Lesher, Senior Executive Vice President and Chief Wholesale Banking Officer. Mr. Cummins’ remaining responsibilities, including leading teams responsible for enterprise operational services, enterprise corporate services, the strategy, transformation, and performance office, and the governance and controls organization, transitioned to Michael B. Maguire, Senior Executive Vice President and CFO.\nWe launched Truist Cares for Western North Carolina, a three-year, $725 million commitment to support and sustain hurricane recovery and resiliency through dedicated capital to support rebuilding and resiliency, loans or investments in Community Development Financial Institutions, philanthropic grants to local and national nonprofit organizations, and community service hours.\nTruist Financial Corporation   47\nKey Areas of Focus\nOur strategic direction is to build the top super regional bank that grows with our clients with care. Our 2025 strategic objectives are to:\n•\nLeverage our capital position by growing and capturing additional share within our high growth markets and existing client base in key focus areas in WB and CSBB and in areas, markets, and client solutions where we have invested significantly and have momentum.\n•\nIn WB, deepen and grow existing client relationships in areas like Payments and Wealth, enhance the client digital experience, continue our momentum in Investment Banking and Trading, and capture more share of the commercial middle market.\n•\nIn CSBB, grow core deposits, deepen existing relationships with Premier clients, enhance the client digital experience, and drive additional fee and loan growth through our differentiated consumer lending solutions.\n•\nContinue to invest in important areas like new and existing talent, technology, risk, and cybersecurity, while maintaining our expense discipline with a goal of driving positive operating leverage.\n•\nMaintain our credit and risk discipline.\n•\nReturn capital to shareholders through our common stock dividend and share repurchase authorization.\nFinancial Results\nNet income to common shareholders totaled $4.5 billion, or $3.36 per share, for 2024, compared to a net loss available to common shareholders of $1.5 billion, or $1.09 per share, from the prior year.\n•\nResults from continuing operations for 2024 included securities losses of $6.7 billion ($5.1 billion after-tax or $3.82 per share) from the balance sheet repositioning, a charitable contribution to the Truist Foundation of $150 million ($115 million after-tax, or $0.09 per share), restructuring charges of $120 million ($92 million after-tax, or $0.07 per share), and the FDIC special assessment adjustment of $64 million ($49 million after-tax, or $0.04 per share).\n•\nResults from continuing operations for 2023 included a non-cash goodwill impairment charge of $6.1 billion ($4.56 per share), the FDIC special assessment of $507 million ($387 million after-tax, or $0.29 per share), restructuring charges of $320 million ($244 million after-tax, or $0.18 per share), and a discrete tax benefit of $204 million ($0.15 per share).\nNet income from discontinued operations was $4.9 billion for 2024, compared to $456 million for 2023.\n•\nResults from discontinued operations for 2024 included a gain on the sale of TIH of $6.9 billion ($4.8 billion after-tax, or $3.64 per share), the accelerated recognition of TIH equity compensation expense for certain event-driven awards of $99 million ($76 million after tax, or $0.06 per share), and restructuring charges of $82 million ($62 million after-tax, or $0.05 per share).\n•\nResults from discontinued operations for 2023 included restructuring charges of $55 million ($42 million after-tax, or $0.03 per share).\nTable 8: Earnings Highlights\nYear Ended December 31,\n(Dollars in millions)\nChange\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nNet income (loss) available to common shareholders\n$\n4,469 \n$\n(1,452)\n$\n5,927 \n$\n5,921 \n$\n(7,379)\nDiluted earnings per common share\n3.36 \n(1.09)\n4.43 \n4.45 \n(5.52)\nNet interest income - TE\n$\n14,303 \n$\n14,744 \n$\n14,455 \n$\n(441)\n$\n289 \nNoninterest income\n(813)\n5,498 \n5,660 \n(6,311)\n(162)\nTotal taxable-equivalent revenue\n$\n13,490 \n$\n20,242 \n$\n20,115 \n$\n(6,752)\n$\n127 \nLess taxable-equivalent adjustment\n212 \n220 \n142 \nTotal revenue\n$\n13,278 \n$\n20,022 \n$\n19,973 \nReturn on average assets\n0.92 \n%\n(0.19)\n%\n1.15 \n%\n1.11 \n%\n(1.34)\n%\nReturn on average common shareholders’ equity\n8.0 \n(2.6)\n10.4 \n10.6 \n(13.0)\nNet interest margin - TE\n3.03 \n2.98 \n3.01 \n0.05 \n(0.03)\n48   Truist Financial Corporation\nTruist’s TE revenue for 2024 was $13.5 billion. Excluding securities losses, TE revenue was $20.1 billion, representing a decrease of $101 million compared to 2023. Net interest income on a TE basis was $14.3 billion, down $441 million, or 3.0%, from the prior year primarily as a result of having a smaller more efficient balance sheet after the repositioning improving NIM by five basis points.\n•\nAverage earning assets decreased $21.6 billion, or 4.4%, compared to the prior year primarily due to declines in average total loans of $15.8 billion, or 4.9%, and average securities of $13.7 billion, or 10.0%, partially offset by an increase in other earning assets of $7.3 billion, or 25%. The change in average securities was driven by maturities and the balance sheet repositioning. The change in other earning assets (increase in balances held at the Federal Reserve) was driven by the balance sheet repositioning.\n•\nAverage deposits decreased $13.3 billion, or 3.3%, average short-term borrowings were flat, and average long-term debt decreased $13.0 billion, or 26% as a result of the smaller more efficient balance sheet.\nNIM was 3.03% for 2024, up five basis points compared to the prior year.\n•\nThe yield on the average total loan portfolio was 6.34% for 2024, up 22 basis points, compared to the prior year primarily reflecting higher market interest rates. The yield on the average securities portfolio was 2.83% for 2024, up 60 basis points compared to the prior year, reflecting the balance sheet repositioning and reinvesting cash flows into higher yielding securities.\n•\nThe average cost of total deposits was 2.02% for 2024, up 42 basis points compared to the prior year. The average cost of short-term borrowings was 5.36% for 2024, up 11 basis points compared to the prior year. The average cost of long-term debt was 4.94% for 2024, up 48 basis points compared to the prior year. The increases in rates on deposits and other funding sources was largely attributable to the repricing of lower cost funding sources.\nThe provision for credit losses was $1.9 billion for the year ended December 31, 2024 compared to $2.1 billion for the year ended December 31, 2023. The net charge-off ratio for the current year of 0.59% was up 9 basis points compared to the prior year.\n•\nThe decrease in the current year provision expense primarily reflects a lower allowance build.\n•\nThe net charge-off ratio was up compared to the prior year driven by higher net charge-offs in the CRE, other consumer, credit card, and indirect auto portfolios, partially offset by higher recoveries in the commercial and industrial portfolio. Additionally, the prior year included $98 million of charge-offs related to the sale of the student loan portfolio.\nNoninterest income was down $6.3 billion for the year ended December 31, 2024 compared to the year ended December 31, 2023 primarily due to $6.7 billion of securities losses resulting from the balance sheet repositioning, lower lending related fees, operating lease income, and card and payment related fees, partially offset by higher investment banking and trading income, wealth management income, service charges on deposits, and other income. Excluding securities losses, noninterest income was up $340 million, or 6.2%, compared to the prior year.\nNoninterest expense was down $6.7 billion, or 36%, for the year ended December 31, 2024 compared to the year ended December 31, 2023 primarily due to the 2023 goodwill impairment of $6.1 billion, lower regulatory charges due to the FDIC special assessment and related adjustments ($64 million in 2024 compared to $507 million in 2023), lower other expense, excluding the charitable contribution to the Truist Foundation, lower amortization of intangibles, and operating lease depreciation, partially offset by a $150 million charitable contribution to the Truist Foundation (other expense) and higher professional fees and outside processing expense. Restructuring charges decreased $200 million; both periods included restructuring charges for severance charges as well as facilities optimization costs. Noninterest expenses excluding the charitable contribution, the amortization of intangibles, the FDIC special assessment adjustment, restructuring charges, and a small loss on the early extinguishment of debt, decreased $44 million, or 0.4%.\nTruist had a benefit from income taxes of $556 million for 2024, compared to a provision for income taxes of $738 million in 2023. The provision for income taxes for 2023 reflects a pre-tax loss, which includes a non-deductible goodwill impairment charge, partially offset by a discrete tax benefit in the fourth quarter of 2023.\nTruist’s total assets at December 31, 2024 were $531.2 billion, a decrease of $4.2 billion, or 0.8%, compared to December 31, 2023 as loans and leases, net of ALLL, decreased $5.7 billion, or 1.9%, total securities decreased $3.4 billion, or 2.8%, partially offset by an increase of $8.7 billion, or 35%, in interest-bearing deposits with banks.\nTotal liabilities at December 31, 2024 were $467.5 billion, a decrease of $8.6 billion, or 1.8%, from the prior year, reflecting a decrease of $5.3 billion, or 1.3%, in deposits and a decrease of $4.0 billion, or 10.2%, in long-term debt, partially offset by an increase of $4.4 billion, or 17.6%, in short-term borrowings.\nTruist Financial Corporation   49\nTotal shareholders’ equity was $63.7 billion at December 31, 2024, an increase of $4.4 billion from December 31, 2023. This increase includes $4.8 billion in net income and $4.3 billion in OCI, partially offset by $3.1 billion in common and preferred dividends, $1.0 billion in common share repurchases, and $750 million for the redemption of series L preferred stock. Truist’s book value per common share at December 31, 2024 was $43.90, compared to $39.31 at December 31, 2023. Truist’s TBVPS of $30.01 at December 31, 2024 increased 37% compared to December 31, 2023.\nAsset quality remained stable.\n•\nNonperforming loans and leases held for investment totaled $1.4 billion or 0.47% of loans and leases held for investment at December 31, 2024, up three basis points compared to December 31, 2023.\n•\nLoans 90 days or more past due and still accruing totaled $587 million or 0.19% of loans and leases held for investment at December 31, 2024, up two basis point as a percentage of loans and leases compared with December 31, 2023. Excluding government guaranteed loans, the ratio of loans 90 days or more past due and still accruing as a percentage of loans and leases was 0.05% at December 31, 2024, up one basis point from December 31, 2023.\n•\nThe allowance for credit losses was $5.2 billion and includes $4.9 billion for the allowance for loan and lease losses and $304 million for the reserve for unfunded commitments. The ALLL ratio was 1.59%, up five basis points compared with December 31, 2023.\nCapital strengthened during 2024.\n•\nTruist’s CET1 ratio was 11.5% as of December 31, 2024, up 140 basis points since December 31, 2023 from the sale of TIH and organic capital generation, partially offset by the balance sheet repositioning, common dividends, and share repurchases.\n•\nTruist returned $3.8 billion to common shareholders through declared common dividends of $2.8 billion or $2.08 per share during 2024 and repurchases of $1.0 billion of common stock, resulting in a dividend payout ratio of 62% and total payout ratio of 85%.\n•\nTruist redeemed all outstanding shares of its perpetual preferred stock series L and the corresponding depositary shares representing fractional interests in such series for $750 million.\n•\nTruist’s average consolidated LCR was 109% for the three months ended December 31, 2024, compared to the regulatory minimum of 100%.\nAnalysis of Results of Operations\nNet Interest Income and NIM\nTaxable-equivalent net interest income for the year ended December 31, 2024 was down $441 million, or 3.0%, compared to the year ended December 31, 2023 primarily as a result of having a smaller more efficient balance sheet after the repositioning. Net interest margin was 3.03%, up five basis points compared to the prior year.\n•\nAverage earning assets decreased $21.6 billion, or 4.4%, compared to the prior year primarily due to declines in average total loans of $15.8 billion, or 4.9%, and average securities of $13.7 billion, or 10.0%, partially offset by an increase in other earning assets of $7.3 billion, or 25%. The change in average securities was driven by maturities and the balance sheet repositioning. The change in other earning assets (increase in balances held at the Federal Reserve) was driven by the balance sheet repositioning.\n•\nThe yield on the average total loan portfolio was 6.34% for 2024, up 22 basis points, compared to the prior year primarily reflecting higher market interest rates. The yield on the average securities portfolio was 2.83% for 2024, up 60 basis points compared to the prior year, reflecting the balance sheet repositioning and reinvesting cash flows into higher yielding securities.\n•\nAverage deposits decreased $13.3 billion, or 3.3%, average short-term borrowings were flat, and average long-term debt decreased $13.0 billion, or 26% due to decreased funding needs.\n•\nThe average cost of total deposits was 2.02% for 2024, up 42 basis points compared to the prior year. The average cost of short-term borrowings was 5.36% for 2024, up 11 basis points compared to the prior year. The average cost of long-term debt was 4.94% for 2024, up 48 basis points compared to the prior year. The increases in rates on deposits and other funding sources was largely attributable to the repricing of lower cost funding sources.\nThe major components of net interest income and the related annualized yields as well as the variances between the periods caused by changes in interest rates versus changes in volumes are summarized below.\n50   Truist Financial Corporation\nTable 9: Taxable-Equivalent Net Interest Income and Rate / Volume Analysis\n2024 vs. 2023\n2023 vs. 2022\nYear Ended December 31,\n(Dollars in millions)\nAverage Balances\n(1)\nAnnualized Yield/Rate\n(2)\nIncome/Expense\n(2)\nIncr.\n(Decr.)\nChange due to\nIncr.\n(Decr.)\nChange due to\n2024\n2023\n2022\n2024\n2023\n2022\n2024\n2023\n2022\nRate\nVolume\nRate\nVolume\nAssets\n \n \n \n \n \n \n \n \n \nAFS and HTM securities at amortized cost:\n \n \n \n \n \n \n \n \n \nU.S. Treasury\n$\n12,100 \n$\n11,021 \n$\n10,591 \n4.01 \n%\n1.20 \n%\n0.88 \n%\n$\n485 \n$\n132 \n$\n93 \n$\n353 \n$\n339 \n$\n14 \n$\n39 \n$\n35 \n$\n4 \nGSE\n390 \n348 \n498 \n3.38 \n2.94 \n2.24 \n13 \n10 \n11 \n3 \n2 \n1 \n(1)\n3 \n(4)\nAgency MBS\n109,652 \n121,923 \n132,222 \n2.70 \n2.31 \n1.93 \n2,958 \n2,821 \n2,552 \n137 \n441 \n(304)\n269 \n477 \n(208)\nStates and political subdivisions\n417 \n424 \n392 \n4.14 \n4.13 \n3.88 \n17 \n18 \n15 \n(1)\n— \n(1)\n3 \n1 \n2 \nNon-agency MBS\n1,282 \n3,816 \n4,072 \n2.85 \n2.34 \n2.30 \n37 \n89 \n94 \n(52)\n16 \n(68)\n(5)\n2 \n(7)\nOther\n17 \n20 \n44 \n5.25 \n5.37 \n3.60 \n1 \n1 \n2 \n— \n— \n— \n(1)\n1 \n(2)\nTotal securities\n123,858 \n137,552 \n147,819 \n2.83 \n2.23 \n1.87 \n3,511 \n3,071 \n2,767 \n440 \n798 \n(358)\n304 \n519 \n(215)\nInterest earning trading assets\n5,320 \n4,739 \n5,767 \n6.12 \n6.64 \n4.15 \n326 \n314 \n239 \n12 \n(26)\n38 \n75 \n124 \n(49)\nOther earning assets\n(3)\n36,622 \n29,335 \n19,886 \n5.48 \n5.31 \n1.92 \n2,008 \n1,557 \n381 \n451 \n51 \n400 \n1,176 \n927 \n249 \nLoans and leases, net of unearned income:\n \n \n \n \n \nCommercial and industrial\n155,674 \n163,983 \n149,030 \n6.36 \n6.34 \n3.91 \n9,897 \n10,389 \n5,823 \n(492)\n33 \n(525)\n4,566 \n3,931 \n635 \nCRE\n21,585 \n22,741 \n22,697 \n6.81 \n6.71 \n4.01 \n1,480 \n1,535 \n920 \n(55)\n22 \n(77)\n615 \n613 \n2 \nCommercial Construction\n7,729 \n6,125 \n5,326 \n7.67 \n7.62 \n4.46 \n583 \n459 \n228 \n124 \n3 \n121 \n231 \n191 \n40 \nResidential mortgage\n54,486 \n56,131 \n51,721 \n3.88 \n3.78 \n3.60 \n2,114 \n2,121 \n1,860 \n(7)\n55 \n(62)\n261 \n96 \n165 \nHome equity\n9,778 \n10,388 \n10,788 \n7.94 \n7.36 \n5.01 \n776 \n765 \n540 \n11 \n57 \n(46)\n225 \n246 \n(21)\nIndirect auto\n22,326 \n25,621 \n27,197 \n7.00 \n6.10 \n5.50 \n1,563 \n1,563 \n1,497 \n— \n215 \n(215)\n66 \n156 \n(90)\nOther consumer\n28,748 \n28,412 \n26,320 \n8.18 \n7.25 \n6.23 \n2,351 \n2,061 \n1,640 \n290 \n265 \n25 \n421 \n284 \n137 \nStudent\n— \n2,453 \n6,114 \n— \n6.91 \n4.97 \n— \n170 \n304 \n(170)\n(85)\n(85)\n(134)\n91 \n(225)\nCredit card\n4,907 \n4,876 \n4,753 \n11.96 \n11.59 \n9.57 \n587 \n565 \n455 \n22 \n18 \n4 \n110 \n98 \n12 \nTotal loans and leases HFI\n305,233 \n320,730 \n303,946 \n6.34 \n6.12 \n4.36 \n19,351 \n19,628 \n13,267 \n(277)\n583 \n(860)\n6,361 \n5,706 \n655 \nLHFS\n1,305 \n1,605 \n2,889 \n6.31 \n6.37 \n4.23 \n82 \n102 \n122 \n(20)\n(1)\n(19)\n(20)\n47 \n(67)\nTotal loans and leases\n306,538 \n322,335 \n306,835 \n6.34 \n6.12 \n4.36 \n19,433 \n19,730 \n13,389 \n(297)\n582 \n(879)\n6,341 \n5,753 \n588 \nTotal earning assets\n472,338 \n493,961 \n480,307 \n5.35 \n4.99 \n3.49 \n25,278 \n24,672 \n16,776 \n606 \n1,405 \n(799)\n7,896 \n7,323 \n573 \nNonearning assets\n51,185 \n51,554 \n56,666 \n \n \n \n \n \n \n \n \nAssets of discontinued operations\n2,542 \n7,617 \n6,857 \nTotal assets\n$\n526,065 \n$\n553,132 \n$\n543,830 \n \n \n \n \n \n \n \n \nLiabilities and Shareholders’ Equity\n \n \n \n \n \n \n \n \n \n \nInterest-bearing deposits:\n \n \n \n \n \n \n \n \n \n \nInterest-checking\n$\n104,606 \n$\n103,465 \n$\n111,539 \n2.68 \n2.11 \n0.47 \n2,802 \n2,184 \n519 \n618 \n594 \n24 \n1,665 \n1,706 \n(41)\nMoney market and savings\n136,217 \n138,841 \n145,645 \n2.54 \n2.04 \n0.37 \n3,457 \n2,834 \n536 \n623 \n677 \n(54)\n2,298 \n2,324 \n(26)\nTime deposits\n39,406 \n36,803 \n15,514 \n4.04 \n3.83 \n0.58 \n1,590 \n1,409 \n90 \n181 \n79 \n102 \n1,319 \n1,059 \n260 \nTotal interest-bearing deposits\n280,229 \n279,109 \n272,698 \n2.80 \n2.30 \n0.42 \n7,849 \n6,427 \n1,145 \n1,422 \n1,350 \n72 \n5,282 \n5,089 \n193 \nShort-term borrowings\n24,499 \n24,478 \n14,957 \n5.36 \n5.25 \n2.58 \n1,313 \n1,286 \n385 \n27 \n26 \n1 \n901 \n558 \n343 \nLong-term debt\n36,713 \n49,678 \n34,172 \n4.94 \n4.46 \n2.31 \n1,813 \n2,215 \n791 \n(402)\n220 \n(622)\n1,424 \n958 \n466 \nTotal interest-bearing liabilities\n341,441 \n353,265 \n321,827 \n3.21 \n2.81 \n0.72 \n10,975 \n9,928 \n2,321 \n1,047 \n1,596 \n(549)\n7,607 \n6,605 \n1,002 \nNoninterest-bearing deposits\n107,639 \n122,018 \n145,392 \n \n \n \n \n \n \n \n \n \n \nOther liabilities\n13,343 \n11,560 \n9,994 \n \n \n \n \n \n \n \n \n \n \n \nLiabilities of discontinued operations\n1,049 \n3,190 \n2,800 \nShareholders’ equity\n62,593 \n63,099 \n63,817 \n \n \n \n \n \n \n \n \n \n \n \nTotal liabilities and shareholders’ equity\n$\n526,065 \n$\n553,132 \n$\n543,830 \n \n \n \n \n \n \n \n \n \n \n \nAverage interest-rate spread\n \n \n2.14 \n%\n2.18 \n%\n2.77 \n%\n \n \n \n \n \n \n \n \nNIM/net interest income - TE\n \n \n3.03 \n%\n2.98 \n%\n3.01 \n%\n$\n14,303 \n$\n14,744 \n$\n14,455 \n$\n(441)\n$\n(191)\n$\n(250)\n$\n289 \n$\n718 \n$\n(429)\nTaxable-equivalent adjustment\n \n \n \n \n$\n212 \n$\n220 \n$\n142 \n \n \n \nMemo: Total deposits\n$\n387,868 \n$\n401,127 \n$\n418,090 \n2.02 \n%\n1.60 \n%\n0.27 \n%\n$\n7,849 \n$\n6,427 \n$\n1,145 \n$\n1,422 \n$\n5,282 \n(1)\nRepresents daily average balances. Unrealized gains and losses on available-for-sale securities are included in nonearning assets. Active hedge basis adjustments for fair value hedges are included in nonearning assets and other liabilities. In 2024, Truist revised its presentation of active hedge basis adjustments for fair value hedges on securities to be included in nonearning assets for all periods presented.\n(2)\nYields are stated on a TE basis utilizing a federal tax rate of 21%. Interest income includes certain fees, deferred costs, and dividends. The change in interest not solely due to changes in rate or volume has been allocated based on the pro-rata absolute dollar amount of each.\n(3)\nIncludes cash equivalents, interest-bearing deposits with banks, FHLB stock, and other earning assets.\nTruist Financial Corporation   51\nProvision for Credit Losses\nThe provision for credit losses was $1.9 billion for the year ended December 31, 2024 compared to $2.1 billion for the year ended December 31, 2023. The net charge-off ratio for the current year of 0.59% was up 9 basis points compared to the prior year.\n•\nThe decrease in the current year provision expense primarily reflects a lower allowance build.\n•\nThe net charge-off ratio was up compared to the prior year driven by higher net charge-offs in the CRE, other consumer, credit card, and indirect auto portfolios, partially offset by higher recoveries in the commercial and industrial portfolio. Additionally, the prior year included $98 million of charge-offs related to the sale of the student loan portfolio.\nRefer to “Note 5. Loans and ACL” for additional discussion of the ACL.\nNoninterest Income\nNoninterest income is a significant contributor to Truist’s financial results. Management focuses on diversifying its sources of revenue to reduce Truist’s reliance on traditional spread-based interest income, as certain fee-based activities are a relatively stable revenue source during periods of changing interest rates. The following table provides a breakdown of Truist’s noninterest income:\nTable 10: Noninterest Income\nYear Ended December 31,\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nWealth management income\n$\n1,412 \n$\n1,358 \n$\n1,338 \n4.0 \n%\n1.5 \n%\nInvestment banking and trading income\n1,203 \n822 \n995 \n46.4 \n(17.4)\nCard and payment related fees\n907 \n936 \n944 \n(3.1)\n(0.8)\nService charges on deposits\n915 \n873 \n1,028 \n4.8 \n(15.1)\nMortgage banking income\n432 \n437 \n460 \n(1.1)\n(5.0)\nLending related fees\n366 \n447 \n375 \n(18.1)\n19.2 \nOperating lease income\n205 \n254 \n258 \n(19.3)\n(1.6)\nSecurities gains (losses)\n(6,651)\n— \n(71)\nNM\nNM\nOther income\n398 \n371 \n333 \n7.3 \n11.4 \nTotal noninterest income\n$\n(813)\n$\n5,498 \n$\n5,660 \n(114.8)\n(2.9)\nNoninterest income was down $6.3 billion for the year ended December 31, 2024 compared to the year ended December 31, 2023 primarily due to $6.7 billion of securities losses resulting from the balance sheet repositioning, lower lending related fees, operating lease income, and card and payment related fees, partially offset by higher investment banking and trading income, wealth management income, service charges on deposits, and other income. Excluding securities losses, noninterest income was up $340 million, or 6.2%, compared to the prior year.\n•\nInvestment banking and trading income increased due to higher bond and equity originations, structured real estate income, loan syndication fees, and merger and acquisition fees, partially offset by lower trading income.\n•\nWealth management income increased due to higher assets under management, partially offset by the impact of the sale of Sterling Capital Management LLC in 2024.\n•\nService charges on deposits increased due to a prior period reduction in deposit service charge fees for client refund accruals resulting from a revision in deposit service fee protocols, partially offset by a decline as a result of continued growth of Truist One checking.\n•\nOther income increased due to higher derivative income and the gain on the sale of Sterling Capital Management LLC, partially offset by lower equity investment income due to gains in 2023 and a valuation decrease for derivatives related to Visa shares.\n•\nLending related fees decreased due to lower leasing-related gains.\n•\nOperating lease income decreased due to the runoff of operating lease balances.\n•\nCard and payment related fees decreased due to lower interchange rates, higher rebates, and lower volumes.\n52   Truist Financial Corporation\nNoninterest Expense\nThe following table provides a breakdown of Truist’s noninterest expense:\nTable 11: Noninterest Expense\nYear Ended December 31,\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nPersonnel expense\n$\n6,506 \n$\n6,516 \n$\n6,558 \n(0.2)\n%\n(0.6)\n%\nProfessional fees and outside processing\n1,337 \n1,192 \n1,322 \n12.2 \n(9.8)\nSoftware expense\n896 \n868 \n887 \n3.2 \n(2.1)\nNet occupancy expense\n656 \n658 \n690 \n(0.3)\n(4.6)\nEquipment expense\n373 \n381 \n449 \n(2.1)\n(15.1)\nAmortization of intangibles\n345 \n395 \n455 \n(12.7)\n(13.2)\nMarketing and customer development\n268 \n260 \n321 \n3.1 \n(19.0)\nOperating lease depreciation\n144 \n175 \n184 \n(17.7)\n(4.9)\nRegulatory costs\n344 \n824 \n183 \n(58.3)\nNM\nRestructuring charges\n120 \n320 \n466 \n(62.5)\n(31.3)\nGoodwill impairment\n— \n6,078 \n— \n(100.0)\nNM\nOther expense\n1,020 \n1,011 \n652 \n0.9 \n55.1 \nTotal noninterest expense\n$\n12,009 \n$\n18,678 \n$\n12,167 \n(35.7)\n53.5 \nRestructuring Charges\nNoninterest expense was down $6.7 billion, or 36%, for the year ended December 31, 2024 compared to the year ended December 31, 2023 primarily due to the 2023 goodwill impairment of $6.1 billion, lower regulatory charges due to the FDIC special assessment and related adjustments ($64 million in 2024 compared to $507 million in 2023), lower other expense, excluding the charitable contribution to the Truist Foundation, lower amortization of intangibles, and operating lease depreciation, partially offset by a $150 million charitable contribution to the Truist Foundation (other expense) and higher professional fees and outside processing expense. Restructuring charges decreased $200 million; both periods included restructuring charges for severance charges as well as facilities optimization costs. Noninterest expenses excluding the charitable contribution, the amortization of intangibles, the FDIC special assessment adjustment, restructuring charges, and a small loss on the early extinguishment of debt, decreased $44 million, or 0.4%.\n•\nOther expense, excluding the aforementioned charitable contribution to the Truist Foundation, decreased primarily due to lower pension expense, the prior period costs associated with a revision in deposit service fee protocols, and the prior period resolution of the USAA remote deposit capture patent infringement lawsuit.\n•\nOperating lease depreciation decreased due to the runoff of operating lease balances.\n•\nProfessional fees and outside processing expense increased due to higher investments in technology and risk infrastructure.\nTruist has incurred certain restructuring charges, which include:\n•\nseverance and personnel-related costs or credits;\n•\noccupancy and equipment charges or credits, which relate to costs or gains associated with lease terminations, obsolete equipment write-offs, and the sale of duplicate facilities and equipment;\n•\nprofessional services, which relate to legal and investment banking advisory fees and other consulting services pertaining to restructuring initiatives or transactions; and\n•\nwrite-offs related to exiting certain businesses.\nRestructuring accruals are established when the costs are incurred or once all requirements for a plan to dispose of or outsource certain business functions have been approved by management. Restructuring accruals are re-evaluated periodically and adjusted as necessary. The remaining accruals at December 31, 2024 are generally expected to be utilized within one year, unless they relate to specific contracts that expire later.\nTruist Financial Corporation   53\nThe following table presents a summary of restructuring charges and the related accruals. The 2024 and 2023 restructuring charges predominantly include costs for severance and other benefits and costs related to exiting facilities.\nTable 12: Restructuring Accrual Activity\n(Dollars in millions)\nAccrual at Jan 1, 2023\nExpense\nUtilized\nAccrual at Dec 31, 2023\nExpense\nUtilized\nAccrual at Dec 31, 2024\nSeverance and personnel-related\n$\n6 \n$\n249 \n$\n(247)\n$\n8 \n$\n80 \n$\n(88)\n$\n— \nOccupancy and equipment\n— \n52 \n(52)\n— \n31 \n(31)\n— \nProfessional services\n11 \n2 \n(13)\n— \n6 \n(5)\n1 \nOther\n2 \n17 \n(19)\n— \n3 \n(3)\n— \nTotal\n$\n19 \n$\n320 \n$\n(331)\n$\n8 \n$\n120 \n$\n(127)\n$\n1 \nSegment Results\nTruist operates and measures business activity across two segments: CSBB and WB, with functional activities included in OT&C. The Company’s business segment structure is based on the manner in which financial information is evaluated by management as well as the products and services provided or the type of client served.\nEffective January 1, 2024, several business activities were realigned reflecting updates to the Company’s operating structure. First, the CB&W segment was renamed CSBB and the C&CB segment was renamed WB. Second, the Wealth business was realigned into the WB segment from the CSBB segment, representing a separate reporting unit in that segment. Third, the small business banking client segmentation was realigned into the CSBB segment from the WB segment.\nOn February 20, 2024, the Company entered into an agreement to sell the remaining stake of the common equity in TIH to an investor group, representing substantially all of the Company’s IH segment, which represented a material strategic shift for the Company, and as a result, the Company recast results for all periods presented under the discontinued operations basis of presentation. On May 6, 2024, the Company completed the sale of its remaining equity interests in TIH. TIH was the principal legal entity of the IH segment. As the operations of TIH were included in discontinued operations prior to the sale of TIH, the Company no longer presents the IH segment as one of its reportable segments. Refer to “Note 2. Discontinued Operations” for additional information related to discontinued operations.\nEffective October 1, 2024, the Company’s corporate expense allocation methodology was enhanced to allocate certain overhead or functional expenses based on actual OT&C noninterest expense performance. Prior period results have been revised for the CSBB, WB, and OT&C segments to conform to the current allocation methodology.\nAs a result of the methodology change, CSBB noninterest expense increased $267 million and $639 million for the years ended December 31, 2023 and 2022, respectively, with an off-setting decrease in OT&C noninterest expense. For the same reason, WB noninterest expense increased $325 million and $101 million for the years ended December 31, 2023 and 2022, respectively, with an off-setting decrease in OT&C noninterest expense.\nTable 13: Net Income from Continuing Operations by Reportable Segment\n \nYear Ended December 31,\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024 vs. 2023\n2023 vs. 2022\nConsumer and Small Business Banking\n$\n3,490 \n$\n126 \n$\n3,228 \nNM\n(96.1)\n%\nWholesale Banking\n3,984 \n346 \n4,446 \nNM\n(92.2)\nOther, Treasury & Corporate\n(7,519)\n(1,975)\n(1,895)\nNM\n4.2 \nTruist Financial Corporation\n$\n(45)\n$\n(1,503)\n$\n5,779 \n(97.0)\n(126.0)\n54   Truist Financial Corporation\n2024 compared to 2023\nConsumer and Small Business Banking\nCSBB net income was $3.5 billion for the year ended December 31, 2024, an increase of $3.4 billion compared to the prior year.\n•\nSegment net interest income decreased $106 million primarily driven by lower loan and deposit balances, partially offset by higher funding credit on deposits.\n•\nThe allocated provision for credit losses increased $192 million primarily reflecting higher charge-offs in the other consumer, credit card, and indirect auto portfolios and an allowance build in the current period compared to same period last year.\n•\nNoninterest income increased $30 million primarily due to increased service charges on deposits, partially offset by lower card and payment related fees in the current period.\n•\nNoninterest expense decreased $3.6 billion including the goodwill impairment in the prior year. Excluding the goodwill impairment, noninterest expense decreased $271 million due to lower personnel expenses, FDIC assessment cost, restructuring charges, pension costs, and technology project costs, as well as lower foreclosed property expense, partially offset by higher enterprise operations, marketing, and finance support expenses.\nCSBB average loans and leases held for investment decreased $8.0 billion, or 6.0%, for the year ended December 31, 2024 compared to the prior year driven primarily by a decrease in indirect auto loans, the sale of the student loan portfolio in the second quarter of 2023, and lower mortgage loan balances as well as a decrease in LightStream loans and home equity lending, partially offset by increases in Service Finance and Sheffield loans.\nCSBB average total deposits decreased $7.3 billion, or 3.3%, for the year ended December 31, 2024 compared to the prior year primarily due to decreases in average interest-bearing checking, noninterest-bearing deposits, and money market and savings, partially offset by an increase in time deposits.\nWholesale Banking\nWB net income was $4.0 billion for the year ended December 31, 2024, an increase of $3.6 billion compared to the prior year.\n•\nSegment net interest income decreased $354 million primarily due to lower deposit and loan balances combined with higher cost of deposits and lower loan yields, partially offset by higher funding credit on deposits.\n•\nThe allocated provision for credit losses decreased $437 million, which primarily reflects a decrease in the allowance build compared to the earlier period, partially offset by an increase in net charge-offs.\n•\nNoninterest income increased $451 million primarily due to increases in investment banking income across all products, income from tax credit activity, and wealth management related income, partially offset by lower lending related fees, operating lease income, and income from strategic investments.\n•\nNoninterest expense decreased $3.4 billion including the goodwill impairment in the prior year. Excluding the goodwill impairment, noninterest expense decreased $654 million primarily due to lower FDIC assessment cost, restructuring expense, pension costs, and personnel expenses as well as lower marketing and finance support expenses.\nWB average loans and leases held for investment decreased $7.5 billion, or 4.0%, for the year ended December 31, 2024 compared to the prior year driven by decreases in the commercial and industrial portfolio.\nWB average total deposits decreased $6.4 billion, or 4.3%, for the year ended December 31, 2024 compared to the prior year primarily due to decreases in average noninterest-bearing deposits and money market and savings, partially offset by an increase in interest-bearing checking balances.\nOther, Treasury, and Corporate\nOT&C generated a net loss of $7.5 billion for the year ended December 31, 2024, compared to a net loss of $2.0 billion in the prior year.\n•\nSegment net interest income increased $27 million due to funding charges primarily on loans to other segments, the balance sheet repositioning, and lower average long-term debt, partially offset by the funding credit on deposits to other segments.\n•\nNoninterest income decreased $6.8 billion primarily due to securities losses resulting from the balance sheet repositioning.\n•\nNoninterest expense increased $334 million primarily driven by higher incentive expense, higher donations and contributions expense due to a charitable contribution to the Truist Foundation, and increased professional fees and outside processing expense, partially offset by lower pension costs and increased credit from other segments for enterprise operations.\nTruist Financial Corporation   55\nAnalysis of Financial Condition\nInvestment Activities\nTruist’s investment policy is approved and carried out by ALCO, which meets regularly to review the economic environment and establish investment strategies. The ALCO also has much broader responsibilities, which are discussed in the “Market Risk” section in MD&A.\nInvestment strategies are reviewed by the ALCO based on the interest rate environment, balance sheet mix, actual and anticipated loan demand, funding opportunities, and the overall interest rate sensitivity of the Company. In general, the goals of the investment portfolio are: (i) to provide sufficient liquid assets to meet unanticipated deposit and loan fluctuations and overall corporate treasury objectives; (ii) to provide eligible securities to secure public funds, trust deposits, and other borrowings; and (iii) to earn an optimal return on funds invested commensurate with meeting regulatory requirements, consistent with the Company’s risk appetite.\nTruist Bank invests in securities allowable under bank regulations. These securities may include obligations of the U.S. Treasury, U.S. government agencies, GSEs (including MBS), bank eligible obligations of any state or political subdivision, non-agency MBS, structured notes, bank eligible corporate obligations (including corporate debentures), commercial paper, negotiable CDs, bankers’ acceptances, mutual funds, and limited types of equity securities.\nTable 14: Composition of Securities Portfolio\n(Dollars in millions)\nDec 31, 2024\nDec 31, 2023\nAFS securities (at fair value):\nU.S. Treasury\n$\n14,411 \n$\n10,041 \nGSE\n403 \n362 \nAgency MBS – residential\n49,959 \n51,289 \nAgency MBS – commercial\n2,293 \n2,248 \nStates and political subdivisions\n382 \n425 \nNon-agency MBS\n— \n2,981 \nOther\n16 \n20 \nTotal AFS securities\n67,464 \n67,366 \nHTM securities (at amortized cost):\n \n \nAgency MBS – residential\n50,640 \n54,107 \nTotal securities\n$\n118,104 \n$\n121,473 \nThe securities portfolio totaled $118.1 billion at December 31, 2024, compared to $121.5 billion at December 31, 2023. U.S. Treasury, GSE, and Agency MBS represented 99.7% and 97.2% of the total securities portfolio as of December 31, 2024 and December 31, 2023, respectively. The overwhelming majority of the portfolio is in agency MBS securities.\n•\nThe decrease in 2024 includes sales of $28.1 billion and maturities and paydowns of $18.7 billion, partially offset by $44.7 billion in purchases. The purchases and sales were primarily related to the balance sheet repositioning.\n◦\nFollowing the sale of TIH, which resulted in after-tax cash proceeds to Truist of approximately $10.1 billion, Truist executed a strategic balance sheet repositioning of a portion of its AFS investment securities portfolio by selling $27.7 billion of lower-yielding investment securities, resulting in an after-tax loss of $5.1 billion in the second quarter of 2024. The investment securities that were sold had a book value of $34.4 billion and a weighted average book yield of 2.80% for the remainder of 2024 including the impact of hedges and based on the Federal Funds futures curve at the time. Including the tax benefit, the repositioning generated $29.3 billion available for reinvestment.\n◦\nTruist invested approximately $18.7 billion of the $39.4 billion available, including the $10.1 billion after-tax proceeds from the sale of TIH, in shorter duration investment securities yielding 5.27%. The remaining $20.7 billion was invested in cash. The blended reinvestment rate on the new investment securities purchased and cash was 5.22% for the remainder of 2024 including the impact of hedges and based on the Federal Funds futures curve at the time.\n•\nAs of December 31, 2024 and December 31, 2023, 41% of the investment securities portfolio was classified as held-to-maturity based on amortized cost, excluding portfolio level basis adjustments.\n•\nAs of December 31, 2024, approximately 3.0% of the securities portfolio was variable rate, excluding the impact of swaps, compared to 5.7% as of December 31, 2023.\n•\nThe effective duration of the AFS securities portfolio was 5.0 years at December 31, 2024 and 6.1 years at December 31, 2023, excluding the impact of swaps, or 3.3 years at December 31, 2024 and 4.0 years at December 31, 2023, including the impact of swaps. The effective duration of the HTM securities portfolio was 7.0 years at December 31, 2024 and 7.3 years at December 31, 2023.\n56   Truist Financial Corporation\nThe following table presents the securities portfolio by major category of security holdings with ranges of maturities and average yields:\nTable 15: Securities Yields by Major Category and Maturity\nDecember 31, 2024\n(Dollars in millions)\nAFS\nHTM\nFair Value\nEffective Yield\n(1)\nAmortized Cost\nEffective Yield\n(1)\nU.S. Treasury:\n \n \n \n \nWithin one year\n$\n4,512 \n4.84 \n%\n$\n— \n— \n%\nOne to five years\n9,480 \n4.45 \n— \n— \nFive to ten years\n397 \n3.60 \n— \n— \nAfter ten years\n22 \n3.02 \n— \n— \nTotal\n14,411 \n4.55 \n— \n— \nGSE:\n \n \n \n \nWithin one year\n2 \n3.00 \n— \n— \nOne to five years\n5 \n2.88 \n— \n— \nFive to ten years\n11 \n3.05 \n— \n— \nAfter ten years\n385 \n3.78 \n— \n— \nTotal\n403 \n3.74 \n— \n— \nAgency MBS – residential:\n(2)\n \n \n \n \nOne to five years\n88 \n2.44 \n— \n— \nFive to ten years\n365 \n2.88 \n— \n— \nAfter ten years\n49,506 \n3.90 \n50,640 \n1.79 \nTotal\n49,959 \n3.89 \n50,640 \n1.79 \nAgency MBS – commercial:\n(2)\nWithin one year\n— \n— \n— \n— \nOne to five years\n9 \n4.40 \n— \n— \nFive to ten years\n78 \n3.69 \n— \n— \nAfter ten years\n2,206 \n1.99 \n— \n— \nTotal\n2,293 \n2.05 \n— \n— \nStates and political subdivisions:\n \n \n \n \nWithin one year\n41 \n6.80 \n— \n— \nOne to five years\n68 \n6.84 \n— \n— \nFive to ten years\n146 \n6.60 \n— \n— \nAfter ten years\n127 \n5.45 \n— \n— \nTotal\n382 \n6.28 \n— \n— \nOther:\n \n \n \n \nOne to five years\n7 \n2.87 \n— \n— \nFive to ten years\n9 \n6.51 \n— \n— \nTotal\n16 \n4.88 \n— \n— \nTotal securities\n$\n67,464 \n3.98 \n$\n50,640 \n1.79 \n(1)\nYields represent interest computed using the effective interest method on the amortized cost of securities inclusive of amortization of premiums or accretion of discounts, excluding the impact of hedging. Weighted yield is represented on a TE basis with the exception of obligations of state and political subdivisions which are presented on a tax-effected basis.\n(2)\nFor purposes of the maturity, MBS, which are not due at a single maturity date, have been included in maturity groupings based on the contractual maturity. The expected life of MBS will differ from contractual maturities because borrowers may have the right to call or prepay the underlying mortgage loans with or without call or prepayment penalties.\nLending Activities\nTruist strives to meet the credit needs of its clients while pursuing a balanced strategy of loan profitability, loan growth, and loan quality. Management believes that this purpose can best be accomplished by building strong client relationships over time and developing in-depth local market knowledge. The Company employs underwriting criteria governing the degree of risk assumed and the diversity of the loan portfolio in terms of type, industry, and geographical concentration.\nTruist lends to a diverse client base that is managed to be geographically dispersed to mitigate concentration risk arising from local and regional economic downturns. The following discussion provides additional information on the Company’s loan and lease portfolios. Refer to the “Risk Management” section for a discussion of the credit risk management policies used to manage the portfolios.\nTruist Financial Corporation   57\nCommercial Loan and Lease Portfolio\nCommercial loans and leases represent the largest category of the Company’s loan and lease portfolio. Commercial Community Banking and small business banking generally target small-to-middle market businesses with annual sales between $2 million and $500 million, while Investment Banking and Capital Markets (formerly Corporate and Investment Banking) provides lending solutions to large corporate clients. The commercial loan and lease portfolio consists of lending to public and private business clients and includes commercial and industrial, owner occupied, equipment leasing and financing, CRE, government and institutional financing, premium financing, and dealer floor plan financing.\nIn accordance with the Company’s lending policy, each commercial loan undergoes a detailed underwriting process. Commercial loans are typically priced with an interest rate tied to market indices, such as the prime rate or SOFR and are individually monitored and reviewed for deterioration in the ability of the client to repay the loan. The majority of Truist’s commercial loans are secured by real estate, business equipment, inventories, and other types of collateral.\nResidential Mortgage Loan Portfolio\nTruist primarily originates conforming mortgage loans, loans under FHA, U.S. Department of Veterans Affairs, or U.S. Department of Agriculture programs, and higher quality jumbo and construction-to-permanent loans for 1-4 family residential properties. Conforming loans are loans that are underwritten in accordance with the underwriting standards set forth by FNMA and FHLMC. They are generally collateralized by one-to-four-family residential real estate, typically have loan-to-collateral value ratios of 80% or less at origination, or have mortgage insurance as required by investors and are made to borrowers that meet Truist’s credit standards.\nRisks associated with mortgage lending include interest rate risk, which is mitigated through the sale of a substantial portion of conforming fixed-rate loans in the secondary mortgage market and an effective MSR hedging process. Credit risk is managed through underwriting procedures and mortgage insurance. The right to service the loans and receive servicing income is generally retained when conforming loans are sold. Management believes that the retention of mortgage servicing diversifies income while enabling Truist to build long-term client relationships and offer high quality client service. Truist also purchases residential mortgage loans from correspondent originators. The loans purchased from third-party originators are subject to substantially the same underwriting and risk-management criteria as loans originated internally.\nHome Equity Loan Portfolio\nThe home equity portfolio is composed of loans offered through Truist’s branch network. These include home equity loans and revolving home equity lines of credit secured by first or second liens on residential real estate in Truist’s market areas.\nIndirect Auto Loan Portfolio\nThe indirect auto portfolio primarily includes secured indirect installment loans to consumers for the purchase of new and used automobiles. The indirect auto portfolio also includes nonprime and near prime automobile finance. Such loans are originated through approved franchised and independent dealers throughout the Truist market area and nationally through Regional Acceptance Corporation. These loans are homogeneous, and no single loan is individually significant in terms of its size and potential risk of loss. Indirect auto loans are subject to lending policies and procedures and are underwritten with note amounts and credit limits that are consistent with the Company’s risk philosophy. In addition to its normal underwriting due diligence, Truist uses application systems and scoring systems to help underwrite and manage the credit risk in its indirect auto portfolio.\nOther Consumer Loan Portfolio\nThe other consumer portfolio includes loans originated through the Truist branch network, as well as loans originated by Truist’s national online consumer lending platforms. The other consumer loan portfolio includes: secured and unsecured loans originated through the Truist branch network marketed to qualifying clients and other creditworthy candidates in Truist’s market areas; LightStream, an online platform which originates fixed-rate, unsecured lending to consumers with strong credit; secured indirect installment loans to consumers for the purchase of new and used boats and recreational vehicles; Sheffield, a small ticket consumer lending division related to the purchase of power sports and outdoor power equipment; other indirect and point-of-sale lending to consumers, including through Service Finance, to finance home improvements, furniture purchases, certain elective health-care services; and unsecured loans originated via third-party partnerships, which are in run-off. These loans are homogeneous, and no single loan is individually significant in terms of its size and potential risk of loss. These loans are originated in accordance with underwriting criteria as determined by Truist.\n58   Truist Financial Corporation\nCredit Card Loan Portfolio\nThe credit card portfolio consists of the outstanding balances on credit cards for commercial and consumer clients. Truist markets credit cards to its existing client base and does not solicit cardholders through nationwide programs or other forms of mass marketing. Such balances are generally unsecured and actively managed.\nRefer to “Note 5. Loans and ACL” for additional information.\nThe following table summarizes the loan portfolio:\nTable 16: Loans and Leases as of Period End\n(Dollars in millions)\nDec 31, 2024\nDec 31, 2023\nCommercial:\nCommercial and industrial\n$\n154,848 \n$\n160,788 \nCRE\n20,363 \n22,570 \nCommercial construction\n8,520 \n6,683 \nConsumer:\nResidential mortgage\n55,599 \n55,492 \nHome equity\n9,642 \n10,053 \nIndirect auto\n23,089 \n22,727 \nOther consumer\n29,395 \n28,647 \nCredit card\n4,927 \n5,101 \nTotal loans and leases HFI\n306,383 \n312,061 \nLHFS\n1,388 \n1,280 \nTotal loans and leases\n$\n307,771 \n$\n313,341 \nLoans and leases HFI were $306.4 billion at December 31, 2024, down $5.7 billion compared to 2023.\nCommercial loans decreased $6.3 billion during 2024 primarily due to declines of $5.9 billion in the commercial and industrial portfolio and $2.2 billion in the CRE portfolio due to lower production, partially offset by an increase in the commercial construction portfolio of $1.8 billion.\nConsumer loans and credit cards increased $632 million during 2024 primarily due to a $748 million increase in other consumer primarily due to growth of higher-return point-of-sale lending portfolios (Service Finance and Sheffield), and a $362 million increase in indirect auto primarily due to higher production, partially offset by a $411 million decrease in home equity.\nTruist Financial Corporation   59\nThe following table presents a summary of the loans and leases by scheduled repayment period and interest rate terms. Determinations of maturities are based on scheduled repayments, except when rollovers or extensions are included for purposes of measuring the ACL. Truist’s credit policy typically does not permit automatic renewal of loans. At the scheduled maturity date (including balloon payment date), the client generally must request a new loan to replace the matured loan and execute either a new note or note modification with rate, terms, and conditions negotiated at that time.\nTable 17: Loan Maturities\nDecember 31, 2024\n(Dollars in millions)\n1 Year or Less\n1 to 5 Years\n5 to 15 Years\nAfter 15 Years\nTotal\nFixed rate:\n \n \n \nCommercial:\nCommercial and industrial\n$\n11,084 \n$\n14,377 \n$\n10,589 \n$\n2,111 \n$\n38,161 \nCRE\n858 \n2,161 \n401 \n3 \n3,423 \nCommercial construction\n19 \n42 \n22 \n38 \n121 \nTotal commercial\n11,961 \n16,580 \n11,012 \n2,152 \n41,705 \nConsumer:\nResidential mortgage\n1,560 \n6,276 \n17,113 \n23,743 \n48,692 \nHome equity\n313 \n956 \n1,604 \n409 \n3,282 \nIndirect auto\n5,514 \n15,958 \n1,617 \n— \n23,089 \nOther consumer\n5,580 \n13,784 \n6,611 \n857 \n26,832 \nTotal consumer\n12,967 \n36,974 \n26,945 \n25,009 \n101,895 \nCredit card\n266 \n— \n— \n— \n266 \nTotal fixed rate\n25,194 \n53,554 \n37,957 \n27,161 \n143,866 \nVariable rate:\n \n \n \nCommercial:\nCommercial and industrial\n32,888 \n73,617 \n8,234 \n1,948 \n116,687 \nCRE\n5,139 \n10,982 \n813 \n6 \n16,940 \nCommercial construction\n3,321 \n4,956 \n121 \n1 \n8,399 \nTotal commercial\n41,348 \n89,555 \n9,168 \n1,955 \n142,026 \nConsumer:\nResidential mortgage\n175 \n776 \n2,348 \n3,608 \n6,907 \nHome equity\n623 \n2,261 \n3,459 \n17 \n6,360 \nIndirect auto\n— \n— \n— \n— \n— \nOther consumer\n396 \n1,813 \n351 \n3 \n2,563 \nTotal consumer\n1,194 \n4,850 \n6,158 \n3,628 \n15,830 \nCredit card\n4,661 \n— \n— \n— \n4,661 \nTotal variable rate\n47,203 \n94,405 \n15,326 \n5,583 \n162,517 \nTotal loans and leases HFI\n$\n72,397 \n$\n147,959 \n$\n53,283 \n$\n32,744 \n$\n306,383 \nCertain residential mortgage loans have an initial period where the borrower is only required to pay the periodic interest. After the interest-only period, the loan will require the payment of both interest and principal over the remaining term. The outstanding balances of variable rate residential mortgage loans in the interest-only phase were approximately $647 million and $317 million at December 31, 2024 and December 31, 2023, respectively.\n60   Truist Financial Corporation\nThe following table presents the composition of average loans and leases:\nTable 18: Average Loans and Leases\nThree Months Ended\n(Dollars in millions)\nDec 31, 2024\nSep 30, 2024\nJun 30, 2024\nMar 31, 2024\nDec 31, 2023\nCommercial:\nCommercial and industrial\n$\n153,209 \n$\n154,102 \n$\n157,043 \n$\n158,385 \n$\n160,278 \nCRE\n20,504 \n21,481 \n21,969 \n22,400 \n22,755 \nCommercial construction\n8,261 \n7,870 \n7,645 \n7,134 \n6,515 \nConsumer:\nResidential mortgage\n54,390 \n53,999 \n54,490 \n55,070 \n55,658 \nHome equity\n9,675 \n9,703 \n9,805 \n9,930 \n10,104 \nIndirect auto\n22,790 \n22,121 \n22,016 \n22,374 \n23,368 \nOther consumer\n29,355 \n29,015 \n28,326 \n28,285 \n28,913 \nCredit card\n4,926 \n4,874 \n4,905 \n4,923 \n4,996 \nTotal average loans and leases HFI\n$\n303,110 \n$\n303,165 \n$\n306,199 \n$\n308,501 \n$\n312,587 \nAverage loans and leases HFI were flat compared to the prior quarter.\n•\nAverage commercial loans decreased 0.8% due to declines in the commercial and industrial and CRE portfolios.\n•\nAverage consumer loans and credit cards increased 1.2% due to growth in the indirect auto, residential mortgage, and other consumer portfolios.\nTruist Financial Corporation   61\nAsset Quality\nThe following tables summarize asset quality information:\nTable 19: Asset Quality\n(Dollars in millions)\nDec 31, 2024\nDec 31, 2023\nNPAs:\nNPLs:\nCommercial and industrial\n$\n521 \n$\n470 \nCRE\n298 \n284 \nCommercial construction\n3 \n24 \nResidential mortgage\n166 \n153 \nHome equity\n116 \n122 \nIndirect auto\n259 \n268 \nOther consumer\n66 \n59 \nTotal NPLs HFI\n1,429 \n1,380 \nLoans held for sale\n— \n51 \nTotal nonperforming loans and leases\n1,429 \n1,431 \nForeclosed real estate\n3 \n3 \nOther foreclosed property\n45 \n54 \nTotal nonperforming assets\n$\n1,477 \n$\n1,488 \nLoans 90 days or more past due and still accruing:\nCommercial and industrial\n$\n19 \n$\n7 \nCRE\n1 \n— \nCommercial construction\n— \n1 \nResidential mortgage – government guaranteed\n430 \n418 \nResidential mortgage – nonguaranteed\n51 \n21 \nHome equity\n9 \n11 \nIndirect auto\n— \n2 \nOther consumer\n23 \n21 \nCredit card\n54 \n53 \nTotal loans 90 days or more past due and still accruing\n$\n587 \n$\n534 \nLoans 30-89 days past due and still accruing:\nCommercial and industrial\n$\n168 \n$\n230 \nCRE\n60 \n5 \nCommercial construction\n3 \n— \nResidential mortgage – government guaranteed\n318 \n326 \nResidential mortgage – nonguaranteed\n401 \n313 \nHome equity\n60 \n70 \nIndirect auto\n622 \n669 \nOther consumer\n236 \n271 \nCredit card\n81 \n87 \nTotal loans 30-89 days past due and still accruing\n$\n1,949 \n$\n1,971 \nNonperforming assets totaled $1.5 billion at December 31, 2024, down $11 million compared to December 31, 2023 due to a decline in the LHFS portfolio, partially offset by an increase in the commercial and industrial portfolio. Nonperforming loans and leases represented 0.47% of total loans and leases HFI, up three basis points compared to December 31, 2023.\nLoans 90 days or more past due and still accruing totaled $587 million at December 31, 2024, up $53 million compared to the prior year primarily due to an increase in the residential mortgage portfolio. Excluding government guaranteed loans, the ratio of loans 90 days or more past due and still accruing as a percentage of loans and leases HFI was 0.05% at December 31, 2024, up one basis point compared to December 31, 2023.\nLoans 30-89 days past due and still accruing totaled $1.9 billion at December 31, 2024, down $22 million compared to the prior year due to declines in the commercial and industrial, indirect auto, and other consumer portfolios, partially offset by increases in the residential mortgage and CRE portfolios. The ratio of loans 30-89 days or more past due and still accruing as a percentage of loans and leases HFI was 0.64% at December 31, 2024, up one basis point compared to the prior year.\n62   Truist Financial Corporation\nProblem loans include NPLs and loans that are 90 days or more past due and still accruing as disclosed in Table 19. In addition, for the commercial portfolio segment, loans that are rated special mention or substandard performing are closely monitored by management as potential problem loans. Refer to “Note 5. Loans and ACL” for the amortized cost basis of loans by origination year and credit quality indicator as well as additional disclosures related to NPLs.\nTable 20: Asset Quality Ratios\nDec 31, 2024\nDec 31, 2023\nLoans 30-89 days past due and still accruing as a percentage of loans and leases HFI\n0.64 \n%\n0.63 \n%\nLoans 90 days or more past due and still accruing as a percentage of loans and leases HFI\n0.19 \n0.17 \nNPLs as a percentage of loans and leases HFI\n0.47 \n0.44 \nNPLs as a percentage of total loans and leases\n(1)\n0.46 \n0.46 \nNPAs as a percentage of:\nTotal assets\n(1)\n0.28 \n0.28 \nLoans and leases HFI plus foreclosed property\n0.48 \n0.46 \nALLL as a percentage of loans and leases HFI\n1.59 \n1.54 \nRatio of ALLL to NPLs\n3.4x\n3.5x\nLoans 90 days or more past due and still accruing as a percentage of loans and leases HFI, excluding government guaranteed\n(2)\n0.05 \n%\n0.04 \n%\n(1)\nIncludes LHFS.\n(2)\nThis asset quality ratio has been adjusted to remove the impact of government guaranteed loans. Management believes the inclusion of such assets in this asset quality ratio results in distortion of this ratio because collection of principal and interest is reasonably assured, or the ratio might not be comparable to other periods presented or to other portfolios that do not have government guarantees.\nTable 21: Asset Quality Ratios (Continued)\nYear Ended December 31,\n2024\n2023\n2022\nNet charge-offs as a percentage of average loans and leases HFI:\nCommercial:\nCommercial and industrial\n0.20 \n%\n0.20 \n%\n0.04 \n%\nCRE\n1.31 \n0.71 \n0.02 \nCommercial construction\n(0.03)\n0.04 \n(0.07)\nConsumer:\nResidential mortgage\n(0.01)\n0.01 \n(0.01)\nHome equity\n(0.07)\n(0.12)\n(0.11)\nIndirect auto\n2.11 \n1.66 \n1.17 \nOther consumer\n1.73 \n1.40 \n1.14 \nStudent\n— \n4.39 \n0.34 \nCredit card\n5.26 \n3.85 \n2.98 \nTotal\n0.59 \n0.50 \n0.27 \nRatio of ALLL to net charge-offs\n2.7x\n3.0x\n5.3x\n \nThe following table presents activity related to NPAs:\nTable 22: Rollforward of NPAs\n(Dollars in millions)\n2024\n2023\nBalance, January 1\n$\n1,488 \n$\n1,250 \nNew NPAs\n3,331 \n3,055 \nAdvances and principal increases\n454 \n842 \nDisposals of foreclosed assets\n(1)\n(616)\n(603)\nDisposals of NPLs\n(2)\n(223)\n(237)\nCharge-offs and losses\n(1,313)\n(1,013)\nPayments\n(1,308)\n(1,357)\nTransfers to performing status\n(309)\n(440)\nOther, net\n(27)\n(9)\nEnding balance, December 31\n$\n1,477 \n$\n1,488 \n(1)\nIncludes charge-offs and losses recorded upon sale of $260 million and $196 million for the years ended December 31, 2024 and 2023, respectively.\n(2)\nIncludes gains, net of charge-offs and losses recorded upon sale of $14 million for the year ended December 31, 2024, and charge-offs and losses recorded upon sale of $30 million for the year ended December 31, 2023.\nTruist Financial Corporation   63\nCommercial Credit Concentrations\nTruist has established the following general practices to manage commercial credit risk:\n•\nlimiting the amount of credit that Truist may extend to a borrower;\n•\nestablishing a process for credit approval accountability;\n•\ninitial underwriting and analysis of borrower, transaction, market, and collateral risks;\n•\nevaluating the diversity of the loan portfolio in terms of type, industry, and geographical concentration;\n•\nongoing servicing and monitoring of individual loans and lending relationships;\n•\ncontinuous monitoring of the portfolio, market dynamics, and the economy; and\n•\nperiodically reevaluating the Company’s strategy and overall exposure as economic, market, and other relevant conditions change.\nTruist monitors various segments of its credit portfolios to assess potential concentration risks. Management is involved in the credit approval and review process, and risk acceptance criteria are adjusted as needed to reflect the Company’s risk appetite. Consistent with established risk management objectives, the Company utilizes various risk mitigation techniques, including collecting collateral and security interests, obtaining guarantees, and, to a limited extent, through the purchase of credit loss protection via third-party insurance or use of credit derivatives such as credit default swaps.\nIn the commercial portfolio, risk concentrations are evaluated regularly on both an aggregate portfolio level and on an individual client basis. The Company manages its commercial exposure through portfolio targets, limits, and transactional risk acceptance criteria as well as other techniques, including loan syndications/participations, loan sales, collateral, structure, covenants, and other risk reduction techniques.\nThe following tables provide industry distribution by major types of commercial credit exposure and the geographical distribution of commercial exposures. Industry classification for commercial and industrial loans is based on the North American Industry Classification System. CRE loans are classified based on type of property. For the geographic disclosures, amounts are generally assigned to a state based on the physical billing address of the client or physical property address.\n64   Truist Financial Corporation\nTable 23: Commercial and Industrial Portfolio Industry and Geography\nDecember 31, 2024\nDecember 31, 2023\n(Dollars in millions)\nLHFI\n% of Total\nNPL\nLHFI\n% of Total\nNPL\nIndustry:\n(1)\nFinance and insurance\n$\n24,271 \n15.7 \n%\n$\n28 \n$\n21,929 \n13.6 \n%\n$\n40 \nRetail trade\n12,488 \n8.1 \n66 \n12,368 \n7.7 \n89 \nManufacturing\n12,298 \n7.9 \n62 \n14,090 \n8.8 \n65 \nHealth care and social assistance\n12,154 \n7.8 \n129 \n13,078 \n8.1 \n46 \nReal estate and rental and leasing\n11,354 \n7.3 \n3 \n11,001 \n6.8 \n16 \nPublic administration\n8,860 \n5.7 \n— \n9,280 \n5.8 \n— \nWholesale trade\n7,428 \n4.8 \n45 \n7,471 \n4.6 \n3 \nInformation\n5,235 \n3.4 \n66 \n5,727 \n3.6 \n— \nTransportation and warehousing\n4,634 \n3.0 \n34 \n5,707 \n3.5 \n8 \nEducational services\n4,478 \n2.9 \n— \n5,362 \n3.3 \n31 \nProfessional, scientific, and technical services\n4,125 \n2.7 \n8 \n4,445 \n2.8 \n26 \nUtilities\n4,096 \n2.6 \n— \n4,577 \n2.8 \n— \nArts, entertainment, and recreation\n3,599 \n2.3 \n6 \n3,250 \n2.0 \n— \nOther services (except public administration)\n3,072 \n2.0 \n2 \n3,308 \n2.1 \n1 \nAdministrative and support and waste management and remediation services\n3,022 \n2.0 \n— \n3,652 \n2.3 \n49 \nAccommodation and food services\n2,935 \n1.9 \n9 \n2,925 \n1.8 \n13 \nOther\n(2)\n11,746 \n7.6 \n31 \n11,913 \n7.5 \n41 \nSubtotal\n135,795 \n87.7 \n489 \n140,083 \n87.1 \n428 \nBusiness owner occupied\n19,053 \n12.3 \n32 \n20,705 \n12.9 \n42 \nTotal commercial and industrial\n$\n154,848 \n100.0 \n%\n$\n521 \n$\n160,788 \n100.0 \n%\n$\n470 \nGeography:\nFlorida\n$\n18,258 \n11.8 \n%\n$\n172 \n$\n18,947 \n11.8 \n%\n$\n228 \nTexas\n14,728 \n9.5 \n47 \n15,374 \n9.6 \n24 \nNorth Carolina\n12,167 \n7.9 \n16 \n12,959 \n8.1 \n11 \nNew York\n11,379 \n7.3 \n50 \n10,336 \n6.4 \n3 \nGeorgia\n11,240 \n7.3 \n10 \n12,167 \n7.6 \n32 \nVirginia\n9,343 \n6.0 \n7 \n9,724 \n6.0 \n35 \nCalifornia\n8,115 \n5.2 \n8 \n9,115 \n5.7 \n1 \nMaryland\n6,781 \n4.4 \n3 \n6,668 \n4.1 \n6 \nPennsylvania\n6,466 \n4.2 \n9 \n7,423 \n4.6 \n4 \nTennessee\n5,729 \n3.7 \n51 \n5,852 \n3.6 \n43 \nSouth Carolina\n4,151 \n2.7 \n23 \n4,134 \n2.6 \n1 \nNew Jersey\n3,947 \n2.5 \n5 \n3,754 \n2.3 \n36 \nIllinois\n3,639 \n2.4 \n20 \n3,892 \n2.4 \n10 \nOhio\n3,482 \n2.2 \n1 \n3,220 \n2.0 \n6 \nOther\n(3)\n35,423 \n22.9 \n99 \n37,223 \n23.2 \n30 \nTotal commercial and industrial\n$\n154,848 \n100.0 \n%\n$\n521 \n$\n160,788 \n100.0 \n%\n$\n470 \n(1)\nThe Company adjusted certain NAICS code assignments in connection with the implementation of new guidance related to non-depository financial institutions. This change primarily impacted the industry assignment related to asset securitization facilities and family office obligations. Prior periods were reclassified to conform to the current presentation.\n(2)\nRepresents other remaining industries that are deemed to be individually insignificant.\n(3)\nIncludes non-U.S. loans of $4.1 billion and $5.1 billion at December 31, 2024 and December 31, 2023, respectively. The remainder represents other remaining states that are deemed to be individually insignificant.\nTruist has noted that the CRE and commercial construction portfolios have the potential for heightened risk in the current environment. Truist seeks to maintain a high-quality portfolio through disciplined risk management and prudent client selection.\nTruist’s CRE and commercial construction portfolios totaled $28.9 billion as of December 31, 2024, which includes 36% related to multifamily residential, 21% related to industrial, 14% related to office, 13% related to retail, and the remainder composed of hotel and other commercial real estate.\nTruist Financial Corporation   65\nOur combined CRE and commercial construction office portfolio is primarily composed of multi-tenant, non-gateway properties located within Truist Bank’s footprint. As of December 31, 2024, approximately 97% of these properties are multi-tenant or medical. Additionally, as of December 31, 2024, 34% and 19% of these exposures are scheduled to mature in 2025 and 2026, respectively, with the remainder scheduled to mature in 2027 and beyond.\nTable 24: CRE Portfolio Property Type and Geography\nDecember 31, 2024\nDecember 31, 2023\n(Dollars in millions)\nLHFI\n% of Total\nNPL\nLHFI\n% of Total\nNPL\nIndustry:\nMultifamily\n$\n5,508 \n27.0 \n%\n$\n27 \n$\n5,731 \n25.4 \n%\n$\n3 \nIndustrial\n4,303 \n21.1 \n3 \n4,054 \n18.0 \n3 \nRetail\n3,530 \n17.3 \n33 \n4,172 \n18.5 \n9 \nOffice\n3,459 \n17.0 \n228 \n4,286 \n19.0 \n264 \nHotel\n1,891 \n9.3 \n— \n2,445 \n10.8 \n— \nOther\n(1)\n1,672 \n8.3 \n7 \n1,882 \n8.3 \n5 \nTotal CRE\n$\n20,363 \n100.0 \n%\n$\n298 \n$\n22,570 \n100.0 \n%\n$\n284 \nGeography:\nFlorida\n$\n2,594 \n12.7 \n%\n$\n26 \n$\n2,481 \n11.0 \n%\n$\n5 \nNorth Carolina\n2,212 \n10.9 \n10 \n2,726 \n12.1 \n1 \nGeorgia\n2,010 \n9.9 \n80 \n2,532 \n11.2 \n120 \nCalifornia\n1,683 \n8.3 \n— \n1,709 \n7.6 \n81 \nTexas\n1,599 \n7.9 \n6 \n1,611 \n7.1 \n— \nNew York\n1,491 \n7.3 \n2 \n1,574 \n7.0 \n3 \nPennsylvania\n1,218 \n6.0 \n1 \n1,403 \n6.2 \n— \nVirginia\n1,108 \n5.4 \n3 \n1,276 \n5.7 \n— \nMassachusetts\n860 \n4.2 \n27 \n698 \n3.1 \n— \nDistrict of Columbia\n827 \n4.1 \n45 \n1,043 \n4.6 \n— \nTennessee\n715 \n3.5 \n1 \n810 \n3.6 \n1 \nOther\n(2)\n4,046 \n19.8 \n97 \n4,707 \n20.8 \n73 \nTotal CRE\n$\n20,363 \n100.0 \n%\n$\n298 \n$\n22,570 \n100.0 \n%\n$\n284 \n(1)\nRepresents other remaining property types that are deemed to be individually insignificant.\n(2)\nIncludes non-U.S. loans of $54 million and $73 million at December 31, 2024 and December 31, 2023, respectively. The remainder represents other remaining states that are deemed to be individually insignificant.\nTable 25: Commercial Construction Portfolio Property Type and Geography\nDecember 31, 2024\nDecember 31, 2023\n(Dollars in millions)\nLHFI\n% of Total\nNPL\nLHFI\n% of Total\nNPL\nIndustry:\nMultifamily\n$\n4,918 \n57.7 \n%\n$\n— \n$\n3,868 \n57.9 \n%\n$\n23 \nIndustrial\n1,680 \n19.7 \n— \n877 \n13.1 \n— \nSingle Family - CP\n664 \n7.8 \n2 \n819 \n12.3 \n— \nOffice\n627 \n7.4 \n— \n634 \n9.5 \n1 \nSingle Family - AD and CL\n187 \n2.2 \n1 \n196 \n2.9 \n— \nOther\n(1)\n444 \n5.2 \n— \n289 \n4.3 \n— \nTotal commercial construction\n$\n8,520 \n100.0 \n%\n$\n3 \n$\n6,683 \n100.0 \n%\n$\n24 \nGeography:\nTexas\n$\n1,345 \n15.8 \n$\n— \n$\n956 \n14.3 \n$\n23 \nGeorgia\n1,294 \n15.2 \n— \n1,059 \n15.8 \n— \nFlorida\n1,138 \n13.4 \n— \n741 \n11.1 \n— \nNorth Carolina\n992 \n11.6 \n1 \n777 \n11.6 \n— \nCalifornia\n492 \n5.8 \n— \n512 \n7.7 \n— \nOther\n(2)\n3,259 \n38.2 \n2 \n2,638 \n39.5 \n1 \nTotal commercial construction\n$\n8,520 \n100.0 \n%\n$\n3 \n$\n6,683 \n100.0 \n%\n$\n24 \n(1)\nRepresents other remaining property types that are deemed to be individually insignificant.\n(2)\nIncludes an immaterial amount of non-U.S. loans at December 31, 2024 and $16 million at December 31, 2023. The remainder represents other remaining states that are deemed to be individually insignificant.\nSee additional information on the commercial portfolios in “Note 5. Loans and ACL,” including loans by origination year and credit quality indicator.\n66   Truist Financial Corporation\nACL\nActivity related to the ACL is presented in the following tables:\nTable 26: Activity in ACL\nYear Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nBalance, beginning of period\n(1)\n$\n5,093 \n$\n4,649 \n$\n4,695 \nProvision for credit losses\n1,870 \n2,109 \n777 \nCharge-offs:\n \n \nCommercial and industrial\n(395)\n(390)\n(143)\nCRE\n(316)\n(166)\n(13)\nCommercial construction\n— \n(5)\n(1)\nResidential mortgage\n(3)\n(10)\n(9)\nHome equity\n(9)\n(10)\n(13)\nIndirect auto\n(591)\n(531)\n(411)\nOther consumer\n(606)\n(477)\n(381)\nStudent\n— \n(108)\n(22)\nCredit card\n(296)\n(223)\n(176)\nTotal charge-offs\n(2,216)\n(1,920)\n(1,169)\nRecoveries:\n \n \nCommercial and industrial\n87 \n70 \n87 \nCRE\n34 \n3 \n8 \nCommercial construction\n2 \n3 \n5 \nResidential mortgage\n6 \n6 \n16 \nHome equity\n16 \n23 \n25 \nIndirect auto\n120 \n107 \n91 \nOther consumer\n110 \n78 \n79 \nStudent\n— \n— \n1 \nCredit card\n38 \n35 \n34 \nTotal recoveries\n413 \n325 \n346 \nNet charge-offs\n(1,803)\n(1,595)\n(823)\nOther\n(2)\n1 \n(70)\n— \nBalance, end of period\n$\n5,161 \n$\n5,093 \n$\n4,649 \nACL:\n(1)\nALLL\n4,857 \n4,798 \n4,377 \nRUFC\n304 \n295 \n272 \nTotal ACL\n$\n5,161 \n$\n5,093 \n$\n4,649 \n(1)\nExcludes provision for credit losses and allowances related to other financial assets at amortized cost.\n(2)\n2023 includes the impact from the adoption of the Troubled Debt Restructurings and Vintage Disclosures accounting standard.\nNet charge-offs during 2024 totaled $1.8 billion, or 0.59% as a percentage of average loans, and were up nine basis points compared to the prior year, primarily driven by higher charge-offs in the CRE, other consumer, credit card, and indirect auto portfolios, partially offset by the sale of the student loan portfolio in the prior year.\nThe allowance for credit losses was $5.2 billion and includes $4.9 billion for the allowance for loan and lease losses and $304 million for the reserve for unfunded commitments. The ALLL ratio was 1.59%, compared to 1.54% at December 31, 2023. The increase in the ALLL ratio primarily reflects increases in reserves related to the CRE, commercial construction, and certain consumer non-real estate portfolios, as well as declines in commercial and industrial balances. The ALLL covered nonperforming loans and leases held for investment 3.4x compared to 3.5x at December 31, 2023. At December 31, 2024, the ALLL was 2.7x annualized net charge-offs, compared to 3.0x at December 31, 2023.\nTruist Financial Corporation   67\nThe following table presents an allocation of the ALLL. The entire amount of the allowance is available to absorb losses occurring in any category of loans and leases.\nTable 27: Allocation of ALLL by Category\nDecember 31, 2024\nDecember 31, 2023\n(Dollars in millions)\nAmount\n% ALLL in Each Category\n% Loans in Each Category\nAmount\n% ALLL in Each Category\n% Loans in Each Category\nCommercial and industrial\n$\n1,284 \n26.4 \n%\n50.7 \n%\n$\n1,404 \n29.4 \n%\n51.6 \n%\nCRE\n643 \n13.2 \n6.6 \n616 \n12.8 \n7.2 \nCommercial construction\n257 \n5.3 \n2.8 \n174 \n3.6 \n2.1 \nResidential mortgage\n204 \n4.2 \n18.1 \n298 \n6.2 \n17.8 \nHome equity\n89 \n1.8 \n3.1 \n89 \n1.9 \n3.2 \nIndirect auto\n955 \n19.7 \n7.5 \n942 \n19.6 \n7.3 \nOther consumer\n994 \n20.5 \n9.6 \n890 \n18.5 \n9.2 \nCredit card\n431 \n8.9 \n1.6 \n385 \n8.0 \n1.6 \nTotal ALLL\n4,857 \n100.0 \n%\n100.0 \n%\n4,798 \n100.0 \n%\n100.0 \n%\nRUFC\n304 \n \n295 \n \nTotal ACL\n$\n5,161 \n \n$\n5,093 \n \nTruist monitors the performance of its home equity loans and lines secured by second liens similarly to other consumer loans and utilizes assumptions specific to these loans in determining the necessary ALLL. Truist also receives notification when the first lien holder, whether Truist or another financial institution, has initiated foreclosure proceedings against the borrower. When notified that the first lien is in the process of foreclosure, Truist obtains valuations to determine if any additional charge-offs or reserves are warranted. These valuations are updated at least annually thereafter.\nTruist has limited ability to monitor the delinquency status of the first lien, unless the first lien is held or serviced by Truist. Truist estimates credit losses on second lien loans where the first lien is delinquent based on historical experience; the increased risk of loss on these credits is reflected in the ALLL. As of December 31, 2024, Truist held or serviced the first lien on 33% of its second lien positions.\nOther Assets\nThe components of other assets are presented in the following table:\nTable 28: Other Assets as of Period End\n(Dollars in millions)\nDec 31, 2024\nDec 31, 2023\nTax credit and other private equity investments\n$\n9,303 \n$\n7,898 \nBank-owned life insurance\n7,801 \n7,716 \nPrepaid pension assets\n7,238 \n6,563 \nAccrued income\n2,069 \n2,085 \nDTAs, net\n1,945 \n3,037 \nAccounts receivable\n1,904 \n997 \nLeased assets and related assets\n1,352 \n1,647 \nPrepaid expenses\n1,061 \n1,083 \nROU assets\n1,015 \n1,057 \nDerivative assets\n966 \n951 \nFHLB stock\n965 \n1,198 \nOther\n1,513 \n765 \nTotal other assets\n$\n37,132 \n$\n34,997 \n68   Truist Financial Corporation\nFunding Activities\nDeposits are the primary source of funds for the Company’s lending and investing activities. Scheduled payments and maturities from portfolios of loans and investment securities also provide a stable source of liquidity. FHLB advances, other secured borrowings, Federal funds purchased and other short-term borrowed funds, as well as long-term debt issued through the capital markets, all provide supplemental liquidity sources. Funding activities are monitored and governed through Truist’s overall ALM process under the governance and oversight of the ALCO, which is further discussed in the “Market Risk” section in MD&A. The following section provides a brief description of the various sources of funds.\nDeposits\nDeposits are obtained principally from individuals and businesses within Truist’s geographic area and include noninterest-bearing checking accounts, interest-bearing checking accounts, savings accounts, money market deposit accounts, CDs, and IRAs. Deposit account terms vary with respect to the minimum balance required, the time period the funds must remain on deposit, and service charge schedules. Interest rates paid on specific deposit types are determined based on (i) competitor deposit rates, (ii) the anticipated amount and timing of funding needs, (iii) the availability and cost of alternative sources of funding, and (iv) anticipated future economic conditions and interest rates. Deposits are attractive sources of funding because of their stability and relative cost.\nThe following table presents a summary of deposits:\nTable 29: Deposits as of Period End\n(Dollars in millions)\nDec 31, 2024\nDec 31, 2023\nNoninterest-bearing deposits\n$\n107,451 \n$\n111,624 \nInterest checking\n109,042 \n104,757 \nMoney market and savings\n137,307 \n135,923 \nTime deposits\n36,724 \n43,561 \nTotal deposits\n$\n390,524 \n$\n395,865 \nDeposits totaled $390.5 billion at December 31, 2024, a decrease of $5.3 billion from December 31, 2023. Brokered deposits were $28.1 billion at December 31, 2024 compared to $31.3 billion at December 31, 2023.\nApproximately 60% of deposits are insured or collateralized at December 31, 2024, compared to 62% at December 31, 2023. Truist deposit accounts are typically based on long-term relationships that include multiple products and services. The amount of deposits above the FDIC’s limit of $250,000 was $179.1 billion and $175.1 billion as of December 31, 2024 and 2023, respectively, calculated using the same methodology as the Call Report for Truist Bank.\nThe following table summarizes the maturities of time deposit accounts above $250,000:\nTable 30: Scheduled Maturities of Time Deposits $250,000 and Greater\nDecember 31, 2024\n(Dollars in millions)\nThree months or less\n$\n4,621 \nOver three through six months\n3,122 \nOver six through twelve months\n2,182 \nOver twelve months\n116 \nTotal\n$\n10,041 \nTruist Financial Corporation   69\nThe following table presents average deposits:\nTable 31: Average Deposits\nThree Months Ended\n(Dollars in millions)\nDec 31, 2024\nSep 30, 2024\nJun 30, 2024\nMar 31, 2024\nDec 31, 2023\nNoninterest-bearing deposits\n$\n107,968 \n$\n106,080 \n$\n107,634 \n$\n108,888 \n$\n114,555 \nInterest checking\n107,075 \n103,899 \n103,894 \n103,537 \n101,722 \nMoney market and savings\n138,242 \n136,639 \n135,264 \n134,696 \n137,464 \nTime deposits\n36,757 \n37,726 \n41,250 \n41,937 \n41,592 \nTotal average deposits\n$\n390,042 \n$\n384,344 \n$\n388,042 \n$\n389,058 \n$\n395,333 \nAverage deposits for the fourth quarter of 2024 were $390.0 billion, an increase of $5.7 billion, or 1.5%, compared to the prior quarter.\nAverage noninterest-bearing deposits increased 1.8% compared to the prior quarter and represented 27.7% of total deposits for the fourth quarter of 2024 compared to 27.6% for the third quarter of 2024. Average interest checking increased 3.1%. Average money market and savings accounts increased 1.2%. Average time deposits decreased 2.6%.\nBorrowings\nThe types of short-term borrowings that have been, or may be, used by the Company include Federal funds purchased, securities sold under repurchase agreements, master notes, commercial paper, short-term bank notes, and short-term FHLB advances. Short-term borrowings fluctuate based on the Company’s funding needs. While deposits remain the primary source for funding loan originations, management uses short-term borrowings as a supplementary funding source for loan growth and other balance sheet management purposes. The following table summarizes certain information for the past three years with respect to short-term borrowings excluding trading liabilities, hedges, and collateral in excess of derivative exposure:\nTable 32: Short-Term Borrowings\nAs Of / For The Year Ended December 31,\n(Dollars in millions)\n2024\n2023\n2022\nSecurities sold under agreements to repurchase:\nMaximum outstanding at any month-end during the year\n$\n9,675 \n$\n4,120 \n$\n6,033 \nBalance outstanding at end of year\n9,675 \n2,427 \n2,128 \nAverage outstanding during the year\n2,947 \n2,472 \n2,670 \nAverage interest rate during the year\n5.13 \n%\n5.18 \n%\n1.33 \n%\nAverage interest rate at end of year\n4.42 \n5.39 \n4.36 \nFederal funds purchased and short-term borrowed funds:\nMaximum outstanding at any month-end during the year\n$\n28,218 \n$\n26,453 \n$\n22,324 \nBalance outstanding at end of year\n19,530 \n22,401 \n19,340 \nAverage outstanding during the year\n21,552 \n22,007 \n10,135 \nAverage interest rate during the year\n5.39 \n%\n5.26 \n%\n2.79 \n%\nAverage interest rate at end of year\n4.04 \n5.15 \n4.38 \nAt December 31, 2024, short-term borrowings totaled $29.2 billion, an increase of $4.4 billion compared to December 31, 2023. Average short-term borrowings were $24.5 billion for the years ended December 31, 2024 and 2023, representing 5.5% and 5.2% of total funding, respectively.\nLong-term debt provides funding and, to a lesser extent, regulatory capital, and primarily consists of senior and subordinated notes issued by the Parent Company and Truist Bank. Long-term debt totaled $35.0 billion at December 31, 2024, a decrease of $4.0 billion compared to December 31, 2023. During the year ended December 31, 2024, the Company had:\n•\nNet redemptions of $1.8 billion of floating rate FHLB advances.\n•\nMaturities and redemptions of $6.9 billion of senior notes.\n•\nIssuances of $4.5 billion of fixed-to-floating rate senior notes with interest rates between 5.15% and 5.71% due from January 24, 2030 to January 24, 2035.\n70   Truist Financial Corporation\nShareholders’ Equity\nTruist’s book value per common share and TBVPS are presented in the following table:\nTable 33: Book Value per Common Share\n(Dollars in millions, except per share data, shares in thousands)\nDec 31, 2024\nDec 31, 2023\nCommon equity per common share\n$\n43.90 \n$\n39.31 \nNon-GAAP capital measure:\n(1)\n \n \nTangible common equity per common share\n$\n30.01 \n$\n21.83 \nCalculation of tangible common equity:\n(1)\n \n \nTotal shareholders’ equity\n$\n63,679 \n$\n59,253 \nLess:\n \n \nPreferred stock\n5,907 \n6,673 \nNoncontrolling interests\n— \n152 \nGoodwill and intangible assets, net of deferred taxes\n18,274 \n23,306 \nTangible common equity\n$\n39,498 \n$\n29,122 \nCommon shares outstanding at end of period\n1,315,936 \n1,333,743 \n(1)\nTangible common equity is a non-GAAP measure that excludes the impact of intangible assets, net of deferred taxes. This measure is useful for evaluating the performance of a business consistently, whether acquired or developed internally. Truist’s management uses this measure to assess balance sheet risk and shareholder value.\nTotal shareholders’ equity was $63.7 billion at December 31, 2024, an increase of $4.4 billion from December 31, 2023. This increase includes $4.8 billion in net income and $4.3 billion in OCI, partially offset by $3.1 billion in common and preferred dividends,$1.0 billion in common share repurchases, and $750 million for the redemption of series L preferred stock. For 2024, the dividend payout ratio was 62% and the total payout ratio was 85%.Truist’s book value per common share at December 31, 2024 was $43.90, compared to $39.31 at December 31, 2023. Truist’s TBVPS of $30.01 at December 31, 2024, increased 37% compared to December 31, 2023.\nTruist Financial Corporation   71\nRisk Management\nTruist seeks to maintain a comprehensive risk management framework supported by people, processes, and systems to identify, measure, monitor, manage, and report significant risks arising from its exposures and business activities. A key objective of the Company’s risk management framework is to promote the execution of strategic goals and objectives in alignment with its risk appetite.\nTruist has developed a risk management taxonomy to provide for the identification and classification of risk elements at Truist. The objective of the risk management taxonomy is to define enterprise-wide categorization for elements used in risk management activities, establish consistently applied language, and enable data analysis, aggregation, and reporting.\nTruist is committed to fostering a culture that supports the identification and escalation of risks across the organization. All teammates are responsible for upholding the Company’s purpose, mission, and values, and are encouraged to speak up if there is any activity or behavior that is inconsistent with the Company’s culture. The Truist code of ethics guides the Company’s decision making and informs teammates on how to act in the absence of specific guidance.\nTruist seeks an appropriate return for the risk taken in its business operations. Risk-taking activities must be evaluated and prioritized to identify those that present attractive risk-adjusted returns, while preserving asset value and capital.\nTruist’s compensation plans are designed to consider teammates’ adherence to and successful implementation of Truist’s risk values and associated policies and procedures. The Company’s compensation structure is designed to support its core values and sound risk management practices in an effort to promote judicious risk-taking behavior.\nTruist’s risk appetite is defined as the level of risk exposure Truist is willing to assume to realize its purpose, mission, and values, as well as achieve its strategic objectives, deliver shareholder returns, and maintain the safety and soundness of Truist. Truist’s RMO provides independent oversight and guidance for risk-taking across the enterprise. In keeping with the belief that consistent values drive long-term behaviors, Truist’s RMO has established four key behaviors all teammates are expected to practice daily – regardless of role:\n•\nAwareness: demonstrate an appropriate understanding of enterprise and business unit risks and the controls required to mitigate them. Complete required risk and compliance training within deadlines. Comply with risk related applicable Truist policies.\n•\nIdentification: proactively recognize business concerns, issues, risks, or emerging risks as they arise in day-to-day activities.\n•\nEscalation: speak up, report, and elevate concerns, issues, and risks as soon as possible to appropriate parties.\n•\nMitigation: consistently execute risk related applicable procedures and processes as designed for day-to-day activities. Maintain and execute effective controls to manage risk within risk appetite. As applicable, complete successful and timely remediation of assigned issues.\nThe BRC assists the Board in its oversight of the Company’s risk management function. The BRC is responsible for approving and periodically reviewing the Company’s risk management framework and risk management policies as well as monitoring the Company’s risk profile, approving risk appetite statements, and providing input to management regarding Truist’s risk appetite and risk profile.\nThe RMO is led by the CRO and is responsible for overseeing the identification, measurement, monitoring, management, and reporting of risk. The CRO has direct access to the Board to communicate any risk issues (current or emerging) as well as the performance of the risk management activities throughout the enterprise.\nThe risk management framework is supported by a three-lines-of-defense structure with unique roles and responsibilities for executing risk management activities, maintaining independent oversight, and providing independent assurance. The 1st line of defense (1LOD) includes the business units which originate and own the risk and GCO, which is described below. The 2nd line of defense (2LOD) is the independent risk management function provided by the RMO. The 3rd line of defense (3LOD) is the independent assurance function provided by Truist Audit Services.\nThe GCO standardizes first-line risk execution and ownership across the Company in partnership with the business units and enterprise functions. As part of the first-line of defense, the GCO provides risk advice and oversight, issues management, testing, reporting, and business continuity expertise to first-line execution efforts. The GCO coordinates closely with the RMO in executing these responsibilities.\n72   Truist Financial Corporation\nTruist’s Committee and Risk Reporting Governance Program is designed to provide comprehensive Board and management risk oversight, maintaining a committee governance structure that supports alignment and execution of the risk management framework. The committee structure provides a mechanism to allow for efficient aggregation and escalation of risk information from the business units up to management and ultimately the Board. Truist’s committee structure is broken down into three levels of committees:\n•\nLevel I committees: Board committees established by the Board to assist in its oversight of the Company. Level I committees are subject to governance directly by the Board, the respective Board committee charters, the bylaws of Truist, and the Truist corporate governance guidelines.\n•\nLevel II committees: appointed by a Level I committee with a direct reporting relationship and with the annual review and approval of its charter by the appointing Level I committee. \n•\nLevel III committees: appointed by a Level I, II, or III committee with a direct reporting relationship with, and the annual review and approval of its charter by, the appointing “parent” Level I, II, or III committee.\nThis committee structure includes management committees that are responsible for providing independent risk oversight of each of Truist’s primary risk types and comprehensive coverage of Truist’s strategy, risk-taking and execution activities. Examples of such committees include the ERC and Management Compensation Oversight Committee.\nThe ERC serves as the enterprise-wide risk governance body authorized by the BRC with responsibility for broad strategic oversight of all risk types and establishing an integrated view of risks across Truist at the enterprise level. The ERC is responsible for maintaining a risk management framework and monitoring its adoption and execution across the enterprise. The ERC is chaired by the CRO and its membership includes the CEO, CFO, Chief Audit Officer, and other designated members of Truist management.\nPrincipal types of inherent risk include market, credit, liquidity, technology, compliance, strategic, reputational, and operational risks. The following is a discussion of these risks.\nMarket Risk\nMarket risk is the risk to current or anticipated earnings, capital, or economic value arising from changes in interest rates, spreads, or prices of financial instruments, and the corresponding impact on the composition of the balance sheet or trading and fair value positions. Market risk results from changes in the level, volatility, or correlations among financial market risk factors or prices, including interest rates, credit spreads, foreign exchange rates, equity, and commodity prices.\nTruist’s most significant market risk exposure is to interest rate risk in its balance sheet; however, market risk also results from underlying product liquidity risk, price risk, and volatility risk of instruments held in Truist’s business units. Interest rate risk results from: differences between the timing of rate changes and the timing of cash flows associated with assets and liabilities (re-pricing risk); changing rate relationships among different yield curves affecting bank activities (basis risk); changing rate relationships across the spectrum of maturities (yield curve risk); and interest-related options inherently embedded in bank products (options risk).\nThe primary objectives of market risk management are to minimize adverse effects from changes in market risk factors on net interest income, net income, and capital, and to offset the risk of price changes for certain assets and liabilities recorded at fair value. At Truist, market risk management also includes the enterprise-wide IPV function.\nInterest Rate Market Risk\nAs a financial institution, Truist is exposed to interest rate risk from assets, liabilities, and off-balance sheet positions. Truist primarily monitors this risk through two measurement types, (i) NII at risk and (ii) economic value of equity. Truist manages this risk with securities, derivatives, and broader asset liability management activities. Truist uses derivatives to hedge interest income variability of floating rate loans and to hedge valuation changes of long-term debt and investment securities.\nIRR measurement is reported monthly through the ALCO. Monthly IRR reporting includes exposure and historical trends relative to risk limit scenarios, impacts to a wide range of rate scenarios, and sensitivity tests of key assumptions. IRR reporting is provided to the BRC quarterly.\nTruist Financial Corporation   73\nIRR measurement is influenced by data, assumptions, and models. Due to their high sensitivity to market rates, mortgage (loan and security) prepayments leverage an industry model that results in varying prepayment speeds across rate scenarios. Prepayments for non-mortgage loans leverage a mix of dynamic models (varying results based on market rates) and static prepayment assumptions based on historical experience. Prior to December 2024, interest-bearing-deposit rate paid was projected to move at a constant ratio (deposit beta) of market rates, primarily the Federal Funds Rate, aligned to historical through the cycle experience, and deposit balances in alternate scenarios were aligned to the Truist baseline scenario. In December 2024, we enhanced our deposit methodology to more dynamically incorporate client deposit balance levels, the mix across product types, and deposit rate paid across alternate rate scenarios based on modeled changes in customer and bank behavior. \nNII at risk measures the change in NII under alternate interest rate scenarios relative to Truist’s baseline scenario, which incorporates Truist’s current balance sheet and off-balance sheet hedges as well as expectations for new business over the forecast horizon. Truist’s baseline scenario relies on assumptions including expectations of the economy and interest rates – which are influenced by market conditions, new business volume, pricing, and customer behavior. In measuring NII at risk, Truist assumes that changes in key factors, such as prepayments and deposit pricing (betas), largely move in line with those it has experienced in prior rate cycles. However, future behavior of key factors may vary from Truist’s assumptions. NII at risk measurement assumes, when applicable, that U.S. interest rates floor at zero and Truist does not take any balance sheet or hedging actions in response to the rate scenarios.\nTruist evaluates a wide range of alternate scenarios including instantaneous and gradual as well as parallel and non-parallel changes in interest rates. The table below presents the estimated change to NII over the following 12 months for select parallel alternate scenarios, expressed as a percentage change relative to baseline NII.\nThe change in simulation analysis results from December 31, 2023 to December 31, 2024 in the table below was primarily due to the aforementioned enhanced deposit methodology. The use of dynamic deposit balance models results in rotation to higher cost funding products (e.g., CDs) when market rates increase and to lower cost funding products (e.g., non-maturity deposits) when market rates decrease. The use of dynamic rate paid models results in varying deposit betas based on the timing and conditions within market rate cycles but generally result in lower betas in the simulation analysis results than the prior methodology due to beta lag effects relative to changes in market rates. These updates were made to better reflect expected deposit behavior and Truist’s NII rate sensitivity to changes in market rates. Together, the incorporation of dynamic deposit balances and dynamic rate paid resulted in adding NII in up rate scenarios and reducing NII in down rate scenarios.\nTable 34: Interest Sensitivity Simulation Analysis\nDec 31, 2024\nDec 31, 2023\nUp 200bps gradual change in interest rates\n1.1 \n%\n(1.5)\n%\nUp 50bps instantaneous change in interest rates\n0.6 \n(0.4)\nDown 50bps instantaneous change in interest rates\n(0.8)\n(0.1)\nDown 200bps gradual change in interest rates\n(2.1)\n(0.3)\nTruist performs and monitors sensitivity tests of key assumptions used in NII risk including:\n•\nAsset prepayment speeds\n•\nNew loan volume pricing spreads\n•\nInterest-bearing deposit betas\n•\nNon-interest-bearing demand deposit balance runoff, replaced by market funding\nEVE measures changes in the economic value of Truist’s current balance sheet and off-balance sheet hedges under alternate rate scenarios relative to starting economic value. Truist uses EVE as a longer-term measure of interest rate risk. Truist performs and monitors sensitivity tests of key assumptions used in EVE including:\n•\nAsset prepayment speeds\n•\nMortgage spreads (mortgage loan and security valuations)\n•\nInterest-bearing deposit beta\n•\nDeposit runoff / decay\nKey assumption tests are generally performed by increasing and decreasing the assumption, whether static or dynamically modeled, relative to their respective starting values and then measuring the resulting impact to NII and EVE under baseline and alternate rate scenarios.\nThe identification and testing of key assumptions are influenced by market conditions and management views of key risks. The results of key assumption sensitivity tests are reported to ALCO and BRC at least quarterly. Key assumptions and their associated sensitivity tests are reviewed with ALCO and BRC at least annually.\n74   Truist Financial Corporation\nMarket Risk from Trading Activities\nAs a financial intermediary, Truist provides its clients access to derivatives, foreign exchange, and securities markets, which generate market risks. Trading market risk is managed using a multi-faceted risk management approach, which includes measuring risk using VaR, stress testing, and sensitivity analysis. Risk metrics are monitored against a suite of limits on a daily basis at both the trading desk level and at the aggregate portfolio level.\nTruist is also subject to risk-based capital guidelines for market risk under the Market Risk Rule.\nCovered Trading Positions\nCovered positions subject to the Market Risk Rule include trading assets and liabilities, specifically those held for the purpose of short-term resale or with the intent of benefiting from actual or expected short-term price movements or to lock in arbitrage profits. Truist’s trading portfolio of covered positions results primarily from market making and underwriting services for the Company’s clients, as well as associated risk mitigating hedging activity. The trading portfolio, measured in terms of VaR, consists primarily of four sub-portfolios of covered positions: (i) credit trading, (ii) fixed income securities, (iii) interest rate derivatives, and (iv) equity derivatives. As a market maker across different asset classes, Truist’s trading portfolio also contains other sub-portfolios, including foreign exchange, loan trading, and commodity derivatives; however, these portfolios do not generate material trading risk exposures.\nValuation policies and methodologies exist for all trading positions. Additionally, these positions are subject to independent price verification. See “Note 19. Derivative Financial Instruments,” “Note 18. Fair Value Disclosures,” and “Critical Accounting Policies” herein for discussion of valuation policies and methodologies.\nSecuritizations\nAs of December 31, 2024, the aggregate market value of on-balance sheet securitization positions subject to the Market Risk Rule, which were non-agency asset backed securities positions, was $100 million. Consistent with the Market Risk Rule requirements, the Company performs pre-purchase due diligence on each securitization position to identify the characteristics including deal structure and the asset quality of the underlying assets, that materially affect valuation and performance. Securitization positions are subject to Truist’s risk management framework, which includes daily monitoring against a suite of limits. There were no off-balance sheet securitization positions during the reporting period.\nCorrelation Trading Positions\nThe trading portfolio of covered positions did not contain any correlation trading positions as of December 31, 2024.\nVaR-Based Measures\nVaR measures the potential loss of a given position or portfolio of positions at a specified confidence level and time horizon. Truist utilizes a historical VaR methodology to measure and aggregate risks across its covered trading positions. For risk management purposes, the VaR calculation is based on a historical simulation approach and measures the potential trading losses using a one-day holding period at a one-tail, 99% confidence level. For Market Risk Rule purposes, the Company calculates VaR using a 10-day holding period and a 99% confidence level. Due to inherent limitations of the VaR methodology, such as the assumption that past market behavior is indicative of future market performance, VaR is only one of several tools used to measure and manage market risk. Other tools used to manage market risk include stress testing, scenario analysis, and stop loss limits.\nThe trading portfolio’s VaR profile is influenced by a variety of factors, including the size and composition of the portfolio, market volatility, and the correlation between different positions. A portfolio of trading positions is typically less risky than the sum of the risk from each of the individual sub-portfolios, because, under normal market conditions, risk within each category partially offsets the exposure to other risk categories. The following table summarizes certain VaR-based measures for the year ended December 31, 2024 and 2023.\nTruist Financial Corporation   75\nTable 35: VaR-based Measures\nYear Ended December 31,\n2024\n2023\n(Dollars in millions)\n10-Day Holding Period\n1-Day Holding Period\n10-Day Holding Period\n1-Day Holding Period\nVaR-based Measures:\nMaximum\n$\n28 \n$\n12 \n$\n30 \n$\n14 \nAverage\n21 \n7 \n17 \n7 \nMinimum\n12 \n4 \n10 \n4 \nPeriod-end\n16 \n6 \n23 \n11 \nVaR by Risk Class:\nInterest Rate Risk\n6 \n5 \nCredit Spread Risk\n6 \n2 \nEquity Price Risk\n6 \n5 \nForeign Exchange Risk\n1 \n1 \nPortfolio Diversification\n(12)\n(2)\nPeriod-end\n6 \n11 \nStressed VaR-based measures\nStressed VaR, another component of market risk capital, is calculated using the same internal models as used for the VaR-based measure. Stressed VaR is calculated over a ten-day holding period at a one-tail, 99% confidence level and employs a historical simulation approach based on a continuous twelve-month historical window selected to reflect a period of significant financial stress for the Company’s trading portfolio. The following table summarizes Stressed VaR-based measures:\nTable 36: Stressed VaR-based Measures - 10 Day Holding Period\nYear Ended December 31,\n(Dollars in millions)\n2024\n2023\nMaximum\n$\n234 \n$\n164 \nAverage\n145 \n76 \nMinimum\n69 \n25 \nPeriod-end\n105 \n79 \nCompared to the same period of the prior year, Stressed VaR measures were higher, primarily due to higher market making inventory.\nSpecific Risk Measures\nSpecific risk is a measure of idiosyncratic risk that could result from risk factors other than broad market movements (e.g., default or event risks). The Market Risk Rule provides fixed risk weights under a standardized measurement method while also allowing a model-based approach, subject to regulatory approval. Truist utilizes the standardized measurement method to calculate the specific risk component of market risk regulatory capital. As such, incremental risk capital requirements do not apply.\nVaR Model Backtesting\nIn accordance with the Market Risk Rule, the Company evaluates the accuracy of its VaR model through daily backtesting by comparing aggregate daily trading gains and losses (excluding fees, commissions, reserves, net interest income, and intraday trading) from covered positions with the corresponding daily VaR-based measures generated by the model. As illustrated in the following graph, there were no Company-wide VaR backtesting exceptions during the twelve months ended December 31, 2024. The total number of Company-wide VaR backtesting exceptions over the preceding twelve months is used to determine the multiplication factor for the VaR-based capital requirement under the Market Risk Rule. The capital multiplication factor increases from a minimum of three to a maximum of four, depending on the number of exceptions. All Company-wide VaR backtesting exceptions are thoroughly reviewed in the context of VaR model use and performance. There was no change in the capital multiplication factor over the preceding twelve months.\n76   Truist Financial Corporation\nModel Risk Oversight\nMRO is responsible for the independent model validation of all decision models, including trading market risk models. As part of ongoing monitoring efforts, the performance of all trading risk models is reviewed regularly to evaluate model performance with emerging developments in financial markets, assess evolving modeling approaches, and identify potential model enhancement.\nStress Testing\nThe Company uses a range of stress testing techniques to help monitor risks across trading desks and to augment standard daily VaR and other risk limits reporting. The stress testing framework is designed to quantify the impact of extreme, but plausible, stress scenarios that could lead to large, unexpected losses. Stress tests include simulations for risk factor sensitivities, historical repeats, and hypothetical scenarios with varying liquidity horizons of key risk factors. All trading positions within each applicable market risk category (i.e., interest rate risk, equity risk, foreign exchange rate risk, credit spread risk, and commodity price risk) are included in the Company’s stress testing framework. Management reviews stress testing scenarios and makes updates on an ongoing basis. Management also utilizes stress analyses to support the Company’s capital adequacy assessment standards. See the “Capital” section of MD&A for additional discussion of capital adequacy.\nCredit Risk\nCredit risk is the risk to current or anticipated earnings or capital arising when a borrower, obligor, issuer, or counterparty does not meet its financial obligations to us. Credit risk is primarily incurred through lending activities in the Company’s WB and CSBB operating segments. A number of products expose the Company to credit risk, including loans and leases, lending commitments, derivatives, trading assets, and investment securities. Changes in credit quality can have a significant impact on the Company’s earnings and capital position.\nTruist has established the following general practices to manage credit risk:\n•\nlimiting the amount of credit that individual lenders may extend to a borrower;\n•\nestablishing a process for credit approval accountability;\n•\ncareful initial underwriting and analysis of borrower, transaction, market, and collateral risks;\n•\nongoing servicing and monitoring of individual loans and lending relationships;\n•\nmaintaining collections and asset resolution teams;\n•\ncontinuous monitoring of the portfolio, concentration and transactional limits, emerging risks, market dynamics and the economy; and\n•\nperiodically reevaluating the Company’s strategy and overall exposure as economic, market and other relevant conditions change.\nTruist Financial Corporation   77\nThe following discussion describes the underwriting procedures and overall risk management of Truist’s lending function.\nUnderwriting Approach\nThe loan portfolio is a primary source of profitability and risk; therefore, proper loan underwriting is critical to Truist’s long-term financial success. Truist’s underwriting approach is designed to define acceptable combinations of specific risk-mitigating features that promote credit relationships that conform to Truist’s risk philosophy. Provided below is a summary of the most significant underwriting criteria used to evaluate new loans and loan renewals:\n•\nCash flow and debt service coverage - \ncash flow adequacy is a necessary condition of creditworthiness, meaning that loans must either be clearly supported by a borrower’s cash flow or, if not, must be justified by secondary repayment sources.\n•\nSecondary sources of repayment - \nalternative repayment funds are a significant risk-mitigating factor as long as they are liquid, can be easily accessed, and provide adequate resources to supplement the primary cash flow source.\n•\nValue of any underlying collateral - \nloans are generally secured by the asset being financed. Because an analysis of the primary and secondary sources of repayment is the most important factor, collateral, unless it is liquid, does not justify loans that cannot be serviced by the borrower’s primary and secondary cash flows.\n•\nOverall creditworthiness of the client, taking into account the client’s relationships, both past and current, with Truist and other lenders - \nTruist’s success depends on building lasting and mutually beneficial relationships with clients, which involves assessing their financial position and background.\n•\nLevel of equity invested in the transaction - \nin general, borrowers are required to contribute or invest a portion of their own funds prior to any loan advances.\nRefer to the “Lending Activities” section in MD&A for a discussion of each loan and lease portfolio.\nLiquidity Risk\nLiquidity risk is the risk that Truist will be unable, or that market participants may perceive Truist to be unable, to fund increases in its assets and meet its financial obligations at a reasonable cost and in a timely manner. Refer to the “Liquidity” section in MD&A for additional discussion.\nTechnology Risk\nTechnology risk is the risk associated with the disruption or failure of technology that negatively impacts business operations. Truist has defined and adopted a technology risk framework that provides the foundation for its technology risk strategy, program, and oversight and defines key objectives, operating model components, risk domains, and capabilities to manage this risk.\nRefer to Item 1C, “Cybersecurity” for a discussion regarding Truist’s cybersecurity risk management, strategy, and governance.\nData Analytics, AI, and Generative AI Risks\nData risk is the risk to current or projected financial condition, operations, strategic objectives, and regulatory compliance arising from inadequate data accuracy, completeness, consistency, timeliness, relevance, integrity, and validity (i.e., data fidelity). Inadequate data fidelity can negatively impact regulatory and management reporting, public disclosures, and business decisions.\nTruist recognizes the importance of maintaining accurate and reliable data and maintains a formal data risk management program that is designed to mitigate risks related to data fidelity. Through active data risk monitoring and accuracy testing, Truist seeks to provide reasonable assurance over data-related processes, risks, and controls, as well as the quality and retention of key data used for operational, strategic, regulatory, and compliance purposes. Management and the Board provide oversight of the data risk management program and receive regular updates from the RMO.\nTruist’s AI program is foundationally based on the National Institute of Standards and Technology AI Risk Management Framework Core, which provides outcomes and actions that enable dialogue, understanding, and activities to manage AI risks and develop trustworthy AI systems.\n78   Truist Financial Corporation\nCompliance Risk\nCompliance risk is the risk of legal or regulatory sanctions, financial loss, or damage to reputation as a result of noncompliance with (i) applicable laws, regulations, rules or other regulatory requirements (for example, the risk of consumer or wholesale clients experiencing economic loss or other legal harm as a result of noncompliance with relevant laws, requirements or regulations, such as the BSA and its related laws and regulations); (ii) internal policies and procedures, standards of best practice or codes of conduct; and (iii) principles of integrity and fair dealing applicable to Truist’s activities and functions.\nStrategic Risk\nStrategic risk is the risk to earnings, capital, franchise value, stakeholder confidence, and human capital arising from ineffective strategy, inability to adapt to changes in operating environment, adverse business decisions, or improper execution of strategic initiatives.\nReputational Risk\nReputational risk is the risk to current or future earnings, capital and resilience arising from negative publicity or stakeholder opinion, whether real or perceived, regarding Truist’s business practices, products, services, transactions, or other activities undertaken by Truist, its representatives, or its partners that may adversely impair Truist’s brand and public confidence, relationship with clients, teammates, stakeholders, or communities. The Company monitors, identifies, and internally escalates potential reputational risk events and endeavors to mitigate such reputational risks in a timely manner. Truist seeks to provide transparent and accurate communication, both internally and externally, to respond to key stakeholders on issues or events that could give rise to potential reputational risk. Truist utilizes an established risk taxonomy that is used to help identify, measure, and monitor reputational risk that enables clear transparently communication to stakeholders on the level of potential risk faced by the Company which in turn allows for effective management of risk to acceptable levels.\nTruist is committed to operating in a manner that reflects the Company’s stated purpose, mission, and values and seeks to protect its reputation, public confidence, and resilience by identifying and evaluating associated risks that conflict with the expectations of the Company’s internal and external stakeholders, including clients, teammates, investors, regulators, and communities.\nOperational Risk\nOperational risk is the risk of loss associated with inadequate or failed internal processes, people, systems, or from external events. It includes legal risk, which is the risk of loss arising from defective transactions, litigation or claims made, or the failure to adequately protect company-owned assets. An operational loss occurs when an event results in a loss or reserve originating from operational risk.\nModel Risk\nModel risk is the risk to current or anticipated earnings or capital from decisions based on incorrect or misused model outputs. Truist uses models for many purposes, including the valuation of financial positions, estimation of credit losses, and the measurement of risk. Valuation models are used to value certain financial instruments for which quoted prices may not be readily available. Valuation models are also used as inputs for VaR, the estimation of VaR itself, regulatory capital, stress testing, and the ACL. Models are owned by the applicable business units, which are responsible for the development, implementation, and use of their models. Oversight of these functions is performed by the MRO, which is a component of the RMO. Once models have been approved by MRO, model owners are responsible for the maintenance of an appropriate operating environment and must monitor and evaluate the performance of the models on a recurring basis. Models are updated in response to changes in portfolio composition, industry and economic conditions, technological capabilities, and other developments.\nMRO seeks to manage model risk through a suite of model governance and model validation activities. The risk of each model is assessed and classified into various risk tiers. Additionally, MRO maintains an enterprise-wide model inventory containing relevant model information. Regarding model validation, MRO utilizes internal validation analysts and managers with skill sets in predictive modeling to perform detailed reviews of model development, implementation, and conceptual soundness. On certain occasions, the MRO will also engage external parties to assist with validation efforts. Once in a production environment, MRO assesses a model’s performance on a periodic basis through ongoing monitoring reviews. MRO tracks issues that have been identified during model validation or through ongoing monitoring and engages with model owners to drive timely remediation. MRO gauges model risk utilizing a collection of key risk indicators, which are periodically reported to relevant committees, including the Model Risk Management Committee and the ERC. MRO will also present model risk topics to the BRC as necessary.\nTruist Financial Corporation   79\nLiquidity\nLiquidity is the ability to fund increases in assets and meet obligations as they come due, all without incurring unacceptable costs. In addition to the level of liquid assets, such as cash, cash equivalents, and highly liquid unencumbered securities, other factors affect the ability to meet liquidity needs, including access to a variety of funding sources, maintaining borrowing capacity, growing core deposits, loan repayment, and the ability to securitize or package loans for sale.\nTruist has a liquidity risk management process designed to identify, measure, and monitor key liquidity risks to assess whether Truist is operating within its liquidity risk appetite. The liquidity risk appetite is outlined using a qualitative statement and more granular detailed risk appetite statements aligned to Truist’s risk taxonomy; risk statements form the basis for aligning risk appetite with risk management goals and strategy. Using the risk appetite statements, key risk indicators are developed that represent quantitative metrics which measure current risk exposure relative to Truist’s risk appetite, which help the Board and management monitor liquidity risk taking activity. Truist’s key risk indicators are designed to support the following objectives:\n•\nmaintain (i) a diversified, but customer deposit centric, funding base, (ii) a level of liquid, readily monetized assets sufficient to satisfy business as usual and stressed cash flow needs across multiple liquidity horizons, and (iii) an appropriate level of contingent funding to meet any unexpected needs;\n•\nlimit concentration risk from individual, correlated counterparties, and funding concentrations in tenors that may negatively impact Truist from an unforeseen idiosyncratic or market event; and\n•\nmaintain sufficient liquidity in the holding company to serve as a source of strength to its subsidiaries.\nInternal Liquidity Stress Testing\nLiquidity stress testing is conducted for Truist and Truist Bank using a variety of institution-specific and market-wide adverse scenarios. Each liquidity stress test scenario applies defined assumptions to execute sources and uses of liquidity over varying planning horizons. The types of expected liquidity uses during a stressed event may include deposit attrition, contractual maturities, reductions in unsecured and secured funding, increased draws on unfunded commitments, and the potential need to post additional collateral for derivatives. To mitigate liquidity outflows, Truist has identified sources of liquidity; however, access to these sources of liquidity could be affected within a stressed environment.\nTruist maintains a liquidity buffer of cash on hand and highly liquid unencumbered securities that is designed to meet the projected 30-day net stressed cash-flow needs. Truist’s liquidity buffer is substantially the same in composition to what qualifies as HQLA under the LCR Rule. Truist periodically monetizes a representative sample of the liquidity buffer to assess operational readiness through available monetization channels.\nContingency Funding Plan\nTruist has a contingency funding plan designed to address ongoing obligations and commitments, particularly in the event of a liquidity contraction. This plan is designed to examine and quantify the organization’s liquidity under the various internal liquidity stress scenarios and is periodically tested to assess the plan’s reliability. Additionally, the plan provides a framework for management and other teammates to follow in the event of a liquidity contraction or in anticipation of such an event. The plan addresses authority for activation and decision making, liquidity options, and the responsibilities of key departments in the event of a liquidity contraction. On a quarterly basis, Truist conducts testing of market access for alternative sources of funds (e.g. discount window, standing repo facility, etc.) to test operational readiness. On an periodic basis, Truist conducts a table-top test of the Contingency Funding Plan to assess reliability of the plan during liquidity stress events and to simulate the operational elements of the plan such as communications, coordination, and decision-making.\nLCR, NSFR, and HQLA\nThe LCR rule requires that Truist and Truist Bank maintain an amount of eligible HQLA that is sufficient within the parameters of the rule to meet their estimated total net cash outflows over a prospective 30 calendar-day period of stress. Eligible HQLA, for purposes of calculating the LCR, is the amount of unencumbered HQLA that satisfy operational requirements of the LCR rule. Truist and Truist Bank are subject to the Category III reduced LCR requirements. Truist held average weighted eligible HQLA of $89.6 billion and Truist’s average LCR was 109% for the three months ended December 31, 2024.\nThe NSFR rule defines a minimum amount of stable, long-term funding that Truist and Truist Bank must maintain in relation to their asset composition and off-balance sheet activities. Truist and Truist Bank are subject to the Category III reduced NSFR requirements. At December 31, 2024, Truist was compliant with this requirement.\n80   Truist Financial Corporation\nSources of Funds\nTruist funds its balance sheet through diverse sources of funding including client deposits, secured and unsecured capital markets funding, and shareholders’ equity. Truist Bank’s primary source of funding is client deposits. Continued access to client deposits is highly dependent on public confidence in the stability of Truist Bank and its ability to return funds to clients when requested.\nTruist Bank maintains a number of diverse funding sources to meet its liquidity requirements. These sources include unsecured borrowings from the capital markets through the issuance of senior or subordinated bank notes, institutional CDs, overnight and term Federal funds markets, and retail brokered CDs. Truist Bank also maintains access to secured borrowing sources, including FHLB advances, repurchase agreements, and the FRB discount window. Available investment securities could be pledged to create additional secured borrowing capacity. The following table presents a summary of Truist Bank’s available secured borrowing capacity and eligible cash at the FRB:\nTable 37: Selected Liquidity Sources\n(Dollars in millions)\nDec 31, 2024\nDec 31, 2023\nUnused borrowing capacity:\nFRB\n$\n72,040 \n$\n55,252 \nFHLB\n31,411 \n24,712 \nAvailable investment securities (at fair value)\n68,212 \n77,029 \nAvailable secured borrowing capacity\n171,663 \n156,993 \nEligible cash at the FRB\n33,717 \n25,085 \nTotal\n$\n205,380 \n$\n182,078 \nAt December 31, 2024, Truist Bank’s available secured borrowing capacity represented approximately 4.4 times the amount of wholesale funding maturities in one-year or less.\nAs of December 31, 2024, the Company had $1.7 billion in obligations to purchase goods or services that are enforceable and legally binding. Many of the purchase obligations have terms that are not fixed and determinable and are included in the total amount of obligations based upon the estimated timing and amount of payment. In addition, certain of the purchase agreements contain clauses that would allow Truist to cancel the agreement with specified notice; however, that impact is not included in determining the total amount of obligations. See “Note 9. Other Assets and Liabilities,” “Note 11. Borrowings,” and “Note 16. Commitments and Contingencies” for additional information regarding outstanding balances of sources of liquidity and contractual commitments and obligations.\nParent Company\nThe Parent Company serves as the primary source of capital for its operating subsidiaries. The Parent Company’s assets consist primarily of cash on deposit with Truist Bank, equity investments in subsidiaries, advances to subsidiaries, and notes receivable from subsidiaries. The principal obligations of the Parent Company are payments on long-term debt. The main sources of funds for the Parent Company are dividends and management fees from subsidiaries, repayments of advances to subsidiaries, and proceeds from the issuance of equity and long-term debt. The primary uses of funds by the Parent Company are investments in subsidiaries, advances to subsidiaries, dividend payments to common and preferred shareholders, repurchases of common stock, payments on and, from time-to-time, potential repurchases or redemptions of a portion of an outstanding tranche of the long-term debt of the Parent Company (as may be permitted by the terms of each respective series), and the redemption of preferred stock. See “Note 22. Parent Company Financial Information” for additional information regarding dividends from subsidiaries and debt transactions.\nAccess to funding at the Parent Company is more sensitive to market disruptions. Therefore, Truist manages cash levels at the Parent Company to exceed a minimum of 12 months of projected cash outflows. In determining the buffer, Truist considers cash requirements for common and preferred dividends, unfunded commitments to affiliates, serving as a source of strength to Truist Bank, and being able to withstand sustained market disruptions that could limit access to the capital markets. At December 31, 2024, the Parent Company held cash on hand to meet these requirements.\nCredit Ratings\nCredit ratings are forward-looking opinions of rating agencies as to the Company’s ability to meet its financial commitments and repay its securities and obligations in accordance with their terms of issuance. Credit ratings influence both borrowing costs and access to the capital markets. The Company’s credit ratings are continuously monitored by the rating agencies and are subject to change at any time. As Truist seeks to maintain high-quality credit ratings, management meets with the major rating agencies on a regular basis to provide financial and business updates and to discuss current outlooks and trends. See Item 1A, “Risk Factors” for additional information regarding factors that influence credit ratings and potential risks that could materialize in the event of downgrade in the Company’s credit ratings.\nTruist Financial Corporation   81\nThe following table presents the credit ratings and outlooks of the Parent Company and Truist Bank as of December 31, 2024:\nTable 38: Credit Ratings of Truist Financial Corporation and Truist Bank\n \nMoody’s\nS&P\nFitch\nDBRS Morningstar\nTruist Financial Corporation:\nIssuer\nBaa1\nA- / A-2\nA / F1\nAAL / R-1M\nSenior unsecured\nBaa1\nA-\nA-\nAAL\nSubordinated\nBaa1\nBBB+\nBBB+\nAH\nPreferred stock\nBaa3(hyb)\nBBB-\nBBB-\nAL\nTruist Bank:\nIssuer\nA3\nA / A-1\nA / F1\nAA / R-1H\nSenior unsecured\nA3\nA\nA\nAA\nDeposits\nA1/P-1\nNA\nA+ / F1\nAA\nSubordinated\n(P) A3\nA-\nA-\nAAL\nRatings outlook:\nCredit trend\nStable\nStable\nStable\nStable\nCapital\nThe maintenance of appropriate levels of capital is a management priority and is monitored on a regular basis. Truist’s principal goals related to the maintenance of capital are to provide adequate capital to support Truist’s risk profile consistent with the Board-approved risk appetite, provide financial flexibility to support future growth and client needs, comply with relevant laws, regulations, and supervisory guidance, achieve optimal credit ratings for Truist, for the Parent Company to remain a source of strength for the Parent Company’s subsidiaries, and provide a competitive return to shareholders. Risk-based capital ratios, which include CET1 capital, Tier 1 capital, and Total capital are calculated based on regulatory guidance related to the measurement of capital and risk-weighted assets.\nManagement regularly monitors the capital position of Truist on both a consolidated and bank-level basis. In this regard, management’s objective is to maintain capital at levels that are in excess of internal capital limits, which are above the regulatory “well-capitalized” minimums. Truist also regularly performs stress testing on its capital levels and is required to periodically submit the Company’s capital plans and stress testing results to the banking regulators. Management has implemented internal stress capital ratio minimums\n \nthat serve as limits which are measured under internally-developed stress testing scenarios to evaluate whether capital ratios calculated under hypothetical stress, and after the effect of alternative capital actions, are likely to remain above internal stressed minimums. Breaches of internal capital limits or projected breaches of internal stress capital ratio minimums under hypothetical stress result in the activation of Truist’s capital contingency plan.\nTable 39: Capital Requirements\n \nMinimum Capital\nWell-Capitalized\nMinimum Capital Plus Stress Capital Buffer\n(1)\n \nTruist\nTruist Bank\nCET1\n4.5 \n%\nNA\n6.5 \n%\n7.3 \n%\nTier 1 capital\n6.0 \n6.0 \n%\n8.0 \n8.8 \nTotal capital\n8.0 \n10.0 \n10.0 \n10.8 \nLeverage ratio\n4.0 \nNA\n5.0 \nNA\nSupplementary leverage ratio\n3.0 \nNA\nNA\nNA\n(1)\nReflects a SCB requirement of 2.8% applicable to Truist as of December 31, 2024. Truist’s SCB requirement, received in the 2024 CCAR process, is effective from October 1, 2024 to September 30, 2025.\nTruist completed the 2024 CCAR process and received a SCB requirement of 2.8% for the period October 1, 2024 to September 30, 2025, down 10 basis points from the SCB requirement for the period October 1, 2023 to September 30, 2024.\nPayments of cash dividends and repurchases of common shares are among the methods used to manage any excess capital generated. In addition, management closely monitors the Parent Company’s double leverage ratio (investments in subsidiaries as a percentage of shareholders’ equity). The active management of the subsidiaries’ equity capital is the process used to manage this important driver of Parent Company liquidity and is a key element in the management of Truist’s capital position.\nManagement intends to maintain capital at Truist Bank at levels that exceed the minimum capital plus CCB. This will also result in Truist Bank being “well-capitalized” for regulatory purposes.\nManagement’s capital deployment plan in order of preference is to focus on (i) organic growth, (ii) dividends, (iii) strategic opportunities and acquisitions, and (iv) share repurchases if excess capital is available.\n82   Truist Financial Corporation\nTruist Bank’s capital ratios are presented in the following table:\nTable 40: Capital Ratios - Truist Bank\nDec 31, 2024\nDec 31, 2023\nCET1\n12.6 \n%\n11.7 \n%\nTier 1 capital\n12.6 \n11.7 \nTotal capital\n14.3 \n13.3 \nLeverage ratio\n10.1 \n9.2 \nSupplementary leverage ratio\n8.5 \n7.9\nThe Parent Company’s capital ratios are presented in the following table:\nTable 41: Capital Ratios - Truist Financial Corporation\n(Dollars in millions)\nDec 31, 2024\nDec 31, 2023\nRisk-based:\n \nCET1\n11.5 \n%\n10.1 \n%\nTier 1 capital\n12.9 \n11.6 \nTotal capital\n15.0 \n13.7 \nLeverage ratio\n10.5 \n9.3 \nSupplementary leverage ratio\n8.8 \n7.9 \nRisk-weighted assets\n$\n418,337 \n$\n423,705 \nTruist’s capital level at December 31, 2024 remains strong compared to the regulatory levels for well-capitalized banks. Truist’s CET1 ratio was 11.5% as of December 31, 2024, up 140 basis points since December 31, 2023 from the sale of TIH and organic capital generation, partially offset by common dividends, share repurchases, and the impact of the CECL phase-in under U.S. banking agencies rules. The remaining CECL phase-in will be amortized in the first quarter of 2025.\nTruist paid $2.8 billion in common stock dividends, or $2.08 per share, during 2024 and for 2023. Truist repurchased $1.0 billion in common stock for 2024 and had no share repurchases for 2023. In early 2025, Truist declared common dividends of $0.52 per share for the first quarter of 2025.\nCapital Contingency Plan\nIn the event of a realized or potential capital shortfall, Truist has a capital contingency plan that is designed to facilitate improvement of the Company’s capital position through the execution of specific contingency actions which either increase capital, decrease risk-weighted assets, or both. The plan provides a framework designed to monitor for the occurrence of these events by establishing mechanisms to detect capital contraction, including market and economic stress that could adversely impact the Company’s capital position. The plan also establishes governance protocols for activation or deactivation and decision making, list capital contingency options and associated key information, and addresses the responsibilities of key departments.\nReclassifications\nIn certain circumstances, reclassifications have been made to prior period information to conform to the current presentation. Such reclassifications had no effect on previously reported shareholders’ equity or net income. Refer to “Note 1. Basis of Presentation” for additional discussion regarding reclassifications.\nCritical Accounting Policies\nThe accounting and reporting policies of Truist are in accordance with GAAP and conform to the accounting and reporting guidelines prescribed by bank regulatory authorities. The financial position and results of operations are affected by management’s application of accounting policies, including estimates, assumptions and judgments made to arrive at the carrying value of assets and liabilities and amounts reported for revenues and expenses. Different assumptions in the application of these policies could result in material changes in the consolidated financial position and/or consolidated results of operations and related disclosures. Understanding Truist’s accounting policies is fundamental to understanding the consolidated financial position and consolidated results of operations. Accordingly, Truist’s significant accounting policies and effects of new accounting pronouncements are discussed in detail in “Note 1. Basis of Presentation.”\nThe following is a summary of Truist’s critical accounting policies that are highly dependent on estimates, assumptions, and judgments. These critical accounting policies are reviewed with the Audit Committee of the Board of Directors on a periodic basis.\nTruist Financial Corporation   83\nACL\nTruist’s ACL represents management’s best estimate of expected future credit losses related to the loan and lease portfolios and off-balance sheet lending commitments at the balance sheet date. Estimates of expected future loan and lease losses are determined by using statistical models and management’s judgement. The ACL estimation process includes both quantitatively calculated components as well as qualitative components. Quantitative models are designed to forecast probability of default, exposure at default and loss given default by correlating certain macroeconomic forecast data to historical experience. The models are generally applied at the portfolio level to pools of loans with similar risk characteristics. Certain loans or leases that do not have similar risk characteristics are individually evaluated when establishing an allowance for expected credit losses. The macroeconomic forecast data used in the models is based on forecasted variables for the reasonable and supportable period of two years. Beyond this forecast period the models gradually revert to long-term historical loss conditions over a one-year period. As a means of addressing uncertainty related to future economic conditions, the quantitative allowance components include an adjustment that reflects model outputs calculated using a range of potential future economic conditions. Expected losses are estimated through contractual maturity, giving appropriate consideration to expected prepayments unless the borrower has a right to renew that is not cancellable or to capture the losses expected at the balance sheet date or prior to January 1, 2023 it was reasonably expected that the loan will be modified as a TDR.\nThe qualitative components of the ACL incorporate management’s judgment in determining qualitative adjustments where model outputs are inconsistent with management’s expectations with respect to expected credit losses. The qualitative components are used to adjust for limitations in modeled results related to current economic conditions, and considerations with respect to the impact of current and expected events or risks, the outcomes of which are uncertain and may not be completely considered by quantitative models.\nManagement considers a range of macroeconomic forecast data in connection with the allowance estimation process. Under the range of scenarios considered as of December 31, 2024, use of the Company’s pessimistic scenario would have resulted in an increase to the modeled allowance results of approximately $2.2 billion. This estimate reflects the sensitivity of the modeled allowance estimate to macroeconomic forecast data but does not consider other qualitative adjustments that could increase or decrease modeled loss estimates calculated using this alternative economic scenario.\nThe methodology used to determine an estimate for the RUFC is similar to that used to determine the funded component of the ALLL and is measured over the period there is a contractual obligation to extend credit that is not unconditionally cancellable. The RUFC is adjusted for factors specific to binding commitments, including the probability of funding and exposure at default. A detailed discussion of the methodology used in determining the ACL is included in “Note 1. Basis of Presentation.”\nFair Value of Financial Instruments\nThe vast majority of assets and liabilities measured at fair value on a recurring basis are based on either quoted market prices or market prices for similar instruments. Refer to “Note 18. Fair Value Disclosures” for additional disclosures regarding the fair value of financial instruments.\nSecurities\nTruist generally utilizes a third-party pricing service in determining the fair value of its AFS investment securities, whereas trading securities are priced internally. Fair value measurements for investment securities are derived from market-based pricing matrices that were developed using observable inputs that include benchmark yields, benchmark securities, reported trades, offers, bids, issuer spreads, and broker quotes. Management performs procedures to evaluate the fair values provided by the third-party service provider. These procedures, which are performed independent of the responsible business unit, include comparison of pricing information received from the third-party pricing service to other third-party pricing sources, review of additional information provided by the third-party pricing service and other third-party sources for selected securities and back-testing to compare the price realized on security sales to the daily pricing information received from the third-party pricing service. The Enterprise Valuation Committee provides oversight to Truist’s enterprise-wide IPV function, which is responsible for the comparison of pricing information received from the third-party pricing service or internally to other third-party pricing sources, approving tolerance limits determined by IPV for price comparison exceptions, reviewing significant changes to pricing and valuation policies and reviewing and approving the pricing decisions made on any illiquid and hard-to-price securities. When market observable data is not available, which generally occurs due to the lack of liquidity or inactive markets for certain securities, the valuation of the security is subjective and may involve substantial judgment by management to reflect unobservable input assumptions.\n84   Truist Financial Corporation\nMSRs\nTruist’s primary class of MSRs for which it separately manages the economic risks relates to residential mortgages. Residential MSRs do not trade in an active, open market with readily observable prices. While sales of MSRs do occur, the precise terms and conditions typically are not readily available. Accordingly, Truist estimates the fair value of residential MSRs using a stochastic OAS valuation model to project residential MSR cash flows over multiple interest rate scenarios, which are then discounted at risk-adjusted rates. The OAS model considers portfolio characteristics, contractually specified servicing fees, prepayment assumptions, delinquency rates, late charges, other ancillary revenue, costs to service and other economic factors. Truist reassesses and periodically adjusts the underlying inputs and assumptions in the OAS model to reflect market conditions and assumptions that a market participant would consider in valuing the residential MSR asset.\nFair value estimates and assumptions are compared to industry surveys, recent market activity, actual portfolio experience and, when available, observable market data. Truist’s enterprise-wide IPV function also compares market data, when available, and information received from certain third-party pricing sources, to MSR fair value estimates, approving tolerance limits determined by IPV for price comparison exceptions, and reviewing significant changes to pricing and valuation policies. Due to the nature of the valuation inputs, residential MSRs are classified within Level 3 of the valuation hierarchy. The value of residential MSRs is significantly affected by mortgage interest rates available in the marketplace, which influence mortgage loan prepayment speeds. In general, during periods of declining interest rates, the value of MSRs declines due to increasing prepayments attributable to increased mortgage-refinance activity. Conversely, during periods of rising interest rates, the value of residential MSRs generally increases due to reduced refinance activity. Truist typically hedges against market value changes in the residential MSRs. Refer to “Note 8. Loan Servicing” for quantitative disclosures reflecting the effect that changes in management’s assumptions would have on the fair value of residential MSRs.\nTrading Assets and Liabilities\nFair value measurements for trading securities and securities sold short are derived from observable market-based information including overall market conditions, recent trades, comparable securities, broker quotes and FINRA’s Trade Reporting and Compliance Engine data when determining the value of a position. Security prices are also validated through actual cash settlement upon the sale of a security. When observable market prices are not available, the Company uses judgment and estimates fair value using internal models that reflect assumptions consistent with those that would be used by a market participant in estimating fair value. Refer to “Note 18. Fair Value Disclosures” for further information on the Company’s trading securities and securities sold short. \nTruist elects to measure certain loans at fair value for financial reporting where fair value aligns with the underlying business purpose. Trading loans include loans held in connection with the Company’s trading business primarily consisting of commercial and corporate leveraged loans and loans made or acquired in connection with the Company’s TRS business. Other trading liabilities include loans sold, but not yet purchased primarily consisting of commercial and corporate leveraged loans. Trading loans and loans sold, but not yet purchased are valued primarily using quoted prices for similar instruments in active markets or quoted prices for identical or similar instruments in markets that are not active by a third-party pricing service. Refer to “Note 18. Fair Value Disclosures” for further information on the Company’s trading loans and other trading liabilities. Refer to “Note 16. Commitments and Contingencies,” and “Note 19. Derivative Financial Instruments,” for further discussion of the Company’s TRS business.\nDerivative Assets and Liabilities\nTruist uses derivatives to manage various financial risks and in a dealer capacity to facilitate client transactions. Truist mitigates credit risk by subjecting counterparties to credit reviews and approvals similar to those used in making loans and other extensions of credit. In addition, certain counterparties are required to provide collateral to Truist when their unsecured loss positions exceed certain negotiated limits. The fair values of derivative financial instruments are determined based on quoted market prices and internal pricing models that use market observable data for interest rates, foreign exchange, equity, and credit. The fair value of interest rate lock commitments, which are related to mortgage loan commitments, is based on quoted market prices adjusted for commitments that Truist does not expect to fund and includes the value attributable to the net servicing fee. Refer to “Note 19. Derivative Financial Instruments” for further information on the Company’s derivatives.\nGoodwill and Other Intangible Assets\nThe acquisition method of accounting requires that assets acquired and liabilities assumed in business combinations are recorded at their fair values. This often involves estimates based on third-party valuations or internal valuations based on discounted cash flow analyses or other valuation techniques, which are inherently subjective. The amortization of definite-lived intangible assets is based upon the estimated economic benefits to be received, which is also subjective. Business combinations also typically result in goodwill, which is subject to ongoing periodic impairment tests based on the fair values of the reporting units to which the acquired goodwill relates. Refer to “Note 1. Basis of Presentation” for a description of the impairment testing process.\nTruist Financial Corporation   85\nEffective January 1, 2024, several business activities were realigned reflecting updates to the Company’s operating structure. First, the CB&W segment was renamed CSBB and the C&CB segment was renamed WB. Second, the Wealth business was realigned into the WB segment from the CSBB segment, representing a separate reporting unit in that segment. Third, the small business banking client segmentation was realigned into the CSBB segment from the WB segment. Further, TIH was the principal legal entity of the IH segment. As the operations of TIH were included in discontinued operations prior to the sale of TIH, the Company no longer presents the IH segment as one of its reportable segments.\nFollowing the realignment of these business activities, the Company’s three reporting units with goodwill balances are CSBB, WB excluding Wealth, and Wealth. In conjunction with these realignments, goodwill of $1.7 billion was realigned to Wealth, residing within the WB segment, from CSBB based on the relative fair value of CSBB and Wealth, and goodwill of $220 million was realigned to CSBB from the WB reporting unit based on the relative fair value of the WB reporting unit and the realigned small business banking client segmentation. In addition, the Company completed an assessment of any potential goodwill impairment for all impacted reporting units immediately prior and subsequent to the realignments and determined that no impairment existed. The quantitative valuation of the WB reporting unit performed in conjunction with these goodwill realignments indicated that as of January 1, 2024, the fair value of the WB reporting unit exceeded its carrying value by less than 10%, indicating at the time of the realignments that the goodwill of the WB reporting unit may be at risk of impairment.\nManagement performs a goodwill impairment analysis on an annual basis as of October 1 or more often if events or circumstances indicate that it is more-likely-than not that the fair value of a reporting unit is below its carrying value. For its annual impairment review, Truist performed a quantitative test of each of its reporting units. The quantitative impairment test estimates the fair value of the reporting units using the income approach and a market-based approach, weighted 50% and 50%, respectively. The inputs and assumptions specific to each reporting unit are incorporated in the valuations, including projections of future cash flows, discount rates, and applicable valuation multiples based on the comparable public company information. The income approach utilizes a discounted cash flow analysis of multi-year financial forecasts developed for each reporting unit by considering several inputs and assumptions such as net interest margin, expected credit losses, noninterest income, noninterest expense, and required capital. The market-based approach utilizes comparable public company information, key valuation multiples, and considers a market control premium associated with cost synergies and other cash flow benefits that arise from obtaining control over a reporting unit, and guideline transactions, when applicable.\nTruist also assesses the reasonableness of the aggregate estimated fair value of the reporting units by comparison to its market capitalization over a reasonable period of time, including consideration of expected acquirer expense synergies, historic bank control premiums, and the current market.\nThe projection of net interest margin is the most significant input to the financial projections of the CSBB and WB reporting units, while noninterest income is the most significant input to the financial projections of the Wealth reporting unit. The long-term growth rate used in determining the terminal value of each reporting unit was 3% as of October 1, 2024, based on management’s assessment of the minimum expected terminal growth rate of each reporting unit. Discount rates are estimated based on the Capital Asset Pricing Model, which considers the risk-free interest rate, market risk premium, beta, and unsystematic risk adjustments specific to a particular reporting unit. The discount rates are also calibrated based on risks related to the projected cash flows of each reporting unit. The discount rates utilized for the CSBB, Wealth, and WB reporting units as of October 1, 2024 were 12.5%, 12.0%, and 10.5%, respectively.\nBased on the results of the Company’s annual impairment analyses, the Company concluded that the fair values of the CSBB, WB and Wealth reporting units exceeded their respective carrying values; therefore, there was no goodwill impairment. However, for the WB reporting unit, the fair value of the reporting unit exceeded its carrying value by approximately 10%, indicating that the goodwill of the WB reporting unit may remain at risk of impairment. Circumstances that could negatively impact the fair value for the WB reporting unit in the future include a sustained decrease in Truist’s stock price, a decline in industry peer multiples, an increase in the applicable discount rate, and deterioration in the reporting unit’s forecast. \nThe estimated fair value of a reporting unit is highly sensitive to changes in management’s estimates and assumptions; therefore, in some\ninstances, changes in these assumptions could impact whether the fair value of a reporting unit is greater than its carrying value. The valuation of the WB reporting unit as of October 1, 2024 indicated that if the discount rate were increased more than 100 basis points, with other cash flow assumptions unchanged, the reporting unit’s fair value would be less than its carrying value, indicating a goodwill impairment under the income approach. Ultimately, future potential changes in management’s assumptions may impact the estimated fair value of a reporting unit and cause the fair value of the reporting unit to be below its carrying value. Additionally, a reporting unit’s carrying value could change based on market conditions, change in the underlying makeup of the reporting unit, or the risk profile of those reporting units, which could impact whether the fair value of a reporting unit is less than carrying value.\n86   Truist Financial Corporation\nThe Company monitored events and circumstances during the period from October 1, 2024 to December 31, 2024, including macroeconomic and market factors, industry and banking sector events, Truist specific performance indicators, a comparison of management’s forecast and assumptions to those used in its October 1, 2024 quantitative valuations, and the sensitivity of the October 1, 2024 quantitative results to changes in assumptions as of December 31, 2024. Based on these considerations, Truist concluded that it was not more-likely-than-not that the fair value of one or more of its reporting units is below its respective carrying amount as of December 31, 2024.\nPrior to the January 1, 2024 realignment of certain business activities described above, the Company also performed quantitative goodwill impairment analyses for its former CB&W and C&CB reporting units as of October 1, 2023. Based on the results of the prior year impairment analyses, the Company concluded as of October 1, 2023 that the carrying values of the former CB&W and C&CB reporting units exceeded their respective fair values, which resulted in a non-cash, non-tax-deductible goodwill impairment charge of $6.1 billion for the year ended December 31, 2023. This prior year goodwill impairment charge was primarily due to the continued impact of higher interest rates and discount rates on the former CB&W and C&CB reporting units, and a sustained decline in the banking industry share prices, including Truist’s through the October 1, 2023 date of the prior year quantitative analyses.\nFor additional goodwill information, refer to “Note 1. Basis of Presentation” and “Note 7. Goodwill and Other Intangible Assets.”\nIncome Taxes\nTruist is subject to income tax laws of the U.S., its states, and the municipalities in which the Company conducts business. In estimating the net amount due to or to be received from tax jurisdictions either currently or in the future, the Company assesses the appropriate tax treatment of transactions and filing positions after considering statutes, regulations, judicial precedent, and other pertinent information. The income tax laws are complex and subject to different interpretations by the taxpayer and the relevant government taxing authorities. Significant judgment is required in determining the tax accruals and in evaluating the Company’s tax positions, including evaluating uncertain tax positions. Changes in the estimate of accrued taxes occur periodically due to changes in tax rates, interpretations of tax laws and new judicial guidance, the status of examinations by the tax authorities, and newly enacted statutory and regulatory guidance that could impact the relative merits and risks of tax positions. These changes, when they occur, impact tax expense and can materially affect operating results. Truist reviews tax positions quarterly and adjusts accrued taxes as new information becomes available.\nDeferred income tax assets represent amounts available to reduce income taxes payable in future years. Such assets arise due to temporary differences between the financial reporting and tax bases of assets and liabilities, as well as from NOL and tax credit carryforwards. The Company regularly evaluates the ability to realize DTAs, recognizing a valuation allowance if, based on the weight of available evidence, it is more-likely-than-not that some portion or all of the DTA will not be realized. In determining whether a valuation allowance is necessary, the Company considers the level of taxable income in prior years to the extent that carrybacks are permitted under current tax laws, as well as estimates of future pre-tax and taxable income and tax planning strategies that would, if necessary, be implemented. Truist currently maintains a valuation allowance for certain state carryforwards. For additional income tax information, refer to “Note 1. Basis of Presentation” and “Note 14. Income Taxes.”\nPension and Postretirement Benefit Obligations\nTruist offers various pension plans and postretirement benefit plans to teammates. Calculation of the obligations and related expenses under these plans requires the use of actuarial valuation methods and assumptions, which are subject to management judgment and may differ significantly if different assumptions are used. The discount rate assumption used to measure the postretirement benefit obligations is set by reference to an AA Above Median corporate bond yield curve and the individual characteristics of the plans such as projected cash flow patterns and payment durations.\nManagement also considered the sensitivity that changes in the expected return on plan assets and the discount rate would have on pension expense. For the Company’s qualified plans, a decrease of 50 basis points in the discount rate would result in additional pension expense of approximately $20 million for 2025, while a decrease of 50 basis points in the expected return on plan assets would result in an increase of approximately $73 million in pension expense for 2025. This estimate reflects the sensitivity of certain factors considered in calculation of pension expense but does not consider all factors that could increase or decrease estimates calculated.\nRefer to “Note 15. Benefit Plans” for disclosures related to the benefit plans.\nTruist Financial Corporation   87",
  "item2": null
}