{
  "item1": "Target Corporation incorporated Minnesota 1902. corporate purpose help all families discover joy everyday life. offer customers, referred \"guests,\" fashionable, differentiated merchandise everyday essentials discounted prices. operate single segment designed enable guests purchase products seamlessly stores through digital channels.",
  "item7": "Item 7. Management's Discussion Analysis Financial Condition Results Operations 2024, drove strategy (as described ) investing core strengths deepened connection existing guests, while introducing innovations further differentiated Target, unlocked new channels growth, gave consumers more reasons become loyal Target guests. During 2024, Continued emphasize newness differentiation across assortment, including steady flow exclusive products designer collaborations, such as: 2,000 new wellness products introduced January 2025—600 which exclusive Target; exclusive official \"Taylor Swift | Eras Tour Book\"; large assortment exclusive Wicked products including Wicked Quenchers Stanley; partnerships celebrities such Dwayne “The Rock” Johnson, Tom Holland, Jennifer Aniston, Ashley Tisdale more; Diane von Furstenberg Target collection; Cuddle Collab limited-edition collection pets pet lovers; limited-time pickleball collection tennis lifestyle brand Prince; Launched expanded several owned brands, including dealworthy TM — new low-price line essentials — Auden TM TM TM TM , 11 owned brands exceeding $1 billion annual sales; Expanded selection products available Target Plus digital marketplace; Launched reimagined Target Circle loyalty program deliver easier more personalized shopping saving experience, including free-to-join option paid membership same-day delivery, well integration Target Circle Card (formerly RedCard); Continued enhance Roundel digital media products services, including through new self-service buying tool, Roundel Media Studio, experiential events integrated marketing activities; Invested new artificial intelligence (AI) technology, including modernized AI-powered inventory management systems Store Companion, AI-powered chatbot designed make team members' jobs easier enhance shopping experience; Opened 23 new stores, many which full-size stores, reflecting large-format focus stores hubs strategy; Fulfilled over 65 percent digital sales through same-day fulfillment options (Order Pickup, Drive Up, Same Day Delivery), which grew 7.7 percent compared 2023, including double-digit percentage growth both Same Day Delivery Drive Up. Fiscal 2024 included following notable items: GAAP Adjusted diluted earnings per share $8.86.",
  "item2": "Business Environment April 2025, U.S. imposed range tariffs vast majority products manufactured foreign countries jurisdictions, subsequently imposed incremental tariffs, paused, modified, issued specific exceptions recently imposed tariffs. U.S. indicated actively negotiating expects negotiate country-specific agreements expects will result changes imposed tariff rates."
}