{
  "source_file": "tgt-20250201.htm",
  "form_type": "10-K",
  "item1": "Item 1.    Business\nGeneral\nTarget Corporation was incorporated in Minnesota in 1902. Our corporate purpose is to help all families discover the joy of everyday life. We offer our customers, referred to as \"guests,\" fashionable, differentiated merchandise and everyday essentials at discounted prices. We operate as a single segment designed to enable guests to purchase products seamlessly in stores or through our digital channels. Since 1946, we have given 5 percent of our profit to communities.\nWhen used in this report, the terms \"we,\" \"our,\" \"us,\" \"Target,\" and the \"Corporation\" mean Target Corporation and its subsidiaries, collectively, unless the context otherwise requires or indicates.\nStrategy\nTarget delivers on our purpose of helping all families discover the joy of everyday life through our curated, multi-category assortment, outstanding value, and a team that’s centered on care for each other, our guests, and communities. Our stores, digital experience, fulfillment services, and loyalty ecosystem also play a critical role in differentiating Target and bringing our purpose to life.\nOur strategy aims to expand Target’s relevancy in consumers’ lives and drive traffic, sales\n,\n and market share growth. Core elements include:\n•\nDelighting with newness, style, and value by strengthening our owned brands portfolio, curating leading national brands, and expanding the breadth and depth of signature partnerships.\n•\nDelivering value by providing everyday low pricing and leveraging promotions and our loyalty ecosystem, Target Circle.\n•\nOpening new stores, updating existing stores\n,\n and enhancing our digital experience to reach more consumers and provide a reliably convenient, easy\n,\n and inspiring shopping experience.\n•\nTransforming our supply chain for increased efficiency, speed, capacity, and reliability across our network.\n•\nBeing a favorite discovery destination by making it easy for consumers to discover Target’s products and experiences across different channels and touchpoints, including our stores, our mobile app and website, and social platforms. \n•\nExpanding our capabilities, such as our Roundel advertising and Target Plus third-party digital marketplace businesses, to leverage our assets and enhance the guest experience.\nOur strategy defines how we’ll continue to differentiate Target, and we’ll seek to enable growth through:\n•\nOur Team – A highly engaged and purpose-driven team\n.\n•\nConsumer-Centricity – A deep understanding of consumers\n.\n•\nTechnology – A connected ecosystem of data, insights, and technology, including artificial intelligence\n.\n•\nEfficiency – Simplifying work for our teams to make it easier to deliver a great guest experience.\n•\nSustainability – Resiliency in our business model.\nTARGET CORPORATION\n2024 Form 10-K\n2\nBUSINESS\nTable of Contents\nIndex to Financial Statements\nThe vast majority of our Net Sales are generated by the sale of merchandise to customers. Our strategy continues to leverage stores as fulfillment hubs, with stores fulfilling more than 96 percent of total Merchandise Sales in each of the last three years, which provides convenience for our guests at a reduced fulfillment cost. In addition to Merchandise Sales, we generate revenue from other sources, most notably advertising revenue and credit card profit-sharing income. \nNote 2\n to the Financial Statements provides more information.\nNet Sales\n(in billions)\n2022\n(52 weeks)\n2023\n(53 weeks)\n2024\n(52 weeks)\n$109.1\n$107.4\n$106.6\n \n(a)    \n2023 consisted of 53 weeks. The extra week in 2023 contributed $1.7 billion of Net Sales.\nTARGET CORPORATION\n2024 Form 10-K\n3\nBUSINESS\nTable of Contents\nIndex to Financial Statements\nMerchandise Sales by Fulfillment Channel\nFinancial Highlights\nFor information on key financial highlights, see \nPart II, Item 7, Management's Discussion and Analysis of Financial Condition and Results of Operations\n (MD&A).\nSeasonality\nA larger share of annual revenues traditionally occurs in the fourth quarter because it includes the November and December holiday sales period.\nMerchandise\nThe majority of our stores offer a wide assortment of general merchandise and food. Most of our stores larger than 170,000 square feet offer a variety of general merchandise and a full line of food items comparable to traditional supermarkets. Our digital channels include a wide merchandise and food assortment, including many items found in our stores, along with a complementary assortment sold by Target and third parties. We manage our business across the six core merchandise categories shown below. Within categories, gross margins vary depending on the type of merchandise.\nMerchandise Sales by Category\nTARGET CORPORATION\n2024 Form 10-K\n4\nBUSINESS\nTable of Contents\nIndex to Financial Statements\nA significant portion of our Merchandise Sales are from national brand merchandise. Approximately one-third of our Merchandise Sales come from our owned and exclusive brands, including, but not limited to, the brands listed below.\nOwned Brands\n \nA New Day™\nFuture Collective™\nPillowfort™\nAll in Motion™\nGigglescape™\nProject 62™\nArt Class™\nGood & Gather™\nRoom Essentials™\nAuden™\nGoodfellow & Co™\nShade & Shore™\nAva & Viv™\nHearth & Hand™ with Magnolia\nSmartly™\nBoots & Barkley™\nHeyday™\nSmith & Hawken™\nBrightroom™\nHyde & EEK! Boutique™\nSonia Kashuk™\nBullseye's Playground™\nJoyLab™\nSpritz™\nCasaluna™\nKindfull™\nSun Squad™\nCat & Jack™\nKona Sol™\nThreshold™\nCloud Island™\nMade By Design™\nUniversal Thread™\nColsie™\nMarket Pantry™\nup & up™\ndealworthy™\nMondo Llama™\nWild Fable™\nEmbark™\nMore Than Magic™\nWondershop™\nEverspring™\nOpalhouse™\nXhilaration™\nFavorite Day™\nOpen Story™\nFigmint™\nOriginal Use™\nExclusive Adult Beverage Brands\n \n \nCalifornia Roots™\nJingle & Mingle™\nSunPop™\nCasa Cantina™\nPhotograph™\nThe Collection™\nHeadliner™\nRosé Bae™\nWine Cube™\nWe also sell merchandise through periodic exclusive design and creative partnerships, and shop-in-shop experiences, with partners such as Apple, Disney, Levi's, and Ulta Beauty, and generate revenue from in-store amenities such as Starbucks, Target Café, and Target Optical. CVS Pharmacy, Inc. (CVS) operates pharmacies and clinics in our stores under a perpetual operating agreement from which we generate annual occupancy income. \nOur global sourcing operations, which operate from offices in 12 countries around the world, are an important component of our business strategy. Our global sourcing team identifies, evaluates, and partners with suppliers and vendors from around the world to procure merchandise (most notably for our owned brands) and make it available to our guests through our stores and digital channels. The global sourcing team is also integral to ensuring quality and value of products, management of product costs, and driving ethical business practices.\nOther Capabilities\nWe generate revenue through a variety of other sources, including Roundel, which provides advertising services to vendors and other third parties; credit card profit sharing related to our Target Circle Card program; our third-party digital marketplace—Target Plus; membership fees; and others.\nCustomer Loyalty Programs\nOur guests receive a 5 percent discount on nearly all purchases and receive free shipping at Target.com when they use their Target Debit Card, Target Credit Card, Target MasterCard, or Target Circle Card Reloadable Account (collectively, Target Circle Cards). We also seek to drive customer loyalty and trip frequency through our Target Circle™ program which offers guests instant discounts and Target Circle Rewards redeemable on future purchases. In March 2024, we announced changes to Target Circle, including the integration of Target Circle Card™ (formerly RedCard) and the addition of a Target Circle 360™ paid membership option. Among other benefits, Target Circle \nTARGET CORPORATION\n2024 Form 10-K\n5\nBUSINESS\nTable of Contents\nIndex to Financial Statements\n360 members receive access to same-day delivery and our fastest available shipping option with no additional markup or fees.\nDistribution\nMost merchandise is distributed to our stores through our network of distribution centers. Common carriers ship merchandise to and from our distribution centers. Vendors or third-party distributors ship certain food items and other merchandise directly to our stores. Merchandise sold through our digital channels is distributed to our guests through guest pick-up at our stores, via common carriers (from stores, supply chain facilities, vendors, and third-party distributors), and same-day delivery via our wholly owned subsidiary, Shipt, Inc. (Shipt). Our stores fulfill the majority of the digitally originated sales, which allows improved product availability, faster fulfillment times, reduced shipping costs, and allows us to offer guests a suite of same-day fulfillment options such as Order Pickup, Drive Up, and Shipt. \nHuman Capital Management\nIn support of our purpose—to help all families discover the joy of everyday life—we invest in our team, our most important asset, by giving them opportunities to grow professionally, take care of themselves, each other, and their families, and to make a difference for our guests and our communities. We are among the largest private employers in the United States (U.S.), and our workforce has varying goals and expectations of their employment relationship, from team members looking to build a career to students, retirees, and others who are seeking to supplement their income in an enjoyable atmosphere. We seek to be an employer of choice to attract and retain top talent no matter their objectives in seeking employment. To that end, we strive to foster a highly engaged and purpose-driven culture where all employees, referred to as \"team members,\" have access to opportunity and growth, enabling our team to deliver business results.\nAs of February 1, 2025, we employed approximately 440,000 full-time, part-time, and seasonal team members. Because of the seasonal nature of the retail business, employment levels peak in the holiday season. We also engage independent contractors, most notably in our Shipt subsidiary.\nOur Board of Directors, through the Compensation and Human Capital Management Committee, oversees human capital management matters. \nTalent Development and Engagement\nWe offer a compelling work environment with meaningful experiences and abundant growth and career-development opportunities. This starts with the opportunity to do challenging work and learn on the job and is supplemented by programs and continuous learning that help our team build skills at all levels, including programs focused on specialized skill development, leadership opportunities, coaching, and mentoring. Our talent and succession planning process supports the development of a strong talent pipeline for leadership and other critical roles. We monitor our team members’ perceptions of these talent development and engagement programs through a number of surveys and take steps to address areas needing improvement. We are focused on making Target a destination for talent by creating a sense of belonging for our team members. We believe that this sense of belonging for all is an essential part of our team and culture, which helps fuel the growth of our business.\nCompensation and Benefits\nOur compensation and benefits are designed to support the financial, mental, and physical well-being of our team members and their families. We believe in paying team members equitably and we regularly review the pay data of U.S. team members to confirm that we are doing so. Our compensation packages include a starting wage range of $15 to $24 per hour for U.S. hourly team members in our stores and supply chain facilities (who comprise the vast majority of our team), a 401(k) plan with dollar-for-dollar matching contributions up to five percent of eligible earnings, paid vacation and holidays, family leave, sick pay, merchandise and other discounts, disability insurance, life insurance, healthcare and dependent care flexible spending accounts, tuition-free education assistance and tuition reimbursement, free mental health services, an annual short-term incentive program, long-term equity awards, and health insurance benefits, including free virtual health care visits. Eligibility for, and the level of, benefits vary depending on team members’ full-time or part-time status, work location, compensation level, and tenure. \nTARGET CORPORATION\n2024 Form 10-K\n6\nBUSINESS\nTable of Contents\nIndex to Financial Statements\nWorkplace Health and Safety\nWe strive to maintain a safe and secure work environment and have specific safety programs. This includes administering a comprehensive occupational injury- and illness-prevention program and training for team members. \nWorking Capital\nEffective inventory management is key to our ongoing success, and we use various techniques including demand forecasting and planning and various forms of replenishment management. We achieve effective inventory management by staying in-stock in core product offerings, maintaining positive vendor relationships, and carefully planning inventory levels for seasonal and apparel items to minimize markdowns.\nThe \nLiquidity and Capital Resources\n section in MD&A provides additional details.\nCompetition\nWe compete with traditional and internet retailers, including department stores, off-price general merchandise retailers, wholesale clubs, category-specific retailers, drug stores, supermarkets, direct-to-consumer brands, and other forms of retail commerce. Our ability to positively differentiate ourselves from other retailers and provide compelling value to our guests largely determines our competitive position within the retail industry. \nIntellectual Property\nOur brand image is a critical element of our business strategy. Our principal trademarks, including Target, our \"Expect More. Pay Less.\" brand promise, and our \"Bullseye Design,\" ha\nve been registered with the U.S. Patent and Trademark Office. We also seek to obtain and preserve intellectual property protection for our brands.\nGeographic Information\nNearly all of our sales are generated within the U.S. The vast majority of our property and equipment is located within the U.S. In addition to our administrative operations headquartered in the U.S., we perform additional administrative functions in Bangalore, India, and perform global sourcing operations from offices in 12 countries, predominantly in Asia and Central America.\nAvailable Information\nOur internet website is corporate.target.com. Our Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements, and amendments to those documents filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (Exchange Act), are available free of charge on the Investors section of our website (corporate.target.com/investors) as soon as reasonably practicable after we file such material with, or furnish it to, the U.S. Securities and Exchange Commission (SEC). In addition, the SEC maintains a website (sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC. Investors should note that we currently announce material information to our investors and others using filings with the SEC, press releases, public conference calls, webcasts, or our corporate website (corporate.target.com). Information that we post on our corporate website could be deemed material to investors. We encourage investors, the media, and others interested in us to review the information we post on these channels. The information on our website is not, and shall not be deemed to be, a part hereof or incorporated into this or any of our other filings with the SEC.\nTARGET CORPORATION\n2024 Form 10-K\n7\nBUSINESS\nTable of Contents\nIndex to Financial Statements\nInformation About Our Executive Officers\nExecutive officers are elected by, and serve at the pleasure of, the Board of Directors. There are no family relationships between any of the officers named and any other executive officer or member of the Board of Directors, or any arrangement or understanding pursuant to which any person was selected as an officer.\nName\nTitle and Recent Business Experience\nAge\nBrian C. Cornell\nChair of the Board and Chief Executive Officer since August 2014.\n66 \nMichael J. Fiddelke\nExecutive Vice President and Chief Operating Officer since February 2024. Executive Vice President and Chief Financial Officer from November 2019 to October 2024.\n48 \nRick H. Gomez\nExecutive Vice President and Chief Commercial Officer since July 2024. Executive Vice President and Chief Food, Essentials and Beauty Officer from January 2024 to July 2024, Executive Vice President and Chief Food and Beverage Officer from February 2021 to January 2024. Executive Vice President and Chief Marketing, Digital & Strategy Officer from December 2019 to February 2021.\n55 \nA. Christina Hennington\nExecutive Vice President and Chief Strategy and Growth Officer since July 2024. Executive Vice President and Chief Growth Officer from February 2021 to July 2024. Executive Vice President and Chief Merchandising Officer, Hardlines, Essentials and Capabilities from January 2020 to February 2021.\n50 \nMelissa K. Kremer\nExecutive Vice President and Chief Human Resources Officer since January 2019.\n47 \nJim Lee\nExecutive Vice President and Chief Financial Officer since September 2024. Prior to joining Target, Mr. Lee held various leadership positions with PepsiCo, Inc., including as Deputy Chief Financial Officer from November 2023 to September 2024, Senior Vice President, Corporate Finance from October 2022 to November 2023, and Chief Strategy and Transformation Officer and Senior Vice President, PepsiCo Beverages North America, from February 2019 to October 2022.\n50 \nCara A. Sylvester\nExecutive Vice President and Chief Guest Experience Officer since May 2022. Executive Vice President and Chief Marketing & Digital Officer from February 2021 to May 2022. Senior Vice President, Home from March 2019 to February 2021.\n47 \nAmy Tu\nExecutive Vice President, Chief Legal & Compliance Officer and Corporate Secretary since August 2024. Prior to joining Target, Ms. Tu held various leadership positions with Tyson Foods, Inc., including as President, International from October 2022 to August 2024, Chief Administrative Officer from October 2022 to August 2023, Executive Vice President and Chief Legal Officer and Secretary from October 2021 to January 2023, Executive Vice President, General Counsel and Secretary from November 2020 to October 2021, and Executive Vice President and General Counsel from December 2017 to November 2020.\n57 \nMatthew L. Zabel\nExecutive Vice President and Chief Corporate Affairs Officer since October 2023. Executive Vice President and General Counsel from May 2022 to October 2023. Senior Vice President, Risk and Employee & Labor Relations from August 2020 to May 2022. Senior Vice President, Enterprise Risk from September 2017 to August 2020.\n56 \nTARGET CORPORATION\n2024 Form 10-K\n8\nRISK FACTORS\nTable of Contents\nIndex to Financial Statements",
  "item7": "Item 7.   Management's Discussion and Analysis of Financial Condition and Results of Operations\nExecutive Overview \nIn 2024, we drove our strategy (as described on \npage 2\n) by investing in core strengths that deepened connection with existing guests, while introducing innovations that further differentiated Target, unlocked new channels of growth, and gave consumers more reasons to become loyal Target guests. During 2024, we\n•\nContinued to emphasize newness and differentiation across our assortment, including a steady flow of exclusive products and designer collaborations, such as:\n◦\n2,000 new wellness products introduced in January of 2025—600 of which were exclusive to Target;\n◦\nour exclusive official \"Taylor Swift | The Eras Tour Book\";\n◦\nour large assortment of exclusive Wicked products including Wicked Quenchers from Stanley; \n◦\npartnerships with celebrities such as Dwayne “The Rock” Johnson, Tom Holland, Jennifer Aniston, Ashley Tisdale and more;\n◦\nthe Diane von Furstenberg for Target collection; \n◦\nThe Cuddle Collab limited-edition collection for pets and pet lovers; and \n◦\na limited-time pickleball collection with tennis and lifestyle brand Prince;\n•\nLaunched or expanded several owned brands, including dealworthy\nTM\n — our new low-price line of essentials — and Auden\nTM\n, Cat & Jack\nTM\n, Gigglescape\nTM\n, and up&up\nTM\n, with 11 of our owned brands exceeding $1 billion in annual sales;\n•\nExpanded the selection of products available on our Target Plus digital marketplace;\n•\nLaunched our reimagined Target Circle loyalty program to deliver an easier and more personalized shopping and saving experience, including a free-to-join option and a paid membership for same-day delivery, as well as the integration of Target Circle Card (formerly RedCard);\n•\nContinued to enhance our Roundel digital media products and services, including through a new self-service buying tool, Roundel Media Studio, and experiential events integrated with marketing activities;\n•\nInvested in new artificial intelligence (AI) technology, including modernized AI-powered inventory management systems and Store Companion, an AI-powered chatbot designed to make team members' jobs easier and enhance the shopping experience;\n•\nOpened 23 new stores, many of which are full-size stores, reflecting our large-format focus and stores as hubs strategy; and\n•\nFulfilled over 65 percent of our digital sales through our same-day fulfillment options (Order Pickup, Drive Up, and Same Day Delivery), which grew 7.7 percent compared to 2023, including double-digit percentage growth in both Same Day Delivery and Drive Up.\nFinancial Summary\nFiscal 2024 included the following notable items:\n•\nGAAP and Adjusted diluted earnings per share were $8.86.\n•\nNet Sales were $106.6 billion, a decrease of $0.8 billion, or 0.8 percent, from the prior year, driven by one less week in the current year. \n•\nComparable sales increased 0.1 percent, driven by a 1.4 percent increase in traffic and partially offset by a 1.3 percent decrease in average transaction amount.\n•\nOperating income of $5.6 billion was 2.5 percent lower than the 53-week prior-year period. \nTARGET CORPORATION\n2024 Form 10-K\n25\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nFINANCIAL SUMMARY\nIndex to Financial Statements\nEarnings Per Share\n \n \n \nPercent Change\n2024\n2023 \n(a)\n2022\n2024/2023\n2023/2022\nGAAP diluted earnings per share \n$\n8.86 \n$\n8.94 \n$\n5.98 \n(0.9)\n%\n49.4 \n%\nAdjustments\n— \n— \n0.03 \n \n \nAdjusted diluted earnings per share \n$\n8.86 \n$\n8.94 \n$\n6.02 \n(0.9)\n%\n48.6 \n%\nNote:  Amounts may not foot due to rounding. Adjusted diluted earnings per share (Adjusted EPS), a non-GAAP metric, excludes the impact of certain items. Management believes that Adjusted EPS is useful in providing period-to-period comparisons of the results of our operations. A reconciliation of non-GAAP financial measures to GAAP measures is provided on \npage 30\n.\n(a)\n2023 consisted of 53 weeks compared with 52 weeks in 2024 and 2022.\nWe report after-tax return on invested capital (ROIC) because we believe ROIC provides a meaningful measure of our capital-allocation effectiveness over time. For the trailing twelve months ended February 1, 2025, after-tax ROIC was 15.4 percent, compared to 16.1 percent for the trailing twelve months ended February 3, 2024. The calculation of ROIC is provided on \npage 31\n.\nAnalysis of Results of Operations\nSummary of Operating Income\n \n \n \nPercent Change\n(dollars in millions)\n2024\n2023 \n(c)\n2022\n2024/2023\n2023/2022\nNet sales \n(a)\n$\n106,566 \n$\n107,412 \n$\n109,120 \n(0.8)\n%\n(1.6)\n%\nCost of sales \n(b)\n76,502 \n77,828 \n82,306 \n(1.7)\n(5.4)\nSG&A expenses \n(b)\n21,969 \n21,462 \n20,581 \n2.4 \n4.3 \nDepreciation and amortization (exclusive of depreciation included in cost of sales)\n2,529 \n2,415 \n2,385 \n4.7 \n1.3 \nOperating income\n$\n5,566 \n$\n5,707 \n$\n3,848 \n(2.5)\n%\n48.3 \n%\n(a)\nIn 2024, we changed the presentation of revenue in our Consolidated Statements of Operations, consolidating the previous three-line format (Sales, Other Revenue, and Total Revenue) to a single line labeled \"Net Sales\", which reflects all revenues (formerly Total Revenue). \nNote 2\n to the Financial Statements provides additional information. We believe this presentation better reflects our strategy, which includes growing capabilities and business offerings that leverage Target's assets and competitive strengths.\n(b)\nRefer to \nNote 3\n to the Financial Statements for additional information about a reclassification of prior year amounts to conform with current year presentation. \n(c)\n2023 consisted of 53 weeks compared with 52 weeks in 2024 and 2022.\nRate Analysis\n2024\n2023\n2022\nGross margin rate \n(a)\n28.2 \n%\n27.5 \n%\n24.6 \n%\nSG&A expense rate \n(a)\n20.6 \n20.0 \n18.9 \nDepreciation and amortization (exclusive of depreciation included in cost of sales) expense rate\n2.4 \n2.2 \n2.2 \nOperating income margin rate\n5.2 \n5.3 \n3.5 \n(a)\nReflects the impact of a reclassification of prior year amounts to conform with current year presentation. Refer to \nNote 3\n to the Financial Statements for additional information. \nNote: Gross margin is calculated as Net Sales less Cost of Sales. All rates are calculated by dividing the applicable amount by Net Sales. Previously our gross margin rate was calculated based only on Merchandise Sales. The calculation change aligns with our 2024 transition to a single-line revenue presentation on our Consolidated Statements of Operations, with prior period amounts updated to conform to the current year presentation. We also updated prior period gross margin rates to conform to the current year calculations, which resulted in an approximate 1 percentage point increase in our gross margin rate for both 2023 and 2022.\nTARGET CORPORATION\n2024 Form 10-K\n26\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF OPERATIONS\nIndex to Financial Statements\nA discussion regarding Analysis of Results of Operations and Analysis of Financial Condition for 2023, as compared to 2022, is included in Part II, Item 7, MD&A\n \nto our \nAnnual Report on Form 10-K for the year ended \nFebruary 3, 2024\n.\nNet Sales\nNet Sales includes Merchandise Sales and revenues from other sources, most notably advertising revenue and credit card profit-sharing income. \nNote 2\n to the Financial Statements provides more information.\nMerchandise Sales are net of expected returns, and our estimate of gift card breakage. \nNote 2\n to the Financial Statements defines gift card \"breakage.\" We use comparable sales to evaluate the performance of our stores and digital channels by measuring the change in sales for a period over the comparable, prior-year period of equivalent length. Comparable sales include all Merchandise Sales, except sales from stores open less than 13 months or that have been closed. Comparable sales measures vary across the retail industry. As a result, our comparable sales calculation is not necessarily comparable to similarly titled measures reported by other companies. Digitally originated sales include all Merchandise Sales initiated through mobile applications and our websites. Our stores fulfill the majority of digitally originated sales, including shipment from stores to guests, store Order Pickup or Drive Up, and Same Day Delivery. Digitally originated sales may also be fulfilled through our distribution centers, our vendors, or other third parties.\nMerchandise Sales growth – from both comparable sales and new stores – represents an important driver of our long-term profitability. We expect that comparable sales growth will drive a significant portion of our total sales growth. We believe that our ability to successfully differentiate our guests’ shopping experience through a careful combination of merchandise assortment, price, convenience, guest experience, and other factors will over the long-term drive both increasing shopping frequency (number of transactions, or \"traffic\") and the amount spent each visit (average transaction amount).\nThe extra week in 2023 contributed $1.7 billion to Net Sales.\nComparable Sales\n2024\n2023\n2022\nComparable sales change\n0.1 \n%\n(3.7)\n%\n2.2 \n%\nDrivers of change in comparable sales\n \n \n \nNumber of transactions (traffic)\n1.4 \n(2.4)\n2.1 \nAverage transaction amount\n(1.3)\n(1.4)\n0.1 \nComparable Sales by Channel\n2024\n2023\n2022\nStores originated comparable sales change\n(1.6)\n%\n(3.5)\n%\n2.4 \n%\nDigitally originated comparable sales change\n7.5 \n(4.8)\n1.5 \nMerchandise Sales by Channel\n2024\n2023\n2022\nStores originated\n80.4 \n%\n81.7 \n%\n81.4 \n%\nDigitally originated\n19.6 \n18.3 \n18.6 \nTotal\n100 \n%\n100 \n%\n100 \n%\nMerchandise Sales by Fulfillment Channel\n2024\n2023\n2022\nStores\n97.6 \n%\n97.4 \n%\n96.7 \n%\nOther\n2.4 \n2.6 \n3.3 \nTotal\n100 \n%\n100 \n%\n100 \n%\nNote:  Merchandise Sales fulfilled by stores include in-store purchases and digitally originated sales fulfilled by shipping merchandise from stores to guests, Order Pickup, Drive Up, and Same Day Delivery.\nTARGET CORPORATION\n2024 Form 10-K\n27\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF OPERATIONS\nIndex to Financial Statements\nPart I, Item 1, Business of this Form 10-K\n and \nNote 2\n to the Financial Statements provides additional product category sales information. The collective interaction of a broad array of macroeconomic, competitive, and consumer behavioral factors, as well as sales mix, and transfer of sales to new stores makes further analysis of sales metrics infeasible.\nTD Bank Group offers credit to qualified guests through Target-branded credit cards: the Target Credit Card and the Target MasterCard Credit Card (Target Credit Cards). Additionally, we offer a branded proprietary Target Debit Card and Target Circle Card Reloadable Account. Collectively, we refer to these products as Target Circle Cards. Guests receive a 5 percent discount on virtually all purchases when they use a Target Circle Card at Target. We monitor the percentage of purchases that are paid for using Target Circle Cards (Target Circle Card Penetration) because our internal analysis has indicated that a meaningful portion of incremental purchases on our Target Circle Cards are also incremental sales for Target. For the years ended February 1, 2025, February 3, 2024, and January 28, 2023, total Target Circle Card Penetration was 17.8 percent, 18.6 percent, and 19.8 percent, respectively. See the Customer Loyalty Programs section within \nItem 1. Business on \npage 5\n for information about the rebranding of RedCards. \nGross Margin (GM) Rate\nOur gross margin rate was 28.2 percent in 2024 and 27.5 percent in 2023. The increase reflected the net impact of \n•\nmerchandising activities, including cost improvements which more than offset higher promotional and clearance markdown rates, as well as growth in advertising and marketplace revenues;\n•\nlower book to\n \nphysical inventory adjustments in 2024; and\n•\nhigher supply chain & digital fulfillment costs due to new supply chain facilities coming online and an increase in digital volume.\nSelling, General and Administrative (SG&A) Expense Rate\nOur SG&A expense rate was 20.6 percent in 2024, compared with 20.0 percent in 2023, reflecting the net impact of cost increases across our business, including higher team member pay and benefits and higher general liability expenses, partially offset by the benefit of lower store remodel-related expenses.\nTARGET CORPORATION\n2024 Form 10-K\n28\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF OPERATIONS & OTHER PERFORMANCE FACTORS\nIndex to Financial Statements\nStore Data\nChange in Number of Stores\n2024\n2023\nBeginning store count\n1,956 \n1,948 \nOpened\n23 \n21 \nClosed\n(1)\n(13)\nEnding store count\n1,978 \n1,956 \nNumber of Stores and\nRetail Square Feet\nNumber of Stores\nRetail Square Feet\n \n(a)\nFebruary 1, 2025\nFebruary 3, 2024\nFebruary 1, 2025\nFebruary 3, 2024\n170,000 or more sq. ft.\n273 \n273 \n48,824 \n48,824 \n50,000 to 169,999 sq. ft.\n1,559 \n1,542 \n195,050 \n192,908 \n49,999 or less sq. ft.\n146 \n141 \n4,404 \n4,207 \nTotal\n1,978 \n1,956 \n248,278 \n245,939 \n(a)\nIn thousands; reflects total square feet less office, distribution center, and vacant space.\nOther Performance Factors\nNet Interest Expense\nNet interest expense was $411 million for 2024, compared with $502 million for 2023. The decrease in net interest expense was primarily due to an increase in interest income.\nProvision for Income Taxes\nOur 2024 effective income tax rate was 22.2 percent compared with 21.9 percent in 2023. The increase primarily reflects lower discrete tax benefits compared to the prior year.\nNumerous countries, including certain jurisdictions in which we operate, have enacted legislation to implement the model rules of the Organization for Economic Cooperation and Development Pillar Two framework (Pillar Two), which is designed to ensure large multinational enterprises are subject to a 15 percent global minimum tax on income earned in each jurisdiction in which they operate. We do not expect the enacted rules, which will be applicable to us in 2025, to materially impact our 2025 financial results. \nUnder the Pillar Two framework, any existing deferred tax assets not disclosed in our financial statements will not be available for future use. Accordingly, we are disclosing the existence of gross tax loss carryforwards of $1.1 billion in Canada and $0.2 billion in Luxembourg. The losses are deemed to have a remote possibility of realization; therefore, a deferred tax asset and valuation allowance are not established.\nTARGET CORPORATION\n2024 Form 10-K\n29\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nRECONCILIATION OF NON-GAAP FINANCIAL MEASURES\nIndex to Financial Statements\nReconciliation of Non-GAAP Financial Measures to GAAP Measures\nTo provide additional transparency, we have disclosed non-GAAP adjusted diluted earnings per share (Adjusted EPS). This metric excludes certain items presented below. We believe this information is useful in providing period-to-period comparisons of the results of our operations. This measure is not in accordance with, or an alternative to, generally accepted accounting principles in the U.S. (GAAP). The most comparable GAAP measure is diluted earnings per share. Adjusted EPS should not be considered in isolation or as a substitution for analysis of our results as reported in accordance with GAAP. Other companies may calculate Adjusted EPS differently than we do, limiting the usefulness of the measure for comparisons with other companies.\nReconciliation of Non-GAAP \nAdjusted EPS\n2024\n2023 \n(a)\n2022\n(millions, except per share data)\nPretax\nNet of Tax\nPer Share Amounts\nPretax\nNet of Tax\nPer Share Amounts\nPretax\nNet of Tax\nPer Share Amounts\nGAAP diluted earnings per share\n$\n8.86 \n$\n8.94 \n$\n5.98 \nAdjustments\nOther \n(b)\n— \n— \n— \n— \n— \n— \n$\n20 \n$\n15 \n0.03 \nAdjusted diluted earnings per share\n$\n8.86 \n$\n8.94 \n$\n6.02 \nNote:  Amounts may not foot due to rounding.\n(a)\n2023 consisted of 53 weeks compared with 52 weeks in 2024 and 2022.\n(b)\nOther items unrelated to current period operations, none of which were individually significant.\nEarnings before interest expense and income taxes (EBIT) and earnings before interest expense, income taxes, depreciation, and amortization (EBITDA) are non-GAAP financial measures. We believe these measures provide meaningful information about our operational efficiency compared with our competitors by excluding the impact of differences in tax jurisdictions and structures, debt levels, and for EBITDA, capital investment. These measures are not in accordance with, or an alternative to, GAAP. The most comparable GAAP measure is net earnings. EBIT and EBITDA should not be considered in isolation or as a substitution for analysis of our results as reported in accordance with GAAP. Other companies may calculate EBIT and EBITDA differently, limiting the usefulness of the measures for comparisons with other companies.\nEBIT and EBITDA\n \n \nPercent Change\n(dollars in millions)\n2024\n2023 \n(a)\n2022\n2024/2023\n2023/2022\nNet earnings\n$\n4,091 \n$\n4,138 \n$\n2,780 \n(1.1)\n%\n48.8 \n%\n + Provision for income taxes\n1,170 \n1,159 \n638 \n0.9 \n81.7 \n + Net interest expense\n411 \n502 \n478 \n(18.1)\n5.0 \nEBIT\n$\n5,672 \n$\n5,799 \n$\n3,896 \n(2.2)\n%\n48.8 \n%\n + Total depreciation and amortization \n(b)\n2,981 \n2,801 \n2,700 \n6.4 \n3.8 \nEBITDA\n$\n8,653 \n$\n8,600 \n$\n6,596 \n0.6 \n%\n30.4 \n%\n(a)\n2023 consisted of 53 weeks compared with 52 weeks in 2024 and 2022.\n(b)\nRepresents total depreciation and amortization, including amounts classified within Depreciation and Amortization and within Cost of Sales.\nTARGET CORPORATION\n2024 Form 10-K\n30\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nRECONCILIATION OF NON-GAAP FINANCIAL MEASURES\nIndex to Financial Statements\nWe have also disclosed after-tax ROIC, which is a ratio based on GAAP information, with the exception of the add-back of operating lease interest to operating income. We believe this metric is useful in assessing the effectiveness of our capital allocation over time. Other companies may calculate ROIC differently, limiting the usefulness of the measure for comparisons with other companies.\nAfter-Tax Return on Invested Capital \n(dollars in millions)\nTrailing Twelve Months\nNumerator\nFebruary 1, 2025\nFebruary 3, 2024 \n(a)\nOperating income\n$\n5,566 \n$\n5,707 \n + Net other income\n106 \n92 \nEBIT\n5,672 \n5,799 \n + Operating lease interest \n(b)\n159 \n120 \n - Income taxes \n(c)\n1,297 \n1,295 \nNet operating profit after taxes\n$\n4,534\n \n$\n4,624\n \nDenominator\nFebruary 1, 2025\nFebruary 3, 2024\nJanuary 28, 2023\nCurrent portion of long-term debt and other borrowings\n$\n1,636 \n$\n1,116 \n$\n130 \n + Noncurrent portion of long-term debt\n14,304 \n14,922 \n16,009 \n + Shareholders' investment\n14,666 \n13,432 \n11,232 \n + Operating lease liabilities \n(d)\n3,935 \n3,608 \n2,934 \n - Cash and cash equivalents\n4,762 \n3,805 \n2,229 \nInvested capital\n$\n29,779 \n$\n29,273 \n$\n28,076 \nAverage invested capital \n(e)\n$\n29,526\n \n$\n28,674\n \nAfter-tax return on invested capital\n15.4\n \n%\n16.1\n \n%\n(a)\nConsisted of 53 weeks.\n(b)\nRepresents the add-back to operating income driven by the hypothetical interest expense we would incur if the property under our operating leases were owned or accounted for as finance leases. Calculated using the discount rate for each lease and recorded as a component of rent expense within Operating Income. Operating lease interest is added back to Operating Income in the ROIC calculation to control for differences in capital structure between us and our competitors.\n(c)\nCalculated using the effective tax rates, which were 22.2 percent and 21.9 percent for the trailing twelve months ended February 1, 2025, and February 3, 2024, respectively. Includes tax effect of $1.3 billion related to EBIT for each of the trailing twelve month periods ended February 1, 2025, and February 3, 2024, and $35 million and $26 million, respectively, related to operating lease interest.\n(d)\nTotal short-term and long-term operating lease liabilities included within Accrued and Other Current Liabilities and Noncurrent Operating Lease Liabilities.\n(e)\nAverage based on the invested capital at the end of the current period and the invested capital at the end of the comparable prior period.\nTARGET CORPORATION\n2024 Form 10-K\n31\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF FINANCIAL CONDITION\nIndex to Financial Statements\nAnalysis of Financial Condition\nLiquidity and Capital Resources\nCapital Allocation\nWe follow a disciplined and balanced approach to capital allocation based on the following priorities, ranked in order of importance: first, we fully invest in opportunities to profitably grow our business, create sustainable long-term value, and maintain our current operations and assets; second, we maintain a competitive quarterly dividend and seek to grow it annually; and finally, we return any excess cash to shareholders by repurchasing shares within the limits of our credit rating goals.\nOur year-end cash and cash equivalents balance increased to $4.8 billion from $3.8 billion in 2023. Our cash and cash equivalents balance includes short-term investments of $3.9 billion and $2.9 billion as of February 1, 2025, and February 3, 2024, respectively. Our investment policy is designed to preserve principal and liquidity of our short-term investments. This policy allows investments in large money market funds or in highly rated direct short-term instruments that mature in 60 days or less. We also place dollar limits on our investments in individual funds or instruments.\nOperating Cash Flows\nCash flows provided by operating activities were $7.4 billion in 2024 compared with $8.6 billion in 2023. The operating cash flow decrease is primarily due to higher income tax payments and the combined impact of inventory and accounts payable activity.\nInventory\nYear-end inventory was $12.7 billion in 2024, compared with $11.9 billion in 2023. The increase in inventory levels reflects \n•\nearlier inventory receipts compared to the prior year, including to support merchandising strategies; and\n•\ninventory investments in select merchandise categories to support sales growth and an improved in-stock position.\nTARGET CORPORATION\n2024 Form 10-K\n32\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF FINANCIAL CONDITION\nIndex to Financial Statements\nCapital Expenditures\nNote:  Amounts may not foot due to rounding.\nCapital expenditures in 2024 reflect investments in our strategic initiatives, including investments in both stores and in our supply chain, enhancing our capabilities and guest experience across stores and digital channels. The decrease in capital expenditures in 2024 compared with 2023 primarily reflects a slowdown in store remodel activities.\nWe expect capital expenditures in 2025 of approximately $4 billion to $5 billion, with the majority focused on store assets, including both new stores and remodels, as well as continued investment in supply chain and technology projects. We expect to open about 20 new stores during 2025 and to resume a faster pace of remodel activities compared with 2024. \nDividends\nWe paid dividends totaling $2.0 billion ($4.44 per share) in 2024 and $2.0 billion ($4.36 per share) in 2023, a per share increase of 1.8 percent. We declared dividends totaling $2.1 billion ($4.46 per share) in 2024 and $2.1 billion ($4.38 per share) in 2023, a per share increase of 1.8 percent. We have paid dividends every quarter since our 1967 initial public offering, and it is our intent to continue to do so in the future.\nShare Repurchases\nDuring 2024, we deployed $1.0 billion to repurchase shares. We did not repurchase any shares during 2023. See \nPart II\n, \nItem 5\n, \nMarket for the Registrant's Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\n of this Annual Report on Form 10-K and \nNote 20\n to the Financial Statements for more information.\nTARGET CORPORATION\n2024 Form 10-K\n33\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF FINANCIAL CONDITION\nIndex to Financial Statements\nFinancing\nOur financing strategy is to ensure liquidity and access to capital markets, to maintain a balanced spectrum of debt maturities, and to manage our net exposure to floating interest rate volatility. Within these parameters, we seek to minimize our borrowing costs. Our ability to access the long-term debt and commercial paper markets has provided us with ample sources of liquidity. Our continued access to these markets depends on multiple factors, including the condition of debt capital markets, our operating performance, and maintaining strong credit ratings. As of February 1, 2025, our credit ratings were as follows:\nCredit Ratings\nMoody's\nStandard and Poor's\nFitch\nLong-term debt\nA2\nA\nA\nCommercial paper\nP-1\nA-1\nF1\nIf our credit ratings were lowered, our ability to access the debt markets, our cost of funds, and other terms for new debt issuances could be adversely impacted. Each of the credit rating agencies reviews its rating periodically, and there is no guarantee our current credit ratings will remain the same as described above.\nWe have the ability to obtain short-term financing from time to time under our commercial paper program and credit facilities. In October 2024, we obtained a new committed $1.0 billion 364-day unsecured revolving credit facility that will expire in October 2025 and terminated our prior 364-day credit facility. This credit facility and our $3.0 billion unsecured revolving credit facility that will expire in October 2028 provide a liquidity backstop to our commercial paper program. No balances were outstanding under either credit facility at any time during 2024 or 2023. We did not have any balances outstanding under our commercial paper program as of February 1, 2025 or February 3, 2024.\nMost of our long-term debt obligations contain covenants related to secured debt levels. In addition to a secured debt level covenant, our credit facilities also contain a debt leverage covenant. We are, and expect to remain, in compliance with these covenants. Additionally, as of February 1, 2025, no notes or debentures contained provisions requiring acceleration of payment upon a credit rating downgrade, except that certain outstanding notes allow the note holders to put the notes to us if within a matter of months of each other we experience both (i) a change in control and (ii) our long-term credit ratings are either reduced and the resulting rating is non-investment grade, or our long-term credit ratings are placed on watch for possible reduction and those ratings are subsequently reduced and the resulting rating is non-investment grade.\nNote 15\n to the Financial Statements provides additional information.\nFuture Cash Requirements\nWe enter into contractual obligations in the ordinary course of business that may require future cash payments. Such obligations include, but are not limited to, purchase commitments, debt service, leasing arrangements, and liabilities related to deferred compensation and pensions. The \nNotes to the Consolidated Financial Statements\n provide additional information. \nWe believe our sources of liquidity, namely operating cash flows, credit facility capacity, and access to capital markets, will continue to be adequate to meet our contractual obligations, working capital and capital expenditure requirements, finance anticipated expansion and strategic initiatives, fund debt maturities, pay dividends, and execute purchases under our share repurchase program for the foreseeable future.\nCritical Accounting Estimates\nOur consolidated financial statements are prepared in accordance with GAAP, which requires us to make estimates and apply judgments that affect the reported amounts. In the \nNotes to the Consolidated Financial Statements\n, we describe the significant accounting policies used in preparing the consolidated financial statements. Our management has discussed the\n development, selection, and disclosure of our critical accounting estimates with the Audit & Risk Committee of our Board \nof Directors. The following items require significant estimation or judgment:\nTARGET CORPORATION\n2024 Form 10-K\n34\nMANAGEMENT'S DISCUSSION AND ANALYSIS\nTable of Contents\nANALYSIS OF FINANCIAL CONDITION\nIndex to Financial Statements\nInventory and cost of sales:\n    The vast majority of our inventory is accounted for under the retail inventory accounting method using the last-in, first-out method (LIFO). Our inventory is valued at the lower of LIFO cost or market. We reduce inventory for estimated losses related to shrink and markdowns. Our shrink estimate is based on historical losses and is adjusted to reflect results of actual physical inventory counts. We generally perform counts at each location annually, with counts taking place throughout the year. A 10 percent increase or decrease in our 2024 year-end inventory shrink reserve would impact our cost of sales by approximately $150 million. Historically, our actual physical inventory count results have shown our estimates to be reasonably accurate. Market adjustments for markdowns are recorded when the salability of the merchandise has diminished. Salability can be impacted by consumer preferences and seasonality, among other factors. We believe the risk of inventory obsolescence is largely mitigated because our inventory typically turns in less than three months. Inventory was $12.7 billion and $11.9 billion as of February 1, 2025, and February 3, 2024, respectively, and is further described in \nNote 8\n to the Financial Statements.\nVendor income:\n    We receive various forms of consideration from our vendors (vendor income), principally earned as a result of volume rebates, promotions, advertising allowances, and markdown allowances. Vendor income is recorded as a reduction of cost of sales except in arrangements where the payment is a reimbursement of specific, incremental, and identifiable costs and recorded as an offset to those costs. Vendor income earned can vary based on a number of factors, including purchase volumes, sales volumes, and our pricing and promotion strategies.\nWe establish a receivable for vendor income that is earned but not yet received. Based on historical trending and data, this receivable is computed by forecasting vendor income collections and estimating the amount earned. The majority of the year-end vendor income receivables are collected within the following fiscal quarter, and we do not believe there is a reasonable likelihood that the assumptions used in our estimate will change significantly. Historically, adjustments to our vendor income receivable have not been material. Vendor income receivable was $543 million and $513 million as of February 1, 2025, and February 3, 2024, respectively. Vendor income is described further in \nNote 4\n to the Financial Statements.\nLong-lived assets:\n    Long-lived assets are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amounts may not be recoverable. The evaluation is performed primarily at the store level. An impairment loss is recognized when estimated undiscounted future cash flows from the operation and/or eventual disposition of the asset or asset group are less than its carrying amount, and is measured as the excess of its carrying amount over fair value. We estimate fair value by obtaining market appraisals, obtaining valuations from third-party brokers, or using other valuation techniques. We recorded impairments of $68 million, $102 million, and $66 million in 2024, 2023, and 2022, respectively, which are described further in \nNote 10\n to the Financial Statements.\nInsurance/self-insurance:\n    We retain a substantial portion of the risk related to certain general liability, workers' compensation, property loss, and team member medical and dental claims. However, we maintain stop-loss coverage to limit the exposure related to certain risks. Liabilities associated with these losses include estimates of both claims filed and losses incurred but not yet reported. We use actuarial methods which consider a number of factors to estimate our ultimate cost of losses. General liability and workers' compensation liabilities are recorded based on our estimate of their net present value; other liabilities referred to above are not discounted. Our workers' compensation and general liability accrual was $772 million and $650 million as of February 1, 2025, and February 3, 2024, respectively. We believe that the amounts accrued are appropriate; however, our liabilities could be significantly affected if future occurrences or loss developments differ from our assumptions. For example, a 10 percent increase or decrease in average claim costs would have impacted our self-insurance expense by $77 million in 2024. Historically, adjustments to our estimates have not been material. Refer to \nPart II\n,",
  "item2": null
}