{
  "source_file": "tmo-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.    Business\nDescription of Business\nThermo Fisher Scientific Inc. (also referred to in this document as “Thermo Fisher,” “we,” the “company,” or the “registrant”) is the world leader in serving science. Our Mission is to enable our customers to make the world healthier, cleaner and safer. We serve customers working in pharmaceutical and biotech companies, hospitals and clinical diagnostic labs, universities, research institutions and government agencies, as well as environmental, industrial, research and development, quality and process control settings. Our global team delivers an unrivaled combination of innovative technologies, purchasing convenience and pharmaceutical services through our industry-leading brands, including Thermo Scientific, Applied Biosystems, Invitrogen, Fisher Scientific, Unity Lab Services, Patheon and PPD.\nWe continuously increase our depth of capabilities across our broad portfolio of innovative products and services and leverage our extensive global channels to address our customers’ needs. We do this through organic investments in research and development, capacity and capabilities and through acquisitions. Our goal is to enable our customers to be more productive in an increasingly competitive business environment, enable them to accelerate innovation, solve their challenges and advance their important work.\nBusiness Segments and Products\nWe report our business in four segments – Life Sciences Solutions, Analytical Instruments, Specialty Diagnostics, and Laboratory Products and Biopharma Services.\nLife Sciences Solutions Segment\nThrough our Life Sciences Solutions segment, we provide an extensive portfolio of reagents, instruments and consumables used in biological and medical research, discovery and production of new drugs and vaccines as well as diagnosis of infection and disease. These products and services are used by customers in pharmaceutical, biotechnology, agricultural, clinical, healthcare, academic, and government markets. Life Sciences Solutions includes three primary businesses – Biosciences, Genetic Sciences, and BioProduction.\nOur biosciences business includes reagents, instruments and consumables that help our customers conduct biological and medical research in areas such as molecular biology and protein biology, discover new drugs and vaccines, and enable the diagnosis of infection and disease. Our genetic sciences business combines a wide variety of instruments and related reagents used to provide high-value genomic and proteomic solutions to assist customer decisions in the research, clinical, healthcare and applied markets. Our bioproduction business supports developers and manufacturers of biological-based therapeutics and vaccines with a portfolio of premium solutions and services focused on upstream cell culture, downstream purification, analytics for detection and quantitation of process/product impurities, and a suite of single-use solutions spanning the biologics workflow.\n3\nTHERMO FISHER SCIENTIFIC INC.\nAnalytical Instruments Segment\nThrough our Analytical Instruments segment, we provide a broad offering of instruments and the supporting consumables, software and services that are used for a range of applications. These products and services are used by customers in pharmaceutical, biotechnology, academic, government, environmental and other research and industrial markets, as well as the clinical laboratory. This segment includes three primary businesses – Chromatography and Mass Spectrometry, Chemical Analysis, and Electron Microscopy.\nOur chromatography and mass spectrometry business develops and provides analytical instrumentation for organic and inorganic sample analysis across both applied technologies and scientific research. Our chemical analysis products fall into three main categories: production, process and analytics; field and safety instruments; and environmental and process instruments. Our electron microscopy business serves customers in the life sciences, materials sciences, and semiconductor markets providing leading research tools; and also, in the semiconductor market provides integrated workflows that power research and development and production solutions.\nSpecialty Diagnostics Segment\nOur Specialty Diagnostics segment offers a wide range of diagnostic test kits, reagents, culture media, instruments and associated products to serve customers in healthcare, clinical, pharmaceutical, industrial, and food safety laboratories. Our healthcare products are used to increase the speed and accuracy of diagnoses, which improves patient care in a more cost-efficient manner. This segment has five primary businesses – Clinical Diagnostics, ImmunoDiagnostics, Microbiology, Transplant Diagnostics and our Healthcare Market Channel. \nOur clinical diagnostics products include a broad offering of liquid, ready-to-use and lyophilized immunodiagnostic reagent kits, calibrators, controls, protein detection assays, and instruments.  Such products are used for, among other things, drugs-of-abuse testing, therapeutic drug monitoring, thyroid hormone testing, sepsis screening, serum toxicity, first trimester screening, tumor markers testing, and the diagnosis and monitoring of multiple myeloma. Our immunodiagnostics offerings include developing, manufacturing and marketing complete blood-test systems to support the clinical diagnosis and monitoring of allergy, asthma and autoimmune diseases. Our microbiology offerings include dehydrated and prepared culture media, collection and transport systems, instrumentation and consumables to detect pathogens in blood, diagnostic and rapid direct specimen tests, quality-control products and associated products for the microbiology laboratory. Our transplant diagnostics products include human leukocyte antigen typing and testing for the organ transplant market. Our healthcare market channel offerings include a broad array of consumables, diagnostic kits and reagents, equipment, instruments, solutions and services for hospitals, clinical laboratories, reference laboratories, physicians’ offices and other clinical testing facilities. \nLaboratory Products and Biopharma Services Segment\nOur Laboratory Products and Biopharma Services segment offers virtually everything needed for the laboratory. Our unique combination of self-manufactured and sourced products and extensive service offering enables our customers to focus on their core activities and helps them to be more innovative, productive and cost-efficient. The segment also includes a comprehensive offering of outsourced services used by the pharmaceutical and biotech industries for drug development, clinical research, clinical trials services and commercial drug manufacturing. We serve the pharmaceutical, biotechnology, academic, government and other research and industrial markets, as well as the clinical laboratory market through four key businesses: Laboratory Products, Research and Safety Market Channel, Pharma Services and Clinical Research.\nOur laboratory products include lab consumables, equipment and chemicals that are used for life science research and drug discovery and development to advance the prevention and cure of diseases and enhance quality of life. Our research and safety market channel offers a mix of products that are manufactured by Thermo Fisher, by third parties for us on a private-label basis, and by third parties under their brands but offered for sale through us. Our pharma services business provides the entire spectrum of development, manufacturing and clinical trials services for both small-molecule and large-molecule pharmaceuticals. Our clinical research business offers comprehensive, integrated clinical development and analytical services including all phases of development (i.e., Phases I-IV), peri- and post-approval and site and patient access services.\nSales and Marketing\nWe market and sell our products and services through a direct sales force, customer-service professionals, electronic commerce and third-party distributors. Our global team delivers a combination of innovative technologies, purchasing convenience and pharmaceutical services through our industry-leading brands, including Thermo Scientific, Applied Biosystems, Invitrogen, Fisher Scientific, Unity Lab Services, Patheon and PPD.\nWe have approximately 15,000 sales personnel including highly trained technical specialists who enable us to better meet the needs of our more technical end-users. We also provide customers with product standardization and other supply-chain-management services to reduce procurement costs.\n4\nTHERMO FISHER SCIENTIFIC INC.\nNew Products and Research and Development\nOur business includes the development and introduction of new products and may include entry into new business segments. We anticipate that we will continue to make significant expenditures for research and development as we seek to provide a continuing flow of innovative products to maintain and improve our competitive position.\nResources\nRaw Materials\nOur management team believes that we have a readily available supply of raw materials for all of our significant products from various sources. No single supplier is material, although for reasons of quality assurance, regulatory requirements, cost effectiveness, availability or uniqueness of design, certain materials components may be sourced from a single supplier or a limited number of suppliers that can readily provide such materials or components.\nRaw material and fuel prices are subject to fluctuations due to market conditions. We employ many strategies, including the use of alternative materials, to mitigate the effect of these fluctuations on our results.\nPatents, Licenses and Trademarks\nPatents are important in many aspects of our business. No particular patent, or related group of patents, is so important, however, that its loss would significantly affect our operations as a whole. Where appropriate, we seek patent protection for inventions and developments made by our personnel that are incorporated into our products or otherwise fall within our fields of interest. Patent rights resulting from work sponsored by outside parties do not always accrue exclusively to the company and may be limited by agreements or contracts.\nWe protect some of our technology as trade secrets and, where appropriate, we use trademarks or register trademarks used in connection with products. We also enter into license agreements with others to grant and/or receive rights to intellectual property rights.\nAll trademarks, trade names, product names, graphics and logos of Thermo Fisher contained herein are trademarks or registered trademarks of Thermo Fisher or its subsidiaries, as applicable, in the United States and/or other countries. Solely for convenience, we may refer to trademarks in this Annual Report on Form 10-K without the ™ and ® symbols. Such references are not intended to indicate, in any way, that we will not assert, to the fullest extent permitted by law, our rights to our trademarks. To the extent other trademarks appear in this Annual Report on Form 10-K, they are the property of their respective owners.\nSeasonal Influences\nRevenues in the fourth quarter are historically stronger than in other quarters due to the capital spending patterns of industrial, pharmaceutical and government customers. Sales of seasonal products, such as allergy and flu tests and related diagnostic products, vary quarter to quarter and year to year. \nCompetition\nThe company encounters aggressive and able competition in virtually all of the markets we serve. Because of the diversity of our products and services, we face many different types of competitors and competition. Our competitors include a broad range of manufacturers, third-party distributors and service providers. Competitive climates in many of the markets we serve are characterized by changing technology and customer demands that require continuing research and development. Our success primarily depends on the following factors:\n•\ntechnical performance and advances in technology that result in new products and improved price/performance ratios;\n•\nproduct differentiation, availability and reliability;\n•\nthe depth of our capabilities;\n•\nour reputation among customers as a quality provider of products and services;\n•\ncustomer service and support;\n•\nactive research and application-development programs; and\n•\nrelative prices of our products and services.\n5\nTHERMO FISHER SCIENTIFIC INC.\nGovernment Regulation\nEnvironmental Regulations\nWe are subject to various laws and governmental regulations concerning environmental matters and employee safety and health in the United States and other countries. U.S. federal environmental legislation that affects us includes the Toxic Substances Control Act, the Resource Conservation and Recovery Act, the Clean Air Act, the Clean Water Act, the Safe Drinking Water Act, and the Comprehensive Environmental Response Compensation and Liability Act (CERCLA). We are also subject to regulation by the Occupational Safety and Health Administration (OSHA) concerning employee safety and health matters. The United States Environmental Protection Agency (USEPA), OSHA, and other federal agencies have the authority to promulgate regulations that have an effect on our operations.\nIn addition to these federal laws and regulations, various states have been delegated certain authority under the aforementioned federal statutes and have authority over these matters under state laws. Many state and local governments have adopted environmental and employee safety and health laws and regulations, some of which are similar to federal requirements.\nA number of our operations involve the handling, manufacturing, use or sale of substances that are or could be classified as toxic or hazardous materials within the meaning of applicable laws. Consequently, some risk of environmental harm is inherent in our operations and products, as it is with other companies engaged in similar businesses.\nOur expenses for environmental requirements are incurred generally for ongoing compliance and historical remediation matters. Based on current information, we believe that these compliance costs are not material. For historical remediation obligations, our expenditures relate primarily to the cost of permitting, installing, and operating and maintaining groundwater-treatment systems and other remedial measures.\nOur Fair Lawn and Somerville, New Jersey facilities entered into administrative consent orders with the New Jersey Department of Environmental Protection in 1984 to maintain groundwater-remediation activities at these sites, and are currently under the State’s Licensed Site Remediation Professional Program. As the owner of the Fair Lawn facility, we are listed as a potentially responsible party for remediation within an area called the Fair Lawn Wellfields Superfund Site, and, in 2008, the company and certain other parties entered into a consent order with the USEPA to complete a Remedial Investigation/Feasibility Study. In 2018, the USEPA issued a Record of Decision, setting forth the scope of required remediation work at the site, which includes upgrading a water treatment plant to address constituents such as chlorinated organic compounds, 1,4-dioxane, and perfluorooctanoic acid/perfluorooctane sulfonate (PFOA/PFOS). In 2020, the court approved a consent decree that requires the company and another responsible party to finance and perform the required remediation work with USEPA oversight. In 2023, the design of a groundwater treatment plant was fully approved by USEPA. Construction commenced in 2024, and the plant is expected to be fully operating by April 2025.\nIn 2011, our Life Technologies subsidiary entered into a consent decree with the USEPA and other responsible parties to implement a groundwater remedy at the former Davis Landfill Superfund site in Smithfield, Rhode Island. After years of additional study, in September, 2020, USEPA revised its cleanup plan by selecting an interim remedial approach that includes groundwater treatment followed by additional monitoring of site conditions. Depending on the results of these treatment and monitoring activities over the next several years, USEPA anticipates selecting a final groundwater remedy for the site. In November 2021, the 2011 consent decree was amended to reflect the parties’ obligations to implement USEPA’s interim remedy, for which pre-design work commenced during 2022 and is ongoing.\nWe record accruals for environmental liabilities based on current interpretations of environmental laws and regulations when it is probable that a liability has been incurred and the amount of such liability can be reasonably estimated. We calculate estimates based upon several factors, including reports prepared by environmental specialists and management’s knowledge and experience with these environmental matters. We include in these estimates potential costs for investigation, remediation and operation and maintenance of cleanup sites. Accrued liabilities for environmental matters totaled $81 million at December 31, 2024.\nThese environmental liabilities do not include third-party recoveries to which we may be entitled. We believe that our accrual is adequate for the environmental liabilities we currently expect to incur. As a result, we believe that our ultimate liability with respect to environmental matters will not have a material adverse effect on our financial position, results of operations or cash flows. However, we may be subject to remedial or compliance costs due to future events, such as changes in existing laws and regulations, changes in agency direction or enforcement policies, developments in remediation technologies, changes in the conduct of our operations, and the effect of changes in accounting rules, which could have a material adverse effect on our financial position, results of operations or cash flows. For a discussion of the environmental laws and regulations that the Company’s operations, products and services are subject to and other environmental contingencies, refer to Note 5 to our Consolidated Financial Statements.\n6\nTHERMO FISHER SCIENTIFIC INC.\nOther Laws and Regulations\nOur operations, and some of the products and services we offer, are subject to a number of complex and stringent laws and regulations governing the development, testing, approval, production, handling, transportation and distribution of chemicals, drugs and other similar products, including the operating and security standards of the Food and Drug Administration, the Drug Enforcement Administration, the Bureau of Alcohol, Tobacco, Firearms and Explosives, and various state boards of pharmacy as well as comparable state and foreign agencies. As Thermo Fisher’s businesses also include export and import activities, we are subject to pertinent laws enforced by the U.S. Departments of Commerce, State and Treasury. In addition, our logistics activities must comply with the rules and regulations of the Department of Transportation, the Federal Aviation Administration and similar foreign agencies. While we believe we are in compliance in all material respects with such laws and regulations, any noncompliance could result in substantial fines or otherwise restrict our ability to provide competitive distribution services and thereby have an adverse effect on our financial condition. To date, no such laws or regulations have had a material impact on our operations.\nWe are subject to laws and regulations governing government contracts, and failure to address these laws and regulations or comply with government contracts could harm our business by leading to a reduction in revenues associated with these customers. We have agreements relating to the sale of our products to government entities and, as a result, we are subject to various statutes and regulations that apply to companies doing business with the government. We are also subject to investigation for compliance with the regulations governing government contracts. A failure to comply with these regulations could also result in suspension of these contracts, criminal, civil and administrative penalties or debarment.\nFor a discussion of risks related to changes in governmental regulations, refer to “\nRisk Factors\n” in Part I, Item 1A.\nHuman Capital\nThe success of Thermo Fisher is fueled by colleagues who are highly engaged and feel empowered to achieve their goals. Everything we do starts with our Mission - to enable our customers to make the world healthier, cleaner and safer. Our colleagues understand the role they play in fulfilling that Mission and that inspires them to bring their best to work each day. Our Mission is not only a differentiator for us externally, but a motivator for us internally. \nOur culture is a competitive advantage and is rooted in our 4i Values of Integrity, Intensity, Innovation and Involvement. Our values are woven into our ways of working, embedded in every stage of our colleague lifecycle - from recruiting to onboarding, training, development and longer-term career planning. Within this framework, we strive to create a safe, fair and positive working environment for our colleagues around the world. We want our teams to feel they have a stake in our success, a voice in our direction and to be empowered to make a difference for the key stakeholders we serve. \nWe also prioritize engagement, empowerment and continuous improvement to enable colleagues to contribute, collaborate and innovate. To advance this goal, we conduct an annual Employee Involvement Survey to solicit direct feedback from our colleagues on what we’re doing well and where we need to improve. We then compile the feedback to measure our progress using three key indices: Leadership, Involvement and Inclusion. Our continued focus on enhancing our culture helps position our company to be an even better place to work.\nWe are committed to maintaining the strongest team in our industry, focusing on developing and retaining our colleagues, while leveraging our Mission and leadership brand to attract new colleagues to our company. As of December 31, 2024, we employed approximately 125,000 colleagues globally, with an approximate regional distribution as follows: 60,000 based in the Americas, 22,000 in the Asia-Pacific region, and nearly 43,000 in Europe, the Middle East and Africa (EMEA).\nIn today’s environment, we know talent is a key differentiator, and that building the strongest team in the industry is critical to our future. Our overarching goal from a talent perspective is to create opportunities for our colleagues to achieve their full potential and career aspirations here at Thermo Fisher. We encourage and support colleagues to enhance their skills, so they are in the best position to deliver on their goals and achieve their career objectives. From our colleague referral program, summer internships, university relations, to our Graduate Leadership Development Program, we continue to build strong internal and external talent channels. \nOnce on board, talent development at Thermo Fisher is a key organizational capability. We continue to make significant investments to support our colleagues along every step of their career journey. Our talent development framework incorporates a multi-faceted approach, including formal and self-paced training, networking opportunities, on-the-job stretch learning, coaching, mentoring and manager training utilizing contemporary technology solutions to support the broad needs of our workforce.\nWe provide multiple programs at all career levels, from online learning for all colleagues through Thermo Fisher University, to focused trainings for managers at various experience levels, to our Global Leadership Program for executives. We also support our colleagues’ career advancement through our tuition reimbursement program.\n7\nTHERMO FISHER SCIENTIFIC INC.\nIn a company our size, we can also actively manage our talent through rotational opportunities across our businesses, functions and geographies that help our colleagues gain new experiences, share knowledge and broaden their skills. Our executives and leaders participate in frequent talent discussions as well as formal reviews, leveraging workforce data and predictive analytics to better anticipate the talent requirements of our business based on our growth opportunities and market demand. \nThermo Fisher is dedicated to talent development to meet our evolving business needs and to provide our colleagues with opportunities for long and fulfilling careers. \nFurther, our total rewards package is regularly evaluated and measured against established benchmarks to ensure its effectiveness in recruiting and retention, and to continue to position Thermo Fisher as an employer of choice.  We deliver comprehensive rewards, including competitive base pay, and also provide a variety of incentive and equity programs that, by design, directly link the impact of colleague contributions to the company’s overall success.\nOur health and wellness programs provide competitive, flexible benefits that our global colleagues and their families can count on. For example, for U.S. colleagues, we offer a choice of comprehensive national medical, dental and vision plans; a wellness program, including valuable health incentive opportunities and tax-advantaged savings and spending accounts; as well as commuter support, employee assistance programs, optional group legal coverage, and company-paid disability, accident and life insurance. We also offer a company-paid proprietary program for cancer care called the Impact Program, which gives our colleagues and their families access to personalized support and direct lines of communication to experts in cancer genetics and genomics. Similar benefits are available in all countries around the world where we operate.\nWe also invest in our colleagues’ financial health, helping them to grow and protect their savings, plan for the future and share in the success of the company they are helping to build. \nAvailable Information\nThe company files annual, quarterly and current reports, proxy statements and other documents with the Securities and Exchange Commission (SEC) under the Exchange Act. The SEC maintains a website that contains reports, proxy and information statements and other information that issuers, including the company, file electronically with the SEC. The public can obtain any documents that we file with the SEC at www.sec.gov. We also make available free of charge on or through our own website at www.thermofisher.com our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and, if applicable, amendments to those reports filed or furnished pursuant to Section 13(a) of the Exchange Act as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. In addition, paper copies of these documents may be obtained free of charge by writing to the company care of its Investor Relations Department at our principal executive office located at 168 Third Avenue, Waltham, Massachusetts 02451.\nInformation about Our Executive Officers\nAs of February 20, 2025, our executive officers were:\nName\nAge\nPresent Title\n(Fiscal Year First Became Executive Officer)\nOther Positions Held\nMarc N. Casper\n56\nChairman, President and Chief Executive Officer (2001)\nPresident and Chief Executive Officer (2009-2020)\nChief Operating Officer (2008-2009)\nExecutive Vice President (2006-2009)\nStephen Williamson\n58\nSenior Vice President and Chief Financial Officer (2015)\nVice President, Financial Operations (2008-2015)\nMichel Lagarde\n51\nExecutive Vice President and Chief Operating Officer (2017)\nExecutive Vice President (2019-2021)\nSenior Vice President and President, Pharma Services (2017-2019)\nPresident and Chief Operating Officer, Patheon N.V. (2016-2017)\nFrederick M. Lowery\n54\nExecutive Vice President (2024)\nSenior Vice President and President, Customer Channels (2021-2024)\nSenior Vice President and President, Life Sciences Solutions and Laboratory Products (2017-2021)\nGianluca Pettiti\n46\nExecutive Vice President (2021)\nSenior Vice President and President, Specialty Diagnostics (2019-2021)\nPresident, Biosciences (2018-2019)\nPresident, China (2015-2017)\nMichael D. Shafer\n56\nExecutive Vice President (2024)\nSenior Vice President and President, Pharma Services (2019-2024)\nPresident, Materials and Structural Analysis (2016-2019)\n8\nTHERMO FISHER SCIENTIFIC INC.\nName\nAge\nPresent Title\n(Fiscal Year First Became Executive Officer)\nOther Positions Held\nMichael A. Boxer\n63\nSenior Vice President and General Counsel (2018)\nSenior Vice President, General Counsel and Secretary (2021-2022)\nLisa P. Britt\n56\nSenior Vice President and Chief Human Resources Officer (2017)\nJoseph R. Holmes\n46\nVice President and Chief Accounting Officer (2021)\nSenior Director, Technical Accounting (2017-2021)",
  "item7": "Item 7.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nReference is made throughout this Management’s Discussion and Analysis of Financial Condition and Results of Operations to Notes to the \nConsolidated Financial Statements\n, which begin on page \n29\n of this report. Management’s Discussion and Analysis of Financial Condition and Results of Operations for 2022 is included in Item 7 of the company’s 2023 \nAnnual Report on Form 10-K\n filed with the Securities and Exchange Commission. \nThe company refers to various amounts or measures not prepared in accordance with generally accepted accounting principles (non-GAAP measures). These non-GAAP measures are further described and reconciled to their most directly comparable amount or measure under the section “\nNon-GAAP Measures\n” later in this “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nAmounts and percentages reported within this Annual Report on Form 10-K are presented and calculated based on underlying unrounded amounts.  As a result, the sum of components may not equal corresponding totals due to rounding.\nOverview\nThermo Fisher Scientific Inc. enables customers to make the world healthier, cleaner and safer by helping them accelerate life sciences research, solve complex analytical challenges, increase laboratory productivity, and improve patient health through diagnostics and the development and manufacture of life-changing therapies. Markets served include pharmaceutical and biotech, academic and government, industrial and applied, as well as healthcare and diagnostics. The company’s operations fall into four segments (Note 11): Life Sciences Solutions, Analytical Instruments, Specialty Diagnostics and Laboratory Products and Biopharma Services. \nConsolidated Results\n(Dollars in millions except per share amounts)\n2024\n2023\nChange\nRevenues\n$\n42,879 \n$\n42,857 \n0 \n%\nGAAP operating income\n$\n7,337 \n$\n6,859 \n7 \n%\nGAAP operating income margin\n17.1 \n%\n16.0 \n%\n1.1 \n pt\nAdjusted operating income \n(non-GAAP measure)\n$\n9,707 \n$\n9,810 \n(1)\n%\nAdjusted operating income margin \n(non-GAAP measure)\n22.6 \n%\n22.9 \n%\n(0.3)\n pt\nGAAP diluted earnings per share attributable to Thermo Fisher Scientific Inc.\n$\n16.53 \n$\n15.45 \n7 \n%\nAdjusted earnings per share \n(non-GAAP measure)\n$\n21.86 \n$\n21.55 \n1 \n%\n19\nTHERMO FISHER SCIENTIFIC INC.\nOrganic Revenue Growth\nRevenue growth\n0 \n%\nImpact of acquisitions\n0 \n%\nImpact of currency translation\n0 \n%\nOrganic revenue growth \n(non-GAAP measure)\n0 \n%\nSince 2020, the Life Sciences Solutions and Specialty Diagnostics segments as well as the laboratory products business have supported COVID-19 diagnostic testing. Additionally, our pharma services business has provided our pharma and biotech customers with the services they needed to develop and produce vaccines and therapies globally. Since the company’s acquisition of PPD in December 2021, the clinical research business has continued to play a leading role in supporting the clinical trials for COVID-19 vaccines and therapies. These positive impacts continued at much lower levels in 2024 as customer testing as well as therapy and vaccine demand declined. Sales of products related to COVID-19 testing were $0.10 billion and $0.33 billion in 2024 and 2023, respectively. \nDuring 2024, all of our end markets were negatively impacted by a more muted macroeconomic environment and low economic activity in China. Revenues from pharma and biotech and diagnostics and healthcare customers were also negatively impacted by reduced demand for COVID-19 related products and services. As a result, revenues in these end markets declined slightly in the year. Revenues in the academic and government and industrial and applied markets increased slightly as we saw the benefits of our investments into high-impact innovation. During 2024, all geographies were negatively impacted by the more muted macroeconomic environment. Sales grew slightly in Asia-Pacific, including China. Sales growth in Europe was flat and sales in North America declined slightly due to decreased demand for COVID-19 related products. Contributions to organic revenue during 2024 from the Analytical Instruments, Specialty Diagnostics, and Laboratory Products and Biopharma Services segments were offset by declines in the Life Sciences Solutions segment. \nThe company continues to execute its proven growth strategy which consists of three pillars:\n•\nHigh-impact innovation,\n•\nOur trusted partner status with customers, and\n•\nOur unparalleled commercial engine.\nGAAP operating income margin and adjusted operating income margin decreased in 2024 due primarily to unfavorable business mix and strategic investments, partially offset by productivity improvements. The decreases in GAAP operating income margin during 2024 were more than offset by lower levels of amortization expense. We estimate that charges for restructuring and related actions incurred for headcount reductions and facility consolidations, which resulted in charges of approximately $0.3 billion in 2024 and $0.3 billion in 2023, will realize annual cost savings of approximately $0.2 billion and $0.6 billion, respectively, primarily due to reduced employee and facility expenses.\nThe company’s references to strategic investments generally refer to targeted spending for enhancing commercial capabilities, including expansion of geographic sales reach and e-commerce platforms, marketing initiatives, expanded service and operational infrastructure, research and development projects and other expenditures to enhance the customer experience, as well as incentive compensation and recognition for employees. The company’s references throughout this discussion to productivity improvements generally refer to improved cost efficiencies from its Practical Process Improvement (PPI) business system to address inflation, including reduced costs resulting from implementing continuous improvement methodologies, global sourcing initiatives, a lower cost structure following restructuring actions including headcount reductions and consolidation of facilities, and low cost region manufacturing.\nNotable Recent Acquisitions\nOn January 3, 2023, the company acquired, within the Specialty Diagnostics segment, The Binding Site Group, a U.K.-based provider of specialty diagnostic assays and instruments to improve the diagnosis and management of blood cancers and immune system disorders. The acquisition expands the segment’s portfolio with the addition of pioneering innovation in diagnostics and monitoring for multiple myeloma. \nOn August 14, 2023, the company acquired, within the Laboratory Products and Biopharma Services segment, CorEvitas, LLC, a U.S.-based provider of regulatory-grade, real-world evidence for approved medical treatments and therapies. The acquisition expands the segment’s portfolio with the addition of highly complementary real-world evidence solutions to enhance decision-making as well as the time and cost of drug development.\nOn July 10, 2024, the company acquired, within the Life Sciences Solutions segment, Olink Holding AB (publ), a Swedish-based provider of next-generation proteomics solutions. The acquisition enhances the segment’s capabilities in the high-growth proteomics market with the addition of highly differentiated solutions. It also complements the existing life sciences and mass \n20\nTHERMO FISHER SCIENTIFIC INC.\nspectrometry offerings, accelerating protein biomarker discovery and providing strong synergy opportunities.  \nSegment Results\nThe company’s management evaluates segment operating performance using operating income before certain charges/credits as defined in Note 11. Accordingly, the following segment data are reported on this basis.\n(Dollars in millions)\n2024\n2023\nRevenues\nLife Sciences Solutions\n$\n9,631 \n$\n9,977 \nAnalytical Instruments\n7,463 \n7,263 \nSpecialty Diagnostics\n4,512 \n4,405 \nLaboratory Products and Biopharma Services\n23,157 \n23,041 \nEliminations\n(1,885)\n(1,829)\nConsolidated revenues\n$\n42,879 \n$\n42,857 \nLife Sciences Solutions\nOrganic \n(non-GAAP measure)\n(Dollars in millions)\n2024\n2023\nTotal\nChange\nAcquisitions/ Divestitures\nCurrency\nTranslation\nRevenues\n$\n9,631 \n$\n9,977 \n(3)\n%\n1 \n%\n0 \n%\n(4)\n%\nSegment income\n3,503 \n3,420 \n2 \n%\nSegment income margin\n36.4 \n%\n34.3 \n%\n2.1 \n pt\nThe decrease in organic revenues in 2024 was primarily due to moderation in COVID-19 related revenue. The increase in segment income margin resulted primarily from exceptionally strong productivity improvements, partially offset by unfavorable volume mix and strategic investments. \nAnalytical Instruments\nOrganic \n(non-GAAP measure)\n(Dollars in millions)\n2024\n2023\nTotal\nChange\nAcquisitions/ Divestitures\nCurrency\nTranslation\nRevenues\n$\n7,463 \n$\n7,263 \n3 \n%\n0 \n%\n(1)\n%\n3 \n%\nSegment income\n1,955 \n1,908 \n2 \n%\nSegment income margin\n26.2 \n%\n26.3 \n%\n(0.1)\n pt\nThe increase in organic revenues in 2024 was due to very strong growth in the electron microscopy business, partially offset by declines in the other instrumentation businesses. The decrease in segment income margin resulted primarily from unfavorable business mix and strategic investments, largely offset by strong productivity improvements. \nSpecialty Diagnostics\nOrganic \n(non-GAAP measure)\n(Dollars in millions)\n2024\n2023\nTotal\nChange\nAcquisitions/ Divestitures\nCurrency\nTranslation\nRevenues\n$\n4,512 \n$\n4,405 \n2 \n%\n0 \n%\n0 \n%\n3 \n%\nSegment income\n1,159 \n1,124 \n3 \n%\nSegment income margin\n25.7 \n%\n25.5 \n%\n0.2 \n pt\nThe increase in organic revenues in 2024 was driven by growth in the immunodiagnostics and transplant diagnostics businesses, as well as in the healthcare market channel, partially offset by decreased demand for products addressing diagnosis of COVID-19. The increase in segment income margin was due to productivity improvements, partially offset by strategic investments. \n21\nTHERMO FISHER SCIENTIFIC INC.\nLaboratory Products and Biopharma Services\nOrganic \n(non-GAAP measure)\n(Dollars in millions)\n2024\n2023\nTotal\nChange\nAcquisitions/ Divestitures\nCurrency\nTranslation\nRevenues\n$\n23,157 \n$\n23,041 \n1 \n%\n0 \n%\n0 \n%\n0 \n%\nSegment income\n3,090 \n3,358 \n(8)\n%\nSegment income margin\n13.3 \n%\n14.6 \n%\n(1.3)\n pt\nOrganic revenues were flat in 2024 due to growth in the research and safety channel and clinical research business, offset by decreased demand in COVID-19 vaccines and therapies-related activity. The decrease in segment income margin was primarily due to unfavorable business mix and strategic investments, partially offset by productivity improvements.\nNon-operating Items\n(Dollars in millions)\n2024\n2023\nNet interest expense\n$\n312 \n$\n496 \nGAAP other income/(expense)\n12 \n(65)\nAdjusted other income/(expense) \n(non-GAAP measure)\n(6)\n(15)\nGAAP tax rate\n9.3 \n%\n4.5 \n%\nAdjusted tax rate \n(non-GAAP measure)\n10.5 \n%\n10.0 \n%\nWeighted average diluted shares\n383 \n388 \nNet interest expense (interest expense less interest income) decreased due primarily to higher cash, and cash equivalents and short-term investments balances, as well as higher interest rates on these balances when compared to 2023. See additional discussion under the caption “Liquidity and Capital Resources” below. In 2024 and 2023, the company’s net interest expense was reduced by approximately $264 million and $116 million, respectively, as a result of its interest rate swap and cross-currency interest rate swap arrangements (Note 10).\nGAAP other income/(expense) and adjusted other income/(expense) includes currency transaction gains/losses on non-operating monetary assets and liabilities, and net periodic pension benefit cost/(income), excluding the service cost component. GAAP other income/(expense) in 2024 and 2023 also includes $20 million and $(45) million, respectively, of net gains/(losses) on investments.  \nThe GAAP tax rate in 2024 was impacted by $176 million of expense, net, for a provision associated with a tax audit. The company’s 2024 GAAP and adjusted tax rates were also impacted by tax benefits of $459 million, primarily in jurisdictions where the deferred tax assets are now expected to be realized due to forecasted income.\nThe GAAP and adjusted tax rates in 2023 were impacted by changes in valuation allowances, including a $183 million release in a jurisdiction where the deferred tax assets are now expected to be realized, and, to a lesser extent, by a decrease in pre-tax earnings compared to 2022. The company’s GAAP and adjusted tax rates in 2023 were also impacted by tax planning initiatives, including a tax benefit of $127 million for U.S. tax credits and the revaluation of net operating loss carryforwards due to higher tax rates as a result of its tax return resubmissions, a tax benefit of $91 million, net of related tax expenses, from a foreign exchange loss on an intercompany debt refinancing transaction, and $233 million of tax benefits resulting from intra-entity transactions. The effective tax rates in both 2024 and 2023 were also affected by relatively significant earnings in lower tax jurisdictions. Due primarily to the non-deductibility of intangible asset amortization for tax purposes, the company’s cash payments for income taxes were higher than its income tax expense for financial reporting purposes. See additional discussion under the caption “Liquidity and Capital Resources” below.\nThe company expects its GAAP effective tax rate in 2025 will be between 9% and 11% based on currently forecasted rates of profitability in the countries in which the company conducts business and expected generation of foreign tax credits. The effective tax rate can vary significantly from period to period as a result of discrete income tax factors and events. The company expects its adjusted tax rate will be approximately 11.5% in 2025.\nThe company has operations and a taxable presence in approximately 70 countries outside the U.S. Some of these countries have lower tax rates than the U.S. The company’s ability to obtain a benefit from lower tax rates outside the U.S. is dependent on its relative levels of income in countries outside the U.S. and on the statutory tax rates in those countries. Based on the dispersion of the company’s non-U.S. income tax provision among many countries, the company believes that a change in the statutory tax rate in any individual country is not likely to materially affect the company’s income tax provision or net income.\nEquity in earnings/losses of unconsolidated entities was impacted by an $88 million impairment of an equity method investment in 2024.\n22\nTHERMO FISHER SCIENTIFIC INC.\nWeighted average diluted shares decreased in 2024 compared to 2023 due to share repurchases, net of option dilution.\nLiquidity and Capital Resources\nThe company’s proven growth strategy has enabled it to generate free cash flow as well as access the capital markets. The company deploys its capital primarily via mergers and acquisitions and secondarily via share buybacks and dividends.\nDecember 31,\nDecember 31,\n(In millions)\n2024\n2023\nCash and cash equivalents\n$\n4,009 \n$\n8,077 \nShort-term investments\n1,561 \n3 \nTotal debt\n31,275 \n34,917 \nApproximately half of the company’s cash balances and cash flows from operations are from outside the U.S. The company uses its non-U.S. cash for needs outside of the U.S. including acquisitions, capacity expansion, and repayment of third-party foreign debt by foreign subsidiaries. In addition, the company also transfers cash to the U.S. using non-taxable intercompany transactions, including loans and returns of capital, as well as dividends where the related U.S. dividend received deduction or foreign tax credit equals any tax cost arising from the dividends. As a result of using such means of transferring cash to the U.S., the company does not expect any material adverse liquidity effects from its significant non-U.S. cash balances for the foreseeable future. \nThe company believes that its existing cash and cash equivalents and its future cash flow from operations together with available borrowing capacity under its revolving credit agreement will be sufficient to meet the cash requirements of its existing businesses for the foreseeable future, including at least the next 24 months. \nAs of December 31, 2024, the company’s short-term obligations and current maturities of long-term obligations totaled $2.21 billion. The company has a revolving credit facility with a bank group that provides up to $5.00 billion of unsecured multi-currency revolving credit (Note 3). If the company borrows under this facility, it intends to leave undrawn an amount equivalent to outstanding commercial paper to provide a source of funds in the event that commercial paper markets are not available. As of December 31, 2024, no borrowings were outstanding under the company’s revolving credit facility, although available capacity was reduced by immaterial outstanding letters of credit.\n(In millions)\n2024\n2023\nNet cash provided by operating activities\n$\n8,667 \n$\n8,406 \nNet cash used in investing activities\n(5,841)\n(5,142)\nNet cash used in financing activities\n(6,792)\n(3,622)\nFree cash flow \n(non-GAAP measure)\n7,324 \n7,014 \nOperating Activities\nDuring 2024, net income provided substantially all cash from operating activities. Changes in working capital were not significant.  Cash payments for income taxes were $1.83 billion during 2024. \nDuring 2023, cash provided by income was offset in part by investments in working capital. A decrease in inventories provided cash of $0.60 billion. A decrease in accounts payable used cash of $0.50 billion, and changes in other assets and liabilities used cash of $0.80 billion primarily due to the timing of payments for compensation and income taxes. Cash payments for income taxes were $1.48 billion during 2023. \nThe company is contingently liable with respect to certain legal proceedings and related matters. An unfavorable outcome that differs materially from current accrual estimates, if any, for one or more of the matters described under the heading “Product Liability, Workers Compensation and Other Personal Injury Matters” in Note 5 could have a material adverse effect on the company’s financial position as well as its results of operations and cash flows.\nInvesting Activities\nDuring 2024, the acquisition of Olink Holding AB (publ) used cash of $3.13 billion. The company’s investing activities also included net purchases of investments of $1.63 billion, primarily to provide additional interest income, as well as $1.40 billion of property, plant and equipment for capacity and capability investments.\nDuring 2023, acquisitions of The Binding Site Group and CorEvitas, LLC used cash of $2.70 billion and $0.91 billion, respectively. The company’s investing activities also included purchases of $1.48 billion of property, plant and equipment for capacity and capability investments.\n23\nTHERMO FISHER SCIENTIFIC INC.\nThe company expects that for all of 2025, expenditures for property, plant and equipment, net of disposals, will be between $1.4 billion and $1.7 billion.\nFinancing Activities\nDuring 2024, issuance of debt provided $1.20 billion of cash. Repayment of debt used cash of $3.61 billion. The company’s financing activities also included the repurchase of $4.00 billion of the company’s common stock (7.4 million shares) and the payment of $0.58 billion in cash dividends. On November 15, 2024, the Board of Directors announced that it replaced the existing authorization to repurchase the company’s common stock, of which $1.00 billion was remaining, with a new authorization to repurchase up to $4.00 billion of the company’s common stock. \nEarly in the first quarter of 2025, the company repurchased $2.00 billion (3.6 million shares) of the company's common stock. At February 20, 2025, $1.00 billion was available for future repurchases of the company’s common stock under this authorization.\nIn the first quarter of 2025, the company issued Fr.1.15 billion of Swiss franc-denominated debt (Note 3).\nDuring 2023, issuance of debt provided $5.94 billion of cash. Repayment of debt and net commercial paper activity used cash of $5.78 billion and $0.32 billion, respectively. The company’s financing activities also included the repurchase of $3.00 billion of the company's common stock (5.2 million shares) and the payment of $0.52 billion in cash dividends.\nIn addition to the obligations on the balance sheet at December 31, 2024, which include, but are not limited to pension obligations (Note 14), unrecognized tax benefits (Note 7), debt (Note 3), operating leases (Note 13), and contingent consideration (Note 4), the company also has unconditional purchase obligations in the ordinary course of business that include agreements to purchase goods, services or fixed assets, pay royalties, and fund capital commitments pursuant to investments held by the company (Note 5).   \nNon-GAAP Measures\nIn addition to the financial measures prepared in accordance with generally accepted accounting principles (GAAP), we use certain non-GAAP financial measures such as organic revenue growth, which is reported revenue growth, excluding the impacts of revenues from acquired/divested businesses and the effects of currency translation. We report organic revenue growth because Thermo Fisher management believes that in order to understand the company’s short-term and long-term financial trends, investors may wish to consider the impact of acquisitions/divestitures and foreign currency translation on revenues. Thermo Fisher management uses organic revenue growth to forecast and evaluate the operational performance of the company as well as to compare revenues of current periods to prior periods.\nWe report adjusted operating income, adjusted operating margin, adjusted other income/(expense), adjusted tax rate, and adjusted EPS. We believe that the use of these non-GAAP financial measures, in addition to GAAP financial measures, helps investors to gain a better understanding of our core operating results and future prospects, consistent with how management measures and forecasts the company’s core operating performance, especially when comparing such results to previous periods, forecasts, and to the performance of our competitors. Such measures are also used by management in their financial and operating decision-making and for compensation purposes. To calculate these measures we exclude, as applicable:\n•\nCertain acquisition-related costs, including charges for the sale of inventories revalued at the date of acquisition, significant transaction/acquisition-related costs, including changes in estimates of contingent acquisition-related consideration, and other costs associated with obtaining short-term financing commitments for pending/recent acquisitions. We exclude these costs because we do not believe they are indicative of our normal operating costs.\n•\nCosts/income associated with restructuring activities and large-scale abandonments of product lines, such as reducing overhead and consolidating facilities. We exclude these costs because we believe that the costs related to restructuring activities and large-scale abandonment of product lines are not indicative of our normal operating costs.\n•\nEquity in earnings/losses of unconsolidated entities; impairments of long-lived assets; and certain other gains and losses that are either isolated or cannot be expected to occur again with any predictability, including gains/losses on investments, the sale of businesses, product lines, and real estate, significant litigation-related matters, curtailments/settlements of pension plans, and the early retirement of debt. We exclude these items because they are outside of our normal operations and/or, in certain cases, are difficult to forecast accurately for future periods. \n•\nThe expense associated with the amortization of acquisition-related intangible assets because a significant portion of the purchase price for acquisitions may be allocated to intangible assets that have lives of up to 20 years. Exclusion of the amortization expense allows comparisons of operating results that are consistent over time for both our newly acquired and long-held businesses and with both acquisitive and non-acquisitive peer companies.\n24\nTHERMO FISHER SCIENTIFIC INC.\n•\nThe noncontrolling interest and tax impacts of the above items and the impact of significant tax audits or events (such as changes in deferred taxes from enacted tax rate/law changes), the latter of which we exclude because they are outside of our normal operations and difficult to forecast accurately for future periods.\nWe report free cash flow, which is operating cash flow excluding net capital expenditures, to provide a view of the continuing operations’ ability to generate cash for use in acquisitions and other investing and financing activities. The company also uses this measure as an indication of the strength of the company. Free cash flow is not a measure of cash available for discretionary expenditures since we have certain non-discretionary obligations such as debt service that are not deducted from the measure.\nThe non-GAAP financial measures of the company’s results of operations and cash flows included in this Form 10-K are not meant to be considered superior to or a substitute for the company’s results of operations prepared in accordance with GAAP. Reconciliations of such non-GAAP financial measures to the most directly comparable GAAP financial measures are set forth within the “Consolidated Results” and “Segment Results” sections and below. \n(Dollars in millions except per share amounts)\n2024\n2023\nReconciliation of adjusted operating income and adjusted operating income margin\nGAAP operating income\n$\n7,337 \n17.1 \n%\n$\n6,859 \n16.0 \n%\nCost of revenues adjustments (a)\n47 \n0.1 \n%\n95 \n0.2 \n%\nSelling, general and administrative expenses adjustments (b)\n(8)\n0.0 \n%\n59 \n0.1 \n%\nRestructuring and other costs (c)\n379 \n0.9 \n%\n459 \n1.1 \n%\nAmortization of acquisition-related intangible assets\n1,952 \n4.6 \n%\n2,338 \n5.5 \n%\nAdjusted operating income \n(non-GAAP measure)\n$\n9,707 \n22.6 \n%\n$\n9,810 \n22.9 \n%\nReconciliation of adjusted other income/(expense)\nGAAP other income/(expense)\n$\n12 \n$\n(65)\nAdjustments (d)\n(19)\n50 \nAdjusted other income/(expense) \n(non-GAAP measure)\n$\n(6)\n$\n(15)\nReconciliation of adjusted tax rate\nGAAP tax rate\n9.3 \n%\n4.5 \n%\nAdjustments (e)\n1.2 \n%\n5.5 \n%\nAdjusted tax rate \n(non-GAAP measure)\n10.5 \n%\n10.0 \n%\nReconciliation of adjusted earnings per share\nGAAP diluted earnings per share (EPS) attributable to Thermo Fisher Scientific Inc.\n$\n16.53 \n$\n15.45 \nCost of revenues adjustments (a)\n0.12 \n0.24 \nSelling, general and administrative expenses adjustments (b)\n(0.02)\n0.15 \nRestructuring and other costs (c)\n0.99 \n1.18 \nAmortization of acquisition-related intangible assets\n5.09 \n6.03 \nOther income/expense adjustments (d)\n(0.05)\n0.13 \nBenefit from/(provision for) income taxes adjustments (e)\n(0.86)\n(1.66)\nEquity in earnings/losses of unconsolidated entities\n0.11 \n0.15 \nNoncontrolling interests adjustments (f)\n(0.05)\n(0.12)\nAdjusted EPS \n(non-GAAP measure)\n$\n21.86 \n$\n21.55 \nReconciliation of free cash flow\nGAAP net cash provided by operating activities\n$\n8,667 \n$\n8,406 \nPurchases of property, plant and equipment\n(1,400)\n(1,479)\nProceeds from sale of property, plant and equipment\n57 \n87 \nFree cash flow\n (non-GAAP measure)\n$\n7,324 \n$\n7,014 \n(a)\nAdjusted results in 2024 and 2023 exclude charges for inventory write-downs associated with large-scale abandonment of product lines, accelerated depreciation on manufacturing assets to be abandoned due to facility consolidations, and charges for the sale of inventory revalued at the date of acquisition.\n25\nTHERMO FISHER SCIENTIFIC INC.\n(b)\nAdjusted results in 2024 and 2023 exclude certain third-party expenses, principally transaction/integration costs related to recent acquisitions, charges/credits for changes in estimates of contingent acquisition consideration, and charges associated with product liability litigation. Adjusted results in 2024 also exclude $7 million of accelerated depreciation on fixed assets to be abandoned due to facility consolidations.\n(c)\nAdjusted results in 2024 and 2023 exclude restructuring and other costs consisting principally of severance, impairments of long-lived assets, charges for environmental-related matters, net charges for pre-acquisition litigation and other matters, net gains/losses on the sale of real estate, and abandoned facility and other expenses of headcount reductions and real estate consolidations. Adjusted results in 2023 also exclude $26 million of contract termination costs associated with facility closures. \n(d)\nAdjusted results exclude net gains/losses on investments.\n(e)\nAdjusted results in 2024 and 2023 exclude incremental tax impacts for the reconciling items between GAAP and adjusted net income, incremental tax impacts as a result of tax rate/law changes and the tax impacts from audit settlements. Adjusted results in 2023 also exclude $14 million of net charges for pre-acquisition matters.\n(f)\nAdjusted results exclude the incremental impacts for the reconciling items between GAAP and adjusted net income attributable to noncontrolling interests. \nCritical Accounting Policies and Estimates\nThe company’s discussion and analysis of its financial condition and results of operations is based upon its financial statements, which have been prepared in accordance with accounting principles generally accepted in the United States of America. The preparation of these financial statements requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosure of contingent liabilities. On an on-going basis, management evaluates its estimates, including those related to acquisition-related measurements and income taxes. Management believes the most complex and sensitive judgments, because of their significance to the consolidated financial statements, result primarily from the need to make estimates about the effects of matters that are inherently uncertain. Management bases its estimates on historical experience, current market and economic conditions and other assumptions that management believes are reasonable. The results of these estimates form the basis for judgments about the carrying value of assets and liabilities where the values are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions. \nThe company believes the following represent its critical accounting policies and estimates used in the preparation of its financial statements:\nAcquisition-related Measurements\n \nBusiness Combinations\nThe company uses assumptions and estimates in determining the fair value of assets acquired and liabilities assumed in business combinations. The determinations of the fair value of intangible assets, which represent a significant portion of the purchase price in many of the company’s acquisitions, require the use of significant judgment with regard to (i) the fair value and (ii) whether such intangibles are amortizable or non-amortizable and, if the former, the period and the method by which the intangible asset will be amortized. The company estimates the fair value of acquisition-related intangible assets principally based on projections of cash flows that will arise from identifiable intangible assets of acquired businesses, which include estimates of customer attrition and technology obsolescence rates, among others. The projected cash flows are discounted to determine the present value of the assets at the dates of acquisition. See Note 12 for additional information about our recent business combinations.\nGoodwill and Indefinite-lived Intangible Assets\nThe company evaluates goodwill and indefinite-lived intangible assets for impairment annually and when events occur or circumstances change that would more likely than not reduce the fair value of an asset below its carrying amount. Events or circumstances that might require an interim evaluation include unexpected adverse business conditions, economic factors, unanticipated technological changes or competitive activities, loss of key personnel and acts by governments and courts, among others. Goodwill and indefinite-lived intangible assets totaled $45.85 billion and $1.24 billion, respectively, at December 31, 2024 (see Note 2 for additional information). Estimates of discounted future cash flows require assumptions related to revenue and operating income margin growth rates, discount rates and other factors. For the goodwill impairment tests, the company also considers (i) peer revenues and earnings trading multiples from companies that have operational and financial characteristics that are similar to the respective reporting units and (ii) estimated weighted average costs of capital. Different assumptions from those made in the company’s analysis could materially affect projected cash flows and the company’s evaluation of goodwill and indefinite-lived intangible assets for impairment.\nThe company performed the quantitative goodwill impairment test for all of its reporting units and indefinite-lived intangible assets. Determinations of fair value based on projections of discounted cash flows, which generally increased from the prior year projections primarily due to lower discount rates, and based on peer revenues and earnings trading multiples, which also \n26\nTHERMO FISHER SCIENTIFIC INC.\ngenerally increased from the prior year, were sufficient to conclude that no impairments of goodwill or indefinite-lived intangible assets existed at the end of the tenth fiscal month of 2024, the date of the company’s annual impairment testing. There were no interim impairments of goodwill or indefinite-lived intangible assets in 2024. There can be no assurance, however, that adverse events or conditions will not cause the fair values of these assets to decline. Should the fair values of the company’s reporting units or indefinite-lived intangible assets decline because of reduced operating performance, market declines, or other indicators of impairment, or as a result of changes in the discount rates, charges for impairment may be necessary.\nDefinite-lived Intangible Assets\nDefinite-lived intangible assets totaled $14.30 billion at December 31, 2024 (see Note 2 for additional information). Certain definite-lived intangible assets have largely independent cash flows. The company reviews these definite-lived intangible assets for impairment individually when indication of potential impairment exists, such as a significant reduction in cash flows associated with the assets. Actual cash flows arising from a particular intangible asset could vary from projected cash flows, which could imply different carrying values from those established at the dates of acquisition and which could result in impairment of such asset. Most of the company’s definite-lived intangible assets are used in conjunction with other assets, such as property, plant and equipment and operating lease right-of-use assets. In these situations, the company considers the asset groups to be the units of account for impairment testing. The company recorded definite-lived intangible asset impairments of $0.01 billion in 2023.\nIncome Taxes\nUnrecognized Tax Benefits\nIn the ordinary course of business there is inherent uncertainty in quantifying the company’s income tax positions. The company assesses income tax positions and records tax benefits for all years subject to examination based upon management’s evaluation of the facts, circumstances and information available at the reporting date. For those tax positions where it is more likely than not that a tax benefit will be sustained, the company has recorded the largest amount of tax benefit with a greater than 50 percent likelihood of being realized upon ultimate settlement with a taxing authority that has full knowledge of all relevant information. For those income tax positions where it is not more likely than not that a tax benefit will be sustained, no tax benefit has been recognized in the financial statements. Should tax return positions that the company expects are sustainable not be sustained upon audit, the company could be required to record an incremental tax provision for such taxes. The company’s liability for these unrecognized tax benefits totaled $0.52 billion at December 31, 2024, compared to $0.54 billion at December 31, 2023, primarily as a result of audit settlements and reductions of prior year tax positions (Note 7).\nThe company operates in numerous countries under many legal forms and, as a result, is subject to the jurisdiction of numerous domestic and non-U.S. tax authorities, as well as to tax agreements and treaties among these governments. Determination of taxable income in any jurisdiction requires the company to interpret the related tax laws and regulations and the use of estimates and assumptions regarding significant future events, such as the amount, timing and character of deductions, permissible revenue recognition methods under the tax law and the sources and character of income and tax credits. Changes in tax laws, regulations, agreements and treaties, currency exchange restrictions or the company’s level of operations or profitability in each taxing jurisdiction could have an impact upon the amount of current and deferred tax balances and hence the company’s net income.\nValuation Allowances\nThe company estimates the degree to which tax assets will result in a benefit, after consideration of all positive and negative evidence, and provides a valuation allowance for tax assets that it believes will more likely than not go unused. In situations in which the company has been able to determine that its deferred tax assets will be realized, that determination generally relies on future reversals of taxable temporary differences and expected future taxable income. If it becomes more likely than not that a tax asset will be used, the company reverses the related valuation allowance. Any such reversals are recorded as a reduction of the company’s tax provision. The company’s tax valuation allowance totaled $1.04 billion and $1.32 billion at December 31, 2024 and December 31, 2023, respectively (Note 7). Should the company’s actual future taxable income by tax jurisdiction vary from estimates, additional allowances or reversals thereof may be necessary.\nRecent Accounting Pronouncements\nA description of recently issued accounting standards is included under the heading “Recent Accounting Pronouncements” in Note 1.\n27\nTHERMO FISHER SCIENTIFIC INC.",
  "item2": null
}