{
  "source_file": "tmus-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business \nBusiness Overview and Strategy\nUn-carrier Strategy\nAs America’s supercharged Un-carrier, we have disrupted the wireless communications services industry by actively engaging with and listening to our customers and focusing on eliminating their pain points. Our customers benefit from what we believe is an unmatched combination of value and network quality, unwavering focus on offering them the best possible service experience and undisputable drive for disruptive innovation in wireless and beyond. This includes providing added value and what we believe is an exceptional experience while implementing signature Un-carrier initiatives that have changed the wireless industry. We ended annual service contracts, overages, unpredictable international roaming fees and data buckets, among other things. We are inspired by a relentless focus on customer experience, consistently delivering award-winning customer experience, which drives our customer satisfaction levels while enabling operational efficiencies.\nWith what we believe is America’s largest, fastest, most awarded and most advanced 5G network, the Un-carrier strives to offer customers unrivaled coverage and capacity where they live, work and travel. We believe our network is the foundation of our success and powers everything we do. Our dense and multi-layer network provides an unmatched 5G and overall network experience to our customers, which consists of our foundational layer of low-band, our mid-band and our millimeter-wave (“mmWave”) spectrum licenses (see “Spectrum Position” below). This multilayer portfolio of spectrum broadens and deepens our nationwide 5G network, enabling accelerated innovation and increased competition in the U.S. wireless and broadband industries.\nWe continue to expand the footprint and improve the quality of our network, enabling us to provide what we believe are outstanding wireless experiences for customers who should not have to compromise on quality and value. Our network allows us to deliver new, innovative products and services, such as our High Speed Internet fixed wireless product, with the same customer experience focus and industry-disrupting mindset that we have adopted in our attempt to redefine the wireless communications services industry in the United States in the customers’ favor.\nAs part of our relentless, customer-first focus, we are transforming into an AI-enabled, data-informed, digital-first organization to continue delivering differentiated experiences to our customers. Leveraging the latest AI technology and digital capabilities, we are pioneering new approaches to serving customers with a platform to better anticipate and proactively solve their issues, offering personalized self-service options and taking authorized actions on their behalf, while simultaneously creating large-format customer experience stores for customers looking for an immersive experience, and increasing investment in domestic customer care. Our comprehensive T-Life app will further allow us to tap into customer preferences and radically simplify customer experiences in the future. \nOur Operations\nAs of December 31, 2024, we provide wireless communications services to 129.5 million postpaid and prepaid customers and generate revenue by providing affordable wireless communications services to these customers, as well as a wide selection of wireless devices and accessories. We also provide wholesale wireless services to various partners, who then offer the services for sale to their customers. Our most significant expenses relate to operating and expanding our network, providing a full range of devices, acquiring and retaining high-quality customers and compensating employees. We provide services, devices and accessories across our flagship brands, T-Mobile, Metro by T-Mobile and Mint Mobile, through our T-Mobile and Metro by T-Mobile owned and operated retail stores, as well as through our websites (www.t-mobile.com, www.metrobyt-mobile.com and www.mintmobile.com), T-Mobile, Metro by T-Mobile and Mint Mobile apps, customer care channels and through national retailers. In addition, we sell devices to dealers and other third-party distributors for resale through independent third-party retail outlets and a variety of third-party websites. The information on our websites is not part of this Form 10-K. See \nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n for additional information.\nServices and Products\nWe provide wireless communications services through a variety of service plan options. We also offer for sale to customers a wide selection of wireless devices, including smartphones, wearables, tablets, home broadband routers and other mobile communication devices that are manufactured by various suppliers. \n6\nTable of Contents\nOur most popular service plan offering is Go5G Plus, which includes unlimited talk, text and data on our network, 5G access at no extra cost, scam protection features, access to the same device offers as new customers and more. We also offer an Essentials rate plan for customers who want the basics at a lower price point, specific rate plans to qualifying customers, including Military and Veterans, First Responder and 55+, as well as Go5G and Go5G Next plans to deliver a full suite of plans that provide customers the features that meet their lifestyle and daily needs.\nAt the time of device purchase, qualified customers can finance all or a portion of the individual device or accessory purchase price over an installment period, generally of 24 months, using an equipment installment plan (“EIP”). \nIn addition to our wireless communications services, we offer High Speed Internet, which includes a fixed wireless product that utilizes the excess capacity of our nationwide 5G network. Our fixed wireless product is available to tens of millions of domestic households where we currently have excess network capacity, providing, for some consumers, an alternative to traditional landline internet or broadband service providers and expanding access to and choice for some consumers. With our High Speed Internet plan, customers can access the internet without worrying about annual service contracts, data overages or hidden fees. \nWe also provide products and services that are complementary to our wireless communications services, including device protection, financial services and advertising.\nCustomers\nWe provide wireless communications services to a variety of customers needing connectivity, but focus primarily on two categories of customers: \n•\nPostpaid customers generally are qualified to pay after receiving wireless communications services utilizing phones, High Speed Internet modems, mobile internet devices (including tablets and hotspots), wearables, DIGITS and other connected devices (including SyncUP and internet of things (“IoT”)). We serve consumers as well as business customers, who are provided services under the T-Mobile for Business brand.\n•\nPrepaid customers generally pay for wireless communications services in advance. We serve prepaid customers under the T-Mobile, Metro by T-Mobile, Mint Mobile and Ultra Mobile brands.\nWe provide Machine-to-Machine (“M2M”) and Mobile Virtual Network Operator (“MVNO”) customers access to our network. This access and the customer relationship are managed by wholesale partners, with whom we have commercial agreements permitting them to sell services utilizing our network. \nWe generate the majority of our service revenues by providing wireless communications services to postpaid and prepaid customers. Our ability to attract and retain postpaid and prepaid customers is important to our business in the generation of service revenues, equipment revenues and other revenues. In 2024, our service revenues generated by providing wireless communications services by customer category were:\n•\n79% Postpaid customers;\n•\n16% Prepaid customers; and \n•\n5% Wholesale and other services.\nSubstantially all of our revenues for the years ended December 31, 2024, 2023 and 2022, were earned in the United States, including Puerto Rico and the U.S. Virgin Islands. \nNetwork Strategy\nUtilizing our multilayer spectrum portfolio, our mission is to become “Famous for Network.” We have deployed low-band, mid-band and mmWave spectrum dedicated for 5G across our dense and broad network to create what we believe is America’s largest, fastest, most awarded and most advanced 5G network. \nWe believe our spectrum position and focus on technology leadership will continue to drive network differentiation. Our innovative Customer-Driven Coverage (“CDC”) approach to network investments, and leadership in deploying the latest network technologies including Massive Multiple-input/multiple-out (“Massive MIMO”), Voice over New Radio (“VoNR”), four-carrier and higher order aggregation, dynamic network slicing and the U.S.’s first broad deployment of 5G Advanced, are \n7\nTable of Contents\nenabled by our scaled nationwide 5G standalone network. We are also part of an alliance working to bring Radio Access Network (“RAN”) and AI innovation closer together to deliver transformational network experiences in the future.\nSpectrum Position\nWe provide wireless communications services utilizing low-band spectrum licenses covering our 600 MHz and 700 MHz spectrum, mid-band spectrum licenses, such as Advanced Wireless Services (“AWS”), Personal Communications Services (“PCS”) and 2.5 GHz spectrum, and mmWave spectrum.\n•\nWe controlled an average of 394 MHz of combined low- and mid-band spectrum nationwide as of December 31, 2024. This spectrum is comprised of:\n•\nAn average of 41 MHz in the 600 MHz band;\n•\nAn average of 10 MHz in the 700 MHz band;\n•\nAn average of 14 MHz in the 800 MHz band;\n•\nAn average of 41 MHz in the 1700 MHz AWS band;\n•\nAn average of 66 MHz in the 1900 MHz PCS band;\n•\nAn average of 184 MHz in the 2.5 GHz band;\n•\nAn average of 11 MHz in the 3.45 GHz band; and\n•\nAn average of 27 MHz in the C-band.\n•\nWe controlled an average of 1,033 GHz of combined mmWave spectrum licenses.\n•\nIn September 2023, we entered into a License Purchase Agreement with Comcast Corporation and its affiliate, Comcast OTR1, LLC (together with Comcast Corporation, “Comcast”) pursuant to which we will acquire spectrum in the 600 MHz band in exchange for total cash consideration of between $1.2 billion and $3.3 billion. On January 13, 2025, we and Comcast entered into an amendment to the License Purchase Agreement pursuant to which we will acquire additional spectrum. Subsequent to the amendment, the total cash consideration for the transaction is between $1.2 billion and $3.4 billion. See \nNote \n7\n – Goodwill, Spectrum License Transactions and Other Intangible Assets\n of the Notes to the Consolidated Financial Statements for additional details.\n•\nWe plan to evaluate future spectrum purchases in future auctions and secondary market opportunities to further augment or refine our current spectrum position.\n•\nAs of December 31, 2024, we had equipment deployed on approximately 82,000 macro cell sites and 52,000 small cell/distributed antenna system sites across our network. \nCompetition\nThe wireless communications services industry remains competitive. We are the second largest provider of wireless communications services in the U.S. as measured by our total postpaid and prepaid customers. Our wireless communications services competitors include other carriers, such as AT&T Inc. (“AT&T”), Verizon Communications, Inc. (“Verizon”), and DISH Network Corporation (“DISH”) as it continues to grow its network. In addition, our competitors include numerous smaller and regional providers, including Comcast Corporation, Charter Communications, Inc., Cox Communications, Inc., and Altice USA, Inc., many of which offer no-contract, postpaid and prepaid service plans. Competitors also include providers who offer similar communication services, such as voice, messaging and data services, using alternative technologies. In addition to our wireless communications services, our High Speed Internet service competes against other broadband providers, including traditional wireline solutions, such as Cable, DSL and Fiber broadband providers, and fixed wireless solutions, including AT&T and Verizon’s fixed wireless products, and Satellite Internet providers. Competitive factors within the wireless communications services and broadband industries include pricing, market saturation, service and product offerings, customer experience, network investment and quality, development and deployment of technologies and regulatory changes. Some of our competitors have shown a willingness to use discounted pricing or offer bundled services as a potential source of differentiation. \nHuman Capital\nEmployees\nAs of December 31, 2024, we employed approximately 70,000 full-time and part-time employees, including network, retail, administrative and customer support functions.\n8\nTable of Contents\nAttraction and Retention\nWe employ a highly skilled workforce within a broad range of functions. Substantially all of our employees are located throughout the United States, including Puerto Rico, to serve our nationwide network and retail operations. Our headquarters are located in Bellevue, Washington, and Overland Park, Kansas.\nWe attract and retain our workforce through a dynamic and inclusive culture and by providing a comprehensive set of benefits, including:\n•\nCompetitive medical, dental and vision benefits;\n•\nFamily-building benefits designed to meet the diverse needs of our employees, including IVF and IUI, adoption and surrogacy benefits;\n•\nAnnual stock grants to all full-time and part-time employees and a discounted Employee Stock Purchase Program;\n•\nA 401(k) Savings Plan;\n•\nNationwide minimum pay of at least $20 per hour to all full-time and part-time employees;\n•\nLiveMagenta: a custom-branded program for employee engagement and well-being, including free access to life coaches, financial coaches and tools for healthy living;\n•\nAccess to personal health advocates offering independent guidance;\n•\nA generous paid time off program, including paid family leave;\n•\nTuition assistance for all full-time and part-time employees, including full tuition partnerships with multiple schools; and\n•\nA matching program for employee donations and volunteering.\nTraining and Development\nCareer growth and development is foundational to T-Mobile’s culture and success. We want to deliver the best experiences from the best teams, and one way we do that is by offering an array of development programs and resources to build diverse talent and empower our people to succeed through every step of their career. We put employees in the driver’s seat and give them access to mentoring, training, videos, books, job search and interview tips, and much more. \nBy strategically investing in the following three key areas of career development and learning, we are developing our talent now and for the future.\n•\nEvolve skills and careers – Learn every day, champion relentless improvement, develop critical skills, explore career possibilities, and build the desired career; \n•\nAdvance leadership expertise – Build critical leadership capabilities, enable leadership growth at all levels, and develop skills to lead in the future; and\n•\nChampion belonging and inclusion – Promote inclusive habits and behaviors and enhance belonging and connectedness.\nBelonging and Inclusion\nOur diversity, equity and inclusion efforts are focused on fostering a workplace that helps us better serve our customers and communities across the nation. We aim to create an environment where employees feel included, valued and empowered, contributing to a stronger, more connected business. T-Mobile has an inclusive hiring process that seeks diverse talent to be candidates for employment, but all of our hiring decisions continue to be based solely on merit.\nEmployee Resource Groups (ERGs)\nMany of our employees participate in one of six Employee Resource Groups (ERGs) and their sub-groups, which are instrumental in promoting connection. Each of these groups is open to any and all employees, and there are 38 chapters nationwide that organize volunteer opportunities and local events. \n9\nTable of Contents\nOur ERGs include:\n•\nVeterans & Allies Network;\n•\nAccessibility Community at T-Mobile;\n•\nMulticultural Alliance;\n•\nAsia Pacific & Allies Network;\n•\nBlack Empowerment Network;\n•\nIndigenous Peoples Network;\n•\nEleva Network (focused on the Latino community and allies);\n•\nMultigenerational Network;\n•\nPride; and\n•\nWomen & Allies Network. \nThese groups offer immersive experiences, mentorship programs, networking opportunities, and community service projects. They are designed to help participants grow as professionals and community leaders\n.\nExternal Diversity Councils\nIn partnership with civil rights organizations, we had previously established two External Diversity and Inclusion Councils. These councils offered guidance for our efforts in areas like workforce recruitment, procurement, community investment, and corporate governance. The work with these external councils concluded as planned after a successful 5-year collaboration and the councils have been dissolved.\nSuppliers\nT-Mobile considers a broad range of suppliers, including those that are veteran-owned, disability-owned, woman-owned, minority-owned, and LGBT-owned, and we include small and large businesses of all kinds in our procurement processes. Purchases and contracts are awarded based on the best qualified and most competitive suppliers to enable T-Mobile’s success.\nEnvironmental Sustainability\nEfficiencies and Reducing Our Carbon Footprint\nWe are actively working to identify efficiencies in our energy usage and reduce our environmental impact by:\n•\nPursuing a science-based net-zero emissions target for 2040, covering Scope 1, 2, and 3 emissions;\n•\nInvesting in renewable energy, meeting our RE100 pledge since 2021, through initiatives such as Virtual Power Purchasing Agreements and clean energy projects producing over 3.4 million megawatt hours annually;\n•\nEnhancing energy efficiency in our facilities, including retail stores, data centers, and cell sites; and\n•\nPromoting a circular economy through a robust device reuse and recycling program.\nResponsible Sourcing\nWe believe our suppliers are a valuable extension of our business and corporate values. Our Supplier Code of Conduct outlines expectations around ethical business practices for our suppliers. We require our suppliers to operate in compliance with the laws, rules, regulations and ethical standards of the countries in which they operate or provide products or services. We expect our suppliers to share our commitment to ethical conduct and environmentally responsible business practices while they conduct business with or on behalf of us. Our Responsible Sourcing Policy further outlines T-Mobile’s expectations in this area. \nWe employ a third-party risk management (“TPRM”) process to screen for anti-corruption, global sanctions, human rights and environmental risks before engaging with a supplier. Our TPRM process also continuously monitors current suppliers for policy violations and risks.\n10\nTable of Contents\nRegulation\nThe FCC regulates many key aspects of our business, including licensing, construction, the operation and use of our network, modifications of our network, control and ownership of our licenses and authorizations, the sale, transfer and acquisition of certain licenses, domestic roaming arrangements and interconnection agreements, pursuant to its authority under the Communications Act of 1934, as amended (“Communications Act”). The FCC has a number of complex requirements that affect our operations and pending proceedings regarding additional or modified requirements that could increase our costs or diminish our revenues. For example, the FCC has rules regarding provision of 911, 988 and E-911 services, porting telephone numbers, interconnection, roaming, internet openness or net neutrality, robocalling/robotexting, disabilities access, privacy and cybersecurity, digital discrimination, consumer protection and the universal service and Lifeline programs. Many of these and other issues are being considered in ongoing proceedings, and we cannot predict whether or how such actions will affect our business, financial condition or operating results. Our ability to provide services and generate revenues could be harmed by adverse regulatory action or changes to existing laws and regulations. In addition, regulation of companies that offer competing services can impact our business indirectly.\nExcept for operations in certain unlicensed frequency bands, wireless communications services providers generally must be licensed by the FCC to provide communications services at specified spectrum frequencies within specified geographic areas and must comply with the rules and policies governing the use of the spectrum as adopted by the FCC. The FCC issues each license for a fixed period of time, typically 10-15 years depending on the particular licenses. While the FCC has generally renewed licenses given to operating companies like us, the FCC has authority both to revoke a license for cause and to deny a license renewal if a renewal is not in the public interest. Furthermore, we could be subject to fines, forfeitures and other penalties for failure to comply with FCC regulations, even if any such noncompliance was unintentional. In extreme cases, penalties can include revocation of our licenses. The loss of any licenses, or any related fines or forfeitures, could adversely affect our business, results of operations and financial condition. In addition, the FCC retains the right to modify rules related to use of licensed spectrum, which could impact T-Mobile’s ability to provide services.\nAdditionally, Congress’s and the FCC’s allocation of additional spectrum for broadband commercial mobile radio service (“CMRS”), which includes cellular, PCS and other wireless services, could significantly increase and intensify competition. We cannot assess the impact that any developments that may occur in the U.S. economy or any future spectrum allocations by the FCC may have on license values. FCC spectrum auctions and other market developments may adversely affect the market value of our licenses or our competitive position in the future. A significant decline in the value of our licenses could adversely affect our financial condition and results of operations. In addition, the FCC periodically reviews its policies on how to evaluate carriers’ spectrum holdings in the context of spectrum transactions or acquisitions. Most recently, for example, in September 2023, the FCC sought public comment on whether it should initiate a rulemaking proceeding to consider changes to its mobile spectrum rules and policies. A change in these rules and policies could affect our access to additional spectrum resources and competition among us and other carriers.\nCongress and the FCC have imposed limitations on foreign ownership of CMRS licensees. Direct foreign ownership in the licensee of more than 20% is prohibited. Indirect foreign ownership of more than 25% through an entity controlling the licensee must be reviewed and approved by the FCC as not inconsistent with the public interest. Consistent with that established policy, the FCC has issued a declaratory ruling authorizing up to 100% ownership of our Company by DT.\nFor our Educational Broadband Service (“EBS”) licenses in the 2.5 GHz band, FCC rules previously limited eligibility to hold EBS licenses to accredited educational institutions and certain governmental, religious and nonprofit entities, while permitting those license holders to lease their licenses to commercial providers for non-educational purposes. Therefore, we have historically accessed EBS spectrum primarily through long-term leasing arrangements with EBS license holders. Our EBS spectrum leases typically have an initial term equal to the remaining term of the EBS license, with an option to renew the lease for additional terms, for a total lease term of up to 30 years. In April 2020, the FCC lifted the restriction on who can hold EBS licenses and the 30-year limitation on lease duration, among other changes. The elimination of these restrictions allows current license holders to sell their licenses, including to T-Mobile. While a majority of our leases have contractual provisions enabling us to match offers, we may be forced to compete with others to purchase 2.5 GHz licenses on the secondary market and expend additional capital earlier than we may have anticipated. T-Mobile has started to acquire some of these EBS licenses, but we continue to lease spectrum in this band and expect that to be the case for some time.\nWhile the Communications Act generally preempts state and local governments from regulating the entry of, or the rates charged by, wireless communications services providers, certain state and local governments regulate other terms and conditions of wireless service, including billing, termination of service arrangements and the imposition of early termination fees, advertising, network outages, the use of devices while driving, service mapping, protection of consumer information, zoning and land use. Notwithstanding this federal preemption, several states are considering or have passed laws or regulations \n11\nTable of Contents\nthat could potentially set prices, minimum performance standards and/or restrictions on service discontinuation that could impact our business in those states.\nFor example, following the FCC’s adoption of the 2017 Restoring Internet Freedom (“RIF”) Order reclassifying broadband internet access services as non-common carrier “information services,” a number of states sought to impose state-specific net neutrality, rate-setting, and privacy requirements on providers’ broadband services. The FCC’s RIF Order expressly preempted such state efforts, which were inconsistent with the FCC’s federal deregulatory approach at that time. In 2019, however, the DC Circuit issued a ruling largely upholding the RIF Order but also vacating the portion of the ruling broadly preempting state/local measures regulating broadband services. The court left open the prospect that particular state laws could still unlawfully conflict with the FCC’s RIF Order and be preempted. In the meantime, the FCC sought to repeal the RIF Order through its adoption of the 2024 Open Internet Order, though the latter was struck down by a federal court of appeals in January 2025.\nWhile most states pursuing net neutrality legislation sought to codify the federal rules repealed by the RIF Order, there are differences in some states. For example, California has passed separate privacy and net neutrality legislation, while many others have passed privacy laws, and New York has passed a broadband rate-setting law. There are also efforts within Congress to pass federal legislation to codify uniform federal privacy and net neutrality requirements. Ensuring the preemption of separate state requirements, including the California laws, is critical to this effort. If not preempted or rescinded, separate state requirements will impose significant business costs and could also result in increased litigation costs and enforcement risks. A number of states also subject wireless service providers to registration requirements. State authority over wireless broadband services will likely remain unsettled unless resolved by the courts, the FCC or Congress.\nIn addition, the Federal Trade Commission (“FTC”) and other federal agencies have jurisdiction over some consumer protection matters and the elimination and prevention of anticompetitive business practices with respect to the provision of non-common carrier services. Further, the FCC and the Federal Aviation Administration regulate the siting, lighting and construction of transmitter towers and antennae. Tower siting and construction are also subject to state and local zoning, as well as federal statutes regarding environmental and historic preservation. The future costs to comply with all relevant regulations are, to some extent, unknown, and changes to regulations, or the applicability of regulations, could result in higher operating and capital expenses, or reduced revenues in the future.\nAvailable Information\nThe SEC maintains an internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically at www.sec.gov. Our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”) are also publicly available free of charge on the investor relations section of our website at investor.t-mobile.com as soon as reasonably practicable after they are electronically filed with or furnished to the SEC. Our corporate governance guidelines, director selection guideline, code of ethics for senior financial officers, code of business conduct, speak up policy, supplier code of conduct, and charters for the audit, compensation, nominating and corporate governance, and executive committees of our Board of Directors are also posted on the investor relations section of our website at investor.t-mobile.com. The information on our website is not part of this or any other report we file with, or furnish to, the SEC.",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n for additional information.\nServices and Products\nWe provide wireless communications services through a variety of service plan options. We also offer for sale to customers a wide selection of wireless devices, including smartphones, wearables, tablets, home broadband routers and other mobile communication devices that are manufactured by various suppliers. \n6\nTable of Contents\nOur most popular service plan offering is Go5G Plus, which includes unlimited talk, text and data on our network, 5G access at no extra cost, scam protection features, access to the same device offers as new customers and more. We also offer an Essentials rate plan for customers who want the basics at a lower price point, specific rate plans to qualifying customers, including Military and Veterans, First Responder and 55+, as well as Go5G and Go5G Next plans to deliver a full suite of plans that provide customers the features that meet their lifestyle and daily needs.\nAt the time of device purchase, qualified customers can finance all or a portion of the individual device or accessory purchase price over an installment period, generally of 24 months, using an equipment installment plan (“EIP”). \nIn addition to our wireless communications services, we offer High Speed Internet, which includes a fixed wireless product that utilizes the excess capacity of our nationwide 5G network. Our fixed wireless product is available to tens of millions of domestic households where we currently have excess network capacity, providing, for some consumers, an alternative to traditional landline internet or broadband service providers and expanding access to and choice for some consumers. With our High Speed Internet plan, customers can access the internet without worrying about annual service contracts, data overages or hidden fees. \nWe also provide products and services that are complementary to our wireless communications services, including device protection, financial services and advertising.\nCustomers\nWe provide wireless communications services to a variety of customers needing connectivity, but focus primarily on two categories of customers: \n•\nPostpaid customers generally are qualified to pay after receiving wireless communications services utilizing phones, High Speed Internet modems, mobile internet devices (including tablets and hotspots), wearables, DIGITS and other connected devices (including SyncUP and internet of things (“IoT”)). We serve consumers as well as business customers, who are provided services under the T-Mobile for Business brand.\n•\nPrepaid customers generally pay for wireless communications services in advance. We serve prepaid customers under the T-Mobile, Metro by T-Mobile, Mint Mobile and Ultra Mobile brands.\nWe provide Machine-to-Machine (“M2M”) and Mobile Virtual Network Operator (“MVNO”) customers access to our network. This access and the customer relationship are managed by wholesale partners, with whom we have commercial agreements permitting them to sell services utilizing our network. \nWe generate the majority of our service revenues by providing wireless communications services to postpaid and prepaid customers. Our ability to attract and retain postpaid and prepaid customers is important to our business in the generation of service revenues, equipment revenues and other revenues. In 2024, our service revenues generated by providing wireless communications services by customer category were:\n•\n79% Postpaid customers;\n•\n16% Prepaid customers; and \n•\n5% Wholesale and other services.\nSubstantially all of our revenues for the years ended December 31, 2024, 2023 and 2022, were earned in the United States, including Puerto Rico and the U.S. Virgin Islands. \nNetwork Strategy\nUtilizing our multilayer spectrum portfolio, our mission is to become “Famous for Network.” We have deployed low-band, mid-band and mmWave spectrum dedicated for 5G across our dense and broad network to create what we believe is America’s largest, fastest, most awarded and most advanced 5G network. \nWe believe our spectrum position and focus on technology leadership will continue to drive network differentiation. Our innovative Customer-Driven Coverage (“CDC”) approach to network investments, and leadership in deploying the latest network technologies including Massive Multiple-input/multiple-out (“Massive MIMO”), Voice over New Radio (“VoNR”), four-carrier and higher order aggregation, dynamic network slicing and the U.S.’s first broad deployment of 5G Advanced, are \n7\nTable of Contents\nenabled by our scaled nationwide 5G standalone network. We are also part of an alliance working to bring Radio Access Network (“RAN”) and AI innovation closer together to deliver transformational network experiences in the future.\nSpectrum Position\nWe provide wireless communications services utilizing low-band spectrum licenses covering our 600 MHz and 700 MHz spectrum, mid-band spectrum licenses, such as Advanced Wireless Services (“AWS”), Personal Communications Services (“PCS”) and 2.5 GHz spectrum, and mmWave spectrum.\n•\nWe controlled an average of 394 MHz of combined low- and mid-band spectrum nationwide as of December 31, 2024. This spectrum is comprised of:\n•\nAn average of 41 MHz in the 600 MHz band;\n•\nAn average of 10 MHz in the 700 MHz band;\n•\nAn average of 14 MHz in the 800 MHz band;\n•\nAn average of 41 MHz in the 1700 MHz AWS band;\n•\nAn average of 66 MHz in the 1900 MHz PCS band;\n•\nAn average of 184 MHz in the 2.5 GHz band;\n•\nAn average of 11 MHz in the 3.45 GHz band; and\n•\nAn average of 27 MHz in the C-band.\n•\nWe controlled an average of 1,033 GHz of combined mmWave spectrum licenses.\n•\nIn September 2023, we entered into a License Purchase Agreement with Comcast Corporation and its affiliate, Comcast OTR1, LLC (together with Comcast Corporation, “Comcast”) pursuant to which we will acquire spectrum in the 600 MHz band in exchange for total cash consideration of between $1.2 billion and $3.3 billion. On January 13, 2025, we and Comcast entered into an amendment to the License Purchase Agreement pursuant to which we will acquire additional spectrum. Subsequent to the amendment, the total cash consideration for the transaction is between $1.2 billion and $3.4 billion. See \nNote \n7\n – Goodwill, Spectrum License Transactions and Other Intangible Assets\n of the Notes to the Consolidated Financial Statements for additional details.\n•\nWe plan to evaluate future spectrum purchases in future auctions and secondary market opportunities to further augment or refine our current spectrum position.\n•\nAs of December 31, 2024, we had equipment deployed on approximately 82,000 macro cell sites and 52,000 small cell/distributed antenna system sites across our network. \nCompetition\nThe wireless communications services industry remains competitive. We are the second largest provider of wireless communications services in the U.S. as measured by our total postpaid and prepaid customers. Our wireless communications services competitors include other carriers, such as AT&T Inc. (“AT&T”), Verizon Communications, Inc. (“Verizon”), and DISH Network Corporation (“DISH”) as it continues to grow its network. In addition, our competitors include numerous smaller and regional providers, including Comcast Corporation, Charter Communications, Inc., Cox Communications, Inc., and Altice USA, Inc., many of which offer no-contract, postpaid and prepaid service plans. Competitors also include providers who offer similar communication services, such as voice, messaging and data services, using alternative technologies. In addition to our wireless communications services, our High Speed Internet service competes against other broadband providers, including traditional wireline solutions, such as Cable, DSL and Fiber broadband providers, and fixed wireless solutions, including AT&T and Verizon’s fixed wireless products, and Satellite Internet providers. Competitive factors within the wireless communications services and broadband industries include pricing, market saturation, service and product offerings, customer experience, network investment and quality, development and deployment of technologies and regulatory changes. Some of our competitors have shown a willingness to use discounted pricing or offer bundled services as a potential source of differentiation. \nHuman Capital\nEmployees\nAs of December 31, 2024, we employed approximately 70,000 full-time and part-time employees, including network, retail, administrative and customer support functions.\n8\nTable of Contents\nAttraction and Retention\nWe employ a highly skilled workforce within a broad range of functions. Substantially all of our employees are located throughout the United States, including Puerto Rico, to serve our nationwide network and retail operations. Our headquarters are located in Bellevue, Washington, and Overland Park, Kansas.\nWe attract and retain our workforce through a dynamic and inclusive culture and by providing a comprehensive set of benefits, including:\n•\nCompetitive medical, dental and vision benefits;\n•\nFamily-building benefits designed to meet the diverse needs of our employees, including IVF and IUI, adoption and surrogacy benefits;\n•\nAnnual stock grants to all full-time and part-time employees and a discounted Employee Stock Purchase Program;\n•\nA 401(k) Savings Plan;\n•\nNationwide minimum pay of at least $20 per hour to all full-time and part-time employees;\n•\nLiveMagenta: a custom-branded program for employee engagement and well-being, including free access to life coaches, financial coaches and tools for healthy living;\n•\nAccess to personal health advocates offering independent guidance;\n•\nA generous paid time off program, including paid family leave;\n•\nTuition assistance for all full-time and part-time employees, including full tuition partnerships with multiple schools; and\n•\nA matching program for employee donations and volunteering.\nTraining and Development\nCareer growth and development is foundational to T-Mobile’s culture and success. We want to deliver the best experiences from the best teams, and one way we do that is by offering an array of development programs and resources to build diverse talent and empower our people to succeed through every step of their career. We put employees in the driver’s seat and give them access to mentoring, training, videos, books, job search and interview tips, and much more. \nBy strategically investing in the following three key areas of career development and learning, we are developing our talent now and for the future.\n•\nEvolve skills and careers – Learn every day, champion relentless improvement, develop critical skills, explore career possibilities, and build the desired career; \n•\nAdvance leadership expertise – Build critical leadership capabilities, enable leadership growth at all levels, and develop skills to lead in the future; and\n•\nChampion belonging and inclusion – Promote inclusive habits and behaviors and enhance belonging and connectedness.\nBelonging and Inclusion\nOur diversity, equity and inclusion efforts are focused on fostering a workplace that helps us better serve our customers and communities across the nation. We aim to create an environment where employees feel included, valued and empowered, contributing to a stronger, more connected business. T-Mobile has an inclusive hiring process that seeks diverse talent to be candidates for employment, but all of our hiring decisions continue to be based solely on merit.\nEmployee Resource Groups (ERGs)\nMany of our employees participate in one of six Employee Resource Groups (ERGs) and their sub-groups, which are instrumental in promoting connection. Each of these groups is open to any and all employees, and there are 38 chapters nationwide that organize volunteer opportunities and local events. \n9\nTable of Contents\nOur ERGs include:\n•\nVeterans & Allies Network;\n•\nAccessibility Community at T-Mobile;\n•\nMulticultural Alliance;\n•\nAsia Pacific & Allies Network;\n•\nBlack Empowerment Network;\n•\nIndigenous Peoples Network;\n•\nEleva Network (focused on the Latino community and allies);\n•\nMultigenerational Network;\n•\nPride; and\n•\nWomen & Allies Network. \nThese groups offer immersive experiences, mentorship programs, networking opportunities, and community service projects. They are designed to help participants grow as professionals and community leaders\n.\nExternal Diversity Councils\nIn partnership with civil rights organizations, we had previously established two External Diversity and Inclusion Councils. These councils offered guidance for our efforts in areas like workforce recruitment, procurement, community investment, and corporate governance. The work with these external councils concluded as planned after a successful 5-year collaboration and the councils have been dissolved.\nSuppliers\nT-Mobile considers a broad range of suppliers, including those that are veteran-owned, disability-owned, woman-owned, minority-owned, and LGBT-owned, and we include small and large businesses of all kinds in our procurement processes. Purchases and contracts are awarded based on the best qualified and most competitive suppliers to enable T-Mobile’s success.\nEnvironmental Sustainability\nEfficiencies and Reducing Our Carbon Footprint\nWe are actively working to identify efficiencies in our energy usage and reduce our environmental impact by:\n•\nPursuing a science-based net-zero emissions target for 2040, covering Scope 1, 2, and 3 emissions;\n•\nInvesting in renewable energy, meeting our RE100 pledge since 2021, through initiatives such as Virtual Power Purchasing Agreements and clean energy projects producing over 3.4 million megawatt hours annually;\n•\nEnhancing energy efficiency in our facilities, including retail stores, data centers, and cell sites; and\n•\nPromoting a circular economy through a robust device reuse and recycling program.\nResponsible Sourcing\nWe believe our suppliers are a valuable extension of our business and corporate values. Our Supplier Code of Conduct outlines expectations around ethical business practices for our suppliers. We require our suppliers to operate in compliance with the laws, rules, regulations and ethical standards of the countries in which they operate or provide products or services. We expect our suppliers to share our commitment to ethical conduct and environmentally responsible business practices while they conduct business with or on behalf of us. Our Responsible Sourcing Policy further outlines T-Mobile’s expectations in this area. \nWe employ a third-party risk management (“TPRM”) process to screen for anti-corruption, global sanctions, human rights and environmental risks before engaging with a supplier. Our TPRM process also continuously monitors current suppliers for policy violations and risks.\n10\nTable of Contents\nRegulation\nThe FCC regulates many key aspects of our business, including licensing, construction, the operation and use of our network, modifications of our network, control and ownership of our licenses and authorizations, the sale, transfer and acquisition of certain licenses, domestic roaming arrangements and interconnection agreements, pursuant to its authority under the Communications Act of 1934, as amended (“Communications Act”). The FCC has a number of complex requirements that affect our operations and pending proceedings regarding additional or modified requirements that could increase our costs or diminish our revenues. For example, the FCC has rules regarding provision of 911, 988 and E-911 services, porting telephone numbers, interconnection, roaming, internet openness or net neutrality, robocalling/robotexting, disabilities access, privacy and cybersecurity, digital discrimination, consumer protection and the universal service and Lifeline programs. Many of these and other issues are being considered in ongoing proceedings, and we cannot predict whether or how such actions will affect our business, financial condition or operating results. Our ability to provide services and generate revenues could be harmed by adverse regulatory action or changes to existing laws and regulations. In addition, regulation of companies that offer competing services can impact our business indirectly.\nExcept for operations in certain unlicensed frequency bands, wireless communications services providers generally must be licensed by the FCC to provide communications services at specified spectrum frequencies within specified geographic areas and must comply with the rules and policies governing the use of the spectrum as adopted by the FCC. The FCC issues each license for a fixed period of time, typically 10-15 years depending on the particular licenses. While the FCC has generally renewed licenses given to operating companies like us, the FCC has authority both to revoke a license for cause and to deny a license renewal if a renewal is not in the public interest. Furthermore, we could be subject to fines, forfeitures and other penalties for failure to comply with FCC regulations, even if any such noncompliance was unintentional. In extreme cases, penalties can include revocation of our licenses. The loss of any licenses, or any related fines or forfeitures, could adversely affect our business, results of operations and financial condition. In addition, the FCC retains the right to modify rules related to use of licensed spectrum, which could impact T-Mobile’s ability to provide services.\nAdditionally, Congress’s and the FCC’s allocation of additional spectrum for broadband commercial mobile radio service (“CMRS”), which includes cellular, PCS and other wireless services, could significantly increase and intensify competition. We cannot assess the impact that any developments that may occur in the U.S. economy or any future spectrum allocations by the FCC may have on license values. FCC spectrum auctions and other market developments may adversely affect the market value of our licenses or our competitive position in the future. A significant decline in the value of our licenses could adversely affect our financial condition and results of operations. In addition, the FCC periodically reviews its policies on how to evaluate carriers’ spectrum holdings in the context of spectrum transactions or acquisitions. Most recently, for example, in September 2023, the FCC sought public comment on whether it should initiate a rulemaking proceeding to consider changes to its mobile spectrum rules and policies. A change in these rules and policies could affect our access to additional spectrum resources and competition among us and other carriers.\nCongress and the FCC have imposed limitations on foreign ownership of CMRS licensees. Direct foreign ownership in the licensee of more than 20% is prohibited. Indirect foreign ownership of more than 25% through an entity controlling the licensee must be reviewed and approved by the FCC as not inconsistent with the public interest. Consistent with that established policy, the FCC has issued a declaratory ruling authorizing up to 100% ownership of our Company by DT.\nFor our Educational Broadband Service (“EBS”) licenses in the 2.5 GHz band, FCC rules previously limited eligibility to hold EBS licenses to accredited educational institutions and certain governmental, religious and nonprofit entities, while permitting those license holders to lease their licenses to commercial providers for non-educational purposes. Therefore, we have historically accessed EBS spectrum primarily through long-term leasing arrangements with EBS license holders. Our EBS spectrum leases typically have an initial term equal to the remaining term of the EBS license, with an option to renew the lease for additional terms, for a total lease term of up to 30 years. In April 2020, the FCC lifted the restriction on who can hold EBS licenses and the 30-year limitation on lease duration, among other changes. The elimination of these restrictions allows current license holders to sell their licenses, including to T-Mobile. While a majority of our leases have contractual provisions enabling us to match offers, we may be forced to compete with others to purchase 2.5 GHz licenses on the secondary market and expend additional capital earlier than we may have anticipated. T-Mobile has started to acquire some of these EBS licenses, but we continue to lease spectrum in this band and expect that to be the case for some time.\nWhile the Communications Act generally preempts state and local governments from regulating the entry of, or the rates charged by, wireless communications services providers, certain state and local governments regulate other terms and conditions of wireless service, including billing, termination of service arrangements and the imposition of early termination fees, advertising, network outages, the use of devices while driving, service mapping, protection of consumer information, zoning and land use. Notwithstanding this federal preemption, several states are considering or have passed laws or regulations \n11\nTable of Contents\nthat could potentially set prices, minimum performance standards and/or restrictions on service discontinuation that could impact our business in those states.\nFor example, following the FCC’s adoption of the 2017 Restoring Internet Freedom (“RIF”) Order reclassifying broadband internet access services as non-common carrier “information services,” a number of states sought to impose state-specific net neutrality, rate-setting, and privacy requirements on providers’ broadband services. The FCC’s RIF Order expressly preempted such state efforts, which were inconsistent with the FCC’s federal deregulatory approach at that time. In 2019, however, the DC Circuit issued a ruling largely upholding the RIF Order but also vacating the portion of the ruling broadly preempting state/local measures regulating broadband services. The court left open the prospect that particular state laws could still unlawfully conflict with the FCC’s RIF Order and be preempted. In the meantime, the FCC sought to repeal the RIF Order through its adoption of the 2024 Open Internet Order, though the latter was struck down by a federal court of appeals in January 2025.\nWhile most states pursuing net neutrality legislation sought to codify the federal rules repealed by the RIF Order, there are differences in some states. For example, California has passed separate privacy and net neutrality legislation, while many others have passed privacy laws, and New York has passed a broadband rate-setting law. There are also efforts within Congress to pass federal legislation to codify uniform federal privacy and net neutrality requirements. Ensuring the preemption of separate state requirements, including the California laws, is critical to this effort. If not preempted or rescinded, separate state requirements will impose significant business costs and could also result in increased litigation costs and enforcement risks. A number of states also subject wireless service providers to registration requirements. State authority over wireless broadband services will likely remain unsettled unless resolved by the courts, the FCC or Congress.\nIn addition, the Federal Trade Commission (“FTC”) and other federal agencies have jurisdiction over some consumer protection matters and the elimination and prevention of anticompetitive business practices with respect to the provision of non-common carrier services. Further, the FCC and the Federal Aviation Administration regulate the siting, lighting and construction of transmitter towers and antennae. Tower siting and construction are also subject to state and local zoning, as well as federal statutes regarding environmental and historic preservation. The future costs to comply with all relevant regulations are, to some extent, unknown, and changes to regulations, or the applicability of regulations, could result in higher operating and capital expenses, or reduced revenues in the future.\nAvailable Information\nThe SEC maintains an internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically at www.sec.gov. Our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the “Exchange Act”) are also publicly available free of charge on the investor relations section of our website at investor.t-mobile.com as soon as reasonably practicable after they are electronically filed with or furnished to the SEC. Our corporate governance guidelines, director selection guideline, code of ethics for senior financial officers, code of business conduct, speak up policy, supplier code of conduct, and charters for the audit, compensation, nominating and corporate governance, and executive committees of our Board of Directors are also posted on the investor relations section of our website at investor.t-mobile.com. The information on our website is not part of this or any other report we file with, or furnish to, the SEC.\nItem 1A. Risk Factors\nIn addition to the other information contained in this Form 10-K, the following risk factors should be considered carefully in evaluating T-Mobile. Our business, financial condition, liquidity, or operating results, as well as the price of our common stock and other securities, could be materially and adversely affected by any of these risks.\nRisks Related to Our Business\nWe operate in a highly competitive industry. If we are unable to attract and retain customers, our business, financial condition, and operating results would be negatively affected.\nThe wireless communications services industry is highly competitive. As the industry reaches saturation, competition in all market segments, including prepaid, postpaid, enterprise and government customers will likely further intensify, putting pressure on pricing and/or margins for us and all our competitors. Our ability to attract and retain customers will depend on multiple factors, such as network quality and capacity, customer service excellence, effective marketing strategies, competitive pricing, compelling value propositions, and distribution and logistics capabilities. Additionally, targeted marketing approaches for diverse customer segments, coupled with continuous innovation in products and services, are essential for retaining and \n12\nTable of Contents\nexpanding our customer base. If we are unable to successfully differentiate our services from our competitors, it would adversely affect our competitive position and ability to grow our business.\nWe have seen and expect to continue to see intense competition in all market segments from traditional Mobile Network Operators (“MNOs”), such as AT&T and Verizon, who have each invested heavily in spectrum, their wireless networks, and services and device promotions, and DISH, as it continues to build out its wireless network and roll out services. Numerous other regional MNOs and MVNOs offering wireless services may also compete with us in some markets, including cable providers, such as Comcast, Charter, Cox, and Altice, as they continue to diversify their offerings to include wireless services offered under MVNO agreements. As new products and services emerge, we may also be forced to compete against non-traditional competitors from outside of the wireless communications services industry, such as satellite providers, offering similar connectivity services using alternative technologies. \nIn the market for broadband services, traditional cable providers, AT&T, Verizon, and other players such as satellite and fiber providers, all compete for customers. To complement our fixed wireless service, we have agreed to enter into joint venture agreements aimed at establishing a robust fiber wireline network in certain geographic regions that we believe will complement our fixed wireless services in those areas. However, these partnerships also involve inherent risks. See \n“Any acquisition, divestiture, investment, joint venture or merger may subject us to significant risks, any of which may harm our business”\n for further discussions of such risks.\nIf we are unable to compete effectively in attracting and retaining customers in markets where we operate, it could negatively impact our business, financial condition, and operating results.\nWe have experienced criminal cyberattacks and may experience disruption, data loss and other security breaches, whether directly or indirectly through third parties whose products and services we rely on in operating our business.\nOur business involves the receipt, storage, and transmission of confidential information about our customers, such as sensitive personal, account and payment information, confidential information about our employees and suppliers, and other sensitive information about our Company, such as our business plans, transactions, financial information, and intellectual property (collectively, “Confidential Information”). Additionally, to offer services to our customers and operate our business, we utilize several applications and systems, including those we own and operate, such as our wireless network, as well as others provided to us by third parties, such as cloud service providers and SaaS companies (collectively, “Systems”).\nWe are subject to persistent cyberattacks and threats to our business from bad actors seeking to gain unauthorized access to Confidential Information and compromise Systems to undermine availability or integrity. They are perpetrated by a variety of groups and persons, including nation state-sponsored parties, malicious actors, employees, contractors, or other unrelated third parties. Some actors reside in jurisdictions where law enforcement measures to address such attacks are ineffective or unavailable.\nCyberattacks against companies like ours are increasing in frequency and scope of potential harm over time, and the methods used to gain unauthorized access constantly evolve, making it increasingly difficult to anticipate, prevent, and detect incidents successfully in every instance. In some cases, these bad actors exploit bugs, errors, misconfigurations or other vulnerabilities in our Systems to obtain Confidential Information. In other cases, these bad actors obtain unauthorized access to Confidential Information by exploiting insider access or utilizing log in credentials taken from our customers, employees, or third-party providers through credential harvesting, social engineering or other means. Other bad actors aim to cause serious operational disruptions to our business and Systems through ransomware or distributed denial of services attacks. \nAlthough we regularly work to identify, track and remedy any security vulnerabilities, given the complex nature of our Systems and the tools that are available to us, we may be unable to identify vulnerabilities in a timely manner, or to apply patches or compensating measures that address such vulnerabilities, before bad actors can exploit them. The exploitation of a security vulnerability before patches or measures are applied could materially compromise Confidential Information and Systems.\nIn addition, we routinely rely upon third-party providers whose products and services are used in our business. These third-party providers have experienced, and will continue to experience cyberattacks that involve attempts to expose our Confidential Information and/or to create operational risk that could materially and adversely affect our business, and these providers also face other security challenges common to all parties that collect and process information. Additionally, our Systems include components from third parties or fourth parties we do not control and may have compromises, defects, flaws, or design errors unknown to us.\n13\nTable of Contents\nAs a result of the previously disclosed cyberattacks in August 2021 and January 2023, we incurred significant costs in connection with, among other things, responding to and resolving mass arbitration claims, multiple class action lawsuits and an FCC investigation. For more information on the foregoing, see “– Contingencies and Litigation – Litigation and Regulatory Matters” in \nNote 1\n8\n – Commitments and Contingencies\n of the Notes to the Consolidated Financial Statements.\nIn addition to the August 2021 cyberattack and the January 2023 cyberattack, we have experienced unrelated non-material incidents involving unauthorized access to certain Confidential Information and Systems. Typically, these incidents have involved attempts to commit fraud by taking control of a customer’s phone line, often by exploiting insider access or using compromised credentials. In other cases, the incidents have involved unauthorized access to certain of our customers’ private information, including payment information, financial data, social security numbers or passwords, and our intellectual property. Some of these incidents have occurred at third-party providers, including third parties who provide us with various Systems and others who sell our products and services through retail locations or take care of our customers.\nIn November 2024, it was publicly reported that a nation-state actor called “Salt Typhoon” successfully infiltrated the telecommunications networks of certain of our competitors to obtain information on their customers. While we have no evidence that any of our Systems or Confidential Information were impacted in any significant way, we may face similar attempts in the future.\nOur procedures and safeguards to prevent unauthorized access to Confidential Information and to defend against cyberattacks seeking to disrupt our operations must be continually evaluated and enhanced to address the ever-evolving threat landscape and changing cybersecurity regulations, including while we adapt complex digital transformation efforts. These preventative actions require the investment of significant resources and management time and attention. Additionally, we do not have control of the cybersecurity systems, breach prevention, and response protocols of our third-party providers, including through our cybersecurity programs or policies. While T-Mobile may have contractual rights to assess the effectiveness of many of our providers’ systems and protocols, we do not have the means to always know or assess the effectiveness of all of our providers’ systems and controls. We cannot provide any assurances that actions taken by us, or our third-party providers, including through our cybersecurity programs or policies, will adequately repel a significant cyberattack or prevent or substantially mitigate the impacts of cybersecurity breaches or misuses of Confidential Information, unauthorized access to our networks or Systems or exploits against third-party environments, or that we, or our third-party providers, will be able to effectively identify, investigate, and remediate such incidents in a timely manner or at all. We expect to continue to be the target of cyberattacks, given the nature of our business, and we expect the same with respect to our third-party providers. We also expect that threat actors will continue to gain sophistication including in the use of tools and techniques (such as AI) that are specifically designed to circumvent security controls, evade detection, and obfuscate forensic evidence, making it more challenging for us to identify, investigate and recover from future cyberattacks in a timely and effective manner. In addition, we have acquired and continue to acquire companies with cybersecurity vulnerabilities or unsophisticated security measures, which exposes us to significant cybersecurity, operational, and financial risks. If we fail to protect Confidential Information or to prevent operational disruptions from future cyberattacks, there may be a material adverse effect on our business, reputation, financial condition, cash flows, and operating results.\nIf we fail to timely adopt and effectively deploy emerging network technologies, our competitive position could erode, which may adversely affect our business, financial condition, and operating results. \nOur competitive advantage and reputation depend on our ability to provide industry-leading network coverage, speed, and reliability. While we have established a leadership position in 5G, the communications industry evolves rapidly, and emerging technologies – such as AI-driven Radio Access Networks (“AI-RAN”) and the potential transition to 6G – may redefine network standards and increase customer expectations. To stay ahead, we are investing in strategic collaborations with third parties, such as AI-RAN partnerships, to develop technologies that are intended to advance our network capabilities. Despite these efforts, we may encounter technical challenges, regulatory hurdles, supply chain constraints, or unexpected delays in developing and deploying new network technologies. If we fail to anticipate market trends, efficiently integrate innovative solutions into our network, or maintain the quality and reliability of our network, our market share and competitive standing could erode, adversely impacting our business and operating results.\nIf we fail to effectively execute our digital transformation and drive customer and employee adoption of emerging technologies, our competitive position and financial performance could be materially harmed.\nWe are engaged in complex digital transformation efforts intended to streamline operations, enhance customer experience, and improve our overall competitiveness. These initiatives involve integrating emerging and rapidly evolving technologies, reconfiguring internal processes, and implementing advanced data analytics and AI-driven tools, including those developed through our partnerships with a number of third-party providers. The successful execution of our planned transformation is \n14\nTable of Contents\nsubject to significant uncertainties. For example, we may face challenges in harmonizing complex system architectures, integrating new platforms with legacy infrastructure, and managing large volumes of data from disparate sources. We must also maintain rigorous data security and privacy safeguards, ensure our AI-driven solutions comply with evolving regulatory standards, and mitigate potential issues such as algorithmic bias or unintended operational disruptions. Additionally, implementing these digital solutions often requires substantial capital and operational expenditures, extensive employee training, specialized skill sets that may be difficult to source, and close coordination with multiple third-party vendors and partners. If we fail to execute these initiatives effectively, our ability to realize the intended benefits of digital transformation may be compromised. Even if we successfully deploy these capabilities, customer adoption and employee acceptance may be slower than anticipated, diminishing the expected improvements to efficiency, service quality, or revenue generation. This could materially and adversely affect our competitive position, financial performance, and brand reputation.\nWe rely on highly skilled personnel throughout all levels of our business. Our business could be harmed if we are unable to retain or motivate key personnel, hire a sufficient number of qualified new personnel, or maintain our corporate culture.\nOur future success depends in substantial part on our ability to attract, recruit, hire, motivate, develop, and retain talented personnel possessing the qualifications, experiences, capabilities and skills we need for all areas of our organization, including our CEO and members of our senior leadership team. Succession planning to ensure effective transfer of knowledge and a seamless transition when key personnel depart is also important to our long-term success. Additionally, as we continue to make significant investments in new technologies and new business areas, we are increasingly dependent on being able to hire and retain technically skilled employees, including those with expertise in AI and machine learning.\nBoth external factors, such as fluctuations in economic and industry conditions, changes in U.S. immigration policies, regulatory changes, political forces and the competitive landscape, and internal factors, such as employee tolerance for changes in our corporate culture, organizational changes, limited remote working opportunities, and our compensation programs, may impact our ability to effectively manage our workforce. Further, employee compensation and benefit costs may increase due to inflationary pressures, and if our compensation does not keep up with inflation or that of our competitors’, we may see increased employee dissatisfaction and departures or difficulty in recruiting new employees. If key employees depart or we are unable to recruit and integrate new employees successfully, our business could be negatively impacted.\nSystem failures and business disruptions may prevent us from providing reliable service, which could materially and adversely affect our reputation and financial condition.\nWe rely upon systems and networks – those of third-party suppliers and other providers, in addition to our own – to provide services to our customers. System, network, or infrastructure failures resulting from one of several potential causes may prevent us from providing reliable service or otherwise operate our business. Examples of these risks include:\n•\nphysical damage, power surges or outages, equipment failure, or other service disruptions with respect to both our wireless and wireline networks, including those resulting from severe weather, storms, earthquakes, floods, hurricanes, wildfires and other natural disasters, which may occur more frequently or with greater intensity as a result of global climate change, public health crises, terrorist attacks, political instability and volatility and acts of war;\n•\nhuman error due to factors such as poor change management or policy compliance;\n•\nrisks to our access to and use of reliable energy and water;\n•\nhardware or software failures or outages of our business systems or communications network;\n•\nsupplier failures or delays; and\n•\nshifts in physical conditions due to climate change, such as sea-level rise or changes in temperature or precipitation patterns, which may impact the operating conditions of our infrastructure or other infrastructure we rely on.\nSuch events could cause us to lose customers and revenue, incur expenses, suffer reputational damage, and subject us to fines, penalties, adverse actions or judgments, litigation, or governmental investigations. Remediation costs could include liability for information loss, costs of repairing infrastructure and systems, and/or costs of incentives offered to customers. Our insurance may not cover or may not be adequate to fully reimburse us for costs and losses associated with such events, and such events may also impact the availability of insurance at costs and other terms we find acceptable for future events.\n15\nTable of Contents\nThe scarcity and cost of additional wireless spectrum, and regulations relating to spectrum use, may adversely affect our business, financial condition, and operating results.\nWe continue to acquire and deploy new spectrum to expand and deepen our 5G coverage, maintain our quality of service, meet increasing or changing customer demands, and deploy new technologies. In order to expand and differentiate our services from our competitors, we will continue to actively seek to make additional investments in new spectrum, which could be significant. However, we may be unable to secure the additional spectrum necessary to maintain or enhance our competitive position on favorable terms or at all.\nThe continued interest in acquiring spectrum by existing carriers and others, including speculators, may reduce our ability to acquire or renew spectrum holdings (such as 2.5Ghz), and/or increase the cost of spectrum that is made available in the secondary markets and government auctions. Additionally, the FCC may be unable to make sufficient additional spectrum available for auction to meet the demand from all interested parties. As a result, any such spectrum that is made available at auction may be subject to heightened competition and priced beyond levels we are able or willing to pay. \nEven if new spectrum becomes available to us, the FCC or other government entities may impose conditions on the acquisition and use of such spectrum, such as the configuration or geographic areas in which the spectrum may be deployed. These conditions may substantially increase the costs we incur or negatively affect the value of the spectrum to our business.\nIf we cannot acquire needed spectrum from the government or otherwise, if competitors acquire spectrum that will allow them to provide services competitive with our services, or if we cannot deploy services over acquired spectrum on a timely basis without burdensome conditions, at reasonable cost, and while maintaining network quality levels, our ability to attract and retain customers and our business, financial condition and operating results could be materially and adversely affected.\nAny acquisition, divestiture, investment, joint venture or merger may subject us to significant risks, any of which may harm our business.\nWe may pursue acquisitions of, investments in, or joint ventures or mergers with, other companies, or the acquisition of technologies, services, products or other assets that we believe would complement or expand our business. We may also elect to divest some of our assets to third parties. Some of these potential transactions could be significant relative to the size of our business and operations. Any such transaction would involve a number of risks and could present financial, managerial and operational challenges, including:\n•\ndiversion of management attention from running our existing business;\n•\nincreased costs to integrate the networks, spectrum, technology, personnel, customer base, distributors and business partners and business practices of the company involved in any such transaction with our business;\n•\nincreased interest expense and leverage or limits on other uses of cash; \n•\npotential loss of talent during integration due to differences in culture, locations, or other factors;\n•\ndifficulties in effectively integrating the financial, operational and sustainability systems of the business involved in any such transaction into (or supplanting such systems with) our financial, operational and sustainability reporting infrastructure and internal control framework in an effective and timely manner;\n•\nrisks of entering markets in which the Company has no or limited experience and where competitors have stronger market positions; \n•\npotential exposure to material liabilities not discovered in the due diligence process or as a result of any litigation arising in connection with any such transaction;\n•\nsignificant transaction-related expenses in connection with any such transaction, whether consummated or not;\n•\nrisks related to our ability to obtain any required regulatory approvals necessary to consummate any such transaction; and\n•\nany business, technology, service, or product involved in any such transaction may significantly under-perform relative to our expectations, and we may not achieve the benefits we expect from the transaction, which could, among other things, also result in a write-down of goodwill and other intangible assets associated with such transaction.\nWe have entered into joint venture agreements aimed at establishing a robust fiber broadband network that complements our fixed wireless services. Once closed, differences in views among the joint venture participants may result in delayed decisions or disputes. Operating through joint ventures in which we do not hold a majority ownership interest results in us having limited control over many decisions made with respect to the businesses of the joint ventures. We also cannot control the actions of our joint venture partners. These joint ventures may not be subject to the same requirements regarding internal controls and internal \n16\nTable of Contents\ncontrol over financial reporting that we follow. As a result, internal control problems may arise with respect to these joint ventures. Any of these risks could have a material adverse effect on our business, financial condition and results of operations and could also affect our reputation. \nAdditionally, in connection with our merger (the “Merger”) with Sprint Corporation (“Sprint”) and related transactions, including the acquisition by DISH of certain prepaid wireless business (the “Prepaid Transaction” and, collectively, the “Transactions”), we agreed to fulfill various government commitments (the “Government Commitments”), including, among others, extensive 5G network build-out, delivering high-speed wireless services to the vast majority of Americans and marketing our in-home fixed wireless product to households where spectrum capacity is sufficient, as well as commitments related to national security, pricing and availability of rate plans. These Government Commitments materially increased our compliance obligations and could result in additional expenses and/or penalties in the future. In connection with the Prepaid Transaction, we and DISH entered into certain arrangements, including a Master Network Services Agreement (the “MNSA”), pursuant to which we provide DISH, for a period of seven years, network services for certain end users and infrastructure mobile network operator services to assist in the access and integration of the DISH network.\nAny failure to fulfill our obligations under the Government Commitments and the MNSA in a timely manner could result in substantial fines, penalties, or other legal and administrative actions, liabilities, and reputational harm.\nEconomic, political and market conditions may adversely affect our business, financial condition, and operating results.\nOur business, financial condition, and operating results are sensitive to changes in general economic conditions, including interest rates, consumer credit conditions, consumer debt levels, consumer confidence, unemployment rates, economic growth, energy costs, rates of inflation (or concerns about deflation), supply chain disruptions, impacts of current geopolitical conflict or instability, such as the Ukraine-Russia and Israel-Hamas wars and further escalations thereof, and other macroeconomic factors. \nThe wireless industry, broadly, is dependent on population growth, as a result, we expect the wireless industry’s customer growth rate to be moderate in comparison with historical growth rates, leading to ongoing competition for customers. In addition, the Government Commitments place certain limitations on our ability to increase prices, which limits our ability to pass along growing costs to customers. Rising prices for goods, services, and labor due to inflation could adversely impact our margins and/or growth.\nOur services and device financing plans are available to a broad customer base, a significant segment of which may be vulnerable to weak economic conditions, particularly our subprime customers. We may have greater difficulty in gaining new customers within this segment, and existing customers may be more likely to terminate service and default on device financing plans due to an inability to pay.\nWeak economic and credit conditions may also adversely impact our suppliers, dealers, wholesale partners or MVNOs, and enterprise and government customers, some of which may file for bankruptcy, or may experience cash flow or liquidity problems, or may be unable to obtain or refinance credit such that they may no longer be able to operate. Any of these could adversely impact our ability to distribute, market, or sell our products and services.\nIf we do not successfully deliver new products and services, we may not realize our intended growth targets or generate the expected returns from our business, adversely affecting our financial condition, and operating results.\nWe continue to expand our offerings beyond traditional wireless services to include High Speed Internet (including fiber broadband), advertising technology and services, and specialized network solutions, such as network slicing for first responders (T-Priority) and 5G advanced network solutions (ANS) for enterprises. These new ventures require significant capital, expertise, and operational support, and their success depends on factors we cannot fully control or predict. Increased competition, technical challenges, security concerns, operational complexities, or shifting regulatory landscapes could delay product rollouts, inflate costs, or limit adoption rates. Additionally, entering new markets or lines of business may expose us to unfamiliar regulatory requirements, compliance challenges, or damage existing customer relationships. Should these new products and services fail to gain traction, generate expected returns, or deliver value to customers, we could incur substantial expenses without offsetting revenue gains, adversely affecting our business, financial condition, and operating results.\n17\nTable of Contents\nWe rely on third parties to provide products and services for the operation of our business, and the failure or inability of such parties to provide these products or services could adversely affect our business, financial condition, and operating results.\nWe have a diverse set of suppliers to help us develop, maintain, and troubleshoot products and services such as wireless and wireline network components, software development services, and billing and customer service support. However, in certain areas such as, billing services, voice, and data communications transport services, wireless or wireline network infrastructure equipment, handsets, other devices, back-office processes and payment processing, there are a limited number of suppliers who can provide adequate support for us, which decreases our flexibility to switch to alternative third parties. Unexpected termination of our arrangement with any of these suppliers or difficulties in renewing our commercial arrangements with them could have a material and adverse effect on our business operations.\nOur suppliers are also subject to their own risks, including, but not limited to, cybersecurity, economic, financial and credit conditions, labor force disruptions, geopolitical tensions, disruptions in global supply chain and the risks of natural catastrophic events (such as earthquakes, floods, hurricanes, storms, heatwaves and fires), energy shortages, power outages, equipment failures, terrorist attacks or other hostile acts, and public health crises, such as the COVID-19 pandemic, which may result in performance below the levels required by their contracts. Our business could be severely disrupted if critical suppliers or service providers fail to comply with their contracts or if we experience delays or service degradation during any transition to a new outsourcing provider or other supplier or if we are required to replace the supplied products or services with those from another source, especially if the replacement becomes necessary on short notice. Any such disruptions could have a material adverse effect on our business, financial condition, and operating results.\nFurther, some of our suppliers may provide services from outside of the United States, which carries additional regulatory and legal obligations. We rely on suppliers to provide us with contractual assurances and to disclose accurate information regarding risks associated with their provision of products or services in accordance with our policies and standards, including our Supplier Code of Conduct and our third-party risk management practices. The failure of our suppliers to comply with our expectations and policies could expose us to additional legal and litigation risks and lead to unexpected contract terminations.\nAdditionally, we rely on third-party technology partners on various projects and developments. If any of our third-party technology partners terminate or reduce their relationships with us or suspend, limit, or cease their operations, we may not be able to complete such initiatives or achieve the intended results from the partnerships, and our business, reputation, financial condition and results of operations may suffer.\nSociopolitical volatility and polarization may adversely affect our business operations and reputation.\nThe current sociopolitical environment is characterized by deep complexity, volatility, and polarization on various social and political issues. The increasing intersection of technology and politics has led to rapid and unpredictable shifts in public sentiment. Social media and digital platforms have amplified the voices of various stakeholders, creating the potential for swift change in public opinion and stronger reactions to corporate actions. As a company that sells products and services across the nation to millions of customers, these dynamics increase the risk of potential reputational damage, boycotts, and shifts in consumer behavior that could adversely affect our brand, sales and profitability. Our ability to respond effectively, sensitively, and authentically to the expectations and concerns of our customers, employees, and other stakeholders is key to mitigating these risks. If we are unable to manage these challenges effectively, there may be adverse impacts to our business, reputation, financial condition, and operating results.\nAdditionally, we are subject to emerging and evolving regulatory requirements and frameworks regarding environmental, social and governance matters, including potential new or revised disclosure rules proposed by the SEC and recently enacted or proposed legislation in jurisdictions such as California. The ultimate scope of these regulations may change as they are finalized, and they may not be uniform across jurisdictions. Meeting these obligations may require significant investments of time, capital, and personnel.\nRisks Related to Our Indebtedness\nOur substantial level of indebtedness could adversely affect our business flexibility and ability to service our debt, and increase our borrowing costs.\nWe have, and we expect that we will continue to have, a substantial amount of debt. Our substantial level of indebtedness could have the effect of, among other things, reducing our flexibility in responding to changing business, economic, market and industry conditions and increasing the amount of cash required to service our debt. In addition, this level of indebtedness may \n18\nTable of Contents\nalso reduce funds available for capital expenditures, any Board-approved share repurchases, dividends or other activities. Those impacts may put us at a competitive disadvantage relative to other companies with lower debt levels. Further, we may incur substantial additional indebtedness in the future, subject to the restrictions contained in our debt instruments, if any, which could increase the risks associated with our capital structure.\nOur ability to service our substantial debt obligations will depend on future performance, which will be affected by business, economic, market and industry conditions and other factors. There is no guarantee that we will be able to generate sufficient cash flow to service our debt obligations when due. If we are unable to meet such obligations or fail to comply with the financial and other restrictive covenants contained in the agreements governing such debt obligations, we may be required to refinance all or part of our debt, sell important strategic assets at unfavorable prices or make additional borrowings. We may not be able to, at any given time, refinance our debt, sell assets, or make additional borrowings on commercially reasonable terms or at all, which could have a material adverse effect on our business, financial condition, and operating results.\nChanges in credit market conditions and other factors could adversely affect our ability to raise debt favorably.\nInstability in the global financial markets, inflation, policies of various governmental and regulatory agencies, including changes in monetary policy and interest rates, and other general economic conditions could lead to volatility in the credit and equity markets. This volatility could limit our access to the capital markets, leading to higher borrowing costs or, in some cases, the inability to obtain financing on terms that are acceptable to us or at all. Further, deterioration in our operating performance may lead to a decrease in our credit ratings, which could also impact our ability to access the debt capital markets at rates favorable or acceptable to us.\nIn addition, any hedging agreements we may enter into to limit our exposure to interest rate increases or foreign currency fluctuations may not offer complete protection from these risks or may be unsuccessful, and consequently may effectively increase the interest rate we pay on our debt or the exchange rate with respect to any debt we may incur in a foreign currency, and any portion not subject to such hedging agreements would have full exposure to interest rate increases or foreign currency fluctuations, as applicable. If any financial institutions that are parties to our hedging agreements were to default on their payment obligations to us, declare bankruptcy or become insolvent, we would be unhedged against the underlying exposures. Any posting of collateral by us under our hedging agreements and the modification or termination of any of our hedging agreements could negatively impact our liquidity or other financial metrics. Any of these risks could have a material adverse effect on our business, financial condition, and operating results.\nRisks Related to Legal and Regulatory Matters\nFailure to maintain effective internal control over financial reporting could impair our compliance with Section 404 of the Sarbanes-Oxley Act, which could lead to material misstatements in our financial statements and adversely affect our operations and reputation.\nWe rely on robust internal controls to provide reasonable assurance regarding the reliability of our financial information and the preparation of our financial statements. These controls include, among other things, properly designed processes, clear policies and procedures, competent personnel, effective oversight functions, and reliable information systems that facilitate the collection, processing, and communication of financial data. As we continue to refine and improve our systems to align with our evolving business needs, there is no assurance that these improvements will be implemented without delays or disruptions. A failure or significant delay in updating our systems, or a failure to effectively integrate new systems with existing processes, could compromise the effectiveness of our internal controls. If our internal controls are not effectively designed or properly implemented, or if changes to our business processes or organizational structure outpace our internal controls’ ability to adapt, we could experience material weaknesses or other deficiencies.\nAny material weaknesses or other control deficiencies that may arise in the future could require significant time and resources to remediate. If we are unable to remediate material weaknesses in internal control over financial reporting, then our ability to analyze, record and report financial information free of material misstatements, to prepare financial statements within the time periods specified by the rules and forms of the SEC and otherwise to comply with the requirements of Section 404 of the Sarbanes-Oxley Act would be negatively impacted. As a result, we could face legal fines and penalties, diminished investor confidence, and adverse impacts on our access to the capital markets, potentially resulting in a decline in our stock price and harm to our reputation.\n19\nTable of Contents\nChanges in regulations or in the regulatory framework under which we operate could adversely affect our business, financial condition, and operating results.\nWe are subject to regulatory oversight by various federal, state, and local agencies, as well as judicial review and actions, on issues related to the wireless industry that include, but are not limited to, roaming, interconnection, spectrum allocation and licensing, facilities siting, pole attachments, intercarrier compensation, Universal Service Fund (“USF”), 911 services, robocalling/robotexting, consumer protection, consumer privacy, and cybersecurity. We are also subject to regulations in connection with other aspects of our business, including device financing and insurance activities.\nThe FCC regulates the licensing, construction, modification, operation, ownership, sale, and interconnection of wireless communications systems, as do some state and local regulatory agencies. In particular, the FCC imposes significant regulation on licensees of wireless spectrum with respect to how radio spectrum is used by licensees or at what power levels, the nature of the services that licensees may offer and how the services may be offered, and the resolution of issues of interference between operators in the same or adjacent spectrum bands. Changes necessary to resolve interference issues or concerns may have a significant impact on our ability to fully utilize our spectrum. Additionally, the FTC and other federal and state agencies have asserted that they have jurisdiction over some consumer protection matters, and the elimination and prevention of anticompetitive business practices with respect to the provision of wireless products and services.\nWe cannot assure that the FCC or any other federal, state, or local agencies will not adopt or change regulations, change or discontinue existing programs, implement new programs, or take enforcement or other actions that would adversely affect our business, impose new costs, or require changes in current or planned operations, including timing of the shutdown of legacy technologies. \nWe also face potential investigations by, and inquiries from or actions by state public utility commissions. We also cannot assure that Congress will not amend the Communications Act, from which the FCC obtains its authority, and which serves to limit state authority, or enact other legislation in a manner that could be adverse to our business.\nFurther, government funded programs may be discontinued due to ongoing legal challenges to the FCC’s funding mechanism, which could result in the reduction in subsidies for low-income customers and the associated revenue.\nFailure to comply with applicable regulations could have a material adverse effect on our business, financial condition, and operating results. We could be subject to fines, forfeitures, and other penalties (including, in extreme cases, revocation of our spectrum licenses) for failure to comply with the FCC or other governmental regulations, even if any such noncompliance was unintentional. The loss of any licenses, or any related fines or forfeitures, could adversely affect our business, financial condition, and operating results.\nLaws and regulations relating to the handling of privacy, data protection and AI may result in increased costs, legal claims, fines against us, or reputational damage.\nSince 2020, more than a dozen states have enacted new, comprehensive privacy laws that create new data privacy rights for residents of those states and new compliance obligations for us and the industry in general, in addition to private rights of action for certain types of data breaches. These include the California Consumer Privacy Act (“CCPA”) and similar laws in other states. Pending legislation in a number of other states would create similar laws elsewhere. All of these new privacy laws and others that we expect to be developed and enacted going forward will impose additional data protection obligations and potential liability on companies such as ours doing business in those states. Further, privacy laws also limit our ability to collect and use personal information.\nWe have incurred and will continue to incur significant implementation costs to ensure compliance with the CCPA, new privacy laws in other states, and their related regulations, including managing the complexity of laws that vary from state to state. Both federal and state governments are considering additional privacy laws and regulations which, if passed, could further impact our business, strategies, offerings, and initiatives and cause us to incur further costs. Any actual or perceived failure to comply with the CCPA, other data privacy laws or regulations, or related contractual or other obligations, or any perceived privacy rights violation, could lead to investigations, claims, and proceedings by governmental entities and private parties, damages for contract breaches, and other significant costs, penalties, and other liabilities, as well as harm to our reputation and market position.\nAI-related laws and regulations continue to remain uncertain and may vary from jurisdiction to jurisdiction. Our obligations to comply with the evolving legal and regulatory landscape may require us to incur significant additional costs or limit our ability to incorporate certain AI capabilities into our business operations or product offerings. As we integrate AI technologies into our \n20\nTable of Contents\nbusiness, we must navigate varying regulations that could impact our operations and product development. Failure to comply with these regulations could result in fines, penalties, or restrictions on our use of AI, which could adversely affect our business.\nUnfavorable outcomes of legal proceedings may adversely affect our business, reputation, financial condition, cash flows and operating results.\nWe and our affiliates are involved in various disputes, governmental and/or regulatory inspections, investigations and proceedings, mass arbitrations and litigation matters. For more information, see “– Contingencies and Litigation – Litigation and Regulatory Matters” in \nNote 18 – Commitments and Contingencies\n of the Notes to the Consolidated Financial Statements. \nIn addition, we, along with equipment manufacturers and other carriers, are subject to current and potential future lawsuits alleging adverse health effects arising from the use of wireless handsets or from wireless transmission equipment such as cell towers. In addition, the FCC has from time to time gathered data regarding wireless device emissions, and its assessment of the risks associated with using wireless devices may evolve based on its findings. Any of these allegations or changes in risk assessments could result in customers purchasing fewer devices and wireless services, could result in significant legal and regulatory liability, and could have a material adverse effect on our business, reputation, financial condition, cash flows and operating results.\nSuch legal proceedings can be complex, costly, and highly disruptive to our business operations by diverting the attention and energy of management and other key personnel. The assessment of the outcome of legal proceedings, including our potential liability, if any, is a highly subjective process that requires judgments about future events that are not within our control. The amounts ultimately received or paid upon settlement or pursuant to final judgment, order or decree may differ materially from amounts accrued in our financial statements. In addition, litigation or similar proceedings could impose restraints on our current or future manner of doing business. Such potential outcomes including judgments, awards, settlements or orders could have a material adverse effect on our business, reputation, financial condition, cash flows and operating results.\nOur business may be adversely impacted if we are not able to protect our intellectual property rights or if we infringe on the intellectual property rights of others.\nWe rely on a variety of intellectual property assets, including patents, copyrights, trademarks, and domains, to maintain our competitiveness. If we are unable to protect our intellectual property due to factors such as changes in US intellectual property laws, the value of our intellectual property may become impaired, which may adversely impact our business and financial results.\nAdditionally, we have faced and will continue to face various litigations alleging that our products or services infringe patents or other intellectual property of third parties, including potential litigation arising from our use of AI. If successful, these litigations could result in an award of financial compensation, including damages or royalties, business disruptions, reputational harm, or an order requiring that we cease offering, selling, and using the relevant products, equipment, services, and network functions. Defending against such litigation is not only costly and time-consuming, but it may also be disruptive to our business operations and divert resources and attention. Furthermore, the outcomes of these litigations are inherently uncertain.\nOur suppliers and vendors also have and will continue to face intellectual property litigation related to the technology used in the products, equipment, and services they provide to us. If successful, such litigation against our suppliers and vendors might impact their ability to continue to provide the relevant products, equipment, and services to us.\nWe offer regulated financial services products. These products expose us to a wide variety of state and federal regulations.\nThe financing of devices, such as through our EIP, impact our regulatory compliance obligations. Failure to remain compliant with applicable regulations may increase our risk exposure in the following areas:\n•\nconsumer complaints and potential examinations or enforcement actions by federal and state regulatory agencies, including, but not limited to, the Consumer Financial Protection Bureau, state attorneys general, the FCC and the FTC; and\n•\nregulatory fines, penalties, enforcement actions, civil litigation, and/or class action lawsuits. Failure to comply with applicable regulations and the realization of any of these risks could have a material adverse effect on our business, financial condition, and operating results.\n21\nTable of Contents\nOur business may be impacted by new or amended tax laws or regulations or administrative interpretations and judicial decisions affecting the scope or application of tax laws or regulations.\nIn connection with the products and services we sell, we calculate, collect, and remit various federal, state, and local taxes, fees and regulatory charges (“tax” or “taxes”) to numerous federal, state and local governmental authorities, including federal and state USF contributions and common carrier regulatory charges and public safety fees. As many of our service plans offer taxes and fees inclusive, our business results could be adversely impacted by increases in taxes and fees. In addition, we incur and pay state and local transaction taxes and fees on purchases of goods and services used in our business.\nTax laws are dynamic and subject to change as new laws are passed and new interpretations of the laws are issued or applied. In many cases, the application of existing, newly enacted or amended tax laws may be uncertain and subject to different interpretations, especially when evaluated against new technologies and telecommunications services, such as broadband internet access and cloud-related services. Legislative changes, administrative interpretations and judicial decisions affecting the scope or application of tax laws could also impact revenue reported and taxes due on tax inclusive plans. Additionally, failure to comply with any of the tax laws could subject us to additional taxes, fines, penalties, or other adverse actions.\nIn the event that federal, state, and/or local municipalities were to significantly increase taxes and regulatory or public safety charges on our network, operations, or services, or seek to impose new taxes or charges, it could have a material adverse effect on our business, financial condition, and operating results.\nOur wireless licenses are subject to renewal and may be revoked in the event that we violate applicable laws.\nOur existing wireless licenses are subject to renewal upon the expiration of the period for which they are granted. Our licenses have been granted with an expectation of renewal, and the FCC generally has approved our license renewal applications. However, the Communications Act provides that licenses may be revoked for cause and license renewal applications denied if the FCC determines that a renewal would not serve the public interest. If we fail to timely file to renew any wireless license or fail to meet any regulatory requirements for renewal, including construction and substantial service requirements, we could be denied a license renewal. Many of our wireless licenses are subject to interim or final construction requirements, and there is no guarantee that the FCC will find our construction, or the construction of prior licensees, sufficient to meet the build-out or renewal requirements. Accordingly, we cannot assure that the FCC will renew our wireless licenses upon their expiration. If any of our wireless licenses were to be revoked or not renewed upon expiration, we would not be permitted to provide services under that license, which could have a material adverse effect on our business, financial condition, and operating results.\nRisks Related to Ownership of Our Common Stock\nOur Certificate of Incorporation designates the Court of Chancery of the State of Delaware as the sole and exclusive forum for certain actions and proceedings, which could limit the ability of our stockholders to obtain a judicial forum of their choice for disputes with the Company or its directors, officers or employees.\nOur Certificate of Incorporation provides that, unless we consent in writing to the selection of an alternative forum, the Court of Chancery of the State of Delaware shall be the sole and exclusive forum for (i) any derivative action or proceeding brought on behalf of the Company, (ii) any action asserting a claim of breach of a fiduciary duty owed by any director, officer or employee of the Company to the Company or its stockholders, (iii) any action asserting a claim arising pursuant to any provision of the General Corporation Law of the State of Delaware, the Certificate of Incorporation or the Company's bylaws or (iv) any other action asserting a claim arising under, in connection with, and governed by the internal affairs doctrine. This choice of forum provision does not waive our compliance with our obligations under the federal securities laws and the rules and regulations thereunder. Moreover, the provision does not apply to suits brought to enforce a duty or liability created by the Exchange Act or by the Securities Act of 1933, as amended.\nThis choice of forum provision may increase costs to bring a claim, discourage claims or limit a stockholder's ability to bring a claim in a judicial forum that the stockholder finds favorable for disputes with the Company or its directors, officers or employees, which may discourage such lawsuits against the Company and its directors, officers and employees, even though an action, if successful, might benefit our stockholders. Alternatively, if a court were to find the choice of forum provision to be inapplicable or unenforceable in an action, we may incur additional costs associated with resolving such matters in other jurisdictions, which could increase our costs of litigation and adversely affect our business and financial condition.\n22\nTable of Contents\nDT controls a majority of the voting power of our common stock and the T-Mobile trademarks we utilize in our business and may have interests that differ from the interests of our other stockholders.\nDT controls a majority of the voting power of our common stock and therefore we are a “controlled company,” as defined in the NASDAQ Stock Market LLC (“NASDAQ”) listing rules, and we are not subject to NASDAQ requirements that would otherwise require us to have a majority of independent directors, a nominating committee composed solely of independent directors or a compensation committee composed solely of independent directors. Accordingly, our stockholders will not be afforded the same protections as stockholders of other NASDAQ-listed companies generally receive with respect to corporate governance for so long as we rely on these exemptions from the corporate governance requirements.\nIn addition, pursuant to our Certificate of Incorporation and the Second Amended and Restated Stockholders’ Agreement, as long as DT beneficially owns 30% or more of our outstanding common stock, we are restricted from taking certain actions without DT’s prior written consent, including (i) incurring indebtedness above certain levels based on a specified debt to cash flow ratio, (ii) taking any action that would cause a default under any instrument evidencing indebtedness involving DT or its affiliates, (iii) acquiring or disposing of assets or entering into mergers or similar acquisitions in excess of $1.0 billion, (iv) changing the size of our Board of Directors, (v) subject to certain exceptions, issuing equity of 10% or more of the then-outstanding shares of our common stock, or issuing equity to redeem debt held by DT, (vi) repurchasing or redeeming equity securities or making any extraordinary or in-kind dividend other than on a pro rata basis, or (vii) making certain changes involving our CEO. We are also restricted from amending our Certificate of Incorporation and bylaws in any manner that could adversely affect DT’s rights under the Second Amended and Restated Stockholders’ Agreement for as long as DT beneficially owns 5% or more of our outstanding common stock. These restrictions could prevent us from taking actions that our Board of Directors might otherwise determine are in the best interests of the Company and our stockholders, or that may be in the best interests of our other stockholders.\nDT effectively has control over all matters submitted to our stockholders for approval, including the election or removal of directors, changes to our Certificate of Incorporation, a sale or merger of our Company and other transactions requiring stockholder approval under Delaware law. DT’s controlling interest may have the effect of making it more difficult for a third party to acquire, or discouraging a third party from seeking to acquire, the Company and DT, as the controlling stockholder, may have strategic, financial, or other interests different from those of our other stockholders, including as the holder of a portion of our debt and as the counterparty in a number of commercial arrangements, and may make decisions adverse to the interests of our other stockholders.\nIn addition, we license certain trademarks from DT, including the right to use the trademark “T-Mobile” as a name for the Company and our flagship brand under a trademark license agreement, as amended, with DT. As described in more detail in our Proxy Statement on Schedule 14A filed with the SEC on April 24, 2024 under the heading “Transactions with Related Persons and Approval,” we are obligated to pay DT a royalty in an amount equal to 0.25% (the “royalty rate”) of the net revenue (as defined in the trademark license) generated by products and services sold by the Company under the licensed trademarks subject to a cap of $80 million per calendar year through December 31, 2028. We and DT are obligated to negotiate a new trademark license when (i) DT has 50% or less of the voting power of the outstanding shares of capital stock of the Company or (ii) any third party owns or controls, directly or indirectly, 50% or more of the voting power of the outstanding shares of capital stock of the Company, or otherwise has the power to direct or cause the direction of the management and policies of the Company. If we and DT fail to agree on a new trademark license, either we or DT may terminate the trademark license and such termination shall be effective, in the case of clause (i) above, on the third anniversary after a notice of termination and, in the case of clause (ii) above, on the second anniversary after a notice of termination. A further increase in the royalty rate or termination of the trademark license could have a material adverse effect on our business, financial condition, and operating results.\nWe cannot guarantee that our current and future stockholder return programs will be fully utilized or that they will enhance long-term stockholder value.\nOur Board of Directors has authorized, and may from time to time authorize, stockholder return programs, consisting of repurchases of shares of our common stock, the payment of cash dividends, or both. The specific timing and amount of any share repurchases and any dividend payments under any stockholder return program will depend on prevailing share prices, general economic and market conditions, Company performance and other considerations, such as whether the Company determines that there are other uses for the funds currently authorized for the program that would be more advantageous for our business. In addition, the specific timing and amount of any dividend payments are subject to declaration on future dates by the Board of Directors in its sole discretion. \n23\nTable of Contents\nAny stockholder return program could impact our cash flows and affect the trading price of our common stock and increase volatility. We cannot guarantee that any stockholder return program will be fully consummated or that it will enhance long-term stockholder value. Our current and future stockholder return programs do not, and will not, obligate the Company to acquire any particular amount of common stock or to declare and pay any particular amount of dividends, and any program may be suspended or discontinued at any time at the Company’s discretion. Any announcement of termination of any program may result in a decrease in the price of our common stock.\nFuture sales of our common stock by DT and SoftBank and foreign ownership limitations by the FCC could have a negative impact on our stock price and decrease the value of our stock.\nWe cannot predict the effect, if any, that market sales of shares of our common stock by DT or SoftBank will have on the prevailing trading price of our common stock. Sales of a substantial number of shares of our common stock could cause our stock price to decline.\nWe and DT are parties to the Second Amended and Restated Stockholders’ Agreement pursuant to which DT is free to transfer its shares in public sales without notice, as long as such transactions would not result in a third party owning more than 30% of the outstanding shares of our common stock. If a transfer were to exceed the 30% threshold, it would be prohibited unless the transfer were approved by our Board of Directors, or the transferee were to make a binding offer to purchase all of the other outstanding shares on the same price and terms. The Second Amended and Restated Stockholders’ Agreement does not otherwise impose any other restrictions on the sales of common stock by DT. Moreover, the Second Amended and Restated Stockholders’ Agreement generally requires us to cooperate with DT to facilitate the resale of our common stock or debt securities held by DT under shelf registration statements we have filed.\nThe sale of shares of our common stock by DT or SoftBank (other than in transactions involving the purchase of all of our outstanding shares) could significantly increase the number of shares available in the market, which could cause a decrease in our stock price. In addition, even if DT or SoftBank does not sell a large number of their shares into the market, their rights to transfer a large number of shares into the market could depress our stock price.\nFurthermore, under existing law, no more than 20% of an FCC licensee’s capital stock may be directly owned, or no more than 25% indirectly owned, or voted by non-U.S. citizens or their representatives, by a foreign government or its representatives or by a foreign corporation. If an FCC licensee is controlled by another entity, up to 25% of that entity’s capital stock may be owned or voted by non-U.S. citizens or their representatives, by a foreign government or its representatives or by a foreign corporation. Foreign ownership above the 25% holding company level may be allowed if the FCC finds such higher levels consistent with the public interest. The FCC has ruled that higher levels of foreign ownership, even up to 100%, are presumptively consistent with the public interest with respect to investors from certain nations. If our foreign ownership by previously unapproved foreign parties were to exceed the permitted level without further FCC authorization, the FCC could subject us to a range of penalties, including an order for us to divest the foreign ownership in part, fines, license revocation or denials of license renewals. If ownership of our common stock by an unapproved foreign entity were to become subject to such limitations, or if any ownership of our common stock violates any other rule or regulation of the FCC applicable to us, our Certificate of Incorporation provides for certain redemption provisions at a pre-determined price which may be less than fair market value. These limitations and our Certificate of Incorporation may limit our ability to attract additional equity financing outside the United States and decrease the value of our common stock.\nItem 1B. Unresolved Staff Comments\nNone.\nItem 1C. Cybersecurity\nRisk Management and Strategy\nOur Cybersecurity Approach and Integration\nWe have implemented processes for overseeing and identifying material risks from \ncybersecurity threats, and our cybersecurity processes are integrated into the Company’s overall risk management system and processes.\n \nAs part of management’s oversight of cybersecurity, our Chief Security Officer (“CSO”) presents on our cybersecurity practices to the Nominating and Corporate Governance Committee of our Board of Directors (the “NCG Committee”) and to our full Board of Directors on a periodic basis. Our Senior Vice President, Internal Audit & Risk Management (the “Chief Audit Executive”), periodically presents enterprise risks, including cybersecurity risks, to the Audit Committee of our Board of Directors (the “Audit Committee”). Our \n24\nTable of Contents\nChief Compliance Officer regularly attends meetings of the NCG Committee to provide insights from the compliance perspective relating to cybersecurity.\nCyber risk management is a core component of the Company's governance structure. We utilize the National Institute of Standards and Technology’s Cybersecurity Framework as a guide in cyber risk management to identify, assess, and assist the CSO in managing cybersecurity risks. Cyber risk management encompasses partnerships among teams that are responsible for cyber governance, prevention, detection, and remediation activities within the Company’s cybersecurity environment. As part of our cyber risk management efforts, we conduct periodic reviews and collaborate with enterprise-wide risk assessments to assess and manage cybersecurity risks. Our cybersecurity team also provides enterprise-wide cybersecurity training for employees to continuously improve our mitigation against human-driven vulnerabilities. \nOur management also conducts a quarterly enterprise-wide risk assessment that considers a wide spectrum of risks facing the Company, including cybersecurity. Through these quarterly risk assessments, management informs the Audit Committee on the cyber risk landscape facing the Company and the Company’s preparedness to manage such risk. The enterprise-wide risk assessment is a top-down risk assessment that leverages the assessments performed by cyber risk management. \nEngagement with External Experts\nThe Company engages top-tier external cyber security firms, as needed, leveraging their expertise as part of our ongoing effort to evaluate and enhance our cybersecurity program. They help with cyber defense capabilities (including staff enhancement of certain functions) and transformation to mitigate associated threats, reduce risk, enhance our cybersecurity posture, and meet the Company's evolving needs.\nOversight of Third-Party Service Providers\nOur third-party risk management program includes processes for identifying and managing material cybersecurity risks arising from third-party providers. Our third-party risk management program actively engages with the enterprise-wide risk assessment process and partners with cyber risk management to report relevant risks to the NCG Committee, the Audit Committee and our internal Enterprise Risk & Compliance Committee. Our third-party risk management program includes cybersecurity as an aspect of its risk assessment of third parties with the objective that key risks are identified and addressed. Moreover, the program also considers risks associated with certain fourth parties, entities that are partners or subcontractors of our direct third-party vendors, through assessments carried out by our third-party service providers.\nCybersecurity Incident Impact\nAs previously disclosed, in August 2021, we experienced a cybersecurity incident that resulted in numerous lawsuits, including mass arbitration claims and multiple class action lawsuits. In January 2023, we experienced another cybersecurity incident that also resulted in consumer class actions and regulatory inquiries. As a result of the August 2021 cyberattack and the January 2023 cyberattack, we have incurred and may continue to incur significant costs or experience other material financial impacts, which may not be covered by, or may exceed the coverage limits of, our cyber liability insurance, and such costs and impacts may have a material adverse effect on our business, reputation, financial condition, cash flows and operating results.\n For additional details regarding the impact of both cybersecurity incidents, see \nNote 1\n8\n – Commitments and Contingencies\n of the Notes to the Consolidated Financial Statements. \nWe have not identified other known risks from previous cybersecurity threats that have materially affected or are reasonably likely to materially affect us. However, we face ongoing risks from certain cybersecurity threats that, if realized, are reasonably likely to materially affect business strategy, results of operations, or financial condition.\n See “Risk Factors – \nWe have experienced criminal cyberattacks and could in the future be further harmed by disruption, data loss or other security breaches, whether directly or indirectly through third parties whose products and services we rely on in operating our business\n.”\nGovernance\nDisclosure of Management’s Responsibilities\nTransformation and Chief Information & Digital Officer \nThe Transformation and Chief Information & Digital Officer under the direction of the Company’s Chief Executive Officer, is responsible for overseeing the Company’s information technology systems, digital capabilities, and cybersecurity practices. \nThe CSO, under the direction of the Transformation and Chief Information & Digital Officer, is responsible for overseeing the \n25\nTable of Contents\ncybersecurity organization and promoting a security-centric culture throughout our business and operational functions.\n The CSO is at the forefront of enhancing our cybersecurity framework and strengthening the overall cybersecurity program. This involves upgrading tools and capabilities, which are part of a broader, multi-year strategy to continue to enhance security measures. The CSO oversees the cyber risk management function, which identifies cybersecurity threats, assesses cybersecurity risks and supports the Transformation and Chief Information & Digital Officer and the Company in managing such risks. \nAs the Company’s Executive Vice President, Transformation and Chief Information & Digital Officer, Néstor Cano has served in several leadership positions at both the Company and Sprint, including as Sprint’s Chief Operating Officer, overseeing, among other things, Sprint’s digital architecture and delivery. Mr. Cano studied industrial engineering at Barcelona Polytechnic University, attended the Executive Distribution Academy by INSEAD Business School in Fontainebleau, France, and also completed his post-graduate degree in executive management at IESE Business School in Barcelona, Spain. \nAs the Company’s CSO, Jeff Simon has extensive experience in risk management and information security, including serving as the Chief Information Security Officer at Fidelity National Information Services, Inc. Mr. Simon received his Master of Science in Computer Science, Software Engineering & Artificial Intelligence from the Johns Hopkins Whiting School of Engineering and Bachelor of Science in Business Administration and Applied Economics from Marquette University. Mr. Simon is a Certified Information Systems Security Professional.\nEnterprise Risk & Compliance Committee \nOur Enterprise Risk & Compliance Committee is comprised of a collective of senior management representatives and subject matter experts from across the Company. The Enterprise Risk & Compliance Committee is chaired by the Chief Financial Officer of the Company, with the Executive Vice President & General Counsel as the co-chair and comprises core members including the Transformation and Chief Information & Digital Officer, while the CSO serves in an advisory capacity. The purpose of the Enterprise Risk & Compliance Committee is to oversee and govern the Company’s risk management, environmental, social, corporate governance, cybersecurity, and operational compliance activities, as well as provide a means of bringing risk issues to the attention of management. Specific to cybersecurity, the Transformation and Chief Information & Digital Officer and the CSO have the expertise to provide insights into the nature of cyber threats, the Company’s readiness, and actions taken to mitigate such risks. \nDisclosure of the Board’s Roles and Responsibilities\nOur Board of Directors oversees risks from cybersecurity threats using a multi-faceted approach that involves the NCG Committee and Audit Committee and various executive roles. Additionally, our Transformation and Chief Information & Digital Officer and CSO report on cybersecurity to the full Board.\nNominating and Corporate Governance Committee\nThe NCG Committee oversees risks associated with data privacy and information security, which encompasses cybersecurity. Our CSO and Chief Compliance Officer, among other executives, provide periodic reports to the NCG Committee and also meet with the NCG Committee to discuss any material events when they arise. The periodic reports are designed to keep the NCG Committee abreast of the Company’s cybersecurity practices, risks and trends in cybersecurity threats. The NCG Committee also has discussions with management focused on evaluating the Company’s exposure to cybersecurity risks and cybersecurity practices in place to mitigate such risks. These discussions enable the NCG Committee to be informed of the steps management is taking to detect, monitor and manage cybersecurity risks. These reports to the NCG Committee typically include information on any significant incidents that have occurred, how they were managed, and any changes to the risk profile of the Company. The NCG Committee seeks updates to facilitate proactive governance and to allow the NCG Committee to address emerging cybersecurity issues with management.\nAudit Committee\nThe Audit Committee is integral to overseeing the Company’s overall risk management strategies, including cybersecurity risks and disclosures.\n \nTo keep the Audit Committee informed, the Chief Audit Executive maintains a direct and open communication channel with the Audit Committee. Regular meetings are held for the Chief Audit Executive to report to the Audit Committee. These include an enterprise-wide risk assessment that highlights cybersecurity risks and cybersecurity risk mitigation actions. Additionally, the Audit Committee receives updates on significant incidents and cybersecurity risks that have been presented to or discussed with the Enterprise Risk & Compliance Committee.\n26\nTable of Contents\nItem 2. Properties\n \nOur properties are best described on a collective basis, as no individual property is material. Our property and equipment consists of the following:\n(percent of gross property and equipment)\nDecember 31, 2024\nDecember 31, 2023\nWireless communications systems\n71 \n%\n68 \n%\nLand, buildings and building equipment\n5 \n%\n5 \n%\nData processing equipment and other\n24 \n%\n27 \n%\nTotal\n100 \n%\n100 \n%\nWireless communications systems primarily consist of assets used to operate our wireless network and information technology data centers, including switching equipment, radio frequency equipment, tower assets, High Speed Internet routers, construction in progress and leasehold improvements related to the wireless network and asset retirement costs.\nLand, buildings and building equipment primarily consist of land and land improvements, central office buildings or any other buildings that house network equipment, buildings used for administrative and other purposes, related construction in progress and certain network service equipment.\nData processing equipment and other primarily consist of data processing equipment, office equipment, capitalized software, leased wireless devices, construction in progress and leasehold improvements.\nWe also lease distributed antenna systems and small cell sites, as well as properties throughout the United States that contain data and switching centers, customer call centers, retail locations, warehouses and administrative spaces.\nItem 3. Legal Proceedings\nFor more information regarding the legal proceedings in which we are involved, see \nNote 1\n8\n – Commitments and Contingencies\n of the Notes to the Consolidated Financial Statements.\nItem 4. Mine Safety Disclosures\nNot applicable.\n27\nTable of Contents\nPART II.\nItem 5. Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nMarket Information\nOur common stock is traded on the NASDAQ Global Select Market under the symbol “TMUS.” We are included within the S&P 500 in the Wireless Telecommunication Services GICS (Global Industry Classification Standard) Sub-Industry index. As of January 24, 2025, there were 14,513 registered stockholders of record of our common stock, but we estimate the total number of stockholders to be much higher as a number of our shares are held by brokers or dealers for their customers in street name.\nDuring the year ended December 31, 2024, we declared and paid cash dividends totaling $2.83 per share, as part of our 2023-2024 Stockholder Return Program (as defined below). Additionally, on November 21, 2024, our Board of Directors declared a quarterly cash dividend of $0.88 per share on our issued and outstanding common stock, which will be paid on March 13, 2025, to stockholders of record as of the close of business on February 28, 2025, as part of our 2025 Stockholder Return Program (as defined below).\nIssuer Purchases of Equity Securities\nThe table below provides information regarding our share repurchases during the three months ended December 31, 2024:\n(in millions, except share and per share amounts)\nTotal Number of Shares Purchased\nAverage Price Paid per Share\nTotal Number of Shares Purchased as Part of Publicly Announced Plans or Programs\nApproximate Dollar Value of Shares that may yet be Purchased Under the Plans or Programs \n(1)\nOctober 1, 2024 - October 31, 2024\n7,070,211 \n$\n217.82 \n7,070,211 \n$\n5,731 \nNovember 1, 2024 - November 30, 2024\n6,527,845 \n235.76 \n6,527,845 \n4,192 \nDecember 1, 2024 - December 31, 2024\n6,685,526 \n230.35 \n6,685,526 \n14,004 \nTotal\n20,283,582 \n20,283,582 \n(1)    On September 6, 2023, our Board of Directors authorized a stockholder return program for up to $19.0 billion of repurchases of our common stock and payment of dividends through December 31, 2024 (the “2023-2024 Stockholder Return Program”). On December 13, 2024, we announced that our Board of Directors authorized a stockholder return program for up to an additional $14.0 billion that will run through December 31, 2025 (the “2025 Stockholder Return Program”). The amounts presented represent the remaining dollar amount authorized for purchase under the 2023-2024 Stockholder Return Program and 2025 Stockholder Return Program, as applicable, as of the end of the period, which has been reduced by the amount of any cash dividends declared and paid by the Company.\nSee \nNote 1\n5\n - Stockholder Return Programs\n of the Notes to the Consolidated Financial Statements for more information about our 2023-2024 Stockholder Return Program and 2025 Stockholder Return Program.\n28\nTable of Contents\nPerformance Graph\nThe graph below compares the five-year cumulative total returns of T-Mobile, the S&P 500 index, the NASDAQ Composite index and the Dow Jones US Mobile Telecommunications TSM index. The graph tracks the performance of a $100 investment, with the reinvestment of all dividends, from December 31, 2019 to December 31, 2024. \nThe five-year cumulative total returns of T-Mobile, the S&P 500 index, the NASDAQ Composite index and the Dow Jones US Mobile Telecommunications TSM index, as illustrated in the graph above, are as follows:\nAt December 31,\n(in dollars)\n2019\n2020\n2021\n2022\n2023\n2024\nT-Mobile US, Inc.\n$\n100.00 \n$\n171.96 \n$\n147.90 \n$\n178.53 \n$\n205.33 \n$\n286.82 \nS&P 500\n100.00 \n118.40 \n152.39 \n124.79 \n157.59 \n197.02 \nNASDAQ Composite\n100.00 \n144.92 \n177.06 \n119.45 \n172.77 \n223.87 \nDow Jones US Mobile Telecommunications TSM\n100.00 \n109.03 \n99.62 \n89.92 \n96.64 \n118.64 \nThe stock price performance included in this graph is not necessarily indicative of future stock price performance.\nItem 6. [Reserved]\n29\nTable of Contents\nItem 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nThe objectives of our Management’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) are to provide users of our consolidated financial statements with the following:\n•\nA narrative explanation from the perspective of management of our financial condition, results of operations, cash flows, liquidity and certain other factors that may affect future results;\n•\nContext to the consolidated financial statements; and\n•\nInformation that allows assessment of the likelihood that past performance is indicative of future performance.\nOur MD&A is provided as a supplement to, and should be read together with, our audited consolidated financial statements as of December 31, 2024 and 2023, and for each of the three years in the period ended December 31, 2024, included in \nPart II, Item 8\n of this Form 10-K. Except as expressly stated, the financial condition and results of operations discussed throughout our MD&A are those of T-Mobile US, Inc. and its consolidated subsidiaries.\nMerger-Related Costs\nMerger-related costs associated with our Merger with Sprint generally include:\n•\nIntegration costs to achieve efficiencies in network, retail, information technology and back office operations, migrate customers to the T-Mobile network and billing systems and the impact of legal matters assumed as part of the Merger;\n•\nRestructuring costs, including severance, store rationalization and network decommissioning; and\n•\nTransaction costs, including legal and professional services related to the completion of the transactions.\nMerger-related costs have been excluded from our calculations of Adjusted EBITDA and Core Adjusted EBITDA, which are non-GAAP financial measures, as we do not consider these costs to be reflective of our ongoing operating performance. See “Adjusted EBITDA and Core Adjusted EBITDA” in the “\nPerformance Measures\n” section of this MD&A. Net cash payments for Merger-related costs, including payments related to our restructuring plan, are included in Net cash provided by operating activities on our Consolidated Statements of Cash Flows and our calculation of Adjusted Free Cash Flow.\nDuring the year ended December 31, 2024, we recognized a gain for the $100 million extension fee previously paid by DISH associated with the DISH License Purchase Agreement as a reduction to Selling, general and administrative expenses on our Consolidated Statements of Comprehensive Income. The gain was presented as a reduction in Merger-related costs and excluded from our calculations of Adjusted EBITDA and Core Adjusted EBITDA. See \nNote \n7\n – Goodwill, Spectrum License Transactions and Other Intangible Assets\n of the Notes to the Consolidated Financial Statements for more information.\nAs of June 30, 2024, we have incurred substantially all restructuring and integration costs associated with the Merger and, accordingly, no longer separately disclose Merger-related costs. The cash payments for the Merger-related costs incurred extend beyond 2024. Cash payments extending beyond 2024 primarily relate to operating and financing leases for which we have recognized accelerated lease expense. See \nNote \n19\n – Restructuring Costs\n of the Notes to the Consolidated Financial Statements for more information. \nMerger-related costs are presented below:\n(in millions)\nYear Ended December 31,\n2024 Versus 2023\n2023 Versus 2022\n2024\n2023\n2022\n$ Change\n% Change\n$ Change\n% Change\nMerger-related costs\nCost of services, exclusive of depreciation and amortization\n$\n180 \n$\n652 \n$\n2,670 \n$\n(472)\n(72)\n%\n$\n(2,018)\n(76)\n%\nCost of equipment sales, exclusive of depreciation and amortization\n— \n(12)\n1,524 \n12 \n(100)\n%\n(1,536)\n(101)\n%\nSelling, general and administrative\n(59)\n394 \n775 \n(453)\n(115)\n%\n(381)\n(49)\n%\nTotal Merger-related costs\n$\n121 \n$\n1,034 \n$\n4,969 \n$\n(913)\n(88)\n%\n$\n(3,935)\n(79)\n%\nNet cash payments for Merger-related costs\n$\n767 \n$\n1,973 \n$\n3,364 \n$\n(1,206)\n(61)\n%\n$\n(1,391)\n(41)\n%\n30\nTable of Contents\n2023 Workforce Reduction\nIn August 2023, we implemented an initiative to reduce the size of our workforce by approximately 5,000 positions, just under 7% of our total employee base, primarily in corporate and back-office functions, and some technology roles.\nSee \nNote \n19\n – Restructuring Costs\n of the Notes to the Consolidated Financial Statements for more information. \nJoint Ventures\nOn April 24, 2024, we entered into a definitive agreement with a fund operated by EQT, Infrastructure VI fund (“Fund VI”), to establish a joint venture between us and Fund VI to acquire Lumos (“Lumos”), a fiber-to-the-home platform, from EQT’s predecessor fund, EQT Infrastructure III. The arrangement is expected to close in the first half of 2025, subject to customary closing conditions and regulatory approvals. At closing, we expect to invest approximately $950 million in the joint venture to acquire a 50% equity interest and all existing Lumos fiber customers. The funds invested by us will be used to fund future fiber builds. In addition, pursuant to the definitive agreement, we expect to make an additional capital contribution of approximately $500 million in 2027 or 2028 under the existing business plan. \nOn July 18, 2024, we entered into a definitive agreement with KKR & Co. Inc. (“KKR”) to establish a joint venture to acquire Metronet Holdings, LLC and certain of its affiliates (collectively, “Metronet”), a fiber-to-the-home platform. This arrangement is expected to close in 2025, subject to customary closing conditions and regulatory approvals. At closing, we expect to invest approximately $4.9 billion in the joint venture to acquire a 50% equity interest and all existing residential fiber customers, as well as funding the joint venture. We do not anticipate making further capital contributions following the closing under the existing business plan. \nThe joint ventures will focus on market identification and selection, build plans, network engineering and design, network deployment, and customer installation, with us owning customer relationships and selling fiber service under the T-Mobile brand. Upon closing of the transactions, we expect to account for the Lumos and Metronet joint ventures under the equity method of accounting and recognize service revenues for the acquired Lumos and Metronet fiber customers and wholesale costs paid to the joint ventures for network access within Cost of services on our Consolidated Statements of Comprehensive Income.\nAcquisition of Ka’ena Corporation\nOn May 1, 2024 (the “Acquisition Date”), we completed the merger with Ka’ena Corporation and its subsidiaries, including, among others, Mint Mobile LLC (collectively, “Ka’ena”), and as a result, Ka’ena became a wholly owned subsidiary of T-Mobile (the “Ka’ena Acquisition”). The total purchase price is variable, dependent upon specified performance indicators of Ka’ena, and consists of an upfront payment on the Acquisition Date and an earnout payable on August 1, 2026. On the Acquisition Date and in satisfaction of the upfront payment, we transferred $420 million in cash and 3,264,952 shares of T-Mobile common stock valued at $536 million as determined based on its closing market price on April 30, 2024, for a total payment fair value of $956 million. A portion of the upfront payment made on the Acquisition Date was for the settlement of the preexisting wholesale relationship with Ka’ena. The amount of the upfront payment was subject to customary adjustments and as a result of such adjustments, $17 million of the upfront payment was returned to T-Mobile during the fourth quarter of 2024, which resulted in a commensurate increase in the maximum payable in satisfaction of the earnout.\nBased on the adjusted amount paid upfront, up to an additional $420 million in future cash and T-Mobile common stock is payable in satisfaction of the earnout, dependent upon Ka’ena’s achievement of specified performance indicators.\nPrior to the Ka’ena Acquisition, Ka’ena was a wholesale partner of the Company for which we recognized service revenues within Wholesale and other service revenues. Upon the closing of the Ka’ena Acquisition, this relationship was effectively terminated, and the Company acquired Ka’ena’s prepaid customer relationships and began to recognize service revenues associated with these customers within Prepaid revenues and operating expenses primarily within Selling, general and administrative expenses on our Consolidated Statements of Comprehensive Income subsequent to the Acquisition Date.\nFor more information regarding the Ka’ena Acquisition, see \nNote 2 – Business Combinations\n of the Notes to the Consolidated Financial Statements.\nAcquisition of UScellular Wireless Operations\nOn May 24, 2024, we entered into a securities purchase agreement with United States Cellular Corporation (“UScellular”), Telephone and Data Systems, Inc., and USCC Wireless Holdings, LLC, pursuant to which, among other things, we will acquire \n31\nTable of Contents\nsubstantially all of UScellular’s wireless operations and select spectrum assets for an aggregate purchase price of approximately $4.4 billion, payable in cash and the assumption of up to $2.0 billion of debt through an exchange offer to be made to certain UScellular debtholders prior to closing. To the extent any debtholders do not participate in the exchange, their bonds will continue as obligations of UScellular, and the cash portion of the purchase price will be correspondingly increased. The transaction is expected to close in mid-2025, subject to customary closing conditions and receipt of certain regulatory approvals. Upon closing of the transaction, we expect to account for the UScellular transaction as a business combination and to consolidate the acquired operations. We expect this transaction will yield approximately $1.0 billion in total annual run rate cost synergies, including operating expense and capital expenditure synergies, upon integration, with total cost to achieve the integration currently estimated at between $2.2 billion to $2.6 billion.\nFor more information regarding our acquisition of UScellular’s wireless operations, see \nNote 2 – Business Combinations\n of the Notes to the Consolidated Financial Statements.\nAcquisition of Vistar Media Inc.\nOn December 20, 2024, we entered into an agreement and plan of merger for the acquisition of 100% of the outstanding capital stock of Vistar Media Inc., a provider of technology solutions for digital-out-of-home advertisements, for a purchase price of approximately $625 million. The purchase price is subject to certain agreed-upon working capital and other adjustments. The acquisition is subject to certain customary closing conditions, including certain regulatory approvals, and is expected to close in the first quarter of 2025.\nRevenue Trends \nIn 2025, we expect Postpaid service revenues to continue to grow, primarily due to continued postpaid account and customer growth as well as postpaid Average Revenue per Account (“ARPA”) growth driven by the execution of our strategy to continuously deepen our account relationships, including growth in High Speed Internet. We also expect an increase in service revenues upon the closing of our previously announced joint ventures and acquisition of UScellular. In addition, Wholesale and other service revenues are expected to continue to decline primarily as DISH services more of its Boost customers with their standalone network.\nOperating Expense Trends\nIn 2025, we expect Total operating expenses to increase, primarily driven by higher Depreciation and amortization from assets placed into service \nassociated with our continued build-out of our nationwide 5G network, a\ns well as higher Cost of equipment sales, driven by higher expected unit sales from a growing customer base. We also expect an increase in Total operating expenses upon the closing of our previously announced joint ventures and acquisition of UScellular. We expect these increases to be partially offset by synergy realization from the acquisition of UScellular benefiting Cost of services.\nMacroeconomic Trends\nMacroeconomic trends may result in adverse impacts on our business, and we continue to monitor these potential impacts, including potential economic recession, changes in the Federal Reserve’s monetary policy, as well as geopolitical risks, including the Ukraine-Russia and Israel-Hamas wars and further escalations thereof. Such scenarios and uncertainties may affect, among others, expected credit loss activity as well as certain fair value estimates. \nTo date, price inflation has not had a significant impact on our operations as we have fixed rates established through long-term contracts for many of our most significant costs, including for many of our tower agreements and backhaul contracts. Similarly, our exposure to the impact of rising interest rates is limited, primarily to any new debt issuances or draws on our Revolving Credit Facility (as defined below), as interest is paid on our Senior Notes at a fixed rate. We continue to monitor the impact of these trends on the payment performance of our customers.\n32\nTable of Contents\nResults of Operations\nSet forth below is a summary of our consolidated financial results:\nYear Ended December 31,\n2024 Versus 2023\n2023 Versus 2022\n(in millions)\n2024\n2023\n2022\n$ Change\n% Change\n$ Change\n% Change\nRevenues\nPostpaid revenues\n$\n52,340 \n$\n48,692 \n$\n45,919 \n$\n3,648 \n7 \n%\n$\n2,773 \n6 \n%\nPrepaid revenues\n10,399 \n9,767 \n9,857 \n632 \n6 \n%\n(90)\n(1)\n%\nWholesale and other service revenues\n3,439 \n4,782 \n5,547 \n(1,343)\n(28)\n%\n(765)\n(14)\n%\nTotal service revenues\n66,178 \n63,241 \n61,323 \n2,937 \n5 \n%\n1,918 \n3 \n%\nEquipment revenues\n14,263 \n14,138 \n17,130 \n125 \n1 \n%\n(2,992)\n(17)\n%\nOther revenues\n959 \n1,179 \n1,118 \n(220)\n(19)\n%\n61 \n5 \n%\nTotal revenues\n81,400 \n78,558 \n79,571 \n2,842 \n4 \n%\n(1,013)\n(1)\n%\nOperating expenses\nCost of services, exclusive of depreciation and amortization shown separately below\n10,771 \n11,655 \n14,666 \n(884)\n(8)\n%\n(3,011)\n(21)\n%\nCost of equipment sales, exclusive of depreciation and amortization shown separately below\n18,882 \n18,533 \n21,540 \n349 \n2 \n%\n(3,007)\n(14)\n%\nSelling, general and administrative\n20,818 \n21,311 \n21,607 \n(493)\n(2)\n%\n(296)\n(1)\n%\nImpairment expense\n— \n— \n477 \n— \nNM\n(477)\n(100)\n%\n(Gain) loss on disposal group held for sale\n— \n(25)\n1,087 \n25 \n(100)\n%\n(1,112)\n(102)\n%\nDepreciation and amortization\n12,919 \n12,818 \n13,651 \n101 \n1 \n%\n(833)\n(6)\n%\nTotal operating expenses\n63,390 \n64,292 \n73,028 \n(902)\n(1)\n%\n(8,736)\n(12)\n%\nOperating income\n18,010 \n14,266 \n6,543 \n3,744 \n26 \n%\n7,723 \n118 \n%\nOther expense, net\nInterest expense, net\n(3,411)\n(3,335)\n(3,364)\n(76)\n2 \n%\n29 \n(1)\n%\nOther income (expense), net\n113 \n68 \n(33)\n45 \n66 \n%\n101 \n(306)\n%\nTotal other expense, net\n(3,298)\n(3,267)\n(3,397)\n(31)\n1 \n%\n130 \n(4)\n%\nIncome before income taxes\n14,712 \n10,999 \n3,146 \n3,713 \n34 \n%\n7,853 \n250 \n%\nIncome tax expense\n(3,373)\n(2,682)\n(556)\n(691)\n26 \n%\n(2,126)\n382 \n%\nNet income\n$\n11,339 \n$\n8,317 \n$\n2,590 \n$\n3,022 \n36 \n%\n$\n5,727 \n221 \n%\nStatement of Cash Flows Data\nNet cash provided by operating activities\n$\n22,293 \n$\n18,559 \n$\n16,781 \n$\n3,734 \n20 \n%\n$\n1,778 \n11 \n%\nNet cash used in investing activities\n(9,072)\n(5,829)\n(12,359)\n(3,243)\n56 \n%\n6,530 \n(53)\n%\nNet cash used in financing activities\n(12,815)\n(12,097)\n(6,451)\n(718)\n6 \n%\n(5,646)\n88 \n%\nNon-GAAP Financial Measures\nAdjusted EBITDA\n$\n31,864 \n$\n29,428 \n$\n27,821 \n$\n2,436 \n8 \n%\n$\n1,607 \n6 \n%\nCore Adjusted EBITDA\n31,771 \n29,116 \n26,391 \n2,655 \n9 \n%\n2,725 \n10 \n%\nAdjusted Free Cash Flow\n17,032 \n13,586 \n7,656 \n3,446 \n25 \n%\n5,930\n77 \n%\nNM - Not meaningful\n33\nTable of Contents\nThe following discussion and analysis is for the year ended December 31, 2024, compared to the same period in 2023, unless otherwise stated.\n \nFor a discussion and analysis of the year ended December 31, 2023, compared to the same period in 2022, please refer to Management’s Discussion and Analysis of Financial Condition and Results of Operations included in Part II, Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2023, filed with the SEC on February 2, 2024.\n \nTotal revenues \nincreased $2.8 billion, or 4%. The components of these changes are discussed below.\nPostpaid revenues \nincreased $3.6 billion, or 7%, primarily from:\n•\nHigher average postpaid accounts; and\n•\nHigher postpaid ARPA. See “Postpaid ARPA” in the “\nPerformance Measures\n” section of this MD&A.\nPrepaid revenues\n increased $632 million, or 6%, primarily from:\n•\nHigher average prepaid customers, primarily from the prepaid customers acquired through the Ka’ena Acquisition; partially offset by\n•\nLower prepaid ARPU. See “Prepaid ARPU” in the “\nPerformance Measures\n” section of this MD&A.\nWholesale and other service revenues\n decreased $1.3 billion, or 28%, primarily from:\n•\nLower MVNO revenues, including the impact from the Ka’ena Acquisition, and lower DISH and TracFone MVNO revenue;\n•\nLower Affordable Connectivity Program and Lifeline revenues; and\n•\nLower Wireline revenues due to the sale of the Wireline Business on May 1, 2023.\nEquipment revenues \nincreased slightly, primarily from:\n•\nAn increase of $627 million in liquidation revenue, primarily due to a higher number of liquidated devices, including the impact from the transition of certain device recovery programs from external sources to in-house processing; mostly offset by\n•\nA decrease of $231 million in device sales revenue, excluding purchased leased devices, primarily from:\n•\nA net decrease in the total number of devices sold, driven by lower Assurance Wireless and prepaid devices, partially offset by higher postpaid devices; partially offset by\n•\nHigher average revenue per device sold, net of promotions, primarily driven by an increase in the high-end phone mix; and\n•\nA decrease of $219 million in lease revenues, primarily due to a lower number of customer devices under lease as a result of the continued strategic shift in device financing from leasing to EIP.\nOther revenues \ndecreased $220 million, or 19%, primarily from the transition of certain device recovery programs from external sources to in-house processing, resulting in a change in presentation from Other revenues to Equipment revenues.\nTotal operating expenses\n decreased $902 million, or 1%. The components of this change are discussed below.\nCost of services\n, exclusive of depreciation and amortization, decreased $884 million, or 8%, primarily from:\n•\nA decrease of $472 million in Merger-related costs related to network decommissioning and integration;\n•\nLower costs due to the sale of the Wireline Business on May 1, 2023; \n•\nLower employee costs, primarily due to reduced headcount;\n•\n$141 million of severance and related costs associated with the August 2023 workforce reduction recognized in the prior year; and\n•\nHigher Merger synergies; partially offset by\n•\nHigher site costs related to the continued build-out of our nationwide 5G network.\n34\nTable of Contents\nCost of equipment sales\n, exclusive of depreciation and amortization, increased $349 million, or 2%, primarily from:\n•\nAn increase of $457 million in liquidation costs, primarily due to a higher number of liquidated devices, including the impact from the transition of certain device recovery programs from external sources to in-house processing; partially offset by\n•\nA decrease of $81 million in device cost of equipment sales, excluding purchased leased devices, primarily from:\n•\nA net decrease in the total number of devices sold, driven by lower Assurance Wireless and prepaid devices, partially offset by higher postpaid devices; partially offset by\n•\nHigher average cost per device sold, primarily driven by an increase in the high-end phone mix.\nSelling, general and administrative\n expenses decreased $493 million, or 2%, primarily from:\n•\nA decrease of $453 million in Merger-related costs, including the $100 million gain recognized during the year ended December 31, 2024, for the extension fee previously paid by DISH associated with the DISH License Purchase Agreement;\n•\n$321 million of severance and related costs associated with the August 2023 workforce reduction recognized in the prior year; \n•\n$202 million of gains associated with the closing of certain spectrum exchange transactions and $105 million of legal-related insurance recoveries recognized during the year ended December 31, 2024; and \n•\nHigher Merger synergies; partially offset by\n•\nHigher costs as a result of the Ka’ena Acquisition; and\n•\nHigher advertising expenses. \nGain on disposal group held for sale\n was $25 million for the year ended December 31, 2023, related to the sale of the Wireline Business on May 1, 2023. There was no gain or loss on disposal group held for sale for the year ended December 31, 2024.\nDepreciation and amortization\n increased slightly, primarily from higher depreciation expense from the acceleration of certain technology assets in the first half of 2024 as we continue to modernize our network, technology systems and platforms and from the continued build-out of our nationwide 5G network.\nOperating income\n, the components of which are discussed above, increased $3.7 billion, or 26%.\nInterest expense, net\n increased slightly, primarily from:\n•\nHigher interest expense, primarily due to higher average debt outstanding and a higher average effective interest rate; mostly offset by\n•\nHigher interest income, primarily due to higher average balances and higher average interest rates on short-term cash equivalents.\nOther income, net\n increased $45 million, or 66%, primarily from the $80 million gain recognized during the year ended December 31, 2024, associated with the partial settlement of the Sprint Retirement Pension Plan retiree obligations. See \nNote 13 – Employee Compensation and Benefit Plans\n for additional information. \nIncome before income taxes\n, the components of which are discussed above, was $14.7 billion and $11.0 billion for the years ended December 31, 2024 and 2023, respectively.\nIncome tax expense\n increased $691 million, or 26%, primarily from:\n•\nHigher income before income taxes; partially offset by\n•\nAn increase in tax benefits from adjustments to certain tax reserves; and\n•\nNet tax benefits recognized from a remeasurement of deferred tax assets and liabilities in certain state jurisdictions.\nOur effective tax rate was 22.9% and 24.4% for the years ended December 31, 2024 and 2023, respectively.\n35\nTable of Contents\nNet income\n, the components of which are discussed above, was $11.3 billion and $8.3 billion for the years ended December 31, 2024 and 2023, respectively. Net income included:\n•\nMerger-related costs, net of Merger-related gain and tax, of $91 million for the year ended December 31, 2024, compared to Merger-related costs, net of tax, of $775 million for the year ended December 31, 2023. \n•\nSeverance and related costs associated with the August 2023 workforce reduction of $347 million, net of tax, for the year ended December 31, 2023.\nGuarantor Financial Information\nPursuant to the applicable indentures and supplemental indentures, the Senior Notes to affiliates and third parties issued by T-Mobile USA, Inc., Sprint and Sprint Capital Corporation (collectively, the “Issuers”) are fully and unconditionally guaranteed, jointly and severally, on a senior unsecured basis by T-Mobile (“Parent”) and certain of Parent’s 100% owned subsidiaries (“Guarantor Subsidiaries”).\nThe guarantees of the Guarantor Subsidiaries are subject to release in limited circumstances only upon the occurrence of certain customary conditions. Generally, the guarantees of the Guarantor Subsidiaries with respect to the Senior Notes issued by T-Mobile USA, Inc. (other than $3.5 billion in principal amount of Senior Notes issued in 2017 and 2018) and the credit agreement entered into by T-Mobile USA, Inc. will be automatically and unconditionally released if, immediately following such release and any concurrent releases of other guarantees, the aggregate principal amount of indebtedness of non-guarantor subsidiaries (other than certain specified subsidiaries) would not exceed $2.0 billion. The indentures, supplemental indentures and credit agreements governing the long-term debt contain covenants that, among other things, limit the ability of the Issuers or borrowers and the Guarantor Subsidiaries to incur more debt, create liens or other encumbrances, and to merge, consolidate or sell, or otherwise dispose of, substantially all of their assets.\nBasis of Presentation\nThe following tables include summarized financial information of the obligor groups of debt issued by T-Mobile USA, Inc., Sprint and Sprint Capital Corporation. The summarized financial information of each obligor group is presented on a combined basis with balances and transactions within the obligor group eliminated. Investments in and the equity in earnings of non-guarantor subsidiaries, which would otherwise be consolidated in accordance with GAAP, are excluded from the below summarized financial information pursuant to SEC Regulation S-X Rule 13-01.\nThe summarized balance sheet information for the consolidated obligor group of debt issued by T-Mobile USA, Inc. is presented in the table below:\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nCurrent assets\n$\n16,741 \n$\n17,601 \nNoncurrent assets\n179,335 \n178,252 \nCurrent liabilities\n18,279 \n19,040 \nNoncurrent liabilities \n(1)\n122,934 \n128,197 \nDue to non-guarantors \n(1)\n \n1,507 \n10,916 \nDue to related parties\n2,098 \n1,576 \n(1)     The decrease in Noncurrent liabilities and Due to non-guarantors was primarily driven by the impact of certain intercompany settlements during the year ended December 31, 2024.\nThe summarized results of operations information for the consolidated obligor group of debt issued by T-Mobile USA, Inc. is presented in the table below: \n(in millions)\nYear Ended\nDecember 31, 2024\nYear Ended\nDecember 31, 2023\nTotal revenues\n$\n78,996 \n$\n75,934 \nOperating income\n14,463 \n10,707 \nNet income\n8,360 \n4,766 \nRevenue from non-guarantors\n2,619 \n2,393 \nOperating expenses to non-guarantors\n2,481 \n2,569 \nOther expense to non-guarantors\n(116)\n(699)\n36\nTable of Contents\nThe summarized balance sheet information for the consolidated obligor group of debt issued by Sprint is presented in the table below:\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nCurrent assets\n$\n10,970 \n$\n11,193 \nNoncurrent assets\n14,734 \n11,324 \nCurrent liabilities\n12,683 \n12,751 \nNoncurrent liabilities \n(1)\n96,145 \n110,688 \nDue to non-guarantors \n(1)\n21,371 \n41,805 \nDue to related parties\n2,098 \n1,576 \n(1)     The decrease in Noncurrent liabilities and Due to non-guarantors was primarily driven by the impact of certain intercompany settlements during the year ended December 31, 2024.\nThe summarized results of operations information for the consolidated obligor group of debt issued by Sprint is presented in the table below:\n(in millions)\nYear Ended\nDecember 31, 2024\nYear Ended\nDecember 31, 2023\nTotal revenues\n$\n330 \n$\n19 \nOperating loss\n(3,628)\n(3,197)\nNet loss\n(8,101)\n(7,629)\nOther expense, net, to non-guarantors\n(584)\n(2,005)\nThe summarized balance sheet information for the consolidated obligor group of debt issued by Sprint Capital Corporation is presented in the table below:\n(in millions)\nDecember 31, 2024\nDecember 31, 2023\nCurrent assets\n$\n10,970 \n$\n11,193 \nNoncurrent assets\n14,734 \n11,324 \nCurrent liabilities\n12,756 \n12,823 \nNoncurrent liabilities \n(1)\n92,278 \n106,881 \nDue to non-guarantors \n(1)\n12,318 \n32,706 \nDue to related parties\n2,098 \n1,576 \n(1)     The decrease in Noncurrent liabilities and Due to non-guarantors was primarily driven by the impact of certain intercompany settlements during the year ended December 31, 2024.\nThe summarized results of operations information for the consolidated obligor group of debt issued by Sprint Capital Corporation is presented in the table below: \n(in millions)\nYear Ended\nDecember 31, 2024\nYear Ended\nDecember 31, 2023\nTotal revenues\n$\n330 \n$\n19 \nOperating loss\n(3,628)\n(3,197)\nNet loss\n(8,041)\n(7,491)\nOther expense, net, to non-guarantors\n(257)\n(1,489)\nPerformance Measures\nIn managing our business and assessing financial performance, we supplement the information provided by our consolidated financial statements with other operating or statistical data and non-GAAP financial measures. These operating and financial measures are utilized by our management to evaluate our operating performance and, in certain cases, our ability to meet liquidity requirements. Although companies in the wireless industry may not define each of these measures in precisely the same way, we believe that these measures facilitate comparisons with other companies in the wireless industry on key operating and financial measures.\nPostpaid Accounts\nA postpaid account is generally defined as a billing account number that generates revenue. Postpaid accounts generally consist of customers that are qualified for postpaid service utilizing phones, High Speed Internet modems, mobile internet devices (including tablets and hotspots), wearables, DIGITS and other connected devices (including SyncUP and IoT), where they generally pay after receiving service.\n37\nTable of Contents\nThe following table sets forth the number of ending postpaid accounts:\nAs of December 31,\n2024 Versus 2023\n2023 Versus 2022\n(in thousands)\n2024\n2023\n2022\n# Change\n% Change\n# Change\n% Change\nPostpaid accounts \n(1)\n30,894 \n29,797 \n28,526 \n1,097 \n4 \n%\n1,271 \n4 \n%\n(1)    Customers impacted by the decommissioning of the legacy Sprint CDMA and LTE and T-Mobile UMTS networks have been excluded from our postpaid account base resulting in the removal of 57,000 postpaid accounts in the first quarter of 2022 and 69,000 postpaid accounts in the second quarter of 2022.\nPostpaid Net Account Additions\nThe following table sets forth the number of postpaid net account additions:\nYear Ended December 31,\n2024 Versus 2023\n2023 Versus 2022\n(in thousands)\n2024\n2023\n2022\n# Change\n% Change\n# Change\n% Change\nPostpaid net account additions\n1,097 \n1,271 \n1,436 \n(174)\n(14)\n%\n(165)\n(11)\n%\nPostpaid net account additions decreased 174,000, or 14%, for the year ended December 31, 2024, primarily from fewer High Speed Internet only additions.\nCustomers\nA customer is generally defined as a SIM number with a unique T-Mobile identifier which is associated with an account that generates revenue. Customers are qualified either for postpaid service utilizing phones, High Speed Internet modems, mobile internet devices (including tablets and hotspots), wearables, DIGITS and other connected devices (including SyncUP and IoT), where they generally pay after receiving service, or prepaid service, where they generally pay in advance of receiving service.\nThe following table sets forth the number of ending customers:\nAs of December 31,\n2024 Versus 2023\n2023 Versus 2022\n(in thousands)\n2024\n2023\n2022\n# Change\n% Change\n# Change\n% Change\nCustomers, end of period\nPostpaid phone customers\n79,013 \n75,936 \n72,834 \n3,077 \n4 \n%\n3,102 \n4 \n%\nPostpaid other customers\n25,105 \n22,116 \n19,398 \n2,989 \n14 \n%\n2,718 \n14 \n%\nTotal postpaid customers\n104,118 \n98,052 \n92,232 \n6,066 \n6 \n%\n5,820 \n6 \n%\nPrepaid customers \n(1)\n25,410 \n21,648 \n21,366 \n3,762 \n17 \n%\n282 \n1 \n%\nTotal customers\n129,528 \n119,700 \n113,598 \n9,828 \n8 \n%\n6,102 \n5 \n%\nAdjustments to customers \n(1) (2)\n3,504 \n170 \n(1,878)\n3,334 \nNM\n2,048 \n(109)\n%\n(1)    In the second quarter of 2024, we acquired 3,504,000 prepaid customers through the Ka’ena Acquisition, which includes the impact of certain base adjustments to align the policies of Ka’ena and T-Mobile.\n(2)    Customers impacted by the decommissioning of the legacy Sprint CDMA and LTE and T-Mobile UMTS networks have been excluded from our customer base resulting in the removal of 212,000 postpaid phone customers and 349,000 postpaid other customers in the first quarter of 2022 and 284,000 postpaid phone customers, 946,000 postpaid other customers and 28,000 prepaid customers in the second quarter of 2022. In the fourth quarter of 2023, we recognized an additional base adjustment to increase postpaid phone customers by 20,000 and increase postpaid other customers by 150,000 due to fewer customers than expected whose service was deactivated as a result of the network shut-downs. In connection with our acquisition of companies, we included a base adjustment in the first quarter of 2022 to increase postpaid phone customers by 17,000 and reduce postpaid other customers by 14,000. Certain customers now serviced through reseller contracts were removed from our reported postpaid customer base resulting in the removal of 42,000 postpaid phone customers and 20,000 postpaid other customers in the second quarter of 2022.\nNM - Not meaningful\nHigh Speed Internet customers included in Postpaid other customers were 5,742,000 and 4,288,000 as of December 31, 2024 and 2023, respectively. High Speed Internet customers included in Prepaid customers were 688,000 and 488,000 as of December 31, 2024 and 2023, respectively.\n38\nTable of Contents\nNet Customer Additions\nThe following table sets forth the number of net customer additions:\nYear Ended December 31,\n2024 Versus 2023\n2023 Versus 2022\n(in thousands)\n2024\n2023\n2022\n# Change\n% Change\n# Change\n% Change\nNet customer additions\nPostpaid phone customers \n3,077 \n3,082 \n3,093 \n(5)\n— \n%\n(11)\n— \n%\nPostpaid other customers\n2,989 \n2,568 \n3,326 \n421 \n16 \n%\n(758)\n(23)\n%\nTotal postpaid customers\n6,066 \n5,650 \n6,419 \n416 \n7 \n%\n(769)\n(12)\n%\nPrepaid customers\n258 \n282 \n338 \n(24)\n(9)\n%\n(56)\n(17)\n%\nTotal net customer additions\n6,324 \n5,932 \n6,757 \n392 \n7 \n%\n(825)\n(12)\n%\nAdjustments to customers \n(1) (2)\n3,504 \n170 \n(1,878)\n3,334 \nNM\n2,048 \n(109)\n%\n(1)    In the second quarter of 2024, we acquired 3,504,000 prepaid customers through the Ka’ena Acquisition, which includes the impact of certain base adjustments to align the policies of Ka’ena and T-Mobile.\n(2)    Customers impacted by the decommissioning of the legacy Sprint CDMA and LTE and T-Mobile UMTS networks have been excluded from our customer base resulting in the removal of 212,000 postpaid phone customers and 349,000 postpaid other customers in the first quarter of 2022 and 284,000 postpaid phone customers, 946,000 postpaid other customers and 28,000 prepaid customers in the second quarter of 2022. In the fourth quarter of 2023, we recognized an additional base adjustment to increase postpaid phone customers by 20,000 and increase postpaid other customers by 150,000 due to fewer customers than expected whose service was deactivated as a result of the network shut-downs. In connection with our acquisition of companies, we included a base adjustment in the first quarter of 2022 to increase postpaid phone customers by 17,000 and reduce postpaid other customers by 14,000. Certain customers now serviced through reseller contracts were removed from our reported postpaid customer base resulting in the removal of 42,000 postpaid phone customers and 20,000 postpaid other customers in the second quarter of 2022.\nNM - Not meaningful\nTotal net customer additions increased 392,000, or 7%, primarily from:\n•\nHigher postpaid other net customer additions, primarily due to\n•\nHigher net additions from mobile internet devices, primarily due to higher prior year deactivations of lower ARPU mobile internet devices in the educational sector that were activated during the COVID-19 pandemic and no longer needed; and\n•\nHigher net additions from other connected devices; partially offset by\n•\nLower net additions from wearables; and\n•\nLower net additions from High Speed Internet, primarily driven by increased deactivations from a growing customer base, partially offset by a lower churn rate; partially offset by\n•\nLower prepaid net customer additions, primarily driven by continued moderation of prepaid industry growth and lower net additions from High Speed Internet, partially offset by higher net additions following the Ka’ena Acquisition.\n•\nHigh Speed Internet net customer additions included in postpaid other net customer additions were 1,454,000 and 1,878,000 for the years ended December 31, 2024 and 2023, respectively. High Speed Internet net customer additions included in prepaid net customer additions were 200,000 and 252,000 for the years ended December 31, 2024 and 2023, respectively.\nChurn\nChurn represents the number of customers whose service was deactivated as a percentage of the average number of customers during the specified period further divided by the number of months in the period. The number of customers whose service was deactivated is presented net of customers that subsequently had their service restored within a certain period of time and excludes customers who received service for less than a certain minimum period of time. We believe that churn provides management, investors and analysts with useful information to evaluate customer retention and loyalty.\nThe following table sets forth the churn:\nYear Ended December 31,\nBps Change 2024 Versus 2023\nBps Change 2023 Versus 2022\n2024\n2023\n2022\nPostpaid phone churn\n0.86 \n%\n0.87 \n%\n0.88 \n%\n-1 bps\n-1 bps\nPrepaid churn\n2.73 \n%\n2.76 \n%\n2.77 \n%\n-3 bps\n-1 bps\nPostpaid phone churn decreased 1 basis point, primarily from improved customer retention, including the benefits of a differentiated value proposition and network experience.\n39\nTable of Contents\nPrepaid churn decreased 3 basis points, primarily from improved customer retention.\nPostpaid Average Revenue Per Account\nPostpaid Average Revenue per Account (“ARPA”) represents the average monthly postpaid service revenue earned per account. Postpaid ARPA is calculated as Postpaid revenues for the specified period divided by the average number of postpaid accounts during the period, further divided by the number of months in the period. We believe postpaid ARPA provides management, investors and analysts with useful information to assess and evaluate our postpaid service revenue realization and assists in forecasting our future postpaid service revenues on a per account basis. We consider postpaid ARPA to be indicative of our revenue growth potential given the increase in the average number of postpaid phone customers per account and increases in postpaid other customers, including High Speed Internet, mobile internet devices (including tablets and hotspots), wearables, DIGITS and other connected devices (including SyncUP and IoT).\nThe following table sets forth our operating measure ARPA:\n(in dollars)\nYear Ended December 31,\n2024 Versus 2023\n2023 Versus 2022\n2024\n2023\n2022\n $ Change\n% Change\n $ Change\n% Change\nPostpaid ARPA\n$\n143.85 \n$\n139.27 \n$\n137.43 \n$\n4.58 \n3 \n%\n$\n1.84 \n1 \n%\nPostpaid ARPA increased $4.58, or 3%, primarily from:\n•\nHigher premium services, primarily high-end rate plans, net of contra-revenues for content included in such plans, and discounts for specific affinity groups, such as 55+, military and first responders;\n•\nAn increase in customers per account, including continued adoption of High Speed Internet; and\n•\nThe impact from rate plan optimizations; partially offset by\n•\nIncreased promotional activity; and\n•\nAn increase in total High Speed Internet only accounts.\nAverage Revenue Per User\nAverage Revenue per User (“ARPU”) represents the average monthly service revenue earned per customer. ARPU is calculated as service revenues for the specified period divided by the average number of customers during the period, further divided by the number of months in the period. We believe ARPU provides management, investors and analysts with useful information to assess and evaluate our service revenue per customer and assist in forecasting our future service revenues generated from our customer base. Postpaid phone ARPU excludes postpaid other customers and related revenues, which include High Speed Internet, mobile internet devices (including tablets and hotspots), wearables, DIGITS and other connected devices (including SyncUP and IoT).\nThe following table sets forth our operating measure ARPU:\n(in dollars)\nYear Ended December 31,\n2024 Versus 2023\n2023 Versus 2022\n2024\n2023\n2022\n$ Change\n% Change\n$ Change\n% Change\nPostpaid phone ARPU\n$\n49.35 \n$\n48.83 \n$\n48.78 \n$\n0.52 \n1 \n%\n$\n0.05 \n— \n%\nPrepaid ARPU\n36.06 \n37.92 \n38.76 \n(1.86)\n(5)\n%\n(0.84)\n(2)\n%\nPostpaid Phone ARPU\nPostpaid phone ARPU increased slightly, primarily from:\n•\nHigher premium services, primarily high-end rate plans, net of contra-revenues for content included in such plans, and discounts for specific affinity groups, such as 55+, military and first responders; and\n•\nThe impact from rate plan optimizations; mostly offset by\n•\nIncreased promotional activity.\nPrepaid ARPU\nPrepaid ARPU decreased $1.86, or 5%, primarily from the inclusion of lower ARPU prepaid customers associated with the Ka’ena Acquisition.\n40\nTable of Contents\nAdjusted EBITDA and Core Adjusted EBITDA\nAdjusted EBITDA represents earnings before Interest expense, net of Interest income, Income tax expense, Depreciation and amortization, stock-based compensation and certain expenses, gains and losses, which are not reflective of our ongoing operating performance (“Special Items”). Special Items include Merger-related costs, (gain) loss on disposal groups held for sale, certain legal-related recoveries and expenses, restructuring costs not directly attributable to the Merger (including severance), and other non-core gains and losses. Core Adjusted EBITDA represents Adjusted EBITDA less device lease revenues. Adjusted EBITDA margin represents Adjusted EBITDA divided by Service revenues. Core Adjusted EBITDA margin represents Core Adjusted EBITDA divided by Service revenues.\nAdjusted EBITDA, Adjusted EBITDA margin, Core Adjusted EBITDA and Core Adjusted EBITDA margin are non-GAAP financial measures utilized by our management, including our chief operating decision maker, to monitor the financial performance of our operations and allocate resources of the Company as a whole. We historically used Adjusted EBITDA, and we currently use Core Adjusted EBITDA internally as a measure to evaluate and compensate our personnel and management for their performance. We use Adjusted EBITDA and Core Adjusted EBITDA as benchmarks to evaluate our operating performance in comparison to our competitors. Management believes analysts and investors use Adjusted EBITDA and Core Adjusted EBITDA as supplemental measures to evaluate overall operating performance and to facilitate comparisons with other wireless communications services companies because they are indicative of our ongoing operating performance and trends by excluding the impact of interest expense from financing, non-cash depreciation and amortization from capital investments, non-cash stock-based compensation, and Special Items. Management believes analysts and investors use Core Adjusted EBITDA because it normalizes for the transition in the Company’s device financing strategy, by excluding the impact of device lease revenues from Adjusted EBITDA, to align with the exclusion of the related depreciation expense on leased devices from Adjusted EBITDA. Adjusted EBITDA, Adjusted EBITDA margin, Core Adjusted EBITDA and Core Adjusted EBITDA margin have limitations as analytical tools and should not be considered in isolation or as substitutes for income from operations, net income or any other measure of financial performance reported in accordance with GAAP.\n41\nTable of Contents\nThe following table illustrates the calculation of Adjusted EBITDA and Core Adjusted EBITDA and reconciles Adjusted EBITDA and Core Adjusted EBITDA to Net income, which we consider to be the most directly comparable GAAP financial measure:\nYear Ended December 31,\n2024 Versus 2023\n2023 Versus 2022\n(in millions, except percentages)\n2024\n2023\n2022\n$ Change\n% Change\n$ Change\n% Change\nNet income\n$\n11,339 \n$\n8,317 \n$\n2,590 \n$\n3,022 \n36 \n%\n$\n5,727 \n221 \n%\nAdjustments:\nInterest expense, net\n3,411 \n3,335 \n3,364 \n76 \n2 \n%\n(29)\n(1)\n%\nOther (income) expense, net\n(113)\n(68)\n33 \n(45)\n66 \n%\n(101)\n(306)\n%\nIncome tax expense\n3,373 \n2,682 \n556 \n691 \n26 \n%\n2,126 \n382 \n%\nOperating income\n18,010 \n14,266 \n6,543 \n3,744 \n26 \n%\n7,723 \n118 \n%\nDepreciation and amortization\n12,919 \n12,818 \n13,651 \n101 \n1 \n%\n(833)\n(6)\n%\nStock-based compensation \n(1)\n586 \n644 \n576 \n(58)\n(9)\n%\n68 \n12 \n%\nMerger-related costs \n(2)\n121 \n1,034 \n4,969 \n(913)\n(88)\n%\n(3,935)\n(79)\n%\nImpairment expense\n— \n— \n477 \n— \nNM\n(477)\n(100)\n%\nLegal-related (recoveries) expenses, net\n (3)\n(89)\n(42)\n391 \n(47)\n112 \n%\n(433)\n(111)\n%\n(Gain) loss on disposal group held for sale\n— \n(25)\n1,087 \n25 \n(100)\n%\n(1,112)\n(102)\n%\nOther, net \n(4)\n317 \n733 \n127 \n(416)\n(57)\n%\n606 \n477 \n%\nAdjusted EBITDA\n31,864 \n29,428 \n27,821 \n2,436 \n8 \n%\n1,607 \n6 \n%\nLease revenues\n(93)\n(312)\n(1,430)\n219 \n(70)\n%\n1,118 \n(78)\n%\nCore Adjusted EBITDA\n$\n31,771 \n$\n29,116 \n$\n26,391 \n$\n2,655 \n9 \n%\n$\n2,725 \n10 \n%\nNet income margin (Net income divided by Service revenues)\n17 \n%\n13 \n%\n4 \n%\n400 bps\n900 bps\nAdjusted EBITDA margin (Adjusted EBITDA divided by Service revenues)\n48 \n%\n47 \n%\n45 \n%\n100 bps\n200 bps\nCore Adjusted EBITDA margin (Core Adjusted EBITDA divided by Service revenues)\n48 \n%\n46 \n%\n43 \n%\n200 bps\n300 bps\n(1)\nStock-based compensation includes payroll tax impacts and may not agree with stock-based compensation expense on the consolidated financial statements. Additionally, certain stock-based compensation expenses associated with the Transactions have been included in Merger-related costs.\n(2)\nMerger-related costs, for the year ended December 31, 2024, includes the $100 million gain recognized for the extension fee previously paid by DISH associated with the DISH License Purchase Agreement.\n(3)\nLegal-related (recoveries) expenses, net, consists of the settlement of certain litigation associated with the August 2021 cyberattack and is presented net of insurance recoveries.\n(4)\nOther, net, primarily consists of certain severance, restructuring and other expenses, gains and losses, not directly attributable to the Merger, which are not reflective of T-Mobile’s core business activities and are, therefore, excluded from Adjusted EBITDA and Core Adjusted EBITDA. Other, net, for the year ended December 31, 2023, includes $462 million of severance and related costs associated with the August 2023 workforce reduction.\nNM - Not meaningful\nCore Adjusted EBITDA increased $2.7 billion, or 9%, for the year ended December 31, 2024. The components comprising Core Adjusted EBITDA are discussed further above.\nThe increase was primarily from:\n•\nHigher Total service revenues;\n•\nHigher Equipment revenues, excluding lease revenues; and\n•\nLower Cost of services, excluding Special Items; partially offset by\n•\nHigher Selling, general and administrative expenses, excluding Special Items; and\n•\nHigher Cost of equipment sales, excluding Special Items.\nAdjusted EBITDA increased $2.4 billion, or 8%, for the year ended December 31, 2024, primarily due to the fluctuations in Core Adjusted EBITDA, discussed above, partially offset by lower lease revenues, which decreased $219 million for the year ended December 31, 2024. \n42\nTable of Contents\nLiquidity and Capital Resources\nOur principal sources of liquidity are our cash and cash equivalents and cash generated from operations, proceeds from issuance of debt, financing leases, the sale of certain receivables, the Revolving Credit Facility and an unsecured short-term commercial paper program. Further, the incurrence of additional indebtedness may inhibit our ability to incur new debt in the future to finance our business strategy under the terms governing our existing and future indebtedness.\nCash Flows\nThe following is a condensed schedule of our cash flows:\nYear Ended December 31,\n2024 Versus 2023\n2023 Versus 2022\n(in millions)\n2024\n2023\n2022\n$ Change\n% Change\n$ Change\n% Change\nNet cash provided by operating activities\n$\n22,293 \n$\n18,559 \n$\n16,781 \n$\n3,734 \n20 \n%\n$\n1,778 \n11 \n%\nNet cash used in investing activities\n(9,072)\n(5,829)\n(12,359)\n(3,243)\n56 \n%\n6,530 \n(53)\n%\nNet cash used in financing activities\n(12,815)\n(12,097)\n(6,451)\n(718)\n6 \n%\n(5,646)\n88 \n%\nOperating Activities\nNet cash provided by operating activities increased $3.7 billion, or 20%, primarily from:\n•\nA $3.7 billion increase in Net income, adjusted for non-cash income and expenses; and\n•\nA $49 million decrease in net cash outflows from changes in working capital, primarily due to lower use of cash from Accounts receivable and Other current and long-term liabilities, partially offset by higher use of cash from Accounts payable and accrued liabilities, Equipment installment plan receivables and Operating lease right-of-use assets.\n•\nNet cash provided by operating activities includes the impact of $767 million and $2.0 billion in net payments for Merger-related costs for the years ended December 31, 2024 and 2023, respectively.\nInvesting Activities\nNet cash used in investing activities increased $3.2 billion, or 56%. The use of cash was primarily from: \n•\n$8.8 billion\n in Purchases of property and equipment, including capitalized interest, from the continued build-out of our nationwide 5G network;\n•\n$3.5 billion in Purchases of spectrum licenses and other intangible assets, including deposits, primarily for the 600 MHz licenses purchased from Channel 51 License Co LLC and LB License Co, LLC (see \nNote \n7\n – Goodwill, Spectrum License Transactions and Other Intangible Assets\n of the Notes to the Consolidated Financial Statements); and\n•\n$373 million of cash consideration, net of cash acquired, related to the Ka’ena Acquisition; \npartially offset by\n•\n$3.6 billion\n in \nProceeds related to beneficial interests in securitization transactions.\nFinancing Activities\nNet cash used in financing activities increased $718 million, or 6%. The use of cash was primarily from: \n•\n$11.2 billion in Repurchases of common stock;\n•\n$5.1 billion in Repayments of long-term debt;\n•\n$3.3 billion in Dividends on common stock;\n•\n$1.4 billion in Repayments of financing lease obligations; and\n•\n$269 million in Tax withholdings on share-based awards; partially offset by\n•\n$8.6 billion in Proceeds from issuance of long-term debt.\nCash and Cash Equivalents\nAs of December 31, 2024, our Cash and cash equivalents were $5.4 billion compared to $5.1 billion at December 31, 2023.\n43\nTable of Contents\nAdjusted Free Cash Flow\nAdjusted Free Cash Flow represents Net cash provided by operating activities less cash payments for Purchases of property and equipment, plus Proceeds from sales of tower sites and Proceeds related to beneficial interests in securitization transactions. Adjusted Free Cash Flow is a non-GAAP financial measure utilized by management, investors and analysts of our financial information to evaluate cash available to pay debt, repurchase shares, pay dividends and provide further investment in the business. Adjusted Free Cash Flow margin is calculated as Adjusted Free Cash Flow divided by Service revenues. Adjusted Free Cash Flow margin is utilized by management, investors, and analysts to evaluate the Company’s ability to convert service revenue efficiently into cash available to pay debt, repurchase shares, pay dividends and provide further investment in the business.\nThe table below provides a reconciliation of Adjusted Free Cash Flow to Net cash provided by operating activities, which we consider to be the most directly comparable GAAP financial measure:\nYear Ended December 31,\n2024 Versus 2023\n2023 Versus 2022\n(in millions, except percentages)\n2024\n2023\n2022\n$ Change\n% Change\n$ Change\n% Change\nNet cash provided by operating activities\n$\n22,293 \n$\n18,559 \n$\n16,781 \n$\n3,734 \n20 \n%\n$\n1,778 \n11 \n%\nCash purchases of property and equipment, including capitalized interest\n(8,840)\n(9,801)\n(13,970)\n961 \n(10)\n%\n4,169 \n(30)\n%\nProceeds from sales of tower sites\n— \n12 \n9 \n(12)\n(100)\n%\n3 \n33 \n%\nProceeds related to beneficial interests in securitization transactions\n3,579 \n4,816 \n4,836 \n(1,237)\n(26)\n%\n(20)\n— \n%\nAdjusted Free Cash Flow\n$\n17,032 \n$\n13,586 \n$\n7,656 \n$\n3,446 \n25 \n%\n$\n5,930 \n77 \n%\nNet cash provided by operating activities margin (Net cash provided by operating activities divided by Service revenues)\n34 \n%\n29 \n%\n27 \n%\n500 bps\n200 bps\nAdjusted Free Cash Flow margin (Adjusted Free Cash Flow divided by Service revenues)\n26 \n%\n21 \n%\n12 \n%\n500 bps\n900 bps\nAdjusted Free Cash Flow increased $3.4 billion, or 25%, for the year ended December 31, 2024, primarily from:\n•\nHigher Net cash provided by operating activities, as described above; and\n•\nLower Cash purchases of property and equipment, including capitalized interest, driven by increased capital efficiencies from accelerated investments in our nationwide 5G network in previous years; partially offset by\n•\nLower Proceeds related to beneficial interests in securitization transactions, which were offset in Net cash provided by operating activities.\n•\nAdjusted Free Cash Flow includes the impact of $767 million and $2.0 billion for the years ended December 31, 2024 and 2023, respectively, in net payments for Merger-related costs.\nDuring the years ended December 31, 2024 and 2023, there were no significant net cash proceeds from securitization.\nOn October 22, 2024, we executed amendments (the “Pledge Amendments”) to the EIP Sale Arrangement and the Service Receivable Sale Arrangement (as discussed in \nNote 5 – Sales of Certain Receivables\n of the Notes to the Consolidated Financial Statements). Following the effective date of the Pledge Amendments of November 1, 2024, all cash proceeds associated with the sale of such receivables, a portion of which, prior to November 1, 2024, were recognized as Proceeds related to beneficial interests in securitization transactions within Net cash used in investing activities on our Consolidated Statements of Cash Flows, were recognized as operating cash flows. The Pledge Amendments did not have a net impact on Adjusted Free Cash Flow. \nBorrowing Capacity\nWe maintain a revolving credit facility (the “Revolving Credit Facility”) with an aggregate commitment amount of $7.5 billion. As of December 31, 2024, there was no outstanding balance under the Revolving Credit Facility.\nWe maintain an unsecured short-term commercial paper program with the ability to borrow up to $2.0 billion from time to time. This program supplements our other available external financing arrangements and proceeds are expected to be used for general corporate purposes. As of December 31, 2024, there was no outstanding balance under this program.\n44\nTable of Contents\nDebt Financing\nAs of December 31, 2024, our total debt and financing lease liabilities were $80.6 billion, excluding our tower obligations, of which $74.2 billion was classified as long-term debt and $1.2 billion was classified as long-term financing lease liabilities.\nDuring the year ended December 31, 2024, we issued long-term debt for net proceeds of $8.6 billion and repaid short-term debt with an aggregate principal amount of $5.1 billion.\nFor more information regarding our debt financing transactions, see \nNote 9 – Debt\n of the Notes to the Consolidated Financial Statements.\nSpectrum Auctions\nIn September 2022, the FCC announced that we were the winning bidder of 7,156 licenses in Auction 108 (2.5 GHz spectrum) for an aggregate price of $304 million. At inception of Auction 108 in June 2022, we deposited $65 million. We paid the FCC the remaining $239 million for the licenses won in the auction in September 2022. On February 29, 2024, the FCC issued to us the licenses won in Auction 108, and substantially all of these licenses were deployed in March 2024.\nFor more information regarding our spectrum licenses, see \nNote 7 – Goodwill, Spectrum License Transactions and Other Intangible Assets\n of the Notes to the Consolidated Financial Statements.\nLicense Purchase Agreements\nOn August 8, 2022, we entered into License Purchase Agreements to acquire spectrum in the 600 MHz band from Channel 51 License Co LLC and LB License Co, LLC (together with Channel 51 License Co LLC, the “Sellers”) in exchange for total cash consideration of $3.5 billion. On March 30, 2023, we and the Sellers entered into Amended and Restated License Purchase Agreements, pursuant to which we and the Sellers agreed to bifurcate the transaction into two tranches of licenses, with the closings on the acquisitions of certain licenses in Chicago, Dallas and New Orleans being deferred in order to potentially expedite the regulatory approval process for the remainder of the licenses. Subsequently, on August 25, 2023, we and the Sellers entered into Amendments No. 1 to the Amended and Restated License Purchase Agreements, whereby we deferred the closings of certain additional licenses in Chicago and Dallas into the second closing tranche. Together, the licenses with closings deferred into the second closing tranche represent approximately $1.1 billion of the aggregate $3.5 billion cash consideration.\nThe FCC approved the purchase of the first tranche on December 29, 2023. The first tranche closed on June 24, 2024, and the associated payment of $2.4 billion was made on August 5, 2024.\nThe FCC approved the purchase of the Dallas licenses included in the second tranche on October 22, 2024. The purchase of the Dallas licenses closed on December 6, 2024, and the associated payment of $541 million was made on the same day.\nWe anticipate that the remaining deferred licenses from the second tranche of $604 million will close in 2025.\nThe parties have agreed that each of the closings will occur within 180 days after the receipt of the applicable required regulatory approvals, and payment of each portion of the aggregate $3.5 billion purchase price will occur no later than 40 days after the date of each respective closing.\nOn September 12, 2023, we entered into a License Purchase Agreement with Comcast pursuant to which we will acquire spectrum in the 600 MHz band from Comcast in exchange for total cash consideration of between $1.2 billion and $3.3 billion, subject to an application for FCC approval. The licenses are subject to an exclusive leasing arrangement between us and Comcast entered into contemporaneously with the License Purchase Agreement. On January 13, 2025, we and Comcast entered into an amendment to the License Purchase Agreement pursuant to which we will acquire additional spectrum. Subsequent to the amendment, the total cash consideration for the transaction is between $1.2 billion and $3.4 billion. We anticipate the closing will occur in the first half of 2028.\nOn September 10, 2024, we entered into a License Purchase Agreement with N77 License Co LLC (“Buyer”), pursuant to which Buyer has the option to purchase all or a portion of our remaining 3.45 GHz spectrum licenses in exchange for a range of cash consideration, with the specific licenses sold to be determined based upon the amount of committed financing raised by Buyer. As of December 31, 2024 and 2023, the licenses subject to the License Purchase Agreement were held at cost of $2.7 billion in Spectrum licenses on our Consolidated Balance Sheets. We maintain the right to terminate the License Purchase \n45\nTable of Contents\nAgreement no later than February 7, 2025, as we did not receive written notice of committed financing as of December 9, 2024, from the Buyer at or above a certain target level of cash consideration. If we do not terminate the License Purchase Agreement, the transaction is subject to FCC approval.\nAcquisition of Ka’ena Corporation\nOn the Acquisition Date, we completed the Ka’ena Acquisition. The total purchase price is variable, dependent upon specified performance indicators of Ka’ena, and consists of an upfront payment on the Acquisition Date and an earnout payable on August 1, 2026. On the Acquisition Date and in satisfaction of the upfront payment, we transferred $420 million in cash and 3,264,952 shares of T-Mobile common stock valued at $536 million as determined based on its closing market price on April 30, 2024, for a total payment fair value of $956 million. The amount of the upfront payment was subject to customary adjustments and as a result of such adjustments, $17 million of the upfront payment was returned to T-Mobile during the fourth quarter of 2024, which resulted in a commensurate increase in the maximum payable in satisfaction of the earnout.\nBased on the adjusted amount paid upfront, up to an additional $420 million in future cash and T-Mobile common stock is payable in satisfaction of the earnout, dependent upon Ka’ena’s achievement of specified performance indicators.\nFor more information regarding the Ka’ena Acquisition, see \nNote 2 – Business Combinations\n of the Notes to the Consolidated Financial Statements.\nLumos Joint Venture\nOn April 24, 2024, we entered into a definitive agreement with Fund VI to establish a joint venture between us and Fund VI to acquire Lumos from EQT’s predecessor fund, EQT Infrastructure III. The arrangement is expected to close in the first half of 2025, subject to customary closing conditions and regulatory approvals. At closing, we expect to invest approximately $950 million in the joint venture to acquire a 50% equity interest and all existing Lumos fiber customers. The funds invested by us will be used to fund future fiber builds. In addition, pursuant to the definitive agreement, we expect to make an additional capital contribution of approximately $500 million in 2027 or 2028 under the existing business plan.\nFor more information regarding the Lumos joint venture, see\n \nNote 3 – Joint Ventures\n of the Notes to the Consolidated Financial Statements.\nAcquisition of UScellular Wireless Operations\nOn May 24, 2024, we entered into a securities purchase agreement with UScellular pursuant to which, among other things, we will acquire substantially all of UScellular’s wireless operations and select spectrum assets for an aggregate purchase price of approximately $4.4 billion, payable in cash and the assumption of up to $2.0 billion of debt through an exchange offer to be made to certain UScellular debtholders prior to closing. To the extent any debtholders do not participate in the exchange, their bonds will continue as obligations of UScellular, and the cash portion of the purchase price will be correspondingly increased. The transaction is expected to close in mid-2025, subject to customary closing conditions and receipt of certain regulatory approvals.\nFollowing the closing of the transaction, UScellular will retain ownership of its other spectrum, as well as its towers. Subject to the closing of the transaction, we will enter into a 15-year master license agreement to lease space on at least 2,100 towers being retained and to extend our tenancy term on approximately 600 towers where we are already leasing space from UScellular for 15 years post-closing. We estimate the incremental future minimum lease payments associated with the master license agreement will be $1.4 billion over 15 years post-closing. \nMetronet Joint Venture \nOn July 18, 2024, we entered into a definitive agreement with KKR to establish a joint venture to acquire Metronet. This arrangement is expected to close in 2025, subject to customary closing conditions and regulatory approvals. At closing, we expect to invest approximately $4.9 billion in the joint venture to acquire a 50% equity interest and all existing residential fiber customers, as well as funding the joint venture. We do not anticipate making further capital contributions following the closing under the existing business plan. \nFor more information regarding the Metronet joint venture, see\n \nNote 3 – Joint Ventures\n of the Notes to the Consolidated Financial Statements.\n46\nTable of Contents\nAcquisition of Vistar Media Inc.\nOn December 20, 2024, we entered into an agreement and plan of merger for the acquisition of 100% of the outstanding capital stock of Vistar Media Inc., for a purchase price of approximately $625 million. The purchase price is subject to certain agreed-upon working capital and other adjustments. The acquisition is subject to certain customary closing conditions, including certain regulatory approvals, and is expected to close in the first quarter of 2025. \nFor more information regarding the acquisition of Vistar Media Inc., see \nNote 2 – Business Combinations\n of the Notes to the Consolidated Financial Statements.\nOff-Balance Sheet Arrangements\nWe have arrangements, as amended from time to time, to sell certain EIP accounts receivable and service accounts receivable on a revolving basis as a source of liquidity. As of December 31, 2024, we derecognized net receivables of $1.6 billion upon sale through these arrangements.\nFor more information regarding these off-balance sheet arrangements, see \nNote 5 – Sales of Certain Receivables\n of the Notes to the Consolidated Financial Statements.\nFuture Sources and Uses of Liquidity\nWe may seek additional sources of liquidity, including through the issuance of additional debt, to continue to opportunistically acquire spectrum licenses or other long-lived assets in private party transactions, repurchase shares, pay dividends or for the refinancing of existing long-term debt on an opportunistic basis. Excluding liquidity that could be needed for acquisitions of businesses, spectrum and other long-lived assets, or for any potential stockholder returns, we expect our principal sources of funding to be sufficient to meet our anticipated liquidity needs for business operations for the next 12 months, as well as our longer-term liquidity needs. Our intended use of any such funds is for general corporate purposes, including for capital expenditures, spectrum purchases, opportunistic investments and acquisitions, redemption of debt, tower obligations, share repurchases, and dividend payments.\nWe determine future liquidity requirements for operations, capital expenditures, share repurchases and dividend payments based in large part upon projected financial and operating performance, and opportunities to acquire additional spectrum or repurchase shares. We regularly review and update these projections for changes in current and projected financial and operating results, general economic conditions, the competitive landscape and other factors. We have incurred, and will incur, substantial expenses to comply with the Government Commitments, and we have incurred all of the remaining restructuring and integration costs associated with the Merger, with the cash expenditures for the Merger-related costs extending beyond 2024. There are a number of additional risks and uncertainties that could cause our financial and operating results and capital requirements to differ materially from our projections, which could cause future liquidity to differ materially from our assessment.\nThe indentures, supplemental indentures and credit agreements governing our long-term debt to affiliates and third parties, excluding financing leases, contain covenants that, among other things, limit the ability of the Issuers or borrowers and the Guarantor Subsidiaries to incur more debt, create liens or other encumbrances, and merge, consolidate or sell, or otherwise dispose of, substantially all of their assets. We were in compliance with all restrictive debt covenants as of December 31, 2024.\nFinancing Lease Facilities\nWe have uncommitted financing lease facilities with certain third parties that provide us with the ability to enter into financing leases for network equipment and services. As of December 31, 2024, we have entered into $9.9 billion of financing leases under these financing lease facilities, of which $1.2 billion was executed during the year ended December 31, 2024. We expect to enter into up to a total of $1.2 billion in financing lease commitments during the year ending December 31, 2025.\nCapital Expenditures\nOur liquidity requirements for capital expenditures have been driven primarily by capital expenditures for spectrum licenses, the construction, expansion and upgrading of our network infrastructure, the integration of the networks, spectrum, technology, personnel and customer base of T-Mobile and Sprint, which is substantially complete, and investments in information technology platforms. We expect to maintain our investment in capital expenditures related to these efforts in 2025 compared to \n47\nTable of Contents\n2024, as we continue to build out our nationwide 5G network and our digital transformation. Future capital expenditure requirements will be primarily driven by the deployment of acquired spectrum licenses.\nFor more information regarding our spectrum licenses, see \nNote \n7\n – Goodwill, Spectrum License Transactions and Other Intangible Assets\n \nof the Notes to the Consolidated Financial Statements.\nStockholder Returns\nOn September 6, 2023, our Board of Directors authorized our 2023-2024 Stockholder Return Program of up to $19.0 billion that ran from October 1, 2023, through December 31, 2024. The 2023-2024 Stockholder Return Program consisted of repurchases of shares of our common stock and the payment of cash dividends.\nDuring the year ended December 31, 2024, we repurchased 59,376,922 shares of our common stock at an average price per share of $187.07 for a total purchase price of $11.1 billion, all of which were purchased under the 2023-2024 Stockholder Return Program.\nDuring the year ended December 31, 2024, we paid an aggregate of $3.3 billion, in cash dividends to our stockholders, which was presented within Net cash used in financing activities on our Consolidated Statements of Cash Flows.\nOn December 13, 2024, we announced that our Board of Directors authorized our 2025 Stockholder Return Program of up to $14.0 billion that will run through December 31, 2025. The 2025 Stockholder Return Program is expected to consist of additional repurchases of shares of our common stock and the payment of cash dividends. The declaration and payment of all dividends is subject to the discretion of our Board of Directors and will depend on financial and legal requirements and other considerations. The amount available under the 2025 Stockholder Return Program for share repurchases will be reduced by the amount of any cash dividends declared and paid by us.\nThe 2025 Stockholder Return Program is the next step consistent with the Company’s capital allocation framework outlined at its recent Capital Markets Day. As discussed at Capital Markets Day, the Company expects its business plan to support approximately $80.0 billion in investments and capital returns between September 18, 2024, and the end of 2027. The Company currently plans to allocate such funds as follows: \n•\nUp to $50.0 billion for share repurchases and cash dividends, which includes the 2025 Stockholder Return Program; \n•\nApproximately $19.5 billion in a discretionary and flexible envelope for potential activities, which may include de-levering, investments in our core business, strategic investments, and/or additional capital returns to stockholders beyond the $50.0 billion initial allocation; and \n•\nApproximately $10.5 billion to complete pending transactions. See \nNote 2 - \nBusiness Combinations\n, \nNote 3 - Joint Ventures\n and \nNote 7 – Goodwill, Spectrum License Transactions and Other Intangible Assets\n for additional information.\nOn November 21, 2024, our Board of Directors declared a cash dividend of $0.88 per share on our issued and outstanding common stock, which will be paid on March 13, 2025, to stockholders of record as of the close of business on February 28, 2025.\nAs of December 31, 2024, $1.0 billion for dividends payable is presented within Other current liabilities on our Consolidated Balance Sheets.\nSubsequent to December 31, 2024, from January 1, 2025, through January 24, 2025, we repurchased 2,855,113 shares of our common stock at an average price per share of $216.03 for a total purchase price of $617 million under the 2025 Stockholder Return Program. As of January 24, 2025, we had up to $13.4 billion remaining under the 2025 Stockholder Return Program for repurchases of shares and quarterly dividends through December 31, 2025.\nFor additional information regarding the 2023-2024 Stockholder Return Program and the 2025 Stockholder Return Program, see \nNote 1\n5\n – Stockholder Return Progra\nms\n of the Notes to the Consolidated Financial Statements.\n48\nTable of Contents\nContractual Obligations\nIn connection with the regulatory approvals of the Transactions, we made commitments to various state and federal agencies, including the U.S. Department of Justice and FCC. \nFor more information regarding these commitments, see \nNote 1\n8\n – Commitments and Contingencies\n \nof the Notes to the Consolidated Financial Statements.\nThe following table summarizes our material contractual obligations and borrowings as of December 31, 2024, and the timing and effect that such commitments are expected to have on our liquidity and capital requirements in future periods:\n(in millions)\nLess Than 1 Year\n1 - 3 Years\n3 - 5 Years\nMore Than 5 Years\nTotal\nLong-term debt \n(1)\n$\n4,069 \n$\n11,735 \n$\n15,388 \n$\n46,799 \n$\n77,991 \nInterest on long-term debt\n3,203 \n5,792 \n4,695 \n22,773 \n36,463 \nFinancing lease liabilities, including imputed interest\n1,242 \n1,166 \n29 \n— \n2,437 \nTower obligations \n(2)\n380 \n788 \n835 \n3,677 \n5,680 \nOperating lease liabilities, including imputed interest\n4,491 \n8,493 \n7,241 \n15,664 \n35,889 \nPurchase obligations\n (3) (4) (5) (6)\n4,589 \n5,050 \n2,240 \n2,338 \n14,217 \nSpectrum leases and service credits \n(7)\n289 \n613 \n641 \n3,807 \n5,350 \nIP transit services liability \n(8)\n100 \n183 \n— \n— \n283 \nTotal contractual obligations\n$\n18,363 \n$\n33,820 \n$\n31,069 \n$\n95,058 \n$\n178,310 \n(1)\nRepresents principal amounts of long-term debt to affiliates and third parties at maturity, excluding unamortized premiums, discounts, debt issuance costs, consent fees, and financing lease obligations. See \nNote \n9\n – Debt\n of the Notes to the Consolidated Financial Statements for further information.\n(2)\nFuture minimum payments, including principal and interest payments, related to the tower obligations. See \nNote \n10\n – Tower Obligations\n of the Notes to the Consolidated Financial Statements for further information.\n(3)\nThe minimum commitment for certain obligations is based on termination penalties that could be paid to exit the contracts. Termination penalties are included in the above table as payments due as of the earliest we could exit the contract, typically in less than one year. For certain contracts that include fixed volume purchase commitments and fixed prices for various products, the purchase obligations are calculated using fixed volumes and contractually fixed prices for the products that are expected to be purchased. This table does not include open purchase orders as of December 31, 2024 under normal business purposes. See \nNote 1\n8\n – Commitments and Contingencies\n of the Notes to the Consolidated Financial Statements for further information. \n(4)\nOn August 8, 2022, we entered into License Purchase Agreements to acquire spectrum in the 600 MHz band from Channel 51 License Co LLC and LB License Co, LLC in exchange for total cash consideration of $3.5 billion. As of December 31, 2024, the remaining deferred licenses from the second tranche of $604 million are subject to regulatory approval and are excluded from our reported purchase commitments above. On September 12, 2023, we entered into a License Purchase Agreement to acquire spectrum in the 600 MHz band from Comcast in exchange for total cash consideration of between $1.2 billion and $3.3 billion. On January 13, 2025, we and Comcast entered into an amendment to the License Purchase Agreement pursuant to which we will acquire additional spectrum. Subsequent to the amendment, the total cash consideration for the transaction is between $1.2 billion and $3.4 billion. The agreement, as amended, remains subject to an application for FCC approval. Total consideration for this License Purchase Agreement is excluded from our reported purchase obligations above. See \nNote 7 – Goodwill, Spectrum License Transactions and Other Intangible Assets\n of the Notes to the Consolidated Financial Statements for further information.\n(5)\nOn May 1, 2024, we completed the Ka’ena Acquisition and based on the amount of the adjusted upfront payment, up to an additional $420 million in future cash and T-Mobile common stock is payable in satisfaction of the earnout and is excluded from our reported purchase commitments above. Additionally, on May 24, 2024, we entered into a securities purchase agreement with UScellular for an aggregate purchase price of approximately $4.4 billion, payable in cash and the assumption of up to $2.0 billion of debt, as well as entered into a master license agreement with estimated minimum lease payments of $1.4 billion over 15 years post-closing. On December 20, 2024, we entered into an agreement and plan of merger for the acquisition of 100% of the outstanding capital stock of Vistar Media Inc. for a purchase price of approximately $625 million. These transactions are subject to customary closing conditions and receipt of certain regulatory approvals and are excluded from our reported purchase obligations above. See \nNote 2 – Business Combinations\n of the Notes to the Consolidated Financial Statements for further information.\n(6)\nOn April 24, 2024, we entered into a definitive agreement with Fund VI to establish a joint venture between us and Fund VI to acquire Lumos. We expect to invest approximately $950 million in the joint venture. In addition, pursuant to the definitive agreement, we expect to make an additional capital contribution of approximately $500 million in 2027 or 2028 under the existing business plan. Additionally, on July 18, 2024, we entered into a definitive agreement with KKR to establish a joint venture to acquire Metronet. At closing, we expect to invest approximately $4.9 billion in the joint venture. These transactions are subject to customary closing conditions and regulatory approvals and are excluded from our reported purchase obligations above. See \nNote 3 – Joint Ventures\n of the Notes to the Consolidated Financial Statements for further information.\n(7)\nSpectrum lease agreements are typically for terms of five to 10 years with automatic renewal provisions, bringing the total term of the agreements up to 30 years.\n(8)\nOn May 1, 2023, Cogent Infrastructure, Inc. and the Company completed the Wireline Transaction. Under the terms of the Wireline Sale Agreement, the Company agreed to make payments pursuant to an IP transit services agreement totaling $700 million, consisting of (i) $350 million in equal monthly installments during the first year after the closing and (ii) $350 million in equal monthly installments over the subsequent 42 months. For more information regarding the Wireline Transaction, see \nNote 1 – Summary of Significant Accounting Policies\n of the Notes to the Consolidated Financial Statements.\n49\nTable of Contents\nCertain commitments and obligations are included in the table based on the year of required payment or an estimate of the year of payment. Other long-term liabilities have been omitted from the table above due to the uncertainty of the timing of payments, combined with the lack of historical trends to predict future payments.\nThe purchase obligations reflected in the table above are primarily commitments to purchase spectrum licenses, wireless devices, network services, equipment, software, marketing sponsorship agreements and other items in the ordinary course of business. These amounts do not represent our entire anticipated purchases in the future but represent only those items for which we are contractually committed. Where we are committed to make a minimum payment to the supplier regardless of whether we take delivery, we have included only that minimum payment as a purchase obligation. The acquisition of spectrum licenses is subject to regulatory approval and other customary closing conditions.\nRelated Party Transactions\nWe have related party transactions associated with DT, SoftBank or their respective affiliates in the ordinary course of business, including intercompany servicing and licensing.\nAs of January 24, 2025, DT and SoftBank held, directly or indirectly, approximately 51.5% and 7.5%, respectively, of the outstanding T-Mobile common stock, with the remaining approximately 41.0% of the outstanding T-Mobile common stock held by other stockholders. As a result of the Proxy, Lock-Up and ROFR Agreement, dated April 1, 2020, by and between DT and SoftBank, DT has voting control, as of January 24, 2025, over approximately 58.7% of the outstanding T-Mobile common stock.\nDisclosure of Iranian Activities under Section 13(r) of the Exchange Act\nSection 219 of the Iran Threat Reduction and the Syria Human Rights Act of 2012 added Section 13(r) to the Exchange Act. Section 13(r) requires an issuer to disclose in its annual or quarterly reports, as applicable, whether it or any of its affiliates knowingly engaged in certain activities, transactions or dealings relating to Iran or with designated natural persons or entities involved in terrorism or the proliferation of weapons of mass destruction. Disclosure is required even where the activities, transactions or dealings are conducted outside the U.S. by non-U.S. affiliates in compliance with applicable law, and whether or not the activities are sanctionable under U.S. law.\nAs of the date of this report, we are not aware of any activity, transaction or dealing by us or any of our affiliates for the year ended December 31, 2024, that requires disclosure in this report under Section 13(r) of the Exchange Act, except as set forth below with respect to affiliates that we do not control and that are our affiliates solely due to their common control with either DT or SoftBank. We have relied upon DT and SoftBank for information regarding their respective activities, transactions and dealings.\nDT, through certain of its non-U.S. subsidiaries, is party to roaming and interconnect agreements with the following mobile and fixed line telecommunication providers in Iran, some of which are or may be government-controlled entities: Irancell Telecommunications Services Company, Telecommunication Kish Company, Mobile Telecommunication Company of Iran, and Telecommunication Infrastructure Company of Iran. In addition, during the year ended December 31, 2024, DT, through certain of its non-U.S. subsidiaries, provided basic telecommunications services to five customers in Germany identified on the Specially Designated Nationals and Blocked Persons List maintained by the U.S. Department of Treasury’s Office of Foreign Assets Control: Bank Melli, Europäisch-Iranische Handelsbank, CPG Engineering & Commercial Services GmbH, Golgohar Trade and Technology GmbH and International Trade and Industrial Technology ITRITEC GmbH. These services have been terminated or are in the process of being terminated. For the year ended December 31, 2024, gross revenues of all DT affiliates generated by roaming and interconnection traffic and telecommunications services with the Iranian parties identified herein were less than $0.1 million, and the estimated net profits were less than $0.1 million.\nIn addition, DT, through certain of its non-U.S. subsidiaries that operate a fixed-line network in their respective European home countries (in particular, Germany), provides telecommunications services in the ordinary course of business to the Embassy of Iran in those European countries. Gross revenues and net profits recorded from these activities for the year ended December 31, 2024, were less than $0.1 million. We understand that DT intends to continue these activities.\nSeparately, SoftBank, through one of its non-U.S. subsidiaries, provides roaming services in Iran through Irancell Telecommunications Services Company. During the year ended December 31, 2024, SoftBank had no gross revenues from such services, and no net profit was generated. We understand that the SoftBank subsidiary intends to continue such services. This subsidiary also provides telecommunications services in the ordinary course of business to accounts affiliated with the Embassy of Iran in Japan. During the year ended December 31, 2024, SoftBank estimates that gross revenues and net profit \n50\nTable of Contents\ngenerated by such services were both under $0.1 million. We understand that the SoftBank subsidiary is obligated under contract and intends to continue such services.\nIn addition, SoftBank, through one of its non-U.S. indirect subsidiaries, provides office supplies to the Embassy of Iran in Japan. SoftBank estimates that gross revenues and net profit generated by such services during the year ended December 31, 2024, were both under $0.1 million. We understand that the SoftBank subsidiary intends to continue such activities.\nCritical Accounting Estimates\nOur significant accounting policies are fundamental to understanding our results of operations and financial condition as they require that we use estimates and assumptions that may affect the value of our assets or liabilities and financial results. See \nNote 1 – Summary of Significant Accounting Policies\n of the Notes to the Consolidated Financial Statements for further information.\nTwo of these policies, discussed below, relate to critical estimates because they require management to make difficult, subjective and complex judgments about matters that are inherently uncertain and because it is likely that materially different amounts would be reported under different conditions or using different assumptions. Actual results could differ from those estimates.\nManagement and the Audit Committee of the Board of Directors have reviewed and approved the accounting policies associated with these critical estimates.\nDepreciation\nOur property and equipment balance represents a significant component of our consolidated assets. We record property and equipment at cost, and we generally depreciate property and equipment on a straight-line basis over the estimated useful life of the assets. If all other factors were to remain unchanged, we expect that a one-year increase in the useful lives of our in-service property and equipment would have resulted in a decrease of approximately $3.2 billion in our 2024 depreciation expense and that a one-year decrease in the useful life would have resulted in an increase of approximately $4.6 billion in our 2024 depreciation expense.\nSee \nNote 1 – Summary of Significant Accounting Policies\n and \nNote \n6\n – Property and Equipment\n of the Notes to the Consolidated Financial Statements for information regarding depreciation of assets, including management’s underlying estimates of useful lives.\nIncome Taxes\nWe account for uncertainty in income taxes recognized in the financial statements in accordance with the accounting guidance for the financial statement recognition and measurement of a tax position taken or expected to be taken in a tax return. We assess whether it is more likely than not that a tax position will be sustained upon examination based on the technical merits of the position and adjust the unrecognized tax benefits in light of changes in facts and circumstances, such as changes in tax law, interactions with taxing authorities and developments in case law.\nThe income tax laws of the jurisdictions in which we operate are complex and subject to different interpretations by management and the relevant government taxing authorities. In establishing a provision for income tax expense, we must make judgments about the application of these inherently complex tax laws. We must also make estimates about when in the future certain items will affect taxable income in the various tax jurisdictions. Our interpretations may be subjected to review during examination by taxing authorities and disputes may arise over the respective tax positions. We attempt to resolve these disputes during the tax examination and audit process and ultimately through the court system when applicable. \nWe monitor relevant tax authorities and revise our estimate of accrued income taxes due to changes in income tax laws and their interpretation by the courts and regulatory authorities on a quarterly basis. Revisions of our estimate of accrued income taxes also may result from our own income tax planning and from the resolution of income tax controversies. Such revisions in our estimates may be material to our Income tax expense for any given quarter. \nAccounting Pronouncements Not Yet Adopted\nFor information regarding recently issued accounting standards, see \nNote 1 – Summary of Significant Accounting Policies\n of the Notes to the Consolidated Financial Statements.\n51\nTable of Contents",
  "item2": null
}