{
  "source_file": "tpl-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business.\n \nGeneral\n \nTexas Pacific Land Corporation (which, together with its subsidiaries as the context requires, may be referred to as “TPL,” the “Company,” “our,” “we,” or “us”) is a Delaware Corporation and one of the largest landowners in the State of Texas with approximately 873,000 surface acres of land, principally concentrated in the Permian Basin.  Additionally, we own a 1/128th nonparticipating perpetual oil and gas royalty interest (“NPRI”) under approximately 85,000 acres of land, a 1/16th NPRI under approximately 371,000 acres of land, and approximately 16,000 additional net royalty acres (normalized to 1/8th) (“NRA”), for a collective total of approximately 207,000 NRA, principally concentrated in the Permian Basin.\nThe Company was originally organized as Texas Pacific Land Trust (the “Trust”) under a Declaration of Trust, dated February 1, 1888 (the “Declaration of Trust”), to receive and hold title to extensive tracts of land in the State of Texas, previously the property of the Texas and Pacific Railway Company.  The Declaration of Trust provided for the appointment of trustees (the “Trustees”) to manage the assets of the Trust with all of the powers of an absolute owner.  On January 11, 2021, the Trust completed its reorganization from a business trust, Texas Pacific Land Trust, into Texas Pacific Land Corporation, a corporation formed and existing under the laws of the State of Delaware (“the “Corporate Reorganization”).\nOur surface and royalty ownership provide revenue opportunities throughout the oil and gas development value chain.  While we are not an oil and gas producer, we benefit from various revenue sources throughout the life cycle of a well.  During the initial development phase whereby infrastructure for oil and gas development is constructed, we receive fixed fee payments for use of our land and revenue for sales of materials (caliche) used in the construction of the infrastructure.  During the drilling and completion phase, we generate revenue for providing sourced water and/or treated produced water, fixed fee payments for use of our land and revenue related to the sale of sand to operators.  During the production phase, we receive revenue from our oil and gas royalty interests and revenue related to saltwater disposal on our land.  In addition, we generate revenue from pipeline, power line and utility easements, commercial leases and temporary permits principally related to a variety of land uses, including, but not limited to, midstream infrastructure projects and processing facilities as hydrocarbons are processed and transported to market.  Additionally, as a result of an acquisition in 2024, we have recently begun receiving commercial revenue related to a nonhazardous oilfield solids waste disposal site.  See further discussion in Note 3, “Assets Acquired in a Business Combination” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”\nOur mission is to pursue a thoughtful, long-term approach towards optimizing and building upon the commercial and environmental virtues of our extensive lands and resources.  We have a long history of responsible management of our legacy assets, and in recent years, we have expanded our business strategy to generate incremental revenue streams that take advantage of our vast surface and royalty footprint, such as our investments in the Water Services and Operations business segment.  Beyond our current businesses, we continue to explore new opportunities related to renewable energy, environmental \n1\nTable of \nContents\nsustainability, and technology, among others, that can leverage our existing legacy surface and royalty assets.  Our business model emphasizes high cash flow margins and relatively low ongoing capital expenditure requirements, and we expect new opportunities to generally align with these priorities.  We remain focused on optimizing long-term value creation and profitability, fostering responsible stewardship of our assets, providing quality customer service, and engaging with and advocating for employee and stakeholder interests.\nRecent Developments\nCommon Stock Split\nOn March 26, 2024, we effected a three-for-one stock split in the form of a stock dividend of two additional shares of common stock, par value $0.01 per share (“Common Stock”), for every share of Common Stock outstanding to stockholders of record as of March 18, 2024. All shares, restricted stock awards (“RSAs”), restricted stock units (“RSUs”), performance stock units (“PSUs”) and per share information have been retroactively adjusted to reflect the stock split. The shares of Common Stock retained a par value of $0.01 per share. Accordingly, an amount equal to the par value of the increased shares resulting from the stock split was reclassified from “Additional paid-in capital” to “Common Stock” on our consolidated balance sheets.\nAcquisition Activity During 2024\nIn August 2024, we acquired  4,120 surface acres in Martin, County, Texas along with other surface-related tangible and intangible assets from an unaffiliated seller, for total cash consideration of $45.0 million, of which $20.4 million represented assets acquired for the Land and Resource Management segment with the remaining $24.6 million of assets acquired for the Water Services and Operations segment.  In addition to surface acres, we acquired water sourcing assets and other contractual rights including a contractual right to a 7.5% royalty on revenue generated from a nonhazardous oilfield solids waste disposal site.  These assets generate revenue streams across both segments including water sales, produced water royalties, and other surface related (“SLEM”) revenue and provide additional commercial growth opportunities for us to expand water sourcing and produced water opportunities to both new and existing customers.  See further discussion of this acquisition in Note 3, “Assets Acquired in a Business Combination” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”\nAlso in August 2024, we acquired mineral interests across 4,106 NRA located in Culberson County, Texas for a purchase price of $120.3 million, net of post-closing adjustments.  The acquisition was completed in conjunction with Brigham Royalties Fund I Holdco, L.L.C., a subsidiary of Brigham Royalties, LLC (“Brigham Royalties”) in an arms-length transaction with an unaffiliated seller. See further discussion of this acquisition in Note 4, “Oil and Gas Royalty Interests” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”  The acquired mineral interests overlap with existing TPL royalty acreage.\nIn October 2024, we acquired 7,490 NRA located primarily in the Midland Basin in Martin, Midland and other counties in Texas and New Mexico, with over 80% of the acquired interests adjacent to or overlapping existing TPL surface and royalty acreage for cash consideration of $275.2 million, net of post-closing adjustments.\n \nBusiness Segments\n \nWe operate our business in two reportable segments: Land and Resource Management and Water Services and Operations.  Our segments provide management with a comprehensive financial view of our key businesses.  Our segments enable the alignment of strategies and objectives of the Company and provide a framework for timely and rational allocation of resources within businesses.  See Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and Note 15, “Business Segment Reporting” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”\nLand and Resource Management\n \nOur Land and Resource Management segment encompasses the business of managing our approximately 873,000 surface acres of land and approximately 207,000 NRA of oil and gas royalty interests, principally concentrated in the Permian Basin.  The revenue streams of this segment consist primarily of royalties from oil and gas, revenues from easements, commercial leases and renewables, and land and material sales. \n \nWe are not an oil and gas producer.  Rather, our oil and gas revenue is derived from our oil and gas royalty interests.  Thus, in addition to being subject to fluctuations in response to the market prices for oil and gas, our oil and gas royalties are \n2\nTable of \nContents\nalso subject to decisions made by the owners and operators of the oil and gas wells to which our royalty interests relate as to investments in and production from those wells.  Our oil and gas royalty interests require no capital expenditures or operating expense burden from us for well development.\n \nOur revenue from easements is primarily generated from pipelines transporting oil, gas and related hydrocarbons, power line and utility easements, and subsurface wellbore easements.  Easements typically have a 30-plus year term but subsequently renew every 10 years with an additional payment.  In addition to easements, we also receive revenues from other surface-related operations on our land, including but not limited to, commercial leases, well development and material sales.  Commercial lease revenue is derived primarily from processing, storage and compression facilities, and roads.  Material sales include caliche, sand, and other material sales to operators.  Caliche is used in the construction of oil and gas-related infrastructure, and sand is utilized for completion operations.  Additionally, as a result of an acquisition in 2024, we have recently begun generating commercial revenue related to a nonhazardous oilfield solids waste disposal site.  See the discussion of acquisition activity above for additional information.\nIn recent years, we have entered into agreements with third parties related to renewables and various “next generation” opportunities that will potentially utilize TPL’s surface assets.  These agreements include the evaluation of grid-connected batteries, studies on carbon capture and sequestration, and development of bitcoin mining facilities, among other opportunities.  Generally, these projects are structured with multi-year terms that allow for feasibility and/or commercial suitability and revenue arrangements that provide royalty, fee, profit sharing, lease and/or rental payments, though contractual terms and timing for commercial operations will vary by project.  We do not anticipate these agreements will have a significant impact on our revenues in the short-term but do have the potential to contribute meaningfully to our revenues in the longer term.  \nAs a significant landowner, we also generate revenue from land sales.  From time to time, we receive offers from third parties to acquire tracts of our land.  Sales demand and related sale prices of particular tracts of land are influenced by many factors, including general economic conditions, the rate of development in nearby areas and the suitability of the particular tract for commercial uses.\nOperations\n \nRevenues from the Land and Resource Management segment for the last three years were as follows (dollars presented in thousands):\nYears Ended December 31,\n \n2024\n2023\n2022\n \nSegment\nRevenue\n% of Total\nConsolidated\nRevenue\nSegment\nRevenue\n% of Total\nConsolidated\nRevenue\nSegment\nRevenue\n% of Total\nConsolidated\nRevenue\nOil and gas royalties \n$\n373,331 \n53 \n%\n$\n357,394 \n57 \n%\n$\n452,434 \n68 \n%\nEasements and other surface-related income\n63,074 \n9 \n%\n67,905 \n11 \n%\n44,860 \n7 \n%\nLand sales\n4,388 \n1 \n%\n6,806 \n1 \n%\n9,681 \n1 \n%\nTotal Revenue – Land and Resource Management segment\n$\n440,793 \n63 \n%\n$\n432,105 \n69 \n%\n$\n506,975 \n76 \n%\nSee Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Segment Results of Operations” for a discussion of our segment-level financial results.\nOil and Gas Activity for the Year Ended December 31, 2024 \nFor the year ended December 31, 2024, our share of crude oil, natural gas and natural gas liquid (“NGL”) production was 26.8 thousand barrels of oil equivalent (“Boe”) per day compared to 23.5 thousand Boe per day for the same period of 2023.  The average realized price was $39.87 per Boe for the year ended December 31, 2024, a decrease of 6.4% compared to the average realized price of $42.58 per Boe for the same period of 2023.\nThere are a number of oil and gas wells in which we have royalty interests that have been permitted but are still awaiting drilling and completion activity. In addition, we have also identified oil and gas wells in which we have a royalty interest that have been drilled but are not yet completed (“DUC”). These permitted and DUC wells represent potential near-term \n3\nTable of \nContents\ncandidates for further development by operators towards ultimately being placed into production. We have identified 506 permitted gross wells (an estimated 6.4 net wells) and 793 DUC wells (an estimated 13.2 net wells) subject to our royalty interest as of December 31, 2024.  The number of DUC wells is determined using uniform drilling spacing units with pooled interests for all wells awaiting completion. \nCompetition\n \nOur Land and Resource Management segment has few direct peers, in that it sells, leases and generally manages land owned by the Company and, as such, any owner of property located in areas comparable to the Company is a potential competitor.  The Company’s sizable land ownership of approximately 873,000 surface acres and commercial sophistication is unique, as neighboring landowners tend to own substantially smaller land positions and/or do not possess the commercial expertise to maximize business opportunities.\n \nWater Services and Operations\n \nOur Water Services and Operations segment encompasses the business of providing full-service water offerings to operators in the Permian Basin through our wholly-owned subsidiary, Texas Pacific Water Resources LLC (“TPWR”).\nThese full-service water offerings include, but are not limited to, water sourcing, produced-water treatment, infrastructure development, and disposal solutions.  We are committed to sustainable water development.  Our significant surface ownership in the Permian Basin provides TPWR with a unique opportunity to provide multiple full-service water offerings to operators.\nThe revenue streams of this segment principally consist of revenue from sales of sourced and treated water\n \nas well as revenue from produced water royalties.  Energy businesses use water for their oil and gas projects, including new drilling and completion operations, while service businesses (\ni.e.\n, water management service companies) operate water facilities to sell water to, and dispose of produced water of, energy businesses.\nOperations\n \nRevenues from our Water Services and Operations segment for the last three years were as follows (dollars presented in thousands):\nYears Ended December 31,\n \n2024\n2023\n2022\n \nSegment\nRevenue\n% of Total\nConsolidated\nRevenue\nSegment\nRevenue\n% of Total\nConsolidated\nRevenue\nSegment\nRevenue\n% of Total\nConsolidated\nRevenue\nWater sales\n$\n150,724 \n21 \n%\n$\n112,203 \n18 \n%\n$\n84,725 \n13 \n%\nProduced water royalties\n104,123 \n15 \n%\n84,260 \n13 \n%\n72,234 \n11 \n%\nEasements and other surface-related income\n10,183 \n1 \n%\n3,027 \n— \n%\n3,488 \n— \n%\nTotal Revenue – Water Services and Operations segment\n$\n265,030 \n37 \n%\n$\n199,490 \n31 \n%\n$\n160,447 \n24 \n%\nSee Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Segment Results of Operations” for a discussion of our segment-level operating results.\nActivity for the year ended December 31, 2024\nThe increase in water sales during 2024 compared to 2023 is principally due to a 31.0% increase in water sales volumes over the same period.\nIn May 2024, we announced our progress towards developing new solutions for produced water in the Permian Basin. Over the last few years, we have been working with a leading industrial technology and manufacturing firm to develop an energy-efficient desalination and treatment process and associated equipment that can recycle produced water into fresh water with quality standards appropriate for surface discharge and beneficial reuse. With the Permian Basin generating approximately 19 million barrels of produced water per day, we believe this technology would provide an attractive and critical alternative to \n4\nTable of \nContents\nsubsurface injection. We filed a patent application for the desalination and treatment process and have secured exclusive use-rights for the equipment geared towards produced water applications.  We have successfully tested a pilot program in our research and development lab.  Construction has begun on a sub-scale produced water desalination test facility with an initial capacity of 10,000 barrels of produced water per day, and we anticipate construction to be completed during 2025.  We are also in commercial discussions with oil and gas upstream operators as we look to provide critical, technology-driven solutions while also optimizing our economic interests and limiting capital outlay. During the year ended December 31, 2024, we spent $9.9 million on this new energy-efficient desalination and treatment process and equipment, of which $7.4 million was capitalized.   \nAdditionally, during 2024, we invested $21.7 million in TPWR projects to maintain and/or enhance water sourcing assets.\n \nCompetition\nWhile there is competition in the water service business in the Permian Basin, we believe our position as a significant landowner of approximately 873,000 surface acres gives us a distinct advantage over our competitors who must negotiate with existing landowners to source water and then for the right of way to deliver the water to the end user.\n \nMajor Customers  \nThe chart below depicts our total revenues and revenues from customers representing 10% or more of our 2024 consolidated revenues:\nWhile approximately 41% of our 2024 revenue was derived from only three customers, two of these customers are in the top 10, and the remaining customer is in the top 50, energy companies in the world based on market capitalization, and we believe each of them is a strong and reliable operator.  Given their major presence in the Permian Basin and our significant surface lands in the same area, the high concentration of business with these three customers is expected.  Further, the choice of whom we do business with largely depends on location of mineral royalties and surface rights on or near our assets and consists of a limited universe of oil and gas companies who operate in the Permian Basin. \n5\nTable of \nContents\nSeasonality\n \nWhile our business is not seasonal in nature, as that term is generally understood, revenue from oil and gas royalties may fluctuate from period to period based upon market prices for oil and gas and production decisions made by the operators.  Our other revenue streams, which include, but are not limited to, water sales and royalties, easements and other surface related income and sales of land, may also fluctuate from period to period.  In addition, our results are generally dependent on the decisions and actions of third parties out of our ultimate control.  As a consequence, the results of our operations for any particular period are not necessarily indicative of the results of operations for a full year.\n \nRegulations\n \nWe are subject to various federal, state and local laws.  Management believes that our operations comply in all material respects with applicable laws and regulations and that the existence and enforcement of such laws and regulations have no more restrictive effect on our method of operations than on other companies similar to TPL.\n \nWe cannot determine the extent to which new legislation, new regulations or changes in existing laws or regulations may affect our future operations.\n \nEnvironmental Considerations\n \nCompliance with federal, state and local provisions that have been enacted or adopted regulating the discharge of materials into the environment, or otherwise relating to the protection of the environment, have had no material effect upon our business generally, including the capital expenditures, earnings and competitive position of the Company.  To date, we have not been called upon to expend any material amount of funds for these purposes.\nEnvironmental, Social and Governance (“ESG”)\n \nOur current ESG disclosure is available at our website at www.TexasPacific.com.  Our ESG disclosure has been prepared to align with the Sustainable Accounting Standards Board, the Global Reporting Initiative, and the Task Force on Climate Related Disclosures frameworks.\nIntegrating sustainability and ESG objectives is a priority for our Company.  Our ESG strategy reflects its dedication to meeting tactical business priorities while managing the environmental impacts of its operations, maintaining principles for social responsibility, and upholding a commitment to strong corporate governance.  Our ESG strategy is focused on the overarching priorities of environmental management, employee health and safety, workforce management and equality, community and landowner engagement, and strong corporate governance and ethics.  We are committed to sustainability and responsible stewardship across all of our operations and land management activities.\nAs we do not produce oil or gas from the land from which our royalty revenue stream is derived, we developed our sustainability goals and partnership opportunities in consultation with the entities operating on our land.  On the water solutions side of our business, we developed a tailored ESG program that addresses the ethical and responsible buildout of water assets and management of water as a natural resource.  Our continued goal is an integrated and iterative approach to sustainable and responsible resource management.\nOur ESG accomplishments include, but are not limited to:\n•\nIncreased the electrification of our water assets in an effort to reduce costs and mitigate our overall emission profile by reducing reliance on diesel generators.  Cumulatively through December 31, 2024, we have spent $22.3 million of capital on electric infrastructure.\n•\nInitiated energy tracking in 2020 to monitor and identify trends in energy consumption and sourcing.\n•\nPrioritized the health and welfare of our workforce.\n•\nEmployed practices for the tracking and monitoring of all spills, regardless of whether they are within or outside of regulatory reporting requirements.  We had zero spills of produced water in 2024, 2023, and 2022.\n•\nPartnered with oil & gas operators on our surface estate to collectively discuss and manage ESG risks.  Partnership opportunities included: developing renewable energy infrastructure across our land, developing water infrastructure to \n6\nTable of \nContents\nsupport the reuse and recycling of produced water—a critical response to climate change, partnering to develop new technologies that support emissions management, and more.\n•\nInstituted a governance framework that includes oversight and stewardship of our ESG strategies.  The Nominating and Corporate Governance Committee (the “Nominating and Corporate Governance Committee”) of our board of directors (“the Board”) reviews our policies and programs concerning corporate social responsibility, including ESG matters, with the support of the Audit Committee of the Board (“the “Audit Committee”) and the Compensation Committee of the Board (the “Compensation Committee”), where appropriate.  The committees provide guidance to the Board and management with respect to trends and developments regarding environmental, social, governance, and political matters that could significantly impact the Company.\nThe disclosure denotes that our ESG strategy, including metrics and targets, is continuously reviewed and assessed annually to determine if updates or process improvements are needed.\nHuman Capital Resources\n \nWe believe we have a talented, motivated and dedicated team, and we are committed to supporting the development of our team members and continuously building on our strong culture.\n \nAs of December 31, 2024, we had 111 full-time employees, of which 34 were employees of TPWR.  \nOur business strategy and ability to serve customers relies on employing talented professionals and attracting, training, developing and retaining a knowledgeable skilled workforce.  We maintain a good working relationship with our employees.  We value our employees and their experience in providing value through land, mineral and water resource management and water solutions.  Maintaining a robust pipeline of talent is crucial to our ongoing success and is a key aspect of succession planning efforts across the organization.  Our leadership and human resources teams are responsible for attracting and retaining top talent by facilitating an environment where employees feel supported and encouraged in their professional and personal development.  We are committed to enhancing gender, racial and ethnic diversity throughout our organization.\n \nWe believe that diversity is an important factor in bringing people together, encouraging shared commitment and fostering new ideas.\nWe strive to be a great place for our employees to work.  Accordingly, we offer industry competitive pay and benefits, tuition reimbursement and continuing education classes and are committed to maintaining a workplace environment that promotes employee productivity and satisfaction.\nEmployee safety is also among our top priorities.  Accordingly, we have developed and administer company-wide policies to ensure a safe and fair workplace free of discrimination or harassment for each team member and compliance with Occupational Safety and Health Administration (“OSHA”) standards, as further discussed in our Code of Business Conduct and Ethics.  This commitment applies to recruiting, hiring, compensation, benefits, training, termination, promotions or any other terms and conditions of employment.  We maintain our strong focus on safety and have taken measures to protect our employees and maintain safe, reliable operations.\nWe have a goal of zero occupational injuries, illnesses and incidents in our workplace.  To ensure that we protect our safety culture, we have in place a dedicated Health, Safety, and Environment Management team with substantial combined years of experience and have in-house authorized trainers for OSHA-required certified training, powered equipment training and PCE-safe land certificated training.\n \nAvailable Information on our Website\n \nWe make available on our website at www.TexasPacific.com, free of charge, our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports as soon as reasonably practicable after they are electronically filed with, or furnished to, the SEC pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 (the “Exchange Act”).  Such reports are also available at www.sec.gov.  The information contained on our website is not part, or incorporated by reference into, this Annual Report on Form 10-K.\n \n7\nTable of \nContents",
  "item7": "Item 7.\n \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations.\nThe following Management’s Discussion and Analysis of Financial Condition and Results of Operation (“MD&A”) is intended to help the reader understand the results of operations and financial condition of Texas Pacific Land Corporation.  MD&A is provided as a supplement to, and should be read in conjunction with, our consolidated financial statements and the accompanying notes to financial statements included in Part II, Item 8 of this Annual Report on Form 10-K.  This discussion and analysis contains forward-looking statements that involve risks, uncertainties and assumptions.  Actual results may differ materially from those anticipated in these forward-looking statements as a result of various factors, including, but not limited to, those factors presented in Part I, Item 1A. “Risk Factors” and elsewhere in this Annual Report on Form 10-K.  This section generally discusses the results of our operations for the year ended December 31, 2024 compared to the year ended December 31, 2023.  For a discussion of the year ended December 31, 2023 compared to the year ended December 31, 2022, refer to Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the year ended December 31, 2023. \nOverview\n  \nTPL was originally organized in 1888 as a business trust to hold title to extensive tracts of land in the State of Texas that were previously the property of the Texas and Pacific Railway Company.  On January 11, 2021, we completed our Corporate Reorganization from a business trust to a corporation and changed our name from Texas Pacific Land Trust to Texas Pacific Land Corporation.  \nOur business activity is generated from our surface and royalty interest ownership, primarily in the Permian Basin.  Our revenues are derived from oil and gas royalties, water sales, produced water royalties, easements and other surface-related income and land sales.  Due to the nature of our operations and concentration of our ownership in one geographic location, our revenue and net income are subject to substantial fluctuations from quarter to quarter and year to year.  In addition to fluctuations in response to changes in the market price for oil and gas, our financial results are subject to decisions by not only the owners and operators of oil and gas wells to which our oil and gas royalty interests relate, but also to other owners and operators in the Permian Basin as it relates to our other revenue streams, principally water sales, produced water royalties, easements and other surface-related revenue. \nMarket Conditions\nAverage oil prices for the year ended December 31, 2024 were relatively flat compared to average oil prices during the same period last year.  Oil prices continue to be impacted by certain actions by OPEC+, geopolitics, and evolving global supply and demand trends, among other factors.  Average natural gas prices during 2024 decreased compared to average prior year natural gas prices.  Global and domestic natural gas markets have experienced volatility due to macroeconomic conditions, infrastructure and logistical constraints, weather, and geopolitics, among other factors.  Since mid-2022, the Waha Hub located in Pecos County, Texas has at times experienced significant negative price differentials relative to Henry Hub, located in Erath, Louisiana, due in part to growing local Permian natural gas production and limited natural gas pipeline takeaway capacity.  Midstream infrastructure is currently being developed by operators to provide additional takeaway capacity, though the impact on future basis differentials will be dependent on future natural gas production and other factors.  Changes in global and domestic macro-economic conditions could result in additional shifts in oil and gas supply and demand in future periods.  Although our revenues are directly and indirectly impacted by changes in oil and natural gas prices, we believe our royalty interests (which require no capital expenditures or operating expense burden from us for well development), strong balance sheet, and liquidity position will help us navigate through potential commodity price volatility.\nPermian Basin Activity \n The Permian Basin is one of the oldest and most well-known hydrocarbon-producing areas and currently accounts for a substantial portion of oil and gas production in the United States, covering approximately 86,000 square miles in 52 counties across southeastern New Mexico and western Texas.  Exploration and production (“E&P”) companies active in the Permian have generally increased their drilling and development activity in 2024 compared to recent prior year activity levels.  Per the U.S. Energy Information Administration (“EIA”), Permian production averaged approximately 6.3 million barrels per day during 2024, which represents the highest annual production ever.  The EIA currently estimates that Permian oil production for December 2024 was approximately 6.5 million barrels per day.\n21\nTable of \nContents\nDue to our ownership concentration in the Permian Basin, our revenues are directly impacted by oil and gas pricing and drilling activity in the Permian Basin.  The metrics below show selected benchmark oil and natural gas prices and approximate activity levels in the Permian Basin for the years ended December 31, 2024 and 2023:\nYears Ended December 31,\n2024\n2023\nOil and Gas Pricing Metrics:\n(1)\nWTI Cushing average price per bbl\n$\n76.63 \n$\n77.58 \nHenry Hub average price per mmbtu\n$\n2.19 \n$\n2.53 \nWaha Hub natural gas average price per mmbtu\n$\n0.14 \n$\n1.68 \nActivity Metrics specific to the Permian Basin:\n(1)(2)\nAverage monthly horizontal permits\n654\n499\nAverage monthly horizontal wells drilled\n504\n422\nAverage weekly horizontal rig count\n296\n323\nDUCs as of December 31 for each applicable year\n4,536\n4,656\nTotal Average US weekly horizontal rig count \n(2)\n536\n620\n(1)    Commonly used definitions in the oil and gas industry provided in the table above are defined as follows:  WTI Cushing represents West Texas Intermediate.  Bbl represents one barrel of 42 U.S. gallons of oil.  Mmbtu represents one million British thermal units, a measurement used for natural gas.  DUCs represent drilled but uncompleted wells.  DUC classification is based on well data and date stamps provided by Enverus. DUCs is based on wells that have a drilled/spud date stamp but do not have a completed or first production date stamp. Excludes wells that have been labeled plugged and abandoned or permit expired and wells drilled/spud more than five years ago.\n(2)    Permian Basin specific information per Enverus analytics.  US weekly horizontal rig counts per Baker Hughes United States Rotary Rig Count for horizontal rigs.  Statistics for similar data are also available from other sources.  The comparability between these other sources and the sources used by the Company may differ.  \nWhile average oil prices for the year ended December 31, 2024 were generally flat compared to the same period in 2023, Henry Hub and Waha Hub natural gas prices for the year ended December 31, 2024 declined compared to the same period last year.  E&P companies generally have continued to deploy capital at a measured pace as drilling and development activities across the Permian Basin have remained strong overall.  Although average rig counts during the year ended December 31, 2024 were lower compared to the same period last year, increased drilling and completion efficiencies have allowed operators to maintain robust levels of well development.  As we are a significant landowner in the Permian Basin and not an oil and gas producer, our revenue is affected by the development decisions made by companies that operate in the areas where we own royalty interests and land.  Accordingly, these decisions made by others affect not only our share of production volumes and produced water disposal volumes, but also directly impact our surface-related income and water sales.\nLiquidity\n \nand Capital Resources\nOverview\nOur principal sources of liquidity are cash and cash flows generated from our operations.  Our primary liquidity and capital requirements are for capital expenditures related to our Water Services and Operations segment (the extent and timing of which are under our control), working capital and general corporate needs.\nWe continuously review our liquidity and capital resources.  If market conditions were to change and our revenues were to decline significantly or operating costs were to increase significantly, our cash flows and liquidity could be reduced.  Should this occur, we could seek alternative sources of funding.  We had no debt, credit facilities, or any off-balance sheet arrangements as of December 31, 2024. \n \nAs we evaluate our current capital structure, capital allocation priorities, business fundamentals, and investment opportunities, we have set a target cash and cash equivalents balance of approximately $700 million.  Above this target, we will seek to deploy the majority of our free cash flow towards dividends and share repurchases.  As of December 31, 2024, we had cash and cash equivalents of $369.8 million that we expect to utilize, along with cash flow from operations, to provide capital to \n22\nTable of \nContents\nsupport our business, to pay dividends subject to the discretion of our Board, to repurchase shares of our Common Stock subject to market conditions, for potential acquisitions and for general corporate purposes.  We believe that cash from operations, together with our cash and cash equivalents balances, will be sufficient to meet ongoing capital expenditures, working capital requirements and other cash needs for at least the next 12 months.\nReturn of Capital to Shareholders\nDuring the year ended December 31, 2024, we paid total dividends to our stockholders of $347.3 million, consisting of cumulative regular cash dividends of $5.11 per share and a special dividend of $10.00 per share.  In addition, we repurchased $29.2 million of our Common Stock (including share repurchases not settled at the end of the period).\n \nAcquisition Activity \nWe completed the following asset acquisitions and business combination during 2024:\n•\nAcquired mineral interests across 7,490 NRA located primarily in the Midland Basin in Martin, Midland and other counties in Texas and New Mexico for cash consideration of  $275.2 million, net of post-closing adjustments.\n•\nAcquired mineral interests across 4,106 NRA located in Culberson County, Texas for a purchase price of $120.3 million, net of post-closing adjustments.\n•\nAcquired 4,120 surface acres in Martin County, Texas along with other surface-related tangible and intangible assets in a business combination for total consideration of $45.0 million.\nSee Part I, Item 1, “Business — Recent Developments” for further discussion of our acquisition activity during 2024.\nDevelopment of New Solutions for Produced Water and Capital Expenditures\nIn May 2024, we announced our progress towards developing new solutions for produced water in the Permian Basin. Over the last few years, we have been working with a leading industrial technology and manufacturing firm to develop an energy-efficient desalination and treatment process and associated equipment that can recycle produced water into fresh water with quality standards appropriate for surface discharge and beneficial reuse.  During the year ended December 31, 2024, we spent $9.9 million on this energy-efficient desalination and treatment process and equipment, of which $7.4 million was capitalized.  See the discussion in Part I, Item 1, “Business — Business Segments” for additional information.\nAdditionally, during the year ended December 31, 2024, we invested approximately $21.7 million to maintain and/or enhance our water sourcing assets. \nCash Flows from Operating Activities\nFor the years ended December 31, 2024 and 2023, net cash provided by operating activities was $490.7 million and $418.3 million, respectively.  Our cash flow provided by operating activities is primarily from oil, gas and produced water royalties, water and land sales, easements, and other surface-related income.  Cash flow used in operations generally consists of operating expenses associated with our revenue streams, general and administrative expenses and income taxes. \nThe increase in cash flows provided by operating activities for the year ended December 31, 2024 compared to the same period of 2023 was primarily driven by an increase in operating income and changes in working capital requirements.\n \nCash Flows Used in Investing Activities \nFor the years ended December 31, 2024 and 2023, net cash used in investing activities was $471.7 million and $60.3 million, respectively.  Our cash flows used in investing activities are primarily related to acquisitions and capital expenditures related to our water services and operations segment.  Our acquisitions may include land, royalty interests and other similar tangible and intangible assets.\nFor further information regarding acquisitions during the year ended December 31, 2024, see “Acquisition Activity” above.  Capital expenditures for the years ended December 31, 2024 and 2023 were $29.7 million and $15.0 million, respectively.\n23\nTable of \nContents\nCash Flows Used in Financing Activities\nFor the years ended December 31, 2024 and 2023, net cash used in financing activities was $378.1 million and $144.6 million, respectively.  Our cash flows used in financing activities principally consist of activities that return capital to our stockholders such as payments of dividends and repurchases of our Common Stock.\nDuring the year ended December 31, 2024, we paid total dividends of $347.3 million, consisting of cumulative regular cash dividends of $5.11 per share and a special dividend of $10.00 per share.  During the year ended December 31, 2023, we paid total dividends of $100.0 million consisting of cumulative regular cash dividends of $4.33 per share.  We repurchased $29.2 million and $42.4 million of our Common Stock (in each case, including share repurchases not settled at the end of the period) during the years ended December 31, 2024 and 2023, respectively.\nResults of Operations - Consolidated\nThe following table shows our consolidated results of operations and our results of operations by reportable segment for Land and Resource Management (“LRM”) and Water Service and Operations (“WSO”) for the years ended December 31, 2024 and 2023 (in thousands):\n \nYears Ended December 31,\n \n2024\n2023\nLRM\nWSO\nConsolidated\nLRM\nWSO\nConsolidated\nRevenues:\nOil and gas royalties\n$\n373,331 \n$\n— \n$\n373,331 \n$\n357,394 \n$\n— \n$\n357,394 \nWater sales\n— \n150,724 \n150,724 \n— \n112,203 \n112,203 \nProduced water royalties\n— \n104,123 \n104,123 \n— \n84,260 \n84,260 \nEasements and other surface-related income\n63,074 \n10,183 \n73,257 \n67,905 \n3,027 \n70,932 \nLand sales\n4,388 \n— \n4,388 \n6,806 \n— \n6,806 \nTotal revenues\n440,793 \n265,030 \n705,823 \n432,105 \n199,490 \n631,595 \nExpenses:\nSalaries and related employee expenses\n27,493 \n26,128 \n53,621 \n21,945 \n21,439 \n43,384 \nWater service-related expenses\n— \n46,124 \n46,124 \n— \n33,566 \n33,566 \nGeneral and administrative expenses\n25,531 \n8,952 \n34,483 \n39,078 \n7,372 \n46,450 \nDepreciation, depletion and amortization\n10,968 \n14,194 \n25,162 \n3,073 \n11,684 \n14,757 \nAd valorem and other taxes\n7,257 \n38 \n7,295 \n7,382 \n3 \n7,385 \nTotal operating expenses\n71,249 \n95,436 \n166,685 \n71,478 \n74,064 \n145,542 \nOperating income\n369,544 \n169,594 \n539,138 \n360,627 \n125,426 \n486,053 \nOther income, net\n31,707 \n7,976 \n39,683 \n30,384 \n1,124 \n31,508 \nIncome before income taxes\n401,251 \n177,570 \n578,821 \n391,011 \n126,550 \n517,561 \nIncome tax expense\n86,350 \n38,511 \n124,861 \n84,305 \n27,611 \n111,916 \nNet income\n$\n314,901 \n$\n139,059 \n$\n453,960 \n$\n306,706 \n$\n98,939 \n$\n405,645 \nYear Ended December 31, 2024\n \nCompared to\n \nYear Ended December 31, 2023\nConsolidated Revenues and Net Income:\nTotal revenues increased $74.2 million, or 11.8%, to $705.8 million for the year ended December 31, 2024 compared to $631.6 million for the year ended December 31, 2023.  This increase was principally due to the $38.5 million increase in water sales, the $19.9 million increase in produced water royalties and the $15.9 million increase in oil and gas royalty revenue in 2024 over 2023.  Individual revenue line items are discussed below under “Segment Results of Operations.”  Net income of $454.0 million for the year ended December 31, 2024 was 11.9% higher than 2023, principally as a result of the increase in total revenues, partially offset by an increase in operating expenses, as discussed below.\n24\nTable of \nContents\nConsolidated Expenses:\nSalaries and related employee expenses\n.  Salaries and related employee expenses were $53.6 million for the year ended December 31, 2024 compared to $43.4 million for 2023.  The number of employees increased from 100 at December 31, 2023 to 111 as of December 31, 2024, which, when coupled with market compensation adjustments effective at the beginning of 2024, resulted in increased salary and related employee expenses for the year ended December 31, 2024 compared to 2023.  Additionally, contract labor expenses for the year ended December 31, 2024 increased over 2023, principally as a result of the 34.3% increase in water sales over the same period.\nWater service-related expenses\n.  Water service-related expenses increased $12.6 million to $46.1 million for the year ended December 31, 2024 compared to 2023.  Certain types of water service-related expenses, including, but not limited to, treatment, transfer, water purchases, repairs and maintenance, equipment rental, and fuel costs vary from period to period as our customers’ needs and requirements change.  Right of way and other expenses also vary from period to period depending on the location of customer delivery.  The increase in water service-related expenses for the year ended December 31, 2024 was principally related to a 34.3% increase in water sales over 2023, primarily as a result of increased water volumes.  Research and development expenses related to development of a new energy-efficient method of produced water desalination and treatment were $2.5 million and $1.2 million for the years ended December 31, 2024 and 2023, respectively.  For further discussion of this new treatment method, see “Liquidity and Capital Resources — Development of New Solutions for Produced Water and Capital Expenditures” above.\nGeneral and administrative expenses.  \nGeneral and administrative expenses decreased $12.0 million to $34.5 million for the year ended December 31, 2024 from $46.5 million for the same period of 2023.  The decrease in general and administrative expenses during the year ended December 31, 2024 compared to the same period of 2023 was principally related to a reduction in legal and professional fees associated with stockholder matters that occurred during 2023.\nDepreciation, depletion and amortization\n.  Depreciation, depletion and amortization was $25.2 million for the year ended December 31, 2024 compared to $14.8 million for the year ended December 31, 2023.  The increase is principally due to additional depletion expense associated with royalty interests acquired in August 2024 and October 2024, as well as additional amortization expense associated with intangible assets acquired in August 2023 and August 2024.\nOther income, net.\n  Other income, net was $39.7 million and $31.5 million for the years ended December 31, 2024 and 2023, respectively.  The increase in other income, net was primarily related to increased interest income earned on our cash balances during 2024.  Higher interest yields during the year ended December 31, 2024 contributed to the increase in interest income.  Additionally, during the year ended December 31, 2024, we recorded a curtailment and settlement gain of $4.6 million related to the Company’s pension plan.  See further discussion at Note 8, “Pension and Other Postretirement Benefits” in the notes to our consolidated financial statements included under Part II, Item 8, “Financial Statements and Supplementary Data.”\nTotal income tax expense.\n  Total income tax expense was $124.9 million and $111.9 million for the years ended December 31, 2024 and 2023, respectively.  The increase in income tax expense was primarily related to increased operating income resulting from increased consolidated revenues.\nSegment Results of Operations\nWe operate our business in two reportable segments: Land and Resource Management and Water Services and Operations.  We eliminate any inter-segment revenues and expenses, if any, upon consolidation.\n \nWe evaluate the performance of our operating segments separately to monitor the different factors affecting financial results.  The reportable segments presented are consistent with our reportable segments discussed in Note 15, “Business Segment Reporting” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”  We monitor our reporting segments based upon revenue and net income calculated in accordance with accounting principles generally accepted in the United States of America (“GAAP”).\nOur oil and gas royalty revenue, and, in turn, our results of operations for the year ended December 31, 2024 have been impacted by lower average commodity prices compared to 2023.  However, our oil and gas royalty revenues increased for the year ended December 31, 2024 due to increased royalty production.  Additionally, revenues derived from water sales and produced water royalties for the year ended December 31, 2024 were also positively impacted by our active management of our surface and royalty interests in recent years. \n25\nTable of \nContents\nYear Ended December 31, 2024\n \nCompared to\n \nYear Ended December 31, 2023 \nLand and Resource Management\nLand and Resource Management segment revenues increased $8.7 million, or 2.0%, to $440.8 million for the year ended December 31, 2024 as compared to 2023.  The increase in Land and Resource Management segment revenues was related to a $15.9 million increase in oil and gas royalty revenue, partially offset by a decrease in easements and other surface-related income of $4.8 million and a decrease in land sales of $2.4 million for the year ended December 31, 2024 compared to  2023.  \nOil and gas royalties\n.  Oil and gas royalty revenue was $373.3 million for the year ended December 31, 2024 compared to $357.4 million for the year ended December 31, 2023, an increase of 4.5%.  Oil and gas royalties for the year ended December 31, 2023 included an $8.7 million recovery with an operator with respect to unpaid oil and gas royalties for older production periods.  Excluding the impact of the $8.7 million recovery on 2023 revenue, oil and gas royalties for the year ended December 31, 2024 increased $24.6 million due to increased production volumes over 2023.  Our share of production volumes increased to 26.8 thousand Boe per day for the year ended December 31, 2024 compared to 23.5 thousand Boe per day for 2023.  The average realized prices decreased to $39.87 per Boe for the year ended December 31, 2024 from $42.58 per Boe for 2023.\nThe table below provides financial and operational data by royalty stream for the years ended December 31, 2024 and 2023:\nYears Ended December 31,\n2024\n2023\n(2)\nOur share of production volumes \n(1)\n:\nOil (MBbls)\n4,118 \n3,701 \nNatural gas (MMcf)\n17,074 \n14,528 \nNGL (MBbls)\n2,841 \n2,453 \nEquivalents (MBoe)\n9,804 \n8,575 \nEquivalents per day (MBoe/d)\n26.8 \n23.5 \nOil and gas royalties (in thousands):\nOil royalties\n$\n298,074 \n$\n273,304 \nNatural gas royalties\n18,512 \n29,915 \nNGL royalties\n56,745 \n45,510 \nTotal oil and gas royalties\n$\n373,331 \n$\n348,729 \nRealized prices:\nOil ($/Bbl)\n$\n75.80 \n$\n77.33 \nNatural gas ($/Mcf)\n$\n1.17 \n$\n2.23 \nNGL ($/Bbl)\n$\n21.60 \n$\n20.05 \nEquivalents ($/Boe)\n$\n39.87 \n$\n42.58 \n(1)    Commonly used definitions in the oil and gas industry not previously defined: MBbls represents one thousand barrels of crude oil, condensate or NGLs.  Mcf represents one thousand cubic feet of natural gas.  MMcf represents one million cubic feet of natural gas.  MBoe represents one thousand Boe.  MBoe/d represents one thousand Boe per day.\n(2)    The metrics and dollars provided for the year ended December 31, 2023\n \nexclude the impact of the $8.7 million\n recovery\n of oil and gas discussed above.\nEasements and other surface-related income.\n  Easements and other surface-related income was $63.1 million for the year ended December 31, 2024, a decrease of 7.1% compared to $67.9 million for the year ended December 31, 2023.  Easements and other surface-related income includes revenue related to the use and crossing of our land for oil and gas \n26\nTable of \nContents\nexploration and production, renewable energy, and agricultural operations.  The decrease in easements and other surface-related income was principally related to a decrease of $5.1 million in wellbore easements for the year ended December 31, 2024 compared to 2023.  Easements and other surface-related income is dependent on development decisions made by companies that operate in the areas where we own land and is, therefore, unpredictable and may vary significantly from period to period.  See “Permian Basin Activity” above for additional discussion of development activity in the Permian Basin during the year ended December 31, 2024.\nLand sales\n.  Land sales were $4.4 million and $6.8 million for the years ended December 31, 2024 and 2023, respectively.  For the year ended December 31, 2024, we sold 439 acres of land for an aggregate sales price of $4.4 million.  For the year ended December 31, 2023, we sold 18,061 acres of land for an aggregate sales price of approximately $6.8 million.\n \nNet income.\n  Net income for the Land and Resource Management segment increased to $314.9 million for the year ended December 31, 2024 compared to $306.7 million for 2023.  Segment operating income increased $8.9 million for the year ended December 31, 2024 compared to 2023.  The increase was principally due to a $15.9 million increase in oil and gas royalty revenue and a $13.5 million decrease in general and administrative expenses, partially offset by increased depletion expense and salaries and related employee expenses.  Expenses are discussed further above under “Results of Operations — Consolidated.”\n \nWater Services and Operations\n \nWater Services and Operations segment revenues increased 32.9%, to $265.0 million for the year ended December 31, 2024 compared to $199.5 million for 2023.  The increase in Water Services and Operations segment revenues was principally due to increases in water sales revenue and produced water royalties, which are discussed below.  As discussed in “Market Conditions” and “Permian Basin Activity” above, our segment revenues are directly influenced by development decisions made by our customers and the overall activity level in the Permian Basin.  Accordingly, our segment revenues and sales volumes, as further discussed below, will fluctuate from period to period based upon those decisions and activity levels.\n \nWater sales\n.  Water sales revenue increased $38.5 million, or 34.3% to $150.7 million for the year ended December 31, 2024 compared to 2023.  The growth in water sales was principally due to an increase of 31.0% in water sales volumes for the year ended December 31, 2024 compared to the year ended December 31, 2023.\nProduced water royalties.\n  Produced water royalties are royalties received from the transfer or disposal of produced water on our land.  Produced water royalties are contractual and not paid as a matter of right.  We do not operate any saltwater disposal wells. Produced water royalties were $104.1 million  for the year ended December 31, 2024 compared to $84.3 million in 2023.  This increase was principally due to increased produced water volumes for the year ended December 31, 2024 compared to 2023.\nEasements and other surface-related income\n.  Easements and other surface-related income was $10.2 million for the year ended December 31, 2024, an increase of $7.2 million compared to $3.0 million for the year ended December 31, 2023.  The increase in easements and other surface-related income primarily related to an increase in temporary permits for sourced water lines for the year ended December 31, 2024 compared to 2023.\n \nNet income\n.  Net income for the Water Services and Operations segment was $139.1 million for the year ended December 31, 2024 compared to $98.9 million for the year ended December 31, 2023.  Segment operating income increased $44.2 million for the year ended December 31, 2024 compared to 2023.  The increase was principally due to a $65.5 million increase in segment revenues which were partially offset by a $12.6 million increase in water service-related expenses and a $10.9 million increase in income tax expense.  Expenses are discussed further above under “Results of Operations — Consolidated.”\nNon-GAAP Performance Measures\n \nIn addition to amounts presented in accordance with GAAP, we also present certain supplemental non-GAAP performance measurements.  These measurements are not to be considered more relevant or accurate than the measurements presented in accordance with GAAP.  In compliance with the requirements of the SEC, our non-GAAP measurements are reconciled to net income, the most directly comparable GAAP performance measure.  For all non-GAAP measurements, neither the SEC nor any other regulatory body has passed judgment on these non-GAAP measurements.\n27\nTable of \nContents\nEBITDA, Adjusted EBITDA and Free Cash Flow\nEBITDA is a non-GAAP financial measurement of earnings before interest expense, taxes, depreciation, depletion and amortization.  The purpose of presenting EBITDA is to highlight earnings without finance, taxes, and depreciation, depletion and amortization expense, and its use is limited to specialized analysis.  We calculate Adjusted EBITDA as EBITDA plus employee share-based compensation and less pension curtailment and settlement gain.  The pension curtailment and settlement gain is related to a buyout by a third party of defined benefit obligations under our pension plan and the subsequent freezing of our pension plan, both of which occurred in the fourth quarter of 2024.  We have excluded the pension curtailment and settlement gain from the calculation of Adjusted EBITDA as such gain is a non-recurring item and is not related to our core business.  The purpose of presenting Adjusted EBITDA is to highlight earnings without non-cash activity such as share-based compensation and other non-recurring or unusual items, if applicable.  We calculate free cash flow as Adjusted EBITDA less current income tax expense and capital expenditures.  The purpose of presenting free cash flow is to provide an additional measure of operating performance.  We have presented EBITDA, Adjusted EBITDA and free cash flow because we believe that these metrics are useful supplements to net income in analyzing the Company's operating performance.  Our definitions of EBITDA, Adjusted EBITDA and free cash flow may differ from computations of similarly titled measures of other companies.\nThe following table presents a reconciliation of EBITDA, Adjusted EBITDA and free cash flow to net income for the years ended December 31, 2024 and 2023 (in thousands):\nYears Ended December 31,\n2024\n2023\n Net income \n$\n453,960 \n$\n405,645 \n Add: \nIncome tax expense \n124,861 \n111,916 \nDepreciation, depletion and amortization\n25,162 \n14,757 \n EBITDA \n603,983 \n532,318 \n Add (deduct):\nEmployee share-based compensation\n11,364 \n9,124 \nPension curtailment and settlement gain\n(4,616)\n— \nAdjusted EBITDA\n610,731 \n541,442 \nDeduct:\nCurrent income tax expense\n(120,257)\n(110,517)\nCapital expenditures\n(29,423)\n(15,431)\nFree Cash Flow\n$\n461,051 \n$\n415,494 \nOff-Balance Sheet Arrangements\nThe Company has not engaged in any off-balance sheet arrangements.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities at the date of the financial statements.  It is our opinion that we fully disclose our significant accounting policies in the notes to the consolidated financial statements.  Consistent with our disclosure policies, we include the following discussion related to what we believe to be our most critical accounting policies that require our most difficult, subjective or complex judgment and estimates.\n \nAccrual of Oil and Gas Royalties\n \nThe Company accrues oil and gas royalties.  An accrual is necessary due to the time lag between the removal of crude oil and natural gas products from the respective mineral reserve locations and generation of the actual payment by operators.  The oil and gas royalty accrual is based upon historical production volumes, estimates of the timing of future payments and recent market prices for oil and gas.  \n \n28\nTable of \nContents\nRecent Accounting Pronouncements\nFor further information regarding recently issued accounting pronouncements, see Note 2, “Summary of Significant Accounting Policies” in the notes to our consolidated financial statements included under Part II, Item 8. “Financial Statements and Supplementary Data.”",
  "item2": null
}