{
  "item1": "Texas Pacific Land Corporation (which, together its subsidiaries context requires, may referred “TPL,” “Company,” “our,” “we,” “us”) Delaware Corporation one largest landowners State Texas approximately 873,000 surface acres land, principally concentrated Permian Basin. Additionally, own 1/128th nonparticipating perpetual oil gas royalty interest (“NPRI”) under approximately 85,000 acres land, 1/16th NPRI under approximately 371,000 acres land, approximately 16,000 additional net royalty acres (normalized 1/8th) (“NRA”), collective total approximately 207,000 NRA, principally concentrated Permian Basin. Company originally organized Texas Pacific Land Trust (the “Trust”) under Declaration Trust, dated February 1, 1888 (the “Declaration Trust”), receive hold title extensive tracts land State Texas, previously property Texas Pacific Railway Company. Declaration Trust provided appointment trustees (the “Trustees”) manage assets Trust all powers absolute owner.",
  "item7": "Year Ended December 31, 2023 Consolidated Revenues Net Income: Total revenues increased $74.2 million, 11.8%, $705.8 million year ended December 31, 2024 compared $631.6 million year ended December 31, 2023. increase principally due $38.5 million increase water sales, $19.9 million increase produced water royalties $15.9 million increase oil gas royalty revenue 2024 over 2023. Individual revenue line items discussed below under “Segment Results Operations.” Net income $454.0 million year ended December 31, 2024 11.9% higher than 2023, principally result increase total revenues, partially offset increase operating expenses, discussed below. Consolidated Expenses: Salaries related employee expenses .",
  "item2": "Texas Pacific Land Corporation (which, together its subsidiaries context requires, may referred “TPL”, “Company”, “our”, “we” “us”) Delaware corporation one largest landowners State Texas approximately 882,000 surface acres land, principally concentrated Permian Basin. Additionally, own 1/128th nonparticipating perpetual oil gas royalty interest (“NPRI”) under approximately 85,000 acres land, 1/16th NPRI under approximately 371,000 acres land, approximately 16,000 additional net royalty acres (normalized 1/8th) (“NRA”), collective total approximately 207,000 NRA, principally concentrated Permian Basin. Company originally organized under Declaration Trust, dated February 1, 1888, receive hold title extensive tracts land State Texas, previously property Texas Pacific Railway Company. completed reorganization January 11, 2021 business trust, Texas Pacific Land Trust, into Texas Pacific Land Corporation."
}