{
  "source_file": "tpl-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nCautionary Statement Regarding Forward-Looking Statements\nStatements in this Quarterly Report on Form 10-Q (this “Quarterly Report”) that are not purely historical are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended (the “Securities Act”), and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), including statements regarding management\n’\ns expectations, hopes, intentions or strategies regarding the future.  Words or phrases such as “expects,” “anticipates,” “could,” “will,” “intends,” “may,” “might,” “plan,” “potential,” “should,” “would,” “believes” or similar expressions or the negative of such terms, when used in this Quarterly Report or other filings with the Securities and Exchange Commission (the “SEC”), are intended to identify “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995.  Forward-looking statements include, but are not limited to, statements regarding the Company’s future operations and prospects, the markets for real estate in the areas in which the Company owns real estate, applicable zoning regulations, the markets for oil and gas including actions of other oil and gas producers or consortiums worldwide such as the Organization of Petroleum Exporting Countries (“OPEC”) and Russia (collectively referred to as “OPEC+”), expected competition, management’s intent, beliefs or current expectations with respect to the Company’s future financial performance and other matters.  All forward-looking statements in this Quarterly Report are based on information available to us, and speak only, as of the date this Quarterly Report is filed with the SEC, and we assume no responsibility to update any such forward-looking statements, except as required by law.  All forward-looking statements are subject to a number of risks, uncertainties and other factors that could cause our actual results, performance, prospects or opportunities to differ materially from those expressed in, or implied by, these forward-looking statements.  These risks, uncertainties and other factors include, but are not limited to, the factors discussed in Part I, Item 1A. “Risk Factors” in\n \nour Annual Report\n \non Form 10-K\n \nfor the year ended December 31, 2024 (the “2024 Annual Report”), and in Part I, Item 2. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and Part II, Item 1A. “Risk Factors” of this Quarterly Report.\nThe following discussion and analysis should be read in conjunction with our 2024 Annual Report filed with the SEC on February 19, 2025 and the condensed consolidated financial statements and accompanying notes included in Part I, Item 1 of this Quarterly Report.  Period-to-period comparisons of financial data are not necessarily indicative, and therefore, should not be relied upon as indicators, of the Company’s future performance.\nOverview\n  \nTexas Pacific Land Corporation (which, together with its subsidiaries as the context requires, may be referred to as “TPL”, the “Company”, “our”, “we” or “us”) is a Delaware corporation and one of the largest landowners in the State of Texas with approximately 882,000 surface acres of land, principally concentrated in the Permian Basin.  Additionally, we own a 1/128th nonparticipating perpetual oil and gas royalty interest (“NPRI”) under approximately 85,000 acres of land, a 1/16th NPRI under approximately 371,000 acres of land, and approximately 16,000 additional net royalty acres (normalized to 1/8th) (“NRA”), for a collective total of approximately 207,000 NRA, principally concentrated in the Permian Basin.\nThe Company was originally organized under a Declaration of Trust, dated February 1, 1888, to receive and hold title to extensive tracts of land in the State of Texas, previously the property of the Texas and Pacific Railway Company.  We completed our reorganization on January 11, 2021 from a business trust, Texas Pacific Land Trust, into Texas Pacific Land Corporation.\nWe are not an oil and gas producer.  Our business activity is generated from surface and royalty interest ownership, primarily in the Permian Basin.  Our revenues are derived from oil and gas royalties, water sales, produced water royalties, easements and other surface-related income and land sales.  Due to the nature of our operations and concentration of our ownership in one geographic location, our revenue and net income are subject to substantial fluctuations from quarter to quarter and year to year.  In addition to fluctuations in response to changes in the market price for oil and gas, our financial results are also subject to decisions by not only the owners and operators of the oil and gas wells to which our oil and gas royalty interests relate, but also to other owners and operators in the Permian Basin as it relates to our other revenue streams, principally water sales, produced water royalties, easements, and other surface-related revenue.\nFor a detailed overview of our business and business segments, see Part I, Item 1. “Business — General” in our 2024 Annual Report.\n18\nTable of Contents\nMarket Conditions\nAverage WTI oil prices for the nine months ended September 30, 2025 were down approximately 14% compared to average oil prices during the same period last year.  Oil prices continue to be impacted by certain actions by OPEC+, geopolitics, and evolving global supply and demand trends, among other factors.  In addition, ambiguity around tariffs implemented by and towards the United States has created incremental global economic uncertainty, which has, in part, contributed to relatively weaker oil prices in 2025 to-date.  Average Henry Hub natural gas prices during 2025 have increased approximately 64% compared to average prior year natural gas prices.  Global and domestic natural gas markets have benefited from improved supply-demand balances, including tailwinds from expanded liquefied natural gas capacity and improved industrial and power demand, among other factors.  Since mid-2022, the Waha Hub located in Pecos County, Texas has at times experienced significant negative price differentials relative to Henry Hub, located in Erath, Louisiana, due in part to growing local Permian natural gas production and limited natural gas pipeline takeaway capacity.  Midstream infrastructure is currently being developed by operators to provide additional takeaway capacity, though the impact on future basis differentials will be dependent on future natural gas production and other factors.  Changes in global and domestic macro-economic conditions could result in additional shifts in oil and gas supply and demand in future periods.  Although our revenues are directly and indirectly impacted by oil and natural gas prices, we believe our royalty interests (which require no capital expenditures or operating expense burden from us for well development), strong balance sheet, and liquidity position will help us navigate through potential commodity price volatility.\nPermian Basin Activity\nThe Permian Basin is one of the oldest and most well-known hydrocarbon-producing areas and currently accounts for a substantial portion of oil and gas production in the United States, covering approximately 86,000 square miles across southeastern New Mexico and western Texas.  Exploration and production (“E&P”) companies operating in the Permian Basin continue to maintain robust drilling and development activity.  Per the U.S. Energy Information Administration, Permian production is currently in excess of 6.6 million barrels per day, which is higher than the average daily production in this region for any year prior to 2025.\nDue to our ownership concentration in the Permian Basin, our revenues are directly impacted by oil and gas pricing and drilling activity in the Permian Basin.  Below are metrics for the three and nine months ended September 30, 2025 and 2024:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nOil and Gas Pricing Metrics:\n (1)\nWTI Cushing oil average price per bbl\n$\n65.78 \n$\n76.43 \n$\n67.31 \n$\n78.58 \nHenry Hub natural gas average price per mmbtu\n$\n3.03 \n$\n2.11 \n$\n3.45 \n$\n2.11 \nWaha Hub natural gas average price per mmbtu\n$\n0.52 \n$\n(0.50)\n$\n1.16 \n$\n(0.02)\nActivity Metrics specific to the Permian Basin:\n (1)(2)\nAverage monthly horizontal permits\n589\n683\n601\n655\nAverage monthly horizontal wells drilled\n428\n492\n467\n506\nAverage weekly horizontal rig count\n238\n294\n267\n299\nDUCs as of September 30 for each applicable year\n3,992\n4,491\n3,992\n4,491\nTotal Average U.S. weekly horizontal rig count\n (2)\n475\n521\n505\n560\n(1)   Commonly used definitions in the oil and gas industry provided in the table above are defined as follows:  WTI Cushing represents West Texas Intermediate.  Bbl represents one barrel of 42 U.S. gallons of oil.  Mmbtu represents one million British thermal units, a measurement used for natural gas.  Waha Hub natural gas pricing data per Bloomberg.  DUCs represent drilled but uncompleted wells.  DUC classification is based on well data and date stamps provided by Enverus.  DUCs are based on wells that have a drilled/spud date stamp but do not have a completed or first production date stamp.  Excludes wells that have been labeled plugged and abandoned or permit expired and wells drilled/spud more than five years ago.\n19\nTable of Contents\n(2)    Permian Basin specific information per Enverus analytics.  U.S. weekly horizontal rig counts per Baker Hughes United States Rotary Rig Count for horizontal rigs.  Statistics for similar data are also available from other sources.  The comparability between these other sources and the sources used by the Company may differ.\nThe metrics above show selected domestic benchmark oil and natural gas prices and approximate activity levels in the Permian Basin for the three and nine months ended September 30, 2025 and 2024.  While average oil prices for the nine months ended September 30, 2025 decreased compared to the same period in 2024, average Henry Hub and Waha natural gas prices for the nine months ended September 30, 2025 increased compared to the same period in 2024.  E&P companies broadly have continued to deploy capital towards drilling and development activities in the Permian Basin at a measured pace.  As we are a significant landowner in the Permian Basin and not an oil and gas producer, our revenue is affected by the development decisions made by companies that operate in the areas where we own royalty interests and land.  Accordingly, these decisions made by others affect, both directly and indirectly, our oil and gas royalties, produced water royalties, water sales, and other surface-related income.\nLiquidity\n \nand Capital Resources\nOverview\nOur principal sources of liquidity are cash and cash flows generated from our operations and a revolving credit facility, which closed on October 23, 2025.  Our primary liquidity and capital requirements are for acquisitions, capital expenditures related to our Water Services and Operations segment, working capital and general business needs.\nWe continuously review our levels of liquidity and capital resources.  If market conditions were to change and our revenues were to decline significantly or our operating costs were to increase significantly, our cash flows and liquidity could be reduced.  Should this occur, we could seek alternative sources of funding.  As of September 30, 2025, we had no debt or any off-balance sheet arrangements. \nAs we evaluate our current capital structure, capital allocation priorities, business fundamentals, and investment opportunities, we have set a target cash and cash equivalents balance of approximately $700 million.  Above this target, we will seek to deploy the majority of our free cash flow towards returning capital to our stockholders in the form of special dividends and share repurchases.  As of September 30, 2025, we had cash and cash equivalents of $531.8 million that we expect to utilize, along with cash flow from operations, to provide capital to support our business, to pay regular dividends subject to the discretion of our board of directors (the “Board”), to, subject to market conditions, repurchase shares of our common stock, par value $0.01 per share (the “Common Stock”), for potential acquisitions and for general corporate purposes.\n Acquisition Activity\nIn September 2025, we acquired approximately 8,147 acres of land in Martin, County Texas for an aggregate purchase price, inclusive of closing costs, of $31.4 million in an all-cash transaction. \nOn November 3, 2025, we acquired approximately 17,306 NRA located primarily in the Midland basin in Martin, Howard, Midland, and other counties for an aggregate purchase price of $474.1 million.  A deposit for the acquisition of $71.1 million was held in escrow as of September 30, 2025. The final purchase price and acreage interests are subject to customary closing conditions and adjustments.\nRevolving Credit Facility\nOn October 23, 2025, the Company entered into a credit agreement among the Company, as the borrower, Wells Fargo Bank, National Association, as administrative agent and an L/C issuer (the “Administrative Agent”), and the other lenders from time to time party thereto (collectively with the Administrative Agent in its capacity as a lender, the “Lenders”), which provides for a revolving credit facility (the “Credit Facility”) in the aggregate principal amount of up to $500.0 million, and the ability to request potential increases in the commitments of the lenders of up to an additional $250.0 million; provided that any such request for an increase must be in a minimum amount of $50.0 million or, if less, the amount remaining available for all such increases.  The Credit Facility and all borrowings thereunder will mature on October 23, 2029.\n20\nTable of Contents\nThe borrowings under the Credit Facility will bear interest at a rate per annum (i) for each SOFR loan, equal to term SOFR for such interest period plus (x) 2.25% if the Company’s consolidated total leverage ratio is less than or equal to 2.0 to 1.0 or (y) 2.50% if the Company’s consolidated total leverage ratio is greater than 2.0 to 1.0 or (ii) for each base rate loan, equal to the base rate plus (x) 1.25% if the Company’s consolidated total leverage ratio is less than or equal to 2.0 to 1.0 or (y) 1.50% if the Company’s consolidated total leverage ratio is greater than 2.0 to 1.0.  The base rate for any day is a fluctuating rate per annum equal to the highest of (a) the federal funds rate plus 1/2 of 1%, (b) the rate of interest per annum publicly announced by the Administrative Agent as its prime rate, and (c) term SOFR for a one-month tenor in effect on such day plus 1.00%.  The Company is also required to pay customary letter of credit fees.\nWe intend to draw on the facility primarily for capital expenditures, ongoing working capital, acquisitions and general corporate purposes.  Borrowings under the Credit Facility will be unsecured with a springing security interest in substantially all equity securities of the Company’s subsidiaries in the event the Company’s consolidated total leverage ratio exceeds 2.50 to 1.0.  The Credit Facility also contains customary financial and other affirmative and negative covenants.\nThe events of default under the Credit Agreement include, among others, payment defaults, breaches of covenants, defaults under the related loan documents, material misrepresentations, cross defaults with certain other material indebtedness, bankruptcy and insolvency events, judgment defaults, certain events related to plans subject to the Employee Retirement Income Security Act of 1974, as amended, invalidity of the Credit Agreement or the related loan documents and change in control events.  The occurrence of an event of default could result in the termination of commitments and letter of credit extensions, the acceleration of the Company’s obligations under the Credit Agreement, the requirement to post cash collateral with respect to letters of credit and the exercise of the Lenders of all rights and remedies under the Credit Agreement.\n \nDraws on the Credit Facility will be repaid with cashflows generated from our operations.  We believe that cash from operations and our cash and cash equivalents balance, together with our revolving Credit Facility will be sufficient to meet ongoing capital expenditures, working capital requirements, and other cash needs and allow for opportunistic transactions for at least the next 12 months.  The Credit Facility remains undrawn as of November 5, 2025.\nReturn of Capital to Stockholders\nDuring the nine months ended September 30, 2025, we paid $111.0 million in dividends to our stockholders.  In addition, during nine months ended September 30, 2025, we repurchased $8.4 million of our Common Stock (including share repurchases not settled at the end of the period).\nDevelopment of New Solutions for Produced Water and Capital Expenditures\nIn 2024, we announced our progress towards developing a patented, energy-efficient, desalination and treatment process and associated equipment that can recycle produced water into fresh water with quality standards appropriate for surface discharge and beneficial reuse.  With the Permian Basin generating over 20 million barrels of produced water per day, this technology provides an attractive and critical alternative to subsurface injection.  We have begun construction of our facility, which will have an initial capacity of 10,000 barrels of water per day, with estimated service date by the end of 2025.  Cumulatively through September 30, 2025, we have spent $24.0 million ($12.1 million during the nine months ended September 30, 2025) on this new energy-efficient desalination and treatment process and equipment, of which $18.0 million has been capitalized as of September 30, 2025. \nAdditionally, during the nine months ended September 30, 2025, we invested approximately $14.1 million to enhance our water sourcing assets. \nCash Flows from Operating Activities\nFor the nine months ended September 30, 2025 and 2024, cash provided by operating activities was $432.2 million and $364.1 million, respectively.  Our cash flow provided by operating activities is primarily from oil, gas and produced water royalties, water and land sales, easements, and other surface-related income.  Cash flows used in operations generally consist of operating expenses associated with our revenue streams, general and administrative expenses and income taxes. \nThe increase in cash flows provided by operating activities for the nine months ended September 30, 2025 compared to the same period of 2024 was primarily driven by an increase in operating income and changes in working capital requirements during 2025 as compared to 2024.\n \n21\nTable of Contents\nCash Flows Used in Investing Activities \nFor the nine months ended September 30, 2025 and 2024, cash used in investing activities was $137.6 million and $225.8 million, respectively.  Our cash flows used in investing activities are primarily related to acquisitions and purchases of fixed assets primarily related to our Water Services and Operations segment.  Our acquisitions may include land, royalty interests and other similar tangible and intangible assets.\nFor the nine months ended September 30, 2025 and 2024, the cash flows used for acquisitions totaled $110.6 million, including a deposit for an acquisition, and $209.3 million, respectively.  For further information regarding acquisitions of royalty interests and acquisitions of land, see Note 4, “Oil and Gas Royalty Interests” and Note 5, “Real Estate Activity,” respectively, in the notes to the condensed consolidated financial statements in this Quarterly Report.  Purchases of fixed assets for the nine months ended September 30, 2025 increased $14.4 million compared to the same period of 2024 principally related to increased fixed asset purchases to maintain and enhance our water sourcing assets and office tenant improvements.  This activity was partially offset by a $3.9 million post-close adjustment from the seller of oil and gas interests we acquired in 2024 related to curative title defects.\nCash Flows Used in Financing Activities\nFor the nine months ended September 30, 2025 and 2024, cash used in financing activities was $134.2 million and $335.0 million, respectively.  Our cash flows used in financing activities primarily consist of activities that return capital to our stockholders, such as payments of dividends and repurchases of our Common Stock.\nDuring the nine months ended September 30, 2025 and 2024, we paid total dividends of $111.0 million and $310.6 million, respectively.  During the nine months ended September 30, 2025 and 2024, employees surrendered $14.8 million and $1.6 million in shares, respectively, to the Company to settle tax withholdings related to stock vesting.  During the nine months ended September 30, 2025 and 2024, we repurchased $8.4 million and $22.8 million shares, respectively, of our Common Stock (including share repurchases not settled at the end of the period).\n22\nTable of Contents\nResults of Operations\nThe following tables show our consolidated results of operations and our results of operations by reportable segment for Land and Resource Management (“LRM”) and Water Service and Operations (“WSO”) for the three and nine months ended September 30, 2025 and 2024 (in thousands):\n \nThree Months Ended September 30,\n \n2025\n2024\nLRM\nWSO\nConsolidated\nLRM\nWSO\nConsolidated\nRevenues:\nOil and gas royalties\n$\n108,705 \n$\n— \n$\n108,705 \n$\n94,444 \n$\n— \n$\n94,444 \nWater sales\n— \n44,578 \n44,578 \n— \n36,211 \n36,211 \nProduced water royalties\n— \n32,268 \n32,268 \n— \n27,727 \n27,727 \nEasements and other surface-related income\n12,741 \n3,974 \n16,715 \n11,303 \n2,977 \n14,280 \nLand sales\n819 \n— \n819 \n901 \n— \n901 \nTotal revenues\n122,265 \n80,820 \n203,085 \n106,648 \n66,915 \n173,563 \nExpenses:\nSalaries and related employee expenses\n7,298 \n7,089 \n14,387 \n7,182 \n6,848 \n14,030 \nWater service-related expenses\n— \n16,428 \n16,428 \n— \n11,731 \n11,731 \nGeneral and administrative expenses\n3,431 \n2,160 \n5,591 \n10,359 \n2,161 \n12,520 \nDepreciation, depletion and amortization\n10,453 \n4,510 \n14,963 \n2,135 \n3,627 \n5,762 \nAd valorem and other taxes\n2,614 \n11 \n2,625 \n2,189 \n— \n2,189 \nTotal operating expenses\n23,796 \n30,198 \n53,994 \n21,865 \n24,367 \n46,232 \nOperating income\n98,469 \n50,622 \n149,091 \n84,783 \n42,548 \n127,331 \nOther income, net\n4,827 \n1,261 \n6,088 \n6,446 \n1,640 \n8,086 \nIncome before income taxes\n103,296 \n51,883 \n155,179 \n91,229 \n44,188 \n135,417 \nIncome tax expense\n22,536 \n11,405 \n33,941 \n19,359 \n9,464 \n28,823 \nNet income\n$\n80,760 \n$\n40,478 \n$\n121,238 \n$\n71,870 \n$\n34,724 \n$\n106,594 \n23\nTable of Contents\n \nNine Months Ended September 30,\n \n2025\n2024\nLRM\nWSO\nConsolidated\nLRM\nWSO\nConsolidated\nRevenues:\nOil and gas royalties\n$\n314,956 \n$\n— \n$\n314,956 \n$\n276,377 \n$\n— \n$\n276,377 \nWater sales\n— \n108,968 \n108,968 \n— \n113,987 \n113,987 \nProduced water royalties\n— \n90,705 \n90,705 \n— \n76,034 \n76,034 \nEasements and other surface-related income\n61,568 \n9,595 \n71,163 \n43,643 \n7,853 \n51,496 \nLand sales\n819 \n— \n819 \n2,145 \n— \n2,145 \nTotal revenues\n377,343 \n209,268 \n586,611 \n322,165 \n197,874 \n520,039 \nExpenses:\nSalaries and related employee expenses\n21,727 \n21,304 \n43,031 \n20,127 \n19,135 \n39,262 \nWater service-related expenses\n— \n36,005 \n36,005 \n— \n36,767 \n36,767 \nGeneral and administrative expenses\n10,392 \n6,964 \n17,356 \n21,022 \n6,709 \n27,731 \nDepreciation, depletion and amortization\n27,279 \n13,324 \n40,603 \n3,641 \n10,054 \n13,695 \nAd valorem and other taxes\n6,667 \n34 \n6,701 \n5,988 \n2 \n5,990 \nTotal operating expenses\n66,065 \n77,631 \n143,696 \n50,778 \n72,667 \n123,445 \nOperating income\n311,278 \n131,637 \n442,915 \n271,387 \n125,207 \n396,594 \nOther income, net\n12,399 \n3,250 \n15,649 \n25,390 \n5,859 \n31,249 \nIncome before income taxes\n323,677 \n134,887 \n458,564 \n296,777 \n131,066 \n427,843 \nIncome tax expense\n70,804 \n29,730 \n100,534 \n63,807 \n28,436 \n92,243 \nNet income\n$\n252,873 \n$\n105,157 \n$\n358,030 \n$\n232,970 \n$\n102,630 \n$\n335,600 \nConsolidated Results of Operations \nFor the Three Months Ended September 30, 2025 as Compared to the Three Months Ended September 30, 2024\nTotal revenues were $203.1 million for the three months ended September 30, 2025 compared to $173.6 million for the three months ended September 30, 2024.  Total operating expenses were $54.0 million for the three months ended September 30, 2025 compared to $46.2 million for the three months ended September 30, 2024.  Net income was $121.2 million for the three months ended September 30, 2025 compared to $106.6 million for the three months ended September 30, 2024.  Individual revenue and expense line items are discussed below under “Segment Results of Operations.”\n \nFor the Nine Months Ended September 30, 2025 as Compared to the Nine Months Ended September 30, 2024\nTotal revenues were $586.6 million for the nine months ended September 30, 2025 compared to $520.0 million for the nine months ended September 30, 2024.  Total operating expenses were $143.7 million for the nine months ended September 30, 2025 compared to $123.4 million for the nine months ended September 30, 2024.  Net income was $358.0 million for the nine months ended September 30, 2025 compared to $335.6 million for the three months ended September 30, 2024.  Individual revenue and expense line items are discussed below under “Segment Results of Operations.” \nSegment Results of Operations\nWe operate our business in two reportable segments: Land and Resource Management and Water Services and Operations.  We eliminate any inter-segment revenues and expenses upon consolidation.\nWe evaluate the performance of our operating segments separately to monitor the different factors affecting financial results.  The reportable segments presented are consistent with our reportable segments discussed in Note 14, “Business Segment Reporting” in the notes to the condensed consolidated financial statements in this Quarterly Report.  We monitor our reporting segments based upon net income calculated in accordance with accounting principles generally accepted in the United States of America (“GAAP”).\nAs discussed in “Market Conditions” and “Permian Basin Activity” above, our segment revenues are directly influenced by development decisions made by our customers and the overall activity level in the Permian Basin.  Accordingly, \n24\nTable of Contents\nour segment revenues, sales volumes and associated expenses, as further discussed below, fluctuate from period to period based upon those decisions and activity levels.\nFor the Three Months Ended September 30, 2025 as Compared to the Three Months Ended September 30, 2024\nLand and Resource Management\nOil and gas royalties. \n Oil and gas royalty revenue was $108.7 million for the three months ended September 30, 2025 compared to $94.4 million for the three months ended September 30, 2024, an increase of $14.3 million.  Our share of production increased to 36.3 thousand barrels of oil equivalent (“Boe”) per day for the three months ended September 30, 2025 compared to 28.3 thousand Boe per day for the same period of 2024.  The average realized price decreased 10.4% to $34.10 per Boe for the three months ended September 30, 2025 from $38.04 per Boe for the three months ended September 30, 2024.\nThe financial and operational data by royalty stream is presented in the table below for the three months ended September 30, 2025 and 2024:\nThree Months Ended\nSeptember 30,\n2025\n2024\nOur share of production volumes:\n (1)\nOil (MBbls)\n1,284 \n1,046 \nNatural gas (MMcf)\n6,142 \n4,654 \nNGL (MBbls)\n1,031 \n779 \nEquivalents (MBoe)\n3,338 \n2,600 \nEquivalents per day (MBoe/d)\n36.3 \n28.3 \nOil and gas royalty revenue (in thousands):\nOil royalties\n$\n79,860 \n$\n75,427 \nNatural gas royalties\n11,441 \n4,201 \nNGL royalties\n17,404 \n14,816 \nTotal oil and gas royalties\n$\n108,705 \n$\n94,444 \nRealized prices:\nOil ($/Bbl)\n$\n65.14 \n$\n75.53 \nNatural gas ($/Mcf)\n$\n2.01 \n$\n0.98 \nNGL ($/Bbl)\n$\n18.25 \n$\n20.57 \nEquivalents ($/Boe)\n$\n34.10 \n$\n38.04 \n(1)\nCommonly used definitions in the oil and gas industry not previously defined: MBbls represents one thousand barrels of crude oil, condensate or NGLs.  Mcf represents one thousand cubic feet of natural gas.  MMcf represents one million cubic feet of natural gas.  MBoe represents one thousand Boe.  MBoe/d represents one thousand Boe per day.\nEasements and other surface-related income. \n Easements and other surface-related income was $12.7 million for the three months ended September 30, 2025, compared to $11.3 million for the three months ended September 30, 2024.  Easements and other surface-related income includes revenue related to the use and crossing of our land for oil and gas E&P, renewable energy, and agricultural operations.  The increase in easements and other surface-related income was principally related to increases of $1.6 million in pipeline easements for the three months ended September 30, 2025 compared to the same period of 2024.  The amount of income derived from pipeline easements is a function of the term of the easement, the size of the easement, and the number of easements entered into for any given period.  Easements and other surface-related income is dependent on development decisions made by companies that operate in the areas where we own land and is, therefore, unpredictable and may vary significantly from period to period.  See “Market Conditions” and “Permian Basin Activity” above for additional discussion of development activity in the Permian Basin during the three months ended September 30, 2025.\n25\nTable of Contents\nGeneral and administrative expenses.  \nGeneral and administrative expenses were $3.4 million for the three months ended September 30, 2025 compared to $10.4 million for the comparable period of 2024.  The decrease was primarily due to a decrease in legal and professional fees of $7.0 million over the same time period.\nDepreciation, depletion and amortization\n.  Depreciation, depletion and amortization was $10.5 million for the three months ended September 30, 2025 compared to $2.1 million for the comparable period of 2024.  The increase was principally due to depletion expense associated with royalty interests acquired during the second half of 2024.\nOther income, net\n.  Other income, net was $4.8 million for the three months ended September 30, 2025 compared to $6.4 million for the same period of 2024.  Lower cash balances and investment yields during the three months ended September 30, 2025 compared to the same period of 2024 resulted in a decrease in interest income.\nWater Services and Operations\n \nWater sales\n.  Water sales revenue increased $8.4 million to $44.6 million for the three months ended September 30, 2025, compared to $36.2 million for the same period of 2024.  The increase in water sales was principally due to a 14.3% increase in pricing for the three months ended September 30, 2025, compared to the same period of 2024.  Water sales volumes are dependent upon customer demand in the areas in which we provide water to customers and may fluctuate from period to period.\nProduced water royalties.\n  Produced water royalties are received from the transfer or disposal of produced water on our land and are contractual and not paid as a matter of right.  Produced water royalties are also fee based and not directly impacted by lower commodity prices.  However, indirectly, volumes may vary from period to period depending upon development activity levels and operator decisions involving recycling versus disposal of produced water.  We do not operate any saltwater disposal wells.  Produced water royalties increased to $32.3 million for the three months ended September 30, 2025 compared to $27.7 million for the same period in 2024.  This increase was principally due to increased produced water volumes for the three months ended September 30, 2025 compared to the same period of 2024.\nWater service-related expenses\n.  Water service-related expenses increased $4.7 million to $16.4 million for the three months ended September 30, 2025 compared to the same period of 2024.  Certain types of water-related expenses, including, but not limited to, treatment, transfer, water purchases, repairs and maintenance, equipment rental, and fuel costs, vary from period to period as our customers’ needs and requirements change.  Right of way and other expenses also vary from period to period depending upon location of customer delivery.  The increase in water service-related expenses for the three months ended September 30, 2025 compared to the same period of 2024 was principally related to a $2.5 million increase in right of way expenses and expenses associated with customer delivery.\nDepreciation, depletion and amortization\n.  Depreciation, depletion and amortization was $4.5 million for the three months ended September 30, 2025 compared to $3.6 million for the comparable period of 2024.  The increase was principally due to depreciation expense related to new water service-related assets placed in service.\nFor the Nine Months Ended September 30, 2025 as Compared to the Nine Months Ended September 30, 2024\nLand and Resource Management\nOil and gas royalties\n.  Oil and gas royalty revenue was $315.0 million for the nine months ended September 30, 2025 compared to $276.4 million for the nine months ended September 30, 2024, an increase of $38.6 million.  Our share of production increased to 33.6 thousand Boe per day for the nine months ended September 30, 2025 compared to 26.0 thousand Boe per day for the same period of 2024.  The average realized price decreased 11.3% to $36.01 per Boe for the nine months ended September 30, 2025 from $40.60 per Boe for the same period of 2024.\n26\nTable of Contents\nThe financial and operational data by royalty stream is presented in the table below for the nine months ended September 30, 2025 and 2024:\nNine Months Ended\nSeptember 30,\n2025\n2024\nOur share of production volumes:\nOil (MBbls)\n3,616 \n3,003 \nNatural gas (MMcf)\n17,031 \n12,312 \nNGL (MBbls)\n2,705 \n2,073 \nEquivalents (MBoe)\n9,160 \n7,128 \nEquivalents per day (MBoe/d)\n33.6 \n26.0 \nOil and gas royalty revenue (in thousands):\nOil royalties\n$\n229,932 \n$\n222,788 \nNatural gas royalties\n33,576 \n13,630 \nNGL royalties\n51,448 \n39,959 \nTotal oil and gas royalties\n$\n314,956 \n$\n276,377 \nRealized prices:\nOil ($/Bbl)\n$\n66.59 \n$\n77.68 \nNatural gas ($/Mcf)\n$\n2.13 \n$\n1.20 \nNGL ($/Bbl)\n$\n20.56 \n$\n20.84 \nEquivalents ($/Boe)\n$\n36.01 \n$\n40.60 \nEasements and other surface-related income. \n Easements and other surface-related income was $61.6 million for the nine months ended September 30, 2025, an increase of $17.9 million compared to $43.6 million for the nine months ended September 30, 2024.  Easements and other surface-related income includes revenue related to the use and crossing of our land for oil and gas E&P, renewable energy, and agricultural operations.  The increase in easements and other surface-related income was principally related to increases of $12.1 million in pipeline easements, $3.0 million in wellbore easements and $2.0 million in commercial leases for the nine months ended September 30, 2025 compared to the same period of 2024.  Easements and other surface-related income is dependent on development decisions made by companies that operate in the areas where we own land and is, therefore, unpredictable and may vary significantly from period to period.  See “Market Conditions” and “Permian Basin Activity” above for additional discussion of development activity in the Permian Basin during the nine months ended September 30, 2025.\nSalaries and related employee expenses\n.  Salaries and related employee expenses, which include not only salaries, equity and non-equity incentive compensation, but also employee benefits and contract labor expense, were $21.7 million for the nine months ended September 30, 2025 compared to $20.1 million for the same period of 2024.  The increase in salaries and related employee expenses was principally related to market compensation adjustments that take effect annually at the start of a given year.\nGeneral and administrative expenses.  \nGeneral and administrative expenses were $10.4 million for the\n \nnine months ended September 30, 2025 compared to $21.0 million for the comparable period of 2024.  The decrease was primarily due to a decrease in legal and professional fees of $10.7 million over the same time period.\nDepreciation, depletion and amortization\n.  Depreciation, depletion and amortization was $27.3 million for the nine months ended September 30, 2025 compared to $3.6 million for the comparable period of 2024.  The increase was principally due to depletion expense associated with royalty interests acquired during the second half of 2024.\nOther income, net\n.  Other income, net was $12.4 million for the nine months ended September 30, 2025 compared to $25.4 million for the same period of 2024.  Lower cash balances and investment yields during the nine months ended September 30, 2025 compared to the same period of 2024 resulted in a decrease in interest income.  Additionally, during the \n27\nTable of Contents\nnine months ended September 30, 2024, we received $1.9 million of proceeds from a settlement with a title company regarding a defect in title to property acquired in a prior year.\nWater Services and Operations\nWater sales\n.  Water sales revenue decreased $5.0 million to $109.0 million for the nine months ended September 30, 2025 compared to the same period of 2024.  The decrease in water sales was principally due to a decrease of 7.5% in water sales volumes, which was partially offset by an increase in pricing for the nine months ended September 30, 2025 compared to the same period of 2024.  Water sales volumes are dependent upon customer demand in the areas in which we provide water to customers and may fluctuate from period to period.\nProduced water royalties.  \nProduced water royalties are royalties received from the transfer or disposal of produced water on our land and are contractual and not paid as a matter of right.  Produced water royalties are also fee based and not directly impacted by lower commodity prices.  However, indirectly, volumes may vary from period to period depending upon development activity levels and operator decisions involving recycling versus disposal of produced water.  We do not operate any saltwater disposal wells.  Produced water royalties increased to $90.7 million for the nine months ended September 30, 2025 compared to $76.0 million for the comparable period of 2024.  The increase in produced water royalties was principally due to increased produced water volumes for the nine months ended September 30, 2025 compared to the same period of 2024.\nSalaries and related employee expenses\n.  Salaries and related employee expenses, which include not only salaries, equity and non-equity incentive compensation, but also employee benefits and contract labor expense, were $21.3 million for the nine months ended September 30, 2025 compared to $19.1 million for the same period of 2024.  The increase in salaries and related employee expenses is principally related to increased contract labor costs associated with development of an in-house water management application and market compensation adjustments that take effect annually at the start of the year.\nDepreciation, depletion and amortization\n.  Depreciation, depletion and amortization was $13.3 million for the nine months ended September 30, 2025 compared to $10.1 million for the comparable period of 2024.  The increase was principally due to depreciation expense related to new water service-related assets placed in service.\nOther income, net\n.  Other income, net was $3.3 million for the nine months ended September 30, 2025 compared to $5.9 million for the same period of 2024.  Lower cash balances and investment yields during the nine months ended September 30, 2025 compared to the same period of 2024 resulted in a decrease in interest income.\nNon-GAAP Performance Measures\n \nIn addition to amounts presented in accordance with GAAP, we also present certain supplemental non-GAAP performance measurements.  These measurements are not to be considered more relevant or accurate than the measurements presented in accordance with GAAP.  In compliance with the requirements of the SEC, our non-GAAP measurements are reconciled to net income, the most directly comparable GAAP performance measure.  For all non-GAAP measurements, neither the SEC nor any other regulatory body has passed judgment on these non-GAAP measurements.\nEBITDA, Adjusted EBITDA and Free Cash Flow\nEBITDA is a non-GAAP financial measurement of earnings before interest expense, taxes, depreciation, depletion and amortization.  The purpose of presenting EBITDA is to highlight earnings without finance, taxes, and depreciation, depletion and amortization expense, and its use is limited to specialized analysis.\nThe purpose of presenting Adjusted EBITDA is to highlight earnings without non-cash activity such as share-based compensation and other non-recurring or unusual items, if applicable.  Additionally, Adjusted EBITDA is a metric used by the compensation committee of our Board to evaluate the Company’s performance in determining the short-term and long-term incentive compensation of our Named Executive Officers on an annual basis.  We calculate Adjusted EBITDA as EBITDA plus employee share-based compensation.\nThe purpose of presenting free cash flow is to provide investors a metric to measure the funds available for investing in future acquisitions and returning capital to our stockholders through dividends and share repurchases after current income tax expense and purchases of fixed assets.  Additionally, free cash flow is a metric used by the compensation committee of our Board to evaluate the Company’s performance in determining the short-term and long-term incentive compensation of our Named Executive Officers.  To calculate free cash flow, net income is adjusted by the same items discussed above for EBITDA and Adjusted EBITDA and then further adjusted by deducting current income tax expense and purchases of fixed assets.\n28\nTable of Contents\nWe have presented EBITDA, Adjusted EBITDA and free cash flow because we believe that these metrics are useful supplements to net income in analyzing the Company’s operating performance, ability to fund future acquisitions, ability to return capital to our stockholders and explaining how our Named Executive Officers are compensated.  Our definitions of EBITDA, Adjusted EBITDA and free cash flow may differ from computations of similarly titled measures of other companies.\nThe following table presents a reconciliation of net income to EBITDA and Adjusted EBITDA for the three and nine months ended September 30, 2025 and 2024 (in thousands):\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n Net income \n$\n121,238 \n$\n106,594 \n$\n358,030 \n$\n335,600 \n Add: \nIncome tax expense \n33,941 \n28,823 \n100,534 \n92,243 \nDepreciation, depletion and amortization\n14,963 \n5,762 \n40,603 \n13,695 \n EBITDA \n170,142 \n141,179 \n499,167 \n441,538 \n Add: \nEmployee share-based compensation\n3,493 \n2,935 \n10,061 \n7,855 \nAdjusted EBITDA\n$\n173,635 \n$\n144,114 \n$\n509,228 \n$\n449,393 \nThe following table presents a reconciliation of net income to free cash flow for the three and nine months ended September 30, 2025 and 2024 (in thousands):\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\n Net income \n$\n121,238 \n$\n106,594 \n$\n358,030 \n$\n335,600 \n Add (deduct): \nIncome tax expense \n33,941 \n28,823 \n100,534 \n92,243 \nDepreciation, depletion and amortization\n14,963 \n5,762 \n40,603 \n13,695 \nEmployee share-based compensation\n3,493 \n2,935 \n10,061 \n7,855 \nCurrent income tax expense\n(30,166)\n(27,416)\n(95,430)\n(90,080)\nPurchases of fixed assets\n(18,601)\n(7,829)\n(30,878)\n(16,451)\nDecrease in accounts payable related to purchases of fixed assets\n(2,005)\n(2,004)\n(3,444)\n(5,543)\nFree cash flow\n$\n122,863 \n$\n106,865 \n$\n379,476 \n$\n337,319 \nCritical Accounting Policies and Estimates\nThis discussion and analysis of our financial condition and results of operations is based on our condensed consolidated financial statements, which have been prepared in accordance with GAAP.  The preparation of these financial statements requires us to make judgments, estimates and assumptions that affect the reported amounts of assets, liabilities, revenues, expenses and disclosures of contingent assets and liabilities.  For a full discussion of our accounting policies refer to Note 2 to the consolidated financial statements included in our 2024 Annual Report.\nThere have been no material changes to our critical accounting policies or in the estimates and assumptions underlying those policies, from those provided in Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in our 2024 Annual Report.\n29\nTable of Contents\nRecent Accounting Pronouncements\nFor further information regarding recently issued accounting pronouncements, see Note 2, “Summary of Significant Accounting Policies” in the notes to the condensed consolidated financial statements included in Part I, \nItem 1. “Financial Statements”\n in this Quarterly Report."
}