{
  "source_file": "tpr-20250628.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nTapestry, Inc. (the \"Company\") is a house of iconic accessories and lifestyle brands. Our global house of brands unites the magic of Coach and kate spade new york. Each of our brands are unique and independent, while sharing a commitment to innovation and authenticity defined by distinctive products and differentiated customer experiences across channels and geographies. We use our collective strengths to move our customers and empower our communities, to make the fashion industry more sustainable, and to harness the power of an inclusive culture. Individually, our brands are iconic. Together, we can stretch what’s possible.\nOUR BRANDS\nThe Company has three reportable segments:\n•\nCoach \n-\n \nCoach is a global fashion house of accessories and lifestyle collections, founded in New York City in 1941. Inspired by the vision of Expressive Luxury and the inclusive and courageous spirit of its hometown, the brand makes beautiful things, crafted to last – for you to be yourself in. Coach has built a legacy of craftsmanship and a community that champions the courage to be real. Coach includes global sales of primarily Coach brand products to customers through our direct-to-consumer (\"DTC\"), wholesale and licensing businesses. This segment represented 79.9% of total net sales in fiscal 2025.\n•\nKate Spade \n- Since its launch in 1993 with a collection of six essential handbags, kate spade new york has always been colorful, bold and optimistic. Today, it is a global lifestyle brand that designs extraordinary things for the everyday, delivering seasonal collections of handbags, ready-to-wear, jewelry, footwear, gifts, home décor and more. Known for its rich heritage and unique brand DNA, kate spade new york offers a distinctive point of view and celebrates communities of women around the globe who live their perfectly imperfect lifestyles. Kate Spade includes global sales of primarily kate spade new york brand products to customers through our DTC, wholesale and licensing businesses. This segment represented 17.1% of total net sales in fiscal 2025.\n•\nStuart Weitzman \n- Since 1986, New York City based global luxury footwear brand Stuart Weitzman has combined its signature artisanal craftsmanship and precise engineering to empower women to stand strong. Having perfected the art of shoemaking for nearly 40 years, the brand continues to expand its assortment to feature handbags and men's footwear, all the while staying true to its ethos of inspiring strength and confidence with every step. Stuart Weitzman includes global sales of primarily Stuart Weitzman brand products to customers through our DTC, wholesale and licensing businesses. This segment represented 3.0% of total net sales in fiscal 2025.\nIn addition to these reportable segments, the Company has certain corporate expenses that are not directly attributable to its brands (\"Unallocated corporate expenses\"); therefore, they are not allocated to its segments. Such costs primarily include certain overhead expenses related to corporate functions as well as certain administration, corporate occupancy, information technology and depreciation costs.\nOn February 16, 2025, the Company entered into a sale and purchase agreement (the “Purchase Agreement”) with Caleres, Inc. (the “Purchaser”) to sell the Stuart Weitzman Business (as defined below). The Purchaser acquired certain assets and liabilities of the Company's global business of designing, manufacturing, promotion, marketing, production, distribution, sales and licensing of Stuart Weitzman branded products (the \"Stuart Weitzman Business\"). The sale was completed on August 4, 2025 (the \"Stuart Weitzman Business Divestiture\"). Refer to Note 5, \"Acquisitions and Divestitures,\" and Note 21, \"Subsequent Events,\" for further information. \nRefer to Note 17, \"Segment Information,\" for further information about the Company's segments.\nOUR STRATEGY\nIn the first quarter of fiscal 2023, the Company introduced the 2025 growth strategy, \nfuture\nspeed, designed to amplify and extend the competitive advantages of its brands, with a focus on four strategic priorities:\n•\nBuilding Lasting Customer Relationships: The Company's brands aim to leverage Tapestry’s transformed business model to drive customer lifetime value through a combination of increased customer acquisition, retention and reactivation.\n2\n•\nFueling Fashion Innovation & Product Excellence: The Company aims to drive sustained growth in core handbags and small leathergoods, while accelerating gains in footwear and lifestyle products.\n•\nDelivering Compelling Omni-Channel Experiences: The Company aims to extend its omni-channel leadership to meet the customer wherever they shop, delivering growth online and in stores.\n•\nPowering Global Growth: The Company aims to support balanced growth across regions, prioritizing North America and China, its largest markets, while capitalizing on opportunities in under-penetrated geographies such as Southeast Asia and Europe.\nThe Company's next investor day will be held in September 2025, during which the Company will present its latest long-term growth strategy.\nDIRECT TO CONSUMER BUSINESS\nOur DTC business consists of channels that provide us with immediate, controlled access to consumers. This includes retail and outlet stores, brand e-commerce sites as well as concession shop-in-shops. DTC revenues were approximately 86% of total net sales in fiscal 2025.\n•\nStores \n-\n \nOur brands operate freestanding retail stores, outlet stores, as well as concession shop-in-shop locations. These stores are located in regional shopping centers, metropolitan areas throughout the world and established outlet centers.\nStore Count\n2025\n2024\n2023\nCoach\nNorth America\n324\n \n324 \n330 \nInternational\n607\n \n606 \n609 \nTotal Coach\n931\n \n930 \n939 \nKate Spade\nNorth America\n189\n \n197 \n205 \nInternational\n171\n \n181 \n192 \nTotal Kate Spade\n360\n \n378 \n397 \nStuart Weitzman\nNorth America\n28\n \n34 \n36 \nInternational\n52\n \n60 \n57 \nTotal Stuart Weitzman\n80\n \n94 \n93 \nTapestry\nNorth America\n541\n \n555 \n571 \nInternational\n830\n \n847 \n858 \nTotal Tapestry\n1,371\n \n1,402 \n1,429 \n3\nAvg. Square Footage\n2025\n2024\n2023\nCoach\nNorth America\n4,907\n \n4,905 \n4,904 \nInternational\n2,388\n \n2,342 \n2,294 \nTotal Coach\n3,265\n \n3,235 \n3,211 \nKate Spade\nNorth America\n3,023\n \n2,949 \n2,876 \nInternational\n1,502\n \n1,439 \n1,446 \nTotal Kate Spade\n2,301\n \n2,226 \n2,185 \nStuart Weitzman\nNorth America\n1,927\n \n1,938 \n1,905 \nInternational\n1,371\n \n1,338 \n1,371 \nTotal Stuart Weitzman\n1,566\n \n1,555 \n1,578 \nTapestry\nNorth America\n4,095\n \n4,029 \n3,987 \nInternational\n2,142\n \n2,078 \n2,043 \nTotal Tapestry\n2,912\n \n2,850 \n2,820 \n•\nDigital \n-\n \nWe view our digital platform as an instrument to deliver our products to customers directly with the benefit of added accessibility as consumers can purchase our products beyond where our physical locations are based. We have e-commerce sites in our major markets in the U.S., Canada, Japan, Greater China, several throughout Europe, Australia, and several throughout the rest of Asia. Additionally, we continue to leverage various third-party digital platforms to sell our products to customers.\n4\nWHOLESALE BUSINESS\nOur wholesale business primarily includes major department stores, specialty stores, and third-party digital partners. We work closely with our wholesale partners to ensure a clear and consistent product presentation. We enhance our presentation with proprietary brand fixtures within the department store environment in select locations. We custom tailor our assortments through wholesale product planning and allocation processes to match the attributes to the consumers of our wholesale partners in each local market. We continue to closely monitor inventories held by our wholesale customers in an effort to optimize inventory levels across wholesale doors. Wholesale represented approximately 13% of our total net sales for fiscal 2025. As of June 28, 2025, there were no customers who individually accounted for more than 10% of each segment’s total net sales.\nLICENSING BUSINESS\nOur brands take an active role in the design process and control the marketing and distribution of products in our worldwide licensing relationships. Our key licensing relationships and their fiscal year expirations as of June 28, 2025 are as follows:\nBrand\nCategory\n \nPartner\n \nFiscal Year Expiration\nCoach\nEyewear\nLuxottica\n2026\nCoach\nWatches\nMovado\n2028\nCoach\nFragrance\nInterparfums\n2031\nKate Spade\nTech Accessories\nCase-Mate\n2027\nKate Spade\nSleepwear\nKomar\n2028\nKate Spade\nFashion Bedding\nLive Comfortably\n2028\nKate Spade\nStationery and Gift\nLifeguard Press\n2030\nKate Spade\nFragrance\nInterparfums\n2030\nKate Spade\nEyewear\nSafilo\n2031\nProducts made under license are, in most cases, sold through stores and wholesale business channels and, with the Company's approval, the licensees have the right to distribute products selectively through other venues, which provide additional, yet controlled, exposure of our brands. Our licensing partners generally pay royalties on their net sales of our branded products. Such royalties currently comprise approximately 1% of Tapestry's total net sales. The licensing agreements generally give our brands the right to terminate the license if specified sales targets are not achieved.\n5\nPRODUCTS\nThe following table shows Net sales for each of our product categories by segment. \n Fiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nJuly 1, 2023\nAmount\n% of Total\nsegment net sales\nAmount\n% of Total\nsegment net sales\nAmount\n% of Total\nsegment net sales\n(millions)\nCoach\nHandbags\n$\n3,223.3\n \n57.6\n \n%\n$\n2,889.9 \n56.7 \n%\n$\n2,847.1 \n57.4 \n%\nAccessories\n1,539.5\n \n27.5\n \n1,407.9 \n27.6 \n1,325.7 \n26.7 \nFootwear\n342.5\n \n6.1\n \n326.0 \n6.4 \n311.5 \n6.3 \nOther\n493.2\n \n8.8\n \n471.5 \n9.3 \n476.1 \n9.6 \nTotal Coach\n$\n5,598.5\n \n100.0\n \n%\n$\n5,095.3 \n100.0 \n%\n$\n4,960.4 \n100.0 \n%\nKate Spade\nHandbags\n$\n623.0\n \n52.1\n \n%\n$\n721.0 \n54.0 \n%\n$\n779.7 \n54.9 \n%\nAccessories\n269.8\n \n22.5\n \n307.0 \n23.0 \n324.8 \n22.9 \nFootwear\n55.2\n \n4.6\n \n57.4 \n4.3 \n57.8 \n4.1 \nOther\n249.1\n \n20.8\n \n249.0 \n18.7 \n256.6 \n18.1 \nTotal Kate Spade\n$\n1,197.1\n \n100.0\n \n%\n$\n1,334.4 \n100.0 \n%\n$\n1,418.9 \n100.0 \n%\nStuart Weitzman\n(1)\n$\n215.1\n \n100.0\n \n%\n$\n241.5 \n100.0 \n%\n$\n281.6 \n100.0 \n%\nTapestry\nHandbags\n$\n3,846.3\n \n54.9\n \n%\n$\n3,610.9 \n54.1 \n%\n$\n3,626.8 \n54.4 \n%\nAccessories\n1,809.3\n \n25.8\n \n1,714.9 \n25.7 \n1,650.5 \n24.8 \nFootwear\n612.8\n \n8.7\n \n624.9 \n9.4 \n650.9 \n9.8 \nOther\n742.3\n \n10.6\n \n720.5 \n10.8 \n732.7 \n11.0 \nTotal Tapestry\n$\n7,010.7\n \n100.0\n \n%\n$\n6,671.2 \n100.0 \n%\n$\n6,660.9 \n100.0 \n%\n(1)\nThe significant majority of sales for Stuart Weitzman is attributable to footwear and therefore all of Stuart Weitzman net sales are within the Tapestry Footwear category.\n•\nHandbags\n — This category primarily includes handbags classically inspired as well as fashion designs, business cases, computer bags, messenger-style bags, backpacks, travel bags and totes. \n•\nAccessories\n — This category primarily includes small leather goods, such as mini and micro handbags, money pieces, wristlets, pouches and cosmetic cases. Also included in this category are novelty accessories (including address books, time management accessories, travel accessories, sketchbooks and portfolios), belts, key rings, technology accessories, gifting, straps and charms.\n•\nFootwear\n — This category primarily includes women's and men's footwear, including casual shoes, dress shoes, boots, sneakers and sandals.\n•\nOther \n— This category primarily includes outerwear, ready-to-wear, jewelry, watches, eyewear, fragrance, scarves, hats, gloves, other products, as well as royalties earned from the Company's licensing partners.\nDESIGN AND MERCHANDISING\nOur creative leaders are responsible for conceptualizing and implementing the design direction for our brands across the consumer touchpoints of product, stores and marketing. At Tapestry, each brand has a dedicated design and merchandising team; this ensures that Coach, Kate Spade and Stuart Weitzman speak to their customers with a voice and positioning unique to \n6\ntheir brand. Designers have access to the brands' extensive archives of product designs, which are a valuable resource for product concepts. Our designers collaborate with strong merchandising teams that analyze sales, market trends and consumer preferences to identify market opportunities that help guide each season's design process and create a globally relevant product assortment. Leveraging our strategic investments that we have made in data and analytics tools, merchandisers are able to gain a deeper understanding of customer behavior which empowers our teams to respond to changes in consumer preferences and demand as well as scale opportunities across brands with greater speed and efficiency. Our merchandising teams are committed to managing the product life cycle to maximize sales and profitability across all business channels. The product category teams, each comprised of design, merchandising, product development and sourcing specialists, help each brand execute design concepts that are consistent with the brand's strategic direction.\nOur design and merchandising teams also work in close collaboration with all of our licensing partners to ensure that the licensed products are conceptualized and designed to address the intended market opportunity and convey the distinctive perspective and lifestyle associated with our brands.\nMARKETING\nOur marketing objective is to build emotional connections with consumers to drive acquisition. We use a 360-degree approach to marketing for each of our brands, synchronizing our efforts across all business channels to ensure consistency at every touchpoint. Our global marketing strategy is to deliver a consistent, relevant and multi-layered message every time the consumer comes in contact with our brands through our communications, visual merchandising and customer experiences. Each brand's distinctive positioning is communicated by our creative marketing, visual merchandising and public relations teams, as well as outside creative agencies. We also have a sophisticated consumer and market research capability and leverage third-party experts to gain insights into consumer attitudes and trends.\nWe engage in many consumer communication initiatives globally, including activities at a national, regional and local level. Total expenses attributable to the Company's marketing-related activities in fiscal 2025 were $744.5 million, representing nearly 11% of net sales, compared to $616.8 million in fiscal 2024, representing over 9% of net sales.\nOur wide range of marketing activities utilize a variety of media, including digital, social, television, print and out-of-home. Our respective brand websites serve as effective communication vehicles by providing an immersive brand experience, showcasing the fullest expression across product categories.\nAs part of our direct marketing strategy, we use databases of consumers to generate personalized communications in direct channels such as email and text messages to drive engagement. Visitors to our e-commerce sites provide an opportunity to increase the size of these consumer databases, in addition to serving as a point of transactions globally, except where restricted.\nThe Company has several regional informational websites for locations where we have not established an e-commerce presence. The Company utilizes social media and continues to explore digital technologies to create emotional connections with consumers, acquire new customers and build brand awareness, in addition to increasing on-line and store sales.\nMANUFACTURING\nTapestry carefully balances its commitments to a limited number of “better brand” partners that have demonstrated integrity, quality and reliable delivery. The Company continues to evaluate new manufacturing sources and geographies to deliver high quality products at competitive costs and to mitigate the impact of manufacturing in inflationary markets.\nOur raw material suppliers, independent manufacturers and licensing partners must achieve and maintain high quality standards, which are an integral part of our brands' identity. Before directly partnering with a new manufacturing vendor for finished goods, the Company evaluates each facility by conducting a quality, business practice standards and social compliance review. We expect finished good manufacturers to undergo a social compliance audit before being approved as a Tapestry supplier. Manufacturers working with our licensed partners are expected to have had an acceptable social compliance audit conducted within the prior six months of their onboarding date. Suppliers that fail to meet our standards are not approved until an acceptable report is provided. We also conduct periodic evaluations of existing, previously approved finished good suppliers. We believe that our manufacturing partners are in material compliance with the Company’s integrity standards.\nThese independent manufacturers each or in aggregate support a broad mix of product types, materials and a seasonal influx of new, fashion-oriented styles, which allows us to meet shifts in marketplace demand and changes in consumer preferences.\nWe have longstanding relationships with purveyors of fine leathers and hardware. Although our products are manufactured by independent manufacturers, we maintain a strong level of oversight in the selection of key raw materials and compliance with quality control standards is monitored through on-site quality inspections at independent manufacturing facilities.\nWe maintain strong oversight of the supply chain process for each of our brands from design through manufacturing. We are able to do this by maintaining sourcing management offices in Vietnam, mainland China, the Philippines, Cambodia and \n7\nSpain that work closely with our independent manufacturers. This broad-based, global manufacturing strategy is designed to optimize the mix of cost, lead times and construction capabilities.\nDuring fiscal 2025, manufacturers of Coach products were primarily located in Vietnam, Cambodia, the Philippines and India and no individual vendor provided 10% or more of the brand's total inventory purchases. During fiscal 2025, Kate Spade products were manufactured primarily in Vietnam, Cambodia, mainland China, and the Philippines and no individual vendor provided 10% or more of the brand's total inventory purchases. Stuart Weitzman products were primarily manufactured in Spain. During fiscal 2025, Stuart Weitzman had one vendor, located in Spain, who individually provided approximately 11% of the brand's total inventory purchases.\nFULFILLMENT\nThe Company’s distribution network is designed to support the movement of each brand's products from our manufacturers to fulfillment centers around the world. These fulfillment centers are either directly operated by the Company or by independent third parties, some of which support multiple brands. Our facilities use bar code scanning warehouse management systems, where our fulfillment center employees use handheld scanners to read product bar codes. This allows for accurate storage and order processing and allows us to provide excellent service to our customers. These facilities are also integrated into our Enterprise Resource Planning system, ensuring accurate inventory reporting. Our products are primarily shipped to retail stores, wholesale customers and e-commerce customers.\nIn North America, we maintain fulfillment centers in Florida, Nevada and Ohio, operated by Tapestry. The Company also has third-party facilities in Canada and Mexico. Globally, we utilize regional fulfillment centers in mainland China, the Netherlands, the United Kingdom, Singapore and Spain, owned and operated by third parties, that support multiple countries. We also utilize local fulfillment centers, through third parties in Japan, parts of Greater China, South Korea, Malaysia and Australia.\nINFORMATION SYSTEMS \nThe Company’s information systems are integral in supporting the Company’s long-term strategies. Our robust information technology platform serves as a foundation to drive growth and enhance consumer centricity initiatives, and enable data-driven decision making. We are continually enhancing our digital technology platforms to elevate our e-commerce capabilities, strengthen DTC functionalities, and deliver a seamless overall omni-channel experience leveraging modern and cloud-based technologies. During fiscal 2025, we continued to enhance our artificial intelligence, both predictive and generative, and machine learning models for areas such as data analytics, planning, marketing, customer journey personalization, pricing and product creation, to improve our customer capture and segmentation capabilities for more tailored and effective engagement.\nThe Company utilizes a cloud-based digital platform which integrates critical components of our businesses including our customer shopping sites, Order Management Systems, Point of Sale systems, Customer Services, Enterprise Resource Planning systems and product management systems into one cohesive platform with a shared codebase. This unified platform allows us to be a more dynamic and responsive company providing best-in-class service to our customers across all brands in North America, Europe and Japan.\nRefer to Part I, Item 1C, \"Cybersecurity\" for further information on our cybersecurity risk management, strategy and governance.\nINTELLECTUAL PROPERTY\nTapestry owns COACH, KATE SPADE and STUART WEITZMAN, as well as all of the material trademark, design and patent-rights related to the production, marketing, distribution and sale of our products in the United States and other countries in which our products are principally sold. In addition, the Company licenses trademarks and copyrights used in connection with the production, marketing and distribution of certain categories of goods and limited edition collaborations. Tapestry also owns and maintains registrations in countries around the world for trademarks in relevant classes of products and services. In addition, Tapestry owns trade dress, copyrights, design patents and utility patents for its brands' product designs. Tapestry aggressively polices its intellectual property and pursues infringers both domestically and internationally. The Company pursues counterfeiters through leads generated internally, as well as through its network of investigators, law enforcement and customs officials, the respective online reporting form for each brand, the Tapestry hotline and business partners around the world.\n8\nSEASONALITY\nThe Company's results are typically affected by seasonal trends. During the first fiscal quarter, we typically build inventory for the winter and holiday season. In the second fiscal quarter, working capital requirements are reduced substantially as we generate higher net sales and operating income, especially during the holiday season.\nFluctuations in net sales, operating income and operating cash flows of the Company in any fiscal quarter may be affected by the timing of wholesale shipments and other events affecting retail sales, including weather and macroeconomic events.\nGOVERNMENT REGULATION\nMost of the Company's imported products are subject to tariffs, indirect taxes, quotas and non-tariff trade barriers that may limit the quantity of products that we may import into the U.S. and other countries or may impact the cost of such products. The Company is not materially restricted by quotas or other government restrictions in the operation of its business; however, customs duties do represent a component of total product cost. To maximize opportunities, the Company operates complex supply chains through foreign trade zones, bonded logistic parks and other strategic initiatives such as free trade agreements. Additionally, the Company operates a direct import business in many countries worldwide. As a result, the Company is subject to stringent government regulations and restrictions, adding significant complexity with respect to its cross-border activity either by the various customs and border protection agencies or by other government agencies which control the quality, safety and sustainability of the Company’s products. The Company maintains an internal global trade, customs and product compliance organization to help manage its import/export and regulatory affairs activity.\nCOMPETITION\nThe Company faces intense competition from many other brands in the product lines and markets that we participate. In varying degrees, depending on the product category involved, we compete on the basis of style, price, customer service, quality, brand prestige and recognition, among others. Over the last decade, these brands have grown and are expected to continue to grow, encouraging the entry of new competitors as well as increasing the competition from existing competitors. This increased competition drives interest in these brand loyal categories. We believe, however, that we have significant competitive advantages because of the recognition and the acceptance of our brands by consumers and the power of our information technology platform.\n9\nCORPORATE RESPONSIBILITY\nAs a people-centered and purpose-led Company, Tapestry believes that a better-made future is one that is both beautiful and responsible. Our Corporate Responsibility (“CR”) strategy, the \nFabric of Change\n, aims to unite teams across the Company’s business to work to meet our Corporate Responsibility Goals and a shared objective: to create a company of the future that balances true fashion authority with meaningful, positive change. The \nFabric of Change\n focuses on four pillars: Power of Our People, Sustain the Planet, Uplift Our Communities and Create Products with Care.\n•\nPower of Our People:\n◦\nAs our company name suggests, we believe in the intertwining of a broad mix of people who bring a variety of perspectives, unleashing the power of innovation and self-expression in our products and experiences.\n◦\nAs a global employer, we work to continuously expand our aperture as wide as possible to acquire, retain and grow the best talent.\n•\nSustain the Planet:\n◦\nWe aim to preserve and restore our planet through investments in solutions that improve biodiversity and reduce the impacts of climate change.\n◦\nWe have set goals focused on utilizing 100% renewable energy in our own operations globally, reducing waste in our corporate and fulfillment centers and minimizing water use across our company and supply chain. We also have greenhouse gas (“GHG”) emissions reduction targets for Scope 1, 2, 3 and Scope 3 Forest, Land and Agriculture that have been validated by Science Based Targets initiative.\n•\nUplift Our Communities:\n◦\nWe aim to empower the communities where our employees live and work, and provide the resources and capacity needed to support supply chain partners in the regions where we operate.\n◦\nWe have set goals focused on volunteer service hours completed by our employees around the world, financial and product donations to nonprofit organizations globally, and ensuring people working in the factories crafting our products will have access to empowerment programs during the workday.\n•\nCreate Products with Care:\n◦\nWe aim to increase the use of innovative materials and focus on production methods that design out waste and pollution, keep products in use and restore natural systems.\n◦\nWe have set goals focused on tracing and mapping our raw materials, and targets to increase the uptake of sourcing environmentally preferred materials.\nThe Company’s CR strategy, including oversight, management and identification of risks, is ultimately governed by the Board of Directors (the \"Board\") and overseen by an Executive Steering Committee, which is comprised of members of our executive leadership team, and driven by a Task Force, comprised of senior leaders and cross-functional members from major business functions. The Board approves long-term sustainability goals, strategic moves or major plans of action and receives updates at least annually. Tapestry's Governance and Nominations Committee of the Board receives quarterly updates on sustainability strategy, including climate-related topics, progress towards the CR goals and other CR related initiatives.\nAdditional information on the \nFabric of Change\n and CR Goals can be found at www.tapestry.com/responsibility. The content on this website and the content in our corporate responsibility reports are not incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with the SEC.\nHUMAN CAPITAL\nAt Tapestry, being true to yourself is core to who we are. When each of us brings our individuality to our collective ambition, our creativity is unleashed. This global house of brands was built by unconventional entrepreneurs and unexpected solutions, so when we say we believe in dreams, we mean we believe in making them happen.\nWhere differences intersect, new thinking emerges. We cultivate a place for people who are both warm and rigorous, work that is both challenging and fun and a culture led by both head and heart. Most of all, we bring together the unique spirits of our people and our brands and give them a place to move their work and our industry forward. \n10\nGovernance and Oversight\nOur Board and its committees provide governance and oversight of the Company's strategy, including over issues of human capital management. The Board has designated the Human Resources Committee of the Board (the “HR Committee”) as the primary committee responsible for the Company’s human capital strategy, overseeing executive compensation programs, performance and talent development, succession planning, engagement and regular review of employee benefits and well-being strategies. The full Board and the HR Committee receive quarterly updates on the Company’s talent development strategies and other applicable areas of human capital management.\nUnlocking the power of our people is a key strategic focus area for the Company, supported by significant engagement from the Company’s senior leadership on talent development and human capital management, as reflected in the key programs and focus areas described below.\nEmployees\nAs of June 28, 2025, the Company employed approximately 19,000 employees globally. Of these employees, approximately 15,100 employees worked in retail locations, of which 6,500 were part-time employees. This total excludes seasonal and temporary employees that the Company employs, particularly during the second quarter due to the holiday season. The Company believes that its relations with its employees are good and has never encountered a strike or work stoppage.\nEmbracing Difference by Design\nWe believe that having a variety of perspectives, backgrounds and experiences makes us more innovative and successful and brings us closer to our consumer. We believe that difference sparks brilliance, so we welcome people and ideas from everywhere to join us in stretching what's possible.\nOur core values of ‘Embracing Difference by Design’ and ‘Stand Taller Together’ are non-negotiable, it is who we are. They are the bedrock of the kind of ingenuity that turns heads, turns objects into icons and comes only from the places few have looked before. To support these actions, we are guided by four interconnected principles:\n•\nTalent:\n Identify, retain and grow the best talent – making us an employer of choice in a rapidly evolving talent marketplace.\n•\nCulture:\n Cultivate a workplace culture where everyone can fully contribute and reach their potential by feeling included, that they belong and that they matter.\n•\nCommunity:\n Amplify our brands and support the communities in which our employees live and work.\n•\nMarketplace:\n Growing our customer base in line with the market and shifting dynamics.\nAdditionally, we believe educating our employees is crucial in achieving our goals. We have curated a catalogue of learning and development content, tools and resources, including bespoke skill-building programs to accommodate our dynamic employee population. Furthermore, the Company has focused on providing employees with resources to foster continuing education and conversation through 'Tapestry UNSCRIPTED', which is an internal speaker series for our employees designed to bring our values to life. We feel hosting bold conversations about our values provides an opportunity for us to be inspired, discover ideas and ignite personal passions.\nTapestry is committed to inclusion and opportunity for all through our corporate partnerships and best practice benchmarking groups through our corporate efforts. Our focus on fostering an equitable work environment has led to continued recognition in the form of awards from Forbes as one of the World’s Most Admired Companies; Newsweek for America’s Greatest Workplaces for Mental Well-being; America’s Greatest Workplaces for Women and Greatest Workplaces 2025; and official certification from Great Place to Work in the US and several countries globally.\n11\nTotal Rewards\nTapestry is dedicated to being a place where our employees love to work, where they feel recognized and rewarded for all that they do. Maintaining a competitive total compensation program helps us attract, motivate and retain the key talent we need to achieve outstanding business and financial results. To accomplish this goal, we strive to appropriately align our total compensation with the pay, benefits and rewards offered by companies that compete with us for talent in the marketplace.\nOur Total Compensation Program includes cash pay, annual and long-term incentives, benefits and other special programs that our employees value. We strive to pay each employee fairly and competitively across our brands. Tapestry's primary compensation principle is to \"pay for performance.\" Tapestry's practice is to pay a competitive base salary and provide corporate employees with the opportunity to earn an annual bonus tied to Tapestry's and its brands' financial performance, and provide store employees with the opportunity to earn sales incentives. Approximately 2,400 of our employees, including nearly all of our store managers, received an annual long-term equity award in 2025, which aligns employee interests with those of our stockholders, rewards employees for enhancing stockholder value and supports retention of key employees.\nOur benefits package, which varies by country, is designed to be competitive and comprehensive. Our benefits, along with competitive pay, include health benefits, vacation time, and paid Company holidays for directly hired full-time and qualifying part-time employees. Additionally, we offer parental leave for directly hired full-time employees. The Company also offers retirement benefits and paid wellness days for full-time and part-time employees. To support employees in achieving their career and financial goals, the Company also provides access to learning opportunities on personal finances, as well as physical and mental wellness, through various platforms based on the location of the employee.\nTalent Acquisition and Development\nHiring talented employees is critically important to us, as we consider our employees around the world to be our greatest asset. Our recruitment and sourcing strategy focuses on tapping many sources to attract the best talent to our organization and then retaining them through our continued investments in resources that provide our employees with the tools for development and career advancement. Our internal opportunity program encourages employees to stretch themselves in their career development, aligning their capabilities with career interests and goals. We strive to provide a working environment where our people can grow and progress their careers within the Company.\nWe are committed to helping our employees develop the knowledge, skills and abilities needed for continued success and encourage employee development at all levels and every career stage. Our development programs enable individual and team success through targeted initiatives and resources, offering a wide-ranging curriculum focused on professional and leadership development for leaders, managers and individual contributors, including through our Manager Effectiveness Program, Better Conversations Everyday Program, Leader Transition Acceleration Program and third-party learning platforms, in addition to other trainings and education facilitated through the Company for all employees.\nPerformance management is critical to our ability to reach our goals and foster a culture of success. By having a dynamic, performance-driven culture, we can achieve greater results, maximize employee, manager and team performance and offer exciting development and career opportunities. In fiscal year 2025, we transitioned from an annual performance review cycle to one that has managers and employees meeting for formal check-ins four times a year, focused on goals and expectations, feedback, coaching and career development. As our focus extends beyond the performance of our employees to the performance of our Company as a whole, we have mechanisms in place to facilitate comprehensive upward feedback through robust cross-functional feedback tools and a cadence of regular pulse surveys that inform on how we can continue to strive for excellence in our work culture.\nWell-being\nAt Tapestry, we are committed to providing a safe working environment for our people, as well as supporting our people in achieving and maintaining their health and well-being goals. Work-life integration is top of mind, and we provide resources and benefits to help achieve this balance. We provide our employees with supplemental resources to achieve wellness such as access to our Employee Assistance Program, regular employee programming and subscriptions to Headspace, a smartphone application dedicated to meditation and mindfulness. In addition, the Company maintains an Associate Relief Fund, which provides emergency assistance for events considered a disaster or hardship.\nAt Tapestry, we believe in encouraging and empowering our employees to take part in building a welcoming and inclusive community. We provide all employees with supplemental time-off to perform community service through nonprofits of their personal choice and through team and Company sponsored volunteering events. In our commitment to supporting our communities, we have three foundations which provide monetary support to nonprofit organizations across communities that we are a part of. Additionally, on an annual basis, our foundations match up to $10,000, per eligible employee, in donations to eligible non-profits in North America.\n12\nFINANCIAL INFORMATION ABOUT GEOGRAPHIC AREAS\nRefer to Note 4, \"Revenue,\" and Note 17, \"Segment Information,\" presented in the Notes to the Consolidated Financial Statements for geographic information.\nAVAILABLE INFORMATION\nOur Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and all amendments to these reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 are available free of charge on our investor website, located at www.tapestry.com/investors under the caption “SEC Filings,” as soon as reasonably practicable after they are filed with or furnished to the Securities and Exchange Commission. These reports are also available on the Securities and Exchange Commission’s website at www.sec.gov. No information contained on any of our websites is intended to be included as part of, or incorporated by reference into, this Annual Report on Form 10-K.\nThe Company has included the Chief Executive Officer (“CEO”) and Chief Financial Officer (\"CFO\") certifications regarding its public disclosure required by Section 302 of the Sarbanes-Oxley Act of 2002 as Exhibits 31.1 and 32.1 and Exhibits 31.2 and 32.2, respectively to this Form 10-K.\n13",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of the Company's financial condition and results of operations should be read together with the Company’s consolidated financial statements and notes to those financial statements included elsewhere in this document. When used herein, the terms “the Company,” \"Tapestry,\" “we,” “us” and “our” refer to Tapestry, Inc., including consolidated subsidiaries. References to \"Coach,\" \"Stuart Weitzman,\" \"Kate Spade\" or \"kate spade new york\" refer only to the referenced brand.\nINTRODUCTION\nManagement’s discussion and analysis of financial condition and results of operations (“MD&A”) is provided as a supplement to the accompanying consolidated financial statements and notes thereto to help provide an understanding of our results of operations, financial condition and liquidity. MD&A is organized as follows:\n•\nOverview.\n This section provides a general description of the business and brands as well as the Company’s growth strategy.\n•\nGlobal Economic Conditions and Industry Trends.\n This section includes a discussion on global economic conditions and industry trends that affect comparability that are important in understanding results of operations and financial conditions, and in anticipating future trends.\n•\nResults of Operations\n.\n An analysis of our results of operations in fiscal \n2025\n compared to fiscal \n2024\n.\n•\nNon-GAAP Measures.\n This section includes non-GAAP measures that are useful to investors and others in evaluating the Company’s ongoing operating and financial results in a manner that is consistent with management's evaluation of business performance and understanding how such results compare with the Company’s historical performance.\n•\nFinancial Condition.\n This section includes a discussion on liquidity and capital resources including an analysis of changes in cash flow as well as working capital and capital expenditures.\n•\nCritical Accounting Policies and Estimates. \nThis section includes any critical accounting policies or estimates that impact the Company. \nOVERVIEW\nFiscal 2025, fiscal 2024 and fiscal 2023 were 52-week periods.\nTapestry, Inc. is a house of iconic accessories and lifestyle brands. Our global house of brands unites the magic of Coach and kate spade new york. Each of our brands are unique and independent, while sharing a commitment to innovation and authenticity defined by distinctive products and differentiated customer experiences across channels and geographies. We use our collective strengths to move our customers and empower our communities, to make the fashion industry more sustainable, and to harness the power of an inclusive culture. Individually, our brands are iconic. Together, we can stretch what’s possible.\nThe Company has three reportable segments:\n•\nCoach - \nIncludes global sales of primarily Coach brand products to customers through our DTC, wholesale and licensing businesses.\n•\nKate Spade \n- Includes global sales primarily of kate spade new york brand products to customers through our DTC, wholesale and licensing businesses.\n•\nStuart Weitzman -\n Includes global sales of Stuart Weitzman brand products primarily through our DTC, wholesale and licensing businesses. \n    Each of our brands are unique and independent, while sharing a commitment to innovation and authenticity defined by distinctive products and differentiated customer experiences across business channels and geographies. Our success does not depend solely on the performance of a single business channel, geographic area or brand.\n32\nStuart Weitzman Business Divestiture\nOn February 16, 2025, the Company entered into a Purchase Agreement with Caleres to sell the Stuart Weitzman Business (as defined below). The Purchaser acquired certain assets and liabilities of the Company's global business of designing, manufacturing, promotion, marketing, production, distribution, sales and licensing of Stuart Weitzman branded products (the \"Stuart Weitzman Business\") for total cash consideration of $105.0 million (the \"Purchase Price\"), subject to customary adjustments for cash, indebtedness, net working capital and transaction expenses. The sale was completed on August 4, 2025 (the \"Stuart Weitzman Business Divestiture\"). Refer to Note 5, \"Acquisitions and Divestitures,\" and Note 21, \"Subsequent Events,\" for further information. \nCapri Holdings Limited Acquisition\nOn August 10, 2023, the Company entered into the Merger Agreement by and among the Company, Sunrise Merger Sub, Inc., a direct wholly owned subsidiary of Tapestry, and Capri. In order to finance the Capri Acquisition, on November 27, 2023, the Company issued $4.50 billion of U.S. dollar-denominated senior unsecured notes (the \"Capri Acquisition USD Senior Notes\") and €1.50 billion of Euro-denominated senior unsecured notes (the \"Capri Acquisition EUR Senior Notes\" and, together with the Capri Acquisition USD Senior Notes, the \"Capri Acquisition Senior Notes\") which, together with the $1.40 billion of delayed draw unsecured term loan facilities (the \"Capri Acquisition Term Loan Facilities\") executed on August 30, 2023, complete the expected financing for the Capri Acquisition. On April 22, 2024, the FTC filed a complaint against the Company and Capri in the United States District Court for the Southern District of New York seeking to enjoin the consummation of the Capri Acquisition, and on October 24, 2024, the Court issued its Opinion and Order granting the FTC's request for a preliminary injunction of the Merger, pending an administrative trial on the merits which was scheduled to begin on December 9, 2024. On October 28, 2024, the Company and Capri filed a Notice of Appeal with respect to the October 24, 2024 Opinion and Order. On November 6, 2024, the United States Court of Appeals for the Second Circuit entered an order setting an expedited briefing schedule for the appeal of the decision of the United States District Court of the Southern District of New York granting the preliminary injunction of the merger. On November 13, 2024, the Parties entered into a Termination Agreement (the “Termination Agreement”), pursuant to which the Parties agreed to terminate the Merger Agreement, including all schedules and exhibits thereto and all ancillary agreements contemplated thereby or entered pursuant thereto (the “Termination Date”), effective immediately. Pursuant to the Termination Agreement, the Company agreed to reimburse Capri for its expenses in an amount equal to $45.1 million in cash on November 14, 2024. The Parties also agreed to release each other from claims, demands, damages, actions, causes of action and liability relating to or arising out of the Merger Agreement and the transactions contemplated therein or thereby. Following termination of the Merger Agreement, the Parties and the FTC filed a stipulation withdrawing the appeal to the United States Court of Appeals for the Second Circuit on November 19, 2024 and the Second Circuit dismissed the appeal on November 20, 2024. The Parties and the FTC also filed a Joint Motion to dismiss the complaint in the administrative trial on November 15, 2024 and the FTC dismissed the complaint on December 4, 2024. On November 25, 2024, due to the termination of the Merger Agreement and pursuant to the terms of the indenture governing the Capri Acquisition Senior Notes, as supplemented, the Company redeemed all outstanding Capri Acquisition Senior Notes at a redemption price of 101% of the aggregate principal amount of such Capri Acquisition Senior Notes, plus accrued and unpaid interest to, but excluding, the date of redemption. In addition, the Capri Acquisition Term Loan Facilities were terminated concurrently with the execution of the Termination Agreement on November 13, 2024. Refer to Note 5, \"Acquisitions and Divestitures\" and Note 12, \"Debt\" for further information.\n2025 Growth Strategy\nIn the first quarter of fiscal 2023, the Company introduced the 2025 growth strategy, \nfuture\nspeed, designed to amplify and extend the competitive advantages of its brands, with a focus on four strategic priorities:\n•\nBuilding Lasting Customer Relationships: The Company's brands aim to leverage Tapestry’s transformed business model to drive customer lifetime value through a combination of increased customer acquisition, retention and reactivation.\n•\nFueling Fashion Innovation & Product Excellence: The Company aims to drive sustained growth in core handbags and small leathergoods, while accelerating gains in footwear and lifestyle products.\n•\nDelivering Compelling Omni-Channel Experiences: The Company aims to extend its omni-channel leadership to meet the customer wherever they shop, delivering growth online and in stores.\n•\nPowering Global Growth: The Company aims to support balanced growth across regions, prioritizing North America and China, its largest markets, while capitalizing on opportunities in under-penetrated geographies such as Southeast Asia and Europe.\n33\nThe Company's next investor day will be held in September 2025, during which the Company will present its latest long-term growth strategy.\nGLOBAL ECONOMIC CONDITIONS AND INDUSTRY TRENDS\nThe environment in which we operate is subject to a number of different factors driving global consumer spending. Consumer preferences, macroeconomic conditions, foreign currency fluctuations and geopolitical events continue to impact overall levels of consumer travel and spending on discretionary items, with inconsistent patterns across business channels and geographies.\nWe will continue to monitor the below trends and evaluate and adjust our operating strategies and cost management opportunities to mitigate the related impact on our results of operations, while remaining focused on the long-term growth of our business and protecting the value of our brands.\nFor a detailed discussion of significant risk factors that have the potential to cause our actual results to differ materially from our expectations, see Part I, Item 1A. \"Risk Factors\".\nCurrent Macroeconomic Conditions and Outlook\nCurrency volatility, geopolitical instability and political uncertainty, such as the impact of policies implemented and that may be implemented by the U.S. Presidential Administration, including, but not limited to, changes to trade agreements, tax legislation or duty rates may also contribute to a worsening of the macroeconomic environment or adversely impact our business. \nDuring the second half of fiscal 2025, the U.S. Government announced tariffs on imports from select countries. The majority of the Company's products sold in the U.S. are imported from countries in which these tariffs were announced. As a result of the Company's actions to accelerate inventory purchases and based on current trends of the business, we did not experience a meaningful negative impact to our results of operations in fiscal 2025.\nAt the time of this report, the Company estimates a projected tariff and trade policy impact of approximately 230 basis points to operating margin in fiscal 2026 after consideration of mitigating actions. In addition, there could be further impact to our results of operations in fiscal 2026 and beyond depending on the outcome of trade negotiations. The Company is prepared to take actions to mitigate this negative impact as changes in trade relations, economic and monetary policies are made clear. \nThe macroeconomic environment remained challenging and volatile during fiscal 2025. Several organizations that monitor the world’s economy, including the International Monetary Fund, continue to forecast growth in the global economy. Some of these organizations have recently revised the forecast slightly upwards since the third quarter of fiscal 2025. The forecast is below the historical growth average and is reflective of the current volatile environment, including escalation of trade tensions, tighter monetary and fiscal policies which have continued to moderate inflation, financial market volatility and the negative economic impacts of geopolitical instability in certain regions of the world.\nIn fiscal 2025, the U.S. Dollar has continued to fluctuate as compared to foreign currencies in regions where we conduct our business. During fiscal 2025, this trend has resulted in impacts to our business including, but not limited to, decreased Net sales of $13.4 million, no impact to gross margin and approximately 20 basis point negative impact to operating margin.\nIn response to the current environment, the Company is closely monitoring changes and continues to take strategic actions considering near-term exigencies and remains committed to maintaining the health of the brands and business.\nFiscal 2025 Impairment\nDuring the fourth quarter of fiscal 2025, the Company performed its annual goodwill and indefinite-lived intangible assets impairment analysis. The assessment concluded that the fair values of the Kate Spade reporting unit and indefinite-lived brand intangible asset did not exceed their respective carrying values due to a reduction in both current and future expected cash flows, which includes an estimated impact of cost increases due to changes in tariff and trade policies. As a result, the Company recorded $244.1 million of impairment charges to goodwill for the Kate Spade reporting unit and $610.7 million of impairment charges to indefinite-lived brand intangible assets during the fourth quarter of fiscal 2025. Refer to \"Critical Accounting Policies and Estimates,\" herein, for further information.\nTax Legislation\nOn August 16, 2022, the Inflation Reduction Act of 2022 was signed into law, with tax provisions primarily focused on implementing a 15% corporate alternative minimum tax (“CAMT”) on global adjusted financial statement income and a 1% excise tax on share repurchases. The CAMT was effective at the beginning of fiscal 2024 and did not have a material impact on the Company’s effective tax rate.\n34\nOn December 12, 2022, the E.U. member states also reached an agreement to implement the Organization for Economic Co-operation and Development’s (“OECD”) reform of international taxation known as Global Anti-Base Erosion Rules (“GloBE”), which broadly mirrors the Inflation Reduction Act by imposing a 15% global minimum tax on multinational companies, which was effective on January 1, 2025. Based on the countries in which we do business, these changes did not have a material impact in fiscal 2025. Other countries are also implementing similar legislation with effective dates starting in fiscal 2026, known as Qualifying Domestic Minimum Top-Up Tax (\"QDMTT\"). On June 26, 2025, the U.S. Treasury reached an agreement with the other G7 countries regarding the application of GloBE rules to U.S. parented multinational enterprises (\"U.S. MNEs\"). Most notably, the agreement includes a full exclusion for U.S. MNEs from the Undertaxed Profits Rule and Income Inclusion Rule, which are two of the three taxing mechanisms under GloBE. Given that the third mechanism, QDMTT is still in force, it is unclear what impact if any this agreement will have on the Company. Unless U.S. MNEs are likewise excluded from QDMTT, the Company believes QDMTT would have a negative impact on its effective tax rate in fiscal 2026 and beyond.\nOn July 4, 2025, the One Big Beautiful Bill Act (\"OBBBA\") was enacted. Key income tax-related provisions of the OBBBA include the repeal of mandatory capitalization of research and development expenditures (reinstating full expensing beginning January 2025), permanent extension of 100% bonus depreciation, and revisions to international tax regimes that more closely align with the original application of Tax Cut Jobs Act of 2017. The Company is evaluating the financial implications of the OBBBA and will begin reflecting its effects in the first quarter of fiscal 2026. The Company believes this legislation will not have a material impact on its financial statements but will continue to evaluate as guidance becomes available.\n35\nRESULTS OF OPERATIONS\nFISCAL 2025 COMPARED TO FISCAL 2024 \nThe following table summarizes results of operations for fiscal 2025 compared to fiscal 2024. All percentages shown in the tables below and the related discussion that follows have been calculated using unrounded numbers.\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nVariance\n \n(millions, except per share data)\n \nAmount\n% of\nnet sales\nAmount\n% of\nnet sales\nAmount\n%\nNet sales\n$\n7,010.7\n \n100.0\n \n%\n$\n6,671.2 \n100.0 \n%\n$\n339.5 \n5.1 \n%\nGross profit\n5,288.9\n \n75.4\n \n4,889.5 \n73.3 \n399.4 \n8.2 \nSG&A expenses\n4,873.9\n \n69.5\n \n3,749.4 \n56.2 \n1,124.5 \n30.0 \nOperating income (loss)\n415.0\n \n5.9\n \n1,140.1 \n17.1 \n(725.1)\n(63.6)\nLoss on extinguishment of debt\n120.1\n \n1.7\n \n— \n— \n120.1 \nNM\nInterest expense, net\n85.4\n \n1.2\n \n125.0 \n1.9 \n(39.6)\n(31.7)\nOther expense (income)\n(6.6)\n(0.1)\n3.2 \n— \n(9.8)\nNM\nIncome (loss) before provision for income taxes\n216.1\n \n3.1\n \n1,011.9 \n15.2 \n(795.8)\n(78.7)\nProvision for income taxes\n32.9\n \n0.5\n \n195.9 \n2.9 \n(163.0)\n(83.2)\nNet income (loss)\n183.2\n \n2.6\n \n816.0 \n12.2 \n(632.8)\n(77.6)\nNet income (loss) per share:\n \n \nBasic\n$\n0.84\n \n \n$\n3.56 \n \n$\n(2.72)\n(76.3)\nDiluted\n$\n0.82\n \n \n$\n3.50 \n \n$\n(2.68)\n(76.5)\nNM - Not meaningful\n36\nGAAP to Non-GAAP Reconciliation\nThe Company’s reported results are presented in accordance with accounting principles generally accepted in the United States of America (“GAAP”). The reported results during fiscal 2025 and fiscal 2024 reflect certain items which affect the comparability of our results, as noted in the following tables. Refer to \"Non-GAAP Measures\" herein for further discussion on the Non-GAAP measures.\nFiscal 2025 Items\nFiscal Year Ended June 28, 2025\nItems affecting comparability\n \nGAAP Basis\n(As Reported)\nAcquisition and Divestiture Costs\nOrganizational Efficiency Costs\nImpairment\nNon-GAAP Basis\n(Excluding Items)\n(millions, except per share data) \nCoach\n$\n1,875.3\n \n$\n—\n \n$\n(0.8)\n$\n—\n \n$\n1,876.1\n \nKate Spade\n(769.2)\n—\n \n(5.7)\n(854.8)\n91.3\n \nStuart Weitzman\n(15.4)\n(0.6)\n—\n \n—\n \n(14.8)\nCorporate\n(675.7)\n(111.9)\n(10.7)\n—\n \n(553.1)\nOperating income (loss)\n$\n415.0\n \n$\n(112.5)\n$\n(17.2)\n$\n(854.8)\n$\n1,399.5\n \nNet income (loss)\n$\n183.2\n \n$\n(212.0)\n$\n(13.9)\n$\n(725.1)\n$\n1,134.2\n \nNet income (loss) per diluted common share\n$\n0.82\n \n$\n(0.95)\n$\n(0.06)\n$\n(3.27)\n$\n5.10\n \nIn fiscal 2025, the Company incurred charges as follows:\n•\nAcquisition and Divestiture Costs\n - Includes costs related to the terminated Capri Acquisition and the Stuart Weitzman Business Divestiture. These charges include:\n◦\nCapri Acquisition Costs: \nTotal pre-tax charges of $268.4 million primarily related to:\n▪\nLoss on extinguishment of debt -\n $119.4 million primarily related to redemption premiums, as well as unamortized debt issuance costs and discounts, as a result of the redemption of the Capri Acquisition Senior Notes in fiscal 2025 due to the termination of the Capri Acquisition agreement;\n▪\nSG&A expenses -\n $88.8 million primarily related to expense reimbursement payment made to Capri and professional fees recorded;\n▪\nInterest expense, net -\n $60.2 million of financing related charges which primarily includes the net impact of the Capri Acquisition Senior Notes; and\n◦\nStuart Weitzman Business Divestiture Costs\n: Total pre-tax charges of $23.7 million primarily due to the loss on business held for sale, professional fees, share-based compensation expense and store impairment.\n•\nOrganizational Efficiency Costs\n - Total pre-tax charges of $17.2 million primarily related to severance costs and technology costs.\n•\nImpairment\n - Total pre-tax charges of $854.8 million primarily due to impairment charges on the indefinite-lived brand intangible asset and goodwill for Kate Spade. Refer to Note 14, \"Goodwill and Other Intangible Assets\" for further information.\n    These actions taken together negatively impacted operating income by $984.5 million, increased Loss on extinguishment of debt by $119.4 million, increased interest expense by $60.2 million and reduced the provision for income tax by $213.1 million resulting in a net decrease in net income by $951.0 million or $4.28 per diluted share.\n37\nSupplemental Segment Data\nFiscal Year Ended June 28, 2025\nItems affecting comparability\n \nGAAP Basis\n(As Reported)\nAcquisition and Divestiture Costs\nOrganizational Efficiency Costs\nImpairment\nNon-GAAP Basis\n(Excluding Items)\n(millions) \nCoach\n$\n2,497.2\n \n$\n—\n \n$\n0.8\n \n$\n—\n \n$\n2,496.4\n \nKate Spade\n1,567.2\n \n—\n \n5.7\n \n854.8\n \n706.7\n \nStuart Weitzman\n133.8\n \n0.6\n \n—\n \n—\n \n133.2\n \nCorporate\n675.7\n \n111.9\n \n10.7\n \n—\n \n553.1\n \nSG&A expenses\n$\n4,873.9\n \n$\n112.5\n \n$\n17.2\n \n$\n854.8\n \n$\n3,889.4\n \nFiscal 2024 Items\nFiscal Year Ended June 29, 2024\nItems affecting comparability\n \nGAAP Basis\n(As Reported)\nAcquisition Costs\nNon-GAAP Basis\n(Excluding Items)\n(millions, except per share data) \nCoach\n$\n1,651.1 \n$\n— \n$\n1,651.1 \nKate Spade\n132.6 \n— \n132.6 \nStuart Weitzman\n(21.2)\n— \n(21.2)\nCorporate\n(622.4)\n(109.9)\n(512.5)\nOperating income (loss)\n$\n1,140.1 \n$\n(109.9)\n$\n1,250.0 \nNet income (loss)\n$\n816.0 \n$\n(184.2)\n$\n1,000.2 \nNet income (loss) per diluted common share\n$\n3.50 \n$\n(0.79)\n$\n4.29 \nIn fiscal 2024, the Company incurred charges as follows:\n•\nAcquisition Costs\n - Total pre-tax charges of $226.6 million attributable to the Capri Acquisition. These charges include:\n◦\nInterest expense, net\n: $116.7 million of financing related charges, which primarily includes the net impact of the Capri Acquisition Senior Notes, and the financing fees of the unsecured bridge loan facility in an aggregate principal amount of up to $8.00 billion;\n◦\nSG&A expenses\n: $109.9 million primarily related to professional fees recorded within Corporate. \nThese actions taken together negatively impacted Operating income by $109.9 million, increased Interest expense, net by $116.7 million and reduced the Provision for income taxes by $42.4 million, resulting in a net decrease in Net income by $184.2 million, or $0.79 per diluted share.\nSupplemental Segment Data\nFiscal Year Ended June 29, 2024\nItems affecting comparability\n \nGAAP Basis\n(As Reported)\nAcquisition Costs\nNon-GAAP Basis\n(Excluding Items)\n(millions) \nCoach\n$\n2,224.3 \n$\n— \n$\n2,224.3 \nKate Spade\n738.6 \n— \n738.6 \nStuart Weitzman\n164.1 \n— \n164.1 \nCorporate\n622.4 \n109.9 \n512.5 \nSG&A expenses\n$\n3,749.4 \n$\n109.9 \n$\n3,639.5 \n38\nTapestry, Inc. Summary - Fiscal 2025\nCurrency Fluctuation Effects\nThe change in net sales in fiscal 2025 compared to fiscal 2024 has been presented both including and excluding currency fluctuation effects. All percentages shown in the tables below and the discussion that follows have been calculated using unrounded numbers.\nNet Sales\nFiscal Year Ended\nVariance\nJune 28, 2025\nJune 29, 2024\nAmount\n%\nConstant Currency Change\n(millions)\nCoach\n$\n5,598.5\n \n$\n5,095.3 \n$\n503.2 \n9.9 \n%\n10.1 \n%\nKate Spade\n1,197.1\n \n1,334.4 \n(137.3)\n(10.3)\n(10.1)\nStuart Weitzman \n215.1\n \n241.5 \n(26.4)\n(10.9)\n(10.9)\nTapestry\n$\n7,010.7\n \n$\n6,671.2 \n$\n339.5 \n5.1 \n5.3 \nNet sales in fiscal 2025 increased 5.1% or $339.5 million to $7.01 billion. Excluding the impact of foreign currency, net sales increased by 5.3% or $352.9 million.\n•\nCoach Net Sales\n increased 9.9% or $503.2 million to $5.60 billion in fiscal 2025. Excluding the impact of foreign currency, net sales increased 10.1% or $514.5 million. This increase in net sales was primarily due to an increase of $445.0 million in DTC sales as a result of an increase in both e-commerce and store sales, mainly driven by North America, Europe and Greater China. The increase in net sales was also attributed to a $89.4 million increase in wholesale sales, mainly driven by North America and Greater China.\n•\nKate Spade Net Sales\n decreased 10.3% or $137.3 million to $1.20 billion in fiscal 2025. Excluding the impact of foreign currency, net sales decreased 10.1% or $135.2 million. This decrease in net sales was due to a decrease of $148.7 million in DTC sales as a result of lower store and to a lesser extent, e-commerce sales. The decrease in DTC sales was partially offset by an increase of $10.2 million in wholesale sales.\n•\nStuart Weitzman Net Sales\n decreased 10.9% or $26.4 million to $215.1 million in fiscal 2025. Excluding the impact of foreign currency, net sales decreased 10.9% or $26.4 million.\nGross Profit\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nVariance\n(millions)\nAmount\n% of Net Sales\nAmount\n% of Net Sales\nAmount\n%\nCoach\n$\n4,372.5\n \n78.1\n \n%\n$\n3,875.4 \n76.1 \n%\n$\n497.1 \n12.8 \n%\nKate Spade\n798.0\n \n66.7\n \n871.2 \n65.2 \n(73.2)\n(8.4)\nStuart Weitzman \n118.4\n \n55.1\n \n142.9 \n59.2 \n(24.5)\n(17.1)\nTapestry\n$\n5,288.9\n \n75.4\n \n$\n4,889.5 \n73.3 \n$\n399.4 \n8.2 \nGross profit increased 8.2% or $399.4 million to $5.29 billion in fiscal 2025 from $4.89 billion in fiscal 2024. Gross margin in fiscal 2025 increased 210 basis points to 75.4% as compared to 73.3% in fiscal 2024. This increase in Gross margin was primarily attributed to net pricing improvements. \nThe Company includes inbound product-related transportation costs from our service providers within Cost of sales. The Company, similar to some companies, includes certain transportation-related costs due to our distribution network in SG&A expenses rather than in Cost of sales; for this reason, our gross margins may not be comparable to that of entities that include all costs related to their distribution network in Cost of sales.\n39\nSelling, General and Administrative Expenses\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nVariance\n(millions)\nAmount\n% of Net Sales\nAmount\n% of Net Sales\nAmount\n%\nCoach\n$\n2,497.2\n \n44.6\n \n%\n$\n2,224.3 \n43.7 \n%\n$\n272.9 \n12.3 \n%\nKate Spade\n(1)\n1,567.2\n \nNM\n738.6 \n55.3 \n828.6 \nNM\nStuart Weitzman\n(2)\n \n133.8\n \n62.2\n \n164.1 \n68.0 \n(30.3)\n(18.5)\nCorporate\n(3)(4)\n675.7\n \nNA\n622.4 \nNA\n53.3 \n8.6 \nTapestry\n$\n4,873.9\n \n69.5\n \n$\n3,749.4 \n56.2 \n$\n1,124.5 \n30.0 \nSG&A expenses increased 30.0% or $1.12 billion to $4.87 billion in fiscal 2025 as compared to $3.75 billion in fiscal 2024. As a percentage of net sales, SG&A expenses increased to 69.5% during fiscal 2025 as compared to 56.2% during fiscal 2024. Excluding items affecting comparability of $984.5 million in fiscal 2025, SG&A expenses increased 6.9% or $249.9 million to $3.89 billion from $3.64 billion in fiscal 2024. SG&A as a percentage of net sales increased 90 basis points to 55.4% as compared to 54.5% in fiscal 2024. This increase in SG&A as a percentage of net sales was primarily due to higher marketing spend and higher compensation costs driven by accrued incentive compensation, partially offset by leverage of fixed costs on higher net sales.\n(1)\nIn fiscal 2025, Kate Spade incurred charges affecting comparability of $860.5 million. Excluding those items affecting comparability, SG&A expenses decreased 4.3% or $31.9 million to $706.7 million in fiscal 2025 as compared to $738.6 million in fiscal 2024. SG&A as a percentage of net sales increased 380 basis points to 59.1% in fiscal 2025 as compared to 55.3% in fiscal 2024.\n(2)\nIn fiscal 2025, Stuart Weitzman\n \nincurred charges affecting comparability of $0.6 million. Excluding those items affecting comparability, SG&A expenses decreased 18.9% or $30.9 million to $133.2 million in fiscal 2025 as compared to $164.1 million in fiscal 2024. SG&A as a percentage of net sales decreased 610 basis points to 61.9% in fiscal 2025 as compared to 68.0% in fiscal 2024.\n(3)\nIn fiscal 2025, Corporate incurred charges affecting comparability of $122.6 million. Excluding those items affecting comparability, SG&A expenses increased 7.9% or $40.6 million to $553.1 million in fiscal 2025 as compared to $512.5 million in fiscal 2024.\n(4)\nCorporate expenses, which are included within SG&A expenses discussed above but are not directly attributable to a reportable segment.\nOperating Income (Loss)\nFiscal Year Ended\nJune 28, 2025\nJune 29, 2024\nVariance\n(millions)\nAmount\n% of Net Sales\nAmount\n% of Net Sales\nAmount\n%\nCoach\n$\n1,875.3\n \n33.5\n \n%\n$\n1,651.1 \n32.4 \n%\n$\n224.2 \n13.6 \n%\nKate Spade\n(769.2)\n(64.3)\n132.6 \n9.9 \n(901.8)\nNM\nStuart Weitzman \n(15.4)\n(7.1)\n(21.2)\n(8.8)\n5.8 \n27.8\nCorporate\n(675.7)\nNA\n(622.4)\nNA\n(53.3)\n(8.6)\nTapestry\n$\n415.0\n \n5.9\n \n$\n1,140.1 \n17.1 \n$\n(725.1)\n(63.6)\nOperating income decreased $725.1 million to $415.0 million during fiscal 2025 as compared to $1.14 billion in fiscal 2024. Operating margin was 5.9% in fiscal 2025 as compared to 17.1% in fiscal 2024. Excluding items affecting comparability of $984.5 million in fiscal 2025, operating income increased $149.5 million to $1.40 billion from $1.25 billion in fiscal 2024; and operating margin increased approximately 130 basis points to 20.0% in fiscal 2025 as compared to 18.7% in fiscal 2024. This increase in operating margin was primarily attributed to an increase of 210 basis points in gross margin partially offset by 90 basis points increase in SG&A as a percentage of sales.\n40\n•\nCoach Operating Income\n increased $224.2 million to $1.88 billion in fiscal 2025, resulting in an operating margin increase of 110 basis points to 33.5%, as compared to $1.65 billion and 32.4%, respectively in fiscal 2024. This increase in operating margin was primarily attributed to:\n◦\nGross Margin\n, increased 200 basis points mainly due to net pricing improvements;\n◦\nSG&A expenses as a percentage of net sales\n, increased 90 basis points mainly due to higher marketing spend, partially offset by leverage of fixed costs on higher net sales. \n•\nKate Spade Operating Loss \nincreased $901.8 million to a loss of $769.2 million in fiscal 2025, resulting in an operating margin of (64.3)%, as compared to income of $132.6 million and 9.9%, respectively in fiscal 2024. Excluding items affecting comparability, operating income decreased $41.3 million to $91.3 million in fiscal 2025 from $132.6 million in fiscal 2024; and operating margin decreased 230 basis points to 7.6% in fiscal 2025 as compared to 9.9% in fiscal 2024. This decrease in operating margin was primarily attributed to:\n◦\nGross Margin\n, increased 150 basis points mainly due to lower duty expenses, lower freight costs and net pricing improvements;\n◦\nSG&A expenses as a percentage of net sales\n, increased 380 basis points mainly driven by higher marketing spend, deleverage of fixed costs on lower net sales, partially offset by a decrease in distribution costs.\n•\nStuart Weitzman Operating Loss \ndecreased $5.8 million to a loss of $15.4 million in fiscal 2025, resulting in an operating margin increase of 170 basis points to (7.1)%, as compared to an operating loss of $21.2 million and operating margin of (8.8)% in fiscal 2024. Excluding items affecting comparability, operating loss decreased $6.4 million to a loss of $14.8 million in fiscal 2025 from a loss of $21.2 million in fiscal 2024; and operating margin increased 200 basis points to (6.8)% in fiscal 2025 as compared to (8.8)% in fiscal 2024. \n•\nCorporate Operating Expenses\n increased 8.6% or $53.3 million to $675.7 million in fiscal 2025. Excluding items affecting comparability, Corporate operating expenses increased $40.6 million to $553.1 million from $512.5 million in fiscal 2024. This increase in operating expenses was due to higher compensation costs driven by accrued incentive compensation and higher professional fees, partially offset by lower occupancy costs.\nLoss on Extinguishment of Debt\nLoss on extinguishment of debt increased $120.1 million in fiscal 2025 to $120.1 million as compared to $0.0 million in fiscal 2024. Excluding items affecting comparability, Loss on extinguishment of debt was $0.7 million in fiscal 2025 as compared to $0.0 million in fiscal 2024. \nInterest Expense, net\nInterest expense, net, decreased $39.6 million to $85.4 million in fiscal 2025 as compared to $125.0 million in fiscal 2024. Excluding items affecting comparability, Interest expense, net, increased $16.9 million to $25.2 million from $8.3 million in fiscal 2024. This increase in net interest expense was mainly due to an increase in interest expense as a result of the issuance of the 2030 and 2035 Senior Notes and borrowings under the Existing Revolving Credit Facility, partially offset by a decrease in interest expense as a result of the repayment of the Term Loan due 2027.\nOther Expense (Income)\nOther income increased $9.8 million to Other income of $6.6 million in fiscal 2025 as compared to Other expense of $3.2 million in fiscal 2024. This increase in Other income was related to an increase in foreign exchange gains. \nProvision (Benefit) for Income Taxes\nThe effective tax rate was 15.2% in fiscal 2025 as compared to 19.4% in fiscal 2024. Excluding items affecting comparability, the effective tax rate was 17.8% in fiscal 2025 as compared to 19.2% in fiscal 2024. The decrease in effective tax rate was primarily driven by discrete items recognized in the period, partially offset by geographic mix of earnings.\nNet Income (Loss)\nNet income decreased 77.6% or $632.8 million to $183.2 million in fiscal 2025 as compared to a net income of $816.0 million in fiscal 2024. Excluding items affecting comparability, net income increased 13.4% or $134.0 million to $1.13 billion in fiscal 2025 from $1.00 billion in fiscal 2024. \nNet Income (Loss) per Share\nNet income per diluted share was $0.82 in fiscal 2025 as compared to net income per diluted share of $3.50 in fiscal 2024. Excluding items affecting comparability, net income per diluted share increased $0.81 to $5.10 in fiscal 2025 from $4.29 in fiscal 2024. This change was primarily due to higher net income and a decrease in shares outstanding.\n41\nFISCAL 2024 COMPARED TO FISCAL 2023 \nThe comparison of fiscal 2024 to 2023 has been omitted from this Form 10-K, but can be referenced in our Form 10-K for the fiscal year ended June 29, 2024, filed on August 15, 2024 \nwithin Part II. Item 7. \"Management's Discussion and Analysis of Financial Conditions and Results of Operations\".\nNON-GAAP MEASURES \nThe Company’s reported results are presented in accordance with GAAP. The reported SG&A expenses, Operating income, Interest expense, Provision for income taxes, Net income and earnings per diluted share in fiscal 2025 and fiscal 2024 and the reported Loss on extinguishment of debt in fiscal 2025, reflect certain items affecting comparability, including the impact of Acquisition and Divestiture Costs, Organizational Efficiency Costs and Impairment charges. As a supplement to the Company's reported results, these measures are also reported on a non-GAAP basis to exclude the impact of these items along with a reconciliation to the most directly comparable GAAP measures. \nThe Company incurred Acquisition and Divestiture Costs which consist of non-recurring acquisition and divestiture costs, primarily financing-related expenses and professional fees from the terminated Capri Acquisition as well as costs related to the Stuart Weitzman Business Divestiture, inclusive of the loss on business held for sale, professional fees, share-based compensation expense and store impairment. The Company also incurred Organizational Efficiency Costs which consist of non-recurring costs, primarily from various initiatives aimed at streamlining the organization and optimizing processes. These costs mainly include one-time severance and technology related charges. Impairment charges incurred by the Company consist of non-recurring impairment costs related to Kate Spade indefinite-lived brand intangible assets and goodwill.\nThese non-GAAP performance measures were used by management to conduct and evaluate its business during its regular review of operating results for the periods affected. Management and the Company’s Board utilized these non-GAAP measures to make decisions about the uses of Company resources, analyze performance between periods, develop internal projections and measure management performance. The Company’s internal management reporting excluded these items. In addition, the human resources committee of the Company’s Board uses these non-GAAP measures when setting and assessing achievement of incentive compensation goals.\nThe Company operates on a global basis and reports financial results in U.S. dollars in accordance with GAAP. Fluctuations in foreign currency exchange rates can affect the amounts reported by the Company in U.S. dollars with respect to its foreign revenues and profit. Accordingly, certain material increases and decreases in operating results for the Company and its segments have been presented both including and excluding currency fluctuation effects. These effects occur from translating foreign-denominated amounts into U.S. dollars and comparing to the same period in the prior fiscal year. Constant currency information compares results between periods as if exchange rates had remained constant period-over-period. The Company calculates constant currency revenue results by translating current period revenue in local currency using the prior year period's currency conversion rate.\nWe believe these non-GAAP measures are useful to investors and others in evaluating the Company’s ongoing operating and financial results in a manner that is consistent with management's evaluation of business performance and understanding how such results compare with the Company’s historical performance. Additionally, we believe presenting certain increases and decreases in constant currency provides a framework for assessing the performance of the Company's business outside the United States and helps investors and analysts understand the effect of significant year-over-year currency fluctuations. We believe excluding these items assists investors and others in developing expectations of future performance.\nBy providing the non-GAAP measures, as a supplement to GAAP information, we believe we are enhancing investors’ understanding of our business and our results of operations. The non-GAAP financial measures are limited in their usefulness and should be considered in addition to, and not in lieu of, GAAP financial measures. Further, these non-GAAP measures may be unique to the Company, as they may be different from non-GAAP measures used by other companies.\nFor a detailed discussion on these non-GAAP measures, see the GAAP to Non-GAAP Reconciliation discussions above in this Item 7. \"Management’s Discussion and Analysis of Financial Condition and Results of Operations.\"\n42\nFINANCIAL CONDITION\nCash Flows - Fiscal 2025 Compared to Fiscal 2024 \nFiscal Year Ended\nJune 28,\n2025\nJune 29,\n2024\nChange\n(millions)\nNet cash provided by (used in) operating activities\n$\n1,216.6\n \n$\n1,255.6 \n$\n(39.0)\nNet cash provided by (used in) investing activities\n914.0\n \n(1,041.9)\n1,955.9 \nNet cash provided by (used in) financing activities\n(7,175.2)\n5,214.4 \n(12,389.6)\nEffect of exchange rate changes on cash and cash equivalents\n26.3\n \n(12.2)\n38.5 \nNet increase (decrease) in cash and cash equivalents\n$\n(5,018.3)\n$\n5,415.9 \n$\n(10,434.2)\nThe Company’s cash and cash equivalents decreased by $5.02 billion in fiscal 2025 compared to an increase of $5.42 billion in fiscal 2024, as discussed below.\nNet cash provided by (used in) operating activities\nNet cash provided by operating activities decreased $39.0 million primarily due to lower net income of $632.8 million and changes in operating assets and liabilities of $207.2 million partially offset by a higher impact of non-cash adjustments of $801.0 million primarily related to the impairment of goodwill and intangible assets.\nThe $207.2 million decrease in changes in operating asset and liability balances was primarily driven by the following: \n•\nInventories were a use of cash of $108.2 million in fiscal 2025 compared to a source of cash of $85.8 million in fiscal 2024, primarily driven by increased inventory purchases for Coach to support continued sales growth and pull forward of inventory receipts.\n•\nAccounts payable were a use of cash of $15.0 million in fiscal 2025 as compared to a source of cash of $49.1 million in fiscal 2024, primarily driven by a decrease in professional fees due to higher spending in the prior year related to the Capri Acquisition and timing of other payments, partially offset by an increase in advertising.\n•\nAccounts receivables were a source of cash of $8.8 million in fiscal 2025 as compared to a use of cash of $37.3 million in fiscal 2024, primarily driven by timing of collections.\nNet cash provided by (used in) investing activities\nNet cash provided by investing activities was $914.0 million in fiscal 2025 compared to a use of cash of $1.04 billion in fiscal 2024, resulting in a $1.96 billion increase in net cash provided by investing activities. \nThe $914.0 million source of cash in fiscal 2025 was primarily due to proceeds from maturities and sales of investments of $2.92 billion, partially offset by purchases of investments of $1.89 billion, mainly related to the proceeds of the Capri Acquisition Senior Notes.\nThe $1.04 billion use of cash in fiscal 2024 was primarily due to purchases of investments of $2.71 billion, partially offset by maturities and sales of investments of $1.68 billion, mainly related to the proceeds of the Capri Acquisition Senior Notes.\nNet cash provided by (used in) financing activities\nNet cash used in financing activities was $7.18 billion in fiscal 2025 as compared to a source of cash of $5.21 billion in fiscal 2024, resulting in a $12.39 billion increase in net cash used in financing activities.\nThe $7.18 billion use of cash in fiscal 2025 was primarily due to the repayment of debt of $7.16 billion, which mainly included the Capri Acquisition Senior Notes, use of cash of $2.02 billion under the Company's accelerated share repurchase program partially offset by proceeds from the issuance of debt of $2.25 billion.\nThe $5.21 billion source of cash in fiscal 2024 was primarily due to proceeds from the issuance of the Capri Acquisition Senior Notes of $6.09 billion, partially offset by the repayment of the Term Loan due 2027 of $468.8 million, and dividend payments of $321.4 million.\nEffect of exchange rate changes on cash and cash equivalents\nEffect of exchange rate changes on cash and cash equivalents was an increase of $26.3 million as compared to a decrease of $12.2 million in fiscal 2024.\n43\nCash Flows - Fiscal 2024 Compared to Fiscal 2023 \nThe comparison of fiscal \n2024\n to 2023 has been omitted from this Form 10-K, but can be referenced in our Form 10-K for the fiscal year ended June 29, 2024, filed on August 15, 2024\n within Part II. Item 7. \"Management's Discussion and Analysis of Financial Conditions and Results of Operations\"\n.\nWorking Capital and Capital Expenditures\nThe following table presents our financial condition as of June 28, 2025 and \nJune 29, 2024\n:\nJune 28, 2025\nJune 29, 2024\nChange\n(millions)\nCash and cash equivalents\n(1)\n$\n1,100.0\n \n$\n6,142.0 \n$\n(5,042.0)\nShort-term investments\n(1)\n19.6\n \n1,061.8 \n(1,042.2)\nCurrent debt\n(2)\n(16.7)\n(303.4)\n286.7 \nLong-term debt\n(2)\n(2,377.9)\n(6,937.2)\n4,559.3 \nTotal, net\n$\n(1,275.0)\n$\n(36.8)\n$\n(1,238.2)\n(1)    \nAs of June 28, 2025, approximately 26.2% of our Cash and cash equivalents and Short-term investments were held outside the United States. \n(2)    \nRefer to Note 12, \"Debt\" for discussion of the carrying values of our debt.\nSources of Liquidity\nOur primary sources of liquidity are the cash flows generated from our operations, our cash and cash equivalents and short-term investments, availability under our credit facilities and other available financing options.\nThe following table presents the total availability, borrowings outstanding and remaining availability under our credit facilities as of June 28, 2025:\nTotal Availability\nBorrowings Outstanding\nRemaining Availability\n(millions)\nAmended Revolving Credit Facility\n(1)\n$\n2,000.0\n \n$\n—\n \n$\n2,000.0\n \nChina Credit Facility\n(1)(2)\n34.9\n \n16.7\n \n18.2\n \nTotal\n$\n2,034.9\n \n$\n16.7\n \n$\n2,018.2\n \n(1)    \nRefer to Note 12, \"Debt\" for further information on these instruments.\n(2)     \nThe carrying amounts of the China Credit Facility include the impact of changes in the exchange rate of the United States Dollar against the Renminbi.\nWe believe that our Amended Revolving Credit Facility is adequately diversified with no undue concentrations in any one financial institution. As of June 28, 2025, there were 18 financial institutions participating in the Amended Revolving Credit Facility, with no one participant maintaining a commitment percentage in excess of 10%. We have no reason to believe, at this time, that the participating institutions will be unable to fulfill their obligations to provide financing in accordance with the terms of the facility in the event we elect to draw funds in the foreseeable future.\nWe have the ability to draw on our credit facilities or access other sources of financing options available to us in the credit and capital markets for, among other things, acquisition or integration-related costs, our restructuring initiatives, settlement of a material contingency or a material adverse business or macroeconomic development, as well as for other general corporate business purposes. \n44\nManagement believes that cash flows from operations, access to the credit and capital markets and our credit lines, on-hand cash and cash equivalents and our investments will provide adequate funds to support our operating, capital and debt service requirements for fiscal 2026 and beyond. There can be no assurance that any such capital will be available to the Company on acceptable terms or at all. Our ability to fund working capital needs, planned capital expenditures and scheduled debt payments, as well as to comply with all of the financial covenants under our debt agreements, depends on future operating performance and cash flow. This future operating performance and cash flow are subject to prevailing economic conditions and to financial, business and other factors, some of which are beyond the Company's control.\nStuart Weitzman Business Divestiture\nOn February 16, 2025, the Company entered into a Purchase Agreement to sell the Stuart Weitzman Business for total cash consideration of $105.0 million, subject to customary adjustments. The sale was completed on August 4, 2025. Refer to Note 5, \"Acquisitions and Divestitures,\" and Note 21, \"Subsequent Events,\" for further information. \nSupply Chain Finance\nTo improve our working capital efficiency, we make available to certain suppliers, a voluntary supply chain finance (“SCF”) program that enables our suppliers to sell their receivables from the Company to a global financial institution on a non-recourse basis at a rate that leverages our credit rating. We do not have the ability to refinance or modify payment terms to the global financial institution through the SCF program. No guarantees are provided by the Company or any of our subsidiaries under the SCF program. Refer to Note 3, \"Significant Accounting Policies,\" for additional information.\nCapital Expenditures\nTotal capital expenditures and cloud computing implementation costs were $153.0 million in fiscal 2025. Certain cloud computing implementation costs are recognized within Prepaid expenses and Other assets on the Consolidated Balance Sheets. \nSeasonality\nThe Company's results are typically affected by seasonal trends. During the first fiscal quarter, we typically build inventory for the winter and holiday season. In the second fiscal quarter, working capital requirements are reduced substantially as we generate higher net sales and operating income, especially during the holiday season. \nFluctuations in net sales, operating income and operating cash flows of the Company in any fiscal quarter may be affected by the timing of wholesale shipments and other events affecting retail sales, including weather and macroeconomic events.\nStock Repurchase Program\nOn May 12, 2022, the Company announced that its Board of Directors (the \"Board\") authorized a common stock repurchase program to repurchase up to $1.50 billion of its outstanding common stock (the \"2022 Share Repurchase Program\"). Purchases of the Company's common stock under this program were executed through open market purchases, including through purchase agreements under Rule 10b5-1. \nOn November 13, 2024, the Board authorized the Company to repurchase up to $2.00 billion of outstanding shares of its common stock (the \"2025 Share Repurchase Program\"). Under the 2025 Share Repurchase Program, the Company may repurchase shares on the open market, in privately negotiated transactions or in other transactions, including accelerated share repurchase programs. On November 21, 2024, the Company entered into accelerated share repurchase agreements (the “ASR Agreements”) with Bank of America, N.A. and Morgan Stanley & Co. LLC (the “Dealers”) to repurchase an aggregate of up to $2.00 billion of the Company’s shares of common stock. Under the ASR Agreements, the Company paid $2.00 billion to the Dealers and received an initial delivery of 28,363,766 shares of the Company's common stock on November 26, 2024. The total number of shares purchased by the Company pursuant to the ASR Agreements will be based on the volume-weighted average price (\"VWAP\") of the Company's common stock on specified dates during the term of each of the ASR Agreements, less a discount, and subject to adjustments pursuant to the terms and conditions of the ASR Agreements. The difference between the initially delivered shares and the total number of shares purchased will be settled in four tranches, no later than the first quarter of fiscal 2026. During the quarter ended March 29, 2025, the Company cash settled $3.0 million related to 43,094 shares of common stock owed for the settlement of one tranche as a result of the increase in the VWAP of the Company's common stock. During the quarter ended June 28, 2025, the Company cash settled $3.6 million related to 49,442 shares of common stock of an additional tranche. \nAs of June 28, 2025, the Company had $800.0 million of additional shares available to be repurchased as authorized under the 2022 Share Repurchase Program and no remaining availability to repurchase shares under the 2025 Share Repurchase Program. There were no shares repurchased during the three months ended June 28, 2025 under the 2022 Share Repurchase Program and the 2025 Share Repurchase Program.\n45\nContractual and Other Obligations\nFirm Commitments\nAs of June 28, 2025, the Company's contractual obligations are as follows:\nTotal\nFiscal\n2026\nFiscal\n2027 – 2028\nFiscal\n2029 – 2030\nFiscal 2031\nand Beyond\n(millions)\nCapital expenditure & cloud computing implementation commitments\n$\n34.3 \n$\n31.3 \n$\n3.0 \n$\n— \n$\n— \nInventory purchase obligations\n(1)\n353.0 \n353.0 \n— \n— \n— \nOperating lease obligations\n2,025.3 \n382.7 \n586.5 \n367.9 \n688.2 \nDebt repayment\n(2)\n2,413.3 \n16.7 \n396.6 \n750.0 \n1,250.0 \nInterest on outstanding debt\n(2)(3)\n771.8 \n131.5 \n214.0 \n189.5 \n236.8 \nOther\n222.3 \n101.8 \n111.7 \n8.8 \n— \nTotal\n$\n5,820.0\n \n$\n1,017.0\n \n$\n1,311.8\n \n$\n1,316.2\n \n$\n2,175.0\n \n(1)    \nIncludes inventory purchase obligations related to the Stuart Weitzman Business as of June 28, 2025 of $24.6 million. \n(2)    \nThe principal and interest of the China Credit Facility include the impact of changes in the exchange rate of the United States Dollar against the Renminbi as of June 28, 2025.\n(3)    \nInterest on outstanding debt includes fixed interest expenses for unsecured notes. Refer to Note 12, \"Debt,\" for further information. \nWe expect to fund these firm commitments with operating cash flows generated in the normal course of business and, if necessary, through availability under our credit facilities or other accessible sources of financing. Excluded from the above contractual obligations table is the non-current liability for unrecognized tax benefits of $137.5 million as of June 28, 2025, as we cannot make a reliable estimate of the period in which the liability will be settled, if ever. Besides the firm commitments noted above, the above table excludes other amounts included in current liabilities in the Consolidated Balance Sheets at June 28, 2025 as these items will be paid within one year and certain long-term liabilities not requiring cash payments. \nOff-Balance Sheet Arrangements\nIn addition to the commitments included in the table above, we have outstanding letters of credit, surety bonds and bank guarantees totaling $26.5 million as of June 28, 2025, primarily serving to collateralize our obligation to third parties for duty, leases, insurance claims and materials used in product manufacturing. These letters of credit expire at various dates through calendar 2039.\nWe do not maintain any other off-balance sheet arrangements, transactions, obligations or other relationships with unconsolidated entities that would be expected to have a material current or future effect on our consolidated financial statements. Refer to Note 13, \"Commitments and Contingencies,\" for further information.\n46\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe preparation of financial statements in conformity with accounting principles generally accepted in the United States of America requires management to make estimates and assumptions that affect our results of operations, financial condition and cash flows as well as the disclosure of contingent assets and liabilities as of the date of the Company's financial statements. Actual results could differ from estimates in amounts that may be material to the financial statements. Predicting future events is inherently an imprecise activity and, as such, requires the use of judgment. Actual results could differ from estimates in amounts that may be material to the financial statements. The development and selection of the Company’s critical accounting policies and estimates are periodically reviewed with the Audit Committee.\nThe accounting policies discussed below are considered critical because changes to certain judgments and assumptions inherent in these policies could affect the financial statements. For more information on the Company's accounting policies, please refer to the Notes to Consolidated Financial Statements.\nRevenue Recognition\nRevenue is recognized when the Company satisfies its performance obligations by transferring control of promised products or services to its customers, which may be at a point of time or over time. Control is transferred when the customer obtains the ability to direct the use of and obtain substantially all of the remaining benefits from the products or services. The amount of revenue recognized is the amount of consideration to which the Company expects to be entitled, including estimation of sale terms that may create variability in the consideration. Revenue subject to variability is constrained to an amount which will not result in a significant reversal in future periods when the contingency that creates variability is resolved.\nRetail store and concession shop-in-shop revenues are recognized at the point-of-sale, when the customer obtains physical possession of the products. Digital revenue from sales of products ordered through the Company’s e-commerce sites is recognized upon delivery and receipt of the shipment by its customers and includes shipping and handling charges paid by customers. Retail and digital revenues are recorded net of estimated returns, which are estimated by developing an expected value based on historical experience. Payment is due at the point of sale.\nThe Company recognizes revenue within the wholesale business at the time title passes and risk of loss is transferred to customers, which is generally at the point of shipment of products but may occur upon receipt of the shipment by the customer in certain cases. Wholesale revenue is recorded net of estimates for returns, discounts, end-of-season markdowns, cooperative advertising allowances and other consideration provided to the customer. The Company's historical estimates of these variable amounts have not differed materially from actual results.\nThe Company recognizes licensing revenue over time during the contract period in which licensees are granted access to the Company's trademarks. These arrangements require licensees to pay a sales-based royalty and may include a contractually guaranteed minimum royalty amount. Revenue for contractually guaranteed minimum royalty amounts is recognized ratably over the license year and any excess sales-based royalties are recognized as earned once the minimum royalty threshold is achieved.\nAt June 28, 2025, a 10% change in the allowances for estimated uncollectible accounts, markdowns and returns would not have resulted in a material change in the Company's reserves and net sales.\nInventories\nThe Company holds inventory that is sold through retail and wholesale distribution channels, including e-commerce sites. Substantially all of the Company's inventories are comprised of finished goods and are reported at the lower of cost or net realizable value. Inventory costs include material, conversion costs, freight and duties and are primarily determined on a weighted-average cost basis. The Company reserves for inventory, including slow-moving and aged inventory, based on current product demand, expected future demand and historical experience. A decrease in product demand due to changing customer tastes, buying patterns or increased competition could impact the Company's evaluation of its inventory and additional reserves might be required. Estimates may differ from actual results due to the quantity, quality and mix of products in inventory, consumer and retailer preferences and market conditions. At June 28, 2025, a 10% change in the inventory reserve, would not have resulted in a material change in inventory and cost of sales.\n47\nGoodwill and Other Intangible Assets\nUpon acquisition, the Company estimates and records the fair value of purchased intangible assets, which primarily consists of brands, customer relationships, right-of-use assets and order backlog. Goodwill and certain other intangible assets deemed to have indefinite useful lives, including brand intangible assets, are not amortized, but are assessed for impairment at least annually. Finite-lived intangible assets are amortized over their respective estimated useful lives and, along with other long-lived assets as noted above, are evaluated for impairment periodically whenever events or changes in circumstances indicate that their related carrying values may not be fully recoverable. Estimates of fair value for finite-lived and indefinite-lived intangible assets are primarily determined using discounted cash flows and the multi-period excess earnings method, respectively, with consideration of market comparisons as appropriate. This approach uses significant estimates and assumptions, including projected future cash flows, discount rates and growth rates.\nThe Company generally performs its annual goodwill and indefinite-lived intangible assets impairment analysis using a quantitative approach. The quantitative goodwill impairment test identifies the existence of potential impairment by comparing the fair value of each reporting unit with its carrying value, including goodwill. If the fair value of a reporting unit exceeds its carrying value, the reporting unit's goodwill is considered not to be impaired. If the carrying value of a reporting unit exceeds its fair value, an impairment charge is recognized in an amount equal to that excess. The impairment charge recognized is limited to the amount of goodwill allocated to that reporting unit.\nDetermination of the fair value of a reporting unit and intangible asset is based on management's assessment, considering independent third-party appraisals when necessary. Furthermore, this determination is judgmental in nature and often involves the use of significant estimates and assumptions, which may include projected future cash flows, discount rates, growth rates, and determination of appropriate market comparables and recent transactions. These estimates and assumptions could have a significant impact on whether or not an impairment charge is recognized and the amount of any such charge. \nThe Company performs its annual impairment assessment of goodwill as well as brand intangibles at the beginning of the fourth quarter of each fiscal year. During the fourth quarter of fiscal 2025, the Company performed its annual goodwill and indefinite-lived intangible assets impairment analysis. The assessment concluded that the fair values of the Kate Spade reporting unit and indefinite-lived brand intangible asset did not exceed their respective carrying values due to a reduction in both current and future expected cash flows, which includes an estimated impact of cost increases due to changes in tariff and trade policies. Accordingly, the Company recorded $244.1 million of impairment charges to goodwill for the Kate Spade reporting unit during the fourth quarter of the fiscal year. The Company also recorded an impairment charge of $610.7 million related to the Kate Spade indefinite-lived brand intangible. The Company determined that there was no impairment in fiscal 2024 or fiscal 2023. \nSeveral factors could impact the Kate Spade brand's ability to achieve expected future cash flows, including the optimization of the store fleet productivity, the success of international expansion strategies, the impact of promotional activity, continued economic volatility and potential operational challenges related to the macroeconomic factors, the reception of new collections in all business channels and other initiatives aimed at increasing profitability of the business. If profitability trends decline during fiscal 2026 from those that are expected, it is possible that an interim test, or our annual impairment test, could result in an impairment of these assets. \nBased on the annual assessment in fiscal 2025 of the Coach brand reporting unit, the Company determined the fair values significantly exceeded their respective carrying values, therefore resulting in no impairment.\nValuation of Long-Lived Assets\nLong-lived assets, such as Property and equipment and Operating lease right-of-use (\"ROU\") assets, are evaluated for impairment whenever events or circumstances indicate that the carrying value of the assets may not be recoverable. In evaluating long-lived assets for recoverability, the Company uses its best estimate of future cash flows expected to result from the use of the related asset group and its eventual disposition. To the extent that estimated future undiscounted net cash flows attributable to the asset are less than its carrying value, an impairment loss is recognized equal to the difference between the carrying value of such asset and its fair value, considering external market participant assumptions.\nIn determining future cash flows, the Company takes various factors into account, including the effects of macroeconomic trends such as consumer spending, in-store capital investments, promotional cadence, the level of advertising and changes in merchandising strategy. Since the determination of future cash flows is an estimate of future performance, there may be future impairments in the event that future cash flows do not meet expectations.\nThe Company recorded $\n8.8\n million and $\n6.3\n million of impairment charges within SG&A expense in the Consolidated Statement of Operations in fiscal 2025 and fiscal 2024, respectively.\n48\nShare-Based Compensation\nThe Company recognizes the cost of equity awards to employees and the non-employee Directors based on the grant-date fair value of those awards. The grant-date fair values of share unit awards are based on the fair value of the Company's common stock on the date of grant. The grant-date fair value of stock option awards is determined using the Black-Scholes option pricing model and involves several assumptions, including the expected term of the option, expected volatility and dividend yield. The expected term of options represents the period of time that the options granted are expected to be outstanding and is based on historical experience. Expected volatility is based on historical volatility of the Company’s stock as well as the implied volatility from publicly traded options on the Company's stock. Dividend yield is based on the current expected annual dividend per share and the Company’s stock price. Changes in the assumptions used to determine the Black-Scholes value could result in significant changes in the Black-Scholes value. \nFor stock options and share unit awards, the Company recognizes share-based compensation net of estimated forfeitures and revises the estimates in subsequent periods if actual forfeitures differ from the estimates. The Company estimates the forfeiture rate based on historical experience as well as expected future behavior.\nThe Company grants performance-based share awards to key executives, the vesting of which is subject to the executive’s continuing employment and the Company's or individual's achievement of certain performance goals. On a quarterly basis, the Company assesses actual performance versus the predetermined performance goals and adjusts the share-based compensation expense to reflect the relative performance achievement. Actual distributed shares are calculated upon conclusion of the service and performance periods, and include dividend equivalent shares. If the performance-based award incorporates a market condition, the grant-date fair value of such award is determined using a pricing model, such as a Monte Carlo Simulation.\nA hypothetical 10% change in our stock-based compensation expense would not have a material impact to our fiscal 2025 net income.\nIncome Taxes\nThe Company’s effective tax rate is based on pre-tax income, statutory tax rates, tax laws and regulations and tax planning strategies available in the various jurisdictions in which the Company operates. The Company classifies interest and penalties on uncertain tax positions in the Provision for income taxes. The Company records net deferred tax assets to the extent it believes that it is more likely than not that these assets will be realized. In making such determination, the Company considers all available evidence, including scheduled reversals of deferred tax liabilities, projected future taxable income, tax planning strategies and recent and expected future results of operation. The Company reduces deferred tax assets by a valuation allowance if, based upon the weight of available evidence, it is more likely than not that some amount of deferred tax assets is not expected to be realized. The Company is not permanently reinvested with respect to earnings of a limited number of foreign entities and has recorded the tax consequences of remitting earnings from these entities. The Company is permanently reinvested with respect to all other earnings. \nThe Company recognizes the impact of tax positions in the financial statements if those positions will more likely than not be sustained on audit, based on the technical merits of the position. Although the Company believes that the estimates and assumptions used are reasonable and legally supportable, the final determination of tax audits could be different than that which is reflected in historical tax provisions and recorded assets and liabilities. Tax authorities periodically audit the Company’s income tax returns, these tax authorities may take a contrary position that could result in a significant impact on the Company's results of operations. Significant management judgment is required in determining the effective tax rate, in evaluating tax positions and in determining the net realizable value of deferred tax assets.\nRefer to Note 15, “Income Taxes,” for further information.\nRecent Accounting Pronouncements\nRefer to Note 3, \"Significant Accounting Policies,\" to the accompanying audited consolidated financial statements for a description of certain recently adopted, issued or proposed accounting standards which may impact our consolidated financial statements in future reporting periods.\n49",
  "item2": null
}