{
  "source_file": "tpr-20250927.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.     MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of the Company's financial condition and results of operations should be read together with the Company's condensed consolidated financial statements and notes to those financial statements included elsewhere in this document. When used herein, the terms \"the Company,\" \"Tapestry,\" \"we,\" \"us\" and \"our\" refer to Tapestry, Inc., including consolidated subsidiaries. References to \"Coach,\" \"Stuart Weitzman,\" \"Kate Spade\" or \"kate spade new york\" refer only to the referenced brand.\nINTRODUCTION\nManagement’s discussion and analysis of financial condition and results of operations (“MD&A”) is provided as a supplement to the accompanying consolidated financial statements and notes thereto to help provide an understanding of our results of operations, financial condition, and liquidity. MD&A is organized as follows:\n•\nOverview.\n This section provides a general description of the business and brands as well as the Company’s growth strategy.\n•\nGlobal Economic Conditions and Industry Trends.\n This section includes a discussion on global economic conditions and industry trends that affect comparability that are important in understanding results of operations and financial conditions, and in anticipating future trends.\n•\nResults of Operations.\n An analysis of our results of operations in the first quarter of fiscal 2026 compared to the first quarter of fiscal 2025.\n•\nNon-GAAP Measures.\n This section includes non-GAAP measures that are useful to investors and others in evaluating the Company’s ongoing operating and financial results in a manner that is consistent with management's evaluation of business performance and understanding how such results compare with the Company’s historical performance.\n•\nFinancial Condition.\n This section includes a discussion on liquidity and capital resources including an analysis of changes in cash flow as well as working capital and capital expenditures.\n•\nCritical Accounting Policies and Estimates. \nThis section includes any material changes or updates to critical accounting policies or estimates since the Annual Report on Form 10-K for fiscal 2025.\nOVERVIEW\nTapestry, Inc. is a house of iconic accessories and lifestyle brands. Our global house of brands unites the magic of Coach and kate spade new york. Each of our brands are unique and independent, while sharing a commitment to innovation and authenticity defined by distinctive products and differentiated customer experiences across channels and geographies. We use our collective strengths to move our customers and empower our communities, to make the fashion industry more sustainable, and to harness the power of an inclusive culture. Individually, our brands are iconic. Together, we can stretch what’s possible.\nThe Company has two reportable segments:\n•\nCoach - \nIncludes global sales of primarily Coach brand products to customers through our DTC, wholesale and licensing businesses.\n•\nKate Spade \n- Includes global sales primarily of kate spade new york brand products to customers through our DTC, wholesale and licensing businesses.\n2028 Growth Strategy\nIn the first quarter of fiscal 2026, the Company introduced its 2028 growth strategy (“Amplify”), which focuses on four key pillars:\n•\nBuild Emotional Connections with Consumers: The Company aims to drive new customer acquisition, with a focus on Gen Z consumers entering the market to build brand love and lifetime value.\n•\nFueling Fashion Innovation & Product Excellence: The Company aims to lead with handbags and leathergoods with targeted lifestyle expansion in footwear.\n•\nDelivering Compelling Experiences to Drive Global Growth: The Company aims to sustain growth in North America and accelerate momentum in international markets, prioritizing Greater China and Europe.\n•\nIgnite the Power of Our People: The Company aims to future-proof growth by continuing to develop a consumer-obsessed culture that is agile and always looking forward. \n27\nStuart Weitzman Business\n \nDivestiture\nOn February 16, 2025, the Company entered into a sale and purchase agreement (the “Purchase Agreement”) with Caleres, Inc. (the “Purchaser”) to sell the Stuart Weitzman Business (as defined below). The Purchaser acquired certain assets and liabilities of the Company's global business of designing, manufacturing, promotion, marketing, production, distribution, sales and licensing of Stuart Weitzman branded products (the \"Stuart Weitzman Business\") for total cash consideration of $105.0 million (the \"Purchase Price\"). The Purchase Price was subject to customary adjustments for cash, indebtedness, net working capital and transaction expenses. The sale was completed on August 4, 2025 (the \"Stuart Weitzman Business Divestiture\"). Refer to Note 5, \"Acquisitions and Divestitures\" for further information.\nCapri Holdings Limited Acquisition\nOn August 10, 2023, the Company entered into the Merger Agreement by and among the Company, Sunrise Merger Sub, Inc., a direct wholly owned subsidiary of Tapestry, and Capri. In order to finance the Capri Acquisition, on November 27, 2023, the Company issued $4.50 billion of U.S. dollar-denominated senior unsecured notes and €1.50 billion of Euro-denominated senior unsecured notes (the \"Capri Acquisition Senior Notes\") which, together with the $1.40 billion of delayed draw unsecured term loan facilities (the \"Capri Acquisition Term Loan Facilities\") executed on August 30, 2023, completed the expected financing for the Capri Acquisition. On April 22, 2024, the FTC filed a complaint against the Company and Capri in the United States District Court for the Southern District of New York seeking to enjoin the consummation of the Capri Acquisition, and on October 24, 2024, the Court issued its Opinion and Order granting the FTC's request for a preliminary injunction of the Merger, pending an administrative trial on the merits which was scheduled to begin on December 9, 2024. On November 13, 2024, the Parties entered into a Termination Agreement (the “Termination Agreement”), pursuant to which the Parties agreed to terminate the Merger Agreement, including all schedules and exhibits thereto and all ancillary agreements contemplated thereby or entered pursuant thereto, effective immediately. Pursuant to the Termination Agreement, the Company agreed to reimburse Capri for its expenses in an amount equal to $45.1 million in cash on November 14, 2024. On November 25, 2024, due to the termination of the Merger Agreement and pursuant to the terms of the indenture governing the Capri Acquisition Senior Notes, as supplemented, the Company redeemed all outstanding Capri Acquisition Senior Notes at a redemption price of 101% of the aggregate principal amount of such Capri Acquisition Senior Notes, plus accrued and unpaid interest to, but excluding, the date of redemption. In addition, the Capri Acquisition Term Loan Facilities were terminated concurrently with the execution of the Termination Agreement on November 13, 2024. Refer to Note 5, \"Acquisitions and Divestitures\" for further information.\nGLOBAL ECONOMIC CONDITIONS AND INDUSTRY TRENDS\nThe environment in which we operate is subject to a number of different factors driving global consumer spending. Consumer preferences, macroeconomic conditions, foreign currency fluctuations and geopolitical events continue to impact overall levels of consumer travel and spending on discretionary items, with inconsistent patterns across business channels and geographies.\nWe will continue to monitor the below trends and evaluate and adjust our operating strategies and cost management opportunities to mitigate the related impact on our results of operations, while remaining focused on the long-term growth of our business and protecting the value of our brands.\nFor a detailed discussion of significant risk factors that have the potential to cause our actual results to differ materially from our expectations, see Part I, Item 1A. \"Risk Factors\" herein and as disclosed in our Annual Report on Form 10-K for the year ended June 28, 2025.\nCurrent Macroeconomic Conditions and Outlook\n \nCurrency volatility, geopolitical instability and political uncertainty, such as the impact of policies implemented and that may be implemented by the U.S. Presidential Administration, including, but not limited to, changes to trade agreements, tax legislation or duty rates may also contribute to a worsening of the macroeconomic environment or adversely impact our business. \nDuring the second half of fiscal 2025, the U.S. Government announced tariffs on imports from select countries. The majority of the Company's products sold in the U.S. are imported from countries in which these tariffs were announced. Additionally, during the first quarter of fiscal 2026, the President of the United States issued an executive order removing the de minimis exemption for low value shipments imported into the U.S. for all countries beginning August 29, 2025. As a result of these changes in the tariff landscape, including the de minimis removal, during the first quarter of fiscal 2026 the Company's gross margin was negatively impacted by approximately 70 basis points. The Company continues to expect to take actions to mitigate the negative impacts of these incremental costs during the remainder of the fiscal year and beyond.\nDuring the first quarter of fiscal 2026, the macroeconomic environment remained challenging and volatile. Several organizations that monitor the world’s economy, including the International Monetary Fund, continue to forecast growth in the global economy, and remains mostly unchanged since the fourth quarter of fiscal 2025. The forecast is below the historical \n28\ngrowth average and is reflective of the current volatile environment, including escalation of trade tensions, financial market volatility and the negative economic impacts of geopolitical instability in certain regions of the world.\nIn the first quarter of fiscal 2026, the U.S. Dollar continued to fluctuate as compared to foreign currencies in regions where we conduct our business. This trend has resulted in impacts to our business including, but not limited to, an increase in Net sales of $10.6 million and a negative impact to gross margin and operating margin of approximately 60 basis points and 50 basis points, respectively. \nIn response to the current environment, the Company is closely monitoring changes and continues to take strategic actions considering near-term exigencies and remains committed to maintaining the health of the brands and business.\nTax Legislation\nOn August 16, 2022, the Inflation Reduction Act of 2022 was signed into law, with tax provisions primarily focused on implementing a 15% corporate alternative minimum tax (“CAMT”) on global adjusted financial statement income and a 1% excise tax on share repurchases. The CAMT was effective at the beginning of fiscal 2024 and did not have a material impact on the Company’s effective tax rate.\nOn December 12, 2022, the E.U. member states also reached an agreement to implement the Organization for Economic Co-operation and Development’s (“OECD”) reform of international taxation known as \nPillar Two\n Global Anti-Base Erosion Rules (“GloBE”), which broadly mirrors the Inflation Reduction Act by imposing a 15% global minimum tax on multinational companies, which was effective on January 1, 2025. Based on the countries in which we do business, these changes did not have a material impact in fiscal 2025. Other countries are also implementing similar legislation with effective dates starting in fiscal 2026, known as Qualifying Domestic Minimum Top-Up Tax (\"QDMTT\"). On June 26, 2025, the U.S. Treasury reached an agreement with the other G7 countries regarding the application of GloBE rules to U.S. parented multinational enterprises (\"U.S. MNEs\"). Most notably, the agreement includes a full exclusion for U.S. MNEs from the Undertaxed Profits Rule and Income Inclusion Rule, which are two of the three taxing mechanisms under GloBE. Given that the third mechanism, QDMTT is still in force, it is unclear what impact if any the OECD agreement will have on the Company. Based on current legislation, QDMTT will have a negative impact on the Company's effective tax rate in fiscal 2026 and beyond. \nSeasonality\nThe Company's results are typically affected by seasonal trends. During the first fiscal quarter, we typically build inventory for the winter and holiday season. In the second fiscal quarter, working capital requirements are reduced substantially as we generate higher net sales and operating income, especially during the holiday season. \nFluctuations in net sales, operating income and operating cash flows of the Company in any fiscal quarter may be affected by the timing of wholesale shipments and other events affecting retail sales, including weather and macroeconomic events.\n29\nRESULTS OF OPERATIONS \nFIRST QUARTER FISCAL 2026 COMPARED TO FIRST QUARTER FISCAL 2025\nThe following table summarizes results of operations for the first quarter of fiscal 2026 compared to the first quarter of fiscal 2025. All percentages shown in the table below and the discussion that follows have been calculated using unrounded numbers. \nThree Months Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nVariance\n \n(millions, except per share data) \n \nAmount\n% of\nNet sales\nAmount\n% of\nNet sales\nAmount\n%\nNet sales\n$\n1,704.6\n \n100.0\n \n%\n$\n1,507.5 \n100.0 \n%\n$\n197.1 \n13.1 \n%\nGross profit\n1,300.5\n \n76.3\n \n1,134.9 \n75.3 \n165.6 \n14.6 \nSG&A expenses\n972.3\n \n57.0\n \n882.9 \n58.6 \n89.4 \n10.1 \nOperating income (loss)\n328.2\n \n19.3\n \n252.0 \n16.7 \n76.2 \n30.2 \nInterest expense, net\n12.8\n \n0.8\n \n30.7 \n2.0 \n(17.9)\n(58.2)\nOther expense (income)\n(3.3)\n(0.2)\n(4.4)\n(0.3)\n1.1 \n24.8 \nProvision (benefit) for income taxes\n43.9\n \n2.6\n \n39.1 \n2.6 \n4.8 \n12.3 \nNet income (loss)\n274.8\n \n16.1\n \n186.6 \n12.4 \n88.2 \n47.2 \nNet income (loss) per share:\n \n \n \n \nBasic\n$\n1.32\n \n \n$\n0.81 \n \n$\n0.51 \n64.2 \nDiluted\n$\n1.28\n \n \n$\n0.79 \n \n$\n0.49 \n61.2 \nNM - Not meaningful\n30\nGAAP to Non-GAAP Reconciliation\nThe Company’s reported results are presented in accordance with accounting principles generally accepted in the United States of America (\"GAAP\"). The reported results during the first quarter of fiscal 2026 and fiscal 2025 reflect certain items which affect the comparability of our results, as noted in the following table. Refer to \"Non-GAAP Measures\" herein for further discussion on the Non-GAAP measures.\nStuart Weitzman Divestiture \nThe Company made certain changes to the composition of segment information effective in the first quarter of fiscal 2026 as a result of the sale of Stuart Weitzman on August 4, 2025. As of the first quarter of fiscal 2026, the Company's reportable segments are Coach and Kate Spade. For the first quarter of fiscal 2026, prior to the completion of the sale on August 4, 2025, Stuart Weitzman Net sales were $14.6 million, Gross profit was $7.7 million and SG&A expenses were $8.7 million resulting in an Operating loss of $1.0 million. These results were considered as Items Affecting Comparability in the three months ended September 27, 2025. For the first quarter of fiscal 2025, Stuart Weitzman Net sales were $53.7 million, Gross profit was $29.2 million and SG&A expenses were $36.6 million resulting in an Operating loss of $7.4 million. These results were not considered as Items Affecting Comparability in the three months ended September 28, 2024.\nFirst Quarter Fiscal 2026 Items\nThree Months Ended September 27, 2025\nItems Affecting Comparability\n \nGAAP Basis\n(As Reported)\nAcquisition and Divestiture Costs\nOrganizational Efficiency Costs\nNon-GAAP Basis\n(Excluding Items)\n(millions, except per share data) \nCoach\n$\n487.4\n \n$\n—\n \n$\n(1.2)\n$\n488.6\n \nKate Spade\n5.6\n \n—\n \n(0.2)\n5.8\n \nStuart Weitzman\n(1.0)\n(1.0)\n—\n \n—\n \nCorporate\n(163.8)\n(13.7)\n(9.6)\n(140.5)\nOperating income (loss)\n$\n328.2\n \n$\n(14.7)\n$\n(11.0)\n$\n353.9\n \nNet income (loss)\n$\n274.8\n \n$\n(13.4)\n$\n(8.9)\n$\n297.1\n \nNet income (loss) per diluted common share\n$\n1.28\n \n$\n(0.06)\n$\n(0.04)\n$\n1.38\n \nIn the first quarter of fiscal 2026, the Company incurred charges as follows:\n•\nAcquisition and Divestiture\n - Total pre-tax charges of $14.7 million related to the Stuart Weitzman divestiture primarily due to professional fees, severance costs as well as the Stuart Weitzman Operating loss for the period. \n•\nOrganizational Efficiency Costs\n - Total pre-tax charges of $11.0 million primarily related to technology costs and severance costs.\n    These actions taken together negatively impacted operating income by $25.7 million and reduced the provision for income tax by $3.4 million resulting in a net decrease in net income by $22.3 million or $0.10 per diluted share.\nSupplemental Segment Data\nThree Months Ended September 27, 2025\nItems Affecting Comparability\n \nGAAP Basis\n(As Reported)\nAcquisition and Divestiture Costs\nOrganizational Efficiency Costs\nNon-GAAP Basis\n(Excluding Items)\n(millions)\nCoach\n$\n638.6\n \n$\n—\n \n$\n1.2\n \n$\n637.4\n \nKate Spade\n161.2\n \n—\n \n0.2\n \n161.0\n \nStuart Weitzman\n8.7\n \n8.7\n \n—\n \n—\n \nCorporate\n163.8\n \n13.7\n \n9.6\n \n140.5\n \nSG&A expenses\n$\n972.3\n \n$\n22.4\n \n$\n11.0\n \n$\n938.9\n \n31\nFirst Quarter Fiscal 2025 Items\nThree Months Ended September 28, 2024\nItems Affecting Comparability\n \nGAAP Basis\n(As Reported)\nAcquisition Costs\nNon-GAAP Basis\n(Excluding Items)\n(millions, except per share data) \nCoach\n$\n386.6 \n$\n— \n$\n386.6 \nKate Spade\n27.0 \n— \n27.0 \nStuart Weitzman\n(7.4)\n— \n(7.4)\nCorporate\n(154.2)\n(33.4)\n(120.8)\nOperating income (loss)\n$\n252.0 \n$\n(33.4)\n$\n285.4 \nNet income (loss)\n$\n186.6 \n$\n(55.0)\n$\n241.6 \nNet income (loss) per diluted common share\n$\n0.79 \n$\n(0.23)\n$\n1.02 \nIn the first quarter of fiscal 2025, the Company incurred charges as follows:\n•\nAcquisition Costs\n - Total pre-tax charges of $70.8 million attributable to the Capri Acquisition. These charges include $37.4 million related to financing recorded in interest expense and $33.4 million primarily related to professional fees recorded in SG&A expense within Corporate.\n    These actions taken together negatively impacted operating income by $33.4 million, increased interest expense by $37.4 million and reduced the provision for income tax by $15.8 million resulting in a net decrease in net income by $55.0 million or $0.23 per diluted share.\nSupplemental Segment Data\nThree Months Ended September 28, 2024\nItems Affecting Comparability\n \nGAAP Basis\n(As Reported)\nAcquisition Costs\nNon-GAAP Basis\n(Excluding Items)\n(millions)\nCoach\n$\n529.5 \n$\n— \n$\n529.5 \nKate Spade\n162.6 \n— \n162.6 \nStuart Weitzman\n36.6 \n— \n36.6 \nCorporate\n154.2 \n33.4 \n120.8 \nSG&A expenses\n$\n882.9 \n$\n33.4 \n$\n849.5 \n32\nTapestry, Inc. Summary – First Quarter of Fiscal 2026 \nCurrency Fluctuation Effects\nThe change in Net sales for the first quarter of fiscal 2026 compared to the first quarter of fiscal 2025 has been presented both including and excluding currency fluctuation effects. All percentages shown in the tables below and the discussion that follows have been calculated using unrounded numbers.\nStuart Weitzman Divestiture \nThe Company made certain changes to the composition of segment information effective in the first quarter of fiscal 2026 as a result of the sale of Stuart Weitzman on August 4, 2025. As of the first quarter of fiscal 2026, the Company's reportable segments are Coach and Kate Spade. For the first quarter of fiscal 2026, prior to the completion of the sale on August 4, 2025, Stuart Weitzman Net sales were $14.6 million, Gross profit was $7.7 million and SG&A expenses were $8.7 million resulting in an Operating loss of $1.0 million. These results were considered as Items Affecting Comparability in the three months ended September 27, 2025. For the first quarter of fiscal 2025, Stuart Weitzman Net sales were $53.7 million, Gross profit was $29.2 million and SG&A expenses were $36.6 million resulting in an Operating loss of $7.4 million. These results were not considered as Items Affecting Comparability in the three months ended September 28, 2024.\nNet Sales\nThree Months Ended\nVariance\nSeptember 27,\n2025\nSeptember 28,\n2024\nAmount\n%\nConstant Currency Change\n(millions)\nCoach\n$\n1,429.8\n \n$\n1,170.6 \n$\n259.2 \n22.1 \n%\n21.3 \n%\nKate Spade\n260.2\n \n283.2 \n(23.0)\n(8.1)\n(8.6)\nStuart Weitzman \n14.6\n \n53.7 \n(39.1)\n(72.8)\n(72.8)\nTotal Tapestry\n$\n1,704.6\n \n$\n1,507.5 \n$\n197.1 \n13.1 \n12.4 \nNet sales in the first quarter of fiscal 2026 increased 13.1% or $197.1 million to $1.70 billion. Excluding the impact of the Stuart Weitzman Business and foreign currency, net sales increased by 15.5% or $225.6 million. \n•\nCoach Net sales\n increased 22.1% or $259.2 million to $1.43 billion in the first quarter of fiscal 2026. Excluding the impact of foreign currency, Net sales increased 21.3% or $249.9 million. This increase in Net sales was primarily due to an increase of $222.7 million in DTC sales as a result of an increase in both store sales and e-commerce, mainly driven by North America, Greater China and Europe.\n•\nKate Spade Net sales \ndecreased 8.1% or $23.0 million to $260.2 million in the first quarter of fiscal 2026. Excluding the impact of foreign currency, Net sales decreased 8.6% or $24.3 million. This decrease in Net sales was primarily due to a decrease of $28.1 million in DTC sales as a result of lower store and e-commerce sales.\n33\nGross Profit\nThree Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nVariance\n(millions)\nAmount\n% of Net sales\nAmount\n% of Net sales\nAmount\n%\nCoach\n$\n1,126.0\n \n78.8\n \n%\n$\n916.1 \n78.3 \n%\n$\n209.9 \n22.9 \n%\nKate Spade\n166.8\n \n64.1\n \n189.6 \n67.0 \n(22.8)\n(12.0)\nStuart Weitzman \n7.7\n \n52.3\n \n29.2 \n54.4 \n(21.5)\n(73.8)\nTotal Tapestry\n$\n1,300.5\n \n76.3\n \n$\n1,134.9 \n75.3 \n$\n165.6 \n14.6 \nGross profit increased 14.6% or $165.6 million to $1.30 billion in the first quarter of fiscal 2026 from $1.13 billion in the first quarter of fiscal 2025. Gross margin increased 100 basis points to 76.3% in the first quarter of fiscal 2026 from 75.3% in the first quarter of fiscal 2025. Excluding items affecting comparability, Gross margin increased 120 basis points to 76.5% in the first quarter of fiscal 2026 from 75.3% in the first quarter of fiscal 2025, which includes a 70 basis point benefit from the divestiture of Stuart Weitzman. The remaining 50 basis point increase in Gross margin was primarily attributed to net pricing improvements, partially offset by the impact of higher tariffs and unfavorable currency impacts. Refer to \"Current Macroeconomic Conditions and Outlook\" for further information.\nThe Company includes inbound product-related transportation costs from our service providers within Cost of sales. The Company, similar to some companies, includes certain transportation-related costs due to our distribution network in SG&A expenses rather than in Cost of sales; for this reason, our gross margins may not be comparable to that of entities that include all costs related to their distribution network in Cost of sales.\nSelling, General and Administrative Expenses (\"SG&A\")\nThree Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nVariance\n(millions)\nAmount\n% of Net sales\nAmount\n% of Net sales\nAmount\n%\nCoach\n(1)\n$\n638.6\n \n44.7\n \n%\n$\n529.5 \n45.3 \n%\n$\n109.1 \n20.6 \n%\nKate Spade\n(2)\n161.2\n \n61.9\n \n162.6 \n57.3 \n(1.4)\n(0.9)\nStuart Weitzman\n8.7\n \n59.3\n \n36.6 \n68.1 \n(27.9)\n(76.3)\nCorporate\n(3)(4)\n163.8\n \nNA\n154.2 \nNA\n9.6 \n6.3 \nTotal Tapestry\n$\n972.3\n \n57.0\n \n$\n882.9 \n58.6 \n$\n89.4 \n10.1 \nSG&A expenses increased 10.1% or $89.4 million to $972.3 million in the first quarter of fiscal 2026 as compared to $882.9 million in the first quarter of fiscal 2025. As a percentage of net sales, SG&A expenses decreased to 57.0% during the first quarter of fiscal 2026 from 58.6% during the first quarter of fiscal 2025. Excluding items affecting comparability in the first quarter of fiscal 2026, SG&A expenses increased 10.5% or $89.4 million to $938.9 million from $849.5 million in the first quarter of fiscal 2025. SG&A as a percentage of net sales decreased 80 basis points to 55.6% compared to 56.4% during the first quarter of fiscal 2025, which includes a 40 basis point benefit from the divestiture of Stuart Weitzman. The remaining 40 basis point decrease in SG&A as a percentage of net sales was primarily due to leverage of fixed costs on higher net sales, partially offset by higher marketing spend.\n(1)\nExcluding items affecting comparability, SG&A expenses increased 20.4% or $107.9 million to $637.4 million in the first quarter of fiscal 2026 as compared to $529.5 million in the first quarter of fiscal 2025. SG&A as a percentage of net sales decreased 70 basis points to 44.6% in the first quarter of fiscal 2026 as compared to 45.3% in the first quarter of fiscal 2025.\n(2)\nExcluding items affecting comparability, SG&A expenses decreased 1.0% or $1.6 million to $161.0 million in the first quarter of fiscal 2026 as compared to $162.6 million in the first quarter of fiscal 2025. SG&A as a percentage of net sales increased approximately 460 basis points to 61.9% in the first quarter of fiscal 2026 as compared to 57.3% in the first quarter of fiscal 2025.\n(3)\nExcluding items affecting comparability, SG&A expenses increased 16.3% or $19.7 million to $140.5 million in the first quarter of fiscal 2026 as compared to $120.8 million in the first quarter of fiscal 2025.\n34\n(4)\nCorporate expenses, which are included within SG&A expenses discussed above, but are not directly attributable to a reportable segment.\nOperating Income (Loss)\nThree Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nVariance\n(millions)\nAmount\n% of Net Sales\nAmount\n% of Net Sales\nAmount\n%\nCoach\n$\n487.4\n \n34.1\n \n%\n$\n386.6 \n33.0 \n%\n$\n100.8 \n26.1 \n%\nKate Spade\n5.6\n \n2.1\n \n27.0 \n9.6 \n(21.4)\n(79.3)\nStuart Weitzman \n(1.0)\n(7.0)\n(7.4)\n(13.7)\n6.4 \n86.2 \nCorporate\n(163.8)\nNA\n(154.2)\nNA\n(9.6)\n(6.3)\nTotal Tapestry\n$\n328.2\n \n19.3\n \n$\n252.0 \n16.7 \n$\n76.2 \n30.2 \nOperating income increased $76.2 million to $328.2 million in the first quarter of fiscal 2026 as compared to $252.0 million in the first quarter of fiscal 2025. Operating margin increased to 19.3% in the first quarter of fiscal 2026 as compared to 16.7% in the first quarter of fiscal 2025. Excluding items affecting comparability, operating income increased $68.5 million to $353.9 million in the first quarter of fiscal 2026 from $285.4 million in the first quarter of fiscal 2025. Operating margin increased 200 basis points to 20.9% in the first quarter of fiscal 2026 as compared to 18.9% in the first quarter of fiscal 2025, which includes a 110 basis point benefit from the divestiture of Stuart Weitzman. The remaining 90 basis point increase in operating margin was primarily attributed to a 50 basis point increase in Gross margin and a 40 basis point decrease in SG&A as a percentage of sales.\n•\nCoach Operating Income\n increased $100.8 million to $487.4 million in the first quarter of fiscal 2026. Operating margin increased to 34.1% in the first quarter of fiscal 2026 as compared to 33.0% in the first quarter of fiscal 2025. Excluding items affecting comparability, operating income increased $102.0 million to $488.6 million in the first quarter of fiscal 2026 from $386.6 million in the first quarter of fiscal 2025; and operating margin increased 120 basis points to 34.2% in the first quarter of fiscal 2026 as compared to 33.0% in the first quarter of fiscal 2025. This increase in operating margin was primarily attributed to:\n◦\nGross margin,\n increased 50 basis points mainly due to net pricing improvements, partially offset by unfavorable currency impacts and the impact of higher tariffs; \n◦\nSG&A expenses as a percentage of net sales\n, decreased 70 basis points mainly due to leverage of fixed costs on higher net sales, partially offset by higher marketing spend. \n•\nKate Spade Operating Income\n decreased $21.4 million to $5.6 million in the first quarter of fiscal 2026. Operating margin decreased to 2.1% in the first quarter of fiscal 2026 as compared to 9.6% in the first quarter of fiscal 2025. Excluding items affecting comparability, operating income decreased $21.2 million to $5.8 million in the first quarter of fiscal 2026 from $27.0 million in the first quarter of fiscal 2025; and operating margin decreased approximately 740 basis points to 2.2% in the first quarter of fiscal 2026 as compared to 9.6% in the first quarter of fiscal 2025. This decrease in operating margin was primarily attributed to:\n◦\nGross margin\n, decreased 290 basis points mainly due to the impact of higher tariffs and unfavorable channel mix, partially offset by net pricing improvements; \n◦\nSG&A expenses as a percentage of net sales,\n increased approximately 460 basis points mainly driven by higher marketing spend. \n•\nCorporate Operating Expenses\n increased 6.3% or $9.6 million to $163.8 million in the first quarter of fiscal 2026. Excluding items affecting comparability, Corporate operating expenses increased $19.7 million to $140.5 million from $120.8 million in the first quarter of fiscal 2025. This increase in operating expenses was primarily attributed to higher professional fees and higher compensation costs.\nInterest Expense, net\nNet interest expense decreased $17.9 million to $12.8 million in the first quarter of fiscal 2026 as compared to $30.7 million in the first quarter of fiscal 2025. Excluding items affecting comparability, net interest expense increased $19.6 million to $12.9 million from interest income of $6.7 million in the first quarter of fiscal 2025. This increase in Interest expense, net, was mainly due to an increase in interest expense as a result of the issuance of the 2030 and 2035 Senior Notes.\n35\nOther Expense (Income)\nOther income decreased $1.1 million to $3.3 million in the first quarter of fiscal 2026 as compared to Other income of $4.4 million in the first quarter of fiscal 2025. Excluding items affecting comparability, Other income decreased $1.0 million to $3.4 million as compared to Other income of $4.4 million in the first quarter of fiscal 2025. This decrease in other income was related to a decrease in foreign exchange gains. \nProvision (Benefit) for Income Taxes\nThe effective tax rate was 13.8% in the first quarter of fiscal 2026 as compared to 17.3% in the first quarter of fiscal 2025. Excluding items affecting comparability, the effective tax rate was 13.7% in the first quarter of fiscal 2026 as compared to 18.5% in the first quarter of fiscal 2025. The decrease in effective tax rate was primarily attributable to the excess tax windfall related to share-based compensation awards partially offset by the geographical mix of earnings.\nNet Income (Loss)\nNet income increased 47.2% or $88.2 million to $274.8 million in the first quarter of fiscal 2026 as compared to $186.6 million in the first quarter of fiscal 2025. Excluding items affecting comparability, net income increased $55.5 million to $297.1 million in the first quarter of fiscal 2026 from $241.6 million in the first quarter of fiscal 2025.\nNet Income (Loss) per Share\nNet income per diluted share was $1.28 in the first quarter of fiscal 2026 as compared to net income per diluted share of $0.79 in the first quarter of fiscal 2025. Excluding items affecting comparability, net income per diluted share increased $0.36 to $1.38 in the first quarter of fiscal 2026 from $1.02 in the first quarter of fiscal 2025, primarily due to higher net income and a decrease in shares outstanding.\n36\nNON-GAAP MEASURES\nThe Company’s reported results are presented in accordance with GAAP. The reported SG&A expenses, operating income, interest expense, other expense (income), provision for income taxes, net income and earnings per diluted share in the first quarter of fiscal 2026 and fiscal 2025 reflect certain items affecting comparability, including the impact of the Acquisition and Divestiture and Organizational Efficiency Costs. As a supplement to the Company's reported results, these measures are also reported on a non-GAAP basis to exclude the impact of these items along with a reconciliation to the most directly comparable GAAP measures.\nThe Company incurred Acquisition and Divestiture items which consist of non-recurring costs, related to the Stuart Weitzman Business Divestiture, inclusive of professional fees, one-time severance costs, compensation costs and operating net loss. The Company also incurred Organizational Efficiency Costs which consist of non-recurring costs, primarily from various initiatives aimed at streamlining the organization and optimizing processes. These costs mainly include one-time technology and severance related charges.\nThese non-GAAP performance measures were used by management to conduct and evaluate its business during its regular review of operating results for the periods affected. Management and the Company’s Board utilized these non-GAAP measures to make decisions about the uses of Company resources, analyze performance between periods, develop internal projections and measure management performance. The Company’s internal management reporting excluded these items. In addition, the human resources committee of the Company’s Board uses these non-GAAP measures when setting and assessing achievement of incentive compensation goals.\nThe Company operates on a global basis and reports financial results in U.S. dollars in accordance with GAAP. Fluctuations in foreign currency exchange rates can affect the amounts reported by the Company in U.S. dollars with respect to its foreign revenues and profit. Accordingly, certain material increases and decreases in operating results for the Company and its segments have been presented both including and excluding currency fluctuation effects. These effects occur from translating foreign-denominated amounts into U.S. dollars and comparing to the same period in the prior fiscal year. Constant currency information compares results between periods as if exchange rates had remained constant period-over-period. The Company calculates constant currency revenue results by translating current period revenue in local currency using the prior year period's currency conversion rate.\nWe believe these non-GAAP measures are useful to investors and others in evaluating the Company’s ongoing operating and financial results in a manner that is consistent with management's evaluation of business performance and understanding how such results compare with the Company’s historical performance. Additionally, we believe presenting certain increases and decreases in constant currency provides a framework for assessing the performance of the Company's business outside the United States and helps investors and analysts understand the effect of significant year-over-year currency fluctuations. We believe excluding these items assists investors and others in developing expectations of future performance.\nBy providing the non-GAAP measures, as a supplement to GAAP information, we believe we are enhancing investors’ understanding of our business and our results of operations. The non-GAAP financial measures are limited in their usefulness and should be considered in addition to, and not in lieu of, GAAP financial measures. Further, these non-GAAP measures may be unique to the Company, as they may be different from non-GAAP measures used by other companies.\nFor a detailed discussion on these non-GAAP measures, see the GAAP to Non-GAAP Reconciliation discussions above in this Item 2. \"Management’s Discussion and Analysis of Financial Condition and Results of Operations.\"\n37\nFINANCIAL CONDITION\nCash Flows\nThree Months Ended\nSeptember 27,\n2025\nSeptember 28,\n2024\nChange\n(millions)\nNet cash provided by (used in) operating activities\n$\n112.6\n \n$\n119.5 \n$\n(6.9)\nNet cash provided by (used in) investing activities\n69.3\n \n190.1 \n(120.8)\nNet cash provided by (used in) financing activities\n(550.8)\n(74.5)\n(476.3)\nEffect of exchange rate changes on cash and cash equivalents\n(11.6)\n85.8 \n(97.4)\nNet increase (decrease) in cash and cash equivalents\n$\n(380.5)\n$\n320.9 \n$\n(701.4)\nThe Company’s cash and cash equivalents decreased by $380.5 million in the first quarter of fiscal 2026 as compared to an increase of $320.9 million in the first quarter of fiscal 2025, as discussed below. \nNet cash provided by (used in) operating activities\nNet cash provided by operating activities decreased $6.9 million primarily due to changes in operating assets and liabilities of $169.4 million, higher impact of non-cash adjustments of $74.3 million, as well as higher net income of $88.2 million. \nThe $169.4 million decrease in changes in operating asset and liability balances were primarily driven by the following:\n•\nAccrued liabilities were a use of cash of $71.1 million in the first quarter of fiscal 2026 compared to a source of cash of $32.0 million in the first quarter of fiscal 2025, primarily driven by a decrease in accrued interest due to repayment of the Capri Acquisition Senior Notes, partially offset by an increase in accrued duty driven by higher tariffs.\n•\nAccounts payable were a source of cash of $33.8 million in the first quarter of fiscal 2026 compared to a source of cash of $92.9 million in the first quarter of fiscal 2025, primarily driven by lower in-transit inventory and receipts.\nNet cash provided by (used in) investing activities\nNet cash provided by investing activities in the first quarter of fiscal 2026 was $69.3 million as compared to a source of cash of $190.1 million in the first quarter of fiscal 2025, resulting in a $120.8 million decrease in net cash provided by investing activities.\nThe $69.3 million source of cash in the first quarter of fiscal 2026 was primarily due to proceeds from the divestiture of the Stuart Weitzman business of $109.6 million, partially offset by purchases of property and equipment of $32.4 million.\nThe $190.1 million source of cash in the first quarter of fiscal 2025 was primarily due to maturities and sales of investments of $1.69 billion, partially offset by purchases of investments of $1.48 billion, mainly related to the proceeds of the Capri Acquisition Senior Notes.\nNet cash provided by (used in) financing activities\nNet cash used in financing activities was $550.8 million in the first quarter of fiscal 2026 as compared to a use of cash of $74.5 million in the first quarter of fiscal 2025, resulting in a net increase in use of cash for financing activities of $476.3 million.\nThe $550.8 million of cash used in the first quarter of fiscal 2026 was primarily due to repurchase of common stock of $698.2 million, partially offset by proceeds from commercial paper, net of $240.0 million.\nThe $74.5 million of cash used in the first quarter of fiscal 2025 was primarily due to dividend payments of $81.4 million and taxes paid to net settle share-based awards of $34.5 million, partially offset by proceeds from share-based awards of $41.7 million.\nEffect of exchange rate changes on cash and cash equivalents\nEffect of exchange rate changes on cash and cash equivalents was $(11.6) million as compared to $85.8 million in the first quarter of fiscal 2025. The $97.4 million decrease primarily relates to the currency impact of the United States Dollar against the Euro on the Euro-denominated Capri Acquisition Senior Notes which were redeemed during the second quarter of fiscal 2025.\n38\nWorking Capital and Capital Expenditures\nThe following table presents our financial condition as of September 27, 2025 and June 28, 2025:\nSeptember 27, 2025\nJune 28, 2025\nChange\n(millions)\nCash and cash equivalents\n(1)\n$\n719.5\n \n$\n1,100.0 \n$\n(380.5)\nShort-term investments\n(1)\n23.7\n \n19.6 \n4.1 \nCurrent debt\n(2)\n(256.8)\n(16.7)\n(240.1)\nLong-term debt\n(2)\n(2,378.6)\n(2,377.9)\n(0.7)\nTotal\n$\n(1,892.2)\n$\n(1,275.0)\n$\n(617.2)\n(1)    \nAs of September 27, 2025, approximately 39.6% of our cash and short-term investments were held outside the United States.\n(2)    \nRefer to Note 11, \"Debt\" for discussion of the carrying values of our debt.\nSources of Liquidity\nOur primary sources of liquidity are the cash flows generated from our operations, our cash and cash equivalents and short-term investments, availability under our credit facilities, and other available financing options.\nThe following table presents the total availability, borrowings outstanding and remaining availability under our credit facilities as of September 27, 2025:\nTotal Availability\nBorrowings Outstanding\nRemaining Availability\n(millions)\nAmended Revolving Credit Facility and Commercial Paper Program\n(1)(2)\n$\n2,000.0\n \n$\n240.0\n \n1,760.0\n \nChina Credit Facility\n(1)(3)\n35.0\n \n16.8\n \n18.2\n \n(1)    \nRefer to Note 11, \"Debt\" for further information on these instruments.\n(2)    \nBorrowings under the Commercial Paper Program are supported by the Amended Revolving Credit Facility. Accordingly, aggregate borrowings outstanding under the Commercial Paper Program and the Amended Revolving Credit Facility will not exceed $2.00 billion.\n(3)     \nThe carrying amounts of the China Credit Facility include the impact of changes in the exchange rate of the United States Dollar against the Renminbi.\nWe believe that our Amended Revolving Credit Facility is adequately diversified with no undue concentrations in any one financial institution. As of September 27, 2025, there were 18 financial institutions participating in the Amended Revolving Credit Facility, with no one participant maintaining a combined maximum commitment percentage in excess of 10%. We have no reason to believe at this time that the participating institutions will be unable to fulfill their obligations to provide financing in accordance with the terms of the facility in the event we elect to draw funds in the foreseeable future.\nWe have the ability to draw on our credit facilities or access other sources of financing options available to us in the credit and capital markets for, among other things, acquisition or integration-related costs, our restructuring initiatives, settlement of a material contingency, or a material adverse business or macroeconomic development, as well as for other general corporate business purposes.\nManagement believes that cash flows from operations, access to the credit and capital markets and our credit lines, on-hand cash and cash equivalents and our investments will provide adequate funds to support our operating, capital and debt service requirements for fiscal 2026 and beyond. There can be no assurance that any such capital will be available to the Company on acceptable terms or at all. Our ability to fund working capital needs, planned capital expenditures and scheduled debt payments, as well as to comply with all of the financial covenants under our debt agreements, depends on future operating performance and cash flow. This future operating performance and cash flow are subject to prevailing economic conditions, and to financial, business and other factors, some of which are beyond the Company's control.\n39\nReference should be made to our most recent Annual Report on Form 10-K and other filings with the SEC for additional information regarding liquidity and capital resources.\nCommercial Paper Program\nOn July 24, 2025, the Company entered into a commercial paper borrowing program (the \"Commercial Paper Program\") that provides for the issuance of up to $2.00 billion of unsecured commercial paper notes with maturities up to 365 days. Borrowings under the Commercial Paper Program are supported by the Amended Revolving Credit Facility and may be used to support the Company's general corporate needs. The aggregate amount of borrowings outstanding under the Commercial Paper Program and Amended Revolving Credit Facility will not exceed $2.00 billion. During the three months ended September 27, 2025, the Company issued notes under the Commercial Paper Program with original maturities less than 3 months. As of September 27, 2025, the Company had $240.0 million of borrowings outstanding under the Commercial Paper Program with a weighted average interest rate of 4.260%. Refer to Note 11, \"Debt\" for further information. \nStuart Weitzman Business Divestiture\nOn February 16, 2025, the Company entered into a Purchase Agreement to sell the Stuart Weitzman Business for total cash consideration of $105.0 million, subject to customary adjustments. The sale was completed on August 4, 2025. Refer to Note 5, \"Acquisitions and Divestitures\" for further information. \nSupply Chain Finance\nTo improve our working capital efficiency, we make available to certain suppliers, a voluntary supply chain finance (“SCF”) program that enables our suppliers to sell their receivables from the Company to a global financial institution on a non-recourse basis at a rate that leverages our credit rating. We do not have the ability to refinance or modify payment terms to the global financial institution through the SCF program. No guarantees are provided by the Company or any of our subsidiaries under the SCF program. Refer to Note 2, \"Basis of Presentation and Organization,\" for additional information.\nCapital Expenditures\nDuring the first quarter of fiscal 2026 capital expenditures and cloud computing implementation costs were $38.0 million. The Company expects total fiscal 2026 capital expenditures and cloud computing costs to be approximately $200.0 million. Certain cloud computing implementation costs are recognized within Prepaid expenses and Other assets on the Condensed Consolidated Balance Sheets.\nStock Repurchase Plan\n2026 Share Repurchase Program\nOn September 10, 2025, the Company announced that the Board authorized the Company to repurchase up to $3.00 billion of its outstanding common stock (the \"2026 Share Repurchase Program\"), replacing the 2022 Share Repurchase Program which had $561.7 million of remaining authorization. \nDuring the three months ended September 27, 2025, the Company repurchased $500.0 million of common stock, $238.3 million under the 2022 Share Repurchase Program and $261.7 million under the 2026 Share Repurchase Program. As of September 27, 2025, the Company had $2.74 billion of remaining repurchase authorization under the 2026 Share Repurchase Program.\n2025 Share Repurchase Program\nOn November 13, 2024, the Board authorized the Company to repurchase up to $2.00 billion of outstanding shares of its common stock (the \"2025 Share Repurchase Program\"). On November 21, 2024, the Company entered into accelerated share repurchase agreements (the “ASR Agreements”) with Bank of America, N.A. and Morgan Stanley & Co. LLC (the “Dealers”) to repurchase an aggregate of up to $2.00 billion of the Company’s shares of common stock. Under the ASR Agreements, the Company paid $2.00 billion to the Dealers and received an initial delivery of 28,363,766 shares of the Company's common stock on November 26, 2024. Final settlement was based on the volume-weighted average price (\"VWAP\") of the Company's common stock, less a discount, and occurred in four tranches. During the year ended June 28, 2025 and the quarter ended September 27, 2025, as a result of the increase in the VWAP of the Company's common stock, the Company cash-settled $6.6 million related to 92,536 shares of common stock and $195.7 million related to 1,838,270 shares of common stock, respectively, which completed the agreement. The average share price for the 28,363,766 shares received under the ASR Agreements was $77.64.\n40\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe Company's significant accounting policies are described in Note 3 to the audited consolidated financial statements in our Annual Report on Form 10-K for fiscal 2025. Our discussion of results of operations and financial condition relies on our condensed consolidated financial statements that are prepared based on certain critical accounting policies that require management to make judgments and estimates which are subject to varying degrees of uncertainty. While we believe that these accounting policies are based on sound measurement criteria, actual future events can and often do result in outcomes that can be materially different from these estimates or forecasts. \nFor a complete discussion of our critical accounting policies and estimates, see the \"Critical Accounting Policies and Estimates\" section of the Management's Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for fiscal 2025. As of September 27, 2025, there have been no material changes to any of the critical accounting policies.\nThe Company performs its annual impairment assessment of goodwill as well as brand intangibles at the beginning of the fourth quarter of each fiscal year. In all fiscal years, the fair values of our Coach brand reporting units significantly exceeded their respective carrying values. During the fourth quarter of fiscal year 2025, the Company recorded $244.1 million of impairment charges related to goodwill for the Kate Spade reporting unit and $610.7 million of impairment charges related to the Kate Spade indefinite-lived brand intangible. Several factors could impact the Kate Spade brand's ability to achieve expected future cash flows, including the optimization of the store fleet productivity, the success of international expansion strategies, the impact of promotional activity, continued economic volatility and potential operational challenges related to the macroeconomic factors, the reception of new collections in all business channels and other initiatives aimed at increasing profitability of the business. If profitability trends decline during fiscal 2026 from those that are expected, it is possible that an interim test, or our annual impairment test, could result in an impairment of these assets."
}