{
  "source_file": "trgp-20241231.htm",
  "form_type": "10-K",
  "item1": null,
  "item7": "Item 7. Management’s Discussion and Analysis of\n Financial Condition and Results of Operations\n\n\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our consolidated financial statements and the notes included in Part IV of this Annual Report. Additional sections in this Annual Report should be helpful to the reading of our discussion and analysis, including the following: (i) a description of our business strategy found in “Item 1. Business–Overview”; (ii) a description of recent developments, found in “Item 1. Business–Recent Developments”; and (iii) a description of risk factors affecting us and our business, found in “Item 1A. Risk Factors.” Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 that are not included in this Annual Report can be found in Part II, Item 7. “Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our Annual Report on Form 10-K for the year ended December 31, 2023.\n\n\n \n\n\nGeneral Trends and Outlook\n\n\n \n\n\nWe expect our results of operations to continue to be affected by the following key trends: commodity prices, volume throughput and demand for our products and services, contract terms and mix, the impact of our hedging activities, the cost to operate and support assets, volatile capital markets and competition. These expectations are based on assumptions made by us and information currently available to us. To the extent our underlying assumptions about or interpretations of available information prove to be incorrect, our actual results may vary materially from our expected results.\n\n\n \n\n\nCommodity Prices\n\n\n \n\n\nThere has been, and we believe there will continue to be, volatility in commodity prices and in the relationships among natural gas, NGL and crude oil prices. The volatility and uncertainty of natural gas, NGL and crude oil prices impact drilling, completion and other investment decisions by producers and ultimately supply to our systems. See “Item 1A. Risk Factors – Our cash flow is affected by supply and demand for natural gas, NGL products, and crude oil, and by natural gas, NGL, crude oil and condensate prices, and decreases in supply, demand or these prices could adversely affect our results of operations and financial condition.”\n\n\n \n\n\nOur operating income generally improves in an environment of higher natural gas, NGL and condensate prices. Our processing profitability is largely dependent upon pricing and the supply of and market demand for natural gas, NGLs and condensate, both of which are beyond our control. In a declining commodity price environment, without taking into account our hedges, we will realize a reduction in cash flows under our percent-of-proceeds contracts proportionate to average price declines. While we have a significant level of margin that we derive from fee-based arrangements across our operations and particularly for our assets in the Downstream Business, our contract mix, along with our commodity hedging program, serves to mitigate the impact of commodity price movements on our cash flows. For additional information regarding our hedging activities, see “Item 7A. Quantitative and Qualitative Disclosures about Market Risk — Commodity Price Risk.”\n\n\n \n\n\nThe following table presents selected average annual and quarterly industry index prices for natural gas, selected NGL products and crude oil for the periods presented:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nNatural Gas $/MMBtu (1)\n\n\n \n\n\n \n\n\nIllustrative Targa NGL $/gal (2)\n\n\n \n\n\n \n\n\nCrude Oil $/Bbl (3)\n\n\n \n\n\n\n\n\n\n2024\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4th Quarter\n\n\n$\n\n\n2.80\n\n\n \n\n\n \n\n\n$\n\n\n0.65\n\n\n \n\n\n \n\n\n$\n\n\n69.40\n\n\n \n\n\n\n\n\n\n3rd Quarter\n\n\n \n\n\n2.16\n\n\n \n\n\n \n\n\n \n\n\n0.59\n\n\n \n\n\n \n\n\n \n\n\n78.71\n\n\n \n\n\n\n\n\n\n2nd Quarter\n\n\n \n\n\n1.89\n\n\n \n\n\n \n\n\n \n\n\n0.61\n\n\n \n\n\n \n\n\n \n\n\n79.97\n\n\n \n\n\n\n\n\n\n1st Quarter\n\n\n \n\n\n2.24\n\n\n \n\n\n \n\n\n \n\n\n0.65\n\n\n \n\n\n \n\n\n \n\n\n75.61\n\n\n \n\n\n\n\n\n\n2024 Average\n\n\n \n\n\n2.27\n\n\n \n\n\n \n\n\n \n\n\n0.63\n\n\n \n\n\n \n\n\n \n\n\n75.92\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2023\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n4th Quarter\n\n\n$\n\n\n2.88\n\n\n \n\n\n \n\n\n$\n\n\n0.60\n\n\n \n\n\n \n\n\n$\n\n\n78.33\n\n\n \n\n\n\n\n\n\n3rd Quarter\n\n\n \n\n\n2.54\n\n\n \n\n\n \n\n\n \n\n\n0.62\n\n\n \n\n\n \n\n\n \n\n\n82.18\n\n\n \n\n\n\n\n\n\n2nd Quarter\n\n\n \n\n\n2.09\n\n\n \n\n\n \n\n\n \n\n\n0.56\n\n\n \n\n\n \n\n\n \n\n\n73.75\n\n\n \n\n\n\n\n\n\n1st Quarter\n\n\n \n\n\n3.45\n\n\n \n\n\n \n\n\n \n\n\n0.70\n\n\n \n\n\n \n\n\n \n\n\n76.11\n\n\n \n\n\n\n\n\n\n2023 Average\n\n\n \n\n\n2.74\n\n\n \n\n\n \n\n\n \n\n\n0.62\n\n\n \n\n\n \n\n\n \n\n\n77.59\n\n\n \n\n\n\n\n\n\n \n\n\n(1)\nNatural gas prices are based on average first of month prices from Henry Hub Inside FERC commercial index prices.\n\n\n(2)\n“Illustrative Targa NGL” pricing is weighted using average quarterly prices from Mont Belvieu Non-TET monthly commercial index and represents the following composition for the periods noted:\n\n\n2024: 44% ethane, 32% propane, 11% normal butane, 4% isobutane and 9% natural gasoline\n\n\n2023: 44% ethane, 32% propane, 11% normal butane, 4% isobutane and 9% natural gasoline\n\n\n(3)\nCrude oil prices are based on average quarterly prices of West Texas Intermediate crude oil as measured on the NYMEX.\n\n\n \n\n\n55\n\n\n\n\n \n\n\nVolumes and Demand for our Services\n\n\n \n\n\nFluctuations in energy prices can greatly affect production rates and investments by third parties in the development and production of new oil and natural gas reserves. Our operations are affected by the level of crude, natural gas and NGL prices, the relationship among these prices and related activity levels from our customers. In our gathering and processing operations, plant inlet volumes, crude oil volumes and capacity utilization rates generally are driven by wellhead production and our competitive and contractual position on a regional basis and more broadly by the impact of prices for crude oil, natural gas and NGLs on exploration and production activity in the areas of our operations. Drilling and production activity generally decreases as crude oil and natural gas prices decrease below commercially acceptable levels. Producers generally focus their drilling activity on certain basins depending on commodity price fundamentals. Our asset systems are predominantly located in some of the most economic basins in the United States.\n \n\n\n \n\n\nThe factors that impact the gathering and processing volumes also impact the total volumes that flow to our Downstream Business. Accordingly, increased producer activity will drive demand for our midstream services and may result in incremental growth capital expenditures. Demand for our transportation, fractionation and other fee-based services is largely correlated with producer activity levels. Demand for our international export, storage and terminaling services has remained relatively constant, as demand for these services is based on a number of domestic and international factors.\n\n\n \n\n\nContract Terms, Contract Mix and the Impact of Commodity Prices\n\n\n \n\n\nAcross our operations and particularly in our Downstream Business, we benefit from long-term fee-based arrangements for our services. Our Gathering and Processing segment contract mix also has components of fee-based margin, such as fee floors and other fee-based services which mitigate against low commodity prices. The significant level of margin we derive from fee-based arrangements combined with our hedging arrangements helps to mitigate our exposure to commodity price movements. Volatility in commodity prices can have a significant impact on our profitability, especially those percent-of-proceeds contracts that create direct exposure to changes in energy prices by paying us for gathering and processing services with a portion of proceeds from the commodities handled (“equity volumes”).\n \n\n\n \n\n\nContract terms in the Gathering and Processing segment are based upon a variety of factors, including natural gas and crude quality, geographic location, competitive dynamics and the pricing environment at the time the contract is executed, and customer requirements. Our gathering and processing contract mix and, accordingly, our exposure to crude, natural gas and NGL prices may change as a result of producer preferences, competition and changes in production as wells decline at different rates or are added, our expansion into regions where different types of contracts are more common and other market factors.\n\n\n \n\n\nThe contract terms and contract mix of our Downstream Business can also have a significant impact on our results of operations. Transportation and fractionation services are supported by fee-based contracts whose rates and terms are driven by NGL supply and transportation and fractionation capacity. Export services are supported by fee-based contracts whose rates and terms are driven by global LPG supply and demand fundamentals. The Logistics and Transportation segment includes predominantly fee-based contracts.\n\n\n \n\n\nImpact of Our Commodity Price Hedging Activities\n\n\n \n\n\nWe have hedged the commodity price risk associated with a portion of our expected natural gas, NGL and condensate equity volumes, future commodity purchases and sales, and transportation basis risk by entering into financially settled derivative transactions. These transactions include swaps, futures, and purchased puts (or floors) and calls (or caps) to hedge additional expected equity commodity volumes without creating volumetric risk. We intend to continue managing our exposure to commodity prices in the future by entering into derivative transactions. We actively manage the Downstream Business product inventory and other working capital levels to reduce exposure to changing prices. For additional information regarding our hedging activities, see “Item 7A. Quantitative and Qualitative Disclosures About Market Risk–Commodity Price Risk.”\n\n\n \n\n\nOperating Expenses\n\n\n \n\n\nVariable costs such as service and repairs can impact our results. Continued expansion of existing assets will also give rise to additional operating expenses, which will affect our results. The employees supporting our operations are employees of Targa Resources LLC, a Delaware limited liability company, and a wholly-owned subsidiary of ours.\n \n\n\n \n\n\n56\n\n\n\n\n \n\n\nVolatile Capital Markets and Competition\n\n\n \n\n\nWe continuously consider and enter into discussions regarding potential growth projects and acquisitions and may contemplate external funding for potential growth projects and acquisitions. Any limitations on our access to capital may impair our ability to execute this strategy. If the cost of such capital becomes too expensive, our ability to develop or acquire strategic and accretive assets may be limited. We may not be able to raise the necessary funds on satisfactory terms, if at all. The primary factors influencing our cost of borrowing include interest rates, credit spreads, covenants, underwriting or loan origination fees and similar charges we pay to lenders. These factors may impair our ability to execute our growth and acquisition strategy.\n \n\n\n \n\n\nCurrent economic conditions and competition for asset purchases and development opportunities could limit our ability to fully execute our growth strategy. Due to increased volatility in commodity prices and the broader market, the ability of companies in the oil and gas industry to seek financing and access the capital markets on favorable terms or at all has been negatively impacted. We believe we have sufficient access to financial resources and liquidity necessary to meet our requirements for working capital, debt service payments and capital expenditures in 2025 and beyond. For additional information regarding our financing activities, see “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations — Our Liquidity and Capital Resources.”\n\n\n \n\n\nHow We Evaluate Our Operations\n\n\n \n\n\nThe profitability of our business is a function of the difference between: (i) the revenues we receive from our operations, including fee-based revenues from services and revenues from the natural gas, NGLs, crude oil and condensate we sell, and (ii) the costs associated with conducting our operations, including the costs of wellhead natural gas, crude oil and mixed NGLs that we purchase as well as operating, general and administrative costs and the impact of our commodity hedging activities. Because commodity price movements tend to impact both revenues and costs, increases or decreases in our revenues alone are not necessarily indicative of increases or decreases in our profitability. Our contract portfolio, the prevailing pricing environment for crude oil, natural gas and NGLs, the impact of our commodity hedging program and its ability to mitigate exposure to commodity price movements, and the volumes of crude oil, natural gas and NGL throughput on our systems are important factors in determining our profitability. Our profitability is also affected by the NGL content in gathered wellhead natural gas, supply and demand for our products and services, utilization of our assets and changes in our customer mix.\n\n\n \n\n\nOur profitability is also impacted by fee-based contracts. Our growing capital expenditures for pipelines and gathering and processing assets underpinned by fee-based margin, expansion of our Downstream facilities, continued focus on adding fee-based margin to our existing and future gathering and processing contracts, as well as third-party acquisitions of businesses and assets, will continue to increase the number of our contracts that are fee-based. Fixed fees for services such as gathering and processing, transportation, fractionation, storage, terminaling and crude oil gathering are not directly tied to changes in market prices for commodities. Nevertheless, a change in market dynamics such as available commodity throughput does affect profitability.\n\n\n \n\n\nManagement uses a variety of financial measures and operational measurements to analyze our performance. These include: (i) throughput volumes, facility efficiencies and fuel consumption, (ii) operating expenses, (iii) capital expenditures and (iv) the following non-GAAP measures: adjusted EBITDA, adjusted cash flow from operations, adjusted free cash flow and adjusted operating margin (segment).\n\n\n \n\n\nThroughput Volumes, Facility Efficiencies and Fuel Consumption\n\n\n \n\n\nOur profitability is impacted by our ability to add new sources of natural gas supply and crude oil supply to offset the natural decline of existing volumes from oil and natural gas wells that are connected to our gathering and processing systems. This is achieved by connecting new wells and adding new volumes in existing areas of production, as well as by capturing crude oil and natural gas supplies currently gathered by third parties. Similarly, our profitability is impacted by our ability to add new sources of mixed NGL supply, connected by third-party transportation and Grand Prix, to our Downstream Business fractionation facilities and at times to our export facilities. We fractionate NGLs generated by our gathering and processing plants, as well as by contracting for mixed NGL supply from third-party facilities.\n\n\n \n\n\nIn addition, we seek to increase adjusted operating margin by limiting volume losses, reducing fuel consumption and by increasing efficiency. With our gathering systems’ extensive use of remote monitoring capabilities, we monitor the volumes received at the wellhead or central delivery points along our gathering systems, the volume of natural gas received at our processing plant inlets and the volumes of NGLs and residue natural gas recovered by our processing plants. We also monitor the volumes of NGLs received, stored, fractionated and delivered across our logistics assets. This information is tracked through our processing plants and Downstream Business facilities to determine customer settlements for sales and volume related fees for service and helps us increase efficiency and reduce fuel consumption.\n\n\n \n\n\n57\n\n\n\n\n \n\n\nAs part of monitoring the efficiency of our operations, we measure the difference between the volume of natural gas received at the wellhead or central delivery points on our gathering systems and the volume received at the inlet of our processing plants as an indicator of fuel consumption and line loss. We also track the difference between the volume of natural gas received at the inlet of the processing plant and the NGLs and residue gas produced at the outlet of such plant to monitor the fuel consumption and recoveries of our facilities. Similar tracking is performed for our crude oil gathering and logistics assets and our NGL pipelines. These volume, recovery and fuel consumption measurements are an important part of our operational efficiency analysis and safety programs.\n\n\n \n\n\nOperating Expenses\n\n\n \n\n\nOperating expenses are costs associated with the operation of specific assets. Labor, contract services, repair and maintenance and ad valorem taxes comprise the most significant portion of our operating expenses. These expenses remain relatively stable and independent of the volumes through our systems, but may increase with system expansions and inflation, and will fluctuate depending on the scope of the activities performed during a specific period.\n\n\n \n\n\nCapital Expenditures\n\n\n \n\n\nOur capital expenditures are classified as growth capital expenditures and maintenance capital expenditures. Growth capital expenditures improve the service capability of the existing assets, extend asset useful lives, increase capacities from existing levels, add capabilities, and reduce costs or enhance revenues. Maintenance capital expenditures are those expenditures that are necessary to maintain the service capability of our existing assets, including the replacement of system components and equipment, which are worn, obsolete or completing their useful life and expenditures to remain in compliance with environmental laws and regulations.\n\n\n \n\n\nCapital spending associated with growth and maintenance projects is closely monitored. Return on investment is analyzed before a capital project is approved, spending is closely monitored throughout the development of the project, and the subsequent operational performance is compared to the assumptions used in the economic analysis performed for the capital investment approval.\n \n\n\n \n\n\nNon-GAAP Measures\n\n\n \n\n\nWe utilize non-GAAP measures to analyze our performance. Adjusted EBITDA, adjusted cash flow from operations, adjusted free cash flow and adjusted operating margin (segment) are non-GAAP measures. The GAAP measures most directly comparable to these non-GAAP measures are income (loss) from operations, Net income (loss) attributable to Targa Resources Corp. and segment operating margin. These non-GAAP measures should not be considered as an alternative to GAAP measures and have important limitations as analytical tools. Investors should not consider these measures in isolation or as a substitute for analysis of our results as reported under GAAP. Additionally, because our non-GAAP measures exclude some, but not all, items that affect income and segment operating margin, and are defined differently by different companies within our industry, our definitions may not be comparable with similarly titled measures of other companies, thereby diminishing their utility. Management compensates for the limitations of our non-GAAP measures as analytical tools by reviewing the comparable GAAP measures, understanding the differences between the measures and incorporating these insights into our decision-making processes.\n\n\n \n\n\nAdjusted Operating Margin\n\n\n \n\n\nWe define adjusted operating margin for our segments as revenues less product purchases and fuel. It is impacted by volumes and commodity prices as well as by our contract mix and commodity hedging program.\n \n\n\n \n\n\nGathering and Processing adjusted operating margin consists primarily of:\n\n\n \n\n\n•\nservice fees related to natural gas and crude oil gathering, treating and processing; and \n\n\n \n\n\n•\nrevenues from the sale of natural gas, condensate, crude oil and NGLs less producer settlements, fuel and transport and our equity volume hedge settlements. \n\n\n \n\n\nLogistics and Transportation adjusted operating margin consists primarily of:\n\n\n \n\n\n•\nservice fees (including the pass-through of energy costs included in certain fee rates);\n\n\n \n\n\n•\nsystem product gains and losses; and \n\n\n \n\n\n•\nNGL and natural gas sales, less NGL and natural gas purchases, fuel, third-party transportation costs and the net inventory change. \n\n\n58\n\n\n\n\n \n\n\n \n\n\nThe adjusted operating margin impacts of mark-to-market hedge unrealized changes in fair value are reported in Other.\n\n\n \n\n\nAdjusted operating margin for our segments provides useful information to investors because it is used as a supplemental financial measure by management and by external users of our financial statements, including investors and commercial banks, to assess:\n\n\n \n\n\n•\nthe financial performance of our assets without regard to financing methods, capital structure or historical cost basis;\n\n\n \n\n\n•\nour operating performance and return on capital as compared to other companies in the midstream energy sector, without regard to financing or capital structure; and\n\n\n \n\n\n•\nthe viability of capital expenditure projects and acquisitions and the overall rates of return on alternative investment opportunities.\n\n\n \n\n\nManagement reviews adjusted operating margin and operating margin for our segments monthly as a core internal management process. We believe that investors benefit from having access to the same financial measures that management uses in evaluating our operating results.\n The reconciliation of our adjusted operating margin to the most directly comparable GAAP measure is presented under “Management’s Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations – By Reportable Segment.”\n\n\n \n\n\nAdjusted EBITDA\n\n\n \n\n\nWe define adjusted EBITDA as Net income (loss) attributable to Targa Resources Corp. before interest, income taxes, depreciation and amortization, and other items that we believe should be adjusted consistent with our core operating performance. The adjusting items are detailed in the adjusted EBITDA reconciliation table and its footnotes. Adjusted EBITDA is used as a supplemental financial measure by us and by external users of our financial statements such as investors, commercial banks and others to measure the ability of our assets to generate cash sufficient to pay interest costs, support our indebtedness and pay dividends to our investors.\n\n\n \n\n\nAdjusted Cash Flow\n from Operations and Adjusted Free Cash Flow\n\n\n \n\n\nWe define adjusted cash flow from operations as adjusted EBITDA less cash interest expense on debt obligations and cash taxes. We define adjusted free cash flow as adjusted cash flow from operations less maintenance capital expenditures (net of any reimbursements of project costs) and growth capital expenditures, net of contributions from noncontrolling interest and including contributions to investments in unconsolidated affiliates. Adjusted cash flow from operations and adjusted free cash flow are performance measures used by us and by external users of our financial statements, such as investors, commercial banks and research analysts, to assess our ability to generate cash earnings (after servicing our debt and funding capital expenditures) to be used for corporate purposes, such as payment of dividends, retirement of debt or redemption of other financing arrangements.\n\n\n59\n\n\n\n\n \n\n\n \n\n\nOur Non-GAAP Financial Measures\n\n\n \n\n\nThe following table reconciles the non-GAAP financial measures used by management to the most directly comparable GAAP measures for the periods indicated:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nReconciliation of Net income (loss) attributable to Targa Resources Corp. to Adjusted EBITDA, Adjusted Cash Flow from Operations and Adjusted Free Cash Flow\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income (loss) attributable to Targa Resources Corp.\n\n\n$\n\n\n1,312.0\n\n\n \n\n\n \n\n\n$\n\n\n1,345.9\n\n\n \n\n\n\n\n\n\nInterest (income) expense, net\n\n\n \n\n\n767.2\n\n\n \n\n\n \n\n\n \n\n\n687.8\n\n\n \n\n\n\n\n\n\nIncome tax expense (benefit)\n\n\n \n\n\n384.5\n\n\n \n\n\n \n\n\n \n\n\n363.2\n\n\n \n\n\n\n\n\n\nDepreciation and amortization expense\n\n\n \n\n\n1,423.0\n\n\n \n\n\n \n\n\n \n\n\n1,329.6\n\n\n \n\n\n\n\n\n\n(Gain) loss on sale or disposition of assets\n\n\n \n\n\n(3.1\n\n\n)\n\n\n \n\n\n \n\n\n(5.3\n\n\n)\n\n\n\n\n\n\nWrite-down of assets\n\n\n \n\n\n6.2\n\n\n \n\n\n \n\n\n \n\n\n6.9\n\n\n \n\n\n\n\n\n\n(Gain) loss from financing activities\n\n\n \n\n\n0.8\n\n\n \n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n\n\n\n\nEquity (earnings) loss\n\n\n \n\n\n(9.4\n\n\n)\n\n\n \n\n\n \n\n\n(9.0\n\n\n)\n\n\n\n\n\n\nDistributions from unconsolidated affiliates\n\n\n \n\n\n25.3\n\n\n \n\n\n \n\n\n \n\n\n18.6\n\n\n \n\n\n\n\n\n\nCompensation on equity grants\n\n\n \n\n\n63.2\n\n\n \n\n\n \n\n\n \n\n\n62.4\n\n\n \n\n\n\n\n\n\nRisk management activities\n\n\n \n\n\n164.6\n\n\n \n\n\n \n\n\n \n\n\n(275.4\n\n\n)\n\n\n\n\n\n\nNoncontrolling interests adjustments (1)\n\n\n \n\n\n3.9\n\n\n \n\n\n \n\n\n \n\n\n(3.7\n\n\n)\n\n\n\n\n\n\nLitigation expense (2)\n\n\n \n\n\n4.1\n\n\n \n\n\n \n\n\n \n\n\n6.9\n\n\n \n\n\n\n\n\n\nAdjusted EBITDA\n\n\n$\n\n\n4,142.3\n\n\n \n\n\n \n\n\n$\n\n\n3,530.0\n\n\n \n\n\n\n\n\n\nInterest expense on debt obligations (3)\n\n\n \n\n\n(752.4\n\n\n)\n\n\n \n\n\n \n\n\n(675.8\n\n\n)\n\n\n\n\n\n\nCash taxes\n\n\n \n\n\n(17.5\n\n\n)\n\n\n \n\n\n \n\n\n(13.6\n\n\n)\n\n\n\n\n\n\nAdjusted Cash Flow from Operations\n\n\n$\n\n\n3,372.4\n\n\n \n\n\n \n\n\n$\n\n\n2,840.6\n\n\n \n\n\n\n\n\n\nMaintenance capital expenditures, net (4)\n\n\n \n\n\n(231.9\n\n\n)\n\n\n \n\n\n \n\n\n(223.4\n\n\n)\n\n\n\n\n\n\nGrowth capital expenditures, net (4)\n\n\n \n\n\n(3,000.4\n\n\n)\n\n\n \n\n\n \n\n\n(2,224.5\n\n\n)\n\n\n\n\n\n\nAdjusted Free Cash Flow\n\n\n$\n\n\n140.1\n\n\n \n\n\n \n\n\n$\n\n\n392.7\n\n\n \n\n\n\n\n\n\n \n\n\n(1)\nRepresents adjustments related to our subsidiaries with noncontrolling interests, including depreciation and amortization expense as well as earnings for certain plants within our WestTX joint venture not subject to noncontrolling interest.\n\n\n(2)\nLitigation expense includes charges related to litigation resulting from the major winter storm in February 2021 that we consider outside the ordinary course of our business and/or not reflective of our ongoing core operations. We may incur such charges from time to time, and we believe it is useful to exclude such charges because we do not consider them reflective of our ongoing core operations and because of the generally singular nature of the claims underlying such litigation.\n\n\n(3)\nExcludes amortization of interest expense. The year ended December 31, 2024 includes $55.8 million of interest expense associated with the Splitter Agreement ruling.\n\n\n(4)\nRepresents capital expenditures, net of contributions from noncontrolling interests and includes contributions to investments in unconsolidated affiliates.\n\n\n \n\n\n60\n\n\n\n\n \n\n\nConsolidated Results of Operations\n\n\n \n\n\nThe following table and discussion is a summary of our consolidated results of operations:\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2024 vs. 2023\n\n\n \n\n\n\n\n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nRevenues:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSales of commodities\n\n\n$\n\n\n13,891.8\n\n\n \n\n\n \n\n\n$\n\n\n13,962.1\n\n\n \n\n\n \n\n\n$\n\n\n(70.3\n\n\n)\n\n\n \n\n\n(1\n\n\n%)\n\n\n\n\n\n\nFees from midstream services\n\n\n \n\n\n2,489.7\n\n\n \n\n\n \n\n\n \n\n\n2,098.2\n\n\n \n\n\n \n\n\n \n\n\n391.5\n\n\n \n\n\n \n\n\n19\n\n\n%\n\n\n\n\n\n\nTotal revenues\n\n\n \n\n\n16,381.5\n\n\n \n\n\n \n\n\n \n\n\n16,060.3\n\n\n \n\n\n \n\n\n \n\n\n321.2\n\n\n \n\n\n \n\n\n2\n\n\n%\n\n\n\n\n\n\nProduct purchases and fuel\n\n\n \n\n\n10,703.0\n\n\n \n\n\n \n\n\n \n\n\n10,676.4\n\n\n \n\n\n \n\n\n \n\n\n26.6\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nOperating expenses\n\n\n \n\n\n1,175.6\n\n\n \n\n\n \n\n\n \n\n\n1,077.9\n\n\n \n\n\n \n\n\n \n\n\n97.7\n\n\n \n\n\n \n\n\n9\n\n\n%\n\n\n\n\n\n\nDepreciation and amortization expense\n\n\n \n\n\n1,423.0\n\n\n \n\n\n \n\n\n \n\n\n1,329.6\n\n\n \n\n\n \n\n\n \n\n\n93.4\n\n\n \n\n\n \n\n\n7\n\n\n%\n\n\n\n\n\n\nGeneral and administrative expense\n\n\n \n\n\n384.9\n\n\n \n\n\n \n\n\n \n\n\n348.7\n\n\n \n\n\n \n\n\n \n\n\n36.2\n\n\n \n\n\n \n\n\n10\n\n\n%\n\n\n\n\n\n\nOther operating (income) expense\n\n\n \n\n\n(0.4\n\n\n)\n\n\n \n\n\n \n\n\n1.5\n\n\n \n\n\n \n\n\n \n\n\n(1.9\n\n\n)\n\n\nNM\n\n\n \n\n\n\n\n\n\nIncome (loss) from operations\n\n\n \n\n\n2,695.4\n\n\n \n\n\n \n\n\n \n\n\n2,626.2\n\n\n \n\n\n \n\n\n \n\n\n69.2\n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n\n\n\n\nInterest expense, net\n\n\n \n\n\n(767.2\n\n\n)\n\n\n \n\n\n \n\n\n(687.8\n\n\n)\n\n\n \n\n\n \n\n\n(79.4\n\n\n)\n\n\n \n\n\n12\n\n\n%\n\n\n\n\n\n\nEquity earnings (loss)\n\n\n \n\n\n9.4\n\n\n \n\n\n \n\n\n \n\n\n9.0\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n4\n\n\n%\n\n\n\n\n\n\nGain (loss) from financing activities\n\n\n \n\n\n(0.8\n\n\n)\n\n\n \n\n\n \n\n\n(2.1\n\n\n)\n\n\n \n\n\n \n\n\n1.3\n\n\n \n\n\n \n\n\n62\n\n\n%\n\n\n\n\n\n\nOther, net\n\n\n \n\n\n1.2\n\n\n \n\n\n \n\n\n \n\n\n(2.8\n\n\n)\n\n\n \n\n\n \n\n\n4.0\n\n\n \n\n\nNM\n\n\n \n\n\n\n\n\n\nIncome tax (expense) benefit\n\n\n \n\n\n(384.5\n\n\n)\n\n\n \n\n\n \n\n\n(363.2\n\n\n)\n\n\n \n\n\n \n\n\n(21.3\n\n\n)\n\n\n \n\n\n6\n\n\n%\n\n\n\n\n\n\nNet income (loss)\n\n\n \n\n\n1,553.5\n\n\n \n\n\n \n\n\n \n\n\n1,579.3\n\n\n \n\n\n \n\n\n \n\n\n(25.8\n\n\n)\n\n\n \n\n\n(2\n\n\n%)\n\n\n\n\n\n\nLess: Net income (loss) attributable to noncontrolling interests\n\n\n \n\n\n241.5\n\n\n \n\n\n \n\n\n \n\n\n233.4\n\n\n \n\n\n \n\n\n \n\n\n8.1\n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n\n\n\n\nNet income (loss) attributable to Targa Resources Corp.\n\n\n \n\n\n1,312.0\n\n\n \n\n\n \n\n\n \n\n\n1,345.9\n\n\n \n\n\n \n\n\n \n\n\n(33.9\n\n\n)\n\n\n \n\n\n(3\n\n\n%)\n\n\n\n\n\n\nPremium on repurchase of noncontrolling interests, net of tax\n\n\n \n\n\n32.9\n\n\n \n\n\n \n\n\n \n\n\n510.1\n\n\n \n\n\n \n\n\n \n\n\n(477.2\n\n\n)\n\n\n \n\n\n(94\n\n\n%)\n\n\n\n\n\n\nNet income (loss) attributable to common shareholders\n\n\n$\n\n\n1,279.1\n\n\n \n\n\n \n\n\n$\n\n\n835.8\n\n\n \n\n\n \n\n\n$\n\n\n443.3\n\n\n \n\n\n \n\n\n53\n\n\n%\n\n\n\n\n\n\nFinancial data:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAdjusted EBITDA (1)\n\n\n$\n\n\n4,142.3\n\n\n \n\n\n \n\n\n$\n\n\n3,530.0\n\n\n \n\n\n \n\n\n$\n\n\n612.3\n\n\n \n\n\n \n\n\n17\n\n\n%\n\n\n\n\n\n\nAdjusted cash flow from operations (1)\n\n\n \n\n\n3,372.4\n\n\n \n\n\n \n\n\n \n\n\n2,840.6\n\n\n \n\n\n \n\n\n \n\n\n531.8\n\n\n \n\n\n \n\n\n19\n\n\n%\n\n\n\n\n\n\nAdjusted free cash flow (1)\n\n\n \n\n\n140.1\n\n\n \n\n\n \n\n\n \n\n\n392.7\n\n\n \n\n\n \n\n\n \n\n\n(252.6\n\n\n)\n\n\n \n\n\n(64\n\n\n%)\n\n\n\n\n\n\n \n\n\n(1)\nAdjusted EBITDA, adjusted cash flow from operations and adjusted free cash flow are non-GAAP financial measures and are discussed under “Management’s Discussion and Analysis of Financial Condition and Results of Operations–How We Evaluate Our Operations.”\n\n\nNM        Due to a low denominator, the noted percentage change is disproportionately high and as a result, considered not meaningful.\n\n\n \n\n\n2024 Compared to 2023\n\n\n \n\n\nCommodity sales are relatively flat reflecting lower natural gas and condensate prices ($1,242.8 million) and the unfavorable impact of hedges ($686.5 million), offset by higher NGL, natural gas and condensate volumes ($1,607.2 million), and higher NGL prices ($251.6 million).\n\n\n \n\n\nThe increase in fees from midstream services is primarily due to higher gas gathering and processing fees, higher transportation and fractionation fees, and higher export volumes.\n\n\n \n\n\nProduct purchases and fuel are relatively flat reflecting higher NGL and natural gas volumes, offset by lower natural gas prices.\n\n\n \n\n\nThe increase in operating expenses is primarily due to higher labor, maintenance, rental and chemical costs as a result of increased activity and system expansions, partially offset by lower taxes.\n\n\n \n\n\nSee “—Results of Operations—By Reportable Segment” for additional information on a segment basis.\n\n\n \n\n\nThe increase in depreciation and amortization expense is primarily due to the impact of system expansions on our asset base, partially offset by the shortening of depreciable lives of certain assets that were idled in 2023.\n\n\n \n\n\nThe increase in general and administrative expense is primarily due to higher compensation and benefits and professional fees.\n\n\n \n\n\nThe increase in interest expense, net, is due to recognition of cumulative interest on a 2024 legal ruling associated with the Splitter Agreement and higher borrowings, partially offset by higher capitalized interest. Higher capitalized interest is due to system expansions and higher interest rates. See Note 17 – Contingencies for additional information related to the legal ruling.\n\n\n \n\n\nThe increase in income tax expense is primarily due to the release of state valuation allowance in 2023.\n\n\n61\n\n\n\n\n \n\n\nThe premium on repurchase of noncontrolling interests, net of tax is primarily due to the CBF Acquisition in 2024 and the Grand Prix Transaction in 2023.\n\n\n \n\n\nResults of Operations—By Reportable Segment\n\n\n \n\n\nOur operating margins by reportable segment are:\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nGathering and Processing\n\n\n \n\n\n \n\n\nLogistics and Transportation\n\n\n \n\n\n \n\n\nOther\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nYear Ended:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDecember 31, 2024\n\n\n \n\n\n$\n\n\n2,312.4\n\n\n \n\n\n \n\n\n$\n\n\n2,355.1\n\n\n \n\n\n \n\n\n$\n\n\n(164.6\n\n\n)\n\n\n\n\n\n\nDecember 31, 2023\n\n\n \n\n\n \n\n\n2,082.2\n\n\n \n\n\n \n\n\n \n\n\n1,948.7\n\n\n \n\n\n \n\n\n \n\n\n275.5\n\n\n \n\n\n\n\n\n\n \n\n\nGathering and Processing Segment\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2024 vs. 2023\n\n\n \n\n\n\n\n\n\n \n\n\n(In millions, except operating statistics and price amounts)\n\n\n \n\n\n\n\n\n\nOperating margin\n\n\n$\n\n\n \n\n\n2,312.4\n\n\n \n\n\n \n\n\n$\n\n\n \n\n\n2,082.2\n\n\n \n\n\n \n\n\n$\n\n\n \n\n\n230.2\n\n\n \n\n\n \n\n\n \n\n\n11\n\n\n%\n\n\n\n\n\n\nOperating expenses\n\n\n \n\n\n \n\n\n814.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n746.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n68.0\n\n\n \n\n\n \n\n\n \n\n\n9\n\n\n%\n\n\n\n\n\n\nAdjusted operating margin\n\n\n$\n\n\n \n\n\n3,127.0\n\n\n \n\n\n \n\n\n$\n\n\n \n\n\n2,828.8\n\n\n \n\n\n \n\n\n$\n\n\n \n\n\n298.2\n\n\n \n\n\n \n\n\n \n\n\n11\n\n\n%\n\n\n\n\n\n\nOperating statistics (1):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPlant natural gas inlet, MMcf/d (2) (3)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPermian Midland (4)\n\n\n \n\n\n \n\n\n2,933.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n2,535.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n397.9\n\n\n \n\n\n \n\n\n \n\n\n16\n\n\n%\n\n\n\n\n\n\nPermian Delaware\n\n\n \n\n\n \n\n\n2,837.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n2,526.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n310.8\n\n\n \n\n\n \n\n\n \n\n\n12\n\n\n%\n\n\n\n\n\n\nTotal Permian\n\n\n \n\n\n \n\n\n5,770.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n5,061.7\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n708.7\n\n\n \n\n\n \n\n\n \n\n\n14\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSouthTX\n\n\n \n\n\n \n\n\n325.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n367.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(41.5\n\n\n)\n\n\n \n\n\n \n\n\n(11\n\n\n%)\n\n\n\n\n\n\nNorth Texas\n\n\n \n\n\n \n\n\n186.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n205.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(19.0\n\n\n)\n\n\n \n\n\n \n\n\n(9\n\n\n%)\n\n\n\n\n\n\nSouthOK (5)\n\n\n \n\n\n \n\n\n351.7\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n385.0\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(33.3\n\n\n)\n\n\n \n\n\n \n\n\n(9\n\n\n%)\n\n\n\n\n\n\nWestOK\n\n\n \n\n\n \n\n\n212.8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n207.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n5.7\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n\n\n\n\nTotal Central\n\n\n \n\n\n \n\n\n1,077.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,165.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(88.1\n\n\n)\n\n\n \n\n\n \n\n\n(8\n\n\n%)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBadlands (5) (6)\n\n\n \n\n\n \n\n\n136.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n130.0\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n6.3\n\n\n \n\n\n \n\n\n \n\n\n5\n\n\n%\n\n\n\n\n\n\nTotal Field\n\n\n \n\n\n \n\n\n6,984.0\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n6,357.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n626.9\n\n\n \n\n\n \n\n\n \n\n\n10\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCoastal\n\n\n \n\n\n \n\n\n449.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n541.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(91.5\n\n\n)\n\n\n \n\n\n \n\n\n(17\n\n\n%)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n \n\n\n7,433.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n6,898.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n535.4\n\n\n \n\n\n \n\n\n \n\n\n8\n\n\n%\n\n\n\n\n\n\nNGL production, MBbl/d (3)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPermian Midland (4)\n\n\n \n\n\n \n\n\n428.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n367.7\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n60.7\n\n\n \n\n\n \n\n\n \n\n\n17\n\n\n%\n\n\n\n\n\n\nPermian Delaware\n\n\n \n\n\n \n\n\n359.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n321.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n38.3\n\n\n \n\n\n \n\n\n \n\n\n12\n\n\n%\n\n\n\n\n\n\nTotal Permian\n\n\n \n\n\n \n\n\n788.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n689.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n99.0\n\n\n \n\n\n \n\n\n \n\n\n14\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSouthTX (5)\n\n\n \n\n\n \n\n\n32.8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n40.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(8.1\n\n\n)\n\n\n \n\n\n \n\n\n(20\n\n\n%)\n\n\n\n\n\n\nNorth Texas\n\n\n \n\n\n \n\n\n22.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n24.0\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(1.4\n\n\n)\n\n\n \n\n\n \n\n\n(6\n\n\n%)\n\n\n\n\n\n\nSouthOK (5)\n\n\n \n\n\n \n\n\n35.0\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n43.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(8.1\n\n\n)\n\n\n \n\n\n \n\n\n(19\n\n\n%)\n\n\n\n\n\n\nWestOK\n\n\n \n\n\n \n\n\n15.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n12.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n2.6\n\n\n \n\n\n \n\n\n \n\n\n21\n\n\n%\n\n\n\n\n\n\nTotal Central\n\n\n \n\n\n \n\n\n105.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n120.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(15.0\n\n\n)\n\n\n \n\n\n \n\n\n(12\n\n\n%)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nBadlands (5)\n\n\n \n\n\n \n\n\n16.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n15.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1.1\n\n\n \n\n\n \n\n\n \n\n\n7\n\n\n%\n\n\n\n\n\n\nTotal Field\n\n\n \n\n\n \n\n\n910.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n825.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n85.1\n\n\n \n\n\n \n\n\n \n\n\n10\n\n\n%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCoastal\n\n\n \n\n\n \n\n\n35.8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n39.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(3.4\n\n\n)\n\n\n \n\n\n \n\n\n(9\n\n\n%)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n \n\n\n946.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n864.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n81.7\n\n\n \n\n\n \n\n\n \n\n\n9\n\n\n%\n\n\n\n\n\n\nCrude oil, Badlands, MBbl/d\n\n\n \n\n\n \n\n\n106.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n105.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1.1\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n%\n\n\n\n\n\n\nCrude oil, Permian, MBbl/d\n\n\n \n\n\n \n\n\n27.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n27.4\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n0.5\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n%\n\n\n\n\n\n\nNatural gas sales, BBtu/d (3)\n\n\n \n\n\n \n\n\n2,780.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n2,685.8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n94.7\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n%\n\n\n\n\n\n\nNGL sales, MBbl/d (3)\n\n\n \n\n\n \n\n\n558.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n495.8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n62.4\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n%\n\n\n\n\n\n\nCondensate sales, MBbl/d\n\n\n \n\n\n \n\n\n19.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n18.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n0.8\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n%\n\n\n\n\n\n\nAverage realized prices (7):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNatural gas, $/MMBtu\n\n\n \n\n\n \n\n\n0.67\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1.94\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(1.27\n\n\n)\n\n\n \n\n\n \n\n\n(65\n\n\n%)\n\n\n\n\n\n\nNGL, $/gal\n\n\n \n\n\n \n\n\n0.46\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n0.46\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nCondensate, $/Bbl\n\n\n \n\n\n \n\n\n73.35\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n74.35\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n(1.00\n\n\n)\n\n\n \n\n\n \n\n\n(1\n\n\n%)\n\n\n\n\n\n\n \n\n\n(1)\nSegment operating statistics include the effect of intersegment amounts, which have been eliminated from the consolidated presentation. For all volume statistics presented, the numerator is the total volume sold during the period and the denominator is the number of calendar days during the period.\n\n\n(2)\nPlant natural gas inlet represents our undivided interest in the volume of natural gas passing through the meter located at the inlet of a natural gas processing plant, other than Badlands.\n\n\n62\n\n\n\n\n \n\n\n(3)\nPlant natural gas inlet volumes and gross NGL production volumes include producer take-in-kind volumes, while natural gas sales and NGL sales exclude producer take-in-kind volumes.\n\n\n(4)\nPermian Midland includes operations in WestTX, of which we own a 72.8% undivided interest, and other plants that are owned 100% by us. Operating results for the WestTX undivided interest assets are presented on a pro-rata net basis in our reported financials.\n\n\n(5)\nOperations include facilities that are not wholly owned by us. For more information regarding our joint ventures and jointly owned facilities, see “Item 1. Business—Our Business Operations.” \n\n\n(6)\nBadlands natural gas inlet represents the total wellhead volume and includes the Targa volumes processed at the LM4 plant.\n\n\n(7)\nAverage realized prices, net of fees, include the effect of realized commodity hedge gain/loss attributable to our equity volumes. The price is calculated using total commodity sales plus the hedge gain/loss as the numerator and total sales volume as the denominator, net of fees.\n\n\n \n\n\nThe following table presents the realized commodity hedge gain (loss) attributable to our equity volumes that are included in the adjusted operating margin of the Gathering and Processing segment:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31, 2024\n\n\n \n\n\n \n\n\nYear Ended December 31, 2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions, except volumetric data and price amounts)\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nVolume \nSettled\n\n\n \n\n\n \n\n\nPrice \nSpread (1)\n\n\n \n\n\n \n\n\nGain \n(Loss)\n\n\n \n\n\n \n\n\nVolume \nSettled\n\n\n \n\n\n \n\n\nPrice \nSpread (1)\n\n\n \n\n\n \n\n\nGain \n(Loss)\n\n\n \n\n\n\n\n\n\nNatural gas (BBtu)\n\n\n \n\n\n \n\n\n43.7\n\n\n \n\n\n \n\n\n$\n\n\n1.92\n\n\n \n\n\n \n\n\n$\n\n\n84.1\n\n\n \n\n\n \n\n\n \n\n\n63.2\n\n\n \n\n\n \n\n\n$\n\n\n1.22\n\n\n \n\n\n \n\n\n$\n\n\n77.4\n\n\n \n\n\n\n\n\n\nNGL (MMgal)\n\n\n \n\n\n \n\n\n449.8\n\n\n \n\n\n \n\n\n \n\n\n0.04\n\n\n \n\n\n \n\n\n \n\n\n15.8\n\n\n \n\n\n \n\n\n \n\n\n680.3\n\n\n \n\n\n \n\n\n \n\n\n0.07\n\n\n \n\n\n \n\n\n \n\n\n49.9\n\n\n \n\n\n\n\n\n\nCrude oil (MBbl)\n\n\n \n\n\n \n\n\n2.1\n\n\n \n\n\n \n\n\n \n\n\n(2.05\n\n\n)\n\n\n \n\n\n \n\n\n(4.3\n\n\n)\n\n\n \n\n\n \n\n\n2.4\n\n\n \n\n\n \n\n\n \n\n\n(6.92\n\n\n)\n\n\n \n\n\n \n\n\n(16.6\n\n\n)\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n95.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n110.7\n\n\n \n\n\n\n\n\n\n \n\n\n(1)\nThe price spread is the differential between the contracted derivative instrument pricing and the price of the corresponding settled commodity transaction.\n\n\n \n\n\n2024 Compared to 2023\n\n\n \n\n\nThe increase in adjusted operating margin was predominantly due to higher natural gas inlet volumes which drove higher fee-based income in the Permian, partially offset by lower natural gas and condensate prices. The increase in natural gas inlet volumes was attributable to the addition of the Legacy II plant during the first quarter of 2023, the Midway plant during the second quarter of 2023, the Greenwood I and Wildcat II plants during the fourth quarter of 2023, the Roadrunner II plant during the second quarter of 2024, the Greenwood II plant during the fourth quarter of 2024, and continued strong producer activity.\n\n\n \n\n\nThe increase in operating expenses was primarily due to higher volumes and multiple plant additions in the Permian.\n\n\n \n\n\nLogistics and Transportation Segment\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2024 vs. 2023\n\n\n\n\n\n\n \n\n\n(In millions, except operating statistics)\n\n\n\n\n\n\nOperating margin\n\n\n \n\n\n$\n\n\n \n\n\n2,355.1\n\n\n \n\n\n \n\n\n$\n\n\n \n\n\n1,948.7\n\n\n \n\n\n \n\n\n$\n\n\n \n\n\n406.4\n\n\n \n\n\n \n\n\n21%\n\n\n\n\n\n\nOperating expenses\n\n\n \n\n\n \n\n\n \n\n\n362.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n332.0\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n30.3\n\n\n \n\n\n \n\n\n9%\n\n\n\n\n\n\nAdjusted operating margin\n\n\n \n\n\n$\n\n\n \n\n\n2,717.4\n\n\n \n\n\n \n\n\n$\n\n\n \n\n\n2,280.7\n\n\n \n\n\n \n\n\n$\n\n\n \n\n\n436.7\n\n\n \n\n\n \n\n\n19%\n\n\n\n\n\n\nOperating statistics MBbl/d (1):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNGL pipeline transportation volumes (2)\n\n\n \n\n\n \n\n\n \n\n\n800.8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n635.5\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n165.3\n\n\n \n\n\n \n\n\n26%\n\n\n\n\n\n\nFractionation volumes\n\n\n \n\n\n \n\n\n \n\n\n936.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n798.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n138.0\n\n\n \n\n\n \n\n\n17%\n\n\n\n\n\n\nExport volumes (3)\n\n\n \n\n\n \n\n\n \n\n\n423.6\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n365.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n58.4\n\n\n \n\n\n \n\n\n16%\n\n\n\n\n\n\nNGL sales\n\n\n \n\n\n \n\n\n \n\n\n1,159.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,019.8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n139.3\n\n\n \n\n\n \n\n\n14%\n\n\n\n\n\n\n \n\n\n(1)\nSegment operating statistics include intersegment amounts, which have been eliminated from the consolidated presentation. For all volume statistics presented, the numerator is the total volume sold during the period and the denominator is the number of calendar days during the period.\n\n\n(2)\nRepresents the total quantity of mixed NGLs that earn a transportation margin.\n\n\n(3)\nExport volumes represent the quantity of NGL products delivered to third-party customers at our Galena Park Marine Terminal that are destined for international markets.\n\n\n \n\n\n2024 Compared to 2023\n\n\n \n\n\nThe increase in adjusted operating margin was due to higher pipeline transportation and fractionation margin, higher marketing margin, and higher LPG export margin. Pipeline transportation and fractionation volumes benefited from higher supply volumes primarily from our Permian Gathering and Processing systems, the addition of Train 9 during the second quarter of 2024, the in-service of the Daytona NGL Pipeline during the third quarter of 2024, and the addition of Train 10 during the fourth quarter of 2024. Marketing margin increased due to greater optimization opportunities. LPG export margin increased due to higher volumes as we benefited from the completion of the export expansion project during the third quarter of 2023 and the Houston Ship Channel allowing night-time vessel transits, partially offset by maintenance and required inspections.\n \n\n\n \n\n\nThe increase in operating expenses was due to higher system volumes, higher compensation and benefits, higher taxes, higher repairs and maintenance and the addition of two trains during 2024.\n\n\n \n\n\n63\n\n\n\n\n \n\n\n \n\n\nOther\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2024 vs. 2023\n\n\n \n\n\n\n\n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nOperating margin\n\n\n \n\n\n$\n\n\n(164.6\n\n\n)\n\n\n \n\n\n$\n\n\n275.5\n\n\n \n\n\n \n\n\n$\n\n\n(440.1\n\n\n)\n\n\n\n\n\n\nAdjusted operating margin\n\n\n \n\n\n$\n\n\n(164.6\n\n\n)\n\n\n \n\n\n$\n\n\n275.5\n\n\n \n\n\n \n\n\n$\n\n\n(440.1\n\n\n)\n\n\n\n\n\n\n \n\n\nOther contains the results of commodity derivative activity mark-to-market gains/losses related to derivative contracts that were not designated as cash flow hedges. We have entered into derivative instruments to hedge the commodity price associated with a portion of our future commodity purchases and sales and natural gas transportation basis risk within our Logistics and Transportation segment. See further details of our risk management program in “Item 7A. – Quantitative and Qualitative Disclosures About Market Risk.”\n\n\n \n\n\nOur Liquidity and Capital Resources\n\n\n \n\n\nAs of December 31, 2024, inclusive of our consolidated joint venture accounts, we had $157.3 million of Cash and cash equivalents on our Consolidated Balance Sheets. On a consolidated basis, our main sources of liquidity and capital resources are internally generated cash flows from operations, borrowings under the New TRGP Revolver, Commercial Paper Program, Securitization Facility, and access to debt and equity capital markets. We supplement these sources of liquidity with joint venture arrangements and proceeds from asset sales. Our exposure to adverse credit conditions includes our credit facilities, cash investments, hedging abilities, customer performance risks and counterparty performance risks.\n \n\n\n \n\n\nWe believe our sources of liquidity and capital resources are sufficient to meet our anticipated cash requirements for at least the next twelve months to satisfy our obligations. Our ability to generate cash is subject to a number of factors, some of which are beyond our control. These include commodity prices and ongoing efforts to manage operating costs and maintenance capital expenditures, as well as general economic, financial, competitive, legislative, regulatory and other factors. For additional discussion on recent factors impacting our liquidity and capital resources, see “Recent Developments.”\n\n\n \n\n\nShort-term Liquidity\n\n\n \n\n\nOur principal sources of short-term liquidity consist of internally generated cash flow, borrowings available under the New TRGP Revolver, as well as our right to request additional commitment increases under the New TRGP Revolver, our Commercial Paper Program, the Securitization Facility, proceeds from debt and equity offerings, and joint ventures and/or asset sales. Based on anticipated levels of operations and absent any disruptive events, we believe our liquidity is sufficient to finance our operations, capital expenditures, quarterly cash dividends and obligations, as discussed further below, for at least the next twelve months.\n \n\n\n \n\n\nOur short-term liquidity on a consolidated basis as of February 18, 2025 was:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nConsolidated Total\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nCash on hand (1)\n\n\n \n\n\n$\n\n\n254.5\n\n\n \n\n\n\n\n\n\nTotal availability under the Securitization Facility\n\n\n \n\n\n \n\n\n600.0\n\n\n \n\n\n\n\n\n\nTotal availability under the New TRGP Revolver and Commercial Paper Program\n\n\n \n\n\n \n\n\n3,500.0\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n4,354.5\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOutstanding borrowings under the Securitization Facility\n\n\n \n\n\n \n\n\n(600.0\n\n\n)\n\n\n\n\n\n\nOutstanding borrowings under the New TRGP Revolver and Commercial Paper Program\n\n\n \n\n\n \n\n\n(881.0\n\n\n)\n\n\n\n\n\n\nOutstanding letters of credit under the New TRGP Revolver\n\n\n \n\n\n \n\n\n(9.4\n\n\n)\n\n\n\n\n\n\nTotal liquidity\n\n\n \n\n\n$\n\n\n2,864.1\n\n\n \n\n\n\n\n\n\n \n\n\n(1)\nIncludes cash held in our consolidated joint venture accounts.\n\n\n \n\n\nOther potential capital resources associated with our existing arrangements include our right to request an additional $500.0 million in commitment increases under the New TRGP Revolver, subject to the terms therein. The New TRGP Revolver matures on February 18, 2030. The maturity date is extendable, subject to the lenders’ consent, by one year up to two times.\n\n\n \n\n\nIn August 2024, the Partnership amended the Securitization Facility to, among other things, extend the termination date of the Securitization Facility to August 29, 2025.\n\n\n \n\n\nA portion of our capital resources are allocated to letters of credit to satisfy certain counterparty credit requirements. As of December 31, 2024, we had $17.6 million in letters of credit outstanding under the Existing TRGP Revolver. The letters of credit also reflect certain\n \n\n\n64\n\n\n\n\n \n\n\ncounterparties’ views of our financial condition and ability to satisfy our performance obligations, as well as commodity prices and other factors.\n\n\n \n\n\nWorking Capital\n\n\n \n\n\nWorking capital is the amount by which current assets exceed current liabilities. On a consolidated basis, at the end of any given month, accounts receivable and payable tied to commodity sales and purchases are relatively balanced, with receivables from customers being offset by plant settlements payable to producers. The factors that typically cause overall variability in our reported total working capital are: (i) our cash position; (ii) liquids inventory levels, which we closely manage, as well as liquids valuations; (iii) changes in payables and accruals related to major growth capital projects; (iv) changes in the fair value of the current portion of derivative contracts; (v) monthly swings in borrowings under the Securitization Facility; and (vi) major structural changes in our asset base or business operations, such as certain organic growth capital projects and acquisitions or divestitures.\n\n\n \n\n\nWorking capital as of December 31, 2024 decreased $310.0 million compared to December 31, 2023. The decrease was primarily due to higher accounts payable related to capital spending on growth projects, higher product purchases and fuel payables resulting from higher NGL volumes and prices, and higher net liabilities for hedging activities, partially offset by higher receivables resulting from higher NGL volumes and prices, and a lower outstanding balance on the Securitization Facility.\n\n\n \n\n\nLong-term Financing\n\n\n \n\n\nOur long-term financing consists of potentially raising funds through long-term debt obligations, the issuance of common stock, preferred stock, or joint venture arrangements. The majority of our debt is fixed rate borrowings; however, we have some exposure to the risk of changes in interest rates, primarily as a result of the variable rate borrowings under the New TRGP Revolver, the Securitization Facility, and the Commercial Paper Program. We may enter into interest rate hedges with the intent to mitigate the impact of changes in interest rates on cash flows. As of December 31, 2024, we did not have any interest rate hedges.\n \n\n\n \n\n\nIn August 2024, we completed an underwritten public offering of the 5.500% Notes, resulting in net proceeds of approximately $990.1 million. We used the net proceeds from the issuance to repay borrowings under the Commercial Paper Program, a portion of which were incurred to repay the remaining balance under the Term Loan Facility, and for general corporate purposes.\n\n\n \n\n\nIn the future, we or the Partnership may redeem, purchase or exchange certain of our and/or the Partnership’s outstanding debt through redemption calls, cash purchases and/or exchanges for other debt, in open market purchases, privately negotiated transactions or otherwise. Such calls, repurchases, exchanges or redemptions, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors. The amounts involved may be material.\n\n\n \n\n\nTo date, our debt balances and our subsidiaries’ debt balances have not adversely affected our operations, ability to grow or ability to repay or refinance indebtedness.\n \n\n\n \n\n\nFor information about our debt obligations, see Note 8 – Debt Obligations to our consolidated financial statements. For information about our interest rate risk, see “Item 7A. Quantitative and Qualitative Disclosures About Market Risk—Interest Rate Risk.”\n\n\n \n\n\nCompliance with Debt Covenants\n\n\n \n\n\nAs of December 31, 2024, both we and the Partnership were in compliance with the covenants contained in our various debt agreements.\n\n\n \n\n\nCash Flow Analysis\n\n\n \n\n\nCash Flows from Operating Activities\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2024 vs. 2023\n\n\n \n\n\n\n\n\n\n(In millions)\n\n\n \n\n\n\n\n\n\n$\n\n\n3,649.7\n\n\n \n\n\n \n\n\n$\n\n\n3,211.6\n\n\n \n\n\n \n\n\n$\n\n\n438.1\n\n\n \n\n\n\n\n\n\n \n\n\nThe primary drivers of cash flows from operating activities are: (i) the collection of cash from customers from the sale of NGLs and natural gas, as well as fees for processing, gathering, export, fractionation, terminaling, storage and transportation; (ii) the payment of amounts related to the purchase of NGLs and natural gas; and (iii) the payment of other expenses, primarily field operating costs, general and administrative expense and interest expense. In addition, we use derivative instruments to manage our exposure to commodity price risk. Changes in the prices of the commodities we hedge impact our derivative settlements as well as our margin deposit requirements on unsettled futures contracts.\n \n\n\n65\n\n\n\n\n \n\n\n \n\n\nThe increase in net cash provided by operating activities was primarily due to higher collections from customers resulting from increased revenues during 2024 compared to 2023, partially offset by an increase in payments for product purchases and fuel, lower settlements on our hedging transactions, an increase in interest payments, and a nonrecurring one-time payment associated with the Splitter Agreement ruling.\n\n\n \n\n\nCash Flows from Investing Activities\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2024 vs. 2023\n\n\n \n\n\n\n\n\n\n(In millions)\n\n\n \n\n\n\n\n\n\n$\n\n\n(3,021.3\n\n\n)\n\n\n \n\n\n$\n\n\n(2,400.8\n\n\n)\n\n\n \n\n\n$\n\n\n(620.5\n\n\n)\n\n\n\n\n\n\n \n\n\nThe increase in net cash used in investing activities was due to higher outlays for major growth capital projects in 2024 primarily related to construction activities in the Permian region and Mont Belvieu, Texas.\n\n\n \n\n\nCash Flows from Financing Activities\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nSource of Financing Activities, net\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDebt, including financing costs\n\n\n$\n\n\n1,149.9\n\n\n \n\n\n \n\n\n$\n\n\n1,300.0\n\n\n \n\n\n\n\n\n\nRepurchase of noncontrolling interests\n\n\n \n\n\n(112.9\n\n\n)\n\n\n \n\n\n \n\n\n(1,118.9\n\n\n)\n\n\n\n\n\n\nDividends\n\n\n \n\n\n(615.5\n\n\n)\n\n\n \n\n\n \n\n\n(427.3\n\n\n)\n\n\n\n\n\n\nContributions from (distributions to) noncontrolling interests\n\n\n \n\n\n(220.6\n\n\n)\n\n\n \n\n\n \n\n\n(212.4\n\n\n)\n\n\n\n\n\n\nRepurchase of shares\n\n\n \n\n\n(813.7\n\n\n)\n\n\n \n\n\n \n\n\n(429.5\n\n\n)\n\n\n\n\n\n\nNet cash provided by (used in) financing activities\n\n\n$\n\n\n(612.8\n\n\n)\n\n\n \n\n\n$\n\n\n(888.1\n\n\n)\n\n\n\n\n\n\n \n\n\nThe decrease in net cash used in financing activities was due to lower repurchases of noncontrolling interests primarily due to the Grand Prix Transaction in 2023, partially offset by higher repurchases of common stock, higher dividends paid and lower borrowings of debt in 2024. This decrease in debt borrowing activity was due to lower proceeds from senior unsecured notes, partially offset by higher net borrowings under the Commercial Paper Program, lower repayments under the Term Loan Facility in 2024, and repayments under the Existing TRGP Revolver in 2023.\n\n\n \n\n\nSummarized Combined Financial Information for Guarantee of Securities of Subsidiaries\n\n\n \n\n\nOur subsidiaries that guaranteed our obligations under the Existing TRGP Revolver (the “Obligated Group”) also fully and unconditionally guaranteed, jointly and severally, the payment of TRGP’s senior unsecured notes, subject to certain limited exceptions.\n\n\n \n\n\nIn lieu of providing separate financial statements for the Obligated Group, we have presented the following supplemental summarized Combined Balance Sheet and Statement of Operations information for the Obligated Group based on Rule 13-01 of the SEC’s Regulation S-X.\n\n\n \n\n\nAll significant intercompany items among the Obligated Group have been eliminated in the supplemental summarized combined financial information. The Obligated Group’s investment balances in our non-guarantor subsidiaries have been excluded from the supplemental summarized combined financial information. Significant intercompany balances and activity for the Obligated Group with other related parties, including our non-guarantor subsidiaries (referred to as “affiliates”), are presented separately in the following supplemental summarized combined financial information.\n\n\n \n\n\n66\n\n\n\n\n \n\n\nSummarized Combined Balance Sheet and Statement of Operations information for the Obligated Group as of the end of the most recent period presented follows:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSummarized Combined Balance Sheet Information\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n \n\n\nDecember 31, 2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nASSETS\n\n\n \n\n\n\n\n\n\nCurrent assets\n\n\n \n\n\n$\n\n\n986.9\n\n\n \n\n\n \n\n\n$\n\n\n966.3\n\n\n \n\n\n\n\n\n\nCurrent assets - affiliates\n\n\n \n\n\n \n\n\n1.1\n\n\n \n\n\n \n\n\n \n\n\n11.2\n\n\n \n\n\n\n\n\n\nLong-term assets\n\n\n \n\n\n \n\n\n16,574.0\n\n\n \n\n\n \n\n\n \n\n\n15,267.6\n\n\n \n\n\n\n\n\n\nTotal assets\n\n\n \n\n\n$\n\n\n17,562.0\n\n\n \n\n\n \n\n\n$\n\n\n16,245.1\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nLIABILITIES AND OWNERS’ EQUITY (DEFICIT)\n\n\n \n\n\n\n\n\n\nCurrent liabilities\n\n\n \n\n\n$\n\n\n2,763.0\n\n\n \n\n\n \n\n\n$\n\n\n2,107.9\n\n\n \n\n\n\n\n\n\nCurrent liabilities - affiliates\n\n\n \n\n\n \n\n\n36.7\n\n\n \n\n\n \n\n\n \n\n\n26.2\n\n\n \n\n\n\n\n\n\nLong-term liabilities\n\n\n \n\n\n \n\n\n15,120.9\n\n\n \n\n\n \n\n\n \n\n\n13,278.8\n\n\n \n\n\n\n\n\n\nTarga Resources Corp. stockholders’ equity (deficit)\n\n\n \n\n\n \n\n\n(358.6\n\n\n)\n\n\n \n\n\n \n\n\n832.2\n\n\n \n\n\n\n\n\n\nTotal liabilities and owners’ equity (deficit)\n\n\n \n\n\n$\n\n\n17,562.0\n\n\n \n\n\n \n\n\n$\n\n\n16,245.1\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSummarized Combined Statement of Operations Information\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nRevenues\n\n\n \n\n\n$\n\n\n15,939.3\n\n\n \n\n\n \n\n\n$\n\n\n15,737.0\n\n\n \n\n\n\n\n\n\nOperating income\n\n\n \n\n\n \n\n\n2,031.3\n\n\n \n\n\n \n\n\n \n\n\n2,134.2\n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n \n\n\n888.7\n\n\n \n\n\n \n\n\n \n\n\n1,100.1\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nCommon Stock Dividends\n\n\n \n\n\nThe following table details the dividends declared and/or paid by us to common shareholders for 2024:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThree Months Ended\n\n\n \n\n\nDate Paid or\nTo Be Paid\n\n\n \n\n\nTotal Common\nDividends Declared\n\n\n \n\n\n \n\n\nAmount of Common\nDividends Paid or\nTo Be Paid\n\n\n \n\n\n \n\n\nDividends on \nShare-Based Awards\n\n\n \n\n\n \n\n\nDividends Declared per Share of Common Stock\n\n\n \n\n\n\n\n\n\n(In millions, except per share amounts)\n\n\n \n\n\n\n\n\n\nDecember 31, 2024\n\n\n \n\n\nFebruary 14, 2025\n\n\n \n\n\n$\n\n\n165.1\n\n\n \n\n\n \n\n\n$\n\n\n163.6\n\n\n \n\n\n \n\n\n$\n\n\n1.5\n\n\n \n\n\n \n\n\n$\n\n\n0.75000\n\n\n \n\n\n\n\n\n\nSeptember 30, 2024\n\n\n \n\n\nNovember 15, 2024\n\n\n \n\n\n \n\n\n165.2\n\n\n \n\n\n \n\n\n \n\n\n163.5\n\n\n \n\n\n \n\n\n \n\n\n1.7\n\n\n \n\n\n \n\n\n \n\n\n0.75000\n\n\n \n\n\n\n\n\n\nJune 30, 2024\n\n\n \n\n\nAugust 15, 2024\n\n\n \n\n\n \n\n\n166.1\n\n\n \n\n\n \n\n\n \n\n\n164.3\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n \n\n\n \n\n\n \n\n\n0.75000\n\n\n \n\n\n\n\n\n\nMarch 31, 2024\n\n\n \n\n\nMay 15, 2024\n\n\n \n\n\n \n\n\n168.1\n\n\n \n\n\n \n\n\n \n\n\n166.3\n\n\n \n\n\n \n\n\n \n\n\n1.8\n\n\n \n\n\n \n\n\n \n\n\n0.75000\n\n\n \n\n\n\n\n\n\n \n\n\nThe actual amount we declare as dividends in the future depends on our consolidated financial condition, results of operations, cash flow, the level of our capital expenditures, future business prospects, compliance with our debt covenants and any other matters that our Board of Directors deems relevant.\n\n\n \n\n\n67\n\n\n\n\n \n\n\nCapital Expenditures\n\n\n \n\n\nThe following table details cash outlays for capital projects for the years ended December 31, 2024 and 2023:\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(In millions)\n\n\n \n\n\n\n\n\n\nCapital expenditures:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nGrowth (1)\n\n\n \n\n\n$\n\n\n2,950.1\n\n\n \n\n\n \n\n\n$\n\n\n2,211.0\n\n\n \n\n\n\n\n\n\nMaintenance (2)\n\n\n \n\n\n \n\n\n241.7\n\n\n \n\n\n \n\n\n \n\n\n232.6\n\n\n \n\n\n\n\n\n\nGross capital expenditures\n\n\n \n\n\n \n\n\n3,191.8\n\n\n \n\n\n \n\n\n \n\n\n2,443.6\n\n\n \n\n\n\n\n\n\nChange in capital project payables and accruals, net\n\n\n \n\n\n \n\n\n(226.0\n\n\n)\n\n\n \n\n\n \n\n\n(58.2\n\n\n)\n\n\n\n\n\n\nCash outlays for capital projects\n\n\n \n\n\n$\n\n\n2,965.8\n\n\n \n\n\n \n\n\n$\n\n\n2,385.4\n\n\n \n\n\n\n\n\n\n \n\n\n(1)\nGrowth capital expenditures, net of contributions from noncontrolling interests and including contributions to investments in unconsolidated affiliates, were $3,000.4 million and $2,224.5 million for the years ended December 31, 2024 and 2023.\n\n\n(2)\nMaintenance capital expenditures, net of contributions from noncontrolling interests, were $231.9 million and $223.4 million for the years ended December 31, 2024 and 2023.\n\n\n \n\n\nThe increase in total growth capital expenditures was primarily due to system expansions in the Permian region in response to forecasted production growth and higher activity levels, and expansions in our downstream business. The increase in total maintenance capital expenditures was primarily due to our growing infrastructure footprint. Future capital expenditures may vary based on investment opportunities and maintenance capital requirements.\n\n\n \n\n\nOff-Balance Sheet Arrangements\n \n\n\n \n\n\nAs of December 31, 2024, there were $73.8 million in surety bonds outstanding related to various performance obligations. These are in place to support various performance obligations as required by (i) statutes within the regulatory jurisdictions where we operate and (ii) counterparty support. Obligations under these surety bonds are not normally called, as we typically comply with the underlying performance requirement.\n\n\n \n\n\nWe have invested in entities that are not consolidated in our financial statements. For information on our obligations with respect to these investments, as well as our obligations with respect to related letters of credit, see Note 7 – Investments in Unconsolidated Affiliates and Note 8 – Debt Obligations.\n\n\n \n\n\nContractual Obligations\n \n\n\n \n\n\nWe believe we have sufficient liquidity to fund our operations and meet our short-term and long-term cash obligations. The following is a summary of our material future contractual obligations:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nContractual Obligations:\n\n\n \n\n\nTotal\n\n\n \n\n\n \n\n\nWithin 12 Months\n\n\n \n\n\n\n\n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nLong-term debt obligations (1)\n\n\n \n\n\n$\n\n\n \n\n\n13,664.9\n\n\n \n\n\n \n\n\n$\n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nInterest on debt obligations (2)\n\n\n \n\n\n \n\n\n \n\n\n7,031.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n758.3\n\n\n \n\n\n\n\n\n\nOperating leases (3)\n\n\n \n\n\n \n\n\n \n\n\n134.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n22.2\n\n\n \n\n\n\n\n\n\nFinance leases (4)\n\n\n \n\n\n \n\n\n \n\n\n335.3\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n70.3\n\n\n \n\n\n\n\n\n\nLand site lease and rights of way (5)\n\n\n \n\n\n \n\n\n \n\n\n333.1\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n9.3\n\n\n \n\n\n\n\n\n\nPurchase obligations (6)\n\n\n \n\n\n \n\n\n \n\n\n2,736.9\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n1,316.3\n\n\n \n\n\n\n\n\n\nOther long-term liabilities (7)\n\n\n \n\n\n \n\n\n \n\n\n123.2\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n17.9\n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n \n\n\n24,359.4\n\n\n \n\n\n \n\n\n$\n\n\n \n\n\n2,194.3\n\n\n \n\n\n\n\n\n\n \n\n\n(1)\nRepresents scheduled future maturities of long-term debt obligation and excludes the Securitization Facility. See Note 8 - Debt Obligations for more information. \n\n\n(2)\nRepresents interest expense on long-term debt obligations based on both fixed debt interest rates and prevailing December 31, 2024 rates for floating debt. See Note 8 - Debt Obligations for more information.\n\n\n(3)\nIncludes minimum payments on operating lease obligations for compressors, office space and railcars. See Note 10 - Leases for more information.\n\n\n(4)\nIncludes minimum payments on finance lease obligations for compressors, substations, vehicles and tractors. See Note 10 - Leases for more information.\n\n\n(5)\nLand site lease and rights of way provide for surface and underground access for gathering, processing and distribution assets that are located on property not owned by us. These agreements expire at various dates with varying terms, some of which are perpetual. See Note 16 - Commitments for more information.\n\n\n(6)\nIncludes commitments for pipeline capacity payments for firm transportation and throughput and deficiency agreements, purchase of natural gas and NGLs, capital expenditures, operating expenses and service contracts. Contracts that will be settled at future spot prices are valued using prices as of December 31, 2024.\n\n\n(7)\nIncludes long-term liabilities of which we are certain of the amount and timing, including certain arrangements that resulted in deferred revenue and other liabilities pertaining to accrued dividends. See Note 9 - Other Long-term Liabilities for more information.\n\n\n \n\n\n68\n\n\n\n\n \n\n\nCritical Accounting Policies and Estimates\n\n\n \n\n\nThe accounting policies and estimates discussed below are considered by management to be critical to an understanding of our financial statements because their application requires the most significant judgments from management in estimating matters for financial reporting that are inherently uncertain. See the description of our accounting policies in the notes to the financial statements for additional information about our critical accounting policies and estimates.\n\n\n \n\n\nBusiness Acquisitions\n\n\n \n\n\nFor business acquisitions, we recognize the identifiable assets acquired, the liabilities assumed and any noncontrolling interest in the acquiree at their estimated fair values on the acquisition date. Goodwill results when the cost of a business acquisition exceeds the fair value of the net identifiable assets of the acquired business. Determining fair value requires management’s judgment and involves the use of significant estimates and assumptions with respect to projections of future production volumes, pricing and cash flows, benchmark analysis of comparable public companies, discount rates, expectations regarding customer contracts and relationships, and other management estimates. The judgments made in the determination of the estimated fair value assigned to the assets acquired, liabilities assumed and any noncontrolling interest in the investee, the duration of each liability, and any resulting goodwill can materially impact the financial statements in periods after acquisition. See Note 4 – Acquisitions and Divestitures in our Consolidated Financial Statements.\n\n\n \n\n\nDepreciation of Property, Plant and Equipment and Amortization of Intangible Assets\n\n\n \n\n\nDepreciation of our property, plant and equipment is computed using the straight-line method over the estimated useful lives of the assets. Our estimate of depreciation incorporates assumptions regarding the useful economic lives and residual values of our assets. The determination of useful lives of property, plant and equipment requires us to make various assumptions, including our expected use of the asset and the supply of and demand for hydrocarbons in the markets served, normal wear and tear of facilities, and the extent and frequency of maintenance programs.\n \n\n\n \n\n\nWe amortize the costs of our intangible assets in a manner that closely resembles the expected benefit pattern of the intangible assets or on a straight-line basis where such pattern is not readily determinable, over the periods in which we benefit from services provided to customers. At the time assets are placed in service or acquired, we believe such assumptions are reasonable; however, circumstances may develop that would cause us to change these assumptions, which would change our depreciation/amortization amounts prospectively.\n \n\n\n \n\n\nImpairment of Long-Lived Assets, including Intangible Assets\n\n\n \n\n\nWe evaluate long-lived assets, including intangible assets, for impairment when events or changes in circumstances indicate our carrying amount of an asset may not be recoverable, including changes to our estimates that could have an impact on our assessment of asset recoverability. Asset recoverability is measured by comparing the carrying value of the asset or asset group with its expected future pre-tax undiscounted cash flows. Individual assets are grouped at the lowest level for which the related identifiable cash flows are largely independent of the cash flows of other assets and liabilities. These cash flow estimates require us to make judgments and assumptions related to operating and cash flow results, economic obsolescence, the business climate, contractual, legal and other factors.\n\n\n \n\n\nIf the carrying amount exceeds the expected future undiscounted cash flows, we recognize a non-cash pre-tax impairment charge equal to the excess of net book value over fair value. The estimated cash flows used to assess recoverability of our long-lived assets and measure fair value of our asset groups are derived from current business plans, which are developed using near-term price and volume projections reflective of the current environment and management's projections for long-term average prices and volumes. In addition to near and long-term price assumptions, other key assumptions include volume projections, operating costs, timing of incurring such costs and the use of an appropriate terminal value and discount rate. Any changes we make to these projections and assumptions could result in significant revisions to our evaluation of recoverability of our long-lived assets and the recognition of additional impairments.\n \n\n\n \n\n\nPrice Risk Management (Hedging)\n\n\n \n\n\nOur net income and cash flows are subject to volatility stemming from changes in commodity prices and interest rates. In an effort to reduce the volatility of our cash flows, we have entered into derivative financial instruments to hedge the commodity price associated with a portion of our expected natural gas, NGL, and condensate equity volumes, future commodity purchases and sales, and transportation basis risk.\n \n\n\n \n\n\nOne of the factors that can affect our operating results each period is the price assumptions used to value our derivative financial instruments, which are reflected at their fair values on the balance sheet. We determine the fair value of our derivative instruments using\n \n\n\n69\n\n\n\n\n \n\n\npresent value methods or standard option valuation models with assumptions about commodity prices based on those observed in underlying markets. Changes in the methods or assumptions we use to calculate the fair value of our derivative instruments could have a material effect on our consolidated financial statements.\n \n\n\n \n\n\nRecent Accounting Pronouncements\n\n\n \n\n\nFor a discussion of recent accounting pronouncements that will affect us, see Note 3 – Significant Accounting Policies in our Consolidated Financial Statements.",
  "item2": null
}