{
  "item1": "Transporeon solutions cover transportation lifecycle freight sourcing procurement, through freight execution including dock yard management all way freight auditing. collective offerings position us uniquely help customers tackle everyday challenges supply chain industry. products aim solve problems where they occur—in between companies—and hence aimed collaboration, interoperability, data-driven decision making. Each Transporeon product can used standalone combination each other.",
  "item7": "Item 7. Management’s Discussion Analysis Financial Condition Results Operations EXECUTIVE LEVEL OVERVIEW leading provider technology solutions enable professionals field mobile workers improve transform work processes. comprehensive work process solutions used across range industries including architecture, building construction, civil engineering, geospatial, survey mapping, natural resources, utilities, transportation, government. representative customers include construction owners, contractors, engineering construction firms, surveying companies, energy utility companies, trucking companies, state, federal, municipal governments.",
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS CRITICAL ACCOUNTING POLICIES ESTIMATES RECENT ACCOUNTING PRONOUNCEMENTS summary recent accounting pronouncements applicable Condensed Consolidated Financial Statements, refer “Overview Accounting Policies” EXECUTIVE LEVEL OVERVIEW leading provider technology solutions enable professionals field mobile workers improve transform work processes. comprehensive work process solutions used across range industries, including architecture, building construction, civil engineering, geospatial, survey mapping, natural resources, utilities, transportation, government. representative customers include construction owners, contractors, engineering construction firms, surveying companies, energy utility companies, trucking companies, state, federal, municipal governments."
}