{
  "source_file": "trmb-20250103.htm",
  "form_type": "10-K",
  "item1": "Item 1.\nBusiness\nTrimble is a leading technology solutions provider that enables office and field professionals to connect their workflows and asset lifecycles to drive a more productive, sustainable future.  With a focus on the industries that build, move, and feed the world, the comprehensive depth and breadth of our solutions is transforming the way the world works, making it easier for Trimble customers to focus on what matters—getting the job done right.\nWe innovate at the intersection of the digital and physical worlds with solutions that span the world’s foundational industries, including building, civil and infrastructure construction, geospatial, survey and mapping, natural resources, utilities, transportation, and government.\nWe exist to empower our customers: asset owners, general and specialty contractors, engineers and designers, surveyors, energy and utility companies, trucking companies and drivers, as well as state, federal, and municipal governments.\nProductivity and sustainability are at the heart of who we are—woven into our work internally and through our customers’ application of our technologies.  Our solutions provide customers with the ability to improve their work quality while being safe, efficient, and sustainable.  More than that, our products enable reduced environmental impact in our markets, ranging from reduced greenhouse gas (“GHG”) emissions to improved water stewardship.\nToday’s work requires solutions for an interconnected world, no matter the industry.  This has driven Trimble to move increasingly from point solutions to workflows to industry ecosystems enabled by seamless data and artificial intelligence (“AI”).  Trimble offers a \ndiverse range of coherent capabilities that connect applications, data, workflows, and mobile technologies to more efficiently orchestrate work, often in mixed fleet environments.  We deploy AI, Generative AI, Machine Learning, Computer Vision, and similar technologies into our solutions across our business segments to deliver customer value through process automation and operational insights.  Our advanced positioning and autonomous guidance capabilities enable increased precision with large equipment, including equipment used in construction and civil engineering.  \nWe offer integrated systems that track and manage fleets of vehicles, improve the driver experience, and provide real-time logistical analytics and insights back to the office.  Our connected reality capture systems enable the management of large amounts of geo-referenced information, and our software solutions connect all aspects of a fleet, a farm, or a lane, while our collaborative building information modeling (“BIM”) solutions are used throughout the design, build, and operation of the built environment.\nWe focus on integrating our software application and cloud capabilities to create vertically-focused, system-wide solutions that transform how work is done.  The integration of sensors, software, hardware, and data in our portfolio gives us a unique ability to provide detailed insights for our customers to improve their specific workflows.\nOur strategy is centered on the concept of open industry clouds and underlying common data environments as the nucleus of our connected solutions, allowing all stakeholders to collaborate and make decisions based on the same information.  In construction, we connect teams across the design, build, and operational phases of a project.  Our connected supply chain solutions provide transportation companies and their drivers with tools to enhance fuel efficiency, safety, transparency, and sustainability.\nConnected software applications and cloud platform services are key elements of our solutions and account for a steadily increasing portion of our business.  Our software enhances a broad range of other products and systems to allow our customers to optimize their work toward targeted outcomes and improve their decision-making and productivity.  Ranging from embedded, real-time firmware to software that integrates data with large-scale enterprise back-office systems, many of our solutions are extensible and can be tailored by users for customized business processes and workflows.  Trimble software capabilities include extensive three-dimensional (“3D”) modeling, analysis, planning and design solutions, AI capabilities, as well as a large suite of domain-specific software applications used across industries including construction, geospatial, utilities, and transportation.\nOur software is sold as subscription services, term licenses, or perpetual licenses, and is hosted as Software as a Service (“SaaS”), or can be provisioned for on-premise.  We are extending our capabilities to run in multi-cloud environments while delivering our unique value via domain-specific workflows and lifecycle management in our target industries.\nOur global operations include major research, development, manufacturing, and logistics operations in the United States, the Netherlands, India, Germany, Finland, Canada, New Zealand, the United Kingdom, and Sweden. \nBusiness Strategy\nOur growth strategy is centered on multiple elements:\n•\nExecute on our Connect & Scale strategy.\n \n We continue to focus on executing our multi-year platform strategy.  This strategy contains two elements.\n1\nTable of Contents\n◦\nThe first element, \nConnect\n, is about connecting more customer workflows, industry lifecycles, and solution offerings so that we can continue to transform the way our customers work.  This includes integrating more of our customers’ data through cloud offerings, making more of our solutions available on a subscription basis, and incorporating AI capabilities.  For example, our flagship design and construction platform solution, Trimble Connect, enables entire project teams to collaborate in real-time between the office and the field to make efficient decisions around the same data-rich design model enhanced by our cloud capabilities.  Our cloud based solutions in construction create a connected data environment for online collaboration; workflows which connect the digital and physical worlds; and the power to dynamically orchestrate design coordination in the cloud from wherever project stakeholders may be.  Meanwhile in our Transportation business, the Trimble Transportation Cloud, for example, provides shippers and carriers with the critical information they need to make more informed bid and contract award decisions, while our Transporeon business creates a marketplace for shippers, forwarders, carriers, and retailers to connect online and digitize their end-to-end transportation management processes. \n◦\nThe second element, \nScale\n, is about investing in the people, processes, and technologies that are necessary to streamline and standardize our internal processes, providing a seamless experience for our customers as they engage with our connected solutions, and enabling us to continue to grow our business efficiently and effectively for many years into the future.  This network effect also means that the willingness of developers, partners, or end users to engage increases as the number of network participants grows, which further enhances the platform experience and end-user value. \n•\nDeliver customer outcomes that can enable productivity, quality, safety, transparency, and environmental sustainability.\n  Across our business segments, our technological solutions deliver customer value through digital transformation, replacing legacy methods to improve productivity, first-time quality, worker safety, operational transparency, and sustainability.  Our construction and transportation management systems enable customers to optimize their business operations while gaining better operational insight and transparency to facilitate more informed decision-making.  Our online, multi-sided marketplace solutions provide better real-time insight into market pricing and availability, while the deployment of AI across our solutions increases customer productivity through task and process automation.  Our field solutions automate tasks and improve first-time quality, while improving operator safety, and the connection of data flows and workflows between field and office and across stakeholders facilitates operational efficiency and transparency.  By delivering productivity and efficiency gains, avoiding rework, and enabling more sustainable designs, Trimble solutions also deliver sustainability advantages for our customers, reducing the use of fuels and other inputs, which delivers both reduced cost and lower carbon emissions.\n•\nFocus on software and services.\n \nSoftware and services targeted for the needs of vertical end markets are fundamental elements of our solutions and are core to our growth strategy.  Our software is connecting stakeholders across the industry lifecycle continuums of our served industries.  Together, our software and services solutions integrate and optimize additional workflows for our customers, with increasing use of AI, thereby improving their work productivity, and in the case of subscription, maintenance, and support services, also provide us with enhanced business visibility over time.  Professional services constitute an additional customer offering that helps our customers integrate and optimize the use of our offerings in their environment.\n•\nAddress attractive markets with significant growth and profitability potential.\n \n We focus on large markets historically underserved by technology that offer significant potential for long-term revenue growth, profitability, and market leadership.  Our core industries, such as construction and transportation, are each multitrillion-dollar global industries that operate in demanding environments with technology adoption in the early phases relative to other industries.  With the growth in mobile and cloud computing capabilities, the increasing technological know-how of end users, and compelling return on investment, we believe many of our markets continue to be attractive for substituting Trimble’s technology and solutions in place of traditional operating methods\n.\n•\nCapitalize on domain knowledge and technological innovation that benefit a diverse customer base.\n \n We have over time redefined our technological focus from hardware-driven point solutions to integrated work process solutions to industry ecosystems by developing domain expertise and heavily reinvesting in research and development (“R&D”) and acquisitions.  We currently have over 1,000 unique patents reflective of our technology portfolio and deep domain knowledge to deliver specific, targeted solutions quickly and cost-effectively to each of the vertical markets we serve.  Our patent portfolio is continuously updated with new patent grants that emerge from our investments in R&D.  We look for opportunities where the opportunity for technological change is high and that have a requirement for the integration of multiple technologies into complete vertical solutions.\n•\nDrive geographic expansion with a localization strategy. \n \nWe view international expansion as an important element of our strategy, and we continue to position ourselves in geographic markets that will serve as important sources of future growth.  Products are sold in more than 170 countries through dealers, joint ventures, original equipment manufacturers (“OEMs”), and other channels throughout the world, as well as direct sales to end users.  Sales are supported by our own offices located in over 40 countries around the world.\n2\nTable of Contents\n•\nOptimize go-to-market strategies to best access our markets.\n \n We utilize vertically focused go-to-market strategies that leverage domain expertise to best serve the needs of individual markets both domestically and abroad.  These go-to-market capabilities include: independent dealers; joint ventures, including with Caterpillar, AGCO, and Nikon; OEM arrangements; distribution alliances with key partners; and direct sales to end users.  This combination of channels provides us with broad market reach and localization capabilities to effectively serve our markets.\n•\nPursue strategic and targeted acquisitions, divestitures, joint ventures, and investments\n. \n O\nrganic growth continues to be our primary focus, while acquisitions serve to enhance our market position.  We acquire businesses that bring domain expertise, geographic presence, technology, products, and distribution capabilities that augment our portfolio and allow us to penetrate existing markets more effectively, or to establish a market beachhead.  Our success in targeting and effectively integrating acquisitions is an important aspect of our growth strategy. \nWe entered into a definitive agreement with Platform Science on September 14, 2024 to sell our Mobility business.  \nSubsequent to the end of the year 2024, t\nhe transaction closed on February 8, 2025 resulting in our\n ownership\n, or rights to acquire ownership of\n 32.5% o\nf Platform Science’s expanded business with an approximate fair value of \n$\n248.7\n million\n.  We received (i) shares of preferred stock of Platform Science, with certain liquidation preferences, that represent 28.5% of Platform Science’s expanded business and (ii) warrants allowing us the rights to acquire 4% of Platform Science’s expanded business.\n \nThe transaction aims to enhance driver experience, fleet safety, efficiency, and compliance by combining two cutting-edge in-cab commercial vehicle ecosystems, which gives customers access to more applications and offerings.\n \nTo further grow and position Trimble, we partner with leaders in various fields by investing in early-to-growth stage companies through our venture fund and through strategic formation of joint ventures.  On April 1, 2024, we contributed our Ag business, excluding certain GNSS and guidance technologies, to a newly formed joint venture with AGCO named PTx Trimble, of which we retain a 15% ownership stake.  Our Ag business was part of our Field Systems segment.  \nTrimble and AGCO’s shared vision is to create a global leader in mixed fleet smart farming and autonomy solutions that delivers on our collective strategy to better serve farmers with factory fit and aftermarket applications in the mixed fleet precision agriculture market.  \nBusiness Segments and Markets\nOur segments are distinguished by the markets they serve.  Each segment consists of businesses that are responsible for product development, marketing, sales, strategy, and financial performance.  We report our financial performance, including revenue and operating income, based on three reportable segments: Architects, Engineers, Construction and Owners (“AECO”), Field Systems, and Transportation and Logistics (“T&L”).  For further financial information about our segments, see \nNote 7 “Reporting Segment and Geographic Information”\n in Item 8 of this report.\nArchitects, Engineers, Construction and Owners \nThe AECO segment primarily serves customers working in architecture, engineering, construction, design, asset management, operations, and maintenance.  Within this segment, our most substantial product portfolios are focused on design, engineering, building and civil construction, capital planning, and asset management. \nArchitecture Design Software.\n  Empowers creative professionals in architecture, design, construction, and related industries with capabilities like SketchUp for design & visualization, 3D modeling, construction and fabrication documentation, and architectural visualization.  It facilitates innovative and detailed design processes, enabling seamless collaboration among stakeholders.\nEngineering Software.\n \nTransforms workflows with precision by focusing on enhancing accuracy, productivity, and profitability.  It includes capabilities for the mechanical, electrical, and plumbing (“MEP”) trades for engineering and modeling, structural engineering and modeling, and civil design and engineering by delivering constructable solutions that drive project success.\nConstruction Software.\n \nDesigned to optimize connected workflows, this software supports comprehensive project management through enterprise resource planning (“ERP”) and operations solutions.  Its capabilities span preconstruction and estimating, prefabrication, project and operations management, finance and human capital management, and digital supply chain management.  Our construction portfolio also enables civil contractors to align operational efficiency from bidding to project execution through estimating, scheduling, field tracking, equipment maintenance, and reporting and analyses. \nOwner Software.\n \n \nAs architects, engineers, and contractors collaborate to deliver projects, our asset lifecycle management (“ALM”) portfolio centralizes data from capital planning, design, construction, and commissioning and unlocks its value into the operations and maintenance phases of the completed asset.  This owner-centric technology speeds decision-making, progress measurement, and payment for the AEC providers while improving the owner’s asset stewardship maintenance for years across the public and private sectors.  \n3\nTable of Contents\nWhen combining our AECO software capabilities with our Field Systems portfolio, we are uniquely able to bring comprehensive integrated workflows to the broad construction industry ecosystem.  At our core, we are able to bridge the gap between office and field by integrating detailed design models and project tracking capabilities with field hardware (GNSS receivers and laser scanners), and ERP solutions in real-time.  This drives tremendous efficiencies in seamless workflows, error reduction, and process automation for the spectrum of construction users. \nOur solutions enhance productivity and foster collaboration by improving data sharing across architects, designers, general contractors, subcontractors, and engineers.  The Trimble Connect collaboration platform streamlines and integrates workflows and ensures interoperability between Trimble’s solutions as well as software tools from the broader construction ecosystem and marketplaces.\nThrough automation and innovation, our solutions reduce costs, waste, and rework, enhance worker safety, expedite project timelines, improve decision-making, and enhance quality control.  These technologies contribute to sustainability by fostering resource efficiency and environmental responsibility across the building construction industry.\nIn 2024, Trimble advanced its Connect & Scale strategy with significant AECO software updates.  Highlights include (i) AppXchange for ERP; (ii) Tekla 2024; and (iii) enhanced visualization for Sketchup.  New AI-based capabilities were released in 2024, which included (i) LiveCount AI Takeoff; (ii) AI Driven 3D Model Search; (iii) Sketchup Diffusion and Assistant; and (iv) AI-driven project management workflows in ProjectSight.  Additionally, Trimble Unity launched, empowering public infrastructure owners with centralized data and connected digital workflows for ALM.\nWe sell and distribute our products across the AECO segment through a robust, integrated network of direct, indirect, and digital channels, tailored to optimize customer experiences across the geographic regions we serve.  We leverage our dedicated direct sales force to deliver software solutions to asset owners, clients, contractors, subcontractors, and consulting engineers, ensuring that the most appropriate channel is matched to each region for maximum market reach and customer satisfaction.  We develop and nurture a global network of independent distributors with deep expertise and strong customer relationships in their respective markets, including BuildingPoint dealers that specifically address the needs of the building construction industry.  Our digital channels complement this network by providing flexible, accessible, and scalable solutions that enhance customer engagement and streamline the purchasing process.\nCompetitors in this segment are typically companies that produce software specific to the construction process.  As we extend our software and services offerings to cover the full set of construction lifecycle management solutions used by construction owners, designers, and construction companies, we increasingly compete with large established companies that offer similar systems across all industries.  We compete principally on the basis of innovation, differentiated products, domain expertise, service, quality, and geographic reach.\nField Systems\nThe Field Systems segment provides products and services to private, commercial, and government customers.  The businesses within Field Systems service surveying and mapping professionals, civil construction, building construction field services, and positioning systems.  We sell and distribute our products in the Field Systems segment primarily through a global network of independent distribution partners.\nGeospatial\n.\n \n Through our surveying, mapping, and building construction product portfolio, professional surveyors and engineers provide services to the construction, engineering, mining, oil and gas, energy and utilities, government, and land management sectors.  Our solutions replace less productive conventional methods of surveying, mapping, 2D or 3D modeling, monitoring, measurement, reporting, and analysis.  Our suite of solutions includes field-based data collection systems and field software, real-time communications systems, and back-office software for data processing, modeling, monitoring, reporting, and analysis.  Our field-based technologies are used in handheld, land mobile, and airborne applications and incorporate technologies such as mobile application software, high precision GNSS, robotic measurement systems, inertial positioning, 3D laser scanning, digital imaging, and optical or laser measurement.  We maintain a joint venture with Nikon, which focuses on the design and manufacture in Japan of surveying instruments including mechanical total stations and related products.  Our office-based products include software for planning, data processing and editing, quality control, 3D modeling, intelligent data analysis and AI-based feature extraction, deformation monitoring, project reporting, and data export.  Our customers in this area benefit from using our products, including significantly improved productivity in both field and office activities, improved safety through non-contact measurement and detection of potentially dangerous ground or structure movement, and improved data flow that enables better decision-making.\nCivil Engineering Construction.\n \nOur civil engineering and construction portfolio spans the lifecycle of civil infrastructure assets from feasibility and capital budgeting, to planning and design, to construction, through long-term operation and maintenance.  Our solutions serve key industry stakeholders, including asset owners or clients, design engineers, consultants, contractors, subcontractors, and suppliers.  Our technological suite is employed across the entire project lifecycle to improve productivity, reduce waste and re-work, including reduced carbon emissions, and enable more informed decision-making \n4\nTable of Contents\nthrough enhanced situational awareness, data flow, data-driven insights and decision support, and project collaboration.  At the same time, our solutions can improve worker safety and reduce environmental impact.  Our suite of integrated solutions and technologies in this area includes field and office software for estimating and job cost management and optimized project design and visualization; software for 3D design and data sharing; systems to automatically guide and control construction equipment such as excavators, bulldozers, wheel loaders, motor graders, and paving equipment; systems to monitor, track, and manage assets, equipment, and workers; and software to facilitate the management of the construction process and for sharing and communication of data in real-time.  Together, these solutions are designed to transform how work is done within the civil construction industry.\nThe civil construction market portfolio integrates data and information across the entire construction process and across mixed fleets.  This includes data from site positioning and machine control systems, construction asset management equipment and services, and various software applications.  Utilizing wireless and internet-based site communications infrastructure, our solutions include the ability to track and control equipment, deploy a 3D model to machines, track the progress of work in real-time, and reduce re-work.  By leveraging our technology, contractors gain greater insight into their operations, helping them to lower costs and improve productivity, worker safety, and asset utilization.\nWe maintain a joint venture with Caterpillar, Caterpillar-Trimble Control Technologies, to develop the next generation of advanced electronic guidance and control products for earth-moving machines.  The joint venture develops machine control and guidance products that use site design information combined with accurate positioning technology to automatically control dozer blades and other machine tools.  We also maintain a joint venture with Hilti, which focuses on the joint development of measuring solutions for the building construction trades and integrating data for construction management.  \nPositioning Services.\n \nTrimble Positioning Services serves customers in a variety of end markets, including agriculture, construction, geospatial, automotive, and other markets.  This service improves positional accuracy and enables higher levels of precision and automation for work processes and systems, including autonomous solutions.  Trimble GNSS-based correction services are available in a variety of formats and accuracy levels, depending on the relevant application’s specific needs.  Subscription-based services offered by Trimble Positioning Services include VRSNow; CenterPoint RTX; FieldPoint RTX; Rangepoint RTX; ViewPoint RTX; Trimble xFill; and OmniSTAR (HP, XP, G2, and VBS) services.\nDuring 2024, we announced several new developments in Field Systems, including: (i) the Trimble R980 GNSS receiver, our new flagship model featuring industry-leading ProPoint and IonoGuard technology; (ii) the configurable Trimble X9 3D laser scanning system, available with perpetual and term-based licensing options; and (iii) Trimble Reality Capture platform service, an extension within Trimble Connect, unlocking the potential of scan data in the cloud.  We further expanded our reality capture portfolio with (i) the new Trimble MX90 and Trimble MX60 mobile mapping systems and (ii) an update to our Trimble SiteVision augmented reality software, which now also includes scanning capabilities.  Additionally, we delivered multiple feature releases in our powerful (i) Trimble Access field software; (ii) Trimble Business Center office software; (iii) Trimble 4D Control monitoring software; as well as (iv) TerraFlex and TerraOffice software.  Our software development continues to be focused on driving productivity through enhanced connectivity, supporting strategic industry workflows by delivering connected workflows and emphasizing interoperability.\nWe sell and distribute our products in the Field Systems segment primarily through global networks of independent distributors with expertise and customer relationships in the respective markets, including SITECH Technology dealers, which serve the civil construction industry, and BuildingPoint dealers, which serve the building construction industry.  We also sell many of our software solutions through our own direct sales force when bundled into Trimble’s Construction One  offering to contractors, sub-contractors, and consulting engineers.\nMajor competitors in this segment are typically survey instrument companies that provide software-driven 3D measurement and imaging solutions.  We compete principally based on innovation, differentiated products, integrated workflow solutions, domain expertise, service, quality, and geographic reach.\nTransportation and Logistics\nThe T&L segment provides a suite of solutions for shippers, carriers, and intermediaries globally.  Within this segment, our most substantial product portfolio addresses the truckload freight market.\nTransportation.\n \nOur transportation solutions provide capabilities for the long-haul trucking and freight shipper markets to create a connected supply chain and integrate all forms of transportation, drivers, back-office management, shippers, and freight.  We provide enterprise and mobility solutions focused on business intelligence and data analytics, safety and regulatory compliance, navigation and routing, freight brokerage, AI-powered transportation procurement, supply chain visibility and final mile, and transportation management and fleet maintenance.  \nIn the transportation market, we offer a suite of solutions that provides comprehensive fleet and transportation management systems, analytics, routing, mapping, reporting, and predictive modeling solutions to enable the transportation industry to achieve greater overall operational efficiency, fleet utilization, including greater fuel efficiency and reduced carbon emissions, \n5\nTable of Contents\nand profitability while ensuring regulatory compliance.  In addition to cloud-hosted solutions, we also integrate our applications and services directly into the customer’s IT infrastructure.\nThe transportation management system serves as a central hub from which the core operations of transportation organizations are managed, data is stored and analyzed, and mission-critical business processes are automated.  Our enterprise transportation management system automates business processes spanning the entire transportation lifecycle for shippers, carriers, and intermediaries, delivering visibility, control, and decision support for the intricate relationships and complex processes involved in the movement of freight.  Our products also provide truck routing, mileage, and mapping solutions, as well as a voice-guided turn-by-turn navigation solution.\nTransporeon.\n \n Our Transporeon solutions cover the transportation lifecycle from freight sourcing and procurement, through freight execution including dock and yard management all the way to freight auditing.  Our collective offerings position us uniquely to help customers tackle everyday challenges in the supply chain industry.  Our products aim to solve problems where they occur—in between companies—and hence are aimed for collaboration, interoperability, and data-driven decision making.  Each Transporeon product can be used standalone or in combination with each other.  With the amount of data we generate every day—up to approximately 200,000 transports and dock scheduling appointments get executed and booked on the Transporeon platform daily—we are able to provide data insights and market benchmarks, and enable our customers to use Generative AI enabled products, which base the decision making and learning on historical data as well as a constantly growing set of new information.\nDuring 2024, we had a number of developments in T&L.  In September 2024, Trimble and Platform Science announced a partnership to transform the transportation industry through a definitive agreement for Platform Science to acquire \nour Mobility business.  \nThe transaction closed on \nFebruary 8, 2025,\n and Trimble became a shareholder in Platform Science’s expanded business.  Additionally, (i) we integrated our real-time visibility solutions from Trimble and Transporeon for workflows to improve customer service and operational efficiency by giving customers the ability to notify their ecosystems of exceptions and delays with their shipments in real-time; and (ii) Transporeon offerings were standardized on Trimble Maps and PC*Miler routing offering customers the benefit of Trimble’s commercial routing solution globally.\nThe T&L segment generally sells directly to end users and OEMs.  Competitors in this segment are typically companies that provide transportation management software, and digital freight matching.  We compete principally on the basis of interoperability, domain expertise, customer support and service, price, innovative product offerings, quality, and the completeness of our solutions.  \nSeasonality of Business\nConstruction equipment revenue, within our Field Systems segment, historically has been higher in early spring.  However, overall, as a company, we are experiencing less seasonality as a result of the diversification of our businesses across segments and the increased impact of software and subscription revenue.  Changes in global macroeconomic conditions could also impact the level of seasonality we experience.\nManufacturing\nWe outsource the manufacturing of many of our hardware products to our key contract manufacturing partners that include Jabil and Benchmark Electronics Inc.  Our contract manufacturing partners are responsible for significant material procurement, assembly, and testing.  We continue to manage product design through pilot production for the subcontracted products, and we are directly involved in qualifying suppliers and key components used in all our products.  We also utilize original design manufacturers for some of our products.\nWe manufacture our optics-based products, as well as some of our GPS products, at our plants in Dayton, Ohio and Danderyd, Sweden\n.  \nSome of these products or portions of these products are also subcontracted to third parties for assembly.\nOur primary design, manufacturing, and distribution sites in Dayton, Ohio; Sunnyvale, California; Eindhoven, Netherlands; and Danderyd, Sweden \nare\n registered to ISO9001:2015 covering the design, production, distribution, and servicing of our products.\nResearch and Development and Intellectual Property\nWe believe that our competitive position is maintained through the development and introduction of new products, including software and services.  Trimble delivers digital technologies that enhance the physical world by integrating and connecting industry workflows, stakeholders, and data, while modernizing its interfaces and business models to make it easier for customers to do business.  Our platform investments allow us to extend our differentiation in positioning and sensing, modeling, and analytics into emerging industry solutions and to drive ecosystem collaboration across our target industries.  This improves our value over the customer lifecycle, while enhancing our leadership in software and services, which already accounts fo\nr over 70% of our R&D investment.  O\nur investments enable us to push the state-of-the-art in key technology areas and to connect other leading technologies to solve customer problems in new and unique ways.\n6\nTable of Contents\nAs part of our technology development practices, we actively establish and maintain our intellectual property rights through the use of patents, copyrights, trademarks, and trade secret laws.  We hold over \n1,000\n unique issued and enforceable patents covering key technology areas, including precision GNSS, optical and inertial positioning solutions, AI and machine learning, IoT, cloud computing, laser scanning, 3D modeling, point cloud processing, augmented reality, and many others.  \nOur patent portfolio is continuously updated with new patent grants that emerge from our investments in R&D.  \nWe actively manage the intellectual property used in the development, operations, and sales of our products and services.  We also own numerous trademarks and service marks that contribute to the identity and recognition of Trimble and that of its global products and services.  \nSustainability\nWe value sustainability, and we are taking action to harness our potential to address global challenges.  Inspired by our mission of “Transforming the Way the World Works,” and fueled by the dedication of our employees, we are working to build momentum and strive for continual improvement and measurable progress in shaping a sustainable future.\nSustainability is deeply integrated into our business strategy, threaded throughout our products and solutions and our people and culture.  It’s what guides our innovations and investments.  It’s what drives us to build resilience for our company and our customers, to foster our people and culture, and to lead with integrity in all that we do.\nBuilding Resilience\n•\nEnable customers to adapt, grow and thrive in the face of change\n•\nDriving decarbonization in our own operations and supply chain\nPeople and Culture\n•\nGuided by our values of Belong, Grow, and Innovate\n•\nActivated by our leadership capabilities of Inspire, Engage and Achieve\nLeading with Integrity\n•\nCorporate and Sustainability Governance\n•\nEthical Business Practices\n•\nPrivacy and Cybersecurity\nBuilding Resilience.\n  We build resilience for our customers, our company, and our supply chain.  Our technologies in positioning, modeling, and data analytics help our customers take meaningful, precise action, including for sustainability challenges.  By connecting the physical and digital worlds, our solutions provide the information to make the right decisions at the right time.  We are working throughout our value chain, with suppliers and customers, as well as within our own operations, toward a more sustainable future.\nOur core growth strategy for our customers includes: (i) our Connect & Scale strategy through industry cloud platforms to optimize customers’ work for maximum collaboration, effectiveness, and efficiencies; (ii) enabling our customers to make better decisions and work smarter; and (iii) investing in cutting-edge innovation through new ventures to accelerate digital transformation in the industries we serve.\nWe continue to apply our innovation and efficiency capabilities in line with our own climate action roadmap.  Guided by our Science-Based Targets initiative (SBTi), approved enterprise-level GHG emissions reduction targets, we continue to work towards (i) cutting our GHG footprint in half by 2030; (ii) source 100% renewable energy by 2025; and (iii) engage 70% of our suppliers to set their own science-based emission reduction targets by 2026\n.  \nThe SBTi covers our two absolute reduction targets: (i) Trimble commits to reduce absolute scope 1 and 2 GHG emissions 50% by 2030 from a 2019 base year; and (ii) Trimble commits to reduce absolute scope 3 GHG emissions from fuel and energy related activities, business travel, and upstream transportation and distribution 50% by 2030 from a 2019 base year.\nPeople and Culture.\n  Guided by our values of Belong, Grow, and Innovate, our community of talented and innovative employees creates opportunities for our customers and community members to thrive.  As further described in the below Human Capital section, our focus on our values enables our employees to do their best work and empowers them to better solve complex problems for our customers and the communities that we serve.\nLeading with Integrity.\n  We are dedicated to leadership principles that ensure excellence in all we do.  Through transparency, good governance, and a deep commitment to sustainability and ethics, we continue operating from a strong foundation of integrity now and in the future.\nSupported by the Audit Committee, People and Compensation Committee, and Nominating and Corporate Governance Committee, the Board of Directors reviews, monitors, and guides our sustainability strategy, commitments, and accountability for risk management.  Our executive management team further executes the strategies and steers operations.\nOur operations adhere to key guiding policies, such as our Environmental Policy and Human Rights and Labor Policy.  The Code of Business Conduct provides the tools and information necessary for our team and partners to maintain high ethical standards and business integrity. \n7\nTable of Contents\nHuman Capital\nOur culture reflects our guiding principles at work and is fundamental to sustaining our success.  That company culture is foundational to a thriving workplace; it is the behaviors and values of leaders and employees that are the foundation for who we are.  At Trimble, we value being yourself and thriving together; being intentional and humble; and being curious and solving problems.  Our leaders inspire purpose and vision, engage to draw out the best from each other, and strive to achieve meaningful results.  This mindset shapes how we treat one another and how we serve our customers, colleagues, and stockholders.  \nAt the end of 2024, we employed over 12,100 full-time and part-time employees, the overwhelming majority of which were full-time employees.  Approximately 42%, 34%, 19%, and 5% of employees reside in North America, Europe, Asia-Pacific, and the rest of the world.  Our employees work in over 40 countries.    \nPeople and Culture  \nWe are committed to providing every employee the opportunity to learn, grow, and excel in a collaborative environment where everyone feels they belong.  We believe that a variety of experiences and perspectives fuels innovation and drives our best thinking.  Our leaders activate their teams through our leadership capabilities of Inspire, Engage, and Achieve.  They inspire their teams by fostering a shared vision built on integrity and aspiration; they engage them through opportunities that cultivate humility, curiosity, and collaboration; and they strive to achieve exceptional results for our customers through relentless innovation.  Our leaders cultivate an environment of collaboration, innovation, and growth, helping ensure every employee is empowered to contribute their best.\nEngagement\nWe engage employees in a variety of ways that promote open, transparent communication.  Our global engagement surveys are designed to encourage employees to share meaningful feedback that allows us to celebrate our strengths and openly talk about areas that require improvement and continued focus.  Our performance management program focuses on aligning managers and employees on priorities that best contribute to our strategic objectives and also fosters coaching and feedback that reinforces our shared values.  \nTalent Development\nThrough our internal global talent platform, we empower employees to identify internal job opportunities, skill development resources, and projects to achieve their personal development goals and full potential.  We encourage employees to nurture a love of continuous learning and resilience that is essential for accomplishment. \nCompensation and Benefits \nWe believe people should be paid in accordance with the role they perform and for their skills and experience.  To deliver on that commitment, we benchmark, and set pay ranges based on market data and consider factors such as an employee’s role, their experience, their performance, and the cost of living in the region in which they live.  We also regularly review our compensation practices to help ensure our pay is fair and equitable.  In addition to base salaries, \ncertain roles are eligible to participate in short-term and long-term incentive plans\n.\nWe offer comprehensive, market-competitive benefit programs tailored to the needs of our global workforce (which vary by country and region).  Our benefits portfolio supports health, well-being, and financial security of our employees, encompassing health and wellness programs, life and disability insurance, flexible savings accounts, paid time off, parental and family leave, employee support resources, retirement plans, and an employee stock purchase plan.  We also provide benefits that reflect the evolving needs of our workforce, such as education programs, peer recognition, and on-site services that include health and fitness centers at select locations.  Additionally, our flexible work strategy is designed to meet the evolving needs of our workforce while maintaining high levels of productivity and innovation.\nBuilding Community Connections\nWe believe that building connections between our employees, their families, and our communities creates a more meaningful, fulfilling, and enjoyable workplace.  In our offices around the world, our employee-led committees select local organizations to support, often in the form of grants and employee fundraising.  \nOur \nTrimble Foundation Fund (the “Foundation”)\n aligns international philanthropic efforts by giving back to the communities where Trimble does business and helping those in need.  The Foundation focuses on three key areas within our communities: (i) \nbuilding community resilience thr\nough disaster responses as well as climate change adaptation and mitigation efforts; (ii) increasing access to quality education and pathways to fulfilling careers; and (iii) transforming industries through projects that scale sustainable industry practices. \n8\nTable of Contents\nHealth, Safety, and Wellness\nThe success of our business is fundamentally connected to the well-being of our people.  Accordingly, we are committed to the health, safety, and wellness of our employees.  We provide our employees and their families with access to a variety of innovative, flexible, and convenient health and wellness programs that offer choice where possible, so they can customize their benefits to meet their needs and the needs of their families. \nAvailable Information\nThis Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and all amendments to these reports are available free of charge on our website through \ninvestor.trimble.com\n, as soon as reasonably practicable after such material is electronically filed with or furnished to the Securities and Exchange Commission.  Financial news and reports and related information about our Company, GAAP to non-GAAP reconciliations, \nas well as our Sustainability report, a\nre also found on this website.  Information contained on our website is not part of this report.\nIn addition, you may request a copy of these filings (excluding exhibits) at no cost by writing or telephoning us at our principal executive offices at the following address or telephone number:\nTrimble Inc.\n10368 Westmoor Drive, Westminster, CO 80021\nAttention: Investor Relations \nTelephone: (303) 635-8551\nThe URLs in this report are intended to be inactive textual references only.  They are not intended to be active hyperlinks to websites.  The information on such websites, even if it might be accessible through a hyperlink resulting from the URLs or referenced herein, is not and shall not be deemed to be incorporated into this report.  No assurance or representation is given as to the suitability or reliability for any purpose whatsoever of any information on such websites.\nInformation about our Executive Officers\nThe names, ages, and positions of our executive officers as of April 25, 2025, are as follows:\nName\nAge\nPosition\nRobert G. Painter\n53\nPresident and Chief Executive Officer\nPhillip Sawarynski\n52\nChief Financial Officer\nJennifer Allison\n52\nVice President, General Counsel and Secretary\nRonald J. Bisio \n56\nSenior Vice President\nChris Keating\n54\nSenior Vice President\nPeter Large\n55\nSenior Vice President\nMark Schwartz\n50\nSenior Vice President\nJulie A. Shepard\n67\nChief Accounting Officer\nRobert G. Painter\n—Robert Painter has been Trimble’s president and chief executive officer since January 2020.  From 2016 through 2019, he served as the Company’s chief financial officer.  Prior to that, Mr. Painter held a variety of positions in the Company, including vice president of Trimble Buildings construction software, general manager of the Intelligent Construction Tools international joint venture, general manager of Construction Services, and leadership positions in corporate development and corporate strategy.  Mr. Painter holds a bachelor’s degree in finance from West Virginia University and an MBA from Harvard University.\nPhillip Sawarynski\n—Phillip Sawarynski became Trimble’s chief financial officer in August 2024, having previously served as Trimble’s treasurer since 2018, as well as managing director and co-head of Trimble Ventures since 2021, and vice president of corporate development since 2022.  From 2015 to 2018, he served as sector vice president of finance in Trimble’s mobility and intelligent transportation division, and from 2013 to 2015, as general manager of the Company’s imaging division.  Mr. Sawarynski joined Trimble in 2009 as a finance director, first in Trimble’s agriculture division from 2009 to 2011 and then in Trimble’s geospatial business segment from 2011 to 2013.  Prior to joining Trimble, Mr. Sawarynski served as CFO of Nexus Corporation and held a variety of finance and engineering positions at Ford Motor Company, The Dow Chemical Company, and International Paper Company.  He holds a Bachelor of Science degree in Chemical Engineering from the University of Michigan, and an MBA from Carnegie Mellon University.\nJennifer Allison\n—\nJennifer Allison became Trimble's general counsel and corporate secretary in April 2023, having served as general counsel for Trimble’s Construction Sector since July 2018, when Trimble acquired Viewpoint, where she had served as general counsel since 2016.  Previously, Ms. Allison was general counsel at Tripwire, and prior to that she was the assistant \n9\nTable of Contents\ngeneral counsel and director of human resources and corporate compliance for EthicsPoint (now NAVEX Global).  Prior to those roles, Ms. Allison clerked for the Oregon Supreme Court.  Ms. Allison received a bachelor’s degree in English Literature from Portland State University and her JD from Lewis & Clark Law School.\nRonald J. Bisio\n—\nRonald Bisio currently serves as senior vice president in charge of the Field Systems segment, responsible for advanced positioning, agriculture industry solutions, civil construction field systems, and geospatial business operations.  From July 2022 to November 2023, he served as senior vice president responsible for Trimble’s transportation businesses.  Prior to that, Mr. Bisio was responsible for Trimble’s surveying and geospatial businesses since April 2015, first as vice president and then as senior vice president as of February 2019.  From January 2011 until April 2015, he served as general manager for Trimble’s rail division.  He joined Trimble in 1996 and has also held several marketing, sales, and general management positions while at Trimble.  Mr. Bisio earned an MBA from the University of Denver, a Master of Regional Planning from the University of Massachusetts, and a Bachelor of Science in Cartography from Salem State University in Salem, Massachusetts.\nChris Keating\n—\nChris Keating currently serves as senior vice president of the T&L segment, responsible for Transporeon, enterprise, MAPS, and forestry.  Mr. Keating first joined Trimble in July 2012 via the acquisition of the SketchUp team from Google.  Until October 2023, he served in expanding leadership roles in Trimble’s AECO segment, including as general manager of the architecture & design division (SketchUp), vice president and general manager of the AECO design and engineering software group, and senior vice president of corporate strategy.  Mr. Keating holds a bachelor’s degree in Mechanical Engineering from Clarkson University and an MBA from Carnegie Mellon University.\nPeter Large\n—Peter Large currently serves as senior vice president in charge of strategy, corporate development, corporate partnerships and alliances, and Trimble’s Office of Technology Innovation.  From October 2022 to November 2023, he served as senior vice president responsible for Trimble's buildings and infrastructure segment, and from July 2021 to October 2022, as senior vice president responsible for our civil infrastructure solutions businesses, including Trimble’s joint ventures with Caterpillar and Hilti.  Prior to that, he was vice president responsible for Trimble’s construction field solutions businesses.  He was appointed to that position when he rejoined Trimble in December 2020, having earlier served with the Company between 1996 and 2014 in a number of leadership roles, including as vice president of channel development; as general manager for the mapping, GIS, and utilities business; and in a variety of product management, marketing, and sales management roles.  Prior to re-joining Trimble, he obtained a doctoral degree and then was a research solutions strategist with Boeing’s Digital Solutions and Analytics business from 2019 to 2020.  Dr. Large holds an Ed.D. from Oklahoma State University, a Master of Science in Management from the Stanford University Graduate School of Business, a Postgraduate Diploma in Strategy and Innovation from the University of Oxford, and a Bachelor of Science degree from the University of Newcastle Upon Tyne, U.K.\nMark Schwartz\n—\nMark Schwartz currently serves as senior vice president of the AECO segment, responsible for Trimble’s construction enterprise solutions, civil infrastructure design and engineering, and owner and public sector businesses.  Prior to that, Mr. Schwartz served as senior vice president responsible for construction enterprise solutions from October 2022 until November 2023, and as Trimble’s chief digital officer from September 2020 through October 2022, leading the transformation initiatives of Trimble's business systems, processes, and infrastructure to better serve the customer through the transition to “as‑a-service” business models.  Mr. Schwartz served as vice president and general manager of Trimble’s civil construction software business from January 2020 until September 2020 and as chief operating officer of virtual site solutions, a joint venture between Trimble and Caterpillar from April 2017 to January 2020.  Mr. Schwartz holds a Bachelor of Science from Bryant University in Smithfield, Rhode Island.\nJulie A. Shepard\n—Julie Shepard has been Trimble’s chief accounting officer since May 2007.  She joined Trimble in December 2006 as vice president of finance.  Prior to joining Trimble, she was vice president of finance and corporate controller at Quantum Corporation.  She brings with her over 30 years of experience in a broad range of finance roles, with diverse experience ranging from early-stage private equity backed technology companies to large multinational corporations.  She began her career at Price Waterhouse and is a Certified Public Accountant.  Ms. Shepard received a Bachelor of Science in Accounting from California State University.  She is a member of the AICPA, Financial Executives Institute, and the Institute of Management Accounting.\n10\nTable of Contents",
  "item7": "Item 7.  Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with the consolidated financial statements and the related notes.  The following discussion contains forward-looking statements that reflect our plans, estimates, and beliefs.  Our actual results could differ materially from those discussed in the forward-looking statements.  Factors that could cause or contribute to these differences include, but are not limited to, those discussed below and those listed under “Risk Factors.”  This section of this report generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023.  Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 that are not included in this report can be found in “Management's Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our Annual Report on Form 10-K, for the year ended December 29, 2023. \nEXECUTIVE LEVEL OVERVIEW\nWe are a leading provider of technology solutions that enable professionals and field mobile workers to improve or transform their work processes.  Our comprehensive work process solutions are used across a range of industries including architecture, building construction, civil engineering, geospatial, survey and mapping, natural resources, utilities, transportation, and government.  Our representative customers include construction owners, contractors, engineering and construction firms, surveying companies, energy and utility companies, trucking companies, and state, federal, and municipal governments.  Further information on our business is presented in Part I, \nItem 1\n,\n “Business”\n of this report.\nOur growth strategy is centered on multiple elements:\n•\nExecute on our Connect & Scale strategy; \n•\nDeliver customer outcomes that can enable productivity, quality, safety, transparency, and environmental sustainability; \n•\nFocus on software and services; \n•\nAddress attractive markets with significant growth and profitability potential;\n•\nCapitalize on domain knowledge and technological innovation that benefit a diverse customer base; \n•\nDrive geographic expansion with a localization strategy; \n•\nOptimize go-to-market strategies to best access our markets; and\n•\nPursue strategic and targeted acquisitions, divestitures, joint ventures, and investments. \nOur focus on these growth drivers has led over time to growth in revenue and profitability and an increasingly diversified business model.  We continue to experience a shift toward a more significant mix of recurring revenue as demonstrated by our success in driving annualized recurring revenue (“ARR”) of\n $2,257.8 million, which represents growth of 14% year-over-year \nat the end of \n2024\n.  Excluding the impact of foreign currency, acquisitions, and divestitures, organic ARR growth was \n14%\n.  This\n shift toward recurring revenue h\nas positively impacted our revenue mix, growth, and profitability over time and is leading to improved visibility in our businesses.\n  Our software, services, and recurring revenue represented 76% and 67% of total revenue for 2024 and 2023.  \nAdditionally, we continue to maintain focus on increasing our mix of recurring revenue, which is accelerated by the Transporeon \nacquisition that closed in the second quarter of 2023\n and \nthe Ag divestiture that closed in the second quarter of 2024\n.  \nAs our solutions have expanded, our go-to-market model has also evolved with a balanced mix between direct, distribution, and OEM customers as well as enterprise-level customer relationships.\nThroughout this “Management’s Discussion and Analysis of Financial Condition and Results of Operations” section, we refer to organic revenue growth, which is a non-GAAP measure.  For a full definition of ARR, organic ARR, and organic revenue growth as used in this discussion and analysis, refer to the \n“Supplemental Disclosure of Non-GAAP Financial Measures and Annualized Recurring Revenue”\n found later in this Item 7.\nImpact of Recent Events on Our Business\nAcquisitions and Divestitures\nWe acquire businesses that align with our long-term growth strategies including our strategic product roadmap and, conversely, we divest certain businesses that no longer fit those strategies.  This is demonstrated by the 12 acquisitions and 23 divestitures that we have completed since 2020, including the Transporeon acquisition, the Ag divestiture, and the Mobility divestiture. \nMobility Divestiture\nOn September 14, 2024, we entered into a definitive agreement with Platform Science to sell our Mobility business.  Subsequent to the end of the year 2024, the transaction closed on \nFebruary 8, 2025 resulting in our\n ownership\n, or rights to acquire ownership of \n32.5% of Platform Science’s expanded business with an approximate fair value of $248.7 million.  The approximate fair value was determined based on unobservable inputs, including discounted cash flow projections, market comparables, and an option pricing model.  We received (i) shares of preferred stock of Platform Science, with \n28\nTable of Contents\ncertain liquidation preferences, that represent 28.5% of Platform Science’s expanded business and (ii) warrants allowing us the rights to acquire 4% of Platform Science’s expanded business.  The combined businesses aim to enhance driver experience, fleet safety, efficiency, and compliance by combining two cutting-edge in-cab commercial vehicle ecosystems, which gives customers access to more applications and offerings. \nThe assets and liabilities of Mobility were classified as held for sale beginning in the third quarter of 2024.  A valuation allowance was established to reduce the carrying value of the disposal group assets to the approximate fair value of the consideration we would receive.  As a result, we recorded a pre-tax loss of approximately $32.9 million included within Divestitures gain, net in our Consolidated Statements of Income in 2024.  \nUpon the closing of the transaction in the first quarter of 2025, we derecognized the assets and liabilities that were transferred and recorded our equity investment at its cost.  Mobility was reported as a part of our T&L segment.  See \nNote \n4\n “Divestitures”\n in Item 8 of this report.  \nAg Divestiture\nOn September 28, 2023, we executed a Sale and Contribution Agreement with AGCO that provided for the formation of a joint venture, called PTx Trimble, that operates in the mixed fleet precision agriculture market.  The agreement was amended and restated on March 31, 2024, and the transaction closed on April 1, 2024.  Under the terms of the agreement, we contributed our Ag business, excluding certain GNSS and guidance technologies, in exchange for $1.9 billion in cash proceeds, subject to working capital adjustments.  Following the closing of this transaction, we own 15% and AGCO owns 85% of PTx Trimble.  In addition to forming PTx Trimble, the parties concurrently entered into agreements that include the following: (i) long-term supply agreement for key GNSS and guidance technologies, (ii) technology transfer and license agreement, (iii) trademark license agreement, (iv) master sale and distribution agreement for positioning services, and (v) transition services agreement.  Ag was reported as a part of our Field Systems segment. \nUpon closing of the transaction in the second quarter of 2024, we recognized a pre-tax gain of $1.7 billion.  The gain included $275.6 million for our retained 15% ownership interest in PTx Trimble, an LLC, which is reported as an equity method investment. \nThe formation of PTx Trimble is expected to better serve farmers with factory fit and aftermarket applications in the mixed fleet precision agriculture market to help farmers drive productivity, efficiency, and sustainability.  Additionally, the transaction is expected to (i) simplify our Connect & Scale strategy, (ii) reduce risk of channel transition in the agriculture market, and (iii) enhance our financial profile and flexibility with a resulting higher mix of software, services, and recurring revenue.\nWe repaid $1.0 billion of our variable-rate debt through use of the net proceeds and expect to use the majority of the remaining proceeds after tax to repurchase stock.\nMacroeconomic Conditions\nMacroeconomic conditions continue to present significant challenges globally, driven by geopolitical tensions, tariff and trade policies, exchange rate and interest rate volatility, and persistent inflationary pressures.  The heightened trade tensions and related imposition of tariffs between the United States and its trading partners, the extent and duration of these tariffs, and their impact on global economic conditions remain uncertain and depend on various factors, including international negotiations, policy responses, potential exemptions, and shifts in global supply and demand.  These evolving dynamics may have a negative impact on our business operations.  In response, we are closely monitoring global trade developments and considering ways to mitigate potential impacts on our business.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThe preparation of financial statements and related disclosures in conformity with U.S. GAAP requires us to make judgments, assumptions, and estimates that affect the reported amounts of assets, liabilities, revenue, costs of sales, operating expenses, and related disclosures.  We consider the accounting polices described below to be our critical accounting policies.  These critical accounting policies are impacted significantly by judgments, assumptions, and estimates used in the preparation of the consolidated financial statements, and actual results could differ materially from the amounts reported based on these policies.  Our accounting policies are more fully described in \nNote 1 “Description of Business and Accounting Policies”\n in Item 8 of this report. \nRevenue Recognition\nRevenue is recognized upon transfer of control of promised products or services to customers in an amount that reflects the consideration we expect to receive in exchange for those products or services.  Revenue is recognized net of allowance for returns and any taxes collected from customers.  We enter into contracts that may include various combinations of products and services, which are generally capable of being distinct and accounted for as separate performance obligations; however, \n29\nTable of Contents\ndetermining whether products or services are considered distinct performance obligations that should be accounted for separately versus together may sometimes require significant judgment.\nJudgment is required to determine stand-alone selling price (“SSP”) for each performance obligation.  We use a range of amounts to estimate SSP and determine whether there is a discount to be allocated based on the relative SSP of the various products and services.  We estimate SSP considering multiple factors including but not limited to, our internal cost, pricing practices, sales channel, competitive positioning, and overall market and business environments.  As our offerings and markets change, we may be required to reassess our estimated SSP and, as a result, the timing and classification of our revenue could be affected.\nIncome Taxes\nWe are a U.S. based multinational company operating in multiple U.S. and foreign jurisdictions.  Judgment is required in evaluating our uncertain tax positions and determining our provision for income taxes.  We consider many factors when evaluating and estimating our tax positions and tax benefits, which may require periodic adjustments and may not accurately forecast actual tax audit outcomes.  Determining whether an uncertain tax position is effectively settled requires judgment.  Changes in recognition or measurement of our uncertain tax positions would result in the recognition of a tax benefit or an additional charge to the tax provision.\nIncome taxes are accounted for under the liability method, whereby deferred tax assets or liability account balances are calculated at the balance sheet date using current tax laws and rates in effect for the year in which the differences are expected to affect taxable income.  A valuation allowance is recorded to reduce the carrying amounts of deferred tax assets if we believe it is more likely than not such assets will not be realized.\nWe are subject to the periodic examination of our domestic and foreign tax returns by the IRS, state, local, and foreign tax authorities who may challenge our tax positions.  We regularly assess the likelihood of adverse outcomes from these examinations in determining the adequacy of our provision for income taxes.\nBusiness Combinations, Divestitures, and Goodwill and Purchased Intangible Assets \nFor business combinations, we allocate the purchase consideration to the assets acquired and liabilities assumed based on their fair values at the acquisition date.  When determining the fair values, we make significant estimates and assumptions, especially concerning intangible assets.  Critical estimates when valuing intangible assets include expected future cash flows based on consideration of revenue and revenue growth rates and margins, customer attrition rates, future changes in technology and brand awareness, loyalty and position, and discount rates.  Any purchase consideration in excess of the fair values of the net assets acquired is recorded as goodwill.  \nWhen divesting a business, a significant portion of the gain or loss may be impacted by the goodwill allocated to the divested business and the fair value of any equity interests acquired in exchange for the disposal group.  We allocate a portion of the applicable reporting unit’s goodwill to the divested business using the ratio of the fair value of the divested business compared to the fair value of the reporting unit.  The fair value of the reporting units, divested businesses, and acquired equity interests is generally determined using a combination of the discounted cash flow method and the guideline company method.  \nThe significant assumptions used in the discounted cash flow model to estimate the fair values include certain assumptions that form the basis of the forecasted results, specifically, revenue, revenue growth rates, and discount rates.  These significant assumptions are forward looking and could be affected by future economic and market conditions.\nWe evaluate goodwill on an annual basis in our fourth quarter or more frequently if indicators of potential impairment exist.  To determine whether goodwill is impaired, we first assess qualitative factors.  Qualitative factors include but are not limited to macroeconomic conditions, industry and market considerations, cost factors, overall financial performance, or other relevant company-specific events.  If it is determined more likely than not that the fair value of a goodwill reporting unit is less than its carrying amount, we perform a quantitative analysis.  Alternatively, we may bypass the qualitative assessment and perform a quantitative impairment test.\nWhen performing a quantitative approach, we compare the reporting unit’s carrying amount, including goodwill, to the reporting unit's fair value.  The estimation of a reporting unit's fair value involves using estimates and assumptions, including expected future operating performance using risk-adjusted discount rates.  If the reporting unit's carrying amount exceeds its fair value, an impairment loss is recognized.  \nWe review intangible assets for impairment whenever events or changes in circumstances indicate that the carrying amount of those assets may not be recoverable based on their future cash flows.  The estimated future cash flows are primarily based on assumptions about expected future operating performance. \n30\nTable of Contents\nRESULTS OF OPERATIONS \nOverview\nThe following table shows revenue by category, gross margin and gross margin as a percentage of revenue, operating income and operating income as a percentage of revenue, diluted earnings per share, and annualized recurring revenue compared for the periods indicated:\n \n2024\n2023\nDollar Change\n% Change\n(In millions, except per share amounts) \n \n \nRevenue:\nProduct\n$\n1,284.0 \n$\n1,771.7 \n$\n(487.7)\n(28)%\nSubscription and services\n2,399.3 \n2,027.0 \n372.3 \n18%\nTotal revenue\n$\n3,683.3 \n$\n3,798.7 \n$\n(115.4)\n(3)%\nGross margin\n$\n2,396.3 \n$\n2,332.8 \n$\n63.5 \n3%\nGross margin as a % of revenue\n65.1 \n%\n61.4 \n%\nOperating income\n$\n460.7 \n$\n448.8 \n$\n11.9 \n3%\nOperating income as a % of revenue\n12.5 \n%\n11.8 \n%\nDiluted earnings per share\n$\n6.09 \n$\n1.25 \n$\n4.84 \n387%\nNon-GAAP operating income \n(1)\n$\n937.2 \n$\n934.7 \n$\n2.5 \n—%\nNon-GAAP operating income as a % of revenue \n(1)\n25.4 \n%\n24.6 \n%\nNon-GAAP diluted earnings per share \n(1)\n$\n2.85 \n$\n2.66 \n$\n0.19 \n7%\nAnnualized Recurring Revenue (“ARR”)\n (1)\n$\n2,257.8 \n$\n1,982.3 \n$\n275.5 \n14%\n(1)    \nRefer to\n \n“Supplemental Disclosure of Non-GAAP Financial Measures and Annualized Recurring Revenue”\n of this report for definitions.\nBasis of Presentation\nWe use a 52–53 week fiscal year ending on the Friday nearest to December 31, which for 2024 was January 3, 2025.  2024\n was a \n53\n-week year and \n2023 \nwas a \n52\n-week year\n.  2025 will be a 52-week year.\nYear 2024 Compared with Year 2023\nRevenue\n2024\nChange versus 2023\n% Change\nProduct\nSubscription and Services\nTotal Revenue\nChange in Revenue\n(28)\n%\n18 \n%\n(3)\n%\nAcquisitions\n2 \n%\n2 \n%\n2 \n%\nDivestitures\n(21)\n%\n(1)\n%\n(10)\n%\nOrganic growth\n(9)\n%\n17 \n%\n5 \n%\nOrganic total revenue increased due to the increased mix of subscription and services revenue and the impact of the additional week in fiscal 2024.  \nOrganic product revenue decreased due to lower Ag demand in the first quarter and higher U.S. federal government sales of Surveying hardware in the prior year. \nOrganic subscription and services revenue increased primarily due to strong growth in subscription and software term licenses in all segments, primarily AECO, and to a lesser extent, the impact of the additional week.  \nGross Margin\nGross margin increased due to the organic growth of higher margin software and subscription sales, including the impact of the additional week, partially offset by the divestiture of Ag margin hardware sales.\nGross margin as a percentage of revenue increased due to the organic growth of higher margin software and subscription sales and the divestiture of Ag’s lower margin hardware sales.\n31\nTable of Contents\nOperating Income\nOperating income and operating income as a percentage of revenue increased primarily due to organic growth and associated gross margin expansion and to a lesser extent, the impact of the additional week.  The increase was partially offset by the Ag divestiture and higher acquisition and divestiture transaction costs.\nResearch and Development, Sales and Marketing, and General and Administrative Expense\nThe following table shows research and development (“R&D”), sales and marketing (“S&M”), and general and administrative (“G&A”) expense along with these expenses as a percentage of revenue for the periods indicated:\n \n2024\n2023\nDollar Change\n% Change\n(In millions)\n \n \nResearch and development\n$\n662.3 \n$\n664.3 \n$\n(2.0)\n—%\nPercentage of revenue\n18.0 \n%\n17.5 \n%\nSales and marketing\n$\n603.8 \n$\n583.0 \n$\n20.8 \n4%\nPercentage of revenue\n16.4 \n%\n15.3 \n%\nGeneral and administrative\n$\n547.9 \n$\n487.5 \n$\n60.4 \n12%\nPercentage of revenue\n14.9 \n%\n12.8 \n%\nTotal\n$\n1,814.0 \n$\n1,734.8 \n$\n79.2 \n5%\nR&D expense decreased primarily due to the impact of the divestiture, partially offset by expense related to Transporeon, and to a lesser extent, the impact of the additional week.  We believe that the development and introduction of new solutions are critical to our future success, and we expect to continue the active development of new products.\nS&M expense increased slightly primarily due to higher compensation expense, including commissions, and the impact of the additional week, partially offset by the impact of the Ag divestiture. \nG&A expense increased primarily due to divestiture transaction costs, and to a lesser extent, investments related to our Connect & Scale strategy and the impact of the additional week.  The increase was partially offset by the impact of the Ag divestiture.\nAmortization of Purchased Intangible Assets\nThe following table shows amortization of purchased intangible assets for the periods indicated:\n \n2024\n2023\nDollar Change\n% Change\n(In millions)\n \n \nCost of sales\n$\n93.3 \n$\n108.7 \n$\n(15.4)\n(14)%\nOperating expenses\n105.7 \n103.6 \n2.1 \n2%\nTotal amortization expense of purchased intangibles \n$\n199.0 \n$\n212.3 \n$\n(13.3)\n(6)%\nTotal amortization expense of purchased intangibles as a percentage of revenue\n5 \n%\n6 \n%\nIn 2024, total amortization expense of purchased intangibles decreased primarily due to the expiration of prior years’ acquisition amortization, partially offset by the amortization of intangibles acquired from the Transporeon acquisition, which was not applicable in the first quarter of 2023.\nNon-Operating Income (Expense), Net\nThe following table shows non-operating income (expense), net for the periods indicated:\n \n2024\n2023\nDollar Change\n% Change\n(In millions)\n \n \nDivestitures gain, net\n$\n1,687.9 \n$\n9.2 \n$\n1,678.7 \n18247%\nInterest expense, net\n(90.7)\n(161.0)\n70.3 \n(44)%\n(Loss) income from equity method investments, net\n(48.1)\n28.1 \n(76.2)\n(271)%\nOther (loss) income, net\n(3.9)\n31.9 \n(35.8)\n(112)%\nTotal non-operating income (expense), net\n$\n1,545.2 \n$\n(91.8)\n$\n1,637.0 \n(1783)%\nNon-operating income, net increased primarily due to the Ag divestiture gain and lower interest expense.  These increases were partially offset by lower joint-venture profitability, including $52.7 million of our proportionate share of PTx Trimble’s goodwill impairment and a prior year foreign currency hedging gain associated with the acquisition of Transporeon that was included in Other (loss) income, net.\n32\nTable of Contents\nIncome Tax Provision \nOur provision for income taxes in 2024 increased by $455.8 million compared to 2023, primarily due to the gain from the Ag divestiture.  Our effective income tax rate for 2024 and 2023 were 25.0% and 12.8%.  The increase in the tax rate was primarily due to gains from the Ag divestiture.\nResults by Segment\nWe report our financial performance, including revenue and operating income, based on three reportable segments: AECO, Field Systems, and T&L.\nOur Chief Executive Officer, who is our Chief Operating Decision Maker (“CODM”) views and evaluates operations based on the results of our reportable operating segments under our management reporting system.  These results are not necessarily in conformance with U.S. GAAP.  For additional discussion of our segments, refer to \nNote 7 “\nReporting \nSegment\n \nand Geographic \nInformation”\n in Item 8 of this report.\nThe following table is a summary of revenue and operating income by segment compared for the periods indicated:\n \n2024\n2023\nDollar Change\n% Change\n(In millions)\n \nAECO\nSegment revenue\n$\n1,358.6 \n$\n1,110.5 \n$\n248.1 \n22%\nSegment revenue as a % of total revenue\n37 \n%\n29 \n%\nSegment operating income \n$\n463.6 \n$\n329.0 \n$\n134.6 \n41%\nSegment operating income as a % of segment revenue\n34.1 \n%\n29.6 \n%\nField Systems\nSegment revenue\n$\n1,535.9 \n$\n1,967.9 \n$\n(432.0)\n(22)%\nSegment revenue as a % of total revenue\n42 \n%\n52 \n%\nSegment operating income \n$\n442.0 \n$\n603.5 \n$\n(161.5)\n(27)%\nSegment operating income as a % of segment revenue\n28.8 \n%\n30.7 \n%\nT&L\nSegment revenue\n$\n788.8 \n$\n720.3 \n$\n68.5 \n10%\nSegment revenue as a % of total revenue\n21 \n%\n19 \n%\nSegment operating income \n$\n155.1 \n$\n118.2 \n$\n36.9 \n31%\nSegment operating income as a % of segment revenue\n19.7 \n%\n16.4 \n%\nThe following table is a reconciliation of our consolidated segment operating income to consolidated income before taxes:\n \n2024\n2023\n(In millions)\n \n \nTotal segment operating income\n$\n1,060.7 \n$\n1,050.7 \nUnallocated general corporate expenses\n(123.5)\n(116.0)\nAmortization of purchased intangible assets\n(199.0)\n(212.3)\nAcquisition / divestiture items\n(81.6)\n(72.4)\nStock-based compensation / deferred compensation\n(163.5)\n(151.1)\nRestructuring and other costs\n(32.4)\n(50.1)\nConsolidated operating income\n460.7 \n448.8 \nTotal non-operating income (expense), net\n1,545.2 \n(91.8)\nConsolidated income before taxes\n$\n2,005.9 \n$\n357.0 \nAECO\nChange versus 2023\n2024\n \n% Change\nChange in Revenue - AECO\n22 \n%\nDivestitures\n(1)\n%\nForeign currency exchange\n1 \n%\nOrganic growth\n22 \n%\nOrganic revenue increased due to strong demand for subscription offerings, particularly for Viewpoint, Architecture and Design, and to a lesser extent, MEP and Structures offerings.  Additionally, the increase was driven by the impact of the \n33\nTable of Contents\nadditional week of subscription and term license revenue in the fourth quarter, including Structures annual term license renewals on January 1, 2025.\nOperating income and operating income as a percentage of revenue increased primarily due to strong organic revenue growth and gross margin expansion, partially offset by increased operating expense associated with double digit revenue growth.\nField Systems\nChange versus 2023\n2024\n \n% Change\nChange in Revenue - Field Systems\n(22)\n%\nAcquisitions\n1 \n%\nDivestitures\n(19)\n%\nOrganic growth\n(4)\n%\nOrganic revenue decreased primarily due to higher U.S. federal government sales of Surveying products in the prior year, partially offset by Civil Construction and Advanced Positioning sales growth in the current year.  Additionally, the decrease was due to slower Ag demand in the first quarter of 2024, before the business was divested in the second quarter of 2024.  \nOperating income and operating income as a percentage of revenue decreased primarily due to the impact of the Ag divestiture.\nT&L\nChange versus 2023\n2024\n \n% Change\nChange in Revenue - T&L\n10 \n%\nAcquisitions\n6 \n%\nDivestitures\n(1)\n%\nOrganic growth\n5 \n%\nOrganic revenue increased primarily driven by Transporeon, MAPS, and Enterprise subscription revenue growth, partially offset by lower Mobility sales.\nOperating income and operating income as a percentage of revenue increased primarily due to organic revenue growth and gross margin expansion.  The increase was also driven by the impact of the Transporeon acquisition, which closed in the second quarter of 2023.\n34\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nAt the End of Year\n2024\n2023\nDollar Change\n% Change\n(In millions, except percentages)\n \n \nCash and cash equivalents\n (1)\n$\n747.8 \n$\n238.9 \n$\n508.9 \n213 \n%\nAs a percentage of total assets\n7.9 \n%\n2.5 \n%\nPrincipal balance of outstanding debt\n$\n1,400.0 \n$\n3,080.4 \n$\n(1,680.4)\n(55)\n%\nYears\n2024\n2023\nDollar Change\n% Change\n(In millions)\n \n \nNet cash provided by operating activities\n$\n531.4 \n$\n597.1 \n$\n(65.7)\n(11)\n%\nNet cash provided by (used in) investing activities\n1,861.1 \n(2,068.1)\n3,929.2 \n(190)\n%\nNet cash (used in) provided by financing activities\n(1,864.2)\n1,431.5 \n(3,295.7)\n(230)\n%\nEffect of exchange rate changes on cash and cash equivalents\n(19.4)\n7.4 \n(26.8)\n(362)\n%\nNet increase (decrease) in cash and cash equivalents\n$\n508.9 \n$\n(32.1)\n(1) Includes $9.0 million and $9.1 million of cash and cash equivalents classified as held for sale as of January 3, 2025 and December 29, 2023.\nOperating Activities\nThe decrease in cash provided by operating activities was primarily driven by higher tax payments associated with the Ag divestiture gain, and higher accounts receivable due to the impact of the additional week in the fourth quarter of 2024.  The decrease was partially offset by lower net working capital requirements associated with a greater mix of subscription and services revenue and higher deferred revenue due to the impact of the additional week.\nInvesting Activities\nThe increase in cash provided by investing activities was primarily due to the $1.9 billion of proceeds received from the Ag divestiture in the current year, as compared to the $2.0 billion payment in the prior year for the acquisition of Transporeon. \nFinancing Activities\nThe increase in cash used in financing activities was primarily driven by the $1.7 billion repayment of debt in the current year, as compared to the prior year’s $2.0 billion of proceeds from the issuance of debt for the acquisition of Transporeon, partially offset by the $500.0 million repayment of debt.\nCash and Cash Equivalents\nWe believe that our cash and cash equivalents and available borrowing capacity under our existing lines of credit, along with cash provided by operations, will be sufficient in the foreseeable future to meet our anticipated operating cash needs, including expenditures related to our Connect & Scale strategy, debt service, acquisitions, and any stock repurchases under the stock repurchase program. \nOur 2022 credit facility allows us to borrow up to $1.25 billion, with an option to increase the borrowings up to $1.75 billion with lender approval.  As of January 3, 2025, there was no outstanding debt under the 2022 credit facility.  \nOur 2024 senior notes totaling $400.0 million matured and were paid in December 2024.\nIn the second quarter of 2024, \nwe completed the Ag divestiture and received $1.9 billion of cash proceeds, subject to working capital adjustments.  The total tax payment for the transaction is $367.8 million, of which $122.0 million was paid in 2024, with the remaining amount to be paid in 2025.\n \n We used a portion of the proceeds to repay $1.0 billion of term loans and expect to use the majority of the remaining proceeds after tax to repurchase stock. \nOur material cash requirements include the following contractual and other obligations and cash needs:\nLeases\nWe have operating leases primarily for certain of our major facilities including corporate offices, research and development facilities, and manufacturing facilities.  Operating leases represent undiscounted lease payments and include short-term leases.  At the end of 2024, we had fixed lease payment obligations of $182.1 million, with $39.4 million payable within the next 12 months.  Refer to \nNote 9 “Leases”\n in Item 8 of this report for additional information regarding our leases.\nTax Payable\nAt the end of 2024, we had income taxes payable of $325.0 million, which are payable within the next 12 months.   \n35\nTable of Contents\nIn addition, we have unrecognized tax benefits of $78.2 million included in Other non-current liabilities, including interest and penalties.  At this time, we cannot make a reasonably reliable estimate of the period of cash settlement with tax authorities regarding this liability.  Refer to \nNote 13 “Income Taxes”\n in Item 8 of this report for additional information regarding our taxes.\nOther Purchase Obligations and Commitments\nPurchase obligations and commitments primarily relate to investments in our platform associated with our Connect & Scale strategy and non-cancellable inventory commitments.  At the end of 2024, we had operating purchase obligations and commitments of $470.7 million, with $235.4 million payable within the next 12 months.  Other than the items discussed above, we do not have any off-balance sheet financing arrangements or liabilities.\nDebt\nAt the end of 2024, we had outstanding fixed-rate senior notes with varying maturities for an aggregate principal amount of $1.4 billion.  Future interest payments total $517.7 million, with $78.2 million payable within the next 12 months.  During 2024, we made $1.7 billion in debt payments through the use of the net proceeds from the Ag divestiture and cash on hand.  Refer to \nNote 8 “Debt”\n in Item 8 of this report for additional information regarding our debt.\nStock Repurchase Program\nSubsequent to the end of the year 2024, the Board of Directors authorized a common stock repurchase authorization of up to $1.0 billion, which replaces the existing 2024 Stock Repurchase Program in the first quarter of 2025.  We may repurchase stock from time to time through accelerated stock repurchase programs, open market transactions, privately negotiated transactions, block purchases, tender offers, or other means.  The stock repurchase program does not obligate us to acquire any specific number of shares.  Refer to \nNote 15 “Common Stock Repurchase”\n in Item 8 of this report for additional information regarding our stock repurchase program.\nEFFECT OF NEW ACCOUNTING PRONOUNCEMENTS\nThe impact of recent accounting pronouncements is disclosed in \nNote 1 “Description of Business and Accounting Policies”\n in Item 8 of this report.\nSUPPLEMENTAL DISCLOSURE OF NON-GAAP FINANCIAL MEASURES AND ANNUALIZED RECURRING REVENUE\nTo supplement our consolidated financial information, we included non-GAAP financial measures, which are not meant to be considered in isolation or as a substitute for comparable GAAP.  We believe non-GAAP financial measures provide useful information to investors and others in understanding our “core operating performance”, which excludes (i) the effect of non-cash items and certain variable charges not expected to recur; and (ii) transactions that are not meaningful in comparison to our past operating performance or not reflective of ongoing financial results.  Lastly, we believe that our core operating performance offers a supplemental measure for period-to-period comparisons and can be used to evaluate our historical and prospective financial performance, as well as our performance relative to competitors.\nOrganic revenue growth is a non-GAAP measure that refers to revenue excluding the impacts of (i) foreign currency translation, and (ii) acquisitions and divestitures that closed in the prior 12 months.  We believe organic revenue growth provides useful information in evaluating the results of our business because it excludes items that are not indicative of ongoing performance or impact comparability with the prior year.  We provide reconciliation tables showing the change in revenue growth to organic revenue growth in the “\nResults of Operations\n” section found earlier in this Item 7.\nIn addition to providing non-GAAP financial measures, we disclose ARR to give the investors supplementary indicators of the value of our current recurring revenue contracts.  \nARR represents the estimated annualized value of recurring revenue.  ARR is calculated by taking our subscription and maintenance and support for the current quarter and adding the portion of the contract value of all our term licenses attributable to the current quarter, then dividing that sum by the number of days in the quarter and then multiplying that quotient by 365.  Organic ARR refers to annualized recurring revenue excluding the impacts of (i) foreign currency translation, and (ii) acquisitions and divestitures that closed in the prior 12 months.  ARR and organic ARR should be viewed independently of revenue and deferred revenue as they are performance measures and are not intended to be combined with or to replace either of those items.\n36\nTable of Contents\nThe non-GAAP financial measures, definitions, and explanations to the adjustments to comparable GAAP measures are included below:\nYears\n \n \n2024\n2023\n \n \nDollar\n% of\nDollar\n% of\n(In millions, except per share amounts) \n \nAmount\nRevenue\nAmount\nRevenue\nREVENUE:\nGAAP revenue:\n$\n3,683.3 \n$\n3,798.7 \nGROSS MARGIN:\nGAAP gross margin:\n$\n2,396.3 \n65.1 \n%\n$\n2,332.8 \n61.4 \n%\nAmortization of purchased intangible assets\n(A)\n93.3 \n108.7 \nAcquisition / divestiture items\n(B)\n— \n0.5 \nStock-based compensation / deferred compensation\n(C)\n17.4 \n15.0 \nRestructuring and other costs\n(D)\n3.6 \n(0.1)\nNon-GAAP gross margin:\n$\n2,510.6 \n68.2 \n%\n$\n2,456.9 \n64.7 \n%\nOPERATING EXPENSES:\nGAAP operating expenses:\n$\n1,935.6 \n52.6 \n%\n$\n1,884.0 \n49.6 \n%\nAmortization of purchased intangible assets\n(A)\n(105.7)\n(103.6)\nAcquisition / divestiture items\n(B)\n(81.6)\n(71.9)\nStock-based compensation / deferred compensation\n(C)\n(146.1)\n(136.1)\nRestructuring and other costs\n(D)\n(28.8)\n(50.2)\nNon-GAAP operating expenses:\n$\n1,573.4 \n42.7 \n%\n$\n1,522.2 \n40.1 \n%\nOPERATING INCOME:\nGAAP operating income:\n$\n460.7 \n12.5 \n%\n$\n448.8 \n11.8 \n%\nAmortization of purchased intangible assets\n(A)\n199.0 \n212.3 \nAcquisition / divestiture items\n(B)\n81.6 \n72.4 \nStock-based compensation / deferred compensation\n(C)\n163.5 \n151.1 \nRestructuring and other costs\n(D)\n32.4 \n50.1 \nNon-GAAP operating income:\n$\n937.2 \n25.4 \n%\n$\n934.7 \n24.6 \n%\nNON-OPERATING (EXPENSE) INCOME, NET:\nGAAP non-operating (expense) income, net:\n$\n1,545.2 \n$\n(91.8)\nAcquisition / divestiture items\n(B)\n(1,688.5)\n(36.5)\nDeferred compensation\n(C)\n(4.9)\n(5.8)\nRestructuring and other costs\n(D)\n64.1 \n1.3 \nNon-GAAP non-operating expense, net:\n$\n(84.1)\n$\n(132.8)\n \n \nGAAP and Non-GAAP Tax Rate %\nGAAP and Non-GAAP Tax Rate %\n(G)\n(G)\nINCOME TAX PROVISION:\nGAAP income tax provision:\n$\n501.5 \n25.0 \n%\n$\n45.7 \n12.8 \n%\nNon-GAAP items tax effected\n(E)\n(288.1)\n56.9 \nDifference in GAAP and Non-GAAP tax rate\n(F)\n(64.7)\n35.6 \nNon-GAAP income tax provision:\n$\n148.7 \n17.4 \n%\n$\n138.2 \n17.2 \n%\nNET INCOME:\nGAAP net income:\n$\n1,504.4 \n$\n311.3 \nAmortization of purchased intangible assets\n(A)\n199.0 \n212.3 \nAcquisition / divestiture items\n(B)\n(1,606.9)\n35.9 \nStock-based compensation\n(C)\n158.6 \n145.3 \nRestructuring and other costs\n(D)\n96.5 \n51.4 \nNon-GAAP tax adjustments\n(E) - (F)\n352.8 \n(92.5)\nNon-GAAP net income:\n$\n704.4 \n$\n663.7 \nDILUTED NET INCOME PER SHARE:\nGAAP diluted net income per share:\n$\n6.09 \n$\n1.25 \nAmortization of purchased intangible assets\n(A)\n0.80 \n0.85 \nAcquisition / divestiture items\n(B)\n(6.50)\n0.14 \n37\nTable of Contents\nYears\n \n \n2024\n2023\n \n \nDollar\n% of\nDollar\n% of\n(In millions, except per share amounts) \n \nAmount\nRevenue\nAmount\nRevenue\nStock-based compensation\n(C)\n0.64 \n0.58 \nRestructuring and other costs\n(D)\n0.39 \n0.21 \nNon-GAAP tax adjustments\n(E) - (F)\n1.43 \n(0.37)\nNon-GAAP diluted net income per share:\n$\n2.85 \n$\n2.66 \nADJUSTED EBITDA:\nGAAP operating income:\n$\n460.7 \n12.5 \n%\n$\n448.8 \n11.8 \n%\nAmortization of purchased intangible assets\n(A)\n199.0 \n212.3 \nAcquisition / divestiture items\n(B)\n81.6 \n72.4 \nStock-based compensation\n(C)\n163.5 \n151.1 \nRestructuring and other costs\n(D)\n32.4 \n50.1 \nNon-GAAP operating income:\n937.2 \n25.4 \n%\n934.7 \n24.6 \n%\nDepreciation expense and cloud computing amortization\n49.3 \n46.9 \nIncome from equity method investments, net\n13.9 \n28.1 \nAdjusted EBITDA\n$\n1,000.4 \n27.2 \n%\n$\n1,009.7 \n26.6 \n%\nNon-GAAP Definitions\nNon-GAAP gross margin \nWe define Non-GAAP gross margin as GAAP gross margin, excluding the effects of amortization of purchased intangible assets, acquisition/divestiture items, stock-based compensation, deferred compensation, and restructuring and other costs.\n \nWe believe our investors benefit by understanding our non-GAAP gross margin as a way of understanding how product mix, pricing decisions, and manufacturing costs influence our business. \nNon-GAAP operating expenses\n \nWe define Non-GAAP operating expenses as GAAP operating expenses, excluding the effects of amortization of purchased intangible assets, acquisition/divestiture items, stock-based compensation, deferred compensation, and restructuring and other costs.  We believe this measure is important to investors evaluating our non-GAAP spending in relation to revenue. \nNon-GAAP operating income\nWe define Non-GAAP operating income as GAAP operating income, excluding the effects of amortization of purchased intangible assets, acquisition/divestiture items, stock-based compensation, deferred compensation, and restructuring and other costs.\n \nWe believe our investors benefit by understanding our non-GAAP operating income trends, which are driven by revenue, gross margin, and spending. \nNon-GAAP non-operating expense, net\nWe define Non-GAAP non-operating expense, net as GAAP non-operating income (expense), net, excluding acquisition/divestiture items, deferred compensation, and restructuring and other costs.\n \nWe believe this measure helps investors evaluate our non-operating expense trends. \nNon-GAAP income tax provision\nWe define Non-GAAP income tax provision as GAAP income tax provision, excluding charges and benefits such as net deferred tax impacts resulting from the non-U.S. intercompany transfer of intellectual property, deferred tax impacts from global intangible low-taxed income, and significant reserve releases upon the statute of limitations expirations.  We believe this measure helps investors because it provides for consistent treatment of excluded items in our non-GAAP presentation and a difference in the GAAP and non-GAAP tax rates. \nNon-GAAP net income\nWe define Non-GAAP net income as GAAP net income, excluding the effects of amortization of purchased intangible assets, acquisition/divestiture items, stock-based compensation, restructuring and other costs, and non-GAAP tax adjustments.\n \nThis measure provides a supplemental view of net income trends, which are driven by non-GAAP income before taxes and our non-GAAP tax rate. \n38\nTable of Contents\nNon-GAAP diluted net income per share\nWe define Non-GAAP diluted net income per share as GAAP diluted net income per share, excluding the effects of amortization of purchased intangible assets, acquisition/divestiture items, stock-based compensation, restructuring and other costs, and non-GAAP tax adjustments.\n \nWe believe our investors benefit by understanding our non-GAAP operating performance as reflected in a per share calculation as a way of measuring non-GAAP operating performance by ownership in the Company. \nAdjusted EBITDA\nWe define Adjusted EBITDA as non-GAAP operating income plus depreciation expense, cloud computing amortization, and income from equity method investments, net, excluding our proportionate share of items such as goodwill impairment, amortization of purchased intangibles, stock-based compensation, and restructuring costs.  Other companies may define Adjusted EBITDA differently.  Adjusted EBITDA is a performance measure that we believe offers a useful view of the overall operations of our business because it facilitates operating performance comparisons by removing potential differences caused by variations unrelated to operating performance, such as capital structures (interest expense, net), income taxes, depreciation, amortization of purchased intangibles and cloud computing costs, and income from equity method investments, net.  \nExplanations of Non-GAAP adjustments\n(A).\nAmortization of purchased intangible assets\n.\n  Non-GAAP gross margin and operating expenses exclude the amortization of purchased intangible assets, which primarily represents technology and/or customer relationships already developed.\n(B).\nAcquisition / divestiture items\n.\n  Non-GAAP gross margin and operating expenses exclude costs consisting of external and incremental costs resulting directly from acquisitions, divestitures, and strategic investment activities such as legal, due diligence, integration, and other closing costs, including the acceleration of acquisition stock awards and adjustments to the fair value of earn-out liabilities.  Non-GAAP non-operating expense, net, excludes one-time acquisition/divestiture charges, including foreign currency exchange rate gains/losses related to an acquisition, divestiture gains/losses, and strategic investment\n \ngains/losses.  These are one-time costs that vary significantly in amount and timing and are not indicative of our core operating performance. \n(C).\nStock-based compensation / deferred compensation\n.\n  Non-GAAP gross margin and operating expenses exclude stock-based compensation and income or expense associated with movement in our non-qualified deferred compensation plan liabilities.  Changes in non-qualified deferred compensation plan assets, included in non-operating expense, net, offset the income or expense in the plan liabilities.    \n(D).\nRestructuring and other costs.\n  Non-GAAP gross margin and operating expenses exclude restructuring and other costs comprised of termination benefits related to reductions in employee headcount and closure or exit of facilities, expenses related to the 2023 re-audit, as well as a $20 million\n commitment to donate to the Trimble Foundation that was paid over four quarters ending in the first quarter of 2023.  \nNon-GAAP non-operating expense net, excludes our proportionate share of items recorded in income from equity method investment items, such as goodwill impairment, amortization of purchased intangibles, stock-based compensation, and restructuring costs.    \n(E).\nNon-GAAP items tax effected\n.\n  This amount adjusts the provision for income taxes to reflect the effect of the non-GAAP items (A) through (D) on non-GAAP net income.  \n(F).\nDifference in GAAP and non-GAAP tax rate\n.\n  This amount represents the difference between the GAAP and non-GAAP tax rates applied to the non-GAAP operating income plus the non-GAAP non-operating expense, net. The non-GAAP tax rate excludes charges and benefits such as (i) deferred tax impacts from tax amortization relating to a non-U.S. intercompany transfer of intellectual property, (ii) deferred tax impacts from global intangible low-taxed income, and (iii) significant reserve releases upon statute of limitations expirations.\n(G).\nGAAP and non-GAAP tax rate percentages\n.\n  These percentages are defined as GAAP income tax provision as a percentage of GAAP income before taxes and non-GAAP income tax provision as a percentage of non-GAAP income before taxes.  \n39\nTable of Contents",
  "item2": null
}