{
  "source_file": "trow-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\nBusiness. \nT. Rowe Price Group, Inc. (\"T. Rowe Price Group\", \"T. Rowe Price\", \"the firm\", \"we\", \"us\", or \"our\") is a financial services holding company that provides global investment advisory services through its subsidiaries to investors worldwide. We are driven by our purpose: to identify and actively invest in opportunities to help people thrive in an evolving world. With more than 85 years of experience, we provide a broad range of investment solutions across equity, fixed income, multi-asset, and alternative capabilities for clients around the world— from individuals to advisors to institutions to retirement plan sponsors. We also provide certain investment advisory clients with related administrative services, including distribution, mutual fund transfer agent, accounting, and shareholder services; participant recordkeeping and transfer agent services for defined contribution retirement plans; brokerage; trust services; and non-discretionary advisory services through model delivery. We take an active, independent approach to investing, offering our dynamic perspective and meaningful partnership, so our clients can feel more confident.\nThe late Thomas Rowe Price, Jr., founded our firm in 1937, and the common stock of T. Rowe Price Associates, Inc. was first offered to the public in 1986. The T. Rowe Price Group, Inc. corporate holding company structure was established in 2000. Our common stock trades on the NASDAQ Global Select Market under the symbol \"TROW\".\nOur core capabilities have enabled us to deliver excellent operating results since our initial public offering. We maintain a strong corporate culture focused on delivering superior long-term investment performance and world-class service to our clients. We distribute our broad array of active investment solutions through a diverse set of distribution channels and vehicles to meet the needs of our clients globally. These vehicles include an array of U.S. mutual funds, collective investment trusts, exchange-traded funds, subadvised funds, separately managed accounts, and other sponsored products. The other sponsored products include: open-ended investment products offered to investors outside the U.S., products offered through variable annuity life insurance plans in the U.S., affiliated private investment funds, business development companies, an interval fund, and collateralized loan obligations. \nThe investment management industry has been evolving and industry participants are facing several challenging trends including passive investments taking market share from traditional active strategies; continued downward fee pressure; demand for new investment vehicles to meet client needs; and an ever-changing regulatory landscape.\nDespite these challenging trends, we believe there are significant opportunities that align to our core capabilities. Our ongoing financial strength and discipline allows us to respond to these opportunities with several strategic, multi-year initiatives that are designed to strengthen our long-term competitive position and to:\n•\nSustain our leadership position in retirement.\n•\nAccess growth of the U.S. wealth management channel through improved vehicle capabilities, technology, specialist sales, and content. \n•\nFocus on further global growth in select high-opportunity countries where we have existing business by investing more in resources, products, and marketing.\n•\nBroaden our reach in the private and alternatives market by leveraging our distribution channels and expanding our investment capabilities.\n•\nEnhance our relationships with clients and renew our individual investor base by investing in our ability to provide exceptional service and unique offerings.\n•\nStrengthen our distribution technology to enhance the digital client experience and client reporting. \n•\nAttract and retain top talent and enable effective hybrid collaboration.\n•\nNurture our brand globally and leverage it effectively across channels and geographies. \n•\nDeliver strong financial results and balance sheet strength for our stockholders over the long term.\nPage 2\nTable of Contents\n            \n    \nASSETS UNDER MANAGEMENT (AUM).\nOur consolidated net revenues and net income are derived largely from investment advisory services provided by our subsidiaries, primarily T. Rowe Price Associates (TRPA), T. Rowe Price Investment Management (TRPIM), Oak Hill Advisors (OHA), and T. Rowe Price International Ltd (TRPIL). Our revenues depend largely on the total value and composition of our assets under management. Accordingly, fluctuations in financial markets and in the composition of assets under management impact our revenues and results of operations. \nAt December 31, 2024, we had $1,606.6 billion in assets under management, an increase of $162.1 billion from the end of 2023. This increase in assets under management was driven by market appreciation, net of distributions not reinvested, of $205.3 billion, offset by net cash outflows of $43.2 billion. \nIn 2024, our target date retirement products experienced net cash inflows of $16.3 billion. The assets under management in our target date retirement products totaled $475.6 billion at December 31, 2024, or 29.6% of our managed assets at December 31, 2024, compared to 28.3% at the end of 2023.\nThe following charts show our AUM (in billions) by asset class, client type, geography, and account type as of December 31 for the prior three years: \nEquity\nInstitutional\n(3)\nFixed Income, including money market\nRetail\n(4)\nMulti-Asset\n(1)\nAlternatives\n(2)\n(1)\nThe underlying AUM of the multi-asset portfolios have been aggregated and presented in this category and not reported in the equity and fixed income rows.\n(2)\nThe alternatives asset class includes strategies authorized to invest more than 50% of its holdings in private credit, leveraged loans, mezzanine, real assets/CRE, structured products, stressed/distressed, non-investment grade CLOs, special situations, business development companies, or that have absolute return as its investment objective. Generally, only those strategies with longer than daily liquidity are included. Unfunded capital commitments of $16.2 billion at December 31, 2024, $11.6 billion at December 31, 2023, and $10.5 billion at December 31, 2022 are not reflected in AUM above.\n(3)\nInstitutional includes assets sourced from institutions along with defined contribution assets that are sourced through intermediaries and our full-service recordkeeping business. \n(4)\nRetail includes assets sourced through our direct-marketed business and financial intermediaries.\nPage 3\nTable of Contents\n            \n    \nUnited States\nU.S. Defined Contribution\nAPAC, EMEA, Canada\nOther Retirement\nOther Accounts\nAdditional information concerning our assets under management, results of operations, and financial condition during the past three years is contained in Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations as well as our consolidated financial statements, which are included in Item 8. of this Form 10-K. \nINVESTMENT MANAGEMENT SERVICES.\nInvestment Capabilities\nWe manage a broad range of investment strategies in equity, fixed income, multi-asset, and alternatives across sectors, styles and regions. Our strategies are designed to meet the varied and changing needs and objectives of investors and are delivered across a range of vehicles. We also offer specialized advisory services, including management of stable value investment contracts, customized multi-asset solutions, and a distribution management service for the disposition of equity securities our clients receive from third-party venture capital investment pools.\nPage 4\nTable of Contents\n            \n    \nThe following tables set forth our broad investment capabilities as of December 31, 2024.\nEquity\nGrowth\nCore\nValue\nConcentrated\nIntegrated (Quantitative & Fundamental)\nImpact\nU.S.:\nAll-Cap, Large-Cap, Mid-Cap, Small-Cap, Sectors\nLarge-Cap, Mid-Cap, Small-Cap\nLarge-Cap, Mid-Cap, Small-Cap\nLarge-Cap (Value)\nLarge-Cap (Growth & Value, Lower Volatility), Multi-Cap, Small-Cap\nLarge-Cap\nGlobal / International:\nAll-Cap, Large-Cap, Small-Cap, Sectors, Regional\nLarge-Cap\nLarge-Cap, Regional\nLarge-Cap, Regional\nLarge-Cap (Core)\nLarge-Cap\nFixed Income\nCash\nLow Duration\nHigh Yield / Bank Loans\nGovernment\nSecuritized\nInvestment Grade Credit\nU.S.:\nTaxable Money, Tax-Exempt Money\nStable Value, Short-Term Bond, Short Duration Income, Ultra-Short Term Bond\nCredit Opportunities, Floating Rate, High Yield\nInflation Protection, Treasury\nSecuritized Credit, CLO, GNMA\nInvestment Grade, Corporate Income Bond\nGlobal / International:\nN/O\nN/O\nEuro High Yield, High Income, Global High Yield\nGlobal Government Bond\nN/O\nEuro Investment Grade Corporate, Global Investment Grade Corporate \nMulti-Sector\nDynamic Suite\nEmerging Markets\nMunicipal\n(Tax-Free)\nImpact\nU.S.:\nQM Bond, Core Bond, Core Plus, Investment Grade Core, Total Return\nN/O\nN/O\nHigh Yield, Intermediate Muni, Intermediate, Long-Term, Short/Intermediate\nN/O\nGlobal / International:\nGlobal Multi-Sector, Global Aggregate, International Bond, Euro Aggregate\nDynamic Credit, Dynamic Global Bond, Dynamic Global Bond Investment Grade, Dynamic Emerging Markets Bond\nBond, Corporate, Corporate High Yield, Investment Grade, Local Currency, Asia Credit\nN/O\nGlobal Impact Credit\nN/O - Not offered\nMulti-Asset\nU.S. / Global / International:\nTarget Date, Custom Target Date\nTarget Allocation\nGlobal Allocation\nGlobal Income\nManaged Volatility\nCustom Solutions\nReal Assets\nRetirement Income\nAlternatives\nU.S. / Global / International:\nPrivate Credit\nLeveraged Loans\nMezzanine\nReal Assets / CRE\nStructured Products\nStressed / Distressed\nCLOs - Non-Investment Grade\nSpecial Situations\nMA Alternatives\nPage 5\nTable of Contents\n            \n    \nOur research staff conducts fundamental and quantitative security analysis primarily from offices located in the U.S. and U.K. with additional staff based in Australia, China, Hong Kong, Japan, and Singapore. We also use research provided by brokerage firms and security analysts in a supportive capacity and information received from private economists, political observers, commentators, government experts, and market analysts. \nWe introduce new strategies, investment vehicles, or other products to complement and expand our investment offerings, to respond to competitive developments in the financial marketplace, and to meet the changing needs of our clients. A new strategy is solely dependent on our belief we have the appropriate investment management expertise and its objective will be useful to investors over a long period. \nWe typically provide seed capital for certain investment products to begin building an investment performance history in advance of the portfolio receiving sustainable client assets. The length of time we hold our seed capital investment will vary for each investment product as it is highly dependent on how long it takes to generate cash flows into the product from unrelated investors or, in the case of certain alternative products, the investment term. Generally, we ensure the investment product has a sustainable level of assets from unrelated shareholders before we consider redemption of our seed capital investment in order to maintain the product's net asset value or its performance record. At December 31, 2024, we had seed capital investments in our products of $1.3 billion. Additionally, we invest our capital in certain alternative products we manage to further align our interest with those of our clients. These investments are commonly referred to as co-investments and totaled $0.3 billion at December 31, 2024.\nWe may also close or limit investments to new investors across investment products in order to maintain the integrity of the investment strategy and to protect the interests of its existing shareholders and investors. At present, the following strategies, which represent about 7% of total assets under management at December 31, 2024, are generally closed to new investors: \nStrategy \nYear closed\nU.S. Small-Cap Core\n2013\nCapital Appreciation\n2014\nDistribution Channels and Products\nWe distribute our products across a diversified client base across five primary distribution channels in three broad geographical regions: Americas; Europe, Middle East and Africa (\"EMEA\"); and Asia Pacific (\"APAC\"). We service clients in 54 countries around the world. Investors domiciled outside the U.S. represented about 9% of total assets under management at the end of 2024.\nThe following table outlines the five distribution channels and products through which our assets under management are sourced as of December 31, 2024.\nPage 6\nTable of Contents\n            \n    \nVehicle\nRetail\nInstitutional\nAmericas financial intermediaries\nEMEA & APAC financial intermediaries\nIndividual U.S. investors on a direct basis\nU.S. Defined Contribution\nInstitutional investors\nU.S. Mutual Funds\nx\nx\nx\nx\nCollective Investment Trusts\nx\nx\nExchange-Traded Funds\nx\nx\nx\nCollege Savings Plans\nx\nx\nModel Portfolios\nx\nx\n   x\n(6)\nSeparately Managed Accounts (SMAs)\n(1)\nx\nx\nSubadvised Accounts\nx\nx\nSeparate Accounts\nx\nx\nx\nSICAVs\n(2)\n / FCPs\n(3)\nx\nx\nCanadian Pooled Funds\nx\nx\nOEICs\n(4)\nx\nx\nJapanese ITMs\n(5)\nx\nx\nAustralian Unit Trusts\nx\nx\nPrivate Funds\nx\nCollateralized Loan Obligations\nx\nBusiness Development Company (BDC)\nx\nx\n(1)\n Includes both model delivery and manager traded SMAs,\n. (2)\nSociété d'Investissement à Capital Variable (Luxembourg), \n(3)\nFonds Commun de Placement (Luxembourg), \n(4)\nOpen-Ended Investment Company (U.K.), \n(5)\nJapanese Investment Trust Management Funds, \n(6) \nProvided through our ActivePlus and Retirement Advisory Service Portfolios. \nINVESTMENT ADVISORY FEES.\nWe derive substantially all of our net revenue from investment advisory fees that are earned pursuant to agreements with our sponsored products and clients. Nearly 57% of our investment advisory fees are earned from our sponsored U.S. mutual funds, with the remaining investment advisory fees earned from our collective investment trusts, subadvised funds, separately managed accounts, and other sponsored products. The other sponsored investment portfolios include: open-ended investment products offered to investors outside the U.S., products offered through variable annuity life insurance plans in the U.S., exchange traded funds, affiliated private investment funds, business development companies, and sponsored collateralized loan obligations.\nOur investment advisory fees are generally computed using the value of assets under management at a contracted annual fee rate or an effective fee rate for those products with a tiered-fee rate structure. For the majority of our revenue, the value of the assets under management used to calculate the fees are based on a daily valuation. The contracted fee rate(s) applied to the fund or account’s assets under management will vary depending on the services provided, the asset class, and vehicle. For example, fee rates are typically higher for equities and alternatives compared to multi-asset and fixed income products. Additionally, fees rates are typically higher for commingled vehicles including U.S. mutual funds, private investment funds and collective investment trusts compared to\n \nseparately managed accounts and subadvised funds. \nInvestment management agreements typically provide the ability for termination upon relatively short notice with little or no penalty. Specifically, our sponsored U.S. mutual fund investment management agreements must be approved, and fees are annually reviewed by the Boards of the respective funds, including a majority of directors who are not interested persons of the funds or of T. Rowe Price Group (as defined in the Investment Company Act of 1940). Additionally, fund shareholders must approve material changes to these investment management agreements. Each agreement automatically terminates in the event of its assignment (as defined in the Investment Company Act) and, generally, either party may terminate the agreement without penalty after a 60-day notice. The termination of one or more of the U.S. mutual fund agreements could have a material adverse effect on our results of operations. \nPage 7\nTable of Contents\n            \n    \nWe also earn performance-based investment advisory fees on certain separately managed accounts and affiliated private investment funds. These performance-based fees are recognized and reported separately in the consolidated income statement when performance returns exceed the stated hurdle at the end of the performance period, which can lead to an uneven recognition pattern in a given year. \nWe distribute certain of our sponsored products outside the U.S. through distribution agents and other financial intermediaries. The fees we earn for distributing and marketing these products are part of the investment advisory fees earned for managing the product assets. We recognize any related distribution fees paid to financial intermediaries in distribution and servicing costs.\nCAPITAL ALLOCATION-BASED INCOME.\nWe recognize income earned from general partner interests in certain affiliated private investment funds that are entitled to a disproportionate allocation of income, also referred to as carried interest. We record our proportionate share of the investment funds' income assuming the funds were liquidated at each reporting date pursuant to each investment fund's governing agreements. The income will fluctuate period-to-period and the realization of accrued carried interest occurs over a number of years. A portion of this income is allocated to certain employees that have non-controlling interests in the entities that hold the general partner's investments.\nADMINISTRATIVE, DISTRIBUTION, AND SERVICING FEES.\nAdministrative Services\nWe provide certain ancillary administrative services to our investment advisory clients. These administrative services are provided by several of our subsidiaries and include mutual fund transfer agent, fund/portfolio accounting, distribution, and shareholder services; recordkeeping services for defined contribution retirement plans investing in our sponsored vehicles and vehicles outside the T. Rowe Price complex; transfer agent services for defined contribution retirement plans investing in our sponsored U.S. mutual funds; brokerage; trust services; and non-discretionary advisory services.\nDistribution and Servicing\nOur subsidiary, T. Rowe Price Investment Services, is the principal distributor of our U.S. mutual funds and contracts with third-party financial intermediaries who distribute these share classes. Certain of the U.S. mutual funds offer Advisor Class and R Class shares that are distributed to investors and defined contribution retirement plans, respectively. These share classes pay 12b-1 fees of 25 and 50 basis points, respectively, out of fund assets, for distribution, administration, and personal services. In addition, U.S. mutual funds offered to investors through variable annuity life insurance plans have a share class that pays a 12b-1 fee of 25 basis points. We pay all of the 12b-1 fees earned to financial intermediaries who source assets under management into these share classes and provide distribution, administration, and personal services on our behalf.\n \nREGULATION.\nAll aspects of our business are subject to extensive federal, state, and foreign laws and regulations. These laws and regulations are primarily intended to benefit or protect our clients and product shareholders. They generally grant supervisory agencies and bodies broad administrative powers, including the power to limit or restrict the conduct of our business if we fail to comply with laws and regulations. Possible sanctions that may be imposed on us, if we fail to comply, include the suspension of individual employees, limitations on engaging in certain business activities for specified periods of time, revocation of our investment adviser and other registrations, censures, and fines. Furthermore, the regulations to which we are subject continue to change over time, resulting in uncertainty for our business as we must adapt to new laws and regulatory regimes and could significantly increase our reporting, disclosure and compliance obligations, including for cybersecurity and climate-related disclosures.\nAs a global company which offers its products to customers in a variety of jurisdictions, our subsidiaries are registered with or licensed by various U.S. and/or non-U.S. regulators. We are subject to various securities/financial services, compliance, corporate governance, disclosure, privacy, cybersecurity, technology, anti-bribery and anti-corruption, anti-money laundering, anti-terrorist financing, and economic, trade and sanctions laws and regulations, both domestically and internationally, as well as to various cross-border rules and regulations, and the data \nPage 8\nTable of Contents\n            \n    \nprotection laws and regulations of numerous jurisdictions, including the General Data Protection Regulation (“GDPR”) of the European Union (“EU”) and the California Consumer Privacy Act (“CCPA”). We also must comply with complex and changing tax regimes in the jurisdictions where we operate our business.\nThe following table shows the securities and financial services regulator to certain of our subsidiaries:\n \nRegulator\nT. Rowe Price Entity\nWithin the U.S.\nSecurities & Exchange Commission\n - T. Rowe Price Associates\n - T. Rowe Price Hong Kong\n - T. Rowe Price International\n - T. Rowe Price Japan\n - T. Rowe Price Australia\n - T. Rowe Price Singapore\n - T. Rowe Price (Canada)\n - T. Rowe Price Advisory Services\n - T. Rowe Price Investment Management\n - Oak Hill Advisors\n - Oak Hill Advisors (Europe)\n - OHA (UK)\n -OHA Private Credit Advisors\n - OHA Private Credit Advisors II\nAll entities above are registered as investment advisers under the Investment Advisers Act of 1940, which imposes substantive regulation around, among other things, fiduciary duties to clients, transactions with clients, effective compliance programs, conflicts of interest, advertising, recordkeeping, reporting, and disclosure requirements.\nState of Maryland, Office of Financial Regulation\n - T. Rowe Price Trust Company\nOutside the U.S.\nFinancial Conduct Authority\n - T. Rowe Price International\n - T. Rowe Price UK\n - Oak Hill Advisors (Europe)\n - OHA (UK)\nSecurities and Futures Commission\n - T. Rowe Price Hong Kong\n - Oak Hill Advisors (Hong Kong)\nMonetary Authority of Singapore\n - T. Rowe Price Singapore\nSeveral provincial securities commissions in Canada\n - T. Rowe Price (Canada)\nCommission de Surveillance du Secteur Financier \n - T. Rowe Price (Luxembourg) Management Sàrl \n - OHA Services Sàrl \nAustralian Securities and Investments Commission\n - T. Rowe Price Australia\n - Oak Hill Advisors (Australia) Pty\nJapan Financial Services Agency\n - T. Rowe Price Japan\nSwiss Financial Market Supervisory Authority\n - T. Rowe Price (Switzerland)\nServing the needs of retirement savers is an important focus of our business. Such activities are subject to regulators such as the U.S. Department of Labor, and applicable laws and regulations including the Employee Retirement Income Security Act of 1974 (\"ERISA\").\nRegistrations\n•\nOur subsidiaries providing transfer agent services, T. Rowe Price Services and T. Rowe Price Retirement Plan Services, are registered under the Securities Exchange Act of 1934.\n \n•\nT. Rowe Price Investment Services (TRPIS) is an SEC registered introducing broker-dealer and member of the Financial Industry Regulatory Authority (\"FINRA\") and the Securities Investor Protection Corporation. This \nPage 9\nTable of Contents\n            \n    \nsubsidiary is the principal underwriter and distributor for our sponsored U.S. mutual funds and exchange-traded funds, and may also offer and make recommendations for certain funds that are not offered to the general public such as privately placed funds. Investors may open a brokerage account with TRPIS in order to buy and sell securities. Pershing, a third-party clearing broker and an affiliate of BNY Mellon, maintains our brokerage’s customer accounts and clears all transactions.\n \n•\nT. Rowe Price Associates and certain subsidiaries are registered as commodity trading advisors and/or commodity pool operators with the Commodity Futures Trading Commission and are members of the National Futures Association. \nNet Capital Requirements\nCertain subsidiaries are subject to net capital requirements, including those of various federal, state, and international regulatory agencies. Each of our subsidiary's net capital, as defined, meets or exceeds all minimum requirements as of December 31, 2024.\n \nFor further discussion of the potential impact of current or proposed legal or regulatory requirements, please see the Legal and Regulatory risk factors included in Item 1A. of this Form 10-K.\nCOMPETITION.\nAs a member of the financial services industry, we are subject to substantial competition in all aspects of our business. A significant number of proprietary and other sponsors’ investment products are sold to the public by other investment management firms, broker-dealers, mutual fund companies, banks, and insurance companies. We compete with brokerage and investment banking firms, insurance companies, banks, traditional and alternative asset management companies, hedge funds, and other financial institutions and funds in all aspects of our business and in every country in which we offer our products and services. Some of these financial institutions have greater resources, may have more developed brand awareness in particular markets, or offer additional services to clients than we do. We compete with other providers of investment advisory services based primarily on the availability and objectives of the investment products offered, investment performance, fees and related expenses, and the scope and quality of investment advice and other client services. \nWe have and will continue to face significant competition from passive oriented investment strategies. As a result, such products have taken market share from active managers. While we cannot predict how much market share these competitors will continue to gain, we believe there will always be demand for good active management investment products. \nIn order to maintain and enhance our competitive position, we may review acquisition and venture opportunities and, if appropriate, engage in discussions and negotiations that could lead to an acquisition transaction or other financial relationships with another entity.\nHUMAN CAPITAL.\nAt T. Rowe Price, our people are our greatest asset. Our culture of collaboration, diversity and inclusion enables us to identify and challenge our best ideas to arrive at well-informed decisions for our clients. To attract and retain the highest quality talent, we invest in the associate experience and develop talent and succession plans; deliver individual and firmwide training and development opportunities for our associates to learn and grow; and provide strong, competitive, and regionally specific benefits and programs that promote the health and wellness of our associates. \nAs of December 31, 2024, we employed 8,158 associates, an increase of 3.2% from the 7,906 associates employed at the end of 2023. We add temporary and part-time personnel to complement our staff from time to time to meet periodic and special project demands, primarily for technology and collective investment fund administrative services. \nPage 10\nTable of Contents\n            \n    \nInvesting In Our People\nTo help our clients achieve their long-term investment goals, we help our associates achieve their long-term career goals. We continuously seek to identify new opportunities for our associates to expand their experience and grow their skills while cultivating an environment that allows them to be and bring their best selves to work every day. As a result of our associates developing these skills, we can promote from within. We fill approximately one-third of our open positions with internal applicants, and most of our portfolio managers have been promoted from within. We facilitate the professional development of our associates by advancing their knowledge, skills, and experience; providing them access to in-person, virtual, and online training programs; and offering a generous tuition reimbursement program. Our comprehensive learning platform allows associates to grow in ways that matter to them, while offering customized and bespoke learning paths to build critical capabilities that advance our business priorities. \nWe encourage associates to participate in one of the four mentorship programs offered by the firm, which include mentoring, reciprocal mentoring, and mentor circle programs. Launched in 2022 and continuously enhanced, T. Rowe Price’s mentorship program enrollment has grown across the firm.\nWe believe a critical driver of our firm’s future growth is our ability to cultivate leaders. Our leaders balance business credibility, accountability, and leadership capability to maximize potential, drive client value, and activate our culture. Reflecting this, we offer leadership experiences that include a series of leadership speaker events and access to virtual and in-person leadership development programs led by professors at leading universities and institutions.\nAttracting and Retaining Talent\n \nWe recruit and engage candidates with different backgrounds and experiences who bring new perspectives. Our\n \ntalent acquisition team continually enhances our recruitment and outreach strategies for all qualified applicants. Our talent strategy has garnered recognitions, including Forbes’ World’s Best Employers, World's Most Admired Companies from Fortune, Top Workplaces Culture Excellence from Energage, and America's Most Responsible Companies from Newsweek, among others. \nWe publish our Equal Employment Opportunity (\"EEO\") data on our website at https://www.troweprice.com/content/dam/trowecorp/Pdfs/eeo-fact-sheet.pdf. In addition, we publish our annual sustainability report, which includes transparency into our data, a copy of which can be found on our website at https://www.troweprice.com/corporate/us/en/what-we-do/esg-approach/esg-corporate.html. \nOffering Benefits to Further Our Commitment \nWe offer employee benefit solutions, including both health care and retirement benefits, where applicable; fitness club reimbursement; life insurance; and an Employee Assistance Program to support well-being. Benefit competitiveness and design is assessed for a given country, and offerings reflect our global principles and local market practice. For example, retirement programs are uniquely designed to support associates in meeting retirement goals while also reflecting regional and country-specific practices in APAC, EMEA, and North America. \nFocus on Family\nWe have always emphasized the importance of spending quality time away from work. In addition to generous vacation time, the firm offers fully paid maternity leave for birth mothers and fully paid parental leave to all new mothers and fathers. We also provide adoption assistance to associates looking to expand their families. In the U.S., the UK, and Canada, we offer our associates backup childcare and elder care. We also launched an APAC Family Program working group designed to support working parents and caregivers throughout the region in the workplace.\nAVAILABLE INFORMATION.\nWe intend to use our website, troweprice.com, as means of disclosing material non-public information and for complying with our disclosure obligations under Regulation FD. These disclosures will be included in the Investor Relations section of our website, investors.troweprice.com. We make our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports filed or furnished pursuant to \nPage 11\nTable of Contents\n            \n    \nSection 13(a) of the Exchange Act, available free of charge in this section of our website as soon as reasonably practicable after they have been filed with the SEC. In addition, our website includes the following information: \n•\nour financial statement information from our periodic SEC filings in the form of XBRL data files that may be used to facilitate computer-assisted investor analysis;\n•\ncorporate governance information including our governance guidelines, committee charters, senior officer code of ethics and conduct, and other governance-related policies; \n•\nother news and announcements that we may post from time to time that investors might find useful or interesting, including our monthly assets under management disclosure and periodic investor presentations; and \n•\nopportunities to sign up for email alerts and RSS feeds to have information pushed in real time. \nAccordingly, investors should monitor this section of our website, in addition to following our press releases, SEC filings, and public webcasts, all of which will be referenced on the website. Unless otherwise expressly stated, the information found on our website is not incorporated into this or any other report we file with, or furnish to, the SEC. Specifically, information in our sustainability report is not incorporated by reference into this Form 10-K.\nThe SEC maintains a website that contains the materials we file with the SEC at www.sec.gov.",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nOVERVIEW.\nOur revenues and net income are derived primarily from investment advisory services provided to individual and institutional investors in a broad range of investment solutions across equity, fixed income, multi-asset, and alternative capabilities. We also provide certain investment advisory clients with related administrative services, including distribution, mutual fund transfer agent, accounting, and shareholder services; participant recordkeeping and transfer agent services for defined contribution retirement plans; brokerage; trust services; and non-discretionary advisory services. \nInvestment advisory fees depend largely on the total value and composition of assets under our management. Accordingly, fluctuations in financial markets and in the composition of assets under management affect our revenues and results of operations. \nWe incur significant expenditures to develop new products and services and improve and expand our capabilities and distribution channels in order to attract new clients and additional investments from our existing clients. These efforts often involve costs that precede any future revenues we may recognize from an increase to our assets under management.\nThe investment management industry has been evolving and\n \nindustry participants are facing challenging trends including passive investments taking market share from traditional active strategies; continued downward fee pressure; demand for new investment vehicles to meet client needs; and an ever-changing regulatory landscape.\n \nIn this regard, we have ample liquidity and resources that allow us to take advantage of attractive growth opportunities. We are investing in key capabilities, including investment professionals, distribution professionals, technologies, and new product offerings in order to provide our clients with strong investment management expertise and service. \nMARKET TRENDS.\nU.S. stocks produced strong gains for the second consecutive year in 2024, and various equity indexes reached new all-time highs during the year. The equity market was buoyed by generally favorable corporate earnings and by continuing interest in companies expected to benefit from AI developments. Although inflation remained above the Federal Reserve’s long-term 2% target, the central bank shifted its focus toward the moderating labor market in the second half of the year and began reducing interest rates starting in September. In the final months of the year, equity investors generally welcomed not only looser monetary policy, but also diminished political uncertainty following U.S. elections in early November. Market volatility increased, however, as investors curtailed their expectations for short-term interest rate cuts in 2025.\nDeveloped non-U.S. equity markets were mostly positive in 2024, helped by looser monetary policies from various central banks around the world. However, returns to U.S. investors were hurt by a stronger dollar versus major non-U.S. currencies. In Europe, equity markets were widely mixed in U.S. dollar terms, whereas developed Asian markets were mostly positive.\nEmerging equity markets generally appreciated and outperformed stocks in developed non-U.S. markets in U.S. dollar terms. Emerging Asian markets were mostly positive in dollar terms, though South Korean stocks fell sharply due in large part to late-year political turmoil. Equities in the emerging Europe, Middle East, and Africa (EMEA) region were also mostly positive. In Latin America, stocks in regional heavyweights Brazil and Mexico fell sharply, though some smaller markets produced positive returns.\nPage 31\nTable of Contents\n            \n    \nReturns of several major equity market indexes for 2024 are as follows:\nS&P 500 Index\n25.0%\nNASDAQ Composite Index\n(1)\n28.6%\nRussell 2000 Index\n11.5%\nMSCI EAFE (Europe, Australasia, and Far East) Index\n4.4%\nMSCI Emerging Markets Index\n8.1%\n(1) \nReturns exclude dividends\nGlobal bond returns were mostly positive in 2024, as many central banks around the world reduced short-term interest rates due to easing inflation pressures. In the U.S., Treasury bill yields declined as the Federal Reserve reduced the federal funds target rate by 100 basis points (1.00%) in three steps starting in mid-September. Intermediate- and long-term U.S. Treasury yields fluctuated throughout the year, but ultimately increased for the year amid expectations for fewer interest rate cuts in 2025 due to inflation remaining above the Federal Reserve’s 2% long-term goal. The 10-year U.S. Treasury note yield was 4.58% at December 31, 2024 compared to 3.88% at December 31, 2023 .\nIn the U.S. investment-grade universe, sector performance was broadly positive. Non-agency commercial mortgage-backed securities and asset-backed securities produced solid gains. Corporate bonds rose to a lesser degree. Mortgage-backed securities performed in line with the broad investment-grade market. Treasuries lagged with slight positive returns. Tax-free municipal bonds slightly trailed the broad taxable bond market. High yield corporate bonds produced solid gains and strongly outperformed the investment-grade bond market.\nBonds in developed non-U.S. markets produced negative returns in U.S. dollar terms due to weaker currencies versus the dollar and rising bond yields in some countries. Easing inflation pressures enabled central banks in Europe and the UK to reduce interest rates a few times. In Japan, longer-term interest rates rose as the Bank of Japan increased short-term rates in March, ending a multi-year period of negative interest rates. The Bank of Japan also unexpectedly raised rates at the end of July. In the emerging markets fixed income universe, dollar-denominated bonds produced gains in U.S. dollar terms, but local currency bonds produced negative returns, as most developing markets currencies declined versus the dollar. \nReturns of several major bond market indexes for 2024 are as follows:\nBloomberg Barclays U.S. Aggregate Bond Index\n1.3%\nJ.P. Morgan Global High Yield Index\n9.0%\nBloomberg Barclays Municipal Bond Index\n1.1%\nBloomberg Barclays Global Aggregate Ex-U.S. Dollar Bond Index\n(4.2)%\nJ.P. Morgan Emerging Markets Bond Index Plus\n7.7%\nBank of America US High Yield Index\n8.2%\nCredit Suisse Leveraged Loan Index\n9.1%\nASSETS UNDER MANAGEMENT.\nAssets under management ended 2024 at $1,606.6 billion, an increase of $162.1 billion from the end of 2023. This increase was driven by net market appreciation and income, net of distributions not reinvested, of $205.3 billion, offset by net cash outflows of $43.2 billion. \nPage 32\nTable of Contents\n            \n    \nThe following table details changes in our assets under management by asset class during the last three years:\n(in billions)\nEquity\nFixed income, including money market\nMulti-asset\n(1)\nAlternatives\n(2)\nTotal\nAssets under management at December 31, 2021\n$\n992.7 \n$\n175.7 \n$\n477.7 \n$\n41.7 \n$\n1,687.8 \nNet cash flows prior to manager-driven distributions\n(72.7)\n4.1 \n4.9 \n4.6 \n(59.1)\nManager-driven distributions\n— \n— \n— \n(2.6)\n(2.6)\nNet cash flows\n(72.7)\n4.1 \n4.9 \n2.0 \n(61.7)\nNet market appreciation (depreciation) and income\n(3)\n(255.8)\n(12.8)\n(82.5)\n(0.3)\n(351.4)\nChange during the period\n(328.5)\n(8.7)\n(77.6)\n1.7 \n(413.1)\nAssets under management at December 31, 2022\n664.2 \n167.0 \n400.1 \n43.4 \n1,274.7 \nNet cash flows prior to manager-driven distributions\n(85.4)\n(6.8)\n9.1 \n3.9 \n(79.2)\nManager-driven distributions\n— \n— \n— \n(2.6)\n(2.6)\nNet cash flows\n(85.4)\n(6.8)\n9.1 \n1.3 \n(81.8)\nNet market appreciation (depreciation) and income\n(3)\n164.8 \n9.8 \n73.8 \n3.2 \n251.6 \nChange during the period\n79.4 \n3.0 \n82.9 \n4.5 \n169.8 \nAssets under management at December 31, 2023\n743.6 \n170.0 \n483.0 \n47.9 \n1,444.5 \nNet cash flows prior to manager-driven distributions\n(52.0)\n12.6 \n(6.5)\n6.4 \n(39.5)\nManager-driven distributions\n— \n— \n— \n(3.7)\n(3.7)\nNet cash flows\n(52.0)\n12.6 \n(6.5)\n2.7 \n(43.2)\nNet market appreciation (depreciation) and income\n(3)\n138.1 \n5.5 \n59.5 \n2.2 \n205.3 \nChange during the period\n86.1 \n18.1 \n53.0 \n4.9 \n162.1 \nAssets under management at December 31, 2024\n$\n829.7 \n$\n188.1 \n$\n536.0 \n$\n52.8 \n$\n1,606.6 \n(1) \nThe underlying AUM of the multi-asset portfolios have been aggregated and presented in this category and not reported in the equity and fixed income columns. \n(2) \nThe alternatives asset class includes strategies authorized to invest more than 50% of its holdings in private credit, leveraged loans, mezzanine, real assets/CRE, structured products, stressed/distressed, non-investment grade CLOs, special situations, business development companies, or that have absolute return as its investment objective. Generally, only those strategies with longer than daily liquidity are included. Unfunded capital commitments of $16.2 billion at December 31, 2024, $11.6 billion at December 31, 2023, and $10.5 billion at December 31, 2022 are not reflected in AUM above.\n(3)\n Reflects net distributions not reinvested of $5.9 billion in 2024, $2.9 billion in 2023, and $3.3 billion in 2022.\nInvestment advisory clients outside the U.S. accounted for 8.8% of our assets under management at December 31, 2024, 8.6% at December 31, 2023, and 9.1% at December 31, 2022. \nThe following table details our assets under management and net flows in our target date retirement products, which are included in the multi-asset column shown above:\n(in billions)\n2024\n2023\n2022\nAssets under management\n$\n475.6 \n$\n408.4 \n$\n334.2 \nNet cash flows\n$\n16.3 \n$\n13.1 \n$\n11.3 \nPage 33\nTable of Contents\n            \n    \nOur net cash outflows in 2024 were driven primarily by growth-oriented equity strategies and a multi-asset sub-advised variable annuity outflow. These outflows were partially offset by net cash inflows in our target date retirement products, fixed income and alternative strategies. Financial intermediaries were the main sources of net outflows in 2024. Geographically, while the EMEA and APAC regions experienced net inflows, these were outweighed by outflows in the Americas. For 2023, net outflows were driven primarily by our growth-oriented equity strategies sourced from Americas financial intermediaries and institutional clients. These outflows were partially offset by net cash inflows in our multi-asset strategies, predominately our target date retirement products, and alternative strategies. From a geography perspective, net outflows were predominantly from U.S. clients invested in equity strategies though all regions experienced net outflows. For 2022, net outflows were driven primarily by our growth-oriented equity strategies sourced from U.S. intermediaries. These outflows were partially offset by net cash inflows in our international fixed income, multi-asset, and alternative strategies. From a geographical perspective, the Americas and EMEA regions experienced net outflows predominantly in equities, while APAC had positive net flows.\nWe provide strategic investment advice solutions for certain portfolios. These advice solutions, the vast majority of which are overseen by our multi-asset division, may include strategic asset allocation, and in certain portfolios, asset selection and/or tactical asset allocation overlays. We also offer advice solutions through retail separately managed accounts and separately managed accounts model delivery. As of December 31, 2024, total assets in these solutions were $557 billion, of which $542 billion are reported in assets under management in the tables above.\nWe provide participant accounting and plan administration for defined contribution retirement plans that primarily invest in the firm's U.S. mutual funds, collective investment trusts and funds managed outside of the firm's complex. As of December 31, 2024, our assets under administration were $282 billion, of which $159 billion were assets we manage. \nINVESTMENT PERFORMANCE\n(1)\n.\nStrong investment performance and brand awareness is a key driver to attracting and retaining assets—and to our long-term success. The following table presents investment performance for the one-, three-, five-, and 10-years ended December 31, 2024. Past performance is no guarantee of future results. \n% of U.S. mutual funds that outperformed Morningstar median\n(2),(3) \n1 year\n3 years\n5 years\n10 years\nEquity\n51%\n51%\n46%\n67%\nFixed Income\n48%\n52%\n55%\n63%\nMulti-Asset\n63%\n63%\n69%\n82%\nAll Funds\n54%\n56%\n56%\n70%\n% of U.S. mutual funds that outperformed passive peer median\n(2),(4)\n1 year\n3 years\n5 years\n10 years\nEquity\n55%\n47%\n43%\n55%\nFixed Income\n52%\n52%\n61%\n63%\nMulti-Asset\n55%\n60%\n68%\n64%\nAll Funds\n54%\n53%\n56%\n60%\n% of composites that outperformed benchmarks\n(5)\n1 year\n3 years\n5 years\n10 years\nEquity\n39%\n29%\n40%\n61%\nFixed Income\n60%\n45%\n56%\n73%\nAll Composites\n48%\n36%\n46%\n65%\nPage 34\nTable of Contents\n            \n    \nAUM Weighted Performance\n% of U.S. mutual funds AUM that outperformed Morningstar median\n(2),(3)\n1 year\n3 years\n5 years\n10 years\nEquity\n57%\n58%\n49%\n80%\nFixed Income\n66%\n62%\n64%\n78%\nMulti-Asset\n70%\n68%\n90%\n94%\nAll Funds\n61%\n61%\n59%\n83%\n% of U.S. mutual funds AUM that outperformed passive peer median\n(2),(4)\n1 year\n3 years\n5 years\n10 years\nEquity\n64%\n36%\n29%\n55%\nFixed Income\n68%\n68%\n85%\n73%\nMulti-Asset\n71%\n58%\n95%\n95%\nAll Funds\n66%\n43%\n48%\n66%\n% of composites AUM that outperformed benchmarks\n(5)\n1 year\n3 years\n5 years\n10 years\nEquity\n50%\n21%\n42%\n53%\nFixed Income\n65%\n37%\n47%\n69%\nAll Composites\n52%\n24%\n43%\n55%\nAs of December 31, 2024, 54 of 90 (60.0%) of our rated U.S. mutual funds (across primary share classes) received an overall rating of 4 or 5 stars. By comparison, 32.5% of Morningstar's fund population is given a rating of 4 or 5 stars\n(6)\n. In addition, 63.0%\n(6)\n of AUM in our rated U.S. mutual funds (across primary share classes) ended 2024 with an overall rating of 4 or 5 stars.\n(1) \nThe investment performance reflects that of T. Rowe Price sponsored mutual funds and composites AUM. \n(2) \nSource: © 2025 Morningstar, Inc. All rights reserved. The information contained herein: 1) is proprietary to Morningstar and/or its content providers; 2) may not be copied or distributed; and 3) is not warranted to be accurate, complete, or timely. Neither Morningstar nor its content providers are responsible for any damages or losses arising from any use of this information. \n(3)\n Source: Morningstar. Primary share class only. Excludes money market mutual funds, funds with an operating history of less than one year, T. Rowe Price passive funds, and T. Rowe Price funds that are clones of other funds. The top chart reflects the percentage of T. Rowe Price funds with 1 year, 3 year, 5 year, and 10 year track record that are outperforming the Morningstar category median. The bottom chart reflects the percentage of T. Rowe Price funds AUM that has outperformed for the time periods indicated. Total Fund AUM included for this analysis includes $322B for 1 year, $318B for 3 years, $317B for 5 years, and $316B for 10 years. \n(4)\n Passive Peer Median was created by T. Rowe Price using data from Morningstar. Primary share class only. Excludes money market mutual funds, funds with an operating history of less than one year, funds with fewer than three peers, T. Rowe Price passive funds, and T. Rowe Price funds that are clones of other funds. This analysis compares T. Rowe Price active funds with the applicable universe of passive/index open-end funds and ETFs of peer firms. The top chart reflects the percentage of T. Rowe Price funds with 1 year, 3 year, 5 year, and 10 year track record that are outperforming the passive peer universe. The bottom chart reflects the percentage of T. Rowe Price funds AUM that has outperformed for the time periods indicated. Total AUM included for this analysis includes $306B for 1 year, $302B for 3 years, $262B for 5 years, and $257B for 10 years.\n(5)\nComposite net returns are calculated using the highest applicable separate account fee schedule. Excludes money market composites. All composites compared to official GIPS composite primary benchmark. The top chart reflects the percentage of T. Rowe Price composites with 1 year, 3 year, 5 year, and 10 year track record that are outperforming their benchmarks. The bottom chart reflects the percentage of T. Rowe Price composite AUM that has outperformed for the time periods indicated. Total AUM included for this analysis includes $1,423B for 1 year, $1,420B for 3 years, $1,418B for 5 years, and $1,367B for 10 years. \n(6)\n The Morningstar Rating™ for funds is calculated for funds with at least a three-year history. Exchange-traded funds and open-ended mutual funds are considered a single population for comparative purposes. It is calculated based on a Morningstar Risk-Adjusted Return measure that accounts for variation in a managed product's monthly excess performance, placing more emphasis on downward variations and rewarding consistent performance. Morningstar gives its best ratings of 5 or 4 stars to the top 32.5% of all funds (of the 32.5%,10% get 5 stars and 22.5% get 4 stars). The Overall Morningstar Rating™ is derived from a weighted average of the performance figures associated with a fund’s 3, 5, and 10 year (if applicable) Morningstar Rating™ metrics.\nRESULTS OF OPERATIONS.\nThe following table and discussion set forth information regarding our consolidated financial results for 2024, 2023 and 2022 on a U.S. GAAP basis and a non-GAAP basis. The non-GAAP basis adjusts for the impact of our consolidated investment products, the impact of market movements on the deferred compensation liabilities and related economic hedges, investment income related to certain other investments, acquisition-related amortization and costs, impairment charges, and certain nonrecurring charges and gains, if any. \nPage 35\nTable of Contents\n            \n    \n2024 compared to 2023\n2023 compared to 2022\n(in millions, except per-share data)\n2024\n2023\n2022\nChange\n% Change \n(1)\nChange\n% Change \n(1)\nU.S. GAAP basis\nInvestment advisory fees\n(2)\n$\n6,399.7 \n$\n5,709.5 \n$\n5,962.7 \n$\n690.2 \n12.1 \n%\n$\n(253.2)\n(4.2)\n%\nPerformance-based advisory fees\n(2)\n$\n59.3 \n$\n38.2 \n$\n6.4 \n$\n21.1 \n55.2 \n%\n$\n31.8 \nn/m\nCapital allocation-based income\n(3)\n$\n46.6 \n$\n161.9 \n$\n(54.3)\n$\n(115.3)\nn/m\n$\n216.2 \nn/m\nNet revenues\n$\n7,093.6 \n$\n6,460.5 \n$\n6,488.4 \n$\n633.1 \n9.8 \n%\n$\n(27.9)\n(0.4)\n%\nOperating expenses\n$\n4,760.3 \n$\n4,474.3 \n$\n4,114.7 \n$\n286.0 \n6.4 \n%\n$\n359.6 \n8.7 \n%\nNet operating income\n$\n2,333.3 \n$\n1,986.2 \n$\n2,373.7 \n$\n347.1 \n17.5 \n%\n$\n(387.5)\n(16.3)\n%\nNon-operating income\n$\n486.3 \n$\n504.1 \n$\n(425.5)\n$\n(17.8)\n(3.5)\n%\n$\n929.6 \nn/m\nNet income to T. Rowe Price Group\n$\n2,100.1 \n$\n1,788.7 \n$\n1,557.9 \n$\n311.4 \n17.4 \n%\n$\n230.8 \n14.8 \n%\nDiluted earnings per common share \n$\n9.15 \n$\n7.76 \n$\n6.70 \n$\n1.39 \n17.9 \n%\n$\n1.06 \n15.8 \n%\nAdjusted basis\n(4)\nOperating expenses\n$\n4,498.8 \n$\n4,260.7 \n$\n4,087.8 \n$\n238.1 \n5.6 \n%\n$\n172.9 \n4.2 \n%\nOperating expenses, excluding accrued carried interest related compensation\n$\n4,456.3 \n$\n4,190.7 \n$\n4,070.2 \n$\n265.6 \n6.3 \n%\n$\n120.5 \n3.0 \n%\nNet operating income\n$\n2,685.9 \n$\n2,263.2 \n$\n2,500.5 \n$\n422.7 \n18.7 \n%\n$\n(237.3)\n(9.5)\n%\nNon-operating income (loss)\n$\n148.7 \n$\n140.8 \n$\n(24.4)\n$\n7.9 \n5.6 \n%\n$\n165.2 \nn/m\nNet income to T. Rowe Price Group\n$\n2,139.5 \n$\n1,750.1 \n$\n1,864.8 \n$\n389.4 \n22.3 \n%\n$\n(114.7)\n(6.2)\n%\nDiluted earnings per common share\n$\n9.33 \n$\n7.59 \n$\n8.02 \n$\n1.74 \n22.9 \n%\n$\n(0.43)\n(5.4)\n%\nAssets under management (AUM) (in billions)\nAverage AUM\n$\n1,561.9 \n$\n1,362.3 \n$\n1,398.4 \n$\n199.6 \n14.7 \n%\n$\n(36.1)\n(2.6)\n%\nEnding AUM\n$\n1,606.6 \n$\n1,444.5 \n$\n1,274.7 \n$\n162.1 \n11.2 \n%\n$\n169.8 \n13.3 \n%\nInvestment advisory annualized effective fee rate (EFR) (in bps)\nEFR without performance-based fees\n41.0\n41.9\n42.6\n(0.9)\n(2.1)\n%\n(0.7)\n(1.6)\n%\nEFR with performance-based fees\n41.4\n42.2\n42.7\n(0.8)\n(1.9)\n%\n(0.5)\n(1.2)\n%\n(1) \nThe percentage change is not meaningful (n/m).\n(2)\n \nPerformance-based advisory fees were previously included in investment advisory fees. Prior periods were recast to reflect this change.\n(3) \nCapital allocation-based income represents the change in accrued carried interest. \n(4) \nSee the reconciliation to the comparable U.S. GAAP measures at the end of the Results of Operations section of this Management's Discussion and Analysis. \nResults Overview - 2024 compared to 2023\nInvestment advisory fees\n are earned based on the value and composition of our assets under management, which change based on fluctuations in financial markets, investment performance, and net cash flows. As our average assets under management increase or decrease in a given period, the level of our investment advisory fees for that same period generally fluctuate in a similar manner. Our annualized effective fee rates can be impacted by market or cash flow related shifts among asset and share classes, shifts among vehicles, price changes in existing products, and asset level changes in products with tiered-fee structures.\nInvestment advisory fees earned in 2024 increased 12.1% compared to 2023 as average assets under management increased $199.6 billion, or 14.7%, to $1,561.9 billion. \nThe average annualized effective fee rate, excluding performance-based advisory fees, earned on our assets under management was 41.0 basis points in 2024, compared to 41.9 basis points earned in 2023. Our effective fee rate has declined largely due to a mix shift in assets toward lower fee products and asset classes from client flows and transfers, partially offset by higher market returns. The average annualized fee rate, excluding performance-based fees, was 40.5 basis points for the fourth quarter of 2024.\nOperating expenses\n were $4,760.3 million in 2024, an increase of 6.4% compared to 2023. The increase was primarily driven by higher compensation costs, distribution and servicing costs, and advertising and promotion costs. Additionally, 2023 included a $82.4 million reduction in operating expenses related to the remeasurement of the contingent consideration liability compared to a $13.4 million reduction in 2024.\nPage 36\nTable of Contents\n            \n    \nOn a non-GAAP basis, operating expenses were $4,498.8 million, an increase of 5.6% compared to 2023. The increase in our non-GAAP operating expenses was primarily driven by higher costs across compensation and benefits, distribution and servicing, advertising, professional fees, and a non-recurring recovery of general and administrative costs recognized in 2023. These increases were partially offset by lower external research fees, lower accrued carried interest compensation, and higher capitalized labor. In 2024, the firm changed its approach to paying for external research, consistent with regulations and general industry practice.\nWe currently estimate our 2025 non-GAAP operating expenses, excluding non-GAAP accrued carried interest compensation, will grow in the range of 4%-6% from the 2024 amount of $4,456.3 million. We could elect to adjust our expense growth should unforeseen circumstances arise, including significant market movements.\nOperating margin\n \nwas 32.9% in 2024 compared to 30.7% in 2023. The increase is primarily driven by net revenue growth outpacing operating expense growth primarily due to higher average assets under management. \nDiluted earnings per share\n was $9.15 in 2024 compared to $7.76 in 2023. The increase in GAAP basis diluted earnings per share was primarily due to higher operating income and a lower effective tax rate. \nOn a non-GAAP basis, diluted earnings per share was $9.33 in 2024 compared to $7.59 in 2023. The increase was primarily due to higher operating income and a lower effective tax rate.\nSee our non-GAAP reconciliations later in this Management's Discussion and Analysis section. \nResults Overview - 2023 compared to 2022\nInvestment advisory fees\n are earned based on the value and composition of our assets under management, which change based on fluctuations in financial markets and net cash flows. As our average assets under management increase or decrease in a given period, the level of our investment advisory fees for that same period generally fluctuates in a similar manner. Our annualized effective fee rates can be impacted by market or cash flow related shifts among asset and share classes, price changes in existing products, and asset level changes in products with tiered-fee structures.\nInvestment advisory fees earned in 2023 decreased 3.7% over the comparable 2022 period as average assets under our management decreased $36.1 billion, or 2.6%, to $1,362.3 billion. \nThe average annualized effective fee rate earned on our assets under management was 41.9 basis points in 2023, compared to 42.6 basis points earned in 2022. Our effective fee rate has declined largely due to a mix shift toward lower fee asset classes and vehicles as a result of net equity outflows, partially offset by higher market returns. The average annualized fee rate earned on our assets under management was 41.5 basis points for the fourth quarter of 2023.\nOperating expenses\n were $4,474.3 million in 2023, an increase of 8.7% over the comparable 2022 period. The impact of market movements on the supplemental savings plan liability accounted for about 70% of the increase in U.S. GAAP operating expenses. Non-operating income has a corresponding increase due to our economic hedge of the liability.\nOn a non-GAAP basis, operating expenses were $4,260.7 million, a 4.2% increase over the comparable 2022 period. The increase in our non-GAAP operating expenses was primarily driven by higher costs across compensation and benefits, accrued carried interest related compensation expense, technology, facility, advertising, and professional fees. These increases were offset in part by higher capitalized labor, lower stock-based compensation, and a non-recurring recovery of general and administrative costs incurred in 2022. \nOperating margin\n was 30.7% in 2023, compared to 36.6% in 2022. The decrease in our operating margin in 2023 compared to 2022 is primarily driven by a decrease in investment advisory fees as a result of lower average assets under management and higher operating expenses. \nPage 37\nTable of Contents\n            \n    \nDiluted earnings per share.\n Diluted earnings per share was $7.76 in 2023 compared to $6.70 in 2022. The increase in 2023 GAAP basis diluted earnings per share from 2022 was primarily due to net investment income in 2023 compared to net investment losses in 2022. These increases were partially offset by lower operating income and a higher effective tax rate. \nOn a non-GAAP basis, diluted earnings per share was $7.59 in 2023 compared to $8.02 in 2022. The decrease in 2023 was primarily due to lower operating income and a higher effective tax rate. These decreases were offset by net investment income earned on our cash and discretionary investment portfolio in 2023 compared to net investment losses in 2022. \nSee our non-GAAP reconciliations later in this Management's Discussion and Analysis section. \nNet revenues\n2024 compared to 2023\n2023 compared to 2022\n(in millions)\n2024\n2023\n2022\n$ Change\n% Change\n(1)\n$ Change\n% Change\n(1)\nInvestment advisory fees\n(2)\nEquity\n$\n3,864.7 \n$\n3,442.3 \n$\n3,758.4 \n$\n422.4 \n12.3 \n%\n$\n(316.1)\n(8.4)\n%\nFixed income, including money markets\n410.7 \n400.4 \n426.3 \n10.3 \n2.6 \n%\n(25.9)\n(6.1)\n%\nMulti-asset\n1,814.1 \n1,583.4 \n1,508.9 \n230.7 \n14.6 \n%\n74.5 \n4.9 \n%\nAlternatives\n310.2 \n283.4 \n269.1 \n26.8 \n9.5 \n%\n14.3 \n5.3 \n%\n6,399.7 \n5,709.5 \n5,962.7 \n690.2 \n12.1 \n%\n(253.2)\n(4.2)\n%\nPerformance-based advisory fees\n(2)\n59.3 \n38.2 \n6.4 \n21.1 \n55.2 \n%\n31.8 \nn/m\nCapital allocation-based income\n46.6 \n161.9 \n(54.3)\n(115.3)\nn/m\n216.2 \nn/m\nAdministrative, distribution, and servicing fees\nAdministrative fees\n498.8 \n467.5 \n481.4 \n31.3 \n6.7 \n%\n(13.9)\n(2.9)\n%\nDistribution and servicing fees\n89.2 \n83.4 \n92.2 \n5.8 \n7.0 \n%\n(8.8)\n(9.5)\n%\n588.0 \n550.9 \n573.6 \n37.1 \n6.7 \n%\n(22.7)\n(4.0)\n%\nNet revenues\n$\n7,093.6 \n$\n6,460.5 \n$\n6,488.4 \n$\n633.1 \n9.8 \n%\n$\n(27.9)\n(0.4)\n%\nAverage AUM (in billions):\nEquity\n$\n804.3 \n$\n705.2 \n$\n763.6 \n$\n99.1 \n14.1 \n%\n$\n(58.4)\n(7.6)\n%\nFixed income, including money market\n178.6 \n169.3 \n173.4 \n9.3 \n5.5 \n%\n(4.1)\n(2.4)\n%\nMulti-asset\n529.0 \n442.3 \n418.7 \n86.7 \n19.6 \n%\n23.6 \n5.6 \n%\nAlternatives\n50.0 \n45.5 \n42.7 \n4.5 \n9.9 \n%\n2.8 \n6.6 \n%\nAverage AUM\n$\n1,561.9 \n$\n1,362.3 \n$\n1,398.4 \n$\n199.6 \n14.7 \n%\n$\n(36.1)\n(2.6)\n%\nEnding AUM (in billions)\n$\n1,606.6 \n$\n1,444.5 \n$\n1,274.7 \n$\n162.1 \n11.2 \n%\n$\n169.8 \n13.3 \n%\n(1)\n n/m - the percentage change is not meaningful.\n(2) \nPerformance-based advisory fees were previously included in investment advisory fees. Prior periods were recast to reflect this change.\nInvestment advisory fees.\n The relationship between the change in average assets under management and the change in investment advisory fees for 2024, 2023 and 2022 are presented above. \nIn 2024, the increase in investment advisory fees was due to higher average AUM as stronger market returns and appreciation were offset by net outflows over the last two years.\nIn 2023, the decline in overall advisory revenues was driven by lower average AUM and a mix shift toward lower fee asset classes and vehicles. A lower starting AUM and net outflows in 2023 were the primary drivers of a lower average AUM in 2023. These impacts were partially offset by stronger overall market returns in 2023. \nPerformance-based advisory fees\n in each period were primarily related to alternative strategies.\nPage 38\nTable of Contents\n            \n    \nCapital allocation-based income\n increased net revenues by $46.6 million. The 2024 amount includes an increase of $134.1 million in accrued carried interest from investments in affiliated investment funds, partially offset by $87.5 million of non-cash amortization and impairments related to acquisition-date asset basis differences. Impairments recognized in 2024 were $36.6 million, and should market and performance conditions deteriorate, additional impairments may be recognized in future periods. The firm realized carried interest of $139.6 million compared to $109.8 million in the 2023 period. \nFor 2023, capital allocation-based income increased net revenues by $161.9 million. This amount includes an increase of $223.2 million in accrued carried interest, partially offset by $61.3 million of non-cash amortization and impairments related to the difference in the acquisition closing date fair value and the carrying value on the date they were acquired.\nA portion of the capital allocation-based income is passed through as compensation and recognized in compensation and related costs, with the unpaid amount reported as non-controlling interest on the consolidated balance sheet. In 2024, the compensation expense was $5.4 million, consisting of $42.5 million related to the accrued carried interest offset in part by $37.1 million in amortization and impairment charges. For 2023, we recognized compensation expense of $44.6 million, consisting of $70.0 million in compensation expense related to the accrued carried interest offset in part by $25.4 million in amortization and impairment charges. \nAdministrative, distribution, and servicing fees\n \nin 2024 were $588.0 million, an increase of $37.1 million compared to 2023. The increase was primarily driven by higher average assets on which we earn non-discretionary advisory services revenue and higher transfer agent servicing activities provided to the T. Rowe Price mutual funds. \nFor 2023, the decrease was primarily driven by lower transfer agent servicing activities provided to the T. Rowe Price mutual funds, and lower 12b-1 revenue earned from the Advisor and R share classes of the U.S. mutual funds as a result of lower average assets under management in these share classes. The decrease in 12b-1 revenue was offset entirely by a decrease in the costs paid to third-party intermediaries that source these assets and is reported in distribution and servicing expense. \nNet revenues are presented after the elimination of $3.6 million for 2024, $2.1 million for 2023, and $2.0 million for 2022, earned from our consolidated investment products. The corresponding expenses recognized by these consolidated investment products were also eliminated from operating expenses.\nPage 39\nTable of Contents\n            \n    \nOperating expenses\n \n2024 compared to 2023\n2023 compared to 2022\n(in millions)\n2024\n2023\n2022\n$ Change\n% Change\n$ Change\n% Change\nCompensation, benefits, and related costs\n$\n2,603.4 \n$\n2,450.7 \n$\n2,405.8 \n$\n152.7 \n6.2 \n%\n$\n44.9 \n1.9 \n%\nAcquisition-related retention agreements\n44.8 \n55.0 \n70.2 \n(10.2)\n(18.5)\n%\n(15.2)\n(21.7)\n%\nCapital allocation-based income compensation\n5.4 \n44.6 \n(22.9)\n(39.2)\nn/m\n67.5 \nn/m\nDeferred compensation liabilities\n104.3 \n123.2 \n(132.3)\n(18.9)\n(15.3)\n%\n255.5 \nn/m\nCompensation and related costs\n2,757.9 \n2,673.5 \n2,320.8 \n84.4 \n3.2 \n%\n352.7 \n15.2 \n%\nDistribution and servicing costs\n354.1 \n289.9 \n301.5 \n64.2 \n22.1 \n%\n(11.6)\n(3.8)\n%\nAdvertising and promotion\n129.6 \n114.2 \n97.3 \n15.4 \n13.5 \n%\n16.9 \n17.4 \n%\nProduct and recordkeeping related costs\n297.5 \n291.0 \n300.1 \n6.5 \n2.2 \n%\n(9.1)\n(3.0)\n%\nTechnology, occupancy, and facility costs\n644.1 \n632.6 \n560.5 \n11.5 \n1.8 \n%\n72.1 \n12.9 \n%\nGeneral, administrative, and other\n433.8 \n421.3 \n412.2 \n12.5 \n3.0 \n%\n9.1 \n2.2 \n%\nChange in fair value of contingent consideration\n(13.4)\n(82.4)\n(161.2)\n69.0 \n(83.7)\n%\n78.8 \n(48.9)\n%\nAcquisition-related amortization and impairment costs\n156.7 \n134.2 \n283.5 \n22.5 \n16.8 \n%\n(149.3)\n(52.7)\n%\nTotal operating expenses\n$\n4,760.3 \n$\n4,474.3 \n$\n4,114.7 \n$\n286.0 \n6.4 \n%\n$\n359.6 \n8.7 \n%\nTotal adjusted operating expenses\n(1)\n$\n4,498.8 \n$\n4,260.7 \n$\n4,087.8 \n$\n238.1 \n5.6 \n%\n$\n172.9 \n4.2 \n%\n(1) \nSee the reconciliation to the comparable U.S. GAAP measures at the end of the Results of Operations section of this Management's Discussion and Analysis. \nCompensation, benefits and related costs\n \nwere $2,603.4 million, an increase of $152.7 million, or 6.2%, compared to 2023. The increase was driven by a higher bonus pool on an increase in revenue and higher salaries and related benefits partially offset by higher capitalized labor and lower other employee related costs. The firm employed 8,158 associates at December 31, 2024, an increase of 3.2% from the end of 2023. \nFor 2023, compensation, benefits and related costs were $2,450.7 million, an increase of $44.9 million, or 1.9%, compared to 2022. The increase was driven by $99.1 million in higher salaries and related benefits as a result of base salary increases in January 2023 and July 2022. These increases were offset by higher capitalized labor, lower non-cash stock-based compensation, and lower other employee-related costs.\nDistribution and servicing costs\n were $354.1 million for 2024, an increase of $64.2 million, or 22.1%, compared to $289.9 million in 2023. The increase was primarily driven by higher average assets under management distributed through intermediaries.\nFor 2023, distribution and services costs were $289.9 million, a decrease of $11.6 million, or 3.8%, compared to 2022. The decrease was primarily driven by lower average assets under management in certain share classes of the U.S. mutual funds that earn 12b-1 fees and SICAVs. These decreases were partially offset by higher costs incurred to distribute certain products through U.S. intermediaries as the average assets under management in these products were higher.\nThe costs in this expense category primarily include amounts paid to third-party intermediaries that source the assets of certain share classes of our U.S. mutual funds, ETFs and our international products, such as our Japanese ITMs and SICAVs. These costs were offset entirely by the distribution revenue we earn and report in net revenues: 12b-1 revenue is recognized in administrative, distribution, and servicing fees for the Advisor and R share classes of the U.S. mutual funds and investment advisory fees for our international products. \nAdvertising and promotion costs\n were $129.6 million for 2024, an increase of $15.4 million, or 13.5%, compared to 2023. The increase was primarily driven by higher media advertising.\nFor 2023, advertising and promotion costs were $114.2 million, an increase of $16.9 million, or 17.4%, compared to 2022. The increase was primarily driven by higher media advertising and agency costs in 2023.\nPage 40\nTable of Contents\n            \n    \nProduct and recordkeeping related costs\n were $297.5 million for 2024, an increase of $6.5 million, or 2.2%, compared to 2023. The increase was primarily driven by higher product related costs to be reimbursed from our sponsored investment products partially offset by lower recordkeeping related costs.\nFor 2023, product and recordkeeping related costs were $291.0 million for 2023, a decrease of $9.1 million, or 3.0%, compared to 2022. The decrease was driven by lower recordkeeping related costs.\nTechnology, occupancy, and facility costs\n were $644.1 million for 2024, an increase of $11.5 million or 1.8%, compared to 2023. The increase was due to ongoing investment in our technology capabilities, primarily hosted solutions, partially offset by lower facility costs as 2023 included the rent cost of two London facilities until we occupied our new building in September 2023.\nFor 2023, technology, occupancy, and facility costs were $632.6 million, an increase of $72.1 million or 12.9%, compared to 2022. The increase was primarily due to ongoing investment in our technology capabilities, including depreciation and hosting solution licenses, and increased office facility costs, mainly related to rent expense associated with a new London office that we began leasing in the second half of 2022 and occupied in September 2023. \nGeneral, administrative, and other costs\n were $433.8 million for 2024, an increase of $12.5 million or 3.0%, compared to 2023. The increase was primarily due to a cost recovery recognized in 2023 that did not recur in 2024, higher professional fees and travel costs. These increases were partially offset by lower external research fees and other general and administrative costs. In 2024, the firm changed its approach to paying for external research, consistent with regulations and general industry practice.\nFor 2023, general, administrative, and other costs were $421.3 million, an increase of $9.1 million or 2.2% compared to 2022. The increase was primarily due to higher professional fees and travel costs, partially offset by a $20.8 million recovery of nonrecurring costs that were incurred in 2022.\nChange in fair value of contingent consideration.\n Our contingent consideration consists of an earnout arrangement as part of the 2021 acquisition of OHA in which additional purchase price may be due to the sellers upon satisfying or exceeding certain defined revenue targets. Each reporting period, we record the fair value of the contingent consideration due under this arrangement. Reduced revenue expectations have resulted in a reduction in the fair value of the contingent consideration liability of $13.4 million in 2024, $82.4 million in 2023, and $161.2 million in 2022. The fair value of the contingent consideration liability as of December 31, 2024 is zero.\nAcquisition-related amortization and impairment costs\n primarily relate to the indefinite- and definite-lived intangible assets identified and separately recognized, at fair value, on acquisition date. In 2024, we recognized acquisition-related amortization and impairment costs of $156.7 million, an increase of $22.5 million or 16.8%, compared to 2023. The increase was primarily driven by impairment charges related to the trade name intangible asset. \nFor 2023, we recognized acquisition-related amortization and impairment costs of $134.2 million, a decrease of $149.3 million, compared to 2022. The decrease was primarily driven by an insignificant amount of impairment charges in 2023 for certain intangibles compared to $175.1 million in 2022.\nThe impairment charges for both periods were the result of reduced growth expectations for both investment management and incentive fees and higher discount rate compared to when the acquisition closed in 2021. \nThe remaining weighted average amortization period for our definite-lived intangible assets is 3.7 years. Should conditions that led us to recognize these impairment charges worsen, additional impairments may be recognized in future periods.\nPage 41\nTable of Contents\n            \n    \nNon-operating income (loss)\n \nNon-operating income was $486.3 million in 2024 compared to $504.1 million in 2023 and a non-operating loss of $425.5 million in 2022. Non-operating activity for the years ended December 31, 2024, 2023 and 2022 are as follows: \n2024 compared to 2023\n2023 compared to 2022\n(in millions)\n2024\n2023\n2022\n$ Change\n$ Change\nNet gains (losses) from non-consolidated sponsored investment products\nCash and discretionary investments \nDividend income\n$\n138.6 \n$\n109.1 \n$\n34.7 \n$\n29.5 \n$\n74.4 \nMarket related gains (losses) and equity in earnings (losses)\n4.8 \n24.5 \n(59.1)\n(19.7)\n83.6 \nTotal cash and discretionary investments\n143.4\n \n133.6\n \n(24.4)\n9.8\n \n158.0\n \nSeed capital investments \nDividend income\n2.4 \n1.8 \n0.8 \n0.6 \n1.0 \nMarket related gains (losses) and equity in earnings (losses)\n62.0 \n50.3 \n(60.1)\n11.7 \n110.4 \nTotal seed capital investments\n64.4\n \n52.1\n \n(59.3)\n12.3\n \n111.4\n \nTotal cash, discretionary, and seed investments\n207.8\n \n185.7\n \n(83.7)\n22.1\n \n269.4\n \nNet gains recognized upon deconsolidation\n(0.4)\n— \n3.0 \n(0.4)\n(3.0)\nInvestments used to hedge the deferred compensation liabilities\n96.4 \n123.6 \n(139.4)\n(27.2)\n263.0 \nTotal net gains (losses) from non-consolidated investment products\n303.8\n \n309.3\n \n(220.1)\n(5.5)\n529.4\n \nOther investment income\n59.4 \n45.9 \n15.4 \n13.5 \n30.5 \nNet gains (losses) on investments\n363.2\n \n355.2\n \n(204.7)\n8.0\n \n559.9\n \nNet gains (losses) on consolidated investment portfolios\n130.3 \n164.6 \n(203.5)\n(34.3)\n368.1 \nOther losses, including foreign currency losses\n(7.2)\n(15.7)\n(17.3)\n8.5 \n1.6 \nNon-operating income (loss)\n$\n486.3\n \n$\n504.1\n \n$\n(425.5)\n$\n(17.8)\n$\n929.6\n \nAdjusted non-operating income (loss)\n(1)\n$\n148.7\n \n$\n140.8\n \n$\n(24.4)\n$\n7.9\n \n$\n165.2\n \n(1) \nSee the reconciliation to the comparable U.S. GAAP measures at the end of the Results of Operations section of this Management's Discussion and Analysis. \nIn 2024 and 2023, strong market returns contributed to the increased valuation and gains of our investment portfolio, along with higher cash balances and interest rates increased dividend income. In 2022, our overall investment portfolio valuations were negatively impacted by market declines caused by the continued elevated inflation, supply chain disruptions, and a more aggressive pace of Federal Reserve interest rate increases.\nPage 42\nTable of Contents\n            \n    \nThe impact of consolidating investment products on the individual lines of our consolidated statements of income for 2024, 2023, and 2022 is as follows:\n2024 compared to 2023\n2023 compared to 2022\n(in millions)\n2024\n2023\n2022\n$ Change\n$ Change\nOperating expenses reflected in net operating income\n$\n(9.8)\n$\n(11.1)\n$\n(8.2)\n$\n1.3 \n$\n(2.9)\nNet investment income (loss) reflected in non-operating income\n130.3 \n164.6 \n(203.5)\n(34.3)\n368.1 \nImpact on income before taxes\n$\n120.5 \n$\n153.5 \n$\n(211.7)\n$\n(33.0)\n$\n365.2 \nNet income (loss) attributable to our interest in the consolidated investment products\n$\n84.8 \n$\n106.5 \n$\n(103.4)\n$\n(21.7)\n$\n209.9 \nNet income (loss) attributable to redeemable non-controlling interests (unrelated third-party investors)\n35.7 \n47.0 \n(108.3)\n(11.3)\n155.3 \nImpact on income before taxes\n$\n120.5 \n$\n153.5 \n$\n(211.7)\n$\n(33.0)\n$\n365.2 \nProvision for income taxes\nThe following table reconciles the statutory federal income tax rate to our effective tax rate for the years ended December 31, 2024, 2023, and 2022:\n2024\n2023\n2022\nStatutory U.S. federal income tax rate\n21.0 \n%\n21.0 \n%\n21.0 \n%\nState income taxes for current year, net of federal income tax benefits\n(1)\n2.9 \n2.3 \n3.4 \nNet income attributable to redeemable non-controlling interests\n(2)\n \n(0.3)\n(0.5)\n1.3 \nNet excess tax benefits from stock-based compensation plans activity\n(0.2)\n0.1 \n(0.4)\nValuation allowance\n0.2 \n3.4 \n— \nOther items\n0.7 \n— \n0.3 \nEffective income tax rate\n24.3 \n%\n26.3 \n%\n25.6 \n%\n(1) \nState income tax benefits are reflected in the total benefits for net income attributable to redeemable non-controlling interests and stock-based compensation plans activity.\n(2)    \nNet income attributable to redeemable non-controlling interests represents the portion of earnings held in the firm's consolidated investment products, which are not taxable to the firm despite being included in pre-tax income.\nOur effective tax rate for 2024 was 24.3%, compared to 26.3% for 2023 and 25.6% for 2022. The decrease in our effective tax rate in 2024 from 2023 was primarily due to lower valuation allowances recognized in 2024. These favorable impacts were slightly offset by higher state taxes.\nFor 2023, the increase in our effective tax rate from 2022 was primarily due to an increase in the valuation allowances recorded mainly against UK-based deferred tax assets, including net operating losses, and a decrease in discrete tax benefits associated with option exercises and restricted stock vests. These unfavorable impacts were partially offset by a favorable impact of net gains attributable to redeemable non-controlling interests held in our consolidated investment products and state tax liability settlements.\nThe non-GAAP tax rate primarily adjusts for the impact of the consolidated investment products, including net income attributable to redeemable non-controlling interests. Our non-GAAP effective tax rates were 24.5% for 2024\n,\n 27.2% for 2023, and 24.7% for 2022\n. \nPage 43\nTable of Contents\n            \n    \nOur effective tax rate will continue to experience volatility in future periods due to, among other things, the impact on the stock-based compensation tax benefits recognized from market fluctuations in our stock price and timing of option exercises, changes in the mix of our earnings among countries with differing tax laws, and changes in the valuation allowance of foreign-based deferred tax assets. As of December 31, 2024, the total valuation allowance recorded was $118.9 million, of which nearly all is related to UK-based deferred tax assets. We intend to continue maintaining a full valuation allowance on these and future deferred tax assets until there is sufficient evidence to support the reversal of all or some portion of these allowances. Our U.S. GAAP effective tax rate is also impacted by changes in the proportion of net income that is attributable to our redeemable non-controlling interests, non-controlling interests reflected in permanent equity and the remeasurement of the contingent consideration liability. \nWe currently estimate our effective tax rates for the full-year 2025 will be in the range of 23.0% to 27.0% on a GAAP basis, and 23.0% to 26.0% on a non-GAAP basis. \nThe Organization of Economic Co-operation and Development has issued Pillar Two Model Rules (Pillar Two) introducing a global 15% minimum tax effective January 1, 2024 within certain countries where we operate. For countries that have adopted Pillar Two in 2024, it did not have a material impact on the company's consolidated results of operations, cash flows, and overall financial position. We will continue to monitor and evaluate the impacts of future Pillar Two legislation proposed or enacted in jurisdictions that have not yet adopted the rules. \nNON-GAAP INFORMATION AND RECONCILIATION.\nWe believe the non-GAAP financial measures below provide relevant and meaningful information to investors about our core operating results. These measures have been established in order to increase transparency for the purpose of evaluating our core business, for comparing current results with prior period results, and to enable more appropriate comparison with industry peers. However, non-GAAP financial measures should not be considered a substitute for financial measures calculated in accordance with U.S. GAAP and may be calculated differently by other companies. \nThe following schedules reconcile certain U.S. GAAP financial measures for each of the last three years.\n2024\n(in millions, except per-share amount)\nOperating expenses\nNet operating income\nNon-operating income (loss)\nProvision (benefit) for income taxes\n(6)\nNet income attributable to T. Rowe Price Group, Inc.\nDiluted earnings per share\n(7)\nU.S. GAAP Basis (FS line item)\n$\n4,760.3 \n$\n2,333.3 \n$\n486.3 \n$\n683.8 \n$\n2,100.1 \n$\n9.15 \nNon-GAAP adjustments:\nAcquisition-related:\nInvestment and NCI amortization and impairments\n(1)\n (Capital allocation-based income and Compensation and related costs)\n37.1 \n50.4 \n— \n10.2 \n40.2 \n0.18 \nAcquisition-related retention arrangements\n(1) \n(Compensation and related costs)\n(44.8)\n44.8 \n— \n10.4 \n34.4 \n0.15 \nContingent consideration\n(1)\n \n13.4 \n(13.4)\n— \n(1.8)\n(11.6)\n(0.05)\nIntangible assets amortization and impairments\n(1)\n \n(156.7)\n156.7 \n— \n32.2 \n124.5 \n0.54 \nTotal acquisition-related\n(151.0)\n238.5 \n— \n51.0 \n187.5 \n0.82 \nDeferred compensation liabilities\n(3) \n(Compensation and related costs)\n(104.3)\n104.3 \n(96.4)\n1.7 \n6.2 \n0.03 \nConsolidated investment products\n(4)\n(6.2)\n9.8 \n(130.3)\n(17.5)\n(67.3)\n(0.29)\nOther non-operating income\n(5)\n— \n— \n(110.9)\n(23.9)\n(87.0)\n(0.38)\nAdjusted Non-GAAP Basis\n$\n4,498.8 \n$\n2,685.9 \n$\n148.7 \n$\n695.1 \n$\n2,139.5 \n$\n9.33 \nPage 44\nTable of Contents\n            \n    \n2023\n(in millions, except per-share amount)\nOperating expenses\nNet operating income\nNon-operating income (loss)\nProvision (benefit) for income taxes\n(6)\nNet income attributable to T. Rowe Price Group, Inc.\nDiluted earnings per share\n(7)\nU.S. GAAP Basis (FS line item)\n$\n4,474.3 \n$\n1,986.2 \n$\n504.1 \n$\n654.6 \n$\n1,788.7 \n$\n7.76 \nNon-GAAP adjustments:\nAcquisition-related:\nInvestment and NCI amortization and impairments\n(1)\n (Capital allocation-based income and Compensation and related costs)\n25.4 \n35.9 \n— \n7.9 \n28.0 \n0.12 \nAcquisition-related retention arrangements\n(1) \n(Compensation and related costs)\n(55.0)\n55.0 \n— \n10.8 \n44.2 \n0.19 \nContingent consideration\n(1)\n \n82.4 \n(82.4)\n— \n(10.6)\n(71.8)\n(0.31)\nIntangible assets amortization and impairments\n(1)\n \n(134.2)\n134.2 \n— \n28.8 \n105.4 \n0.46 \nTotal acquisition-related\n(81.4)\n142.7 \n— \n36.9 \n105.8 \n0.46 \nDeferred compensation liabilities\n(3) \n(Compensation and related costs)\n(123.2)\n123.2 \n(123.6)\n0.5 \n(0.9)\n— \nConsolidated investment products\n(4)\n(9.0)\n11.1 \n(164.6)\n(22.3)\n(84.2)\n(0.37)\nOther non-operating income\n(5)\n— \n— \n(75.1)\n(15.8)\n(59.3)\n(0.26)\nAdjusted Non-GAAP Basis\n$\n4,260.7 \n$\n2,263.2 \n$\n140.8 \n$\n653.9 \n$\n1,750.1 \n$\n7.59 \n2022\n(in millions, except per-share amount)\nOperating expenses\nNet operating income\nNon-operating income (loss)\nProvision (benefit) for income taxes\n(6)\nNet income attributable to T. Rowe Price Group, Inc.\nDiluted earnings per share\n(7)\nU.S. GAAP Basis (FS line item)\n$\n4,114.7 \n$\n2,373.7 \n$\n(425.5)\n$\n498.6 \n$\n1,557.9 \n$\n6.70 \nNon-GAAP adjustments:\nAcquisition-related:\nInvestment and NCI amortization and impairments\n(1)\n (Capital allocation-based income and Compensation and related costs)\n40.5 \n57.5 \n— \n15.5 \n42.0 \n0.18 \nAcquisition-related retention arrangements\n(1) \n(Compensation and related costs)\n(70.2)\n70.2 \n— \n18.9 \n51.3 \n0.22 \nContingent consideration\n(1)\n \n161.2 \n(161.2)\n— \n(43.3)\n(117.9)\n(0.52)\nIntangible assets amortization and impairments\n(1)\n \n(283.5)\n283.5 \n— \n76.2 \n207.3 \n0.89 \nTransaction costs\n(2)\n (General, administrative and other)\n(0.9)\n0.9 \n— \n0.2 \n0.7 \n0.01 \nTotal acquisition-related\n(152.9)\n— \n250.9 \n— \n— \n— \n67.5 \n— \n183.4 \n— \n0.78 \nDeferred compensation liabilities\n(3) \n(Compensation and related costs)\n132.3 \n(132.3)\n139.4 \n1.9 \n5.2 \n0.02 \nConsolidated investment products\n(4)\n(6.3)\n8.2 \n203.5 \n27.8 \n75.6 \n0.33 \nOther non-operating income\n(5)\n— \n— \n58.2 \n15.5 \n42.7 \n0.19 \nAdjusted Non-GAAP Basis\n$\n4,087.8 \n$\n2,500.5 \n$\n(24.4)\n$\n611.3 \n$\n1,864.8 \n$\n8.02 \n(1)\n    \nThese non-GAAP adjustments remove the impact of acquisition-related amortization and costs, including amortization of intangible assets, the recurring fair value remeasurements of the contingent consideration liability, amortization of acquired investment and non-controlling interest basis differences and amortization of compensation-related arrangements. We believe adjusting for these charges helps the reader's ability to understand our core operating results and increases comparability period to period.\nPage 45\nTable of Contents\n            \n    \n(2)\n    This non-GAAP adjustment removes acquisition-related transactions costs. We believe adjusting for these charges helps the reader's ability to understand our core operating results and increases comparability period to period.\n(3)\n    \nThis non-GAAP adjustment removes the compensation expense impact from market valuation changes in the deferred compensation liabilities, which include the supplemental savings plan and, beginning in the fourth quarter of 2024, restricted fund units, and the related net gains (losses) on investments designated as economic hedges against the related liabilities. The liabilities are adjusted for appreciation (depreciation) of hypothetical investments chosen by participants. We use investment products to economically hedge the market risk associated with the supplemental savings plan liability and the expected settlement value of unvested restricted fund units. We believe it is useful to offset the non-operating investment income (loss) recognized on the economic hedges against the related compensation expense and remove the net impact to help the reader's ability to understand the firm's core operating results and to increase comparability period to period.\n(4)\n    \nThis non-GAAP adjustment removes the impact the consolidated investment products have on our U.S. GAAP consolidated statements of income. Specifically, we add back the operating expenses and subtract the investment income of the consolidated investment products. The adjustment to operating expenses represents the operating expenses of the consolidated investment products, net of the elimination of related investment advisory and administrative fees. The adjustment to net income attributable to T. Rowe Price Group, Inc. represents the net income of the consolidated investment products, net of redeemable non-controlling interests. We believe adjusting for the impact of the consolidated investment products helps the reader’s ability to understand our core operating results and increases comparability period to period. \n(5)\n    \nThis non-GAAP adjustment represents non-operating income (loss) and the net gains (losses) earned on the firm's investment portfolio that are not designated as economic hedges of the deferred compensation liabilities and that are not part of the cash and discretionary investment portfolio. We retain in our non-GAAP measures the investment gains recognized on the cash and discretionary investments as these assets and related income (loss) are considered part of the firm's core operations. We believe adjusting for the remaining non-operating income (loss) helps the reader’s ability to understand the firm's core operating results and increases comparability period to period. Additionally, we do not emphasize the impact of this portion of non-operating income (loss) when managing and evaluating the firm's performance.\n(6)\n    \nThe income tax impacts were calculated in order to achieve an overall non-GAAP effective tax rate of 24.5% for 2024, 27.2% for 2023 and 24.7% for 2022. \n(7)\n    This non-GAAP measure was calculated by applying the two-class method to adjusted net income attributable to \n    T. Rowe Price Group and dividing by the weighted-average common shares outstanding assuming dilution. The calculation of net income allocated to common stockholders is as follows:\nYear ended\n(in millions)\n2024\n2023\n2022\nAdjusted net income attributable to T. Rowe Price Group\n$\n2,139.5 \n$\n1,750.1 \n$\n1,864.8 \nLess: net income allocated to outstanding restricted stock and stock unit holders\n56.8 \n43.4 \n43.3 \nAdjusted net income allocated to common stockholders\n$\n2,082.7 \n$\n1,706.7 \n$\n1,821.5 \nCAPITAL RESOURCES AND LIQUIDITY.\nDuring 2024, stockholders’ equity attributable to T. Rowe Price Group, Inc. increased from $9.5 billion to $10.3 billion, and tangible book value increased to $7.5 billion at December 31, 2024 from $6.5 billion at December 31, 2023.\nSources of Liquidity\nWe have ample liquidity, including cash and investments in T. Rowe Price products as follows: \n(in millions)\n12/31/2024\n12/31/2023\nCash and cash equivalents\n$\n2,649.8 \n$\n2,066.6 \nDiscretionary investments\n457.1 \n463.7 \nTotal cash and discretionary investments\n3,106.9 \n2,530.3 \nRedeemable seed capital investments\n1,262.3 \n1,370.9 \nInvestments used to hedge the deferred compensation liabilities\n1,110.9 \n894.6 \nTotal cash and investments in T. Rowe Price products\n$\n5,480.1 \n$\n4,795.8 \nPage 46\nTable of Contents\n            \n    \nOur discretionary investment portfolio is comprised primarily of short duration fixed income ETFs, which typically yield higher than money market rates. Of our cash and cash equivalents, $653.9 million at December 31, 2024, and $699.0 million at December 31, 2023 were held by our subsidiaries located outside the U.S. Our cash and discretionary investment portfolio experienced market gains of $148.7 million in 2024 and $140.8 million in 2023. Given the availability of our financial resources and cash expected to be generated through future operations, we do not maintain an available external source of additional liquidity. \nOur seed capital investments are redeemable, although we generally expect to be invested for several years for the products to build an investment performance history and until unrelated third-party investors substantially reduce our relative ownership percentage. \nThe cash and investment presentation on the consolidated balance sheet is based on how we account for the cash or investment. The following table details how our interests in cash and investments relate to where they are presented in the consolidated balance sheet as of December 31, 2024.\n(in millions)\nCash and cash equivalents\nInvestments\nNet assets of consolidated investment products\n(1)\nTotal\nCash and discretionary investments\n$\n2,649.8 \n$\n319.6 \n$\n137.5 \n$\n3,106.9 \nSeed capital investments\n— \n391.6 \n870.7 \n1,262.3 \nInvestments used to hedge the deferred compensation liabilities\n— \n1,081.2 \n29.7 \n1,110.9 \nTotal cash and investments in T. Rowe Price products attributable to T. Rowe Price Group, Inc.\n2,649.8 \n1,792.4 \n1,037.9 \n5,480.1 \nInvestments in affiliated private investment funds\n(2)\n— \n696.8 \n— \n696.8 \nInvestments in CLOs\n— \n67.4 \n— \n67.4 \nInvestment in UTI and other investments\n— \n443.9 \n— \n443.9 \nTotal cash and investments attributable to T. Rowe Price Group, Inc.\n2,649.8 \n3,000.5 \n1,037.9 \n6,688.2 \nRedeemable non-controlling interests\n— \n— \n944.0 \n944.0 \nAs reported on consolidated balance sheet at \nDecember 31, 2024\n$\n2,649.8 \n$\n3,000.5 \n$\n1,981.9 \n$\n7,632.2 \n(1)\nThe \nc\nonsolidated investment products are generally those products we provided seed capital at the time of their formation and we have a controlling interest. The $1,037.9 million represents the total value at December 31, 2024 of our interest in the consolidated investment products. The total net assets of the investment products at December 31, 2024 of $1,981.9 million includes assets of $2,044.0 million, less liabilities of $62.1 million as reflected in the consolidated balance sheet in Item 8. Financial Statements of this Form 10-K. \n(2)\n    Includes $160.7 million of non-controlling interests in consolidated entities and represents the portion of these investments, held by third parties, that we cannot sell in order to obtain cash for general operations.\nOur consolidated balance sheet reflects the assets and liabilities of those investment products we consolidate, as well as redeemable non-controlling interests for the portion of these investment products that are held by unrelated third-party investors. Although we can redeem our net interest in these investment products at any time, we cannot directly access or sell the assets held by the products to obtain cash for general operations. Additionally, the assets of these investment products are not available to our general creditors. Our interest in these investment products was primarily used as initial seed capital and is recategorized as discretionary when it is determined by management that the seed capital is no longer needed. We assess the discretionary products and, when we decide to liquidate our interest, we seek to do so in a way as to not impact the product and, ultimately, the unrelated third-party investors.\nUses of Liquidity\nWe paid $4.96 per share in regular dividends in 2024, an increase of 1.6% over the $4.88 per share paid in 2023. Further, we expended $334.5 million in 2024 to repurchase nearly 3.0 million shares, or 1.3%, of our outstanding common stock at an average price of $112.57 per share. These dividends and repurchases were expended using existing cash balances and cash generated from operations. We generally repurchase our common stock over time to offset the dilution created by our equity-based compensation plans. \nPage 47\nTable of Contents\n            \n    \nSince the end of 2021, we have returned $4.8 billion to stockholders through stock repurchases and our regular quarterly dividends, as follows: \n(in millions)\nRecurring dividend\nStock repurchases\nTotal cash returned to stockholders\n2022\n$\n1,108.8 \n$\n855.3 \n$\n1,964.1 \n2023\n1,121.9 \n254.3 \n1,376.2 \n2024\n1,135.2 \n334.5 \n1,469.7 \nTotal\n$\n3,365.9 \n$\n1,444.1 \n$\n4,810.0 \nWe anticipate property and equipment expenditures for the full-year 2025 to be about $300 million, of which more than three-quarters is planned for technology initiatives. We expect to fund our anticipated capital expenditures with operating cash flows and other available resources.\nThe following tables summarize the cash flows for 2024, 2023 and 2022, that are attributable to T. Rowe Price Group Inc., our consolidated investment products, and the related eliminations required in preparing the consolidated statement of cash flows.\n2024\n(in millions)\nCash flow attributable to T. Rowe Price Group, Inc.\nCash flow attributable to consolidated investment products\nEliminations\nAs reported \nCash flows from operating activities\nNet income (loss)\n$\n2,100.1 \n$\n120.5 \n$\n(84.8)\n$\n2,135.8 \nAdjustments to reconcile net income (loss) to net cash provided by (used in) operating activities\nDepreciation, amortization and impairments of property, equipment and software\n254.1 \n— \n— \n254.1 \nAmortization and impairment of acquisition-related assets and retention agreements\n250.1 \n— \n— \n250.1 \nFair value remeasurement of contingent consideration liability\n(13.4)\n— \n— \n(13.4)\nStock-based compensation expense\n247.3 \n— \n— \n247.3 \nNet (gains) losses recognized on investments\n(425.0)\n— \n84.8 \n(340.2)\nTotal non-cash adjustments\n313.1 \n— \n84.8 \n397.9 \nNet investments in sponsored investment products used to economically hedge deferred compensation liabilities\n(123.2)\n— \n30.0 \n(93.2)\nNet change in trading securities held by consolidated investment products\n— \n(760.4)\n— \n(760.4)\nOther changes\n23.9 \n6.1 \n(24.5)\n5.5 \nNet cash provided by (used in) operating activities\n2,313.9 \n(633.8)\n5.5 \n1,685.6 \nNet cash provided by (used in) investing activities\n(187.9)\n(15.8)\n26.2 \n(177.5)\nNet cash provided by (used in) financing activities\n(1,542.8)\n637.9 \n(31.7)\n(936.6)\nEffect of exchange rate changes on cash and cash equivalents of consolidated investment products\n— \n(2.4)\n— \n(2.4)\nNet change in cash and cash equivalents during year\n583.2 \n(14.1)\n— \n569.1 \nCash and cash equivalents at beginning of year\n2,066.6 \n77.2 \n— \n2,143.8 \nCash and cash equivalents at end of year\n$\n2,649.8 \n$\n63.1 \n$\n— \n$\n2,712.9 \nPage 48\nTable of Contents\n            \n    \n2023\n(in millions)\nCash flow attributable to T. Rowe Price Group, Inc.\nCash flow attributable to consolidated investment products\nEliminations\nAs reported\nCash flows from operating activities\nNet income (loss)\n$\n1,788.7 \n$\n153.5 \n$\n(106.5)\n$\n1,835.7 \nAdjustments to reconcile net income (loss) to net cash provided by (used in) operating activities\nDepreciation, amortization and impairments of property, equipment and software\n254.8 \n— \n— \n254.8 \nAmortization and impairment of acquisition-related assets and retention agreements\n226.8 \n— \n— \n226.8 \nFair value remeasurement of contingent consideration liability\n(82.4)\n— \n— \n(82.4)\nStock-based compensation expense\n265.6 \n— \n— \n265.6 \nNet (gains) losses recognized on investments\n(567.3)\n— \n106.5 \n(460.8)\nTotal non-cash adjustments\n97.5 \n— \n106.5 \n204.0 \nNet (investments) redemptions in sponsored investment products used to economically hedge deferred compensation liabilities\n(10.3)\n— \n66.4 \n56.1 \nNet change in trading securities held by consolidated investment products\n— \n(1,070.3)\n— \n(1,070.3)\nOther changes\n182.7 \n27.9 \n(17.0)\n193.6 \nNet cash provided by (used in) operating activities\n2,058.6 \n(888.9)\n49.4 \n1,219.1 \nNet cash provided by (used in) investing activities\n(310.2)\n(56.8)\n495.2 \n128.2 \nNet cash provided by (used in) financing activities\n(1,437.4)\n903.4 \n(544.6)\n(1,078.6)\nEffect of exchange rate changes on cash and cash equivalents of consolidated investment products\n— \n0.4 \n— \n0.4 \nNet change in cash and cash equivalents during year\n311.0 \n(41.9)\n— \n269.1 \nCash and cash equivalents at beginning of year\n1,755.6 \n119.1 \n— \n1,874.7 \nCash and cash equivalents at end of year\n$\n2,066.6 \n$\n77.2 \n$\n— \n$\n2,143.8 \nPage 49\nTable of Contents\n            \n    \n2022\n(in millions)\nCash flow attributable to T. Rowe Price Group, Inc.\nCash flow attributable to consolidated investment products\nEliminations\nAs reported\nCash flows from operating activities\nNet income (loss)\n$\n1,557.9 \n$\n(211.7)\n$\n103.4 \n$\n1,449.6 \nAdjustments to reconcile net income (loss) to net cash provided by (used in) operating activities\nDepreciation, amortization and impairments of property, equipment and software\n225.7 \n— \n— \n225.7 \nAmortization and impairment of acquisition-related assets and retention agreements\n420.1 \n— \n— \n420.1 \nFair value remeasurement of contingent consideration liability\n(161.2)\n— \n— \n(161.2)\nStock-based compensation expense\n285.4 \n— \n— \n285.4 \nNet (gains) losses recognized on investments\n314.0 \n— \n(103.4)\n210.6 \nTotal non-cash adjustments\n1,084.0 \n— \n(103.4)\n980.6 \nNet investments in sponsored investment products used to economically hedge deferred compensation liabilities\n(18.8)\n— \n— \n(18.8)\nNet change in trading securities held by consolidated investment products\n— \n87.9 \n— \n87.9 \nOther changes\n(182.8)\n46.6 \n(3.7)\n(139.9)\nNet cash provided by (used in) operating activities\n2,440.3 \n(77.2)\n(3.7)\n2,359.4 \nNet cash provided by (used in) investing activities\n(179.3)\n(8.7)\n146.5 \n(41.5)\nNet cash provided by (used in) financing activities\n(2,028.5)\n94.4 \n(142.8)\n(2,076.9)\nEffect of exchange rate changes on cash and cash equivalents of consolidated investment products\n— \n9.5 \n— \n9.5 \nNet change in cash and cash equivalents during year\n232.5 \n18.0 \n— \n250.5 \nCash and cash equivalents at beginning of year\n1,523.1 \n101.1 \n— \n1,624.2 \nCash and cash equivalents at end of year\n$\n1,755.6 \n$\n119.1 \n$\n— \n$\n1,874.7 \nOperating activities\nDuring 2024, operating activities attributable to T. Rowe Price Group, Inc. provided cash flows of $2,313.9 million, an increase of $255.3 million from $2,058.6 million provided during 2023. The increase was primarily driven by a $311.4 million increase in net income and a $215.6 million increase in the add-back for non-cash items as detailed in the 2024 table above. These increases to operating cash flows were offset in part by a $158.8 million decrease in cash flows related to timing differences associated with the cash settlement of our assets and liabilities. Additionally, in 2024, we made $112.9 million more net investments in sponsored investment products used to economically hedge our deferred compensation liabilities compared to 2023. The remaining change in reported cash flows from operating activities was attributable to the net change in trading securities held in our consolidated investment products’ underlying portfolios. \nDuring 2023, operating activities attributable to T. Rowe Price Group, Inc. provided cash flows of $2,058.6 million, a decrease of $381.7 million from $2,440.3 million provided during 2022. The decrease was primarily driven by a $986.5 million decrease in the add-back for non-cash items as detailed in the 2023 table above. These decreases to operating cash flows were offset in part by a $230.8 million increase in net income and $365.5 million increase in cash flows related to timing differences associated with the cash settlement of our assets and liabilities. Additionally, in 2023, we expended $8.5 million less in net investments in sponsored investment products used to economically hedge our deferred compensation liabilities compared to 2022. The remaining change in reported cash flows from operating activities was attributable to the net change in trading securities held in our consolidated investment products’ underlying portfolios. \n \nPage 50\nTable of Contents\n            \n    \nInvesting activities\nNet cash used in investing activities that are attributable to T. Rowe Price Group Inc. totaled $187.9 million in 2024 compared to $310.2 million in 2023. Net investing activities from our investments in sponsored investment products generated net proceeds of $407.1 million in 2024 compared to $36.1 million in 2023. In 2024, we increased our property and equipment expenditures by $115.5 million and our other investing activity by $133.2 million. We eliminate our capital in those investment products we consolidate in preparing our consolidated statements of cash flows. The remaining change in reported cash flows from investing activities of $41.0 million is related to the net cash removed from our balance sheet from consolidating and deconsolidating investment products.\nNet cash used in investing activities that are attributable to T. Rowe Price Group totaled $310.2 million in 2023 compared to $179.3 million in 2022. During 2023, net proceeds from the sale of investments of $36.1 million were lower compared to $62.0 million during 2022. In 2023, we increased our property and equipment expenditures by $70.3 million and our other investing activity by $34.7 million. We eliminate our capital in those investment products we consolidate in preparing our consolidated statements of cash flows. The remaining change in reported cash flows from investing activities of $48.1 million is primarily related to the net cash removed from our balance sheet from consolidating and deconsolidating investment products.\nFinancing Activities\nNet cash used in financing activities attributable to T. Rowe Price Group totaled $1,542.8 million in 2024 compared to $1,437.4 million in 2023. During 2024, we used $337.2 million to repurchase nearly 3.0 million shares compared to $254.4 million to repurchase 2.4 million shares in 2023. The $13.9 million increase in dividends paid in 2024 was a result of the 1.6% increase in our quarterly dividend per share. In addition, in 2024, net distributions to non-controlling interests in consolidated entities decreased by $6.6 million and cash flow related to common stock issued under stock compensation plans decreased by $15.3 million compared to 2023. The remaining change in reported cash flows from financing activities is attributable to a $247.4 million increase in net subscriptions from redeemable non-controlling interest holders of our consolidated investment products during 2024.\nNet cash used in financing activities attributable to T. Rowe Price Group totaled $1,437.4 million in 2023 compared to $2,028.5 million in 2022. During 2023, we used $254.4 million to repurchase 2.4 million shares compared to $849.8 million to repurchase 6.8 million shares in 2022. The $14.3 million increase in dividends paid in 2023 is a result of the 1.7% increase in our quarterly dividend per share in 2023. In addition, net distributions to non-controlling interests in consolidated entities increased by $8.2 million and cash flow related to common stock issued under stock compensation plans increased by $18.2 million during 2023 compared to 2022. The remaining change in reported cash flows from financing activities is primarily attributable to a $407.2 million increase in net subscriptions from redeemable non-controlling interest holders of our consolidated investment products during 2023.\nMATERIAL CASH COMMITMENTS.\nOur material cash commitments primarily include our obligations related to our deferred compensation liabilities, facility leases, our headquarters build out, and other contractual amounts that will be due for the purchase of goods or services to be used in our operations. Some of these contractual amounts may be cancellable under certain conditions and may involve termination fees. We expect to fund these cash commitments from future cash flows from operations.\nOur obligations under our deferred compensation liabilities are disclosed on our consolidated balance sheet with more information included in Note 12 and Note 17 to the consolidated financial statements. Our lease obligations are disclosed in Note 7 to the consolidated financial statements. Additionally, there are unrecognized tax benefits discussed in Note 10 to our consolidated financial statements. The note references above are in Item 8. of this Form 10-K.\nWhile most of our other material cash commitments consist of goods and services used in our operations, these commitments primarily consist of obligations related to long-term software licensing and maintenance contracts, construction in process, and service contracts. \nWe also have outstanding commitments to fund additional contributions to investment partnerships totaling $202.5 million. The vast majority of these additional contributions will be made to investment partnerships in which we have \nPage 51\nTable of Contents\n            \n    \nan existing investment. In addition to such amounts, a percentage of prior distributions may be called under certain circumstances.\nAs part of the OHA acquisition, T. Rowe Price committed $500 million to fund OHA product launches through 2026. As of December 31, 2024, T. Rowe Price has $360 million remaining to commit to OHA products. T. Rowe Price has also entered into certain earnout and other arrangements as part of that acquisition. For more detail on these arrangements, see Note 5 and Note 16 to our consolidated financial statements in Item 8. of this Form 10-K.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES.\nThe preparation of financial statements often requires the selection of specific accounting methods and policies from among several acceptable alternatives. Further, significant estimates and judgments may be required in selecting and applying those methods and policies in the recognition of the assets and liabilities in our consolidated balance sheets, the revenues and expenses in our consolidated statements of income, and the information that is contained in our significant accounting policies and notes to the consolidated financial statements. These policies and estimates are considered critical because they had a material impact or are reasonably likely to have a material impact on our consolidated financial statements and because they require management to make significant judgments, assumptions or estimates. Making these estimates and judgments requires the analysis of information concerning events that may not yet be complete and of facts and circumstances that may change over time. Accordingly, actual amounts or future results can differ materially from those estimates that we currently include in our consolidated financial statements, significant accounting policies, and notes.\nWe present those significant accounting policies used in the preparation of our consolidated financial statements as an integral part of those statements within this 2024 Annual Report on Form 10-K. In the following discussion, we highlight and explain further certain of those policies and estimates that are most critical to the preparation and understanding of our financial statements.\nConsolidation\n \nWe consolidate all subsidiaries and sponsored investment products in which we have a controlling financial interest. We are deemed to have a controlling interest when we own the majority of the voting interest of an entity or are deemed to be the primary beneficiary of a variable interest entity (\"VIE\"). VIEs are entities that lack sufficient equity to finance its activities or the equity holders do not have defined power to direct the activities of the entity normally associated with an equity investment. Our analysis to determine whether an entity is a VIE or a voting interest entity (\"VOE\") involves judgment and considers several factors, including an entity’s legal organization, capital structure, the rights of the equity investment holders, our ownership interest in the entity, and our contractual involvement with the entity. We continually review and reconsider our VIE or VOE conclusions upon the occurrence of certain events, such as changes to our ownership interest, changes to an entity’s legal structure, or amendments to governing documents. Our VIEs are primarily sponsored investment products and our variable interest consists of our equity ownership in and investment management fees earned from these entities. \nWe are the primary beneficiary if we have the power to direct the activities of the VIE that most significantly impact its economic performance and the obligation to absorb losses of the entity or the right to receive benefits from the VIE that could potentially be significant. Our SICAV funds and other investment products regulated outside the U.S. are determined to be VIEs. We have interests in certain investment partnerships that are also considered VIEs, including entities that have interests in general partners of affiliated private investment funds, which are also VIEs. We consolidate the entities that hold the interest in the general partners; however, the entities are not the primary beneficiaries of the affiliated private investment funds.\nOther-than-temporary impairments of equity method investments\n \nWe evaluate our equity method investments for impairment when events or changes in circumstances indicate that the carrying value of the investment exceeds its fair value, and the decline in fair value is other than temporary. For our investments in our affiliated private investment funds, we consider the length of time and the extent to which market value has been less than cost, any specific events that may influence the operations of the funds and our intent and ability to retain the investment for a period of time to allow for any anticipated recovery in market value. We generally believe an assessment period of four consecutive quarters of sustained market losses is a reasonable period to allow for an anticipated market recovery. \nPage 52\nTable of Contents\n            \n    \nIntangible assets \nIndefinite-lived intangible assets are tested for impairment annually, in the fourth quarter, or more frequently if events or changes in circumstances indicate that it is more likely than not that the intangible asset is impaired. Management must first determine the level at which indefinite-lived intangible assets are tested for impairment (i.e., unit of account). We have concluded that the trade name and investment advisory agreement indefinite-lived intangible assets will be considered their own separate unit of account. Once the unit of account is determined, management has the option to first assess indefinite-lived intangible assets for qualitative factors to determine whether it is necessary to perform a quantitative impairment test. If a quantitative impairment test is required, the impairment test consists of a comparison of the fair value of an intangible asset with its carrying amount. If the carrying amount of the intangible asset exceeds its fair value, an impairment loss is recognized in an amount equal to that excess. If required, fair value is generally determined using a discounted cash flow analysis where estimated future cash flows are discounted to arrive at a single present value amount. This approach includes inputs that require significant management judgment, the most relevant of which include revenue growth, discount rates, and effective tax rates. Changes in these inputs could produce different fair value amounts and therefore different impairment conclusions. During 2024, we recognized $31.1 million of non-cash impairment charges on the trade name intangible asset. The maximum future impairment of indefinite-lived intangible assets that we could incur is the amount recognized in our consolidated balance sheets within intangible assets, $151.6 million as of December 31, 2024. \nDefinite-lived intangible assets are reviewed for impairment whenever events or circumstances indicate that the asset group's carrying amount may not be recoverable (i.e., the carrying amount is more than the undiscounted estimated future cash flows). Management must first determine the level at which definite-lived intangible assets are tested for impairment (i.e., asset group). The determination of the asset group is judgmental and the intangible assets can be grouped based on the lowest level for which identifiable cash flows are largely independent of identifiable cash flows for other groups of assets. Since each affiliated private investment fund has identifiable cash flows separate from other funds, we determined that the asset group for testing is each individual affiliated private investment fund. Once the asset group is identified, we next determine whether there are any triggering events that would cause us to believe that the carrying value would not be recoverable. If there is a triggering event, then we would perform a test of recoverability. Based on that test, if the carrying value is not recoverable, then a fair value measurement is required of the asset group to determine if the fair value is less than the asset group's carrying amount. If required, fair value would be determined using a discounted cash flow analysis where estimated future cash flows are discounted to arrive at a single present value amount. This approach includes inputs that require significant management judgment, the most relevant of which include revenue growth, discount rates, and effective tax rates. Any impairment loss would be the difference between the fair value of the asset group and its carrying amount. During 2024, we recognized immaterial non-cash impairment charges on these intangible assets.\nGoodwill\n \nWe internally conduct, manage, and report our operations as one reportable business segment - investment advisory business. This reflects how the chief operating decision maker allocates resources and assesses performance. Accordingly, we have one reporting unit - our investment advisory business, consistent with our single operating segment, to which all goodwill has been assigned. \nWe evaluate the carrying amount of goodwill in our consolidated balance sheets for possible impairment on an annual basis in the fourth quarter of each year using a fair value approach. Goodwill would be considered impaired whenever its carrying amount exceeds the fair value of our investment advisory business. Our annual testing has demonstrated that the fair value of our investment advisory business (our market capitalization) exceeds our carrying amount (our stockholders’ equity) and, therefore, no impairment exists. Should we reach a different conclusion in the future, additional work would be performed to ascertain the amount of the noncash impairment charge to be recognized. We must also perform impairment testing at other times if an event or circumstance occurs indicating that it is more likely than not that an impairment has been incurred. The maximum future impairment of goodwill that we could incur is the amount recognized in our consolidated balance sheets, $2.6 billion as of December 31, 2024. \nPage 53\nTable of Contents\n            \n    \nProvision for income taxes\nAfter compensation and related costs, our provision for income taxes on our earnings is our largest annual expense. We operate in numerous states and countries through our various subsidiaries and must allocate our income, expenses, and earnings under the various laws and regulations of each of these taxing jurisdictions. Accordingly, our provision for income taxes represents our total estimate of the liability that we have incurred in doing business each year in all of our locations. Annually, we file tax returns that represent our filing positions with each jurisdiction and settle our return liabilities. Each jurisdiction has the right to audit those returns and may take different positions with respect to income and expense allocations and taxable earnings determinations. From time to time, we may also provide for estimated liabilities associated with uncertain tax return filing positions that are subject to, or in the process of, being audited by various tax authorities. Because the determination of our annual provision is subject to judgments and estimates, it is likely that actual results will vary from those recognized in our financial statements. As a result, we recognize additions to, or reductions of, income tax expense during a reporting period that pertain to prior period provisions as our estimated liabilities are revised and actual tax returns and tax audits are settled. We recognize any such prior period adjustment in the discrete quarterly period in which it is determined.\nWe recognize deferred tax assets to the extent that we believe that these assets are more likely than not to be realized. In making such a determination, we consider all available positive and negative evidence, including\nfuture reversals of existing taxable temporary differences, projected future taxable income, tax-planning strategies, and results of recent operations. If we determine that we would be able to realize our deferred tax assets in the future in excess of their net recorded amount, we would make an adjustment to the deferred tax asset valuation allowance, which would reduce the provision for income taxes.\nNEWLY ISSUED BUT NOT YET ADOPTED ACCOUNTING GUIDANCE.\nSee \nNote 1 - Basis of Preparation and Summary of Significant Accounting Policies\n within Item 8. Financial Statements for a discussion of newly issued but not yet adopted accounting guidance. \nFORWARD-LOOKING INFORMATION.\nFrom time to time, information or statements provided by or on behalf of T. Rowe Price, including those within this report, may contain certain forward-looking information, including information or anticipated information relating to: our revenues, net income, and earnings per share of common stock; changes in the amount and composition of our assets under management; our expense levels; our effective tax rate; legal or regulatory developments; geopolitical instability; interest rates and currency fluctuations; and our expectations regarding financial markets, future transactions, dividends, stock repurchases, investments, new products and services, capital expenditures, changes in our effective fee rate, and other industry or market conditions. Readers are cautioned that any forward-looking information provided by or on behalf of T. Rowe Price is not a guarantee of future performance. Actual results may differ materially from those in forward-looking information because of various factors including, but not limited to, those discussed below and in Item 1A. Risk Factors, of this Form 10-K Annual Report. Further, forward-looking statements speak only as of the date on which they are made, and we undertake no obligation to update any forward-looking statement to reflect events or circumstances after the date on which it is made or to reflect the occurrence of unanticipated events.\nOur future revenues and results of operations will fluctuate primarily due to changes in the total value and composition of assets under our management. Such changes result from many factors, including, among other things: client-related cash inflows and outflows in our products, performance fees, capital allocation-based income, fluctuations in global financial markets that result in appreciation or depreciation of the assets under our management, our introduction of new investment products, and changes in retirement savings trends relative to participant-directed investments and defined contribution plans. \nThe ability to attract and retain investors’ assets under our management is dependent on investor sentiment and confidence; the relative investment performance of the T. Rowe Price mutual funds and other managed investment products compared to competing offerings and market indexes; the ability to maintain our investment management and administrative fees at appropriate levels; the impact of changes in interest rates and inflation; competitive conditions in the mutual fund, asset management, and broader financial services sectors; our level of success in implementing our strategy to expand our business; and our ability to attract and retain key personnel. Our revenues are substantially dependent on fees earned under contracts with the T. Rowe Price funds and could be adversely affected if the independent directors of one or more of the T. Rowe Price funds terminated or significantly altered the \nPage 54\nTable of Contents\n            \n    \nterms of the investment management or related administrative services agreements. Non-operating investment income will also fluctuate primarily due to the size of our investments, changes in their market valuations, and any other-than-temporary impairments that may arise or, in the case of our equity method investments, our proportionate share of the investees’ net income.\nOur future results are also dependent upon the level of our expenses, which are subject to fluctuation for the following or other reasons: changes in the level of our advertising and promotion expenses in response to market conditions, including our efforts to expand our investment advisory business to investors outside the U.S. and to further penetrate our distribution channels within the U.S.; the pace and level of spending to support key strategic priorities; variations in the level of total compensation expense due to, among other things, bonuses, restricted stock units and other equity grants, other incentive awards, our supplemental savings plan, changes in our employee count and mix, and competitive factors; any goodwill, intangible asset or other asset impairment that may arise; fluctuation in foreign currency exchange rates applicable to the costs of our international operations; expenses and capital costs, such as technology assets, depreciation, amortization, and research and development, incurred to maintain and enhance our administrative and operating services infrastructure; the timing of the assumption of all third party research payments, unanticipated costs that may be incurred to protect investor accounts and the goodwill of our clients; and disruptions of services, including those provided by third parties, such as fund and product recordkeeping, facilities, communications, power, and the mutual fund transfer agent and accounting systems,\n \nas a result of extreme events, cyberattacks or otherwise.\nOur business is also subject to substantial governmental regulation, and changes in legal, regulatory, accounting, tax, and compliance requirements may have a substantial effect on our operations and results, including, but not limited to, effects on costs that we incur and effects on investor interest in investment products and investing in general or in particular classes of mutual funds or other investments.",
  "item2": null
}