{
  "source_file": "trv-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\n        \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following is a discussion and analysis of the Company’s financial condition and results of operations.\nFINANCIAL HIGHLIGHTS\n2025 Third Quarter Consolidated Results of Operations\n•\nNet income of $1.89 billion, or $8.37 per share basic and $8.24 per share diluted\n•\nNet earned premiums of $11.14 billion\n•\nCatastrophe losses of $402 million ($318 million after-tax) \n•\nNet favorable prior year reserve development of $22 million ($16 million after-tax)\n•\nCombined ratio of 87.3%\n•\nNet investment income of $1.03 billion ($850 million after-tax)\n•\nNet realized investment gains of $27 million ($21 million after-tax)\n•\nOperating cash flows of $4.23 billion\n2025 Third Quarter Consolidated Financial Condition\n•\nTotal investments of $103.68 billion; fixed maturities and short-term securities comprised 94% of total investments\n•\nTotal assets of $143.68 billion\n•\nTotal debt of $9.27 billion, resulting in a debt-to-total capital ratio of 22.7% (21.6% excluding net unrealized inv\nestment losses,\n net of tax)\n•\nTotal capital returned to shareholders of $878 million, comprising $628 million of share repurchases and $250 million of dividends\n•\nShareholders’ equity of $31.61 billion\n•\nNet unrealized investment losses of $2.48 billion ($1.97 billion after-tax)\n•\nBook value per common share of $141.72\n•\nHolding company liquidity of $2.84 billion\n33\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nCONSOLIDATED OVERVIEW\nConsolidated Results of Operations\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions, except ratio and per share amounts)\n2025\n2024\n2025\n2024\nRevenues\n \n \n \n \nPremiums\n$\n11,135\n \n$\n10,704 \n$\n32,766\n \n$\n31,073 \nNet investment income\n1,033\n \n904 \n2,905\n \n2,635 \nFee income\n127\n \n121 \n370\n \n345 \nNet realized investment gains (losses)\n27\n \n55 \n(28)\n25 \nOther revenues\n148\n \n120 \n383\n \n337 \nTotal revenues\n12,470\n \n11,904 \n36,396\n \n34,415 \nClaims and expenses\n \n \n \n \nClaims and claim adjustment expenses\n6,594\n \n6,996 \n21,389\n \n21,025 \nAmortization of deferred acquisition costs\n1,849\n \n1,790 \n5,429\n \n5,166 \nGeneral and administrative expenses\n1,572\n \n1,460 \n4,576\n \n4,344 \nInterest expense\n111\n \n98 \n309\n \n294 \nTotal claims and expenses\n10,126\n \n10,344 \n31,703\n \n30,829 \nIncome before income taxes\n2,344\n \n1,560 \n4,693\n \n3,586 \nIncome tax expense\n456\n \n300 \n901\n \n669 \nNet income\n$\n1,888\n \n$\n1,260 \n$\n3,792\n \n$\n2,917 \nNet income per share\n \n \n \n \nBasic\n$\n8.37\n \n$\n5.50 \n$\n16.69\n \n$\n12.68 \nDiluted\n$\n8.24\n \n$\n5.42 \n$\n16.45\n \n$\n12.51 \nCombined ratio\n \n \n \n \nLoss and loss adjustment expense ratio\n58.7\n \n%\n64.8 \n%\n64.7\n \n%\n67.1 \n%\nUnderwriting expense ratio\n28.6\n \n28.4 \n28.5\n \n28.6 \nCombined ratio\n87.3\n \n%\n93.2 \n%\n93.2\n \n%\n95.7 \n%\nThe following discussions of the Company’s net income and segment income are presented on an after-tax basis. Discussions of the components of net income and segment income are presented on a pre-tax basis, unless otherwise noted. Discussions of net income per common share are presented on a diluted basis.\nOverview\nDiluted net income per share of $8.24 in the third quarter of 2025 increased by 52% over diluted net income per share of $5.42 in the same period of 2024.  Net income of $1.89 billion in the third quarter of 2025 increased by 50% over net income of $1.26 billion in the same period of 2024. The higher rate of increase in diluted net income per share reflected the impact of share repurchases in recent periods. The increase in income before income taxes in the third quarter of 2025 primarily reflected the pre-tax impacts of (i) lower catastrophe losses, (ii) higher underwriting margins excluding catastrophe losses and prior year reserve development (“underlying underwriting margins”) and (iii) higher net investment income, partially offset by (iv) lower net favorable prior year reserve development and (v) lower net realized investment gains. Catastrophe losses in the third quarters of 2025 and 2024 were $402 million and $939 million, respectively. Net favorable prior year reserve development in the third quarters of 2025 and 2024 was $22 million and $126 million, respectively. Underlying underwriting margins in the third quarter of 2025 were higher in all three segments. Income tax expense in the third quarter of 2025 was higher than in the same period of 2024, primarily reflecting the impact of the increase in income before income taxes.\n34\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nDiluted net income per share of $16.45 in the first nine months of 2025 increased by 31% over diluted net income per share of $12.51 in the same period of 2024. Net income of $3.79 billion in the first nine months of 2025 increased by 30% over net income of $2.92 billion in the same period of 2024. The higher rate of increase in diluted net income per share reflected the impact of share repurchases in recent periods. The increase in income before income taxes primarily reflected the pre-tax impacts of (i) higher underlying underwriting margins, (ii) higher net investment income and (iii) higher net favorable prior year reserve development, partially offset by (iv) higher catastrophe losses and (v) net realized investment losses compared to net realized investment gains in the same period of 2024. Catastrophe losses in the first nine months of 2025 and 2024 were $3.60 billion and $3.16 billion, respectively. Net favorable prior year reserve development in the first nine months of 2025 and 2024 was $715 million and $447 million, respectively. The higher underlying underwriting margins in the first nine months of 2025 were driven by Personal Insurance and Business Insurance, partially offset by Bond & Specialty Insurance. Income tax expense in the first nine months of 2025 was higher than in the same period of 2024, primarily reflecting the impact of the increase in income before income taxes.\nThe Company has insurance operations in Canada, the United Kingdom, the Republic of Ireland and throughout other parts of the world as a corporate member of Lloyd’s, as well as in Brazil through a joint venture. Because these operations are conducted in local currencies other than the U.S. dollar, the Company is subject to changes in foreign currency exchange rates. For the three months and nine months ended September 30, 2025 and 2024, changes in foreign currency exchange rates impacted reported line items in the statement of income by insignificant amounts. The impact of these changes was not material to the Company’s net income or segment income for the periods reported.\nRevenues\nEarned Premiums\nEarned premiums in the third quarter of 2025 were $11.14 billion, $431 million or 4% higher than in the same period of 2024. Earned premiums in the first nine months of 2025 were $32.77 billion, $1.69 billion or 5% higher than in the same period of 2024. In Business Insurance, earned premiums in the third quarter and first nine months of 2025 increased by 4% and 6%, respectively, over the same periods of 2024. In Bond & Specialty Insurance, earned premiums in the third quarter and first nine months of 2025 increased by 3% and 4%, respectively, over the same periods of 2024. In Personal Insurance, earned premiums in the third quarter and first nine months of 2025 increased by 4% and 5%, respectively, over the same periods of 2024. Factors contributing to the changes in earned premiums in each segment are discussed in more detail in the segment discussions that follow.\nNet Investment Income\nThe following table sets forth information regarding the Company’s investments.\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nAverage investments \n(1)\n$\n105,655\n \n$\n97,736 \n$\n103,086\n \n$\n96,042 \nPre-tax net investment income\n1,033\n \n904 \n2,905\n \n2,635 \nAfter-tax net investment income\n850\n \n742 \n2,387\n \n2,167 \nAverage pre-tax yield \n(2)\n3.9\n \n%\n3.7 \n%\n3.8\n \n%\n3.7 \n%\nAverage after-tax yield \n(2)\n3.2\n \n%\n3.0 \n%\n3.1\n \n%\n3.0 \n%\n_________________________________________________________ \n(1)\nExcludes net unrealized investment gains and losses and reflects cash, receivables for investment sales, payables on investment purchases and accrued investment income.\n(2)\nExcludes net realized and net unrealized investment gains and losses.\nNet investment income in the third quarter of 2025 was $1.03 billion, $129 million or 14% higher than in the same period of 2024. Net investment income in the first nine months of 2025 was $2.91 billion, $270 million or 10% higher than in the same period of 2024. Net investment income from fixed maturity investments in the third quarter and first nine months of 2025 was $874 million and $2.52 billion, respectively, $125 million and $369 million higher, respectively, than in the same periods of 2024. The increases in both periods of 2025 primarily resulted from a higher average level of fixed maturity investments and higher long-term average yields. Net investment income from short-term securities in the third quarter and first nine months of 2025 was $73 million and $185 million, respectively, $4 million and $32 million lower, respectively, than in the same periods of 2024. The decreases in both periods of 2025 primarily resulted from lower short-term average yields, partially offset by a higher average level of short-term securities. The Company’s remaining investment portfolios had net investment income of $101 million in the third quarter of 2025, $11 million higher than in the same period of 2024, primarily reflecting higher private \n35\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nequity partnership returns. The Company’s remaining investment portfolios had net investment income of $244 million in the first nine months of 2025, $62 million lower than in the same period of 2024, primarily reflecting lower private equity partnership returns. Included in other investments are private equity, hedge fund and real estate partnerships that are accounted for under the equity method of accounting and typically report their financial statement information to the Company one month to three months following the end of the reporting period. Accordingly, net investment income from these other investments is generally reflected in the Company’s financial statements on a quarter lag basis.\nFee Income\nFee income in the third quarter of 2025 was $127 million, $6 million higher than in the same period of 2024. Fee income in the first nine months of 2025 was $370 million, $25 million higher than in the same period of 2024. The National Accounts market in Business Insurance is the primary source of the Company’s fee-based business and is discussed in the Business Insurance segment discussion that follows.\nNet Realized Investment Gains (Losses)\nThe following table sets forth information regarding the Company’s net realized investment gains (losses).\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2025\n2024\n2025\n2024\nImpairment gains (losses):\nFixed maturities\n$\n—\n \n$\n(5)\n$\n(2)\n$\n(8)\nNet realized investment gains (losses) on equity securities still held\n40\n \n51 \n41\n \n102 \nOther net realized investment gains (losses), including from sales\n(13)\n9 \n(67)\n(69)\nTotal\n$\n27\n \n$\n55 \n$\n(28)\n$\n25 \nNet realized investment gains on equity securities still held of $40 million and $41 million, respectively, in the third quarter and first nine months of 2025 were driven by the impact of changes in fair value attributable to favorable equity markets. Net realized investment gains on equity securities still held of $51 million and $102 million, respectively, in the third quarter and first nine months of 2024 were driven by the impact of changes in fair value attributable to favorable equity markets.\nOther Revenues\nOther revenues in the third quarter of 2025 were $148 million, $28 million higher than in the same period of 2024. Other revenues in the first nine months of 2025 were $383 million, $46 million higher than in the same period of 2024. Other revenues include revenues from Simply Business, installment premium charges and other policyholder service charges.  \nClaims and Expenses\nClaims and Claim Adjustment Expenses\nClaims and claim adjustment expenses in the third quarter of 2025 were $6.59 billion, $402 million or 6% lower than in the same period of 2024, driven by (i) lower catastrophe losses in all three segments and (ii) lower losses in Personal Insurance, partially offset by (iii) loss cost trends in all three segments, (iv) lower net favorable prior year reserve development and (v) higher business volumes in Business Insurance and Bond & Specialty Insurance. Catastrophe losses in the third quarter of 2025 primarily resulted from severe wind and hail storms in multiple states. Catastrophe losses in the third quarter of 2024 primarily resulted from Hurricane Helene and severe wind and hail storms in multiple states. \nClaims and claim adjustment expenses in the first nine months of 2025 were $21.39 billion, $364 million or 2% higher than in the same period of 2024, driven by (i) higher catastrophe losses in Personal Insurance and Business Insurance, partially offset by lower catastrophe losses in Bond & Specialty Insurance, (ii) loss cost trends in all three segments and (iii) higher business volumes in Business Insurance and Bond & Specialty Insurance, partially offset by (iv) higher net favorable prior year reserve development in all three segments and (v) lower losses in Personal Insurance. Catastrophe losses in the first nine months of 2025 included the third quarter events described above, as well as the January 2025 California wildfires and severe wind and hail storms in multiple states in the first six months of 2025. Catastrophe losses in the first nine months of 2024 included the third quarter events described above, as well as numerous severe wind and hail storms in multiple states in the first six months of 2024.\n36\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nFactors contributing to net prior year reserve development during the third quarters and first nine months of 2025 and 2024 are discussed in more detail in note 7 of the notes to the unaudited consolidated financial statements.\nSignificant Catastrophe Losses\nThe following table presents the amount of losses recorded by the Company for significant catastrophes that occurred in the three months and nine months ended September 30, 2025 and 2024, the amount of net unfavorable (favorable) prior year reserve development recognized in the three months and nine months ended September 30, 2025 and 2024 for significant catastrophes that occurred in 2024 and 2023, and the estimate of ultimate losses for those catastrophes at September 30, 2025 and December 31, 2024. For purposes of the table, a significant catastrophe is an event for which the Company estimates its ultimate losses will be $100 million or more after reinsurance and before taxes. The Company’s threshold for disclosing catastrophes is primarily determined at the reportable segment level and for 2025 ranged from $20 million to $30 million of losses before reinsurance and taxes. For the Company’s definition of a catastrophe, refer to “Part II—Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations— Consolidated Overview” in the Company’s 2024 Annual Report.\n37\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\n \nLosses Incurred/Unfavorable (Favorable)\nPrior Year Reserve Development\n \n \n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n \nEstimated Ultimate Losses\n(in millions, pre-tax and net of reinsurance)\n2025\n2024\n2025\n2024\nSeptember 30, 2025\nDecember 31, 2024\n2023\nPCS Serial Number:\n25 — Severe wind and hail storms\n(1)\n(1)\n(2)\n(3)\n145 \n147 \n32 — Severe wind and hail storms\n3 \n(2)\n(2)\n(2)\n133 \n135 \n33 — Severe wind and hail storms\n— \n(2)\n— \n(6)\n189 \n189 \n35 — Severe wind and hail storms\n2 \n1 \n11 \n(2)\n151 \n140 \n38 — Severe wind and hail storms\n2 \n3 \n4 \n5 \n117 \n113 \n42 — Severe wind and hail storms\n1 \n2 \n— \n5 \n137 \n137 \n48 — Severe wind and hail storms\n— \n1 \n4 \n(5)\n148 \n144 \n49 — Severe wind and hail storms\n— \n2 \n(4)\n(2)\n131 \n135 \n51 — Severe wind and hail storms\n2 \n(12)\n4 \n(33)\n235 \n231 \n63 — Severe wind and hail storms\n4 \n14 \n1 \n7 \n131 \n130 \n75 — Severe wind and hail storms\n2 \n(6)\n(5)\n(17)\n168 \n173 \n2024\nPCS Serial Number:\n26 — Severe wind and hail storms\n(8)\n15 \n(13)\n266\n248 \n261 \n39 — Severe wind and hail storms\n(2)\n35 \n(10)\n256\n240 \n250 \n42 — Severe wind and hail storms\n(5)\n(30)\n(15)\n159\n146 \n161 \n44 — Severe wind and hail storms\n1 \n(22)\n1 \n182\n172 \n171 \n45 — Severe wind and hail storms\n6 \n(13)\n15 \n151\n174 \n159 \n46 — Severe wind and hail storms\n1 \n29 \n10 \n187\n192 \n182 \n61 — Severe wind and hail storms\n1 \n159 \n(9)\n159\n135 \n144 \n77 — Hurricane Helene\n2 \n547 \n(46)\n547\n687 \n733 \n2025\nPCS Serial Number:\n11 — California wildfire – Palisades fire\n(2)\nn/a\n1,332 \nn/a\n1,332 \nn/a\n12 — California wildfire – Eaton fire\n— \nn/a\n391 \nn/a\n391 \nn/a\n24 — Severe wind and hail storms\n— \nn/a\n338 \nn/a\n338 \nn/a\n29 — Severe wind and hail storms\n(7)\nn/a\n135 \nn/a\n135 \nn/a\n37 — Severe wind and hail storms\n3 \nn/a\n225 \nn/a\n225 \nn/a\n39 — Severe wind and hail storms \n(1)\n8 \nn/a\n101 \nn/a\n101 \nn/a\n43 — Severe wind and hail storms\n (1)\n29 \nn/a\n104 \nn/a\n104 \nn/a\n45 — Severe wind and hail storms\n(17)\nn/a\n110 \nn/a\n110 \nn/a\n_________________________________________________________\nn/a: not applicable.\n(1) PCS events 39 and 43, which were $93 million and $75 million, respectively, as of June 30, 2025, both exceeded the Company’s threshold for a significant catastrophe ($100 million) as of September 30, 2025.\nAmortization of Deferred Acquisition Costs\nAmortization of deferred acquisition costs in the third quarter of 2025 was $1.85 billion, $59 million or 3% higher than in the same period of 2024. Amortization of deferred acquisition costs in the first nine months of 2025 was $5.43 billion, $263 million or 5% higher than in the same period of 2024. The increases in both periods were generally consistent with the increases in earned premiums. Amortization of deferred acquisition costs is discussed in more detail in the segment discussions that follow.\n38\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nGeneral and Administrative Expenses\nGeneral and administrative expenses in the third quarter of 2025 were $1.57 billion, $112 million or 8% higher than in the same period of 2024. General and administrative expenses in the first nine months of 2025 were $4.58 billion, $232 million or 5% higher than in the same period of 2024. The increases in both periods of 2025 primarily reflected the impact of costs associated with higher business volumes. General and administrative expenses are discussed in more detail in the segment discussions that follow.\nInterest Expense\nInterest expense in the third quarter and first nine months of 2025 was $111 million and $309 million, respectively, compared with $98 million and $294 million, respectively, in the same periods of 2024.\nIncome Tax Expense\nIncome tax expense in the third quarter of 2025 was $456 million, $156 million or 52% higher than in the same period of 2024, primarily reflecting the impact of the $784 million increase in income before income taxes in the third quarter of 2025. Income tax expense in the first nine months of 2025 was $901 million, $232 million or 35% higher than in the same period of 2024, primarily reflecting the impact of the $1.11 billion increase in income before income taxes in the first nine months of 2025. \nThe Company’s effective tax rate was 19% in both the third quarters of 2025 and 2024. The Company’s effective tax rate was 19% in both the first nine months of 2025 and 2024. The effective tax rate for all periods reflected the impact of tax-exempt investment income on the calculation of the Company’s income tax provision. \nCombined Ratio\nThe combined ratio of 87.3% in the third quarter of 2025 was 5.9 points lower than the combined ratio of 93.2% in the same period of 2024. The loss and loss adjustment expense ratio of 58.7% in the third quarter of 2025 was 6.1 points lower than the loss and loss adjustment expense ratio of 64.8% in the same period of 2024. The underwriting expense ratio of 28.6% in the third quarter of 2025 was 0.2 points higher than the underwriting expense ratio of 28.4% in the same period of 2024.\nCatastrophe losses in the third quarters of 2025 and 2024 accounted for 3.6 points and 8.8 points, respectively, of the combined ratio. Net favorable prior year reserve development in the third quarters of 2025 and 2024 provided 0.2 points and 1.2 points of benefit, respectively, to the combined ratio. The combined ratio excluding prior year reserve development and catastrophe losses (“underlying combined ratio”) in the third quarter of 2025 was 1.7 points lower than the 2024 ratio on the same basis, primarily reflecting the impacts of (i) the benefit of earned pricing and (ii) lower losses in Personal Insurance.\nThe combined ratio of 93.2% in the first nine months of 2025 was 2.5 points lower than the combined ratio of 95.7% in the same period of 2024. The loss and loss adjustment expense ratio of 64.7% for the first nine months of 2025 was 2.4 points lower than the loss and loss adjustment expense ratio of 67.1% in the same period of 2024. The underwriting expense ratio of 28.5% for the first nine months of 2025 was 0.1 points lower than the underwriting expense ratio of 28.6% in the same period of 2024.\nCatastrophe losses in the first nine months of 2025 and 2024 accounted for 11.0 points and 10.2 points, respectively, of the combined ratio. Net favorable prior year reserve development in the first nine months of 2025 and 2024 provided 2.2 points and 1.5 points of benefit, respectively, to the combined ratio. The underlying combined ratio in the first nine months of 2025 was 2.6 points lower than the 2024 ratio on the same basis, primarily reflecting the impacts of (i) the benefit of earned pricing and (ii) lower losses in Personal Insurance.\nThe combined ratio continues to be impacted by the tort environment, including more aggressive attorney involvement in insurance claims.\n39\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nWritten Premiums\nConsolidated gross and net written premiums were as follows:\n \nGross Written Premiums\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2025\n2024\n2025\n2024\nBusiness Insurance\n$\n6,285\n \n$\n6,173 \n$\n19,410\n \n$\n18,725 \nBond & Specialty Insurance\n1,160\n \n1,165 \n3,455\n \n3,368 \nPersonal Insurance\n4,848\n \n4,811 \n13,569\n \n13,231 \nTotal\n$\n12,293\n \n$\n12,149 \n$\n36,434\n \n$\n35,324 \n \nNet Written Premiums\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2025\n2024\n2025\n2024\nBusiness Insurance\n$\n5,675\n \n$\n5,517 \n$\n17,165\n \n$\n16,652 \nBond & Specialty Insurance\n1,080\n \n1,072 \n3,164\n \n3,055 \nPersonal Insurance\n4,718\n \n4,728 \n13,202\n \n12,907 \nTotal\n$\n11,473\n \n$\n11,317 \n$\n33,531\n \n$\n32,614 \nGross and net written premiums in the third quarter of 2025 both increased by 1% over the same period of 2024. Gross and net written premiums in the first nine months of 2025 both increased by 3% over the same period of 2024. Factors contributing to the changes in gross and net written premiums in each segment are discussed in more detail in the segment discussions that follow.\nRESULTS OF OPERATIONS BY SEGMENT\nBusiness Insurance\nResults of Business Insurance were as follows:\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nRevenues\n \n \n \n \nEarned premiums\n$\n5,700\n \n$\n5,474 \n$\n16,710\n \n$\n15,802 \nNet investment income\n727\n \n642 \n2,045\n \n1,883 \nFee income\n114\n \n109 \n333\n \n315 \nOther revenues\n111\n \n89 \n288\n \n243 \nTotal revenues\n6,652\n \n6,314 \n19,376\n \n18,243 \nTotal claims and expenses\n5,534\n \n5,454 \n16,406\n \n15,634 \nSegment income before income taxes\n1,118\n \n860 \n2,970\n \n2,609 \nIncome tax expense\n211\n \n162 \n567\n \n491 \nSegment income\n$\n907\n \n$\n698 \n$\n2,403\n \n$\n2,118 \nLoss and loss adjustment expense ratio\n63.3\n \n%\n66.6 \n%\n64.6\n \n%\n65.5 \n%\nUnderwriting expense ratio\n29.6\n \n29.2 \n29.6\n \n29.6 \nCombined ratio\n92.9\n \n%\n95.8 \n%\n94.2\n \n%\n95.1 \n%\n40\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nOverview\nSegment income in the third quarter of 2025 was $907 million, $209 million or 30% higher than segment income of $698 million in the same period of 2024. The increase in segment income before income taxes primarily reflected the pre-tax impacts of (i) lower catastrophe losses and (ii) higher net investment income, partially offset by (iii) higher net unfavorable prior year reserve development. Catastrophe losses in the third quarters of 2025 and 2024 were $139 million and $340 million, respectively. Net unfavorable prior year reserve development in the third quarters of 2025 and 2024 was $125 million and $91 million, respectively. Income tax expense in the third quarter of 2025 was higher than in the same period of 2024, primarily reflecting the impact of the increase in segment income before income taxes.\nSegment income in the first nine months of 2025 was $2.40 billion, $285 million or 13% higher than segment income of $2.12 billion in the same period of 2024. The increase in segment income before income taxes primarily reflected the pre-tax impacts of (i) higher underlying underwriting margins, (ii) higher net investment income and (iii) net favorable prior year reserve development of $28 million compared to net unfavorable prior year reserve development of $57 million in the same period of 2024, partially offset by (iv) higher catastrophe losses. Catastrophe losses in the first nine months of 2025 and 2024 were $1.02 billion and $938 million, respectively. The higher underlying underwriting margins primarily reflected the impacts of (i) the benefit of earned pricing and (ii) higher business volumes, partially offset by (iii) higher general and administrative expenses. Income tax expense in the first nine months of 2025 was higher than in the same period of 2024, primarily reflecting the impact of the increase in segment income before income taxes.\nRevenues\nEarned Premiums\nEarned premiums in the third quarter of 2025 were $5.70 billion, $226 million or 4% higher than in the same period of 2024. Earned premiums in the first nine months of 2025 were $16.71 billion, $908 million or 6% higher than in the same period of 2024. The increases in both periods of 2025 primarily reflected the increase in net written premiums over the preceding twelve months. \nNet Investment Income\nNet investment income in the third quarter of 2025 was $727 million, $85 million or 13% higher than in the same period of 2024. Net investment income in the first nine months of 2025 was $2.05 billion, $162 million or 9% higher than in the same period of 2024. Refer to the “Revenues—Net Investment Income” section of the “Consolidated Results of Operations” discussion herein for a description of the factors contributing to the increases in the Company’s consolidated net investment income in the third quarter and first nine months of 2025 compared with the same periods of 2024. In addition, refer to note 2 of the notes to the consolidated financial statements in the Company’s 2024 Annual Report for a discussion of the Company’s net investment income allocation methodology.\nFee Income\nNational Accounts is the primary source of fee income due to revenue from its large deductible policies and service businesses, which include risk management, claims administration, loss control and risk management information services provided to third parties, as well as policy issuance and claims management services to workers’ compensation residual market pools. Fee income in the third quarter of 2025 was $114 million, $5 million or 5% higher than in the same period of 2024. Fee income in the first nine months of 2025 was $333 million, $18 million or 6% higher than in the same period of 2024.\nOther Revenues\nOther revenues in the third quarter of 2025 were $111 million, $22 million higher than in the same period of 2024. Other revenues in the first nine months of 2025 were $288 million, $45 million higher than in the same period of 2024. Other revenues include revenues from Simply Business, installment premium charges and other policyholder service charges.\nClaims and Expenses\nClaims and Claim Adjustment Expenses\nClaims and claim adjustment expenses in the third quarter of 2025 were $3.67 billion, $31 million or 1% lower than in the same period of 2024, primarily reflecting the impacts of (i) lower catastrophe losses, partially offset by (ii) higher business volumes, (iii) loss cost trends and (iv) higher net unfavorable prior year reserve development.\nClaims and claim adjustment expenses in the first nine months of 2025 were $10.96 billion, $456 million or 4% higher than in the same period of 2024, primarily reflecting the impacts of (i) higher business volumes, (ii) loss cost trends and (iii) higher catastrophe losses, partially offset by (iv) net favorable prior year reserve development compared to net unfavorable prior year reserve development in the same period of 2024.\n41\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nFactors contributing to net prior year reserve development during the third quarters and first nine months of 2025 and 2024 are discussed in more detail in note 7 of the notes to the unaudited consolidated financial statements.\nAmortization of Deferred Acquisition Costs\nAmortization of deferred acquisition costs in the third quarter of 2025 was $973 million, $43 million or 5% higher than the same period of 2024. Amortization of deferred acquisition costs in the first nine months of 2025 was $2.83 billion, $179 million or 7% higher than the same period of 2024. The increases in both periods of 2025 were generally consistent with the increases in earned premiums.\nGeneral and Administrative Expenses\nGeneral and administrative expenses in the third quarter of 2025 were $894 million, $68 million or 8% higher than in the same period of 2024. General and administrative expenses in the first nine months of 2025 were $2.62 billion, $137 million or 6% higher than in the same period of 2024. The increases in both periods of 2025 were primarily in support of business growth.\nIncome Tax Expense\nIncome tax expense in the third quarter of 2025 was $211 million, $49 million or 30% higher than the same period of 2024, primarily reflecting the impact of the $258 million increase in income before income taxes. Income tax expense in the first nine months of 2025 was $567 million, $76 million or 15% higher than in the same period of 2024, primarily reflecting the impact of the $361 million increase in income before income taxes.\nCombined Ratio\nThe combined ratio of 92.9% in the third quarter of 2025 was 2.9 points lower than the combined ratio of 95.8% in the same period of 2024. The loss and loss adjustment expense ratio of 63.3% in the third quarter of 2025 was 3.3 points lower than the loss and loss adjustment expense ratio of 66.6% in the same period of 2024. The underwriting expense ratio of 29.6% in the third quarter of 2025 was 0.4 points higher than the underwriting expense ratio of 29.2% in the same period of 2024.\nCatastrophe losses in the third quarters of 2025 and 2024 accounted for 2.4 points and 6.2 points, respectively, of the combined ratio. Net unfavorable prior year reserve development in the third quarters of 2025 and 2024 accounted for 2.2 points and 1.7 points, respectively, of the combined ratio. The underlying combined ratio in the third quarter of 2025 was 0.4 points higher than the 2024 ratio on the same basis, primarily reflecting a higher expense ratio.\nThe combined ratio of 94.2% in the first nine months of 2025 was 0.9 points lower than the combined ratio of 95.1% in the same period of 2024. The loss and loss adjustment expense ratio of 64.6% in the first nine months of 2025 was 0.9 points lower than the loss and loss adjustment expense ratio of 65.5% in the same period of 2024. The underwriting expense ratio of 29.6% for the first nine months of 2025 was comparable with the underwriting expense ratio in the same period of 2024.\nCatastrophe losses in the first nine months of 2025 and 2024 accounted for 6.1 points and 5.9 points, respectively, of the combined ratio. Net favorable prior year reserve development in the first nine months of 2025 provided 0.2 points of benefit to the combined ratio. Net unfavorable prior year reserve development in the first nine months of 2024 accounted for 0.4 points of the combined ratio. The underlying combined ratio in the first nine months of 2025 was 0.5 points lower than the 2024 ratio on the same basis, primarily reflecting the impact of the benefit of earned pricing.\n42\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nWritten Premiums\nBusiness Insurance’s gross and net written premiums by market were as follows:\n \nGross Written Premiums\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2025\n2024\n2025\n2024\nDomestic:\n \n \n \n \nSelect Accounts\n$\n927\n \n$\n892 \n$\n2,980\n \n$\n2,874 \nMiddle Market\n3,463\n \n3,279 \n10,496\n \n9,835 \nNational Accounts\n367\n \n355 \n1,307\n \n1,300 \nNational Property and Other\n1,089\n \n1,172 \n2,955\n \n3,056 \nTotal Domestic\n5,846\n \n5,698 \n17,738\n \n17,065 \nInternational\n439\n \n475 \n1,672\n \n1,660 \nTotal Business Insurance\n$\n6,285\n \n$\n6,173 \n$\n19,410\n \n$\n18,725 \n \nNet Written Premiums\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2025\n2024\n2025\n2024\nDomestic:\n \n \n \n \nSelect Accounts\n$\n920\n \n$\n885 \n$\n2,900\n \n$\n2,834 \nMiddle Market\n3,232\n \n3,030 \n9,432\n \n9,012 \nNational Accounts\n273\n \n264 \n914\n \n903 \nNational Property and Other\n841\n \n896 \n2,446\n \n2,450 \nTotal Domestic\n5,266\n \n5,075 \n15,692\n \n15,199 \nInternational\n409\n \n442 \n1,473\n \n1,453 \nTotal Business Insurance\n$\n5,675\n \n$\n5,517 \n$\n17,165\n \n$\n16,652 \nGross written premiums in the third quarter and first nine months of 2025 increased by 2% and 4%, respectively, over the same periods of 2024. Net written premiums in the third quarter of 2025 increased by 3% over the same period of 2024. Net written premiums in the first nine months of 2025 increased by 3% over the same period of 2024, as growth in gross written premiums was partially offset by higher ceded written premiums driven by changes in the casualty reinsurance program. \nSelect Accounts\n.  Net written premiums of $920 million and $2.90 billion in the third quarter and first nine months of 2025, respectively, increased by 4% and 2%, respectively, over the same periods of 2024. Retention rates remained strong in the third quarter of 2025 but decreased slightly from the same period of 2024. Retention rates remained strong in the first nine months of 2025 but decreased from the same period of 2024. Renewal premium changes in the third quarter of 2025 remained positive but were lower than the same period of 2024. Renewal premium changes in the first nine months of 2025 remained positive but were slightly lower than the same period of 2024. New business premiums in the third quarter and first nine months of 2025 increased over the same periods of 2024.\nMiddle Market. \n Net written premiums of $3.23 billion and $9.43 billion in the third quarter and first nine months of 2025, respectively, increased by 7% and 5%, respectively, over the same periods of 2024.  Net written premiums in the first nine months of 2025 were reduced by the impact of higher ceded written premiums driven by changes in the casualty reinsurance program. Retention rates remained strong in the third quarter of 2025 but decreased from the same period of 2024. Retention rates remained strong in the first nine months of 2025 and were comparable with the same period of 2024. Renewal premium changes in the third quarter and first nine months of 2025 remained positive but were lower than the same periods of 2024.  New business premiums in the third quarter and first nine months of 2025 increased over the same periods of 2024.\n43\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nNational Accounts.\n  Net written premiums of $273 million and $914 million in the third quarter and first nine months of 2025, respectively, increased by 3% and 1%, respectively, over the same periods of 2024. Retention rates remained strong in the third quarter of 2025 and increased over the same period of 2024. Retention rates remained strong in the first nine months of 2025 but decreased slightly from the same period of 2024. Renewal premium changes in the third quarter and first nine months of 2025 remained positive but were lower than the same periods of 2024. New business premiums in the third quarter and first nine months of 2025 decreased from the same periods of 2024.\nNational Property and Other. \n Net written premiums of $841 million in the third quarter of 2025 decreased by 6% from the same period of 2024. Net written premiums of $2.45 billion in the first nine months of 2025 were comparable with the same period of 2024. Retention rates remained strong in the third quarter and first nine months of 2025 and increased over the same periods of 2024. Renewal premium changes in the third quarter and first nine months of 2025 remained positive but were lower than the same periods of 2024. New business premiums in the third quarter and first nine months of 2025 decreased from the same periods of 2024.  \nInternational.\n  Net written premiums of $409 million in the third quarter of 2025 decreased by 7% from the same period of 2024. Net written premiums of $1.47 billion in the first nine months of 2025 increased by 1% over the same period of 2024.  \nBond & Specialty Insurance\nResults of Bond & Specialty Insurance were as follows:\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nRevenues\n \n \n \n \nEarned premiums\n$\n1,042\n \n$\n1,009 \n$\n3,058\n \n$\n2,942 \nNet investment income\n116\n \n101 \n325\n \n285 \nOther revenues\n8\n \n7 \n19\n \n22 \nTotal revenues\n1,166\n \n1,117 \n3,402\n \n3,249 \nTotal claims and expenses\n855\n \n838 \n2,508\n \n2,516 \nSegment income before income taxes\n311\n \n279 \n894\n \n733 \nIncome tax expense\n61\n \n57 \n180\n \n146 \nSegment income\n$\n250\n \n$\n222 \n$\n714\n \n$\n587 \nLoss and loss adjustment expense ratio\n42.9\n \n%\n43.4 \n%\n42.2\n \n%\n45.2 \n%\nUnderwriting expense ratio\n38.7\n \n39.1 \n39.3\n \n39.7 \nCombined ratio\n81.6\n \n%\n82.5 \n%\n81.5\n \n%\n84.9 \n%\nOverview\nSegment income in the third quarter of 2025 was $250 million, $28 million or 13% higher than segment income of $222 million in the same period of 2024.  The increase in segment income before income taxes primarily reflected the pre-tax impacts of (i) higher net investment income, (ii) higher net favorable prior year reserve development, (iii) higher underlying underwriting margins and (iv) lower catastrophe losses. Net favorable prior year reserve development in the third quarters of 2025 and 2024 was $43 million and $36 million, respectively. Catastrophe losses in the third quarters of 2025 and 2024 were $0 million and $4 million, respectively. The higher underlying underwriting margins primarily reflected higher business volumes, partially offset by the impact of earned pricing. Income tax expense in the third quarter of 2025 was higher than in the same period of 2024, primarily reflecting the impact of the increase in segment income before income taxes.\n44\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nSegment income in the first nine months of 2025 was $714 million, $127 million or 22% higher than segment income of $587 million in the same period of 2024. The increase in segment income before income taxes primarily reflected the pre-tax impacts of (i) higher net favorable prior year reserve development, (ii) higher net investment income and (iii) lower catastrophe losses, partially offset by (iv) lower underlying underwriting margins. Net favorable prior year reserve development in the first nine months of 2025 and 2024 was $191 million and $84 million, respectively. Catastrophe losses in the first nine months of 2025 and 2024 were $24 million and $49 million, respectively. The lower underlying underwriting margins primarily reflected (i) the impact of earned pricing and (ii) higher general and administrative expenses, partially offset by (iii) higher business volumes. Income tax expense in the first nine months of 2025 was higher than in the same period of 2024, primarily reflecting the impact of the increase in segment income before income taxes.\nRevenues\nEarned Premiums\nEarned premiums in the third quarter of 2025 were $1.04 billion, $33 million or 3% higher than in the same period of 2024. Earned premiums in the first nine months of 2025 were $3.06 billion, $116 million or 4% higher than in the same period of 2024. The increases in both periods of 2025 primarily reflected increases in net written premiums in prior quarters, including the impact of longer duration surety bonds and multi-year management liability policies.\nNet Investment Income\nNet investment income in the third quarter of 2025 was $116 million, $15 million or 15% higher than in the same period of 2024. Net investment income in the first nine months of 2025 was $325 million, $40 million or 14% higher than in the same period of 2024. Included in Bond & Specialty Insurance are certain legal entities whose invested assets and related net investment income are reported exclusively in this segment and not allocated among all business segments. Refer to the “Revenues—Net Investment Income” section of “Consolidated Results of Operations” herein for a discussion of the factors contributing to the increases in the Company’s consolidated net investment income in the third quarter and first nine months of 2025 compared with the same periods of 2024. In addition, refer to note 2 of the notes to the consolidated financial statements in the Company’s 2024 Annual Report for a discussion of the Company’s net investment income allocation methodology.\nClaims and Expenses\nClaims and Claim Adjustment Expense\nClaims and claim adjustment expenses in the third quarter of 2025 were $451 million, $10 million or 2% higher than in the same period of 2024, primarily reflecting the impacts of (i) higher business volumes and (ii) loss cost trends, partially offset by (iii) higher net favorable prior year reserve development and (iv) lower catastrophe losses.\nClaims and claim adjustment expenses in the first nine months of 2025 were $1.30 billion, $39 million or 3% lower than in the same period of 2024, primarily reflecting the impacts of (i) higher net favorable prior year reserve development and (ii) lower catastrophe losses, partially offset by (iii) higher business volumes and (iv) loss cost trends.\nFactors contributing to net favorable prior year reserve development during the third quarters and first nine months of 2025 and 2024 are discussed in more detail in note 7 of the notes to the unaudited consolidated financial statements.\nAmortization of Deferred Acquisition Costs\nAmortization of deferred acquisition costs in the third quarter of 2025 was $197 million, $3 million or 2% higher than in the same period of 2024. Amortization of deferred acquisition costs in the first nine months of 2025 was $579 million, $20 million or 4% higher than in the same period of 2024. The increases in both periods of 2025 were generally consistent with the increases in earned premiums.\nGeneral and Administrative Expenses\nGeneral and administrative expenses in the third quarter of 2025 were $207 million, $4 million or 2% higher than in the same period of 2024. General and administrative expenses in the first nine months of 2025 were $626 million, $11 million or 2% higher than in the same period of 2024.\nIncome Tax Expense\nIncome tax expense in the third quarter of 2025 was $61 million, $4 million or 7% higher than in the same period of 2024, primarily reflecting the impact of the $32 million increase in segment income before income taxes. Income tax expense in the first nine months of 2025 was $180 million, $34 million or 23% higher than in the same period of 2024, primarily reflecting the impact of the $161 million increase in segment income before income taxes.\n45\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nCombined Ratio\nThe combined ratio of 81.6% in the third quarter of 2025 was 0.9 points lower than the combined ratio of 82.5% in the same period of 2024. The loss and loss adjustment expense ratio of 42.9% in the third quarter of 2025 was 0.5 points lower than the loss and loss adjustment expense ratio of 43.4% in the same period of 2024. The underwriting expense ratio of 38.7% in the third quarter of 2025 was 0.4 points lower than the underwriting expense ratio of 39.1% in the same period of 2024.\nNet favorable prior year reserve development in the third quarters of 2025 and 2024 provided 4.2 points and 3.5 points of benefit, respectively, to the combined ratio. Catastrophe losses in the third quarter of 2025 had no impact on the combined ratio. Catastrophe losses in the third quarter of 2024 accounted for 0.4 points of the combined ratio. The underlying combined ratio in the third quarter of 2025 was 0.2 points higher than the 2024 ratio on the same basis.\nThe combined ratio of 81.5% in the first nine months of 2025 was 3.4 points lower than the combined ratio of 84.9% in the same period of 2024. The loss and loss adjustment expense ratio of 42.2% in the first nine months of 2025 was 3.0 points lower than the loss and loss adjustment expense ratio of 45.2% in the same period of 2024. The underwriting expense ratio of 39.3% in the first nine months of 2025 was 0.4 points lower than the underwriting expense ratio of 39.7% in the same period of 2024.\nNet favorable prior year reserve development in the first nine months of 2025 and 2024 provided 6.2 points and 2.9 points of benefit, respectively, to the combined ratio. Catastrophe losses in the first nine months of 2025 and 2024 accounted for 0.8 points and 1.7 points, respectively, of the combined ratio. The underlying combined ratio in the first nine months of 2025 was 0.8 points higher than the 2024 ratio on the same basis, primarily reflecting the impact of earned pricing.\nWritten Premiums\nThe Bond & Specialty Insurance segment’s gross and net written premiums were as follows:\n \nGross Written Premiums\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2025\n2024\n2025\n2024\nDomestic:\n \n \n \n \nManagement Liability\n$\n679\n \n$\n697 \n$\n1,947\n \n$\n1,965 \nSurety\n349\n \n353 \n1,091\n \n1,040 \nTotal Domestic\n1,028\n \n1,050 \n3,038\n \n3,005 \nInternational\n132\n \n115 \n417\n \n363 \nTotal Bond & Specialty Insurance\n$\n1,160\n \n$\n1,165 \n$\n3,455\n \n$\n3,368 \n \nNet Written Premiums\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2025\n2024\n2025\n2024\nDomestic:\n \n \n \n \nManagement Liability\n$\n613\n \n$\n617 \n$\n1,755\n \n$\n1,746 \nSurety\n342\n \n344 \n1,017\n \n965 \nTotal Domestic\n955\n \n961 \n2,772\n \n2,711 \nInternational\n125\n \n111 \n392\n \n344 \nTotal Bond & Specialty Insurance\n$\n1,080\n \n$\n1,072 \n$\n3,164\n \n$\n3,055 \nGross written premiums in the third quarter of 2025 were comparable with the same period of 2024. Net written premiums in the third quarter of 2025 increased by 1% over the same period of 2024. Gross and net written premiums in the first nine months of 2025 increased by 3% and 4%, respectively, over the same period of 2024.\n46\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nDomestic.\n  Net written premiums of $955 million in the third quarter of 2025 decreased by 1% from the same period of 2024. Net written premiums of $2.77 billion in the first nine months of 2025 increased by 2% over the same period of 2024. Excluding the surety line of business, for which the following are not relevant measures, retention rates remained strong in the third quarter and first nine months of 2025 but decreased from the same periods of 2024. Renewal premium changes in the third quarter and first nine months of 2025 remained positive and were higher than in the same periods of 2024. New business premiums in the third quarter and first nine months of 2025 decreased from the same periods of 2024. \nInternational.\n  Net written premiums of $125 million and $392 million in the third quarter and first nine months of 2025, respectively, increased by 13% and 14%, respectively, over the same periods of 2024. The increases in both periods of 2025 were primarily driven by increases in the United Kingdom and broader Europe.\nPersonal Insurance\nResults of Personal Insurance were as follows:\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(dollars in millions)\n2025\n2024\n2025\n2024\nRevenues\n \n \n \n \nEarned premiums\n$\n4,393\n \n$\n4,221 \n$\n12,998\n \n$\n12,329 \nNet investment income\n190\n \n161 \n535\n \n467 \nFee income\n13\n \n12 \n37\n \n30 \nOther revenues\n29\n \n24 \n76\n \n72 \nTotal revenues\n4,625\n \n4,418 \n13,646\n \n12,898 \nTotal claims and expenses\n3,613\n \n3,943 \n12,444\n \n12,354 \nSegment income before income taxes\n1,012\n \n475 \n1,202\n \n544 \nIncome tax expense\n205\n \n91 \n235\n \n93 \nSegment income\n$\n807\n \n$\n384 \n$\n967\n \n$\n451 \nLoss and loss adjustment expense ratio\n56.4\n \n%\n67.7 \n%\n70.3\n \n%\n74.5 \n%\nUnderwriting expense ratio\n24.9\n \n24.8 \n24.5\n \n24.7 \nCombined ratio\n81.3\n \n%\n92.5 \n%\n94.8\n \n%\n99.2 \n%\nOverview\nSegment income in the third quarter of 2025 was $807 million, $423 million or 110% higher than segment income of $384 million in the same period of 2024. The increase in segment income before income taxes was driven by the pre-tax impacts of (i) lower catastrophe losses, (ii) higher underlying underwriting margins and (iii) higher net investment income, partially offset by (iv) lower net favorable prior year reserve development. Catastrophe losses in the third quarters of 2025 and 2024 were $263 million and $595 million, respectively. Net favorable prior year reserve development in the third quarters of 2025 and 2024 was $104 million and $181 million, respectively. The higher underlying underwriting margins primarily reflected the impacts of (i) lower losses in the automobile product line, (ii) the benefit of earned pricing in the homeowners and other product line, (iii) higher business volumes and (iv) lower non-catastrophe weather-related losses in the homeowners and other product line. Income tax expense in the third quarter of 2025 was higher than in the same period of 2024, primarily reflecting the impact of the increase in segment income before income taxes.\nSegment income in the first nine months of 2025 was $967 million, $516 million or 114% higher than segment income of $451 million in the same period of 2024. The increase in segment income before income taxes was driven by the pre-tax impacts of (i) higher underlying underwriting margins, (ii) higher net favorable prior year reserve development and (iii) higher net investment income, partially offset by (iv) higher catastrophe losses. Catastrophe losses in the first nine months of 2025 and 2024 were $2.56 billion and $2.17 billion, respectively. Net favorable prior year reserve development in the first nine months of 2025 and 2024 was $496 million and $420 million, respectively. The higher underlying underwriting margins primarily reflected the impacts of (i) the benefit of earned pricing, (ii) lower losses in the automobile product line, (iii) higher business volumes and (iv) lower non-catastrophe weather-related and non-weather losses in the homeowners and other product line. Income tax expense in the first nine months of 2025 was higher than in the same period of 2024, primarily reflecting the impact of the increase in segment income before income taxes.\n47\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nRevenues\nEarned Premiums\nEarned premiums in the third quarter of 2025 were $4.39 billion, $172 million or 4% higher than in the same period of 2024. Earned premiums in the first nine months of 2025 were $13.00 billion, $669 million or 5% higher than in the same period of 2024. The increases in both periods of 2025 primarily reflected the increase in net written premiums over the preceding twelve months.\nNet Investment Income\nNet investment income in the third quarter of 2025 was $190 million, $29 million or 18% higher than in the same period of 2024. Net investment income in the first nine months of 2025 was $535 million, $68 million or 15% higher than in the same period of 2024. Refer to the “Revenues—Net Investment Income” section of the “Consolidated Results of Operations” discussion herein for a description of the factors contributing to the increases in the Company’s consolidated net investment income in the third quarter and first nine months of 2025 compared with the same periods of 2024. In addition, refer to note 2 of the notes to the consolidated financial statements in the Company’s 2024 Annual Report for a discussion of the Company’s net investment income allocation methodology.\nOther Revenues\nOther revenues in the third quarters and first nine months of 2025 and 2024 primarily consisted of installment premium charges.\nClaims and Expenses\nClaims and Claim Adjustment Expenses\nClaims and claim adjustment expenses in the third quarter of 2025 were $2.48 billion, $381 million or 13% lower than in the same period of 2024, primarily reflecting the impacts of (i) lower catastrophe losses, (ii) lower losses in the automobile product line and (iii) lower non-catastrophe weather-related losses in the homeowners and other product line, partially offset by (iv) loss cost trends and (v) lower net favorable prior year reserve development.\nClaims and claim adjustment expenses in the first nine months of 2025 were $9.13 billion, $53 million or 1% lower than in the same period of 2024, primarily reflecting the impacts of (i) lower losses in the automobile product line, (ii) lower non-catastrophe weather-related and non-weather losses in the homeowners and other product line and (iii) higher net favorable prior year reserve development, partially offset by (iv) higher catastrophe losses and (v) loss cost trends.\nFactors contributing to net favorable prior year reserve development during the third quarters and first nine months of 2025 and 2024 are discussed in more detail in note 7 of the notes to the unaudited consolidated financial statements.\nAmortization of Deferred Acquisition Costs\nAmortization of deferred acquisition costs in the third quarter of 2025 was $679 million, $13 million or 2% higher than in the same period of 2024. Amortization of deferred acquisition costs in the first nine months of 2025 was $2.02 billion, $64 million or 3% higher than in the same period of 2024. The increases in both periods of 2025 were generally consistent with the increases in earned premiums.\nGeneral and Administrative Expenses\nGeneral and administrative expenses in the third quarter of 2025 were $458 million, $38 million or 9% higher than in the same period of 2024. General and administrative expenses in the first nine months of 2025 were $1.30 billion, $79 million or 6% higher than in the same period of 2024. The increases in both periods of 2025 primarily reflected higher contingent commissions.\nIncome Tax Expense\nIncome tax expense in the third quarter of 2025 was $205 million, $114 million or 125% higher than in the same period of 2024, primarily reflecting the impact of the $537 million increase in segment income before income taxes. Income tax expense in the first nine months of 2025 was $235 million, $142 million or 153% higher than in the same period of 2024, primarily reflecting the impact of the $658 million increase in segment income before income taxes.\n48\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nCombined Ratio\nThe combined ratio of 81.3% in the third quarter of 2025 was 11.2 points lower than the combined ratio of 92.5% in the same period of 2024. The loss and loss adjustment expense ratio of 56.4% in the third quarter of 2025 was 11.3 points lower than the loss and loss adjustment expense ratio of 67.7% in the same period of 2024. The underwriting expense ratio of 24.9% in the third quarter of 2025 was 0.1 points higher than the underwriting expense ratio of 24.8% in the same period of 2024.\nCatastrophe losses in the third quarters of 2025 and 2024 accounted for 6.0 points and 14.1 points, respectively, of the combined ratio. Net favorable prior year reserve development in the third quarters of 2025 and 2024 provided 2.4 points and 4.3 points of benefit, respectively, to the combined ratio. The underlying combined ratio in the third quarter of 2025 was 5.0 points lower than the 2024 ratio on the same basis, primarily reflecting the impacts of (i) lower losses in the automobile product line, (ii) the benefit of earned pricing in the homeowners and other product line and (iii) lower non-catastrophe weather-related losses in the homeowners and other product line.\nThe combined ratio of 94.8% in the first nine months of 2025 was 4.4 points lower than the combined ratio of 99.2% in the same period of 2024. The loss and loss adjustment expense ratio of 70.3% in the first nine months of 2025 was 4.2 points lower than the loss and loss adjustment expense ratio of 74.5% in the same period of 2024. The underwriting expense ratio of 24.5% in the first nine months of 2025 was 0.2 points lower than the underwriting expense ratio of 24.7% in same period of 2024.  \nCatastrophe losses in the first nine months of 2025 and 2024 accounted for 19.7 points and 17.6 points, respectively, of the combined ratio. Net favorable prior year reserve development in the first nine months of 2025 and 2024 provided 3.8 points and 3.4 points of benefit, respectively, to the combined ratio. The underlying combined ratio in the first nine months of 2025 was 6.1 points lower than the 2024 ratio on the same basis, primarily reflecting the impacts of (i) the benefit of earned pricing, (ii) lower losses in the automobile product line and (iii) lower non-catastrophe weather-related and non-weather losses in the homeowners and other product line.\nWritten Premiums\nPersonal Insurance’s gross and net written premiums were as follows:\n \nGross Written Premiums\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2025\n2024\n2025\n2024\nDomestic:\n \n \n \n \nAutomobile\n$\n2,070\n \n$\n2,143 \n$\n5,910\n \n$\n6,016 \nHomeowners and Other\n2,599\n \n2,476 \n7,146\n \n6,676 \nTotal Domestic\n4,669\n \n4,619 \n13,056\n \n12,692 \nInternational\n179\n \n192 \n513\n \n539 \nTotal Personal Insurance\n$\n4,848\n \n$\n4,811 \n$\n13,569\n \n$\n13,231 \n \nNet Written Premiums\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2025\n2024\n2025\n2024\nDomestic:\n \n \n \n \nAutomobile\n$\n2,062\n \n$\n2,138 \n$\n5,889\n \n$\n5,998 \nHomeowners and Other\n2,489\n \n2,410 \n6,822\n \n6,392 \nTotal Domestic\n4,551\n \n4,548 \n12,711\n \n12,390 \nInternational\n167\n \n180 \n491\n \n517 \nTotal Personal Insurance\n$\n4,718\n \n$\n4,728 \n$\n13,202\n \n$\n12,907 \nGross premiums in the third quarter of 2025 increased by 1% over the same period of 2024. Net written premiums in the third quarter of 2025 were comparable with the same period of 2024. Gross and net written premiums in the first nine months of 2025 increased by 3% and 2%, respectively, over the same period of 2024.\n49\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nDomestic\nAutomobile net written premiums of $2.06 billion and $5.89 billion in the third quarter and first nine months of 2025, respectively, decreased by 4% and 2%, respectively, from the same periods of 2024. Retention rates remained strong in the third quarter and first nine months of 2025 and increased slightly over the same periods of 2024. Renewal premium changes in the third quarter and first nine months of 2025 remained positive but were lower than in the same periods of 2024. New business premiums in the third quarter and first nine months of 2025 increased over the same periods of 2024.\nHomeowners and Other net written premiums of $2.49 billion and $6.82 billion in the third quarter and first nine months of 2025, respectively, increased by 3% and 7%, respectively, over the same periods of 2024. Retention rates remained strong in the third quarter and first nine months of 2025 but decreased slightly from the same periods of 2024. Renewal premium changes in the third quarter and first nine months of 2025 remained positive and were higher than in the same periods of 2024. New business premiums in the third quarter and first nine months of 2025 decreased from the same periods of 2024.\nFor its Domestic business, Personal Insurance had approximately 8.5 million and 8.8 million active policies at September 30, 2025 and 2024, respectively.\nInternational\nInternational net written premiums of $167 million in the third quarter of 2025 decreased by 7% from the same period of 2024, driven by decreases in the homeowners and other and automobile product lines. International net written premiums of $491 million in the first nine months of 2025 decreased by 5% from the same period of 2024, driven by decreases in the automobile product line.\nFor its International business, Personal Insurance had approximately 365,000 and 432,000 active policies at September 30, 2025 and 2024, respectively.\nInterest Expense and Other\n \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(in millions)\n2025\n2024\n2025\n2024\nIncome (loss)\n$\n(97)\n$\n(86)\n$\n(270)\n$\n(257)\nThe Income (loss) for Interest Expense and Other for the third quarters of 2025 and 2024 was $(97) million and $(86) million, respectively.  Pre-tax interest expense for the third quarters of 2025 and 2024 was $111 million and $98 million, respectively.  After-tax interest expense for the third quarters of 2025 and 2024 was $88 million and $77 million, respectively. The Income (loss) for Interest Expense and Other in the first nine months of 2025 and 2024 was $(270) million and $(257) million, respectively.  Pre-tax interest expense in the first nine months of 2025 and 2024 was $309 million and $294 million, respectively. After-tax interest expense in the first nine months of 2025 and 2024 was $244 million and $232 million, respectively.\nASBESTOS CLAIMS AND LITIGATION\nThe Company believes that the property and casualty insurance industry has suffered from court decisions and other trends that have expanded insurance coverage for asbestos claims far beyond the original intent of insurers and policyholders. The Company has received and continues to receive a significant number of asbestos claims. Factors underlying these claim filings include continued intensive advertising by lawyers seeking asbestos claimants and the focus by plaintiffs on defendants, such as manufacturers of talcum powder, who were not traditionally sued and/or primary targets of asbestos litigation.  Many defendants have also been subject to increased settlement demands, in part due to the bankruptcy of many traditional primary targets of asbestos litigation. Currently, in many jurisdictions, those who allege very serious injury and who can present credible medical evidence of their injuries are receiving priority trial settings in the courts, while those who have not shown any credible disease manifestation are having their hearing dates delayed or placed on an inactive docket. Prioritizing claims involving credible evidence of injuries, along with the focus on defendants who were not traditionally primary targets of asbestos litigation, contributes to the claims and claim adjustment expense payment patterns experienced by the Company. The Company’s asbestos-related claims and claim adjustment expense experience also has been impacted by the unavailability of other insurance sources potentially available to policyholders, whether through exhaustion of policy limits or through the insolvency of other participating insurers.\n50\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nThe Company continues to be involved in disputes, including litigation, with a number of policyholders, some of whom are in bankruptcy, over coverage for asbestos-related claims. Many coverage disputes with policyholders are only resolved through settlement agreements. Because many policyholders make exaggerated demands, it is difficult to predict the outcome of settlement negotiations. Settlements involving bankrupt policyholders may include extensive releases which are favorable to the Company, but which could result in settlements for larger amounts than originally anticipated. Although the Company has seen a reduction in the overall risk associated with these disputes, it remains difficult to predict the ultimate cost of these claims. As in the past, the Company will continue to pursue settlement opportunities.\nIn addition to claims against policyholders, proceedings have been launched directly against insurers, including the Company, by individuals challenging insurers’ conduct with respect to the handling of past asbestos claims and by individuals seeking damages arising from alleged asbestos-related bodily injuries.\n  It is possible that other direct action\ns against insurers, including the Company, could be filed in the future.  It is difficult to predict the outcome of these proceedings, including whether the plaintiffs would be able to sustain these actions against insurers based on novel legal theories of liability. The Company believes it has meritorious defenses to any such claims and has received favorable rulings in certain jurisdictions.\nBecause each policyholder presents different liability and coverage issues, the Company generally \nreviews the exposure presented by each policyholder with open claims at least annually. Among the factors the Company may consider in the course of this review are: available insurance coverage, including the role of any umbrella or excess insurance the Company has issued to the policyholder; limits and deductibles; an analysis of the policyholder’s potential liability, including as a result of the bankruptcy of other defendants; the jurisdictions involved, including any trends, judicial rulings or legislative ac\ntions in those jurisdictions; past and anticipated future claim activity and loss development on pending claims; past settlement values of similar claims; allocated claim adjustment expense; the potential role of other insurance; the role, if any, of non-asbestos claims or potential non-asbestos claims in any resolution process; and applicable coverage defenses or determinations, if any, including the determination as to whether or not an asbestos claim is a products/completed operation claim subject to an aggregate limit and the available coverage, if any, for that claim. \nThe Company also reviews its asbestos reserves quarterly. These reviews include, as appropriate, an analysis of exposure and claim payment patterns by policyholder, as well as recent settlements, policyholder bankruptcies, judicial rulings and legislative actions. The Company also analyzes developing payment patterns among policyholders and the assumed reinsurance component of reserves, as well as projected reinsurance billings and recoveries. In addition, the Company reviews its historical gross and net loss and expense paid experience, year-by-year, to assess any emerging trends, fluctuations, or characteristics suggested by the aggregate paid activity. Conventional actuarial methods are not utilized to establish asbestos reserves, and the Company’s evaluations have not resulted in a reliable method to determine a meaningful average asbestos defense or indemnity payment.  \nDuring the third quarter of 2025, the Company completed its annual in-depth asbestos claim review, including a review of policyholders with open claims and litigation cases for potential product and “non-product” liability. While the latest available government data continue to reflect a declining trend in deaths caused by mesothelioma, the number of policyholders with open asbestos claims was relatively flat compared to 2024. Net asbestos payments were down compared to 2024, as described below.  Payments on behalf of these policyholders continue to be influenced by the factors described above, including an increase in severity for certain policyholders and a high level of litigation activity in a limited number of jurisdictions where individuals alleging serious asbestos-related injury, primarily mesothelioma, continue to target defendants who were not traditionally sued and/or primary targets of asbestos litigation. The completion of the analyses described above and the annual review in the third quarters of 2025 and 2024 resulted in $277 million and $242 million increases, respectively, to the Company’s net asbestos reserves. In both 2025 and 2024, the reserve increases were primarily driven by increases in the Company’s estimate of projected settlement and defense costs related to a broad number of policyholders. The increase in the estimate of projected settlement and defense costs primarily resulted from payment trends that continue to be higher than previously anticipated due to the continued high level of mesothelioma claim filings and the impact of the current litigation environment surrounding those claims discussed above.\nOver the past decade, the property and casualty insurance industry, including the Company, has experienced net unfavorable prior year reserve development with regard to asbestos reserves, but the Company believes that over that period there has been a reduction in the volatility associated with the Company’s overall asbestos exposure as the overall asbestos environment has evolved from one dominated by exposure to significant litigation risks, particularly coverage disputes relating to policyholders in bankruptcy who were asserting that their claims were not subject to the aggregate limits contained in their policies, to an environment primarily driven by a frequency of litigation related to individuals with mesothelioma. The Company’s overall view of the current underlying\n \nasbestos environment is essentially unchanged from recent periods, and there remains a high degree of uncertainty with respect to future exposure to asbestos claims.\n51\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nNet asbestos paid loss and loss adjustment expenses in the first nine months of 2025 and 2024 were $171 million and $201 million, respectively. Net asbestos reserves were $1.45 billion and $1.42 billion as of September 30, 2025 and 2024, respectively.\nThe following table displays activity for asbestos losses and loss adjustment expenses and reserves:\n(as of and for the nine months ended September 30, in millions)\n2025\n2024\nBeginning reserves:\n \n \nGross\n$\n1,708\n \n$\n1,768 \nCeded\n(370)\n(390)\nNet\n1,338\n \n1,378 \nIncurred losses and loss adjustment expenses:\n \n \nGross\n327\n \n279 \nCeded\n(50)\n(37)\nNet\n277\n \n242 \nPaid loss and loss adjustment expenses:\n \n \nGross\n239\n \n233 \nCeded\n(68)\n(32)\nNet\n171\n \n201 \nForeign exchange and other:\n \n \nGross\n2\n \n1 \nCeded\n—\n \n— \nNet\n2\n \n1 \nEnding reserves:\n \n \nGross\n1,798\n \n1,815 \nCeded\n(352)\n(395)\nNet\n$\n1,446\n \n$\n1,420 \nUNCERTAINTY REGARDING ADEQUACY OF ASBESTOS RESERVES\nAs a result of the processes and procedures discussed above, management believes that the reserves carried for asbestos claims are appropriately established based upon known facts, current law and management’s judgment. However, the uncertainties surrounding the final resolution of these claims continue, and it is difficult to determine the ultimate exposure for asbestos claims and related litigation. As a result, these reserves are subject to revision as new information becomes available and as claims develop. The continuing uncertainties include, without limitation:\n•\nthe risks and lack of predictability inherent in complex litigation;\n•\na further increase in the cost to resolve, and/or the number of, asbestos claims beyond that which is anticipated;\n•\nthe emergence of a greater number of asbestos claims than anticipated as a result of extended life expectancies resulting from medical advances and lifestyle improvements;\n•\nthe role of any umbrella or excess policies we have issued;\n•\nthe resolution or adjudication of disputes concerning coverage for asbestos claims in a manner inconsistent with our previous assessment of these disputes;\n•\nthe number and outcome of direct actions against us;\n•\nfuture developments pertaining to our ability to recover reinsurance for asbestos claims;\n•\nany impact on asbestos defendants we insure due to the bankruptcy of other asbestos defendants;\n•\nthe unavailability of other insurance sources potentially available to policyholders, whether through exhaustion of policy limits or through the insolvency of other participating insurers; and\n•\nuncertainties arising from the insolvency or bankruptcy of policyholders.\nChanges in the legal, regulatory and legislative environment may impact the future resolution of asbestos claims and result in adverse loss reserve development. The emergence of a greater number of asbestos claims beyond that which is anticipated may result in adverse loss reserve development. Changes in applicable legislation and future court and regulatory decisions and \n52\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\ninterpretations, including the outcome of legal challenges to legislative and/or judicial reforms establishing medical criteria for the pursuit of asbestos claims, could affect the settlement of asbestos claims. It is also difficult to predict the ultimate outcome of complex coverage disputes until settlement negotiations near completion and significant legal questions are resolved or, failing settlement, until the dispute is adjudicated. This is particularly the case with policyholders in bankruptcy where negotiations often involve a large number of claimants and other parties and require court approval to be effective. As part of its continuing analysis of asbestos reserves, the Company continues to study the implications of these and other developments.\nBecause of the uncertainties set forth above, additional liabilities may arise for amounts in excess of the Company’s current reserves.  In addition, the Company’s estimate of claims and claim adjustment expenses may change. These additional liabilities or increases in estimates, or a range of either, cannot now be reasonably estimated and could result in income statement charges that could be material to the Company’s operating results in future periods.\nINVESTMENT PORTFOLIO\nThe Company’s invested assets as of September 30, 2025 were $103.68 billion, of which 94% was invested in fixed maturity and short-term investments, 1% in equity securities, 1% in real estate investments and 4% in other investments.  Because the primary purpose of the investment portfolio is to fund future claims payments, the Company employs a thoughtful investment philosophy that focuses on appropriate risk-adjusted returns. A significant majority of funds available for investment are deployed in a widely diversified portfolio of high quality, liquid, taxable U.S. government, tax-exempt and taxable U.S. municipal and taxable corporate and U.S. agency mortgage-backed bonds.\nThe carrying value of the Company’s fixed maturity portfolio as of September 30, 2025 was $91.11 billion.  The Company closely monitors the duration of its fixed maturity investments, and investment purchases and sales are executed with the objective of having adequate funds available to satisfy the Company’s insurance and debt obligations. The weighted average credit quality of the Company’s fixed maturity portfolio was “Aa2” as of both September 30, 2025 and December 31, 2024.  The weighted average credit quality of the Company’s fixed maturity portfolio, excluding U.S. Treasury securities, was “Aa3” and “Aa2” as of September 30, 2025 and December 31, 2024, respectively. Below investment grade securities represented 1.2% of the total fixed maturity investment portfolio as of both September 30, 2025 and December 31, 2024. The weighted average effective duration of fixed maturities and short-term securities was 4.6 (4.9 excluding short-term securities) as of September 30, 2025 and 4.3 (4.5 excluding short-term securities) as of December 31, 2024.\nObligations of U.S. States, Municipalities and Political Subdivisions\nThe Company’s fixed maturity investment portfolio as of September 30, 2025 and December 31, 2024 included $30.30 billion and $27.19 billion, respectively, of securities which are obligations of U.S. states, municipalities and political subdivisions (collectively referred to as the municipal bond portfolio). The municipal bond portfolio is diversified across the United States, the District of Columbia and Puerto Rico and includes general obligation and revenue bonds issued by states, cities, counties, school districts and similar issuers. Included in the municipal bond portfolio as of September 30, 2025 and December 31, 2024 were $326 million and $572 million, respectively, of pre-refunded bonds, which are bonds for which U.S. states or municipalities have established irrevocable trusts, almost exclusively comprised of U.S. Treasury securities and obligations of U.S. government and government agencies and authorities. These trusts were created to fund the payment of principal and interest due under the bonds. The irrevocable trusts are verified as to their sufficiency by an independent verification agent of the underwriter, issuer or trustee. All of the Company’s holdings of securities issued by Puerto Rico and related entities have either been pre-refunded and therefore are defeased by U.S. Treasury securities or have FHA guarantees subject to federal appropriation.\nThe Company bases its investment decision on the underlying credit characteristics of the municipal security. The weighted average credit rating of the municipal bond portfolio was “Aaa/Aa1” as of both September 30, 2025 and December 31, 2024.\nMortgage-Backed Securities, Collateralized Mortgage Obligations and Pass-Through Securities\nThe Company’s fixed maturity investment portfolio as of September 30, 2025 and December 31, 2024 included $13.36 billion and $12.61 billion, respectively, of residential mortgage-backed securities, including pass-through securities and collateralized mortgage obligations (CMOs), all of which are subject to prepayment risk (either shortening or lengthening of duration). While prepayment risk for securities and its effect on income cannot be fully controlled, particularly when interest rates move dramatically, the Company’s inv\nestment strategy generally favors securities that reduce this risk within expected interest rate ranges. Included in the totals as of September 30, 2025 and December 31, 2024 were $10.33 billion and $9.93 billion, respectively, of GNMA, FNMA, FHLMC (excluding FHA project loans) and Canadian government guaranteed residential mortgage-backed pass-through securities classified as available for sale. Also included in those totals were residential CMOs \n53\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nclassified as available for sale with a fair value of $3.03 billion and $2.68 billion as of September 30, 2025 and December 31, 2024, respectively. Approximately 44% and 43% of the Company’s CMO holdings as of September 30, 2025 and December 31, 2024, respectively, were guaranteed by or fully collateralized by securities issued by GNMA, FNMA or FHLMC.  The weighted average credit rating of the $1.68 billion and $1.53 billion of non-guaranteed CMO holdings was “Aaa” \nas of both \nSeptember 30, 2025 and December 31, 2024. The weighted average credit rating of all of the above securities was “Aa1” and “Aaa/Aa1\n” as of September 30, 2025 and December 31, 2024, respectively. For further discussion regarding the Company’s investments in residential CMOs, see “Part II—Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations—Investment Portfolio” in the Company’s 2024 Annual Report.\nEquity Securities, Real Estate and Short-Term Investments\nSee note 1 of the notes to the consolidated financial statements in the Company’s 2024 Annual Report for further information about these invested asset classes.\nOther Investments\nThe Company also invests in private equity, hedge fund and real estate partnerships, and joint ventures. These asset classes have historically provided a higher return than investments in fixed maturities but are subject to more volatility. As of September 30, 2025 and December 31, 2024, the carrying value of the Company’s other investments was $4.19 billion and $4.20 billion, respectively.\nInvestments in private equity, hedge fund and real estate partnerships that are accounted for under the equity method of accounting \ntypically report their financial statement information to the Company one month to three months following the end of the reporting period. Accordingly, net investment income from these other i\nnvestments is generally reflected in the Company’s financial statements on a quarter lag basis.\nCATASTROPHE REINSURANCE COVERAGE\nThe Company’s normal renewals and changes to its catastrophe reinsurance coverage occur in January and July each year. The changes effective in January are discussed in the “Catastrophe Reinsurance” section of “Part I—Item 1—Business” in the Company’s 2024 Annual Report, and changes effective in July are discussed in the “Catastrophe Reinsurance Coverage” section of “Part I—Item 2—Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the Company’s Quarterly Report on Form 10-Q for the quarter ended June 30, 2025.  \nThe Company regularly reviews its catastrophe reinsurance coverage and may adjust such coverage in the future.   \nREINSURANCE RECOVERABLES\nThe Company reinsures a portion of the risks it underwrites in order to control its exposure to losses. For a description of the Company’s reinsurance recoverables, refer to “Part II—Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations—Reinsurance Recoverables” in the Company’s 2024 Annual Report.\nThe following table summarizes the composition of the Company’s reinsurance recoverables:\n(in millions)\nSeptember 30,\n2025\nDecember 31, 2024\nGross reinsurance recoverables on paid and unpaid claims and claim adjustment expenses\n$\n4,447\n \n$\n3,962 \nGross structured settlements\n2,546\n \n2,626 \nMandatory pools and associations \n1,446\n \n1,531 \nGross reinsurance recoverables\n8,439\n \n8,119 \nAllowance for estimated uncollectible reinsurance\n(141)\n(119)\nNet reinsurance recoverables\n$\n8,298\n \n$\n8,000 \n54\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nOUTLOOK\nThe following discussion provides outlook information for certain key drivers of the Company’s results of operations and capital position.\nPremiums. \n The Company’s earned premiums are a function of net written premium volume. Net written premiums comprise both renewal business and new business and are recognized as earned premium over the term of the underlying policies. When business renews, the amount of net written premiums associated with that business may increase or decrease (renewal premium change) as a result of increases or decreases in rate and/or insured exposures, which the Company considers as a measure of units of exposure (such as the number and value of vehicles or properties insured). Net written premiums from both renewal and new business, and therefore earned premiums, are impacted by competitive market conditions as well as general economic conditions, which, particularly in the case of Business Insurance, affect audit premium adjustments, policy endorsements and mid-term cancellations. Net written premiums may also be impacted by the structure of reinsurance programs and related costs, as well as changes in foreign currency exchange rates.\nOverall, the Company expects that retention levels (the amount of expiring premium that renews, before the impact of renewal premium changes) will remain strong by historical standards during the remainder of 2025.   \nProperty and casualty insurance market conditions are expected to remain competitive during the remainder of 2025 for new business. In each of the Company’s business segments, new business generally has less of an impact on underwriting profitability than renewal business, given the volume of new business relative to renewal business. However, in periods of meaningful increases in new business, despite its positive impact on underwriting gains over time, the impact of higher new business levels may negatively impact the combined ratio for a period of time. In periods of meaningful decreases in new business, despite its negative impact on underwriting gains over time, the impact of lower new business levels may positively impact the combined ratio for a period of time.  \nEffective January 1, 2025, the Company renewed a quota share reinsurance agreement with subsidiaries of Fidelis Insurance Holdings Limited (Fidelis) for 2025 pursuant to which the Company assumes 20% of the subject gross written premiums of Fidelis on a risk-attaching basis, subject to a loss ratio cap. The Company’s portion of premiums from Fidelis is reported as part of the International results of Business Insurance. The Company also has a minority investment in Fidelis.\nUnderwriting Gain/Loss.\n  The Company’s underwriting gain/loss can be significantly impacted by catastrophe losses and net favorable or unfavorable prior year reserve development, as well as underlying underwriting margins. Underlying underwriting margins can be impacted by a number of factors, including variability in non-catastrophe weather, large loss and other loss activity; changes in current period loss estimates resulting from prior period loss development; changes in loss cost trends; changes in business mix; changes in reinsurance coverages and/or costs; premium adjustments; and variability in expenses and assessments.\nCatastrophe losses and non-catastrophe weather-related losses are inherently unpredictable from period to period. The Company’s results of operations could be adversely impacted if significant catastrophe and non-catastrophe weather-related losses were to occur.\nOn average for the ten-year period ended December 31, 2024, the Company experienced approximately 38% of its annual catastrophe losses during the second quarter, primarily arising out of severe wind and hail storms, including tornadoes.  Hurricanes, wildfires and winter storms tend to happen at other times of the year and can also have a material impact on the Company’s results of operations. Catastrophe losses incurred in a particular quarter in any given year may differ materially from historical experience. In addition, most of the Company’s reinsurance programs renew on January 1 or July 1 of each year, and, therefore, any changes to the availability, cost or coverage terms of such programs will be effective after such dates.\nOver much of the past decade, the Company’s results have included significant amounts of net favorable prior year reserve development driven by better than expected loss experience. However, given the inherent uncertainty in estimating claims and claim adjustment expense reserves, loss experience could develop such that the Company recognizes in future periods higher or lower levels of favorable prior year reserve development, no favorable prior year reserve development or unfavorable prior year reserve development. In addition, the ongoing review of prior year claims and claim adjustment expense reserves, or other changes in current period circumstances, may result in the Company revising current year loss estimates upward or downward in future periods of the current year.\nIt is possible that changes in economic conditions, the supply chain, international trade, including the impact of tariffs, the labor market and geopolitical tensions, as well as steps taken by federal, state and/or local governments and the Federal Reserve \n55\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\ncould lead to higher or lower inflation than the Company anticipated, which could in turn lead to an increase or decrease in the Company’s loss costs and the need to strengthen or reduce claims and claim adjustment expense reserves. These impacts of inflation on loss costs and claims and claim adjustment expense reserves could be more pronounced for those lines of business that require a relatively longer period of time to finalize and settle claims for a given accident year and, accordingly, are relatively more inflation sensitive. Higher costs of labor, parts and raw materials adversely impacted severity in recent years in our personal and commercial businesses. Tariff and immigration policy could continue to impact severity. For a further discussion, see “Part I—Item 1A—Risk Factors—If actual claims exceed our claims and claim adjustment expense reserves, or if changes in the estimated level of claims and claim adjustment expense reserves are necessary, including as a result of, among other things, changes in the legal/tort, regulatory and economic environments in which the Company operates, our financial results could be materially and adversely affected” in the Company’s 2024 Annual Report.  \nThe Company’s results of operations may be impacted by a number of other factors, including an economic slowdown, a recession, financial market volatility, a continued shutdown of the U.S. government, monetary and fiscal policy measures, heightened geopolitical tensions, fluctuations in interest rates and foreign currency exchange rates, the political and regulatory environment, changes to the U.S. Federal budget and potential changes in tax laws.  \nInvestment Portfolio.\n The Company expects to continue to focus its investment strategy on maintaining a high-quality investment portfolio and a relatively short average effective duration. The weighted average effective duration of fixed maturities and short-term securities was 4.6 (4.9 excluding short-term securities) as of September 30, 2025.  From time to time, the Company enters into short positions in U.S. Treasury futures contracts to manage the duration of its fixed maturity portfolio. As of September 30, 2025, the Company had no open U.S. Treasury futures contracts. The Company regularly evaluates its investment alternatives and mix. Currently, the majority of the Company’s investments are comprised of a widely diversified portfolio of high-quality, liquid, taxable U.S. government, tax-exempt and taxable U.S. municipal, taxable corporate and U.S. agency mortgage-backed bonds.\nThe Company also invests much smaller amounts in equity securities, real estate and private equity, hedge fund and real estate partnerships, and joint ventures. These investment classes have the potential for higher returns but also the potential for greater volatility and higher degrees of risk, including less stable rates of return and less liquidity.\nApproximately 30% of the fixed maturity portfolio is expected to mature over the next three years (including the early redemption of bonds, assuming interest rates (including credit spreads) do not rise significantly by applicable call dates). As a result, the overall yield on and composition of its portfolio could be meaningfully impacted by the types of investments available for reinvestment with the proceeds of maturing bonds. \nNet investment income is a material contributor to the Company’s results of operations. Based on the Company’s current expectations for the impact of expected higher reinvestment yields on the Company’s fixed income investments and higher levels of fixed income investments, the Company expects that after-tax net investment income from that portfolio will be approximately $810 million in the fourth quarter of 2025, and the Company also currently expects that after-tax net investment income from that portfolio will be approximately $810 million in the first quarter of 2026 and growing to approximately $885 million in the fourth quarter of 2026. This expectation could be impacted by the direction of interest rates and disruptions in global financial markets. Included in other investments are private equity, hedge fund and real estate partnerships that are accounted for under the equity method of accounting and typically report their financial statement information to the Company one month to three months following the end of the reporting period. Accordingly, net investment income or loss from these other investments is generally reflected in the Company’s financial statements on a quarter lag basis. The Company’s net investment income in future periods from its non-fixed income investment portfolio will be impacted, positively or negatively, by the performance of global financial markets. \nThe Company had net pre-tax realized investment losses of $28 million in the first nine months of 2025. Changes in global financial markets could result in net realized investment gains or losses in the Company’s investment portfolio. \nThe Company had a net pre-tax unrealized investment loss of $2.48 billion ($1.97 billion after-tax) in its fixed maturity investment portfolio as of September 30, 2025, compared to $4.61 billion ($3.64 billion after-tax) as of December 31, 2024. The net unrealized investment loss is primarily due to the impact of movements in interest rates. The decrease in the net unrealized investment loss in the first nine months of 2025 was due to decreases in interest rates. While the Company does not attempt to predict future interest rate movements, a rising interest rate environment reduces the market value of fixed maturity investments and, therefore, reduces shareholders’ equity, and a declining interest rate environment has the opposite effects. The net unrealized loss discussed above is considered temporary in nature as it is not due to credit impairments, there is no impact on expected contractual cash flows from fixed maturities, and the Company generally holds its fixed maturity investments to maturity. In addition, given the temporary nature of net unrealized losses combined with the Company’s strong operating cash \n56\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nflows (which include income received on investments and the proceeds received upon maturity of the investments), the net unrealized investment loss is not expected to meaningfully impact the Company’s assessment of capital adequacy or liquidity. Equity securities, which include common and non-redeemable preferred stocks, are reported at fair value with changes in fair value recognized in net income.\nAdditionally, disruptions in global financial markets could also impact the market value of the Company’s investment portfolio. The Company’s investment portfolio has benefited from certain tax exemptions (primarily those related to interest from municipal bonds) and certain other tax laws, including, but not limited to, those governing dividends-received deductions and tax credits (such as foreign tax credits). Changes in these laws could adversely impact the value of the Company’s investment portfolio. See “Our businesses are heavily regulated by the states and countries in which we conduct business, including licensing, market conduct and financial supervision, and changes in regulation, including changes in tax regulation, may reduce our profitability and limit our growth” included in “Part I—Item 1A—Risk Factors” in the Company’s 2024 Annual Report.\nFor further discussion of the Company’s investment portfolio, see “Investment Portfolio.” For a discussion of the risks to the Company’s business during or following a financial market disruption and risks to the Company’s investment portfolio, see the risk factors entitled “During or following a period of financial market disruption or an economic downturn, our business could be materially and adversely affected” and “Our investment portfolio is subject to credit and interest rate risk, and may suffer reduced or low returns or material realized or unrealized losses” included in “Part I—Item 1A—Risk Factors” in the Company’s 2024 Annual Report. For a discussion of the risks to the Company’s investments from foreign currency exchange rate fluctuations, see the risk factor entitled “We are subject to additional risks associated with our business outside the United States” included in “Part I—Item 1A—Risk Factors” in the Company’s 2024 Annual Report and see “Part II—Item 7A—Quantitative and Qualitative Disclosures About Market Risk-Foreign Currency Exchange Rate Risk” in the Company’s 2024 Annual Report.\nCapital Position\n.  The Company believes it has a strong capital position and, as part of its ongoing efforts to create shareholder value, expects to continue to return capital not needed to support its business operations to its shareholders, subject to the considerations described below. The Company expects that, generally over time, the combination of dividends to common shareholders and common share repurchases will likely not exceed net income. The Company also expects that to the extent that it continues to grow premium volumes, the level of capital to support the Company’s financial strength ratings will also increase, and accordingly, the amount of capital returned to shareholders relative to earnings would be somewhat less than it otherwise would have been absent the growth in premium volumes. Given the Company’s very strong capital position and earnings over the past four quarters, the Company currently expects to repurchase approximately $2.9 billion of the Company's common shares in the aggregate over the fourth quarter of 2025 and the first quarter of 2026. Included in this amount is $700 million of the net cash proceeds from the expected sale of the Company’s Canadian insurance business (excluding surety) to Definity Financial Corporation. The Canadian sale transaction is expected to close in the first quarter of 2026. The timing and actual number of shares to be repurchased in the future will depend on a variety of additional factors, including the Company’s financial position, earnings, share price, catastrophe losses, maintaining capital levels appropriate for the Company’s business operations, changes in levels of written premiums, funding of the Company’s qualified pension plan, capital requirements of the Company’s operating subsidiaries, legal requirements, regulatory constraints, other investment opportunities (including mergers and acquisitions and related financings), market conditions, changes in tax laws, the timing of the closing of the Canadian sale transaction and other factors. For information regarding the Company’s common share repurchases in 2025, see “Liquidity and Capital Resources” herein.\nAs a result of the Company’s business outside of the United States, primarily in Canada, the United Kingdom (including Lloyd’s), the Republic of Ireland and in Brazil through a joint venture, the Company’s capital is also subject to the effects of changes in foreign currency exchange rates. Strengthening of the U.S. dollar in comparison to other currencies could result in a reduction in shareholders’ equity, while a weakening of the U.S. dollar in comparison to other currencies could result in an increase in shareholders’ equity. For additional discussion of the Company’s foreign exchange market risk exposure, see “Part II—Item 7A—Quantitative and Qualitative Disclosures About Market Risk” in the Company’s 2024 Annual Report.\nOn May 27, 2025, the Company entered into an agreement to sell its Canadian personal insurance business and the majority of its Canadian commercial insurance business to Definity Financial Corporation for approximately US$2.4 billion. The Company will retain its surety business in Canada. The sale is subject to regulatory approvals and customary closing conditions, and is expected to close in the first quarter of 2026. \nMany of the statements in this “Outlook” section and in “Liquidity and Capital Resources” are forward-looking statements, which are subject to risks and uncertainties that are often difficult to predict and beyond the Company’s control.  Actual results could differ materially from those expressed or implied by such forward-looking statements. Further, such forward-looking \n57\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nstatements speak only as of the date of this report and the Company undertakes no obligation to update them. See “Part II—Item 7—Forward-Looking Statements.” For a discussion of potential risks and uncertainties that could impact the Company’s results of operations or financial position, see “Part I—Item 2—Management’s Discussion and Analysis of Financial Condition and Results of Operations” herein and “Part I—Item 1A—Risk Factors” and “Part II—Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the Company’s 2024 Annual Report, in each case as updated by the Company’s periodic filings with the SEC.  \nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity is a measure of a company’s ability to generate sufficient cash flows to meet the cash requirements of its business operations and to satisfy general corporate purposes when needed.\nOperating Company Liquidity.\n  The liquidity requirements of the Company’s insurance subsidiaries are met primarily by funds generated from premiums, fees, income received on investments and investment maturities. The Company believes that cash flows from operating activities are sufficient to meet the future liquidity requirements of its insurance subsidiaries.  Additionally, investment maturities provide a significant level of available liquidity without requiring the sale of investment securities. For further discussion of operating company liquidity, see “Part II—Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations—Liquidity and Capital Resources” in the Company’s 2024 Annual Report.\nHolding Company Liquidity\n.  TRV’s liquidity requirements primarily include shareholder dividends, debt servicing, common share repurchases and, from time to time, contributions to its qualified domestic pension plan. As of September 30, 2025, TRV held total cash and short-term invested assets in the United States aggregating $2.84 billion and having a weighted average maturity of 23 days. TRV has established a holding company liquidity target equal to its estimated annual pre-tax interest expense and common shareholder dividends (currently approximately $1.42 billion). TRV’s holding company liquidity of $2.84 billion as of September 30, 2025 exceeded this target, and it is the opinion of the Company’s management that these assets are sufficient to meet TRV’s current liquidity requirements.  \nTRV is not dependent on dividends or other forms of repatriation from its foreign operations to support its liquidity needs. The undistributed earnings of the Company’s foreign operations are intended to be permanently reinvested in those operations, and such earnings were not material to the Company’s financial position or liquidity as of September 30, 2025. \nTRV has a shelf registration statement filed with the Securities and Exchange Commission (SEC) that expires on June 4, 2028 which permits it to issue securities from time to time. TRV also has a $1.0 billion credit facility with a syndicate of financial institutions that expires on June 15, 2027. As of September 30, 2025, the Company had $100 million of commercial paper outstanding. TRV is not reliant on its commercial paper program to meet its operating cash flow needs. The Company has no senior notes or junior subordinated debentures maturing until April 2026, at which time $200 million of senior notes will mature.\nThe Company utilized uncollateralized letters of credit issued by major banks with an aggregate limit of $260 million to provide a portion of the capital needed to support its obligations at Lloyd’s as of September 30, 2025. If uncollateralized letters of credit are not available at a reasonable price or at all in the future, the Company can collateralize these letters of credit or may have to seek alternative means of supporting its obligations at Lloyd’s, which could include utilizing holding company funds on hand.  \nOperating Activities\nNet cash provided by operating activities in the first nine months of 2025 and 2024 was $7.92 billion and $7.01 billion, respectively. The increase in cash flows in the first nine months of 2025 primarily reflected the impacts of higher levels of cash received for premiums, partially offset by higher levels of payments for claims and claim adjustment expenses.\nInvesting Activities\nNet cash used in investing activities in the first nine months of 2025 and 2024 was $7.08 billion and $5.57 billion, respectively.  The Company’s consolidated total investments as of September 30, 2025 increased by $9.46 billion, or 10%, over year-end 2024, primarily reflecting the impacts of (i) net cash flows provided by operating activities and (ii) lower net unrealized investment losses due to the impact of lower interest rates during the first nine months of 2025, partially offset by (iii) net cash used in financing activities. \n58\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nThe Company’s investment portfolio is managed to support its insurance operations; accordingly, the portfolio is positioned to meet obligations to policyholders. As such, the primary goals of the Company’s asset-liability management process are to satisfy the insurance liabilities and maintain sufficient liquidity to cover fluctuations in projected liability cash flows. Generally, the expected principal and interest payments produced by the Company’s fixed maturity portfolio adequately fund the estimated runoff of the Company’s insurance reserves. Although this is not an exact cash flow match in each period, the substantial amount by which the market value of the fixed maturity portfolio exceeds the value of the net insurance liabilities, as well as the positive cash flow from newly sold policies and the large amount of high quality liquid bonds, contributes to the Company’s ability to fund claim payments without having to sell assets at a loss or access credit facilities.\nFinancing Activities\nNet cash used in financing activities in the first nine months of 2025 and 2024 was $835 million and $1.33 billion, respectively. The totals in both 2025 and 2024 reflected common share repurchases and dividends paid to shareholders, partially offset by the net proceeds from employee stock option exercises. Common share repurchases in the first nine months of 2025 and 2024 were $1.49 billion and $859 million, respectively. Net cash used in financing activities in the first nine months of 2025 also included the receipt of net proceeds from the issuance of debt.\nDividends\n.  Dividends paid to shareholders were $737 million and $711 million in the first nine months of 2025 and 2024, respectively. The declaration and payment of future dividends to holders of the Company’s common stock will be at the discretion of the Company’s Board of Directors and will depend upon many factors, including the Company’s financial position, earnings, capital requirements of the Company’s operating subsidiaries, legal requirements, regulatory constraints and other factors as the Board of Directors deems relevant. Dividends will be paid by the Company only if declared by its Board of Directors out of funds legally available, subject to any other restrictions that may be applicable to the Company. On October 16, 2025, the Company declared a regular quarterly dividend of $1.10 per share, payable December 31, 2025 to shareholders of record on December 10, 2025.\nShare Repurchases\n.  The Company’s Board of Directors has approved common share repurchase authorizations under which repurchases may be made from time to time in the open market, pursuant to pre-set trading plans meeting the requirements of Rule 10b5-1 under the Securities Exchange Act of 1934, in private transactions or otherwise. The authorizations do not have a stated expiration date. The Company expects that, generally over time, the combination of dividends to common shareholders and common share repurchases will likely not exceed net income. The Company also expects that to the extent that it continues to grow premium volumes, the amount of capital returned to shareholders relative to earnings would be somewhat less than it otherwise would have been absent the growth in premium volumes. The timing and actual number of shares to be repurchased in the future will depend on a variety of factors, including the Company’s financial position, earnings, share price, catastrophe losses, maintaining capital levels appropriate for the Company’s business operations, changes in levels of written premiums, funding of the Company’s qualified pension plan, capital requirements of the Company’s operating subsidiaries, legal requirements, regulatory constraints, other investment opportunities (including mergers and acquisitions and related financings), market conditions, changes in tax laws and other factors. During the three and nine months ended September 30, 2025, the Company repurchased 2.3 million and 5.1 million common shares, respectively, under its share repurchase authorizations for a total cost of $625 million and $1.38 billion, respectively. The average cost per share repurchased was $271.76 and $268.28, respectively. As of September 30, 2025, the Company had $3.67 billion of capacity remaining under its share repurchase authorizations. Included in the cost of treasury stock acquired pursuant to common share repurchases is the 1% excise tax imposed as part of the Inflation Reduction Act of 2022.\nCapital Resources\n.  Capital resources reflect the overall financial strength of the Company and its ability to borrow funds at competitive rates and raise new capital to meet its needs. The following table summarizes the components of the Company’s capital structure as of September 30, 2025 and December 31, 2024.\n59\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\n(in millions)\nSeptember 30,\n2025\nDecember 31,\n2024\nDebt:\n \n \nShort-term\n$\n300\n \n$\n100 \nLong-term\n9,054\n \n8,004 \nNet unamortized fair value adjustments and debt issuance costs\n(87)\n(71)\nTotal debt\n9,267\n \n8,033 \nShareholders’ equity:\n \n \nCommon stock and retained earnings, less treasury stock\n34,703\n \n32,831 \nAccumulated other comprehensive loss\n(3,094)\n(4,967)\nTotal shareholders’ equity\n31,609\n \n27,864 \nTotal capitalization\n$\n40,876\n \n$\n35,897 \nOn July 24, 2025, the Company issued $500 million aggregate principal amount of 5.05% senior notes that will mature on July 24, 2035 and $750 million aggregate principal amount of 5.70% senior notes that will mature on July 24, 2055. The Company intends to use the net proceeds of the notes for general corporate purposes, including to retire the Company’s 7.75% senior notes, which will mature on April 15, 2026, and which have an aggregate principal amount outstanding of $200 million. See note 9 of the notes to the unaudited financial statements for further discussion regarding the terms of the senior notes.\nThe following table provides a reconciliation of total capitalization presented in the foregoing table to total capitalization excluding net unrealized losses on investments, net of taxes, included in shareholders’ equity.\n(dollars in millions)\nSeptember 30,\n2025\nDecember 31,\n2024\nTotal capitalization\n$\n40,876\n \n$\n35,897 \nLess: net unrealized losses on investments, net of taxes, included in shareholders’ equity\n(1,970)\n(3,640)\nTotal capitalization excluding net unrealized losses on investments, net of taxes, included in shareholders’ equity\n$\n42,846\n \n$\n39,537 \nDebt-to-total capital ratio\n22.7\n \n%\n22.4 \n%\nDebt-to-total capital ratio excluding net unrealized losses on investments, net of taxes, included in shareholders’ equity\n21.6\n \n%\n20.3 \n%\nThe debt-to-total capital ratio excluding net unrealized gains (losses) on investments, net of taxes, included in shareholders’ equity, is calculated by dividing (a) debt by (b) total capitalization excluding net unrealized gains and losses on investments, net of taxes, included in shareholders’ equity. Net unrealized gains and losses on investments can be significantly impacted by both interest rate movements and other economic factors. Accordingly, in the opinion of the Company’s management, the debt-to-total capital ratio calculated on this basis provides another useful metric for investors to understand the Company’s financial leverage position. The Company’s ratio of debt-to-total capital excluding after-tax net unrealized investment losses included in shareholders’ equity of 21.6% as of September 30, 2025 was within the Company’s target range of 15% to 25%.\nRATINGS\nRatings are an important factor in assessing the Company’s competitive position in the insurance industry. The Company receives ratings from the following major rating agencies: A.M. Best Company (A.M. Best), Fitch Ratings (Fitch), Moody’s Investors Service\n (Moody’s) and S&P Global Ratings (S&P). The following rating agency action was taken with respect to the Company since July 17, 2025, the date on which the Company’s Form 10-Q for the quarter ended June 30, 2025 was filed with the SEC. For additional discussion of ratings, see “Part I\n—Item 1—Business—Ratings” in the Company’s 2024 Annual Report.\n•\nOn August 8, 2025, A.M. Best affirmed all ratings of the Company. The outlook for all ratings is stable.\n60\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS, Continued\nCRITICAL ACCOUNTING ESTIMATES\nFor a description of the Company’s critical accounting estimates, refer to “Part II—Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations—Critical Accounting Estimates” in the Company’s 2024 Annual Report. The Company considers its most significant accounting estimates to be those applied to claims and claim adjustment expense reserves and related reinsurance recoverables, and impairments of investments, goodwill and other intangible assets. Except as shown in the table below, there have been no material changes to the Company’s critical accounting estimates since December 31, 2024.\nClaims and Claim Adjustment Expense Reserves\nThe table below displays the Company’s gross claims and claim adjustment expense reserves by product line. Because establishment of claims and claim adjustment expense reserves is an inherently uncertain process involving estimates and the application of judgment, currently established claims and claim adjustment expense reserves may change. The Company reflects adjustments to the reserves in the results of operations in the period the estimates are changed. These changes in estimates could result in income statement charges that could be material to the Company’s operating results in future periods. In particular, a portion of the Company’s gross claims and claim adjustment expense reserves (totaling $1.80 billion as of September 30, 2025) are for asbestos claims and related litigation. Asbestos reserves are included in the General liability, Commercial multi-peril and International and other lines in the summary table below. While the ongoing review of asbestos claims and associated liabilities considers the inconsistencies of court decisions as to coverage, plaintiffs’ expanded theories of liability and the risks inherent in complex litigation and other uncertainties, in the opinion of the Company’s management, it is possible that the outcome of the continued uncertainties regarding these claims could result in liability in future periods that differs from current insurance reserves by an amount that could be material to the Company’s future operating results. Asbestos reserves are discussed separately; see “Asbestos Claims and Litigation” and “Uncertainty Regarding Adequacy of Asbestos Reserves” in this report.\nGross claims and claim adjustment expense reserves by product line were as follows:\n \nSeptember 30, 2025\nDecember 31, 2024\n(in millions)\nCase\nIBNR\nTotal\nCase\nIBNR\nTotal\nGeneral liability\n$\n6,024\n \n$\n12,595\n \n$\n18,619\n \n$\n5,845 \n$\n11,349 \n$\n17,194 \nCommercial property\n1,300\n \n573\n \n1,873\n \n1,384 \n342 \n1,726 \nCommercial multi-peril\n3,275\n \n3,765\n \n7,040\n \n3,015 \n3,438 \n6,453 \nCommercial automobile\n2,875\n \n3,521\n \n6,396\n \n2,749 \n3,195 \n5,944 \nWorkers’ compensation\n10,094\n \n8,499\n \n18,593\n \n9,980 \n8,749 \n18,729 \nFidelity and surety\n154\n \n689\n \n843\n \n210 \n571 \n781 \nPersonal automobile\n2,297\n \n2,451\n \n4,748\n \n2,315 \n2,588 \n4,903 \nPersonal homeowners and other\n1,636\n \n2,220\n \n3,856\n \n1,238 \n1,833 \n3,071 \nInternational and other\n2,678\n \n3,055\n \n5,733\n \n2,561 \n2,726 \n5,287 \nProperty-casualty\n30,333\n \n37,368\n \n67,701\n \n29,297 \n34,791 \n64,088 \nAccident and health\n4\n \n—\n \n4\n \n5 \n— \n5 \nClaims and claim adjustment expense reserves\n$\n30,337\n \n$\n37,368\n \n$\n67,705\n \n$\n29,302 \n$\n34,791 \n$\n64,093 \nThe $3.61 billion increase in gross claims and claim adjustment expense reserves since December 31, 2024 primarily reflected the impacts of (i) catastrophe losses in the first nine months of 2025, (ii) higher volumes of insured exposures and (iii) loss cost trends for the current accident year, partially offset by (iv) claim payments made during the first nine months of 2025 and (v) net favorable prior year reserve development.\nFUTURE APPLICATION OF ACCOUNTING STANDARDS\nSee note 1 of the notes to the unaudited consolidated financial statements contained in this quarterly report and in the Company’s 2024 Annual Report for a discussion of recently issued accounting pronouncements.\n61\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\nFORWARD-LOOKING STATEMENTS\nThis report contains, and management may make, certain “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995.  All statements, other than statements of historical facts, may be forward-looking statements. Words such as “may,” “will,” “should,” “likely,” “probably,” “anticipates,” “expects,” “intends,” “plans,” “projects,” “believes,” “views,” “ensures,” “estimates” and similar expressions are used to identify these forward-looking statements. These statements include, among other things, the Company’s statements about:\n•\nthe Company’s outlook, the impact of trends on its business and its future results of operations and financial condition (including, among other things, anticipated premium volume, premium rates, renewal premium changes, underwriting margins and underlying underwriting margins, net and core income, investment income and performance, loss costs, return on equity, core return on equity and expected current returns, and combined ratios and underlying combined ratios); \n•\nthe impact of legislative or regulatory actions or court decisions; \n•\nshare repurchase plans;\n•\nfuture pension plan contributions;\n•\nthe sufficiency of the Company’s reserves, including asbestos; \n•\nthe impact of emerging claims issues as well as other insurance and non-insurance litigation;\n•\nthe cost and availability of reinsurance coverage;\n•\ncatastrophe losses and modeling, including statements about probabilities or likelihood of exceedance; \n•\nthe impact of investment (including changes in interest rates), economic (including inflation, the impact of tariffs, changes in tax laws, changes in commodity prices and fluctuations in foreign currency exchange rates) and underwriting market conditions; \n•\nthe Company’s approach to managing its investment portfolio;\n•\nthe impact of changing climate conditions;\n•\nstrategic and operational initiatives to improve growth, profitability and competitiveness; \n•\nthe Company’s competitive advantages and innovation agenda, including executing on that agenda with respect to artificial intelligence;\n•\nthe Company’s cybersecurity policies and practices;\n•\nnew product offerings;\n•\nthe impact of developments in the tort environment, such as increased attorney involvement in insurance claims;\n•\nthe impact of developments in the geopolitical environment; \n•\nthe impact of a continued shutdown of the U.S. government; and\n•\nthe sale of our Canadian personal insurance business and the majority of our Canadian commercial insurance business, including with respect to the expected closing of the transaction, use of proceeds, including share repurchases, and financial impact of the sale.\nThe Company cautions investors that such statements are subject to risks and uncertainties, many of which are difficult to predict and generally beyond the Company’s control, that could cause actual results to differ materially from those expressed in, or implied or projected by, the forward-looking information and statements.  \nSome of the factors that could cause actual results to differ include, but are not limited to, the following:\nInsurance-Related Risks\n•\nhigh levels of catastrophe losses, including as a result of factors such as increased concentrations of insured exposures in catastrophe-prone areas and changing climate conditions, could materially and adversely affect the Company’s results of operations, its financial position and/or liquidity, and could adversely impact the Company’s ratings, the Company’s ability to raise capital and the availability and cost of reinsurance;\n•\nif actual claims exceed the Company’s claims and claim adjustment expense reserves, if changes in the estimated level of claims and claim adjustment expense reserves are necessary, or if the Company is unable to offset increases in loss costs with sufficient price increases, including as a result of, among other things, changes in the legal/tort, regulatory and economic environments in which the Company operates, including increased inflation and the impact of tariffs, the Company’s financial results could be materially and adversely affected;\n•\nthe Company’s business could be harmed because of its continued exposure to asbestos and environmental claims and related litigation;\n•\nthe Company is exposed to, and may face adverse developments involving, mass tort claims such as those relating to exposure to potentially harmful products or substances; and\n62\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\nFORWARD-LOOKING STATEMENTS, Continued\n•\nthe effects of emerging claim and coverage issues on the Company’s business are uncertain, and court decisions or legislative changes that take place after the Company issues its policies\n \ncan result in an unexpected increase in the number of claims and have a material adverse impact on the Company’s results of operations and/or the Company’s financial position.\nFinancial, Economic and Credit Risks\n•\nduring or following a period of financial market disruption or an economic downturn, the Company’s business could be materially and adversely affected;\n•\nthe Company’s investment portfolio is subject to credit and interest rate risk, and may suffer reduced or low returns or material realized or unrealized losses;\n•\nthe Company may not be able to collect all amounts due to it from reinsurers, reinsurance coverage may not be available to the Company in the future at commercially reasonable rates or at all and the Company is exposed to credit risk related to its structured settlements;\n•\nthe Company is exposed to credit risk in certain of its insurance operations and with respect to certain guarantee or indemnification arrangements that it has with third parties;\n•\na downgrade in the Company’s claims-paying and financial strength ratings could adversely impact the Company’s business volumes, adversely impact the Company’s ability to access the capital markets and increase the Company’s borrowing costs; and\n•\nthe inability of the Company’s insurance subsidiaries to pay dividends to the Company’s holding company in sufficient amounts would harm the Company’s ability to meet its obligations, pay future shareholder dividends and/or make future share repurchases.\nBusiness and Operational Risks\n•\nthe intense competition that the Company faces, including with respect to attracting and retaining employees, and the impact of innovation, technological change, including with respect to artificial intelligence, and changing customer preferences on the insurance industry and the markets in which it operates, could harm its ability to maintain or increase its business volumes and its profitability;\n•\ndisruptions to the Company’s relationships with its independent agents and brokers or the Company’s inability to manage effectively a changing distribution landscape could adversely affect the Company;\n•\nthe Company’s efforts to develop new products or services, expand in targeted markets, improve business processes and workflows or make acquisitions may not be successful and may create enhanced risks;\n•\nthe Company may be adversely affected if its pricing and capital models provide materially different indications than actual results;\n•\nloss of or significant restrictions on the use of particular types of underwriting criteria, such as credit scoring, or other data or methodologies, in the pricing and underwriting of the Company’s products could reduce the Company’s future profitability;\n•\nthe Company is subject to additional risks associated with its business outside the United States;\n•\nfuture pandemics (including new variants of COVID-19) could materially affect the Company’s results of operations, financial position and/or liquidity; and \n•\nthe sale of our Canadian insurance business (excluding surety) to Definity Financial Corporation is subject to closing conditions, including obtaining required regulatory approvals and the satisfaction of other customary closing conditions, and may not occur.\nTechnology and Intellectual Property Risks\n•\nif, as a result of cyber attacks (the risk of which could be exacerbated by geopolitical tensions) or otherwise, the Company experiences difficulties with technology, data and network security, outsourcing relationships or cloud-based technology, the Company’s ability to conduct its business could be negatively impacted; \n•\nthe Company’s business success and profitability depend, in part, on effective information technology systems and on continuing to develop and implement improvements in technology, including with respect to artificial intelligence, particularly as its business processes become more digital; and\n•\nintellectual property is important to the Company’s business, and the Company may be unable to protect and enforce its own intellectual property or the Company may be subject to claims for infringing the intellectual property of others.\n63\nTHE TRAVELERS COMPANIES, INC. AND SUBSIDIARIES\nFORWARD-LOOKING STATEMENTS, Continued\nRegulatory and Compliance Risks\n•\nthe Company’s businesses are heavily regulated by the states and countries in which it conducts business, including licensing, market conduct and financial supervision, and changes in regulation, including changes in tax regulation, may reduce the Company’s profitability and limit its growth; and \n•\nthe Company could be adversely affected if its controls designed to ensure compliance with guidelines, policies and legal and regulatory standards are not effective. \nIn addition, the Company’s share repurchase plans depend on a variety of factors, including the Company’s financial position, earnings, share price, catastrophe losses, maintaining capital levels appropriate for the Company’s business operations, changes in levels of written premiums, funding of the Company’s qualified pension plan, capital requirements of the Company’s operating subsidiaries, legal requirements, regulatory constraints, other investment opportunities (including mergers and acquisitions and related financings), market conditions, changes in tax laws and other factors.\nThe Company’s forward-looking statements speak only as of the date of this report or as of the date they are made, and the Company undertakes no obligation to update forward-looking statements.  For a more detailed discussion of these factors, see the information under the captions “Part I—Item 2—Management’s Discussion and Analysis of Financial Condition and Results of Operations” herein and “Part I—Item 1A—Risk Factors” and “Part II—Item 7—Management’s Discussion and Analysis of Financial Condition and Results of Operations” in the Company’s 2024 Annual Report, in each case as updated by the Company’s periodic filings with the SEC.\nWEBSITE AND SOCIAL MEDIA DISCLOSURE\nThe Company may use its website and/or social media outlets, such as Facebook and X, as distribution channels of material company information. Financial and other important information regarding the Company is routinely posted on and accessible through the Company’s website at \ninvestor.travelers.com\n, its Facebook page at \nfacebook.com/travelers\n and its X account (@Travelers) at \nx.com/Travelers\n. In addition, you may automatically receive email alerts and other information about the Company when you enroll your email address by visiting the “Email Notifications” section under the “Investor Toolkit” section at \ninvestor.travelers.com\n."
}