{
  "item1": "All other international Total Bond & Specialty Insurance ___________________________________________ No other single state accounted 3.0% more Bond & Specialty Insurance’s direct written premiums 2024. competitive landscape which Bond & Specialty Insurance operates affected many same factors described above Business Insurance. Competitors market primarily national property casualty insurance companies (including international companies doing business U.S.) write most classes business and, lesser extent, regional insurance companies companies developed niche programs specific industry segments. Bond & Specialty Insurance underwrites markets its products all sizes businesses other organizations, well individuals.",
  "item7": "following table presents Company’s top five reinsurer groups reinsurance recoverable December 31, 2024 (in millions). Also included A.M. Best rating Company’s predominant reinsurer each such reinsurer group February 13, 2025: A.M. Best Rating Group’s Predominant A+ second highest 16 ratings A++ highest 16 ratings A+ second highest 16 ratings A+ second highest 16 ratings Fairfax Financial Group A+ second highest 16 ratings December 31, 2024, Company held $922 million collateral form letters credit, funds trust agreements held fully partially collateralize certain reinsurance recoverables.",
  "item2": "$3.61 billion increase gross claims claim adjustment expense reserves since December 31, 2024 primarily reflected impacts (i) catastrophe losses first nine months 2025, (ii) higher volumes insured exposures (iii) loss cost trends current accident year, partially offset (iv) claim payments made during first nine months 2025 (v) net favorable prior year reserve development. FUTURE APPLICATION ACCOUNTING STANDARDS See note 1 notes unaudited consolidated financial statements contained quarterly report Company’s 2024 Annual Report discussion recently issued accounting pronouncements. TRAVELERS COMPANIES, INC. SUBSIDIARIES FORWARD-LOOKING STATEMENTS report contains, management may make, certain “forward-looking statements” within meaning Private Securities Litigation Reform Act 1995."
}