{
  "source_file": "tsco-20241228.htm",
  "form_type": "10-K",
  "item1": "Item 1.     Business\nOverview\nTractor Supply Company (the “Company” or “Tractor Supply” or “we” or “our” or “us”) is the largest rural lifestyle retailer in the United States (“U.S.”). The Company is focused on supplying the needs of recreational farmers, ranchers, and all those who enjoy living the rural lifestyle (which we refer to as the “\nOut Here\n” lifestyle).  We operate retail stores under the names \nTractor Supply Company \nand\n Petsense by Tractor Supply. \nOur stores are located primarily in towns outlying major metropolitan markets and in rural communities. We also offer an expanded assortment of products through the Tractor Supply mobile application and online at \nTractorSupply.com\n and \nPetsense.com.\n  \nThe Company has one reportable industry segment which is the retail sale of products that support the rural lifestyle. At December 28, 2024, we operated 2,502 retail stores in 49 states (2,296 Tractor Supply retail stores and 206 Petsense by Tractor Supply retail stores). Our Tractor Supply stores typically range in size from 15,000 to 20,000 square feet of inside selling space, along with additional outside selling space (“Side Lot” or “Garden Centers”), and our Petsense by Tractor Supply stores have approximately 5,500 square feet of inside selling space. Our online selling websites and our mobile application offer an extended assortment of products beyond those offered in-store and drive traffic into our stores through our buy online and pickup in-store and ship to store programs. Our retail store locations and digital capabilities provide the convenience to allow our customers to engage with us anytime, anywhere and in any way they choose. \nBusiness Strategy for Tractor Supply Company \nWe believe our sales and earnings growth is the result of executing our multi-year strategy, which includes the following key components:\n \nTarget Market\nWe are dedicated to fulfilling the lifestyle needs of recreational farmers, ranchers, homesteaders, animal and pet owners, and all those who enjoy living the rural lifestyle. Our distinct approach differentiates us from other retailers by concentrating our product assortment on these core customers. We provide a convenient shopping experience both in-store and online, focusing on needs-based, demand-driven product categories. Serving the rural lifestyle market, we act as a trip consolidator for numerous basic maintenance requirements of farm, ranch, and rural customers.\nCustomers\nOur target customers are home, land, pet, animal and livestock owners who generally have above average income and below average cost of living. We seek to serve a customer base that primarily lives in towns outlying major metropolitan markets and in rural communities. This customer base includes recreational farmers, ranchers, and all those who enjoy living a rural inspired lifestyle.  \nCustomer Service\nWe are committed to providing our customers reliable product availability and a convenient, customer-centric experience across shopping channels. In our stores, we believe the ability of our motivated, well-trained team members to provide friendly, responsive and seasoned advice helps our customers find the right products to satisfy their everyday needs, as well as the specialty items needed to complete their rural lifestyle projects. We also engage with our customers through our e-commerce websites and mobile application, which provide the opportunity to allow customers to shop anytime, anywhere, and in any way they choose, while delivering enhanced product information, research, and decision tools that support product selection and informational needs in specific subject areas. Additionally, we maintain a Customer Solutions Center at our Store Support Center located in Brentwood, Tennessee, to support our in-store and online customers, as well as our store team members. We believe this commitment to customer service promotes strong customer loyalty through personalized experiences and provides convenience that our customers expect, which drives repeat shopping experiences.  \n1\nTable of Contents\nWe use a third-party provider to survey and measure our level of customer service.  This process allows customers to provide feedback on their shopping experience.  Based on the third-party provider’s data, we believe our customer satisfaction scores are among the best-in-class.  We carefully evaluate the feedback we receive from our customers and implement improvements at both the Company and the individual store level based on that feedback.\nStore Environment\nOur stores are designed and managed to make shopping an enjoyable experience and to maximize sales and operating efficiencies.  Stores are strategically arranged to provide an open environment for optimal product placement and visual display. In addition, these layouts allow for departmental space to be easily reallocated and visual displays to be changed for seasonal products and promotions. Display and product placement information is routinely sent to stores to ensure quality and uniformity among the stores, and our Field Activity Support Teams (“FAST”) are dedicated to support the stores in creating an enhanced in-store experience for our customers through best-in-class merchandising execution. Our store layouts and visual displays are designed to provide our customers a feeling of familiarity and convenience to enhance the shopping experience. Informative signs are located in key product categories to conveniently assist customers with purchasing decisions and merchandise location.  These signs provide customers with a comparison of product qualities, clear pricing, useful information regarding product benefits, and suggestions for appropriate accessories. Also, our store team members wear highly visible red vests or aprons with name tags, and our customer service and checkout counters are conveniently located near the front of the store. \nOur stores have been equipped with tools such as team member communication devices, wireless internet, and mobile point-of-sale devices that enable our team members to provide an enhanced shopping experience to our customers. \nIn addition, our buy online and pickup in-store and ship to store programs, including curbside pickup, provide convenient access for customers to pick up merchandise from our store locations. We also offer store delivery in all of our Tractor Supply stores to meet our customers' needs.\nWe are in the midst of a multi-year project that began in 2020 to remodel our existing store base, bringing programs to life with new fixtures, layouts and products that truly enhance the customer shopping experience. The site-level space is analyzed category by category and reallocated as needed to align with current merchandising strategies and to drive space productivity. Another space productivity initiative is to transform our Side Lot with an expanded product offering and an enhanced shopping experience. With this investment, the Side Lot space is leveraged to offer a wider product offering in the lawn and garden categories and new categories within the garden center, and offer greater convenience through the expansion of our buy online and pickup in-store and ship to store capabilities for drive-thru pickup.\nMerchandising and Purchasing\nWe offer an extensive assortment of products for all those seeking to enjoy the “\nOut Here”\n lifestyle.  Our product assortment is tailored to meet the needs of our customers in various geographic markets.  Our full line of product offerings includes a broad selection of high quality, reputable brand name and exclusive brand products with approximately 17,000 to 27,000 products per store as well as over 325,000 products online.  No single product accounted for more than 10% of our sales during fiscal 2024. Our comprehensive selection of merchandise is comprised of the following major product categories:\n•\nLivestock, Equine & Agriculture: livestock and equine feed & equipment, poultry, fencing, and sprayers & chemicals; \n•\nCompanion Animal: food, treats and equipment for dogs, cats, and other small animals as well as dog wellness; \n•\nSeasonal & Recreation: tractor & rider, lawn & garden, bird feeding, power equipment, and other recreational products;\n•\nTruck, Tool, & Hardware: truck accessories, trailers, generators, lubricants, batteries, and hardware and tools; and\n•\nClothing, Gift, & Décor: clothing, footwear, toys, snacks, and decorative merchandise.\n2\nTable of Contents\nThe following table indicates the percentage of net sales represented by each of our major product categories during fiscal 2024, 2023, and 2022:\n \nPercent of Net Sales\nFiscal Year\nProduct Category:\n2024\n2023\n2022\nLivestock, Equine & Agriculture\n26 \n%\n27 \n%\n28 \n%\nCompanion Animal\n25 \n25 \n23 \nSeasonal & Recreation\n23 \n22 \n22 \nTruck, Tool, & Hardware\n16 \n16 \n16 \nClothing, Gift, & Décor\n10 \n10 \n11 \nTotal\n100 \n%\n100 \n%\n100 \n%\nNote:\n \nNet sales by major product categories for prior periods have been reclassified to conform to the current year presentation. \nOur buying team continuously reviews and updates our product assortment as necessary to respond to customer needs and to offer new, relevant products. We are focused on providing key products that our customers use on a regular basis for their lifestyle and maintenance needs with emphasis on consumable, usable, and edible (“C.U.E.”) products. Examples of C.U.E. product categories include, but are not limited to, livestock feed and bedding, pet food, bird seed, lubricants, propane, and various seasonal products, such as fertilizer, weed control, mulch, pest control, and twine. \nOur products are sourced through both domestic and international vendors, each of whom are expected to adhere to a code of conduct that guides our relationship.  Our business is not dependent upon any single vendor or particular group of vendors.  We purchase our products from a group of over 1,000 vendors, with no one vendor representing more than 10% of our purchases during fiscal 2024.  Approximately 400 core vendors accounted for 90% of our merchandise purchases during fiscal 2024. We have not experienced any significant difficulty in obtaining satisfactory alternative sources of supply for our products to meet customer demands despite the global supply chain disruptions and delays. We believe that adequate sources of supply exist, but they may cost more or require us to incur higher transportation costs.  \nOur buying teams focus on merchandise procurement, vendor line reviews, and testing of new products and programs.  We also employ a dedicated inventory management team that focuses exclusively on forecasting and inventory replenishment, a committed merchandise planning team that concentrates on assortment planning, and a specialized pricing team that seeks to optimize market-specific pricing for our products. Through the combined efforts of these teams, we continue to focus on improving our overall inventory productivity and in-stock inventory position.\nIntellectual Property \nOur subsidiary, Tractor Supply Co. of Texas, LP (“TSCT”), owns registrations with the U.S. Patent and Trademark Office (“USPTO”) for various service marks including \nTSC\n®\n, \nTractor Supply Co.\n®\n, \nTSC Tractor Supply Co.\n®\n, \nPetsense by Tractor Supply\n®, and the trapezium design for retail services. We consider these service marks, and the accompanying goodwill and name recognition, to be valuable assets of our business. TSCT also owns several other service marks for retail services, some of which have been registered with the USPTO and some of which are the subject of applications for registration pending before the USPTO. \nIn addition to selling products that bear nationally-known manufacturer brands, we also sell products manufactured for us under a number of exclusive brands that we consider to be important to our business. These exclusive brands are manufactured for us by a number of vendors and provide an alternative to the national brands, which helps provide value for our customers and positions us as a destination retailer. \n3\nTable of Contents\nOur exclusive brands represented approximately 29%, 29%, and 30% of our total sales in fiscal 2024, fiscal 2023 and fiscal 2022, respectively. Our exclusive brands include:\n \n4health\n®\n (pet foods and supplies)\n \nPaws & Claws\n® \n(pet foods and supplies)\n \nAmerican Farmworks\n®\n (livestock, farm and ranch\n \nProducer’s Pride\n® \n(livestock and horse feed and supplies)\nequipment)\n \nBit & Bridle\n®\n (apparel and footwear)\n \nRed Shed\n®\n (gifts, collectibles, and outdoor furniture)\n \nBlue Mountain\n® \n(apparel)\n \nRedstone\n® \n(heating products)\n \nC.E. Schmidt\n® \n(apparel and footwear)\n \nRetriever\n®\n (pet foods and supplies)\n \nCountry Lane\n®\n (grooming preparations, animal \n \nRidgecut\n® \n(apparel)\n feed and feed supplements)\n \nCountyline\n®\n (livestock, farm and ranch equipment)\n \nRoyal Wing\n® \n(bird feed and supplies)\n \nCountry Tuff\n®\n (lubricants, fluids and oil treatments)\n \nStrive\n® \n(pet foods)\n \nDumor\n®\n (livestock and horse feed and supplies)\n \nTraveller\n® \n(truck and automotive products)\n \nFarm Table\n®\n (pet food and treats)\n \nTreeline\n® \n(hunting gear and accessories)\n \nGroundwork\n® \n(lawn and garden supplies)\n \nTSC Tractor Supply Co\n® \n(trailers, truck tool boxes and\nanimal bedding)\n \nHuskee\n® \n(outdoor power equipment)\n \nUntamed\n®\n (pet foods)\n \nJobSmart\n®\n (tools)\n \nImpeckables\n® \n(poultry feed, poultry kits and egg\n      incubators)\nThe exclusive brands identified above have been registered as trademarks with the USPTO for certain products and some are the subject of additional applications for registration pending before the USPTO for other products.  \nOur trademark and service mark registrations have various expiration dates; however, provided that we continue to use the marks and file appropriate maintenance and renewal documentation with the USPTO in a timely manner, the registrations are potentially perpetual in duration.  Our patents (both United States and foreign) have expiration dates ranging from April 5, 2027 to November 3, 2043 and protect various elements, designs or functions of farm and ranch equipment, as well as light systems for trucks and other vehicles. \nWe believe our intellectual property, which includes the trademarks and service marks identified above, together with certain trade names, domain names, patents, and copyrights, has significant value and is an important component of our merchandising and marketing strategies.  \nDistribution\nWe currently operate a distribution facility network for supplying stores with merchandise and delivering product ordered through our websites and mobile application.  In fiscal 2024, our Tractor Supply stores received approximately 81% of merchandise through this network while the remaining merchandise shipped directly from our vendors to our stores or customers.  We believe this flow facilitates the prompt and efficient distribution of merchandise that allows us to be a dependable supplier to our customers for their “\nOut Here\n” lifestyle solutions by enhancing in-stock inventory positions, while minimizing freight expense and improving the inventory turn rate.  Our distribution facilities, located in Arizona, Arkansas, Georgia, Indiana, Kentucky, Maryland, Nebraska, New York, Ohio and Texas represent a total distribution center capacity of approximately 7.8 million square feet. We also use third-party operated import centers, mixing centers and pop-up distribution facilities which provide additional distribution capacity. On May 14, 2024, the Company opened its tenth and largest distribution center located in Maumelle, Arkansas, which expanded the distribution center capacity by approximately 1.2 million square feet.\nWe select the locations of our distribution facilities in an effort to minimize logistics costs and optimize the distance from distribution facilities to our stores.  Our distribution centers utilize warehouse and labor management tools that support the planning, control, and processing of inventory.  We manage our inbound and outbound transportation activity in-house through the use of a transportation management system.  We utilize multiple common carriers for store and direct to customer \n4\nTable of Contents\ndeliveries. We manage our transportation costs through carrier negotiations, monitoring of transportation routes, and scheduling of deliveries.\nMarketing\nLeveraging our value-driving offerings from our Neighbor’s Club loyalty program, we utilize an “everyday low price” philosophy to consistently offer our products at competitive prices complemented by limited and strategically planned promotions throughout the year. To drive store traffic, build brand consideration, and position ourselves as a destination retailer, we promote a broad selection of merchandise and our “Life Out Here” brand messaging through digital and social media initiatives, targeted digital video (connected TV and streaming programming), and e-mail.  In addition, our \nNeighbor’s Club\n loyalty program continues to drive strong customer count growth and enhances our ability to engage with our customers, recognize and reward our best customers, drive desired purchase behaviors, and create brand advocacy. Vendors frequently support these specific programs by offering temporary cost reductions, additional funding, and honoring coupons.  Our vendors also provide assistance with product presentation and fixture design, support for in-store events, point-of-purchase materials for customer education, and product knowledge for our team members. \nDigital\nEnsuring that our customers can engage with us in the most convenient manner for them whether in our stores, on our website, on our mobile application, or via our Customer Solutions Center, is a high priority for us. Our goal is to be available anytime, anywhere, and in any way our customers choose to engage with our brand. We provide our customers the opportunity to shop in a manner that fits their lifestyle and is most convenient for them. \nOur focus is on delivering a comprehensive, easy shopping experience, offering the conveniences our customers want and expect by driving a personalized experience by leveraging our Neighbor’s Club Loyalty program.\n  We offer buy online, pickup in-store, and curbside pickup, which provide convenient access for customers to pick up merchandise from our store locations.  Additionally, our online experience offers an expansive product assortment including a direct to consumer assortment. This allows us to extend our aisles beyond our store locations and provides convenient and useful content that is relevant to our customers’ lifestyle. We provide our customers the ability to have products shipped directly to our retail store locations or delivered to their homes or offices.  For select products, we offer same day delivery. We use our distribution facility network as well as our stores to support our e-commerce activities. Our digital commerce (“Digital”) capabilities have further enhanced our in-store shopping experience, allowing us to engage with our customers more effectively, and expanded our target markets outside of our current retail store locations.\nContinuous Improvement\nWe are committed to a continuous improvement program to drive change throughout our organization. Using data analytics and team member engagement, we examine business processes and identify opportunities to reduce costs, drive innovation, and improve effectiveness.  We establish annual goals for productivity and cost improvement. Additionally, we have\n training goals to expand our team’s knowledge and understanding of continuous improvement, which is a key pillar in our culture\n. We have implemented several continuous improvement projects, with team members across our business, to evaluate key operations and implement process changes. Team members are empowered and expected to challenge current paradigms and improve processes.  Management encourages the participation of all team members in the decision-making process, regularly solicits input and suggestions from our team members, and incorporates suggestions into our improvement activities.\nManagement Information and Control Systems\nWe have invested resources in management information and control systems to provide legendary customer service and to deliver the right products in the right place at the right time.  This investment includes use of digital technologies that support the “\nOut Here\n” lifestyle and integrate the customer experience in-store, online, and through our Customer Solutions Center, which offers customers the ability to shop anytime, anywhere, and in any way they choose.  Our key platforms include:\n•\nPoint-of-sale system;\n•\nIn-store mobility;\n•\nE-commerce platform;\n•\nConsumer mobile app;\n•\nReplenishment and allocation systems;\n•\nMerchandising presentation and inventory management tools;\n•\nWarehouse and transportation management systems; \n•\nLabor management tools for stores and supply chain;\n5\nTable of Contents\n•\nPrice optimization system;\n•\nVendor purchase order control system;\n•\nHuman resource information systems;\n•\nBusiness intelligence and analytics tools; and \n•\nCustomer loyalty and campaign management system.  \nThese systems are integrated through an enterprise resource planning (“ERP”) system.  This ERP system tracks merchandise from initial order through ultimate sale and interfaces with our financial systems.\nWe continue to invest in technology to support store, online, and distribution facility expansion and our long-term strategic growth initiatives focused heavily on improving the customer experience across all channels.  We also continue to evaluate and improve the functionality of our systems to maximize their effectiveness.  Such efforts include ongoing hardware and software evaluations, refreshes, and upgrades to support optimal software configurations, and application performance.  We plan to continue to invest in information technology and implement efficiency-driving system enhancements \nsuch as computer vision, labor and task management tools, edge computing and artificial intelligence.\n  We will continue to evaluate the use of emerging technologies to improve productivity \nsuch as robotics, robotic process automation, quantum computing and other technologies.\n  We also maintain and continue to strengthen the security of our information systems to help protect and prevent unauthorized access to personal information of our customers, team members, vendors, and other confidential Company data.  We are endeavoring to adhere to quickly evolving industry privacy laws and standards\n, as well as governance as it applies to artificial intelligence\n.  Critical areas of focus include cloud, end point protection and privacy.  Collectively, these efforts are directed toward improving business processes, maintaining secure, efficient, and stable systems, and enabling the continued growth and success of our business.\nPetsense by Tractor Supply\nPetsense by Tractor Supply is a small-box pet specialty supply retailer focused on meeting the needs of pet owners, primarily in small and mid-sized communities, and offering a variety of pet products and services. At December 28, 2024, we operated a total of 206 Petsense by Tractor Supply stores in 23 states, and an e-commerce website (\nPetsense.com\n). The Petsense name is registered with the USPTO.\nHuman Capital\nWe believe that our team members are the foundation of our business and that their hard work, passion, commitment, and experience drive our success. As a result of our commitment to our team members, we have been recognized by the Great Place to Work Institute as a “\nGreat Place to Work-Certified\n”\n \ncompany for five consecutive years. Additionally, we earned a spot on both the \nNashville Business Journal's\n \nBest Places to Work \n(2023) and \nThe\n \nTennessean's Top Workplaces in Middle Tennessee\n (2023) lists, as well as national lists including \nFortune’s Best Workplaces in Retail \n(2023), \nNewsweek’s America's Greatest Workplaces \n(2023), and \nForbes’ America's Best Large Employers \n(2023). Below are further descriptions of our Company and our focus on the development and support of our team members:\nManagement and Team Members\nAs of December 28, 2024, we employed approxima\ntely \n26,000\n full-time and 26,000\n part-time Tractor Supply and Petsense by Tractor Supply team members and use contractors on an as-needed basis. We typically employ additional part-time team members throughout the year during high sales volume periods. We are not party to any collective bargaining agreements.\nEligible team members participate in one of our various bonus incentive programs, which provide the opportunity to receive additional compensation based upon individual, team, and/or Company performance. In addition to bonus incentive programs, we provide our eligible team members the opportunity to participate in an employee stock purchase plan and a 401(k) retirement savings plan. We offer health insurance for which we share a significant portion of the cost of premiums. We additionally provide our eligible team members with a tuition reimbursement program, paid time off and a six-week parental leave policy for new parents. Our team members also receive a discount on merchandise purchased from the Company. \nWe encourage a promote-from-within environment when internal resources permit. We also provide internal leadership development programs designed to prepare our high-potential team members for greater responsibility. Our current team of district managers and store managers has an average tenure of approximately ten and seven years, respectively. We believe internal promotions, coupled with the hiring of individuals with previous retail experience, provide the management structure necessary to support our long-term strategic growth initiatives. \n6\nTable of Contents\nStore Team Member Learning & Development\nWe seek to hire store team members who live and appreciate the “\nOut Here\n” lifestyle, including recreational farmers, ranchers, homesteaders, animal and pet owners, and all those who enjoy living the rural lifestyle. We endeavor to staff our stores with courteous, highly motivated team members and devote considerable resources to training store team members, often in cooperation with our vendors. Our learning & development programs include:\n•\nA thorough on-boarding process to prepare new team members for their new role;\n•\nProductive workplace environment training that is intended to educate team members on Company policies and procedures covering topics such as harassment, discrimination, and retaliation\n•\nNew store opening training that prepares our store managers to open new stores to Company standards;\n•\nA management training program which covers all aspects of our store operations, including delivering superior service and managing the team member experience;\n•\nStructured training on customer service and selling skills;\n•\nOnline product knowledge training produced in conjunction with key vendors;\n•\nLeadership development programs that prepare leaders to expand their current contributions;\n•\nPeriodic all store team member meetings; and\n•\nAn annual store manager meeting with vendor product presentations.\nWorkplace Health and Safety\nAt Tractor Supply, maintaining a healthy, safe environment for our team members and customers is embedded in our mission and values. Team members are empowered to do the “right thing” and encourage the same of others. We are committed to driving a culture of safety for our team members, customers and communities through role-based training specific to Tractor Supply’s operations, the use of technology to deliver training, and an attitude of continual improvement.\nRespectful Workplace Initiatives\nAt Tractor Supply, we foster a safe, dynamic and productive work environment free of discrimination, harassment and retaliation, supported by our Mission and Values, where everyone is treated with respect and which fosters different perspectives, ideas and innovative thinking. Our Mission and Values have been the foundation of our culture for more than 85 years. All of our team members and customers are highly valued, and we place high importance on considering different viewpoints and caring for and supporting one another.\nGrowth Strategy\nTractor Supply believes we can grow our business by being an integral part of our customers’ lives as the dependable supplier of “\nOut Here\n” lifestyle solutions, creating customer loyalty through personalized experiences, our Neighbor's Club loyalty program and providing convenience that our customers expect at anytime, anywhere, and in any way they choose. Our long-term growth strategy is to: (1) expand and deepen our customer base by providing personal, localized, and memorable customer engagements by leveraging content, social media, and digital shopping experiences, attracting new customers and driving loyalty, (2) evolve customer experiences by digitizing our business processes and furthering our Digital capabilities, (3) offer relevant assortments and services across all channels through exclusive and national brands and continue to grow our total addressable market by introducing new products and services through our test and learn strategy, (4) drive operational excellence and productivity through continuous improvement, increasing space utilization, and implementing advanced supply chain capabilities to support growth, scale and agility, and (5) expand through selective acquisitions, as such opportunities arise, to add complementary businesses and to enhance penetration into new and existing markets to supplement organic growth.\nAchieving this strategy will require a foundational focus on: (1) connecting, empowering and growing our team to enhance our team members' lives and the communities in which they live, enabling them to provide legendary service to our customers, and (2) allocating resources in a disciplined and efficient manner to drive profitable growth and build stockholder value, including leveraging technology and automation, to align our cost structure to support new business capabilities for margin improvement and cost reductions.\nOver the past five years, we have experienced considerable sales growth, resulting in a compounded annual growth rate of approximately 12.2%. We plan to open approximately 90 new Tractor Supply and approximately 10  new Petsense by Tractor Supply stores in fiscal 2025, a selling square footage increase of approximately 4%. In fiscal 2024, we opened 80 new Tractor Supply stores and 11 new Petsense by Tractor Supply stores. In fiscal 2023, we opened 70 new Tractor Supply stores and 13 \n7\nTable of Contents\nnew Petsense by Tractor Supply stores. This represents a selling square footage increase of approximately 2% during fiscal 2024 and 3% during fiscal 2023. \nAt December 28, 2024, we operated 2,502 retail stores in 49 states (2,296 Tractor Supply retail stores and 206 Petsense by Tractor Supply retail stores). Given the size of the communities that we target, we believe there is ample opportunity for new store growth in many existing and new markets. We believe we have developed a proven method for selecting store sites and have significant additional opportunities for new Tractor Supply stores. We also believe that there is opportunity for continued growth for Petsense by Tractor Supply stores. \nApproximately 61% of our stores are in freestanding buildings and 39% are located in shopping centers. We lease approximately 96% of our stores and own the remaining 4%.\nIn addition to new store expansion, we will continue to support our strategic growth through expansion of our distribution network and initiatives including, among others, space productivity and Side Lot improvements to include Garden Centers in certain existing stores as well as continued improvements in technology and infrastructure at our existing stores, and ongoing investments to enhance our Digital capabilities to better serve our customers.\nCompetition\nWe operate in a competitive retail industry. We believe the principal competitive factors include location of stores, fulfillment options, price, quality of merchandise, in-stock inventory consistency, merchandise assortment and presentation, product knowledge, and customer service. We compete with general merchandise retailers, home center retailers, pet retailers, specialty and discount retailers, independently owned retail farm and ranch stores, numerous privately-held regional farm store chains and farm cooperatives, as well as internet-based retailers.  However, we believe we successfully differentiate ourselves from many of these retailers by focusing on our specialized market niche for customers living the rural lifestyle. See further discussion of competition in Item 1A. “Risk Factors” of this Annual Report on Form 10-K.\nSeasonality and Weather\nOur business is seasonal.  Historically, our sales and profits are the highest in the second and fourth fiscal quarters due to the sale of seasonal products. We usually experience our highest inventory and accounts payable balances during our first fiscal quarter for purchases of seasonal products to support the higher sales volume of the spring selling season, and again during our third fiscal quarter to support the higher sales volume of the cold-weather selling season. We believe that our business can be more accurately assessed by focusing on the performance of the halves, not the quarters, due to the fact that different weather patterns from year-to-year can shift the timing of sales and profits between quarters, particularly between the first and second fiscal quarters and the third and fourth fiscal quarters. \nHistorically, weather conditions, including unseasonably warm weather in the fall and winter months and unseasonably cool weather in the spring and summer months, have unfavorably affected the timing and volume of our sales and results of operations. In addition, extreme weather conditions, including snow and ice storms, flood and wind damage, hurricanes, tornadoes, extreme rain, and droughts have impacted operating results both negatively and positively, depending on the severity and duration of these conditions. See further discussion in Item 1A. “Risk Factors — Weather and Climate Risks” of this Annual Report on Form 10-K. Our strategy is to manage product flow and adjust merchandise assortments and depth of inventory to capitalize on seasonal demand trends. \nStewardship and Compliance with Environmental Matters\nOur operations are subject to numerous federal, state, and local environmental laws and regulations, enacted or adopted to protect the environment.  We are committed to complying with all applicable environmental laws and regulations.  We are also committed to becoming a more environmentally sustainable company, including through promoting land and water conservation efforts. This commitment is demonstrated through our Stewardship Program, which is comprised of environmental and sustainability-related initiatives designed to lessen our environmental footprint.  These include the installation of energy management systems, LED lighting conversion, high efficiency heating/air conditioning systems; recycling programs in our stores, distribution centers and Store Support Center; and the installation of rooftop solar arrays at the Store Support Center in Brentwood, Tennessee, our Tractor Supply store in Hendersonville, Tennessee and our newest distribution centers in Navarre, Ohio and Maumelle, Arkansas. \nWe continue to invest in sustainable buildings with the design, construction and operation of facilities that meet LEED (Leadership in Energy and Environmental Design) standards.  Our Store Support Center and distribution centers in Casa \n8\nTable of Contents\nGrande, Arizona, and Frankfort, New York are all LEED Silver certified. Our Navarre, Ohio distribution center is the first Tractor Supply facility LEED Gold certified, and we expect our Maumelle, Arkansas distribution center to receive LEED Gold certification in 2025. The facilities each feature a rooftop solar array consisting of more than 10,000 solar panels that will produce five megawatts of electricity per year, which is enough energy to power the electricity needs of the building as well as electric fork trucks powered by lithium-ion batteries to move inventory within the facility.\nThe Company has been a SmartWay Transport partner since 2013. SmartWay Transport is a public-private initiative between the U.S. Environmental Protection Agency, large and small trucking companies, retailers, and other federal and state agencies.  Its purpose is to improve fuel efficiency and the environmental performance of supply chains by way of reducing both greenhouse gas emissions and air pollution.\nIn 2021, we set decarbonization goals meant to reduce absolute emissions from our operational footprint. In the fourth quarter of 2023, we submitted our letter of commitment to the Science Based Targets Initiative (“SBTi”), outlining our intent to set a science-based target for climate goals. We have until the fall of 2025 to submit our proposed targets for validation. We will use the time to define our targets, develop decarbonization roadmaps, and create financial models to assess the effort needed to achieve these SBTs. These factors will guide our next steps. \nIn mid-2024, we made the decision to retire our 2021 GHG emissions reduction goals and focus on land and water initiatives as we thoughtfully analyze a science-based climate goal under SBTi. Understanding we have a responsibility to be respectful of the resources we consume, we are focused on making our operations as efficient as possible. We continually look for opportunities to drive efficiency by systematically replacing aging HVAC units, updating old fluorescent lighting with LED lighting, investing renewable energy sources like solar and wind and strategically purchasing renewable energy credits. Our commitment to publicly disclose our climate-related data remains strong. The company discloses information regarding Scope 1, Scope 2 and Scope 3 emissions, including disclosure of Scope 3 emissions by category as presented in our 2023 TCFD (Task Force on Climate-Related Financial Disclosures) Report, which can be found on our website (TractorSupply.com).\nIn addition, we announced an ambitious three-year goal in April of 2022 to conserve 25 million gallons of water by 2025. Through operational improvements and partnerships with Ducks Unlimited and Trout Unlimited, we have already begun to make significant progress towards achieving our goal. These partnerships are designed to make a positive impact on nature by supporting work to restore sensitive habitats that are so important to Life Out Here. These commitments to climate and society reinforce Tractor Supply’s vision that a healthy environment, properly managed resources, and vibrant communities are all key for a secure and prosperous future. \nInformation about our Executive Officers\nPursuant to General Instruction G(3) of Form 10-K, the following list is included in Part I of this Report in lieu of being included in the Proxy Statement for the Annual Meeting of Stockholders to be held on May 15, 2025.\nThe following is a list of the names and ages of all executive officers of the registrant, indicating all positions and offices with the registrant held by each such person and each person’s principal occupations and employment during at least the past five years:\nName\nPosition\nAge\nHarry A. Lawton, III\nPresident and Chief Executive Officer\n50\nKurt D. Barton\nExecutive Vice President – Chief Financial Officer and Treasurer\n53\nRobert D. Mills\nExecutive Vice President – Chief Technology, Digital Commerce and Strategy Officer\n52\nJohn P. Ordus\nExecutive Vice President – Chief Stores Officer\n49\nJ. Seth Estep\nExecutive Vice President – Chief Merchandising Officer\n45\nMelissa D. Kersey\nExecutive Vice President – Chief Human Resources Officer\n50\nColin W. Yankee\nExecutive Vice President – Chief Supply Chain Officer\n47\nNoni L. Ellison\nSenior Vice President – General Counsel and Corporate Secretary\n53\nKimberley S. Gardiner\nSenior Vice President – Chief Marketing Officer\n56\nMatthew L. Rubin\nSenior Vice President and General Manager of Petsense by Tractor Supply\n45\nHarry A. Lawton, III has served as President and Chief Executive Officer since January 2020.  Mr. Lawton served as President of Macy's, Inc. from September 2017 to December 2019.  Prior to that time, Mr. Lawton served as Senior Vice President, North America at eBay, Inc. since May 2015.  Mr. Lawton previously held a number of leadership positions at Home Depot, Inc. from \n9\nTable of Contents\n2005 to 2015, including Senior Vice President of Merchandising and head of Home Depot's online business.  Since January 2019, Mr. Lawton has served as a director of Sealed Air Corporation and previously served as a director of Buffalo Wild Wings, Inc. from October 2016 to February 2018. \nKurt D. Barton has served as Executive Vice President – Chief Financial Officer and Treasurer since February 2019, after having served as the Company’s Senior Vice President – Chief Financial Officer and Treasurer since March 2017. Prior to that time, Mr. Barton served as Senior Vice President – Controller of the Company since February 2016.  Mr. Barton previously served as Vice President – Controller of the Company from February 2009, after having served as the Company's Director, Internal Audit from July 2002 to February 2009.  Mr. Barton has served in various other leadership roles in accounting since he joined the Company in 1999.  Mr. Barton, a Certified Public Accountant, began his career in public accounting in 1993, spending six years at Ernst & Young, LLP. Since October 2024, Mr. Barton has served as a director of KeHE Distributors, LLC. \nRobert D. Mills has served as Executive Vice President – Chief Technology, Digital Commerce and Strategy Officer since August 2018, prior to which he served as the Company's Senior Vice President – Chief Information Officer since February 2014.  Mr. Mills previously served as Chief Information Officer for Ulta Beauty, Inc. from October 2011 until he joined the Company.  From 2005 to 2011, Mr. Mills was Vice President, Chief Information Officer for the online business unit at Sears Holdings Corporation where he began as an Information Technology Customer Relationship Leader in 2001.  Prior to 2001, Mr. Mills held roles at The Allstate Corporation, Rockwell International, Telecommunications Division, and Household Finance Corporation.  Since March 2018, Mr. Mills has served as a director of B&G Foods, Inc. Mr. Mills also serves as an Independent Director of OneSight and is a former Chairman for the NRG CIO Council.\nJohn P. Ordus has served as Executive Vice President – Chief Stores Officer since February 2020, after having served as the Company's Senior Vice President - Store Operations since August 2015. Prior to that time, Mr. Ordus served as Regional Vice President from June 2010 and as a Regional Director for the Company from September 2008.  Mr. Ordus joined the Company as a District Manager in February 2002 after the acquisition of Quality Farm & Fleet, Inc. with which Mr. Ordus held roles since January 1998.\nJ. Seth Estep has served as Executive Vice President – Chief Merchandising Officer since February 2020, after having served as the Company's Senior Vice President, General Merchandising since April 2017. Prior to that time, Mr. Estep served the Company as a Vice President, Divisional Merchandise Manager from February 2014.  Mr. Estep also previously served in various other leadership roles in merchandising since he re-joined the Company in January 2008. Since October 2023, Mr. Estep has served as a director at Leslie’s, Inc.\n \nMelissa D. Kersey has served as Executive Vice President – Chief Human Resources Officer since July 2020.  Ms. Kersey was previously Senior Vice President and Chief People Officer for McDonald's USA, LLC from 2017 until July 2020.  Ms. Kersey also previously held a number of executive level roles with Walmart Inc. (previously Wal-Mart Stores, Inc.) from 2008 to 2017, including Senior Vice President of Global Human Resource Transformation and People Services, Senior Vice President and Chief Human Resources Officer for U.S. Stores, and Senior Vice President of Learning and Human Resources Strategy.  Prior to that time, Ms. Kersey spent eight years with Alltel Wireless and four years with the Target Corporation in Operations, Distribution, Human Resources and Technology roles. Since May 2023, Ms. Kersey has served as a director at Floor & Décor Holdings, Inc.\nColin W. Yankee has served as Executive Vice President - Chief Supply Chain Officer since February 2020, after having served as the Company's Senior Vice President, Supply Chain since November 2015 when he joined the Company.  Mr. Yankee was previously Vice President of Logistics for Neiman Marcus Group LLC from 2013 to 2015. Prior to that time, Mr. Yankee held various leadership roles in logistics and supply chain with the Target Corporation since 2004. He began his career as a Cavalry Officer, Captain in the United States Army.\nNoni L. Ellison has served as Senior Vice President – General Counsel and Corporate Secretary since January 2021.  Ms. Ellison was previously General Counsel, Chief Compliance Officer and Corporate Secretary for Carestream Dental LLC from August 2017 until January 2021. Ms. Ellison also previously served as Associate General Counsel and Assistant Corporate Secretary at W.W. Grainger, Inc. from February 2015 until July 2017.  Prior to that time, Ms. Ellison held roles of increasing responsibility at Turner Broadcasting System, Inc. and Scripps Networks Interactive, Inc. and practiced law with two national law firms as a corporate finance and securities associate.\n10\nTable of Contents\nKimberley S. Gardiner has served as Senior Vice President - Chief Marketing Officer since July 2022. Ms. Gardiner was previously Chief Marketing Officer and Senior Vice President at Volkswagen Group of America from November 2020 until July 2022. Prior to that time, Ms. Gardiner served as the Chief Marketing Officer for Mitsubishi Motors North America from January 2019 to November 2020 and as Director of Marketing for Kia Motors America from March 2016 to January 2019. Prior to 2019, Ms. Gardiner held various marketing and strategy roles with increasing responsibility at 5th Kind and Toyota North America.\nMatthew L. Rubin has served as Senior Vice President and General Manager of Petsense by Tractor Supply since February 2021.  Mr. Rubin previously served as Senior Vice President of Business Development & Growth at The Michaels Stores, Inc. from October 2018 until January 2021.  Mr. Rubin was previously an executive in Accenture plc's North America Retail Practice from April 2015 to October 2018.  Before April 2015, Mr. Rubin was a Partner at Consolidated Venture Partners & Consolidated Marketing and a Co-Founder & Finance Partner at OnTrend Products. Mr. Rubin also previously served as Vice President of Specialty Business Operations at BJ’s Wholesale Club Holding, Inc. Mr. Rubin began his career at Office Depot, Inc. where he had multiple merchandising and strategic project leadership roles of increasing responsibility.\nAdditional Information\nWe file reports with the Securities and Exchange Commission (“SEC”), including Annual Reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and other reports as required.  We are an electronic filer and the SEC maintains a website at \nsec.gov\n that contains the reports, proxy and information statements, and other information we file.\nWe make available, free of charge through our website, \nTractorSupply.com\n, our Annual Report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and all amendments to those reports as soon as reasonably practicable after such material is electronically filed with or furnished to the SEC.  The information provided on our website is not part of this report, and is therefore not incorporated by reference unless such information is otherwise specifically referenced elsewhere in this report.",
  "item7": "Item 7.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis is intended to provide the reader with information that will assist in understanding the significant factors affecting our consolidated operating results, financial condition, liquidity, and capital resources during the two-year period ended December 28, 2024 (our fiscal years 2024 and 2023).  For a comparison of our results of operations for fiscal year December 30, 2023 and December 31, 2022, see “Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our Annual Report on Form 10-K for the fiscal year ended December 30, 2023, filed with the SEC on February 23, 2024. This discussion should be read in conjunction with our Consolidated Financial Statements and Notes to the Consolidated Financial Statements included elsewhere in this report.  This discussion contains forward-looking statements and information.  See “Forward-Looking Statements and Information” and “Risk Factors” included elsewhere in this report.\nTractor Supply reports its financial results in accordance with accounting principles generally accepted in the United States of America (“U.S. GAAP”).  Tractor Supply also uses certain non-GAAP measures that fall within the meaning of Securities and Exchange Commission Regulation G and Regulation S-K Item 10(e), which may provide users of the financial information with additional meaningful comparison to prior reported results.  Non-GAAP measures do not have standardized definitions and are not defined by U.S. GAAP.  Therefore, Tractor Supply’s non-GAAP measures are unlikely to be comparable to similar measures presented by other companies.  The presentation of these non-GAAP measures should not be considered in isolation from, as a substitute for, or as superior to the financial information presented in accordance with U.S. GAAP.  We believe this information is useful in providing period-to-period comparisons of the results of our continuing operations. \nOverview\nFounded in 1938, Tractor Supply Company (the “Company” or “Tractor Supply” or “we” or “our” or “us”) is the largest rural lifestyle retailer in the United States (“U.S.”).  The Company is focused on supplying the needs of recreational farmers, ranchers, and all those who enjoy living the rural lifestyle (which we refer to as the “\nOut Here\n” lifestyle).  As of December 28, 2024, we operated 2,502 retail stores in 49 states under the names \nTractor Supply Company \nand \nPetsense by Tractor Supply.\n Our stores are located primarily in towns outlying major metropolitan markets and in rural communities.  We also operate websites under the names \nTractorSupply.com\n and \nPetsense.com\n, as well as a Tractor Supply Company mobile application.  Through our stores and e-commerce channels, we offer the following comprehensive selection of merchandise:\n•\nLivestock, Equine & Agriculture: livestock and equine feed & equipment, poultry, fencing, and sprayers & chemicals; \n•\nCompanion Animal: food, treats and equipment for dogs, cats, and other small animals as well as dog wellness; \n•\nSeasonal & Recreation: tractor & rider, lawn & garden, bird feeding, power equipment, and other recreational products;\n•\nTruck, Tool, & Hardware: truck accessories, trailers, generators, lubricants, batteries, and hardware and tools; and\n•\nClothing, Gift, & Décor: clothing, footwear, toys, snacks, and decorative merchandise.\nTractor Supply Company believes we can grow our business by being a more integral part of our customers’ lives as the dependable supplier of “\nOut Here\n” lifestyle solutions, creating customer loyalty through personalized experiences, and providing convenience that our customers expect anytime, anywhere, and in any way they choose.  Our long-term growth strategy is to: (1) expand and deepen our customer base by providing personal, localized, and memorable customer engagements by leveraging content, social media, and digital shopping experiences, attracting new customers and driving loyalty, (2) evolve customer experiences by digitizing our business processes and furthering our digital capabilities, (3) offer relevant assortments and services across all channels through exclusive and national brands and continue to grow our total addressable market by introducing new products and services through our test and learn strategy, (4) drive operational excellence and productivity through continuous improvement, increasing space utilization, and implementing advanced supply chain capabilities to support growth, scale and agility, and (5) expand through selective acquisitions, as such opportunities arise, to add complementary businesses and to enhance penetration into new and existing markets to supplement organic growth.\nAchieving this strategy will require a foundational focus on: (1) connecting, empowering and growing our team to enhance their lives and the communities we call home, enabling them to provide legendary service to our customers, and (2) allocating resources in a disciplined and efficient manner to drive profitable growth and build stockholder value, including leveraging technology and automation, to align our cost structure to support new business capabilities for margin improvement and cost reductions.\nOver the past five years, we have experienced considerable growth in stores, growing from 2,024 stores (1,844 Tractor Supply retail stores and 180 Petsense by Tractor Supply retail stores) at the end of fiscal 2019 to 2,502 stores (2,296 Tractor Supply retail stores and 206 Petsense by Tractor Supply retail stores) at the end of fiscal 2024, and in net sales, with a compounded annual growth rate of approximately 12.2%.  Given the size of the communities that we target, we believe that there is ample opportunity for new store growth in many existing and new markets. We have developed a proven method for selecting store \n30\nTable of Contents\nsites, and we believe we have significant additional opportunities for new Tractor Supply stores.  We also believe that there is opportunity for continued growth for Petsense by Tractor Supply stores.  \nStock Split\nOn December 5, 2024, the Company’s Board of Directors authorized a five-for-one forward split (the “Stock Split”) of the Company’s outstanding shares of common stock, par value $0.008 per share. On December 20, 2024, stockholders of record at the close of business on December 16, 2024, received four additional shares of common stock for each share owned by such stockholder. The Certificate of Amendment to the Company’s Restated Certificate of Incorporation filed on December 19, 2024 effected the Stock Split and also proportionately increased the number of authorized common shares from 400.0 million to 2.00 billion. The par value of each share was not changed. All share and per-share information in this Annual Report on Form 10-K has been retroactively restated to reflect the Stock Split.\nExecutive Summary\nIn fiscal 2024, we opened 80 new Tractor Supply stores in 34 states and 11 new Petsense by Tractor Supply stores in seven states. In fiscal 2023, we opened 70 new Tractor Supply stores in 28 states and 13 new Petsense by Tractor Supply stores in nine states. This resulted in a selling square footage increase of approximately 2% in fiscal 2024 and 3% in fiscal 2023.\nNet sales increased 2.2% to $14.88 billion in fiscal 2024 from $14.56 billion in fiscal 2023. Comparable store sales increased 0.2% in fiscal 2024 compared to a flat growth rate in fiscal 2023. Gross profit increased 3.2% to $5.40 billion in fiscal 2024 from $5.23 billion in fiscal 2023, and gross margin increased 34 basis points to 36.3% of net sales in fiscal 2024 from 35.9% of net sales in fiscal 2023. Operating income decreased 30 basis points to 9.9% of net sales in fiscal 2024 from 10.2% of net sales in fiscal 2023.  For fiscal 2024, net income was $1.10 billion, or $2.04 per diluted share, compared to $1.11 billion, or $2.02 per diluted share, in fiscal 2023. \nWe ended fiscal 2024 with $251.5 million in cash and cash equivalents and outstanding long-term debt of $1.83 billion, after returning $1.03 billion to our stockholders through stock repurchases and quarterly cash dividends.\nPerformance Metrics\nComparable Store Metrics\nComparable store metrics are a key performance indicator used in the retail industry and by the Company to measure the performance of the underlying business. Our comparable store metrics are calculated on an annual basis using sales generated from all stores open at least one year and all online sales and exclude certain adjustments to net sales.  Stores closed during either of the years being compared are removed from our comparable store metrics calculations. Stores relocated during either of the years being compared are not removed from our comparable store metrics calculations. If the effect of relocated stores on our comparable store metrics calculations became material, we would remove relocated stores from the calculations. An Orscheln store will be considered a comparable store one year after its point-of-sale system conversion. Comparable store sales are intended only as supplemental information and are not a substitute for net sales presented in accordance with U.S. GAAP.\nTransaction Count and Transaction Value\nTransaction count and transaction value metrics are used by the Company to measure sales performance. Transaction count represents the number of customer transactions during a given period. Transaction value represents the average amount paid per transaction and is calculated as net sales divided by the total number of customer transactions during a given period.\nCritical Accounting Estimates\nManagement’s discussion and analysis of our financial position and results of operations are based upon our Consolidated Financial Statements, which have been prepared in accordance with U.S. GAAP.  The preparation of these financial statements requires management to make informed estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities.  Our financial position and/or results of operations may be materially different when reported under different conditions or when using different assumptions in the application of such policies.  In the event estimates or assumptions prove to be different from actual amounts, adjustments are made in subsequent periods to reflect more current information.  Our significant accounting policies are disclosed in Note 1 to the Consolidated Financial Statements.  The following discussion addresses our most critical accounting policies and estimates, which are those that are both important to the portrayal of our financial condition and results of operations and that require significant judgment or use of complex estimates.\n31\nTable of Contents\nMerchandise Inventory:\nWe identify potentially excess and slow-moving inventory by evaluating turn rates, historical and expected future sales trends, age of merchandise, overall inventory levels, current cost of inventory, and other benchmarks. We have established an inventory valuation reserve to recognize the estimated impairment in value (i.e., an inability to realize the full carrying value) based on our aggregate assessment of these valuation indicators under prevailing market conditions and current merchandising strategies.\nWe also have established a reserve for estimating inventory shrinkage between physical inventory counts. The reserve is established by assessing the chain-wide average shrinkage experience rate, applied to the related periods’ sales volumes.  Such assessments are updated on a regular basis for the most recent individual store experiences. Our general policy is to perform physical inventories at least once a year for each store that has been open more than twelve months.\nWe do not believe our merchandise inventories are subject to significant risk of obsolescence in the near term.  However, changes in market conditions or consumer purchasing patterns could result in the need for additional reserves. Our impairment reserves contain uncertainties because the calculations require management to make assumptions and to apply judgment regarding forecasted customer demand and the promotional environment. The estimated store inventory shrink rate is based on historical experience. We believe historical rates are a reasonably accurate reflection of future trends. Our shrinkage reserve contains uncertainties because the calculation requires management to make assumptions and to apply judgment regarding future shrinkage trends, the effect of loss prevention measures and merchandising strategies.\nWe have not made any material changes in the accounting methodology used to recognize inventory impairment reserves or shrinkage in the financial periods presented. We do not believe there is a reasonable likelihood that there will be a material change in the future estimates or assumptions we use to calculate impairment or shrinkage.  However, if assumptions regarding consumer demand, clearance potential or inventory loss for certain products are inaccurate, we may be exposed to losses or gains that could be material.  A 10% change in our inventory impairment reserve as of December 28, 2024, would have affected net income by approximately $2.5 million in fiscal 2024. A 10% change in our shrinkage reserve as of December 28, 2024, would have affected net income by approximately $4.7 million in fiscal 2024.\nSelf-Insurance Reserves:\nWe self-insure a significant portion of our workers’ compensation insurance and general liability (including product liability) insurance plans.  We have stop-loss insurance policies to protect from individual losses over specified dollar values.  Provisions for losses related to our self-insured liabilities are based upon periodic independent actuarially determined estimates that consider a number of factors including historical claims experience, loss development factors, and severity factors.\nThe full extent of certain workers’ compensation and general liability claims may not become fully determined for several years.  Our self-insured liabilities contain uncertainties because management is required to make assumptions and to apply judgment to estimate the ultimate cost to settle reported claims and claims incurred but not reported as of the balance sheet date based upon historical data and experience, including actuarial calculations.\nWe have not made any material changes in the accounting methodology used to establish our self-insurance reserves in the financial periods presented.  We do not believe there is a reasonable likelihood that there will be a material change in the assumptions we use to calculate insurance reserves.  However, if we experience a significant increase in the number of claims or the cost associated with these claims, we may be exposed to losses that could be material.  A 10% change in our self-insurance reserves as of December 28, 2024, would have affected net income by approximately $11.4 million in fiscal 2024.\nImpairment of Long-Lived Assets:\nLong-lived assets, including lease right-of-use assets, are evaluated for impairment whenever events or changes in circumstances indicate that the carrying value may not be recoverable. When evaluating long-lived assets for potential impairment, we first compare the carrying value of the asset or asset group to its estimated undiscounted future cash flows. The evaluation for long-lived assets is performed at the lowest level of identifiable cash flows, which is generally the individual store level. The significant assumptions used to determine estimated undiscounted cash flows include cash inflows and outflows directly resulting from the use of those assets in operations, including margin on net sales, payroll and related items, occupancy costs, insurance allocations, and other costs to operate a store.  If the estimated future cash flows are less than the carrying value of the related asset, we calculate an impairment loss. The impairment loss calculation compares the carrying value of the related \n32\nTable of Contents\nasset or asset group to its estimated fair value, which may be based on an estimated future cash flow model, market valuation, or other valuation technique, as appropriate. We recognize an impairment loss if the amount of the asset’s carrying value exceeds the asset’s estimated fair value. If we recognize an impairment loss, the adjusted carrying amount of the asset becomes its new cost basis. For a depreciable long-lived asset, the new cost basis will be depreciated (amortized) over the remaining estimated useful life of that asset.\nOur impairment loss calculations contain uncertainties because they require management to make assumptions and to apply judgment to estimate future cash flows and asset fair values.\nWe have not made any material changes in our impairment loss assessment methodology in the financial periods presented.\nWe do not believe there is a reasonable likelihood that there will be a material change in the estimates or assumptions we use to calculate long-lived asset impairment losses. None of these estimates and assumptions are significantly sensitive, and a 10% change in any of these estimates would not have a material impact on our analysis.  However, if actual results are not consistent with our estimates and assumptions used in estimating future cash flows and asset fair values, we may be exposed to losses that could be material. \nThere were no significant long-lived assets impairment charges recognized in fiscal 2024.\nImpairment of Goodwill and Other Indefinite-Lived Intangible Assets:\nGoodwill and other indefinite-lived intangible assets are evaluated for impairment annually, or whenever events or changes in circumstances indicate that the carrying value may not be recoverable.  In accordance with the accounting standards, an entity has the option first to assess qualitative factors to determine whether events and circumstances indicate that it is more likely than not that goodwill or an indefinite-lived intangible asset is impaired. If after such assessment an entity concludes that the asset is not impaired, then the entity is not required to take further action. However, if an entity concludes otherwise, then it is required to determine the fair value of the asset using a quantitative impairment test, and if impaired, the associated assets must be written down to fair value.  \nThe quantitative impairment test for goodwill compares the fair value of a reporting unit with the carrying value of its net assets, including goodwill.  If the fair value of the reporting unit is less than the carrying value of the reporting unit, an impairment charge would be recorded to the Company’s operations, for the amount in which the carrying amount exceeds the reporting unit’s fair value.  We determine fair values for each reporting unit using the market approach, when available and appropriate, the income approach, or a combination of both. The income approach involves forecasting projected financial information (such as revenue growth rates, profit margins, tax rates, and capital expenditures) and selecting a discount rate that reflects the risk inherent in estimated future cash flows.  Under the market approach, the fair value is based on observed market data.  If multiple valuation methodologies are used, the results are weighted appropriately.  \nThe quantitative impairment test for other indefinite-lived intangible assets involves comparing the carrying amount of the asset to the sum of the discounted cash flows expected to be generated by the asset.  If the implied fair value of the indefinite-lived intangible asset is less than the carrying value, an impairment charge would be recorded to the Company’s operations. \nOur impairment loss calculation contains uncertainties because they require management to make assumptions and to apply judgment to qualitative factors as well as estimate future cash flows and asset fair values, including forecasting projected financial information and selecting the discount rate that reflects the risk inherent in future cash flows.\nThe valuation approaches utilized to estimate fair value for the purposes of the impairment tests of goodwill and other indefinite-lived intangible assets require the use of assumptions and estimates, which involve a degree of uncertainty. If actual results are not consistent with our estimates and assumptions used in estimating future cash flows and asset fair values, we may be exposed to non-cash impairment losses that could be material.\nThere were no goodwill or other indefinite-lived intangible assets impairment charges recognized in fiscal 2024.\n33\nTable of Contents\nResults of Operations\nThe following table sets forth, for the periods indicated, certain items in the Consolidated Statements of Income expressed as a percentage of net sales.\nFiscal Year\n \n2024\n2023\nNet sales\n100.00 \n%\n100.00 \n%\nCost of merchandise sold \n(a)\n63.74 \n64.08 \nGross margin \n(a)\n36.26 \n35.92 \nSelling, general and administrative expenses \n(a)\n23.39 \n23.06 \nDepreciation and amortization\n3.00 \n2.70 \nOperating income\n9.86 \n10.16 \nInterest expense, net\n0.37 \n0.32 \nIncome before income taxes\n9.49 \n9.84 \nIncome tax expense\n2.09 \n2.23 \nNet income\n7.40 \n%\n7.61 \n%\n(a) Our gross margin amounts may not be comparable to those of other retailers since some retailers include all of the costs related to their distribution facility network in cost of merchandise sold and others (like our Company) exclude a portion of these distribution facility network costs from gross margin and instead include them in Selling, general, and administrative expenses; refer to Note 1 – Significant Accounting Policies of the Notes to the Consolidated Financial Statements, included in Item 8 Financial Statements and Supplementary Data, of this Annual Report on Form 10-K.\nFiscal 2024 Compared to Fiscal 2023 \nNet sales increased 2.2% to $14.88 billion in fiscal 2024 from $14.56 billion in fiscal 2023. Comparable store sales increased 0.2% from the prior year and represented $14.44 billion in sales.  The comparable store average transaction value decreased 0.6% and comparable store average transaction count increased 0.8% for fiscal 2024, as compared to an increase of 0.4% and decrease of 0.4% in fiscal 2023, respectively. Comparable store sales performance reflects merchandise category performance within a relatively tight band, with strength in Seasonal categories and big ticket merchandise. The growth of C.U.E. products was in line with the chain average as positive unit growth was offset by average unit price pressure, principally due to commodity price deflation.\n \nSales from stores opened less than one year were $426.2 million in fiscal 2024, which contributed a net 2.1 percentage points of the 2.2% increase over fiscal 2023 net sales.  Sales from stores opened less than one year and stores from the Orscheln acquisition were $652.8 million in fiscal 2023, which represented 4.1 percentage points of the 2.5% increase over fiscal 2022 net sales. \nThe following table summarizes our store growth during fiscal 2024 and 2023:\nFiscal Year\nStore Count Information:\n2024\n2023\nTractor Supply\nBeginning of period\n2,216 \n2,147 \nNew stores opened\n80 \n70 \nStores closed\n— \n(1)\nEnd of period\n2,296 \n2,216 \nPetsense by Tractor Supply\nBeginning of period  \n198 \n186 \nNew stores opened\n11 \n13 \nStores closed\n(3)\n(1)\nEnd of period\n206 \n198 \nConsolidated end of period\n2,502 \n2,414 \nStores relocated \n5 \n8 \n34\nTable of Contents\nThe following table indicates the percentage of net sales represented by each of our major product categories during fiscal 2024 and 2023:\n \nPercent of Net Sales\nFiscal Year\nProduct Category:\n2024\n2023\nLivestock, Equine, & Agriculture\n26 \n%\n27 \n%\nCompanion Animal\n25 \n25 \nSeasonal & Recreation\n23 \n22 \nTruck, Tool, & Hardware\n16 \n16 \nClothing, Gift, & Décor\n10 \n10 \nTotal\n100 \n%\n100 \n%\nGross profit increased 3.2% to $5.40 billion in fiscal 2024 compared to $5.23 billion in fiscal 2023. As a percent of net sales, gross margin increased 34 basis points to 36.3% for fiscal 2024 compared to 35.9% for fiscal 2023. The gross margin rate increase was primarily attributable to lower transportation costs along with disciplined product cost management and the continued execution of an everyday low price strategy. This was partially offset by unfavorable product mix, primarily from growth in big ticket categories, which have below chain-average margins.\nTotal selling, general and administrative (“SG&A”) expenses, including depreciation and amortization, increased 4.8% to $3.93 billion in fiscal 2024 from $3.75 billion in fiscal 2023. As a percent of net sales, SG&A expenses increased 63 basis points to 26.4% from 25.8%. The increase in SG&A as a percentage of net sales was primarily attributable to the Company’s planned growth investments, which included higher depreciation and amortization and the onboarding of a new distribution center, as well as modest deleverage of the Company’s fixed costs given the level of comparable store sales growth.\nOur effective income tax rate decreased to 22.1% for fiscal 2024 compared to 22.7% in fiscal 2023.  The primary drivers for the decrease in the Company's effective income tax rate year over year were a decrease in state income taxes and an increase in federal credits, partially offset by a reduction in the benefit from overall annual stock compensation activity.\nNet income in fiscal 2024 was $1.10 billion, or $2.04 per diluted share, compared to $1.11 billion, or $2.02 per diluted share, in fiscal 2023.\nDuring fiscal 2024, we repurchased approximately 10.6 million shares of the Company’s common stock at a total cost of $566.4 million, including the 1% excise tax, as part of our share repurchase program.  In fiscal 2023, we repurchased approximately 13.7 million shares at a total cost of $602.9 million.\nFiscal 2023 Compared to Fiscal 2022 \nFor a comparison of our performance and financial metrics for the fiscal years ended December 30, 2023 and December 31, 2022, see “Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our Annual Report on Form 10-K for the fiscal year ended December 30, 2023, filed with the SEC on February 23, 2024 (“2023 10-K”).\nLiquidity and Capital Resources\nIn addition to normal operating expenses, our primary ongoing cash requirements are for new store expansion, existing store remodeling and improvements, store relocations, distribution facility capacity and improvements, information technology, inventory purchases, repayment of existing borrowings under our debt facilities, share repurchases, cash dividends, and selective acquisitions as opportunities arise.  \n35\nTable of Contents\nOur primary ongoing sources of liquidity are existing cash balances, cash provided from operations, remaining funds available under our debt facilities, operating and finance leases, and normal trade credit. Our inventory and accounts payable levels typically build in the first and third fiscal quarters to support the higher sales volume of the spring and cold-weather selling seasons, respectively.\nWe plan to continue to leverage our sale-leaseback program on both existing owned stores and future new store openings in order to help fund our planned owned store development over the next several years.\nWe believe that our existing cash balances, expected cash flow from future operations, funds available under our debt facilities, operating and finance leases, normal trade credit, and access to the long-term debt capital markets will be sufficient to fund our operations and our capital expenditure needs, including new store openings, existing store remodeling and improvements, store relocations, distribution facility capacity and improvements, and information technology improvements, for the next 12 months and the foreseeable future. \nDebt\nThe following table summarizes the Company’s outstanding debt as of the dates indicated (in millions):\nDecember 28, 2024\nDecember 30, 2023\n5.25% Senior Notes\n$\n750.0 \n$\n750.0 \n1.75% Senior Notes\n650.0 \n650.0 \n3.70% Senior Notes\n150.0 \n150.0 \nSenior Credit Facility:\nRevolving Credit Facility\n300.00 \n200.00 \nTotal outstanding borrowings\n1,850.0 \n1,750.0 \nLess: unamortized debt discounts and issuance costs\n(18.0)\n(21.0)\nTotal debt\n1,832.0 \n1,729.0 \nLess: current portion of long-term debt\n— \n— \nLong-term debt\n$\n1,832.0 \n$\n1,729.0 \nOutstanding letters of credit\n$\n74.1 \n$\n58.3 \nWe manage our business and financial ratios to target an investment-grade bond rating, which has historically allowed flexible access to financing at reasonable market costs. As of December 28, 2024, and the date of this filing, February 20, 2025, the Company's senior unsecured debt is rated “Baa1,” by Moody’s Investor Services with a stable outlook and “BBB” by Standard & Poor’s with a stable outlook. These ratings have been obtained with the understanding that Moody’s Investors Services and Standard & Poor’s will continue to monitor our credit and make future adjustments to these ratings to the extent warranted. The ratings are not a recommendation to buy, sell or hold our securities, may be changed, superseded or withdrawn at any time and should be evaluated independently of any other rating.\nOur current ratings, as well as future rating agency actions, could impact our ability to finance our operations on satisfactory terms and affect our financing costs.  There can be no assurance that we will maintain or improve our current credit ratings. \nOn May 5, 2023, the Company completed the sale of $750 million aggregate principal amount of its 5.25% Senior Notes. The\nentire principal amount of the 5.25% Senior Notes is due in full on May 15, 2033. Interest is payable semi-annually in arrears\non each May 15 and November 15. The terms of the 5.25% Senior Notes are governed by the Base Indenture (as defined below), as amended and supplemented by the Second Supplemental Indenture (as defined below) between the Company and Regions Bank, as trustee.\nFor additional information about the Company’s debt and credit facilities, refer to Note 4 to the Consolidated Financial Statements. \n36\nTable of Contents\nOperating Activities\nOperating activities provided cash of $1.42 billion and $1.33 billion in fiscal 2024 and 2023, respectively. The $86.8 million increase in net cash provided by operating activities in fiscal 2024 compared to fiscal 2023 was due to changes in the following (in millions): \nFiscal Year\n \n2024\n2023\nVariance\n(52 weeks)\n(52 weeks)\nNet income\n$\n1,101.2 \n$\n1,107.2 \n$\n(6.0)\nDepreciation and amortization\n447.2 \n393.0 \n54.2 \n(Gain)/loss on disposition of property and equipment\n(62.5)\n(48.0)\n(14.5)\nShare-based compensation expense\n48.4 \n57.0 \n(8.6)\nDeferred income taxes\n(22.6)\n6.2 \n(28.8)\nInventories and accounts payable\n(137.9)\n(178.0)\n40.1 \nPrepaid expenses and other current assets\n11.5 \n22.4 \n(10.9)\nAccrued expenses\n30.3 \n(44.6)\n74.9 \nIncome taxes\n(19.2)\n(11.9)\n(7.3)\nOther, net\n24.4 \n30.7 \n(6.3)\nNet cash provided by operating activities\n$\n1,420.8 \n$\n1,334.0 \n$\n86.8 \nThe $86.8 million increase in net cash provided by operating activities is primarily driven by both increased accounts payable and timing of accruals and related payments. \nInvesting Activities\nInvesting activities used cash of $643.9 million and $653.1 million in fiscal 2024 and 2023, respectively.  The $9.2 million decrease in net cash used in investing activities, including capital expenditures, in fiscal 2024 compared to fiscal 2023 was due to changes in the following (in millions):\nFiscal Year\n \n2024\n2023\nVariance\n(52 weeks)\n(52 weeks)\nExisting stores\n$\n(284.0)\n$\n(156.2)\n$\n(127.8)\nNew and relocated stores and stores not yet opened\n(241.2)\n(130.6)\n(110.6)\nInformation technology\n(153.5)\n(134.6)\n(18.9)\nDistribution center capacity and improvements\n(95.8)\n(330.0)\n234.2 \nCorporate and other\n(9.5)\n(2.5)\n(7.0)\nTotal capital expenditures\n(784.0)\n(753.9)\n(30.1)\nProceeds from sale of property and equipment\n140.1 \n86.5 \n53.6 \nProceeds from sale of business assets\n— \n14.3 \n$\n(14.3)\nNet cash used in investing activities\n$\n(643.9)\n$\n(653.1)\n$\n9.2 \nCapital expenditures for distribution center capacity and improvements in fiscal 2024 and fiscal 2023 are primarily related to the construction of Maumelle, Arkansas. The Maumelle, Arkansas distribution center began operations in the second quarter of fiscal 2024 and expanded our distribution capacity by approximately 1.2 million square feet.\nThe increase in capital expenditures for new stores, relocated stores, and stores not yet opened is primarily attributable to increased capital outlay associated with our owned store development program. Spending also reflects an investment in 80 new Tractor Supply stores, 11 new Petsense by Tractor Supply stores, and  five store relocations during fiscal 2024. In fiscal 2023, we opened 70 new Tractor Supply stores and 13 new Petsense by Tractor Supply stores and had eight store relocations. \n37\nTable of Contents\nCapital expenditures for information technology reflect continued support of our store growth and our Digital initiatives, as well as improvements in security and compliance and other strategic initiatives.\nCapital expenditures for existing stores in fiscal \n2024\n and fiscal \n2023\n primarily reflect our strategic initiatives related to store remodels, including internal space productivity and side lot garden center transformations. Spending in both fiscal \n2024 and fiscal 2023 also includes routine maintenance activity. \nSpending in fiscal 2023 also included Orscheln store conversions.\nCapital expenditures for corporate and other are primarily attributable to spending on space productivity projects and building modifications at the Store Support Center. \nIn fiscal 2024, we sold and subsequently leased back 20 of our retail locations, including 15 existing stores and 5 new stores, resulting in proceeds of $130.8 million. \nOur projected capital expenditures, net of sale leaseback proceeds, for fiscal 2025 are currently estimated to be in a range of approximately $650.0 million to $725.0 million. The capital expenditures include a plan to open approximately 90 Tractor Supply stores, continuing Project Fusion remodels and side lot garden center transformations, and opening approximately 10 new Petsense by Tractor Supply stores.\nFinancing Activities\nFinancing activities used cash of $922.5 million and $486.4 million in fiscal 2024 and 2023, respectively. The $436.1 million increase in net cash used in financing activities in fiscal 2024, compared to fiscal 2023, was due to changes in the following (in millions): \nFiscal Year\n \n2024\n2023\nVariance\n(52 weeks)\n(52 weeks)\nNet borrowings and repayments under debt facilities\n$\n100.0 \n$\n572.0 \n$\n(472.0)\nRepurchase of common stock\n(560.6)\n(594.4)\n33.8 \nNet proceeds from issuance of common stock\n39.4 \n24.4 \n15.0 \nCash dividends paid to stockholders\n(472.5)\n(449.6)\n(22.9)\nOther, net\n(28.8)\n(38.8)\n10.0 \nNet cash used in financing activities\n$\n(922.5)\n$\n(486.4)\n$\n(436.1)\nThe increase in net cash used in financing activities in fiscal 2024 compared to fiscal 2023 is primarily due to the decrease in net borrowings under the debt facilities and an increase in cash dividends paid to shareholders, partially offset by a decrease in the repurchase of common stock.\nRepurchase of Common Stock\nThe Company’s Board of Directors has authorized common stock repurchases under a share repurchase program which was announced in February 2007. The authorization amount of the program, which has been increased from time to time, is currently authorized for up to $6.50 billion, exclusive of any fees, commissions or other expenses related to such repurchases\n.  The s\nhare repurchase program does not have an expiration date.  The repurchases may be made from time to time on the open market or in privately negotiated transactions.  The timing and amount of any shares repurchased under the program will depend on a variety of factors, including price, corporate and regulatory requirements, capital availability, and other market conditions.  Repurchased shares are accounted for at cost and will be held in treasury for future issuance.  The program may be limited, temporarily paused, or terminated at any time without prior notice.  \nWe repurchased approximately 10.6 million and 13.7 million shares of common stock under the share repurchase program and paid cash totaling $560.6 million and $594.4 million in fiscal 2024 and 2023, respectively.  Our projected share repurchases for fiscal 2025 are currently estimated to be in a range of approximately $525 million to $600 million. \n38\nTable of Contents\nOn February 12, 2025 the Company’s Board of Directors authorized a $1.00 billion increase to the existing share repurchase program, bringing the total amount authorized to date under the program to $7.50 billion.\nCash Dividends Paid to Stockholders\nWe paid cash dividends totaling $472.5 million and $449.6 million in fiscal 2024 and 2023, respectively.  In fiscal 2024, we declared and paid cash dividends to stockholders of $0.88 per common share outstanding as compared to $0.82 per common share outstanding in fiscal 2023.  These payments reflect an increase in the quarterly dividend in all four quarters of fiscal 2024 to $0.22 per share from $0.21 per share in all four quarters of fiscal 2023.  \nOn February 12, 2025, the Company’s Board of Directors declared a quarterly cash dividend of $0.23 per share of the Company’s outstanding common stock.  The dividend will be paid on March 11, 2025, to stockholders of record as of the close of business on February 26, 2025.\nIt is the present intention of the Company’s Board of Directors to continue to pay a quarterly cash dividend; however, the declaration and payment amount of future dividends will be determined by the Company’s Board of Directors in its sole discretion and will depend upon the earnings, financial condition, and capital needs of the Company, along with any other factors which the Company’s Board of Directors deem relevant.\nNew Accounting Pronouncements\nRefer\n to Note 1 to the \nConsolidated Financial Statements for recently adopted accounting pronouncements and recently issued pronouncements not yet adopted as of December 28, 2024.",
  "item2": null
}