{
  "source_file": "tsco-20250927.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  Management’s Discussion and Analysis of Financial Condition and Results of Operations\nForward Looking Statements\nThe following discussion and analysis should be read in conjunction with our \nAnnual Report on Form 10-K\n for the fiscal year ended December 28, 2024 (the “2024 Form 10-K”) and subsequent Quarterly Reports on Form 10-Q.  This Quarterly Report on Form 10-Q contains forward-looking statements and information.  The forward-looking statements included herein are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995 (the “PSLRA”).  All statements, other than statements of historical facts, which address activities, events, or developments that we expect or anticipate will or may occur in the future, including sales and earnings growth, new store growth, estimated results of operations in future periods (including, but not limited to, sales, comparable store sales, operating margins, net income, and earnings per diluted share), the declaration and payment of dividends, the timing and amount of share repurchases, future capital expenditures (including their timing, amount and nature), sale-leasebacks, acquisitions, business strategy, strategic initiatives, expansion and growth of our business operations, and other such matters are forward-looking statements.  Forward-looking statements are usually identified by or are associated with such words as “will,” “plans,” “intend,” “expect,” “believe,” “anticipate,” “optimistic,” “forecasted” and similar terminology.  These forward-looking statements may be affected by certain risks and uncertainties, any one, or a combination of which, could materially affect the results of our operations.  To take advantage of the safe harbor provided by the PSLRA, we have identified certain factors in Part I, Item 1A. “Risk Factors” in our \n2024 Form 10-K\n and herein, including the impact of changes in tariffs and the corresponding macroeconomic pressures, which may cause actual results to differ materially from those expressed in any forward-looking statements. These “Risk Factors” may be updated from time to time in our quarterly reports on Form 10-Q or other subsequent filings with the SEC.\nForward-looking statements made by or on behalf of the Company are based on our knowledge of our business and the environment in which we operate, but because of the factors listed above or other factors, actual results could differ materially from those reflected by any forward-looking statements.  Consequently, all of the forward-looking statements made are qualified by these cautionary statements and those contained in the Company’s \n2024 Form 10-K\n and other filings with the Securities and Exchange Commission (the “SEC”).  There can be no assurance that the actual results or developments anticipated by the Company will be realized or, even if substantially realized, that they will have the expected consequences to or effects on the Company or our business and operations.  Readers are cautioned not to place undue reliance on these forward-looking statements, which speak only as of the date hereof.  We do not undertake any obligation to release publicly any revisions to these forward-looking statements to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events, except as required by law.\nSeasonality and Weather\nOur business is seasonal.  Historically, our sales and profits are the highest in the second and fourth fiscal quarters due to the sale of seasonal products.  We usually experience our highest inventory and accounts payable balances during our first fiscal quarter for purchases of seasonal products to support the higher sales volume of the spring selling season, and again during our third fiscal quarter to support the higher sales volume of the cold weather selling season.  We believe that our business can be more accurately assessed by focusing on the performance of the halves, not the quarters, due to the fact that different weather patterns from year-to-year can shift the timing of sales and profits between quarters, particularly between the first and second fiscal quarters and the third and fourth fiscal quarters. \nHistorically, weather conditions, including unseasonably warm weather in the fall and winter months and unseasonably cool weather in the spring and summer months, have unfavorably affected the timing and volume of our sales and results of operations.  In addition, extreme weather conditions, including snow and ice storms, flood and wind damage, hurricanes, tornadoes, extreme rain, and droughts have impacted operating results both negatively and positively, depending on the severity and length of these conditions.  Our strategy is to manage product flow and adjust merchandise assortments and depth of inventory to capitalize on seasonal demand trends, but there is no guarantee that we will be able to successfully execute this strategy. For more information regarding the risks we face in this regard, see Item 1A. “Risk Factors—Weather and Climate Risks” in our \n2024 Form 10-K\n.\n \n17\nTable of Contents\nPerformance Metrics\nComparable Store Metrics\nComparable store metrics are a key performance indicator used in the retail industry and by the Company to measure the performance of the underlying business. Our comparable store metrics are calculated on an annual basis using sales generated from all stores open at least one year and all online sales and exclude certain adjustments to net sales. Stores closed during either of the years being compared are removed from our comparable store metrics calculations. Stores relocated during either of the years being compared are not removed from our comparable store metrics calculations. If the effect of relocated stores on our comparable store metrics calculations became material, we would remove relocated stores from the calculations. Allivet sales will be considered comparable store sales one year after the transaction close date of December 30, 2024. Comparable store sales are intended only as supplemental information and are not a substitute for net sales presented in accordance with U.S. GAAP. \nTransaction Count and Transaction Value\nTransaction count and transaction value metrics are used by the Company to measure sales performance. Transaction count represents the number of customer transactions during a given period. Transaction value represents the average amount paid per transaction and is calculated as net sales divided by the total number of customer transactions during a given period.\nResults of Operations\nThe following table sets forth, for the periods indicated, certain items in the Consolidated Statements of Income expressed as a percentage of net sales. \nFor the Fiscal Three\nFor the Fiscal Nine\nMonths Ended\nMonths Ended\nSeptember 27, 2025\nSeptember 28, 2024\nSeptember 27,\n2025\nSeptember 28,\n2024\nNet sales\n100.00%\n100.00%\n100.00%\n100.00%\nCost of merchandise sold\n62.65\n62.79\n63.15\n63.39\nGross profit\n37.35\n37.21\n36.85\n36.61\nSelling, general and administrative expenses\n24.80\n24.57\n23.64\n23.32\nDepreciation and amortization\n3.34\n3.27\n3.15\n2.94\nOperating income\n9.21\n9.36\n10.06\n10.34\nInterest expense, net\n0.39\n0.40\n0.45\n0.34\nIncome before income taxes\n8.82\n8.96\n9.61\n10.01\nIncome tax expense\n1.85\n2.00\n2.14\n2.22\nNet income\n6.97%\n6.96%\n7.47%\n7.78%\nNote: Percentage of net sales amounts may not sum to totals due to rounding.\nFiscal Three Months (Third Quarter) Ended September 27, 2025 and September 28, 2024 \nNet sales for the third quarter of fiscal 2025 increased 7.2% to $3.72 billion from $3.47 billion in the third quarter of fiscal 2024. The increase in net sales was driven primarily by the 3.9% increase in comparable store sales, as well as new store openings and the contribution from Allivet. In the third quarter of fiscal 2024, net sales increased 1.6% and comparable store sales decreased 0.2%. \nThe comparable store sales results for the third quarter of fiscal 2025 included a comparable average transaction count increase of 2.7% and a comparable average ticket increase of 1.2%. Comparable store sales growth was driven by strength in spring and summer seasonal products and continued momentum in core categories, especially consumable, usable and edible (C.U.E.) products.\n \n18\nTable of Contents\nSales from new stores, including Allivet sales, were $113.8 million for the third quarter of fiscal 2025, which represented 3.3 percentage points of the 7.2% net sales increase over third quarter fiscal 2024 net sales.  For the third quarter of fiscal 2024, sales from stores open less than one year were $70.1 million, which represented 2.0 percentage points of the 1.6% increase over third quarter fiscal 2023 net sales. \nThe following table summarizes store growth for the fiscal three months ended September 27, 2025 and September 28, 2024:\nFiscal Three Months Ended\nStore Count Information:\nSeptember 27, 2025\nSeptember 28, 2024\nTractor Supply\nBeginning of period\n2,335 \n2,254 \nNew stores opened\n29 \n16 \nStores closed\n— \n— \nEnd of period\n2,364 \n2,270 \nPetsense by Tractor Supply\nBeginning of period\n207 \n205 \nNew stores opened\n— \n— \nStores closed\n(1)\n— \nEnd of period\n206 \n205 \nConsolidated end of period\n2,570 \n2,475 \nStores relocated\n— \n1 \nThe following table indicates the percentage of net sales represented by each of our major product categories for the fiscal three months ended September 27, 2025 and September 28, 2024:\nPercent of Net Sales\n \nFiscal Three Months Ended\nProduct Category:\nSeptember 27, 2025\nSeptember 28, 2024\nLivestock, Equine & Agriculture\n29 \n%\n28 \n%\nCompanion Animal\n25 \n%\n25 \n%\nSeasonal & Recreation\n22 \n%\n22 \n%\nTruck, Tool & Hardware\n16 \n%\n17 \n%\nClothing, Gift & Décor\n8 \n%\n8 \n%\nTotal\n100 \n%\n100 \n%\nGross profit increased 7.7% to $1.39 billion for the third quarter of fiscal 2025 from $1.29 billion for the third quarter of fiscal 2024. As a percent of net sales, gross margin in the third quarter of fiscal 2025 increased 15 basis points to 37.4% from 37.2% in the third quarter of fiscal 2024. Gross margin improvement from the Company’s ongoing focus on product cost management and the continued execution of an everyday low price strategy was primarily offset by tariff costs and higher transportation costs.\nSelling, general and administrative (“SG&A”) expenses, including depreciation and amortization, increased 8.4% to $1.05 billion for the third quarter of fiscal 2025 from $965.8 million for the third quarter of fiscal 2024.  As a percent of net sales, SG&A expenses increased 29 basis points to 28.1% in the third quarter of fiscal 2025 from 27.8% in the third quarter of fiscal 2024.  The increase in SG&A as a percent of net sales was primarily attributable to planned investments, as well as the timing of higher incentive compensation as the Company lapped lower accruals in the prior year and a lower sale-leaseback benefit. These factors were partially offset by an ongoing focus on productivity and fixed cost leverage. \nOperating income for the third quarter of fiscal 2025 increased 5.6% to $342.7 million from $324.6 million in the third quarter of fiscal 2024.\n \n19\nTable of Contents\nThe effective income tax rate was 21.0% in the third quarter of fiscal 2025 compared to 22.3% in the third quarter of fiscal 2024.  The decrease in the effective income tax rate in the third quarter of fiscal 2025 compared to the third quarter of fiscal 2024 was driven primarily by the benefit associated with the purchase of a transferable federal tax credit.\nNet income for the third quarter of fiscal 2025 increased 7.4% to $259.3 million, or $0.49 per diluted share, as compared to net income of $241.5 million, or $0.45 per diluted share, for the third quarter of fiscal 2024.\nDuring the third quarter of fiscal 2025, we repurchased approximately 1.3 million shares of the Company’s common stock at a total cost of $75.4 million, excluding the 1% excise tax, as part of our share repurchase program and paid quarterly cash dividends totaling $121.9 million, returning $197.3 million of capital to our stockholders.\nFiscal Nine Months Ended September 27, 2025 and September 28, 2024\nNet sales for the first nine months of fiscal 2025 increased 4.6% to $11.63 billion from $11.11 billion in the first nine months of fiscal 2024. The increase in net sales was driven partially by the 1.5% increase in comparable store sales, as well as new store openings and the contribution from Allivet. In the first nine months of fiscal 2024, net sales increased 2.0% and comparable store sales were flat. \nThe comparable store sales results for the first nine months of fiscal 2025 included a comparable average transaction count increase of 1.9%, partially offset by a decrease in comparable average transaction value of 0.3%. Comparable store sales growth was driven primarily by performance in year-round categories, including C.U.E. products, along with strong demand in the first quarter for winter seasonal products and strength in spring and summer seasonal products across the second and third quarters. This growth was partially offset by softness in big ticket and select discretionary categories.\nSales from new stores, including Allivet sales, were $338.3 million for the first nine months of fiscal 2025, which represented 3.0 percentage points of the 4.6% net sales increase over the first nine months of fiscal 2024 net sales.  For the first nine months of fiscal 2024, sales from stores open less than one year were $219.1 million, which represented 2.0 percentage points of the 2.0% increase over the first nine months of fiscal 2023 net sales.  \n \n20\nTable of Contents\nThe following table summarizes store growth for the fiscal nine months ended September 27, 2025 and September 28, 2024:\nFiscal Nine Months Ended\nStore Count Information:\nSeptember 27, 2025\nSeptember 28, 2024\nTractor Supply\nBeginning of period\n2,296 \n2,216 \nNew stores opened\n68 \n54 \nStores closed\n— \n— \nEnd of period\n2,364 \n2,270 \nPetsense by Tractor Supply\nBeginning of period\n206 \n198 \nNew stores opened\n4 \n7 \nStores closed\n(4)\n— \nEnd of period\n206 \n205 \nConsolidated, end of period\n2,570 \n2,475 \nStores relocated\n7 \n4 \nThe following table indicates the percentage of net sales represented by each of our major product categories for the fiscal nine months ended  September 27, 2025 and September 28, 2024 :\nPercent of Net Sales\nFiscal Nine Months Ended\nProduct Category:\nSeptember 27, 2025\nSeptember 28, 2024\nLivestock, Equine & Agriculture\n29 \n%\n28 \n%\nCompanion Animal\n24 \n%\n24 \n%\nSeasonal & Recreation\n24 \n%\n24 \n%\nTruck, Tool & Hardware\n15 \n%\n16 \n%\nClothing, Gift & Décor\n8 \n%\n8 \n%\nTotal\n100 \n%\n100 \n%\nGross profit increased 5.4% to $4.28 billion for the first nine months of fiscal 2025 from $4.07 billion for the first nine months of fiscal 2024.  As a percent of net sales, gross margin in the first nine months of fiscal 2025 increased 25 basis points to 36.9%  from 36.6% in the first nine months of fiscal 2024. Gross margin improvement from the Company’s ongoing focus on product cost management and the continued execution of an everyday low price strategy was partially offset by tariff costs and higher transportation costs.\nSelling, general and administrative (“SG&A”) expenses, including depreciation and amortization, increased 6.8% to $3.11 billion for the first nine months of fiscal 2025 from $2.92 billion for the first nine months of fiscal 2024.  As a percent of net sales, SG&A expenses increased 53 basis points to 26.8% in the first nine months of fiscal 2025 from 26.3% in the first nine months of fiscal 2024. The increase in SG&A as a percent of net sales was primarily attributable to the Company’s planned investments and modest deleverage of fixed costs given the level of comparable store sales. These factors were partially offset by an ongoing focus on productivity and cost control.\nOperating income for the first nine months of fiscal 2025 increased 1.8% to $1.17 billion compared to $1.15 billion in the first nine months of fiscal 2024. \nThe effective income tax rate was 22.3% in the first nine months of fiscal 2025 compared to 22.2% in the first nine months of fiscal 202\n4. The increase in the effective income tax rate in the first nine months of fiscal 2025 compared to the first nine months of fiscal 2024 was driven primarily by a reduction in the benefit from annual stock compensation activity, partially offset by the benefit associated with the purchase of a transferable federal tax credit.\n \n21\nTable of Contents\nNet income for the first nine months of fiscal 2025 increased 0.4% to $868.7 million, or $1.63 per diluted share, as compared to net income of $864.8 million, or $1.60 per diluted share, for the first nine months of fiscal 2024. \nDuring the first nine months of fiscal 2025, we repurchased approximately \n4.4\n million shares of the Company’s common stock at a total cost of\n $243.2 million,\n excluding the 1% excise tax, as part of our share repurchase program and paid quarterly cash dividends totaling $366.2 million, returning $609.4 million to our stockholders.\nLiquidity and Capital Resources\nIn addition to normal operating expenses, our primary ongoing cash requirements are for new store expansion, existing store remodeling and improvements, store relocations, distribution facility capacity and improvements, information technology, inventory purchases, repayment of existing borrowings under our debt facilities, share repurchases, cash dividends, and selective acquisitions as opportunities arise.  \nOur primary ongoing sources of liquidity are existing cash balances, cash provided from operations, remaining funds available under our debt facilities, operating and finance leases, and normal trade credit. Our inventory and accounts payable levels typically build in the first and third fiscal quarters to support the higher sales volume of the spring and cold-weather selling seasons, respectively.\nWe plan to continue to leverage our sale-leaseback program on both existing owned stores and future new store openings in order to help fund our planned owned store development over the next several years.\nWe believe that our existing cash balances, expected cash flow from future operations, funds available under our debt facilities, operating and finance leases, normal trade credit, and access to the long-term debt capital markets will be sufficient to fund our operations and our capital expenditure needs, including new store openings, existing store remodeling and improvements, store relocations, distribution facility capacity and improvements, and information technology improvements, for the next 12 months and the foreseeable future.  \nDebt\nThe following table summarizes the Company’s outstanding debt as of the dates indicated (in millions):\nSeptember 27, 2025\nDecember 28, 2024\nSeptember 28, 2024\n5.25% Senior Notes\n$\n750.0 \n$\n750.0 \n$\n750.0 \n1.75% Senior Notes\n650.0 \n650.0 \n650.0 \n3.70% Senior Notes \n(a)\n150.0 \n150.0 \n150.0 \nSenior credit facilities:\nRevolving Credit Facility\n210.0 \n300.0 \n300.0 \nTotal outstanding borrowings\n1,760.0 \n1,850.0 \n1,850.0 \nLess: unamortized debt discounts and issuance costs\n(15.8)\n(18.0)\n(18.8)\nTotal debt\n1,744.2 \n1,832.0 \n1,831.2 \nLess: current portion of long-term debt\n— \n— \n— \nLong-term debt\n$\n1,744.2 \n$\n1,832.0 \n$\n1,831.2 \nOutstanding letters of credit\n$\n80.8 \n$\n74.1 \n$\n78.8 \n(a) Also referred to herein as the “Note Purchase Facility,” referring to the Note Purchase and Private Shelf Agreement dated as of August 14, 2017 by and among the Company, PGIM, Inc. and the noteholders party thereto, as amended through November 2, 2022, under which the notes were purchased.\nFor additional information about the Company’s debt and credit facilities, refer to \nNote 6\n to the Consolidated Financial Statements.\n \n22\nTable of Contents\nCash Flows Provided by Operating Activities\nOperating activities provided net cash of $1.31 billion and $903.6 million in the first nine months of fiscal 2025 and fiscal 2024, respectively.  The $406.8 million increase in net cash provided by operating activities in the first nine months of fiscal 2025 compared to the first nine months of fiscal 2024 is due to changes in the following operating activities (in millions):\n \nFiscal Nine Months Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nVariance\nNet income\n$\n868.7 \n$\n864.8 \n$\n3.9 \nDepreciation and amortization\n366.2 \n327.1 \n39.1 \n(Gain)/loss on disposition of property and equipment\n(66.0)\n(38.8)\n(27.2)\nShare-based compensation expense\n41.3 \n35.1 \n6.2 \nDeferred income taxes\n16.8 \n(21.2)\n38.0 \nInventories and accounts payable\n(92.7)\n(266.7)\n174.0 \nPrepaid expenses and other current assets\n(8.4)\n9.1 \n(17.5)\nAccrued expenses\n65.3 \n(38.6)\n103.9 \nIncome taxes\n57.8 \n(11.9)\n69.7 \nOther, net\n61.4 \n44.7 \n16.7 \nNet cash provided by operating activities\n$\n1,310.4 \n$\n903.6 \n$\n406.8 \nNote: Amounts may not sum to totals due to rounding. \nThe $406.8 million increase in net cash provided by operating activities in the first nine months of fiscal 2025 compared to the first nine months of fiscal 2024 was primarily driven by our management of inventory and accounts payable and changes in accrued expenses from the purchase of a transferable federal tax credit, which was executed during the third quarter of fiscal 2025 and will be paid in the fourth quarter of fiscal 2025. In addition, net cash provided by operating activities benefitted from an increase in accrued income taxes driven by timing of payments.\nCash Flows Used in Investing Activities\nInvesting activities used net cash of $676.9 million and $460.1 million in the first nine months of fiscal 2025 and fiscal 2024, respectively. The $216.8 million increase in net cash used in investing activities in the first nine months of fiscal 2025 compared to the first nine months of fiscal 2024 is due to changes in the following investing activities (in millions):\n \nFiscal Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nVariance\nNew stores, relocated stores and stores not yet opened\n$\n(271.5)\n$\n(178.8)\n$\n(92.7)\nExisting stores\n(165.7)\n(209.8)\n44.1 \nInformation technology\n(113.7)\n(95.8)\n(17.9)\nDistribution center capacity and improvements\n(71.6)\n(45.2)\n(26.4)\nCorporate and other\n(6.7)\n(8.4)\n1.7 \n     Total capital expenditures\n(629.2)\n(538.0)\n(91.2)\nProceeds from sale of property and equipment\n92.2 \n77.9 \n14.3 \nAcquisition of Allivet, net of cash acquired\n$\n(139.9)\n$\n— \n(139.9)\nNet cash used in investing activities\n$\n(676.9)\n$\n(460.1)\n$\n(216.8)\nNote: Amounts may not sum to totals due to rounding. \nThe increase in capital expenditures for new stores, relocated stores and stores not yet opened in the first nine months of fiscal 2025 is primarily driven by the increase in new store openings and the construction of owned, fixed-fee development stores. \n \n23\nTable of Contents\nCapital expenditures for the first nine months of fiscal 2025 included the opening of 68 new Tractor Supply stores compared to 54 new Tractor Supply stores during the first nine months of fiscal 2024.\nThe decrease in capital expenditures for existing stores in the first nine months of fiscal 2025 primarily reflects both efficiencies and lower average costs related to internal space productivity and side lot garden center transformations and a reallocation of funds to construction of the new distribution center in Nampa, Idaho.\nCapital expenditures for information technology represent continued support of our store growth, digital initiatives, and Company-wide strategic initiatives.\nThe increase in capital expenditures for distribution center capacity and improvements in the first nine months of fiscal 2025 is primarily driven by the construction of our newest distribution center in Nampa, Idaho. The first nine months of fiscal 2024 reflect spend associated with construction of the Maumelle, Arkansas distribution center which opened during the second quarter of fiscal 2024. The first nine months of fiscal 2025 reflect spend associated with land development and ongoing construction of the Nampa, Idaho distribution center.\nOur projected capital expenditures, net of sale-leaseback proceeds, for fiscal 2025 are currently estimated to be in the range of approximately $650.0 million to $725.0 million. The capital expenditures include a plan to open approximately 90 Tractor Supply stores, continue Project Fusion remodels and side lot garden center transformations, continue construction on our Nampa, Idaho distribution center, and open approximately 10 new Petsense by Tractor Supply stores. \nOn December 30, 2024, the Company completed its acquisition of Allivet, an online pet pharmacy. Net cash used in investing activities includes the cash used for the acquisition of Allivet, net of cash acquired as part of the transaction. \nCash Flows Used in Financing Activities\nFinancing activities used net cash of $700.4 million and $654.3 million in the first nine months of fiscal 2025 and fiscal 2024, respectively. The $46.1 million change in net cash used in financing activities in the first nine months of fiscal 2025 compared to the first nine months of fiscal 2024 is due to changes in the following (in millions):\n \nFiscal Nine Months Ended\n \nSeptember 27, 2025\nSeptember 28, 2024\nVariance\nNet borrowings and repayments under debt facilities\n$\n(90.0)\n$\n100.0 \n$\n(190.0)\nRepurchase of common stock\n(244.0)\n(406.7)\n162.7 \nCash dividends paid to stockholders\n(366.2)\n(355.2)\n(11.0)\nNet proceeds from issuance of common stock\n18.6 \n32.5 \n(13.9)\nOther, net\n(18.8)\n(24.9)\n6.1 \nNet cash used in financing activities\n$\n(700.4)\n$\n(654.3)\n$\n(46.1)\nNote: Amounts may not sum to totals due to rounding. \nThe $46.1 million increase in net cash used in financing activities is primarily due to repayments under the Company’s Revolving Credit Facility compared to incremental borrowings under the Company’s Revolving Credit Facility in the prior year period, partially offset by a decrease in the repurchase of common stock.\n \n24\nTable of Contents\nDividends\nDuring the first nine months of fiscal 2025 and fiscal 2024, the Company's Board of Directors declared the following cash dividends:\nDate Declared\nDividend Amount\nPer Share of Common Stock\n(a)\nRecord Date\nDate Paid\nAugust 6, 2025\n$\n0.23 \nAugust 25, 2025\nSeptember 9, 2025\nMay 14, 2025\n$\n0.23 \nMay 28, 2025\nJune 10, 2025\nFebruary 12, 2025\n$\n0.23 \nFebruary 26, 2025\nMarch 11, 2025\nAugust 7, 2024\n$\n0.22 \nAugust 26, 2024\nSeptember 10, 2024\nMay 8, 2024\n$\n0.22 \nMay 28, 2024\nJune 11, 2024\nFebruary 5, 2024\n$\n0.22 \nFebruary 26, 2024\nMarch 12, 2024\n(a) All share and per share information has been adjusted to reflect the five-for-one Stock Split effective December 20, 2024.\nIt is the present intention of the Company’s Board of Directors to continue to pay a quarterly cash dividend; however, the declaration and payment of future dividends will be determined by the Company’s Board of Directors in its sole discretion and will depend upon the earnings, financial condition, and capital needs of the Company, along with any other factors that the Company’s Board of Directors deem relevant.\nOn November 5, 2025, the Company’s Board of Directors declared a quarterly cash dividend of $0.23 per share of the Company’s outstanding common stock. The dividend will be paid on December 9, 2025 to stockholders of record as of the close of business on November 24, 2025.\nShare Repurchase Program\nThe Company’s Board of Directors has authorized common stock repurchases under a share repurchase program which was announced in February 2007.  The aggregate total authorized amount of the program, which was increased by $1.00 billion on February 12, 2025, is currently $7.50 billion, exclusive of any fees, commissions, or other expenses related to such repurchases.  The share repurchase program does not have an expiration date.  The repurchases may be made from time to time on the open market or in privately negotiated transactions.  The timing and amount of any shares repurchased under the program will depend on a variety of factors, including price, corporate and regulatory requirements, capital availability, and other market conditions.  Repurchased shares are accounted for at cost and will be held in treasury for future issuance.  The program may be limited, temporarily paused, or terminated at any time without prior notice.  As of September 27, 2025, the Company had remaining authorization under the share repurchase program of $1.24 billion, exclusive of any fees, commissions, or other expenses.\nThe following table provides the number of shares repurchased, average price paid per share, and total cost of share repurchases pursuant to our publicly announced repurchase plan during the fiscal three and nine months ended September 27, 2025 and September 28, 2024, respectively (in thousands, except per share amounts):\nFiscal Three Months Ended\nFiscal Nine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nSeptember 27,\n2025\nSeptember 28,\n2024\nTotal number of shares repurchased \n(a)\n1,270 \n2,804 \n4,444\n7,839\nAverage price paid per share \n(a)\n$\n59.32 \n$\n53.43 \n$\n54.73 \n$\n51.84 \nTotal cost of share repurchases \n(b)\n$\n75,904 \n$\n151,342 \n$\n242,553 \n$\n410,431 \n(a) All share and per share information has been adjusted to reflect the five-for-one Stock Split effective December 20, 2024.\n(b) Effective January 1, 2023, the Company’s share repurchases are subject to a 1% excise tax as a result of the Inflation Reduction Act of 2022. Excise taxes incurred on share repurchases represent direct costs of the repurchase and are recorded as a part of the cost basis of the shares within treasury stock.  The cost of shares repurchased may differ from the repurchases of common stock amounts in the consolidated statements of cash flows due to unsettled share repurchases at the end of a period and excise taxes incurred on share repurchases.\n \n25\nTable of Contents\nSignificant Contractual Obligations and Commercial Commitments\nFor a description of the Company’s significant contractual obligations and commercial commitments, refer to Note 11 to the Consolidated Financial Statements included under Part II, Item 8 in our \n2024 Form 10-K\n for the fiscal year ended December 28, 2024. As of September 27, 2025, the Company had contractual commitments of approximately $118.6 million related to the construction of our newest distribution center in Nampa, Idaho. As of September 27, 2025, there has been no other material change in the information disclosed in the \n2024 Form 10-K\n for the fiscal year ended December 28, 2024.\nCritical Accounting Policies and Estimates\nManagement’s discussion and analysis of the Company’s financial position and results of operations are based upon its Consolidated Financial Statements, which have been prepared in accordance with U.S. GAAP.  The preparation of these financial statements requires management to make informed estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities.  The Company’s critical accounting policies, including areas of critical management judgments and estimates, have primary impact on the following financial statement areas:\n-\nInventory valuation\n-\nSelf-insurance reserves\n-\nImpairment of long-lived assets\n-\nImpairment of goodwill and other indefinite-lived intangible assets\nSee Note 1 to the Consolidated Financial Statements in our \n2024 Form 10-K\n for a discussion of the Company’s critical accounting policies.  The Company’s financial position and/or results of operations may be materially different when reported under different conditions or when using different assumptions in the application of such policies.  In the event estimates or assumptions prove to be different from actual amounts, adjustments are made in subsequent periods to reflect more current information. There have been no changes to our critical accounting policies and estimates as previously disclosed in our \n2024 Form 10-K\n.\nNew Accounting Pronouncements    \nFor recently adopted accounting pronouncements and recently issued accounting pronouncements not yet adopted as of September 27, 2025, refer to \nNote 1\n to the Consolidated Financial Statements included under Part I, Item 1 of this Quarterly Report on Form 10-Q."
}