{
  "item1": "Following this, all major automotive companies announced adoption NACS certain markets, access Supercharger network beginning phases 2024 production NACS vehicles beginning no later than 2025. also engaged SAE International govern NACS industry standard, now named J3400. continue monitor increase network Tesla Superchargers anticipation future demand. also work wide variety hospitality, retail public destinations, well businesses commuting employees, offer additional charging options customers, well single-family homeowners multi-family residential entities, deploy home charging solutions.",
  "item7": "TBD focused growing manufacturing capacity, which includes capacity manufacturing newer vehicle models such Cybertruck, Tesla Semi future vehicles utilizing aspects next generation platform, ramping production Gigafactories installed production capacities well increasing production rate efficiency current factories. next phase production growth will depend continued ramp factories initiated advances autonomy introduction new products, including those built next generation vehicle platform, well ability add available sources battery cell supply manufacturing own cells developing high-volume output, lower capital production costs longer range. goals improve vehicle performance, decrease production costs increase affordability customer awareness. These plans subject uncertainties inherent establishing ramping manufacturing operations, which may exacerbated new product manufacturing technologies introduce, number concurrent international projects, any industry-wide component constraints, labor shortages any future impact events outside control.",
  "item2": "Three Months Ended September 30, Nine Months Ended September 30, (Dollars millions) Automotive regulatory credits Total automotive revenues Total automotive & services other segment revenue Energy generation storage segment revenue Automotive & Services Other Segment Automotive sales revenue increased $1.53 billion, 8%, three months ended September 30, 2025 compared three months ended September 30, 2024, due increase approximately 46,000 combined Model 3 Model Y cash deliveries, partially offset decrease approximately 8,000 deliveries other models decrease one-time FSD recognition recognized $326 million FSD revenue Cybertruck certain features such Actually Smart Summon third quarter 2024. Automotive sales revenue decreased $4.75 billion, 9%, nine months ended September 30, 2025 compared nine months ended September 30, 2024, due decrease approximately 24,000 deliveries other models decrease approximately 49,000 combined Model 3 Model Y cash deliveries part bringing down all vehicle factories simultaneously changeover New Model Y. Additionally, there decrease one-time FSD recognition compared prior period lower average selling price per unit driven sales mix higher customer incentives such attractive financing options. Automotive regulatory credits revenue decreased $322 million, 44%, three months ended September 30, 2025 compared three months ended September 30, 2024."
}