{
  "source_file": "tsn-20250927.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nGENERAL\nTyson Foods, Inc. and its subsidiaries (collectively, the “Company,” “we,” “us,” “our,” “Tyson Foods” or “Tyson”) (NYSE: TSN) is a world-class food company and recognized leader in protein. Founded in 1935 by John W. Tyson, it has grown under four generations of family leadership. The Company is unified by this purpose: Tyson Foods. We Feed the World Like Family™ and has a broad portfolio of iconic products and brands including Tyson®, Jimmy Dean®, Hillshire Farm®, Ball Park®, Wright®, State Fair®, Aidells® and ibp®. Tyson Foods is dedicated to bringing high-quality food to every table in the world, safely, and affordably, now and for future generations. Headquartered in Springdale, Arkansas, the Company had approximately 133,000 employees (“team members”) on September 27, 2025. Through its Core Values, Tyson Foods strives to operate with integrity, create value for its shareholders, customers, communities and team members, be faith-friendly and inclusive, provide a safe work environment and serve as a steward of the animals, land and environment entrusted to it. Some of the key factors influencing our business are customer demand for our products; the ability to maintain and grow relationships with customers and introduce new and innovative products to the marketplace; accessibility of international markets; market prices for our products; the cost and availability of live cattle and hogs, raw materials and feed ingredients; availability of team members to operate our production facilities; and operating efficiencies of our facilities.\nWe operate a fully vertically-integrated chicken production process. Our integrated operations consist of breeding stock, contract farmers, feed production, processing, further-processing, marketing and transportation of chicken and related specialty products, including animal and pet food ingredients. Through our wholly-owned subsidiary, Cobb-Vantress, we are one of the leading poultry breeding stock suppliers in the world. Investing in breeding stock research and development allows us to breed into our flocks the characteristics found to be most desirable.\nWe also process live fed cattle and hogs and fabricate dressed beef and pork carcasses into primal and sub-primal meat cuts, case-ready beef and pork and fully-cooked meats. In addition, we derive value from specialty products such as hides and variety meats sold to further processors and others.\nWe produce a wide range of fresh, value-added, frozen and refrigerated food products. Our products are marketed and sold primarily by our sales staff to grocery retailers, grocery wholesalers, meat distributors, warehouse club stores, military commissaries, industrial food processing companies, chain restaurants or their distributors, live markets, international export companies and domestic distributors who serve restaurants, foodservice operations such as plant and school cafeterias, convenience stores, hospitals and other vendors. Additionally, sales to the military and a portion of sales to international markets are made through independent brokers and trading companies.\nAs part of our commitment to innovation and growth, we have a subsidiary focused on investing in companies developing breakthrough technologies, business models and products that have the potential to transform the food industry. Tyson New Ventures, LLC is used to broaden our exposure to innovative, new forms of protein and ways of improving animal welfare, water management, and packaging and land stewardship initiatives to complement the Company’s continuing investments in innovation in our core Beef, Pork, Chicken and Prepared Foods businesses. \nFINANCIAL INFORMATION OF SEGMENTS\nWe operate in four reportable segments: Beef, Pork, Chicken and Prepared Foods. We measure segment profit as operating income (loss). International/Other primarily includes our foreign operations in China, Malaysia, Mexico, South Korea, Thailand and the Kingdom of Saudi Arabia, third-party merger and integration costs and corporate overhead related to Tyson New Ventures, LLC. The contribution of each segment to net sales and operating income (loss), and the identifiable assets attributable to each segment, are set forth in Part II, Item 8, Notes to Consolidated Financial Statements, Note 17: Segment Reporting.\nDESCRIPTION OF SEGMENTS\nBeef\nBeef includes our operations related to processing live fed cattle and fabricating dressed beef carcasses into primal and sub-primal meat cuts and case-ready products. Products are marketed domestically to food retailers, foodservice distributors, restaurant operators, hotel chains and noncommercial foodservice establishments such as schools, healthcare facilities, the military and other food processors, as well as to international export markets. This segment also includes sales from specialty products such as hides, rendered products and variety meats, as well as logistics operations to move products through the supply chain. \n3\nPork\nPork includes our operations related to processing live market hogs and fabricating pork carcasses into primal and sub-primal cuts and case-ready products. Products are marketed domestically to food retailers, foodservice distributors, restaurant operators, hotel chains and noncommercial foodservice establishments such as schools, healthcare facilities, the military and other food processors, as well as to international export markets. This segment also includes our live swine group, related specialty product processing activities and logistics operations to move products through the supply chain.\nChicken\nChicken includes our domestic operations related to raising and processing live chickens into and purchasing raw materials for fresh, frozen and value-added chicken products, as well as sales from specialty products. Our value-added chicken products primarily include breaded chicken strips, nuggets, patties and other ready-to-fix or fully cooked chicken parts. Products are marketed domestically to food retailers, foodservice distributors, restaurant operators, convenience stores, hotel chains and noncommercial foodservice establishments such as schools, healthcare facilities, the military and other food processors, as well as to international export markets. This segment also includes logistics operations to move products through our domestic supply chain and the global operations of our chicken breeding stock subsidiary. \nPrepared Foods\nPrepared Foods includes our operations related to manufacturing and marketing frozen and refrigerated food products and logistics operations to move products through the supply chain. This segment includes brands such as Jimmy Dean®, Hillshire Farm®, Ball Park®, Wright®, State Fair®, as well as artisanal brands Aidells® and Gallo Salame®. Products primarily include a mixture of ready-to-cook and ready-to-eat sandwiches, sandwich components such as flame-grilled hamburgers and Philly steaks, pepperoni, bacon, breakfast sausage, turkey, lunchmeat, hot dogs, flour and corn tortilla products, appetizers, snacks, prepared meals, ethnic foods, side dishes, meat dishes, breadsticks and processed meats. Products are marketed domestically to food retailers, foodservice distributors, restaurant operators, convenience stores, hotel chains and noncommercial foodservice establishments such as schools, healthcare facilities, the military and other food processors, as well as to international export markets. \nRAW MATERIALS AND SOURCES OF SUPPLY\nBeef\nThe primary raw materials used in our beef operations are live cattle. We do not have facilities of our own to raise cattle but employ cattle buyers located throughout cattle producing areas who visit independent feed yards and public auctions to buy live cattle on the open spot market. These buyers are trained to select high quality animals, and we continually measure their performance. We also enter into various risk-sharing and procurement arrangements with producers to secure a supply of livestock for our facilities. Although we generally expect adequate supply of live cattle in the regions we operate, there may be periods of imbalance in supply and demand. The U.S. cattle market is currently experiencing limited supply of market-ready cattle and uncertainty exists regarding the timing of anticipated cattle herd rebuild.\nPork\nThe primary raw materials used in our pork operations are live hogs. The majority of our live hog supply is obtained through various procurement relationships with independent producers. We employ hog buyers who make purchase agreements of various time durations as well as purchase hogs on a daily basis, generally a few days before the animals are processed. These buyers are trained to select high quality animals, and we continually measure their performance. Additionally, we raise a small number of weanling swine to sell to independent finishers and to supply a minimal amount of market hogs and live swine for our own processing needs. Although we generally expect adequate supply of live hogs in the regions we operate, there may be periods of imbalance in supply and demand.\nChicken\nThe primary raw materials used in our domestic chicken operations are corn and soybean meal, used as feed, and live chickens raised primarily by independent contract farmers. Our vertically-integrated chicken process begins with breeding our pedigree and great grandparent stock out to produce the grandparent breeder flocks and ends with broilers for processing. Breeder flocks (i.e., grandparents) are raised to maturity in grandparent growing and laying farms where fertile eggs are produced. Fertile eggs are incubated at the grandparent hatchery and produce pullets (i.e., parents). Pullets are raised to 20 weeks of age, sent to breeder houses, and the resulting eggs are sent to our hatcheries. Once chicks have hatched, they are sent to broiler farms. There, contract farmers care for and raise the chicks according to our standards, with advice from our technical service personnel, until the broilers reach the desired processing weight. Adult chickens are transported to processing facilities where they are harvested and converted into finished products, which are then sent to distribution centers and delivered to customers.\nWe operate feed mills to produce scientifically-formulated feeds. In fiscal 2025, corn, soybean meal and other feed ingredients were major production costs, representing roughly 53% of our cost of growing a live chicken domestically. In addition to feed ingredients to grow the chickens, we use cooking ingredients, packaging materials and cryogenic agents. We believe our sources of supply for these materials are adequate for our present needs, and we do not anticipate any difficulty in acquiring these materials in the future. \nWhile we produce nearly all our inventory of breeder chickens and live broilers, we also purchase ice-packed or deboned chicken to meet production and sales requirements.\n4\nPrepared Foods\nThe primary raw materials used in our prepared foods operations are commodity-based raw materials, including beef, pork, chicken, turkey, flour, vegetables, cheese, eggs, seasonings and other cooking ingredients. Some of these raw materials are provided by our other segments, while others may be purchased from numerous suppliers and manufacturers. We believe the sources of supply of raw materials are adequate for our present needs.\nSEASONAL DEMAND\nDemand for beef, chicken, pork and certain prepared foods products, such as hot dogs and smoked sausage, generally increases during the spring and summer months and other key holiday periods and is generally softer during the winter months. Other prepared foods products, such as prepared meals, meat dishes, appetizers, bacon, and breakfast sausage, generally experience increased demand during the winter months, and also key holiday seasons, while demand generally is softer during the spring and summer months. \nCUSTOMERS\nWalmart Inc. accounted for approximately \n18.7\n% of our fiscal 2025 consolidated sales. Sales to Walmart Inc. were included in all of our segments. Any extended discontinuance of sales to this customer could, if not replaced, have a material impact on our operations. No other single customer or customer group represented more than 10% of fiscal 2025 consolidated sales.\nCOMPETITION\nOur food products compete with those of other food producers and processors and certain prepared food manufacturers. Additionally, our food products compete in markets around the world. We seek to achieve a leading market position for our products via our principal marketing and competitive strategy, which includes:\n•\nidentifying target markets for value-added products;\n•\nconcentrating production, sales and marketing efforts to appeal to and enhance demand from those markets; and\n•\nutilizing our national distribution systems and customer support services.\nPast efforts indicate customer demand can be increased and sustained through application of our marketing strategy, consumer insights, strong analytics to optimize efforts and supported by our distribution systems. The principal competitive elements are advertising, consumer and trade promotions, price, product safety and quality, brand identification, innovation, breadth and depth of product offerings, availability of products, customer service and credit terms.\nFOREIGN OPERATIONS\nWe sold products in approximately 140 countries and regions in fiscal 2025. Major sales markets include Canada, Central America, China, the European Union, the United Kingdom, Japan, Mexico, Malaysia, the Middle East, the Philippines, Singapore, South Korea, Taiwan, Thailand and Vietnam. We have the following foreign operations:\n•\nCobb-Vantress, a chicken breeding stock subsidiary, has business interests in Argentina, Brazil, China, the Dominican Republic, India, New Zealand, Peru, the Philippines, Spain, Tanzania, Turkey and the United Kingdom.\n•\nTyson Asia-Pacific consists of vertically-integrated chicken production operations in Thailand, multi-protein further-processing operations in Malaysia, a producer and distributor of value-added and cooked chicken and beef products in the Kingdom of Saudi Arabia, and joint venture interests in non-consolidated poultry businesses in Malaysia and the Kingdom of Saudi Arabia.\n•\nTyson China and Tyson South Korea consist of a vertically-integrated chicken production operation, multi-protein further-processing operations, and a joint venture interest in a non-consolidated chicken processing business in China. Tyson China and Tyson South Korea also sell beef, pork, and chicken products imported from Tyson production facilities in the United States and other global operations.\n•\nTyson Europe sells chicken products throughout the United Kingdom and Europe produced from our other global operations and co-packer arrangements.\n•\nVibra Agroindustrial S.A., a joint venture in Brazil in which we have a minority interest, is a vertically-integrated chicken processing business.\n•\nHolding Agro Industrial S.A., a joint venture in Argentina and Uruguay in which we have a minority interest, is a vertically-integrated chicken processing business.\n•\nTyson Mexico Trading Company, a Mexican subsidiary, sells chicken and prepared foods products primarily from our U.S. operations and co-packer arrangements.\nWe continue to evaluate growth opportunities in foreign locations. Additional information regarding export sales and long-lived assets located in foreign locations is set forth in Part II, Item 8, Notes to Consolidated Financial Statements, Note 17: Segment Reporting.\n5\nRESEARCH AND DEVELOPMENT\nWe conduct continuous research and development activities which include new product innovation, product improvements, ingredient simplification, manual process automation in our processing facilities and grow-out operations, and chicken breeding stock improvements. Our Discovery Center in Springdale, Arkansas, includes more than 40,000 square feet of United States Department of Agriculture (“USDA”) and United States Food and Drug Administration (“FDA”) pilot plant space, consumer sensory and focus group areas, a packaging lab and 19 research kitchens. The center enables us to bring new market-leading retail and foodservice products to the customer quickly and efficiently. Additionally, we have a Manufacturing Automation Center in Springdale, Arkansas, designed to develop new manufacturing solutions and to enhance team member training on new technology. Further, we have research and development capabilities located in several international locations where we operate.\nENVIRONMENTAL REGULATION AND FOOD SAFETY\nEnvironmental Regulation\nOur facilities for processing beef, pork, chicken, turkey and prepared foods, milling feed and housing live chickens and swine are subject to many international, federal, state and local environmental laws and regulations, including provisions relating to all environmental media - air, land and water, and generally provide for environmental protection. \nWe believe we are in substantial compliance with such applicable laws and regulations and are not aware of any violations of such laws and regulations likely to result in material penalties or material increases in compliance costs. The cost of compliance with such laws and regulations has not had a material adverse effect on our capital expenditures, earnings or competitive position, and except as described below, is not anticipated to have a material adverse effect in the future.\nVarious federal, state and international regulatory agencies and governments continue to consider, adopt or revise programs that regulate, report, and control greenhouse gas emissions. Although we have not incurred significant costs or capital expenditures specific to greenhouse gas emission compliance, these requirements are continually evolving. As the exact impact of new or additional greenhouse gas emission controls and requirements remains in flux, it cannot be determined whether such impacts would have a material adverse effect.\nWe closely monitor developments in this area and strive to mitigate risks related to greenhouse gas emissions through environmental compliance and climate-related initiatives. For example, we collect and monitor greenhouse gas emissions data, which can be used to inform greenhouse gas emission reduction and removal interventions in our operations and supply chain. We continue to evaluate climate-related goals and initiatives, including corresponding costs, evolving legal landscapes, stakeholder expectations, and customer and consumer understanding of climate action. \nWe remain committed to serving as stewards of the people, land, animals and resources entrusted to our care, consistent with our core values. We take a comprehensive and holistic approach to managing natural resources and continuously work to increase operational efficiencies, reduce greenhouse gas emissions across the supply chain, and partner with stakeholders to create a more resilient food system. Additionally, we continue to support agricultural practices and business operations that further these efforts and work to strengthen the overall resiliency of the U.S. agricultural system. Our climate strategy is evolving and efforts are underway to refresh and embed our strategy into our business and operations.\nFood Safety\nWe work to ensure our products meet high standards of food safety and quality. In addition to our own internal Food Safety and Quality Assurance oversight and review, our beef, pork, chicken, and prepared foods products are subject to inspection, primarily by the USDA and the FDA. We also participate in the USDA’s Hazard Analysis and Critical Control Points (“HACCP”) program or FDA’s Hazard Analysis and Risk-Based Prevention Controls (“HARPC”) program as applicable and are subject to the Sanitation Standard Operating Procedures and the Public Health Security and Bioterrorism Preparedness and Response Act of 2002. Additionally, our foreign operations are subject to various other food safety and quality assurance oversight and review.\nHUMAN CAPITAL MANAGEMENT\nEmployees and Labor Relations\nAs of September 27, 2025, we employed approximately 133,000 team members globally. Approximately 116,000 team members were employed in the United States, of whom approximately 110,000 were employed at non-corporate sites such as production facilities, warehouses, truck shops, hatcheries and feed mills. Approximately 17,000 team members were employed in other countries, primarily in Thailand and China. For fiscal 2025, our domestic workforce experienced a 3.5% increased retention rate from fiscal 2024. Approximately 31,000 team members in the United States were subject to collective bargaining agreements with various labor unions, with approximately 47% of those team members at locations either under negotiation for contract renewal or included under agreements expiring in fiscal 2026. The remaining agreements expire over the next several years. Approximately 6,000 team members in other countries were subject to collective bargaining agreements. We believe our overall relations with our workforce in both unionized and non-union settings are healthy.\n6\nHealth, Safety and Wellbeing\nWe maintain a safety culture grounded on the premise of eliminating workplace incidents, risks and hazards. In an effort to ensure our team members are highly engaged and prepared for success at Tyson Foods, we emphasize comprehensive training programs. Newly hired team members participate in orientation programs and on-the-job training. Additionally, all team members receive comprehensive annual compliance training, covering essential topics such as team member safety, food safety, and other vital areas. We review and monitor our safety performance closely. As an expansion of our wellbeing culture and efforts to boost the overall health and wellness of our workforce, we continue to operate health clinics near our production facilities, giving team members and their families easier access to high-quality healthcare.\nTeam Member Engagement\nWe firmly believe innovation thrives when teams come together, bringing a multitude of perspectives to propel progress and growth. We believe the varied experiences of our team make us strong, and we strive to create a workforce in which every team member contributes to our collective success. Our commitment to our team is rooted in our desire to create working environments that enable team members to succeed while supporting the growth of our communities. We maintain policies, practices and strong governance that are designed to enable team member success across our organization. Our policies and practices underscore our commitment to providing a work environment free from all forms of discrimination and harassment. All new team members receive policy training during onboarding, as well as annually. We also maintain an Equal Opportunity Employer statement that details our commitment to equal opportunity in all aspects of employment.\nTalent and Development\nOur talent strategy and philosophy is focused on attracting the best talent, recognizing and rewarding performance, while continually developing, engaging and retaining our team members. We focus on the team member experience, removing barriers to engagement, further modernizing the human resources process, focusing on frontline team member retention and striving to continuously improve all of our talent practices. Through our Upward Academy Onsite Program, we offer English as a second language, high-school equivalency, citizenship, financial literacy and digital literacy training to all team members\n.\n As of September 27, 2025, the onsite program was operating at 40 Company locations. All team members can also access Upward Academy online, a frontline career development program. This program helps team members further hone professional skills and creates opportunities for our team members to advance to higher-paying, more senior-level positions within the Company through college degrees, job skills training and workforce certifications at no cost up to $5,250 per year. We strive to grow and develop the different capabilities and skills that we need for the future, while maintaining a robust pipeline of talent throughout the organization.\nMARKETING AND DISTRIBUTION\nOur principal marketing objective is to be the preferred provider of beef, pork, chicken and prepared foods products for our customers and consumers. We build the Tyson®, Jimmy Dean®, Hillshire Farm®, Ball Park®, Wright®, State Fair®, Aidells® and ibp® brands while supporting strong regional and emerging brands primarily through distinctive brand and product advertising, promotion and public relations efforts focused toward key consumer targets with specific needs. We identify growth and business opportunities through consumer and customer insights derived via leading research and analytic capabilities, while continually enhancing our digital marketing acumen to leverage technology and data in delivering more personalized, relevant brand experiences. We utilize our national distribution system and customer support services to achieve the leading market position for our products and brands.\nWe have the ability to produce and ship fresh, frozen and refrigerated products worldwide. Domestically, our distribution system extends to a broad network of food distributors and is supported by our owned or leased cold storage warehouses, public cold storage facilities and our transportation system. Our distribution centers accumulate fresh and frozen products so we can fill and consolidate partial-truckload orders into full truckloads, thereby decreasing shipping costs while increasing customer service. In addition, we provide our customers a wide selection of products that do not require large volume orders. Our distribution system enables us to supply large or small quantities of products to meet customer requirements anywhere in the continental United States. Internationally, we utilize both rail and truck refrigerated transportation to domestic ports, where consolidations take place to transport to foreign destinations.\nPATENTS AND TRADEMARKS\nWe have filed a number of patent applications relating to our processes and products that either have been granted or are in the process of review. Because we do a significant amount of brand name and product line advertising to promote our products, we consider the protection of our trademarks to be important to our marketing efforts, and we regularly register and apply for the registration of a number of trademarks. We also have developed non-public proprietary information regarding our production processes and other product-related matters. We utilize internal procedures and safeguards to protect the confidentiality of such information and, where appropriate, seek patent and/or other protection for the technology we utilize.\nINDUSTRY PRACTICES\nOur agreements with customers are generally short-term, primarily due to the nature of our products, industry practices and fluctuations in supply, demand and price for such products. In certain instances where we are selling further processed products to large customers, we may enter into written agreements whereby we will act as the exclusive or preferred supplier to the customer, with pricing terms that are either fixed or variable.\n7\nAVAILABILITY OF SEC FILINGS AND CORPORATE GOVERNANCE DOCUMENTS ON INTERNET WEBSITE\nWe maintain an internet website for investors at https://ir.tyson.com. On this website, we make available, free of charge, annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, iXBRL (inline eXtensible Business Reporting Language) reports, and all amendments to any of those reports, as soon as reasonably practicable after we electronically file such reports with, or furnish such reports to, the Securities and Exchange Commission (the “SEC”). Also available on the website to review and print for investors are the Corporate Governance Principles, Audit Committee charter, Compensation and Leadership Development Committee charter, Governance and Nominating Committee charter, Strategy and Acquisitions Committee charter, Code of Conduct, Reporting of Potential Financial Misconduct Policy and other corporate governance policies. The SEC maintains an internet site that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC at www.sec.gov. \nCAUTIONARY STATEMENTS RELEVANT TO FORWARD-LOOKING INFORMATION FOR THE PURPOSE OF “SAFE HARBOR” PROVISIONS OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995\nCertain information in this report constitutes forward-looking statements. Such forward-looking statements include, but are not limited to, current views and estimates of our outlook for fiscal 2026, other future economic circumstances, industry conditions in domestic and international markets, our performance and financial results (e.g., debt levels, return on invested capital, value-added product growth, capital expenditures, tax rates, access to foreign markets and dividend policy). These forward-looking statements are subject to a number of factors and uncertainties that could cause our actual results and experiences to differ materially from anticipated results and expectations expressed in such forward-looking statements. We wish to caution readers not to place undue reliance on any forward-looking statements, which speak only as of the date made. We undertake no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.\nAmong the factors that may cause actual results and experiences to differ from anticipated results and expectations expressed in such forward-looking statements are the following: (i) the effectiveness of financial excellence programs or operational optimization plans; (ii) access to, and inputs from, foreign markets together with foreign economic conditions, including currency fluctuations, import/export restrictions and foreign politics; (iii) global pandemics have had, and may in the future have, an adverse impact on our business and operations; (iv) cyber attacks, other cyber incidents, security breaches or other disruptions of our information technology systems; (v) risks associated with our failure to consummate favorable acquisition transactions or integrate certain acquisitions’ operations; (vi) the Tyson Limited Partnership’s ability to exercise significant control over the Company; (vii) fluctuations in the cost and availability of inputs and raw materials, such as live cattle, live swine, feed grains (including corn and soybean meal) and energy; (viii) market conditions for finished products, including competition from other global and domestic food processors, supply and pricing of competing products and alternative proteins and demand for alternative proteins; (ix) outbreak of a livestock disease (such as African swine fever (ASF), avian influenza (AI), New World screwworm or bovine spongiform encephalopathy (BSE)), which could have an adverse effect on livestock we own, the availability of livestock we purchase, consumer perception of certain protein products or our ability to conduct our operations; (x) changes in consumer preference and diets and our ability to identify and react to consumer trends; (xi) effectiveness of advertising and marketing programs; (xii) significant marketing plan changes by large customers or loss of one or more large customers; (xiii) our ability to leverage brand value propositions; (xiv) changes in availability and relative costs of labor and contract farmers and our ability to maintain good relationships with team members, labor unions, contract farmers and independent producers providing us livestock; (xv) issues related to food safety, including costs resulting from product recalls, regulatory compliance and any related claims or litigation; (xvi) compliance with and changes to regulations and laws (both domestic and foreign), including changes in accounting standards, tax laws, environmental laws, agricultural laws and occupational, health and safety laws; (xvii) the effect of climate change and any legal or regulatory response thereto; (xviii) adverse results from litigation; (xix) risks associated with leverage, including cost increases due to rising interest rates or changes in debt ratings or outlook; (xx) impairment in the carrying value of our goodwill or indefinite life intangible assets; (xxi) our participation in a multiemployer pension plan; (xxii) volatility in capital markets or interest rates; (xxiii) risks associated with our commodity purchasing activities; (xxiv) the effect of, or changes in, general economic conditions; (xxv) impacts on our operations caused by factors and forces beyond our control, such as natural disasters, fire, bioterrorism, pandemics, armed conflicts or extreme weather; (xxvi) failure to maximize or assert our intellectual property rights; (xxvii) effects related to changes in tax rates, valuation of deferred tax assets and liabilities, or tax laws and their interpretation; and (xxviii) those factors listed under Item 1A. Risk Factors.\n8",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOBJECTIVE\nThe following discussion provides an analysis of the Company’s financial condition, cash flows and results of operations from management’s perspective and should be read in conjunction with the consolidated financial statements and notes thereto included in Part II, Item 8 of this Annual Report on Form 10-K. Our objective is to also provide discussion of events and uncertainties known to management that are reasonably likely to cause reported financial information not to be indicative of future operating results or of future financial condition and to offer information that provides understanding of our financial condition, cash flows and results of operations. Refer to the Company's Annual Report on Form 10-K for the fiscal year ended September 30, 2023 for additional information related to fiscal 2023.\nDESCRIPTION OF THE COMPANY\nWe are a world-class food company and recognized leader in protein. Founded in 1935 by John W. Tyson, it has grown under four generations of family leadership. The Company is unified by this purpose: Tyson Foods. We Feed the World Like Family™ and has a broad portfolio of iconic products and brands including Tyson®, Jimmy Dean®, Hillshire Farm®, Ball Park®, Wright®, State Fair®, Aidells® and ibp®. Tyson Foods is dedicated to bringing high-quality food to every table in the world, safely, and affordably, now and for future generations.\nWe operate in four reportable segments: Beef, Pork, Chicken and Prepared Foods. We measure segment profit as operating income (loss). International/Other primarily includes our foreign operations in China, Malaysia, Mexico, South Korea, Thailand and the Kingdom of Saudi Arabia, third-party merger and integration costs and corporate overhead related to Tyson New Ventures, LLC. For further description of the business, refer to Part I, Item 1, Business.\nOVERVIEW\nFiscal year\nWe utilize a 52- or 53-week accounting period ending on the Saturday closest to September 30. The Company’s accounting cycle resulted in a 52-week year for fiscal 2025, 2024 and 2023. \nGeneral\nSales grew 2.1%, or $1.1 billion to $54.4 billion in fiscal 2025, largely due to higher average sales prices in our Beef, Pork and Prepared Foods segments, partially offset by $653 million of increased legal contingency accruals which reduced sales. We reported operating income of $1,098 million in fiscal 2025 as compared to an operating income of $1,409 million in fiscal 2024, as we experienced lower operating income in our Beef and Pork segments, partially offset by higher operating income in our Chicken and Prepared Foods segments and International/Other.\nIn fiscal 2025, our operating income was impacted by $738 million of legal contingency accruals, $343 million of goodwill and intangible impairments, $45 million of restructuring and related charges, $41 million of charges related to a product recall and $23 million related to brand and product line discontinuations. In fiscal 2024, our results were impacted by $182 million of plant closure and disposal charges, $174 million of legal contingency accruals and $31 million of restructuring and related charges.\nMarket Environment \nAccording to the most recently published USDA data, domestic protein production (beef, pork, chicken and turkey) decreased slightly in fiscal 2025 compared to fiscal 2024. The Beef segment continues to experience limited supply of market-ready cattle as well as increased cattle costs. Additionally, uncertainty exists regarding the timing of the anticipated cattle herd rebuilding. The Pork segment experienced sufficient supply of market-ready hogs and increased hog costs. The Chicken segment experienced reduced feed ingredient costs, but costs began to stabilize in the back half of fiscal 2025. The Prepared Foods segment is currently experiencing increased raw material costs primarily due to higher meat costs. \nWe are subject to changes in import and export policies, including trade restrictions, new or increased tariffs or quotas, and customs restrictions through our international sales and operations. Our exports account for less than 10% of our business, primarily composed of chicken leg quarters and paws, boxed beef and variety meats of all proteins. As a result of the recent changes in trade policies and tariffs both domestically and internationally, we may experience some sales disruptions and other impacts associated with tariffs. There is uncertainty regarding the impact the current changes will have on the price and demand of our products in the affected countries, commodity pricing and other general economic conditions, and uncertainty in future changes that may have a material impact.\nMargins\nOur total operating margin was 2.0% in fiscal 2025. Operating margins by segment were as follows:\n•\nBeef – (5.2)%\n•\nPork – (3.4)%\n•\nChicken – 8.5%\n•\nPrepared Foods – 9.0%\n24\nStrategy\nWe are a world-class food company and recognized leader in protein. Our strategy is to deliver margins in the core protein business by driving efficiencies and valuing-up offerings to better serve consumers; grow branded portfolio by innovating new occasions, categories and channels; and scale in international markets by delivering profitable value-added food offerings in high growth categories. \nDuring fiscal 2025, the Company initiated a network optimization plan to optimize our global operations and logistics network. We anticipate recognizing total pretax charges of $86 million related to actions approved through September 27, 2025, which include $99 million that have resulted or will result in cash outflows and $94 million of non-cash charges, partially offset by $107 million gain recognized from the sale of storage facilities. Additionally, we received $252 million in proceeds associated with the sale of storage facilities during fiscal 2025. We expect to incur costs related to the network optimization plan over a multi-year period and anticipate additional charges in the future as further actions are approved.\nIn fiscal 2025, we recognized charges of $45 million related to the network optimization plan, which included a gain of $107 million from the sale of storage facilities. The charges primarily included the closure of two facilities in the Prepared Foods segment, a non-harvesting facility closure in the Beef segment, asset write-offs in the Chicken and Prepared Foods segments and International/Other as well as severance and related costs and contract and lease termination costs. For additional description refer to Part II, Item 8, Notes to the Consolidated Financial Statements, Note 7: Restructuring and Related Charges. \n SUMMARY OF RESULTS\nSales\nin millions\n2025\n2024\n2023\nSales\n$\n54,441 \n$\n53,309 \n$\n52,881 \nChange in sales volume\n— \n%\n— \n%\nChange in average sales price\n3.3 \n%\n0.6 \n%\nSales growth\n2.1 \n%\n0.8 \n%\n2025 vs. 2024 \n–\n•\nSales Volume\n – Volumes were essentially flat and resulted in a decrease of $10 million as decreased sales volume in our Beef, Pork and Prepared Foods segments were offset by increased sales volume in our Chicken segment.\n•\nAverage Sales Price \n– Sales were positively impacted by higher average sales prices, which accounted for an increase of $1,795 million, driven by increased pricing in our Beef, Pork and Prepared Foods segments, while pricing in our Chicken segment was relatively flat.\n◦\nThe above changes in average sales price exclude the impacts of $698 million and $45 million reductions of Sales from the recognition of legal contingency accruals in fiscal 2025 and\n \n2024, respectively.\n2024 vs. 2023 \n–\n•\nSales Volume\n – Volumes were essentially flat and resulted in an increase of $19 million as increased sales volume in our Beef, Pork and Prepared Foods segments were mostly offset by decreased sales volume in our Chicken segment.\n•\nAverage Sales Price \n– Sales were positively impacted by higher average sales prices, which accounted for an increase of $298 million, driven by increased pricing in our Beef segment.\n◦\nThe above changes in average sales price exclude the impacts of $45 million and $156 million reductions of Sales from the recognition of legal contingency accruals in fiscal 2024 and\n \n2023, respectively.\nCost of Sales\nin millions\n2025\n2024\n2023\nCost of sales\n$\n50,879 \n$\n49,682 \n$\n50,250 \nGross profit\n3,562 \n3,627 \nCost of sales as a percentage of sales\n93.5 \n%\n93.2 \n%\n2025 vs. 2024\n –\n•\nCost of sales increased $1,197 million. Lower sales volume decreased cost of sales by $10 million while higher input cost per pound increased cost of sales by $1,207 million.\n•\nThe $1,207 million impact of higher input cost per pound was impacted by: \n•\nIncrease in cattle costs of approximately $1,840 million in our Beef segment. \n•\nIncrease in raw material and other input costs of approximately $345 million in our Prepared Foods segment. \n•\nIncrease in hog costs of approximately $295 million in our Pork segment.\n•\nIncrease of $43 million related to restructuring and related charges.\n25\n•\nDecrease of approximately $340 million in our Chicken segment related to decreased feed ingredient costs.\n•\nDecrease of $89 million related to lower legal contingency accruals in our Beef, Pork and Chicken segments partially offset by an increase in International/Other. \n•\nDecrease of $165 million in plant closure and disposal charges.\n•\nDecrease in freight and transportation costs of approximately $110 million. \n•\nDecrease of $34 million in facility fire related costs, net of insurance proceeds, in our Chicken segment and International/Other. \n•\nRemaining decrease in costs across all of our segments primarily driven by net impacts on average cost per pound from mix changes in addition to savings from our productivity program.\n•\nThe $10 million impact of decreased sales volume was primarily driven by decreased volumes in our Beef, Pork and Prepared Foods segments.\n2024 vs. 2023 \n–\n•\nCost of sales decreased $568 million. Higher sales volume increased cost of sales by $18 million while lower input cost per pound decreased cost of sales by $586 million.\n•\nThe $586 million impact of lower input cost per pound was impacted by: \n•\nDecrease of approximately $895 million in our Chicken segment related to decreased feed ingredient costs.\n•\nDecrease in freight and transportation costs of approximately $310 million. \n•\nDecrease of $140 million due to plant closure and disposal charges.\n•\nDecrease in hog costs of approximately $135 million in our Pork segment.\n•\nDecrease in raw material and other input costs of approximately $65 million in our Prepared Foods segment. \n•\nDecrease due to net derivative losses of $55 million in fiscal 2024, compared to net derivative losses of $117 million in fiscal 2023 due to our risk management activities. These amounts exclude offsetting impacts from related physical purchase transactions, which are included in the change in live cattle and hog costs and raw material and feed ingredient costs described herein.\n•\nDecrease of $59 million in our Chicken segment from insurance proceeds, net of costs, related to a production facility fire in the fourth quarter of fiscal 2021.\n•\nDecrease of $29 million in restructuring and related costs.\n•\nIncrease in cattle costs of approximately $1,315 million in our Beef segment. \n•\nIncrease in performance-based compensation costs of $173 million.\n•\nIncrease of $129 million related to the recognition of legal contingency accruals in our Beef, Pork and Chicken segments. \n•\nIncrease of $86 million in International/Other from costs related to a production facility fire in the Netherlands and subsequent decision to sell the facility.\n•\nIncrease of $42 million in our Beef segment from insurance proceeds received in the first quarter of fiscal 2023 related to the fire at our production facility in the fourth quarter of fiscal 2019.\n•\nRemaining decrease in costs across all of our segments primarily driven by net impacts on average cost per pound from mix changes in addition to savings from our productivity program.\n•\nThe $18 million impact of increased sales volume was primarily driven by increased volumes in our Beef, Pork and Prepared Foods segments.\nSelling, General and Administrative\nin millions\n2025\n2024\n2023\nSelling, general and administrative\n$\n2,121 \n$\n2,218 \n$\n2,245 \nAs a percentage of sales\n3.9 \n%\n4.2 \n%\n2025 vs. 2024 \n–\n•\nDecrease of $97 million in selling, general and administrative was primarily driven by:\n•\nDecrease of $43 million in professional fees.\n•\nDecrease of $35 million in marketing, advertising and promotion expenses.\n•\nDecrease of $29 million in restructuring and related costs.\n•\nDecrease of $25 million in team member costs.\n•\nIncrease of $30 million in technology costs.\n26\n2024 vs. 2023 \n–\n•\nDecrease of $27 million in selling, general and administrative was primarily driven by:\n•\nDecrease of $71 million in marketing, advertising and promotion expenses.\n•\nDecrease of $64 million in restructuring and related costs.\n•\nDecrease of $28 million in corporate facilities and assets costs.\n•\nDecrease of $18 million in donations.\n•\nIncrease of $155 million in team member costs including $205 million in performance-based compensation partially offset by a decrease of $50 million in all other team member costs.\n•\nIncrease of $8 million in brand and product line discontinuations.\nGoodwill Impairment\nin millions\n2025\n2024\nGoodwill Impairment\n$\n343 \n$\n— \n2025 vs. 2024 \n–\n•\nWe recorded a $343 million impairment charge in the Beef segment in fiscal 2025.\nInterest (Income) Expense\nin millions\n2025\n2024\nInterest income\n$\n(73)\n$\n(89)\nInterest expense\n449 \n481 \n2025 vs. 2024 \n–\n•\nThe decrease in interest income for fiscal 2025 was primarily due to average lower cash and cash equivalents held.\n•\nThe decrease in interest expense for fiscal 2025 was primarily due to lower interest expense related to the repayment of the term loan due May 2026 in fiscal 2025 and the repayment of the August 2024 senior notes in fiscal 2024, partially offset by increased interest expense from the issuance of 5.40% 2029 Notes and 5.70% 2034 Notes and decreased capitalized interest expense related to lower capital expenditures.\nOther (Income) Expense, net\nin millions\n2025\n2024\n$\n(47)\n$\n(75)\n2025\n – Included $64 million of joint venture earnings and $18 million of production facilities fire insurance proceeds, partially offset by $28 million of impairments of equity investments and $3 million of foreign exchange losses.\n2024 \n– Included $34 million of production facilities fire insurance proceeds, $15 million gain on sale of an equity method investment, $15 million of joint venture earnings and $11 million of foreign exchange gains.\nEffective Tax Rate\n2025\n2024\n34.1 \n%\n24.8 \n%\n2025 vs. 2024 \n–\n•\nThe increase in effective tax rate for fiscal 2025\n \nwas\n \nprimarily due to a non-deductible goodwill impairment in fiscal 2025. \nNet Income (Loss) Attributable to Tyson\nin millions, except per share data\n2025\n2024\nNet income (loss) attributable to Tyson\n$\n474 \n$\n800 \nNet income (loss) attributable to Tyson - per diluted share\n1.33 \n2.25 \n2025 \n– Included the following items:\n•\n$738 million pretax, or ($1.58) per diluted share, of legal contingency accruals.\n•\n$343 million pretax, or ($0.96) per diluted share, related to a goodwill impairment (non-tax deductible).\n•\n$45 million pretax, or ($0.11) per diluted share, of restructuring and related charges.\n•\n$41 million pretax, or ($0.09) per diluted share, related to a charge from a product recall.\n•\n$28 million pretax, or ($0.08) per diluted share, related to impairment of equity investments.\n27\n•\n$23 million pretax, or ($0.05) per diluted share, related to brand and product line discontinuations.\n•\n$17 million pretax, or ($0.04) per diluted share, of plant closure and disposal charges.\n•\n$36 million pretax, or $0.12 per diluted share, of facility fire related insurance proceeds.\n2024 \n– Included the following items:\n•\n$182 million pretax, or ($0.41) per diluted share, of plant closure and disposal charges.\n•\n$174 million pretax, or ($0.38) per diluted share, of legal contingency accruals.\n•\n$18 million pretax, or ($0.02) per diluted share, of facility fire related insurance proceeds, net of costs.\n•\n$31 million pretax, or ($0.06) per diluted share, of restructuring and related charges.\n•\n$8 million pretax, or ($0.02) per diluted share, related to brand and product line discontinuations.\nSEGMENT RESULTS\nWe operate in four reportable segments: Beef, Pork, Chicken, and Prepared Foods. International/Other primarily includes our foreign operations in China, Malaysia, Mexico, South Korea, Thailand and the Kingdom of Saudi Arabia, third-party merger and integration costs and corporate overhead related to Tyson New Ventures, LLC. Additional information regarding the geographic areas of our foreign operations is set forth in Part II, Item 8, Notes to Consolidated Financial Statements, Note 17: Segment Reporting. The following table is a summary of segment sales and operating income (loss) for fiscal years ended 2025, 2024 and 2023, which is how we measure segment income (loss): \nin millions\nSales\nOperating Income (Loss)\n2025\n2024\n2023\n2025\n2024\n2023\nBeef\n(a)\n$\n21,623 \n$\n20,479 \n$\n19,325 \n$\n(1,135)\n$\n(381)\n$\n(91)\nPork\n(b)\n5,781 \n5,903 \n5,768 \n(199)\n(40)\n(139)\nChicken\n(c)\n16,837 \n16,425 \n17,060 \n1,427 \n988 \n(770)\nPrepared Foods\n(d)\n9,930 \n9,851 \n9,845 \n898 \n879 \n823 \nInternational/Other\n(e)\n2,291 \n2,353 \n2,515 \n107 \n(37)\n(218)\nIntersegment Sales\n(2,021)\n(1,702)\n(1,632)\n— \n— \n— \nTotal\n$\n54,441 \n$\n53,309 \n$\n52,881 \n$\n1,098 \n$\n1,409 \n$\n(395)\n(a) Beef segment results for fiscal 2025 included $343 million of goodwill and intangible impairments, $318 million of legal contingency accruals and $48 million of restructuring and related charges. Beef segment results for fiscal 2024 included a $45 million legal contingency accrual and $41 million of plant closure and disposal charges. Beef segment results for fiscal 2023 included $333 million of goodwill and intangible impairments, $42 million of facility fire related insurance proceeds and $33 million of restructuring and related charges.\n(b) Pork segment results for fiscal 2025 included $380 million of legal contingency accruals. Pork segment results for fiscal 2024 included $108 million of plant closure and disposal charges and $73 million of legal contingency accruals. \n(c) Chicken segment results for fiscal 2025 included $23 million related to brand and product line discontinuations, $23 million of plant closure and disposal charges and $9 million of restructuring and related charges. Chicken segment results for fiscal 2024 included a $56 million legal contingency accrual, $33 million of plant closure and disposal charges and $70 million of facility fire related insurance proceeds. Chicken segment results for fiscal 2023 included $322 million of plant closure and disposal charges, $210 million of goodwill and intangible impairments, $156 million of legal contingency accruals, $16 million of restructuring and related charges and $11 million of facility fire related insurance proceeds.\n(d) Prepared Foods segment results for fiscal 2025 included $41 million of charges related to a product recall and a net benefit of $26 million related to restructuring and related charges, which included a gain from the sale of storage facilities net of other plan charges. Prepared Foods segment results for fiscal 2024 included $24 million of restructuring and related charges. Prepared Foods segment results for fiscal 2023 included $49 million of restructuring and related charges and $17 million of brand and product line discontinuations. \n(e) International/Other results for fiscal 2025 included a $40 million legal contingency charge related to the 2015 sale of our Mexico operation, $18 million of facility fire related insurance proceeds and $14 million of restructuring and related charges. International/Other results for fiscal 2024 included $86 million of facility fire related costs. International/Other results for fiscal 2023 included a $238 million goodwill and intangible impairments.\n28\nBeef Segment Results\nin millions\n2025\n2024\nChange 2025 vs. 2024\n2023\nChange 2024 vs. 2023\nSales\n$\n21,623 \n$\n20,479 \n$\n1,144 \n$\n19,325 \n$\n1,154 \nSales Volume Change\n(1.9)\n%\n1.6 \n%\nAverage Sales Price Change\n9.0 \n%\n4.4 \n%\nOperating Income (Loss)\n$\n(1,135)\n$\n(381)\n$\n(754)\n$\n(91)\n$\n(290)\nOperating Margin\n(5.2)\n%\n(1.9)\n%\n(0.5)\n%\n2025 vs. 2024 \n–\n•\nSales Volume\n – Sales volume decreased as lower head harvested were offset by higher average carcass weights.\n•\nAverage Sales Price\n – Average sales price increased due to increased input costs and strong demand. The change in average sales price for fiscal 2025 excludes a $318 million reduction of Sales from the recognition of legal contingency accruals.\n•\nOperating Income (Loss)\n – Operating loss increased in fiscal 2025 due to compressed Beef margins, goodwill and intangible impairments, legal contingency accruals and increased restructuring and related charges, partially offset by improved operational execution and lapping the impacts of plant closure and disposal charges recorded in fiscal 2024.\n2024 vs. 2023 \n–\n•\nSales Volume\n – Sales volume increased primarily due to higher average carcass weights.\n•\nAverage Sales Price\n – Average sales price increased due to increased input costs and increased demand.\n•\nOperating Income (Loss)\n – Operating income decreased primarily due to compressed beef margins, the recognition of legal contingency accruals and plant closure and disposal charges in fiscal 2024, and recognition of facility fire related insurance proceeds in fiscal 2023 related to a fire at a production facility in 2019, partially offset by goodwill and intangible impairments recorded in fiscal 2023.\nPork Segment Results\nin millions\n2025\n2024\nChange 2025 vs. 2024\n2023\nChange 2024 vs. 2023\nSales\n$\n5,781 \n$\n5,903 \n$\n(122)\n$\n5,768 \n$\n135 \nSales Volume Change\n(1.7)\n%\n3.8 \n%\nAverage Sales Price Change\n5.3 \n%\n(0.7)\n%\nOperating Income (Loss)\n$\n(199)\n$\n(40)\n$\n(159)\n$\n(139)\n$\n99 \nOperating Margin\n(3.4)\n%\n(0.7)\n%\n(2.4)\n%\n2025 vs. 2024 \n–\n•\nSales Volume\n – Sales volume decreased due to production decreases associated with a plant closure in 2024 which were partially offset by production increases at other facilities and higher average carcass weights.\n•\nAverage Sales Price\n – Average sales price increased due to increased input costs and strong demand for our pork products. The change in average sales price excludes a $380 million and $45 million reduction of Sales from the recognition of legal contingency accruals recorded in fiscal 2025 and 2024, respectively.\n•\nOperating Income (Loss)\n – Operating loss increased due to compressed pork margins and the recognition of legal contingency accruals, partially offset by lower operating costs, improved results in our live hog operations and lapping the impacts of plant closure and disposal charges and restructuring and related charges recorded in fiscal 2024.\n2024 vs. 2023 \n–\n•\nSales Volume\n – Sales volume increased due to improved market conditions and increased domestic availability of market-ready hogs.\n•\nAverage Sales Price\n – Average sales price decreased driven by lower pricing on drop credit items. The change in average sales price excludes the impact of a $45 million reduction of Sales from the recognition of legal contingency accruals in fiscal 2024.\n•\nOperating Income (Loss)\n – Operating income increased primarily due to higher pork margins, improved results in our live hog operations and lapping the impacts of facility fire related costs in the third quarter of fiscal 2023, partially offset by the recognition of legal contingency accruals and plant closure and disposal costs in fiscal 2024.\n29\nChicken Segment Results\nin millions\n2025\n2024\nChange 2025 vs. 2024\n2023\nChange 2024 vs. 2023\nSales\n$\n16,837 \n$\n16,425 \n$\n412 \n$\n17,060 \n$\n(635)\nSales Volume Change\n2.6 \n%\n(2.2)\n%\nAverage Sales Price Change\n(0.1)\n%\n(2.4)\n%\nOperating Income (Loss)\n$\n1,427 \n$\n988 \n$\n439 \n$\n(770)\n$\n1,758 \nOperating Margin\n8.5 \n%\n6.0 \n%\n(4.5)\n%\n2025 vs. 2024 \n–\n•\nSales Volume\n – Sales volume increased primarily due to increased domestic production.\n•\nAverage Sales Price\n – Average sales price remained relatively flat as the impact of lower input costs was offset by strong demand.\n•\nOperating Income (Loss)\n – Operating income increased primarily due to improved operational execution, improved volumes and $340 million of net decreases in feed ingredient costs which was partially offset by increased marketing, advertising and promotion expenses. Operating income was also impacted by reduced legal contingency accruals partially offset by increased costs related to brand and product line discontinuations, restructuring and related charges and lapping of facility fire related insurance proceeds recognized in fiscal 2024 associated with a production facility fire in the fourth quarter of fiscal 2021.\n2024 vs. 2023 \n–\n•\nSales Volume\n – Sales volume decreased primarily due to reduced domestic production.\n•\nAverage Sales Price\n – Average sales price decreased due to the impact of lower input costs. The change in average sales price excludes the impact of a $156 million reduction of Sales from the recognition of legal contingency accruals in fiscal 2023.\n•\nOperating Income (Loss)\n – Operating income increased primarily due to improved operational efficiencies, goodwill and intangible impairments recorded in fiscal 2023, lower plant closure and disposal charges, reduced legal contingency accruals, decreased freight costs and an increase in facility fire related insurance proceeds, net of costs associated with a production facility fire in the fourth quarter of fiscal 2021. Additionally, we experienced $895 million of lower feed ingredient costs in fiscal 2024 which was partially offset by associated decreases in average sales price.\nPrepared Foods Segment Results\nin millions\n2025\n2024\nChange 2025 vs. 2024\n2023\nChange 2024 vs. 2023\nSales\n$\n9,930 \n$\n9,851 \n$\n79 \n$\n9,845 \n$\n6 \nSales Volume Change\n(2.5)\n%\n0.9 \n%\nAverage Sales Price Change\n3.3 \n%\n(0.8)\n%\nOperating Income\n$\n898 \n$\n879 \n$\n19 \n$\n823 \n$\n56 \nOperating Margin\n9.0 \n%\n8.9 \n%\n8.4 \n%\n2025 vs. 2024 \n–\n•\nSales Volume\n – Sales volume decreased due to a challenging consumer environment and the impact from a product recall.\n•\nAverage Sales Price\n – Average sales price increased primarily due to the pass through of increased raw material costs. \n•\nOperating Income\n – Operating income increased primarily due to higher average sales price, improved operational execution and lower selling, general and administrative costs, partially offset by increased raw material costs and charges related to a product recall. Additionally, fiscal 2025 benefited from net gains recognized from restructuring and related charges, which included a gain from the sale of storage facilities.\n2024 vs. 2023 \n–\n•\nSales Volume\n – Sales volume increased primarily due to the acquisition of Williams Sausage Company in the third quarter of 2023.\n•\nAverage Sales Price\n – Average sales price decreased primarily due to sales mix. \n•\nOperating Income\n – Operating income increased primarily due to lower raw materials costs, freight costs, marketing, advertising and promotion expenses and restructuring and related charges.\n30\nInternational/Other Results\nin millions\n2025\n2024\nChange 2025 vs. 2024\n2023\nChange 2024 vs. 2023\nSales\n$\n2,291 \n$\n2,353 \n$\n(62)\n$\n2,515 \n$\n(162)\nOperating Income (Loss)\n107 \n(37)\n144 \n(218)\n181 \n2025 vs. 2024 \n–\n•\nSales \n– Sales decreased due to lower average sales price.\n•\nOperating Income (Loss)\n – Operating income increased primarily due to improved performance, insurance proceeds and lapping the charges related to a production facility fire in the first quarter of fiscal 2024, partially offset by the recognition of a legal accrual related to the 2015 sale of our Mexico operation.\n2024 vs. 2023 \n–\n•\nSales \n– Sales decreased due to lower average sales price and the impact of the production facility fire in the Netherlands partially offset by increased volumes in the other regions.\n•\nOperating Income (Loss)\n – Operating income increased primarily due to a goodwill impairment charge recorded in fiscal 2023, partially offset by the impacts of a production facility fire in the first quarter of fiscal 2024 and the subsequent decision to sell the facility. \nLIQUIDITY AND CAPITAL RESOURCES\nOur cash needs for working capital, capital expenditures, growth opportunities, repurchases of senior notes, repayment of maturing debt, the payment of dividends and share repurchases are expected to be met with current cash on hand, cash flows provided by operating activities or short-term borrowings. Based on our current expectations, we believe our liquidity and capital resources will be sufficient to operate our business. However, we may take advantage of opportunities to generate additional liquidity or refinance existing debt through capital market transactions. The amount, nature and timing of any capital market transactions will depend on our operating performance and other circumstances; our then-current commitments and obligations; the amount, nature and timing of our capital requirements; any limitations imposed by our current credit arrangements; and overall market conditions. \nCash Flows from Operating Activities\nin millions\n2025\n2024\nNet income\n$\n507 \n$\n822 \nNon-cash items in net income\n1,754 \n1,544 \nNet changes in operating assets and liabilities:\n(Increase) decrease in accounts receivable\n(121)\n59 \n(Increase) decrease in inventories\n(449)\n153 \nIncrease (decrease) in accounts payable\n184 \n(205)\nIncrease in income taxes payable/receivable\n7 \n89 \nNet changes in other operating assets and liabilities\n273 \n128 \nNet cash provided by operating activities\n$\n2,155 \n$\n2,590 \n•\nNon-cash items in net income primarily included depreciation and amortization of $1,361 million and $1,400 million in fiscal 2025 and fiscal 2024, respectively, and a $343 million goodwill impairment in fiscal 2025.\n•\nCash provided by operating activities for fiscal 2025 was $2.2 billion, a decrease of $435 million compared to fiscal 2024, due to $105 million of lower earnings, net of non-cash items, and a $330 million decrease in cash provided by the net changes in operating assets and liabilities which was primarily impacted by:\n•\nA decrease of $602 million due to an increase in inventory of $449 million in fiscal 2025, compared to a decrease of $153 million in fiscal 2024, primarily due to increased average cost of inventory and higher volume of livestock.\n•\nA decrease of $180 million due to an increase in accounts receivable of $121 million in fiscal 2025, compared to a decrease of $59 million in fiscal 2024 as days sales outstanding increased more during fiscal 2025 than fiscal 2024 driven largely by increased average sales prices.\n•\nPartially offset by:\n•\nAn increase of $389 million due to an increase in accounts payable of $184 million during fiscal 2025, compared to a decrease of $205 million in fiscal 2024, primarily due to higher input costs and increase in days payables outstanding.\n•\nAn increase of $145 million due to an increase of $273 million in the net changes in other operating assets and liabilities in fiscal 2025, compared to an increase of $128 million in fiscal 2024, primarily driven by an increase in legal accruals net of payments offset by an increase in fiscal 2024 performance-based compensation.\n31\nCash Flows from Investing Activities\nin millions\n2025\n2024\nAdditions to property, plant and equipment\n$\n(978)\n$\n(1,132)\n(Purchases of)/Proceeds from marketable securities, net\n(4)\n(3)\nProceeds from sale of business\n— \n174 \nProceeds from sale of storage facilities\n252 \n— \nAcquisition of equity investments\n(11)\n(29)\nOther, net\n76 \n102 \nNet cash used for investing activities\n$\n(665)\n$\n(888)\n•\nAdditions to property, plant and equipment included spending for production growth, safety, animal well-being, new equipment, infrastructure replacements and upgrades to maintain competitive standing and position us for future opportunities. \n•\nApproximately $520 million will be necessary to complete buildings and equipment under construction at September 27, 2025. \n•\nWe expect capital expenditures between $0.7 billion and $1.0 billion for fiscal 2026. Capital expenditures include investments in profit improvement projects as well as projects for maintenance and repair.\n•\nProceeds from sale of business related to the sale of our Vienna, Georgia facility in fiscal 2024.\n•\nProceeds from sale of storage facilities related to the sale of multiple Tyson-owned and operated cold storage facilities in fiscal 2025. \n•\nOther, net for fiscal 2025 primarily included insurance proceeds related to fires at our production facilities and proceeds from disposition of assets. Other, net for fiscal 2024 primarily included proceeds from disposition of corporate assets, proceeds on the sale of an equity method investment and insurance proceeds related to fires at our production facilities.\nCash Flows from Financing Activities\nin millions\n2025\n2024\nProceeds from issuance of debt\n$\n175 \n$\n2,415 \nPayments on debt\n(1,262)\n(1,641)\nProceeds from issuance of commercial paper\n— \n1,694 \nRepayments of commercial paper\n— \n(2,285)\nPurchases of Tyson Class A common stock\n(196)\n(49)\nDividends\n(697)\n(684)\nStock options exercised\n21 \n14 \nOther, net\n(18)\n(45)\nNet cash used for financing activities\n$\n(1,977)\n$\n(581)\n•\nDuring fiscal 2024, proceeds from issuance of debt included $750 million of proceeds from the term loan facility due May 2028, $600 million of proceeds from the 5.40% 2029 Notes, and $900 million from the 5.70% 2034 Notes.\n•\nPayments on debt included:\n•\n2025\n – In fiscal 2025, we fully repaid the $750 million term loan due May 2026 and $310 million of the term loan due May 2028 using cash on hand.\n•\n2024 \n– In March 2024, we issued senior unsecured notes with an aggregate principal amount of $1.5 billion. A portion of the net proceeds from the issuances were used to repay $250 million of the amount outstanding under our term loan facility due May 2026 and we used the remainder of the proceeds to retire the $1,250 million notes due August 2024.\n•\nPurchases of Tyson Class A common stock included:\n•\n$174 million of cash paid for shares repurchased pursuant to our share repurchase program in fiscal 2025.\n•\n$22 million and $49 million for shares repurchased to fund certain obligations under our equity compensation plans in fiscal 2025 and 2024, respectively.\n•\nDividends paid during fiscal 2025 included a 2% increase to our fiscal 2024 quarterly dividend rate.\n32\nLiquidity\nin millions\nCommitments\nExpiration Date\nFacility\nAmount\nOutstanding Letters of Credit (no draw downs)\nAmount\nBorrowed\nAmount Available at September 27, 2025\nCash and cash equivalents\n$\n1,229 \nShort-term investments\n— \nRevolving credit facility\nApril 2030\n$\n2,500 \n$\n— \n$\n— \n2,500 \nCommercial paper\n— \nTotal liquidity\n$\n3,729 \n•\nLiquidity includes cash and cash equivalents, short-term investments and availability under our revolving credit facility, less the outstanding commercial paper balance.\n•\nAt September 27, 2025, we had current debt of $909 million, which we intend to pay with cash generated from our operating activities and other existing or new liquidity sources. \n•\nThe revolving credit facility supports our short-term funding needs and also serves to backstop our commercial paper program. We had no borrowings under the revolving credit facility during fiscal 2025. \n•\nIn April 2025, we terminated our previous revolving credit facility with a maturity date of September 2026 and entered into a new $2.5 billion revolving credit facility. The new revolving credit facility will mature, and the commitments thereunder will terminate, in April 2030 with options for two one-year extensions. Under the terms of this revolving credit facility, we have the option to establish incremental commitment increases of up to an aggregate amount of $500 million if certain conditions are met. The covenants and other terms of the new facility are generally consistent with those of the terminated facility. \n•\nWe expect net interest expense will approximate $395 million for the 53 weeks of fiscal 2026.\n•\nOur ratio of short-term assets to short-term liabilities (“current ratio”) was 1.6 to 1 and 2.0 to 1 at September 27, 2025, and September 28, 2024, respectively. The decrease in fiscal 2025 was primarily due to lower cash and cash equivalents and increased current debt.\n•\nAt September 27, 2025, $725 million of our cash was held in the international accounts of our foreign subsidiaries. Generally, we do not rely on the foreign cash as a source of funds to support our ongoing domestic liquidity needs. We manage our worldwide cash requirements by reviewing available funds among our foreign subsidiaries and the cost effectiveness with which those funds can be accessed. We intend to repatriate any excess cash (net of applicable withholding taxes) not subject to regulatory requirements and to indefinitely reinvest outside of the United States the remainder of cash held by foreign subsidiaries. We do not expect the regulatory restrictions or taxes on repatriation to have a material effect on our overall liquidity, financial condition or the results of operations for the foreseeable future.\nCapital Resources\nCredit Facility\nCash flows from operating activities and cash on hand are our primary sources of liquidity for funding debt service, capital expenditures, dividends and share repurchases. We also have a revolving credit facility, with a committed capacity of $2.5 billion, to provide additional liquidity for working capital needs and to backstop our commercial paper program.\nAt September 27, 2025, amounts available for borrowing under our revolving credit facility totaled $2.5 billion. Our revolving credit facility is funded by a syndicate of 17 banks, with commitments ranging from $50 million to $225 million per bank.\nCommercial Paper Program\nOur commercial paper program provides a low-cost source of borrowing to fund general corporate purposes including working capital requirements. The maximum borrowing capacity under the commercial paper program is $1.75 billion, which increased in April 2025 in conjunction with the execution of the new revolving credit facility. The maturities of the notes may vary, but may not exceed 397 days from the date of issuance. As of September 27, 2025, we had no commercial paper outstanding. Our ability to access commercial paper in the future may be limited or its costs increased.\nCapitalization\nTo monitor our credit ratings and our capacity for long-term financing, we consider various qualitative and quantitative factors. We monitor the ratio of our net debt to EBITDA as support for our long-term financing decisions. At September 27, 2025, and September 28, 2024, the ratio of our net debt to EBITDA was 3.0x and 2.8x, respectively. Refer to Other Key Financial Measures below for an explanation and reconciliation to comparable Generally Accepted Accounting Principles (“GAAP”) measures. The increase in this ratio at September 27, 2025 is due to a decrease in EBITDA of $377 million partially offset by a decrease in net debt of $459 million. \n33\nCredit Ratings\nTerm Loan Facility due May 2028\nStandard & Poor’s Rating Services’, a Standard & Poor’s Financial Services LLC business (“S&P”), applicable rating is “BBB”. Moody’s Investor Service, Inc.’s (“Moody’s”) applicable rating is “Baa2”. The below table outlines the commitment fee on any unused borrowing capacity and the borrowing spread on the outstanding principal balance of our term loan facility due May 2028 that corresponds to the applicable ratings levels from S&P and Moody’s.\nRatings Level (Moody’s/S&P)\nCommitment Fee\nBorrowing Spread\nBaal/BBB+ or above\n0.100 \n%\n1.625 \n%\nBaa2/BBB (current level)\n0.125 \n%\n1.750 \n%\nBaa3/BBB- or lower\n0.175 \n%\n1.875 \n%\nRevolving Credit Facility\nThe below table outlines the fees paid on the unused portion of the facility (“Facility Fee Rate”) and letter of credit fees and borrowings (“Borrowing Spread”) that corresponds to the applicable ratings levels from S&P and Moody's. S&P's applicable rating is “BBB.” Moody's applicable rating is “Baa2.”\nRatings Level (Moody's/S&P)\nFacility Fee Rate\nBorrowing Spread\nA3/A- or above\n0.090 \n%\n0.785 \n%\nBaal/BBB+\n0.100 \n%\n0.900 \n%\nBaa2/BBB (current level)\n0.110 \n%\n1.015 \n%\nBaa3/BBB-\n0.150 \n%\n1.100 \n%\nBa1/BB+ or lower\n0.200 \n%\n1.175 \n%\nIn the event the ratings fall within different levels, the applicable rate will be based upon the higher of the two Levels or, if there is more than a one-notch split between the two Levels, then the Applicable Rate will be based upon the Level that is one Level below the higher Level.\nDebt Covenants\nOur revolving credit and term loan facilities contain affirmative and negative covenants that, among other things, may limit or restrict our ability to: create liens and encumbrances; incur debt; merge, dissolve, liquidate or consolidate; make acquisitions and investments; dispose of or transfer assets; change the nature of our business; engage in certain transactions with affiliates; and enter into hedging transactions, in each case, subject to certain qualifications and exceptions. In addition, we are required to maintain a minimum interest expense coverage ratio.\nOur senior notes also contain affirmative and negative covenants that, among other things, may limit or restrict our ability to: create liens; engage in certain sale/leaseback transactions; and engage in certain consolidations, mergers and sales of assets. \nWe were in compliance with all debt covenants at September 27, 2025 and expect that we will maintain compliance.\nPension Plans\nAs further described in Part II, Item 8, Notes to Consolidated Financial Statements, Note 15: Pensions and Other Postretirement Benefits, the funded status of our defined benefit pension plans is defined as the amount the projected benefit obligation exceeds the plan assets. The funded status of the plans is an underfunded position of $146 million at the end of fiscal 2025 as compared to an underfunded position of $158 million at the end of fiscal 2024. We contributed $14 million in fiscal 2025 and expect to contribute approximately $15 million of cash to our pension plans in fiscal 2026. The exact amount of cash contributions made to pension plans in any year is dependent upon a number of factors, including minimum funding requirements. As a result, the actual funding in fiscal 2026 may be different from the estimate.\nOff-Balance Sheet Arrangements\nWe do not have any off-balance sheet arrangements material to our financial position or results of operations. The off-balance sheet arrangements we have are guarantees of obligations related to certain outside third parties, including leases, debt and livestock grower loans, and residual value guarantees covering certain operating leases for various types of equipment. See Part II, Item 8, Notes to Consolidated Financial Statements, Note 20: Commitments and Contingencies for further discussion.\n34\nCONTRACTUAL OBLIGATIONS\nThe following table summarizes our contractual obligations as of September 27, 2025 (in millions): \nPayments Due by Period\n2026\n2027-2028\n2029-2030\n2031 and thereafter\nTotal\nDebt principal payments\n (1)\n$\n909 \n$\n1,899 \n$\n1,648 \n$\n4,448 \n$\n8,904 \nInterest payments\n (2)\n423 \n777 \n597 \n2,817 \n4,614 \nGuarantees\n (3)\n10 \n14 \n25 \n18 \n67 \nOperating lease obligations\n (4)\n232 \n321 \n207 \n268 \n1,028 \nPurchase obligations\n (5)\n556 \n866 \n601 \n3,245 \n5,268 \nCapital expenditures \n(6)\n410 \n110 \n— \n— \n520 \nOther long-term liabilities\n (7)\n— \n— \n— \n— \n937 \nTotal contractual commitments\n$\n2,540 \n$\n3,987 \n$\n3,078 \n$\n10,796 \n$\n21,338 \n(1)\nIn the event of a default on payment, acceleration of the principal payments could occur.\n(2)\nInterest payments include interest on all outstanding debt. Payments are estimated for variable rate and variable term debt based on effective interest rates at September 27, 2025, and expected payment dates.\n(3)\nAmounts include guarantees of obligations related to certain outside third parties, which consist of leases, debt and livestock grower loans, all of which are substantially collateralized by the underlying assets, as well as residual value guarantees covering certain operating leases for various types of equipment. The amounts included are the maximum potential amount of future payments.\n(4)\nFor additional information regarding operating leases, refer to Part II, Item 8, Notes to the Consolidated Financial Statements, Note 6: Leases.\n(5)\nAmounts include agreements with a remaining term in excess of one year to purchase goods or services that are enforceable and legally binding and specify all significant terms, including: fixed or minimum quantities to be purchased; fixed, minimum or variable price provisions; and the approximate timing of the transaction. The purchase obligations amount included items, such as future purchase commitments for grains and livestock purchase contracts, that provide terms that meet the above criteria. For certain grain purchase commitments with a fixed quantity provision, we have assumed the future obligations under the commitment based on available commodity futures prices as published in observable active markets as of September 27, 2025. Additionally, the purchase obligations amount includes purchase commitments associated with long-term cold storage service agreements entered into as part of the sale of multiple Tyson-owned and operated storage facilities during fiscal 2025. We have excluded future purchase commitments for contracts that do not meet these criteria. Purchase orders are not included in the table, as a purchase order is an authorization to purchase and is cancellable. Contracts for goods or services that contain termination clauses without penalty have also been excluded. \n(6)\nAmounts include estimated amounts to complete buildings and equipment under construction as of September 27, 2025.\n(7)\nOther long-term liabilities primarily consist of deferred compensation, deferred income, self-insurance and asset retirement obligations. We are unable to reliably estimate the amount and timing of the remaining payments beyond fiscal 2025; therefore, we have only included the total liability in the table above. We also have employee benefit obligations consisting of pensions and other postretirement benefits of $165 million that are excluded from the table above. A discussion of the Company's pension and postretirement plans, including funding matters, is included in Part II, Item 8, Notes to Consolidated Financial Statements, Note 15: Pensions and Other Postretirement Benefits.\nIn addition to the amounts shown above in the table, we have unrecognized tax benefits of $153 million and related interest and penalties of $73 million at September 27, 2025, recorded in Other Liabilities and Other current liabilities. \nOur maximum commitment associated with our cash flow assistance programs is limited to the fair value of each participating livestock supplier's net tangible assets. The potential maximum obligation as of September 27, 2025 was approximately $240 million and we did not have significant net receivables outstanding under these programs.\n35\nOTHER KEY FINANCIAL MEASURES\nThe following are other key financial measures used by the Company for the purposes of assessing performance and highlighting operational trends as well as our ability to generate earnings sufficient to service our debt:\nin millions, except ratio data\n2025\n2024\n2023\nNet income (loss)\n$\n507 \n$\n822 \n$\n(649)\nLess: Interest income\n(73)\n(89)\n(30)\nAdd: Interest expense\n449 \n481 \n355 \nAdd/(Less): Income tax expense (benefit)\n262 \n270 \n(29)\nAdd: Depreciation\n1,093 \n1,159 \n1,100 \nAdd: Amortization (a)\n257 \n229 \n229 \nEBITDA\n$\n2,495 \n$\n2,872 \n$\n976 \nTotal gross debt\n8,830 \n9,787 \n9,506 \nLess: Cash and cash equivalents\n(1,229)\n(1,717)\n(573)\nLess: Short-term investments\n— \n(10)\n(15)\nTotal net debt\n$\n7,601 \n$\n8,060 \n$\n8,918 \nRatio Calculations:\nGross debt/EBITDA\n3.5x\n3.4x\n9.7x\nNet debt/EBITDA\n3.0x\n2.8x\n9.1x\nReturn on invested capital (b)\n2.8%\n3.9%\n(1.4%)\nTotal debt to capitalization (c)\n32.6%\n34.6%\n34.2%\nBook value per share (d)\n$\n51.63\n$\n52.03\n$\n51.37\n(a)\nExcludes the amortization of debt issuance and debt discount expense of $11 million, $12 million, $10 million for fiscal 2025, 2024 and 2023, respectively, as it is included in Interest expense.\n(b)\nReturn on invested capital is calculated by dividing after-tax operating income (loss), calculated by applying the Company’s effective tax rate to operating income (loss), by the average of beginning and ending total debt and shareholders’ equity less cash and cash equivalents.\n(c)\nFor the total debt to capitalization calculation, capitalization is defined as total debt plus total shareholders’ equity.\n(d)\nBook value per share is calculated by dividing shareholders’ equity by the sum of Class A and B shares outstanding.\nEBITDA is defined as net income (loss) before interest, income taxes, depreciation and amortization. Net debt to EBITDA represents the ratio of our debt, net of cash and short-term investments, to EBITDA. EBITDA and net debt to EBITDA are presented as supplemental financial measurements in the evaluation of our business. We believe the presentation of these financial measures helps investors to assess our operating performance from period to period, including our ability to generate earnings sufficient to service our debt, enhances understanding of our financial performance and highlights operational trends. These measures are widely used by investors and rating agencies in the valuation, comparison, rating and investment recommendations of companies; however, the measurements of EBITDA and net debt to EBITDA may not be comparable to those of other companies, which limits their usefulness as comparative measures. EBITDA and net debt to EBITDA are not measures required by or calculated in accordance with GAAP and should not be considered as substitutes for net income or any other measure of financial performance reported in accordance with GAAP or as a measure of operating cash flow or liquidity. EBITDA is a useful tool for assessing, but is not a reliable indicator of, our ability to generate cash to service our debt obligations because certain of the items added to net income to determine EBITDA involve outlays of cash. As a result, actual cash available to service our debt obligations will be different from EBITDA. Investors should rely primarily on our GAAP results, and use non-GAAP financial measures only supplementally, in making investment decisions.\nRECENTLY ISSUED/ADOPTED ACCOUNTING PRONOUNCEMENTS\nRefer to the discussion under Part II, Item 8, Notes to Consolidated Financial Statements, Note 1: Business and Summary of Significant Accounting Policies and Note 2: Changes in Accounting Principles. \n36\nCRITICAL ACCOUNTING ESTIMATES\nThe preparation of consolidated financial statements requires us to make estimates and assumptions. These estimates and assumptions affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the consolidated financial statements and the reported amounts of revenues and expenses during the reporting period. Actual results could differ from those estimates. The following is a summary of certain accounting estimates we consider critical. These estimates require levels of subjectivity and judgment, which could result in actual results differing from our estimates.\nContingent liabilities\nDescription\nWe are subject to lawsuits, investigations and other claims related to wage and hour/labor, antitrust, environmental, product, taxing authorities and other matters, and are required to assess the likelihood of any adverse judgments or outcomes to these matters, as well as potential ranges of probable losses.\nA determination of the amount of reserves and disclosures required, if any, for these contingencies is made after considerable analysis of each individual issue. We accrue for contingent liabilities when an assessment of the risk of loss is probable and can be reasonably estimated. We disclose contingent liabilities when the risk of loss is reasonably possible or probable.\nJudgments and Uncertainties\nOur contingent liabilities contain uncertainties because the eventual outcome will result from future events, and determination of current reserves requires estimates and judgments related to future changes in facts and circumstances, differing interpretations of the law and assessments of the amount of damages, and the effectiveness of strategies or other factors beyond our control.\nEffect if Actual Results Differ From Assumptions\nWe have not made any material changes in the accounting methodology used to establish our contingent liabilities during the past three fiscal years. As set forth in Part II, Item 8, Notes to the Consolidated Financial Statements, Note 20: Commitments and Contingencies, we recognized $698 million and $174 million of charges in fiscal 2025 and 2024, respectively, from legal accruals related to our broiler antitrust civil litigation, broiler chicken grower litigation, pork antitrust litigation, beef antitrust litigation and wage rate litigation based on our assessment of the likelihood and amount of probable losses. We do not believe there is a reasonable likelihood there will be a material change in the estimates or assumptions used to calculate our contingent liabilities. However, if actual results are not consistent with our estimates or assumptions, we may be exposed to gains or losses that could be material.\nRevenue recognition\nDescription\nWe recognize revenue for the sale of our product at the point in time when our performance obligation has been satisfied and control of the product has transferred to our customer, which generally occurs upon shipment or delivery to a customer based on terms of the sale. Revenue is measured by the transaction price, which is defined as the amount of consideration we expect to receive in exchange for providing goods to customers. The transaction price is adjusted for estimates of known or expected variable consideration, which includes consumer incentives, trade promotions, and allowances, such as coupons, discounts, rebates, volume-based incentives, cooperative advertising, and other programs. Variable consideration related to these programs is recorded as a reduction to revenue based on amounts we expect to pay.\nJudgments and Uncertainties\nThe transaction price contains estimates of known or expected variable consideration. We base these estimates on current performance, historical utilization, and projected redemption rates of each program. We review and update these estimates regularly until the incentives or product returns are realized and the impact of any adjustments are recognized in the period the adjustments are identified.\nEffect if Actual Results Differ From Assumptions\nWe do not believe there is a reasonable likelihood there will be a material change in the estimates or assumptions used to recognize revenue. As noted above, estimates are made based on historical experience and other factors. Typically, programs that are offered have a short duration, and historically, the difference between actual experience compared to estimated redemptions and performance has not been significant to the quarterly or annual financial statements. However, if the level of redemption rates or performance were to vary significantly from estimates, we may be exposed to gains or losses that could be material. We have not made any material changes in the accounting methodology used to recognize revenue during the past three fiscal years.\nAccrued self-insurance\nDescription\nWe are self-insured for certain losses related to health and welfare, workers’ compensation, auto liability and general liability claims. We use an independent third-party actuary to assist in determining our self-insurance liability. We and the actuary consider a number of factors when estimating our self-insurance liability, including claims experience, demographic factors, severity factors and other actuarial assumptions. We periodically review our estimates and assumptions with our third-party actuary to assist us in determining the adequacy of our self-insurance liability. Our policy is to maintain an accrual at the actuarial estimated median.\n37\nJudgments and Uncertainties\nOur self-insurance liability contains uncertainties due to assumptions required and judgments used. Costs to settle our obligations, including legal and healthcare costs, could increase or decrease causing estimates of our self-insurance liability to change. Incident rates, including frequency and severity, could increase or decrease causing estimates in our self-insurance liability to change.\nEffect if Actual Results Differ From Assumptions\nWe have not made any material changes in the accounting methodology used to establish our self-insurance liability during the past three fiscal years. We do not believe there is a reasonable likelihood there will be a material change in the estimates or assumptions used to calculate our self-insurance liability. However, if actual results are not consistent with our estimates or assumptions, we may be exposed to gains or losses that could be material. A 10% change in the actuarial estimate at September 27, 2025, would not have a significant impact on our liability.\nIncome taxes\nDescription\nWe estimate total income tax expense based on statutory tax rates and tax planning opportunities available to us in various jurisdictions in which we earn income. Income tax includes an estimate for withholding taxes on earnings of foreign subsidiaries expected to be remitted but does not include an estimate for taxes on earnings considered to be indefinitely invested in the foreign subsidiary. Deferred income taxes are recognized for the future tax effects of temporary differences between financial and income tax reporting using tax rates in effect for the years in which the differences are expected to reverse. Valuation allowances are recorded when it is likely a tax benefit will not be realized for a deferred tax asset. We record unrecognized tax benefit liabilities for known or anticipated tax issues based on our analysis of whether, and the extent to which, additional taxes will be due.\nJudgments and Uncertainties\nChanges in projected future earnings could affect the recorded valuation allowances in the future. Our calculations related to income taxes contain uncertainties due to judgment used to calculate tax liabilities in the application of complex tax regulations across the tax jurisdictions where we operate. Our analysis of unrecognized tax benefits contains uncertainties based on judgment used to apply the more likely than not recognition and measurement thresholds.\nEffect if Actual Results Differ From Assumptions\nDue to the complexity of some of these judgments and uncertainties, the ultimate resolution may result in a payment that is materially different from the current estimate of the tax liabilities. To the extent we prevail in matters for which unrecognized tax benefit liabilities have been established, or are required to pay amounts in excess of our recorded unrecognized tax benefit liabilities, our effective tax rate in a given financial statement period could be materially affected. An unfavorable tax settlement would require use of our cash and generally result in an increase in our effective tax rate in the period of resolution. A favorable tax settlement would generally be recognized as a reduction in our effective tax rate in the period of resolution. Changes in tax laws and rates could affect recorded deferred tax assets and liabilities in the future. Other than those potential impacts, we do not believe there is a reasonable likelihood there will be a material change in the tax related balances or valuation allowances.\nDefined benefit pension plans\nDescription\nWe sponsor four defined benefit pension plans that provide retirement benefits to certain team members. We also participate in a multi-employer plan that provides defined benefits to certain team members covered by collective bargaining agreements. Such plans are usually administered by a board of trustees composed of the management of the participating companies and labor representatives. We use independent third-party actuaries to assist us in determining our pension obligations and net periodic benefit cost. We and the actuaries review assumptions that include estimates of the present value of the projected future pension payment to all plan participants, taking into consideration the likelihood of potential future events such as salary increases and demographic experience. We accumulate and amortize the effect of actuarial gains and losses over future periods. Net periodic benefit cost for the defined benefit pension plans was $7 million in fiscal 2025. The projected benefit obligation was $176 million at the end of fiscal 2025. Unrecognized actuarial gain was $2 million at the end of fiscal 2025. We currently expect net periodic benefit cost associated with our pension plans to be approximately $7 million in fiscal 2026. We expect to contribute approximately $15 million of cash to our pension plans in fiscal 2026. The exact amount of cash contributions made to pension plans in any year is dependent upon a number of factors, including minimum funding requirements.\n38\nJudgments and Uncertainties\nOur defined benefit pension plans contain uncertainties due to assumptions required and judgments used. The key assumptions used in developing the required estimates include such factors as discount rates, expected returns on plan assets, retirement rates, and mortality. These assumptions can have a material impact upon the funded status and the net periodic benefit cost. The expected liquidation of certain plans has been considered along with these assumptions. The discount rates were determined using a cash flow matching technique whereby the rates of a yield curve, developed from high-quality debt securities, were applied to the benefit obligations to determine the appropriate discount rate. In determining the long-term rate of return on plan assets, we first examined historical rates of return for the various asset classes within the plans. We then determined a long-term projected rate-of-return based on expected returns. Investment, management and other fees paid out of plan assets are factored into the determination of asset return assumptions. Retirement rates are based primarily on actual plan experience, while standard actuarial tables are used to estimate mortality. It is reasonably likely that changes in external factors will result in changes to the assumptions used to measure pension obligations and net periodic benefit cost in future periods. \nThe risks of participating in multi-employer plans are different from single-employer plans. The net pension cost of the multi-employer plans is equal to the annual contribution determined in accordance with the provisions of negotiated labor contracts. Assets contributed to such plans are not segregated or otherwise restricted to provide benefits only to our team members. The future cost of these plans is dependent on a number of factors including the funded status of the plans and the ability of the other participating companies to meet ongoing funding obligations. \nEffect if Actual Results Differ From Assumptions\nWe have not made any material changes in the accounting methodology used to establish our pension obligations and net periodic benefit cost during the past three fiscal years. We do not believe there is a reasonable likelihood there will be a material change in the estimates or assumptions used to calculate our pension obligations and net periodic benefit cost. However, if actual results are not consistent with our estimates or assumptions, they are accumulated and amortized over future periods and, therefore generally affect the net periodic benefit cost in future periods. A 1% change in the discount rate at September 27, 2025, would not have a significant impact on the projected benefit obligation or net periodic benefit cost. A 1% change in the return on plan assets at September 27, 2025, would not have a significant impact on net periodic benefit cost. The sensitivities reflect the impact of changing one assumption at a time with the remaining assumptions held constant. Economic factors and conditions often affect multiple assumptions simultaneously and the effect of changes in assumptions are not necessarily linear.\nImpairment of goodwill and indefinite life intangible assets\nDescription\nGoodwill and indefinite life intangible assets are evaluated for impairment annually or more frequently if events or circumstances indicate it is more likely than not that the fair value of a reporting unit or indefinite life intangible asset is less than its carrying value. We have elected to make the first day of the fourth quarter the annual impairment assessment date for goodwill and indefinite life intangible assets. However, we could be required to evaluate the recoverability of goodwill and indefinite life intangible assets outside of the required annual assessment if, among other things, we experience disruptions to the business, unexpected significant declines in operating results, divestiture of a significant component of the business, sustained decline in market capitalization or significant changes in macro-economic factors such as increased interest and discount rates.\nWe evaluate goodwill for impairment by first performing a qualitative assessment to determine whether a quantitative goodwill test is necessary. If it is determined, based on qualitative factors, the fair value of the reporting unit may more likely than not be less than its carrying value or if significant changes to macro-economic factors related to the reporting unit have occurred that could materially impact fair value, a quantitative goodwill impairment test would be required. The quantitative test compares the fair value of a reporting unit with its carrying value. Additionally, we can elect to forgo the qualitative assessment and perform the quantitative test. Upon performing the quantitative test, if the carrying value of the reporting unit exceeds its fair value, an impairment loss is recognized in an amount equal to that excess, not to exceed the carrying amount of goodwill. \nFor indefinite life intangible assets, a qualitative assessment can also be performed to determine whether the existence of events and circumstances indicates it is more likely than not an intangible asset is impaired. Similar to goodwill, we can also elect to forgo the qualitative test for indefinite life intangible assets and perform the quantitative test. Upon performing the quantitative test, if the carrying value of the intangible asset exceeds its fair value, an impairment loss is recognized in an amount equal to that excess.\n39\nJudgments and Uncertainties\nWe estimate the fair value of our reporting units considering the use of various valuation techniques, with the primary technique being an income approach (discounted cash flow method) and another technique being a market approach (guideline public company method), which use significant unobservable inputs, or Level 3 inputs, as defined by the fair value hierarchy. We include assumptions about sales growth, operating margins, discount rates and valuation multiples which consider our budgets, business plans, economic projections and marketplace data, and are believed to reflect market participant views which would exist in an exit transaction. Assumptions are also made for varying growth rates for periods beyond the long-term business plan period. Generally, we utilize operating margin assumptions based on future expectations, macro-economic trends, operating margins historically realized in the reporting units’ industries and industry marketplace valuation multiples. We consider reporting units that have 20% or less excess fair value over carrying value to have a heightened risk of impairment. \nDuring fiscal 2023, we experienced lower than anticipated operating results and changing market fundamentals, as well as a drop in our market capitalization to below book value and an increase in long-term treasury rates which caused a net 50 basis point increase in the discount rates used in estimating the fair value of the reporting units. Based on quantitative assessments in fiscal 2023, we recognized $781 million of goodwill impairment charges including $333 million to partially impair the goodwill of the Beef reporting unit, $238 million to fully impair the goodwill of two of our International/Other reporting units and $210 million to partially impair the goodwill of a Chicken segment reporting unit. \nOur fiscal 2024 goodwill impairment analysis did not result in impairment charges. Following the annual fiscal 2024 assessment, our Beef and two Chicken segment reporting units, with a total goodwill of approximately $3.3 billion in fiscal 2024, were at heightened risk of impairment.\nDuring the third quarter of fiscal 2025, our Beef reporting unit experienced lower than anticipated supply of market-ready cattle and an increased carrying value primarily associated with higher cattle costs. Additionally, our forecasts indicated the timing of the recovery of market-ready cattle associated with the anticipated cattle herd rebuilding would be longer than previously estimated. Consequently, we determined the fair value of our Beef reporting unit was more likely than not less than the carrying amount and proceeded to perform a quantitative assessment. Based on this quantitative assessment, we determined the fair value of our Beef reporting unit had decreased to below its carrying value. Accordingly, we recognized a $343 million impairment during the third quarter of fiscal 2025 to fully impair its remaining goodwill.\nWe performed our annual impairment assessment as of the first day of our fourth quarter of fiscal 2025 and determined it was necessary to perform a quantitative assessment for one of our International/Other reporting units, which had goodwill of $0.2 billion at September 27, 2025, as it had lower than previously anticipated operating results. Based on this assessment, we determined that the International/Other reporting unit's estimated fair value exceeded its carrying value, and thus, did not recognize a goodwill impairment. In estimating its fair value, we generally assumed operating margins in future years would normalize over time as we believe this is consistent with market participant views in an exit transaction. The current year results are not indicative of future market participant expectations in an exit transaction primarily due to the impact of macroeconomic factors which we expect to be mostly temporary in nature. As of the date of the assessment, we estimate discount rates utilized in the discounted cash flow method would have to increase by more than approximately 125 basis points, with all other assumptions unchanged, before the carrying value of the International/Other reporting units would exceed their fair value. Following the annual fiscal 2025 assessment, this reporting unit was at heightened risk of impairment.\nWe performed a qualitative assessment for the remaining reporting units in our Chicken, Prepared Foods and Pork segments, which had goodwill of $9.3 billion at September 27, 2025, and determined none of them were at heightened risk of impairment following the fiscal 2025 annual assessment. As of the latest fair value assessments, we estimate discount rates utilized in the discounted cash flow method would have to increase by more than approximately 75 basis points, with all other assumptions unchanged, before the carrying value of any of the Chicken, Prepared Foods and Pork reporting units would exceed their fair value.\nThe fair value of our indefinite life intangible assets is calculated principally using multi-period excess earnings and relief-from-royalty valuation approaches, which uses significant unobservable inputs, or Level 3 inputs, as defined by the fair value hierarchy, and is believed to reflect market participant views which would exist in an exit transaction. Under these valuation approaches, we are required to make estimates and assumptions about sales growth, operating margins, royalty rates and discount rates based on budgets, business plans, economic projections, anticipated future cash flows and marketplace data. We consider indefinite life intangible assets that have 20% or less excess fair value over carrying value to have a heightened risk of impairment. Our fiscal 2025, 2024 and 2023 indefinite life intangible assets impairment analyses did not result in an impairment charge.\n40\nAll of our indefinite life intangible assets' estimated fair values exceeded their carrying values by more than 20% at the date of the most recent estimated fair value determination. We performed our annual impairment assessment as of the first day of our fourth quarter of fiscal 2025 and determined it was necessary to perform quantitative assessments for two of our Prepared Foods brands with carrying values of $0.5 billion and $0.3 billion at September 27, 2025. For these two brands, we estimate the discount rate would need to increase over 150 basis points as of the date of the most recent estimated fair value, with all other assumptions unchanged, to cause the carrying value to approximate its fair value. We generally assumed growth rates in future years would normalize over time as we believe this is consistent with market participant views in an exit transaction. Had we assumed future growth rates consistent with those realized in fiscal 2025, we would have failed the impairment quantitative test, which may have resulted in material impairment losses. The current year growth rate is not indicative of future market participant expectations in an exit transaction primarily due to the impacts of rapid inflationary pressures and volatile market conditions which impacts we expect to be mostly temporary in nature. We do not currently consider any of our indefinite life intangible assets, which had an aggregate value of $4.1 billion at September 27, 2025, to be at heightened risk of impairment.\nEffect if Actual Results Differ From Assumptions\nWe have not made material changes in the accounting methodology used to evaluate impairment of goodwill and indefinite life intangible assets during the last three years.\nOur impairment analysis contains inherent estimates and assumptions, many of which are outside the control of management including interest rates, cost of capital, tax rates, market EBITDA comparables and credit ratings, which could positively or negatively impact the anticipated future economic and operating conditions. The assumptions and estimates used in determining fair value require considerable judgment and are sensitive to changes in underlying assumptions. These assumptions can change in future periods as a result of overall economic conditions, including the impacts of inflationary pressures, increased interest and discount rates, global supply chain constraints and decreased market capitalization, amongst others. As a result, there can be no assurance that estimates and assumptions made for the purpose of assessing impairments will prove to be an accurate prediction of the future. Potential circumstances that could have a negative effect on the fair value of our reporting units and indefinite life intangible assets include, but are not limited to, lower than forecasted growth rates or operating margins and changes in discount rates. A reduction in the estimated fair value of the reporting units and indefinite life intangible assets could trigger an impairment in the future. We cannot predict the occurrence of certain events or changes in circumstances that might adversely affect the carrying value of our goodwill and indefinite life intangible assets.\nWe continuously evaluate the changing macro-economic conditions including inflationary pressures, rising interest rates, demand outlook and export markets, and the Company's market capitalization. Although all our reporting units and indefinite life intangible assets had more than 20% excess fair value over carrying value as of the most recent assessment, other than one reporting unit with goodwill of $0.2 billion as of September 27, 2025, they remain susceptible to impairments if any assumptions, estimates, or market factors significantly change in the future.\nImpairment of long-lived assets and definite life intangibles\nDescription\nLong-lived assets and definite life intangibles are evaluated for impairment whenever events or changes in circumstances indicate the carrying value may not be recoverable. Examples include a significant adverse change in the extent or manner in which we use the asset, a change in its physical condition, or an unexpected change in financial performance.\nWhen evaluating long-lived assets and definite life intangibles for impairment, we compare the carrying value of the asset to the asset’s estimated undiscounted future cash flows. An impairment is indicated if the estimated future cash flows are less than the carrying value of the asset group. For assets held for sale, we compare the carrying value of the disposal group to fair value. The impairment is the excess of the carrying value over the fair value of the asset.\nWe recorded charges related to impairments, disposals and write-offs of long-lived assets of $126 million, $131 million and $101 million, in fiscal 2025, 2024 and 2023, respectively.\nJudgments and Uncertainties\nOur impairment analysis contains uncertainties due to judgment in assumptions, including useful lives and intended use of assets, observable market valuations, forecasted sales growth, operating margins, royalty rates and discount rates based on budgets, business plans, economic projections, anticipated future cash flows and marketplace data that reflects the risk inherent in future cash flows to determine fair value.\n41\nEffect if Actual Results Differ From Assumptions\nWe have not made any material changes in the accounting methodology used to evaluate the impairment of long-lived assets or definite life intangibles during the last three fiscal years. We do not believe there is a reasonable likelihood there will be a material change in the estimates or assumptions used to calculate impairments or useful lives of long-lived assets or definite life intangibles. However, if actual results are not consistent with our estimates and assumptions used to calculate estimated future cash flows, we may be exposed to impairment losses that could be material. We periodically conduct projects to strategically evaluate optimization of such items as network capacity, manufacturing efficiencies and business technology. If we have a significant change in strategies, outlook, or a manner in which we plan to use these assets, we may be exposed to future impairments. \nBusiness Combinations\nDescription\nWe account for acquired businesses using the acquisition method of accounting, which requires that once control of a business is obtained, 100% of the assets acquired and liabilities assumed, including amounts attributed to noncontrolling interests, be recorded at the date of acquisition at their respective fair values. Any excess of the purchase price over the estimated fair values of the net assets acquired is recorded as goodwill.\nWe use various models to determine the value of assets acquired and liabilities assumed such as net realizable value to value inventory, cost method and market approach to value property, relief-from-royalty and multi-period excess earnings to value intangibles and discounted cash flow to value goodwill.\nFor significant acquisitions we may use independent third-party valuation specialists to assist us in determining the fair value of assets acquired and liabilities assumed. \nJudgments and Uncertainties\nSignificant judgment is often required in estimating the fair value of assets acquired and liabilities assumed, particularly intangible assets. We make estimates and assumptions about projected future cash flows including sales growth, operating margins, attrition rates and discount rates based on historical results, business plans, expected synergies, perceived risk and marketplace data considering the perspective of marketplace participants. \nDetermining the useful life of an intangible asset also requires judgment as different types of intangible assets will have different useful lives and certain assets may be considered to have indefinite useful lives.\nEffect if Actual Results Differ From Assumptions\nWhile management believes those expectations and assumptions are reasonable, they are inherently uncertain. Unanticipated market or macroeconomic events and circumstances may occur, which could affect the accuracy or validity of the estimates and assumptions, which could result in subsequent impairments. For more information regarding business combinations, refer to Part II, Item 8, Notes to Consolidated Financial Statements, Note 3: Acquisitions and Dispositions.",
  "item2": null
}