{
  "source_file": "tsn-20250628.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nOBJECTIVE\nThe following discussion provides an analysis of the Company’s financial condition, cash flows and results of operations from management’s perspective and should be read in conjunction with the consolidated condensed financial statements and notes thereto included in Part I, Item 1 of this Quarterly Report on Form 10-Q and within the Company’s Annual Report on Form 10-K filed for the fiscal year ended September 28, 2024. Our objective is to also provide discussion of events and uncertainties known to management that are reasonably likely to cause reported financial information not to be indicative of future operating results or of future financial condition and to offer information that provides understanding of our financial condition, cash flows and results of operations.\nRESULTS OF OPERATIONS\nDescription of the Company\nWe are a world-class food company and recognized leader in protein. Founded in 1935 by John W. Tyson, it has grown under four generations of family leadership. The Company is unified by this purpose: Tyson Foods. We Feed the World Like Family\nTM\n and has a broad portfolio of iconic products and brands including Tyson®, Jimmy Dean®, Hillshire Farm®, Ball Park®, Wright®, State Fair®, Aidells® and ibp®. Tyson Foods is dedicated to bringing high-quality food to every table in the world, safely, sustainably, and affordably, now and for future generations. Some of the key factors influencing our business are customer demand for our products; the ability to maintain and grow relationships with customers and introduce new and innovative products to the marketplace; accessibility of international markets; market prices for our products; the cost and availability of live cattle and hogs, raw materials and feed ingredients; availability of team members to operate our production facilities; and operating efficiencies of our facilities.\nWe operate in four reportable segments: Beef, Pork, Chicken, and Prepared Foods. We measure segment profit as operating income (loss). International/Other primarily includes our foreign operations in China, Malaysia, Mexico, South Korea, Thailand and the Kingdom of Saudi Arabia, third-party merger and integration costs and corporate overhead related to Tyson New Ventures, LLC. \nOverview\nGeneral \nSales grew 4%, or $531 million in the third quarter of fiscal 2025, driven by sales growth across each of our segments. Operating income of $260 million for the third quarter of fiscal 2025 was down 24% as compared to the third quarter of fiscal 2024, as we experienced greater operating losses in our Beef segment, partially offset by higher operating income in our Pork, Chicken and Prepared Foods segments. In the third quarter of fiscal 2025, our operating income was impacted by $343 million of goodwill impairment charges, partially offset by $83 million of income, net of charges, related to the Company's network optimization plan and related gain on the sale of storage facilities. In the third quarter of fiscal 2024, our operating income was impacted by $101 million in legal contingency accruals and $41 million in plant closures and disposal charges.\nSales grew 2%, or $837 million, in the first nine months of fiscal 2025, driven by increased sales in our Beef, Chicken and Prepared Foods segments, partially offset by decreased sales in our Pork segment. Operating income of $940 million for the first nine months of fiscal 2025 was up 6% compared to the first nine months of fiscal 2024 as we experienced higher operating income in our Chicken and Prepared Foods segments and International/Other, partially offset by lower operating income in our Beef and Pork segments. In the first nine months of fiscal 2025, our operating income was impacted by $343 million of goodwill impairment charges, $343 million of legal contingency accruals, $33 million of charges related to the network optimization plan and $23 million of plant closures and disposal charges. In the first nine months ended June 29, 2024, our operating income was impacted by $174 million in legal contingency accruals, $155 million of plant closure and disposal charges, $83 million of costs related to a production facility fire in the Netherlands and the subsequent decision to sell the facility and $31 million of restructuring and related charges.\nMarket Environment \nAccording to the United States Department of Agriculture, domestic protein production (beef, pork, chicken and turkey) decreased 1% in the third quarter of fiscal 2025 as compared to the same period in fiscal 2024. The Beef segment continues to experience limited supply of market-ready cattle as well as increased cattle costs. Additionally, uncertainty exists regarding the timing of the anticipated cattle herd rebuilding. The Pork segment experienced sufficient supply of market-ready hogs and increased hog costs. The Chicken segment experienced reduced feed ingredient costs in the first nine months of fiscal 2025, but costs began to moderate in the third quarter of fiscal 2025 as compared to the same period in fiscal 2024. The Prepared Foods segment is currently experiencing increased raw material costs primarily due to higher meat costs. \n27\nWe are subject to changes in import and export policies, including trade restrictions, new or increased tariffs or quotas, and customs restrictions through our international sales and operations. Our exports account for less than 10% of our business, primarily composed of chicken leg quarters and paws, boxed beef and variety meats of all proteins. As a result of the recent changes in trade policies and tariffs both domestically and internationally, we may experience some sales disruptions and other impacts associated with tariffs. There is uncertainty regarding the impact the current changes will have on the price and demand of our products in the affected countries, commodity pricing and other general economic conditions, and uncertainty in future changes that may have a material impact. We will continue to analyze the impact of supply chain and tariff impacts in the upcoming months. \nMargins\n \nOur total operating margin was 1.9% in the third quarter of fiscal 2025. Operating margins by segment were as follows:\n•\nBeef – (8.8)% \n•\nPork – 2.4% \n•\nChicken – 8.7% \n•\nPrepared Foods – 12.0%\nStrategy \nWe are a world-class food company and recognized leader in protein. Our strategy is to deliver margins in the core protein business by driving efficiencies and valuing-up offerings to better serve consumers; grow branded portfolio by innovating new occasions, categories and channels; and scale in international markets by delivering profitable value-added food offerings in high growth categories.\nIn the first quarter of fiscal 2025, the Company initiated a network optimization plan to optimize our global operations and logistics network. We anticipate we will recognize total pretax charges of $84 million related to actions approved through June 28, 2025. We recognized charges of $24 million and $33 million in the third quarter and first nine months of fiscal 2025, respectively, related to the network optimization plan, which primarily included the closure of two facilities in the Prepared Foods segment, a non-harvesting facility closure in the Beef segment, asset write-offs in the Chicken and Prepared Foods segments and International/Other. Additionally, in the third quarter of fiscal 2025, we recognized a $107 million gain from the sale of storage facilities. Approved charges that have been recognized through June 28, 2025 included $51 million that have resulted or will result in cash outflows and $89 million of non-cash charges. We have also received $252 million of proceeds in the first nine months of fiscal 2025 associated with the sale of storage facilities. We expect to incur costs related to the network optimization plan over a multi-year period. We expect to incur additional charges in the future as additional actions are approved. For further description refer to Part I, Item I, Notes to the Consolidated Condensed Financial Statements, Note 5: Restructuring and Related Charges.\nSummary of Results\nSales\nin millions\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nJune 28, 2025\nJune 29, 2024\nSales\n$\n13,884 \n$\n13,353 \n$\n40,581 \n$\n39,744 \nChange in sales volume\n(0.1)\n%\n0.5 \n%\nChange in average sales price\n3.7 \n%\n2.4 \n%\nSales growth\n4.0 \n%\n2.1 \n%\nThird quarter – Fiscal 2025 vs Fiscal 2024\n•\nSales Volume\n – Volumes were relatively flat, accounting for a $9 million change as decreased sales volume in our Beef and Prepared Foods segments, was mostly offset by increased sales volume in our Chicken and Pork segments.\n•\nAverage Sales Price\n – Sales were positively impacted by higher average sales prices, which accounted for an increase of $495 million, driven by increased pricing in our Beef, Chicken and Prepared Foods segments, partially offset by lower average sales prices in our Pork segment.\n◦\nThe above changes in average sales price exclude a $45 million reduction of Sales for the recognition of a legal contingency accrual recorded in the third quarter of fiscal 2024.\nNine months – Fiscal 2025 vs Fiscal 2024\n•\nSales Volume\n – Sales were positively impacted by an increase in sales volume, which accounted for a $196 million increase in sales driven by increased sales volume in our Chicken and Beef segments, partially offset by decreased sales volume in our Pork and Prepared Foods segments.\n28\n•\nAverage Sales Price\n – Sales were positively impacted by higher average sales prices, which accounted for an increase of $939 million, driven by increased pricing in our Beef, Pork and Prepared Foods segments, while pricing in our Chicken segment was flat.\n◦\nThe above changes in average sales price exclude a $343 million and $45 million reduction of Sales from the recognition of legal contingency accruals for the nine months ended June 28, 2025 and June 29, 2024, respectively.\nCost of Sales\nin millions\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nJune 28, 2025\nJune 29, 2024\nCost of sales\n$\n12,743 \n$\n12,475 \n$\n37,745 \n$\n37,177 \nGross profit\n1,141 \n878 \n2,836 \n2,567 \nCost of sales as a percentage of sales\n91.8 \n%\n93.4 \n%\n93.0 \n%\n93.5 \n%\nThird quarter – Fiscal 2025 vs Fiscal 2024 \n•\nCost of sales increased $268 million. Lower sales volume decreased cost of sales $8 million while higher input cost per pound increased cost of sales by $276 million.\n•\nThe $276 million impact of higher input cost per pound was impacted by:\n•\nIncrease in cattle costs of approximately $560 million in our Beef segment.\n•\nIncrease in raw material and other input costs of approximately $60 million in our Prepared Foods segment.\n•\nIncrease due to net derivative losses of $19 million in the third quarter of fiscal 2025, compared to net derivative gains of $6 million in the third quarter of fiscal 2024 due to our risk management activities. These amounts exclude offsetting impacts from related physical purchase transactions, which are included in the change in live cattle and hog costs and raw material and feed ingredient costs described herein.\n•\nIncrease in hog costs of approximately $15 million in our Pork segment.\n•\nDecrease of $83 million related to the network optimization plan as a result of a gain recognized on the sale of storage facilities, net of charges.\n•\nDecrease of $56 million related to the recognition of a legal contingency accrual in our Chicken segment in fiscal 2024.\n•\nDecrease of $41 million due to lower plant closures and disposal charges.\n•\nDecrease in freight and transportation costs of approximately $30 million.\n•\nDecrease of approximately $20 million in our Chicken segment related to decreased feed ingredient costs.\n•\nDecrease of $17 million in International/Other from lower net costs related to a production facility fire in the Netherlands and the subsequent decision to sell the facility.\n•\nRemaining decrease in costs across all of our segments primarily driven by net impacts on average cost per pound from mix changes and lower operating costs.\nNine months – Fiscal 2025 vs Fiscal 2024\n•\nCost of sales increased $568 million. Higher sales volume increased cost of sales by $184 million while higher input cost per pound increased cost of sales by $384 million.\n•\nThe $384 million impact of higher input cost per pound was impacted by:\n•\nIncrease in cattle costs of approximately $1,070 million in our Beef segment.\n•\nIncrease in raw material and other input costs of approximately $220 million in our Prepared Foods segment.\n•\nIncrease in hog costs of approximately $175 million in our Pork segment.\n•\nIncrease of $31 million related to the network optimization plan charges.\n•\nIncrease of $19 million in our Chicken segment from reduced insurance proceeds, net of costs, related to a production facility fire in the fourth quarter of fiscal 2021.\n•\nDecrease of approximately $285 million in our Chicken segment related to decreased feed ingredient costs.\n•\nDecrease of $132 million due to lower plant closures and disposal charges.\n•\nDecrease of $129 million related to the recognition of legal contingency accruals in our Beef, Pork and Chicken segments in fiscal 2024.\n•\nDecrease in freight and transportation costs of approximately $100 million.\n•\nDecrease of $97 million in International/Other from lower net costs related to a production facility fire in the Netherlands and the subsequent decision to sell the facility.\n29\n•\nRemaining decrease in costs across all of our segments primarily driven by net impacts on average cost per pound from mix changes and lower operating costs.\nSelling, General and Administrative\n \nin millions\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nJune 28, 2025\nJune 29, 2024\nSelling, general and administrative expense\n$\n538 \n$\n537 \n$\n1,553 \n$\n1,683 \nAs a percentage of sales\n3.9 \n%\n4.0 \n%\n3.8 \n%\n4.2 \n%\nThird quarter – Fiscal 2025 vs Fiscal 2024 \n•\nSelling, general and administrative was relatively flat.\nNine months – Fiscal 2025 vs Fiscal 2024\n•\nDecrease of $130 million in selling, general and administrative was primarily driven by:\n•\nDecrease of $36 million in employee costs primarily from performance-based compensation.\n•\nDecrease of $35 million in professional fees.\n•\nDecrease of $33 million in marketing, advertising and promotion expenses.\n•\nDecrease of $31 million in restructuring and related costs.\nGoodwill Impairment\nin millions\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nJune 28, 2025\nJune 29, 2024\nGoodwill Impairment\n$\n343 \n$\n— \n$\n343 \n$\n— \nThird quarter and nine months – Fiscal 2025 vs Fiscal 2024 \n•\nWe recorded a $343 million goodwill impairment charge in the Beef segment in the third quarter of fiscal 2025.\nInterest (Income) Expense\n \nin millions\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nJune 28, 2025\nJune 29, 2024\nInterest income\n$\n(15)\n$\n(36)\n$\n(57)\n$\n(60)\nInterest expense\n113 \n135 \n343 \n351 \nThird quarter and nine months – Fiscal 2025 vs Fiscal 2024 \n•\nThe decrease in interest income for the third quarter and nine months ended June 28, 2025 was primarily due to average lower cash and cash equivalents held. \n•\nThe decrease in interest expense for the three and nine months ended June 28, 2025 was primarily due to lower interest expense related to the repayment of the term loan due May 2026 in the second quarter of fiscal 2025 and the repayment of the August 2024 senior notes in the fourth quarter of fiscal 2024.\nOther (Income) Expense, net\n \nin millions\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nJune 28, 2025\nJune 29, 2024\nTotal other (income) expense, net\n$\n(31)\n$\n(11)\n$\n(47)\n$\n(24)\nThird quarter and nine months – Fiscal 2025\n•\nIncluded $23 million of joint venture earnings and $11 million of foreign exchange gains in the third quarter of fiscal 2025. Included $50 million of joint venture earnings and $7 million of production facilities fire insurance proceeds, partially offset by $7 million of foreign exchange losses in the first nine months of fiscal 2025.\nThird quarter and nine months – Fiscal 2024\n•\nIncluded $19 million and $22 million of joint venture earnings in the third quarter and the first nine months of fiscal 2024, respectively, offset by $9 million and $4 million of foreign exchange losses in the third quarter and the first nine months of fiscal 2024, respectively. Additionally, included $14 million of income related to an amendment of a postretirement benefit plan in the first nine months of fiscal 2024.\n30\nEffective Tax Rate\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nJune 28, 2025\nJune 29, 2024\n64.5 \n%\n22.9 \n%\n36.0 \n%\n25.9 \n%\nThird quarter – Fiscal 2025 vs Fiscal 2024 \n•\nThe third quarter of fiscal 2025 was higher than the third quarter of fiscal 2024 primarily due to a $343 million non-deductible goodwill impairment, partially offset by the favorable impact of higher foreign income in fiscal 2025. \n•\nAdditionally, the third quarter of fiscal 2024 included a $9 million benefit related to the remeasurement of deferred income taxes, primarily due to legislation decreasing state tax rates enacted in the third quarter of 2024.\nNine months – Fiscal 2025 vs Fiscal 2024\n•\nThe effective tax rate for the first nine months of fiscal 2025 was higher than the first nine months of fiscal 2024 due to a $343 million non-deductible goodwill impairment, partially offset by the favorable impact of higher foreign income in fiscal 2025.\nNet Income Attributable to Tyson\nin millions, except per share data\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nJune 28, 2025\nJune 29, 2024\nNet income attributable to Tyson\n$\n61 \n$\n191 \n$\n427 \n$\n443 \nNet income attributable to Tyson – per diluted share\n0.17 \n0.54 \n1.20 \n1.25 \nThird quarter – Fiscal 2025 – \nNet income attributable to Tyson included the following items:\n•\n$343 million pretax, or ($0.96) per diluted share, of goodwill impairment charges (non-tax deductible).\n•\n$83 million pretax, or $0.18 per diluted share, related to the network optimization plan income, net of charges.\n•\n$14 million pretax, or $0.04 per diluted share, of insurance proceeds, net of costs, related to a production facility fire in the Netherlands and our subsequent decision to sell the facility.\n•\n$6 million pretax, or $0.01 per diluted share, related to the relocation of a production facility in China.\n•\n$5 million pretax, or ($0.01) per diluted share, of brand discontinuation charges.\nNine months – Fiscal 2025 – \nNet income attributable to Tyson included the following items:\n•\n$343 million pretax, or ($0.96) per diluted share, of goodwill impairment charges (non-tax deductible).\n•\n$343 million pretax, or ($0.73) per diluted share, related to the recognition of legal contingency accruals.\n•\n$33 million pretax, or ($0.08) per diluted share, related to the network optimization plan charges.\n•\n$23 million pretax, or ($0.05) per diluted share, of plant closures and disposal charges.\n•\n$17 million pretax, or ($0.04) per diluted share, of brand discontinuation charges.\n•\n$14 million pretax, or $0.04 per diluted share, of insurance proceeds, net of costs, related to a production facility fire in the Netherlands and our subsequent decision to sell the facility.\n•\n$7 million pretax, or $0.01 per diluted share, of production facilities fire insurance proceeds, net of costs incurred.\n•\n$6 million pretax, or $0.01 per diluted share, related to the relocation of a production facility in China.\n•\n$9 million post tax, or $0.03 per diluted share, of benefit due to newly enacted tax legislation that resulted in the release of a valuation allowance on losses related to a production facility fire in the Netherlands and our subsequent decision to sell the facility.\nThird quarter – Fiscal 2024 – \nNet income attributable to Tyson included the following items:\n•\n$101 million pretax, or ($0.22) per diluted share, related to the recognition of legal contingency accruals.\n•\n$41 million pretax, or ($0.09) per diluted share, of charges related to plant closures and disposal charges.\n•\n$5 million pretax, or ($0.01) per diluted share, of production facilities fire costs incurred, net of insurance proceeds.\n•\n$3 million pretax, or ($0.01) per diluted share, of charges related to a production facility fire in the Netherlands and our subsequent decision to sell the facility.\nNine months – Fiscal 2024 – \nNet income attributable to Tyson included the following items:\n•\n$174 million pretax, or ($0.38) per diluted share, related to the recognition of legal contingency accruals.\n•\n$155 million pretax, or ($0.31) per diluted share, of charges related to plant closures and disposal charges.\n31\n•\n$83 million pretax, or ($0.23) per diluted share, of charges related to a production facility fire in the Netherlands and our subsequent decision to sell the facility.\n•\n$31 million pretax, or ($0.06) per diluted share, of restructuring and related charges.\n•\n$22 million pretax, or $0.05 per diluted share, of production facilities fire insurance proceeds, net of costs incurred.\nSegment Results\nWe operate in four segments: Beef, Pork, Chicken, and Prepared Foods. The following table is a summary of sales and operating income (loss), which is how we measure segment profit.\nin millions\nSales\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nJune 28, 2025\nJune 29, 2024\nBeef\n$\n5,603 \n$\n5,241 \n$\n16,134 \n$\n15,218 \nPork\n1,506 \n1,462 \n4,367 \n4,465 \nChicken\n4,220 \n4,076 \n12,426 \n12,174 \nPrepared Foods\n2,515 \n2,432 \n7,384 \n7,379 \nInternational/Other\n557 \n582 \n1,707 \n1,744 \nIntersegment sales\n(517)\n(440)\n(1,437)\n(1,236)\nTotal\n$\n13,884 \n$\n13,353 \n$\n40,581 \n$\n39,744 \nin millions\nOperating Income (Loss)\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nJune 28, 2025\nJune 29, 2024\nBeef\n(a)\n$\n(494)\n$\n(69)\n$\n(816)\n$\n(310)\nPork\n(b)\n36 \n(62)\n(100)\n(24)\nChicken\n(c)\n367 \n244 \n980 \n579 \nPrepared Foods\n(d)\n302 \n203 \n755 \n676 \nInternational/Other\n(e)\n49 \n25 \n121 \n(37)\nTotal\n$\n260 \n$\n341 \n$\n940 \n$\n884 \n(a) Beef segment results for the three and nine months ended June 28, 2025 included $343 million of goodwill impairment charges. Additionally, Beef segment results for the nine months ended June 28, 2025 included a $93 million legal contingency accrual and $48 million of network optimization plan charges. Beef segment results for the nine months ended June 29, 2024 included a $45 million legal contingency accrual and $41 million of plant closures and disposal charges.\n(b) Pork segment results for the nine months ended June 28, 2025 included a $250 million legal contingency accrual. Pork segment results for the three and nine months ended June 29, 2024 included $39 million and $73 million, respectively, of plant closures and disposal charges. Additionally, Pork segment results for the three and nine months ended June 29, 2024 included $45 million and $73 million, respectively, related to the recognition of legal contingency accruals.\n(c) Chicken segment results for the three and nine months ended June 28, 2025 included $5 million and $17 million, respectively, of brand discontinuation charges and network optimization plan income, net of charges, of $27 million, and network optimization plan net charges of $5 million, respectively. Chicken segment results for the nine months ended June 28, 2025 included $23 million of plant closures and disposal charges. Chicken segment results for the three and nine months ended June 29, 2024 included $2 million and $41 million, respectively, of plant closures and disposal charges and $5 million of production facility fire costs incurred, net of insurance proceeds, and $19 million of insurance proceeds, net of costs incurred, respectively. Chicken segment results for the three and nine months ended June 29, 2024 also included a $56 million legal contingency accrual.\n(d) Prepared Foods segment results for the three and nine months ended June 28, 2025 included a gain, net of charges, of $56 million and $31 million, respectively, related to the network optimization plan. Prepared Foods segment results for the nine months ended June 29, 2024 included $24 million of restructuring and related charges.\n(e) International/Other results for the three and nine months ended June 28, 2025 included benefits of $14 million of insurance proceeds, net of costs, related to a fire at a production facility in the Netherlands and our subsequent decision to sell the facility and $6 million related to the relocation of a production facility in China. International/Other results for the nine months ended June 28, 2025 included $11 million of network optimization plan charges. International/Other results for the three and nine months ended June 29, 2024 included $3 million and $83 million, respectively, of costs, net of insurance proceeds, related to a fire at our production facility in the Netherlands and subsequent decision to sell.\n32\nBeef Segment Results\nin millions\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nChange\nJune 28, 2025\nJune 29, 2024\nChange\nSales\n$\n5,603 \n$\n5,241 \n$\n362 \n$\n16,134 \n$\n15,218 \n$\n916 \nSales volume change\n(3.1)\n%\n0.3 \n%\nAverage sales price change\n10.0 \n%\n6.3 \n%\nOperating income (loss)\n$\n(494)\n$\n(69)\n$\n(425)\n$\n(816)\n$\n(310)\n$\n(506)\nOperating margin\n(8.8)\n%\n(1.3)\n%\n(5.1)\n%\n(2.0)\n%\nThird quarter and nine months – Fiscal 2025 vs Fiscal 2024 \n•\nSales Volume \n-\n \nSales volume decreased in the third quarter of fiscal 2025 primarily due to lower head harvested, partially offset by higher average carcass weights. Sales volume for the first nine months were relatively flat as higher average carcass weights were offset by lower head harvested. \n•\nAverage Sales Price\n - Average sales price increased in the third quarter and first nine months of fiscal 2025 primarily due to increased input costs and strong demand. The change in average sales price for the first nine months of fiscal 2025 excludes a $93 million reduction of Sales from the recognition of a legal contingency accrual recorded in the second quarter of fiscal 2025.\n•\nOperating Income (Loss)\n - Operating loss increased in the third quarter and first nine months of fiscal 2025 due to compressed Beef margins and the recognition of a goodwill impairment charge, partially offset by improved operational execution. Additionally, the operating loss increase for the first nine months of fiscal 2025 was impacted by the recognition of a legal contingency accrual and network optimization plan charges in fiscal 2025, partially offset by lapping the impacts of plant closures and disposal charges recorded in the first nine months of fiscal 2024. \nPork Segment Results\nin millions\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nChange\nJune 28, 2025\nJune 29, 2024\nChange\nSales\n$\n1,506 \n$\n1,462 \n$\n44 \n$\n4,367 \n$\n4,465 \n$\n(98)\nSales volume change\n1.5 \n%\n(1.0)\n%\nAverage sales price change\n(1.6)\n%\n3.4 \n%\nOperating income (loss)\n$\n36 \n$\n(62)\n$\n98 \n$\n(100)\n$\n(24)\n$\n(76)\nOperating margin\n2.4 \n%\n(4.2)\n%\n(2.3)\n%\n(0.5)\n%\nThird quarter and nine months – Fiscal 2025 vs Fiscal 2024\n•\nSales Volume \n- Sales volume increased in the third quarter of fiscal 2025 due to a sell-through of inventory. Sales volume decreased in the first nine months of fiscal 2025 due to production decreases associated with a plant closure in 2024 which were partly offset by production increases at other facilities and higher average carcass weights.\n•\nAverage Sales Price\n - Average sales price decreased in the third quarter of fiscal 2025 primarily driven by changes in mix. Average sales price increased in first nine months of fiscal 2025 due to increased input costs and strong demand for our pork products. The change in average sales price for the nine months ended excludes a $250 million reduction of Sales from the recognition of a legal contingency accrual recorded in the second quarter of fiscal 2025. The change in average sales price for both the three months ended and nine months ended excludes a $45 million reduction of Sales from the recognition of a legal contingency accrual recorded in the second quarter of fiscal 2024. \n•\nOperating Income (Loss)\n - Operating income increased in the third quarter of fiscal 2025 due to lower operating costs, improved results in our live hog operations and lapping the impacts of a legal contingency accrual and plant closures and disposal charges recorded in the third quarter of fiscal 2024, partially offset by compressed pork margins. Operating loss increased in first nine months of fiscal 2025 due to compressed pork margins and the recognition of a legal contingency accrual, partially offset by lower operating costs, improved results in our live hog operations and lapping the impacts of plant closures and disposal charges recorded in the first nine months of fiscal 2024. \n33\nChicken Segment Results\nin millions\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nChange\nJune 28, 2025\nJune 29, 2024\nChange\nSales\n$\n4,220 \n$\n4,076 \n$\n144 \n$\n12,426 \n$\n12,174 \n$\n252 \nSales volume change\n2.4 \n%\n2.3 \n%\nAverage sales price change\n1.1 \n%\n(0.2)\n%\nOperating income\n$\n367 \n$\n244 \n$\n123 \n$\n980 \n$\n579 \n$\n401 \nOperating margin\n8.7 \n%\n6.0 \n%\n7.9 \n%\n4.8 \n%\nThird quarter and nine months – Fiscal 2025 vs Fiscal 2024 \n•\nSales Volume\n - Sales volume increased in the third quarter and first nine months of fiscal 2025 primarily due to increased domestic production.\n•\nAverage Sales Price\n - Average sales price increased in the third quarter due to mix and strong demand. Average sales price remained relatively flat in the first nine months of fiscal 2025 as the impact of lower input costs was offset by strong demand.\n•\nOperating Income\n - Operating income increased in the third quarter and first nine months of fiscal 2025 driven by operational execution, improved volumes and $20 million and $285 million of net decreases in feed ingredient costs, respectively, which was partially offset by increased marketing, advertising and promotion expenses. Additionally, operating income in the third quarter was impacted by reduced legal contingency accruals and net gains recognized from the network optimization plan, which included a gain from the sale of storage facilities net of other plan charges. The operating income increase in the first nine months of fiscal 2025 was also impacted by reduced legal contingency accruals and lower plant closures and disposal charges, partially offset by brand discontinuation charges, network optimization plan charges and lapping of insurance proceeds related to a production facility fire.\nPrepared Foods Segment Results\nin millions\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nChange\nJune 28, 2025\nJune 29, 2024\nChange\nSales\n$\n2,515 \n$\n2,432 \n$\n83 \n$\n7,384 \n$\n7,379 \n$\n5 \nSales volume change\n(2.3)\n%\n(2.7)\n%\nAverage sales price change\n5.7 \n%\n2.8 \n%\nOperating income\n$\n302 \n$\n203 \n$\n99 \n$\n755 \n$\n676 \n$\n79 \nOperating margin\n12.0 \n%\n8.3 \n%\n10.2 \n%\n9.2 \n%\nThird quarter and nine months – Fiscal 2025 vs Fiscal 2024 \n•\nSales Volume\n – Sales volume decreased in the third quarter and first nine months of fiscal 2025 due to a challenging consumer environment.\n•\nAverage Sales Price\n – Average sales price increased in the third quarter and first nine months of 2025 primarily due to the pass through of increased raw material costs. \n•\nOperating Income\n – Operating income increased in the third quarter and first nine months of fiscal 2025 primarily due to higher average sales price and improved operational execution, partly offset by increased raw material costs. Additionally, operating income increased in the first nine months of fiscal 2025 due to lower freight costs, selling, general and administrative costs and restructuring and related charges. For the third quarter and first nine months of fiscal 2025, operating income also benefited from net gains recognized from the network optimization plan, which included a gain from the sale of storage facilities net of other plan charges.\nInternational/Other Results\nin millions\nThree Months Ended\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nChange\nJune 28, 2025\nJune 29, 2024\nChange\nSales\n$\n557 \n$\n582 \n$\n(25)\n$\n1,707 \n$\n1,744 \n$\n(37)\nOperating income (loss)\n49 \n25 \n24 \n121 \n(37)\n158 \n34\nThird quarter and nine months – Fiscal 2025 vs Fiscal 2024 \n•\nSales \n– Sales for the third quarter and first nine months of fiscal 2025 decreased primarily due to lower average sales price.\n•\nOperating Income (Loss)\n – Operating income increased in the third quarter and first nine months of fiscal 2025 primarily due to improved performance, insurance proceeds and lapping the charges related to a production facility fire in the first quarter of fiscal 2024 and the subsequent decision to sell the facility and remuneration received related to the relocation of a production facility in China.\nLIQUIDITY AND CAPITAL RESOURCES\nOur cash needs for working capital, capital expenditures, growth opportunities, repurchases of senior notes, repayment of maturing debt, the payment of dividends and share repurchases are expected to be met with current cash on hand, cash flows provided by operating activities or short-term borrowings. Based on our current expectations, we believe our liquidity and capital resources will be sufficient to operate our business. However, we may take advantage of opportunities to generate additional liquidity or refinance existing debt through capital market transactions. The amount, nature and timing of any capital market transactions will depend on our operating performance and other circumstances; our then-current commitments and obligations; the amount, nature and timing of our capital requirements; any limitations imposed by our current credit arrangements; and overall market conditions.\nCash Flows from Operating Activities\nin millions\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nNet income\n$\n449 \n$\n458 \nNon-cash items in net income\n1,362 \n1,250 \nNet changes in operating assets and liabilities:\n(Increase) decrease in accounts receivable\n(48)\n73 \n(Increase) decrease in inventories\n(194)\n249 \nIncrease (decrease) in accounts payable\n(5)\n(252)\nIncrease (decrease) in income taxes payable/receivable\n69 \n(20)\nNet changes in other operating assets and liabilities\n(13)\n215 \nNet cash provided by operating activities\n$\n1,620 \n$\n1,973 \n•\nNon-cash items in net income primarily included depreciation and amortization of $1,029 million and $1,082 million for the nine months ended June 28, 2025 and June 29, 2024, respectively, and a $343 million goodwill impairment in the first nine months of fiscal 2025.\n•\nCash provided by operating activities for the first nine months of fiscal 2025 was $1,620 million, a decrease of $353 million compared to the first nine months of fiscal 2024, as the $103 million of higher earnings, net of non-cash items, was more than offset by a $456 million decrease in cash provided by the net changes in operating assets and liabilities which was primarily impacted by:\n•\nA decrease of $443 million due to an increase in inventory of $194 million in the first nine months of fiscal 2025, compared to a decrease of $249 million in the first nine months of fiscal 2024, primarily due to increased average cost of inventory and higher volume of livestock.\n•\nA decrease of $228 million due to a decrease in the net changes in other operating assets and liabilities of $13 million in the first nine months of fiscal 2025, compared to an increase of $215 million in the first nine months of 2024, primarily due to performance-based compensation. \n•\nA decrease of $121 million due to an increase in accounts receivable of $48 million in the first nine months of fiscal 2025, compared to a decrease of $73 million in the first nine months of fiscal 2024 as days sales outstanding decreased more during the first nine months of fiscal 2024 than the first nine months of fiscal 2025.\n•\nPartially offset by:\n•\nAn increase of $247 million due to a decrease in accounts payable of $5 million during the first nine months of fiscal 2025, compared to a decrease of $252 million in the first nine months of fiscal 2024, primarily due to a reduction in accounts payable in fiscal 2024 associated with lower input costs.\n35\nCash Flows from Investing Activities\nin millions\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nAdditions to property, plant and equipment\n$\n(691)\n$\n(884)\nProceeds from sale of (purchases of) marketable securities, net\n(3)\n(2)\nProceeds from sale of storage facilities\n252 \n— \nAcquisition of equity investments\n(5)\n(28)\nOther, net\n42 \n60 \nNet cash used for investing activities\n$\n(405)\n$\n(854)\n•\nAdditions to property, plant and equipment included spending for production growth, safety and animal well-being, new equipment, infrastructure replacements and upgrades to maintain competitive standing and position us for future opportunities. \n•\nWe expect capital expenditures at or below $1 billion for fiscal 2025. Capital expenditures include investments in profit improvement projects as well as projects for maintenance and repair. This includes completion of capacity expansion projects as well as new equipment, automation technology and processes for product innovation.\n•\nProceeds from sale of storage facilities for the nine months ended June 28, 2025 related to the sale of multiple Tyson-owned and operated cold storage facilities. \nCash Flows from Financing Activities\nin millions\nNine Months Ended\nJune 28, 2025\nJune 29, 2024\nProceeds from issuance of debt\n$\n63 \n$\n2,391 \nPayments on debt\n(876)\n(347)\nProceeds from issuance of commercial paper\n— \n1,649 \nRepayments of commercial paper\n— \n(2,240)\nPurchases of Tyson Class A common stock\n(42)\n(44)\nDividends\n(524)\n(513)\nStock options exercised\n20 \n9 \nOther, net\n(18)\n(22)\nNet cash (used for) provided by financing activities\n$\n(1,377)\n$\n883 \n•\nDuring the first nine months of fiscal 2024, proceeds from issuance of debt included $750 million of proceeds from the term loan facility due May 2028, $600 million of proceeds from the 5.40% 2029 Notes and $900 million from the 5.70% 2034 Notes.\n•\nPayments on debt during the nine months ended June 28, 2025 and June 29, 2024 included payments of $750 million and $250 million, respectively, on our term loan due May 2026.\n•\nDividends paid during the nine months ended June 28, 2025 reflected a 2% increase to our fiscal 2024 quarterly dividend rate. \nLiquidity\nin millions\nCommitments\nExpiration Date\nFacility\nAmount\nOutstanding\nLetters of Credit\n(no draw downs)\nAmount\nBorrowed\nAmount\nAvailable at \nJune 28, 2025\nCash and cash equivalents\n$\n1,547 \nShort-term investments\n1 \nRevolving credit facility\nApril 2030\n$\n2,500 \n— \n— \n2,500 \nCommercial paper\n— \nTotal liquidity\n$\n4,048 \n•\nLiquidity includes cash and cash equivalents, short-term investments and availability under our revolving credit, less the outstanding commercial paper balance.\n•\nAt June 28, 2025, we had current debt of $886 million, which we intend to pay with our existing cash balance, cash generated from our operating activities and other existing or new liquidity sources.\n•\nThe revolving credit facility supports our short-term funding needs and also serves to backstop our commercial paper program. We had no borrowings under the revolving credit facility during the nine months ended June 28, 2025. \n36\n•\nOn April 15, 2025, we terminated our previous revolving credit facility with a maturity date of September 2026 and entered into a new $2.5 billion revolving credit facility. The new revolving credit facility will mature, and the commitments thereunder will terminate, in April 2030 with options for two one-year extensions. Under the terms of this revolving credit facility, we have the option to establish incremental commitment increases of up to an aggregate amount of $500 million if certain conditions are met. The covenants and other terms of the new facility are generally consistent with those of the terminated facility.\n•\nWe expect net interest expense to approximate $375 million for fiscal 2025.\n•\nOur current ratio was 1.7 to 1 at June 28, 2025 and 2.0 to 1 at September 28, 2024. The decrease in fiscal 2025 is primarily due to increased current debt.\n•\nAt June 28, 2025, $691 million of our cash was held in the accounts of our foreign subsidiaries. Generally, we do not rely on the foreign cash as a source of funds to support our ongoing domestic liquidity needs. We manage our worldwide cash requirements by reviewing available funds among our foreign subsidiaries and the cost effectiveness with which those funds can be accessed. We intend to repatriate excess cash (net of applicable withholding taxes) not subject to regulatory requirements and to indefinitely reinvest outside of the United States the remainder of cash held by foreign subsidiaries. We do not expect the regulatory restrictions or taxes on repatriation to have a material effect on our overall liquidity, financial condition or the results of operations for the foreseeable future.\nCapital Resources\nCredit Facility\nCash flows from operating activities and cash on hand are our primary sources of liquidity for funding debt service, capital expenditures, dividends and share repurchases. We also have a revolving credit facility, with a committed capacity of $2.5 billion, to provide additional liquidity for working capital needs and to backstop our commercial paper program. \nAt June 28, 2025, amounts available for borrowing under our revolving credit facility totaled $2.5 billion. Our revolving credit facility is funded by a syndicate of 17 banks, with commitments ranging from $50 million to $225 million per bank.\nCommercial Paper Program\nOur commercial paper program provides a low-cost source of borrowing to fund general corporate purposes including working capital requirements. The maximum borrowing capacity under the commercial paper program is $1.75 billion, which increased in April 2025 in conjunction with the execution of the new revolving credit facility. The maturities of the notes may vary, but may not exceed 397 days from the date of issuance. As of June 28, 2025, we had no commercial paper outstanding under this program. Our ability to access commercial paper in the future may be limited or its costs increased. \nCredit Ratings\nTerm Loan Facility due May 2028\nStandard & Poor’s Rating Services’, a Standard & Poor’s Financial Services LLC business (“S&P”), applicable rating is “BBB”. Moody’s Investor Service, Inc.’s (“Moody’s”) applicable rating is “Baa2”. The below table outlines the commitment fee on any unused borrowing capacity and the borrowing spread on the outstanding principal balance of our term loan facility due May 2028 that corresponds to the applicable ratings levels from S&P and Moody’s.\nRatings Level (Moody’s/S&P)\nCommitment Fee\nBorrowing Spread\nBaal/BBB+ or above\n0.100 \n%\n1.625 \n%\nBaa2/BBB (current level)\n0.125 \n%\n1.750 \n%\nBaa3/BBB- or lower\n0.175 \n%\n1.875 \n%\nRevolving Credit Facility\nThe below table outlines the fees paid on the unused portion of the facility (“Facility Fee Rate\n”\n) and letter of credit fees and borrowings (“Borrowing Spread\n”\n) that corresponds to the applicable ratings levels from S&P and Moody’s. S&P's applicable rating is “BBB” and Moody’s applicable rating is “Baa2”.\nRatings Level (Moody’s/S&P)\nFacility Fee Rate\nBorrowing Spread\nA3/A- or above\n0.090 \n%\n0.785 \n%\nBaal/BBB+\n0.100 \n%\n0.900 \n%\nBaa2/BBB (current level)\n0.110 \n%\n1.015 \n%\nBaa3/BBB-\n0.150 \n%\n1.100 \n%\nBa1/BB+ or lower\n0.200 \n%\n1.175 \n%\n37\nIn the event the rating levels fall within different levels, the applicable rate will be based upon the higher of the two Levels or, if there is more than a one-notch split between the two Levels, then the Applicable Rate will be based upon the Level that is one Level below the higher Level.\nDebt Covenants\nOur revolving credit and term loan facilities contain affirmative and negative covenants that, among other things, may limit or restrict our ability to: create liens and encumbrances; incur debt; merge, dissolve, liquidate or consolidate; make acquisitions and investments; dispose of or transfer assets; change the nature of our business; engage in certain transactions with affiliates; and enter into hedging transactions, in each case, subject to certain qualifications and exceptions. In addition, we are required to maintain a minimum interest expense coverage ratio. \nOur senior notes also contain affirmative and negative covenants that, among other things, may limit or restrict our ability to: create liens; engage in certain sale/leaseback transactions; and engage in certain consolidations, mergers and sales of assets. \nWe were in compliance with all debt covenants at June 28, 2025, and we expect that we will maintain compliance.\nRECENTLY ISSUED/ADOPTED ACCOUNTING PRONOUNCEMENTS\nRefer to the discussion of recently issued/adopted accounting pronouncements under Part I, Item 1, Notes to Consolidated Condensed Financial Statements, Note 1: Accounting Policies.\nCRITICAL ACCOUNTING ESTIMATES\nWe consider accounting policies related to: contingent liabilities; revenue recognition; accrued self-insurance; defined benefit pension plans; impairment of long-lived assets and definite life intangibles; impairment of goodwill and indefinite life intangible assets; business combinations; and income taxes to be critical accounting estimates. These policies are summarized in Management’s Discussion and Analysis of Financial Condition and Results of Operations in our Annual Report on Form 10-K for the fiscal year ended September 28, 2024. Refer to Part I, Item 1, Notes to Consolidated Condensed Financial Statements, Note 1: Accounting Policies, for updates to our significant accounting policies during the nine months ended June 28, 2025. These critical accounting policies require us to make estimates and assumptions that affect the amounts reported in the consolidated condensed financial statements and accompanying notes.\nWe consider reporting units and indefinite life intangible assets that have 20% or less excess fair value over carrying amount to have a heightened risk of impairment. During fiscal 2024, we determined the following reporting units and indefinite life intangible asset were considered at heightened risk of impairment: our Chicken segment reporting units and our Beef reporting unit with goodwill totaling $3.0 billion and $0.3 billion, respectively, and one Prepared Foods brand with a carrying value of $0.5 billion, with our Beef reporting unit having less than 10% of excess fair value above carrying value.\nAs further described in the impairment of goodwill and indefinite life intangible assets critical accounting estimate included in our Annual Report on Form 10-K for the fiscal year ended September 28, 2024, we assess goodwill and indefinite life assets for impairment at least annually as of the first day of the fourth quarter and whenever events or changes in circumstances indicate that the carrying value may not be recoverable. Our qualitative assessment for the first and second quarters of fiscal 2025 did not indicate that it was more likely than not the fair value of any of our reporting units or indefinite life intangible assets was less than the carrying amount, and as such, no quantitative test was deemed necessary. During the third quarter of fiscal 2025, our Beef reporting unit experienced lower than anticipated supply of market-ready cattle and an increased carrying amount primarily associated with higher cattle costs. Additionally, our latest forecasts now indicate the timing of the recovery of market-ready cattle associated with the anticipated cattle herd rebuilding will be longer than previously estimated. Consequently, based on our qualitative assessment, we determined the fair value of our Beef reporting unit was more likely than not less than the carrying amount and proceeded to perform a quantitative assessment. Based on this quantitative assessment, we determined the fair value of our Beef reporting unit had decreased to below its carrying value. Accordingly, we recognized a $343 million impairment to fully impair its goodwill. Our qualitative assessments for the third quarter of fiscal 2025 for all of our other reporting units and indefinite life intangible assets did not indicate that it was more likely than not the fair value was less than the carrying amount, and as such, no quantitative test was deemed necessary. \nWe continuously evaluate the changing macro-economic conditions including inflationary pressures, rising interest rates, demand outlook and export markets as well as the Company's market capitalization. Our reporting units with heightened risk of future impairments with $3.0 billion carrying value, as well as a brand with $0.5 billion carrying value, all had less than 20% of excess fair value above carrying value as of the date of the most recent estimated fair value determination. Consequently, their estimated fair values remain highly sensitive to future discount rate increases, changing macro-economic conditions and achievement of projected long-term operating margins. Although our remaining reporting units and indefinite life intangible assets generally had more than 20% excess fair value over carrying amount as of the date of the most recent estimated fair value determination, they are also susceptible to impairments if any assumptions, estimates, or market factors significantly change in the future.\n38\nCAUTIONARY STATEMENTS RELEVANT TO FORWARD-LOOKING INFORMATION FOR THE PURPOSE OF “SAFE HARBOR” PROVISIONS OF THE PRIVATE SECURITIES LITIGATION REFORM ACT OF 1995\nCertain information in this report constitutes forward-looking statements. Such forward-looking statements include, but are not limited to, current views and estimates of our outlook for fiscal 2025, other future economic circumstances, industry conditions in domestic and international markets, our performance and financial results (e.g., debt levels, return on invested capital, value-added product growth, capital expenditures, tax rates, access to foreign markets and dividend policy). These forward-looking statements are subject to a number of factors and uncertainties that could cause our actual results and experiences to differ materially from anticipated results and expectations expressed in such forward-looking statements. We wish to caution readers not to place undue reliance on any forward-looking statements, which speak only as of the date made. We undertake no obligation to update any forward-looking statements, whether as a result of new information, future events or otherwise.\nAmong the factors that may cause actual results and experiences to differ from anticipated results and expectations expressed in such forward-looking statements are the following: (i) global pandemics have had, and may in the future have, an adverse impact on our business and operations; (ii) the effectiveness of restructuring or financial excellence programs; (iii) access to foreign markets together with foreign economic conditions, including currency fluctuations, import/export restrictions and foreign politics; (iv) cyber attacks, other cyber incidents, security breaches or other disruptions of our information technology systems; (v) risks associated with our failure to consummate favorable acquisition transactions or integrate certain acquisitions’ operations; (vi) the Tyson Limited Partnership’s ability to exercise significant control over the Company; (vii) fluctuations in the cost and availability of inputs and raw materials, such as live cattle, live swine, feed grains (including corn and soybean meal) and energy; (viii) market conditions for finished products, including competition from other global and domestic food processors, supply and pricing of competing products and alternative proteins and demand for alternative proteins; (ix) outbreak of a livestock disease (such as African swine fever (ASF), avian influenza (AI) or bovine spongiform encephalopathy (BSE)), which could have an adverse effect on livestock we own, the availability of livestock we purchase, consumer perception of certain protein products or our ability to conduct our operations; (x) changes in consumer preference and diets and our ability to identify and react to consumer trends; (xi) effectiveness of advertising and marketing programs; (xii) significant marketing plan changes by large customers or loss of one or more large customers; (xiii) our ability to leverage brand value propositions; (xiv) changes in availability and relative costs of labor and contract farmers and our ability to maintain good relationships with team members, labor unions, contract farmers and independent producers providing us livestock, including as a result of our relocation of certain corporate team members to our world headquarters in Springdale, Arkansas; (xv) issues related to food safety, including costs resulting from product recalls, regulatory compliance and any related claims or litigation; (xvi) the effect of climate change and any legal or regulatory response thereto; (xvii) compliance with and changes to regulations and laws (both domestic and foreign), including changes in accounting standards, tax laws, environmental laws, agricultural laws and occupational, health and safety laws; (xviii) adverse results from litigation; (xix) risks associated with leverage, including cost increases due to rising interest rates or changes in debt ratings or outlook; (xx) impairment in the carrying value of our goodwill or indefinite life intangible assets; (xxi) our participation in a multiemployer pension plan; (xxii) volatility in capital markets or interest rates; (xxiii) risks associated with our commodity purchasing activities; (xxiv) the effect of, or changes in, general economic conditions; (xxv) impacts on our operations caused by factors and forces beyond our control, such as natural disasters, fire, bioterrorism, pandemics, armed conflicts or extreme weather; (xxvi) failure to maximize or assert our intellectual property rights; (xxvii) effects related to changes in tax rates, valuation of deferred tax assets and liabilities, or tax laws and their interpretation; and (xxviii) those factors discussed within Item 1, Item 1A and Item 7 of our Annual Report on Form 10-K for the year ended September 28, 2024 and our other periodic filings with the SEC."
}