{
  "source_file": "tt-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\n      \nBUSINESS\nOverview\nTrane Technologies plc, a public limited company, incorporated in Ireland in 2009, and its consolidated subsidiaries (collectively we, us, our, the Company) is a global climate innovator. We bring sustainable and efficient solutions to buildings, homes and transportation through our strategic brands, Trane\n®\n and Thermo King\n®\n, and our environmentally responsible portfolio of products, services and connected intelligent controls. We generate revenue and cash primarily through the design, manufacture, sales and service of solutions for Heating, Ventilation and Air Conditioning (HVAC), transport refrigeration, and custom refrigeration solutions. As an industry leader with an extensive global install base, our growth strategy includes expanding recurring revenue through services and rental options. Our unique business operating system, uplifting culture and highly engaged team around the world are also central to our earnings and cash flow growth.\nThrough our sustainability-focused strategy and purpose to \nboldly challenge what's possible for a sustainable world\n, we meet critical needs and growing global demand for innovation that reduces greenhouse gas emissions while enabling healthier, efficient indoor environments and safe, reliable delivery of essential temperature-controlled cargo. We have announced certain defined sustainability commitments with a goal of achieving these commitments by 2030 (2030 Sustainability Commitments). Trane Technologies' 2030 Sustainability Commitments include our 'Gigaton Challenge' to reduce customer greenhouse gas emissions by a billion metric tons; 'Leading by Example' through reducing embodied carbon by 40%, and designing products for circularity; and creating 'Opportunity for All' by investing in our people and our communities.\nReportable Segments\nWe operate under three reportable segments.\n•\nOur Americas segment innovates for customers in North America and Latin America. The Americas segment encompasses commercial heating, cooling and ventilation systems, building controls and solutions, and energy services and solutions; residential heating and cooling; and transport refrigeration systems and solutions. This segment had 2024 net revenues of $15,903.2 million.\n•\nOur EMEA segment innovates for customers in the Europe, Middle East and Africa region. The EMEA segment encompasses heating, cooling and ventilation systems, services and solutions for commercial buildings and transport refrigeration systems and solutions. This segment had 2024 net revenues of $2,556.7 million.\n•\nOur Asia Pacific segment innovates for customers throughout the Asia Pacific region. The Asia Pacific segment encompasses heating, cooling and ventilation systems, services and solutions for commercial buildings and transport refrigeration systems and solutions. This segment had 2024 net revenues of $1,378.3 million.\n4\nTable of Contents\nProducts and Services\nOur principal products and services include the following:\nAir conditioners\n  \nIndustrial process refrigeration\nAir exchangers\nInstallation contracting\nAir handlers\nLighting retrofit solutions\nAirside and terminal devices\nMedical grade refrigeration solutions\nAir-sourced heat pumps\nMulti-pipe HVAC systems\nAsset management systems\nPackage heating and cooling systems\nAuxiliary power units (electric and diesel)\nPackaged rooftop units\nBuilding management systems\nParts and supplies (aftermarket and OEM)\nBus air purification systems\nRail refrigeration systems\nBus and rail HVAC systems\nRate chambers\nChillers\nRefrigerant reclamation\nCoils and condensers\nRenewable energy and storage projects\nCold storage units\nRepair and maintenance services\nCondensing units\nRental services\nContainer refrigeration systems and gensets\nResidential air filters\nControl systems\n  \nResidential air filtration system\nControls contracting and commissioning\nResidential hybrid heating solutions\nCryogenic refrigeration systems\nSelf-powered truck refrigeration systems\nData center HVAC systems\nService agreements\nDecarbonization programs\n  \nSmart and AI-enabled services\nDehumidifiers\nTelematics solutions\nDuctless systems\nTemporary heating and cooling systems\nEnergy and water efficiency programs\nThermal energy storage\nEnergy infrastructure programs\n  \nThermostats/controls & associated digital solutions\nEnergy management services\nTrailer refrigeration systems (diesel, electric and hybrid)\nEnergy recovery ventilators\nTransport heater products\nEnergy storage (battery)\nTruck refrigeration systems (diesel, electric and hybrid)\nFurnaces\nUltra-low temperature freezers\nGeothermal systems\n  \nUnitary systems (light and large)\nHome automation\nVariable refrigerant flow systems\nHumidifiers\nVehicle-powered truck refrigeration systems\nHVAC Performance-monitoring applications\nVentilation\nIndoor air quality assessments and related products for HVAC and Transport solutions\nWater source heat pumps\nThese products are sold primarily under our tradenames including Trane\n®\n and Thermo King\n®\n.\nCompetitive Conditions\nOur products and services are sold in highly competitive markets throughout the world. Due to the diversity of these products and services and the variety of markets served, we encounter a wide variety of competitors that vary by product line and services. They include well-established regional or specialized competitors, as well as larger U.S. and non-U.S. corporations or divisions of larger companies.\nThe principal methods of competition in these markets relate to price, quality, delivery, service and support, technology and innovation. We are one of the leading manufacturers in the world of HVAC systems and services and transport temperature control products and services.\n5\nTable of Contents\nDistribution\nOur products are distributed by a number of methods, which we believe are appropriate to the type of product. U.S. sales are made through branch sales offices, distributors and dealers across the country. Non-U.S. sales are made through numerous subsidiary sales and service companies with a supporting chain of distributors throughout the world.\nOperations by Geographic Area\nApproximately 26% of our net revenues in 2024 were derived outside the U.S. and we sold products in approximately 100 countries. Therefore, the attendant risks of manufacturing or selling in a particular country, such as currency devaluation, nationalization and establishment of common markets, may have an adverse impact on our non-U.S. operations.\nCustomers\nWe have no customer that accounted for more than 10% of our consolidated net revenues in 2024, 2023 or 2022. No material part of our business is dependent upon a single customer or a small group of customers; therefore, the loss of any one customer would not have a material adverse effect on our results of operations or cash flows.\nMaterials\nWe both manufacture and procure many of the components included in our products.  For components we manufacture, we are required to source a wide variety of commodities such as steel, copper, and aluminum. These principal commodities are purchased from a large number of independent sources around the world, primarily within the region where the products are manufactured. We believe that available sources of supply will generally be sufficient for the foreseeable future.\nFor many components we procure, we have an effective supply chain resiliency plan and multiple capable sources to ensure sufficient supply, however there are certain categories of components that could occasionally see limited availability or shortages.\nSeasonality\nDemand for certain products and services is influenced by weather conditions. For instance, sales in our commercial and residential HVAC businesses historically tend to be higher in the second and third quarters of the year because this represents spring and summer in the U.S. and other northern hemisphere markets, which are the peak seasons for sales of air conditioning systems and services. Therefore, results of any quarterly period may not be indicative of expected results for a full year and unusual weather patterns or events could positively or negatively affect certain segments of our business and impact overall results of operations.\nResearch and Development\nWe engage in research and development activities in an effort to introduce new products, enhance existing product effectiveness, improve ease of use and reliability as well as expand the various applications for which our products may be appropriate. In 2024, we spent $309.6 million on research and development, focused on product and system sustainability improvements such as increasing energy efficiency, developing products that allow for use of lower global warming potential refrigerants, reducing material content in products, and designing products for circularity. New product development (NPD) programs complete a Design for Sustainability module within our NPD process to ensure that programs consider environmental impact.\nWe also have a strong focus on sustaining activities, which include costs incurred to reduce production costs, improve existing products, create custom solutions for customers and provide support to our manufacturing facilities. We anticipate that we will continue to make significant expenditures for research and development and sustaining activities to maintain and improve our competitive position.\nPatents and Licenses\nOur intellectual property rights are important to our business and include numerous patents, trademarks, copyrights, trade secrets, proprietary technology, technical data, business processes, and other confidential information. Although in aggregate the Company's intellectual property is important to its operations, the Company does not consider any single patent, trademark, copyright, trade secret, proprietary technology, technical data, business process or any other confidential information (or any related group of any such items) to be of material importance to any segment or to the business as a whole. From time to time the Company engages in litigation to protect its intellectual property rights. For a discussion of risks related to the Company's intellectual property, refer to \"Item 1A. Risk Factors.\"\n6\nTable of Contents\nBacklog\nOur backlog of orders, believed to be firm, at December 31, was as follows:\nIn millions\n2024\n2023\nAmericas\n$\n5,323.1 \n$\n5,302.9 \nEMEA\n585.3 \n614.9 \nAsia Pacific\n839.3 \n1,012.7 \nTotal\n$\n6,747.7 \n$\n6,930.5 \nThese backlog figures are based on orders received and only include amounts associated with our equipment and contracting and installation performance obligations. A major portion of our residential products are built in advance of order and either shipped or assembled from stock. We expect to ship a majority of the December 31, 2024 backlog during 2025. However, orders for specialized equipment or specific customer applications are submitted with extended lead times and are subject to revision and deferral, and to a lesser extent cancellation or termination. To the extent projects are delayed or there are resource constraints, the timing of our revenue could be affected.\nEnvironmental Matters\nWe continue to be dedicated to environmental and sustainability programs to minimize the use of natural resources, reduce the utilization and generation of hazardous materials from our manufacturing processes and to remediate identified environmental concerns. As to the latter, we are currently engaged in site investigations and remediation activities to address environmental cleanup from past operations at current and former manufacturing facilities.\nIt is our policy to establish environmental reserves for investigation and remediation activities when it is probable that a liability has been incurred and a reasonable estimate of the liability can be made. Estimated liabilities are determined based upon existing remediation laws and technologies. Inherent uncertainties exist in such evaluations due to unknown environmental conditions, changes in government laws and regulations, and changes in cleanup technologies. The environmental reserves are updated on a routine basis as remediation efforts progress and new information becomes available.\nWe are sometimes a party to environmental lawsuits and claims and have received notices of potential violations of environmental laws and regulations from the Environmental Protection Agency and similar state and international authorities. We have also been identified as a potentially responsible party (PRP) for cleanup costs associated with off-site waste disposal at federal Superfund and state remediation sites. In most instances at multi-party sites, our share of the liability is not material.\nIn estimating our liability at multi-party sites, we have assumed that we will not bear the entire cost of remediation of any site to the exclusion of other PRPs who may be jointly and severally liable. The ability of other PRPs to participate has been taken into account, based on our understanding of the parties' financial condition and probable contributions on a site-by-site basis.\nFor a further discussion of our potential environmental liabilities, see Note 20 \"Commitments and Contingencies\" to the Consolidated Financial Statements.\nAsbestos-Related Matters\nWe are involved in a number of asbestos-related lawsuits, claims and legal proceedings. In June 2020, our indirect wholly-owned subsidiaries Aldrich Pump LLC (Aldrich) and Murray Boiler LLC (Murray) each filed a voluntary petition for reorganization under Chapter 11 of Title 11 of the United States Code (the Bankruptcy Code) in the United States Bankruptcy Court for the Western District of North Carolina in Charlotte (the Bankruptcy Court). As a result of the Chapter 11 filings, all asbestos-related lawsuits against Aldrich and Murray have been stayed due to the imposition of a statutory automatic stay applicable in Chapter 11 bankruptcy cases. Only Aldrich and Murray have filed for Chapter 11 relief. Neither Aldrich's wholly-owned subsidiary, 200 Park, Inc. (200 Park), Murray's wholly-owned subsidiary, ClimateLabs LLC (ClimateLabs), Trane Technologies plc nor its other subsidiaries (the Trane Companies) are part of the Chapter 11 filings. In addition, at the request of Aldrich and Murray, the Bankruptcy Court has entered an order temporarily staying all asbestos-related claims against the Trane Companies that relate to claims against Aldrich or Murray (except for asbestos-related claims for which the exclusive remedy is provided under workers' compensation statutes or similar laws).\nThe goal of these Chapter 11 filings is to resolve equitably and permanently all current and future asbestos-related claims in a manner beneficial to claimants, Aldrich and Murray through court approval of a plan of reorganization that would create a trust pursuant to section 524(g) of the Bankruptcy Code, establish claims resolution procedures for all current and future asbestos-related claims against Aldrich and Murray and channel such claims to the trust for resolution in accordance with those procedures.\n7\nTable of Contents\nFor detailed information on the bankruptcy cases of Aldrich and Murray, see:\n•\nPart I, Item 1A, \"Risk Factors - Risks Related to Litigation,\"\n•\nPart I, Item 3, \"Legal Proceedings,\"\n•\nPart II, Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations - Significant Matters,\" and\n•\nPart II, Item 8, Consolidated Financial Statements and Note 20, \"Commitments and Contingencies.\"\nHuman Capital Management\nOur people and culture are critical to achieving our operational, financial and strategic success.\nAs of December 31, 2024, we employed approximately 45,000 people in 61 countries including over 16,000 employees outside of the United States. Our Trane Technologies EEO-1 Report published on our website outlines additional details on our U.S. workforce composition.\nOur continued focus on building an uplifting culture, where our employees can be at their best, has positively contributed to retaining employees at strong levels. The 2024 retention rate of our key talent, those with the highest potential rating, was 97.6%, excluding retirements. Our company‑wide (all employees) voluntary retention rate excluding retirements was 91.9%.\nCulture and Purpose\nIn 2024, we continued to drive our purpose to boldly challenge what's possible for a sustainable world with a sharp focus on our strategic priorities and 2030 Sustainability Commitments. As part of our commitment to people and culture, we strive to create a work environment where our people uplift each other, make a positive impact on the planet and thrive at work and at home. We do that through embedding our leadership principles across our people practices such as onboarding, learning and performance management. We also focus on ongoing manager development and the important role people leaders play in our uplifting, inclusive culture. \nOur annual employee engagement survey enables employees to share their experiences and perceptions of our Company. Employees provide ratings and written comments celebrating what we're doing well and recommending areas where we can do better. In 2024, 90% of our workforce participated in our annual engagement survey, and our overall employee engagement score remains high relative to external benchmarks. While our work on culture is never done, our scores indicate that we continue to raise the bar to increase pride, energy and optimism and help create the best employee experience as a destination employer.\nOpportunity for All\nWe are committed to creating Opportunity for All by uplifting our people and communities. We invest in our people and an inclusive culture where everyone can grow and thrive; and we give back in our communities to support the next generation of the workforce with the potential to transform our world. \nOur aspiration is a workforce that mirrors the communities where we live and work. This helps us to reach a broader talent pool, drive innovation and meet the needs of our global customer base. We work closely with external organizations to help us bridge the growing skilled labor gap, create a pipeline of highly skilled talent, and support industry career development. In 2024, we partnered with Opportunity at Work, a non-profit coalition dedicated to hiring skilled talent through alternative routes (STARs), which prioritizes skills and experience for workforce entry and removes the requirement of degrees where unnecessary. We also collaborate with organizations such as Federation for Advanced Manufacturing Education, National Association of Manufacturers, Society for Women Engineers, National Society of Black Engineers, and Society of Hispanic Professional Engineers, that help us recruit qualified talent from varied backgrounds.\nTo help promote inclusion and belonging in the workplace, we offer voluntary company forums such as:\n•\nCEO Day of Understanding – a forum created to allow our employees and leaders to speak about their personal experiences and commitment to fostering inclusion and belonging in the workplace.\n•\nEmployee Resource Groups (ERGs) – All ERGs are voluntary, open to all employees and offer a sense of belonging, networking and learning opportunities. Our ERGs also play an important role in our business through community involvement, brand advocacy, recruiting, and business and target market insights.\n•\nBeing at my Best – a change management program introduced in 2024, which contributes to building an inclusive and psychologically safe workplace.\n8\nTable of Contents\n•\nGlobal Diversity & Inclusion Summit – the 2024 Summit continued its focus on development of inclusive leader behaviors, and highlighted ERGs and learnings and reflections from leaders.\nOur corporate citizenship strategy, Sustainable Futures, focuses on expanding access to science, technology, engineering, and mathematics (STEM) education and career opportunities. This strategy supports our efforts to create opportunity for all by providing under-served communities and schools with a range of resources, from classroom curriculum that introduces them to careers at a climate innovation company, to soft-skill development for landing a STEM job.\nLearning and Development\nWe offer learning and career development opportunities that enhance our employees' skills and abilities and ensure contemporary technical and functional skills and competencies such as innovation, collaboration and leadership. Examples of these programs include:\n•\nTeam Leader Development Program – A seven-week experiential development program that engages, teaches and empowers hourly team leaders in our manufacturing facilities to apply continuous improvement methods, make sound business decisions, solve problems, and serve as a coach to their teams.\n•\nGroup Leader Development Program – A three-week cohort program for salaried, front-line leaders in our manufacturing facilities focuses on enhancing knowledge, skills and ability to lead front-line workers within a world class lean enterprise.\n•\nGraduate Training Program – A five-month development program designed to prepare university graduate engineers for a rewarding career in technical sales. The program prepares sales engineers to sell Trane's complex HVAC systems and energy services. The program, started in 1926, is recognized as the industry's most comprehensive training program and provides intensive technical, business, sales, and leadership training.\n•\nAccelerated Development Program – An early career rotational program focused on both functional and leadership development, designed to build a pipeline of strong talent for key roles in the organization. Participants rotate to multiple geographic locations and business units during the 2.5-year program, while completing diverse assignments, and receiving dedicated functional training and developmental experiences.\n•\nLeadership Development – We invest in custom, key transition leadership development programs for our high potential talent. We partner with best-in-class external leadership development experts such as INSEAD, Center for Creative Leadership, and the NeuroLeadership Institute to deliver programs such as our Executive Leadership Program, Leading for Impact, and our Women's Leadership Program globally each year. Additionally, we offer our Trane Technologies people leaders learning programs to develop their skills in leading their teams, such as building inclusive environments, increasing engagement, and coaching.\n•\nProfessional Development – We have numerous online courses in professional development skills as varied as working virtually, resiliency, and Microsoft Teams, as well as strategic capability initiatives such as product management and other programs that support our strategy of being a world class lean enterprise.\n•\nDependent Scholarships – To support learning in our employees' families, we offer $2,500 scholarships to support their dependent children's pursuits beyond high school, whether for a traditional degree or a trade certification.\n•\nCompliance Training – Our Compliance Training curriculum covers key topics that are important to protect our Company, our people and our customers. Topics include certification in our Code of Conduct, Information Security, Understanding and Preventing Workplace Harassment, and Expense Management. All salaried employees and service technicians globally complete our compliance curriculum annually, while hourly production employees complete Code of Conduct and Preventing Workplace Harassment training every other year.\n9\nTable of Contents\n•\nSustainability Learning – We offer sustainability learning that is available to everyone in the organization in our Learning Management System starting with the \nSustainability Starts with Us\n course that provides a foundational understanding of how our purpose connects to every role. In addition, a comprehensive learning path is available to all around understanding emissions including the following courses: \nThe Greenhouse Gas Effect, Carbon Intensity of the Electric Grid, \nand\n Carbon Neutrality in the Built Environment.\nEmployee Volunteerism\nIn 2024, Trane Technologies hosted a Global Time of Service when thousands of our team members banded together in a global show of commitment to community uplift. Teams around the world identified needs in their local communities and lent their time and resources to help more than 50 non-profit organizations enhance programs and create more opportunity. \nAdditionally, local philanthropic efforts take place throughout the year led by a network of approximately 50 \"Purple Teams\" around the world that fuel the spirit of volunteerism and ensure local alignment with our Sustainable Futures strategy. \nEmployee Well-being\nTrane Technologies believes employees that can thrive at work, at home and in their communities are our greatest strength. We integrate well-being into our culture through core global resources that support physical, social, emotional, and financial well-being. Several elements of our holistic well-being actions include:\n•\nGiving 100% of our team members access to company-sponsored wellness offerings, including a global Employee Assistance Program and a global wellness platform. These resources provide education and individual support covering an array of topics, including mental health, nutrition, fitness, dependent care, financial and retirement planning, and legal, among other topics.\n•\nOffering financial relief through the Helping Hand Fund, an employee-funded program created to help associates facing financial hardship immediately after a qualified disaster or an unforeseen personal hardship.\nWe recognize the pervasiveness of mental health challenges facing employees and their families. We continue efforts to overcome stigma and promote a culture that encourages and supports open discussion about mental health issues. We implemented a global mental health training program, offered in 10 languages, targeted towards people leaders and available to all employees. This program highlights how to recognize and react to mental health concerns and leverage support resources. To date more than 7,000 employees have voluntarily completed this training program.\nOur enterprise Mental Well-Being Hub is a global employee resource that provides access to self-help information, team member stories, trainings, and guidance for supporting others, all in one place.\nCompetitive Pay and Benefits\nTrane Technologies' compensation programs and policies are designed to align the compensation of our employees with the Company's performance and strategy, to attract and retain a talented workforce and to meet the needs of employees globally. We are committed to providing competitive and equitable wages and benefits that allow our employees to thrive at work and at home. In addition, the structure of our compensation programs balance incentive earnings for both long-term and short-term performance with our annual incentive plan closely tied to our financial goals as well as progress toward our 2030 Sustainability Commitments. We further align our leadership globally, fostering collaboration to drive profitable, market-leading revenue growth.\nTrane Technologies' benefit programs and policies are designed to support the well-being of employees and their families. Purpose-driven and locally relevant benefit programs are provided globally. In addition to core and competitive medical, welfare and retirement programs, we offer programs to support work-life balance and deliver benefits access and opportunity to all. We structure our benefit offerings with a focus on access to affordable benefits based on employee need.\nOur proxy statement provides more detail on the competitive compensation and benefit programs we offer.\nEmployee Safety\nIn 2024, we continued our multi-year, world class safety record with a Lost-time Incident Rate of 0.09 and Recordable Rate below 0.71. We refreshed our behavior-based and ergonomics programs and had a major focus on leading indicators, which has been very impactful for all employees across the globe. In 2024, this included a global safety campaign within our manufacturing locations and field operations.\nWe also continue to maintain all our locations globally as tobacco free workplaces.\n10\nTable of Contents\nAvailable Information\nWe have used, and intend to continue to use, the homepage, the Investor Relations and the \"News\" sections of our website (www.tranetechnologies.com), among other sources such as press releases, public conference calls and webcasts, as a means of disclosing additional information, which may include future developments regarding the Company and/or material non-public information. We encourage investors, the media, and others interested in our Company to review the information we make public in these locations on our website.\nWe file annual, quarterly, and current reports, proxy statements, and other documents with the Securities and Exchange Commission under the Securities Exchange Act of 1934.\nThis Annual Report on Form 10-K, as well as our quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to all the foregoing reports, are made available free of charge on our Internet website (www.tranetechnologies.com) as soon as reasonably practicable after such reports are electronically filed with or furnished to the Securities and Exchange Commission. The Board of Directors of our Company has also adopted and posted in the Investor Relations section of our website the Corporate Governance Guidelines and charters for each of the Board's standing committees. The contents of our website are not incorporated by reference in this report.\nExecutive Officers of the Registrant\nThe following is a list of our executive officers as of February 6, 2025.\nName and Age\n  \nDate of\nService as\nan Executive\nOfficer\nPrincipal Occupation and\nOther Information for Past Five Years\nDavid S. Regnery (62)\n8/5/2017\nChair of the Board (since January 2022); Chief Executive Officer and Director (since July 2021); President and Chief Operating Officer (January 2020 to June 2021)\nChristopher J. Kuehn (52)\n6/1/2015\n  \nExecutive Vice President and Chief Financial Officer (since July 2021); Senior Vice President and Chief Financial Officer (March 2020 to June 2021); Vice President and Chief Accounting Officer (June 2015 to February 2020)\nMauro Atalla (56)\n1/6/2025\nSenior Vice President, Chief Technology and Sustainability Officer (since January 2025); Senior Vice President, Engineering and Technology Leader at Collins Aerospace Systems (November 2018 to December 2024)\n  \nRaymond D. Pittard (59)\n7/1/2021\nExecutive Vice President, Chief Integrated Supply Chain Officer (since January 2024); Executive Vice President, Supply Chain, Engineering and Information Technology (July 2021 to January 2024); Transformation Office Leader (December 2019 to June 2021); Vice President, SBU President of Transport Solutions North America and EMEA (December 2013 to December 2019)\nEvan M. Turtz (56)\n4/3/2019\nSenior Vice President and General Counsel (since April 2019); Secretary (since October 2013)\nMairéad A. Magner (47)\n1/6/2022\nSenior Vice President, Chief Human Resources Officer (since January 2022); Vice President, Talent and Organization Capability (January 2018 to January 2022)\nDonald E. Simmons (53)\n1/4/2024\nGroup President, Americas (since January 2024); Americas Segment Leader and CHVAC Americas President (January 2022 to December 2023); President, CHVAC Americas (January 2020 to December 2021)\nElizabeth Elwell (51) \n2/12/2024\nVice President and Chief Accounting Officer (since February 2024); Vice President, Finance Residential HVAC and Supply (May 2022-February 2024); Vice President, Financial Planning & Analysis (January 2019-May 2022)\nNo family relationship exists between any of the above-listed executive officers of our Company. All officers are elected to hold office for one year or until their successors are elected and qualified.\n11\nTable of Contents",
  "item7": "Item 7.\n \nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following Management's Discussion and Analysis of Financial Condition and Results of Operations contains forward-looking statements that involve risks and uncertainties. Our actual results may differ materially from the results discussed in the forward-looking statements. Factors that might cause a difference include, but are not limited to, those discussed under Item 1A. Risk Factors in this Annual Report on Form 10-K. The following section is qualified in its entirety by the more detailed information, including our financial statements and the notes thereto, which appears elsewhere in this Annual Report.\nThis section discusses 2024 and 2023 significant items affecting our consolidated operating results, financial condition and liquidity and provides a year-to-year comparison between 2024 and 2023. Discussions of 2022 significant items and year-to-year comparisons between 2023 and 2022 have been excluded in this Form 10-K and can be found in \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in Part II, Item 7 of our Annual Report on Form 10-K for year ended December 31, 2023.\nOverview\nOrganizational\nTrane Technologies plc is a global climate innovator. We bring sustainable and efficient solutions to buildings, homes and transportation through our strategic brands, Trane\n®\n and Thermo King\n®\n, and our environmentally responsible portfolio of products, services and connected intelligent controls.\n2030 Sustainability Commitments\nOur commitment to sustainability extends to the environmental and social impacts of our people, operations, products and services. We have announced ambitious 2030 Sustainability Commitments, including our Gigaton Challenge to reduce customers' carbon emissions by a billion metric tons through sustainable products and services. We are also Leading by Example as we work toward carbon-neutral operations, zero waste-to-landfill and net positive water use in water-stressed locations. We also committed to reducing embodied carbon in our products by 40%, while also designing products for circularity. Our 2030 emissions reduction targets have been validated by the Science Based Targets Initiative (SBTi), and we are one of very few companies worldwide with validated 2050 net-zero targets. Finally, our Opportunity for All commitment focuses on investing in our people and our uplifting and inclusive culture, and broadening access to Science, Technology, Engineering and Math (STEM) education and careers in our communities.\nRecent Acquisitions\nDuring the third quarter of 2024, we completed acquisitions of two businesses. One acquisition is a Commercial HVAC distributor with sales and service business in the United States. The second acquisition is a technology-focused acquisition that expands the Company's product offerings in the Transport Refrigeration business. The results of both acquisitions are reported within the Americas segment.\nThe Company completed the acquisition of two businesses in January 2025. One acquisition is a Commercial HVAC distributor with sales and service business in Belgium and Luxembourg. The results of the acquisition will be reported within the EMEA segment. The second acquisition is a building management platform for HVAC optimization, using advanced artificial intelligence technologies. The results of the acquisition will be reported within the Americas segment. The results of the acquisitions will be included in our consolidated financial statements from the date of the acquisitions.\nSignificant Matters\nReorganization of Aldrich and Murray\nOn June 18, 2020 (Petition Date), our indirect wholly-owned subsidiaries, Aldrich and Murray each filed a voluntary petition for reorganization under the Bankruptcy Code. As a result of the Chapter 11 filings, all asbestos-related lawsuits against Aldrich and Murray have been stayed due to the imposition of a statutory automatic stay applicable in Chapter 11 bankruptcy cases. Only Aldrich and Murray have filed for Chapter 11 relief. Neither Aldrich's wholly-owned subsidiary, 200 Park, Murray's wholly-owned subsidiary, ClimateLabs, nor the Trane Companies are part of the Chapter 11 filings.\nThe goal of these Chapter 11 filings is to resolve equitably and permanently all current and future asbestos-related claims in a manner beneficial to claimants, Aldrich and Murray through court approval of a plan of reorganization that would create a trust pursuant to section 524(g) of the Bankruptcy Code, establish claims resolution procedures for all current and future asbestos-related claims against Aldrich and Murray and channel such claims to the trust for resolution in accordance with those procedures.\n28\nTable of Contents\nAldrich and its wholly-owned subsidiary 200 Park and Murray and its wholly-owned subsidiary ClimateLabs were deconsolidated as of the Petition Date and their respective assets and liabilities were derecognized from our Consolidated Financial Statements. \nIn 2021, Aldrich and Murray reached an agreement in principle with the court-appointed legal representative of future asbestos claimants (the FCR) and filed a motion to create a $270.0 million trust intended to constitute a \"qualified settlement fund\" within the meaning of the Treasury Regulations under Section 468B of the Internal Revenue Code (QSF). On January 27, 2022, the Bankruptcy Court granted the request to fund the QSF, which was funded on March 2, 2022, resulting in an operating cash outflow of $270.0 million reported in our Consolidated Statements of Cash Flows, of which $91.8 million was allocated to continuing operations and $178.2 million was allocated to discontinued operations for the year ended December 31, 2022.\nOn April 6, 2023, certain individual claimants filed a motion to dismiss the Chapter 11 cases (Claimant Motion to Dismiss). Subsequently, on May 15, 2023, the committee representing current asbestos claimants (the ACC) filed its own motion to dismiss the Chapter 11 cases (ACC Motion to Dismiss, and, together with the Claimant Motion to Dismiss, the Motions to Dismiss). Aldrich, Murray and the FCR filed responses in opposition to the Motions to Dismiss, and the Company filed papers joining in Aldrich and Murray's opposition. A hearing on the Motions to Dismiss was held on July 14, 2023. On December 28, 2023, the Bankruptcy Court entered an order denying the Motions to Dismiss. On January 11, 2024, the ACC and the individual claimants filed motions with the United States District Court for the District of North Carolina (the District Court) seeking leave to appeal the order denying the Motions to Dismiss (Motions for Leave to Appeal) and to certify the appeals directly to the Court of Appeals for the Fourth Circuit. At a hearing on February 9, 2024, the Bankruptcy Court granted the motions to certify direct appeals to the Fourth Circuit. On April 17, 2024, the Fourth Circuit entered an order denying the petitions for direct appeal. On May 1, 2024, the ACC and the individual claimants filed petitions with the Fourth Circuit seeking rehearing \nen banc. \nAldrich and Murray opposed the petitions and the Fourth Circuit denied the petitions by order dated May 15, 2024. On May 28, 2024, Aldrich and Murray filed their response with the District Court in opposition to the Motions for Leave to Appeal. The FCR filed its response to the Motions for Leave to Appeal on May 29, 2024. The ACC and the individual claimants filed their replies in support of the Motions for Leave to Appeal on June 11, 2024. \nOn January 23, 2023, an individual claimant filed a motion to lift the automatic order to pursue its asbestos suit against Aldrich and Murray notwithstanding the Chapter 11 cases (the Stay Relief Motion). Aldrich and Murray, the FCR, and certain non-debtor affiliates each opposed the Stay Relief Motion.  The Bankruptcy Court denied the Stay Relief Motion after holding a hearing on March 30, 2023.  The Bankruptcy Court entered an order memorializing its March oral ruling on November 13, 2024.  The individual claimant filed a notice with the Bankruptcy Court appealing the order denying the Stay Relief Motion to the District Court on November 27, 2024.\nIt is not possible to predict how the District Court will rule on these pending motions, whether an appellate court will affirm or reverse the Bankruptcy Court orders denying the Motions to Dismiss and the Stay Relief Motion, whether the Bankruptcy Court will approve the terms of the Plan, what the extent of the asbestos liability will be or how long the Chapter 11 cases will last.The Chapter 11 cases remain pending as of February 6, 2025.\nFor detailed information on the bankruptcy cases of Aldrich and Murray, see Part I, Item 1, \"Business - Asbestos-Related Matters,\" Part I, Item 1A, \"Risk Factors - Risks Related to Litigation,\" Part I, Item 3, \"Legal Proceedings,\" and Part II, Item 8, Consolidated Financial Statements, and Note 20, \"Commitments and Contingencies.\"\n29\nTable of Contents\nTrends and Economic Events\nWe are a global corporation with worldwide operations. As a global business, our operations are affected by worldwide, regional and industry-specific economic factors as well as geopolitical, environmental and social factors wherever we operate or do business. Our geographic diversity and the breadth of our products and services portfolios have helped mitigate the impact of any one industry or the economy of any single country on our consolidated operating results.\nGiven our broad range of products manufactured and geographic markets served, management uses a variety of factors to predict the outlook for the Company. We monitor key competitors and customers in order to gauge relative performance and the outlook for the future. We regularly perform detailed evaluations of the different market segments we serve to proactively detect trends and to adapt our strategies accordingly, including potential triggers and actions to be taken under recessionary scenarios. In addition, we believe our backlog and order levels are indicative of future revenue and thus are a key measure of anticipated performance.\nWe expect conditions to remain mixed across our served end markets and geographies. Overall Commercial HVAC markets in Americas and EMEA remain strong due to demand for our differentiated customer driven solutions and the benefits of installing energy efficient products and decarbonizing the built environment. In Asia, markets are more dynamic, with weak macro-economic conditions driving soft demand in China and more stable macro-economic conditions driving modest demand in the rest of Asia. Transport refrigeration markets are experiencing lower demand as freight rates remain low, particularly in the United States. Residential markets in the United States have improved in 2024 but are undergoing a regulatory transition which could bring short-term variation in demand, and uncertainties remain from economic risks and higher interest rates.\nWe continue to see material and wage inflation impact our cost structure. Our performance may be impacted by future developments that are uncertain. Geopolitical risks and macroeconomic events could cause disruptions to operations, supply chains, end markets, financial markets and overall economic conditions which could negatively impact our business.\nWe believe we have a solid foundation of global brands that are highly differentiated in all of our major product lines. Our geographic mix, diversity of our portfolio, and our large installed product base, provide growth opportunities from replacement demand and within our service revenue streams. Additionally, we are investing substantial resources to innovate and develop new products and services which we expect to drive future growth.\n30\nTable of Contents\nResults of Operations\nNon-GAAP Financial Measures\nOrganic Revenue\n \nWe define organic revenue as net revenues adjusted for the impact of currency, acquisitions and divestitures\n. \nOrganic revenue is not defined under U.S. Generally Accepted Accounting Principles (GAAP) and may not be comparable to similarly-titled measures used by other companies and should not be considered a substitute for revenue as determined in accordance with GAAP.\n \nSelected references are made to revenue growth on an organic basis so that certain financial results can be viewed without the impacts of fluctuations in foreign currency rates and acquisitions, thereby providing comparisons of operating performance from period to period of the business that we have owned during both periods presented. We believe organic revenue growth provides investors with useful supplemental information about our revenues in both periods presented.\nSegment Adjusted EBITDA\nWe define Segment Adjusted EBITDA as net earnings excluding interest expense, income taxes, depreciation and amortization, restructuring, non-cash adjustments for contingent consideration, merger and acquisition-related costs, unallocated corporate expenses, discontinued operations and other non-recurring items. Segment Adjusted EBITDA, and ratios based on it, are used in the development of annual operating plans, including capital expenditure and operational budgets, and in measuring performance against targets for purposes of incentive compensation. Segment Adjusted EBITDA also provides a useful tool for assessing the operating performance and comparability between periods and our ability to generate cash because it excludes the impact of certain non-cash or non-recurring items that can vary significantly from period to period. Segment Adjusted EBITDA is not defined under GAAP and may not be comparable to similarly-titled measures used by other companies and should not be considered a substitute for net earnings or other results as determined in accordance with GAAP.\n \nSegment Adjusted Operating Income\nWe define Segment Adjusted Operating Income as operating income adjusted to exclude restructuring costs, merger and acquisition-related costs, non-cash adjustments for contingent consideration and other non-recurring items. Segment Adjusted Operating Income, and ratios based on it, are used to provide a comprehensive view of segment profitability and evaluate efficient returns on assets. Segment Adjusted Operating Income also provides a useful tool for assessing the comparability between periods because it eliminates non-recurring items that can vary from period to period. Segment Adjusted Operating Income is not defined under GAAP and may not be comparable to similarly-titled measures used by other companies and should not be considered a substitute for net earnings or other results as determined in accordance with GAAP.\nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023 - Consolidated Results\nDollar amounts in millions\n2024\n2023\nPeriod Change\n2024\n % of revenues\n2023\n % of revenues\nNet revenues\n$\n19,838.2 \n$\n17,677.6 \n$\n2,160.6 \nCost of goods sold\n(12,757.7)\n(11,820.4)\n(937.3)\n64.3%\n66.9%\nGross profit\n7,080.5 \n5,857.2 \n1,223.3 \n35.7%\n33.1%\nSelling and administrative expenses\n(3,580.4)\n(2,963.2)\n(617.2)\n18.1%\n16.7%\nOperating income\n3,500.1 \n2,894.0 \n606.1 \n17.6%\n16.4%\nInterest expense\n(238.4)\n(234.5)\n(3.9)\nOther income/(expense), net\n(19.9)\n(92.2)\n72.3 \n \n \nEarnings before income taxes\n3,241.8 \n2,567.3 \n674.5 \nProvision for income taxes\n(627.6)\n(498.4)\n(129.2)\n \n \nEarnings from continuing operations\n2,614.2 \n2,068.9 \n545.3 \nDiscontinued operations, net of tax\n(24.7)\n(27.2)\n2.5 \n \n \nNet earnings\n$\n2,589.5 \n$\n2,041.7 \n$\n547.8 \n31\nTable of Contents\nNet Revenues\nNet revenues\n for the year ended December 31, 2024 increased by 12.2%, or $2,160.6 million, compared with the same period of 2023.\nThe components of the period change were as follows:\nVolume\n9.4 \n%\nPricing\n2.3 \n%\nOrganic revenue \n(1)\n11.7 \n%\nAcquisitions\n1.0 \n%\nCurrency translation\n(0.5)\n%\nTotal \n12.2 \n%\n(1) \nRepresents a non-GAAP measure. For more information, see \"Non-GAAP Financial Measures.\"\nThe increase in \nNet revenues\n was primarily driven by higher volumes as a result of stronger end-customer demand within our Americas and EMEA segments, realization of price increases and incremental revenue from acquisitions, partially offset by an unfavorable impact from foreign currency translation. Refer to \"Results by Segment\" below for a discussion of \nNet revenues\n by segment.\nGross Profit Margin\nGross profit margin for the year ended December 31, 2024 increased 260 basis points to 35.7% compared to 33.1% for the same period of 2023 primarily due to gross productivity and price realization, partially offset by inflation.\nSelling and Administrative Expenses\nSelling and administrative expenses \nfor the year ended December 31, 2024 increased by 20.8%, or $617.2 million, compared with the same period of 2023. The increase in \nSelling and administrative expenses\n was primarily driven by an increase in human capital costs related to investing in our people, higher sales commissions, incremental selling and administrative expenses of acquired businesses and higher levels of business reinvestment. Additionally, non-cash adjustments to contingent consideration reduced \nSelling and administrative expenses \nfor the years ended December 31, 2024 and December 31, 2023 by $25.0 million and $49.3 million, respectively. \nSelling and administrative expenses\n as a percentage of \nNet revenues\n for the year ended December 31, 2024 increased 140 basis points from 16.7% to 18.1%.\nInterest Expense\nInterest expense\n for the year ended December 31, 2024 increased by 1.7% or $3.9 million compared with the same period of 2023 primarily due to the issuance of $500 million of 5.100% Senior Notes due in 2034. The increase in interest expense was partially offset by an increase in interest income from short-term investments purchased with proceeds from the debt issuance, which is reported in \nOther (income)/expense, net\n. We had no commercial paper outstanding as of December 31, 2024.\nProvision for Income Taxes\nThe 2024 effective tax rate was 19.4% which was lower than the U.S. Statutory rate of 21% due to excess tax benefits from employee share-based payments and earnings in non-U.S. jurisdictions, which, in aggregate have a lower effective tax rate, and includes the impact of the Organisation for Economic Co-operation and Development (OECD) tax reform initiative (Pillar Two), partially offset by U.S. state and local taxes. Revenues from non-U.S. jurisdictions accounted for approximately 26% of our total 2024 revenues, such that a material portion of our pretax income was earned and taxed outside the U.S. at rates up to 38%. When comparing the results of multiple reporting periods, among other factors, the mix of earnings between U.S. and foreign jurisdictions can cause variability in our overall effective tax rate.\nThe 2023 effective tax rate was 19.4% which was lower than the U.S. Statutory rate of 21% due to a $30.3 million reduction in valuation allowances primarily related to deferred tax assets associated with both foreign tax credits and operations of international subsidiaries. Additional items that impact the effective tax rate are excess tax benefits from employee share-based payments and earnings in non-U.S. jurisdictions, which in aggregate have a lower effective tax rate offset by an impairment of an equity investment, and U.S. state and local taxes.  Revenues from non-U.S. jurisdictions accounted for approximately 28% of our total 2023 revenues, such that a material portion of our pretax income was earned and taxed outside the U.S. at rates up to 38%. When comparing the results of multiple reporting periods, among other factors, the mix of earnings between U.S. and foreign jurisdictions can cause variability in our overall effective tax rate.\n32\nTable of Contents\nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023 - Segment Results\nWe operate under three reportable segments designed to create deep customer focus and relevance in markets around the world. Intercompany sales between segments are immaterial.\n•\nOur Americas segment innovates for customers in North America and Latin America. The Americas segment encompasses commercial heating, cooling and ventilation systems, building controls and solutions, and energy services and solutions; residential heating and cooling; and transport refrigeration systems and solutions. \n•\nOur EMEA segment innovates for customers in the Europe, Middle East and Africa region. The EMEA segment encompasses heating, cooling and ventilation systems, services and solutions for commercial buildings, and transport refrigeration systems and solutions.\n•\nOur Asia Pacific segment innovates for customers throughout the Asia Pacific region. The Asia Pacific segment encompasses heating, cooling and ventilation systems, services and solutions for commercial buildings and transport refrigeration systems and solutions.\nThe following discussion compares our results for each of our three reportable segments for the year ended December 31, 2024 compared to the year ended December 31, 2023.\nDollar amounts in millions\n2024\n2023\n% Change\nAmericas\nNet revenues\n$\n15,903.2 \n$\n13,832.0 \n15.0 \n%\nSegment Adjusted EBITDA\n3,318.3 \n2,669.6 \n24.3 \n%\nSegment Adjusted EBITDA as a percentage of net revenues\n20.9 \n%\n19.3 \n%\nEMEA\nNet revenues\n$\n2,556.7 \n$\n2,401.2 \n6.5 \n%\nSegment Adjusted EBITDA\n505.1 \n464.7 \n8.7 \n%\nSegment Adjusted EBITDA as a percentage of net revenues\n19.8 \n%\n19.4 \n%\nAsia Pacific\nNet revenues\n$\n1,378.3 \n$\n1,444.4 \n(4.6)\n%\nSegment Adjusted EBITDA\n329.3 \n321.3 \n2.5 \n%\nSegment Adjusted EBITDA as a percentage of net revenues\n23.9 \n%\n22.2 \n%\nTotal Net revenues\n$\n19,838.2 \n$\n17,677.6 \n12.2 \n%\nTotal Segment Adjusted EBITDA\n4,152.7 \n3,455.6 \n20.2 \n%\nTotal Segment Adjusted EBITDA as a percentage of net revenues\n20.9 \n%\n19.5 \n%\n33\nTable of Contents\nAmericas\nNet revenues\n for the year ended December 31, 2024 increased by 15.0% or $2,071.2 million, compared with the same period of 2023.\nThe components of the period change were as follows:\nVolume\n11.6 \n%\nPricing\n2.7 \n%\nOrganic revenue \n(1)\n14.3 \n%\nAcquisitions\n1.0 \n%\nCurrency translation\n(0.3)\n%\nTotal \n15.0 \n%\nThe increase in \norganic revenue\n was primarily driven by higher volumes led by strong demand within both our Commercial HVAC and Residential HVAC businesses and realization of price increases for both equipment and services within our Commercial HVAC business, partially offset by softer transport markets.  \nThe increase in revenue from acquisitions primarily relates to Helmer Scientific Inc (Helmer) acquired in the second quarter of 2023, Nuvolo Technologies Corporation (Nuvolo) acquired in the fourth quarter of 2023 and a Commercial HVAC sales channel acquisition in the third quarter of 2024. \nSegment Adjusted EBITDA margin for the year ended December 31, 2024 increased by 160 basis points to 20.9% compared to 19.3% for the same period of 2023 primarily due to price realization, gross productivity and higher volumes, partially offset by inflation and continued business reinvestment.\nEMEA\nNet revenues\n for the year ended December 31, 2024 increased by 6.5% or $155.5 million, compared with the same period of 2023.\nThe components of the period change were as follows:\nVolume\n4.9 \n%\nPricing\n0.9 \n%\nOrganic revenue \n(1)\n5.8 \n%\nAcquisitions\n1.3 \n%\nCurrency translation\n(0.6)\n%\nTotal \n6.5 \n%\nThe increase in \norganic revenue \nwas primarily driven by strong customer demand within our Commercial HVAC business and realization of price increases within both our Commercial HVAC and Transport Refrigeration businesses.\nThe increase in revenue from acquisitions primarily relates to MTA acquired in the second quarter of 2023.\nSegment Adjusted EBITDA margin for the year ended December 31, 2024 increased by 40 basis points to 19.8% compared to 19.4% for the same period of 2023 primarily due to favorable productivity and price, partially offset by inflation, continued business reinvestment and loss from a devaluation of the Egyptian pound.\nAsia Pacific\nNet revenues\n for the year ended December 31, 2024 decreased by 4.6% or $66.1 million, compared with the same period of 2023.\nThe components of the period change were as follows:\nVolume\n(4.2)\n%\nPricing\n1.2 \n%\nOrganic revenue \n(1)\n(3.0)\n%\nCurrency translation\n(1.6)\n%\nTotal\n(4.6)\n%\n34\nTable of Contents\nThe decrease in \norganic revenue \nwas primarily driven by lower volumes in China, partially offset by realization of price increases within our Commercial HVAC business and higher volumes in the rest of Asia. \nSegment Adjusted EBITDA margin for the year ended December 31, 2024 increased by 170 basis points to 23.9% compared to 22.2% for the same period of 2023 primarily due to gross productivity and price realization, partially offset by lower volumes, inflation and continued business reinvestment.  \nLiquidity and Capital Resources\nWe assess our liquidity in terms of our ability to generate cash to fund our operating, investing and financing activities. In doing so, we review and analyze our current cash on hand, the number of days our sales are outstanding, inventory turns, capital expenditure commitments and income tax payments. Our cash requirements primarily consist of the following:\n•\nFunding of working capital\n•\nDebt service requirements\n•\nFunding of capital expenditures\n•\nDividend payments\n•\nFunding of acquisitions, joint ventures and equity investments\n•\nShare repurchases\nOur primary sources of liquidity include cash balances on hand, cash flows from operations, proceeds from debt offerings, commercial paper, and borrowing availability under our existing credit facilities. We earn a significant amount of our operating income in jurisdictions where it is deemed to be permanently reinvested. Our most prominent jurisdiction of operation is the U.S. We expect existing cash and cash equivalents available to the U.S. operations, the cash generated by our U.S. operations, our committed credit lines as well as our expected ability to access the capital and debt markets will be sufficient to fund our U.S. operating and capital needs for at least the next twelve months and thereafter for the foreseeable future. In addition, we expect existing non-U.S. cash and cash equivalents and the cash generated by our non-U.S. operations will be sufficient to fund our non-U.S. operating and capital needs for at least the next twelve months and thereafter for the foreseeable future. The maximum aggregate amount of unsecured commercial paper notes available to be issued, on a private placement basis, under the commercial paper program is $2.0 billion, of which we had no outstanding balance as of December 31, 2024.\nAs of December 31, 2024, we had $1,590.1 million of cash and cash equivalents on hand, of which $1,423.0 million was held by non-U.S. subsidiaries. Cash and cash equivalents held by our non-U.S. subsidiaries are generally available for use in our U.S. operations via intercompany loans, equity infusions or via distributions from direct or indirectly owned non-U.S. subsidiaries for which we do not assert permanent reinvestment. In general, repatriation of cash to the U.S. can be completed with no significant incremental U.S. tax. However, to the extent that we repatriate funds from non-U.S. subsidiaries for which we assert permanent reinvestment to fund our U.S. operations, we would be required to accrue and pay applicable non-U.S. taxes. As of December 31, 2024, we currently have no plans to repatriate funds from subsidiaries for which we assert permanent reinvestment.\nShare repurchases are made in accordance with our balanced capital allocation strategy, subject to market conditions and regulatory requirements. In February 2022, our Board of Directors authorized the repurchase of up to $3.0 billion of our ordinary shares (2022 Authorization) and in December 2024, our Board of Directors authorized the repurchase of up to an additional $5.0 billion of our ordinary shares (2024 Authorization) upon the conclusion of the 2022 Authorization. During the year ended December 31, 2024, we repurchased and canceled approximately $1.3 billion of ordinary shares, leaving $1.2 billion remaining under the 2022 Authorization and $5.0 billion remaining under the 2024 Authorization. Additionally, during the period after December 31, 2024 through January 31, 2025, we repurchased approximately $100 million of our ordinary shares under the 2022 Authorization.\nWe expect to pay a competitive and growing dividend. Since the launch of Trane Technologies in March 2020, we have increased our quarterly dividend per share by 58%, from $0.53 to $0.84 per ordinary share, or $2.12 to $3.36 per share annualized. All four 2024 quarterly dividends were paid during the year ended December 31, 2024. In February 2025, our Board of Directors declared an increase in our quarterly share dividend by 12%, from $0.84 to $0.94 per ordinary share, or $3.36 to $3.76 per share annualized starting in the first quarter of 2025. \nWe continue to actively manage and strengthen our business portfolio to meet the current and future needs of our customers. We achieve this partly through engaging in research and development and sustaining activities and partly through acquisitions. Sustaining activities include costs incurred to reduce production costs, improve existing products, create custom solutions for customers and provide support to our manufacturing facilities. Each year, we make investments in new product development and new technology innovation as they are key factors in achieving our strategic objectives as a leader in the climate sector. In addition, we make investments in technology and business for our operational sustainability programs. Our research and development and sustaining costs account for approximately 2% of annual\n Net revenues. \n35\nTable of Contents\nIn pursuing our business strategy, we routinely conduct discussions, evaluate targets and enter into agreements regarding possible acquisitions, divestitures, joint ventures and equity investments. We have acquired several businesses, entered into joint ventures and invested in companies that complement existing products and services further enhancing our product portfolio. We deployed capital of approximately $197 million and $881 million to acquisitions and equity investments completed during the years ended December 31, 2024 and December 31, 2023, respectively. In 2024, we committed capital of approximately $470 million attributable to acquisitions and equity investments that were signed in 2024 and were closed in 2024 or in January 2025.\nWe incur costs associated with restructuring initiatives intended to result in improved operating performance, profitability and working capital levels. Actions associated with these initiatives may include workforce reductions, improving manufacturing productivity, realignment of management structures and rationalizing certain assets. We believe that our existing cash balances, anticipated cash flow from operations, committed credit lines and access to the capital markets will be sufficient to fund share repurchases, dividends, research and development, sustaining activities,\n \nbusiness portfolio changes and ongoing restructuring actions.\nCertain of our subsidiaries entered into Funding Agreements with Aldrich and Murray pursuant to which those subsidiaries are obligated, among other things, to pay the costs and expenses of Aldrich and Murray during the pendency of the Chapter 11 cases to the extent distributions from their respective subsidiaries are insufficient to do so and to provide an amount for the funding for a trust established pursuant to section 524(g) of the Bankruptcy Code, to the extent that the other assets of Aldrich and Murray are insufficient to provide the requisite trust funding. During the third quarter of 2021, Aldrich and Murray filed a motion with the Bankruptcy Court to create a $270.0 million qualified settlement fund (QSF). The funds held in the QSF would be available to provide funding for the Section 524(g) Trust upon effectiveness of the Plan. On January 27, 2022, the Bankruptcy Court granted the request to fund the QSF, which was funded on March 2, 2022.\nLiquidity\nThe following table contains several key measures of our financial condition and liquidity at the periods ended December 31:\nIn millions\n2024\n2023\nCash and cash equivalents\n$\n1,590.1 \n$\n1,095.3 \nShort-term borrowings and current maturities of long-term debt\n452.2 \n801.9 \nLong-term debt\n4,318.1 \n3,977.9 \nTotal debt\n4,770.3 \n4,779.8 \nTotal Trane Technologies plc shareholders' equity\n7,457.4 \n6,995.2 \nTotal equity\n7,486.9 \n7,017.0 \nDebt-to-total capital ratio\n38.9 \n%\n40.5 \n%\nDebt and Credit Facilities\nAs of December 31, 2024, our short-term obligations primarily consist of current maturities of $157.2 million that mature in June 2025 and $295.0 million of fixed rate debentures that contain a put feature that the holders may exercise on each anniversary of the issuance date. If exercised, we are obligated to repay in whole or in part, at the holder's option, the outstanding principal amount (plus accrued and unpaid interest) of the debentures held by the holder. In accordance with notice requirements as specified in the offering documents, holders had the option to exercise puts up to $37.2 million for settlement in February 2025 but did not exercise such option. In accordance with notice requirements as specified in the offering documents, holders will have the option to exercise puts up to $257.8 million for settlement in November 2025. We also maintain a commercial paper program which is used for general corporate purposes. Under the program, the maximum aggregate amount of unsecured commercial paper notes available to be issued, on a private placement basis, is $2.0 billion as of December 31, 2024. We had no commercial paper outstanding at December 31, 2024 and December 31, 2023. See Note 7, \"Debt and Credit Facilities,\" to the Consolidated Financial Statements for additional information regarding the terms of our short-term obligations.\nOur long-term obligations primarily consist of long-term debt with final maturity dates ranging between 2026 and 2049. In addition, we maintain two $1.0 billion senior unsecured revolving credit facilities, one of which matures in June 2026 and the other which matures in April 2027. The facilities provide support for our commercial paper program and can be used for working capital and other general corporate purposes. Total commitments of $2.0 billion were unused at December 31, 2024 and December 31, 2023. See Note 7, \"Debt and Credit Facilities,\" to the Consolidated Financial Statements and further below in \nSupplemental Guarantor Financial Information\n for additional information regarding the terms of our long-term obligations and their related guarantees.\n36\nTable of Contents\nCash Flows\nThe following table reflects the major categories of cash flows for the years ended December 31, respectively. For additional details, please see the Consolidated Statements of Cash Flows in the Consolidated Financial Statements.\nIn millions\n2024\n2023\nNet cash provided by continuing operating activities\n$\n3,177.7 \n$\n2,426.8 \nNet cash used in continuing investing activities\n(562.9)\n(1,172.2)\nNet cash used in continuing financing activities\n(2,020.6)\n(1,350.3)\nOperating Activities\nNet cash provided by continuing operating activities for the year ended December 31, 2024 was $3,177.7 million, of which net income provided $2,938.8 million after adjusting for non-cash transactions. Net cash provided by continuing operating activities for the year ended December 31, 2023 was $2,426.8 million, of which net income provided $2,499.6 million after adjusting for non-cash transactions. The year-over-year increase in net cash from continuing operating activities was primarily due to higher net earnings and an improved cash conversion cycle. \nInvesting Activities\nCash flows from investing activities represents inflows and outflows regarding the purchase and sale of assets. Primary activities associated with these items include capital expenditures, proceeds from the sale of property, plant and equipment, acquisitions, funding of joint ventures and other equity investments and purchases and sales of short-term investments. During the year ended December 31, 2024, net cash used in investing activities from continuing operations was $562.9 million. The primary drivers of the usage were attributable to capital expenditures of $370.6 million and acquisitions of businesses of $180.3 million, net of cash acquired. During the year ended December 31, 2023, net cash used in investing activities from continuing operations was $1,172.2 million. The primary drivers of the usage was attributable to acquisition of businesses, which totaled $862.8 million, net of cash acquired, and capital expenditures of $300.7 million.\nFinancing Activities\nCash flows from financing activities represent inflows and outflows that account for external activities affecting equity and debt. Primary activities associated with these actions include paying dividends to shareholders, repurchasing our own shares, net proceeds from debt issuances and proceeds from shares issued in connection with incentive plans. During the year ended December 31, 2024, net cash used in financing activities from continuing operations was $2,020.6 million. The primary drivers of the outflow related to the repurchase of $1,280.8 million in ordinary shares and dividends paid to ordinary shareholders of $757.5 million. In addition, we received $498.5 million in proceeds from the issuance of 5.100% Senior Notes due 2034, which was offset by the redemption of $500.0 million of 3.550% Senior Notes that matured in November 2024. During the year ended December 31, 2023, net cash used in financing activities from continuing operations was $1,350.3 million. The primary drivers of the outflow related to dividends paid to ordinary shareholders of $683.7 million and the repurchase of $669.3 million in ordinary shares. In addition, we received $699.1 million in proceeds from the issuance of 5.250% Senior Notes due March 2033 which was offset by the redemption of $700.0 million of Senior Notes due June 2023. \n37\nTable of Contents\nFree Cash Flow\nFree cash flow is a non-GAAP measure and defined as \nNet cash provided by (used in) continuing operating activities \nadjusted for\n \ncapital expenditures, cash payments for restructuring, legacy legal liability, transformation costs and merger and acquisition (M&A) related costs less insurance settlements on property claims and an adjustment for our special three-year Outperformance Incentive Program. This measure is useful to management and investors because it is consistent with management's assessment of our operating cash flow performance. The most comparable GAAP measure to free cash flow is\n Net cash provided by (used in) continuing operating activities\n. Free cash flow may not be comparable to similarly-titled measures used by other companies and should not be considered a substitute for \nNet cash provided by (used in) continuing operating activities\n in accordance with GAAP.\nA reconciliation of \nNet cash provided by (used in) continuing operating activities\n to free cash flow the years ended December 31 is as follows:\nIn millions\n2024\n2023\nNet cash provided by (used in) continuing operating activities\n$\n3,177.7 \n$\n2,426.8 \nCapital expenditures\n(370.6)\n(300.7)\nCash payments for restructuring\n8.6 \n12.3 \nLegacy legal liability\n2.7 \n— \nTransformation costs paid\n— \n3.9 \nM&A transaction costs\n1.7 \n18.9 \nInsurance settlements on property claims\n— \n(10.0)\nAdjustment for Outperformance Incentive Program \n(2)\n(31.1)\n— \nFree cash flow \n(1)\n$\n2,789.0 \n$\n2,151.2 \n(1) \nRepresents a non-GAAP measure. \n(2) \nThe Company implemented a special three-year Outperformance Incentive Program during the year ended December 31, 2024 that provides additional incentive-based cash compensation to eligible participants based primarily on the achievement of outsized revenue performance beyond what is achievable under the Company’s existing short-term incentive programs. Performance is measured over three annual periods representing the years ended December 31, 2024, 2025 and 2026. Cash payments related to performance achieved will be made in the quarter ended March 31, 2027. This adjustment represents amounts earned in the respective performance period that will be paid during the quarter ended March 31, 2027. \nPension Plans\nOur investment objective in managing defined benefit plan assets is to ensure that all present and future benefit obligations are met as they come due. We seek to achieve this goal while trying to mitigate volatility in plan funded status, contribution and expense by better matching the characteristics of the plan assets to that of the plan liabilities. We use a dynamic approach to asset allocation to increase fixed income assets as the plan's funded status improves. We monitor plan funded status and asset allocation regularly in addition to investment manager performance. In addition, we monitor the impact of market conditions on our defined benefit plans on a regular basis. None of our defined benefit pension plans have experienced a significant impact on their liquidity due to market volatility. See Note 11, \"Pension and Postretirement Benefits Other Than Pensions,\" to the Consolidated Financial Statements for additional information regarding pensions.\nCapital Resources\nBased on historical performance and current expectations, we believe our cash and cash equivalents balance, the cash generated from our operations, our committed credit lines and our expected ability to access capital markets, including our commercial paper program, will satisfy our working capital needs, capital expenditures, dividends, share repurchases, upcoming debt maturities, and other liquidity requirements associated with our operations for the foreseeable future.\nCapital expenditures were $370.6 million, $300.7 million and $291.8 million for the years ended December 31, 2024, 2023 and 2022, respectively. Our investments continue to improve manufacturing productivity, expand capacity, reduce costs, provide environmental enhancements, upgrade information technology infrastructure and security and advanced technologies for existing facilities. The capital expenditure program for 2025 is estimated to be approximately 2.0% of revenues, including amounts approved in prior periods. Many of these projects are subject to review and cancellation at our option without incurring substantial charges.\nFor financial market risk impacting the Company, see Part II, Item 7A, \"Quantitative and Qualitative Disclosure About Market Risk.\"\n38\nTable of Contents\nCapitalization\nFinancing rates and conditions associated with future borrowings under our commercial paper program or term debt offerings will be affected by general financing conditions and our credit ratings. On April 10, 2024, Moody's announced that it upgraded our long-term credit rating from Baa1 to A3 and put the Company on positive outlook. On October 31, 2024, Standard and Poor's announced that it revised our long-term credit rating from BBB+ stable to BBB+ positive. As of December 31, 2024, our credit ratings were as follows:\n \nShort-term\nLong-term\nMoody's\nP-2\nA3\nStandard and Poor's\nA-2\nBBB+\nThe credit ratings set forth above are not a recommendation to buy, sell or hold securities and may be subject to revision or withdrawal by the assigning rating organization. Each rating should be evaluated independently of any other rating.\nOur public debt does not contain financial covenants and our revolving credit lines have a debt-to-total capital covenant of 65%. As of December 31, 2024, our debt-to-total capital ratio was significantly beneath this limit.\nContractual Obligations\nOur contractual cash obligations include required payments of long-term debt principal and interest, purchase obligations and expected obligations under our pension and postretirement benefit plans. In addition, we have required payments of operating leases, income taxes and expected obligations under the Funding agreement, environmental and product liability matters. For additional information regarding leases, income taxes, including unrecognized tax benefits, and contingent liabilities, see Note 10 \"Leases,\" Note 16 \"Income Taxes\" and Note 20 \"Commitments and Contingencies,\" respectively, to the Consolidated Financial Statements. Our material cash requirements include the following contractual and other obligations.\nDebt\nAt December 31, 2024, we had outstanding aggregate long-term debt principal payments of $4,802.2 million, with $452.2 million payable within 12 months. The amount payable within 12 months includes $295.0 million of debt redeemable at the option of the holder. The scheduled maturities of these bonds range between 2027 and 2028. Future interest payments on long-term debt total $2,348.6 million, with $220.5 million payable within 12 months. See Note 7, \"Debt and Credit Facilities,\" to the Consolidated Financial Statements for additional information regarding debt.\nPurchase Obligations\nPurchase obligations include commitments under legally enforceable contracts or purchase orders. At December 31, 2024, we had purchase obligations of $1,161.2 million, which are primarily payable within 12 months.\nPensions\nIt is our objective to contribute to the pension plans to ensure adequate funds are available in the plans to make benefit payments to plan participants and beneficiaries when required. We currently expect that we will contribute approximately $30 million to our enterprise plans worldwide in 2025. The timing and amounts of future contributions are dependent upon the funding status of the plans, which is expected to vary as a result of changes in interest rates, returns on underlying assets, and other factors. See Note 11, \"Pensions and Postretirement Benefits Other Than Pensions,\" to the Consolidated Financial Statements for additional information regarding pensions.\nPostretirement Benefits Other than Pensions\nWe fund postretirement benefit costs principally on a pay-as-you-go basis as medical costs are incurred by covered retiree populations. Benefit payments, which are net of expected plan participant contributions and Medicare Part D subsidy, are expected to be approximately $29 million in 2025. See Note 11, \"Pensions and Postretirement Benefits Other Than Pensions,\" to the Consolidated Financial Statements for additional information regarding postretirement benefits other than pensions.\n39\nTable of Contents\nSupplemental Guarantor Financial Information\nTrane Technologies plc (Plc or Parent Company) and certain of its 100% directly or indirectly owned subsidiaries provide guarantees of public debt issued by other 100% directly or indirectly owned subsidiaries of Plc. The following table shows our guarantor relationships as of December 31, 2024:\nParent, issuer or guarantors\nNotes issued\nNotes guaranteed\nTrane Technologies plc (Plc)\nNone\nAll registered notes and debentures\nTrane Technologies Irish Holdings Unlimited Company (TT Holdings)\nNone\nAll notes issued by TTFL and TTC HoldCo\nTrane Technologies Global Holding II Company (TT Global II)\nNone\nAll notes issued by TTFL and TTC HoldCo\nTrane Technologies Lux International Holding Company S.à.r.l. (TT International)\nNone\nAll notes issued by TTFL and TTC HoldCo\nTrane Technologies Americas Holding Corporation (TT Americas)\nNone\nAll notes issued by TTFL and TTC HoldCo\nTrane Technologies Financing Limited\n(TTFL)\n3.500% Senior Notes due 2026\n3.800% Senior Notes due 2029\n5.250% Senior Notes due 2033\n5.100% Senior Notes due 2034\n4.650% Senior Notes due 2044\n4.500% Senior Notes due 2049\nAll notes and debentures issued by TTC HoldCo and TTC\nTrane Technologies HoldCo Inc. (TTC HoldCo)\n3.750% Senior Notes due 2028\n5.750% Senior Notes due 2043\n4.300% Senior Notes due 2048\nAll notes issued by TTFL\nTrane Technologies Company LLC (TTC)\n7.200% Debentures due 2025\n6.480% Debentures due 2025\nPuttable debentures due 2027-2028\nAll notes issued by TTFL and TTC HoldCo\nEach subsidiary debt issuer and guarantor is owned 100% directly or indirectly by the Parent Company. Each guarantee is full and unconditional, and provided on a joint and several basis. There are no significant restrictions of the Parent Company, or any guarantor, to obtain funds from its subsidiaries, such as provisions in debt agreements that prohibit dividend payments, loans or advances to the parent by a subsidiary. The following tables present summarized financial information for the Parent Company and subsidiary debt issuers and guarantors on a combined basis (together, \"obligor group\") after elimination of intercompany transactions and balances based on the Company's legal entity ownerships and guarantees outstanding at December 31, 2024. Our obligor groups as of December 31, 2024 were as follows: Obligor group 1 consists of Plc, TT Holdings, TT Global II, TT International, TT Americas, TTFL, TTC HoldCo and TTC; Obligor group 2 consists of Plc, TTFL and TTC.\n40\nTable of Contents\nSummarized Statements of Earnings\nYear ended December 31, 2024\nIn millions\nObligor group 1\nObligor group 2\nNet revenues\n$\n— \n$\n— \nGross profit (loss)\n— \n— \nIntercompany interest and fees\n1,232.3 \n2,956.9 \nEarnings (loss) from continuing operations\n844.1 \n2,071.4 \nDiscontinued operations, net of tax\n(20.9)\n(23.7)\nNet earnings (loss)\n823.2 \n2,047.7 \nLess: Net earnings attributable to noncontrolling interests\n— \n— \nNet earnings (loss) attributable to Trane Technologies plc\n$\n823.2 \n$\n2,047.7 \nSummarized Balance Sheet\nDecember 31, 2024\nIn millions\nObligor group 1\nObligor group 2\nASSETS\nIntercompany receivables\n$\n265.6 \n$\n4,363.2 \nCurrent assets\n413.8 \n4,469.0 \nIntercompany notes receivable\n500.0 \n4,900.0 \nNoncurrent assets\n1,320.0 \n5,603.5 \nLIABILITIES\nIntercompany payables\n5,290.2 \n2,530.3 \nCurrent liabilities\n6,305.0 \n3,490.0 \nIntercompany notes payable\n4,000.0 \n4,000.0 \nNoncurrent liabilities\n9,014.6 \n7,650.2 \nCritical Accounting Estimates\nManagement's Discussion and Analysis of Financial Condition and Results of Operations are based upon our Consolidated Financial Statements, which have been prepared in accordance with U.S. GAAP. The preparation of financial statements in conformity with those accounting principles requires management to use judgment in making estimates and assumptions based on the relevant information available at the end of each period. These estimates and assumptions have a significant effect on reported amounts of assets and liabilities, revenue and expenses as well as the disclosure of contingent assets and liabilities because they result primarily from the need to make estimates and assumptions on matters that are inherently uncertain. Actual results may differ from these estimates. If updated information or actual amounts are different from previous estimates, the revisions are included in our results for the period in which they become known.\nThe following is a summary of certain accounting estimates and assumptions made by management that we consider critical.\n•\nGoodwill and indefinite-lived intangible assets – We have significant goodwill and indefinite-lived intangible assets on our balance sheet related to acquisitions. These assets are tested and reviewed annually during the fourth quarter for impairment or when there is a significant change in events or circumstances that indicate that the fair value of an asset is more likely than not less than the carrying amount of the asset. In addition, an interim impairment test is completed upon a triggering event or when there is a reorganization of reporting structure or disposal of all or a portion of a reporting unit.\nThe determination of estimated fair value requires us to make assumptions about estimated cash flows, including profit margins, long-term forecasts, discount rates and terminal growth rates. We developed these assumptions based on the market and geographic risks unique to each reporting unit. The estimates of fair value are based on the best information available as of the date of the assessment, which primarily incorporates management assumptions about expected future cash flows.\nAnnual Goodwill Impairment Test\nImpairment of goodwill is tested at the reporting unit level. The test compares the carrying amount of the reporting unit to its estimated fair value. If the estimated fair value of a reporting unit exceeds its carrying amount, goodwill of the \n41\nTable of Contents\nreporting unit is not impaired. To the extent that the carrying value of the reporting unit exceeds its estimated fair value, an impairment loss would be recognized for the amount by which the reporting unit's carrying amount exceeds its fair value, not to exceed the carrying amount of goodwill in that reporting unit.\nAs quoted market prices are not available for our reporting units, the calculation of their estimated fair value is determined using three valuation techniques: a discounted cash flow model (an income approach), a market-adjusted multiple of earnings or revenues (a market approach), and a similar transactions method (also a market approach). The discounted cash flow approach relies on our estimates of future cash flows and explicitly addresses factors such as timing, revenue growth rates, and margins, with due consideration given to forecasting risk. The market-adjusted multiple of earnings or revenues approach reflects the market's expectations for future growth and risk, with adjustments to account for differences between the guideline publicly traded companies and the subject reporting units. The similar transactions method considers prices paid in transactions that have recently occurred in our industry or in related industries. These valuation techniques are weighted 50%, 40% and 10%, respectively.\nUnder the income approach, we assumed a forecasted cash flow period of five to ten years with discount rates ranging from 8.5% to 15.5% and a terminal growth rate of 3.5% to 4.0%. Under the guideline public company method, we used multiples of earnings before interest, taxes, depreciation and amortization (EBITDA) or revenues based on the market information of comparable companies. Additionally, we compared the estimated aggregate fair value of our reporting units to our overall market capitalization. The excess of the estimated fair value over carrying value (expressed as a percentage of carrying value) for most reporting units exceeded 400%. The estimated fair value of one reporting unit formed upon the acquisition of Nuvolo in November 2023 was approximately equal to its carrying value. As of December 31, 2024, this reporting unit had $313.0 million of goodwill. A significant increase in the discount rate, decrease in the long-term growth rate, or substantial reductions in our end markets and volume assumptions could have a negative impact on the estimated fair value of this reporting unit.\nOther Indefinite-lived intangible assets\nOther intangible assets with indefinite useful lives are tested for impairment on an annual basis. The fair value of intangible assets with indefinite useful lives is determined on a relief from royalty methodology (income approach) which is based on the implied royalty paid, at an appropriate discount rate, to license the use of an asset rather than owning the asset. The present value of the after-tax cost savings (i.e., royalty relief) indicates the estimated fair value of the asset. Any excess of the carrying value over the estimated fair value would be recognized as an impairment loss equal to that excess.\nIn testing our other indefinite-lived intangible assets for impairment, we forecasted revenues for a period of five years with discount rates ranging from 8.5% to 14.0%, terminal growth rates of 3.5%, and royalty rates ranging from 1.0% to 4.5%. For significant indefinite-lived intangible assets, the excess of the estimated fair value over carrying value (expressed as a percentage of carrying value) exceeded 400%. A significant increase in the discount rate, decrease in the long-term growth rate, decrease in the royalty rate or substantial reductions in our end markets and volume assumptions could have a negative impact on the estimated fair values of any of our tradenames.\n•\nBusiness combinations - Acquisitions that meet the definition of a business combination are recorded using the acquisition method of accounting. We include the operating results of acquired entities from their respective dates of acquisition. We recognize and measure the identifiable assets acquired, liabilities assumed, including contingent consideration relating to potential earnout provisions and any non-controlling interest as of the acquisition date fair value. The valuation of intangible assets is determined using an income approach methodology. We use assumptions to value the intangible assets including projected cash flows, including revenue growth rates and margins, customer attrition rates, royalty rates, tax rates and discount rates. The excess, if any, of total consideration transferred in a business combination over the fair value of identifiable assets acquired, liabilities assumed, and any non-controlling interest is recognized as goodwill. Costs incurred as a result of a business combination other than costs related to the issuance of debt or equity securities are recorded in the period the costs are incurred.\nContingent consideration\nWe assess any contingent consideration included in the consideration paid of a business combination. The value recorded is based on estimates of future financial projections on revenue under various potential scenarios, in which a Monte Carlo simulation model runs many iterations based on comparable companies' revenue growth rates and their implied revenue volatilities. These cash flow projections are discounted with a risk adjusted rate. Each quarter until such contingent amounts are earned, the fair value of the liability is evaluated at each reporting period and adjusted as a component of operating expenses based on changes to the underlying assumptions. The estimates used to determine the fair value of the contingent consideration liability are subject to significant judgment, specifically revenue growth rates, implied revenue volatilities and discount rates.\n42\nTable of Contents\n•\nRevenue recognition – Revenue is recognized when control of a good or service promised in a contract (i.e., performance obligation) is transferred to a customer. Control is obtained when a customer has the ability to direct the use of and obtain substantially all of the remaining benefits from that good or service. A majority of our revenues are recognized at a point-in-time as control is transferred at a distinct point in time per the terms of a contract. However, a portion of our revenues are recognized over time as the customer simultaneously receives control as we perform work under a contract. For these arrangements, the cost-to-cost input method is used as it best depicts the transfer of control to the customer that occurs as we incur costs.\nThe transaction price allocated to performance obligations reflects our expectations about the consideration we will be entitled to receive from a customer. To determine the transaction price, variable and non-cash consideration are assessed as well as whether a significant financing component exists. We include variable consideration in the estimated transaction price when it is probable that significant reversal of revenue recognized would not occur when the uncertainty associated with variable consideration is subsequently resolved. We consider historical data in determining our best estimates of variable consideration, and the related accruals are recorded using the expected value method.\nWe enter into sales arrangements that contain multiple goods and services. For these arrangements, each good or service is evaluated to determine whether it represents a distinct performance obligation and whether the sales price for each obligation is representative of standalone selling price. If available, we utilize observable prices for goods or services sold separately to similar customers in similar circumstances to evaluate relative standalone selling price. List prices are used if they are determined to be representative of standalone selling prices. Where necessary, we ensure that the total transaction price is then allocated to the distinct performance obligations based on the determination of their relative standalone selling price at the inception of the arrangement.\nWe recognize revenue for delivered goods or services when the delivered good or service is distinct, control of the good or service has transferred to the customer, and only customary refund or return rights related to the goods or services exist. For extended warranties and long-term service agreements, revenue for these distinct performance obligations are recognized over time on a straight-line basis over the respective contract term.\n•\nIncome taxes – Deferred tax assets and liabilities are determined based on temporary differences between financial reporting and tax bases of assets and liabilities, applying enacted tax rates expected to be in effect for the year in which the differences are expected to reverse. We recognize future tax benefits, such as net operating losses and tax credits, to the extent that realizing these benefits is considered in our judgment to be more likely than not. We regularly review the recoverability of our deferred tax assets considering our historic profitability, projected future taxable income, timing of the reversals of existing temporary differences and the feasibility of our tax planning strategies. Where appropriate, we record a valuation allowance with respect to a future tax benefit.\nThe provision for income taxes involves a significant amount of management judgment regarding interpretation of relevant facts and laws in the jurisdictions in which we operate. Future changes in applicable laws, projected levels of taxable income, and tax planning could change the effective tax rate and tax balances recorded by us. In addition, tax authorities periodically review income tax returns filed by us and can raise issues regarding our filing positions, timing and amount of income or deductions, and the allocation of income among the jurisdictions in which we operate. A significant period of time may elapse between the filing of an income tax return and the ultimate resolution of an issue raised by a revenue authority with respect to that return. We believe that we have adequately provided for any reasonably foreseeable resolution of these matters. We will adjust our estimate if significant events so dictate. To the extent that the ultimate results differ from our original or adjusted estimates, the effect will be recorded in the provision for income taxes in the period that the matter is finally resolved.\n•\nEmployee benefit plans – We provide a range of benefits to eligible employees and retirees, including pensions, postretirement and postemployment benefits. Determining the cost associated with such benefits is dependent on various actuarial assumptions including discount rates, expected return on plan assets, compensation increases, mortality, turnover rates and healthcare cost trend rates. Actuarial valuations are performed to determine expense in accordance with GAAP. Actual results may differ from the actuarial assumptions and are generally accumulated and amortized into earnings over future periods. We review our actuarial assumptions at each measurement date and make modifications to the assumptions based on current rates and trends, if appropriate. The discount rate, the rate of compensation increase and the expected long-term rates of return on plan assets are determined as of each measurement date. We believe that the assumptions utilized in recording our obligations under our plans are reasonable based on input from our actuaries, outside investment advisors and information as to assumptions used by plan sponsors.\n43\nTable of Contents\nChanges in any of the assumptions can have an impact on the net periodic pension cost or postretirement benefit cost. Estimated sensitivities to the expected 2025 net periodic pension cost of a 0.25% rate decline in the two basic assumptions are as follows: the decline in the discount rate would increase expense by $0.2 million and the decline in the estimated return on assets would increase expense by $4.8 million. A 0.25% rate decrease in the discount rate for postretirement benefits would increase expected 2025 net periodic postretirement benefit cost by $0.3 million.\nRecent Accounting Pronouncements\nSee Note 2, \"Summary of Significant Accounting Policies\" to the Consolidated Financial Statements for a discussion of recent accounting pronouncements.",
  "item2": null
}