{
  "source_file": "ttwo-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    Management's Discussion and Analysis of Financial Condition and Results of Operations\nCAUTIONARY NOTE ABOUT FORWARD-LOOKING STATEMENTS\nThe statements contained herein, which are not historical facts, including statements relating to Take-Two Interactive Software, Inc.'s (\"Take-Two,\" the \"Company,\" \"we,\" \"us,\" or similar pronouns) outlook, are considered forward-looking statements under federal securities laws and may be identified by words such as \"anticipates,\" \"believes,\" \"estimates,\" \"expects,\" \"intends,\" \"plans,\" \"potential,\" \"predicts,\" \"projects,\" \"seeks,\" \"should,\" \"will,\" or words of similar meaning and include, but are not limited to, statements regarding the outlook for our future business and financial performance. Such forward-looking statements are based on the current beliefs of our management as well as assumptions made by and information currently available to them, which are subject to inherent uncertainties, risks, and changes in circumstances that are difficult to predict. Actual outcomes and results may vary materially from these forward-looking statements based on a variety of risks and uncertainties including risks relating to the timely release and significant market acceptance of our games; the risks of conducting business internationally, including as a result of unforeseen geopolitical events; the impact of changes in interest rates by the Federal Reserve and other central banks, including on our short-term investment portfolio; the impact of inflation; volatility in foreign currency exchange rates; our dependence on key management and product development personnel; our dependence on our NBA 2K and Grand Theft Auto products and our ability to develop other hit titles; our ability to leverage opportunities on PlayStation®5 and Xbox Series X|S; factors affecting our mobile business, such as player acquisition costs; the ability to maintain acceptable pricing levels on our games; and other risks included herein; as well as, but not limited to, the risks and uncertainties discussed under the heading \"\nRisk\n Factors\n\" included in Part I, Item 1A of our Annual Report on Form 10-K for the fiscal year ended March 31, 2025 and our other periodic filings with the Securities and Exchange Commission. All forward-looking statements are qualified by these cautionary statements and speak only as of the date they are made. We undertake no obligation to update any forward-looking statement, whether as a result of new information, future events, or otherwise.\nOur Management's Discussion and Analysis of Financial Condition and Results of Operations (\"MD&A\") is provided in addition to the accompanying Condensed Consolidated Financial Statements and notes to assist readers in understanding our results of operations, financial condition, and cash flows. The following discussion should be read in conjunction with the MD&A and our annual Consolidated Financial Statements and the notes thereto included in our Annual Report on Form 10-K for the fiscal year ended March 31, 2025. All figures are in millions, except per share amounts or as otherwise noted.\nOverview\nOur Business\nWe are a leading developer, publisher, and marketer of interactive entertainment for consumers around the globe. We develop, operate, and publish products principally through Rockstar Games, 2K, and Zynga. Our products are currently designed for console gaming systems, mobile, including smartphones and tablets, and PC. We deliver our products through physical retail, digital download, online platforms, and cloud streaming services. \nOur strategy is to create hit entertainment experiences, delivered on every platform relevant to our audience through a variety of sound business models. Our pillars - creativity, innovation, and efficiency - guide us as we strive to create the highest quality, most captivating experiences for our consumers. We believe that our player-first approach and commitment to creativity and innovation are distinguishing strengths, enabling us to differentiate our products in the marketplace by combining advanced technology with compelling gameplay that provide unique, deeply engaging experiences.\nOur teams have established a portfolio of proprietary software content for the major hardware and mobile platforms, and we aim to be at the forefront of technological innovation. We have a diverse portfolio that spans all key platforms and numerous genres, including action, adventure, family, casual, hyper-casual, role-playing, shooter, social casino, sports, and strategy. This enables us to appeal to a wide array of consumers and demographic groups worldwide, ranging from game enthusiasts to casual gamers. Most of our intellectual property is internally owned and developed, which we believe best positions us financially and competitively. In addition, we license selectively some highly recognizable renowned brands, especially in sports entertainment. We support our products with innovative marketing programs created by our internal global marketing teams.\nWe derive substantially all of our revenue from the sale of our interactive entertainment content, which includes internally developed software titles and software titles developed by third parties, in-game virtual items and advertising, and live services on console, mobile, and PC. Operating margins are dependent in part upon our ability to release new, commercially successful software products and to manage effectively their development and marketing costs. We have internal development studios located in Australia, Canada, China, Czech Republic, Finland, Germany, Hungary, India, Serbia, South Korea, Spain, Turkey, the United Kingdom (\"U.K.\"), and the United States (\"U.S.\").\n23\nRockstar Games.\n    Rockstar Games' strategy is to develop a limited number of titles that are known for their quality and longevity in the market for which they can create sequels and incremental revenue opportunities through virtual currency, add-on content, and in-game purchases. Software titles published by our Rockstar Games label are primarily internally developed. We expect Rockstar Games, our wholly-owned publisher of the \nGrand Theft Auto\n, \nL.A. Noire\n, \nMax Payne\n, \nMidnight Club\n, \nRed Dead Redemption\n, and other popular franchises, to continue to be a leader in the action/adventure product category and to create groundbreaking entertainment. We believe that Rockstar Games has established a uniquely original, popular, cultural phenomenon with its \nGrand Theft Auto\n series, which is the interactive entertainment industry's most iconic and critically acclaimed brand and has sold-in over 455 million units worldwide. Our most recent installment, \nGrand Theft Auto V\n, which was released in 2013, has sold-in over 220 million units worldwide and includes access to \nGrand Theft Auto Online\n. Rockstar Games offers its GTA+ membership program, which engages its player community with an array of rotating benefits, including access to classic Rockstar Games titles. Rockstar Games continues to invest in the franchise and announced that \nGrand Theft Auto VI\n is planned for release on November 19, 2026, during our fiscal year 2027. The label released its first trailer for the title\n \nin December 2023 and the second in May 2025, and will share more details in the future. \nRed\n \nDead Redemption 2\n,\n \nwhich has been a critical and commercial success that set numerous entertainment industry records, has sold-in more than 75 million units worldwide. Rockstar Games continues to expand on its established series by developing sequels, offering downloadable episodes, and providing additional content. Rockstar Games' titles are published across all key platforms, including mobile.\n2K.\n    Our 2K label publishes a variety of popular entertainment properties across all key platforms and across a range of genres including shooter, action, role-playing, strategy, sports, and family/casual entertainment. In recent years, 2K has expanded its offerings to include several new franchises that are expected to enhance and diversify its slate of games and provide opportunities for sequels and additional content. We expect 2K to continue to develop new, successful franchises in the future. 2K's internally owned and developed franchises include the critically acclaimed, multi-million unit selling \nBioShock\n, \nMafia\n, \nSid Meier's Civilization\n, and \nXCOM\n franchises, as well as the \nBorderlands \nand\n Tiny Tina's Wonderlands\n franchises, which we now own following our June 2024 acquisition of Gearbox Entertainment. 2K's realistic sports simulation titles include our flagship \nNBA 2K\n series, which continues to be the top-ranked NBA basketball video game, the \nWWE 2K\n professional wrestling series, \nPGA TOUR 2K\n, and \nTopSpin 2K\n. 2K also publishes mobile titles, including \nWWE SuperCard\n and\n NBA 2K All-Stars\n.\n    Zynga.\n   Our Zynga label publishes popular free-to-play mobile games that deliver high quality, deeply engaging entertainment experiences and generates revenue from in-game sales and in-game advertising. Zynga's strategy is to have numerous games in concept development and to determine which titles are best suited for soft and worldwide launch based on the achievement of various milestones and key performance indicator (KPI) thresholds. Zynga's diverse portfolio of popular game franchises has been downloaded more than ten billion times, including \nCSR Racing\n, \nDragon City\n, \nEmpires & Puzzles\n, \nFarmVille\n, \nGame of Thrones: Legends,\n \nGolf Rival\n, \nHair Challenge, Harry Potter: Puzzles & Spells\n, \nHigh Heels!,\n \nMatch Factory!\n, \nMerge Dragons!\n, \nMerge Magic!\n, \nMonster Legends\n, \nScrew Jam, Seat Away, Toon Blast\n, \nTop Eleven\n, \nToy Blast\n, \nTwo Dots\n, \nWords With Friends\n, and \nZynga Poker.\nTrends and Factors Affecting our Business\nProduct Release Schedule.\n    Our financial results are affected by the timing of our product releases and the commercial success of our titles. Generally, a significant portion of our revenue has been derived from a few popular franchises, particularly around new releases within those franchises, some of which have annual or biennial releases. Additionally, our \nGrand Theft Auto\n products in particular have historically accounted for a significant portion of our revenue. Sales of \nGrand Theft Auto\n products generated 12.0% of our net revenue for the six months ended September 30, 2025. The timing of our \nGrand Theft Auto\n product releases may affect our financial performance on a quarterly and annual basis. Rockstar plans to release \nGrand Theft Auto VI\n on November 19, 2026.\nDuring fiscal year 2026, 2K released \nMafia: The Old Country,\n \nNBA 2K26\n, and \nBorderlands 4.\nWe have announced that, during the remainder of fiscal year 2026, 2K plans to release \nWWE 2K26.\nEconomic Environment and Retailer Performance.\n    We continue to monitor various macroeconomic and geopolitical factors, such as global tariff policies, that may affect our business in several areas, including consumer demand, inflation, pricing pressure on our products and third party hardware platforms, credit quality of our receivables, and foreign currency exchange rates. Actions we have taken to date and other potential actions we may take in the future in response to these factors could result in negative impacts in future periods.\nThe economic environment has affected our customers in the past and may do so in the future. There has been increased consolidation in our industry, which is extremely competitive, and larger, better capitalized competitors will be in a stronger position to withstand prolonged periods of economic downturn and sustain their business through periods of financial \n24\nvolatility. Also, bankruptcies or consolidations of our large retail customers could hurt our business, due to uncollectible accounts receivable and the concentration of purchasing power among the remaining large retailers. \nHardware Platforms.\n    We derive a substantial portion of our revenue from the sale of products made for video game consoles manufactured by third parties. Such console revenue comprised 38.8% of our net revenue for the six months ended September 30, 2025. The success of our business is dependent upon consumer acceptance of these platforms and the continued growth in the installed base of these platforms, which could be impacted by global economic factors, including global tariff policies. When new hardware platforms are introduced, demand for interactive entertainment developed for older platforms typically declines, which may negatively affect our business during the market transition to the new consoles. The latest Sony and Microsoft consoles provide \"backwards compatibility\" (i.e., the ability to play games for the previous generation of consoles). The inclusion of such features on new consoles could mitigate the risk of such a decline. However, we cannot be certain how backwards compatibility will affect demand for our products. Further, events beyond our control may impact the availability of these new consoles, which may also affect demand for our products. We manage our product delivery on each current and future platform in a manner we believe to be most effective to maximize our revenue opportunities and achieve the desired return on our investments in product development. Accordingly, our strategy for these platforms is to focus our development efforts on a select number of the highest quality titles.\n    Online Content and Digital Distribution.\n    We provide a variety of online delivered products, including direct digital downloads of our titles, and access to additional offerings through virtual currency, add-on content, in-game purchases, and in-game advertising, which drive ongoing engagement and incremental revenue from recurrent consumer spending on our titles. Net revenue from digital online channels comprised 96.7% of our net revenue for the six months ended September 30, 2025. We expect online delivery of games and game offerings to continue to be the primary part of our business over the long term. \nA significant portion of our mobile titles are distributed, marketed, and promoted through third parties, primarily Apple’s App Store and the Google Play Store. Virtual items for our mobile games are purchased principally through the payment processing systems of these platform providers, as well as our direct-to-consumer commerce platform. We generate a significant portion of our net revenue through the Apple and Google platforms and expect to continue to do so for the foreseeable future. Apple and Google generally have the discretion to set the amounts of their platform fees and change their platforms’ terms of service and other policies with respect to us or other developers at their sole discretion, and those changes may be unfavorable to us. These platform fees are recorded as cost of revenue as incurred. Further, as a result of the platform fees associated with online game sales, our mobile net revenue generally generates a lower gross margin percentage than our Console or PC revenue. Accordingly, the overall product mix between mobile and other game sales may affect our gross margin percentage. We are also continuing to expand our direct-to-consumer efforts more meaningfully across our mobile portfolio to enhance profitability.\nPlayer acquisition costs.\n    Principally for our mobile titles, we use advertising and other forms of player acquisition and retention to grow and retain our player audience. These expenditures, which are recorded within Selling and marketing in our Condensed Consolidated Statements of Operations, generally relate to the promotion of new game launches and ongoing performance-based programs to drive new player acquisition and lapsed player reactivation. Over time, the effectiveness or cost of these acquisition and retention-related programs may change, affecting our operating results.\nCritical Accounting Policies and Estimates\nOur most critical accounting policies, which are those that require significant judgment, include revenue recognition, capitalization and recognition of software development costs and licenses, fair value estimates including valuation of goodwill and intangible assets, valuation and recognition of stock-based compensation, and income taxes. In-depth descriptions of our other critical accounting policies and estimates can be found in our \nAnnual Report on Form 10-K\n for the fiscal year ended March 31, 2025.\nRecently Adopted and Recently Issued Accounting Pronouncements\nSee \nNote 1 - Basis of Presentation and Significant Accounting Policies\n for further discussion. \nOperating Metric\nNet Bookings\nWe monitor Net Bookings as a key operating metric in evaluating the performance of our business. Net Bookings is defined as the net amount of products and services sold digitally or sold-in physically during the period and includes licensing fees, merchandise, in-game advertising, and publisher incentives. Net Bookings were as follows:\n25\nThree Months Ended September 30,\nSix Months Ended September 30,\n2025\n2024\nIncrease/\n(decrease)\n% Increase/\n(decrease)\n2025\n2024\nIncrease/\n(decrease)\n% Increase/\n(decrease)\nNet Bookings\n$\n1,960.5\n \n$\n1,474.9 \n$\n485.6 \n32.9 \n%\n$\n3,383.6\n \n$\n2,693.1 \n$\n690.5 \n25.6 \n%\nFor the three months ended September 30, 2025, Net Bookings increased as compared to the prior year period. The increase was primarily driven by higher Net Bookings from our \nNBA 2K \nfranchise; our \nBorderlands\n franchise, the latest installment of which, \nBorderlands 4\n, released in September 2025; \nColor Block Jam\n, which released in November 2024; and our \nMafia \nfranchise, the latest installment of which, \nMafia: The Old Country,\n released in August 2025.\nFor the six months ended September 30, 2025, Net Bookings increased as compared to the prior year period. The increase was primarily driven by higher Net Bookings from our \nNBA 2K \nand \nBorderlands\n franchises, \nColor Block Jam,\n and our \nMafia \nfranchise.\nResults of Operations\nThe following tables set forth, for the periods indicated, our Condensed Consolidated Statements of Operations, net revenue by platform, net revenue by distribution channel, and net revenue by content type:\n \nThree Months Ended September 30,\nSix Months Ended September 30,\n2025\n2024\n2025\n2024\nTotal net revenue\n$\n1,773.8\n \n100.0\n \n%\n$\n1,353.1 \n100.0 \n%\n$\n3,277.6\n \n100.0\n \n%\n$\n2,691.3 \n100.0 \n%\nCost of revenue\n793.3\n \n44.7\n \n%\n625.2 \n46.2 \n%\n1,352.1\n \n41.3\n \n%\n1,192.3 \n44.2 \n%\nGross profit\n980.5\n \n55.3\n \n%\n727.9 \n53.8 \n%\n1,925.5\n \n58.7\n \n%\n1,499.0 \n55.8 \n%\nSelling and marketing\n536.6\n \n30.3\n \n%\n461.3 \n34.1 \n%\n945.4\n \n28.8\n \n%\n892.7 \n33.2 \n%\nResearch and development\n268.0\n \n15.1\n \n%\n246.7 \n18.2 \n%\n529.4\n \n16.2\n \n%\n466.5 \n17.3 \n%\nGeneral and administrative\n225.0\n \n12.7\n \n%\n253.0 \n18.7 \n%\n432.0\n \n13.2\n \n%\n463.5 \n17.2 \n%\nDepreciation and amortization\n48.8\n \n2.8\n \n%\n47.3 \n3.5 \n%\n99.2\n \n3.0\n \n%\n92.1 \n3.4 \n%\nBusiness reorganization\n0.1\n \n—\n \n%\n16.8 \n1.2 \n%\n(4.1)\n(0.1)\n%\n66.3 \n2.5 \n%\nTotal operating expenses\n1,078.5\n \n60.9\n \n%\n1,025.1 \n74.5 \n%\n2,001.9\n \n61.1\n \n%\n1,981.1 \n73.6 \n%\nLoss from operations\n(98.0)\n(5.6)\n%\n(297.2)\n(20.7)\n%\n(76.4)\n(2.4)\n%\n(482.1)\n(17.8)\n%\nInterest and other, net\n(17.5)\n(1.0)\n%\n(27.1)\n(2.0)\n%\n(52.9)\n(1.6)\n%\n(54.4)\n(2.1)\n%\nLoss before income taxes\n(115.5)\n(6.6)\n%\n(324.3)\n(22.7)\n%\n(129.3)\n(4.0)\n%\n(536.5)\n(19.9)\n%\nProvision for income taxes\n18.4\n \n1.0\n \n%\n41.2 \n3.0 \n%\n16.5\n \n0.5\n \n%\n91.0 \n3.4 \n%\nNet loss\n$\n(133.9)\n(7.6)\n%\n$\n(365.5)\n(25.7)\n%\n$\n(145.8)\n(4.5)\n%\n$\n(627.5)\n(23.3)\n%\nThree Months Ended September 30,\nSix Months Ended September 30,\n2025\n2024\n2025\n2024\nNet revenue by platform:\nMobile\n$\n821.6\n \n46.3\n \n%\n$\n740.2 \n54.7 \n%\n$\n1,623.3\n \n49.5\n \n%\n$\n1,462.7 \n54.3 \n%\nConsole\n720.0\n \n40.6\n \n%\n491.1 \n36.3 \n%\n1,270.6\n \n38.8\n \n%\n1,000.0 \n37.2 \n%\nPC and other\n232.2\n \n13.1\n \n%\n121.8 \n9.0 \n%\n383.7\n \n11.7\n \n%\n228.6 \n8.5 \n%\nNet revenue by distribution channel:\nDigital online\n$\n1,693.1\n \n95.5\n \n%\n$\n1,300.0 \n96.1 \n%\n$\n3,169.7\n \n96.7\n \n%\n$\n2,595.5 \n96.4 \n%\nPhysical retail and other\n80.7\n \n4.5\n \n%\n53.1 \n3.9 \n%\n107.9\n \n3.3\n \n%\n95.8 \n3.6 \n%\nNet revenue by content:\nRecurrent consumer spending\n$\n1,275.9\n \n71.9\n \n%\n$\n1,079.0 \n79.7 \n%\n$\n2,532.0\n \n77.3\n \n%\n$\n2,176.7 \n80.9 \n%\nFull game and other\n497.9\n \n28.1\n \n%\n274.1 \n20.3 \n%\n745.6\n \n22.7\n \n%\n514.6 \n19.1 \n%\n26\nThree Months Ended September 30, 2025 Compared to September 30, 2024 \n2025\n%\n2024\n%\nIncrease/\n(decrease)\n% Increase/\n(decrease)\nTotal net revenue\n$\n1,773.8\n \n100.0\n \n%\n$\n1,353.1 \n100.0 \n%\n$\n420.7 \n31.1 \n%\nProduct costs\n229.3\n \n12.9\n \n%\n212.5 \n15.7 \n%\n16.8 \n7.9 \n%\nSoftware development costs and royalties \n(1)\n172.1\n \n9.7\n \n%\n64.9 \n4.8 \n%\n107.2 \n165.2 \n%\nGame intangibles\n158.8\n \n9.0\n \n%\n173.4 \n12.8 \n%\n(14.6)\n(8.4)\n%\nLicenses\n154.4\n \n8.7\n \n%\n97.2 \n7.2 \n%\n57.2 \n58.8 \n%\nInternal royalties\n78.7\n \n4.4\n \n%\n77.2 \n5.7 \n%\n1.5 \n1.9 \n%\nCost of revenue\n793.3\n \n44.7\n \n%\n625.2 \n46.2 \n%\n168.1 \n26.9 \n%\nGross profit\n$\n980.5\n \n55.3\n \n%\n$\n727.9 \n53.8 \n%\n$\n252.6 \n34.7 \n%\n(1)\n Includes $4.8 and $3.1 of stock-based compensation expense in 2025 and 2024, respectively, in software development costs and royalties.\nFor the three months ended September 30, 2025, net revenue increased by $420.7 as compared to the prior year period. The increase was primarily driven by higher net revenue of (i) $148.7 from our \nBorderlands \nfranchise, the latest installment of which, \nBorderlands 4\n, released in September 2025, (ii) $127.9 from our \nNBA 2K \nfranchise, (iii) $72.8 from \nColor Block Jam\n, which released in November 2024, and (iv) $55.9 from our \nMafia\n franchise, the latest installment of which, \nMafia: The Old Country\n released in August 2025.\nNet revenue from mobile increased by $81.4 and accounted for 46.3% of our total net revenue for the three months ended September 30, 2025, as compared to 54.7% for the prior year period. The increase was primarily driven by higher net revenue from \nColor Block Jam\n. Net revenue from console games increased by $228.9 and accounted for 40.6% of our total net revenue for the three months ended September 30, 2025, as compared to 36.3% for the prior year period. The increase was primarily driven by higher net revenue from our \nNBA 2K, Borderlands\n, and \nMafia \nfranchises. Net revenue from PC and other increased by $110.4 and accounted for 13.1% of our total net revenue for the three months ended September 30, 2025, as compared to 9.0% for the prior year period. The increase was primarily driven by higher net revenue from our \nBorderlands\n, \nMafia\n,\n \nand\n NBA 2K\n franchises\n.\nRecurrent consumer spending (\"RCS\") is generated from ongoing consumer engagement and includes revenue from virtual currency, add-on content, in-game purchases, and in-game advertising. Net revenue from RCS increased by $196.9 and accounted for 71.9% of net revenue for the three months ended September 30, 2025, as compared to 79.7% of net revenue for the prior year period. The increase was primarily driven by higher net revenue from our \nNBA 2K \nfranchise and \nColor Block Jam\n. Net revenue from full game and other increased by $223.8 and accounted for 28.1% of net revenue for the three months ended September 30, 2025 as compared to 20.3% of net revenue for the prior year period. The increase was primarily driven by higher net revenue from our \nBorderlands \nand \nMafia \nfranchises.\nNet revenue from digital online channels increased by $393.1 and accounted for 95.5% of our total net revenue for the three months ended September 30, 2025, as compared to 96.1% for the prior year period. The increase was primarily driven by higher net revenue from our \nNBA 2K \nand\n Borderlands \nfranchises, \nColor Block Jam\n, and our \nMafia \nfranchise\n.\n Net revenue from physical retail and other channels increased by $27.6 and accounted for 4.5% of our total net revenue for the three months ended September 30, 2025, as compared to 3.9% for the same period in the prior year period. The increase was primarily driven by higher net revenue from our \nBorderlands \nand \nMafia \nfranchises, partially offset by lower net revenue from our \nNBA 2K\n franchise.\nGross profit as a percentage of net revenue for the three months ended September 30, 2025 was 55.3% as compared to 53.8% for the prior year period. The increase in gross profit as a percentage of net revenue was primarily driven by (i) lower amortization of intangible assets primarily due to impairments in the prior year and (ii) lower product costs as a percentage of net revenues, partially offset by higher amortization of capitalized software and development costs primarily due to the timing of releases.\nChanges in foreign currency exchange rates increased net revenue by $2.5 and increased gross profit by $5.6 for the three months ended September 30, 2025 as compared to the prior year period.\n27\nOperating Expenses\n2025\n% of net revenue\n2024\n% of net revenue\nIncrease/\n(decrease)\n% Increase/\n(decrease)\nSelling and marketing\n$\n536.6\n \n30.3\n \n%\n$\n461.3 \n34.1 \n%\n$\n75.3 \n16.3 \n%\nResearch and development\n268.0\n \n15.1\n \n%\n246.7 \n18.2 \n%\n21.3 \n8.6 \n%\nGeneral and administrative\n225.0\n \n12.7\n \n%\n253.0 \n18.7 \n%\n(28.0)\n(11.1)\n%\nDepreciation and amortization\n48.8\n \n2.8\n \n%\n47.3 \n3.5 \n%\n1.5 \n3.2 \n%\nBusiness reorganization\n0.1\n \n—\n \n%\n16.8 \n1.2 \n%\n(16.7)\n(99.4)\n%\nTotal operating expenses\n(1)\n$\n1,078.5\n \n60.9\n \n%\n$\n1,025.1 \n74.5 \n%\n$\n53.4 \n5.2 \n%\n(1)\n Includes stock-based compensation expense, which was allocated as follows:\n2025\n2024\nSelling and marketing\n$\n25.2\n \n$\n24.5 \nResearch and development\n25.1\n \n26.2 \nGeneral and administrative\n40.8\n \n32.4 \nChanges in foreign currency exchange rates increased total operating expenses by $6.0 for the three months ended September 30, 2025, as compared to the prior year period.\nSelling and marketing\nSelling and marketing expenses increased by $75.3 for the three months ended September 30, 2025, as compared to the prior year period, primarily driven by (i) higher overall marketing expense for our \nBorderlands \nfranchise, and \nColor Block Jam\n,\n \npartially offset by lower overall marketing expense for \nMatch Factory!\n, \nScrew Jam\n and \nGame of Thrones: Legends\n, and (ii) higher personnel expense due to higher performance-based compensation\n.\nResearch and development\nResearch and development expenses increased by $21.3 for the three months ended September 30, 2025, as compared to the prior year period, primarily driven by higher performance-based compensation, partially offset by lower IT-related expenses for cloud-based services and IT infrastructure.\nGeneral and administrative\nGeneral and administrative expenses decreased by $28.0 for the three months ended September 30, 2025, as compared to the prior year period, primarily driven by lower legal and settlement fees related to the IBM case against Zynga in the prior year, partially offset by higher personnel expense due to higher performance-based compensation.\nDepreciation and amortization\nDepreciation and amortization expenses increased by $1.5 for the three months ended September 30, 2025, as compared to the prior year period, primarily driven by (i) higher IT infrastructure expense and (ii) higher leasehold improvement expense for office buildouts, partially offset by lower amortization related to acquired intangible assets due to prior year impairments.\nBusiness reorganization\nBusiness reorganization decreased by $16.7 for the three months ended September 30, 2025, as compared to the prior year period, primarily driven by the completion of the 2024 Plan.\nInterest and other, net\nInterest and other, net was an expense of $17.5 for the three months ended September 30, 2025, as compared to an expense of $27.1 for the prior year period. The net decrease in expense was primarily driven by lower interest expense related to our debt transactions (refer to \nNote 9 - Debt\n) and foreign currency gains in the current period compared to foreign currency losses in the prior year period.\nProvision for income taxes\nThe provision for income taxes for the three months ended September 30, 2025 is based on our projected annual effective tax rate for fiscal year 2026, adjusted for specific items that are required to be recognized in the period in which they are incurred. The provision for income taxes was $18.4 for the three months ended September 30, 2025, as compared to the provision for income taxes of $41.2 for the prior year period. \n28\nWhen compared to the statutory rate of 21%, the effective tax rate of (15.9)% for the three months ended September 30, 2025 was primarily driven by tax expense of $33.7 related to an increase in the U.S. and international valuation allowances and $16.0 related to geographic mix of earnings and changes in reserves, offset by tax benefits of $10.3 from tax credits.\nIn the prior year period, when compared to the statutory rate of 21.0%, the effective tax rate of (12.7)% for the three months ended September 30, 2024 was due primarily to tax expense of $104.9 related to an increase in valuation allowance and tax expense of $9.9 related to geographic mix of earnings offset by benefits of $17.2 from tax credits.\nThe change in the effective tax rate, when compared to the prior year period's effective tax rate, is primarily driven by lower tax expense from changes in the U.S. and international valuation allowance, lower tax benefits from tax credits, offset by higher tax expense from employee stock-based compensation and lower tax expense from geographic mix of earnings and changes in reserves.\nThe accounting for share-based compensation will increase or decrease our effective tax rate based upon the difference between our share-based compensation expense and the deductions taken on our tax return, which depends on the stock price at the time of the employee award vesting.\nWe anticipate that additional excess tax benefits or shortfalls from employee stock compensation, tax credits, and changes in our geographic mix of earnings could have a significant impact on our effective tax rate in the future. In addition, we are regularly examined by domestic and foreign taxing authorities. Examinations may result in tax assessments in excess of amounts claimed and the payment of additional taxes. We believe our tax positions comply with applicable tax law, and that we have adequately provided for reasonably foreseeable tax assessments. It is possible that settlement of audits or the expiration of the statute of limitations could have an impact on our effective tax rate in future periods.\nOn July 4, 2025, the One Big Beautiful Bill Act (\"OBBB\") was signed into law and includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework, accelerated deductions for domestic research expenditures, permanently reinstating 100% bonus depreciation, and modifications to tax credits. The legislation has multiple effective dates, with certain provisions effective in fiscal year ending March 31, 2026 and others implemented in future periods. The impact of OBBB has been reflected in our estimated annualized effective tax rate, and reduced our forecasted U.S. cash tax liability. It did not, however, impact our U.S. deferred tax assets or liabilities since we continue to maintain a full valuation allowance against U.S. net deferred tax assets.\nThe American Rescue Plan Act of 2021 (the “ARPA”), among other things, includes provisions to expand the IRC Section 162(m) disallowance for deduction of certain compensation paid by publicly held corporations. Effective for tax years starting after December 31, 2026 (April 1, 2027 for the Company), the ARPA expands the limitation to cover the next five most highly compensated employees. The ARPA did not have a material impact on our Condensed Consolidated Financial Statements for the three months ended September 30, 2025. We continue to evaluate the potential impact the ARPA may have on our operations and Consolidated Financial Statements in future periods.\nThe Inflation Reduction Act of 2022 (the “Inflation Reduction Act”) includes a corporate alternative minimum tax (\"CAMT\") of 15% on the adjusted financial statement income (AFSI) of corporations with an average AFSI exceeding $1.0 billion over a consecutive three-year period. It is possible that the CAMT could result in an additional tax liability over the regular federal corporate tax liability in a particular year based on differences between book and taxable income. We do not estimate any tax liability relating to CAMT for the current fiscal year. We will continue to evaluate the potential impact the Inflation Reduction Act may have on our operations and Consolidated Financial Statements in future periods.\nThe Organization for Economic Co-operation and Development (\"OECD\") has proposed a global minimum tax of 15% of reported profits, referred to as Pillar Two. Many countries have already implemented or are taking steps to implement Pillar Two. Although the model rules provide a framework for applying the minimum tax, countries may enact Pillar Two slightly differently than the model rules and on different timelines. Pillar Two could result in additional tax liability over the regular corporate tax liability in a particular jurisdiction to the extent tax expense is less than a 15% minimum rate. The impact of Pillar Two was not material to the tax provision for the three months ended September 30, 2025. We will continue to evaluate the impact Pillar Two and any additional guidance may have on our results and operations.\nNet loss and Loss per share\nFor the three months ended September 30, 2025, net loss was $133.9, as compared to a net loss of $365.5 in the prior year period. Basic and diluted loss per share for the three months ended September 30, 2025 was $0.73, as compared to basic and diluted loss per share of $2.08 in the prior year period. Basic weighted average shares of 184.6 were 9.2 shares higher as compared to the prior year period basic weighted average shares, primarily due to our equity issuance, as well as normal stock compensation activity, including vests, grants, and forfeitures in the prior year being fully outstanding in the current year. See \nNote 10 - Loss Per Share\n to our Condensed Consolidated Financial Statements for additional information.\n29\nSix Months Ended September 30, 2025 Compared to September 30, 2024 \n2025\n%\n2024\n%\nIncrease/\n(decrease)\n% Increase/\n(decrease)\nTotal net revenue\n$\n3,277.6\n \n100.0\n \n%\n$\n2,691.3 \n100.0 \n%\n$\n586.3 \n21.8 \n%\nProduct costs\n439.7\n \n13.4\n \n%\n415.8 \n15.4 \n%\n23.9 \n5.7 \n%\nGame intangibles\n317.3\n \n9.7\n \n%\n336.9 \n12.5 \n%\n(19.6)\n(5.8)\n%\nLicenses\n225.3\n \n6.9\n \n%\n152.3 \n5.7 \n%\n73.0 \n47.9 \n%\nSoftware development costs and royalties \n(1)\n202.2\n \n6.2\n \n%\n141.1 \n5.2 \n%\n61.1 \n43.3 \n%\nInternal royalties\n167.6\n \n5.1\n \n%\n146.2 \n5.4 \n%\n21.4 \n14.6 \n%\nCost of revenue\n1,352.1\n \n41.3\n \n%\n1,192.3 \n44.2 \n%\n159.8 \n13.4 \n%\nGross profit\n$\n1,925.5\n \n58.7\n \n%\n$\n1,499.0 \n55.8 \n%\n$\n426.5 \n28.5 \n%\n(1)\n Includes $(36.2) and $6.0 of stock-based compensation expense in 2025 and 2024, respectively, in software development costs and royalties.\nFor the six months ended September 30, 2025, net revenue increased by $586.3 as compared to the prior year period. The increase was primarily driven by higher net revenue of (i) $200.7 from our \nNBA 2K \nfranchise, (ii) $151.0 from our \nBorderlands \nfranchise, the latest installment of which, \nBorderlands 4\n, released in September 2025, (iii) $148.8 from \nColor Block Jam\n, which released in November 2024, and (iv) $58.4 from our \nMafia \nfranchise, the latest installment of which, \nMafia: The Old Country\n, released in August 2025.\nNet revenue from mobile increased by $160.6 and accounted for 49.5% of our total net revenue for six months ended September 30, 2025, as compared to 54.3% for the prior year period. The increase was primarily driven by higher net revenue from \nColor Block Jam\n. Net revenue from console games increased by $270.6 and accounted for 38.8% of our total net revenue for the six months ended September 30, 2025, as compared to 37.2% for the prior year period. The increase was primarily driven by higher net revenue from our \nNBA 2K,\n \nBorderlands\n, and \nMafia\n franchises. Net revenue from PC and other increased by $155.1 and accounted for 11.7% of our total net revenue for the six months ended September 30, 2025, as compared to 8.5% for the prior year period. The increase was primarily driven by higher net revenue from our \nBorderlands\n, \nGrand Theft Auto\n, \nNBA 2K\n, and \nMafia\n franchises.\nNet revenue from RCS increased by $355.3 and accounted for 77.3% of net revenue for the six months ended September 30, 2025, as compared to 80.9% of net revenue for the prior year period. The increase was primarily driven by higher net revenue from our \nNBA 2K\n franchise and \nColor Block Jam. \nNet revenue from full game and other increased by $231.0 and accounted for 22.7% of net revenue for the six months ended September 30, 2025 as compared to 19.1% of net revenue for the prior year period. The increase was primarily driven by higher net revenue from our \nBorderlands,\n \nGrand Theft Auto\n, and \nMafia \nfranchises.\nNet revenue from digital online channels increased by $574.2 and accounted for 96.7% of our total net revenue for the six months ended September 30, 2025, as compared to 96.4% for the prior year period. The increase was primarily driven by higher net revenue from our \nNBA 2K \nfranchise, \nColor Block Jam\n, and our \nBorderlands \nfranchise.\n \nNet revenue from physical retail and other channels increased by $12.1 and accounted for 3.3% of our total net revenue for the six months ended September 30, 2025, as compared to 3.6% for the same period in the prior year period. The increase was primarily driven by higher net revenue from our \nBorderlands \nand\n Mafia \nfranchises, partially offset by lower net revenue from our \nNBA 2K \nfranchise; \nTopSpin 2K25\n, which released in April 2024; and our \nGrand Theft Auto \nfranchise. \nGross profit as a percentage of net revenue for the six months ended September 30, 2025 was 58.7% as compared to 55.8% for the prior year period. The increase in gross profit as a percentage of net revenue was primarily driven by lower amortization of intangible assets primarily due to impairment charges in the prior year for acquisition-related intangible assets.\nChanges in foreign currency exchange rates increased net revenue by $4.3 and increased gross profit by $16.5 for the six months ended September 30, 2025 as compared to the prior year period.\n30\nOperating Expenses\n2025\n% of net revenue\n2024\n% of net revenue\nIncrease/\n(decrease)\n% Increase/\n(decrease)\nSelling and marketing\n$\n945.4\n \n28.8\n \n%\n$\n892.7 \n33.2 \n%\n$\n52.7 \n5.9 \n%\nResearch and development\n529.4\n \n16.2\n \n%\n466.5 \n17.3 \n%\n62.9 \n13.5 \n%\nGeneral and administrative\n432.0\n \n13.2\n \n%\n463.5 \n17.2 \n%\n(31.5)\n(6.8)\n%\nDepreciation and amortization\n99.2\n \n3.0\n \n%\n92.1 \n3.4 \n%\n7.1 \n7.7 \n%\nBusiness reorganization\n(4.1)\n(0.1)\n%\n66.3 \n2.5 \n%\n(70.4)\n(106.2)\n%\nTotal operating expenses \n(1)\n$\n2,001.9\n \n61.1\n \n%\n$\n1,981.1 \n73.6 \n%\n$\n20.8 \n1.0 \n%\n(1)\n Includes stock-based compensation expense, which was allocated as follows:\n2025\n2024\nSelling and marketing\n$\n49.6\n \n$\n45.7 \nResearch and development\n46.2\n \n49.4 \nGeneral and administrative\n77.0\n \n60.4 \nChanges in foreign currency exchange rates increased total operating expenses by $12.1 for the six months ended September 30, 2025, as compared to the prior year period.\nSelling and marketing\nSelling and marketing expenses increased by $52.7 for the six months ended September 30, 2025, as compared to the prior year period, primarily driven by (i) higher personnel expense due to higher performance-based compensation and (ii) higher overall marketing expense for \nColor Block Jam\n and our \nBorderlands \nfranchise, partially offset by lower overall marketing expenses for \nMatch Factory!\n, \nScrew Jam\n, \nGame of Thrones: Legends\n, \nStar Wars: Hunters\n, and \nTwisted Tangle\n.\nResearch and development\nResearch and development expenses increased by $62.9 for the six months ended September 30, 2025, as compared to the prior year period, primarily driven by (i) higher personnel expense due to the acquisition of Gearbox in June 2024 and higher performance-based compensation, and (ii) the timing of additional R&D related credits related to certain titles.\nGeneral and administrative\nGeneral and administrative expenses decreased by $31.5 for the six months ended September 30, 2025, as compared to the prior year period, primarily driven by lower legal fees and contingencies related to the IBM case against Zynga, partially offset by higher personnel expense due to higher performance-based compensation.\nDepreciation and amortization\nDepreciation and amortization expenses increased by $7.1 for the six months ended September 30, 2025, as compared to the prior year period, primarily driven by (i) higher IT infrastructure expense and (ii) higher leasehold improvement expense for office buildouts, partially offset by lower amortization related to intangible assets related to our acquisitions.\nBusiness reorganization\nBusiness reorganization decreased by $70.4 for the six months ended September 30, 2025, as compared to the prior year period, primarily driven by the completion of the 2024 Plan.\n31\nInterest and other, net\nInterest and other, net was an expense of $52.9 for the six months ended September 30, 2025, as compared to an expense of $54.4 for the prior year period. The net decrease in expense was primarily driven by lower interest expense related to our debt transactions (refer to \nNote 9 - Debt\n) and changes in fair value based on the observable price changes of our long-term investments, partially offset by a lower interest income primarily due to lower interest rates and cash balances.\nProvision for Income Taxes\nThe provision for income taxes for the six months ended September 30, 2025 is based on our projected annual effective tax rate for fiscal year 2026, adjusted for specific items that are required to be recognized in the period in which they are incurred. The provision for income taxes was $16.5 for the six months ended September 30, 2025, as compared to the provision for income taxes of $91.0 for the prior year period. \nWhen compared to the statutory rate of 21%, the effective tax rate of (12.8)% for the six months ended September 30, 2025 was primarily driven by tax expense of $39.3 related to an increase in the U.S. and international valuation allowances, $18.9 related to geographic mix of earnings and changes in reserves, offset by tax benefits of $12.9 from tax credits.\nIn the prior year period, when compared to the statutory rate of 21.0%, the effective tax rate of (17.0)% for the six months ended September 30, 2024  was due primarily to tax expense of $201.8 related to an increase in the U.S. valuation allowance, tax expense of $18.1 related to geographic mix of earnings offset by benefits of $35.0 from tax credits.\nThe change in the effective tax rate, when compared to the prior year period's effective tax rate, is primarily driven by lower tax expense from changes in the U.S. and international valuation allowance, lower tax benefits from tax credits, and lower tax benefits from employee stock-based compensation, offset by lower tax expense related to geographic mix of earnings and changes in reserves.\nThe accounting for share-based compensation will increase or decrease our effective tax rate based upon the difference between our share-based compensation expense and the deductions taken on our tax return, which depends on the stock price at the time of the employee award vesting. \nWe anticipate that additional excess tax benefits or shortfalls from employee stock compensation, tax credits, and changes in our geographic mix of earnings could have a significant impact on our effective tax rate in the future. In addition, we are regularly examined by domestic and foreign taxing authorities. Examinations may result in tax assessments in excess of amounts claimed and the payment of additional taxes. We believe our tax positions comply with applicable tax law, and that we have adequately provided for reasonably foreseeable tax assessments. It is possible that settlement of audits or the expiration of the statute of limitations could have an impact on our effective tax rate in future periods.\nOn July 4, 2025, the One Big Beautiful Bill Act (\"OBBB\") was signed into law and includes significant provisions, such as the permanent extension of certain expiring provisions of the Tax Cuts and Jobs Act, modifications to the international tax framework, accelerated deductions for domestic research expenditures, permanently reinstating 100% bonus depreciation, and modifications to tax credits. The legislation has multiple effective dates, with certain provisions effective in fiscal year ending March 31, 2026 and others implemented in future periods. The impact of OBBB has been reflected in our estimated annualized effective tax rate, and reduced our forecasted U.S. cash tax liability. It did not, however, impact our U.S. deferred tax assets or liabilities since we continue to maintain a full valuation allowance against U.S. net deferred tax assets.\nThe American Rescue Plan Act of 2021 (the “ARPA”), among other things, includes provisions to expand the IRC Section 162(m) disallowance for deduction of certain compensation paid by publicly held corporations. Effective for tax years starting after December 31, 2026 (April 1, 2027 for the Company), the ARPA expands the limitation to cover the next five most highly compensated employees. The ARPA did not have a material impact on our Condensed Consolidated Financial Statements for the six months ended September 30, 2025. We continue to evaluate the potential impact the ARPA may have on our operations and Consolidated Financial Statements in future periods.\nThe Inflation Reduction Act of 2022 (the “Inflation Reduction Act”) includes a corporate alternative minimum tax (\"CAMT\") of 15% on the adjusted financial statement income (AFSI) of corporations with an average AFSI exceeding $1.0 billion over a consecutive three-year period. It is possible that the CAMT could result in an additional tax liability over the regular federal corporate tax liability in a particular year based on differences between book and taxable income. We do not estimate any tax liability relating to CAMT for the current fiscal year. We will continue to evaluate the potential impact the Inflation Reduction Act may have on our operations and Consolidated Financial Statements in future periods.\nThe Organization for Economic Co-operation and Development (\"OECD\") has proposed a global minimum tax of 15% of reported profits, referred to as Pillar Two. Many countries have already implemented or are taking steps to implement Pillar Two. Although the model rules provide a framework for applying the minimum tax, countries may enact Pillar Two \n32\nslightly differently than the model rules and on different timelines. Pillar Two could result in additional tax liability over the regular corporate tax liability in a particular jurisdiction to the extent tax expense is less than a 15% minimum rate. The impact of Pillar Two was not material to the tax provision for the six months ended September 30, 2025. We will continue to evaluate the impact Pillar Two and any additional guidance may have on our results and operations.\nNet loss and loss per share\nFor the six months ended September 30, 2025, net loss was $145.8, as compared to net loss of $627.5 in the prior year period. For the six months ended September 30, 2025, basic and diluted loss per share was $0.80 as compared to basic and diluted loss per share of $3.61 in the prior year period. Basic weighted average shares of 182.7 were 8.9 shares higher as compared to the prior year period basic weighted average shares, primarily due to our equity issuance, as well as normal stock compensation activity, including vests, grants, and forfeitures in the prior year being fully outstanding in the current year. See \nNote 10 - Loss Per Share\n to our Condensed Consolidated Financial Statements for additional information.\nLiquidity and Capital Resources\nOur primary cash requirements are to fund (i) the development, manufacturing and marketing of our published products, (ii) working capital, (iii) capital expenditures, (iv) debt and interest payments, (v) tax payments, and (vi) acquisitions. We expect to rely on cash and cash equivalents as well as on short-term investments, funds provided by our operating activities, and our 2022 Credit Agreement to satisfy our working capital needs. Refer to \nNote 9 - Debt\n for additional discussion of our outstanding debt obligations.\nAccounts Receivable sale program\nOn May 19, 2025, we entered into an arrangement to sell designated pools of high credit quality accounts receivable under an uncommitted accounts receivables purchase facility in an initial aggregate amount of up to $215.0 to an unaffiliated financial institution on a true sale basis. As these accounts receivable are sold without recourse, we do not retain the associated risks of lack of payment due to insolvency of the account debtors following the transfer of such accounts receivable to such financial institution. We will continue to collect cash from our account debtors and remit to the financial institution. We will derecognize the carrying value of the financial assets transferred and recognize a net gain or loss on the sale under Interest and other, net on our Consolidated Statements of Operations. The proceeds from these arrangements will be reflected as cash provided by operating activities in the Consolidated Statement of Cash Flows.\nNo receivables were sold under this facility during the three months ended September 30, 2025. We may utilize this facility in future periods depending on cash flow needs and market conditions.\nShort-term investments\nAs of September 30, 2025, we had $246.4 of short-term investments, which primarily consisted of bank time deposits with maturities greater than 90 days. From time to time, we may make additional short-term investments depending on future market conditions and liquidity needs.\nSenior Notes\nAs of September 30, 2025, we had $3,050.0 of Senior Notes outstanding. \nOn April 14, 2025, we repaid our 2025 Notes with a principal amount of $600.0.\nCredit Agreement\nAs of September 30, 2025, there were no borrowings under the 2022 Credit Agreement, and we had approximately $997.8 available for additional borrowings.\nConvertible Notes\nThe 2026 Convertible Notes mature on December 15, 2026, unless earlier converted, redeemed, or repurchased in accordance with their terms, prior to the maturity date. The 2026 Convertible Notes do not bear regular interest, and the principal amount does not accrete. An aggregate principal amount of $29.4 of the 2026 Convertible Notes remained outstanding at September 30, 2025.\nFinancial Condition\nWe are subject to credit risks, particularly if any of our receivables represent a limited number of customers or are concentrated in foreign markets. If we are unable to collect our accounts receivable as they become due, it could adversely affect our liquidity and working capital position.\n33\nGenerally, we have been able to collect our accounts receivable in the ordinary course of business. We do not hold any collateral to secure payment from customers. We have trade credit insurance on the majority of our customers to mitigate accounts receivable risk.\nA majority of our trade receivables are derived from sales to major retailers, including digital storefronts and platform partners, and distributors. Our five largest customers accounted for 81.5% and 82.2% of net revenue during the six months ended September 30, 2025 and 2024, respectively. We had four customers who accounted for 24.9%, 22.7%, 15.1%, and 12.4% of our net revenue as of September 30, 2025, and four customers who accounted for 25.6%, 22.5%, 18.6%, and 10.3% of our net revenue as of September 30, 2024. As of September 30, 2025 and March 31, 2025, five customers accounted for 78.3% and 72.1% of our gross accounts receivable, respectively. Customers that individually accounted for more than 10% of our gross accounts receivable balance comprised 64.9% and 61.0% of such balances at September 30, 2025 and March 31, 2025, respectively. We had three customers who accounted for 31.5%, 18.9%, and 14.4% of our gross accounts receivable as of September 30, 2025, and three customers who accounted for 24.0%, 21.3%, and 15.7% of our gross accounts receivable as of March 31, 2025. We did not have any additional customers that exceeded 10% of our gross accounts receivable as of September 30, 2025, and March 31, 2025. Based upon performing ongoing credit evaluations, maintaining trade credit insurance on a majority of our customers who sell our physical products, and our past collection experience, we believe that the receivable balances from these largest customers do not represent a significant credit risk, although we actively monitor each customer's creditworthiness and economic conditions that may affect our customers' business and access to capital. We are monitoring the current global economic conditions, including credit markets and other factors as it relates to our customers in order to manage the risk of uncollectible accounts receivable.\nWe believe that our current cash and cash equivalents, short-term investments, and projected cash flow from operations, along with availability under our 2022 Credit Agreement will provide us with sufficient liquidity to satisfy our cash requirements for working capital, capital expenditures, and commitments on both a short-term and long-term basis. \nAs of September 30, 2025, the amount of cash and cash equivalents held outside of the U.S. by our foreign subsidiaries was $1,432.2. These balances are dispersed across various locations around the world. We believe that such dispersion meets the business and liquidity needs of our foreign affiliates. In addition, we expect to have the ability to generate sufficient cash domestically to support ongoing operations for the foreseeable future.\nOur Board of Directors has authorized the repurchase of up to 21.7 shares of our common stock. Under this program, we may purchase shares from time to time through a variety of methods, including in the open market or through privately negotiated transactions, in accordance with applicable securities laws. Repurchases are subject to the availability of stock, prevailing market conditions, the trading price of the stock, our financial performance and other conditions. The program does not require us to repurchase shares and may be suspended or discontinued at any time for any reason. \nDuring the three months ended September 30, 2025, we did not repurchase shares of our common stock in the open market, as part of the program. We have repurchased a total of 11.7 shares of our common stock under the program, and as of September 30, 2025, 10.0 shares of our common stock remained available for repurchase under the share repurchase program.\nOur changes in cash flows were as follows:\n \nSix Months Ended September 30,\n(millions of dollars)\n2025\n2024\nNet cash provided by (used in) operating activities\n$\n83.7\n \n$\n(319.4)\nNet cash used in investing activities\n(314.0)\n(68.0)\nNet cash provided by financing activities\n618.0\n \n597.0 \nEffects of foreign currency exchange rates on cash, cash equivalents, and restricted cash and cash equivalents\n14.1\n \n8.0 \nNet change in cash, cash equivalents, and restricted cash and cash equivalents\n$\n401.8\n \n$\n217.6 \nAt September 30, 2025, we had $1,961.0 of cash and cash equivalents and restricted cash and cash equivalents, compared to $1,559.2 at March 31, 2025. The increase was primarily due to Net cash provided by financing activities, primarily related to proceeds from our equity issuance of our common stock (refer to \nNote 10 - Loss Per Share\n), partially offset by the repayment of our 2025 Notes (refer to \nNote 9 - Debt\n). The increase was also due to Net cash provided by operating activities, which was primarily due to sales of our products, partially offset by investments in software development and licenses. This net increase was partially offset by the decrease in Net cash used in investing activities, which was primarily due to the purchase of short-term investments and fixed assets. \n34\nCommitments\nRefer to \nNote 11 - Commitments and Contingencies\n for disclosures regarding our commitments.\nCapital Expenditures\nIn fiscal year 2026, we anticipate capital expenditures to be approximately $180.0. During the six months ended September 30, 2025, capital expenditures were $57.0.\nInternational Operations\nNet revenue earned outside of the United States is principally generated by our operations in Europe, Asia, Australia, Canada, and Latin America. For the three months ended September 30, 2025 and 2024, 41.6% and 39.8%, respectively, of our net revenue was earned outside the U.S. We are subject to risks inherent in foreign trade, including increased credit risks, tariffs and duties, fluctuations in foreign currency exchange rates, shipping delays and international political, regulatory and economic developments, all of which can have a significant effect on our operating results.\nFluctuations in Quarterly Operating Results and Seasonality\nWe have experienced fluctuations in quarterly and annual operating results as a result of the timing of the introduction of new titles, variations in sales of titles developed for particular platforms, market acceptance of our titles, development and promotional expenses relating to the introduction of new titles, sequels or enhancements of existing titles, projected and actual changes in platforms, the timing and success of title introductions by our competitors, product returns, changes in pricing policies by us and our competitors, the accuracy of retailers' forecasts of consumer demand, the size and timing of acquisitions, the timing of orders from major customers, and order cancellations and delays in product shipment. Sales of our full game products are also seasonal, with peak demand typically occurring in the fourth calendar quarter during the holiday season. For certain of our software products with multiple performance obligations, we defer the recognition of our net revenue over an estimated service period which generally ranges from six to fifteen months. As a result, the quarter in which we generate the highest Net Bookings may be different from the quarter in which we recognize the highest amount of Net revenue. Quarterly comparisons of operating results are not necessarily indicative of future operating results."
}