{
  "source_file": "ttwo-20250331.htm",
  "form_type": "10-K",
  "item1": "Item 1.    Business\nGeneral\nWe are a leading developer, publisher, and marketer of interactive entertainment for consumers around the globe. We develop, operate, and publish products principally through Rockstar Games, 2K, and Zynga. In October 2024, we sold our Private Division label, including our rights to substantially all of the label's titles. Our products are designed for console gaming systems, including, but not limited to, the Sony Computer Entertainment, Inc. (\"Sony\") PlayStation®4 (\"PS4\") and PlayStation5 (\"PS5\"), the Microsoft Corporation (\"Microsoft\") Xbox One® (\"Xbox One\") and Xbox Series X|S (\"Xbox Series X|S\"), and the Nintendo Switch\nTM\n (\"Switch\"), as well as mobile, including smartphones and tablets, and personal computers (\"PC\"). We deliver our products through physical retail, digital download, online platforms, and cloud streaming services.\nOur website address is www.take2games.com. We make all of our filings with the Securities and Exchange Commission (\"SEC\") available free of charge on our website under the caption \"Financial Information—SEC Filings.\" Included in these filings are our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and amendments to those reports, which are available as soon as reasonably practicable after we electronically file or furnish such materials with the SEC pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (the \"Exchange Act\"). Our website and the information contained therein or connected thereto are not intended to be incorporated into this Annual Report on Form 10-K. The SEC maintains a website that contains annual, quarterly and current reports, proxy and information statements and other information that issuers (including the Company) file electronically with the SEC. The SEC's website is \nwww.sec.gov\n.\nStrategy\nOverview.\n    Our strategy is to create hit entertainment experiences, delivered on every platform relevant to our audience through a variety of sound business models. Our pillars - creativity, innovation, and efficiency - guide us as we strive to create the highest quality, most captivating experiences for our consumers. We believe that our player-first approach and commitment to creativity and innovation are distinguishing strengths, enabling us to differentiate our products in the marketplace by combining advanced technology with compelling storylines and characters that provide unique, deeply engaging gameplay experiences. \nOur teams have established a portfolio of proprietary software content for the major hardware and mobile platforms, and we aim to be at the forefront of technological innovation. We have a diverse portfolio that spans all key platforms and numerous genres, including action, adventure, family, casual, hyper-casual, role-playing, shooter, social casino, sports, and strategy. This enables us to appeal to a wide array of consumers and demographic groups worldwide, ranging from game \n1\nenthusiasts to casual gamers. Most of our intellectual property is internally owned and developed, which we believe best positions us financially and competitively. In addition, we license selectively some highly recognizable renowned brands, especially in sports entertainment. We support our products with innovative marketing programs created by our internal global marketing teams. \n    Attract and Retain the Best Talent in the Business.\n    Our headcount includes 12,928 full-time employees as of March 31, 2025, including 10,096 in development studios. We are proud of the culture we have established and believe that it enables us to attract and retain some of the most talented individuals in our industry and consistently set new benchmarks for excellence. By empowering our colleagues to embrace an entrepreneurial mindset and to take calculated risks, we believe that we have created an environment where our people can thrive. We believe that we deploy best-in-class recruiting practices to attract new talent and encourage our people to pursue satisfying, long-term career opportunities with us by providing competitive compensation plans that align our people with our shareholders, extensive employee benefits and well-being programs, and numerous learning and development programs to encourage career growth and progression.\n    Develop Robust Player Relationships.\n    Many of our releases offer a steady cadence of post-launch content to drive further engagement with our franchises, including virtual currency, add-on content, and in-game purchases. This approach enables us to maintain consistent, positive relationships with our players, sustain ongoing relevance for our intellectual properties, and enhance the performance of our titles. \nWe continue to invest in tools and infrastructure to deepen our understanding of our players and to strengthen our relationships with them. This includes our customer data platform and our customer insights and analytics, which inform our go-to-market strategy and allow us to maintain ongoing communications with our players that are tailored to their interests. We also engage with emerging marketing platforms, technologies, and services to enhance our reach and capabilities, including our direct-to-consumer commerce platform, through which players can purchase in-game offerings, primarily for our mobile titles.\nThe enjoyment and safety of our players is of paramount importance to us, and we are committed to providing safe, inclusive, and welcoming environments in which our communities can gather and enjoy our services free of harassment, hate speech, toxic behavior, abuse, and other offensive content and conduct.\n    Increase Scale and Profitability.\n    A key component of our strategy is to build a portfolio and forward pipeline of commercially successful franchises across console, PC, and mobile platforms. We believe that we can increase our scale by launching new intellectual properties; growing our core franchises through high-quality, fresh sequels, relevant brand extensions, and robust live services; and expanding our intellectual property portfolio and talent base through strategic acquisitions and partnerships. We provide continuous recurrent consumer spending offerings to fuel player engagement and growth.\nWe use a product investment review process to evaluate potential titles for investment, review existing titles in development, and assess titles after release by measuring their performance in the market and the return on our investment. We believe that our disciplined approach to product investment will enhance the competitiveness and profitability of our titles.\nAs we grow our scale, we seek to run our business in a highly efficient manner in an effort to optimize and enhance our profitability. We regularly assess opportunities to contain or reduce costs, including leveraging shared services and technology.\nIdentify and Lead New Paradigms and Market Trends.\n    Our teams aspire to be at the forefront of innovation in our industry. We are constantly evaluating and investing selectively in emerging platforms, technologies, business models, and geographies that we believe will help us grow and strengthen our business. In particular, we believe that there are meaningful opportunities to expand our presence in Asia, the Middle East, and Latin America. Within these regions, China is our most established market, where we offer \nNBA 2K Online\n and \nCivilization: Eras and Allies\n through our partnership with Tencent. Our \nNBA 2K Online\n business is the top online PC sports game in China.\nWe also direct our teams to anticipate and actively address changes in consumer behavior and technology so that we can evolve our business as new dynamics develop.\nOur Businesses\n    We derive substantially all of our revenue from the sale of our interactive entertainment content, which includes the sale of internally developed software titles and software titles developed by third parties, the sale of in-game virtual items and advertising, and live services on console, PC, and mobile. Operating margins are dependent in part upon our ability to release new, commercially successful software products and to manage effectively their development and marketing costs. We have internal development studios located in Australia, Canada, China, Czech Republic, Finland, Germany, Hungary, India, Serbia, South Korea, Spain, Turkey, the United Kingdom (\"U.K.\"), and the United States (\"U.S.\"). As of March 31, 2025, we had a \n2\nresearch and development staff of 10,096 full-time employees with the technical capabilities to develop software titles for all major consoles, PCs, and mobile platforms in multiple languages and territories.\n    We engage in evolving business models such as online gaming, virtual currency, add-on content, and in-game purchases, and we expect to continue to generate incremental revenue from these opportunities. We also generate revenue from advertising primarily within our mobile software products.\n    Rockstar Games.\n    Rockstar Games' strategy is to develop a limited number of titles that are known for their quality and longevity in the market for which they can create sequels and incremental revenue opportunities through virtual currency, add-on content, and in-game purchases. Software titles published by our Rockstar Games label are primarily internally developed. We expect Rockstar Games, our wholly-owned publisher of the \nGrand Theft Auto\n, \nL.A. Noire\n, \nMax Payne\n, \nMidnight Club\n, \nRed Dead Redemption\n, and other popular franchises, to continue to be a leader in the action/adventure product category and to create groundbreaking entertainment. We believe that Rockstar Games has established a uniquely original, popular, cultural phenomenon with its \nGrand Theft Auto\n series, which is the interactive entertainment industry's most iconic and critically acclaimed brand and has sold-in over 445 million units worldwide. Our most recent installment, \nGrand Theft Auto V\n, which was released in 2013, has sold-in over 210 million units worldwide and includes access to \nGrand Theft Auto Online\n. Rockstar Games offers its GTA+ membership program, which engages its player community with an array of rotating benefits, including access to classic Rockstar Games titles. Rockstar Games continues to invest in the franchise and announced that \nGrand Theft Auto VI\n, which was expected to launch in Fall of Calendar 2025, is now planned for release on May 26, 2026, during our fiscal year 2027. The label released its first trailer for the title\n \nin December 2023 and the second in May 2025 and will share more details in the future. \nRed\n \nDead Redemption 2\n,\n \nwhich has been a critical and commercial success that set numerous entertainment industry records, has sold-in more than 70 million units worldwide to date. Rockstar Games continues to expand on its established series by developing sequels, offering downloadable episodes, and providing additional content. Rockstar Games' titles are published across all key platforms, including mobile.\n    2K.\n    Our 2K label has published a variety of popular entertainment properties across all key platforms and across a range of genres including shooter, action, role-playing, strategy, sports, and family/casual entertainment. In recent years, 2K has expanded its offerings to include several new franchises that are expected to enhance and diversify its slate of games and provide opportunities for sequels and additional content. We expect 2K to continue to develop new, successful franchises in the future. 2K's internally owned and developed franchises include the critically acclaimed, multi-million unit selling \nBioShock\n, \nMafia\n, \nSid Meier's Civilization\n, and \nXCOM\n franchises, as well as the \nBorderlands \nand\n Tiny Tina's Wonderlands\n franchises, which we now own following our June 2024 acquisition of Gearbox Entertainment. 2K's realistic sports simulation titles include our flagship \nNBA 2K\n series, which continues to be the top-ranked NBA basketball video game, the \nWWE 2K\n professional wrestling series, \nPGA TOUR 2K\n, and \nTopSpin 2K\n. 2K also publishes mobile titles, including \nWWE SuperCard\n. In 2018, we expanded our relationship with the NBA through the \nNBA 2K League.\n    Zynga.\n   Our Zynga label publishes popular free-to-play mobile games that deliver high quality, deeply engaging entertainment experiences and generates revenue from in-game sales and in-game advertising. Zynga's strategy is to have numerous games in concept development and to determine which titles are best suited for soft launch and worldwide launch based on the achievement of various milestones and key performance indicator (KPI) thresholds. Zynga's diverse portfolio of popular game franchises has been downloaded more than six billion times, including \nCSR Racing\n, \nDragon City\n, \nEmpires & Puzzles\n, \nFarmVille\n, \nGame of Thrones: Legends,\n \nGolf Rival\n, \nHarry Potter: Puzzles & Spells\n, \nMatch Factory!\n, \nMerge Dragons!\n, \nMerge Magic!\n, \nMonster Legends\n, \nToon Blast\n, \nTop Eleven\n, \nToy Blast\n, \nTwo Dots\n, \nWords With Friends\n, \nZynga Poker\n, and a high volume of hyper-casual mobile titles, including \nColor Block Jam, Fill the Fridge!,\n \nParking Jam 3D\n, \nPower Slap\n, \nPull the Pin, Screw Jam\n,\n Twisted Tangle, \nand\n Tangled Snakes\n.\nPrivate Division.\n    In October 2024, we sold our Private Division label, including our rights to substantially all of the label's titles. The label was dedicated to bringing titles from the industry's leading creative talent to market and was the publisher, developer, and owner of \nKerbal Space Program\n. \nIntellectual Property\n    Our business is highly dependent on the creation, acquisition, licensing, and protection of intellectual property. We believe that content ownership facilitates our internal product development efforts and maximizes profit potential. We attempt to protect our software and production techniques under copyright, patent, trademark, and trade secret laws as well as through contractual restrictions on disclosure, copying, and distribution.\n    We also enter into content license agreements, such as those with sports leagues, players associations, copyrighted fictional characters and entertainment brands, car manufacturers, music labels, and musicians. These licenses are typically limited to the use of the licensed rights in products for specific time periods. In addition, we license and include console \n3\nmanufacturer technology in our products on a non-exclusive basis, which allows our games to be played on their respective hardware systems.\nManufacturing\n    Platform manufacturers, such as Sony, Microsoft, and Nintendo, either manufacture or control the selection of approved manufacturers of physical copies of software products sold for use on their respective hardware platforms. We place a purchase order for the manufacture of our products with Sony, Nintendo, or Microsoft's approved replicator and then send software code to the manufacturer, together with related artwork, user instructions, warranty information, brochures and packaging designs for approval, defect testing and manufacture. Games are generally shipped within two to three weeks of receipt of our purchase order and all materials.\n    Our software titles typically carry a 90-day limited warranty.\nArrangements with Platform Manufacturers \n    We have entered into license agreements with Sony and Microsoft to develop and publish software in Asia, Australia, Europe, North America, and certain Latin American, Middle Eastern, and African countries. We are not required to obtain any licenses from hardware manufacturers to develop titles for the PC.\n    Sony. \nEffective March 23, 2017, we entered into a PlayStation Global Developer and Publisher Agreement with Sony Computer Entertainment, Inc. and certain of its affiliates, pursuant to which Sony granted us the right and license to develop, publish, have manufactured, market, advertise, distribute and sell PlayStation compatible products for all PlayStation systems. The agreement requires us to submit products to Sony for approval and for us to make royalty payments to Sony based on the number of units manufactured or revenue from digitally downloaded content. In addition, products for PlayStation systems are required to be manufactured by Sony-approved manufacturers. On September 30, 2020, we entered into a PlayStation 5 Amendment, with an effective date of May 1, 2020 (the “PS5 Amendment”), to our existing PlayStation Global Developer and Publisher Agreement. The PS5 Amendment amends the existing agreement to include the PlayStation 5 interactive entertainment system in the definition of systems in the agreement and to extend all of the terms and conditions of the existing agreement to our PlayStation 5 products and services.\n    The term of the agreement, as amended, expires on March 31, 2026, with automatic one-year renewal terms thereafter (unless one party gives the other notice of termination). Sony may terminate the agreement for any or no reason upon 30 days’ notice. The agreement may also be terminated by Sony immediately in the event of a breach by us or our bankruptcy or insolvency. Upon expiration or termination of the agreement, we have certain rights to sell off existing inventories.\n    Microsoft. \nUnder the terms of the license agreements that we have entered into with Microsoft Corporation and its affiliates, Microsoft granted us the right and license to develop, publish, have manufactured, market, advertise, distribute and sell Xbox compatible products. The agreements require us to submit products to Microsoft for approval and to make royalty payments to Microsoft based on the number of units manufactured or revenue from digitally downloaded content. In addition, products for the Xbox consoles are required to be manufactured by Microsoft-approved manufacturers.\n    Effective as of November 17, 2005, we entered into an Xbox 360 Publisher License Agreement with Microsoft for the Xbox 360 console (the “Xbox 360 Agreement”). Effective as of July 1, 2020, we entered into an Xbox Console Publisher License Agreement with Microsoft for the Xbox Series X|S and Xbox One consoles (the “Xbox Next Gen Agreement” and, together with Xbox 360 Agreement, the “Xbox Agreements”). The terms of both Xbox Agreements expire on March 31, 2026, each with automatic one-year renewal terms thereafter (unless one party gives the other advance notice of non-renewal). These Xbox Agreements may be terminated by Microsoft immediately in the event of a breach by us, and the Xbox Next Gen Agreement may also be terminated by Microsoft immediately in the event of our bankruptcy or insolvency. Upon expiration or termination of each of the Xbox Agreements, we have certain rights to sell off existing inventories.\nSales\n    We sell software titles both digitally and physically through direct relationships with digital storefronts and platform partners, large retail customers, and third-party distributors. We sell our products globally and have sales operations in Australia, Canada, France, Germany, Japan, Singapore, South Korea, Taiwan, the U.K., and the U.S. We manage a direct-to-consumer platform, primarily for our mobile business, to drive purchases directly with our consumer base. By leveraging our direct-to-consumer platform, we are able to build closer relationships with our players, understand their behaviors and preferences more accurately, and provide value with various offers and event types.\nWe are dependent on a limited number of customers that account for a significant portion of our sales. Sales to our five largest customers during the fiscal year ended March 31, 2025, accounted for 81.0% of our net revenue, with Apple, Sony, Google, and Microsoft each accounting for more than 10.0% of our net revenue.\n4\n    We distribute our titles, add-on content, and in-game purchases through direct digital download to consoles, PCs, and mobile devices. We view digital distribution as the principal channel for our industry and Company; however, we expect that packaged goods and traditional retailers will continue to be an important channel for the sale of our console products for the foreseeable future, particularly in connection with the release of certain titles for consoles or certain regions where digital distribution is not as well established.\nWe also sell advertising within a number of our games, primarily in mobile. Our advertising offerings provide creative ways for marketers and advertisers to reach and engage with our players and are generally essential for our free-to-play titles. Our advertising offerings include banner and interstitial advertisements, engagement advertisements and offers in which players can participate in watch-to-earn engagements or other offer engagements, branded virtual items, and sponsorships that integrate relevant advertising and messaging within game play.\nMarketing\n    Our marketing and promotional efforts are intended to acquire new users, maximize consumer interest in our titles, promote brand name recognition of our franchises, assist retailers and to properly position, package and merchandise our titles. Marketing is particularly important for our mobile titles to build a large community of players. From time to time, we also receive marketing support from hardware manufacturers in connection with their own promotional efforts.\n    We market titles by:\n•\nImplementing public relations campaigns, using social, digital, online, television, outdoor, and print marketing, including certain performance marketing programs. We aim to label and market our products in accordance with the applicable principles and guidelines of the Entertainment Software Rating Board, (\"ESRB\"), an independent self-regulatory body that assigns ratings and enforces advertising guidelines for the interactive software industry in the U.S. In addition, we work with similar global agencies, including the Pan-European Game Information, which is used throughout most of Europe in more than 35 countries, and the International Age Rating Coalition (\"IARC\"), a rating and age classification system for digitally delivered games and apps that reflects the unique cultural differences among nations and regions.\n•\nStimulating continued sales by reducing the wholesale prices of our products to retailers, digital storefronts, and platform providers at various times during the life of a product. Price protection may occur at any time in a product's life cycle but typically occurs three to nine months after a product's initial launch. In certain international markets, we also provide volume rebates to stimulate continued product sales.\n•\nEmploying various other marketing methods designed to promote consumer awareness, including social media, in-store promotions and point-of-purchase displays, direct mail, cooperative advertising, attendance at trade shows as well as product sampling through demonstration software distributed via the Internet or the digital online services.\n•\nWe have been able to build a large community of players, particularly for mobile titles, through players discovering of our games in platform storefronts, the viral and social features built into the network effects of our games, as well as the cross-promotion of our games to our existing audience. However, we also acquire our players through paid advertising channels. We advertise our mobile games primarily within other mobile applications and on social networks, often through in-app and other advertising partners such as Facebook and Google.\n    As of March 31, 2025, we had a sales and marketing staff of 1,418 full-time employees.\nCompetition\n    Competition in the interactive entertainment industry is based on innovation, features, playability, product quality, brand name recognition, compatibility with popular platforms, access to distribution channels, price, marketing, and customer service. Our business is driven by hit titles, which require increasing budgets for development and marketing. Competition for our titles is influenced by the timing of competitive product releases and the similarity of such products to our titles.\n    In our business, we compete with:\n•\nOther interactive entertainment companies that range in size and cost structure from very small with limited resources to very large with greater financial, marketing, technical, and other resources than ours. Examples of our competitors include Electronic Arts Inc., Embracer Group AB, Playrix, Playtika, Roblox, Savvy Games, Tencent, and Ubisoft Entertainment S.A. We also expect new competitors to enter the market and existing competitors to allocate more resources to develop and market competing games and applications.\n5\n•\nSony, Microsoft, and Nintendo for the sale of interactive entertainment software. Each of these competitors is a large developer and marketer of software for their own platforms and has the financial resources to withstand significant price competition and to implement extensive advertising campaigns.\n•\nOther software, hardware, entertainment, and media for limited retail shelf space and promotional resources. The competition for shelf space, whether physical or virtual, and promotional support is intense among an increasing number of newly introduced entertainment software titles and hardware.\n•\nOther forms of entertainment such as motion pictures, television, social networking, online applications, short-form video, and other forms of entertainment, which may be less expensive or provide other advantages to consumers.\nInternational Operations\n    International sales are a significant part of our business. For the fiscal years ended March 31, 2025, 2024, and 2023, we earned 39.5%, 38.7% and 37.2%, respectively, of our net revenue outside the U.S. We are subject to risks inherent in foreign trade, including increased credit risks, tariffs and duties, fluctuations in foreign currency exchange rates, shipping delays and international political, regulatory, and economic developments, all of which can have a significant effect on our operating results. In particular, as a global company operating in many jurisdictions, we are subject to various and complex laws and regulations domestically and internationally, including laws and regulations related to gaming, user privacy, data collection and retention, consumer protection, protection of minors, online safety, content, advertising, localization, information security, intellectual property, competition, sanctions, addressing climate change, taxation, and employment, among others. Many of these laws and regulations are continuously evolving and developing, and the application to, and impact on, us is uncertain. Certain of our business models are subject to new laws or regulations or evolving interpretations and application of existing laws and regulations. The growth and development of electronic commerce, virtual items, and virtual currency has prompted calls for new laws and regulations and resulted in the application of existing laws or regulations that have limited or restricted the sale of our products and services in certain territories. For more information on risks associated with complying with applicable laws, please see \"\nRisk Factors\n\"\n—Risks related to legal or regulatory compliance.\nSegment and Geographic Information\n    We have one operating and reportable segment. See \nNote\n 22\n to our Consolidated Financial Statements.\nHuman Capital\n    \nHuman Capital Management.\n  Our headcount includes 12,928 full-time employees as of March 31, 2025. We are proud of our established culture, and our reputation for creativity, innovation, and efficiency enables us to attract some of the most talented individuals in our industry and consistently set new benchmarks for excellence. We are constantly focused on our teams – their success, their structure, and how best to support them given their particular needs and projects. 49% of our full-time employees are located in North America, 34% in Europe, and 17% in the Asia-Pacific region; 78% of our full-time employees are focused on product development.\nWhile some of our teams are now working from the office full time, many of our colleagues are working in hybrid work environments, with some flexibility to work remotely on various days. We believe this structure maintains strong productivity, and collaboration, cultivates a strong internal culture, and is also beneficial for talent retention. Our approach to the workplace presents challenges, as well as opportunities, for managing teams and supporting employees. We continue to support our workforce through ongoing and new initiatives, including enhanced manager training to strengthen team cohesion across various work models, encouragement of healthy work habits, active engagement with employee feedback, and a continued focus on mental health awareness.\nBy empowering our teams to embrace an entrepreneurial mindset and to take calculated risks, we foster an environment where our people can thrive. We believe that we deploy best-in-class recruiting practices to attract new talent, and we encourage our people to pursue satisfying, long-term career opportunities with us by providing competitive compensation benefits and well-being programs and by offering numerous learning and development programs to encourage career growth and progression.\nSustainability.  \nWe recognize the synergies between corporate citizenship and smart business and are committed to focusing on, and measuring the impact of, our sustainability activities, which are rooted in our core tenets of creativity, innovation, and efficiency. We believe sustainability creates value for all stakeholders, including employees and customers, while also helping to mitigate risks, reduce costs, protect brand value, and identify market opportunities. We have an organization-wide Sustainability Committee, overseen by the Board of Directors (the \"Board\"), to lead our sustainability efforts. Through this committee, we developed a comprehensive, Sustainability Framework that reflects our top priority issues and stakeholder needs. \n6\nCommunity & Engagement.  \nWe firmly believe that diversity of thought drives the innovation that is integral to our success. We strive to provide an inclusive workplace in which everyone feels respected, heard, and safe. Our culture, grounded in compassion, collaboration, and a commitment to excellence, supports an inclusive and welcoming environment for prospective employees and the broader community.\nTalent Assessment & Development and Employee Experience.  \nWe are committed to internal growth opportunities and career development tracks. We recognize the importance of our employees staying current in an ever-changing industry. Our global Learning & Development team curates a wide variety of training materials and programs targeting both hard skills development and career progression as well as programs in leadership development and employee round tables. Our compliance training program seeks to ensure that our employees recognize and report any signs of harassment, discrimination, retaliation, or other inappropriate behaviors in the workplace and that they understand and abide by our Code of Business Conduct and other internal policies.\nOur learning and development programs are designed to be closely aligned with our performance management process and succession planning. Our formalized performance management process provides the platform for evaluating each individual employee’s contributions to the team and our success, with a focus on regular communication and transparency. We work hard to ensure that development opportunities are individually tailored and that all decisions regarding hiring, career progression, and compensation are based on qualifications, work ethic, and job performance. \nBeyond formal performance management, we stay connected with our teams throughout the year with global town hall meetings and engagement and \"pulse\" surveys. The feedback generated through these tools helps to ensure we are providing a supportive, dynamic, and stimulating work environment for all of our employees. These efforts and more contributed to Take-Two being named one of Forbes' Best Mid-Size Employers list for four of the last six years and certified as a Great Place to Work by Fortune every year from 2020 through 2025 (including in the U.K. in 2025).\nCompensation and Benefits. \n The main objectives of our compensation and benefit programs are to attract, retain, motivate, and reward our employees, who operate in a highly competitive and technologically challenging environment. We offer competitive compensation packages designed to incentivize high individual and company performance. We regularly review our compensation and benefits packages from both an internal and external standpoint to ensure competitiveness, including through industry benchmarking analysis. We seek to link compensation (including annual changes in compensation) to our overall and business unit performance, as well as each individual’s contribution to the results achieved. The emphasis on our overall performance is intended to align our employees’ financial interests with the interests of our shareholders. In addition to awarding Restricted Stock Units to employees at certain levels, we also offer an Employee Stock Purchase Plan to further align the interests of our employees with our shareholders.\nWe also provide a comprehensive benefits package that includes traditional offerings, such as medical, dental vision, retirement, disability, accident and life insurance, prescription drugs, and leaves, and also includes programs such as fitness reimbursement, mental health benefits, mental health awareness training for Human Resources personnel and managers throughout the Company, and charitable giving with a company match.",
  "item7": "Item 7.    Management's Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nOur Business\n    We are a leading developer, publisher, and marketer of interactive entertainment for consumers around the globe. We develop, operate, and publish products principally through Rockstar Games, 2K, and Zynga. Our products are currently designed for console gaming systems, mobile, including smartphones and tablets, and PC. We deliver our products through physical retail, digital download, online platforms, and cloud streaming services. Refer to \nItem 1 - Business\n for additional discussion.\nImpairments\nDuring the fiscal year ended March 31, 2025, we recognized Goodwill impairment charges of $3,545.2, representing a partial impairment related to one of our reporting units, and we recognized impairment charges of $137.0 for acquisition-related Developed Game Technology intangible assets within Cost of revenue and $39.3 for acquisition-related Branding and Trade Names intangible assets within Depreciation and amortization. The impairment charges are a result of a reduction in the forecasted performance of certain games due to industry conditions and changes in our strategies in response to those conditions. Key assumptions and estimates used in deriving the fair values of these assets are forecasted revenue, EBITDA margins, long-term decay rate, and discount rate (refer to \nNote 9 - Goodwill and Intangible Assets, Net\n). Future changes in those key assumptions and estimates could result in additional impairments.\nDuring the fiscal year ended March 31, 2025, we also recognized impairment charges related to our Software development costs and licenses of $77.5, of which $35.1 related to title cancellations as part of our cost reduction program (refer to \nNote 7 - Software Development Costs and Licenses\n and \nNote 21 - Business Reorganization)\n. \nTrends and Factors Affecting our Business\n    Product Release Schedule.\n    Our financial results are affected by the timing of our product releases and the commercial success of our titles. Generally, a significant portion of our revenue has been derived from a few popular franchises, particularly around new releases within those franchises, some of which have annual or biennial releases. Additionally, our \nGrand Theft Auto\n products in particular have historically accounted for a significant portion of our revenue. Sales of \nGrand Theft Auto\n products generated 12.6% of our net revenue for the fiscal year ended March 31, 2025. The timing of our \nGrand Theft Auto\n product releases may affect our financial performance on a quarterly and annual basis. \n    Economic Environment and Retailer Performance.\n    We continue to monitor various macroeconomic and geopolitical factors, such as global tariff policy, that may affect our business in several areas, including consumer demand, inflation, pricing pressure on our products, credit quality of our receivables, and foreign currency exchange rates. Actions we have taken to date and other potential actions we may take in the future in response to these factors could result in negative impacts in future periods.\nThe economic environment has affected our customers in the past and may do so in the future. There has been increased consolidation in our industry, as larger, better capitalized competitors will be in a stronger position to withstand prolonged periods of economic downturn and sustain their business through the financial volatility. Also, bankruptcies or consolidations of our large retail customers could seriously hurt our business, due to uncollectible accounts receivable and the concentration of purchasing power among the remaining large retailers. \n    Hardware Platforms.\n    We derive a substantial portion of our revenue from the sale of products made for video game consoles manufactured by third parties. Such console revenue comprised 37.3% of our net revenue by product platform for the fiscal year ended March 31, 2025. The success of our business is dependent upon consumer acceptance of these platforms and \n39\nthe continued growth in the installed base of these platforms, which could be impacted by global economic factors, including global tariff policy. When new hardware platforms are introduced, demand for interactive entertainment developed for older platforms typically declines, which may negatively affect our business during the market transition to the new consoles. The latest Sony and Microsoft consoles provide \"backwards compatibility\" (i.e., the ability to play games for the previous generation of consoles). The inclusion of such features on new consoles could mitigate the risk of such a decline. However, we cannot be certain how backwards compatibility will affect demand for our products. Further, events beyond our control may impact the availability of these new consoles, which may also affect demand. We manage our product delivery on each current and future platform in a manner we believe to be most effective to maximize our revenue opportunities and achieve the desired return on our investments in product development. Accordingly, our strategy for these platforms is to focus our development efforts on a select number of the highest quality titles.\n    Online Content and Digital Distribution.\n    We provide a variety of online delivered products, including direct digital downloads of our titles, and access to additional offerings through virtual currency, add-on content, in-game purchases, and in-game advertising, which drive ongoing engagement and incremental revenue from recurrent consumer spending on our titles. Net revenue from digital online channels comprised 96.4% of our net revenue for the fiscal year ended March 31, 2025. We expect online delivery of games and game offerings to continue to be the primary part of our business over the long term. \nA significant portion of our mobile titles are distributed, marketed, and promoted through third parties, primarily Apple’s App Store and the Google Play Store. Virtual items for our mobile games are purchased principally through the payment processing systems of these platform providers, as well as our direct-to-consumer commerce platform. We generate a significant portion of our net revenue through the Apple and Google platforms and expect to continue to do so for the foreseeable future. Apple and Google generally have the discretion to set the amounts of their platform fees and change their platforms’ terms of service and other policies with respect to us or other developers at their sole discretion, and those changes may be unfavorable to us. These platform fees are recorded as cost of revenue as incurred. Further, as a result of the platform fees associated with online game sales, our mobile net revenue generally generates a lower gross margin percentage than our Console or PC revenue. Accordingly, the overall product mix between mobile and other game sales may affect our gross margin percentage. We are also continuing to expand our direct-to-consumer efforts more meaningfully across our mobile portfolio to enhance profitability.\nPlayer acquisition costs.\n    Principally for our mobile titles, we use advertising and other forms of player acquisition and retention to grow and retain our player audience. These expenditures, which are recorded within Sales and marketing in our Consolidated Statements of Operations, generally relate to the promotion of new game launches and ongoing performance-based programs to drive new player acquisition and lapsed player reactivation. Over time, the effectiveness or cost of these acquisition and retention-related programs may change, affecting our operating results.\nContent Release Highlights\nDuring fiscal year 2025, 2K released \nNBA 2K25\n, \nTopSpin 2K25\n,\n Sid Meier's Civilization VII\n, \nPGA TOUR 2K25\n, and \nWWE 2K25\n, and Zynga released \nGame of Thrones: Legends\n. Rockstar plans to release \nGrand Theft Auto VI \non May 26, 2026.\nFiscal 2025 Financial Summary\nOur net revenue for the fiscal year ended March 31, 2025 was led by a variety of our top franchises, primarily \nNBA 2K, Grand Theft Auto\n,\n Red Dead Redemption\n, \nWWE 2K\n, and \nSid Meier's Civilization, \nas well as top contributors \nToon Blast\n, our hyper-casual mobile portfolio, \nEmpires & Puzzles\n,\n Match Factory!\n, and \nWords With Friends.\n Our net revenue for the fiscal year ended March 31, 2025 was $5,633.6, an increase of $284.0 or 5.3% compared to the fiscal year ended March 31, 2024. \n    Our operating loss for the fiscal year ended March 31, 2025 was $4,391.1 compared to operating loss of $3,590.6 for fiscal year ended March 31, 2024, primarily due to an increase in Goodwill impairment charges of $1,203.1 related to an additional partial impairment related to one of our reporting units. For the fiscal year ended March 31, 2025, our net loss was $4,478.9, as compared to net loss of $3,744.2 in the prior year. Diluted loss per share for the fiscal year ended March 31, 2025 was $25.58, as compared to Diluted loss per share of $22.01 for the fiscal year ended March 31, 2024. \n    At March 31, 2025, we had $1,559.2 of Cash, cash equivalents, and restricted cash and cash equivalents, compared to $1,102.0 at March 31, 2024. The increase was primarily due to Net cash provided by financing activities, primarily related to proceeds from the issuance of our 2029 Notes and 2034 Notes (refer to \nNote 11 - Debt\n) and the issuance of common stock. This increase was partially offset by (i) Net cash used in investing activities, which was primarily due to the purchase of fixed assets and (ii) Net cash used in operating activities, which was primarily due to investments in software development and licenses, partially offset by sales of our products. \n40\nOn June 11, 2024, we completed the purchase of 100% \nof the issued and outstanding capital stock of The Gearbox Entertainment Company, Inc. (\"Gearbox\"), from Embracer Group AB, for an initial consideration of \n2.8 shares of our common stock (refer to \nNote 20 - Acquisitions\n). \nCritical Accounting Policies and Estimates\n    Our most critical accounting policies, which are those that require significant judgment, include revenue recognition, capitalization and recognition of software development costs and licenses, fair value estimates including valuation of goodwill and intangible assets, valuation and recognition of stock-based compensation, and income taxes. See \nNote 1 - Basis of Presentation and Significant Accounting Policies\n in the Notes to our Consolidated Financial Statements in this Annual Report on Form 10-K.\nRecently Adopted and Recently Issued Accounting Pronouncements\nSee \nNote 1 - Basis of Presentation and Significant Accounting Policies\n.\nOperating Metric \nNet Bookings\n    We monitor Net Bookings as a key operating metric in evaluating the performance of our business. Net Bookings is defined as the net amount of products and services sold digitally or sold-in physically during the period and includes licensing fees, merchandise, in-game advertising, strategy guides, and publisher incentives. Net Bookings were as follows:\nFiscal Year Ended March 31,\n2025\n2024\nIncrease/(decrease)\nIncrease/(decrease) %\nNet Bookings\n$\n5,648.0\n \n$\n5,333.0 \n$\n315.0 \n5.9 \n%\n    For the fiscal year ended March 31, 2025, Net Bookings increased by $315.0 as compared to the prior year. The increase was primarily due to an increase in Net Bookings from \nMatch Factory!\n; our \nSid Meier's Civilization \nfranchise, the latest installment of which, \nCivilization VII\n, released in February 2025; \nToon Blast\n; our \nNBA 2K \nfranchise; and \nTopSpin 2K25\n, which released in April 2024. These increases were partially offset by a decrease in Net Bookings from \nEmpires & Puzzles,\n our \nGrand Theft Auto \nfranchise, our hyper- and hybrid-casual mobile portfolio, and \nLEGO 2K Drive\n, which released in May 2023.\nResults of Operations\nIn this section, we discuss the results of our operations for the fiscal year ended March 31, 2025 compared to the fiscal year ended March 31, 2024. For the comparison of fiscal year 2024 to fiscal year 2023, refer to \nPart II, Item 7 “Management’s Discussion and Analysis of \nFinancial\n Condition and \nResults\n of Operations”\n of our Annual Report on Form 10-K for the year ended March 31, 2024.\n41\nThe following table sets forth, for the periods indicated, our statements of operations, net revenue by content type, net revenue by platform, and net revenue by distribution channel:\n \nFiscal Year Ended March 31,\n \n2025\n2024\n2023\nTotal net revenue\n$\n5,633.6\n \n100.0\n \n%\n$\n5,349.6 \n100.0 \n%\n$\n5,349.9 \n100.0 \n%\nCost of revenue\n2,571.4\n \n45.7\n \n%\n3,107.8 \n58.1 \n%\n3,064.6 \n57.3 \n%\nGross profit\n3,062.2\n \n54.3\n \n%\n2,241.8 \n41.9 \n%\n2,285.3 \n42.7 \n%\nSelling and marketing\n1,683.7\n \n29.9\n \n%\n1,550.2 \n29.0 \n%\n1,586.5 \n29.7 \n%\nResearch and development\n1,005.2\n \n17.8\n \n%\n948.2 \n17.7 \n%\n887.6 \n16.6 \n%\nGeneral and administrative\n883.3\n \n15.7\n \n%\n716.1 \n13.4 \n%\n839.5 \n15.7 \n%\nDepreciation and amortization\n229.4\n \n4.1\n \n%\n171.2 \n3.2 \n%\n122.3 \n2.3 \n%\nGoodwill impairment\n3,545.2\n \n62.9\n \n%\n2,342.1 \n43.8 \n%\n— \n— \n%\nBusiness reorganization\n106.5\n \n1.9\n \n%\n104.6 \n1.9 \n%\n14.6 \n0.3 \n%\nTotal operating expenses\n7,453.3\n \n132.3\n \n%\n5,832.4 \n109.0 \n%\n3,450.5 \n64.5 \n%\nLoss from operations\n(4,391.1)\n(78.0)\n%\n(3,590.6)\n(67.1)\n%\n(1,165.2)\n(21.8)\n%\nInterest and other, net\n(93.3)\n(1.7)\n%\n(103.6)\n(1.9)\n%\n(141.9)\n(2.7)\n%\nLoss on fair value adjustments, net\n(6.9)\n(0.1)\n%\n(8.6)\n(0.2)\n%\n(31.0)\n(0.6)\n%\nLoss before income taxes\n(4,491.3)\n(79.8)\n%\n(3,702.8)\n(69.2)\n%\n(1,338.1)\n(25.0)\n%\n(Benefit from) provision for income taxes\n(12.4)\n(0.2)\n%\n41.4 \n0.8 \n%\n(213.4)\n(4.0)\n%\nNet loss\n$\n(4,478.9)\n(80.0)\n%\n$\n(3,744.2)\n(70.0)\n%\n$\n(1,124.7)\n(21.0)\n%\n \nFiscal Year Ended March 31,\n \n2025\n2024\n2023\nNet revenue by content:\nRecurrent consumer spending\n$\n4,474.6\n \n79.4\n \n%\n$\n4,213.5 \n78.8 \n%\n$\n4,180.4 \n78.1 \n%\nFull game and other \n1,159.0\n \n20.6\n \n%\n1,136.1 \n21.2 \n%\n1,169.5 \n21.9 \n%\nNet revenue by platform:\n \n \n \n \n \n \nMobile\n$\n2,942.0\n \n52.2\n \n%\n$\n2,748.0 \n51.4 \n%\n$\n2,538.6 \n47.5 \n%\nConsole\n2,099.1\n \n37.3\n \n%\n2,167.3 \n40.5 \n%\n2,303.8 \n43.0 \n%\nPC and other\n592.5\n \n10.5\n \n%\n434.3 \n8.1 \n%\n507.5 \n9.5 \n%\nNet revenue by distribution channel:\n \n \n \n \n \n \nDigital online\n$\n5,431.8\n \n96.4\n \n%\n$\n5,112.2 \n95.6 \n%\n$\n5,085.7 \n95.1 \n%\nPhysical retail and other\n201.8\n \n3.6\n \n%\n237.4 \n4.4 \n%\n264.2 \n4.9 \n%\nFiscal Years ended March 31, 2025 and 2024 \n2025\n% of net revenue\n2024\n% of net revenue\nIncrease/(decrease)\n% Increase/(decrease)\nTotal net revenue\n$\n5,633.6\n \n100.0\n \n%\n$\n5,349.6 \n100.0 \n%\n$\n284.0 \n5.3 \n%\nProduct costs\n821.1\n \n14.6\n \n%\n756.6 \n14.1 \n%\n64.5 \n8.5 \n%\nGame intangibles\n811.0\n \n14.4\n \n%\n1,301.1 \n24.3 \n%\n(490.1)\n(37.7)\n%\nInternal royalties\n405.4\n \n7.2\n \n%\n397.6 \n7.4 \n%\n7.8 \n2.0 \n%\nLicenses\n365.8\n \n6.5\n \n%\n305.8 \n5.8 \n%\n60.0 \n19.6 \n%\nSoftware development costs and royalties\n(1)\n168.1\n \n3.0\n \n%\n346.7 \n6.5 \n%\n(178.6)\n(51.5)\n%\nCost of revenue\n2,571.4\n \n45.7\n \n%\n3,107.8 \n58.1 \n%\n(536.4)\n(17.3)\n%\nGross profit\n$\n3,062.2\n \n54.3\n \n%\n$\n2,241.8 \n41.9 \n%\n$\n820.4 \n36.6 \n%\n(1)\n Includes $9.4 and $24.4 of stock-based compensation expense in fiscal year 2025 and 2024, respectively.\n    For the fiscal year ended March 31, 2025, net revenue increased by $284.0, as compared to the prior year. The increase was primarily due to an increase in net revenue of $237.1 from \nMatch Factory!\n, which released in November 2023; $127.2 from our \nSid Meier's Civilization \nfranchise, the latest installment of which, \nCivilization VII\n, released in February 2025; and $84.2 from \nToon Blast\n. These increases were partially offset by a decrease in net revenue of $73.3 from our \nGrand Theft Auto \nfranchise.\n42\nRecurrent consumer spending (\"RCS\") is generated from ongoing consumer engagement and includes revenue from virtual currency, add-on content, in-game purchases, and in-game advertising. Net revenue from recurrent consumer spending increased by $261.1 and accounted for 79.4% of net revenue for the fiscal year ended March 31, 2025, as compared to 78.8% for the prior year. The increase was primarily due to an increase in net revenue from \nMatch Factory!\n and \nToon Blast\n. These increases\n \nwere partially offset by a decrease in net revenue from our \nGrand Theft Auto \nfranchise.\n \nNet revenue from full game and other increased by $22.9 and accounted for 20.6% of net revenue for the fiscal year ended March 31, 2025, as compared to 21.2% for the prior year. The increase was primarily due to an increase in net revenue from our\n Sid Meier's Civilization \nfranchise and \nTopSpin 2K25\n. These increases were partially offset by a decrease in net revenue from our \nNBA 2K \nfranchise\n, \na decrease as a result of a divestiture in our business,\n \nand a decrease in our \nGrand Theft Auto \nfranchise.\n    Net revenue from mobile increased by $194.0 and accounted for 52.2% of our total net revenue in the fiscal year ended March 31, 2025, as compared to 51.4% in the prior year. The increase was primarily due to an increase in net revenue from \nMatch Factory! \nand \nToon Blast.\n These increases were partially offset by a decrease in our \nGrand Theft Auto \nfranchise, \nMerge Dragons!, \nand as a result of a divestiture. Net revenue from console games decreased by $68.2 and accounted for 37.3% of our total net revenue in the fiscal year ended March 31, 2025, as compared to 40.5% in the prior year. The decrease was primarily due to a decrease in net revenue from our \nGrand Theft Auto \nand\n NBA 2K \nfranchises, and \nLEGO 2K Drive\n, which released in May 2023\n. \nThese decreases were partially offset by an increase in net revenue from \nTopSpin 2K25\n, which released in April 2024, and our\n Sid Meier's Civilization \nfranchise. Net revenue from PC and other increased by $158.2 and accounted for 10.5% of our total net revenue in the fiscal year ended March 31, 2025, as compared to 8.1% in the prior year. The increase was primarily due to an increase in net revenue from our \nSid Meier's Civilization\n franchise\n;\n our \nRisk of Rain\n franchise\n, \nwhich\n \nwas acquired in connection with our acquisition of Gearbox in June 2024 (refer to \nNote \n20\n - Acquisitions\n); and our \nGrand Theft Auto\n and \nNBA 2K \nfranchises.\n \n    Net revenue from digital online channels increased by $319.6 and accounted for 96.4% of our total net revenue for the fiscal year ended March 31, 2025, as compared to 95.6% in the prior year. The increase was primarily due to an increase in net revenue from \nMatch Factory!\n, our \nSid Meier's Civilization \nfranchise, and \nToon Blast. \nThese increases were partially offset by a decrease in net revenue from our \nGrand Theft Auto\n franchise\n. \nNet revenue from physical retail and other channels decreased by $35.6 and accounted for 3.6% of our total net revenue for the fiscal year ended March 31, 2025, as compared to 4.4% for the prior year. The decrease was primarily due to a decrease in net revenue from our \nNBA 2K \nand \nRed Dead Redemption \nfranchises, and \nLEGO 2K Drive\n.    \n    Gross profit as a percentage of net revenue for the fiscal year ended March 31, 2025 was 54.3%, as compared to 41.9% in the prior year. The increase was primarily due to lower impairment charges related to intangible assets related to our Zynga acquisition (refer to \nNote 9 - Goodwill and Intangible Assets, net\n).\n    Changes in foreign currency exchange rates decreased net revenue by $2.5 and increased gross profit by $0.2, respectively, in the fiscal year ended March 31, 2025 as compared to the prior year.\nOperating Expenses\n2025\n% of net revenue\n2024\n% of net revenue\nIncrease/(decrease)\n% Increase/(decrease)\nSelling and marketing\n$\n1,683.7\n \n29.9\n \n%\n$\n1,550.2 \n29.0 \n%\n$\n133.5 \n8.6 \n%\nResearch and development\n1,005.2\n \n17.8\n \n%\n948.2 \n17.7 \n%\n57.0 \n6.0 \n%\nGeneral and administrative\n883.3\n \n15.7\n \n%\n716.1 \n13.4 \n%\n167.2 \n23.3 \n%\nDepreciation and amortization\n229.4\n \n4.1\n \n%\n171.2 \n3.2 \n%\n58.2 \n34.0 \n%\nGoodwill impairment\n3,545.2\n \n62.9\n \n%\n2,342.1 \n43.8 \n%\n1,203.1 \n51.4 \n%\nBusiness reorganization\n106.5\n \n1.9\n \n%\n$\n104.6 \n1.9 \n%\n1.9 \n1.8 \n%\nTotal operating expenses\n$\n7,453.3\n \n132.3\n \n%\n$\n5,832.4 \n109.0 \n%\n$\n1,620.9 \n27.8 \n%\n    Includes stock-based compensation expense, which was allocated as follows:\n2025\n2024\nSelling and marketing\n$\n92.4\n \n$\n95.3 \nResearch and development\n99.0\n \n104.4 \nGeneral and administrative\n123.2\n \n111.5 \n    Foreign currency exchange rates decreased total operating expenses by $6.8 for the fiscal year ended March 31, 2025 as compared to the prior year.\n43\nSelling and marketing\n    Selling and marketing expenses increased by $133.5 for the fiscal year ended March 31, 2025 as compared to the prior year period, primarily due to (i) higher overall marketing expenses for \nMatch Factory!\n, \nGame of Thrones: Legends\n, and our \nSid Meier's Civilization \nfranchise, partially offset by lower marketing expenses for our hyper-casual mobile portfolio, and (ii) lower amortization related to our intangible assets. \nResearch and development\n    Research and development expenses increased by $57.0 for the fiscal year ended March 31, 2025, as compared to the prior year period, primarily due to increases in (i) personnel expenses due to increased headcount and (ii) production and development expenses for titles that are not technologically feasible, partially offset by the timing of tax related credits for certain titles.\nGeneral and administrative\n    General and administrative expenses increased by $167.2 for the fiscal year ended March 31, 2025, as compared to the prior year period, primarily due to increases in (i) transaction costs related to our acquisition of Gearbox (refer to \nNote 2\n0\n - Acquisitions\n), (ii) personnel expenses due to increased headcount, (iii) legal fees and contingencies related to the IBM case against Zynga, (iv) IT-related expenses for cloud-based services and IT infrastructure, as well as, (v) a reduction of expense in the prior year related to updating the fair value of contingent earn-out liability for our acquisition of Popcore with no corresponding reduction in the current year.\n    General and administrative expenses for the fiscal years ended March 31, 2025 and 2024 include occupancy expense (primarily rent, utilities and office expenses) of $73.9 and $69.9, respectively, related to our development studios. \nDepreciation and amortization\n    Depreciation and amortization expenses increased by $58.2 for the fiscal year ended March 31, 2025, as compared to the prior year period, primarily due to increases in (i) impairment expense related to our intangible assets (refer to \nNote 9 - Goodwill and Intangible Assets, Net\n), (ii) IT infrastructure expense, and (iii) leasehold improvements for office buildouts.\nGoodwill impairment\nGoodwill impairment expense for the fiscal years ended March 31, 2025 and 2024, were $3,545.2 and $2,342.1, respectively, due to partial impairments recognized related to one of our reporting units (refer to \nNote 9 - Goodwill and Intangible Assets, Net\n).\nBusiness reorganization\nBusiness reorganization expense increased by $1.9 for the fiscal year ended March 31, 2025, as compared to the prior year period, primarily due to an increase in employee-related costs and losses on our divestitures, partially offset by a decrease in expense due to cancellations of our titles (refer to \nNote \n21\n - Business Reorganization\n).\nInterest and other, net\n2025\n% of net revenue\n2024\n% of net revenue\nIncrease/(decrease)\n% Increase/(decrease)\nInterest income\n$\n98.6\n \n1.8\n \n%\n$\n62.3 \n1.2 \n%\n$\n36.3 \n58.3 \n%\nInterest expense\n(167.3)\n(3.0)\n%\n(140.6)\n(2.6)\n%\n(26.7)\n19.0 \n%\nForeign currency exchange gain (loss)\n(22.6)\n(0.4)\n%\n(28.6)\n(0.5)\n%\n6.0 \n(21.0)\n%\nOther\n(2.0)\n—\n \n%\n3.3 \n0.1 \n%\n(5.3)\n(160.6)\n%\nInterest and other, net\n$\n(93.3)\n(1.7)\n%\n$\n(103.6)\n(1.9)\n%\n$\n10.3 \n(9.9)\n%\n    Interest and other, net was expense of $93.3 for the fiscal year ended March 31, 2025, as compared to $103.6 for the fiscal year ended March 31, 2024. The net decrease in expense was primarily due to an increase in interest income primarily due to increases in interest rates and cash balances and a gain on the sale of an investment. These decreases in net expense were partially offset by increases in foreign currency losses, interest expense related to our debt transactions (refer to \nNote 11 - Debt\n) and a gain on debt extinguishment recognized in the prior year on the partial repayment of our 2024 Notes.\n44\nLoss on fair value adjustments, net\nLoss on fair value adjustments, net for the fiscal year ended March 31, 2025 was a loss of $6.9 compared to a loss of $8.6 in the prior year period. The change was primarily due to changes in fair value based on observable price changes of our long-term investments and an increase in fair value of our Convertible Notes.\nBenefit from income taxes\n    Our income tax benefit was $12.4 for the fiscal year ended March 31, 2025 as compared to a provision for income taxes of $41.4 for the fiscal year ended March 31, 2024. \n    When compared to the statutory rate of 21%, the effective tax rate of 0.3% for the fiscal year ended March 31, 2025 was primarily due to an expense of $718.0 from nondeductible goodwill impairments, $222.7 from an increase in the U.S. valuation allowance expense, $25.5 from an increase in the foreign valuation allowance expense, $41.4 from our geographic mix and foreign earnings partially offset by a $54.5 benefit from tax credits anticipated to be utilized.\nWhen compared to the statutory rate of 21%, the effective tax rate of (1.1)% for the fiscal year ended March 31, 2024 was primarily due to an expense of $474.7 from nondeductible goodwill impairments, $337.2 from an increase in the U.S. valuation allowance expense, $41.6 from an increase in the foreign valuation allowance expense, $39.0 from our geographic mix and foreign earnings, and $29.2 from a decrease in the net deferred tax asset relating to the Swiss cantonal basis step-up (as noted below) partially offset by a $63.3 benefit from tax credits anticipated to be utilized and $32.7 benefit from changes in reserves due to statute lapses. \nThe effective tax rate in the current year was higher compared to the prior year primarily due to increased expense from nondeductible goodwill impairments, decreased benefits from tax credits, decreased expense related to an increase in our valuation allowance, and the impact of geographic mix and foreign earnings. \nThe accounting for share-based compensation will increase or decrease our effective tax rate based upon the difference between our share-based compensation expense and the deductions taken on our tax return, which depends on the stock price at the time of the employee award vesting.\nWe anticipate that additional excess tax benefits or shortfalls from employee stock compensation, tax credits, changes in valuation allowance, and changes in our geographic mix of earnings could have a significant impact on our effective tax rate in the future. In addition, we are regularly examined by domestic and foreign taxing authorities. Examinations may result in tax assessments in excess of amounts claimed and the payment of additional taxes. We believe our tax positions comply with applicable tax law, and that we have adequately provided for reasonably foreseeable tax assessments. It is possible that settlement of audits or the expiration of the statute of limitations could have an impact on our effective tax rate in future periods. \nThe ARPA, among other things, includes provisions to expand the IRC Section 162(m) disallowance for deduction of certain compensation paid by publicly held corporations. Effective for tax years starting after December 31, 2026 (April 1, 2027 for the Company), ARPA expands the limitation to cover the next five most highly compensated employees. ARPA did not have a material impact on our Consolidated Financial Statements for the fiscal year ended March 31, 2025. We continue to evaluate the potential impact ARPA may have on our operations and Consolidated Financial Statements in future periods. \nThe Inflation Reduction Act includes a new CAMT of 15% on the AFSI of corporations with an average AFSI exceeding $1.0 billion over a consecutive three-year period. The CAMT is effective for taxable year ending March 31, 2024. It is possible that the CAMT could result in an additional tax liability over the regular federal corporate tax liability in a particular year based on differences between book and taxable income. We do not estimate any tax liability relating to CAMT for the current fiscal year. We will continue to evaluate the potential impact the Inflation Reduction Act may have on our operations and Consolidated Financial Statements in future periods. \nThe OECD has proposed a global minimum tax of 15% of reported profits, referred to as Pillar Two. Many countries have already implemented or are taking steps to implement Pillar Two. Although the model rules provide a framework for applying the minimum tax, countries may enact Pillar Two slightly differently than the model rules and on different timelines. Many aspects of Pillar Two are effective for the fiscal year ending March 31, 2025. Pillar Two could result in additional tax liability over the regular corporate tax liability in a particular jurisdiction to the extent tax expense is less than a 15% minimum rate. The impact of Pillar Two was not material to the tax provision for the fiscal year ended March 31, 2025.\nSwitzerland's Federal Act on Tax Reform and AVH Financing (\"TRAF\") abolished preferential tax regimes for holding companies, domicile companies, and mixed companies at the cantonal level. The TRAF allows the cantons to establish transition rules, the implementation of which may be subject to a ruling from the canton. For the fiscal year ended March 31, \n45\n2024, we recorded a net tax expense of $29.2 due to an increase\n \nin the valuation of allowance of $81.3 offset by an increase in the deferred tax asset of $52.1 relating to the Swiss cantonal basis step-up, as it is more-likely-than-not that such deferred tax assets would not be realized. \nAs of March 31, 2025, we had gross unrecognized tax benefits, including interest and penalties, of $267.1, of which $109.5 would affect our effective tax rate if realized. For the fiscal year ended March 31, 2025, gross unrecognized tax benefits decreased by $9.3.\n    We are no longer subject to audit for U.S. federal income tax returns for periods prior to our fiscal year ended March 31, 2022 and state income tax returns for periods prior to the fiscal year ended March 31, 2020. With few exceptions, we are no longer subject to income tax examinations in non-U.S. jurisdictions for years prior to fiscal year ended March 31, 2018. Certain U.S. federal, state and foreign taxing authorities are currently examining our income tax returns for the fiscal years ended March 31, 2016 through March 31, 2023.\nNet loss and loss per share\n    For the fiscal year ended March 31, 2025, net loss was $4,478.9, as compared to a net loss of $3,744.2 in the prior year. Basic and diluted loss per share for the fiscal year ended March 31, 2025 was $25.58, as compared to basic and diluted loss per share of $22.01 for the fiscal year ended March 31, 2024. Basic weighted average shares of 175.1 were 5.0 higher as compared to the prior year period basic weighted average shares, primarily due to stock issued as consideration for the acquisition of Gearbox, as well as normal stock compensation activity, including vests as well as grants and forfeitures in the prior year being fully outstanding in the current year. See \nNote 12 - Loss Per Share\n to our Consolidated Financial Statements for additional information.\nLiquidity and Capital Resources\n    Our primary cash requirements are to fund (i) the development, manufacturing and marketing of our published products, (ii) working capital, (iii) capital expenditures, (iv) debt and interest payments, (v) tax payments, and (vi) acquisitions. We expect to rely on cash and cash equivalents as well as on short-term investments, funds provided by our operating activities, and our 2022 Credit Agreement to satisfy our working capital needs. Refer to \nNote 11 - Debt\n for additional discussion of our outstanding debt obligations.\nShort-term Investments\n    As of March 31, 2025, we had $9.4 of short-term investments, which primarily consisted of bank time deposits with maturities greater than 90 days. From time to time, we may place additional short-term investments depending on future market conditions and liquidity needs.\nSenior Notes\nAs of March 31, 2025, we had $3,650.0 of Senior Notes outstanding.\nOn April 14, 2025, we repaid our 2025 Notes with a principal amount of $600.0.\nCredit Agreement\nAs of March 31, 2025, there were no borrowings under the 2022 Credit Agreement, and we had approximately $747.8 available for additional borrowings.\nConvertible Notes\nThe 2026 Convertible Notes mature on December 15, 2026, unless earlier converted, redeemed, or repurchased in accordance with their terms, prior to the maturity date. The 2026 Convertible Notes do not bear regular interest, and the principal amount does not accrete. An aggregate principal amount of $29.4 of the 2026 Convertible Notes remained outstanding at March 31, 2025.\nFinancial Condition\n    We are subject to credit risks, particularly if any of our receivables represent a limited number of customers or are concentrated in foreign markets. If we are unable to collect our accounts receivable as they become due, it could adversely affect our liquidity and working capital position.\n46\nGenerally, we have been able to collect our accounts receivable in the ordinary course of business. We do not hold any collateral to secure payment from customers. We have trade credit insurance on the majority of our customers to mitigate accounts receivable risk.\n    A majority of our trade receivables are derived from sales to major retailers, including digital storefronts and platform partners, and distributors. Our five largest customers accounted for 81.0%, 79.8% and 79.6% of net revenue during the fiscal years ended March 31, 2025, 2024 and 2023, respectively. As of March 31, 2025, and 2024, five customers comprised 72.1% and 69.9% of our gross accounts receivable, respectively, with our significant customers (those that individually comprised more than 10% of our gross accounts receivable balance) accounting for 61.0% and 57.7% of such balance at March 31, 2025, and 2024, respectively. We had three customers who accounted for 24.0%, 21.3%, and 15.7% of our gross accounts receivable as of March 31, 2025, and three customers who accounted for 21.8%, 18.1%, and 16.9% of our gross accounts receivable as of March 31, 2024. We did not have any additional customers that exceeded 10% of our gross accounts receivable as of March 31, 2025, and 2024. Based upon performing ongoing credit evaluations, maintaining trade credit insurance on a majority of our customers who sell our physical products, and our past collection experience, we believe that the receivable balances from these largest customers do not represent a significant credit risk, although we actively monitor each customer's creditworthiness and economic conditions that may affect our customers' business and access to capital. We are monitoring the current global economic conditions, including credit markets and other factors as it relates to our customers in order to manage the risk of uncollectible accounts receivable.\nWe believe that our current cash and cash equivalents, short-term investments, and projected cash flow from operations, along with availability under our 2022 Credit Agreement will provide us with sufficient liquidity to satisfy our cash requirements for working capital, capital expenditures, and commitments on both a short-term and long-term basis. \nAs of March 31, 2025, the amount of cash and cash equivalents held outside of the U.S. by our foreign subsidiaries was $791.3. These balances are dispersed across various locations around the world. We believe that such dispersion meets the business and liquidity needs of our foreign affiliates. In addition, we expect to have the ability to generate sufficient cash domestically to support ongoing operations for the foreseeable future.\n    Our Board has authorized the repurchase of up to 21.7 shares of our common stock. Under this program, we may purchase shares from time to time through a variety of methods, including in the open market or through privately negotiated transactions, in accordance with applicable securities laws. Repurchases are subject to the availability of stock, prevailing market conditions, the trading price of the stock, our financial performance and other conditions. The program does not require us to repurchase shares and may be suspended or discontinued at any time for any reason. \nDuring the fiscal years ended March 31, 2025, 2024, and 2023, we did not repurchase shares of our common stock. As of March 31, 2025, we had repurchased a total of 11.7 shares of our common stock under the program, and 10.0 shares of our common stock remained available for repurchase under the share repurchase program. \nOur changes in cash flows were as follows:\n \nFiscal Year Ended March 31,\n2025\n2024\n2023\nNet cash (used in) provided by operating activities\n$\n(45.2)\n$\n(16.1)\n$\n1.1 \nNet cash (used in) provided by investing activities\n(151.5)\n(28.2)\n(2,876.3)\nNet cash provided by (used in) financing activities\n650.5\n \n(91.4)\n1,930.3 \nEffects of foreign currency exchange rates on cash, cash equivalents, and restricted cash and cash equivalents\n3.4\n \n3.1 \n(15.9)\nNet change in cash, cash equivalents, and restricted cash and cash equivalents\n$\n457.2\n \n$\n(132.6)\n$\n(960.8)\n    At March 31, 2025, we had $1,559.2 of Cash, cash equivalents, and restricted cash and cash equivalents, compared to $1,102.0 at March 31, 2024. The increase was primarily due to Net cash provided by financing activities, primarily related to proceeds from the issuance of our 2029 Notes and 2034 Notes (refer to \nNote 11 - Debt\n) and the issuance of common stock. This increase was partially offset by (i) Net cash used in investing activities which was primarily due to the purchase of fixed assets and (i) Net cash used in operating activities, which was primarily due to investments in software development and licenses, partially offset by sales of our products. \n47\nCommitments\n    Refer to \nNote 14 - Commitments and Contingencies\n to our Consolidated Financial Statements for disclosures regarding our commitments.\nCapital Expenditures\n    In fiscal year 2026, we anticipate capital expenditures to be $145.\nOff-Balance Sheet Arrangements\n    As of March 31, 2025 and 2024, we did not have any material relationships with unconsolidated entities or financial parties, such as entities often referred to as structured finance or variable interest entities, which would have been established for the purpose of facilitating off-balance sheet arrangements or other contractually narrow or limited purposes. As such, we are not exposed to any financing, liquidity, market or credit risk that could arise if we had engaged in such relationships.\nInternational Operations\n    Net revenue earned outside of the U.S. is principally generated by our operations in Europe, Asia, Australia, Canada and Latin America. For the fiscal years ended March 31, 2025, 2024, and 2023, 39.5%, 38.7%, and 37.2%, respectively, of our net revenue was earned outside the U.S. We are subject to risks inherent in foreign trade, including increased credit risks, tariffs and duties, fluctuations in foreign currency exchange rates, shipping delays and international political, regulatory and economic developments, all of which can have a significant effect on our operating results.\nFluctuations in Quarterly Operating Results and Seasonality\n    We have experienced fluctuations in quarterly and annual operating results as a result of the timing of the introduction of new titles, variations in sales of titles developed for particular platforms, market acceptance of our titles, development and promotional expenses relating to the introduction of new titles, sequels or enhancements of existing titles, projected and actual changes in platforms, the timing and success of title introductions by our competitors, product returns, changes in pricing policies by us and our competitors, the accuracy of retailers' forecasts of consumer demand, the size and timing of acquisitions, the timing of orders from major customers, and order cancellations and delays in product shipment. Sales of our full game products are also seasonal, with peak demand typically occurring in the fourth calendar quarter during the holiday season. For certain of our software products with multiple performance obligations, we defer the recognition of our net revenue over an estimated service period which generally ranges from six to fifteen months. As a result, the quarter in which we generate the highest Net Bookings may be different from the quarter in which we recognize the highest amount of Net revenue. Quarterly comparisons of operating results are not necessarily indicative of future operating results.",
  "item2": null
}