{
  "source_file": "txt-20250927.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nBusiness Environment \nChanges to the United States trade policy have resulted in new or higher tariffs on goods imported from numerous countries, and some countries have imposed retaliatory tariffs on imports from the United States. We are principally a North American manufacturer and 71% of our 2024 revenues were generated in the U.S. Our aircraft products, subassemblies, parts and components manufactured in Canada and Mexico are largely qualified under the rules of the United States-Mexico-Canada Agreement (USMCA) for preferential treatment on tariffs imposed by the U.S. on Canada and Mexico imports. In addition, our operations outside of North America primarily source materials and components from outside of North America and manufacture products for non-U.S. customers. Many of our businesses also source materials and components from outside of North America. These businesses have been and will continue to be impacted by these imposed U.S. tariffs. In order to mitigate these impacts our businesses have been managing, and will continue to manage, pricing and supply chain optimization strategies. In addition, our aircraft businesses have begun the tariff reconciliation and refund process with the U.S. Government to recover tariff costs that were previously paid related to materials and components that were subsequently determined to be USMCA compliant. To date, we have not experienced a material adverse impact from these tariffs. We will continue to evaluate the ongoing impact of these tariffs and any further developments or changes in global tariff policies on our business and financial position.\nAppropriations for FY 2026 were not enacted by September 30, 2025, and on October 1, 2025, the U.S. Government entered a shutdown, which is ongoing. Consistent with federal guidelines, we are continuing to perform work on existing contracts funded with appropriations from prior fiscal years. If a prolonged government shutdown occurs, it could result in program disruptions, limit the U.S. Government’s ability to progress programs and make timely payments, and impact new program starts.  A prolonged shutdown could have significant consequences for our company, our employees, our suppliers and our industry and could result in delayed cash collections and/or have a material adverse effect on our financial position, results of operations and/or cash flows.\nConsolidated Results of Operations\nThree Months Ended\nNine Months Ended\n(Dollars in millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\n% Change\nSeptember 27,\n2025\nSeptember 28,\n2024\n% Change\nRevenues\n$\n3,602 \n$\n3,427 \n5%\n$\n10,624 \n$\n10,089 \n5%\nCost of sales\n2,948 \n2,809 \n5%\n8,627 \n8,113 \n6%\nGross margin as a % of Manufacturing revenues\n17.6%\n17.7%\n18.4%\n19.3%\nResearch and development costs\n$\n118 \n$\n126 \n(6)%\n$\n387 \n$\n375 \n3%\nSelling and administrative expense\n257 \n282 \n(9)%\n858 \n891 \n(4)%\nInterest expense, net\n30 \n26 \n15%\n90 \n71 \n27%\nSpecial charges\n— \n(2)\n(100)%\n4 \n25 \n(84)%\nNon-service components of pension and postretirement income, net\n67 \n66 \n2%\n200 \n198 \n1%\nAn analysis of our consolidated operating results is set forth below. A more detailed analysis of our segments’ operating results is provided in the Segment Analysis section on pages 24 to 28.\nRevenues\nRevenues increased $175 million, 5%, in the third quarter of 2025, compared with the third quarter of 2024. The revenue increase primarily included the following factors:\n•\nHigher Textron Aviation revenues of $138 million, reflecting higher aircraft revenues of $116 million and higher aftermarket parts and services revenues of $22 million.\n•\nHigher Bell revenues of $97 million due to higher military aircraft and support programs revenues of $128 million, primarily for the Future Long Range Assault Aircraft (FLRAA) program, now designated as MV-75 by the U.S. Army, partially offset by lower commercial revenues of $31 million.\n•\nLower Industrial revenues of $79 million, due to lower revenues of $97 million at Textron Specialized Vehicles, largely reflecting the impact from the disposition of the Powersports business in April 2025 as discussed in Note 12 to the Consolidated Financial Statements, partially offset by higher revenues of $18 million at Kautex. \n•\nHigher Textron Systems revenues of $6 million, largely due to higher volume.\n22\nTable of Contents\nRevenues increased $535 million, 5%, in the first nine months of 2025, compared with the first nine months of 2024. The revenue increase primarily included the following factors:\n•\nHigher Bell revenues of $575 million, due to higher military aircraft and support programs revenues of $431 million, primarily for the MV-75 program and for military sustainment programs, as well as higher commercial revenues of $144 million.\n•\nHigher Textron Aviation revenues of $204 million, reflecting higher aircraft revenues of $148 million and higher aftermarket parts and services revenues of $56 million.\n•\nLower Industrial revenues of $254 million, with $225 million at Textron Specialized Vehicles, largely reflecting the impact from the disposition and lower volume and mix, primarily in golf products. Kautex revenues decreased $29 million, largely due to lower volume. \n•\nLower Textron Systems revenues of $6 million, largely due to lower volume.\nManufacturing group revenues increased $161 million and $517 million in the third quarter and first nine months of 2025, respectively, compared with the corresponding periods of 2024, largely reflecting an increase of $159 million and $853 million, respectively, in product revenues. The increase in product revenues in the first nine months of 2025 was partially offset by a decrease of $336 million in service revenues, largely related to the classification of revenues for the MV-75 program, which was service-related prior to the transition of the program to the Engineering and Manufacturing Development phase in the third quarter of 2024 when it became product-related.\nCost of Sales\nCost of sales includes cost of products and services sold for the Manufacturing group. Cost of sales increased $139 million, 5%, in the third quarter of 2025, compared with the third quarter of 2024, largely due to higher net volume and mix of $143 million and a $61 million impact from inflation, partially offset by the impact from the disposition of the Powersports business. \nCost of sales increased $514 million, 6%, in the first nine months of 2025, compared with the first nine months of 2024, largely due to higher net volume and mix of $401 million and a $193 million impact from inflation and higher LIFO inventory provision, partially offset by the impact from the disposition. Gross margin as a percentage of Manufacturing revenues decreased 90 basis points in the first nine months of 2025, primarily due to lower margin at the Bell segment. \nResearch and Development Costs\nResearch and development costs decreased $8 million, 6%, in the third quarter of 2025, and increased $12 million, 3%, in the first nine months of 2025, compared with the corresponding periods of 2024. The higher research and development costs in the first nine months of 2025 included an increase of $32 million at Bell, reflecting lower costs in 2024 due to the wind down of the Future Attack Reconnaissance Aircraft program, partially offset by a decrease of $10 million at each of the Textron Systems and Textron eAviation segments. \nSelling and Administrative Expense\nSelling and administrative expense decreased $25 million, 9%, and $33 million, 4%, in the third quarter and first nine months of 2025, compared with the corresponding periods of 2024, primarily due to a $16 million gain resulting from the early termination of a vendor contract in the third quarter of 2025 at the Textron Systems segment. The decrease in expense in the first nine months of 2025 also included lower share-based compensation expense, partially offset by a 2024 recovery of amounts that were previously written off related to one customer relationship in the Finance segment.\nInterest Expense, Net\nInterest expense, net includes interest expense for both the Finance and Manufacturing borrowing groups, with interest on intercompany borrowings eliminated, and interest income earned on cash and equivalents for the Manufacturing borrowing group. In the third quarter and first nine months of 2025, interest expense, net increased $4 million, 15%, and $19 million, 27%, respectively, compared with the corresponding periods of 2024. The increase in expense in the first nine months of 2025 primarily reflected lower interest income. Gross interest expense totaled $39 million and $36 million in the third quarter of 2025 and 2024, respectively, and $116 million and $110 million in the first nine months of 2025 and 2024, respectively.\nSpecial Charges\nSpecial charges largely include restructuring activities as discussed in Note 12 to the Consolidated Financial Statements on page \n20\n. \n23\nTable of Contents\nIncome Taxes\nOur effective tax rate was 25.6% and 11.5% in the third quarter of 2025 and 2024, respectively, and 19.9% and 15.8% for the first nine months of 2025 and 2024, respectively. \nOn July 4, 2025, the One Big Beautiful Bill Act (the Act) was enacted and changed certain sections of U.S. income tax law. Among other things, the Act makes permanent: 1) the option to deduct domestic research and development expenditures immediately in the year incurred, 2) the deduction of the full cost of eligible assets in the year placed in service, and 3) the EBITDA-based business interest expense limitation as well as  modifications to the international tax framework.\nIn the third quarter of 2025, our effective tax rate was higher than the U.S. federal statutory rate of 21%, largely reflecting the impact of certain provisions of the Act, primarily those that affected tax deductions for foreign-derived intangible income and research and development credits. In the first nine months of 2025, our effective tax rate was lower than the U.S. federal statutory rate, primarily due to the favorable impact of research and development credits.\nIn the third quarter of 2024, the effective tax rate was lower than the U.S. federal statutory rate, largely due to the favorable impact of research and development credits and foreign tax credits. Our effective tax rate for the first nine months of 2024 was lower than the U.S. federal statutory rate largely due to the favorable impact of research and development credits and tax deductions for foreign-derived intangible income.\nBacklog\nOur backlog is summarized below:\n(In millions)\nSeptember 27,\n2025\nDecember 28,\n2024\nTextron Aviation\n$\n7,739 \n$\n7,845 \nBell\n8,231 \n7,469 \nTextron Systems\n3,172 \n2,594 \nTotal backlog\n$\n19,142 \n$\n17,908 \nBell's backlog increased $762 million, 10%, due to orders in excess of revenues recognized and deliveries. New orders included a $1.3 billion award for the prototype testing and evaluation phase of the MV-75 program. \nBacklog at Textron Systems' increased $578 million, 22%, reflecting orders in excess of revenues recognized and deliveries, which included new contract awards for several programs. \nSegment Analysis\nWe operate in, and report financial information for, the following six operating segments: Textron Aviation, Bell, Textron Systems, Industrial, Textron eAviation and Finance. Segment profit is an important measure used for evaluating performance and for decision-making purposes. Segment profit for the manufacturing segments excludes the non-service components of pension and postretirement income, net; LIFO inventory provision; intangible asset amortization; interest expense, net for Manufacturing group; certain corporate expenses; gains/losses on major business dispositions; and special charges. The operating costs used to derive segment profit for our manufacturing segments includes cost of sales, research and development costs and selling and administrative expense. The cost of sales discussed in this Segment Analysis section excludes the LIFO inventory provision and intangible asset amortization discussed above that are reported within Cost of products sold or Cost of services sold on the Consolidated Statements of Operations. The measurement for the Finance segment includes interest income and expense along with intercompany interest income and expense. \nIn our discussion of comparative results for the Manufacturing group, material changes in revenues and segment profit for our commercial businesses typically are expressed in terms of product line revenues, including volume and mix and pricing; foreign exchange; acquisitions and dispositions; inflation; manufacturing efficiency; and changes in research and development costs and selling and administrative expense. For revenues, volume and mix represents changes in revenues from increases or decreases in the number of units delivered or services provided and the composition of products and/or services sold. For segment profit, volume and mix represents a change due to the number of units delivered or services provided and the composition of products and/or services sold at different profit margins. Pricing represents changes in unit pricing. Foreign exchange is the change resulting from translating foreign-denominated amounts into U.S. dollars at exchange rates that are different from the prior period. Revenues generated by acquired businesses are reflected in Acquisitions for a twelve-month period, while reductions in revenues and segment profit from the sale of businesses are reflected as Dispositions. Inflation represents higher material, wages, benefits, pension service cost or other costs. Manufacturing efficiency includes changes in material, labor and overhead variances to standards, typically due to scrap rates, labor efficiency or inefficiencies, facility usage and other manufacturing productivity inputs.\n24\nTable of Contents\nApproximately 25% of our 2024 revenues were derived from contracts with the U.S. Government, including those under the U.S. Government-sponsored foreign military sales program. For our segments that contract with the U.S. Government, material changes in revenues related to these contracts are expressed in terms of volume. Changes in segment profit for these contracts are typically expressed in terms of volume and mix and contract performance, which includes cumulative catch-up adjustments associated with a) revisions to the transaction price that may reflect contract modifications or changes in assumptions related to award fees and other variable consideration or b) changes in the total estimated costs at completion due to improved or deteriorated operating performance.\nTextron Aviation\nThree Months Ended\nNine Months Ended\n(Dollars in millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\n% Change\nSeptember 27,\n2025\nSeptember 28,\n2024\n% Change\nRevenues:\nAircraft\n$\n985 \n$\n869 \n13%\n$\n2,724 \n$\n2,576 \n6%\nAftermarket parts and services\n492 \n470 \n5%\n1,482 \n1,426 \n4%\nTotal revenues\n1,477 \n1,339 \n10%\n4,206 \n4,002 \n5%\nCost of sales\n1,149 \n1,050 \n9%\n3,249 \n3,060 \n6%\nResearch and development costs\n52 \n54 \n(4)%\n162 \n157 \n3%\nSelling and administrative expense\n97 \n107 \n(9)%\n309 \n319 \n(3)%\nSegment profit\n$\n179 \n$\n128 \n40%\n$\n486 \n$\n466 \n4%\nProfit margin\n12.1%\n9.6%\n11.6%\n11.6%\nTextron Aviation’s revenues increased $138 million, 10%, in the third quarter of 2025, compared with the third quarter of 2024, reflecting higher aircraft revenues of $116 million and higher aftermarket parts and services revenues of $22 million. The increase in aircraft revenues was largely due to higher volume and mix, which included higher commercial turboprop and Citation jet volume, partially offset by lower defense volume. The higher volume and mix also reflects the impact of the strike in the third quarter of 2024. We delivered 42 Citation jets and 39 commercial turboprops in the third quarter of 2025, compared with 41 Citation jets and 25 commercial turboprops in the third quarter of 2024. \nTextron Aviation’s revenues increased $204 million, 5%, in the first nine months of 2025, compared with the first nine months of 2024, reflecting higher aircraft revenues of $148 million and higher aftermarket parts and services revenues of $56 million. The increase in aircraft revenues was primarily due to higher pricing and higher volume and mix. The increase in volume and mix largely reflects higher piston engine aircraft and commercial turboprop volume, partially offset by the mix of Citation jets sold. The higher volume and mix also reflects the impact of the strike in the third quarter of 2024. We delivered 122 Citation jets and 103 commercial turboprops in the first nine months of 2025, compared with 119 Citation jets and 89 commercial turboprops in the first nine months of 2024. \nTextron Aviation’s cost of sales increased $99 million, 9%, in the third quarter of 2025, compared with the third quarter of 2024, largely reflecting higher aircraft volume and inflation of $38 million. Cost of sales increased $189 million, 6%, in the first nine months of 2025, compared with the first nine months of 2024, largely reflecting inflation of $116 million, higher aircraft volume and higher warranty costs.\nTextron Aviation's segment profit increased $51 million, 40%, in the third quarter of 2025, compared with the third quarter of 2024, primarily due to higher volume and mix described above. \nTextron Aviation's segment profit increased $20 million, 4%, in the first nine months of 2025, compared with the first nine months of 2024, primarily due to higher pricing, net of inflation, lower selling and administrative costs and higher aircraft volume and mix, partially offset by higher warranty costs. \n25\nTable of Contents\nBell\nThree Months Ended\nNine Months Ended\n(Dollars in millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\n% Change\nSeptember 27,\n2025\nSeptember 28,\n2024\n% Change\nRevenues:\nMilitary aircraft and support programs\n$\n681 \n$\n553 \n23%\n$\n1,963 \n$\n1,532 \n28%\nCommercial helicopters, parts and services\n345 \n376 \n(8)%\n1,062 \n918 \n16%\nTotal revenues\n1,026 \n929 \n10%\n3,025 \n2,450 \n23%\nCost of sales\n846 \n747 \n13%\n2,490 \n1,961 \n27%\nResearch and development costs\n33 \n32 \n3%\n110 \n78 \n41%\nSelling and administrative expense\n55 \n52 \n6%\n163 \n151 \n8%\nSegment profit\n$\n92 \n$\n98 \n(6)%\n$\n262 \n$\n260 \n1%\nProfit margin\n9.0%\n10.5%\n8.7%\n10.6%\nBell’s military aircraft and support programs revenues increased $128 million, 23%, in the third quarter of 2025, compared with the third quarter of 2024, largely due to higher volume on the FLRAA program, now designated as MV-75 by the U.S. Army. Commercial helicopters, parts and services revenues decreased $31 million, 8%, in the third quarter of 2025, compared with the third quarter of 2024, as we delivered 30 commercial helicopters in the third quarter of 2025, compared with 44 commercial helicopters in the third quarter of 2024. \nBell’s military aircraft and support programs revenues increased $431 million, 28%, in the first nine months of 2025, compared with the first nine months of 2024, largely due to higher volume on the MV-75 program and on military sustainment programs. Commercial helicopters, parts and services revenues increased $144 million, 16%, in the first nine months of 2025, compared with the first nine months of 2024, primarily due to the mix of aircraft sold. We delivered 91 commercial helicopters in the first nine months of 2025, compared with 94 commercial helicopters in the first nine months of 2024. \nBell’s cost of sales increased $99 million, 13%, and $529 million, 27%, in the third quarter and first nine months of 2025, respectively, compared with the corresponding periods of 2024, primarily due to higher net volume and mix described above.\nBell's research and development costs increased $1 million and $32 million, 41%, in the third quarter and first nine months of 2025, respectively, compared with the corresponding periods of 2024. The increase in costs in the first nine months of 2025 largely reflected lower costs in 2024 due to the wind down of the Future Attack Reconnaissance Aircraft program.\nBell’s segment profit decreased $6 million, 6%, in the third quarter of 2025, compared with the third quarter of 2024, and its profit margin decreased 150 basis points, primarily reflecting higher volume on lower margin MV-75 development activities. \nBell's segment profit increased $2 million, 1%, in the first nine months of 2025, compared with the first nine months of 2024, primarily due to higher net volume and mix, partially offset by higher research and development costs and manufacturing inefficiencies. Bell's profit margin decreased 190 basis points, largely reflecting higher research and development costs and higher volume on lower margin MV-75 development activities.\nTextron Systems\nThree Months Ended\nNine Months Ended\n(Dollars in millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\n% Change\nSeptember 27,\n2025\nSeptember 28,\n2024\n% Change\nRevenues\n$\n307 \n$\n301 \n2%\n$\n924 \n$\n930 \n(1)%\nCost of sales\n235 \n226 \n4%\n698 \n694 \n1%\nResearch and development costs\n10 \n10 \n—%\n33 \n43 \n(23)%\nSelling and administrative expense\n10 \n26 \n(62)%\n61 \n81 \n(25)%\nSegment profit\n$\n52 \n$\n39 \n33%\n$\n132 \n$\n112 \n18%\nProfit margin\n16.9%\n13.0%\n14.3%\n12.0%\nTextron Systems’ revenues increased $6 million, 2%, in the third quarter of 2025, compared with the third quarter of 2024, largely due to higher volume. The increase in volume included higher volume on the Ship-to-Shore Connector program, partially offset by the impact of the termination of certain U.S. Government development programs.\nTextron Systems’ revenues decreased $6 million, 1%, in the first nine months of 2025, compared with the first nine months of 2024, largely due to lower volume. The decrease in volume included the impact of the cancellation of the Shadow program and termination of certain U.S. Government development programs, offset by higher volume on the Ship-to-Shore Connector program. \n26\nTable of Contents\nTextron Systems’ research and development costs was unchanged in the third quarter of 2025, and decreased $10 million, 23%, in the first nine months of 2025, compared with the corresponding periods of 2024. The decrease in costs in the first nine months of 2025 was primarily due to a reduction in costs on certain U.S. Government development programs. \nTextron Systems’ selling and administrative expense decreased $16 million, 62%, and $20 million, 25%, in the third quarter and first nine months of 2025, respectively, compared with the corresponding periods of 2024. The decrease in expense in both periods included a $16 million gain resulting from the early termination of a vendor contract in the third quarter of 2025. \nTextron Systems’ segment profit increased $13 million, 33%, and $20 million, 18%, in the third quarter and first nine months of 2025, compared with the corresponding periods of 2024, largely due to lower selling and administrative expense as discussed above. \nIndustrial\nThree Months Ended\nNine Months Ended\n(Dollars in millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\n% Change\nSeptember 27,\n2025\nSeptember 28,\n2024\n% Change\nRevenues:\nKautex\n$\n470 \n$\n452 \n4%\n$\n1,403 \n$\n1,432 \n(2)%\nTextron Specialized Vehicles\n291 \n388 \n(25)%\n989 \n1,214 \n(19)%\nTotal revenues\n761 \n840 \n(9)%\n2,392 \n2,646 \n(10)%\nCost of sales\n655 \n723 \n(9)%\n2,031 \n2,256 \n(10)%\nResearch and development costs\n15 \n16 \n(6)%\n49 \n54 \n(9)%\nSelling and administrative expense\n60 \n69 \n(13)%\n197 \n233 \n(15)%\nSegment profit\n$\n31 \n$\n32 \n(3)%\n$\n115 \n$\n103 \n12%\nProfit margin\n4.1%\n3.8%\n4.8%\n3.9%\nIndustrial segment revenues decreased $79 million, 9%, in the third quarter of 2025, compared with the third quarter of 2024. Revenues decreased $97 million, 25%, at Textron Specialized Vehicles, largely reflecting an $88 million impact from the disposition of the Powersports business in April 2025, as discussed in Note 12 to the Consolidated Financial Statements. Kautex revenues increased $18 million, 4%, primarily due to higher volume. \nIndustrial segment revenues decreased $254 million, 10%, in the first nine months of 2025, compared with the first nine months of 2024. Textron Specialized Vehicles' revenues decreased $225 million, 19%, largely reflecting a $123 million impact from the disposition and lower volume and mix, primarily in golf products. Kautex revenues decreased $29 million, 2%, largely due to lower volume. \nIndustrial's cost of sales decreased $68 million, 9%, and $225 million, 10%, in the third quarter and first nine months of 2025, respectively, compared with the corresponding periods of 2024, principally reflecting the impact from the disposition. The decrease in cost of sales in the first nine months of 2025 also included the impact from lower volume.\nIndustrial's selling and administrative expense decreased $9 million, 13%, and $36 million, 15%, in the third quarter and first nine months of 2025, respectively, compared with the corresponding periods of 2024, primarily reflecting the impact from the disposition. The decrease in expense in the first nine months of 2025 also reflected lower compensation costs, which included the impact of headcount reductions from restructuring activities. \nIndustrial's segment profit decreased $1 million, 3%, in the third quarter of 2025, and increased $12 million, 12%, in the first nine months of 2025, compared with the corresponding periods of 2024. The increase in segment profit for the first nine months of 2025 primarily reflected the impact from the disposition and cost reductions resulting from restructuring activities, partially offset by lower volume and mix described above and inflation, net of pricing.\n27\nTable of Contents\nTextron eAviation\nThree Months Ended\nNine Months Ended\n(Dollars in millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\n%\nChange\nSeptember 27,\n2025\nSeptember 28,\n2024\n%\nChange\nRevenues\n$\n5 \n$\n6 \n(17)%\n$\n20 \n$\n22 \n(9)%\nCost of sales\n7 \n5 \n40%\n20 \n20 \n—%\nResearch and development costs\n8 \n14 \n(43)%\n33 \n43 \n(23)%\nSelling and administrative expense\n5 \n5 \n—%\n15 \n13 \n15%\nSegment loss\n$\n(15)\n$\n(18)\n(17)%\n$\n(48)\n$\n(54)\n(11)%\nTextron eAviation segment revenues decreased $1 million and $2 million in the third quarter and first nine months of 2025, respectively, compared with the corresponding periods of 2024, and segment loss decreased $3 million and $6 million, respectively.  Research and development costs decreased $6 million and $10 million in the third quarter and first nine months of 2025, respectively, compared with the corresponding periods of 2024, due to a reduction in costs on certain development projects. \nFinance\nThree Months Ended\nNine Months Ended\n(In millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\nSeptember 27,\n2025\nSeptember 28,\n2024\nRevenues\n$\n26 \n$\n12 \n$\n57 \n$\n39 \nSelling and administrative expense\n4 \n3 \n8 \n(5)\nInterest expense, net\n4 \n4 \n13 \n14 \nSegment profit\n$\n18 \n$\n5 \n$\n36 \n$\n30 \nFinance segment revenues increased $14 million and $18 million and segment profit increased $13 million and $6 million in the third quarter and first nine months of 2025, respectively, compared with the corresponding periods of 2024. The increase in revenues and segment profit for both periods included $11 million of gains on the disposition of non-captive assets in the third quarter of 2025. Selling and administrative expense in the first nine months of 2024 included an $8 million recovery of amounts that were previously written off related to one customer relationship. \nLiquidity and Capital Resources\nOur financings are conducted through two separate borrowing groups. The Manufacturing group consists of Textron consolidated with its majority-owned subsidiaries that operate in the Textron Aviation, Bell, Textron Systems, Industrial and Textron eAviation segments. The Finance group, which also is the Finance segment, consists of Textron Financial Corporation and its consolidated subsidiaries. We designed this framework to enhance our borrowing power by separating the Finance group.  Our Manufacturing group operations include the development, production and delivery of tangible goods and services, while our Finance group provides financial services. Due to the fundamental differences between each borrowing group’s activities, investors, rating agencies and analysts use different measures to evaluate each group’s performance. To support those evaluations, we present balance sheet and cash flow information for each borrowing group within the Consolidated Financial Statements.\nKey information that is utilized in assessing our liquidity is summarized below:\n(Dollars in millions)\nSeptember 27,\n2025\nDecember 28,\n2024\nManufacturing group\nCash and equivalents\n$\n1,446 \n$\n1,386 \nDebt\n3,394 \n3,247 \nShareholders’ equity\n7,493 \n7,204 \nCapital (debt plus shareholders’ equity)\n10,887 \n10,451 \nNet debt (net of cash and equivalents) to capital\n21%\n21%\nDebt to capital\n31%\n31%\nFinance group\nCash and equivalents\n$\n76 \n$\n55 \nDebt\n340 \n341 \nWe believe that our calculations of debt to capital and net debt to capital are useful measures as they provide a summary indication of the level of debt financing (i.e., leverage) that is in place to support our capital structure, as well as to provide an indication of \n28\nTable of Contents\nthe capacity to add further leverage. We expect to have sufficient cash to meet our needs based on our existing cash balances, the cash we expect to generate from our manufacturing operations and the availability of our existing credit facility. \nCredit Facilities and Other Sources of Capital\nOn October 16, 2025, Textron entered into a senior unsecured revolving credit facility for an aggregate principal amount of $1.0 billion, of which $100 million is available for the issuance of letters of credit. We may elect to increase the aggregate amount of commitments under the facility to up to $1.3 billion by designating an additional lender or by an existing lender agreeing to increase its commitment. The facility expires in October 2030 and provides for two one-year extensions at our option with the consent of lenders representing a majority of the commitments under the facility. The new facility replaces the existing 5-year facility which was scheduled to expire in October 2027. There were no amounts borrowed against either facility and at September 27, 2025 and December 28, 2024, there was a $9 million letter of credit issued and outstanding under the prior facility that remains outstanding under the new facility. \nWe also maintain an effective shelf registration statement filed with the Securities and Exchange Commission that allows us to issue an unlimited amount of public debt and other securities. On February 13, 2025, we issued $500 million of SEC-registered fixed-rate notes due in May 2035 with an annual interest rate of 5.50%. On March 3, 2025, we repaid our $350 million 3.875% Notes due in 2025.\nManufacturing Group Cash Flows\nCash flows for the Manufacturing group as presented in our Consolidated Statements of Cash Flows are summarized below:\nNine Months Ended\n(In millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\nOperating activities\n$\n629 \n$\n561 \nInvesting activities\n(94)\n(194)\nFinancing activities\n(495)\n(1,199)\nIn the first nine months of 2025, cash flows from operating activities increased $68 million to $629 million, compared with $561 million in the first nine months of 2024, primarily due to $60 million in lower net tax payments.  \nCash flows used in investing activities included $210 million and $211 million of capital expenditures in the first nine months of 2025 and 2024, respectively, partially offset by $77 million and $27 million of net proceeds from corporate-owned life insurance policies, respectively. In the first nine months of 2025, cash flows used in investing activities also included $16 million of net proceeds from the disposition of the Powersports business as discussed in Note 12 to the Consolidated Financial Statements. \nCash flows used in financing activities in the first nine months of 2025 included $635 million of cash paid to repurchase an aggregate of 8.4 million shares of our common stock and $355 million of payments on long-term debt, partially offset by $495 million of net proceeds from the issuance of long-term debt. In the first nine months of 2024, cash flows used in financing activities included $890 million of cash paid to repurchase an aggregate of 10.1 million shares of our common stock and $360 million of payments on long-term debt.  \nFinance Group Cash Flows\nCash flows for the Finance group as presented in our Consolidated Statements of Cash Flows are summarized below:\nNine Months Ended\n(In millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\nOperating activities\n$\n14 \n$\n4 \nInvesting activities\n19 \n9 \nFinancing activities\n(12)\n(15)\nThe Finance group’s cash flows from investing activities included finance receivable originations of $167 million and $90 million in the first nine months of 2025 and 2024, respectively, and collections on finance receivables totaling $119 million and $99 million, respectively. In the first nine months of 2025, investing cash flows also included $66 million of proceeds from the disposition of non-captive assets. In the first nine months of 2025 and 2024, financing activities included payments on long-term and nonrecourse debt of $12 million and $15 million, respectively.     \n29\nTable of Contents\nConsolidated Cash Flows\nThe consolidated cash flows after elimination of activity between the borrowing groups, are summarized below:\nNine Months Ended\n(In millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\nOperating activities\n$\n613 \n$\n569 \nInvesting activities\n(45)\n(189)\nFinancing activities\n(507)\n(1,214)\nIn the first nine months of 2025, cash flows from operating activities increased $44 million to $613 million, compared with $569 million in the first nine months of 2024, primarily due to $55 million in lower net tax payments, partially offset by a net cash outflow of $34 million from captive financing activities.  \nCash flows used in investing activities included $210 million and $211 million of capital expenditures in the first nine months of 2025 and 2024, respectively, partially offset by $77 million and $27 million of net proceeds from corporate-owned life insurance policies, respectively. In the first nine months of 2025, cash flows used in investing activities also included $66 million of proceeds from the disposition of non-captive assets and $16 million of net proceeds from the disposition of the Powersports business.\nCash flows used in financing activities in the first nine months of 2025 included $635 million of cash paid to repurchase shares of our outstanding common stock and $367 million of payments on long-term and non-recourse debt, partially offset by $495 million of net proceeds from the issuance of long-term debt. In the first nine months of 2024, cash flows used in financing activities included $890 million of cash paid to repurchase shares of our outstanding common stock and $375 million of payments on long-term and non-recourse debt.\nCaptive Financing and Other Intercompany Transactions\nThe Finance group provides financing primarily to purchasers of new and pre-owned Textron Aviation aircraft and Bell helicopters manufactured by our Manufacturing group, otherwise known as captive financing. In the Consolidated Statements of Cash Flows, cash received from customers is reflected as operating activities when received from third parties. However, in the cash flow information provided for the separate borrowing groups, cash flows related to captive financing activities are reflected based on the operations of each group. For example, when product is sold by our Manufacturing group to a customer and is financed by the Finance group, the origination of the finance receivable is recorded within investing activities as a cash outflow in the Finance group’s statement of cash flows. Meanwhile, in the Manufacturing group’s statement of cash flows, the cash received from the Finance group on the customer’s behalf is recorded within operating cash flows as a cash inflow. Although cash is transferred between the two borrowing groups, there is no cash transaction reported in the consolidated cash flows at the time of the original financing. These captive financing activities, along with all significant intercompany transactions, are reclassified or eliminated from the Consolidated Statements of Cash Flows.\nReclassification adjustments included in the Consolidated Statements of Cash Flows on page \n6\n are summarized below:\nNine Months Ended\n(In millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\nReclassification adjustments from investing activities to operating activities:\nFinance receivable originations for Manufacturing group inventory sales\n$\n(127)\n$\n(72)\nCash received from customers\n97 \n76 \nTotal reclassification adjustments from investing activities to operating activities\n$\n(30)\n$\n4 \n30\nTable of Contents\nCritical Accounting Estimates Update\nOur Consolidated Financial Statements are prepared in conformity with U.S. generally accepted accounting principles, which require us to make estimates and assumptions that affect the amounts reported in the financial statements. The accounting estimates that we believe are most critical to the portrayal of our financial condition and results of operations are reported in Item 7 of our 2024 Annual Report on Form 10-K. The following section provides an update of the year-end disclosure.\nRevenue Recognition\nA substantial portion of our revenues is related to long-term contracts with the U.S. Government, including those under the U.S. Government-sponsored foreign military sales program, for the design, development, manufacture or modification of aerospace and defense products as well as related services. We generally use the cost-to-cost method to measure progress for these contracts because it best depicts the transfer of control to the customer that occurs as we incur costs on our contracts. Under this measure, the extent of progress towards completion is measured based on the ratio of costs incurred to date to the estimated costs at completion of the performance obligation, and revenue is recorded proportionally as costs are incurred.\nChanges in our estimate of the total expected cost or in the transaction price for a contract typically impact our profit booking rate. We utilize the cumulative catch-up method of accounting to recognize the impact of these changes on our profit booking rate for a contract. Under this method, the inception-to-date impact of a profit adjustment on a contract is recognized in the period the adjustment is identified. The impact of our cumulative catch-up adjustments on segment profit recognized in prior periods is presented below:\nThree Months Ended\nNine Months Ended\n(In millions)\nSeptember 27,\n2025\nSeptember 28,\n2024\nSeptember 27,\n2025\nSeptember 28,\n2024\nGross favorable\n$\n28 \n$\n23 \n$\n89 \n$\n95 \nGross unfavorable\n(10)\n(13)\n(46)\n(54)\nNet adjustments\n$\n18 \n$\n10 \n$\n43 \n$\n41 \n31\nTable of Contents\nForward-Looking Information\nCertain statements in this Quarterly Report on Form 10-Q and other oral and written statements made by us from time to time are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements, which may describe strategies, goals, outlook or other non-historical matters, or project revenues, income, returns or other financial measures, often include words such as “believe,” “expect,” “anticipate,” “intend,” “plan,” “estimate,” “guidance,” “project,” “target,” “potential,” “will,” “should,” “could,” “likely” or “may” and similar expressions intended to identify forward-looking statements. These statements are only predictions and involve known and unknown risks, uncertainties, and other factors that may cause our actual results to differ materially from those expressed or implied by such forward-looking statements. Given these uncertainties, you should not place undue reliance on these forward-looking statements. Forward-looking statements speak only as of the date on which they are made, and we undertake no obligation to update or revise any forward-looking statements.  In addition to those factors described in our 2024 Annual Report on Form 10-K under “Risk Factors,” among the factors that could cause actual results to differ materially from past and projected future results are the following:\n•\nInterruptions in the U.S. Government’s ability to fund its activities, pay its obligations, and/or conduct government functions necessary for the certification of aircraft and aircraft parts and other activities of our businesses;\n•\nChanging priorities or reductions in the U.S. Government defense budget, including those related to military operations in foreign countries;\n•\nOur ability to perform as anticipated and to control costs under contracts with the U.S. Government;\n•\nThe U.S. Government’s ability to unilaterally modify or terminate its contracts with us for the U.S. Government’s convenience or for our failure to perform, to change applicable procurement and accounting policies, or, under certain circumstances, to withhold payment or suspend or debar us as a contractor eligible to receive future contract awards;\n•\nChanges in foreign military funding priorities or budget constraints and determinations, or changes in government regulations or policies on the export and import of military and commercial products;\n•\nVolatility in the global economy or changes in worldwide political conditions that adversely impact demand for our products;\n•\nVolatility in interest rates or foreign exchange rates and inflationary pressures;\n•\nRisks related to our international business, including establishing and maintaining facilities in locations around the world and relying on joint venture partners, subcontractors, suppliers, representatives, consultants and other business partners in connection with international business, including in emerging market countries;\n•\nOur Finance segment’s ability to maintain portfolio credit quality or to realize full value of receivables;\n•\nPerformance issues with key suppliers or subcontractors;\n•\nLegislative or regulatory actions, both domestic and foreign, impacting our operations or demand for our products;\n•\nOur ability to control costs and successfully implement various cost-reduction activities; \n•\nThe efficacy of research and development investments to develop new products or unanticipated expenses in connection with the launching of significant new products or programs;\n•\nThe timing of our new product launches or certifications of our new aircraft products;\n•\nOur ability to keep pace with our competitors in the introduction of new products and upgrades with features and technologies desired by our customers;\n•\nPension plan assumptions and future contributions;\n•\nDemand softness or volatility in the markets in which we do business;\n•\nCybersecurity threats, including the potential misappropriation of assets or sensitive information, corruption of data or operational disruption;\n•\nDifficulty or unanticipated expenses in connection with integrating acquired businesses;\n•\nThe risk that acquisitions do not perform as planned, including, for example, the risk that acquired businesses will not achieve revenue and profit projections;\n•\nThe impact of changes in tax legislation; \n•\nThe risk of disruptions to our business and the business of our suppliers, customers and other business partners due to unexpected events, such as pandemics, natural disasters, acts of war, strikes, terrorism, social unrest or other societal, geopolitical or macroeconomic conditions; \n•\nRisks related to changing U.S. and foreign trade policies, including increased trade restrictions or tariffs; and\n•\nThe ability of our businesses to hire, train and retain the highly skilled personnel necessary for our businesses to succeed. \n32\nTable of Contents"
}