{
  "source_file": "txt-20241228.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business\nTextron Inc. is a multi-industry company that leverages its global network of aircraft, defense, industrial and finance businesses to provide customers with innovative products and services around the world. References to “Textron Inc.,” the “Company,” “we,” “our” and “us” in this Annual Report on Form 10-K, unless otherwise indicated, refer to Textron Inc. and its consolidated subsidiaries.\nWe conduct our business through six operating segments: Textron Aviation, Bell, Textron Systems, Industrial and Textron eAviation, which represent our manufacturing businesses, and Finance, which represents our captive finance business. Our segments include numerous separately incorporated subsidiaries. Total revenues for 2024 were $13.7 billion and are presented below by segment and customer type. \n \nThe following description of our business and operating segments should be read in conjunction with Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations. \nTextron Aviation Segment\nTextron Aviation is a leader in general aviation. Textron Aviation manufactures, sells and services Cessna and Beechcraft aircraft, and services the Hawker brand of business jets. The segment has two principal product lines: aircraft and aftermarket parts and services. Aircraft includes sales of business jets, turboprop aircraft, military trainer and defense aircraft and piston engine aircraft.  Aftermarket parts and services includes commercial parts sales and maintenance, inspection and repair services, and advanced flight training devices. \nTextron Aviation's business jets include the Cessna Citation M2 Gen2, Citation CJ3+, Citation CJ4 Gen2, Citation XLS Gen2, Citation Latitude and the Citation Longitude. In October 2024, Textron Aviation introduced its next generation of light jets, the Citation M2 Gen3, CJ3 Gen3 and CJ4 Gen3, which will include the revolutionary Garmin Emergency Autoland technology. Currently under development, the CJ3 Gen2 is expected to enter into service in 2025, the CJ4 Gen3 is expected to enter into service in 2026, and the M2 Gen3 and CJ3 Gen3 are expected to enter into service in 2027. In addition, Textron Aviation is developing the Citation Ascend, a high-performance midsize business jet, which is continuing to progress through the Federal Aviation Administration's (FAA) certification process and is expected to enter into service in 2025.\nTextron Aviation’s turboprop aircraft include the Beechcraft King Air 260, King Air 360ER and King Air 360, and the Cessna Caravan, Grand Caravan EX and SkyCourier. The Beechcraft Denali, a high-performance single engine turboprop aircraft under development, continues toward FAA certification. The Denali will be powered by an engine expected to be up to 20% more efficient than similarly sized engines.\nTextron Aviation’s military trainer and defense aircraft include the Beechcraft T-6 trainer, which has been used to train pilots from more than 40 countries, and the AT-6 light attack military aircraft. Textron Aviation’s piston engine aircraft include the Cessna Skyhawk, Skylane, Turbo Skylane, Turbo Stationair HD and the Beechcraft Baron G58 and Bonanza G36.\nTextron Aviation markets its products worldwide through its own sales force, as well as through a network of authorized independent sales representatives. With a product lineup ranging from introductory training aircraft through super mid-size business jets, Textron Aviation’s diverse customer base includes fractional aircraft businesses, charter and fleet operators, corporate aviation, individual buyers, training schools, airlines, and special mission, military and government operators.\n3\nTable of Contents\nIn support of its family of aircraft, Textron Aviation operates a global network of more than 20 service centers. In addition, more than 300 authorized independent service centers are located throughout the world. Textron Aviation-owned service centers provide customers with 24-hour service and maintenance. Textron Aviation also provides its customers with around-the-clock parts support and offers a mobile support program with over 80 mobile service units.\nBell Segment\nBell is a leading supplier of military and commercial helicopters, tiltrotor aircraft, and related spare parts and services in the world. Tiltrotor aircraft are designed to provide the benefits of both helicopters and fixed-wing aircraft. \nBell supplies advanced military helicopters and provides parts and support services to the U.S. Government and to military customers outside the United States. Bell’s primary U.S. Government programs are for the development of a next generation tiltrotor aircraft for the U.S. Army’s Future Long Range Assault Aircraft (FLRAA) program and the production and support of the V-22 tiltrotor aircraft and H-1 helicopters. Under the U.S. Government-sponsored foreign military sales program, Bell offers the V-22 tiltrotor aircraft and H-1 helicopter products for sale to other countries.\nThe FLRAA development contract was awarded to Bell in December 2022. In 2024, the U.S. Army announced approval of Milestone B for the FLRAA program, establishing FLRAA as a program of record and transitioning the program to the Engineering and Manufacturing Development phase. This phase includes continued digital modeling, detailed hardware and software design, and fabrication of hardware, as Bell proceeds to critical design review and the first prototype flight planned for 2026.\nThrough its commercial business, Bell is a leading supplier of commercially certified helicopters and support to corporate, private, law enforcement, utility, public safety and emergency medical helicopter operators, and U.S. and foreign governments.  Bell produces a variety of commercial aircraft types, including light single- and twin-engine helicopters and medium twin-engine helicopters, along with other related products. The commercial helicopters currently offered by Bell include the 429, 407GXi, 412EPX and 505 Jet Ranger X. Bell’s super medium commercial helicopter, the 525 Relentless, continues toward FAA certification.\nFor both its military programs and its commercial products, Bell provides post-sale support and service for an installed base of approximately 13,000 helicopters. Bell operates a global network of eight Company-operated service centers and four global parts distribution centers. In addition, approximately 85 independent service centers are located in about 35 countries. Collectively, these service sites offer a complete range of logistics support, including parts, support equipment, technical data, training devices, pilot and maintenance training, component repair and overhaul, engine repair and overhaul, aircraft modifications, aircraft customizing, accessory manufacturing, contractor maintenance, field service and product support engineering.\nTextron Systems Segment\nThe businesses in our Textron Systems segment develop, manufacture and integrate a variety of products and services for U.S. and international military, government and commercial customers to support defense, homeland security, aerospace, infrastructure protection and other customer missions. Product and service offerings of this segment include electronic systems and solutions, advanced marine craft, piston aircraft engines, live military air-to-air and air-to-ship training, weapons and related components, unmanned aircraft systems and both manned and unmanned armored and specialty vehicles. \nNotable products currently developed and produced by the Textron Systems segment include the Ship-to-Shore Connector, the U.S. Navy's next generation of Landing Craft Air Cushion vehicles; a family of test and simulation products; the Aerosonde Small Unmanned Aircraft System, a multi-mission capable unmanned aircraft system for commercial and military operations; and piston aircraft engines under the Lycoming brand. Notable service offerings of the segment include fee-for-service programs, using unmanned aircraft systems, and live military air-to-air and air-to-ship training and support services for U.S. Navy, Marine and Air Force personnel provided by Airborne Tactical Advantage Company.  \nIndustrial Segment\nOur Industrial segment designs and manufactures a variety of products within the Kautex and Textron Specialized Vehicles businesses.\nKautex is a leader in designing and manufacturing plastic fuel systems for automobiles and light trucks, including blow-molded solutions for conventional plastic fuel tanks and pressurized plastic fuel tanks for hybrid vehicle applications. Kautex also develops and manufactures clear-vision systems for automotive safety and advanced driver assistance systems (ADAS). Our cleaning systems are comprised of nozzles, reservoirs, inlets and pumps to support onboard cleaning for windscreens, headlamps and ADAS cameras and sensors. In addition, Kautex produces plastic tanks for selective catalytic reduction systems used to reduce emissions from diesel engines, and other fuel system components. Kautex also offers lightweight, composite Pentatonic battery systems, which include enclosures, underbody protection and thermal management systems, for use in electric vehicles, from hybrid to full battery-powered.\n4\nTable of Contents\nKautex’s business model is focused on developing and maintaining long-term customer relationships with leading global original equipment manufacturers (OEMs). Kautex, which is headquartered in Bonn, Germany, operates over 30 plants in 13 countries in close proximity to its customers, along with 9 engineering/research and development locations around the world.\nOur Textron Specialized Vehicles businesses manufacture and sell products under our E-Z-GO, Arctic Cat, TUG Technologies, Douglas Equipment, Premier, Safeaero, Ransomes, Jacobsen and Cushman brands. These businesses design, manufacture and sell golf cars; off-road utility vehicles; powersports products; light transportation vehicles; aviation ground support equipment; professional turf-maintenance equipment; and specialized turf-care vehicles. A significant portion of the products sold by these businesses are powered with lithium batteries, greatly reducing the products’ impact on the environment.\nThe diversified customer base for Textron Specialized Vehicles includes golf courses and resorts, government agencies and municipalities, consumers, outdoor enthusiasts, and commercial and industrial users such as factories, warehouses, airlines, planned communities, hunting preserves, educational and corporate campuses, sporting venues and landscaping professionals. Sales are made through a network of independent distributors and dealers worldwide and the Bass Pro Shops and Cabela's retail outlets, which sell our powersports products under the Tracker Off Road brand, as well as factory direct resources. In addition, we also manufacture powersports products for OEMs for resale to customers under the OEM’s branding.\nTextron eAviation Segment\nOur Textron eAviation segment is focused on research and development initiatives related to sustainable aviation solutions and includes Pipistrel, a manufacturer of light aircraft. Pipistrel offers a family of light aircraft and gliders with both electric and combustion engines, including the Velis Electro, which is the world’s first, and currently only, electric aircraft to receive full type certification from the European Union Aviation Safety Agency and from the UK Civil Aviation Authority. In 2024, the FAA granted a light-sport aircraft airworthiness exemption for the Pipistrel Velis Electro, allowing flight training in an electric aircraft within the United States.\nThe Textron eAviation segment is also developing both hybrid and electric propulsion aircraft, including Pipistrel's Nuuva V300, a long-range, large-capacity hybrid-electric vertical takeoff and landing aircraft, and an electric vertical takeoff and landing (eVTOL) aircraft. The Nuuva V300's first hover flight is expected in 2025 and initial testing on the Nexus, a full-scale technology demonstrator eVTOL, is expected to begin in 2025.\nFinance Segment\nOur Finance segment, or the Finance group, is a commercial finance business that consists of Textron Financial Corporation (TFC) and its consolidated subsidiaries. The Finance segment provides financing primarily to purchasers of new and pre-owned Textron Aviation aircraft and Bell helicopters. A substantial number of the originations in our finance receivable portfolio are cross-border transactions for aircraft sold outside of the U.S. In 2024 and 2023, our Finance group made payments of $109 million and $160 million, respectively, to finance the Manufacturing group's sale of Textron-manufactured products to third parties.  \nBacklog\nBacklog represents amounts allocated to contracts that we expect to recognize as revenue in future periods when we perform under the contracts. Backlog excludes unexercised contract options and potential orders under ordering-type contracts, such as Indefinite Delivery, Indefinite Quantity contracts.\nOur backlog at the end of 2024 and 2023 is summarized below:\n(In millions)\nDecember 28,\n2024\nDecember 30,\n2023\nTextron Aviation\n$\n7,845 \n$\n7,169 \nBell\n7,469 \n4,780 \nTextron Systems\n2,594 \n1,950 \nTotal backlog\n$\n17,908 \n$\n13,899 \nU.S. Government Contracts and Other Governmental Regulation\nOur operations, products and services are subject to various government regulations, including regulations related to U.S. government business, international regulation of aviation products and services, and environmental regulations. \nContracts with the U.S. Government, including contracts under the U.S. Government-sponsored foreign military sales program, generated approximately 25% of our consolidated revenues in 2024, primarily in our Bell and Textron Systems segments. We must comply with and are affected by laws and regulations relating to the formation, administration and performance of U.S. Government contracts. These laws and regulations, among other things, require certification and disclosure of all cost and pricing \n5\nTable of Contents\ndata in connection with contract negotiation; define allowable and unallowable costs and otherwise govern our right to reimbursement under certain cost-based U.S. Government contracts; and safeguard and restrict the use and dissemination of classified and covered defense information and the export of certain products and technical data. New laws, regulations or procurement requirements, or changes to current ones, can significantly increase our costs, reducing our profitability. \nOur contracts with the U.S. Government generally may be terminated by the U.S. Government for convenience or if we default in whole or in part by failing to perform under the terms of the applicable contract. If the U.S. Government terminates a contract for convenience, we normally will be entitled to payment for the cost of contract work performed before the effective date of termination, including, if applicable, reasonable profit on such work, as well as reasonable termination costs. If, however, the U.S. Government terminates a contract for default, generally: (a) we will be paid the contract price for completed supplies delivered and accepted and services rendered, an agreed-upon amount for manufacturing materials delivered and accepted and for the protection and preservation of property, and an amount for partially completed products accepted by the U.S. Government; (b) the U.S. Government may not be liable for our costs with respect to unaccepted items and may be entitled to repayment of advance payments and progress payments related to the terminated portions of the contract; (c) the U.S. Government may not be liable for assets we own and utilize to provide services under the “fee-for-service” contracts; and (d) we may be liable for excess costs incurred by the U.S. Government in procuring undelivered items from another source. See the \nAerospace and Defense Industry\n section in Item 1A. Risk Factors for additional information related to regulation of U.S. Government business.\nOur commercial aircraft manufacturing businesses are regulated by the FAA in the U.S. and by similar aviation regulatory governing authorities internationally, including, the European Aviation Safety Agency. Maintenance facilities and aftermarket services must also comply with FAA and international regulations. These regulations address production and quality systems, airworthiness and installation approvals, repair procedures and continuing operational safety. For an aircraft to be manufactured and sold, the model must receive a type certificate from the appropriate aviation authority, and each aircraft must receive a certificate of airworthiness. Aircraft outfitting and completions also require approval by the appropriate aviation authority. See the \nStrategic Risks\n section in Item 1A. Risk Factors for additional information with respect to risks related to obtaining certification of new aircraft products.\nOur operations are subject to numerous laws and regulations designed to protect the environment. For additional information regarding environmental matters, see Note 17 to the Consolidated Financial Statements in Item 8. Financial Statements and Supplementary Data, and the \nBusiness and Operational Risks\n and \nRisks Related to Regulatory, Legal and Other Matters\n sections in Item 1A. Risk Factors.\nBased on current information and the applicable laws and regulations currently in effect, compliance with government regulations, including environmental regulations, has not had, and we do not expect it to have, a material effect on our capital expenditures, earnings or competitive position. However, laws and regulations may be changed or adopted that impose additional compliance requirements which could necessitate capital expenditures or otherwise increase our costs of doing business, reducing our profitability and negatively impacting our operating results. \nHuman Capital Resources\nAt December 28, 2024, we employed approximately 34,000 employees worldwide, with approximately 80% located in the U.S. and the remainder located outside of the U.S. Approximately 7,400, or 28%, of our U.S. employees, most of whom work for our Bell and Textron Aviation segments, are represented by unions under collective bargaining agreements, and certain of our non-U.S. employees are represented by organized works councils. From time to time, our collective bargaining agreements expire. Historically, we have been successful in negotiating renewals to expiring agreements without any material disruption of operating activities; however, on September 21, 2024, Textron Aviation’s largest union rejected a proposed new contract and initiated a strike. The strike impacted approximately 5,000 of Textron Aviation’s employees at its manufacturing, parts and distribution and service center facilities in Wichita, Kansas. On October 20, 2024, Textron Aviation and the union reached an agreement and a new five-year labor contract was ratified.  \nOur success is highly dependent upon our ability to hire, train and retain a workforce with the skills necessary for our businesses to develop and manufacture the products desired by our customers. We need highly skilled personnel in multiple areas including, among others, engineering, manufacturing, information technology, cybersecurity, flight operations, business development and strategy and management. In order to attract and retain highly skilled employees, we offer comprehensive compensation and benefit programs, career opportunities and an engaging, inclusive environment where employees are treated with dignity and respect.\nHealth and Safety\nThe health and safety of our employees, contractors and communities is a priority, and we strive to provide our employees with healthy working conditions and safe facilities. To maintain and enhance the safety of our employees, we promote a workplace safety culture of continuous improvement, shared responsibility, and individual accountability. We use an annual goal setting \n6\nTable of Contents\nprocess to drive injury rate improvements, and the injury rate reduction goal is a performance metric that is tracked and reported to senior leadership and the Audit Committee of the Board of Directors. \nTalent and Career Development\nOur talent development programs are designed to prepare our employees at all levels to take on new career and growth opportunities at Textron. Leadership, professional and functional training courses are tailored for employees at each stage of their careers and include a mix of enterprise-wide and business unit-specific programs. Textron University, an internal corporate function, provides (i) facilitated face-to-face professional and leadership development programs, (ii) web-based general and specialized functional and technical courses and (iii) an online portal to access advanced skills technical training, manage recertification of existing qualifications and other career planning tools and resources.\nThe current and future talent needs of each of our businesses are assessed annually through a formal talent review process which enables us to develop leadership succession plans and provide our employees with potential new career opportunities. In addition, leaders from functional areas within each business belong to enterprise-wide councils that conduct annual talent reviews. These processes enable us to fill talent needs by matching employees who are ready to assume significant leadership roles with opportunities that best fit their career path, which may be in other businesses within the enterprise.\nWe believe by employing highly talented employees who feel valued, respected and are able to contribute fully, we will improve performance, innovation, collaboration and talent retention, all of which contributes to stronger business results and reinforces our reputation as leaders in our industries and communities.\nFor discussion of certain risks relating to human capital management, see the \nRisks Related to Human Capital\n section in Item 1A. Risk Factors.\nPatents and Trademarks\nWe own, or are licensed under, numerous patents throughout the world relating to products, services and methods of manufacturing. Patents developed while under contract with the U.S. Government may be subject to use by the U.S. Government. We also own or license active trademark registrations and pending trademark applications in the U.S. and in various foreign countries or regions, as well as trade names and service marks. While our intellectual property rights in the aggregate are important to the operation of our business, we do not believe that any existing patent, license, trademark or other intellectual property right is of such importance that its loss or termination would have a material adverse effect on our business taken as a whole.\nInformation about our Executive Officers\nThe following table sets forth certain information concerning our executive officers as of February 6, 2025.\nName\nAge\nCurrent Position with Textron Inc.\nScott C. Donnelly\n63\nChairman, President and Chief Executive Officer\nFrank T. Connor\n65\nExecutive Vice President and Chief Financial Officer\nJulie G. Duffy\n59\nExecutive Vice President and Chief Human Resources Officer\nE. Robert Lupone\n65\nExecutive Vice President, General Counsel, Secretary and Chief Compliance Officer\nMr. Donnelly joined Textron in June 2008 as Executive Vice President and Chief Operating Officer and was promoted to President and Chief Operating Officer in January 2009. He was appointed to the Board of Directors in October 2009 and became Chief Executive Officer of Textron in December 2009. In July 2010, Mr. Donnelly was appointed Chairman of the Board of Directors effective September 1, 2010. Previously, Mr. Donnelly was the President and CEO of General Electric Company’s Aviation business unit, a position he had held since July 2005. GE’s Aviation business unit is a leading maker of commercial and military jet engines and components, as well as integrated digital, electric power and mechanical systems for aircraft. Prior to July 2005, Mr. Donnelly served as Senior Vice President of GE Global Research, one of the world’s largest and most diversified industrial research organizations with facilities in the U.S., India, China and Germany and held various other management positions since joining General Electric in 1989.\nMr. Connor joined Textron in August 2009 as Executive Vice President and Chief Financial Officer. Previously, Mr. Connor was head of Telecom Investment Banking at Goldman, Sachs & Co. from 2003 to 2008. Prior to that position, he served as Chief Operating Officer of Telecom, Technology and Media Investment Banking at Goldman, Sachs & Co. from 1998 to 2003. Mr. Connor joined the Corporate Finance Department of Goldman, Sachs & Co. in 1986 and became a Vice President in 1990 and a Managing Director in 1996. \n7\nTable of Contents\nOn October 23, 2024, we announced that Mr. Connor will be retiring effective February 28, 2025. David Rosenberg, currently our Vice President – Investor Relations, has been appointed Executive Vice President and Chief Financial Officer to succeed Mr. Connor, effective March 1, 2025. Mr. Rosenberg, 48, has more than 24 years of experience in the aviation industry. Prior to his role as Vice President – Investor Relations, he served as Senior Vice President & Chief Financial Officer of Textron Aviation from 2018 through 2023, having previously held leadership positions in finance at Textron Aviation. Following Textron’s acquisition of Beechcraft in 2014, as Textron Aviation’s Vice President, Integration & Strategy, Mr. Rosenberg led the successful merger and integration of Beechcraft and Textron’s Cessna Aircraft business, which created today’s Textron Aviation segment.  Prior to Textron’s acquisition of Beechcraft, Mr. Rosenberg held a series of leadership positions in financial planning, business management, strategic planning and operations with Beechcraft and its predecessor companies.\nMs. Duffy was named Executive Vice President, Human Resources in July 2017 and Executive Vice President and Chief Human Resources Officer in April 2022. Ms. Duffy joined Textron in 1997 as a member of the corporate legal team and has since held positions of increasing responsibility within the Company’s legal function, previously serving as Vice President and Deputy General Counsel – Litigation, a position she had held since 2011. In that role she was responsible for managing the corporate litigation staff with primary oversight of litigation throughout Textron. She has also played an active role in developing, implementing and standardizing human resources policies across the Company and served as the senior legal advisor on employment and benefits issues.\nMr. Lupone joined Textron in February 2012 as Executive Vice President, General Counsel, Secretary and Chief Compliance Officer. Previously, he was Senior Vice President and General Counsel of Siemens Corporation (U.S.) since 1999 and General Counsel of Siemens AG for the Americas since 2008. Prior to joining Siemens in 1992, Mr. Lupone was Vice President and General Counsel of Price Communications Corporation.\nAvailable Information\nWe make available free of charge on our Internet Web site (www.textron.com) our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 as soon as reasonably practicable after we electronically file such material with, or furnish it to, the Securities and Exchange Commission.\nForward-Looking Information\nCertain statements in this Annual Report on Form 10-K and other oral and written statements made by us from time to time are “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements, which may describe strategies, goals, outlook or other non-historical matters, or project revenues, income, returns or other financial measures, often include words such as “believe,” “expect,” “anticipate,” “intend,” “plan,” “estimate,” “guidance,” “project,” “target,” “potential,” “will,” “should,” “could,” “likely” or “may” and similar expressions intended to identify forward-looking statements. These statements are only predictions and involve known and unknown risks, uncertainties, and other factors that may cause our actual results to differ materially from those expressed or implied by such forward-looking statements. Given these uncertainties, you should not place undue reliance on these forward-looking statements. Forward-looking statements speak only as of the date on which they are made, and we undertake no obligation to update or revise any forward-looking statements. In addition to those factors described herein under “Risk Factors,” among the factors that could cause actual results to differ materially from past and projected future results are the following:\n•\nInterruptions in the U.S. Government’s ability to fund its activities and/or pay its obligations;\n•\nChanging priorities or reductions in the U.S. Government defense budget, including those related to military operations in foreign countries;\n•\nOur ability to perform as anticipated and to control costs under contracts with the U.S. Government;\n•\nThe U.S. Government’s ability to unilaterally modify or terminate its contracts with us for the U.S. Government’s convenience or for our failure to perform, to change applicable procurement and accounting policies, or, under certain circumstances, to withhold payment or suspend or debar us as a contractor eligible to receive future contract awards;\n•\nChanges in foreign military funding priorities or budget constraints and determinations, or changes in government regulations or policies on the export and import of military and commercial products;\n•\nVolatility in the global economy or changes in worldwide political conditions that adversely impact demand for our products;\n•\nVolatility in interest rates or foreign exchange rates and inflationary pressures;\n•\nRisks related to our international business, including establishing and maintaining facilities in locations around the world and relying on joint venture partners, subcontractors, suppliers, representatives, consultants and other business partners in connection with international business, including in emerging market countries;\n•\nOur Finance segment’s ability to maintain portfolio credit quality or to realize full value of receivables;\n•\nPerformance issues with key suppliers or subcontractors;\n•\nLegislative or regulatory actions, both domestic and foreign, impacting our operations or demand for our products;\n8\nTable of Contents\n•\nOur ability to control costs and successfully implement various cost-reduction activities; \n•\nThe efficacy of research and development investments to develop new products or unanticipated expenses in connection with the launching of significant new products or programs;\n•\nThe timing of our new product launches or certifications of our new aircraft products;\n•\nOur ability to keep pace with our competitors in the introduction of new products and upgrades with features and technologies desired by our customers;\n•\nPension plan assumptions and future contributions;\n•\nDemand softness or volatility in the markets in which we do business;\n•\nCybersecurity threats, including the potential misappropriation of assets or sensitive information, corruption of data or operational disruption;\n•\nDifficulty or unanticipated expenses in connection with integrating acquired businesses;\n•\nThe risk that acquisitions do not perform as planned, including, for example, the risk that acquired businesses will not achieve revenue and profit projections;\n•\nThe impact of changes in tax legislation; \n•\nThe risk of disruptions to our business and the business of our suppliers, customers and other business partners due to unexpected events, such as pandemics, natural disasters, acts of war, strikes, terrorism, social unrest or other societal, geopolitical or macroeconomic conditions; \n•\nRisks related to changing U.S. and foreign trade policies, including increased trade restrictions or tariffs; and\n•\nThe ability of our businesses to hire, train and retain the highly skilled personnel necessary for our businesses to succeed.",
  "item7": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nIn 2024, our operating results were adversely impacted by a strike at the Textron Aviation segment. On September 21, 2024, the International Association of Machinists and Aerospace Workers (IAM) District 70, Local Lodge 774 called a strike against Textron Aviation. On October 20, 2024, an agreement was reached on a new five-year labor contract. As a result, our revenues and profit were unfavorably impacted in the second half of 2024 due to delayed aircraft deliveries and manufacturing inefficiencies associated with the labor disruption and the recovery of operating activities. At the Industrial segment, we experienced lower revenues and profit in 2024, largely resulting from a decline in demand in our end markets for Textron Specialized Vehicles products. We are in the process of conducting a strategic review of our powersports product line, as discussed in Note 15 to the Consolidated Financial Statements on page \n62\n.\nAt our Bell segment, the ramp up of the FLRAA program contributed to a 14% growth in its revenues for the year. In August, the U.S. Army announced approval of Milestone B for the FLRAA program, establishing it as a program of record and transitioning it to the Engineering and Manufacturing Development phase. In the second half of the year, Bell was awarded contracts totaling approximately $3.0 billion for this phase of the program that contributed to a total company backlog increase of $4.0 billion, 29%, to $17.9 billion at the end of 2024. This backlog increase included growth of $676 million at the Textron Aviation segment, reflecting steady customer demand supported by new products, and $644 million at the Textron Systems segment, which included new contract awards for the Ship-to-Shore Connector program. \n Financial highlights for 2024 also include:\n•\nGenerated $1.0 billion of net cash from operating activities from our manufacturing businesses.\n•\nInvested $491 million in research and development projects and $364 million in capital expenditures. \n•\nReturned $1.1 billion to our shareholders through the repurchase of 12.9 million shares of our common stock. \nFor an overview of our business segments, including a discussion of our major products and services, refer to Item 1. Business. A discussion of our financial condition and operating results for 2024 compared with 2023 is provided below, while a discussion of 2023 compared with 2022 can be found in Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations of our Annual Report on Form 10-K for the year ended December 30, 2023. \nIn November 2023, the Financial Accounting Standards Board issued Accounting Standard Update (ASU) No. 2023-07, \nSegment Reporting (Topic 280): Improvements to Reportable Segment Disclosures\n, which requires a public entity to disclose, on an annual and interim basis, significant segment expenses and other segment items that are regularly provided to the Chief Operating Decision Maker. The new standard is effective for fiscal years beginning after December 15, 2023. We adopted ASU 2023-07 in the fourth quarter of 2024 and have recast management’s discussion and analysis of the results of operations of our company to include a discussion of the additional expense categories. In connection with the adoption of this standard, research and development costs previously included within Cost of products sold are now reported on a separate line in our Consolidated Statements of Operations. Prior period amounts have been recast to conform to the new presentation.\nThe following discussion should be read in conjunction with our Consolidated Financial Statements and related Notes included in Item 8. Financial Statements and Supplementary Data.\nConsolidated Results of Operations\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues\n$\n13,702\n$\n13,683\n$\n12,869\n—%\n6%\nCost of sales\n11,200\n10,835\n10,199\n3%\n6%\nGross margin as a percentage of Manufacturing revenues\n18.0%\n20.5%\n20.4%\nResearch and development costs\n491\n570\n601\n(14)%\n(5)%\nSelling and administrative expense\n1,156\n1,225\n1,186\n(6)%\n3%\nInterest expense, net\n97\n77\n107\n26%\n(28)%\nSpecial charges\n78\n126\n—\n(38)%\n100%\nNon-service components of pension and postretirement income, net\n263\n237\n240\n11%\n(1)%\n20\nTable of Contents\nRevenues\nRevenues increased $19 million in 2024, compared with 2023, largely due to the following factors:\n•\nHigher Bell revenues of $432 million, largely reflecting higher military aircraft and support revenues of $347 million, primarily due to higher volume on the FLRAA program, partially offset by lower volume on the V-22 program.\n•\nLower Industrial revenues of $326 million, due to lower revenues of $263 million at Textron Specialized Vehicles, principally in the powersports and personal transportation vehicles product lines due to reduced demand in their end markets, and lower revenues of $63 million at Kautex.\n•\nLower Textron Aviation revenues of $89 million, reflecting lower volume and mix of $270 million, principally a result of the strike discussed in the Segment Analysis section below, partially offset by higher pricing of $181 million in both the aircraft and aftermarket parts and services product lines.   \nCost of Sales  \nCost of sales includes cost of products and services sold for the Manufacturing group. In 2024, cost of sales increased $365 million, 3%, compared with 2023. The increase in cost was largely due to a $299 million impact from inflation and higher LIFO inventory provision and a $38 million inventory valuation charge to write down inventory to its net realizable value at Textron Specialized Vehicles as discussed in Note 15 to the Consolidated Financial Statements on page \n62\n.\nConsolidated gross margin as a percentage of Manufacturing revenues decreased 250 basis points in 2024, compared with 2023, primarily due to lower gross margin at the Bell segment, largely due to the mix of contracts discussed above, and at the Textron Aviation segment, reflecting the mix of aircraft sold and manufacturing inefficiencies, largely due to the strike. In addition, higher LIFO inventory provision and the inventory valuation charge noted above accounted for 80 basis points of the decrease. \nResearch and Development Costs\nResearch and development costs decreased $79 million, 14%, in 2024, compared with 2023, largely reflecting the winddown of the Future Attack Reconnaissance Aircraft Program at the Bell segment, partially offset by a $17 million increase at the Textron eAviation segment, largely due to development efforts on hybrid and electric propulsion aircraft. \nSelling and Administrative Expense\nSelling and administrative expense decreased $69 million, 6%, in 2024, compared with 2023, primarily reflecting lower compensation expense, which included lower shared-based and incentive compensation and savings from restructuring activities.\nInterest Expense, Net\nInterest expense, net includes interest expense for both the Finance and Manufacturing borrowing groups, with interest on intercompany borrowings eliminated, and interest income earned on cash and equivalents for the Manufacturing borrowing group. In 2024, interest expense, net increased $20 million, 26%, compared with 2023, primarily due to an increase in the weighted-average interest rate of our debt and $7 million in lower interest income. For 2024, 2023 and 2022, gross interest expense totaled $146 million, $133 million and $129 million, respectively. \nSpecial Charges\nSpecial charges of $78 million and $126 million in 2024 and 2023, respectively, include restructuring activities and asset impairment charges as described in Note 15 to the Consolidated Financial Statements on page \n62\n.\nNon-service Components of Pension and Postretirement Income, Net\nNon-service components of pension and postretirement income, net increased by $26 million, 11%, in 2024, compared with 2023. The increase is based on our annual valuation at the end of 2023 and is primarily driven by the impact of actual pension asset returns that exceeded our expected return on plan assets.\nIncome Taxes\n2024\n2023\n2022\nEffective tax rate\n12.5%\n15.2%\n15.2%\nIn 2024, the effective tax rate of 12.5% was lower than the U.S. federal statutory tax rate of 21%, largely due to the favorable impact of research and development credits and the effective settlement of certain tax positions in the fourth quarter of 2024, which is discussed in Note 16 to the Consolidated Financial Statements on page \n63\n. In 2023, the effective tax rate of 15.2% was lower than the U.S. federal statutory tax rate of 21%, largely due to the favorable impact of research and development credits and tax deductions for foreign-derived intangible income.  \nFor a full reconciliation of our effective tax rate to the U.S. federal statutory tax rate, see Note 16 to the Consolidated Financial Statements on page \n63\n.\n21\nTable of Contents\nSegment Analysis\nWe operate in, and report financial information for, the following six operating segments: Textron Aviation, Bell, Textron Systems, Industrial, Textron eAviation and Finance. Segment profit is an important measure used for evaluating performance and for decision-making purposes. Segment profit for the manufacturing segments excludes the non-service components of pension and postretirement income, net; LIFO inventory provision; intangible asset amortization; interest expense, net for Manufacturing group; certain corporate expenses; gains/losses on major business dispositions; special charges and the inventory valuation charge to write down production-related powersports inventory. The operating costs used to derive segment profit for our manufacturing segments includes cost of sales, research and development costs and selling and administrative expense. The cost of sales discussed in this Segment Analysis section excludes the LIFO inventory provision, intangible asset amortization and the inventory valuation charge discussed above that are reported within Cost of products sold or Cost of services sold on the Consolidated Statement of Operations. The measurement for the Finance segment includes interest income and expense along with intercompany interest income and expense. \nIn our discussion of comparative results for the Manufacturing group, material changes in revenues and segment profit for our commercial businesses typically are expressed in terms of product line revenues, including volume and mix and pricing; foreign exchange; acquisitions and dispositions; inflation; manufacturing efficiency; and changes in research and development costs and selling and administrative expense. For revenues, volume and mix represents changes in revenues from increases or decreases in the number of units delivered or services provided and the composition of products and/or services sold. For segment profit, volume and mix represents a change due to the number of units delivered or services provided and the composition of products and/or services sold at different profit margins. Pricing represents changes in unit pricing. Foreign exchange is the change resulting from translating foreign-denominated amounts into U.S. dollars at exchange rates that are different from the prior period. Revenues generated by acquired businesses are reflected in Acquisitions for a twelve-month period, while reductions in revenues and segment profit from the sale of businesses are reflected as Dispositions. Inflation represents higher material, wages, benefits, pension service cost or other costs. Manufacturing efficiency includes changes in material, labor and overhead variances to standards, typically due to scrap rates, labor efficiency or inefficiencies, facility usage and other manufacturing productivity inputs.\nApproximately 25% of our 2024 revenues were derived from contracts with the U.S. Government, including those under the U.S. Government-sponsored foreign military sales program. For our segments that contract with the U.S. Government, material changes in revenues related to these contracts are expressed in terms of volume. Changes in segment profit for these contracts are typically expressed in terms of volume and mix and contract performance, which includes cumulative catch-up adjustments associated with a) revisions to the transaction price that may reflect contract modifications or changes in assumptions related to award fees and other variable consideration or b) changes in the total estimated costs at completion due to improved or deteriorated operating performance.\nTextron Aviation\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues:\nAircraft\n$\n3,374\n$\n3,577\n$\n3,387\n(6)%\n6%\nAftermarket parts and services\n1,910\n1,796\n1,686\n6%\n7%\nTotal revenues\n5,284\n5,373\n5,073\n(2)%\n6%\nCost of sales\n4,102\n4,116\n3,905\n—%\n5%\nResearch and development costs\n208\n199\n191\n5%\n4%\nSelling and administrative expense\n408\n409\n417\n—%\n(2)%\nSegment profit\n$\n566\n$\n649\n$\n560\n(13)%\n16%\nProfit margin\n10.7%\n12.1%\n11.0%\nBacklog\n$\n7,845\n$\n7,169\n$\n6,387\n9%\n12%\nTextron Aviation’s revenues decreased $89 million, 2%, in 2024, compared with 2023, reflecting lower volume and mix of $270 million, which was principally a result of the strike discussed below, partially offset by higher pricing of $181 million. Aircraft revenues decreased $203 million, 6%, due to lower volume and mix, largely from Citation jet and commercial turboprop deliveries, partially offset by higher pricing. We delivered 151 Citation jets and 127 commercial turboprops in 2024, compared with 168 Citation jets and 153 commercial turboprops in 2023.  Aftermarket parts and services revenues increased $114 million, 6%, due to higher pricing and volume.\n22\nTable of Contents\nOn September 21, 2024, the IAM District 70, Local Lodge 774 called a strike against Textron Aviation. The strike impacted approximately 5,000 of Textron Aviation’s employees at the manufacturing, parts and distribution and service center facilities in Wichita. On October 20, 2024, Textron Aviation and the IAM reached an agreement on a new five-year labor contract. The strike had a significant adverse impact on Textron Aviation’s ability to meet its production and delivery schedules in the third quarter and continuing into the fourth quarter of 2024. As a result, our revenues and profit were unfavorably impacted in the second half of 2024 by delayed aircraft deliveries and manufacturing inefficiencies associated with the labor disruption and the recovery of operating activities.\nTextron Aviation’s cost of sales decreased $14 million in 2024, compared with 2023. The impact of lower volume and mix on our cost of sales was offset by $127 million of inflation and $43 million in manufacturing inefficiencies, largely reflecting idle facilities costs resulting from the strike discussed above. \nTextron Aviation’s segment profit decreased $83 million, 13%, in 2024, compared with 2023, primarily due to lower volume and mix and the manufacturing inefficiencies discussed above, partially offset by higher pricing, net of inflation. \nTextron Aviation’s backlog increased $676 million, 9%, in 2024, reflecting orders in excess of deliveries. \nBell\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues:\nMilitary aircraft and support programs\n$\n2,048\n$\n1,701\n$\n1,740\n20%\n(2)%\nCommercial helicopters, parts and services\n1,531\n1,446\n1,351\n6%\n7%\nTotal revenues\n3,579\n3,147\n3,091\n14%\n2%\nCost of sales\n2,899\n2,392\n2,316\n21%\n3%\nResearch and development costs\n97\n192\n266\n(49)%\n(28)%\nSelling and administrative expense\n213\n243\n227\n(12)%\n7%\nSegment profit\n$\n370\n$\n320\n$\n282\n16%\n13%\nProfit margin\n10.3%\n10.2%\n9.1%\nBacklog\n$\n7,469\n$\n4,780\n$\n4,781\n56%\n—%\nBell’s military aircraft and support programs include a development contract for the U.S. Army's FLRAA program, as well as production, upgrade, and support contracts for the V-22 tiltrotor aircraft and H-1 helicopters. The FLRAA program represents an increasing portion of Bell’s revenues as development activities have ramped. In August 2024, the U.S. Army announced approval of Milestone B for the FLRAA program, establishing it as a program of record and transitioning it to the Engineering and Manufacturing Development phase. In the second half of 2024, Bell was awarded contracts totaling approximately $3.0 billion for this phase of the program. \nBell’s military and support programs revenues increased $347 million, 20%, in 2024, compared with 2023, primarily due to higher volume on the FLRAA program, partially offset by lower volume on the V-22 program. Commercial helicopters, parts and services increased $85 million, 6%. We delivered 172 commercial helicopters in 2024, compared with 171 commercial helicopters in 2023.\nBell's cost of sales increased $507 million, 21%, in 2024, compared with 2023, primarily due to the higher volume and mix discussed above. \nBell's research and development costs decreased $95 million, 49%, in 2024, compared with 2023, largely due to the winddown of the Future Attack Reconnaissance Aircraft Program. \nSelling and administrative expense decreased at Bell by $30 million, 12%, in 2024, compared with 2023, primarily due to a gain on a legal settlement recorded in the first quarter of 2024 and lower bid and proposal costs.\nBell’s segment profit increased $50 million, 16%, in 2024, compared with 2023, primarily due to lower research and development costs, as described above, partially offset by an unfavorable impact from mix as volume increased on lower margin FLRAA development activities while volume decreased on higher margin V-22 program revenues. \nBacklog increased $2.7 billion, 56%, at Bell due to orders in excess of revenues recognized and deliveries, largely related to the FLRAA program discussed above. \n23\nTable of Contents\nTextron Systems\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues\n$\n1,241\n$\n1,235\n$\n1,172\n—%\n5%\nCost of sales\n929\n925\n878\n—%\n5%\nResearch and development costs\n51\n53\n53\n(4)%\n—%\nSelling and administrative expense\n107\n110\n109\n(3)%\n1%\nSegment profit\n$\n154\n$\n147\n$\n132\n5%\n11%\nProfit margin\n12.4%\n11.9%\n11.3%\nBacklog\n$\n2,594\n$\n1,950\n$\n2,098\n33%\n(7)%\nTextron Systems revenues and segment profit increased $6 million and $7 million, respectively, in 2024, compared with 2023. The impact on volume related to the cancellation of the Shadow program in the first quarter of 2024 was largely offset by higher volume on the Ship-to-Shore Connector program. \nTextron Systems’ backlog increased $644 million, 33%, in 2024, compared with 2023, reflecting orders in excess of revenues recognized and deliveries, which included new contract awards for the Ship-to-Shore Connector program.\nIndustrial\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues:\nKautex\n$\n1,891\n$\n1,954\n$\n1,771\n(3)%\n10%\nTextron Specialized Vehicles\n1,624\n1,887\n1,694\n(14)%\n11%\nTotal revenues\n3,515\n3,841\n3,465\n(8)%\n11%\nCost of sales\n2,993\n3,221\n2,959\n(7)%\n9%\nResearch and development costs\n72\n80\n71\n(10)%\n13%\nSelling and administrative expense\n299\n312\n280\n(4)%\n11%\nSegment profit\n$\n151\n$\n228\n$\n155\n(34)%\n47%\nProfit margin\n4.3%\n5.9%\n4.5%\nIndustrial segment revenues decreased $326 million, 8%, in 2024, compared with 2023, largely due to lower volume and mix. Textron Specialized Vehicles' revenues decreased $263 million, 14%, reflecting lower volume, principally in the powersports and personal transportation vehicles products due to reduced demand in their end markets. Kautex revenues decreased $63 million, 3%, largely due to lower volume.\nIndustrial's cost of sales decreased $228 million, 7%, in 2024 compared with 2023, primarily reflecting the impact of lower volume and mix. \nSegment profit for the Industrial segment decreased $77 million, 34%, in 2024, compared with 2023, largely due to a $105 million impact from lower volume and mix, partially offset by $22 million in manufacturing efficiencies and $21 million in lower selling and administrative expense and research and development costs, largely due to cost reduction activities.\nTextron eAviation\n% Change\n(Dollars in millions)\n2024\n2023\n2022\n2024\n2023\nRevenues\n$\n33 \n$\n32 \n$\n16 \n3%\n100%\nCost of sales\n29 \n35 \n18 \n(17)%\n94%\nResearch and development costs\n63 \n46 \n20 \n37%\n130%\nSelling and administrative expense\n17 \n14 \n2 \n21%\n600%\nSegment loss\n$\n(76)\n$\n(63)\n$\n(24)\n21%\n163%\nTextron eAviation segment revenues increased $1 million, 3%, in 2024, compared with 2023. Research and development costs increased $17 million, 37%, largely due to the ramp up of development efforts on hybrid and electric propulsion aircraft. Segment loss increased $13 million in 2024, compared with 2023, primarily reflecting the higher research and development costs.     \n24\nTable of Contents\nFinance\n(In millions)\n2024\n2023\n2022\nRevenues\n$\n50 \n$\n55 \n$\n52 \nSelling and administrative expense\n(4)\n(6)\n8 \nInterest expense, net\n19 \n15 \n13 \nSegment profit\n$\n35 \n$\n46 \n$\n31 \nFinance segment revenues decreased $5 million and segment profit decreased $11 million in 2024, compared with 2023. Selling and administrative expense included recoveries of $10 million and $18 million in 2024 and 2023, respectively. The decrease in segment profit was primarily due to $8 million in lower recoveries of credit losses.  \nLiquidity and Capital Resources\nOur financings are conducted through two separate borrowing groups.  The Manufacturing group consists of Textron consolidated with its majority-owned subsidiaries that operate in the Textron Aviation, Bell, Textron Systems, Industrial and Textron eAviation segments. The Finance group, which also is the Finance segment, consists of Textron Financial Corporation and its consolidated subsidiaries. We designed this framework to enhance our borrowing power by separating the Finance group. Our Manufacturing group operations include the development, production and delivery of tangible products and services, while our Finance group provides financial services. Due to the fundamental differences between each borrowing group’s activities, investors, rating agencies and analysts use different measures to evaluate each group’s performance. To support those evaluations, we present balance sheet and cash flow information for each borrowing group within the Consolidated Financial Statements.\nAssessment of Liquidity and Significant Future Cash Requirements\nKey information that is utilized in assessing our liquidity is summarized below:\n(Dollars in millions)\nDecember 28,\n2024\nDecember 30,\n2023\nManufacturing group\nCash and equivalents\n$\n1,386\n$\n2,121\nDebt\n3,247\n3,526\nShareholders’ equity\n7,204\n6,987\nCapital (debt plus shareholders’ equity)\n10,451\n10,513\nNet debt (net of cash and equivalents) to capital\n21%\n17%\nDebt to capital\n31%\n34%\nFinance group\nCash and equivalents\n$\n55\n$\n60\nDebt\n341\n348\nWe believe that our calculations of debt to capital and net debt to capital are useful measures as they provide a summary indication of the level of debt financing (i.e., leverage) that is in place to support our capital structure, as well as to provide an indication of our capacity to add further leverage.   \nWe expect to have sufficient cash to meet our needs based on our existing cash balances, the cash we expect to generate from our manufacturing operations and the availability of our existing credit facility. In addition to our manufacturing operating cash requirements, future material cash outlays include our contractual combined debt and interest payments for the Manufacturing group of $473 million in 2025, $457 million in 2026, $444 million in 2027 and $2.5 billion thereafter, and for the Finance group of $46 million in 2025, $20 million in 2026, $69 million in 2027 and $507 million thereafter. \nFor the Manufacturing group, we also have purchase obligations that require material future cash outlays totaling $2.7 billion in 2025, $501 million in 2026 and $355 million thereafter. Purchase obligations include undiscounted amounts committed under contracts or purchase orders for goods and services with defined terms as to price, quantity and delivery dates, as well as property, plant and equipment. Approximately 28% of our purchase obligations represent purchase orders issued for goods and services to be delivered under firm contracts with the U.S. Government for which we have full recourse under customary contract termination clauses. \n25\nTable of Contents\nCredit Facilities and Other Sources of Capital\nTextron has a senior unsecured revolving credit facility for an aggregate principal amount of $1.0 billion, of which $100 million is available for the issuance of letters of credit. We may elect to increase the aggregate amount of commitments under the facility to up to $1.3 billion by designating an additional lender or by an existing lender agreeing to increase its commitment. The facility expires in October 2027 and provides for two one-year extensions at our option with the consent of lenders representing a majority of the commitments under the facility. At December 28, 2024 and December 30, 2023, there were no amounts borrowed against the facility and there were $9 million of outstanding letters of credit issued under the facility.\nWe also maintain an effective shelf registration statement filed with the Securities and Exchange Commission that allows us to issue an unlimited amount of public debt and other securities. On March 1, 2024, we repaid our $350 million 4.30% Notes due March 2024.\nManufacturing Group Cash Flows\nCash flows from continuing operations for the Manufacturing group as presented in our Consolidated Statements of Cash Flows are summarized below:\n(In millions)\n2024\n2023\n2022\nOperating activities\n$\n1,008 \n$\n1,270 \n$\n1,461 \nInvesting activities\n(288)\n(345)\n(511)\nFinancing activities\n(1,438)\n(776)\n(875)\nCash flows from operating activities were $1.0 billion in 2024, compared with $1.3 billion in 2023. The $262 million decrease in cash flows was largely due to changes in working capital and lower earnings, partially offset by $157 million in lower net tax payments. Net income tax payments were $181 million and $338 million in 2024 and 2023, respectively. Pension contributions were $44 million and $45 million in 2024 and 2023, respectively. \nIn 2024 and 2023, investing cash flows included capital expenditures of $364 million and $402 million, respectively, partially offset by net proceeds from corporate-owned life insurance policies of $85 million and $40 million, respectively. \nCash flows used by financing activities in 2024 included $1.1 billion of cash paid to repurchase an aggregate of 12.9 million shares of our common stock under the 2023 share repurchase plan described below and payments on long-term debt of $361 million. In 2023, cash flows used by financing activities included $1.2 billion of cash paid to repurchase an aggregate of 16.2 million shares of our common stock, partially offset by $348 million of net proceeds from the issuance of long-term debt.  \nIn July 2023, Textron's Board of Directors approved a program for the repurchase of up to 35 million shares of our common stock. This share repurchase program allows us to continue our practice of repurchasing shares to offset the impact of dilution from stock-based compensation and benefit plans and for opportunistic capital management purposes. The repurchase program has no expiration date and there were 15.6 million shares remaining under the program at December 28, 2024. \nDividend payments to shareholders totaled $12 million and $16 million in 2024 and 2023, respectively. Due to the timing of our fiscal year-end, we made three dividend payments in 2024, compared with four dividend payments in 2023.\nFinance Group Cash Flows\nThe cash flows from continuing operations for the Finance group as presented in our Consolidated Statements of Cash Flows are summarized below:\n(In millions)\n2024\n2023\n2022\nOperating activities\n$\n8 \n$\n14 \n$\n(7)\nInvesting activities\n3 \n11 \n100 \nFinancing activities\n(16)\n(37)\n(216)\nThe Finance group’s cash flows from investing activities primarily included collections on finance receivables totaling $133 million and $169 million in 2024 and 2023, respectively, partially offset by finance receivable originations of $130 million and $160 million, respectively. Cash flows used in financing activities included payments on long-term and nonrecourse debt of $16 million and $37 million in 2024 and 2023, respectively.  \n26\nTable of Contents\nConsolidated Cash Flows\nThe consolidated cash flows from continuing operations, after elimination of activity between the borrowing groups, are summarized below:\n(In millions)\n2024\n2023\n2022\nOperating activities\n$\n1,015 \n$\n1,267 \n$\n1,490 \nInvesting activities\n(284)\n(317)\n(447)\nFinancing activities\n(1,454)\n(813)\n(1,091)\nConsolidated cash flows from operating activities were $1.0 billion in 2024, compared with $1.3 billion in 2023. The decrease of $252 million in cash flows was largely due to changes in working capital and lower earnings, partially offset by $161 million in lower net tax payments. Net income tax payments were $191 million and $352 million in 2024 and 2023, respectively. Pension contributions were $44 million and $45 million in 2024 and 2023, respectively. \nIn 2024 and 2023, investing cash flows included capital expenditures of $364 million and $402 million, respectively, partially offset by net proceeds from corporate-owned life insurance policies of $85 million and $40 million, respectively. \nCash flows used by financing activities in 2024 included $1.1 billion of share repurchases and payments on long-term debt of $377 million. In 2023, cash flows used by financing activities included $1.2 billion of share repurchases, partially offset by $348 million of net proceeds from the issuance of long-term debt.   \nCaptive Financing and Other Intercompany Transactions\nThe Finance group provides financing primarily to purchasers of new and pre-owned Textron Aviation aircraft and Bell helicopters manufactured by our Manufacturing group, otherwise known as captive financing. In the Consolidated Statements of Cash Flows, cash received from customers is reflected as operating activities when received from third parties. However, in the cash flow information provided for the separate borrowing groups, cash flows related to captive financing activities are reflected based on the operations of each group. For example, when product is sold by our Manufacturing group to a customer and is financed by the Finance group, the origination of the finance receivable is recorded within investing activities as a cash outflow in the Finance group’s statement of cash flows. Meanwhile, in the Manufacturing group’s statement of cash flows, the cash received from the Finance group on the customer’s behalf is recorded within operating cash flows as a cash inflow. Although cash is transferred between the two borrowing groups, there is no cash transaction reported in the consolidated cash flows at the time of the original financing. These captive financing activities, along with all significant intercompany transactions, are reclassified or eliminated from the Consolidated Statements of Cash Flows.\nReclassification adjustments included in the Consolidated Statements of Cash Flows on page \n36\n are summarized below:\n(In millions)\n2024\n2023\n2022\nReclassification adjustments from investing activities to operating activities:\nFinance receivable originations for Manufacturing group inventory sales\n$\n(109)\n$\n(160)\n$\n(92)\nCash received from customers\n108 \n143 \n127 \nOther\n— \n— \n1 \nTotal reclassification adjustments from investing activities to operating activities\n$\n(1)\n$\n(17)\n$\n36 \nUnder a Support Agreement between Textron and TFC, Textron is required to maintain a controlling interest in TFC. The agreement, as amended in December 2015, also requires Textron to ensure that TFC maintains fixed charge coverage of no less than 125% and consolidated shareholders' equity of no less than $125 million. There were no cash contributions required to be paid to TFC in 2024 and 2023 to maintain compliance with the support agreement.\nCritical Accounting Estimates\nTo prepare our Consolidated Financial Statements to be in conformity with generally accepted accounting principles, we must make complex and subjective judgments in the selection and application of accounting policies. The accounting policies that we believe are most critical to the portrayal of our financial condition and results of operations are listed below. We believe these policies require our most difficult, subjective and complex judgments in estimating the effect of inherent uncertainties. This section should be read in conjunction with Note 1 to the Consolidated Financial Statements on page \n38\n, which includes other significant accounting policies.\n27\nTable of Contents\nRevenue Recognition\nA substantial portion of our revenues is related to long-term contracts with the U.S. Government, including those under the U.S. Government-sponsored foreign military sales program, for the design, development, manufacture or modification of aerospace and defense products as well as related services. We generally use the cost-to-cost method to measure progress for these contracts because it best depicts the transfer of control to the customer that occurs as we incur costs on our contracts.  Under this measure, the extent of progress towards completion is measured based on the ratio of costs incurred to date to the estimated costs at completion of the performance obligation, and revenue is recorded proportionally as costs are incurred.\nDue to the number of years it may take to complete these contracts and the scope and nature of the work required to be performed on the contracts, the estimation of total transaction price and costs at completion is complicated and subject to many variables and, accordingly, is subject to change. In estimating total costs at completion, we are required to make numerous assumptions related to the complexity of design and related development work to be performed; engineering requirements; product performance; subcontractor performance; availability and cost of materials; labor productivity, availability and cost; overhead and capital costs; manufacturing efficiencies; the length of time to complete the contract (to estimate increases in wages and prices for materials); and costs of satisfying offset obligations, among other variables. Our cost estimation process is based on the professional knowledge and experience of engineers and program managers along with finance professionals. We review and update our cost projections quarterly or more frequently when circumstances significantly change. When our estimate of the total costs to be incurred on a contract exceeds the estimated total transaction price, a provision for the entire loss is recorded in the period in which the loss is determined.\nAt the outset of each contract, we estimate an initial profit booking rate considering the risks surrounding our ability to achieve the technical requirements (e.g., a newly developed product versus a mature product), schedule (e.g., the number and type of milestone events), and costs by contract requirements in the initial estimated costs at completion. Profit booking rates may increase during the performance of the contract if we successfully retire risks surrounding the technical, schedule and cost aspects of the contract. Conversely, the profit booking rate may decrease if we are not successful in retiring the risks; and, as a result, our estimated costs at completion increase. All estimates are subject to change during the performance of the contract and, therefore, may affect the profit booking rate.\nChanges in our estimate of the total expected cost or in the transaction price for a contract typically impact our profit booking rate. We utilize the cumulative catch-up method of accounting to recognize the impact of these changes on our profit booking rate for a contract. Under this method, the inception-to-date impact of a profit adjustment on a contract is recognized in the period the adjustment is identified. The impact of our cumulative catch-up adjustments on segment profit recognized in prior periods is presented below:\n(In millions)\n2024\n2023\n2022\nGross favorable\n$\n122 \n$\n106 \n$\n101 \nGross unfavorable\n(91)\n(62)\n(117)\nNet adjustments\n$\n31 \n$\n44 \n$\n(16)\nDue to the significance of judgment in the estimation process described above, it is likely that materially different revenues and/or cost of sales amounts could be recorded if we used different assumptions or if the underlying circumstances were to change. Our earnings could be reduced by a material amount resulting in a charge to earnings if (a) total estimated contract costs are significantly higher than expected due to changes in customer specifications prior to contract amendment, (b) total estimated contract costs are significantly higher than previously estimated due to cost overruns or inflation, (c) there is a change in engineering efforts required during the development stage of the contract or (d) we are unable to meet contract milestones.\nGoodwill\nWe evaluate the recoverability of goodwill annually in the fourth quarter or more frequently if events or changes in circumstances indicate a potential impairment of a reporting unit. We calculate the fair value of each reporting unit using discounted cash flows. These cash flows incorporate assumptions for revenue growth rates and operating margins that are based on our strategic plans and long-range planning forecasts, which include our best estimates of current and forecasted market conditions, cost structure and anticipated net cost reductions. The long-term revenue growth rate we use to determine the terminal value of the business is based on our assessment of its minimum expected terminal growth rate, as well as its past historical growth and broader economic considerations such as gross domestic product, inflation and the maturity of the markets we serve. The discount rates utilized in this analysis are based on each reporting unit’s weighted average cost of capital, which takes into account the relative weights of each component of capital structure (equity and debt) and represents the expected cost of new capital, adjusted as appropriate to consider the risk inherent in future cash flows of the respective reporting unit. We believe this approach yields a discount rate that is consistent with an implied rate of return that an independent investor or market participant would require for an investment in a company having similar risks and business characteristics to the reporting unit being assessed.\n28\nTable of Contents\nBased on our annual impairment review, the fair value calculated using the estimates discussed above exceeded the carrying value by an adequate amount for each reporting group. Accordingly, we do not believe that there is a reasonable possibility that any units might fail the impairment test in the foreseeable future.\nRetirement Benefits\nWe sponsor funded and unfunded domestic and international pension plans for certain of our employees. Beginning on January 1, 2010, we initiated actions to commence the closure of the pension plans to new entrants. We provide employees hired subsequent to these closures with defined contribution benefits. Our pension benefit obligations are calculated based on actuarial valuations. Key assumptions used in determining these obligations and related expenses or benefits include the expected long-term rates of return on plan assets and discount rates. We also make assumptions regarding employee demographic factors such as retirement patterns, mortality, turnover and rate of compensation increases.  We evaluate and update these assumptions annually.\nTo determine the weighted-average expected long-term rate of return on plan assets, we consider the current and expected asset allocation, as well as historical and expected returns on each plan asset class.  A lower expected rate of return on plan assets will decrease pension income.  For 2024 and 2023, the assumed expected long-term rate of return on plan assets used in calculating pension income was 7.16% and 7.14%, respectively. For 2024, the assumed rate of return for our domestic plans, which represent approximately 90% of our total pension assets, was 7.25%. Net periodic benefit income is sensitive to changes in the expected long-term rate of return on plan assets. \nThe discount rate enables us to state expected future benefit payments as a present value on the measurement date, reflecting the current rate at which the pension liabilities could be effectively settled. This rate should be in line with rates for high-quality fixed income investments available for the period to maturity of the pension benefits, which fluctuate as long-term interest rates change.  A lower discount rate increases the present value of the benefit obligations and generally decreases pension income.  In 2024, the weighted-average discount rate used in calculating pension income was 5.19%, compared with 5.51% in 2023.  For our domestic plans, the assumed discount rate was 5.25% in 2024, compared with 5.55% in 2023. A change of 50 basis-points higher or lower, with all other assumptions held constant, in this weighted-average discount rate in 2024 would have changed our pension income for our domestic plans by approximately $10 million.\n29\nTable of Contents",
  "item2": null
}