{
  "source_file": "tyl-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS.\nDESCRIPTION OF BUSINESS\nTyler Technologies, Inc. (“Tyler” or “Company”) is a leading provider of integrated software and technology management solutions for the public sector. Our solutions empower local, state, and federal government entities to create smarter, safer, and stronger communities. We offer the broadest range of software solutions and services designed for every level of public sector government agency. Our solutions deliver mission-critical technology to support the essential functions of government, including public safety, justice, public health, taxation and budgeting, infrastructure and land use, outdoor recreation, utility and civic services, regulation, K-12 education, and social services. We provide both the back-office systems-of-record that serve the operational needs of specific government agencies, as well as platform technology solutions that are designed to integrate with our back-office solutions and be deployed and connected across many agencies. Examples of transformative platform technologies include our market-leading payments platform, data platform, low-code application development platform, and digital resident experience solutions.\nWe maintain deep, long-term relationships with state and local government agencies, including dedicated state-level offices in the 29 states in which we have enterprise contracts. Our professional information technology (“IT”) services include cloud-based software deployment, data conversion, and training. We also provide continuing client support services to ensure product performance and reliability, providing us with long-term client relationships and a significant base of recurring revenue.\nMARKET OVERVIEW\nThe federal, state, and local public sector market is one of the largest and most decentralized IT markets in the country, consisting of hundreds of federal agencies, all 50 states, approximately 3,000 counties, 36,000 cities and towns, and 12,600 school districts. This market is also comprised of approximately 40,000 special districts and other agencies, each with specialized delegated responsibilities and unique information management requirements. \nToday, government agencies play an essential role in all aspects of society, including providing protection and security, delivering public services, ensuring public health, effectively administrating public resources, developing and enforcing regulations, and maintaining engagement with the public. In an increasingly digital world, constituents expect more transparency, frictionless service, and better online experiences from public entities. As a result, government entities recognize the increasing value of information management systems and services to, among other things, improve transactional revenue collection, provide transparency and increased access to information, and streamline the delivery of services to their constituents. Government bodies recognize “digital government” is not just a modern convenience, but a requirement for good governance. From integrated public safety and justice information systems to systems that integrate tax, finance, infrastructure, and land use processes, many jurisdictions have benefited significantly from the implementation of jurisdiction-wide systems that allow different agencies or government offices to share data and provide a more comprehensive approach to information management.\nAgencies at all levels of government face challenges in attracting and retaining the staff necessary to support their IT operations. As a result, they seek to establish long-term relationships with reliable providers of high-quality IT products and services such as Tyler. \nAlthough governments often face budgetary constraints in their operations, their primary revenue sources are usually property, business, and sales tax revenue, as well as transactional fees and service charges, which historically tend to be relatively stable. Government agencies increasingly rely on digital payment solutions to streamline the collection and distribution of government funds. In addition, the acquisition of modern technology typically enables governments to operate more efficiently and securely and often provides a measurable return on investment that justifies the purchase of software and related services. \nTyler management believes we compete based on several key factors, including: \n•\nThe breadth, depth, and quality of our product and service offerings \n•\nDeep industry expertise with proven implementation success \n•\nTechnological innovation \n•\nName recognition, reputation, and references \n•\nValue and return-on-investment \n•\nFinancial strength and stability \n3\nPRODUCTS AND SERVICES\nWe provide a comprehensive and flexible suite of products and services that addresses the information technology needs of cities, counties, states, schools, federal agencies, and other government entities. \nWe design, develop, market, and support a broad range of software solutions to serve mission-critical “back-office” functions of the public sector. Many of our back-office software applications integrate with our transformative platform solutions, such as our unified payments platform, data and insights platform, and digital public engagement solutions that allow for real-time public access to a variety of information or that allow the public to transact business with governments online.  \nEach of our core software solutions consists of several fully integrated applications. In some of the product areas, such as financial management and education and property appraisal and tax, we offer multiple solutions designed to meet the needs of different sized governments. \nA description of our primary suites of products and services follows:\nPlatform & Transformative Technology Solutions \nOur platform and transformative technology solutions create the foundation for government innovation and enhance our clients’ ability to connect with constituents, conduct business, collect and disburse funds, safeguard systems, and leverage data to its fullest. Many of these solutions are integrated into our products, while others can be leveraged as add-on solutions. Our platform & transformative technology solutions include: \n•\nCybersecurity: Augments government agencies’ resources with access to advanced expertise for program design, 24/7 threat detection and response, customized employee training, vulnerability testing, and more. \n•\nData & Insights: Allows agencies to transform data into insights about financial, operational, and strategic outcomes by making it easier to surface meaningful data for informing government decisions and citizens. \n•\nDigital Solutions: Provides a seamless cross-department experience so that agencies can deliver a unified citizen experience and achieve better outcomes while helping workers and policymakers share, communicate, and leverage data more effectively.\n•\nPayments: The leading platform for public sector payments that processes nearly half a billion transactions annually and covers the entire payments life cycle, including billing, presentment, merchant onboarding, collections, reconciliation, and disbursements.\n•\nPlatform Technologies: A low-code application development platform purpose-built for the public sector. Enables government workers to quickly build solutions and applications that suit their needs.\n \n•\nOutdoor Recreation: Designed specifically for local, state, and federal outdoor agencies, our solutions encompass campsite reservations, activity registrations, licensing sales and renewals, and real-time data for conservation and park management. \nPublic Administration Solutions \nOur public administration solutions connect the dots between departments, agencies, municipalities, and states to deliver the core business functions of the public sector. By making it easier to manage the business side of the public sector, agencies can focus on delivering the resources and services required to make their community a place where people want to live. Our public administration solutions include: \n•\nCivic Services: Business management and community development solutions manage permitting, enforcement, health and safety inspections, compliance, maintenance and work orders, 311 requests, and more. \n•\nERP: Integrates core financial applications with human resources, revenue management, tax billing, utilities, asset management, and payment processing. \n•\nProperty & Recording: Manages all aspects of the property tax life cycle, including appraisal services, valuation, tax billing and collections, assessment administration, and land and official records.\n•\nRegulatory: Permitting, licensing and regulatory management help local, state, and federal government agencies and departments of any size simplify every aspect of regulatory compliance. \n4\nCourts & Public Safety Solutions\nOur integrated courts and public safety solutions are used at the municipal, county, state, and federal levels to help courts, prosecutors, defenders, jails, sheriff’s offices, police departments, and probation officers keep their communities safe. Our courts and public safety solutions include:\n•\nCorrections: Connects courts, public safety, and supervision agencies to ensure safer and more efficient operations for correctional facilities.\n•\nCourts & Justice: Provides case management and shares data with all justice partners by connecting courts, prosecutors, public defenders, and the filing community. \n•\nPublic Safety: Provides real-time information and instant data sharing across jurisdictions and promotes intelligence-led responses so that help arrives faster and more prepared while complying with state and federal reporting mandates.\nK-12 Education Solutions \nOur integrated school solutions enable districts to operate as a single system across campuses and functions. By bringing data together and making it accessible as needed to administrators, teachers, students, bus drivers, and parents, we are able to improve everyone’s ability to support the educational journey. Our K–12 Education solutions include: \n•\nSchool ERP: Manages K-12 schools’ most essential business functions by integrating financial, budgeting, and procurement data. Our suite of human resource management tools helps schools efficiently manage payroll and employee information and hire and retain qualified teachers, staff, and substitutes. \n•\nStudent Transportation: Manages every aspect of the student transportation operation with integrated software and telematic hardware solutions to help ensure operational efficiency and cost-effectiveness.\nHealth & Human Services Solutions\nOur integrated solutions enable health and human service agencies to leverage data and optimize operations to better maintain the well-being of communities. Our health & human services solutions include: \n•\nEnvironmental Health: Streamlines the process of issuing permits, performing health inspections, running reports, and investigating complaints.  \n•\nDisability & Benefits: Helps programs and agencies administer benefits and makes it easier to manage the complexity of services like medical cannabis regulation, veterans’ benefits, vocational rehabilitation, workers’ compensation, and more. \nRevenues\nWe derive our revenues from three primary sources:\n•\nSubscription-based services\n•\nMaintenance and support\n•\nProfessional services\nSubscription-Based Services\nSubscriptions revenue consists of revenues derived from our SaaS arrangements and transaction-based fees. We are able to provide the majority of our software products through our SaaS model. The clients who choose this model typically do not wish to maintain, update and operate these systems directly, or make up-front capital expenditures to implement these advanced technologies. The contract terms for these arrangements range from one to 10 years but are typically contracted for periods of generally one to three years. The majority of our SaaS or hosting arrangements include additional professional services as well as maintenance and support services. \nTransaction-based fees primarily relate to digital government services, online payment solutions (which are sometimes offered with the assistance of third-party vendors), and online dispute resolution solutions. Digital government services consist of websites and applications that allow consumers, such as businesses and citizens, to access government information, complete transactions and make electronic payments. Our online payments solution covers the entire payments life cycle, including billing, presentment, merchant onboarding, collections, reconciliation, and disbursements. We also provide electronic document filing solutions (“e-filing”) that simplify the filing and management of court related documents for courts and law offices.\n5\nMaintenance and Support\nSupport is provided to clients over the phone or via the Internet through help desks staffed by our client support representatives. For more complicated issues, our staff, with the clients’ permission, can log on to clients’ systems remotely. We maintain our clients’ software largely through releases that contain improvements and incremental additions of features and functionality, along with updates necessary because of legislative or regulatory changes.\nNearly all of our on-premises software clients contract with us for maintenance and support, which provides us with a significant source of recurring revenue. We generally provide maintenance and support for our on-premises clients under annual, or in some cases multi-year, contracts, with a typical fee based on a percentage of the software product’s license fee. These fees can generally be increased on renewal and may also increase as new license fees increase. Maintenance and support fees are generally paid annually in advance. Most maintenance contracts automatically renew unless the client or Tyler gives notice of termination prior to expiration. Similar maintenance and support services are provided to our SaaS clients and are included in their subscription fees, which are classified as subscription-based revenue.\nProfessional Services\nWe provide a variety of professional services to clients who utilize our software products. Our clients contract with us for installation, training, and data conversion services in connection with their implementation of Tyler’s software solutions, whether through a SaaS arrangement or on-premise software license. The complete implementation process for a typical system includes planning, design, data conversion, set-up and testing. At the culmination of the implementation process, an implementation team is generally onsite at the client’s facility or available via remote video conferencing to help ensure the smooth go-live with the new system. Implementation fees are charged separately to clients on either a fixed-fee or hourly charge basis, depending on the contract.\nBoth in connection with the installation of new systems and on an ongoing basis, we provide extensive training services and programs related to our products and services. Training can be provided in our training centers, onsite at clients’ locations, at meetings and conferences, or remotely, and can be customized to meet clients’ requirements. The vast majority of our clients contract with us for training services, both to improve their employees’ proficiency and productivity and to fully utilize the functionality of our systems. Training services are generally billed on an hourly or daily basis, along with travel and other expenses.\nOur other sources of revenue include software licenses and royalties and computer hardware equipment, which represent 3% and 4% of total revenues for the twelve months ended December 31, 2024 and 2023, respectively.\nSTRATEGY\nOur objective is to grow our revenues and earnings organically, supplemented by focused strategic acquisitions. The key components of our business strategy are to:\n•\nProvide high quality, value–added products and services to our clients\n. We compete on the basis of, among other things, delivering to clients our deep domain expertise in government operations through the high value products and services in the market. We believe we have achieved a reputation as a premium product and service provider to the public sector market.\n•\nContinue to expand our product and service offerings\n. While we already have what we believe to be the broadest line of software products for the public sector, we continually strive to upgrade our core software applications and expand our complementary product and service offerings to respond to technological advancements and the changing needs of our clients. We regularly add new products and services to our portfolio through internal product development as well as acquisitions. We believe that the addition of new features and applications enhances the market appeal of our core products. We have also broadened our offerings of consulting and business process reengineering services.\n•\nAccelerate our move to the cloud\n. We have offered most of our core products in both an on-premises license model and a cloud-based subscription model for several years and have seen a steady increase in the percentage of new software clients choosing our cloud model in recent years. Beginning in late 2019, we moved our approach to sales from “cloud-neutral” to “cloud-first,” with an increasing preference to provide our solutions in the cloud. We are making significant investments in optimizing our products to be deployed efficiently in the public cloud. Over a multi-year period we have been transitioning from hosting clients in Tyler’s proprietary data centers to utilizing Amazon Web Services (“AWS”) for cloud hosting. \n6\n•\nExpand our client base\n. We seek to establish long-term relationships with new clients primarily through our sales and marketing efforts. While we currently have clients in all 50 states, Canada, the Caribbean, the United Kingdom, Australia, and other international locations, some of our solutions have not fully achieved nationwide geographic penetration. We intend to continue to expand into new geographic markets by adding sales staff and targeting marketing efforts by solutions in those areas. We also intend to continue to expand our client base to include larger jurisdictions. While our traditional market focus has primarily been on small and mid-sized governments, our increased size and market presence, together with the technological advances and improved scalability of certain of our solutions, are allowing us to achieve increasing success in selling to larger clients. We also expect to expand our presence in international markets by leveraging our leadership position in the United States through the disciplined pursuit of selected opportunities in other countries.\n•\nExpand our existing client relationships\n. Our existing client base offers significant opportunities for additional sales of solutions and services that we currently offer, but that existing clients do not fully utilize. Add-on sales to existing clients typically involve lower sales and marketing expense than sales to new clients. In particular, since the acquisition of NIC Inc. (“NIC”) in April 2021, we have been successfully selling Tyler software products into NIC’s client base and in turn providing NIC’s payment services to Tyler’s client base. We expect those opportunities to continue to expand.\n•\nGrow recurring revenues\n. We have a large recurring revenue base from subscription-based services and maintenance and support, which generated revenues of $1.8 billion, or 84% of total revenues, in 2024. We have historically experienced very low client turnover (approximately 2% annually), and recurring revenues continue to grow as the installed client base increases. Subscription-based revenues have been our fastest growing revenue category over the past five years, increasing from $350.6 million in 2020 to $1.3 billion in 2024. We monitor Annualized Recurring Revenue (“ARR”), which is calculated based on quarter-to-date end total recurring revenues multiplied by four. ARR was $1.86 billion and $1.61 billion as of December 31, 2024, and 2023, respectively. ARR increased approximately 15% compared to the prior period primarily due to an increase in subscriptions revenue resulting from an ongoing shift toward SaaS arrangements.\n•\nMaximize economies of scale and take advantage of financial leverage in our business\n. We seek to build and maintain a larger client base to create economies of scale, enabling us to provide value-added products and services to our clients while expanding our operating margins. In addition, we believe that we have a marketing and administrative infrastructure in place that can be leveraged to accommodate significant long-term growth without proportionately increasing sales and marketing and general and administrative expenses.\n•\nAttract and retain highly qualified employees\n. We believe that the depth and quality of our management and staff is one of our significant strengths, and that the ability to retain such employees is crucial to our continued growth and success. We believe that our stable management team, financial strength and growth opportunities, as well as our leadership position in the public sector market, enhance our attractiveness as an employer for highly skilled employees.\n•\nPursue strategic acquisitions\n. We selectively pursue strategic acquisitions that provide us with one or more of the following:\n◦\nNew products and services to complement our existing offerings\n◦\nEntry into new markets related to the public sector\n◦\nNew clients and/or geographic expansion\n•\nEstablish strategic alliances\n. We have a strategic collaboration agreement with AWS for cloud hosting services, which brings together Tyler, the nation’s largest software company exclusively focused on the public sector, and AWS, the broadest and deepest cloud platform. Specifically, the agreement with AWS provides the framework for development, training and collaboration in order to support next-generation applications that have the scalability, resiliency, and security AWS offers. AWS is assisting us in accelerating innovation and the development of strategic initiatives. These initiatives bring the most advanced cloud-native services to Tyler clients to help improve the flow of information and provide a better experience for state, local, and federal governments.\n7\nSALES, MARKETING AND CLIENTS\nWe market our products and services primarily through direct sales and marketing personnel located throughout the United States. Other in-house sales staff focus on add-on sales, professional services and support. For certain products, we also utilize a partner network for both sales and professional services, primarily in the state and federal markets. \nSales of new systems are typically generated from referrals from other government offices or departments within a county or municipality, referrals from other local governments, relationships established between sales representatives and county or local officials, contacts at trade shows, direct mailings, and direct contact from prospects already familiar with us. We are active in numerous national, state, county, and local government associations and participate in annual meetings, trade shows, and educational events.\nClients consist primarily of federal, state, county and municipal agencies, school districts and other local government offices. In counties, clients include the auditor, treasurer, tax assessor/collector, county clerk, district clerk, county and district court judges, probation officers, sheriff, and county appraiser. At municipal government sites, clients include directors from various departments, including administration, finance, utilities, public works, code enforcement, personnel, purchasing, taxation, municipal court and police. At the state and federal levels, clients include Chief Information Officers and agency heads. \nCOMPETITION\nWe compete with numerous local, regional, and national firms that provide or offer some or many of the same solutions and services that we provide. Many of these competitors are smaller companies that may offer less expensive solutions than ours. Many of these firms operate within a specific geographic area and/or in a narrow product or service niche. We also compete with national firms, some of which have greater financial and technical resources than we do, including Oracle Corporation, Infor, SAP AG, Workday, Inc., CentralSquare Technologies, Thomson Reuters Corporation, Motorola Solutions, Inc., Axon Enterprise, Inc., and Constellation Software, Inc. In addition, we sometimes compete with consulting and systems integration firms, which develop custom systems, primarily for larger governments. We also occasionally compete with central internal information service departments of governments, which requires us to persuade the end-user department to discontinue service by its own personnel and outsource the service to us.\nWe compete on a variety of factors, including price, service, name recognition, reputation, technological capabilities, and the ability to configure products and services to address the individual requirements of the client. Our ability to offer an integrated system of applications for several offices or departments is often a competitive advantage. Governmental units often are required to seek competitive proposals through a request for proposal process, and some prospective clients use consultants to assist them with the proposal and vendor selection process.\nSUPPLIERS\nSubstantially all of the computers, peripherals, printers, scanners, operating system software, office automation software, and other equipment necessary for the implementation and provision of our software systems and services are presently available from several third-party sources. Hardware is purchased on original equipment manufacturer or distributor terms at discounts from retail. We have not experienced any significant supply problems.\nSEASONALITY\nTransaction-based fees are generally the result of multi-year contracts with our clients that result in fees generated by payment transactions and digital government services and are collected on a recurring basis during the contract term. Transaction-based fees are historically highest in the second quarter, which coincides with peak outdoor recreation seasons and statutory filing deadlines in many jurisdictions, and lowest in the fourth quarter due to fewer business days and lower transaction volumes around holidays. \nINTELLECTUAL PROPERTY, PROPRIETARY RIGHTS, AND LICENSES\nWe regard certain features of our internal operations, software, and documentation as confidential and proprietary and rely on a combination of contractual restrictions, trade secret laws and other measures to protect our proprietary intellectual property. We generally do not rely on patents. We typically license our software products under non-exclusive license agreements, which are generally non-transferable and have a perpetual term.\n8\nHUMAN CAPITAL RESOURCES\nHuman Capital\nOur experienced, collaborative team is one of the most significant contributors to our success in empowering the public sector to create smarter, safer, and stronger communities. Our effectiveness in attracting and developing talented team members, many of whom spend the majority of their careers at Tyler serving our public sector clients, demonstrates our commitment to providing a welcoming and safe workplace, with a strong culture, compensation and benefits, and continual growth opportunities for our team members. \nAs of December 31, 2024, we had approximately 7,400 team members. Approximately 94% of our team members work in one of our 54 U.S. offices or remotely in the U.S.\n \nApproximately 450 of our team members are in Canada, the Philippines, or India. Race and gender reporting are based on information provided by team members. We define leadership as positions which are one or two levels removed from our CEO with management responsibility. The tables below represent our workforce demographics as of December 31, 2024:\nRace:\nWhite\nAsian\nBlack or African  American\nHispanic or Latino\nTwo or more races\nNative  Americans and Other Pacific Islanders\nNot specified\nOverall\n69.6%\n7.7%\n4.7%\n4.9%\n2.1%\n0.5%\n10.5%\nLeadership\n84.0%\n6.3%\n2.9%\n3.1%\n1.4%\n0.4%\n1.9%\nGender:\nMale\nFemale\nNon-Binary\nNot specified\nOverall\n60.6%\n37.1%\n2.0%\n0.3%\nLeadership\n62.1%\n37.9%\n—%\n—%\nWe believe our efforts in managing and supporting our workforce are effective, as evidenced by current levels of applicants, team member tenure, high levels of engagement reported through survey feedback from Tyler team members, and low team member turnover.\nOur team continues to work collaboratively with and for our clients and partners across multiple work arrangements: fully office-based, fully remote and a blended approach of office-based and remote work. Prior to COVID, approximately 40% of team members worked remotely, primarily in sales and professional services roles. As of December 31, 2024, approximately 55% of team members work remotely and 45% of team members are either partially or fully office-based. Collaboration is an important part of our culture.  We are dedicated to creating opportunities for our team members to connect in person, enhancing both our partially and fully office-based presence, while maintaining the flexibility that supports their productivity and well-being. \nVoluntary workforce turnover (rolling 12-month attrition) was 8% as of December 31, 2024 and 2023, which was similar to pre COVID levels of turnover at Tyler that consistently outperform industry levels. The average tenure of our team members continues to be approximately eight years, and approximately 30% of our employees have been employed by Tyler for more than ten years. The most frequent factor cited by team members leaving Tyler in 2024 was career opportunities. While 27% of positions filled in 2024 were filled by existing Tyler team members, we continue to invest in talent development and making career opportunities clear to team members, as discussed in further detail below.\nInvestments in Talent\nWe are committed to providing Tyler team members with career growth opportunities and the training and resources necessary to continually strengthen their skills. Our talent assessment and development programs are designed to provide managers and individual contributors with the resources needed to achieve career goals,\n \nstrengthen management skills and effectively lead their teams.\nFor example, in 2024:\n•\nDivision presidents and corporate function executives conducted annual leadership assessment and talent reviews with their HR leaders and leadership teams to identify development priorities within their teams.\n•\nThe executive team, in partnership with HR, updated the leadership competencies required to execute our Tyler 2030 vision and beyond. The competencies were integrated into key people processes, including performance evaluations and 360 feedback assessments. They also served as the foundation for a new leadership framework to build a pipeline of talent from new leaders through executive level leadership.\n9\n•\nNearly 250 Tyler managers participated in our nine-month Tyler Manager Development program which includes more than 50 hours of interactive, experiential learning focused on developing skills managers need to lead a high performing team. The program also includes multiple leadership assessments, including 360-degree feedback, and a dedicated mentor to support their development. To date, 50% of Tyler managers have participated in the program.\n•\nTyler enhanced our investment in our enterprise-wide mentoring platform to support mentoring relationships for targeted skill building and formal mentoring engagements.\n•\nTyler team members completed over 25,000 hours of Tyler-sponsored leadership training, professional development, and compliance training to support continuous learning and career development.\n•\nAs we continue our multi-year investment in developing cloud skills across the Tyler workforce, 657 Tyler team members participated in approximately 13,000 hours of AWS cloud training, resulting in 99 AWS certifications and 227 accreditations completed.\nOversight and Management \nOur human resources team is tasked with leading and supporting our organization in managing employment-related matters, including recruiting and hiring, onboarding and training, compensation planning, and talent management and development. Our executive team is responsible for periodically reviewing team member programs and initiatives, including healthcare and other benefits, as well as our management development and succession planning practices. Management periodically reports to the Board of Directors and its committees regarding human capital measures and results that guide how we attract, retain and develop a workforce to enable our business strategies. \nHealth & Safety\nWe continually invest in the well-being of Tyler team members and their families, providing a range of resources in support of mental and emotional, financial, and physical health and wellness.\nInclusion\nOne of Tyler’s stated core values is inclusion, which we define as respecting and valuing each other. To organize our efforts on this particular value, we operate Tyler Together, with strategic pillars focused on our culture, career development, and community impact. In \n2024,\n achievements included:\n•\nImproved metrics in our talent attraction and retention efforts;\n•\nExtending equity grants to a broader segment of our workforce, with over 20% of \n2024\n grantees representing first-time grantees; and\n•\nThe re-launch or first-time launch of Employee Resource Groups (“ERGs”) including Tyler Women, Tyler Military Veterans, and the Tyler LGBTQ+ Network, each with defined business objectives.\nINTERNET WEBSITE AND AVAILABILITY OF PUBLIC FILINGS\nWe file annual, quarterly, current and other reports, proxy statements and other information with the Securities and Exchange Commission, or SEC, pursuant to the Securities Exchange Act. You may read and copy any materials we file with the SEC at the SEC’s Public Reference Room by calling the SEC at 1-800-732-0330. The SEC maintains an Internet site that contains reports, proxy and other information statements, and other information regarding issuers, including us, that file electronically with the SEC. The address of this site is http://www.sec.gov.\nWe also maintain a website at www.tylertech.com. We make available free of charge through this site our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Forms 4 and 5, Current Reports on Form 8-K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act as soon as reasonably practicable after we electronically file such material with, or furnish it to the SEC. In addition, copies of our annual report will be made available, free of charge, upon written request.\nOur “Code of Business Conduct and Ethics” is also available on our website. We intend to satisfy the disclosure requirements regarding amendments to, or waivers from, a provision of our Code of Business Conduct and Ethics by posting such information on our website.\n10",
  "item7": "ITEM 7.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nThe following discussion and analysis should be read in conjunction with our consolidated financial statements and related notes included in Item 8 of this Annual Report on Form 10-K. For a comparison of our Results of Operations for the years ended December 31, 2023, and 2022, and our Cash Flow discussion for the year ended December 2023, see “Part II, Item 7. Management's Discussion and Analysis of Financial Conditions and Results of Operations” of our Annual Report on Form 10-K for the year ended December 31, 2023, as filed with the SEC on February 21, 2024. \nCAUTIONARY NOTE CONCERNING FORWARD-LOOKING STATEMENTS\nThis document contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 that are not historical in nature and typically address future or anticipated events, trends, expectations or beliefs with respect to our financial condition, results of operations or business. Forward-looking statements often contain words such as “believes,” “expects,” “anticipates,” “foresees,” “forecasts,” “estimates,” “plans,” “intends,” “continues,” “may,” “will,” “should,” “projects,” “might,” “could” or other similar words or phrases. Similarly, statements that describe our business strategy, outlook, objectives, plans, intentions or goals also are forward-looking statements. We believe there is a reasonable basis for our forward-looking statements, but they are inherently subject to risks and uncertainties and actual results could differ materially from the expectations and beliefs reflected in the forward-looking statements. We presently consider the following to be among the important factors that could cause actual results to differ materially from our expectations and beliefs: (1) changes in the budgets or regulatory environments of our clients, primarily local and state governments, that could negatively impact information technology spending; (2) disruption to our business and harm to our competitive position resulting from cyber-attacks, security vulnerabilities and software updates; (3) our ability to protect client information from security breaches and provide uninterrupted operations of data centers; (4) our ability to achieve growth or operational synergies through the integration of acquired businesses, while avoiding unanticipated costs and disruptions to existing operations; (5) material portions of our business require the Internet infrastructure to be adequately maintained; (6) our ability to achieve our financial forecasts due to various factors, including project delays by our clients, reductions in transaction size, fewer transactions, delays in delivery of new products or releases or a decline in our renewal rates for service agreements; (7) general economic, political and market conditions, including continued inflation and rising interest rates; (8) technological and market risks associated with the development of new products or services or of new versions of existing or acquired products or services; (9) competition in the industry in which we conduct business and the impact of competition on pricing, client retention and pressure for new products or services; (10) the ability to attract and retain qualified personnel and dealing with rising labor costs, the loss or retirement of key members of management or other key personnel; and (11) costs of compliance and any failure to comply with government and stock exchange regulations. These factors and other risks that affect our business are described in Item 1A, “Risk Factors”. We expressly disclaim any obligation to publicly update or revise our forward-looking statements.\nOVERVIEW\nGeneral\nWe provide integrated information management solutions and services for the public sector. We develop and market a broad line of software products and services to address the IT needs of public sector entities. We provide subscription-based services such as software as a service (“SaaS”) and transaction-based services primarily related to digital government services and payment processing. In addition, we provide professional IT services to our clients, including software and hardware installation, data conversion, training, and for certain clients, product modifications, along with continuing maintenance and support for clients using our systems. Additionally, we provide property appraisal services for taxing \njurisdictions\n.\nWe report our results in two reportable segments. Our reportable segments are organized on the basis of a combination of the products and services they deliver to clients and the function the public sector client performs. Business units that have met the aggregation criteria have been combined into our two reportable segments. The Enterprise Software (“ES”) reportable segment provides public sector entities with software systems and services to meet their information technology and automation needs for mission-critical “back-office” functions such as: public administration solutions, courts and public safety solutions, education solutions, and property and recording solutions. The Platform Technologies (“PT”) reportable segment provides public sector entities with platform and transformative solutions including digital solutions, payment processing, streamlined data processing, and improved operations and workflows.\n27\nThe primary financial measures used by the CODM for assessing performance and allocating resources are segment income or loss from operations. The CODM uses segment income or loss from operations before income taxes, not including gains and losses on investments, to allocate resources (including employees, property, and financial or capital resources) for each segment predominantly in the annual budget and forecasting process. Segment gross profit for our operating segments units is defined as gross profit before non-cash amortization of acquired software associated with acquisitions. Segment operating income for our reportable segments is defined as income before non-cash amortization of intangible assets associated with their acquisitions, interest expense, and income taxes. During the fiscal periods presented, we had no significant transaction between reportable segments. Corporate segment operating loss primarily consists of compensation costs for the executive management team, certain shared services staff, and share-based compensation expense for the entire company. Corporate segment operating loss also includes revenues and expenses related to a company-wide user conference. Certain presentation items from previous years have been adjusted to conform with current year presentation.\nRecent Acquisitions \n2024\nWe did not complete any acquisitions during the twelve months ended December 31, 2024,.\n2023\nOn October 31, 2023, we acquired Resource Exploration, Inc. (“ResourceX”), a leading provider of budgeting software to the public sector, and ARInspect, Inc. (“ARInspect”), a leading provider of AI powered machine learning solutions for public sector field operations.\nOn August 8, 2023, we acquired Computing System Innovations, LLC (“CSI”), a leading provider of artificial intelligence automation, redaction, and indexing solution for courts, recorders, attorneys, and others.\nThe actual operating results of CSI and ResourceX are included in the operating results of the ES segment from their respective dates of acquisition. The operating results of ARInspect are included in the operating results of the PT segment since the date of acquisition.\n2024 Operating Results\nFor the twelve months ended December 31, 2024, total revenues increased 9.5% compared to the prior period. Revenues from recent acquisitions contributed $10.4 million or 0.5%, to the total revenue increase.\nSubscriptions revenue grew 15.8% for the twelve months ended December 31, 2024, primarily due to an ongoing shift toward SaaS arrangements for both new and existing clients, along with growth in certain transaction-based revenues. We monitor and analyze several key performance indicators in order to manage our business and evaluate our financial and operating performance. These indicators include the following:\nRevenues – We derive our revenues from four primary sources: subscription-based arrangements from SaaS and transaction-based fees; maintenance; professional services; and software licenses and royalties. Subscriptions and maintenance are considered recurring revenue sources and comprised approximately 84% of our revenues in 2024. The number of new SaaS clients and the number of existing clients who convert from our traditional software arrangements to our SaaS model are a significant driver of our revenue growth, together with transaction-based revenues and maintenance rate increases. In addition, we also monitor our client base and attrition, which historically is very low. During 2024, based on our number of clients, attrition was approximately 2%.\nAnnualized Recurring Revenue (“ARR”) - Subscriptions and maintenance are considered recurring revenue sources. ARR is calculated by annualizing the current quarter\n’\ns recurring revenues from maintenance and subscriptions as reported in our statement of income. Management believes ARR is an indicator of the annual run rate of our recurring revenues, as well as a measure of the effectiveness of the strategies we deploy to drive revenue growth over time. ARR is a metric widely used by companies in the technology sector and by investors, which we believe offers insight to the stability of our maintenance and subscription revenues to be recognized within the year. \n28\nSubscriptions revenues primarily consist of revenues derived from our SaaS arrangements and transaction-based fees. These revenues are considered recurring because revenues from these sources are expected to re-occur in similar annual amounts for the term of our relationship with the client. Transaction-based fees are generally the result of multi-year contracts with our clients that result in fees generated by payment transactions and digital government services and are collected on a recurring basis during the contract term. Transaction-based revenues are historically highest in the second quarter, which coincides with peak outdoor recreation seasons and statutory filing deadlines in many jurisdictions, and lowest in the fourth quarter due to fewer business days and lower transaction volumes around holidays. Because ARR is an annualized revenue amount, the metric can fluctuate from quarter to quarter due to this seasonality. ARR was $1.86 billion and $1.61 billion as of December 31, 2024, and 2023, respectively. ARR increased approximately 15% compared to the prior period primarily due to an increase in subscriptions revenue resulting from an ongoing shift toward SaaS arrangements for both new and existing clients and expansion in transaction-based fees.\nCost of Revenues and Gross Margins – Our primary cost components are hosting costs and personnel expenses in connection with providing software implementation, subscription-based services and maintenance and support to our clients. We can improve gross margins by controlling headcount and related costs and by expanding our revenue base, especially from those products and services that produce incremental revenue with relatively low incremental cost, such as subscription-based services, maintenance and support and software licenses and royalties. Continued migration of clients to our SaaS products and consolidation of versions of on-premises software products with support obligations could decrease support costs with resources redeployed toward development. As of December 31, 2024, our total employee count included in cost of revenues increased to 5,250 from 5,129 at December 31, 2023.\nSales and Marketing (“S&M”) Expense – The primary components of S&M expense include sales personnel salaries and share-based compensation expense, sales commissions, travel-related expenses, advertising and marketing materials, and allocated depreciation, facilities, and IT support. Sales commissions typically fluctuate with revenues and share-based compensation expense generally increases based on increased levels of awards issued during the period and as the market price of our stock increases. Other administrative expenses tend to grow at a slower rate than revenues.\nGeneral and Administrative (“G&A”) Expense – The primary components of G&A expense include personnel salaries and share-based compensation expense for general corporate functions, including senior management, finance, accounting, legal, human resources and corporate development, third-party professional fees, travel-related expenses, insurance, allocation of depreciation, facilities and IT support costs, acquisition-related expenses and other administrative expenses. Share-based compensation expense generally increases based on increased level of awards issued during the period and as the market price of our stock increases. Other administrative expenses tend to grow at a slower rate than revenues.\nResearch and development (“R&D”) expense – These costs include compensation costs for engineering and product management personnel, third-party contractor expenses, software development tools and other expenses related to researching and developing new solutions or upgrading and enhancing existing solutions that do not qualify for capitalization, and allocated depreciation, facilities and IT support costs. As of December 31, 2024, our total employee count included in R&D expense increased to 870 from 830 at December 31, 2023\nLiquidity and Cash Flows – The primary driver of our cash flows is net income. Uses of cash include acquisitions, capital investments in property and equipment and software development, debt repayment and discretionary purchases of treasury stock. Our working capital needs are fairly stable throughout the year with the significant components of cash inflows representing collection of accounts receivable and cash receipts from clients in advance of revenue being earned, offset by cash outflows, primarily payment of personnel expenses. In recent years, we have also received significant amounts of cash from employees exercising stock options and contributing to our Employee Stock Purchase Plan.\nBalance Sheet – Cash, accounts receivable and deferred revenue balances are important indicators of our business.\nOutlook\nARR was $1.86 billion and $1.61 billion as of December 31, 2024, and 2023, respectively, an increase of approximately 15% compared to the prior period. The public sector software market continues to experience heightened activity. We expect to continue to achieve solid growth in revenues and earnings. With our strong financial position and cash flow, we plan to continue to make significant investments in product development and continue to accelerate our move to the cloud to better position us to continue to expand our addressable market and strengthen our competitive position over the long term. \n29\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur discussion and analysis of our financial condition and results of operations is based upon our financial statements. These financial statements have been prepared following the requirements of accounting principles generally accepted in the United States (“GAAP”) and require us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. The Notes to the Financial Statements included as part of this Annual Report describe our significant accounting policies used in the preparation of the financial statements. Significant items subject to such estimates and assumptions include the recoverability of goodwill and other intangible assets and estimated useful lives of intangible assets, the application of the progress toward completion methods of revenue recognition, estimation for revenue recognition and multiple performance obligation arrangements. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. Actual results may differ from these estimates under different assumptions or conditions.\nWe believe the following critical accounting policies require significant judgments and estimates used in the preparation of our financial statements.\nRevenue Recognition. \nWe earn the majority of our revenues from subscription-based services and post-contract client support (“PCS” or “maintenance”). Other sources of revenue are professional services, software licenses and royalties, and hardware and other. Our software arrangements with clients contain multiple performance obligations that range from software licenses, installation, training, consulting, software modification and customization to meet specific client needs; hosting; and PCS. For these contracts, we account for individual performance obligations separately when they are distinct. We evaluate whether separate performance obligations can be distinct or should be accounted for as one performance obligation. Arrangements that include professional services, such as training or installation, are evaluated to determine whether those services are highly interdependent or interrelated to the product’s functionality. The transaction price is allocated to the distinct performance obligations on a relative standalone selling price (“SSP”) basis. \nFor arrangements that involve significant production, modification or customization of the software, or where professional services otherwise cannot be considered distinct, we recognize revenue as control is transferred to the client over time using progress-to-completion methods. Depending on the contract, we measure progress-to-completion primarily using labor hours incurred. Amounts recognized in revenue are calculated using the progress-to-completion measurement after giving effect to any changes in our cost estimates. Changes to total estimated contract costs, if any, are recorded in the period they are determined. Estimated losses on uncompleted contracts are recorded in the period in which we first determine that a loss is apparent. \nBusiness Combinations. \nAccounting for the acquisition of a business requires the allocation of the purchase price to the various assets acquired and liabilities assumed at their respective fair values. The determination of fair value requires the use of significant estimates and assumptions, and in making these determinations, management uses all available information. \nFor tangible and identifiable intangible assets acquired in a business combination, management estimates the fair value of assets acquired and liabilities assumed based on quoted market prices, the carrying value of the acquired assets and widely accepted valuation techniques, including discounted cash flows and market multiple analyses. The assumptions made in performing these valuations include, but are not limited to, discount rates, future revenues and operating costs, projections of capital costs, and other assumptions believed to be consistent with those used by principal market participants. \nDue to the specialized nature of these calculations, we engage third-party specialists to assist management in evaluating our assumptions as well as appropriately measuring the fair value of assets acquired and liabilities assumed. We adjust the preliminary purchase price allocation, as necessary, up to one year after the acquisition closing date as we obtain new information about facts and circumstances that existed as of the closing date. If actual results are materially different than the assumptions we used to determine fair value of the assets acquired and liabilities assumed through a business combination as well as the estimated useful lives of the acquired intangible assets, it is possible that adjustments to the carrying values of such assets and liabilities will have a material impact on our financial position and results of operations.\nGoodwill and Other Intangible Assets\n. We perform an impairment assessment annually on October 1, or more frequently if indicators of potential impairment exist, which includes evaluating qualitative and quantitative factors to assess the likelihood of an impairment of each reporting unit’s goodwill. If the conclusion of an impairment assessment is that it is more likely than not that the fair value of the reporting unit is more than its carrying value, goodwill is not considered impaired, and we are not required to perform the quantitative goodwill impairment test. If the conclusion of an impairment assessment is that it is more likely than not that the fair value is less than its carrying value, we perform the quantitative goodwill impairment test, which compares the fair value of the reporting unit to its carrying value. Impairments, if any, are based on the excess of the carrying amount over the fair value. There have been no impairments to goodwill in any of the periods presented. See Note 8, “Goodwill and Other Intangible Assets,” for additional information. \n30\nAll intangible assets (other than goodwill) are reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of other intangible assets is measured by comparison of the carrying amount to estimated undiscounted future cash flows. The assessment of recoverability or of the estimated useful life for amortization purposes will be affected if the timing or the amount of estimated future operating cash flows is not achieved. Such indicators may include, among others: a significant decline in expected future cash flows; a sustained, significant decline in stock price and market capitalization; a significant adverse change in legal factors or in the business climate; unanticipated competition; and reductions in growth rates. In addition, products, capabilities, or technologies developed by others may render our software products obsolete or non-competitive. Any adverse change in these factors could have a significant impact on the recoverability of goodwill or other intangible assets. During 2024, we did not identify any triggering events that would indicate that the carrying amount of our intangible assets may not be recoverable.\nRecent adoption of new accounting pronouncements\nIn November 2023, the Financial Accounting Standards Board (the “FASB”) issued Accounting Standards Update (ASU) 2023-07 - \nSegment Reporting (Topic 280), Improvements to Reportable Segment Disclosures. \nASU 2023-07 enhances the disclosures required for reportable segments in annual and interim consolidated financial statements. The guidance is effective for fiscal years beginning after December 15, 2023, and interim periods within fiscal years beginning after December 15, 2024, with early adoption permitted. As of December 31, 2024, we adopted the new standard which has been applied retrospectively by the Company. This change did not have a significant impact on the Company’s financial statements and disclosures. See Note 2, “Segment and Related Information,” for further discussion.\nNew accounting pronouncements\nIn January 2025, the FASB issued ASU 2025-01 - \nIncome Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Clarifying the Effective Date. \nThis update clarifies that all public business entities must adopt the guidance in ASU 2024-03 for annual reporting periods beginning after December 15, 2026, and for interim periods within annual reporting periods beginning after December 15, 2027, with early adoption permitted. This guidance is not expected to have a material impact on the Company’s financial statements.\nIn November 2024, the FASB issued ASU 2024-04 - \nDebt - Debt with Conversion and Other Options (Subtopic 470-20): Induced Conversions of Convertible Debt Instruments. \nThis guidance clarifies the requirements for determining whether certain settlements of convertible debt instruments should be accounted for as an induced conversion. It is effective for annual reporting periods beginning after December 15, 2025, and interim periods within those annual reporting periods, with early adoption permitted. This guidance is not expected to have a material impact on the Company’s financial statements. \nIn November 2024, the FASB issued ASU 2024-03 - \nIncome Statement - Reporting Comprehensive Income - Expense Disaggregation Disclosures (Subtopic 220-40): Disaggregation of Income Statement Expenses. \nThis guidance requires public entities to disclose additional information about specific expense categories in the notes to the financial statements on an interim and annual basis. It is effective for annual reporting periods beginning after December 15, 2026, and interim periods beginning after December 15, 2027, with early adoption permitted. This guidance is not expected to have a material impact on the Company’s financial statements.\nIn December 2023, the FASB issued ASU 2023-09 - \nIncome Taxes (Topic ASC 740) Income Taxes\n. The ASU\n improves the transparency of income tax disclosures by requiring (1) consistent categories and greater disaggregation of information in the rate reconciliation and (2) income taxes paid disaggregated by jurisdiction. \nIt also includes certain other amendments to improve the effectiveness of income tax disclosures. ASU 2023-09 is effective for annual periods beginning after December 15, 2024 with early adoption permitted. This guidance is not expected to have a material impact on the Company’s financial statements.  \n31\nANALYSIS OF RESULTS OF OPERATIONS AND OTHER\nThe following discussion compares the historical results of operations on a basis consistent with GAAP for the years ended December 31, 2024 and 2023:\nPercentage of Total Revenues\nYears Ended December 31,\n2024\n2023\nRevenues:\n \n \nSubscriptions\n62.8 \n%\n59.4 \n%\nMaintenance\n21.7 \n23.9 \nProfessional services\n12.3 \n12.8 \nSoftware licenses and royalties\n1.2 \n2.0 \nHardware and other\n2.0 \n1.9 \nTotal revenues\n100.0 \n100.0 \nCost of revenues:\n \n \nSubscriptions, maintenance, and professional services\n52.1 \n51.3 \nSoftware licenses, royalties, and amortization of acquired software\n2.0 \n2.4 \nAmortization of software development\n0.9 \n0.6 \nHardware and other\n1.2 \n1.5 \nSales and marketing expense\n7.4 \n7.7 \nGeneral and administrative expense\n14.1 \n15.8 \nResearch and development expense\n5.5 \n5.6 \nAmortization of other intangibles\n2.8 \n3.8 \nOperating income\n14.0 \n11.3 \nInterest expense\n(0.3)\n(1.2)\nOther income, net\n0.7 \n0.2 \nIncome before income taxes\n14.4 \n10.3 \nIncome tax provision\n2.1 \n1.7 \nNet income\n12.3 \n%\n8.6 \n%\n2024 Compared to 2023 \nRevenues\nSubscriptions.\nThe following table sets forth a comparison of our subscriptions revenue for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nES\n$\n794,475 \n$\n634,262 \n$\n160,213 \n25 \n%\nPT\n548,456 \n525,250 \n23,206 \n4 \n%\nTotal subscriptions revenue\n$\n1,342,931 \n$\n1,159,512 \n$\n183,419 \n16 \n%\nSubscriptions revenue consists of revenues derived from our SaaS arrangements and transaction-based fees primarily related to digital government services and payment processing.\n32\nSaaS\nThe following table sets forth a comparison of our subscriptions revenue derived from SaaS fees for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nES\n$\n559,842 \n$\n459,544 \n$\n100,298 \n22 \n%\nPT\n84,937 \n68,433 \n16,504 \n24 \n%\nTotal subscriptions revenue derived from SaaS fees\n$\n644,779 \n$\n527,977 \n$\n116,802 \n22 \n%\nFor the twelve months ended December 31, 2024, the increase in SaaS fees compared to prior period is primarily attributable to new SaaS clients as well as existing on-premises clients who converted to our SaaS model. Since December 31, 2023, we have added 734 new SaaS clients, while 415 existing on-premises clients have converted to our SaaS offerings. Our new software contract mix for the twelve months ended December 31, 2024, was 12% perpetual software license arrangements and approximately 88% subscription-based arrangements, compared to approximately 17% perpetual software license arrangements and approximately 83% subscription-based arrangements for the twelve months ended December 31, 2023.\nTransaction-based fees\nThe following table sets forth a comparison of our subscriptions revenue derived from transaction-based fees for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nES\n$\n234,633 \n$\n174,718 \n$\n59,915 \n34 \n%\nPT\n463,519 \n456,817 \n6,702 \n1 \n%\nTotal subscriptions revenue derived from transaction-based fees\n$\n698,152 \n$\n631,535 \n$\n66,617 \n11 \n%\nFor the twelve months ended December 31, 2024, contributing to the growth in transaction-based fees compared to prior period are the new transaction clients, volume increases from online payments and e-filing services, price increases by certain third-party processing partners from whom we receive a share of revenues, and the impact of transaction-based fees from recent acquisitions of $4.2 million. These increases are partially offset by a change from the gross revenue model to the net revenue model for payments revenue under one of our state enterprise agreements that results in merchant fees recorded as a reduction in revenue rather than as cost of revenues.\nMaintenance.\nThe following table sets forth a comparison of our maintenance revenue for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nES\n$\n438,455 \n$\n442,781 \n$\n(4,326)\n(1)\n%\nPT\n24,677 \n23,880 \n797 \n3 \nTotal maintenance revenue\n$\n463,132 \n$\n466,661 \n$\n(3,529)\n(1)\n%\nWe provide maintenance and support services for our software products and certain third-party software. Maintenance revenue decreased compared to prior period primarily due to the impact of clients converting from on-premises license arrangements to SaaS, partially offset by maintenance price increases.\n33\nProfessional services.\nThe following table sets forth a comparison of our professional services revenue for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nES\n$\n219,933 \n$\n209,727 \n$\n10,206 \n5 \n%\nPT\n44,058 \n40,249 \n3,809 \n9 \nTotal professional services revenue\n$\n263,991 \n$\n249,976 \n$\n14,015 \n6 \n%\nProfessional services revenue primarily consists of professional services billed in connection with implementing our software, converting client data, training client personnel, custom development activities, consulting, and property appraisal services. New clients who implement our software generally contract with us to provide the related professional services. Existing clients also periodically purchase additional training, consulting and minor programming services. \nThe increase in professional services revenues compared to prior period is primarily attributable to higher new contract volume along with increased billing rates.\nSoftware licenses and royalties.\nThe following table sets forth a comparison of our software licenses and royalties revenue for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nES\n$\n25,292 \n$\n32,709 \n$\n(7,417)\n(23)\n%\nPT\n1,065 \n5,387 \n(4,322)\n(80)\nTotal software licenses and royalties revenue\n$\n26,357 \n$\n38,096 \n$\n(11,739)\n(31)\n%\nThe decrease in software licenses and royalties revenue compared to prior period is primarily attributed to the shift in the mix of new software contracts toward more SaaS offerings. \nAlthough the mix of new contracts between subscription-based and perpetual license arrangements may vary from quarter to quarter and year to year, we expect that software license revenues will continue to decline as we shift our model away from perpetual software license to SaaS. Subscription-based arrangements result in lower software license revenue in the initial year as compared to perpetual software license arrangements, but generate higher overall revenue over the term of the contract. \nCost of revenues and overall gross margins\nThe following table sets forth a comparison of the key components of our cost of revenues for the listed years ended December 31 ($ in thousands):\n \nChange\n2024\n2023\n$\n%\nSubscriptions, maintenance, and professional services\n$\n1,112,778 \n$\n1,001,221 \n$\n111,557 \n11 \n%\nSoftware licenses and royalties\n6,277 \n10,821 \n(4,544)\n(42)\nAmortization of software development\n18,806 \n12,625 \n6,181 \n49 \nAmortization of acquired software\n36,964 \n36,062 \n902 \n3 \nHardware and other\n27,217 \n29,923 \n(2,706)\n(9)\nTotal cost of revenues\n$\n1,202,042 \n$\n1,090,652 \n$\n111,390 \n10 \n%\n34\nSubscriptions, maintenance, and professional services\n. Cost of subscriptions, maintenance and professional services primarily consist of personnel costs related to installation of our software, conversion of client data, training client personnel, public cloud hosting costs, and support activities, including enhancing existing solutions, and various other services such as custom development, ongoing operation of our SaaS solutions, property appraisal outsourcing activities, digital government services, and other transaction-based services such as e-filing. Other costs included are merchant and interchange fees required to process credit/debit card transactions and bank fees to process automated clearinghouse transactions related to our payments business. \nIn 2024, the cost of subscriptions, maintenance and professional services grew 11% primarily due to increased hosting costs as we expand our SaaS client base and transition from our proprietary data centers to the public cloud, together with higher personnel costs. Our professional services staff grew by 121 employees since December 31, 2023, as we increased hiring to ensure that we are well-positioned to serve our growing client base. The increases were partially offset by a reduction in merchant fee expense associated with the change from the gross model to the net model for payments revenue under one of our state enterprise agreements.\nSoftware licenses and royalties\n. Costs of software licenses and royalties primarily consist of direct third-party software costs. We do not have any direct costs associated with royalties. The cost of software licenses and royalties for the twelve months ended December 31, 2024, declined 42%, compared to the prior period due to lower third-party software costs.\nAmortization of software development.\n Software development costs included in cost of revenues primarily consist of personnel costs. We begin to amortize capitalized costs when a product is available for general release to clients. Amortization expense is determined on a product-by-product basis at a rate not less than straight-line basis over the software’s remaining estimated economic life of, generally, three to seven years.\nIn 2024, amortization of software development costs increased 49% compared to the prior period due to new capitalized software development projects going into service in the past year.\nAmortization of acquired software. \nAmortization expense related to acquired software attributed to business combinations is included with cost of revenues. The estimated useful lives of acquired software ranges from three to 10 years. \nIn 2024, amortization of acquired software increased 3% compared to the prior period due to amortization of newly acquired software from recent acquisitions completed in fiscal year 2023, partially offset by assets becoming fully amortized in the fourth quarter 2023.\nThe following table sets forth a comparison of gross profit and overall gross margin for the periods presented as of December 31:\n2024\n2023\nChange\nGross profit\n$\n935,761 \n$\n861,099 \n$\n74,662 \nOverall gross margin\n43.8 \n%\n44.1 \n%\n(0.3)\n%\nOverall gross margin\n. Our 2024 blended gross margin decreased 0.3% compared to 2023. The decline in the overall gross margin compared to the prior period is attributed to lower revenue from software licenses and maintenance, higher software development amortization expense, and higher personnel costs. The declines in overall gross margin were partially offset by a higher revenue mix for subscription revenues compared to the prior period, resulting in an increase in incremental margin related to subscriptions, maintenance and professional services.\nSales and marketing expense\nSales and marketing (“S&M”) expense consists primarily of salaries, employee benefits, travel, share-based compensation expense, commissions and related overhead costs for sales and marketing employees, as well as professional fees, trade show activities, advertising costs and other marketing costs. The following table sets forth a comparison of our S&M expense for the years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nSales and marketing expense\n$\n157,731 \n$\n149,770 \n$\n7,961 \n5 \n%\nS&M expense as a percentage of revenues was 7.4% in 2024 compared to 7.7% in 2023. S&M expense increased approximately 5% compared to the prior period, resulting from higher personnel, bonus, commission, and trade show expenses, offset by lower professional fees related to marketing and advertising.\n35\nGeneral and administrative expense\nGeneral and administrative (“G&A”) expense consists primarily of personnel salaries and share-based compensation expense for general corporate functions including senior management, finance, accounting, legal, human resources and corporate development, as well as third-party professional fees, travel-related expenses, insurance, allocation of depreciation, facilities and IT support costs, amortization of software development for internal use, acquisition-related expenses and other administrative expenses. The following table sets forth a comparison of our G&A expense for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nGeneral and administrative expense\n$\n300,938 \n$\n308,575 \n$\n(7,637)\n(2)\n%\nG&A expense as a percentage of revenue was 14.1% in 2024 compared to 15.8% in 2023. G&A expense decreased 2% compared to the prior period. The decline in G&A expense is primarily attributed to lower facilities costs resulting from lease restructurings, partially offset by higher share-based compensation costs and an increase in software and other IT support costs.\nResearch and development expense\nResearch and development expense consists primarily of salaries, employee benefits and related overhead costs associated with new product development. Research and development expense consists mainly of costs associated with development of new products and new functionality in our current SaaS products. The following table sets forth a comparison of our research and development expense for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nResearch and development expense\n$\n117,939 \n$\n109,585 \n$\n8,354 \n8 \n%\nResearch and development expense as a percent of total revenue was 5.5% in 2024, compared to 5.6% in 2023. Research and development expense increased 8% in 2024 compared to the prior period, mainly due to a number of new Tyler product development initiatives shifting from capitalized development projects to projects that are expensed to research and development. \nAmortization of other intangibles\nOther intangibles represents the portion of the purchase price allocated to the identified intangible assets for client-related intangibles, trade names, and leases acquired. The remaining excess purchase price is allocated to goodwill that is not subject to amortization. Amortization expense related to acquired software is included with cost of revenues while amortization expense of other intangibles is recorded as operating expense. The estimated useful lives of other intangibles range from one to 25 years. The following table sets forth a comparison of amortization of other intangibles for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nAmortization of other intangibles\n$\n59,627 \n$\n74,632 \n$\n(15,005)\n(20)\n%\nIn 2024, amortization of other intangibles decreased 20% compared to the prior period due to the impact of certain trade name intangible assets becoming fully amortized as a result of accelerated amortization expense in the fourth quarter of 2023 and partially in 2024. \nEstimated annual amortization expense relating to client related, trade name, and leases acquired intangibles, excluding acquired software for which the amortization expense is recorded as cost of revenues, for the next five years and thereafter is as follows (in thousands):\n2025\n$\n55,274 \n2026\n54,820 \n2027\n54,440 \n2028\n53,783 \n2029\n53,250 \nThereafter\n427,816 \n36\nInterest expense\nThe following table sets forth a comparison of our interest expense for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nInterest expense\n$\n(5,931)\n$\n(23,629)\n$\n17,698 \n(75)%\nInterest expense is comprised of interest expense and non-usage and other fees associated with our borrowings\n.\n The change in interest expense compared to the prior period is primarily attributable to lower interest incurred as a result of our repayment of the Term Loans in early 2024.\nOther income, net\nThe following table sets forth a comparison of our other income, net for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nOther income, net\n$\n14,572 \n$\n3,328 \n$\n11,244 \n338%\nOther income, net, is primarily comprised of interest income from invested cash. The change in other income, net, compared to the prior period is due to increased interest income generated from higher invested cash balances in 2024 compared to 2023.\nIncome tax provision\nThe following table sets forth a comparison of our income tax provision for the listed years ended December 31 ($ in thousands):\n \n \nChange\n2024\n2023\n$\n%\nIncome tax provision\n$\n45,141 \n$\n32,317 \n$\n12,824 \n40 \n%\nEffective income tax rate\n14.6 \n%\n16.3 \n%\n \n \nThe increase in the income tax provision in 2024 compared to the prior period is primarily due to higher income before taxes, increased liabilities for uncertain tax positions, and higher state income taxes. This was partially offset by an increase in excess tax benefits from share-based compensation and research tax credits and a decrease in non-deductible business expense. The decrease in the effective income tax rate in 2024, compared to the prior period is driven by higher excess tax benefits from share-based compensation and decreases in liabilities for uncertain tax positions, state income taxes, and non-deductible business expenses offset by a decrease in research tax credit benefits relative to income before taxes. The tax benefits related to research tax credits totaled $22.1 million in 2024 compared to $20.5 million in 2023. The tax expense related to uncertain tax positions in 2024 was $10.1 million compared to $7.6 million in 2023. The share-based exercise and vesting activity in 2024 generated $21.1 million of excess tax benefits, while exercise and vesting activity in 2023 generated $9.3 million of excess tax benefits.\nThe effective income tax rates for the periods presented are different from the statutory United States federal income tax rate of 21% primarily due to the tax benefits of research tax credits and excess tax benefits related to stock incentive awards, offset by state income taxes, liabilities for uncertain tax positions, and non-deductible business expenses. \nFINANCIAL CONDITION AND LIQUIDITY\nAs of December 31, 2024, we had cash and cash equivalents of $744.7 million compared to $165.5 million as of December 31, 2023. We also had $34.0 million invested in investment grade corporate bonds, U.S. Treasuries and asset-backed securities as of December 31, 2024. These investments have varying maturity dates through 2027 and are held as available-for-sale. Net cash provided by operating activities continues to be our primary source of funds to finance operating needs and capital expenditures. Other potential capital resources include cash on hand, public and private issuances of debt or equity securities, and our revolving credit facility. It is possible that our ability to access the capital and credit markets in the future may be limited by economic conditions or other factors. We believe that our cash on hand, cash provided by operating activities, and available credit are sufficient to fund our working capital requirements and capital expenditures for at least the next twelve months.\n37\nThe following table sets forth a summary of cash flows for the listed years ended December 31 (in thousands):\n2024\n2023\n2022\nCash flows provided (used) by:\n \n \n \nOperating activities\n$\n624,633 \n$\n380,440 \n$\n381,455 \nInvesting activities\n(67,612)\n(76,960)\n(172,530)\nFinancing activities\n22,207 \n(311,844)\n(344,239)\nNet increase (decrease) in cash and cash equivalents\n$\n579,228 \n$\n(8,364)\n$\n(135,314)\nIn 2024, operating activities provided cash of $624.6 million, compared to $380.4 million in 2023. Operating activities that provided cash were primarily comprised of net income of $263.0 million, non-cash depreciation and amortization charges of $143.4 million, non-cash share-based compensation expense of $122.8 million and non-cash amortization of operating lease right-of-use assets of $8.9 million. Changes in working capital, excluding cash, increased cash provided by operating activities by approximately $91.7 million mainly due to timing of prepaid expenses, timing of payments for operating leases, timing of payments related to income taxes and deferred taxes associated with stock option activity during the period. These decreases were offset by an increase in deferred revenue during the period, an increase in accrued expenses due to timing of payments and increased collections from accounts receivables. In general, changes in deferred revenue are cyclical and primarily driven by the timing of our maintenance and subscription renewal billings. Our renewal dates occur throughout the year, but our largest maintenance billing cycles occur in the second and fourth quarters. Subscription renewals are billed throughout the year.\nInvesting activities used cash of $67.6 million in 2024 compared to $77.0 million in 2023. We invested $32.4 million and received $16.0 million in proceeds from investment grade corporate bonds, U.S. Treasuries and asset-backed securities. Approximately $29.4 million of software development costs were capitalized. Approximately $20.5 million was invested in property and equipment, including $7.5 million related to real estate. The remaining additions were for computer equipment and furniture and fixtures in support of growth. We also paid approximately $1.4 million in holdbacks related to acquisitions completed in 2023. \nFinancing activities provided cash of $22.2 million in 2024 compared to used cash of $311.8 million in 2023, primarily attributable to cash received of $74.8 million from stock option exercises, net of withheld shares for taxes upon equity award settlement and employee stock purchase plan activity, partially offset by the repayment of $50.0 million of Term debt related to our 2021 Credit Agreement and payment of $2.6 million in debt issuances costs related to our newly signed 2024 Credit Agreement. \nIn February 2019, our Board of Directors authorized the repurchase of an additional 1.5 million shares of our common stock. The repurchase program, which was approved by our Board of Directors, was originally announced in October 2002 and was amended at various times from 2003 through 2019. As of February 19, 2025, we have authorization from our Board of Directors to repurchase up to 2.2 million additional shares of our common stock. Our share repurchase program allows us to repurchase shares at our discretion. Market conditions as well as the volume of employee stock option exercises, influence the timing of the buybacks and the number of shares repurchased. Share repurchases are generally funded using our existing cash balances and borrowings under our credit facility and may occur through open market purchases and transactions structured through investment banking institutions, privately negotiated transactions and/or other mechanisms. There is no expiration date specified for the authorization.\nOn September 25, 2024, the Company entered into a $700.0 million credit agreement with the various lenders party thereto and Wells Fargo Bank, National Association, as Administrative Agent, Swingline Lender, and Issuing Lender (the “2024 Credit Agreement”). The 2024 Credit Agreement provides for an unsecured revolving credit facility in an aggregate principal amount of up to $700.0 million, including subfacilities for standby letters of credit and swingline loans. The 2024 Credit Agreement matures on September 25, 2029, and loans may be prepaid at any time, without premium or penalty, subject to certain minimum amounts and payment of any SOFR breakage costs. The Company incurred issuance fees of $2.6 million in connection with the 2024 Credit Agreement. The 2024 Credit Agreement replaced Tyler’s previous $500.0 million unsecured credit facility under the credit agreement dated April 21, 2021, among the Company and various lenders party thereto (the “2021 Credit Agreement”), which was scheduled to mature in April 2026.\nWe repaid all amounts due under the Term Loans under the 2021 Credit Agreement and have no outstanding borrowings under the 2024 Credit Agreement, with an available borrowing capacity of $700.0 million as of December 31, 2024.\nAs of December 31, 2024, we had $600.0 million in outstanding principal for the Convertible Senior Notes due 2026. We will settle any conversions of the Convertible Senior Notes either entirely in cash or in a combination of cash and shares of our common stock, at our election. As of December 31, 2024, none of the conditions allowing holders of the Convertible Senior Notes to convert have been met. \nWe paid interest of $3.1 million in 2024 and $19.2 million in 2023. See Note 10, “Debt,” to the consolidated financial statements for discussions of the Convertible Senior Notes and the 2024 Credit Agreement. \n38\nWe paid income taxes, net of refunds received, of $84.2 million in 2024 compared to $142.8 million in 2023. \nWe anticipate that 2025 capital spending will be between $32 million and $34 million, including approximately $19 million of software development. We expect the majority of the other capital spending will consist of computer equipment and software for infrastructure replacements and expansion. Capital spending and cash tax payments are expected to be funded from existing cash balances and cash flows from operations.\nFrom time to time we engage in discussions with potential acquisition candidates. In order to pursue such opportunities, which could require significant commitments of capital, we may be required to incur debt or to issue additional potentially dilutive securities in the future. No assurance can be given as to our future acquisition opportunities and how such opportunities will be financed. \nWe lease office facilities, transportation and other equipment for use in our operations. Most of our leases are non-cancelable operating lease agreements with remaining terms of one to 10 years. Some of these leases include options to extend for up to six years. \nOur estimated future obligations consist of debt, uncertain tax positions, leases, and purchase commitments as of December 31, 2024. Refer to Note 10, “Debt,” Note 13, “Income Tax,” Note 16, “Leases,” and Note 19, “Commitment and Contingencies,” to the consolidated financial statements for related discussions.\nCAPITALIZATION\nAt December 31, 2024, our capitalization consisted of $597.9 million of outstanding debt and $3.4 billion of shareholders’ equity.",
  "item2": null
}