{
  "source_file": "tyl-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nCAUTIONARY NOTE CONCERNING FORWARD-LOOKING STATEMENTS\nThis document contains “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934 that are not historical in nature and typically address future or anticipated events, trends, expectations or beliefs with respect to our financial condition, results of operations or business. Forward-looking statements often contain words such as “believes,” “expects,” “anticipates,” “foresees,” “forecasts,” “estimates,” “plans,” “intends,” “continues,” “may,” “will,” “should,” “projects,” “might,” “could” or other similar words or phrases. Similarly, statements that describe our business strategy, outlook, objectives, plans, intentions or goals also are forward-looking statements. We believe there is a reasonable basis for our forward-looking statements, but they are inherently subject to risks and uncertainties and actual results could differ materially from the expectations and beliefs reflected in the forward-looking statements. We presently consider the following to be among the important factors that could cause actual results to differ materially from our expectations and beliefs: (1) changes in the budgets or regulatory environments of our clients, including local, state and federal government agencies, that could negatively impact information technology spending; (2) disruption to our business and harm to our competitive position resulting from cyber-attacks, security vulnerabilities and software updates; (3) our ability to protect client information from security breaches and provide uninterrupted operations of data centers; (4) our ability to achieve growth or operational synergies through the integration of acquired businesses, while avoiding unanticipated costs and disruptions to existing operations; (5) material portions of our business require the Internet infrastructure to be adequately maintained; (6) our ability to actively monitor developments in artificial intelligence (\"AI\") regulation and ethical standards as we expect that future changes in the regulatory landscape may affect our product development timelines, compliance costs, and market opportunities related to AI; (7) our ability to achieve our financial forecasts due to various factors, including project delays by our clients, reductions in transaction size, fewer transactions, delays in delivery of new products or releases or a decline in our renewal rates for service agreements; (8) general economic, political and market conditions, including inflation and changes in interest rates; (9) technological and market risks associated with the development of new products or services or of new versions of existing or acquired products or services; (10) competition in the industry in which we conduct business and the impact of competition on pricing, client retention and pressure for new products or services; (11) the ability to attract and retain qualified personnel and dealing with rising labor costs, the loss or retirement of key members of management or other key personnel; and (12) costs of compliance and any failure to comply with government and stock exchange regulations. These factors and other risks that affect our business are described in Item 1A, “Risk Factors”. We expressly disclaim any obligation to publicly update or revise our forward-looking statements.\nGENERAL\nWe provide integrated information management solutions and services for the public sector. We develop and market a broad line of software products and services to address the information technology (“IT”) needs of public sector entities. We provide subscription-based services such as software as a service (“SaaS”) and transaction-based services primarily related to digital government services and payment processing. In addition, we provide professional IT services to our clients, including software and hardware installation, data conversion, training, and for certain clients, product modifications, along with continuing maintenance and support for clients using our systems. Additionally, we provide property appraisal services for taxing \njurisdictions\n.\nWe report our results in two reportable segments. Our reportable segments are organized on the basis of a combination of the products and services they deliver to clients and the function that the public sector client performs. Operating segments that have met the aggregation criteria have been combined into our two reportable segments. The Enterprise Software (“ES”) reportable segment provides public sector entities with software systems and services to meet their information technology and automation needs for mission-critical “back-office” functions such as: public administration solutions, courts and public safety solutions, education solutions, and property and recording solutions. The Platform Technologies (“PT”) reportable segment provides public sector entities with platform and transformative solutions including digital solutions, payment processing, streamlined data processing, and improved operations and workflows.\nOur Chief Operating Decision Maker (“CODM”) uses segment operating income or loss to assess performance and to allocate resources (including employees, property, and financial or capital resources) for each segment, predominantly in the annual budget and forecasting process. During the fiscal periods presented, we had no significant transactions between reportable segments. Corporate unallocated amounts are comprised of non-cash amortization of intangible assets associated with acquisitions, depreciation associated with unallocated property and equipment assets, compensation costs for the executive management team and certain shared services staff, and share-based compensation expense for the entire company. Corporate unallocated amounts also include incidental revenues and expenses related to a company-wide user conference and rental income.\nSee Note 3, “Segment and Related Information,” in the notes to the financial statements for additional information.\n28\nRecent Acquisition\ns\n2\n025\nOn July 28, 2025, we acquired Emergency Networking, Inc (“EN”). EN is a SaaS company specializing in cloud-native software for fire departments and emergency medical services (EMS) agencies. The total cash purchase price, net of cash acquired of $497,000, was approximately $19.4 million, subject to certain post-closing adjustments, including holdbacks of $2.5 million. The actual operating results of EN are included with the operating results of the ES segment since the date of acquisition.\nOn January 31, 2025, we acquired MyGov, LLC (“MyGov”), a provider of SaaS platform solutions for community development. The total cash purchase price, net of cash acquired of $215,000, was approximately $18.2 million. The actual operating results of MyGov are included with the operating results of the ES segment since the date of acquisition.\n2024\nWe did not complete any acquisitions during the 2024 fiscal period.\nOperating Results\nFor both the three and nine months ended September 30, 2025, total revenues increased 10%, compared to the prior period, primarily due to an increase in subscription revenue. \nSubscriptions revenue grew 15.5% and 18.8%, respectively, for the three and nine months ended September 30, 2025, compared to the prior period, primarily due to an ongoing shift toward SaaS arrangements for both new and existing clients, along with growth in certain transaction-based revenues. \nOur total employee count increased to 7,689 as of September 30, 2025, including 29 employees who joined us through acquisitions completed since September 30, 2024, from 7,386 as of September 30, 2024. \nAnnualized Recurring Revenues\nAnnualized recurring revenues (ARR) - Subscriptions and maintenance are considered recurring revenue sources. ARR is calculated by annualizing the current quarter’s recurring revenues from maintenance and subscriptions as reported in our statement of income. Management believes ARR is an indicator of the annual run rate of our recurring revenues, as well as a measure of the effectiveness of the strategies we deploy to drive revenue growth over time. ARR is a metric widely used by companies in the technology sector and by investors, which we believe offers insight into the stability of our maintenance and subscription revenues to be recognized within the year.\nSubscription revenues primarily consist of revenues derived from our SaaS arrangements and transaction-based fees. These revenues are considered recurring because revenues from these sources are expected to re-occur in similar annual amounts for the term of our relationship with the client. Transaction-based fees are generally the result of multi-year contracts with our clients that result in fees generated by payment transactions and digital government services and are collected on a recurring basis during the contract term. Transaction-based revenues are historically highest in the second quarter, which coincides with peak outdoor recreation seasons and statutory filing deadlines in many jurisdictions, and lowest in the fourth quarter, due to fewer business days and lower transaction volumes around holidays. Because ARR is an annualized revenue amount, the metric can fluctuate from quarter to quarter due to this seasonality.\nARR was $2.05 billion and $1.85 billion as of September 30, 2025, and 2024, respectively. ARR increased approximately 11% compared to the prior period primarily due to an increase in subscriptions revenue resulting from an ongoing shift toward SaaS arrangements for both new and existing clients and expansion in transaction-based fee arrangements. \n29\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nOur discussion and analysis of our financial condition and results of operations is based upon our condensed consolidated financial statements. These condensed consolidated financial statements have been prepared following the requirements of GAAP for the interim period and require us to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities. On an ongoing basis, we evaluate our estimates, including those related to revenue recognition and potential impairment of intangible assets and goodwill. As these are condensed financial statements, one should also read expanded information about our critical accounting policies and estimates provided in Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations”, included in our Form 10-K for the year ended December 31, 2024. There have been no material changes to our critical accounting policies and estimates from the information provided in our Form 10-K for the year ended December 31, 2024. \nANALYSIS OF RESULTS OF OPERATIONS\nPercent of Total Revenues\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nRevenues:\nSubscriptions\n67.3 \n%\n63.9 \n%\n67.2 \n%\n62.2 \n%\nMaintenance\n18.7 \n21.3 \n19.1 \n21.8 \nProfessional services\n10.9 \n11.9 \n10.7 \n12.6 \nSoftware licenses and royalties\n0.9 \n1.1 \n0.9 \n1.3 \nHardware and other\n2.2 \n1.8 \n2.1 \n2.1 \nTotal revenues\n100.0 \n100.0 \n100.0 \n100.0 \nCost of revenues:\n \n \nSubscriptions, maintenance, and professional services\n48.5 \n52.2 \n48.9 \n52.0 \nSoftware licenses, royalties, and amortization of acquired software\n1.9 \n2.0 \n1.9 \n2.0 \nAmortization of software development\n1.0 \n0.9 \n1.0 \n0.9 \nHardware and other\n1.4 \n1.1 \n1.4 \n1.3 \nSales and marketing expense\n6.3 \n7.0 \n6.3 \n7.3 \nGeneral and administrative expense\n13.4 \n13.3 \n13.4 \n13.8 \nResearch and development expense\n8.7 \n5.5 \n8.6 \n5.5 \nAmortization of other intangibles\n2.4 \n2.5 \n2.4 \n2.9 \nOperating income\n16.4 \n15.5 \n16.1 \n14.3 \nInterest expense\n(0.2)\n(0.2)\n(0.2)\n(0.3)\nOther income, net\n1.8 \n0.8 \n1.5 \n0.5 \nIncome before income taxes\n18.0 \n16.1 \n17.4 \n14.5 \nIncome tax provision\n3.9 \n1.9 \n3.1 \n2.1 \nNet income\n14.1 \n%\n14.2 \n%\n14.3 \n%\n12.4 \n%\nRevenues\nSubscriptions\nThe following table sets forth a comparison of our subscriptions revenue for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nES\n$\n256,714 \n$\n206,006 \n$\n50,708 \n25 \n%\n$\n733,139 \n$\n577,778 \n$\n155,361 \n27 \n%\nPT\n144,380 \n141,164 \n3,216 \n2 \n448,019 \n416,317 \n31,702 \n8 \nTotal subscriptions revenue\n$\n401,094 \n$\n347,170 \n$\n53,924 \n16 \n%\n$\n1,181,158 \n$\n994,095 \n$\n187,063 \n19 \n%\n30\nSubscriptions revenue consists of revenues derived from our SaaS arrangements and transaction-based fees primarily related to digital government services and payment processing.\nSaaS fees\nThe following table sets forth a comparison of our subscriptions revenue derived from SaaS fees for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nES\n$\n178,383 \n$\n144,445 \n$\n33,938 \n23 \n%\n$\n505,183 \n$\n408,632 \n$\n96,551 \n24 \n%\nPT\n21,403 \n22,179 \n(776)\n(3)\n64,254 \n62,754 \n1,500 \n2 \nTotal SaaS fees revenue\n$\n199,786 \n$\n166,624 \n$\n33,162 \n20 \n%\n$\n569,437 \n$\n471,386 \n$\n98,051 \n21 \n%\nFor the three and nine months ended September 30, 2025, SaaS fees grew 20% and 21%, respectively, compared to the prior period. That growth is primarily attributable to new SaaS clients as well as existing on-premises clients who converted to our SaaS model. Since September 30, 2024, we have added 608 new SaaS clients, while 451 existing on-premises clients have converted to our SaaS offerings. For both the nine months ended September 30, 2025, and September 30, 2024, our new software client mix was approximately 89% subscription-based arrangements and approximately 11% perpetual software license arrangements.\nTransaction-based fees\nThe following table sets forth a comparison of our subscriptions revenue derived from transaction-based fees for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nES\n$\n78,331 \n$\n61,561 \n$\n16,770 \n27 \n%\n$\n227,956 \n$\n169,146 \n$\n58,810 \n35 \n%\nPT\n122,977 \n118,985 \n3,992 \n3 \n383,765 \n353,563 \n30,202 \n9 \nTotal transaction-based fees revenue\n$\n201,308 \n$\n180,546 \n$\n20,762 \n11 \n%\n$\n611,721 \n$\n522,709 \n$\n89,012 \n17 \n%\nFor the three and nine months ended September 30, 2025, transaction-based fees grew 11% and 17%, respectively, compared to the prior period. For the three and nine months ended September 30, 2025, volume increases from online payments from new and existing customers contributed approximately $13.9 million and $58.8 million, respectively, to the growth in transactions fees compared to prior period, and price increases by certain third-party processing partners from whom we receive a share of revenues contributed the remainder of the growth for both periods, respectively, compared to the prior period. \nMaintenance\nThe following table sets forth a comparison of our maintenance revenue for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nES\n$\n105,450 \n$\n109,346 \n$\n(3,896)\n(4)\n%\n$\n319,208 \n$\n329,724 \n$\n(10,516)\n(3)\n%\nPT\n5,862 \n6,241 \n(379)\n(6)\n17,028 \n18,390 \n(1,362)\n(7)\nTotal maintenance revenue\n$\n111,312 \n$\n115,587 \n$\n(4,275)\n(4)\n%\n$\n336,236 \n$\n348,114 \n$\n(11,878)\n(3)\n%\nWe provide maintenance and support services for our software products and certain third-party software. Maintenance revenue decreased 4% and 3% for the three and nine months ended September 30, 2025, respectively, compared to the prior period primarily due to the impact of 451 clients converting from on-premises license arrangements to SaaS, partially offset by maintenance price increases. \n31\nProfessional services \nThe following table sets forth a comparison of our professional services revenue for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nES\n$\n55,769 \n$\n53,947 \n$\n1,822 \n3 \n%\n$\n167,224 \n$\n167,571 \n$\n(347)\n— \n%\nPT\n8,959 \n10,515 \n(1,556)\n(15)\n20,166 \n33,625 \n(13,459)\n(40)\nTotal professional services revenue\n$\n64,728 \n$\n64,462 \n$\n266 \n— \n%\n$\n187,390 \n$\n201,196 \n$\n(13,806)\n(7)\n%\nProfessional services revenue primarily consists of professional services billed in connection with implementing our software, converting client data, training client personnel, custom development activities, consulting, and property appraisal services. New clients who implement our software generally contract with us to provide the related professional services. Existing clients also periodically purchase additional training, consulting and minor programming services. \nProfessional services revenues were flat and decreased 7% for the three and nine months ended September 30, 2025, respectively, compared to the prior period. The decrease for the nine months ended September 30, 2025, is primarily due to loss reserves of approximately $8.5 million for contracts with agencies within two state governments. The remainder of the decrease in professional services revenues compared to the prior period is related to an intentional reduction in custom development work as well as efficiencies in the delivery of professional services.\nSoftware licenses and royalties\nThe following table sets forth a comparison of our software licenses and royalties revenue for the three and nine months ended September 30 ($ in thousands): \nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nES\n$\n5,137 \n$\n5,424 \n$\n(287)\n(5)\n%\n$\n15,977 \n$\n19,314 \n$\n(3,337)\n(17)\n%\nPT\n(37)\n764 \n(801)\n(105)\n(220)\n937 \n(1,157)\n(123)\nTotal software licenses and royalties revenue\n$\n5,100 \n$\n6,188 \n$\n(1,088)\n(18)\n%\n$\n15,757 \n$\n20,251 \n$\n(4,494)\n(22)\n%\nFor the three and nine months ended September 30, 2025, software licenses and royalties revenue decreased 18% and 22%, respectively, compared to the prior period primarily because of the ongoing shift in the mix of new software contracts toward more SaaS offerings. Refer to the SaaS revenue section for further details on our revenue mix shift.\nAlthough the mix of new contracts between subscription-based and perpetual license arrangements may vary from quarter to quarter and year to year, we expect that software license revenues will continue to decline as we shift our model away from perpetual software licenses to SaaS.  \nCost of revenues and overall gross margins\nThe following table sets forth a comparison of the key components of our cost of revenues for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nSubscriptions, maintenance, and professional services\n$\n289,070 \n$\n283,750 \n$\n5,320 \n2 \n%\n$\n859,718 \n$\n829,765 \n$\n29,953 \n4 \n%\nSoftware licenses and royalties\n1,669 \n1,870 \n(201)\n(11)\n5,418 \n4,995 \n423 \n8 \nAmortization of software development\n6,195 \n4,961 \n1,234 \n25 \n17,079 \n13,808 \n3,271 \n24 \nAmortization of acquired software\n9,376 \n9,244 \n132 \n1 \n27,989 \n27,723 \n266 \n1 \nHardware and other\n8,117 \n6,052 \n2,065 \n34 \n25,240 \n21,439 \n3,801 \n18 \nTotal cost of revenues\n$\n314,427 \n$\n305,877 \n$\n8,550 \n3 \n%\n$\n935,444 \n$\n897,730 \n$\n37,714 \n4 \n%\n32\nSubscriptions, maintenance, and professional\n \nservices. \nThe following table sets forth a comparison of our costs of subscriptions, maintenance, and professional services for the three and nine months ended September 30 ($ in thousands): \nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nSubscriptions, maintenance, and professional services\n$\n289,070 \n$\n283,750 \n$\n5,320 \n2 \n%\n$\n859,718 \n$\n829,765 \n$\n29,953 \n4 \n%\nCost of subscriptions, maintenance and professional services primarily consist of personnel costs related to installation of our software, conversion of client data, training client personnel, public cloud hosting costs, support activities, and various other services such as custom development, ongoing operation of our SaaS solutions, property appraisal outsourcing activities, digital govern\nment services, and other transaction-based services such as e-filing. Other costs included are merchant and interchange fees required to process credit/debit card transactions and bank fees to process automated clearinghouse transactions related to our payments business. \nThe cost of subscriptions, maintenance, and professional services for the three and nine months ended September 30, 2025, increased 2% and 4%, respectively, compared to the prior period. For the three months ended September 30, 2025, the increase is primarily due to a $1.3 million increase in stock-based compensation expense, a $1.0 million increase in third-party fees related to higher transaction volumes, and an increase of $6.8 million in hosting costs as we expand our SaaS client base and transition from our proprietary data centers to the public cloud. For the nine months ended September 30, 2025, the increase is primarily due to a $3.9 million increase in stock-based compensation expense, a $17.0 million increase in merchant fees and other third-party fees related to higher transaction volumes, and a $15.1 million increase in hosting costs. The increases for both comparative periods were partially offset by the redeployment of resources to research and development due to continued migration of clients to our SaaS products and the consolidation of versions of on-premises software products with support obligations. \nSoftware licenses and royalties. \nThe following table sets forth a comparison of our costs of software licenses and royalties for the three and nine months ended September 30 ($ in thousands): \nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nSoftware licenses and royalties\n$\n1,669 \n$\n1,870 \n$\n(201)\n(11)\n%\n$\n5,418 \n$\n4,995 \n$\n423 \n8 \n%\nCosts of software licenses and royalties primarily consist of direct third-party software costs. We do not have any direct costs associated with royalties revenues. \nThe cost of software licenses and royalties for the three and nine months ended September 30, 2025, decreased 11% and increased 8% respectively, compared to prior period. The decrease in the three month period was primarily due to timing of third-party software costs incurred, while the increase for the nine month period was driven by higher third-party software costs.\n33\nAmortization of software development.\nThe following table sets forth a comparison of our amortization of software development for the three and nine months ended September 30 ($ in thousands): \nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nAmortization of software development\n$\n6,195 \n$\n4,961 \n$\n1,234 \n25 \n%\n$\n17,079 \n$\n13,808 \n$\n3,271 \n24 \n%\nAmortization of software development costs included in cost of revenues primarily consist of personnel costs which were previously capitalized. We begin to amortize capitalized costs when a product is available for general release to clients. Amortization expense is determined on a product-by-product basis at a rate not less than straight-line basis over the software’s remaining estimated economic life of, generally, three to five years.\nFor the three and nine months ended September 30, 2025, amortization of software development costs increased 25% and 24%, respectively, compared to the prior period due to new capitalized software development projects going into service in the past year.\nAmortization of acquired software. \nThe following table sets forth a comparison of our amortization of acquired software for the three and nine months ended September 30 ($ in thousands): \nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nAmortization of acquired software\n$\n9,376 \n$\n9,244 \n$\n132 \n1 \n%\n$\n27,989 \n$\n27,723 \n$\n266 \n1 \n%\nAmortization expense related to acquired software attributed to business combinations is included with cost of revenues. The estimated useful lives of acquired software range from three to 10 years. \nFor both the three and nine months ended September 30, 2025, amortization of acquired software increased 1% compared to the prior period due to amortization of newly acquired software from recent acquisitions completed in 2025, partially offset by assets becoming fully amortized in the fourth quarter of 2024.\nThe following table sets forth a comparison of gross profit and overall gross margin for the periods presented as of September 30:\nThree Months Ended\nNine Months Ended\n2025\n2024\nChange\n2025\n2024\nChange\nTotal gross profit\n$281,452\n$237,460\n$43,992\n$\n821,717 \n$\n698,942 \n$\n122,775 \nOverall gross margin\n47.2 \n%\n43.7 \n%\n3.5 \n%\n46.8 \n%\n43.8 \n%\n3.0 \n%\nOverall gross margin\n. For the three and nine months ended September 30, 2025, our blended gross margin increased 3.5% and 3.0%, respectively, compared to the prior period. For the three and nine months ended September 30, 2025, the increase in overall gross margin compared to the prior period is primarily attributed to a shift in our revenue mix toward higher-margin SaaS revenues. Also contributing to the increase in overall gross margin for the three and nine months ended September 30, 2025, respectively, is the redeployment of resources to research and development due to continued migration of clients to our SaaS products and consolidation of versions of on-premises software products with support obligations. The increase in the overall gross margin is partially offset by declines in software licenses, maintenance and professional services revenues and increases in merchant fees, hosting costs, and software development amortization expense.\n34\nSales and marketing expense\nSales and marketing (“S&M”) expense consists primarily of salaries, employee benefits, travel, share-based compensation expense, commissions and related overhead costs for sales and marketing employees, as well as professional fees, trade show activities, advertising costs and other marketing costs. The following table sets forth a comparison of our S&M expense for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nSales and marketing expense\n$\n37,560 \n$\n38,203 \n$\n(643)\n(2)\n%\n$\n110,345 \n$\n116,195 \n$\n(5,850)\n(5)\n%\nS&M expense as a percentage of revenues was 6.3% for both the three and nine months ended September 30, 2025, compared to 7.0% and 7.3%, respectively, for the three and nine months ended September 30, 2024. S&M expense decreased 2% and 5%, respectively, when compared to the prior period. The decrease in S&M expense is primarily attributed to an increase in compensation capitalized as contract acquisition costs compared to the prior period.\nGeneral and administrative expense\nGeneral and administrative (“G&A”) expense consists primarily of personnel salaries and share-based compensation expense for general corporate functions including senior management, finance, accounting, legal, human resources and corporate development, as well as third-party professional fees, travel-related expenses, insurance, allocation of depreciation, facilities and IT support costs, amortization of software development for internal use, acquisition-related expenses and other administrative expenses. The following table sets forth a comparison of our G&A expense for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nGeneral and administrative expense\n$\n79,971 \n$\n72,460 \n$\n7,511 \n10 \n%\n$\n236,024 \n$\n220,590 \n$\n15,434 \n7 \n%\nG&A expense as a percentage of revenue was 13.4% for both the three and nine months ended September 30, 2025, compared to 13.3% and 13.8%, respectively, for the three and nine months ended September 30, 2024. G&A expense increased 10% and 7%, respectively, for the three and nine months ended September 30, 2025, compared to the prior period. For the three months ended September 30, 2025, the increase in G&A expense is primarily attributable to an increase of $4.2 million in personnel expenses, a $1.4 million increase in professional fees expense, and a $1.6 million increase in certain IT-related costs. For the nine months ended September 30, 2025, the G&A expense increase is attributed to a $7.2 million increase in personnel expenses, a $2.8 million increase in professional fees expense, and a $6.1 million increase in share-based compensation expense due to the higher stock price for share-based awards issued in the current period. \nResearch and development expense\nResearch and development expense consists primarily of salaries, employee benefits and related overhead costs associated with new product development. Research and development expense consists mainly of costs associated with development of new products and new functionality in our current SaaS products. The following table sets forth a comparison of our research and development expense for the three and nine months ended September 30 ($ in thousands):\n \nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nResearch and development expense\n$\n51,788 \n$\n30,120 \n$\n21,668 \n72 \n%\n$\n150,474 \n$\n88,504 \n$\n61,970 \n70 \n%\nResearch and development expense increased 72% and 70%, respectively, for the three and nine months ended September 30, 2025, compared to the prior period, with the majority of the increase due the redeployment of resources to research and development resulting from the continued migration of clients to our SaaS products and version consolidation of on-premises software products with support obligations, together with increased investments in a number of new Tyler product development initiatives across our product suites. The remainder of the increase is attributed to $3.8 million and $12.6 million increases related to share-based compensation expense for the three and nine months ended September 30, 2025, respectively, compared to the prior period.\n35\nAmortization of other intangibles\nOther intangibles represents the portion of purchase price allocated to the identified intangible assets for client-related intangibles, trade names and leases acquired. The remaining excess purchase price is allocated to goodwill that is not subject to amortization. Amortization expense related to acquired software is included with cost of revenues, while amortization expense of other intangibles is recorded as operating expense. The estimated useful lives of other intangibles range from one to 25 years. The following table sets forth a comparison of amortization of other intangibles for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nAmortization of other intangibles\n$\n14,201 \n$\n13,850 \n$\n351 \n3 \n%\n$\n42,173 \n$\n45,813 \n$\n(3,640)\n(8)\n%\nAmortization of other intangibles increased 3% for the three months ended September 30, 2025, due to amortization of other intangibles from acquisitions completed during the 2025 fiscal year. For the nine months ended September 30, 2025, amortization of other intangibles decreased 8% for the nine months ended September 30, 2025, compared to the prior period due to the impact of certain trade name intangible assets becoming fully amortized as a result of accelerated amortization expense in 2024. \nSegment Operating Income\nThe following table sets forth a comparison of the operating income by reportable segments for the three and nine months ended September 30 ($ in thousands):\nSegment Operating Income (loss):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nES\n$\n174,615 \n$\n139,874 \n$\n34,741 \n25 \n%\n$\n504,122 \n$\n404,159 \n$\n99,963 \n25 \n%\nPT\n26,445 \n32,866 \n(6,421)\n(20)\n83,397 \n96,030 \n(12,633)\n(13)\nFor both the three and nine months ended September 30, 2025, the increase of 25% in the ES segment operating income is primarily due to the $50.7 million and $155.4 million, respectively, increase in subscription revenues as a result of the ongoing shift toward SaaS arrangements for both new and existing clients, along with growth in certain transaction-based revenues from new and existing customers. For the three and nine months ended September 30, 2025, these increases are partially offset by lower revenue of $2.4 million and $14.2 million, respectively, compared to prior period from software licenses, maintenance, and professional services. Also partially offsetting the increase in segment operating income for the three and nine months ended September 30, 2025, are increases in total personnel expenses of  $13.6 million and $27.7 million, respectively and increases in total hosting costs of $4.5 million and $13.1 million compared to the prior period.\nThe decreases for the three and nine months ended September 30, 2025, in the PT segment operating income are primarily due to the $13.5 million decline in professional services revenue attributed to loss reserves of approximately $8.5 million for contracts with agencies within two state governments. Higher merchant fees also contributed to the decline in operating income. \nSee Note 3 “Segment and Related Information” for a reconciliation between our operating segment and consolidated financial results for the periods presented. \nInterest expense\nThe following table sets forth a comparison of our interest expense for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nInterest expense\n$\n(1,235)\n$\n(1,235)\n$\n— \n— \n%\n$\n(3,743)\n$\n(4,672)\n$\n929 \n(20)\n%\nInterest expense is comprised of interest expense and non-usage and other fees associated with our borrowings\n.\n Interest expense in the three months ended September 30, 2025, was flat compared to the prior period. The 20% decline for the nine months ended \nSeptember 30, 2025,\n compared to the prior period is primarily attributable to lower interest incurred as a result of our repayment of the Term Loans in early 2024.\n36\nOther income, net\nThe following table sets forth a comparison of our other income, net, for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nOther income, net\n$\n10,855 \n$\n4,504 \n$\n6,351 \n141 \n%\n$\n26,397 \n$\n8,232 \n$\n18,165 \n221 \n%\nOther income, net, is primarily comprised of interest income from invested cash. The change in other income, net, in the three and nine months ended \nSeptember 30, 2025,\n compared to the prior period is due to increased interest income generated from higher invested cash balances in 2025 compared to 2024. Also contributing to the increase in other income is dividend income of $1.8 million. \nIncome tax provision\nThe following table sets forth a comparison of our income tax provision for the three and nine months ended September 30 ($ in thousands):\nThree Months Ended\nChange\nNine Months Ended\nChange\n2025\n2024\n$\n%\n2025\n2024\n$\n%\nIncome tax provision\n$\n23,159 \n$\n10,199 \n$\n12,960 \n127 \n%\n$\n55,283 \n$\n33,595 \n$\n21,688 \n65%\nEffective income tax rate\n21.5 \n%\n11.8 \n%\n \n \n18.1 \n%\n14.5 \n%\nThe increase in the effective tax rate for the three and nine months ended September 30, 2025, as compared to the prior period, is due to a decrease in excess tax benefits related to stock incentive awards and research tax credit benefits, partially offset by a decrease in liabilities for uncertain tax positions. The excess tax benefits related to stock incentive awards were $1.3 million and $16.0 million for the three and nine months ended September 30, 2025, respectively. Excess tax benefits related to stock incentive awards were $7.5 million and $17.2 million for the three and nine months ended September 30, 2024, respectively.\nThe effective income tax rates for the periods presented are different from the statutory United States federal income tax rate of 21% primarily due to the excess tax benefits related to stock incentive awards and the tax benefits of research tax credits, offset by state income taxes, liabilities for uncertain tax positions, and non-deductible business expenses.\nOn July 4, 2025, the reconciliation bill, commonly referred to as the OBBBA was signed into law, which includes a broad range of tax reform provisions that may affect our Company. The OBBBA allows an elective deduction for domestic Research and Development (“R&D”), a reinstatement of elective 100% first-year bonus depreciation, and a more favorable tax rate on Foreign-derived Deduction Eligible Income and income from non-U.S. subsidiaries (“Net CFC Tested Income”), among other provisions. We do not anticipate a material impact on our effective tax rate in 2025 and future periods. We do, however, anticipate a significant reduction in current tax payments in the next 12 months, as well as a decrease in deferred tax assets and the income tax payable related to the provisions for full expensing of domestic R&D and bonus depreciation. The year-to-date impacts of the OBBBA are included in our operating results for the nine months ended September 30, 2025.\n37\nFINANCIAL CONDITION AND LIQUIDITY\nAs of September 30, 2025, we had cash and cash equivalents of $834.1 million, compared to $744.7 million as of December 31, 2024. We also had $139.2 million invested in investment grade corporate bonds, U.S. Treasuries and asset-backed securities as of September 30, 2025. These investments have varying maturity dates through 2027 and are held as available-for-sale. Net cash provided by operating activities continues to be our primary source of funds to finance operating needs and capital expenditures. Other potential capital resources include cash on hand, public and private issuances of debt or equity securities, and our revolving credit facility. It is possible that our ability to access the capital and credit markets in the future may be limited by economic conditions or other factors. We believe that our cash on hand, cash provided by operating activities, and available credit are sufficient to fund our working capital requirements and capital expenditures for at least the next twelve months.\nThe following table sets forth a summary of cash flows for the nine months ended September 30 ($ in thousands):\n2025\n2024\nCash flows provided (used) by:\nOperating activities\n$\n409,660 \n$\n399,859 \nInvesting activities\n(164,107)\n(34,673)\nFinancing activities\n(156,173)\n7,617 \nNet increase in cash and cash equivalents\n$\n89,380 \n$\n372,803 \nFor the nine months ended September 30, 2025, operating activities provided cash of $409.7 million, compared to $399.9 million in the nine months ended September 30, 2024. Operating activities that provided cash were primarily comprised of net income of $250.1 million, non-cash depreciation and amortization charges of $103.9 million, non-cash share-based compensation expense of $112.6 million, and non-cash amortization of operating lease right-of-use assets of $7.2 million. Changes in working capital, excluding cash, reduced cash provided by operating activities by approximately $64.2 million, mainly due to higher accounts receivable. We have higher accounts receivable because our annual maintenance billing cycle peaks in the second quarter. Also contributing to the decrease in working capital are timing of payments to and receipts from our government partners, the timing of prepaid expenses, timing of bonus and commission payments, timing of payroll related payments, timing of payments for operating leases and timing of income tax payments. These decreases were offset by increases in deferred revenue and deferred taxes associated with stock option activity during the period. In general, changes in deferred revenue are cyclical and primarily driven by the timing of our maintenance and subscription renewal billings. Our renewal dates occur throughout the year, but our largest maintenance billing cycles occur in the second and fourth quarters. Subscription renewals are billed throughout the year.\nInvesting activities used cash of $164.1 million in the nine months ended September 30, 2025, compared to $34.7 million in the nine months ended September 30, 2024. On July 28, 2025, we acquired EN, a SaaS company specializing in cloud-native software for fire departments and emergency medical services (EMS) agencies. The total cash purchase price, net of cash acquired of $497,000, was approximately $19.4 million, subject to certain post-closing adjustments, including holdbacks of $2.5 million. On January 31, 2025, we acquired MyGov, a provider of SaaS platform solutions for community development. The total cash purchase price, net of cash acquired of $215,000, was approximately $18.2 million. We invested $180.0 million and received $76.3 million in proceeds from investment grade corporate bonds, U.S. Treasuries and asset-backed securities. Approximately $14.1 million of software development costs were capitalized. Lastly, approximately $11.7 million was invested in property and equipment.\nFinancing activities used cash of $156.2 million in the nine months ended September 30, 2025, compared to $7.6 million provided in the nine months ended September 30, 2024. Net of shares withheld for taxes upon equity awards settlement, we received $12.3 million from stock option exercises and received $13.9 million from employee stock purchase plan activity. During the nine months ended September 30, 2025, we repurchased approximately 303,000 shares of our common stock for an aggregate purchase price of $174.7 million. We also paid $7.7 million in cash for long-term indemnity holdbacks related to prior acquisitions.\n38\nIn February 2019, our Board of Directors authorized the repurchase of an additional 1.5 million shares of our common stock. The repurchase program, which was approved by our Board of Directors, was originally announced in October 2002 and was amended at various times from 2003 through 2019. As of October 29, 2025, we have authorization from our Board of Directors to repurchase up to 1.8 million additional shares of our common stock. Our share repurchase program allows us to repurchase shares at our discretion. Market conditions, as well as the volume of employee stock option exercises, influence the timing of the buybacks and the number of shares repurchased. Share repurchases are generally funded using our existing cash balances and borrowings under our credit facility and may occur through open market purchases and transactions structured through investment banking institutions, privately negotiated transactions and/or other mechanisms. There is no expiration date specified for the authorization.\nOn September 25, 2024, the Company entered into a $700.0 million credit agreement with the various lender parties thereto and Wells Fargo Bank, National Association, as Administrative Agent, Swingline Lender, and Issuing Lender (the “2024 Credit Agreement”). The 2024 Credit Agreement provides for an unsecured revolving credit facility in an aggregate principal amount of up to $700.0 million, including sub-facilities for standby letters of credit and swingline loans. The 2024 Credit Agreement matures on September 25, 2029, and loans may be prepaid at any time, without premium or penalty, subject to certain minimum amounts and payment of any SOFR breakage costs. The 2024 Credit Agreement replaced Tyler’s previous $500.0 million unsecured credit facility under the credit agreement dated April 21, 2021, among the Company and various lenders party thereto, which was scheduled to mature in April 2026.  \nWe have no outstanding borrowings under the 2024 Credit Agreement, with an available borrowing capacity of $700.0 million as of September 30, 2025. \nAs of September 30, 2025, we had $600.0 million in outstanding principal for the Convertible Senior Notes due in 2026. We will settle any conversions of the Convertible Senior Notes in a combination of cash and shares of our common stock. However, upon conversion of any Convertible Senior Notes, the conversion value, which will be determined over an “Observation Period” (as defined in the Indenture) consisting of 30 trading days, will be paid in cash up to at least the principal amount of the Notes being converted. As of September 30, 2025, we have entered the Free Convertibility Period, effective on September 15, 2025 until the close of business on the second scheduled trading day immediately preceding maturity date, March 15, 2026. No conversions have occurred.\nIn the nine months ended September 30, 2025, and 2024, we paid interest of $2.2 million and $2.9 million, respectively. See Note 8, “Debt,” to the condensed consolidated financial statements for discussions of the Convertible Senior Notes and the 2024 Credit Agreement. \nWe made income tax payments, net of refunds, of $47.3 million and $45.7 million in the nine months ended September 30, 2025, and September 30, 2024, respectively.\nWe anticipate that 2025 capital spending will be between $31.0 million and $33.0 million, including approximately $18.0 million of software development. We expect the majority of the other capital spending will consist of computer equipment and software for infrastructure replacements and expansion. Capital spending and cash tax payments are expected to be funded from existing cash balances and cash flows from operations.\nFrom time to time we engage in discussions with potential acquisition candidates. In order to pursue such opportunities, which could require significant commitments of capital, we may be required to incur debt or to issue additional potentially dilutive securities in the future. No assurance can be given as to our future acquisition opportunities and how such opportunities will be financed.\nWe lease office facilities, transportation, and other equipment for use in our operations. Most of our leases are non-cancelable operating lease agreements with remaining terms of one to 10 years. Some of these leases include options to extend for up to six years.\nThere were no material changes to our future minimum contractual obligations since December 31, 2024, as previously disclosed in our 2024 Annual Report on Form 10-K filed with the SEC on February 19, 2025. Our estimated future obligations consist of debt, uncertain tax positions, leases, and purchase commitments as of September 30, 2025. Refer to Note 8, “Debt,” Note 11, “Income Tax,” Note 14, “Leases,” and Note 15, “Commitments and Contingencies,” to the condensed consolidated financial statements for related discussions.\n39"
}