{
  "source_file": "udr-20241231x10k.htm",
  "form_type": "10-K",
  "item1": "Item 1. BUSINESS\nGeneral\nUDR is a self-administered real estate investment trust, or REIT, that owns, operates, acquires, renovates, develops, redevelops, disposes of, and manages multifamily apartment communities in targeted markets located in the United States. At December 31, 2024, our consolidated real estate portfolio consisted of 169 communities located in 21 markets, consisting of 55,696 completed apartment homes, which are held directly or through our subsidiaries, including the Operating Partnership and the DownREIT Partnership, and consolidated joint ventures. In addition, we have an ownership interest in 10,860 completed or to-be-completed apartment homes through unconsolidated joint ventures or partnerships, including 6,436 apartment homes owned by entities in which we hold preferred equity investments. At December 31, 2024, the Company was not developing any communities, although the Company was incurring and capitalizing costs directly related to predevelopment activities in preparation of future development commencements. During the year ended December 31, 2024, the Company completed the development of two communities located in Tampa, Florida and Addison, Texas, with a total of 415 apartment homes.\nUDR has elected to be taxed as a REIT under the Internal Revenue Code of 1986, as amended, which we refer to in this Report as the “Code.” To continue to qualify as a REIT, we must continue to meet certain tests which, among other things, generally require that our assets consist primarily of real estate assets, our income be derived primarily from real estate assets, and that we distribute at least 90% of our REIT taxable income (other than our net capital gains) to our stockholders annually. As a REIT, we generally will not be subject to U.S. federal income taxes at the corporate level on our net income to the extent we distribute such net income to our stockholders annually. In 2024, we declared total distributions of $1.70 per common share and paid dividends of $1.695 per common share.\n​\n​\n​\n​\n​\n​\n​\n​\n    \nDividends\n    \nDividends\n​\n​\nDeclared in\n​\nPaid in\n​\n​\n2024\n​\n2024\nFirst Quarter\n​\n$\n 0.4250\n​\n$\n 0.4200\nSecond Quarter\n​\n \n 0.4250\n​\n \n 0.4250\nThird Quarter\n​\n \n 0.4250\n​\n \n 0.4250\nFourth Quarter\n​\n \n 0.4250\n​\n \n 0.4250\nTotal\n​\n$\n 1.7000\n​\n$\n 1.6950\n​\nUDR was formed in 1972 as a Virginia corporation. In June 2003, we changed our state of incorporation from Virginia to Maryland. Our corporate offices are located at 1745 Shea Center Drive, Suite 200, Highlands Ranch, Colorado and our telephone number is (720) 283-6120. Our website is \nwww.udr.com\n. The information contained on our website, including any information referred to in this Report as being available on our website, is not a part of or incorporated into this Report.\nAs of December 31, 2024, there were 189.8 million units in the Operating Partnership (“OP Units”) outstanding, of which 176.6 million OP Units (including 0.1 million of general partnership units), or 93.0%, were owned by UDR and 13.2 million OP Units, or 7.0%, were owned by outside limited partners. As of December 31, 2024, there were 32.4 million units in the DownREIT Partnership (“DownREIT Units”) outstanding, of which 23.0 million, or 71.0%, were owned by UDR and its subsidiaries and 9.4 million, or 29.0%, were owned by outside limited partners. The consolidated financial statements of UDR include the noncontrolling interests of the unitholders in the Operating Partnership and DownREIT Partnership.\nHuman Capital Management\n​\nWe strive to attract and retain high-performing talent. As of December 31, 2024, our Company had 1,419 full-time associates and 13 part-time associates, all of whom are dedicated to the success of our organization. Within this workforce, 1,007 associates are focused on roles directly associated with our communities, while the remaining associates contribute to various corporate functions. Our commitment extends to the entire employee lifecycle, encompassing recruitment, onboarding, development, engagement, and retention. Our overarching objective is to enhance the associate experience, foster diversity, and maintain a motivated and committed workforce that fuels our growth and talent retention. This dedication to our UDR culture, values, and behaviors directly influences improved engagement, productivity, and the overall success of our organization.\n \n​\n4\n\n\nTable of Contents\nWe strive to create a culture focused on a philosophy of collaboration, trust, and innovation where every individual feels welcomed, valued, proud, and empowered to do their best work. By prioritizing and enhancing the associate experience, we aim to enhance engagement levels, leading to increased customer satisfaction, higher employee retention, and superior results. We report to our Board of Directors at least annually with respect to our human capital initiatives, including evaluations and analyses.\n \n​\nAssociate Compensation\n \n​\nAttracting, nurturing, and retaining top-tier, diverse talent across our organization is essential to our long-term success. An integral part of this process is our commitment to fair and attractive compensation practices. We continue to utilize general market, as well as industry and geographically specific public compensation data to make informed decisions and adjust our salary ranges accordingly, so we can remain competitive and attract and retain top talent. We seek to stay up to date with the latest trends in the job market in order to provide fair and competitive compensation packages for our associates. Our compensation programs are designed to include performance-driven bonuses. These metrics are presented annually to our executive leadership and our Board of Directors for oversight purposes.\n \n​\nAssociate Growth and Development\n \n​\nWe firmly believe that ongoing development is essential for associate job satisfaction, effectiveness, career progression, and retention. New associates participate in a comprehensive two-day onboarding process that covers our culture, values, mission, and administrative procedures. In 2024, we piloted a new onboarding roadmap to support onboarding new operations associates and decrease time to productivity. In addition, we offer a wide range of training opportunities tailored to individual needs.\n \n​\nThroughout 2024, the talent development team assessed the current training curriculum, audited the quality of existing content, and began documenting opportunities for improvement. As we look to the future, our long-term strategy will focus on UDR-developed content that supports the enhancement of skills and competencies at all levels and emphasizes personalized learning paths, ongoing development opportunities, and career progression. \n​\nDuring 2024, we introduced two digital customer experience service training courses and subsequent leader guides to approximately 1,200 associates to improve overall customer service skills and increase resident satisfaction and loyalty. In addition, more than 450 UDR associates completed a DiSC assessment, which is a personality tool that measures preferences and tendencies, not skill or ability. Finally, in 2024 more than 400 leaders across the Company participated in in-person experiential training, leveraging hands-on learning activities to improve team effectiveness, trust, communication, and collaboration.\n​\nIn total, over 6,000 training courses are available to our associates, spanning topics such as leasing skills, property maintenance, customer service, project management, and leadership development. In 2024, our associates collectively invested 38,225 hours in training, averaging 27 hours per full time associate. By the end of 2024, 90% of associates had completed annual IT security training, fair housing, harassment, workplace violence, diversity and inclusion, and business ethics training.\n \n​\nCertifications play a crucial role in career progression in the apartment industry. We actively encourage our associates to pursue professional certifications that align with their interests and benefit the Company. These certifications range from master's degree programs to certified property manager programs or technical licenses. We offer partial tuition reimbursement to support associates in attaining these certifications. \n \n​\nAdditionally, in 2024, the Company put greater focus on organizational development and succession planning to help ensure UDR has the right talent in the right positions to drive success and growth, as well as business continuity during leadership transitions.\n \n​\nDiversity and Inclusion\n \n​\nWe prioritize respect, fairness, and the promotion of diverse perspectives, which contribute to our Company's growth and success. Our commitment extends to fostering a diverse and inclusive workplace environment that facilitates the development and advancement of all associates.\n \n​\n5\n\n\nTable of Contents\nAs of December 31, 2024, our workforce is comprised of 61% male and 39% female associates, with an ethnic composition of 51% White, 27% Hispanic/Latino, 13% Black, 3% Asian, and 6% Other. Our management team (including resident services managers and more senior job classifications) reflects a gender balance of 59% male and 41% female, with an ethnic breakdown of 60% White and 40% non-White. Over the three-year period ending December 31, 2024, 533 promotions occurred, with 45% of those promoted to resident services manager, director, or more senior job classifications being female and 42% non-White.\n \n​\nOur commitment to promoting diversity and inclusion remains as we strive to create a healthy and diverse work environment and attract candidates from all backgrounds, ethnicities, and genders.\n \n​\nAssociate Engagement and Outreach\n \n​\nThroughout 2024, we listened to our associates through quarterly pulse surveys, and leveraging associate feedback implemented several measures aimed at improving communication, making data-driven decisions, and promoting collaboration between our operations and corporate teams. We will continue to enhance our active listening strategy to drive continuous improvement across our business. \n \n​\nWe believe that our associates should be active in their communities, and we support their efforts. In 2024, we introduced an enhanced volunteer policy that continues to provide associates with up to eight paid hours annually for volunteer activities. Previously, volunteer opportunities were limited to one or two company-sponsored events per year with designated organizations. The updated policy now allows associates the flexibility to volunteer at any time throughout the year with a charitable organization of their choice. Through the policy, UDR provided 1,050 hours of paid time off to associates for volunteer work with over 30 local organizations. We also organized food, clothing, and blood drives, as well as initiatives to promote non-profit organizations and causes, fostering a culture of giving back.\n \n​\nEmployee Health, Wellness and Benefits\n \n​\nThe health, wellness, and safety of our associates are paramount to UDR. We maintain an inclusive culture by prioritizing the well-being of our associates. \n \n​\nIn 2024, we upgraded our Employee Assistance Program (EAP) and increased enrollment by 10%. Our EAP includes counseling services, educational resources, and tools, including workshops and seminars on stress management, nutrition, and well-being for associates, partners, and teen-aged dependents. We also invested in virtual and in-person wellness fairs aimed at providing associates learning opportunities on topics ranging from stress management and mental health to financial fitness. We continue to leverage our Lifestyle Spending Account, which provides associates with $1,000 annually to spend as they choose bolstering associate wellness and satisfaction.\n \n​\nOur commitment to associate benefits is underscored by a third-party benefits survey, conducted in 2024, where 84% of respondents stated they understood their benefits and 64% believed that UDR offered a benefit package that is satisfactory relative to other companies in the industry.\n​\nReporting Segments\nWe report in two segments: \nSame-Store Communities\n and \nNon-Mature Communities/Other\n.\nOur S\name-Store Communities\n segment represents those communities acquired, developed, and stabilized prior to January 1, 2023, and held as of December 31, 2024. These communities were owned and had stabilized occupancy and operating expenses as of the beginning of the prior year, there is no plan to conduct substantial redevelopment activities, and the communities are not classified as held for disposition at year end. A community is considered to have stabilized occupancy once it achieves 90% occupancy for at least three consecutive months.\nOur \nNon-Mature Communities/Other \nsegment represents those communities that do not meet the criteria to be included in \nSame-Store Communities, \nincluding, but not limited to, recently acquired, developed and redeveloped communities, and the non-apartment components of mixed use properties. For additional information regarding our operating segments, see Note 16, \nReportable Segments\n, in the Notes to the UDR Consolidated Financial Statements included in this Report.\n6\n\n\nTable of Contents\nBusiness Objectives \nOur principal business objective is to maximize the economic returns of our apartment communities in a sustainable manner to provide our stockholders with the greatest possible total return and value. To achieve this objective, we intend to continue to pursue the following goals and strategies:\n●\nown and operate a diversified portfolio of apartments in targeted markets in the United States, which are characterized by strong total income growth, high working age population growth, relatively robust rental versus single-family home affordability and favorable demand/supply ratio for multifamily housing, thus enhancing stability and predictability of returns to our stockholders;\n●\nmanage real estate cycles by taking an opportunistic approach to buying, selling, renovating, redeveloping, and developing apartment communities;\n●\nempower our associates to manage our communities efficiently and effectively to improve resident satisfaction;\n●\nmeasure and reward associates based on specific performance targets; and\n●\nmanage our capital structure with the intent of lowering our relative cost of capital to enhance profitability and predictability of liquidity, earnings and dividends.\n2024 Highlights\nCommitment to Shareholders\n●\n \nIn July 2024, the Company marked its 52\nnd\n year as a REIT and, in October 2024, paid its 208\nth\n consecutive quarterly dividend. The Company’s annualized declared 2024 dividend of $1.70 represented a 1.2% increase over the previous year.\nEarnings Results\n·\nNet income attributable to common stockholders was $84.8 million as compared to $439.5 million in the prior year. The primary drivers for the decrease were lower gains from dispositions of real estate as we sold fewer assets in 2024 when compared to the same period in 2023, and lower interest income and other income/(expense) primarily driven by a $37.3 million non-cash loan reserve partially offset by higher notes receivable balances. These were partially offset by higher total net operating income (“NOI”).\n●\nTotal revenues increased 2.7% over the prior year primarily due to overall market rent growth and communities acquired and completion of developments during 2024 and 2023, partially offset by dispositions of real estate in 2024 and 2023.\n·\n \nWe achieved Same-Store revenue growth of 2.3% and Same-Store NOI growth of 1.5%.\nInvesting and Developments\n·\nWe completed the development of two communities located in Tampa, Florida and Addison, Texas, with a total of 415 apartment homes.\n·\nWe recognized a gain of $16.9 million from the sale of an operating community located in Arlington, Virginia.\n·\nWe received distributions totaling $102.4 million from the Company’s unconsolidated joint ventures and partnerships. \n●\nWe contributed $35.0 million to four joint ventures that own and operate four operating communities with a total of 818 apartment homes.\n·\nWe funded an additional $32.2 million to two of our notes receivable investments\n.\n7\n\n\nTable of Contents\nBalance Sheet\n·\nWe issued $300.0 million of 5.125% medium-term notes due September 1, 2034.\n \nThe net proceeds were used to pay down outstanding indebtedness under our commercial paper program.\n·\nWe amended our Revolving Credit Facility to extend the maturity date to August 31, 2028, with two six-month extension options and amended our Term Loan to include a twelve-month extension option.\n·\nWe amended our Working Capital Credit Facility to extend the maturity date from January 12, 2025, to January 12, 2026.\nESG Report \nWe published our 2024 ESG Report on our website, which discloses our environmental and social initiatives, programs, and performance. The report’s ESG disclosures were, to the extent applicable, prepared in accordance with the Global Reporting Initiative (GRI) Standards (core), the Sustainability Accounting Standards Board (SASB) standards, and the Task Force for Climate-related Financial Disclosure (TCFD) framework.\n​\nRefer to Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations,\n for further information on the Company’s activities in 2024.\n​\nOur Strategic Vision \nOur strategic vision is to be the multifamily public REIT of choice for investors. We intend to realize this vision by executing on our strategic objectives, which are:\n1.\nMaintaining a Diversified Portfolio and Allocating Capital to Accretive Investment Opportunities\n2.\nMaintaining a Strong Balance Sheet\n3.\nConsistently Driving Operating Excellence\n4.\nAdvancing a Strong Corporate Culture and Striving for High Resident Satisfaction\nMaintaining a Diversified Portfolio and Allocating Capital to Accretive Investment Opportunities\nWe believe greater portfolio diversification, as defined by geographic concentration, location within a market (i.e., urban or suburban) and property quality (i.e., A or B), reduces the volatility of our same-store growth throughout the real estate cycle, appeals to a wider renter and investor audience, lessens the market risk associated with owning a homogenous portfolio, and provides more opportunities for accretive external growth when appropriate. Diversified characteristics of our portfolio include:\n●\nour consolidated apartment portfolio includes 169 communities located in 21 markets throughout the U.S., including both coastal and sunbelt locations;\n●\nour communities that are located proximate to each other within a market provide enhanced economics; and\n●\nour mix of urban/suburban communities is approximately 30%/70% and our mix of A/B quality properties is approximately 44%/56%.\nWe are focused on increasing our presence in markets with favorable job formation and income growth, high propensity to rent, strong relative affordability for rental versus homeownership, and a favorable demand/supply ratio for multifamily housing. Portfolio investment decisions consider internal analyses and third-party research.\nAcquisitions and Dispositions \nWhen evaluating potential acquisitions, we consider a wide variety of factors, including:\n●\nhigh working age population growth, relatively robust rental versus single-family home affordability, measured long-term new supply growth, overall potential for strong total income growth;\n●\nthe tax and regulatory environment of the market in which the property is located;\n8\n\n\nTable of Contents\n●\ngeographic location, including proximity to jobs, entertainment, transportation, and our existing communities which can deliver significant economies of scale;\n●\nour climate assessments for the market and sub-market in which the property is located;\n●\nconstruction quality, condition, design and sustainability features of, or the potential to implement sustainability initiatives at, the property;\n●\ncurrent and projected cash flow of the property and the ability to increase cash flow;\n●\nability of the property’s projected returns to exceed our cost of capital;\n●\npotential for capital appreciation of the property;\n●\nability to increase the value and profitability of the property through operations and redevelopment;\n●\nterms of resident leases, including the potential for rent increases;\n●\noccupancy and demand by residents for properties of a similar type in the vicinity;\n●\nprospects for liquidity through sale, financing or refinancing of the property; and\n●\ncompetition from existing multifamily communities and the potential for the construction of new multifamily properties in the area.\nWe regularly monitor our assets to increase the quality and performance of our portfolio. Factors we consider in deciding whether to dispose of a property include:\n●\nwhether it is in a market targeted for divestment or a reduction in investment;\n●\ncurrent market price for an asset compared to projected economics for that asset;\n●\npotential increases in new construction in the market area;\n●\nareas with low job growth prospects;\n●\nnear- and long-term capital expenditure needs for the asset; and\n●\noperating efficiencies.\nThe following table summarizes our apartment community acquisitions and dispositions and our consolidated year-end ownership position for the past five years (\ndollars in thousands\n):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\n    \n2022\n    \n2021\n    \n2020\nHomes acquired\n \n​\n 173\n(a)\n​\n 1,889\n​\n​\n 433\n \n​\n 5,426\n \n​\n 1,642\nHomes disposed \n \n​\n 214\n​\n​\n 1,604\n(b)\n​\n 90\n \n​\n 651\n \n​\n 599\nHomes owned at December 31, \n \n​\n 55,696\n \n​\n 55,550\n \n​\n 54,999\n \n​\n 53,229\n \n​\n 48,283\nTotal real estate owned, at cost\n​\n$\n 16,213,363\n​\n$\n 16,023,859\n​\n$\n 15,570,072\n​\n$\n 14,740,803\n​\n$\n 13,071,472\n(a)\nIn January 2024, the Company acquired its joint venture partner’s common equity interest in a 173 apartment home operating community. The community was previously owned by a consolidated joint venture of the Company.\n(b)\nIncludes 1,328 apartment homes from the partial sale of four operating communities to a newly formed joint venture.\nDevelopment Activities\nOur objective in developing a community is to create value while improving the quality of our portfolio. How demographic trends, economic drivers, and multifamily fundamentals and valuations have trended over the long-term \n9\n\n\nTable of Contents\nand our portfolio strategy generally govern our review process on where and when to allocate development capital. At December 31, 2024, the Company was not developing any communities, although the Company was incurring and capitalizing costs directly related to predevelopment activities in preparation of future development commencements. During the year ended December 31, 2024, the Company completed the development of two communities located in Tampa, Florida and Addison, Texas, with a total of 415 apartment homes.\nRedevelopment Activities\nOur objective in redeveloping a community is twofold: we aim to grow rental rates while also producing a higher yielding and more valuable asset through asset quality improvement. During the year ended December 31, 2024, we incurred $51.4 million in major renovations, which included major structural changes and/or architectural revisions to existing buildings. As of December 31, 2024, the Company\n had no communities at which it was conducting substantial redevelopment activities\n.\nJoint Venture and Partnership Activities\nWe have entered into, and may continue in the future to enter into, joint ventures (including limited liability companies or partnerships) through which we own an indirect economic interest of less than 100% of the community or communities owned directly by such joint ventures. Our decision to either hold an apartment community in fee simple or have an indirect interest in the community through a joint venture is based on a variety of factors and considerations, including: (i) the economic and tax terms required by the seller of land or a community; (ii) our desire to diversify our portfolio of communities by market, submarket and product type; (iii) our desire at times to preserve our capital resources to maintain liquidity or balance sheet strength; and (iv) our projections, in some circumstances, that we will achieve higher returns on our invested capital or reduce our risk if a joint venture vehicle is used. Each joint venture agreement is individually negotiated, and our ability to operate and/or dispose of a community in our sole discretion may be limited to varying degrees depending on the terms of the joint venture agreement.\nMaintaining a Strong Balance Sheet\nWe maintain a capital structure that we believe allows us to proactively source potential investment opportunities in the marketplace. We have structured our debt maturity schedule to be able to opportunistically access both secured and unsecured debt markets when appropriate.\nAs part of our plan to finance our activities, we utilize proceeds from debt and equity offerings and refinancings to extend maturities, pay down existing debt, fund development and redevelopment activities, and acquire apartment communities.\nConsistently Driving Operational Excellence\nInvestment in new technologies continues to drive operating efficiencies in our business and helps us to better meet the changing needs of our business and our residents. Our residents can conduct business with us 24 hours a day, 7 days a week, including completing online leasing applications and renewals and submitting maintenance or other requests throughout our portfolio using our web-based resident internet portal or, increasingly, a smart-device application.\nAs a result of transforming our operations through technology, residents’ satisfaction has improved, and our operating teams have become more efficient. Web-based technologies have also resulted in declining marketing and advertising costs, improved cash management, and better pricing management of our available apartment homes.\nAdvancing a Strong Corporate Culture and Ensuring High Resident Satisfaction\nRefer to \nHuman Capital Management\n section above\n,\n for further information on the Company’s corporate culture.\n​\nCompetitive Conditions\nCompetition for new residents is generally intense across our markets. Some competing communities offer amenities that our communities do not have. Competing communities can use rental concessions or lower rents to obtain temporary competitive advantages. Also, some competing communities are larger or newer than our communities. The competitive position of each community is different depending upon many factors, including sub-market supply and \n10\n\n\nTable of Contents\ndemand. In addition, other real estate investors compete with us to acquire existing properties, redevelop existing properties, and to develop new properties. These competitors include insurance companies, pension and investment funds, public and private real estate companies, investment companies and other public and private apartment REITs, some of which may have greater resources, or lower capital costs, than we do.\nWe believe that, in general, we are well-positioned to compete effectively for residents and investments. We believe our competitive advantages include:\n●\na fully integrated organization with property management, development, redevelopment, acquisition, marketing, sales and financing expertise;\n●\nscalable operating and support systems, which include automated systems to meet the changing needs of our residents and to effectively focus on our internet-based marketing efforts;\n●\naccess to diversified sources of capital;\n●\ngeographic diversification with a presence in 21 markets across the country; and\n●\nsignificant presence in many of our major markets that allows us to be a local operating expert.\nMoving forward, we will continue to improve lease management, improve expense control, increase resident retention efforts and align employee incentive plans with metrics that impact our bottom-line performance. We believe this plan of operation, coupled with the portfolio’s strengths in targeting renters across a geographically diverse platform, should position us for continued operational upside.\nCommunities\nAt December 31, 2024, our consolidated real estate portfolio included 169 communities with a total of 55,696 completed apartment homes. The overall quality of our portfolio relative to other properties generally enables us to charge higher rents and to attract residents with higher levels of disposable income who are more likely to absorb such rents.\nAt December 31, 2024, the Company was not developing any communities, although the Company was incurring and capitalizing costs directly related to predevelopment activities in preparation of future development commencements. During the year ended December 31, 2024, the Company completed the development of two communities located in Tampa, Florida and Addison, Texas, with a total of 415 apartment homes.\nAt December 31, 2024, the Company \nhad no communities at which it was conducting substantial redevelopment activities\n.\nSame-Store Community Comparison\nWe believe that one pertinent quantitative measurement of the performance of our portfolio is tracking the results of our \nSame-Store Communities’\n NOI, which is total rental revenue, less rental and other operating expenses excluding property management. Our \nSame-Store Community\n population is comprised of operating communities which we own and have stabilized occupancy, revenues and expenses as of the beginning of the prior year.\nNet income attributable to common stockholders was $84.8 million as compared to $439.5 million in the prior year. The primary drivers for the decrease were lower gains from dispositions of real estate as we sold fewer assets in 2024 when compared to the same period in 2023, and lower interest income and other income/(expense) primarily driven by a $37.3 million non-cash loan reserve partially offset by higher notes receivable balances. These were partially offset by higher total net operating income (“NOI”).\nFor the year ended December 31, 2024, our Same-Store NOI increased by $15.3 million compared to the prior year. Our \nSame-Store Community\n properties provided 92.4% of our total NOI for the year ended December 31, 2024. The increase in NOI for the 51,428 Same-Store apartment homes, or 92.3% of our portfolio, was primarily driven by an increase in market rental rates and an increase in reimbursement, ancillary and fee income, partially offset by higher personnel costs, higher repair and maintenance expense, higher utilities expense, higher administration and marketing costs, and higher real estate tax expense.\n11\n\n\nTable of Contents\nRevenue growth in 2025 may be impacted by adverse developments affecting the general economy, inclusive of economic conditions as a result of a recession, reduced occupancy rates, increased rental concessions, new supply, increased bad debt and other factors which may adversely impact our ability to increase rents.\nTax Matters\nUDR has elected to be taxed as a REIT under the Code. To continue to qualify as a REIT, UDR must continue to meet certain tests that, among other things, generally require that our assets consist primarily of real estate assets, our income be derived primarily from real estate assets, and that we distribute at least 90% of our REIT taxable income (other than net capital gains) to our stockholders annually. Provided we maintain our qualification as a REIT, we generally will not be subject to U.S. federal income taxes at the corporate level on our net income to the extent such net income is distributed to our stockholders annually. Even if we continue to qualify as a REIT, we will continue to be subject to certain federal, state and local taxes on our income and property.\nWe may utilize our taxable REIT subsidiary (“TRS”) to engage in activities that REITs may be prohibited from performing, including the provision of management and other services to third parties and the conduct of certain nonqualifying real estate transactions. Our TRS generally is taxable as a regular corporation, and therefore, subject to federal, state and local income taxes.\nInflation\nInflation primarily impacts our results of operations as a result of wage pressures and increases in utilities and repair and maintenance costs. In addition, inflation could also impact our general and administrative expenses, the interest on our debt if variable or refinanced in a high-inflationary environment, our cost of capital, and our cost of development, redevelopment, maintenance or other operating activities. However, the majority of our apartment leases have initial terms of 12 months or less, which in an inflationary environment, and absent other factors such as increased supply, generally enables us to compensate for inflationary effects by increasing rents on our apartment homes. Although an extreme or sustained escalation in costs could have a negative impact on our residents and their ability to absorb rent increases, we do not believe this had a material impact on our results for the year ended December 31, 2024\n.\nEnvironmental Matters\nVarious environmental laws govern certain aspects of the ongoing operation of our communities. Such environmental laws include those regulating the existence of asbestos-containing materials in buildings, management of surfaces with lead-based paint (and notices to residents about the lead-based paint), use of active underground petroleum storage tanks, and waste-management activities. The failure to comply with such requirements could subject us to a government enforcement action and/or claims for damages by a private party.\nTo date, compliance with federal, state and local environmental protection regulations has not had a material effect on our capital expenditures, earnings or competitive position. We have a property management plan for hazardous materials. As part of the plan, Phase I environmental site investigations and reports have been completed for each property we acquire. In addition, all proposed acquisitions are inspected prior to acquisition. The inspections are conducted by qualified environmental consultants, and we review the issued report prior to the purchase or development of any property. Nevertheless, it is possible that the environmental assessments will not reveal all environmental liabilities, or that some material environmental liabilities exist of which we are unaware. In some cases, we have abandoned otherwise economically attractive acquisitions because the costs of removal or control of hazardous materials have been prohibitive or we have been unwilling to accept the potential risks involved. We do not believe we will be required to engage in any large-scale abatement at any of our properties. We believe that through professional environmental inspections and testing for asbestos, lead paint and other hazardous materials, coupled with a relatively conservative posture toward accepting known environmental risk, we can minimize our exposure to potential liability associated with environmental hazards.\nFederal legislation requires owners and landlords of residential housing constructed prior to 1978 to disclose to potential residents or purchasers of the communities any known lead paint hazards and imposes treble damages for failure to provide such notification. In addition, lead based paint in any of the communities may result in lead poisoning in children residing in that community if chips or particles of such lead based paint are ingested, and we may be held liable under state laws for any such injuries caused by ingestion of lead based paint by children living at the communities.\n12\n\n\nTable of Contents\nWe are unaware of any environmental hazards at any of our properties that individually or in the aggregate may have a material adverse impact on our operations or financial position. We have not been notified by any governmental authority, and we are not otherwise aware, of any material non-compliance, liability, or claim relating to environmental liabilities in connection with any of our properties. We do not believe that the cost of continued compliance with applicable environmental laws and regulations will have a material adverse effect on us or our financial condition or results of operations. Future environmental laws, regulations, or ordinances, however, may require additional remediation of existing conditions that are not currently actionable. Also, if more stringent requirements are imposed on us in the future, the costs of compliance could have a material adverse effect on our results of operations and our financial condition.\nInsurance\nWe carry comprehensive general liability coverage on our communities, with limits of liability we believe to be customary within the multi-family apartment industry to insure against liability claims and related defense costs. We are also insured, with limits of liability we believe to be customary within the multi-family apartment industry, against the risk of direct physical damage on a replacement cost basis, including loss of rental income during the reconstruction period.\nSupplemental U.S. Federal Income Tax Considerations\n​\nThe following discussion supplements and updates the disclosures under “Material U.S. Federal Income Tax Consequences” in the prospectus dated February 14, 2023, contained in our Registration Statement on Form S-3 filed with the SEC on February 14, 2023. Capitalized terms herein that are not otherwise defined shall have the same meaning as when used in such disclosures.\n​\n●\nThe second bullet in the second paragraph under the heading “Taxation of UDR - Income Tests” is clarified to acknowledge an exception to the related party tenant test for a tenant that is a taxable REIT subsidiary and either (i) at least 90% of the total leased space of the property is leased to unrelated tenants and the rent paid by the taxable REIT subsidiary is substantially comparable to the rent paid by the unrelated tenants for comparable space, or (ii) the property leased to the taxable REIT subsidiary is a lodging facility or a health care facility and certain other requirements are satisfied.\n●\nT\nhe third prong of the definition of “hedging transaction” in the fourth paragraph under the heading “Taxation of UDR - Income Tests” is hereby clarified to establish that in order to qualify as a “hedging transaction” that will be excluded from gross income for purposes of the 75% and 95% gross income tests, a new transaction entered into to hedge the income or loss from prior hedging transactions where the property or indebtedness which was the subject of the prior hedging transaction was extinguished or disposed of must be clearly identified as specified in Treasury regulations before the close of the day on which it was acquired, originated, or entered into.\n●\nThe penultimate paragraph under the heading “Taxation of UDR - Asset Tests” is clarified to acknowledge that the cure provision for de minimis violations applies to violations of the 5% asset test as well.\n●\nThe second sentence of the third paragraph under the heading “Taxation of Stockholders - Taxation of Non-U.S. Stockholders - Capital Gains Dividends” and the entirety of the fourth paragraph under the heading “Taxation of Stockholders - Taxation of Non-U.S. Stockholders - Dispositions of UDR Stock” are hereby clarified to establish that the exemption from FIRPTA for a “qualified foreign pension fund” also may apply to a “qualified controlled entity,” but in each case only if the qualified foreign pension fund or qualified controlled entity satisfies certain requirements to be a “qualified holder.” Moreover, Treasury regulations provide that a foreign partnership of which all of the interests are held by qualified holders, including through one or more partnerships, may certify its status as such and will generally not be treated as a non-U.S. person for purposes of withholding under FIRPTA.\n●\nThe second and third sentences of first paragraph under the heading “Taxation of Stockholders -Taxation of Tax-Exempt Stockholders” are hereby clarified to establish that dividend distributions from a REIT to a U.S. tax-exempt entity generally should not give rise to UBTI unless, (i) the tax-exempt entity hold its shares in the REIT as “debt-financed property,” or (ii) the tax-exempt entity is a “qualified trust” that holds more than 10% by value of the interests in the REIT and the REIT is a “pension-held REIT.” Additionally, income from the sale of our stock generally shall not give rise to UBTI unless the tax-exempt entity holds \n13\n\n\nTable of Contents\nour stock as (i) “debt-financed property” or (ii) inventory or property held primarily for sale to customers in the ordinary course of a trade or business.\n●\nThe second paragraph under the heading “Taxation of Stockholders - Taxation of Tax-Exempt Stockholders” is hereby revised to apply to just tax-exempt stockholders that are exempt from U.S. federal income taxation under Sections 501(c) (7), (c)(9) and (c)(17) of the Code.\nAvailable Information\nWe file electronically with the Securities and Exchange Commission our annual reports on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K, pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934. You may obtain a free copy of our annual reports on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K, and amendments to those reports on the day of filing with the SEC on our website at \nwww.udr.com\n, or by sending an e-mail message to \nir@udr.com.\n​\n14\n\n\nTable of Contents",
  "item7": "Item 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with the consolidated financial statements appearing elsewhere herein and is based primarily on the consolidated financial statements for the years ended December 31, 2024, and 2023.\nThis section of this Form 10-K generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023 of UDR, Inc. Discussions of 2022 items and year-to-year comparisons between 2023 and 2022 that are not included in this Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023.\nBusiness Overview\nWe are a self-administered real estate investment trust, or REIT, that owns, operates, acquires, renovates, develops, redevelops, disposes of, and manages multifamily apartment communities in targeted markets located in the United States. We were formed in 1972 as a Virginia corporation. In June 2003, we changed our state of incorporation from Virginia to Maryland. Our subsidiaries include the Operating Partnership and the DownREIT Partnership. Unless the context otherwise requires, all references in this Report to “we,” “us,” “our,” “the Company,” or “UDR” refer collectively to UDR, Inc., its consolidated subsidiaries and its consolidated joint ventures.\nAt December 31, 2024, our consolidated real estate portfolio included 169 communities in 13 states plus the District of Columbia totaling 55,696 apartment homes. In addition, we have an ownership interest in 10,860 completed or to-be-completed apartment homes through unconsolidated joint ventures or partnerships, including 6,436 apartment homes owned by entities in which we hold preferred equity investments. The \nSame-Store Community \napartment home population for the year ended December 31, 2024, was 51,428.\nCritical Accounting Policies and Estimates \nThe preparation of financial statements in conformity with United States generally accepted accounting principles (“GAAP”) requires management to use judgment in the application of accounting policies, including making estimates and assumptions. A critical accounting policy is one that is both important to our financial condition and results of operations as well as involves some degree of uncertainty. Estimates are prepared based on management’s assessment after considering all evidence available. Changes in estimates could affect our financial position or results of operations. Below is a discussion of the accounting policies that we consider critical to understanding our financial condition or results of operations where there is uncertainty or where significant judgment is required. A discussion of our significant accounting policies, including further discussion of the accounting policies described below, can be found in Note 2, \nSignificant Accounting Policies\n, to the Notes to the UDR, Inc. Consolidated Financial Statements included in this Report.\nCost Capitalization\nIn conformity with GAAP, we capitalize those expenditures that materially enhance the value of an existing asset or substantially extend the useful life of an existing asset. Expenditures necessary to maintain an existing property in ordinary operating condition are expensed as incurred.\nIn addition to construction costs, we capitalize costs directly related to the predevelopment, development, and redevelopment of a capital project, which include, but are not limited to, interest, real estate taxes, insurance, and allocated development and redevelopment overhead related to support costs for personnel working on the capital projects. We use our professional judgment in determining whether such costs meet the criteria for capitalization or must be expensed as incurred. These costs are capitalized only during the period in which activities necessary to ready an asset for its intended use are in progress and such costs are incremental and identifiable to a specific activity to get the asset ready for its intended use. As each home in a capital project is completed and becomes available for lease-up, the Company ceases capitalization on the related portion. The costs capitalized are reported on the Consolidated Balance Sheets as \nTotal real estate owned, net of accumulated depreciation.\n Amounts capitalized during the years ended December 31, 2024, 2023, and 2022 were $24.4 million, $23.2 million, and $31.3 million, respectively.\n39\n\n\nTable of Contents\nInvestment in Unconsolidated Entities\nWe may enter into various joint venture agreements and/or partnerships with unrelated third parties to hold or develop real estate assets. We must determine for each of these ventures whether to consolidate the entity or account for our investment under the equity method of accounting. We determine whether to consolidate a joint venture or partnership based on our rights and obligations under the venture agreement, applying the applicable accounting guidance. The application of the rules in evaluating the accounting treatment for each joint venture or partnership is complex and requires substantial management judgment. We evaluate our accounting for investments on a regular basis including when a significant change in the design of an entity occurs. Throughout our financial statements, and in this Management’s Discussion and Analysis of Financial Condition and Results of Operations, we use the term “joint venture” or “partnership” when referring to investments in entities in which we do not have a 100% ownership interest.\nWe continually evaluate our investments in unconsolidated joint ventures when events or changes in circumstances indicate that there may be an other-than-temporary decline in value. We consider various factors to determine if a decrease in the value of the investment is other-than-temporary. These factors include, but are not limited to, age of the venture, our intent and ability to retain our investment in the entity, the financial condition and long-term prospects of the entity, and the relationships with the other joint venture partners and its lenders. The amount of loss recognized is the excess of the investment’s carrying amount over its estimated fair value. If we believe that the decline in fair value is temporary, no impairment is recorded. The aforementioned factors are taken as a whole by management in determining the valuation of our investment property. Should the actual results differ from management’s judgment, the valuation could be negatively affected and may result in a negative impact to our Consolidated Financial Statements.\nImpairment of Long-Lived Assets\nQuarterly or when changes in circumstances warrant, we will assess our real estate properties for indicators\nof impairment. The judgments regarding the existence of impairment indicators are based on certain factors.  Such factors include, among other things, operational performance, market conditions, the Company’s intent and ability to hold the related asset, as well as any significant cost overruns on development properties.\n​\nIf a real estate property has indicators of impairment, we assess whether the long-lived asset’s carrying value exceeds the community’s undiscounted future cash flows, which is representative of projected net operating income (“NOI”) plus the residual value of the community. Our future cash flow estimates are based upon historical results adjusted to reflect our best estimate of future market and operating conditions and our estimated holding periods. If such indicators of impairment are present and the carrying value exceeds the undiscounted cash flows of the community, an impairment loss is recognized equal to the excess of the carrying amount of the asset over its estimated fair value. Our estimates of fair value represent our best estimate based primarily upon unobservable inputs related to rental rates, operating costs, growth rates, discount rates, capitalization rates, industry trends and reference to market rates and transactions.\nFor long-lived assets to be disposed of, impairment losses are recognized when the fair value of the asset less estimated cost to sell is less than the carrying value of the asset. Properties classified as real estate held for disposition generally represent properties that are actively marketed or contracted for sale with the closing expected to occur within the next twelve months. Real estate held for disposition is carried at the lower of cost, net of accumulated depreciation, or fair value, less the cost to sell, determined on an asset-by-asset basis. Expenditures for ordinary repair and maintenance costs on held for disposition properties are charged to expense as incurred. Expenditures for improvements, renovations, and replacements related to held for disposition properties are capitalized at cost. Depreciation is not recorded on real estate held for disposition.\nReal Estate Investment Properties\nWe purchase real estate investment properties from time to time and record the fair value to various components, such as land, buildings, and intangibles related to in-place leases, based on the fair value of each component. In making estimates of fair values for purposes of allocating purchase price, we utilize various sources, including independent appraisals, our own analysis of recently acquired and existing comparable properties in our portfolio and other market data. The fair value of buildings is determined as if the buildings were vacant upon acquisition and subsequently leased at market rental rates. As such, the determination of fair value considers the present value of all cash flows expected to be generated from the property including an initial lease-up period. We determine the fair value of in-place leases by assessing the net effective rent and remaining term of the lease relative to market terms for similar leases at acquisition. In addition, we consider the cost of acquiring similar leases, the foregone rents \n40\n\n\nTable of Contents\nassociated with the lease-up period, and the carrying costs associated with the lease-up period. The fair value of in-place leases is recorded and amortized as amortization expense over the remaining average contractual lease period.\nREIT Status\nWe are a Maryland corporation that has elected to be treated for federal income tax purposes as a REIT. A REIT is a legal entity that holds interests in real estate and is required by the Code to meet a number of organizational and operational requirements, including a requirement that a REIT must distribute at least 90% of our REIT taxable income (other than our net capital gain) to our stockholders. If we were to fail to qualify as a REIT in any taxable year, we will be subject to federal and state income taxes at the regular corporate rates and may not be able to qualify as a REIT for four years. Based on the net earnings reported for the year ended December 31, 2024 in our Consolidated Statements of Operations, we would have incurred federal and state GAAP income taxes if we had failed to qualify as a REIT.\n41\n\n\nTable of Contents\nSummary of Real Estate Portfolio by Geographic Market\nThe following table summarizes our market information by major geographic markets as of and for the year ended December 31, 2024:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, 2024\n​\nYear Ended December 31, 2024\n​\n  \n​\n  \n​\n  \nPercentage\n  \nTotal\n  \nWeighted\n  \nMonthly\n    \nNet\n​\n​\nNumber of\n​\nNumber of\n​\nof Total \n​\nCarrying\n​\nAverage\n​\nIncome per \n​\nOperating\n​\n​\nApartment\n​\nApartment\n​\nCarrying\n​\nValue (in\n​\nPhysical\n​\nOccupied\n​\nIncome\nSame-Store Communities\n​\nCommunities\n​\nHomes\n​\nValue\n​\nthousands)\n​\nOccupancy\n​\nHome (a)\n​\n(in thousands)\nWest Region\n \n  \n \n  \n \n  \n \n​\n  \n \n  \n \n​\n  \n \n​\n  \nOrange County, CA\n \n 8\n \n 4,305\n \n 8.6\n% \n$\n 1,389,752\n \n 96.7\n% \n$\n 3,094\n​\n$\n 121,009\nSan Francisco, CA\n \n 11\n \n 2,781\n \n 5.8\n% \n​\n 941,178\n \n 97.0\n% \n​\n 3,555\n​\n​\n 80,841\nSeattle, WA\n \n 14\n \n 2,702\n \n 6.9\n%\n \n 1,120,396\n \n 97.1\n%\n \n 2,870\n​\n \n 65,293\nMonterey Peninsula, CA\n \n 7\n \n 1,567\n \n 1.3\n%\n \n 203,748\n \n 96.1\n%\n \n 2,408\n​\n \n 33,530\nLos Angeles, CA\n \n 4\n \n 1,225\n \n 3.0\n%\n \n 490,674\n \n 96.1\n%\n \n 3,227\n​\n \n 32,667\nOther Southern California\n \n 3\n \n 821\n \n 1.4\n%\n \n 228,141\n \n 96.6\n%\n \n 2,940\n​\n \n 20,450\nPortland, OR\n \n 2\n \n 476\n \n 0.4\n%\n \n 57,633\n \n 97.0\n%\n \n 1,992\n​\n \n 7,944\nMid-Atlantic Region\n \n  \n \n  \n \n​\n​\n \n  \n \n  \n​\n \n  \n​\n \n  \nMetropolitan D.C.\n \n 23\n \n 8,819\n \n 15.5\n%\n \n 2,510,001\n \n 97.2\n%\n \n 2,389\n​\n \n 168,092\nBaltimore, MD\n \n 7\n \n 2,219\n \n 3.5\n%\n \n 574,442\n \n 96.2\n%\n \n 1,952\n​\n \n 33,401\nRichmond, VA\n \n 4\n \n 1,359\n \n 1.1\n%\n \n 173,749\n \n 96.9\n%\n \n 1,878\n​\n \n 22,389\nNortheast Region\n \n  \n \n  \n \n​\n​\n \n  \n \n  \n​\n \n  \n​\n \n  \nBoston, MA\n \n 12\n \n 4,667\n \n 12.1\n%\n \n 1,969,347\n \n 96.6\n%\n \n 3,228\n​\n \n 124,169\nNew York, NY\n \n 4\n \n 1,945\n \n 8.5\n%\n \n 1,376,237\n \n 97.6\n%\n \n 4,983\n​\n \n 61,798\nPhiladelphia, PA\n​\n 3\n​\n 972\n​\n 2.3\n%\n​\n 375,227\n​\n 96.7\n%\n​\n 2,549\n​\n​\n 19,552\nSoutheast Region\n \n  \n \n  \n \n​\n​\n \n  \n \n  \n​\n \n  \n​\n \n  \nTampa, FL\n \n 11\n \n 3,877\n \n 4.3\n%\n \n 693,272\n \n 96.6\n%\n \n 2,143\n​\n \n 63,340\nOrlando, FL\n \n 11\n \n 3,493\n \n 3.5\n%\n \n 574,688\n \n 96.6\n%\n \n 1,918\n​\n \n 53,451\nNashville, TN\n \n 8\n \n 2,261\n \n 1.7\n%\n \n 270,404\n \n 96.6\n%\n \n 1,753\n​\n \n 33,127\nOther Florida\n \n 1\n \n 636\n \n 0.6\n%\n \n 96,996\n \n 97.2\n%\n \n 2,382\n​\n \n 12,298\nSouthwest Region\n \n  \n \n  \n \n​\n​\n \n  \n \n  \n​\n \n  \n​\n \n  \nDallas, TX\n \n 14\n \n 5,813\n \n 6.2\n%\n \n 1,002,564\n \n 96.5\n%\n \n 1,775\n​\n \n 75,522\nAustin, TX\n \n 4\n \n 1,272\n \n 1.2\n%\n \n 197,458\n \n 96.8\n%\n \n 1,911\n​\n \n 16,785\nDenver, CO\n​\n 1\n​\n 218\n​\n 0.9\n%\n​\n 148,877\n​\n 96.7\n%\n​\n 3,646\n​\n​\n 6,730\nTotal/Average Same-Store Communities\n \n 152\n \n 51,428\n \n 88.8\n%\n \n 14,394,784\n \n 96.8\n%\n$\n 2,554\n​\n \n 1,052,388\nNon-Mature, Commercial Properties & Other\n \n 15\n \n 3,895\n \n 9.9\n%\n \n 1,600,010\n \n  \n​\n \n  \n​\n \n 74,201\nTotal Real Estate Held for Investment\n \n 167\n \n 55,323\n \n 98.7\n%\n \n 15,994,794\n \n  \n​\n \n  \n​\n \n 1,126,589\nReal Estate Held for Disposition (b)\n \n 2\n \n 373\n \n 1.3\n%\n \n 218,569\n \n  \n​\n \n  \n​\n \n 12,234\nTotal Real Estate Owned\n \n 169\n \n 55,696\n \n 100.0\n%\n \n 16,213,363\n \n  \n​\n \n  \n​\n$\n 1,138,823\nTotal Accumulated Depreciation\n \n  \n \n  \n \n  \n​\n \n (6,901,026)\n \n  \n​\n \n  \n​\n \n  \nTotal Real Estate Owned, Net of Accumulated Depreciation\n \n  \n \n  \n \n  \n​\n$\n 9,312,337\n \n  \n​\n \n  \n​\n \n  \n(a)\nMonthly Income per Occupied Home represents total monthly revenues divided by the average physical number of occupied apartment homes in our Same-Store portfolio.\n(b)\nThe Company had two communities located in Brooklyn, New York and Englewood, New Jersey that met the criteria to be classified as held for disposition at December 31, 2024.\nWe report in two segments: \nSame-Store Communities\n and \nNon-Mature Communities/Other\n.\nOur \nSame-Store Communities\n segment represents those communities acquired, developed, and stabilized prior to January 1, 2023 and held as of December 31, 2024. These communities were owned and had stabilized occupancy and operating expenses as of the beginning of the prior year, there is no plan to conduct substantial redevelopment activities, and the communities are not classified as held for disposition at year end. A community is considered to have stabilized occupancy once it achieves 90% occupancy for at least three consecutive months.\nOur \nNon-Mature Communities/Other \nsegment represents those communities that do not meet the criteria to be included in \nSame-Store Communities, \nincluding, but not limited to, recently acquired, developed and redeveloped communities, and the non-apartment components of mixed use properties.\n42\n\n\nTable of Contents\nLiquidity and Capital Resources\nLiquidity is the ability to meet present and future financial obligations either through operating cash flows, sales of properties, borrowings under our credit agreements, and/or the issuance of debt and/or equity securities. Our primary source of liquidity is our cash flow from operations, as determined by rental rates, occupancy levels, and operating expenses related to our portfolio of apartment homes, and borrowings under our credit agreements. We routinely use our working capital credit facility, our unsecured revolving credit facility and issuances of commercial paper to temporarily fund certain investing and financing activities prior to arranging for longer-term financing or the issuance of equity or debt securities. During the past several years, proceeds from the sale of real estate have been used for both investing and financing activities as we continue to execute on maintaining a diversified portfolio.\nWe expect to meet our short-term liquidity requirements generally through net cash provided by property operations and borrowings under our credit agreements and our unsecured commercial paper program. We expect to meet certain long-term liquidity requirements such as scheduled debt maturities, the repayment of financing on development activities, and potential property acquisitions, through net cash provided by property operations, secured and unsecured borrowings, the issuance of debt or equity securities, and/or the disposition of properties. We believe that our net cash provided by property operations and borrowings under our credit agreements and our unsecured commercial paper program will continue to be adequate to meet both operating requirements and the payment of dividends by the Company in accordance with REIT requirements. Likewise, the budgeted expenditures for improvements and renovations of certain properties are expected to be funded from property operations, borrowings under credit agreements, the issuance of debt or equity securities, and/or dispositions of properties.\nWe have a shelf registration statement filed with the Securities and Exchange Commission, or “SEC,” which provides for the issuance of common stock, preferred stock, depositary shares, debt securities, guarantees of debt securities, warrants, subscription rights, purchase contracts and units to facilitate future financing activities in the public capital markets. Access to capital markets is dependent on market conditions at the time of issuance.\nIn July 2021, the Company entered into an ATM sales agreement under which the Company may offer and sell up to 20.0 million shares of its common stock, from time to time, to or through its sales agents and may enter into separate forward sales agreements to or through its forward purchasers. Upon entering into the ATM sales agreement, the Company simultaneously terminated the sales agreement for its prior at-the-market equity offering program, which was entered into in July 2017. During the year ended December 31, 2024 the Company did not sell any shares of common stock through its ATM program. As of December 31, 2024, we had 14.0 million shares of common stock available for future issuance under the ATM program.\nIn connection with any forward sales agreement under the Company’s ATM program, the relevant forward purchasers will borrow from third parties and, through the relevant sales agent, acting in its role as forward seller, sell a number of shares of the Company’s common stock equal to the number of shares underlying the agreement. The Company does not initially receive any proceeds from any sale of borrowed shares by the forward seller.\n​\nIn August 2024, the Company issued $300.0 million of 5.125% senior medium-term notes due September 1, 2034. Interest is payable semi-annually in arrears on March 1 and September 1 of each year, beginning on March 1, 2025. The notes were priced at 98.977% of the principal amount of the notes. The Company used the net proceeds to pay down outstanding indebtedness under its commercial paper program. The Company entered into and settled treasury lock arrangements to hedge against all interest rate risk of the debt. The all-in weighted average interest rate, inclusive of the impact of the treasury locks, was 4.95%.\n​\nThe Company has a $1.3 billion unsecured revolving credit facility (the “Revolving Credit Facility”) and a $350.0 million unsecured term loan (the “Term Loan”). The credit agreement for these facilities (as amended, the “Credit Agreement”) allows the total commitments under the Revolving Credit Facility and the total borrowings under the Term Loan to be increased to an aggregate maximum amount of up to $2.5 billion, subject to certain conditions, including obtaining commitments from one or more lenders. In August 2024, the Company amended the Revolving Credit Facility to extend the maturity date to August 31, 2028, with two six-month extension options. The Revolving Credit Facility was previously set to mature on January 31, 2026, with two six-month extension options, subject to certain conditions. The Term Loan has a scheduled maturity date of January 31, 2027. In August 2024, the Company amended the Term Loan to include a twelve-month extension option, subject to certain conditions.\n​\n43\n\n\nTable of Contents\nFuture Capital Needs\nFuture development and redevelopment expenditures may be funded through unsecured or secured credit facilities, unsecured commercial paper, proceeds from the issuance of equity or debt securities, sales of properties, joint ventures, and, to a lesser extent, from cash flows provided by property operations. Acquisition activity in strategic markets may be funded through joint ventures, by the reinvestment of proceeds from the sale of properties, through the issuance of equity or debt securities, the issuance of operating partnership units and the assumption or placement of secured and/or unsecured debt.\nDuring 2025, we have approximately $178.3 million of secured debt maturing, inclusive of principal amortization, and $289.9 million of unsecured debt maturing. We anticipate repaying the debt due in 2025 with cash flow from our operations, proceeds from debt or equity offerings, proceeds from dispositions of properties, or from borrowings under our credit agreements and our unsecured commercial paper program.\nThe following table summarizes our material cash requirements as of December 31, 2024 \n(dollars in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPayments Due by Period\nMaterial Cash Requirements\n    \n2025\n    \n2026-2027\n    \n2028-2029\n    \nThereafter\n    \nTotal\nLong-term debt obligations\n​\n$\n 468,223\n​\n$\n 1,022,972\n​\n$\n 1,082,337\n​\n$\n 3,268,526\n​\n$\n 5,842,058\nInterest on debt obligations (a)\n​\n \n 179,089\n​\n \n 315,748\n​\n \n 230,097\n​\n \n 216,919\n​\n \n 941,853\nLetters of credit\n​\n \n 3,289\n​\n \n 76\n​\n \n —\n​\n \n —\n​\n \n 3,365\nOperating lease obligations:\n​\n \n  \n​\n \n  \n​\n \n  \n​\n \n  \n​\n \n  \nGround leases (b)\n​\n \n 12,442\n​\n \n 24,884\n​\n \n 24,884\n​\n \n 393,010\n​\n \n 455,220\n​\n​\n$\n 663,043\n​\n$\n 1,363,680\n​\n$\n 1,337,318\n​\n$\n 3,878,455\n​\n$\n 7,242,496\n(a)\nInterest payments on variable rate debt instruments are based on each debt instrument’s respective year-end interest rate at December 31, 2024.\n(b)\nFor purposes of our ground lease contracts, the Company uses the minimum lease payment, if stated in the agreement. For ground lease agreements where there is a rent reset provision based on fair market value or changes in the consumer price index but does not include a specified minimum lease payment, the Company uses the current rent over the remainder of the lease term. \nDuring 2024, we incurred gross interest costs of $205.0 million, of which $9.3 million was capitalized.\n​\nWe do not have any off-balance sheet arrangements that have, or are reasonably likely to have, a current or future effect on our financial condition, changes in financial condition, revenue or expenses, results of operations, liquidity, capital expenditures or capital resources that are material.\n​\nGuarantor Subsidiary Summarized Financial Information\n​\nUDR has certain outstanding debt securities that are guaranteed by the Operating Partnership. With respect to this debt, as further outlined below, the Operating Partnership fully and unconditionally guarantees payment of any principal, premium and interest in full to the holders thereof. The Operating Partnership is a subsidiary of UDR, through which UDR conducts a significant portion of its business and holds a substantial amount of its assets. UDR also conducts business through other subsidiaries, including its taxable REIT subsidiaries. In addition to its ownership interest in the Operating Partnership, UDR holds interests in subsidiaries and joint ventures, owns and operates properties, issues securities from time to time and guarantees debt of certain of its subsidiaries. UDR\n, as the sole general partner of the Operating Partnership, owns 100 percent of the Operating Partnership’s general partnership interests and approximately 95 percent of its limited partnership interests and, by virtue thereof, has the ability to control all of the day-to-day operations of the Operating Partnership. UDR has concluded that it is the primary beneficiary of, and therefore consolidates, the Operating Partnership.\n​\nThe Operating Partnership is the subsidiary guarantor of certain of our registered debt securities, including the $300 million of medium-term notes due September 2026, $300 million of medium-term notes due July 2027, $300 million of medium-term notes due January 2028, $300 million of medium-term notes due January 2029, $600 million of medium-term notes due January 2030, $600 million of medium-term notes due August 2031, $400 million of medium-term notes due August 2032, $350 million of medium-term notes due March 2033, $300 million of medium-term notes \n44\n\n\nTable of Contents\ndue in June 2033, $300 million of medium-term notes due September 2034 and $300 million of medium-term notes due November 2034. \n​\nThe Operating Partnership fully and unconditionally guarantees payment of any principal, premium and interest in full to the holders of the notes described above. The guarantee forms part of the indenture under which the notes were issued. If, for any reason, we do not make any required payment in respect of the notes when due, the Operating Partnership will cause the payment to be made to, or to the order of, the applicable paying agent on behalf of the trustee. Holders of the notes may enforce their rights under the guarantee directly against the Operating Partnership without first making a demand or taking action against UDR or any other person or entity. The Operating Partnership may, without the consent of the holders of the notes, assume all of our rights and obligations under the notes and, upon such assumption, we will be released from our liabilities under the indenture and the notes.\n​\nThe notes are UDR’s unsecured general obligations and rank equally with all of UDR’s other unsecured and unsubordinated indebtedness outstanding from time to time. As a result, our payment of amounts due on the notes is subordinated to all of our existing and future secured obligations to the extent of the value of the collateral pledged toward any such secured obligation. Our payment of amounts due on the notes also is effectively subordinated to all liabilities, whether secured or unsecured, of any of our non-guarantor subsidiaries because, in the event of a bankruptcy, liquidation, dissolution, reorganization or similar proceeding with respect to such subsidiaries, we, as an equity holder of such subsidiaries, would not receive distributions from such subsidiaries until claims of any creditors of such subsidiaries are satisfied.\n​\nThe following tables present the summarized financial information for the Operating Partnership as of December 31, 2024 and 2023, and for the years ended December 31, 2024, 2023, and 2022. The information presented below excludes eliminations necessary to arrive at the information on a consolidated basis (dollars in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\nDecember 31, \n​\nDecember 31, \n​\n    \n2024\n    \n2023\nTotal real estate, net\n \n$\n 2,562,075\n \n$\n 2,629,267\nCash and cash equivalents\n​\n \n —\n​\n \n 5\nOperating lease right-of-use assets\n​\n \n 187,886\n​\n \n 191,673\nOther assets\n​\n \n 47,907\n​\n \n 75,464\nTotal assets\n \n$\n 2,797,868\n \n$\n 2,896,409\n​\n​\n​\n​\n​\n​\n​\nSecured debt, net\n​\n$\n 377,724\n​\n$\n 377,262\nNotes payable to UDR (a)\n​\n​\n 1,429,849\n​\n​\n 1,298,903\nOperating lease liabilities\n​\n​\n 183,215\n​\n​\n 186,939\nOther liabilities\n​\n \n 139,910\n​\n \n 133,595\nTotal liabilities\n​\n \n 2,130,698\n​\n \n 1,996,699\nTotal capital\n​\n$\n 667,170\n​\n$\n 899,710\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended \n​\n​\nDecember 31, \n​\n    \n2024\n    \n2023\n​\n2022\nTotal revenue\n​\n$\n 600,425\n \n$\n 561,441\n​\n$\n 511,560\nProperty operating expenses\n​\n \n (271,781)\n​\n \n (243,842)\n​\n \n (217,048)\nReal estate depreciation and amortization\n​\n \n (187,821)\n​\n \n (166,744)\n​\n \n (155,451)\nOperating income/(loss)\n​\n \n 140,823\n​\n \n 150,855\n​\n \n 139,061\nInterest expense (a)\n​\n \n (69,933)\n​\n \n (55,729)\n​\n \n (37,792)\nOther income/(loss)\n​\n \n 6,595\n​\n \n 6,231\n​\n \n (3,589)\nNet income/(loss)\n​\n$\n 77,485\n \n$\n 101,357\n \n$\n 97,680\n45\n\n\nTable of Contents\n(a)\nAll $1.4 billion and $1.3 billion notes payable to UDR as of December 31, 2024 and 2023, respectively, and $53.6 million, $47.2 million and $35.7 million of interest expense on notes payable to UDR for the years ended December 31, 2024, 2023, and 2022, respectively, eliminate upon consolidation of UDR’s consolidated financial statements.\n​\nStatements of Cash Flows\nThe following discussion explains the changes in \nNet cash provided by/(used in) operating activities\n, \nNet cash provided by/(used in) investing activities\n, and \nNet cash provided by/(used in) financing activities\n that are presented in our Consolidated Statements of Cash Flows for the years ended December 31, 2024 and 2023.\nOperating Activities\nFor the year ended December 31, 2024, our \nNet cash provided by/(used in) operating activities\n was $876.8 million compared to $832.7 million for 2023. The \nincrease in cash flow from \noperating activities was primarily due to an increase in net operating income (“NOI”), primarily driven by \nhigher revenue per occupied home, an increase in weighted average physical occupancy, NOI from additional operating communities, and an increase in operating distributions from our unconsolidated joint ventures, partially offset by higher borrowing costs\n.\nInvesting Activities\nFor the year ended December 31, 2024, \nNet cash provided by/(used in) investing activities\n was $(276.4) million compared to $(289.1) million for 2023. The \ndecrease in cash used in investing activities was primarily due to a decrease in acquisitions, a decrease in spend for development of real estate assets, a decrease in spend for capital expenditures, an increase in distributions received from unconsolidated joint ventures and partnerships, a decrease in cash investments in unconsolidated joint ventures, and \na decrease from the net issuance of notes receivable during the current year compared to the prior year,\n partially offset by a decrease in proceeds from sales of real estate.\nAcquisitions\nIn January 2024, the Company acquired its joint venture partner’s common\n \nequity interest in a 173 apartment home operating community located in Oakland, California for $1.4 million. The community was previously owned by a consolidated joint venture of the Company. (See Note 5, \nJoint Ventures and Partnerships \nfor more information)\n.\n \n​\nIn February 2023, the Company took\n title to a 136 apartment home operating community located in San Francisco, California, through a foreclosure proceeding. The community was previously owned by a consolidated joint venture of the Company. (See Note 5, \nJoint Ventures and Partnerships \nfor more information)\n.\n​\nIn August 2023, the Company acquired a portfolio of six operating communities totaling 1,753 apartment homes, which included four operating communities in Dallas, Texas and two operating communities in Austin, Texas, for a purchase price of $354.6 million. The Company acquired the portfolio with a combination of cash, the assumption of six mortgage loans \nwith an outstanding principal balance of approximately $209.4 million (fair value of $191.7 million),\n and the issuance of 3.6 million OP Units to the seller valued at $141.4 million. The OP Units were valued based on the closing price per share of UDR’s common stock on the date of acquisition in accordance with GAAP. \nThe Company increased its real estate assets owned by approximately $344.8 million, recorded $9.8 million of in-place lease intangibles, and recorded a $17.6 million debt discount in connection with the below-market debt assumed\n.\n​\nDispositions\nIn February 2024, the Company sold an operating community located in Arlington, Virginia with a total of 214 apartment homes for gross proceeds of $100.0 million, resulting in a gain of approximately $16.9 million. This operating community was classified as held for disposition as of December 31, 2023.\n​\nIn January 2023, the Company sold the retail component of a development community located in Washington, D.C. for gross proceeds of approximately $14.4 million, resulting in a gain of less than $0.1 million. The gross proceeds were received ratably throughout the development of the community and are reflected as a reduction of capital expenditures. \n​\n46\n\n\nTable of Contents\nIn June 2023, the Company contributed four wholly-owned operating communities, totaling 1,328 apartment homes located in various markets, to a newly formed joint venture in exchange for a 51.0% interest in the venture. The contribution resulted in the Company no longer retaining a controlling interest in the communities, and the Company deconsolidated the operating communities. The Company received approximately $247.9 million in cash proceeds from our joint venture partner at formation. The transaction was accounted for as a partial sale and resulted in a gain of approximately $325.9 million, which was recorded in \nGain/(loss) on sale of real estate owned\n on the Consolidated Statement of Operations, which consisted of the gain on the partial sale and the initial measurement of our retained interest at fair value. (See Note 5, \nJoint Ventures and Partnerships\n for further discussion).\nIn December 2023, the Company sold an operating community located in Hillsboro, Oregon with a total of 276 apartment homes for gross proceeds of $78.6 million, resulting in a gain of approximately $25.3 million.\nWe plan to continue to pursue our strategy of exiting markets where long-term growth prospects are limited and redeploying capital to primary locations in markets we believe will provide the best investment returns.\nCapital Expenditures\nWe capitalize those expenditures that materially enhance the value of an existing asset or substantially extend the useful life of an existing asset. Expenditures necessary to maintain an existing property in ordinary operating condition are expensed as incurred.\nFor the year ended December 31, 2024, total capital expenditures of $246.5 million or $4,458 per stabilized home, which in aggregate include recurring capital expenditures and major renovations, were spent across our portfolio, excluding development, as compared to $303.7 million or $5,567 per stabilized home for the prior year.\nThe decrease in total capital expenditures was primarily due to:\n●\na decrease of 58.3%, or $71.9 million, in major renovations, which includes major structural changes and/or architectural revisions to existing buildings;\nThis was partially offset by:\n●\nan increase of 15.3%, or $13.1 million, in recurring capital expenditures, which includes asset preservation and turnover-related expenditures.\nThe following table outlines capital expenditures and repair and maintenance costs for all of our communities, excluding real estate under development, for the years ended December 31, 2024 and 2023 (\ndollars in thousands except Per Home amounts\n):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPer Home\n \n​\n​\nYear Ended December 31, \n​\nYear Ended December 31, \n \n​\n    \n2024\n    \n2023\n    \n% Change\n    \n2024\n    \n2023\n    \n% Change\n \nTurnover capital expenditures\n​\n$\n 19,230\n​\n$\n 17,595\n \n 9.3\n%  \n$\n 348\n​\n$\n 323\n \n 7.7\n%\nAsset preservation expenditures\n​\n \n 79,456\n​\n \n 68,017\n \n 16.8\n%  \n \n 1,437\n​\n \n 1,249\n \n 15.1\n%\nTotal recurring capital expenditures\n​\n \n 98,686\n​\n \n 85,612\n \n 15.3\n%  \n \n 1,785\n​\n \n 1,572\n \n 13.5\n%\nNOI enhancing improvements (a)\n​\n \n 92,668\n​\n \n 90,627\n \n 2.3\n%  \n \n 1,676\n​\n \n 1,664\n \n 0.7\n%\nMajor renovations (b)\n​\n \n 51,441\n​\n \n 123,324\n \n (58.3)\n%  \n \n 930\n​\n \n 2,264\n \n (58.9)\n%\nOperations platform\n​\n​\n 3,715\n​\n​\n 4,144\n​\n (10.4)\n%  \n​\n 67\n​\n​\n 76\n​\n (11.8)\n%\nTotal capital expenditures (c)\n​\n$\n 246,510\n​\n$\n 303,707\n \n (18.8)\n%  \n$\n 4,458\n​\n$\n 5,576\n \n (20.1)\n%\nRepair and maintenance expense\n​\n$\n 101,223\n​\n$\n 94,958\n \n 6.6\n%  \n$\n 1,830\n​\n$\n 1,743\n \n 5.0\n%\nAverage home count (d)\n​\n \n 55,301\n​\n \n 54,476\n \n 1.5\n%  \n​\n​\n​\n​\n​\n​\n​\n​\n(a)\nNOI enhancing improvements are expenditures that result in increased income generation or decreased expense growth.\n(b)\nMajor renovations include major structural changes and/or architectural revisions to existing buildings.\n(c)\nTotal capital expenditures includes amounts capitalized during the year. Cash paid for capital expenditures is impacted by the net change in related accruals.\n(d)\nAverage number of homes is calculated based on the number of homes outstanding at the end of each month.\n​\n47\n\n\nTable of Contents\nWe intend to continue to selectively add NOI enhancing improvements, which we believe will provide a return on investment in excess of our cost of capital. Our objective in redeveloping a community is twofold: we aim to meaningfully grow rental rates while also achieving cap rate compression through asset quality improvement.\nConsolidated Real Estate Under Development and Redevelopment\nAt December 31, 2024, the Company was not developing any communities although the Company is incurring and capitalizing costs directly related to predevelopment activities in preparation of future development commencements. During the year ended December 31, 2024, the Company completed the development of two communities located in Tampa, Florida and Addison, Texas, with a total of 415 apartment homes.\nAt December 31, 2024, the Company \nhad no communities at which it was conducting substantial redevelopment activities\n.\nUnconsolidated Joint Ventures and Partnerships\nThe Company recognizes income or losses from our investments in unconsolidated joint ventures and partnerships consisting of our proportionate share of the net income or losses of the joint ventures and partnerships. In addition, we may earn fees for providing management services to the communities held by the unconsolidated joint ventures and partnerships.\nThe Company’s \nInvestment in and advances to unconsolidated joint ventures and partnerships, net\n, are accounted for under the equity method of accounting. For the year ended December 31, 2024:\n●\nwe made investments totaling $50.3 million in our unconsolidated joint ventures and partnerships;\n●\nour proportionate share of the net income/(loss) of the joint ventures and partnerships was $20.2 million, which included an $8.1 million non-cash impairment loss on one of the Company’s preferred equity investments due to a decrease in the value of the operating community that is deemed to be other-than-temporary; and\n●\nwe received cash distributions of $102.4 million, of which $61.3 million were operating cash flows and $41.1 million were investing cash flows.\nWe evaluate our investments in unconsolidated joint ventures and partnerships when events or changes in circumstances indicate that there may be an other-than-temporary decline in value. We consider various factors to determine if a decrease in the value of the investment is other-than-temporary. The Company did not recognize any other-than-temporary impairments in the value of its investments in unconsolidated joint ventures or partnerships during the years ended December 31, 2024 and 2023\n, other than the one preferred equity investment discussed above.\nFinancing Activities\nFor the years ended December 31, 2024 and 2023, \nNet cash provided by/(used in) financing activities\n was $(599.9) million and $(538.9) million, respectively.\nThe following significant financing activities occurred during the year ended December 31, 2024:\n●\nissued $300.0 million of 5.125% senior unsecured medium-term notes due September 2034, for net proceeds of $296.9 million;\n●\nrepaid $138.0 million of secured debt;\n●\nrepaid $15.6 million of unsecured debt;\n●\nrepaid $118.2 million, net on our unsecured commercial paper program;\n●\npaid $42.8 million of distributions to redeemable noncontrolling interests; and\n●\npaid $558.5 million of distributions to our common stockholders.\n48\n\n\nTable of Contents\nThe following significant financing activities occurred during the year ended December 31, 2023:\n●\nrepurchased 0.6 million shares of common stock at an average price of $40.13 per share for approximately $25.0 million;\n●\nreceived net proceeds of $108.1 million on our unsecured commercial paper program; \n●\nrepaid $23.4 million on our revolving bank debt;\n●\npaid $35.6 million of distributions to redeemable noncontrolling interests; and\n●\npaid $539.9 million of distributions to our common stockholders.\nCredit Facilities and Commercial Paper Program\nThe Company has a $1.3 billion Revolving Credit Facility and a $350.0 million Term Loan. The Credit Agreement for these facilities allows the total commitments under the Revolving Credit Facility and the total borrowings under the Term Loan to be increased to an aggregate maximum amount of up to $2.5 billion, subject to certain conditions, including obtaining commitments from one or more lenders. In August 2024, the Company amended the Revolving Credit Facility to extend the maturity date to August 31, 2028, with two six-month extension options. The Revolving Credit Facility was previously set to mature on January 31, 2026, with two six-month extension options, subject to certain conditions. The Term Loan has a scheduled maturity date of January 31, 2027. In August 2024, the Company amended the Term Loan to include a twelve-month extension option, subject to certain conditions. \nBased on the Company’s current credit rating, the Revolving Credit Facility has an interest rate equal to Adjusted SOFR plus a margin of 77.5 basis points and a facility fee of 15 basis points, and the Term Loan has an interest rate equal to Adjusted SOFR plus a margin of 83.0 basis points. Depending on the Company’s credit rating, the margin under the Revolving Credit Facility ranges from 70 to 140 basis points, the facility fee ranges from 10 to 30 basis points, and the margin under the Term Loan ranges from 75 to 160 basis points. Further, the Credit Agreement includes sustainability adjustments pursuant to which the applicable margin for the Term Loan may be reduced by up to two basis points contingent upon the Company receiving green building certifications, which is reflected in the margin noted above. In addition, the Credit Agreement allows for the Company in consultation with the sustainability structuring agent to propose key performance indicators with respect to certain environmental, social, and governance goals of the Company, and thresholds or targets with respect thereto, and a related amendment to the Credit Agreement, that if entered into may allow a change in the applicable margin for the Revolving Credit Facility of up to four basis points and a change in the applicable facility fee of up to one basis point.\nAs of December 31, 2024, we had no outstanding borrowings under the Revolving Credit Facility, leaving $1.3 billion of unused capacity (excluding $3.4 million of letters of credit at December 31, 2024), and $350.0 million of outstanding borrowings under the Term Loan.\nThe Company has a working capital credit facility, which provides for a $75.0 million unsecured revolving credit facility (the “Working Capital Credit Facility”) with a scheduled maturity date of January 12, 2026. In December 2024, the Company extended the maturity date from January 12, 2025 to January 12, 2026. Based on the Company’s current credit rating, the Working Capital Credit Facility has an interest rate equal to Adjusted SOFR plus a margin of 77.5 basis points. Depending on the Company’s credit rating, the margin ranges from 70 to 140 basis points. \nAs of December 31, 2024, we had $9.4 million of outstanding borrowings under the Working Capital Credit Facility, leaving $65.6 million of unused capacity.\nThe bank revolving credit facilities and the term loan are subject to customary financial covenants and limitations, all of which we were in compliance with at December 31, 2024.\nThe Company has an unsecured commercial paper program. Under the terms of the program, the Company may issue unsecured commercial paper up to a maximum aggregate amount outstanding of $700.0 million. The notes are sold under customary terms in the United States commercial paper market and rank pari passu with all of the Company’s other unsecured indebtedness. The notes are fully and unconditionally guaranteed by the Operating Partnership. As of December 31, 2024, we had issued $289.9 million of commercial paper, for one month terms, at a weighted average annualized rate of 4.7%, leaving $410.1 million of unused capacity. \n49\n\n\nTable of Contents\nInterest Rate Risk\nWe are exposed to interest rate risk associated with variable rate notes payable and maturing debt that has to be refinanced. We do not hold financial instruments for trading or other speculative purposes, but rather issue these financial instruments to finance our portfolio of real estate assets and operations. Interest rate sensitivity is the relationship between changes in market interest rates and the fair value of market rate sensitive assets and liabilities. Our earnings are affected as changes in short-term interest rates impact our cost of variable rate debt and maturing fixed rate debt. We had $501.3 million in variable rate debt that is not subject to interest rate swap contracts as of December 31, 2024. If market interest rates for variable rate debt increased by 100 basis points, our interest expense would increase by $6.1 million based on the average balance outstanding during the year.\nThese amounts are determined by considering the impact of hypothetical interest rates on our borrowing cost. This analysis does not consider the effects of the adjusted level of overall economic activity that could exist in such an environment or actions we may take to further mitigate our exposure to the change. However, due to the uncertainty of the specific actions that would be taken and their possible effects, the sensitivity analysis assumes no change in our financial structure.\nThe Company also utilizes derivative financial instruments to manage interest rate risk and generally designates these financial instruments as cash flow hedges. See Note 14, \nDerivatives and Hedging Activities\n, in the Notes to the UDR Consolidated Financial Statements included in this Report for additional discussion of derivative instruments.\nA presentation of cash flow metrics based on GAAP is as follows (\ndollars in thousands\n):\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n​\n2024\n    \n2023\nNet cash provided by/(used in) operating activities\n    \n$\n 876,848\n    \n$\n 832,664\nNet cash provided by/(used in) investing activities\n​\n \n (276,351)\n \n \n (289,138)\nNet cash provided by/(used in) financing activities\n​\n \n (599,936)\n \n \n (538,854)\n​\n​\nResults of Operations\nThe following discussion explains the changes in results of operations that are presented in our Consolidated Statements of Operations for the years ended December 31, 2024 and 2023.\nNet Income/(Loss) Attributable to Common Stockholders\nNet income/(loss) attributable to common stockholders was $84.8 million ($0.26 per diluted share) for the year ended December 31, 2024, as compared to $439.5 million ($1.34 per diluted share) for the prior year. The decrease resulted primarily from the following items, all of which are discussed in further detail elsewhere within this Report:\n●\ngain on the sale of real estate of $16.9 million recognized from the sale of an operating community located in Arlington, Virginia during the year ended December 31, 2024, as compared to gains of $351.2 million recognized from the partial sale of four operating communities located in various markets and the sale of an operating community located in Hillsboro, Oregon, during year ended December 31, 2023;\n●\na decrease in interest income and other income/(expense), net of $30.1 million primarily due to a recorded $37.3 million non-cash loan reserve related to one of the Company’s joint venture loan investments during the year end December 31, 2024, \nwhich was due to the Company’s assessment of the borrower’s ability to make future scheduled payments on the senior loan and a decrease in the value of the operating community, \npartially offset by a $9.7 million increase in interest income from our notes receivables primarily due to higher outstanding balances during the year ended December 31, 2024\n, as compared the same period in 2023\n; \n●\nan increase in interest expense of $14.8 million primarily due to higher overall debt balances during the year ended December 31, 2024, as compared the same period in 2023;\n●\nan increase in general and administrative expenses of $14.4 million primarily attributable to severance benefits associated with the retirement of an executive officer and the reorganization of certain departments, higher incentive and bonus accruals primarily driven by better Company performance, and \n50\n\n\nTable of Contents\nannual market increases for personnel compensation during the year ended December 31, 2024, as compared to the same period in 2023;\n●\nan increase in casualty-related charges/(recoveries), net of $12.0 million primarily attributable to an increase in claim charges due to severe weather events and a decrease in insurance recoveries during the year ended December 31, 2024 as compared to the same period in 2023; and\n●\nan increase in other operating expenses of $10.2 million primarily attributable to an increase in legal-related expenses and political contributions during the year ended December 31, 2024, as compared to the same period in 2023.\nThis was partially offset by: \n●\nan increase in total property NOI of $24.1 million primarily due to \nhigher revenue per occupied home, an increase in weighted average physical occupancy, and NOI from additional operating communities, \npartially offset by an increase in property operating expenses and a decrease from communities sold during 2023 and 2024; \n●\na decrease in net income attributable to redeemable noncontrolling interests in the Operating Partnership and DownREIT Partnership of $23.9 million primarily attributed to the noncontrolling interests’ share of the gain from the partial sale of four operating communities located in various markets and the sale of an operating community located in Hillsboro, Oregon during the year ended December 31, 2023, as compared to the sale of one operating community located in Arlington, Virginia in the same period of 2024; and\n●\nan increase in income/(loss) from unconsolidated entities of $15.5 million primarily attributable to a $24.3 million loss on consolidation related to one of the Company’s preferred equity investments being consolidated during the year ended December 31, 2023, partially offset by an $8.1 million non-cash impairment loss on one of the Company’s preferred equity investments during the year ended December 31, 2024\n.\nApartment Community Operations\nOur net income results are primarily from NOI generated from the operation of our apartment communities. The Company defines NOI, which is a non-GAAP financial measure, as rental income less direct property rental expenses. Rental income represents gross market rent less adjustments for concessions, vacancy loss and bad debt. Rental expenses include real estate taxes, insurance, personnel, utilities, repairs and maintenance, administrative and marketing. Excluded from NOI is property management expense, which is calculated as 3.25% of property revenue, and land rent. Property management expense covers costs directly related to consolidated property operations, inclusive of corporate management, regional supervision, accounting and other costs.\nManagement considers NOI a useful metric for investors as it is a more meaningful representation of a community’s continuing operating performance than net income as it is prior to corporate-level expense allocations, general and administrative costs, capital structure and depreciation and amortization.\nAlthough the Company considers NOI a useful measure of operating performance, NOI should not be considered an alternative to net income or net cash flow from operating activities as determined in accordance with GAAP. NOI excludes several income and expense categories as detailed in the reconciliation of NOI to \nNet income/(loss) attributable to UDR, Inc.\n below.\n51\n\n\nTable of Contents\nThe following table summarizes the operating performance of our total property NOI for each of the periods presented \n(dollars in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended \n​\n​\n​\n​\n​\nDecember 31,  (a)\n​\n​\n​\n​\n    \n2024\n    \n2023\n    \n%\n \nChange\n    \nSame-Store Communities:\n​\n​\n​\n  \n​\n​\n  \n​\n  \nSame-Store rental income\n​\n$\n 1,524,774\n  \n$\n 1,490,070\n  \n 2.3\n%  \nSame-Store operating expense (b)\n​\n \n (472,386)\n  \n \n (452,943)\n  \n 4.3\n%  \nSame-Store NOI\n​\n \n 1,052,388\n  \n \n 1,037,127\n  \n 1.5\n%  \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNon-Mature Communities/Other NOI:\n​\n​\n​\n  \n​\n​\n  \n​\n  \nStabilized, non-mature communities NOI (c)\n​\n​\n 50,869\n  \n \n 26,654\n​\n 90.8\n%  \nDevelopment communities NOI\n​\n \n 1,888\n  \n \n (372)\n  \nNM\n*\nNon-residential/other NOI (d)\n​\n​\n 20,793\n  \n \n 15,669\n​\n 32.7\n%  \nSold and held for disposition communities NOI\n​\n​\n 12,885\n  \n \n 35,692\n​\n (63.9)\n%  \nTotal Non-Mature Communities/Other NOI\n​\n \n 86,435\n  \n \n 77,643\n  \n 11.3\n%  \nTotal property NOI\n​\n$\n 1,138,823\n  \n$\n 1,114,770\n  \n 2.2\n%\n*\nNot meaningful \n(a)\nSame-Store consists of 51,428 apartment homes.\n(b)\nExcludes depreciation, amortization, and property management expenses.\n(c)\nRepresents non-mature communities that have achieved 90% occupancy for three consecutive months but do not meet the criteria to be included in Same-Store Communities.\n(d)\nPrimarily non-residential revenue and expense.\n​\nThe following table is our reconciliation of \nNet income/(loss) attributable to UDR, Inc.\n to total property NOI for each of the periods presented (\ndollars in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\nNet income/(loss) attributable to UDR, Inc.\n​\n$\n 89,585\n​\n$\n 444,353\nJoint venture management and other fees\n​\n \n (8,317)\n​\n \n (6,843)\nProperty management\n​\n \n 54,065\n​\n \n 52,671\nOther operating expenses\n​\n \n 30,416\n​\n \n 20,222\nReal estate depreciation and amortization\n​\n \n 676,068\n​\n \n 676,419\nGeneral and administrative\n​\n \n 84,305\n​\n \n 69,929\nCasualty-related charges/(recoveries), net\n​\n \n 15,179\n​\n \n 3,138\nOther depreciation and amortization\n​\n \n 19,405\n​\n \n 15,419\n(Gain)/loss on sale of real estate owned\n​\n​\n (16,867)\n​\n​\n (351,193)\n(Income)/loss from unconsolidated entities\n​\n \n (20,235)\n​\n \n (4,693)\nInterest expense\n​\n \n 195,712\n​\n \n 180,866\nInterest income and other (income)/expense, net\n​\n \n 12,336\n​\n \n (17,759)\nTax provision/(benefit), net\n​\n \n 879\n​\n \n 2,106\nNet income/(loss) attributable to redeemable noncontrolling interests in the Operating Partnership and DownREIT Partnership\n​\n \n 6,246\n​\n \n 30,104\nNet income/(loss) attributable to noncontrolling interests\n​\n \n 46\n​\n \n 31\nTotal property NOI\n​\n$\n 1,138,823\n​\n$\n 1,114,770\n​\nSame-Store Communities\nOur \nSame-Store Community\n properties (those acquired, developed, and stabilized prior to January 1, 2023 and held on December 31, 2024) consisted of 51,428 apartment homes and provided 92.4% of our total NOI for the year ended December 31, 2024.\nNOI for our \nSame-Store Community\n properties increased 1.5%, or $15.3 million, for the year ended December 31, 2024 compared to the same period in 2023. The increase in property NOI was attributable to a \n2.3%, or $34.7 million, increase in property rental income, which was partially offset by a 4.3%, or $19.4 million, increase in operating expenses\n. The increase in property rental income was primarily driven by a \n1.5%, or $21.6 million, increase in \n52\n\n\nTable of Contents\nrental rates, and \nan 8.3%, or $13.4 million, increase in reimbursement and ancillary and fee income. Weighted average physical occupancy increased by 0.1% to 96.8% and total monthly income per occupied home increased 2.2% to $2,554.\nThe increase in operating expenses was primarily driven by an 11.0%, or $6.7 million, increase in personnel costs primarily due to annual market increases and a refundable payroll tax credit related to the Employee Retention Credit program in 2023, a 5.1%, or $4.6 million, increase in repair and maintenance expense due to an increase in the cost per home of those that were turned during the year, the impact of inflation on third party vendor costs and weather-related events, a 12.6%, or $3.8 million, increase in administration and marketing primarily due to the cost for providing property-wide Wi-Fi, and a 1.8%, or $3.3 million, increase in real estate taxes due to higher assessed valuations. \nThe operating margin (property net operating income divided by property rental income) was 69.0% and 69.6% for the years ended December 31, 2024 and 2023, respectively.\nNon-Mature Communities/Other\nUDR’s \nNon-Mature Communities/Other\n represent those communities that do not meet the criteria to be included in \nSame-Store Communities\n, which include communities recently developed or acquired, redevelopment properties, sold or held for disposition properties, and non-apartment components of mixed use properties.\nThe remaining 7.6%, or $86.4 million, of our total NOI during the year ended December 31, 2024 was generated from our \nNon-Mature Communities/Other\n. NOI from \nNon-Mature Communities/Other\n increased by 11.3%, or $8.8 million, for the year ended December 31, 2024 as compared to the same period in 2023. The increase was primarily attributable to a $24.2 million increase in NOI from stabilized, non-mature communities, primarily due to development communities completed becoming stabilized and communities acquired in 2023 being owned for the full year, and a $5.1 million increase in non-residential/other NOI primarily due to higher retail tenant rents, partially offset by a $22.8 million decrease in sold and held for disposition communities NOI due to the sale of an operating community and two operating communities being held for disposition during the year ended December 31, 2024 as compared to the sale of one operating community, one operating community held for disposition during the year ended December 31, 2023, and the partial sale of four operating communities in 2023.\nGain/(Loss) on Sale of Real Estate Owned\nDuring the year ended December 31, 2024, the Company recognized a gain of $16.9 million from the sale of one operating community located in Arlington, Virginia. \nDuring the year ended December 31, 2023, the Company recognized a gain of $351.2 million from the partial sale of four operating communities located in various markets and the sale of an operating community located in Hillsboro, Oregon.\nInterest income and other income/(expense)\nFor the years ended December 31, 2024 and 2023, the Company recognized interest income and other income/(expense), net of $(12.3) million and $17.8 million, respectively. The decrease of \n$30.1 million was primarily due to a $37.3 million non-cash loan reserve related to one of the Company’s joint venture loan investments during the year end December 31, 2024, \nwhich was due to the Company’s assessment of the borrower’s ability to make future scheduled payments on the senior loan and a decrease in the value of the operating community, \npartially offset by a $9.7 million increase in interest income from our notes receivables primarily due to higher outstanding balances during the year ended December 31, 2024\n, as compared the same period in 2023\n.\n53\n\n\nTable of Contents\nInterest expense\nFor the years ended December 31, 2024 and 2023, the Company recognized interest expense of $195.7 million and $180.9 million, respectively. The increase in 2024 as compared to 2023 was primarily due to higher overall debt balances during the year ended December 31, 2024, as compared the same period in 2023.\nGeneral and administrative\nFor the years ended December 31, 2024 and 2023, the Company recognized general and administrative expense of $84.3 million and $69.9 million, respectively. The increase of $14.4 million was primarily attributable to severance benefits associated with the retirement of an executive officer and the reorganization of certain departments, higher incentive and bonus accruals primarily driven by better Company performance, and annual market increases for personnel compensation during the year ended December 31, 2024, as compared to the same period in 2023.\nCasualty-related charges/(recoveries), net\nFor the years ended December 31, 2024 and 2023, the Company recognized casualty-related charges/(recoveries), net of $15.2 million and $3.1 million, respectively. The increase of $12.0 million was primarily attributable to an increase in claim charges due to severe weather events and a decrease in insurance recoveries during the year ended December 31, 2024 as compared to the same period in 2023.\nOther operating expenses\nFor the years ended December 31, 2024 and 2023, the Company recognized other operating expenses of $30.4 million and $20.2 million, respectively. The increase of $10.2 million was primarily attributable to an increase in legal-related expenses and political contributions during the year ended December 31, 2024, as compared to the same period in 2023.\nNoncontrolling Interest\nFor the years ended December 31, 2024 and 2023, the Company recognized net income attributable to redeemable noncontrolling interests in the Operating Partnership and DownREIT Partnership of $6.2 million and $30.1 million, respectively. The decrease in 2024 as compared to 2023 was\n primarily attributed to the noncontrolling interests’ share of a gain from the sale of an operating community in Arlington, Virginia during the year ended December 31, 2024, as compared to the noncontrolling interests’ share of the gains from the partial sale of four operating communities located in various markets and a gain form the sale of an operating community located in Hillsboro, Oregon during the year ended December 31, 2023.\nIncome/(Loss) from Unconsolidated Entities \nDuring the year ended December 31, 2024, the Company recognized income/(loss) from unconsolidated entities of $20.2 million, which was primarily\n due to net income from our operating joint ventures and preferred equity investments, partially offset by an $8.1 million non-cash impairment loss on one of the Company’s preferred equity investments\n.\nDuring the year ended December 31, \n2023, the Company recognized income/(loss) from unconsolidated entities of $4.7 million, which was primarily\n due to net income from our operating joint ventures and preferred equity investments, partially offset by a $24.3 million loss on consolidation of one of our \npreferred equity investments\n.\nInflation \nInflation primarily impacts our results of operations as a result of wage pressures and increases in utilities and repair and maintenance costs. In addition, inflation could also impact our general and administrative expenses, the interest on our debt if variable or refinanced in a high-inflationary environment, our cost of capital, and our cost of development, redevelopment, maintenance or other operating activities. However, the majority of our apartment leases have initial terms of 12 months or less, which in an inflationary environment, and absent other factors such as increased supply, generally enables us to compensate for inflationary effects by increasing rents on our apartment homes. Although an extreme or sustained escalation in costs could have a negative impact on our residents and their ability to absorb rent increases, we do not believe this had a material impact on our results for the year ended December 31, 2024\n.\n54\n\n\nTable of Contents\nFunds from Operations, Funds from Operations as Adjusted, and Adjusted Funds from Operations\nFunds from Operations\nFunds from operations (“FFO”) attributable to common stockholders and unitholders is defined as \nNet income/(loss) attributable to common stockholders\n (computed in accordance with GAAP), excluding impairment write-downs of depreciable real estate related to the main business of the Company or of investments in non-consolidated investees that are directly attributable to decreases in the fair value of depreciable real estate held by the investee, gains and losses from sales of depreciable real estate related to the main business of the Company and income taxes directly associated with those gains and losses, plus real estate depreciation and amortization, and after adjustments for noncontrolling interests, and the Company’s share of unconsolidated partnerships and joint ventures. This definition conforms with the National Association of Real Estate Investment Trust’s (“Nareit”) definition issued in April 2002 and restated in November 2018. Historical cost accounting for real estate assets in accordance with GAAP implicitly assumes that the value of real estate assets diminishes predictably over time. Since real estate values instead have historically risen or fallen with market conditions, many industry investors and analysts have considered the presentation of operating results for real estate companies that use historical cost accounting to be insufficient by themselves. Thus, Nareit created FFO as a supplemental measure of a REIT’s operating performance. In the computation of diluted FFO, if OP Units, DownREIT Units, unvested restricted stock, unvested LTIP Units, stock options, and the shares of Series E Cumulative Convertible Preferred Stock are dilutive, they are included in the diluted share count.\nManagement considers FFO a useful metric for investors as the Company uses FFO in evaluating property acquisitions and its operating performance, and believes that FFO should be considered along with, but not as an alternative to, net income and cash flow as a measure of the Company’s activities in accordance with GAAP. FFO does not represent cash generated from operating activities in accordance with GAAP and is not necessarily indicative of funds available to fund our cash needs.\nFunds from Operations as Adjusted\nFFO as Adjusted (“FFOA”) attributable to common stockholders and unitholders is defined as FFO excluding the impact of non-comparable items including, but not limited to, acquisition-related costs, prepayment costs/benefits associated with early debt retirement, impairment write-downs or gains and losses on sales of real estate or other assets incidental to the main business of the Company and income taxes directly associated with those gains and losses, casualty-related expenses and recoveries, severance costs and legal and other costs. \nManagement believes that FFOA is useful supplemental information regarding our operating performance as it provides a consistent comparison of our operating performance across time periods and enables investors to more easily compare our operating results with other REITs. FFOA is not intended to represent cash flow or liquidity for the period, and is only intended to provide an additional measure of our operating performance. We believe that \nNet income/(loss) attributable to common stockholders\n is the most directly comparable GAAP financial measure to FFOA. However, other REITs may use different methodologies for calculating FFOA or similar FFO measures and, accordingly, our FFOA may not always be comparable to FFOA or similar FFO measures calculated by other REITs. FFOA should not be considered as an alternative to net income (determined in accordance with GAAP) as an indication of financial performance, or as an alternative to cash flow from operating activities (determined in accordance with GAAP) as a measure of our liquidity.\nAdjusted Funds from Operations\nAdjusted FFO (“AFFO”) attributable to common stockholders and unitholders is defined as FFOA less recurring capital expenditures on consolidated communities that are necessary to help preserve the value of and maintain functionality at our communities. Therefore, management considers AFFO a useful supplemental performance metric for investors as it is more indicative of the Company’s operational performance than FFO or FFOA.\nAFFO is not intended to represent cash flow or liquidity for the period, and is only intended to provide an additional measure of our operating performance. We believe that \nNet income/(loss) attributable to common stockholders\n is the most directly comparable GAAP financial measure to AFFO. Management believes that AFFO is a widely recognized measure of the operations of REITs, and presenting AFFO enables investors to assess our performance in comparison to other REITs. However, other REITs may use different methodologies for calculating AFFO and, accordingly, our AFFO may not always be comparable to AFFO calculated by other REITs. AFFO should not be considered as an alternative to net income/(loss) (determined in accordance with GAAP) as an indication of \n55\n\n\nTable of Contents\nfinancial performance, or as an alternative to cash flow from operating activities (determined in accordance with GAAP) as a measure of our liquidity, nor is it indicative of funds available to fund our cash needs, including our ability to make distributions.\nThe following table outlines our reconciliation of \nNet income/(loss) attributable to common stockholders\n to FFO, FFOA, and AFFO for the years ended December 31, 2024, 2023, and 2022 (\ndollars in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nNet income/(loss) attributable to common stockholders\n​\n$\n 84,750\n​\n$\n 439,505\n​\n$\n 82,512\nReal estate depreciation and amortization\n​\n \n 676,068\n​\n \n 676,419\n​\n \n 665,228\nNoncontrolling interests\n​\n \n 6,292\n​\n \n 30,135\n​\n \n 5,655\nReal estate depreciation and amortization on unconsolidated joint ventures\n​\n \n 53,727\n​\n \n 42,622\n​\n \n 30,062\nImpairment loss from unconsolidated joint ventures\n​\n​\n 8,083\n​\n​\n —\n​\n​\n —\nNet (gain)/loss on consolidation\n​\n​\n —\n​\n​\n 24,257\n​\n​\n —\nNet gain on the sale of depreciable real estate owned, net of tax\n​\n \n (16,867)\n​\n \n (349,993)\n​\n \n (25,494)\nFFO attributable to common stockholders and unitholders, basic\n​\n$\n 812,053\n​\n$\n 862,945\n​\n$\n 757,963\nDistributions to preferred stockholders — Series E (Convertible)\n​\n \n 4,835\n​\n \n 4,848\n​\n \n 4,412\nFFO attributable to common stockholders and unitholders, diluted\n​\n$\n 816,888\n​\n$\n 867,793\n​\n$\n 762,375\nIncome/(loss) per weighted average common share, diluted\n​\n$\n 0.26\n​\n$\n 1.34\n​\n$\n 0.26\nFFO per weighted average common share and unit, basic\n​\n$\n 2.30\n​\n$\n 2.46\n​\n$\n 2.21\nFFO per weighted average common share and unit, diluted\n​\n$\n 2.29\n​\n$\n 2.45\n​\n$\n 2.20\nWeighted average number of common shares and OP/DownREIT Units outstanding — basic\n​\n \n 353,283\n​\n \n 351,175\n​\n \n 343,149\nWeighted average number of common shares, OP/DownREIT Units, and common stock equivalents outstanding — diluted\n​\n \n 356,957\n​\n \n 354,422\n​\n \n 347,094\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nImpact of adjustments to FFO:\n​\n \n​\n​\n \n​\n​\n \n​\nVariable upside participation on preferred equity investment, net\n​\n$\n —\n​\n$\n (204)\n​\n$\n (10,622)\nLegal and other costs\n​\n \n 13,315\n​\n \n 2,869\n​\n \n 1,493\nRealized and unrealized (gain)/loss on real estate technology investments, net of tax \n​\n​\n (8,019)\n​\n​\n (3,051)\n​\n​\n 45,671\nSeverance costs\n​\n \n 10,556\n​\n \n 4,164\n​\n \n 441\nProvision for loan loss (a)\n​\n​\n 37,271\n​\n​\n —\n​\n​\n —\nCasualty-related charges/(recoveries), net\n​\n \n 15,179\n​\n \n 3,138\n​\n \n 9,733\nTotal impact of adjustments to FFO\n​\n$\n 68,302\n​\n$\n 6,916\n​\n$\n 46,716\nFFOA attributable to common stockholders and unitholders, diluted\n​\n$\n 885,190\n​\n$\n 874,709\n​\n$\n 809,091\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFFOA per weighted average common share and unit, diluted\n​\n$\n 2.48\n​\n$\n 2.47\n​\n$\n 2.33\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nRecurring capital expenditures, inclusive of unconsolidated joint ventures\n​\n \n (105,116)\n​\n \n (90,917)\n​\n \n (77,710)\nAFFO attributable to common stockholders and unitholders, diluted\n​\n$\n 780,074\n​\n$\n 783,792\n​\n$\n 731,381\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAFFO per weighted average common share and unit, diluted\n​\n$\n 2.19\n​\n$\n 2.21\n​\n$\n 2.11\n(a)\nDuring the year ended December 31, 2024, the Company recorded a $37.3 million non-cash loan reserve related to one of its note receivable investments.\n​\n56\n\n\nTable of Contents\nThe following table is our reconciliation of FFO share information to weighted average common shares outstanding, basic and diluted, reflected on the UDR Consolidated Statements of Operations for the years ended December 31, 2024, 2023, and 2022 \n(shares in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\nYear Ended December 31, \n​\n    \n2024\n    \n2023\n    \n2022\nWeighted average number of common shares and OP/DownREIT Units outstanding — basic\n \n 353,283\n \n 351,175\n \n 343,149\nWeighted average number of OP/DownREIT Units outstanding\n \n (23,993)\n \n (22,410)\n \n (21,478)\nWeighted average number of common shares outstanding — basic per the Consolidated Statements of Operations\n \n 329,290\n \n 328,765\n \n 321,671\n​\n​\n​\n​\n​\n​\n​\nWeighted average number of common shares, OP/DownREIT Units, and common stock equivalents outstanding — diluted\n \n 356,957\n \n 354,422\n \n 347,094\nWeighted average number of OP/DownREIT Units outstanding\n \n (23,993)\n \n (22,410)\n \n (21,478)\nWeighted average number of Series E Cumulative Convertible Preferred shares outstanding\n \n (2,848)\n \n (2,908)\n \n (2,916)\nWeighted average number of common shares outstanding — diluted per the Consolidated Statements of Operations\n \n 330,116\n \n 329,104\n \n 322,700\n​\n​\n​\n​\n​",
  "item2": null
}