{
  "item1": "portfolio strategy generally govern review process where when allocate development capital. December 31, 2024, Company not developing any communities, although Company incurring capitalizing costs directly related predevelopment activities preparation future development commencements. During year ended December 31, 2024, Company completed development two communities located Tampa, Florida Addison, Texas, total 415 apartment homes. Redevelopment Activities objective redeveloping community twofold: aim grow rental rates while also producing higher yielding more valuable asset through asset quality improvement.",
  "item7": "annual market increases personnel compensation during year ended December 31, 2024, compared same period 2023; increase casualty-related charges/(recoveries), net $12.0 million primarily attributable increase claim charges due severe weather events decrease insurance recoveries during year ended December 31, 2024 compared same period 2023; increase other operating expenses $10.2 million primarily attributable increase legal-related expenses political contributions during year ended December 31, 2024, compared same period 2023. partially offset by: increase total property NOI $24.1 million primarily due higher revenue per occupied home, increase weighted average physical occupancy, NOI additional operating communities, partially offset increase property operating expenses decrease communities sold during 2023 2024; decrease net income attributable redeemable noncontrolling interests Operating Partnership DownREIT Partnership $23.9 million primarily attributed noncontrolling interests’ share gain partial sale four operating communities located various markets sale operating community located Hillsboro, Oregon during year ended December 31, 2023, compared sale one operating community located Arlington, Virginia same period 2024; increase income/(loss) unconsolidated entities $15.5 million primarily attributable $24.3 million loss consolidation related one Company’s preferred equity investments being consolidated during year ended December 31, 2023, partially offset $8.1 million non-cash impairment loss one Company’s preferred equity investments during year ended December 31, 2024 Apartment Community Operations net income results primarily NOI generated operation apartment communities. Company defines NOI, which non-GAAP financial measure, rental income less direct property rental expenses. Rental income represents gross market rent less adjustments concessions, vacancy loss bad debt.",
  "item2": "risks third parties who interest otherwise involved projects which interest, including mezzanine borrowers, joint venture partners other investors, do not perform expected; changing interest rates, which could increase interest costs affect market price securities; potential liability environmental contamination, which could result substantial costs us; imposition federal taxes if fail qualify REIT under Code any taxable year; internal control over financial reporting may not considered effective which could result loss investor confidence financial reports, turn adverse effect stock price; changes real estate laws, tax laws, rent control stabilization laws other laws affecting business. discussion these other factors affecting business prospects set forth Part II, Item 1A. Risk Factors. encourage investors review these risk factors."
}