{
  "source_file": "udr-20250930x10q.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with the consolidated financial statements appearing elsewhere herein and is based primarily on the consolidated financial statements for the three and nine months ended September 30, 2025 and 2024, of UDR, Inc.\n \nUnless the context otherwise requires, all references in this Quarterly Report on Form 10-Q (this “Report”) to “UDR,” the “Company,” “we,” “our” and “us” refer to UDR, Inc., together with its consolidated subsidiaries, including United Dominion Realty, L.P. (the “Operating Partnership” or the “OP”) and UDR Lighthouse DownREIT L.P. (the “DownREIT Partnership”).\n \n​\nForward-Looking Statements\nThis Report contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). Such forward-looking statements include, without limitation, statements concerning property acquisitions and dispositions, development activity and capital expenditures, capital raising activities, rent growth, occupancy and rental expense growth. Words such as “expects,” “anticipates,” “intends,” “plans,” “likely,” “will,” “believes,” “seeks,” “estimates,” and variations of such words and similar expressions are intended to identify such forward-looking statements. \nThe following factors, among others, could cause our future results to differ materially from those expressed in the forward-looking statements:\n●\ngeneral market and economic conditions;\n●\nthe impact of inflation/deflation, tariffs, geopolitical tensions and government shutdowns;\n●\nunfavorable changes in apartment market and economic conditions that could adversely affect occupancy levels and rental rates;\n●\nthe failure of acquisitions, developments or redevelopments to achieve anticipated results;\n●\npossible difficulty in selling apartment communities;\n●\ncompetitive factors that may limit our ability to lease apartment homes or increase or maintain rents;\n●\ninsufficient cash flow that could affect our debt financing and create refinancing risk;\n●\nfailure to generate sufficient revenue, which could impair our debt service payments and distributions to stockholders;\n●\ndevelopment and construction risks that may impact our profitability;\n●\npotential damage from natural disasters, including hurricanes, fires, floods, ice storms and other weather-related events, which could result in substantial costs to us;\n●\nrisks from climate change that impacts our properties or operations;\n●\nrisks from extraordinary losses for which we may not have insurance or adequate reserves;\n●\nrisks from cybersecurity breaches of our information technology systems and the information technology systems of our third party vendors and other third parties;\n●\nthe availability of capital and the stability of the capital markets;\n●\nchanges in job growth, home affordability and the demand/supply ratio for multifamily housing;\n●\nthe failure of automation or technology to help grow net operating income;\n●\nuninsured losses due to insurance deductibles, self-insurance retention, uninsured claims or casualties, or losses in excess of applicable coverage;\n●\ndelays in completing developments and lease-ups on schedule or at expected rent and occupancy levels;\n●\nour failure to succeed in new markets;\n41\n\n\nTable of Contents\n●\nrisks that third parties who have an interest in or are otherwise involved in projects in which we have an interest, including mezzanine borrowers, joint venture partners or other investors, do not perform as expected;\n●\nchanging interest rates, which could increase interest costs and affect the market price of our securities;\n●\npotential liability for environmental contamination, which could result in substantial costs to us;\n●\nthe imposition of federal taxes if we fail to qualify as a REIT under the Code in any taxable year;\n●\nour internal control over financial reporting may not be considered effective which could result in a loss of investor confidence in our financial reports, and in turn have an adverse effect on our stock price; and\n●\nchanges in real estate laws, tax laws, rent control or stabilization laws or other laws affecting our business.\nA discussion of these and other factors affecting our business and prospects is set forth in Part II, Item 1A. Risk Factors. We encourage investors to review these risk factors.\nAlthough we believe that the assumptions underlying the forward-looking statements contained herein are reasonable, any of the assumptions could be inaccurate, and therefore such statements included in this Report may not prove to be accurate. In light of the significant uncertainties inherent in the forward-looking statements included herein, the inclusion of such information should not be regarded as a representation by us or any other person that the results or conditions described in such statements or our objectives and plans will be achieved.\nForward-looking statements and such risks, uncertainties and other factors speak only as of the date of this Report, and we expressly disclaim any obligation or undertaking to update or revise any forward-looking statement contained herein, to reflect any change in our expectations with regard thereto, or any other change in events, conditions or circumstances on which any such statement is based, except to the extent otherwise required by law.\n​\nBusiness Overview\nWe are a self-administered real estate investment trust, or REIT, that owns, operates, acquires, renovates, develops, redevelops, disposes of, and manages multifamily apartment communities in targeted markets located in the United States. We were formed in 1972 as a Virginia corporation. In June 2003, we changed our state of incorporation from Virginia to Maryland. Our subsidiaries include the Operating Partnership and the DownREIT Partnership. \nAt September 30, 2025, our consolidated real estate portfolio included 168 communities in 12 states plus the District of Columbia totaling 55,808 apartment homes. In addition, we have an ownership interest in 11,193 completed or to-be-completed apartment homes through unconsolidated joint ventures or partnerships, including 6,766 apartment homes owned by entities in which we hold preferred equity investments. The \nSame-Store Community \napartment home population for the three and nine months ended September 30, 2025, was 54,915 and 54,442, respectively.\n42\n\n\nTable of Contents\nThe following table summarizes our same-store market information by major geographic markets as of and for the three and nine months ended September 30, 2025, as applicable:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30, 2025\n​\nThree Months Ended September 30, 2025\n​\nNine Months Ended September 30, 2025\n​\n  \n​\n  \n​\n  \nPercentage\n  \nTotal\n  \nWeighted\n  \nMonthly\n  \nWeighted\n  \nMonthly\n​\n​\nNumber of\n​\nNumber of\n​\nof Total \n​\nCarrying\n​\nAverage\n​\nIncome per \n​\nAverage\n​\nIncome per \n​\n​\nApartment\n​\nApartment\n​\nCarrying\n​\nValue (in\n​\nPhysical\n​\nOccupied\n​\nPhysical\n​\nOccupied\nSame-Store Communities\n​\nCommunities\n​\nHomes\n​\nValue\n​\nthousands)\n​\nOccupancy\n​\nHome (a)\n​\nOccupancy\n​\nHome (a)\nWest Region\n \n  \n \n  \n \n  \n \n​\n  \n​\n  \n \n​\n  \n \n  \n \n​\n  \nOrange County, CA\n \n 8\n \n 4,305\n \n 8.6\n% \n$\n 1,412,579\n​\n 96.6\n%\n$\n 3,197\n \n 97.0\n% \n$\n 3,163\nSan Francisco, CA\n \n 14\n \n 3,317\n \n 7.5\n% \n​\n 1,233,065\n​\n 97.6\n% \n​\n 3,615\n \n 97.4\n% \n​\n 3,623\nSeattle, WA\n \n 14\n \n 2,702\n \n 6.9\n%\n \n 1,129,140\n​\n 96.1\n%\n \n 2,989\n \n 96.9\n%\n \n 2,956\nMonterey Peninsula, CA\n \n 7\n \n 1,567\n \n 1.3\n%\n \n 206,700\n​\n 96.7\n%\n \n 2,402\n \n 96.3\n%\n \n 2,381\nLos Angeles, CA\n \n 4\n \n 1,225\n \n 3.0\n%\n \n 493,900\n​\n 96.3\n%\n \n 3,330\n \n 96.5\n%\n \n 3,282\nOther Southern California\n \n 3\n \n 821\n \n 1.4\n%\n \n 229,915\n​\n 96.3\n%\n \n 3,019\n \n 96.7\n%\n \n 2,976\nPortland, OR\n \n 2\n \n 476\n \n 0.4\n%\n \n 59,731\n​\n 95.6\n%\n \n 2,019\n \n 95.7\n%\n \n 1,994\nMid-Atlantic Region\n \n  \n \n  \n \n​\n​\n \n  \n​\n  \n​\n \n  \n \n  \n​\n \n  \nMetropolitan D.C.\n \n 24\n \n 9,119\n \n 16.3\n%\n \n 2,678,258\n​\n 96.8\n%\n \n 2,518\n \n 97.3\n%\n \n 2,477\nBaltimore, MD\n \n 7\n \n 2,219\n \n 3.5\n%\n \n 581,220\n​\n 96.2\n%\n \n 2,025\n \n 96.7\n%\n \n 2,011\nRichmond, VA\n \n 4\n \n 1,359\n \n 1.1\n%\n \n 178,434\n​\n 96.3\n%\n \n 1,966\n \n 96.7\n%\n \n 1,941\nNortheast Region\n \n  \n \n  \n \n​\n​\n \n  \n​\n  \n​\n \n  \n \n  \n​\n \n  \nBoston, MA\n \n 12\n \n 4,667\n \n 12.1\n%\n \n 1,984,546\n​\n 96.4\n%\n \n 3,395\n \n 96.8\n%\n \n 3,337\nNew York, NY\n \n 4\n \n 1,945\n \n 8.5\n%\n \n 1,392,353\n​\n 97.8\n%\n \n 5,264\n \n 97.9\n%\n \n 5,139\nPhiladelphia, PA\n​\n 4\n​\n 1,172\n​\n 2.7\n%\n​\n 445,591\n​\n 97.0\n%\n​\n 2,591\n​\n 97.0\n%\n​\n 2,554\nSoutheast Region\n \n  \n \n  \n \n​\n​\n \n  \n​\n  \n​\n \n  \n \n  \n​\n \n  \nTampa, FL\n \n 11\n \n 3,877\n \n 4.3\n%\n \n 710,245\n​\n 96.3\n%\n \n 2,164\n \n 96.7\n%\n \n 2,158\nOrlando, FL\n \n 11\n \n 3,493\n \n 3.6\n%\n \n 583,956\n​\n 96.4\n%\n \n 1,925\n \n 96.5\n%\n \n 1,920\nNashville, TN\n \n 8\n \n 2,261\n \n 1.7\n%\n \n 276,955\n​\n 95.9\n%\n \n 1,739\n \n 96.2\n%\n \n 1,742\nOther Florida\n \n 1\n \n 636\n \n 0.6\n%\n \n 98,589\n​\n 96.7\n%\n \n 2,421\n \n 96.4\n%\n \n 2,426\nSouthwest Region\n \n  \n \n  \n \n​\n​\n \n  \n​\n  \n​\n \n  \n \n  \n​\n \n  \nDallas, TX\n \n 19\n \n 7,364\n \n 8.1\n%\n \n 1,321,530\n​\n 96.9\n%\n \n 1,789\n \n 97.0\n%\n \n 1,778\nAustin, TX\n \n 6\n \n 1,880\n \n 2.0\n%\n \n 327,512\n​\n 97.0\n%\n \n 1,787\n \n 97.3\n%\n \n 1,800\nDenver, CO\n​\n 2\n​\n 510\n​\n 1.5\n%\n​\n 252,178\n​\n 95.9\n%\n​\n 2,868\n​\n 95.8\n%\n​\n 2,862\nTotal/Average Same-Store Communities\n \n 165\n \n 54,915\n \n 95.1\n%\n \n 15,596,397\n​\n 96.6\n%\n$\n 2,605\n \n 96.9\n%\n$\n 2,576\nNon-Mature, Commercial Properties & Other\n \n 3\n \n 893\n \n 4.6\n%\n \n 752,316\n​\n  \n​\n \n  \n \n  \n​\n \n  \nTotal Real Estate Held for Investment\n \n 168\n \n 55,808\n \n 99.7\n%\n \n 16,348,713\n​\n  \n​\n \n  \n \n  \n​\n \n  \nReal Estate Under Development (b)\n \n —\n \n —\n \n 0.3\n%\n \n 52,749\n​\n  \n​\n \n  \n \n  \n​\n \n  \nTotal Real Estate Owned\n \n 168\n \n 55,808\n \n 100.0\n%\n \n 16,401,462\n​\n  \n​\n \n  \n \n  \n​\n \n  \nTotal Accumulated Depreciation\n \n  \n \n  \n \n  \n​\n \n (7,320,363)\n​\n  \n​\n \n  \n \n  \n​\n \n  \nTotal Real Estate Owned, Net of Accumulated Depreciation\n \n  \n \n  \n \n  \n​\n$\n 9,081,099\n​\n  \n​\n \n  \n \n  \n​\n \n  \n(a)\nMonthly Income per Occupied Home represents total monthly revenues divided by the average physical number of occupied apartment homes in our Same-Store portfolio.\n(b)\nAs of September 30, 2025, the Company was developing one wholly-owned community with a total of 300 apartment homes, none of which have been completed.\nWe report in two segments: \nSame-Store Communities\n and \nNon-Mature Communities/Other\n.\nOur \nSame-Store Communities\n segment represents those communities acquired, developed, and stabilized prior to July 1, 2024 (for quarter-to-date comparison) and January 1, 2024 (for year-to-date comparison) and held as of September 30, 2025. These communities were owned and had stabilized occupancy and operating expenses as of the beginning of the prior period, there is no plan to conduct substantial redevelopment activities, and the communities are not classified as held for disposition within the current year. A community is considered to have stabilized occupancy once it achieves 90% occupancy for at least three consecutive months.\n43\n\n\nTable of Contents\nOur\n Non-Mature Communities/Other\n segment represents those communities that do not meet the criteria to be included in \nSame-Store Communities\n, including, but not limited to, recently acquired, developed and redeveloped communities, and the non-apartment components of mixed use properties.\n​\nLiquidity and Capital Resources \nLiquidity is the ability to meet present and future financial obligations either through operating cash flows, sales of properties, borrowings under our credit agreements, and/or the issuance of debt and/or equity securities. Our primary source of liquidity is our cash flow from operations, as determined by rental rates, occupancy levels, and operating expenses related to our portfolio of apartment homes, and borrowings under our credit agreements. We routinely use our working capital credit facility, our unsecured revolving credit facility and issuances of commercial paper to temporarily fund certain investing and financing activities prior to arranging for longer-term financing or the issuance of equity or debt securities. During the past several years, proceeds from the sale of real estate have been used for both investing and financing activities as we continue to execute on maintaining a diversified portfolio.\nWe expect to meet our short-term liquidity requirements generally through net cash provided by property operations and borrowings under our credit agreements and our unsecured commercial paper program. We expect to meet certain long-term liquidity requirements such as scheduled debt maturities, the repayment of financing on development activities, and potential property acquisitions, through net cash provided by property operations, secured and unsecured borrowings, the issuance of debt or equity securities, and/or the disposition of properties. We believe that our net cash provided by property operations and borrowings under our credit agreements and our unsecured commercial paper program will continue to be adequate to meet both operating requirements and the payment of dividends by the Company in accordance with REIT requirements. Likewise, the budgeted expenditures for improvements and renovations of certain properties are expected to be funded from property operations, borrowings under credit agreements, the issuance of debt or equity securities, and/or dispositions of properties.\nWe have a shelf registration statement filed with the Securities and Exchange Commission, or “SEC,” which provides for the issuance of common stock, preferred stock, depositary shares, debt securities, guarantees of debt securities, warrants, subscription rights, purchase contracts and units to facilitate future financing activities in the public capital markets. Access to capital markets is dependent on market conditions at the time of issuance.\nIn July 2021, the Company entered into an ATM sales agreement under which the Company may offer and sell up to 20.0 million shares of its common stock, from time to time, to or through its sales agents and may enter into separate forward sales agreements to or through its forward purchasers. Upon entering into the ATM sales agreement, the Company simultaneously terminated the sales agreement for its prior at-the-market equity offering program, which was entered into in July 2017. During the three and nine months ended September 30, 2025, the Company did not sell any shares of common stock through its ATM program. As of September 30, 2025, we had 14.0 million shares of common stock available for future issuance under the ATM program.\nIn connection with any forward sales agreement under the Company’s ATM program, the relevant forward purchasers will borrow from third parties and, through the relevant sales agent, acting in its role as forward seller, sell a number of shares of the Company’s common stock equal to the number of shares underlying the agreement. The Company does not initially receive any proceeds from any sale of borrowed shares by the forward seller.\nDuring the three and nine months ended September 30, 2025, the Company repurchased 0.7 million shares of its common stock at an average price of $38.37 per share for total consideration of approximately $25.0 million under its share repurchase program. In October 2025, the Company repurchased an additional 0.3 million shares of its common stock at an average price of $36.14 per share for total consideration of approximately $10.0 million under its share repurchase program.\n​\nThe Company has a $1.3 billion unsecured revolving credit facility (the “Revolving Credit Facility”) and a $350.0 million unsecured term loan (the “Term Loan”). The credit agreement for these facilities (the “Credit Agreement”) allows the total commitments under the Revolving Credit Facility and the total borrowings under the Term Loan to be increased to an aggregate maximum amount of up to $2.5 billion, subject to certain conditions, including obtaining commitments from one or more lenders. The Revolving Credit Facility has a scheduled maturity date of August 31, 2028, with two six-month extension options, subject to certain conditions. In September 2025, the Company amended the Term Loan to extend the maturity date to January 2029, with two one-year extension options, subject to certain conditions. The Term Loan was previously set to mature on January 31, 2027.\n44\n\n\nTable of Contents\n​\nThe Company has an unsecured commercial paper program. Under the terms of the program, the Company may issue unsecured commercial paper up to a maximum aggregate amount outstanding of $700.0 million. The notes are sold under customary terms in the United States commercial paper market and rank pari passu with all of the Company’s other unsecured indebtedness. The notes are fully and unconditionally guaranteed by the Operating Partnership. As of September 30, 2025, we had issued $340.0 million of commercial paper, for one month terms, at a weighted average annualized rate of 4.32%, leaving $360.0 million of unused capacity.\n​\nFuture Capital Needs\nFuture development and redevelopment expenditures may be funded through unsecured or secured credit facilities, unsecured commercial paper, proceeds from the issuance of equity or debt securities, sales of properties, joint ventures, and, to a lesser extent, from cash flows provided by property operations. Acquisition activity in strategic markets may be funded through joint ventures, by the reinvestment of proceeds from the sale of properties, through the issuance of equity or debt securities, the issuance of operating partnership units and the assumption or placement of secured and/or unsecured debt.\nDuring the remainder of 2025, we have approximately $129.2 million of secured debt maturing, inclusive of principal amortization, and $340.0 million of unsecured debt maturing, comprised solely of unsecured commercial paper. We anticipate repaying the remaining debt with cash flow from our operations, proceeds from debt or equity offerings, proceeds from dispositions of properties, or from borrowings under our credit agreements and our unsecured commercial paper program.\nWe do not have any off-balance sheet arrangements that have, or are reasonably likely to have, a current or future effect on our financial condition, changes in financial condition, revenue or expenses, results of operations, liquidity, capital expenditures or capital resources that are material.\nGuarantor Subsidiary Summarized Financial Information\n​\nUDR has certain outstanding debt securities that are guaranteed by the Operating Partnership. With respect to this debt, as further outlined below, the Operating Partnership fully and unconditionally guarantees payment of any principal, premium and interest in full to the holders thereof. The Operating Partnership is a subsidiary of UDR, through which UDR conducts a significant portion of its business and holds a substantial amount of its assets. UDR also conducts business through other subsidiaries, including its taxable REIT subsidiaries. In addition to its ownership interest in the Operating Partnership, UDR holds interests in subsidiaries and joint ventures, owns and operates properties, issues securities from time to time and guarantees debt of certain of its subsidiaries. UDR\n, as the sole general partner of the Operating Partnership, owns 100 percent of the Operating Partnership’s general partnership interests and approximately 95 percent of its limited partnership interests and, by virtue thereof, has the ability to control all of the day-to-day operations of the Operating Partnership. UDR has concluded that it is the primary beneficiary of, and therefore consolidates, the Operating Partnership.\n​\nThe Operating Partnership is the subsidiary guarantor of certain of our registered debt securities, including the $300 million of medium-term notes due September 2026, $300 million of medium-term notes due July 2027, $300 million of medium-term notes due January 2028, $300 million of medium-term notes due January 2029, $600 million of medium-term notes due January 2030, $600 million of medium-term notes due August 2031, $400 million of medium-term notes due August 2032, $350 million of medium-term notes due March 2033, $300 million of medium-term notes due in June 2033, $300 million of medium-term notes due September 2034 and $300 million of medium-term notes due November 2034. \n​\nThe Operating Partnership fully and unconditionally guarantees payment of any principal, premium and interest in full to the holders of the notes described above. The guarantee forms part of the indenture under which the notes were issued. If, for any reason, we do not make any required payment in respect of the notes when due, the Operating Partnership will cause the payment to be made to, or to the order of, the applicable paying agent on behalf of the trustee. Holders of the notes may enforce their rights under the guarantee directly against the Operating Partnership without first making a demand or taking action against UDR or any other person or entity. The Operating Partnership may, without the consent of the holders of the notes, assume all of our rights and obligations under the notes and, upon such assumption, we will be released from our liabilities under the indenture and the notes.\n​\nThe notes are UDR’s unsecured general obligations and rank equally with all of UDR’s other unsecured and unsubordinated indebtedness outstanding from time to time. As a result, our payment of amounts due on the notes is subordinated to all of our existing and future secured obligations to the extent of the value of the collateral pledged toward any such secured obligation. Our payment of amounts due on the notes also is effectively subordinated to all liabilities, whether \n45\n\n\nTable of Contents\nsecured or unsecured, of any of our non-guarantor subsidiaries because, in the event of a bankruptcy, liquidation, dissolution, reorganization or similar proceeding with respect to such subsidiaries, we, as an equity holder of such subsidiaries, would not receive distributions from such subsidiaries until claims of any creditors of such subsidiaries are satisfied.\n​\nThe following tables present the summarized financial information for the Operating Partnership as of September 30, 2025 and December 31, 2024, and for the three and nine months ended September 30, 2025 and 2024. The information presented below excludes eliminations necessary to arrive at the information on a consolidated basis (dollars in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSeptember 30, \n​\nDecember 31, \n​\n    \n2025\n    \n2024\nTotal real estate, net\n \n$\n 2,512,849\n \n$\n 2,562,075\nOperating lease right-of-use assets\n​\n \n 184,934\n​\n \n 187,886\nOther assets\n​\n \n 35,675\n​\n \n 47,907\nTotal assets\n \n$\n 2,733,458\n \n$\n 2,797,868\n​\n​\n​\n​\n​\n​\n​\nSecured debt, net\n​\n$\n 376,377\n​\n$\n 377,724\nNotes payable to UDR (a)\n​\n​\n 1,531,731\n​\n​\n 1,429,849\nOperating lease liabilities\n​\n​\n 180,308\n​\n​\n 183,215\nOther liabilities\n​\n \n 157,455\n​\n \n 139,910\nTotal liabilities\n​\n \n 2,245,871\n​\n \n 2,130,698\nTotal capital\n​\n$\n 487,587\n​\n$\n 667,170\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThree Months Ended \n​\nNine Months Ended \n​\n​\nSeptember 30, \n​\nSeptember 30, \n​\n​\n2025\n \n2024\n    \n2025\n    \n2024\nTotal revenue\n \n$\n 154,564\n \n$\n 150,762\n​\n$\n 459,592\n \n$\n 448,452\nProperty operating expenses\n​\n \n (61,581)\n​\n \n (69,304)\n​\n \n (186,168)\n​\n \n (202,800)\nReal estate depreciation and amortization\n​\n \n (47,206)\n​\n \n (47,262)\n​\n \n (139,896)\n​\n \n (142,014)\nOperating income/(loss)\n​\n \n 45,777\n​\n \n 34,196\n​\n \n 133,528\n​\n \n 103,638\nInterest expense (a)\n​\n \n (18,955)\n​\n \n (17,771)\n​\n \n (55,278)\n​\n \n (52,050)\nOther income/(loss)\n​\n \n (1,331)\n​\n \n 1,805\n​\n \n (4,384)\n​\n \n 4,141\nNet income/(loss)\n \n$\n 25,491\n \n$\n 18,230\n​\n$\n 73,866\n \n$\n 55,729\n(a)\nAll $1.5 billion and $1.4 billion notes payable to UDR as of September 30, 2025 and December 31, 2024, respectively, and $14.7 million and $13.7 million of interest expense on notes payable to UDR for the three months ended September 30, 2025 and 2024, respectively, and $42.4 million and $39.9 million of interest expense on notes payable to UDR for the nine months ended September 30, 2025 and 2024, respectively, eliminate upon consolidation of UDR’s consolidated financial statements.\n​\nCritical Accounting Policies and Estimates and New Accounting Pronouncements\nOur critical accounting policies are those having the most impact on the reporting of our financial condition and results and those requiring significant judgments and estimates. These policies include those related to (1) capital expenditures, (2) impairment of long-lived assets, (3) real estate investment properties, and (4) revenue recognition.\nOur critical accounting policies are described in more detail in the section entitled “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in UDR’s Annual Report on Form 10-K, filed with the SEC on February 18, 2025. There have been no significant changes in our critical accounting policies from those reported in our Form 10-K filed with the SEC on February 18, 2025. With respect to these critical accounting policies, we believe that the application of judgments and assessments is consistently applied and produces financial information that fairly depicts the results of operations for all periods presented.\nStatements of Cash Flows\nThe following discussion explains the changes in \nNet cash provided by/(used in) operating activities\n, \nNet cash provided by/(used in) investing activities\n, and \nNet cash provided by/(used in) financing activities\n that are presented in our Consolidated Statements of Cash Flows for the nine months ended September 30, 2025 and 2024.\n46\n\n\nTable of Contents\nOperating Activities\nFor the nine months ended September 30, 2025, our \nNet cash provided by/(used in) operating activities\n was $641.5 million, compared to $636.3 million for the comparable period in 2024. The increase in cash flow from operating activities was primarily due to an increase in NOI, primarily driven by \nhigher revenue per occupied home and an increase in weighted average physical occupancy and an increase in operating distributions from our unconsolidated joint ventures and partnerships\n, partially offset by changes in operating assets and liabilities\n. \nInvesting Activities\nFor the nine months ended September 30, 2025, \nNet cash provided by/(used in) investing activities\n was $(154.1) million, compared to $(227.6) million for the comparable period in 2024. The decrease in cash used in investing activities was primarily due to an increase in proceeds from the sales of real estate investments, a decrease in spend for development of real estate assets and an increase in distributions received from unconsolidated joint ventures and partnerships, partially offset by an increase from the issuance of notes receivables during the current period compared to the prior year period, an increase in spend in non-real estate capital expenditures, and an increase in investments in unconsolidated joint ventures and partnerships.\nDispositions\n​\nIn January 2025, the Company sold two operating communities located in Brooklyn, New York and Englewood, New Jersey with a total of 373 apartment homes for gross proceeds of $211.5 million, resulting in gains of approximately $47.9 million. Both operating communities were classified as held for disposition as of December 31, 2024.\n​\nCapital Expenditures\nWe capitalize those expenditures that materially enhance the value of an existing asset or substantially extend the useful life of an existing asset. Expenditures necessary to maintain an existing property in ordinary operating condition are expensed as incurred.\nFor the nine months ended September 30, 2025, total capital expenditures of $196.2 million, or $3,545 per stabilized home, which in aggregate include recurring capital expenditures and major renovations, were spent across our portfolio, excluding development, as compared to $191.3 million, or $3,458 per stabilized home, for the comparable period in 2024.\nThe increase in total capital expenditures was primarily due to:\n●\nan increase of 6.4%, or $4.5 million, in recurring capital expenditures, which includes asset preservation expenditures and turnover-related expenditures; and\n●\nan increase of 6.0%, or $3.3 million, in major renovations, which includes major structural changes and/or architectural revisions to existing buildings.\nThis was partially offset by:\n●\na decrease of 6.4%, or $4.1 million, in NOI enhancing improvements, such as kitchen and bath remodels and upgrades to common areas.\n47\n\n\nTable of Contents\nThe following table outlines capital expenditures and repair and maintenance costs for all of our communities, excluding real estate under development, for the nine months ended September 30, 2025 and 2024 (\ndollars in thousands except Per Home amounts\n):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPer Home\n \n​\n​\nNine Months Ended September 30, \n​\nNine Months Ended September 30, \n \n​\n    \n2025\n    \n2024\n    \n% Change\n    \n2025\n    \n2024\n    \n% Change\n \nTurnover capital expenditures\n​\n$\n 12,915\n​\n$\n 14,550\n \n (11.2)\n%  \n$\n 233\n​\n$\n 263\n \n (11.4)\n%\nAsset preservation expenditures\n​\n \n 61,628\n​\n \n 55,493\n \n 11.1\n%  \n \n 1,114\n​\n \n 1,003\n \n 11.1\n%\nTotal recurring capital expenditures\n​\n \n 74,543\n​\n \n 70,043\n \n 6.4\n%  \n \n 1,347\n​\n \n 1,266\n \n 6.4\n%\nNOI enhancing improvements (a)\n​\n \n 59,836\n​\n \n 63,933\n \n (6.4)\n%  \n \n 1,082\n​\n \n 1,156\n \n (6.4)\n%\nMajor renovations (b)\n​\n \n 57,338\n​\n \n 54,087\n \n 6.0\n%  \n \n 1,036\n​\n \n 978\n \n 5.9\n%\nOperations platform\n​\n​\n 4,433\n​\n​\n 3,227\n​\n 37.4\n%  \n​\n 80\n​\n​\n 58\n​\n 37.9\n%\nTotal capital expenditures (c)\n​\n$\n 196,150\n​\n$\n 191,290\n \n 2.5\n%  \n$\n 3,545\n​\n$\n 3,458\n \n 2.5\n%\nRepair and maintenance expense\n​\n$\n 79,057\n​\n$\n 76,943\n \n 2.7\n%  \n$\n 1,429\n​\n$\n 1,391\n \n 2.7\n%\nAverage home count (d)\n​\n \n 55,326\n​\n \n 55,306\n \n —\n%  \n​\n​\n​\n​\n​\n​\n​\n​\n(a)\nNOI enhancing improvements are expenditures that we believe will result in increased income generation or decreased expense growth.\n(b)\nMajor renovations include major structural changes and/or architectural revisions to existing buildings.\n(c)\nTotal capital expenditures includes amounts capitalized during the year. Cash paid for capital expenditures is impacted by the net change in related accruals.\n(d)\nAverage number of homes is calculated based on the number of homes outstanding at the end of each month.\nWe intend to continue to selectively add NOI enhancing improvements, which we believe will provide a return on investment in excess of our cost of capital. Our objective in redeveloping a community is twofold: we aim to meaningfully grow rental rates while also achieving cap rate compression through asset quality improvement.\nConsolidated Real Estate Under Development and Redevelopment\nAt September 30, 2025, \nour development pipeline consisted of one wholly-owned community totaling 300 apartment homes, none of which have been completed, with a budget of $133.6 million, in which we have a gross carrying value of $52.7 million. The homes are estimated to be completed during the second quarter of 2027\n. In addition, the Company is incurring and capitalizing costs directly related to predevelopment activities in preparation of future development commencements.\nAt September 30, 2025, the Company had no communities at which it was conducting substantial redevelopment activities.\nUnconsolidated Joint Ventures and Partnerships\nThe Company recognizes income or losses from our investments in unconsolidated joint ventures and partnerships consisting of our proportionate share of the net income or losses of the joint ventures and partnerships. In addition, we may earn fees for providing management services to the communities held by the unconsolidated joint ventures and partnerships.\nThe Company’s \nInvestment in and advances to unconsolidated joint ventures and partnerships, net\n, are accounted for under the equity method of accounting. For the nine months ended September 30, 2025:\n●\nwe made investments totaling $81.7 million in our unconsolidated joint ventures and partnerships;\n●\nour proportionate share of the net income/(loss) of the joint ventures and partnerships was $23.5 million; and\n●\nwe received distributions of $112.3 million, of which $39.8 million were operating cash flows and \n$72.5\n million were investing cash flows.\nWe evaluate our investments in unconsolidated joint ventures and partnerships when events or changes in circumstances indicate that there may be an other-than-temporary decline in value. We consider various factors to determine if a decrease in the value of the investment is other-than-temporary. The Company did not incur any other-than-temporary impairments in the value of its investments in unconsolidated joint ventures during the three and nine months ended September 30, 2025. For the three and nine months ended September 30, 2024, the Company recorded an $8.1 million non-cash \n48\n\n\nTable of Contents\nimpairment loss on one of its preferred equity investment (recorded in \nIncome/(loss) from unconsolidated entities\n on the Consolidated Statements of Operations) due to a decrease in the value of the operating community that it deemed to be other-than-temporary.\nFinancing Activities\nFor the nine months ended September 30, 2025, our \nNet cash provided by/(used in) financing activities\n was $(486.6) million, compared to $(408.0) million for the comparable period of 2024.\nThe following significant financing activities occurred during the nine months ended September 30, 2025:\n●\nrepaid $49.1 million of secured debt;\n●\nreceived net proceeds of $50.1 million, net on our unsecured commercial paper program;\n●\nreceived net proceeds of $6.3 million on our revolving bank debt;\n●\nrepurchased 0.7 million common shares for approximately $25.0 million,\n●\npaid $29.8 million of distributions to redeemable noncontrolling interests; and\n●\npaid $425.6 million of distributions to our common stockholders.\n​\nCredit Facilities and Commercial Paper Program\nThe Company has a $1.3 billion unsecured revolving credit facility (the “Revolving Credit Facility”) and a $350.0 million unsecured term loan (the “Term Loan”). The credit agreement for these facilities (the “Credit Agreement”) allows the total commitments under the Revolving Credit Facility and the total borrowings under the Term Loan to be increased to an aggregate maximum amount of up to $2.5 billion, subject to certain conditions, including obtaining commitments from one or more lenders. The Revolving Credit Facility has a scheduled maturity date of August 31, 2028, with two six-month extension options, subject to certain conditions. In September 2025, the Company amended the Term Loan to extend the maturity date to January 2029, with two one-year extension options, subject to certain conditions. The Term Loan was previously set to mature on January 31, 2027.\n​\nBased on the Company’s current credit rating, the Revolving Credit Facility has an interest rate equal to SOFR plus a margin of 77.5 basis points and a facility fee of 15 basis points, and the Term Loan has an interest rate equal to SOFR plus a margin of 85.0 basis points. Depending on the Company’s credit rating, the margin under the Revolving Credit Facility ranges from 70 to 140 basis points, the facility fee ranges from 10 to 30 basis points, and the margin under the Term Loan ranges from 75 to 160 basis points. In addition, the Credit Agreement allows for the Company in consultation with the sustainability structuring agent to propose key performance indicators with respect to certain environmental, social, and governance goals of the Company, and thresholds or targets with respect thereto, and a related amendment to the Credit Agreement, that if entered into may allow a change in the applicable margin for the Term Loan of up to five basis points\n.\nAs of September 30, 2025, we had no outstanding borrowings under the Revolving Credit Facility, leaving $1.3 billion of unused capacity (excluding $4.3 million of letters of credit at September 30, 2025), and $350.0 million of outstanding borrowings under the Term Loan.\nThe Company has a working capital credit facility, which provides for a $75.0 million unsecured revolving credit facility (the “Working Capital Credit Facility”) with a scheduled maturity date of January 12, 2026. Based on the Company’s current credit rating, the Working Capital Credit Facility has an interest rate equal to Adjusted SOFR plus a margin of 77.5 basis points. Depending on the Company’s credit rating, the margin ranges from 70 to 140 basis points. \nAs of September 30, 2025, we had $15.7 million of outstanding borrowings under the Working Capital Credit Facility, leaving $59.3 million of unused capacity.\nThe bank revolving credit facilities and the term loan are subject to customary financial covenants and limitations, all of which we were in compliance with at September 30, 2025.\n49\n\n\nTable of Contents\nThe Company has an unsecured commercial paper program. Under the terms of the program, the Company may issue unsecured commercial paper up to a maximum aggregate amount outstanding of $700.0 million. The notes are sold under customary terms in the United States commercial paper market and rank pari passu with all of the Company’s other unsecured indebtedness. The notes are fully and unconditionally guaranteed by the Operating Partnership. As of September 30, 2025, we had issued $340.0 million of commercial paper, for one month terms, at a weighted average annualized rate of 4.32%, leaving $360.0 million of unused capacity. \nInterest Rate Risk\nWe are exposed to interest rate risk associated with variable rate notes payable and maturing debt that has to be refinanced. We do not hold financial instruments for trading or other speculative purposes, but rather issue these financial instruments to finance our portfolio of real estate assets and operations. Interest rate sensitivity is the relationship between changes in market interest rates and the fair value of market rate sensitive assets and liabilities. Our earnings are affected as changes in short-term interest rates impact our cost of variable rate debt and maturing fixed rate debt. We had $557.7 million in variable rate debt that is not subject to interest rate swap contracts as of September 30, 2025. If market interest rates for variable rate debt increased by 100 basis points, our interest expense for the nine months ended September 30, 2025 would increase by $4.4 million based on the average balance outstanding during the period.\nThese amounts are determined by considering the impact of hypothetical interest rates on our borrowing cost. This analysis does not consider the effects of the adjusted level of overall economic activity that could exist in such an environment or actions we may take to further mitigate our exposure to the change. However, due to the uncertainty of the specific actions that would be taken and their possible effects, the sensitivity analysis assumes no change in our financial structure.\nThe Company also utilizes derivative financial instruments to manage interest rate risk and generally designates these financial instruments as cash flow hedges. See Note 11, \nDerivatives and Hedging Activities\n, in the Notes to the UDR Consolidated Financial Statements included in this Report for additional discussion of derivative instruments.\nA presentation of cash flow metrics based on GAAP is as follows (\ndollars in thousands\n):\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNine Months Ended September 30, \n​\n​\n2025\n    \n2024\nNet cash provided by/(used in) operating activities\n    \n$\n 641,480\n    \n$\n 636,312\nNet cash provided by/(used in) investing activities\n​\n \n (154,065)\n \n \n (227,593)\nNet cash provided by/(used in) financing activities\n​\n \n (486,596)\n \n \n (408,033)\n​\n​\nResults of Operations\nThe following discussion explains the changes in results of operations that are presented in our Consolidated Statements of Operations for the three and nine months ended September 30, 2025 and 2024.\nNet Income/(Loss) Attributable to Common Stockholders\nNet income/(loss) attributable to common stockholders was $39.2 million ($0.12 per diluted share) for the three months ended September 30, 2025, as compared to $21.4 million ($0.06 per diluted share) for the comparable period in the prior year. The increase resulted primarily from the following items, all of which are discussed in further detail elsewhere within this Report:\n●\nan increase in income/(loss) from unconsolidated entities of $15.9 million primarily due to no non-cash impairment losses during the three months ended September 30, 2025, as compared to an $8.1 million non-cash impairment loss on one of the Company’s preferred equity investments during the same period in 2024, $3.9 million of higher unrealized gains on technology investments, a $2.6 million increase from unconsolidated joint ventures primarily attributable to higher NOI and a reduction in depreciation and amortization expense, and higher income from preferred equity investments during the three months ended September 30, 2025.\n●\nan increase in total property NOI of $7.7 million primarily due to \nhigher revenue per occupied home, an increase in weighted average physical occupancy and NOI from additional operating communities, \npartially offset by an increase in property operating expenses and a decrease from communities sold during 2024 and 2025; and\n50\n\n\nTable of Contents\n●\na decrease in real estate depreciation expense of $4.4 million primarily due to assets that became fully depreciated and assets sold in 2024 and 2025, partially offset by an acquired community in 2025 and development communities completed in 2024.\nThis was partially offset by: \n​\n●\nan increase in other depreciation and amortization of $3.0 million primarily due to $3.3 million of software transition related costs incurred during the three months ended September 30, 2025, as compared to none during the three months ended September 30, 2024; and\n●\na decrease in interest income and other income/(expense), net of $2.4 million primarily due to lower interest income earned during the three months ended September 30, 2025 as compared to the same period in 2024, due to lower notes receivable balances.\nNet income/(loss) attributable to common stockholders was $151.2 million ($0.46 per diluted share) for the nine months ended September 30, 2025, as compared to $91.0 million ($0.28 per diluted share) for the comparable period in the prior year. The increase resulted primarily from the following items, all of which are discussed in further detail elsewhere within this Report:\n●\ngains on the sale of real estate of $47.9 million from the sale of two operating communities located in Englewood, New Jersey and Brooklyn, New York during the nine months ended September 30, 2025, as compared to a gain on the sale of real estate of $16.9 million from the sale of an operating community located in Arlington, Virginia during the nine months ended September 30, 2024;\n●\nan increase in total property NOI of $19.8 million primarily due to \nhigher revenue per occupied home, an increase in weighted average physical occupancy and NOI from additional operating communities, \npartially offset by an increase in property operating expenses and a decrease from communities sold during 2024 and 2025;\n●\na decrease in real estate depreciation expense of $20.1 million primarily due to assets that became fully depreciated and assets sold in 2024 and 2025, partially offset by an acquired community in 2025 and development communities completed in 2024; and\n●\nan increase in income/(loss) from unconsolidated entities of $12.2 million primarily due to no non-cash impairment losses during the nine months ended September 30, 2025, as compared to an $8.1 million non-cash impairment loss on one of the Company’s preferred equity investments during the same period in 2024 and a $7.4 million increase from unconsolidated joint ventures primarily attributable to higher NOI and a reduction in depreciation and amortization expense partially offset by lower income due to the repayments and partial paydowns received from certain preferred equity investments during the nine months ended September 30, 2025.\nThis was partially offset by: \n​\n●\nan increase in other depreciation and amortization of $8.4 million primarily due to $9.3 million of software transition related costs incurred during the nine months ended September 30, 2025, as compared to none during the nine months ended September 30, 2024; and\n●\na decrease in interest income and other income/(expense), net of $4.8 million primarily due to lower interest income earned during the nine months ended September 30, 2025 as compared to the same period in 2024, due to lower notes receivable balances.\nApartment Community Operations\nOur net income results are primarily from NOI generated from the operation of our apartment communities. The Company defines NOI, which is a non-GAAP financial measure, as rental income less direct property rental expenses. Rental income represents gross market rent less adjustments for concessions, vacancy loss and bad debt. Rental expenses include real estate taxes, insurance, personnel, utilities, repairs and maintenance, administrative and marketing. Excluded from NOI is property management expense, which is calculated as 3.25% of property revenue, and land rent. Property management expense \n51\n\n\nTable of Contents\ncovers costs directly related to consolidated property operations, inclusive of corporate management, regional supervision, accounting and other costs.\nManagement considers NOI a useful metric for investors as it is a more meaningful representation of a community’s continuing operating performance than net income as it is prior to corporate-level expense allocations, general and administrative costs, capital structure and depreciation and amortization.\nAlthough the Company considers NOI a useful measure of operating performance, NOI should not be considered an alternative to net income or net cash flow from operating activities as determined in accordance with GAAP. NOI excludes several income and expense categories as detailed in the reconciliation of NOI to \nNet income/(loss) attributable to UDR, Inc.\n below.\nThe following table summarizes the operating performance of our total property NOI for each of the periods presented \n(dollars in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThree Months Ended \n​\n​\n​\n​\nNine Months Ended \n​\n​\n​\n​\n​\nSeptember 30,  (a)\n​\n​\n​\n​\nSeptember 30,  (b)\n​\n​\n​\n​\n    \n2025\n    \n2024\n    \n%\n \nChange\n    \n​\n2025\n    \n2024\n    \n%\n \nChange\n​\nSame-Store Communities:\n​\n​\n​\n  \n​\n​\n  \n​\n  \n​\n​\n​\n  \n​\n​\n​\n​\n​\nSame-Store rental income\n​\n$\n 414,657\n  \n$\n 404,241\n  \n 2.6\n%  \n​\n$\n 1,223,180\n  \n$\n 1,192,680\n​\n 2.6\n%\nSame-Store operating expense (c)\n​\n \n (131,824)\n  \n \n (127,871)\n  \n 3.1\n%  \n​\n \n (385,455)\n  \n \n (375,346)\n​\n 2.7\n%\nSame-Store NOI\n​\n \n 282,833\n  \n \n 276,370\n  \n 2.3\n%  \n​\n \n 837,725\n  \n \n 817,334\n​\n 2.5\n%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNon-Mature Communities/Other NOI:\n​\n​\n​\n  \n​\n​\n  \n​\n  \n​\n​\n​\n  \n​\n​\n​\n​\n​\nStabilized, non-mature communities NOI (d)\n​\n​\n 2,890\n  \n \n 775\n​\nNM\n*\n​\n​\n 13,611\n​\n​\n 5,508\n​\nNM\n*\nAcquired communities NOI\n​\n \n 1,691\n  \n \n —\n  \nN/A\n​\n​\n \n 2,236\n  \n \n —\n​\nN/A\n​\nNon-residential/other NOI (e)\n​\n​\n 4,721\n  \n \n 4,254\n​\n 11.0\n%  \n​\n​\n 13,797\n​\n​\n 15,270\n​\n (9.6)\n%\nSold and held for disposition communities NOI\n​\n​\n —\n  \n \n 3,023\n​\n (100.0)\n%  \n​\n​\n 247\n​\n​\n 9,707\n​\n (97.5)\n%\nTotal Non-Mature Communities/Other NOI\n​\n \n 9,302\n  \n \n 8,052\n  \n 15.5\n%  \n​\n \n 29,891\n  \n \n 30,485\n​\n (1.9)\n%\nTotal property NOI\n​\n$\n 292,135\n  \n$\n 284,422\n  \n 2.7\n%\n​\n$\n 867,616\n  \n$\n 847,819\n​\n 2.3\n%\n* \nNot meaningful\n(a)\nSame-Store consists of 54,915 apartment homes.\n(b)\nSame-Store consists of 54,442 apartment homes.\n(c)\nExcludes depreciation, amortization, and property management expenses.\n(d)\nRepresents non-mature communities that have achieved 90% occupancy for three consecutive months but do not meet the criteria to be included in Same-Store Communities.\n(e)\nPrimarily non-residential retail revenue and expense.\n​\n52\n\n\nTable of Contents\nThe following table is our reconciliation of \nNet income/(loss) attributable to UDR, Inc.\n to total property NOI for each of the periods presented (\ndollars in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThree Months Ended \n​\nNine Months Ended \n​\n​\n​\nSeptember 30, \n​\nSeptember 30, \n​\n​\n    \n2025\n    \n2024\n    \n2025\n    \n2024\n​\nNet income/(loss) attributable to UDR, Inc.\n​\n$\n 40,409\n​\n$\n 22,597\n​\n$\n 154,802\n​\n$\n 94,629\n​\nJoint venture management and other fees\n​\n \n (2,570)\n​\n \n (2,072)\n​\n \n (7,080)\n​\n \n (6,029)\n​\nProperty management\n​\n \n 13,952\n​\n \n 13,588\n​\n \n 41,344\n​\n \n 40,400\n​\nOther operating expenses\n​\n \n 6,975\n​\n \n 6,382\n​\n \n 22,787\n​\n \n 20,803\n​\nReal estate depreciation and amortization\n​\n \n 165,926\n​\n \n 170,276\n​\n \n 490,511\n​\n \n 510,622\n​\nGeneral and administrative\n​\n \n 22,732\n​\n \n 20,890\n​\n \n 62,156\n​\n \n 58,836\n​\nCasualty-related charges/(recoveries), net\n​\n \n 1,755\n​\n \n 1,473\n​\n \n 8,434\n​\n \n 8,749\n​\nOther depreciation and amortization\n​\n \n 7,009\n​\n \n 4,029\n​\n \n 21,463\n​\n \n 13,024\n​\n(Gain)/loss on sale of real estate owned\n​\n​\n —\n​\n​\n —\n​\n​\n (47,939)\n​\n​\n (16,867)\n​\n(Income)/loss from unconsolidated entities\n​\n \n (14,011)\n​\n \n 1,880\n​\n \n (23,454)\n​\n \n (11,251)\n​\nInterest expense\n​\n \n 50,569\n​\n \n 50,214\n​\n \n 146,935\n​\n \n 146,087\n​\nInterest income and other (income)/expense, net\n​\n \n (3,714)\n​\n \n (6,159)\n​\n \n (13,769)\n​\n \n (18,522)\n​\nTax provision/(benefit), net\n​\n \n 382\n​\n \n (156)\n​\n \n 798\n​\n \n 567\n​\nNet income/(loss) attributable to redeemable noncontrolling interests in the Operating Partnership and DownREIT Partnership\n​\n \n 2,709\n​\n \n 1,574\n​\n \n 10,593\n​\n \n 6,736\n​\nNet income/(loss) attributable to noncontrolling interests\n​\n \n 12\n​\n \n (94)\n​\n \n 35\n​\n \n 35\n​\nTotal property NOI\n​\n$\n 292,135\n​\n$\n 284,422\n​\n$\n 867,616\n​\n$\n 847,819\n​\n​\nSame-Store Communities\nOur \nSame-Store Community\n properties, those acquired, developed, and stabilized prior to July 1, 2024 (for quarter-to-date comparison) and January 1, 2024 (for year-to-date comparison) and held on September 30, 2025 consisted of 54,915 and 54,442 apartment homes, respectively, and provided 96.8% and 96.6% of our total NOI for the three and nine months ended September 30, 2025.\nThree Months Ended September 30, 2025 vs. Three Months Ended September30, 2024\nNOI for our \nSame-Store Community\n properties increased 2.3%, or $6.5 million, for the three months ended September 30, 2025 compared to the same period in 2024. The increase in property NOI was attributable to a \n2.6%, or $10.4 million, increase in property rental income, partially offset by a 3.1%, or $4.0 million, increase in operating expenses\n. The increase in property rental income was primarily driven by a 1.1%, or $4.1 million, increase in rental rates, an 8.5%, or $4.1 million, increase in reimbursement and other income and a 10.1%, or $1.4 million, decrease in vacancy loss. Weighted average physical occupancy increased by 0.3% to 96.6% and total monthly income per occupied home increased by 2.2% to $2,605.\nThe increase in operating expenses was primarily driven by a 3.5%, or $1.7 million increase in real estate taxes due to higher assessed valuations for certain properties, a 9.5%, or $0.9 million, increase in administration and marketing primarily due to the cost for providing property-wide Wi-Fi and a 4.7%, or $0.9 million, increase in utilities primarily due to an increase in energy costs.\nThe operating margin (property net operating income divided by property rental income) was 68.2% and 68.4% for the three months ended September 30, 2025 and 2024, respectively.\n53\n\n\nTable of Contents\nNine Months Ended September 30, 2025 vs. Nine Months Ended September 30, 2024\nNOI for our \nSame-Store Community\n properties increased 2.5%, or $20.4 million, for the nine months ended September 30, 2025 compared to the same period in 2024. The increase in property NOI was attributable to a \n2.6%, or $30.5 million, increase in property rental income, partially offset by a 2.7%, or $10.1 million, increase in operating expenses\n. The increase in property rental income was primarily driven by a 1.2%, or $13.4 million, increase in rental rates, a 9.5%, or $13.0 million, increase in reimbursement and other income and a 7.4%, or $2.6 million, decrease in vacancy loss. Weighted average physical occupancy increased by 0.2% to 96.9% and total monthly income per occupied home increased by 2.3% to $2,576.\nThe increase in operating expenses was primarily driven by a 11.8%, or $3.1 million, increase in administration and marketing primarily due to the cost of providing property-wide Wi-Fi, a 4.6%, or $2.5 million, increase in personnel costs primarily due to annual merit increases and severance costs, a 4.8%, or $2.5 million, increase in utilities, primarily due to an increase in energy costs, and a 2.9%, or $2.2 million, increase in repair and maintenance expense due to increases in third party vendor costs and weather-related events, partially offset by an 11.1%, or $2.0 million, decrease in insurance expense primarily due to a decrease in the impact from claims.\nThe operating margin (property net operating income divided by property rental income) was 68.5% and 68.5% for the nine months ended September 30, 2025 and 2024, respectively.\nNon-Mature Communities/Other\nUDR’s \nNon-Mature Communities/Other\n represent those communities that do not meet the criteria to be included in \nSame-Store Communities\n, which include communities recently developed or acquired, redevelopment properties, sold or held for disposition properties, and non-apartment components of mixed use properties.\nThree Months Ended September 30, 2025 vs. Three Months Ended September 30, 2024\nThe remaining 3.2%, or $9.3 million, of our total NOI during the three months ended September 30, 2025 was generated from our \nNon-Mature Communities/Other\n. NOI from \nNon-Mature Communities/Other\n increased by 15.5%, or $1.3 million, for the three months ended September 30, 2025 as compared to the same period in 2024. The increase was primarily attributable to a $2.1 million increase in NOI from stabilized, non-mature communities, primarily due to completed development communities becoming stabilized and a $1.7 million increase in acquired communities NOI due to the one community acquired during 2025, partially offset by a $3.0 million decrease in sold and held for disposition communities NOI due to the sale of two operating communities during 2025.\nNine Months Ended September 30, 2025 vs. Nine Months Ended September 30, 2024\nThe remaining 3.4%, or $29.9 million, of our total NOI during the nine months ended September 30, 2025 was generated from our \nNon-Mature Communities/Other\n. NOI from \nNon-Mature Communities/Other\n decreased by 1.9%, or $0.6 million, for the nine months ended September 30, 2025 as compared to the same period in 2024. The decrease was primarily attributable to a $9.5 million decrease in sold and held for disposition communities NOI due to the sale of two operating communities during the nine months ended September 30, 2025, partially offset by an $8.1 million increase in NOI from stabilized, non-mature communities, primarily due to completed development communities becoming stabilized and a $2.2 million increase in acquired communities NOI due to the one community acquired during 2025.\nGain/(loss) on sale of real estate owned\nFor the nine months ended September 30, 2025, the Company recognized gain/(loss) on sale of real estate owned of $47.9 million as compared to $16.9 million on sale of real estate owned for the nine months ended September 30, 2024. The increase in 2025 as compared to 2024 was attributable to the sale of two operating communities located in Englewood, New Jersey, and Brooklyn, New York during the nine months ended September 30, 2025, as compared to the sale of an operating community located in Arlington, Virginia\n during the nine months ended September 30, 2024.\nReal estate depreciation and amortization\n54\n\n\nTable of Contents\nFor the three months ended September 30, 2025 and 2024, the Company recognized real estate depreciation and amortization of $165.9 million and $170.3 million, respectively. The decrease in 2025 as compared to 2024 was primarily due\n to assets that became fully depreciated and assets sold in 2024 and 2025, partially offset by an acquired community in 2025 and development communities completed in 2024.\nFor the nine months ended September 30, 2025 and 2024, the Company recognized real estate depreciation and amortization of $490.5 million and $510.6 million, respectively. The decrease in 2025 as compared to 2024 was primarily due\n to assets that became fully depreciated and assets sold in 2024 and 2025, partially offset by an acquired community in 2025 and development communities completed in 2024.\nIncome/(loss) from unconsolidated entities\nFor the three months ended September 30, 2025 and 2024, the Company recognized income/(loss) from unconsolidated entities of $14.0 million and $(1.9) million, respectively. \nThe increase in 2025 as compared to 2024 was primarily due to no non-cash impairment losses during the three months ended September 30, 2025, as compared to an $8.1 million non-cash impairment loss on one of the Company’s preferred equity investments during the same period in 2024, $3.9 million of higher unrealized gains on technology investments, a $2.6 million increase from unconsolidated joint ventures primarily attributable to higher NOI and a reduction in depreciation and amortization expense, and higher income from preferred equity investments during the three months ended September 30, 2025.\nFor the nine months ended September 30, 2025 and 2024, the Company recognized income/(loss) from unconsolidated entities of $23.5 million and $11.3 million, respectively. \nThe increase in 2025 as compared to 2024 was primarily due to no non-cash impairment losses during the nine months ended September 30, 2025, as compared to an $8.1 million non-cash impairment loss on one of the Company’s preferred equity investments during the same period in 2024 and a $7.4 million increase from unconsolidated joint ventures primarily attributable to higher NOI and a reduction in depreciation and amortization expense partially offset by lower income due to the repayments and partial paydowns received from certain preferred equity investments during the nine months ended September 30, 2025.\nOther depreciation and amortization\nFor the three months ended September 30, 2025 and 2024, the Company recognized other depreciation and amortization of $7.0 million and $4.0 million, respectively. \nThe increase in 2025 as compared to 2024 was primarily due \nto $3.3 million of software transition related costs incurred during the three months ended September 30, 2025, as compared to none during the three months ended September 30, 2024\n.\nFor the nine months ended September 30, 2025 and 2024, the Company recognized other depreciation and amortization of $21.5 million and $13.0 million, respectively. \nThe increase in 2025 as compared to 2024 was primarily due \nto $9.3 million of software transition related costs incurred during the nine months ended September 30, 2025, as compared to none during the nine months ended September 30, 2024\n.\nInterest income and other income/(expense), net\nFor the three months ended September 30, 2025 and 2024, the Company recognized interest income and other income/(expense), net of $3.7 million and $6.2 million, respectively. \nThe decrease in 2025 as compared to 2024 was primarily due to lower interest income earned during the three months ended September 30, 2025 as compared to the same period in 2024, due to lower notes receivable balances.\nFor the nine months ended September 30, 2025 and 2024, the Company recognized interest income and other income/(expense), net of $13.8 million and $18.5 million, respectively. \nThe decrease in 2025 as compared to 2024 was primarily due to lower interest income earned during the nine months ended September 30, 2025 as compared to the same period in 2024, due to lower notes receivable balances.\nInflation \nInflation primarily impacts our results of operations as a result of wage pressures and increases in utilities and repair and maintenance costs. In addition, inflation could also impact our general and administrative expenses, the interest on our debt if variable or refinanced in a high-inflationary environment, our cost of capital, and our cost of development, redevelopment, \n55\n\n\nTable of Contents\nmaintenance or other operating activities. However, the majority of our apartment leases have initial terms of 12 months or less, which in an inflationary environment, and absent other factors such as increased supply, generally enables us to compensate for inflationary effects by increasing rents on our apartment homes. Although an extreme or sustained escalation in costs could have a negative impact on our residents and their ability to absorb rent increases\n, we do not believe this had a material impact on our results for the three and nine months ended September 30, 2025.\nFunds from Operations, Funds from Operations as Adjusted, and Adjusted Funds from Operations\nFunds from Operations\nFunds from operations (“FFO”) attributable to common stockholders and unitholders is defined as \nNet income/(loss) attributable to common stockholders\n (computed in accordance with GAAP), excluding impairment write-downs of depreciable real estate related to the main business of the Company or of investments in non-consolidated investees that are directly attributable to decreases in the fair value of depreciable real estate held by the investee, gains and losses from sales of depreciable real estate related to the main business of the Company and income taxes directly associated with those gains and losses, plus real estate depreciation and amortization, and after adjustments for noncontrolling interests, and the Company’s share of unconsolidated partnerships and joint ventures. This definition conforms with the National Association of Real Estate Investment Trust’s (“Nareit”) definition issued in April 2002 and restated in November 2018. Historical cost accounting for real estate assets in accordance with GAAP implicitly assumes that the value of real estate assets diminishes predictably over time. Since real estate values instead have historically risen or fallen with market conditions, many industry investors and analysts have considered the presentation of operating results for real estate companies that use historical cost accounting to be insufficient by themselves. Thus, Nareit created FFO as a supplemental measure of a REIT’s operating performance. In the computation of diluted FFO, if OP Units, DownREIT Units, unvested restricted stock, unvested LTIP Units, stock options, and the shares of Series E Cumulative Convertible Preferred Stock are dilutive, they are included in the diluted share count.\nManagement considers FFO a useful metric for investors as the Company uses FFO in evaluating property acquisitions and its operating performance, and believes that FFO should be considered along with, but not as an alternative to, net income and cash flow as a measure of the Company’s activities in accordance with GAAP. FFO does not represent cash generated from operating activities in accordance with GAAP and is not necessarily indicative of funds available to fund our cash needs.\nFunds from Operations as Adjusted\nFFO as Adjusted (“FFOA”) attributable to common stockholders and unitholders is defined as FFO excluding the impact of non-comparable items including, but not limited to, acquisition-related costs, prepayment costs/benefits associated with early debt retirement, impairment write-downs or gains and losses on sales of real estate or other assets incidental to the main business of the Company and income taxes directly associated with those gains and losses, casualty-related expenses and recoveries, severance costs, software transition related costs and legal and other costs. \nManagement believes that FFOA is useful supplemental information regarding our operating performance as it provides a consistent comparison of our operating performance across time periods and enables investors to more easily compare our operating results with other REITs. FFOA is not intended to represent cash flow or liquidity for the period, and is only intended to provide an additional measure of our operating performance. We believe that \nNet income/(loss) attributable to common stockholders\n is the most directly comparable GAAP financial measure to FFOA. However, other REITs may use different methodologies for calculating FFOA or similar FFO measures and, accordingly, our FFOA may not always be comparable to FFOA or similar FFO measures calculated by other REITs. FFOA should not be considered as an alternative to net income (determined in accordance with GAAP) as an indication of financial performance, or as an alternative to cash flow from operating activities (determined in accordance with GAAP) as a measure of our liquidity.\nAdjusted Funds from Operations\nAdjusted FFO (“AFFO”) attributable to common stockholders and unitholders is defined as FFOA less recurring capital expenditures on consolidated communities that are necessary to help preserve the value of and maintain functionality at our communities. Therefore, management considers AFFO a useful supplemental performance metric for investors as it is more indicative of the Company’s operational performance than FFO or FFOA.\n56\n\n\nTable of Contents\nAFFO is not intended to represent cash flow or liquidity for the period, and is only intended to provide an additional measure of our operating performance. We believe that \nNet income/(loss) attributable to common stockholders\n is the most directly comparable GAAP financial measure to AFFO. Management believes that AFFO is a widely recognized measure of the operations of REITs, and presenting AFFO enables investors to assess our performance in comparison to other REITs. However, other REITs may use different methodologies for calculating AFFO and, accordingly, our AFFO may not always be comparable to AFFO calculated by other REITs. AFFO should not be considered as an alternative to net income/(loss) (determined in accordance with GAAP) as an indication of financial performance, or as an alternative to cash flow from operating activities (determined in accordance with GAAP) as a measure of our liquidity, nor is it indicative of funds available to fund our cash needs, including our ability to make distributions.\nThe following table outlines our reconciliation of\n Net income/(loss) attributable to common stockholders\n to FFO, FFOA, and AFFO for the three and nine months ended September 30, 2025 and 2024 (\ndollars in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThree Months Ended \n​\nNine Months Ended \n​\n​\n​\nSeptember 30, \n​\nSeptember 30, \n​\n​\n    \n2025\n    \n2024\n    \n2025\n    \n2024\n​\nNet income/(loss) attributable to common stockholders\n​\n$\n 39,198\n​\n$\n 21,400\n​\n$\n 151,174\n​\n$\n 90,991\n​\nReal estate depreciation and amortization\n​\n \n 165,926\n​\n \n 170,276\n​\n \n 490,511\n​\n \n 510,622\n​\nNoncontrolling interests\n​\n \n 2,721\n​\n \n 1,480\n​\n \n 10,628\n​\n \n 6,771\n​\nReal estate depreciation and amortization on unconsolidated joint ventures\n​\n \n 12,021\n​\n \n 12,546\n​\n \n 38,245\n​\n \n 40,928\n​\nImpairment loss from unconsolidated joint ventures\n​\n​\n —\n​\n​\n 8,083\n​\n​\n —\n​\n​\n 8,083\n​\nNet (gain)/loss on consolidation\n​\n​\n —\n​\n​\n —\n​\n​\n (286)\n​\n​\n —\n​\nNet gain on the sale of depreciable real estate owned, net of tax\n​\n \n —\n​\n \n —\n​\n \n (47,939)\n​\n \n (16,867)\n​\nFFO attributable to common stockholders and unitholders, basic\n​\n$\n 219,866\n​\n$\n 213,785\n​\n$\n 642,333\n​\n$\n 640,528\n​\nDistributions to preferred stockholders — Series E (Convertible)\n​\n \n 1,211\n​\n \n 1,197\n​\n \n 3,628\n​\n \n 3,638\n​\nFFO attributable to common stockholders and unitholders, diluted\n​\n$\n 221,077\n​\n$\n 214,982\n​\n$\n 645,961\n​\n$\n 644,166\n​\nIncome/(loss) per weighted average common share, diluted\n​\n$\n 0.12\n​\n$\n 0.06\n​\n$\n 0.46\n​\n$\n 0.28\n​\nFFO per weighted average common share and unit, basic\n​\n$\n 0.62\n​\n$\n 0.61\n​\n$\n 1.82\n​\n$\n 1.81\n​\nFFO per weighted average common share and unit, diluted\n​\n$\n 0.62\n​\n$\n 0.60\n​\n$\n 1.81\n​\n$\n 1.81\n​\nWeighted average number of common shares and OP/DownREIT Units outstanding — basic\n​\n \n 353,484\n​\n \n 353,275\n​\n \n 353,543\n​\n \n 353,299\n​\nWeighted average number of common shares, OP/DownREIT Units, and common stock equivalents outstanding — diluted\n​\n \n 356,873\n​\n \n 357,226\n​\n \n 357,110\n​\n \n 356,811\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nImpact of adjustments to FFO:\n​\n \n  \n​\n \n  \n​\n \n  \n​\n \n  \n​\nLegal and other costs\n​\n$\n 2,683\n​\n$\n 1,551\n​\n$\n 9,846\n​\n$\n 6,995\n​\nRealized and unrealized (gain)/loss on real estate technology investments, net of tax \n​\n​\n (3,736)\n​\n​\n 3\n​\n​\n (3,305)\n​\n​\n (4,613)\n​\nSeverance costs\n​\n \n 7,214\n​\n \n 3,018\n​\n \n 8,737\n​\n \n 4,550\n​\nSoftware transition related costs\n​\n​\n 3,329\n​\n​\n —\n​\n​\n 9,263\n​\n​\n —\n​\nCasualty-related charges/(recoveries)\n​\n \n 1,755\n​\n \n 1,473\n​\n \n 8,434\n​\n \n 8,749\n​\nTotal impact of adjustments to FFO\n​\n$\n 11,245\n​\n$\n 6,045\n​\n$\n 32,975\n​\n$\n 15,681\n​\nFFOA attributable to common stockholders and unitholders, diluted\n​\n$\n 232,322\n​\n$\n 221,027\n​\n$\n 678,936\n​\n$\n 659,847\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFFOA per weighted average common share and unit, diluted\n​\n$\n 0.65\n​\n$\n 0.62\n​\n$\n 1.90\n​\n$\n 1.85\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nRecurring capital expenditures, inclusive of unconsolidated joint ventures\n​\n \n (32,238)\n​\n \n (29,898)\n​\n \n (79,844)\n​\n \n (73,496)\n​\nAFFO attributable to common stockholders and unitholders, diluted\n​\n$\n 200,084\n​\n$\n 191,129\n​\n$\n 599,092\n​\n$\n 586,351\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nAFFO per weighted average common share and unit, diluted\n​\n$\n 0.56\n​\n$\n 0.54\n​\n$\n 1.68\n​\n$\n 1.64\n​\n​\n57\n\n\nTable of Contents\nThe following table is our reconciliation of FFO share information to weighted average common shares outstanding, basic and diluted, reflected on the UDR Consolidated Statements of Operations for the three and nine months ended September 30, 2025 and 2024 \n(shares in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nThree Months Ended \n​\nNine Months Ended \n​\n​\nSeptember 30, \n​\nSeptember 30, \n​\n    \n2025\n    \n2024\n    \n2025\n    \n2024\nWeighted average number of common shares and OP/DownREIT Units outstanding — basic\n \n 353,484\n \n 353,275\n \n 353,543\n \n 353,299\nWeighted average number of OP/DownREIT Units outstanding\n \n (22,816)\n \n (23,854)\n \n (22,851)\n \n (24,198)\nWeighted average number of common shares outstanding — basic per the Consolidated Statements of Operations\n \n 330,668\n \n 329,421\n \n 330,692\n \n 329,101\n​\n​\n​\n​\n​\n​\n​\n​\n​\nWeighted average number of common shares, OP/DownREIT Units, and common stock equivalents outstanding — diluted\n \n 356,873\n \n 357,226\n \n 357,110\n \n 356,811\nWeighted average number of OP/DownREIT Units outstanding\n \n (22,816)\n \n (23,854)\n \n (22,851)\n \n (24,198)\nWeighted average number of Series E Cumulative Convertible Preferred shares outstanding\n \n (2,816)\n \n (2,815)\n \n (2,816)\n \n (2,858)\nWeighted average number of common shares outstanding — diluted per the Consolidated Statements of Operations\n \n 331,241\n \n 330,557\n \n 331,443\n \n 329,755\n​\n​\n​"
}