{
  "source_file": "ulta-20250201x10k.htm",
  "form_type": "10-K",
  "item1": "Item 1.\n   Business\nOverview\nUlta Beauty is the largest specialty beauty retailer in the United States and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products, and salon services. Key aspects of our business include:\nOne-of-a-kind Assortment.\n We offer guests a differentiated assortment of approximately 29,000 products from approximately 600 established and emerging beauty brands across a variety of categories and price points. We offer a wide selection of beauty and wellness categories, from mass to\n \nprestige price points, across cosmetics, fragrance, haircare, skincare, bath and body products, professional hair products, and salon styling tools.\nStore Footprint.\n We operate more than 1,400 stores predominantly located in convenient, high-traffic locations. With a bright and open store environment, we make it easy for guests to discover new products and services. Our store design, fixtures, and open layout provide the flexibility to respond to consumer trends and changes in our merchandising strategy. We also offer beauty services in nearly every store, including a full-service hair salon and a Benefit\nTM\n Brow Bar. In addition to our free-standing locations, through our partnership with Target Corporation we have more than 600 Ulta Beauty at Target shop-in-shops which provide guests with a highly-curated, prestige beauty assortment in a unique and elevated presentation in 1,000 square feet of dedicated space within certain Target locations.\nLeading Digital Experiences. \nThrough our website, Ulta.com, and our mobile applications, we offer guests convenient, immersive, and personalized digital experiences. Our digital channels enable always-on shopping and discovery, and our diverse fulfillment options, including buy online pick-up in store, buy online pick-up curbside, ship from store, ship from distribution center, and same-day delivery, provide guests with value and convenience. In addition to e-commerce platforms, we offer guests a variety of unique digital experiences, including virtual try-on and skin analysis tools, which leverage augmented reality capabilities and artificial intelligence tools to provide guests with personalized experiences. \nBest-in-Class Loyalty Program. \nOur best-in-class loyalty program, Ulta Beauty Rewards, enables members to earn points for every dollar spent on products and beauty services at Ulta Beauty, through purchases on our private label and co-branded credit cards, and purchases at Ulta Beauty at Target. In addition to unique membership benefits, members can redeem points for discounts on any product or service at Ulta Beauty. With more than 95% of total sales coming from members, we are uniquely positioned with a deep understanding of our customers and their preferences, enabling us to personalize experiences, recommendations, and promotions through our Customer Relationship Management (CRM) platform and support our brand partners’ growth. \nGreat Guest Experiences. \nWe cultivate human connection with warm and welcoming guest experiences across all of our channels. Our knowledgeable and approachable store associates, our differentiated service offerings, and our efforts to create relevant, compelling digital content are competitive advantages and enable us to build strong engagement with guests.\nWe were founded in 1990 as a beauty retailer at a time when prestige, mass, and salon products were sold through distinct channels — department stores for prestige products; drug stores and mass merchandisers for mass products; and salons and authorized retail outlets for professional hair care products. We developed a unique specialty retail concept that offers a broad range of brands and price points, select beauty services, and a convenient and welcoming shopping environment. We define our target consumer as a beauty enthusiast, a consumer who is passionate about the beauty category, uses beauty for self-expression, experimentation, and self-investment, and has high expectations for the shopping experience. We estimate there are approximately 140 million beauty enthusiasts in the U.S.\n4\n\n\nTable of Contents\nThe following description of our business should be read in conjunction with the information contained in our Management’s Discussion and Analysis of Financial Condition and Results of Operations included in Item 7 and our Financial Statements and Supplementary Data included in Item 8 of this Annual Report on Form 10-K.\nOur strategy\nWe target beauty enthusiasts across multiple demographics and shopping behaviors. Beauty enthusiasts have a deep emotional connection with beauty, and historically, this connection has not diminished in softer economic environments. Our proprietary consumer research confirms engagement with the beauty category remains strong. Strong engagement paired with increasing use of social media and the convergence of beauty and wellness has invited even more consumers into the beauty category and expanded the addressable market. At the same time, the beauty landscape is evolving and guest expectations are rising, which will require continued innovation and investment to further our leadership position. \nReflecting our understanding about how the consumer and beauty category are evolving, in 2024 we refreshed our strategic framework. Through a focus on four foundational areas, our strategies are designed to position Ulta Beauty as the destination for beauty enthusiasts for a lifetime, drive market share leadership in beauty and wellness, and deliver long-term profitable growth. \nAssortment: Curating the best of all things beauty and wellness for all beauty enthusiasts. \nBeauty enthusiasts enjoy the experience of discovering and trying new products and consider beauty very much part of their self-care and wellness journey. Reflecting these insights, our objective is to engage and continuously delight beauty enthusiasts with a curated, differentiated beauty and wellness assortment. We intend to drive product newness through a differentiated portfolio of exclusive, emerging and established brands, including Ulta Beauty Collection, and accelerate our leadership position in wellness with an expanded assortment and elevated experience.\nExperience: Fostering authentic, empowering human connections that inspire, delight and engage guests at every touchpoint. \nThe guest experience is central to driving guest love and loyalty. Our consumer research suggests there are several important experience elements that are most critical to the beauty enthusiast including: creating a welcoming and inclusive environment, providing trusted guidance, offering convenience and ease, and delivering fun and immersion. To deliver on these critical needs and foster authentic, empowering human connections that inspire, delight and engage guests at every touchpoint, we intend to enhance the in-store experience by investing in our best-in-class store associates and stylists, distinct service offerings, and signature events and heighten omnichannel satisfaction, meeting every guest where they are with a robust suite of offerings and increased convenience.\nLoyalty: Building lifelong loyalty and brand love through member growth and personalization.\n To understand longer-term shifts in consumer values, perceptions, and behaviors, as well as of-the-moment insights, we have developed a robust consumer research capability. In addition, with more than 95% of total sales coming from our 44.6 million active Ulta Beauty Rewards loyalty program members, we have unique insights about customer preferences and behavior. Based on our proprietary insights, we know beauty enthusiasts have an emotional, personal, and deep connection with beauty. Social media contributes to this connection, and we expect the influence and reach of beauty will continue to grow as engagement with social platforms increases. To build lifelong loyalty and brand love, we intend to deepen guest engagement through community building and advanced personalization with the goal of expanding our loyalty program from approximately 44 million to 50 million members by 2028 by reaching new segments of beauty enthusiasts.\nAccess: Engaging our guests wherever they want to shop by expanding our reach through seamless and immersive omnichannel experiences. \n Beauty enthusiasts continue to demonstrate their commitment to and preference for the in-person shopping experience, while also embracing the use of online shopping to supplement discovery and convenience. We have built a powerful omnichannel ecosystem that enables guests to shop in ways most convenient to them, whether in stores, on our app or website, or through our partnership with Ulta Beauty at Target.  In addition, we have increased our fulfillment options, providing guests with choice, convenience, and speed. To achieve our objective of engaging our guests by expanding our reach, we intend to accelerate new store openings, targeting more than 1,800 stores over the long term; elevate digital engagement by fueling discovery through continued innovation and streamlining the shopping experience; and grow beyond our traditional channels through our partnership with Target Corporation and through international expansion in Mexico and the Middle East.\n \n5\n\n\nTable of Contents\nCulture and Talent: Underpinning our strategy with exceptional people, culture, and execution.\n \nWe have developed and nurtured a guest and associate-centric, values-based, and high-performance culture. We are focused on reenergizing the core tenets of our culture on how we lead with a winning mindset and how we live our values to care for our guests and for each other. We have talented associates and leaders, and we value and encourage collaboration and enterprise thinking. To support our growth and enhance the guest experience, we will continue to attract, develop and retain talent at all levels and in all functional areas, and we will continue to work to create an environment that positions our associates to fully contribute and have opportunities for growth. We have achieved our success through strong operational execution. \nOur market\nWe operate within the large and growing U.S. beauty products and salon services industry. In 2024, this market represented approximately $186 billion in sales, according to forecasted Euromonitor International and IBIS World Inc. In 2024, the beauty products industry totaled approximately $118 billion and included cosmetics, haircare, fragrance, bath and body, skincare, salon styling tools, and other toiletries. We estimate that Ulta Beauty had only a 9% share of the $118 billion beauty product industry. Within this market, we compete across all major categories as well as a range of price points by offering prestige, mass, and salon products. In 2024, the salon services industry totaled approximately $68 billion and included hair, skin, and nail services. We estimate that Ulta Beauty had less than 1% share of this industry. We have full-service hair salons in substantially every store and operate brow bars in most of our stores, as well as makeup and ear piercing services through our salons. In addition, we offer skin services in approximately 150 locations.\nCompetition\nOur major competitors for prestige and mass products include traditional department stores, specialty stores, grocery stores, drug stores, mass merchandisers, and the online capabilities of national retailers and brands, as well as pure-play e-commerce companies and online marketplaces. The market for salon services and products is highly fragmented. Our competitors for salon services and products include chain and independent salons.\nOur retail channels\nWe are committed to meeting guests where and how they want to shop and strive to offer guests a compelling, personalized shopping experience through our stores, digital platforms, and partnerships.\nStores\nOur member data and customer research suggests our guests prefer to transact in physical stores, where they can discover and interact with products and other beauty enthusiasts. In our fiscal year ended February 1, 2025 (fiscal 2024), 75% of our loyalty members transacted with us solely in one of our stores. Our retail stores are predominantly located in convenient, high-traffic locations such as power strip centers. Our typical store is approximately 10,000 square feet, including approximately 950 square feet dedicated to our full-service salon. We also have a smaller footprint store prototype ranging between approximately 5,000 and 7,500 square feet which provides increased flexibility to enter smaller markets or shopping centers.\nWe offer a full range of beauty services in our stores, focusing on hair, makeup, brow, and skin services. The vast majority of our stores include an open and modern salon area, with most of our stores offering brow services on the salon floor. In addition, stores offering skin services include a skin treatment room or dedicated skin treatment area on the sales floor. The salon features a concierge desk, approximately five to ten stations, and a shampoo and hair color processing area. We employ highly skilled, licensed professional stylists and estheticians who offer services as well as educational experiences, including consultations, styling lessons, makeup applications, skincare services, and at-home care recommendations. \n6\n\n\nTable of Contents\nIn addition to opening new stores, we also remodeled and relocated certain stores, as shown in the following table:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal year ended\n​\n    \nFebruary 1,\n   \nFebruary 3,\n    \nJanuary 28,\n​\n​\n2025\n​\n2024\n​\n2023\nTotal stores beginning of period\n​\n 1,385\n​\n 1,355\n​\n 1,308\nStores opened\n​\n 66\n​\n 33\n​\n 47\nStores closed\n​\n (6)\n​\n (3)\n​\n –\nTotal stores end of period\n​\n 1,445\n​\n 1,385\n​\n 1,355\n​\n​\n​\n​\n​\n​\n​\nTotal square footage\n​\n 15,110,170\n​\n 14,515,593\n​\n 14,200,403\nAverage square footage per store\n​\n 10,457\n​\n 10,481\n​\n 10,480\n​\n​\n​\n​\n​\n​\n​\nStores remodeled\n​\n 41\n​\n 18\n​\n 20\nStores relocated\n​\n 2\n​\n 7\n​\n 12\n​\nOur real estate vision is to make Ulta Beauty accessible and convenient to more consumers across a variety of markets and is a key driver of how we plan to expand our market share over time. We believe that over the long term, we have the potential to grow our store footprint to more than 1,800 freestanding Ulta Beauty stores in the United States. \nWe leverage a variety of insights to identify the best new store locations and optimize our current store locations, including beauty market share information and insights from our loyalty members. This insight-led, analytical approach to site selection has resulted in a high performing real estate portfolio. The average investment required to open a new Ulta Beauty store is approximately $2.1 million, which includes capital investments, net of landlord contributions, pre-opening expenses, and initial inventory, net of payables. Our net investment required to open new stores and the net sales generated by new stores may vary depending on a number of factors, including geographic location and store size. \nOur traditional layout is organized by price point, with prestige makeup and skincare on one side of the store and mass makeup and skincare on the other. As part of our ongoing efforts to enhance and evolve our in-store experience to engage our guests, we also have a layout in select stores that brings together like categories with intuitive adjacencies to magnify our differentiated assortment. This additional layout features elevated gondolas to showcase key, iconic, and service brands and Beauty Bars that offer our brow and makeup services, support in-store events, and highlight beauty-in-action. In addition, select store layouts may vary due to square footage or location. \n​\nDigital platform\n \nIn addition to store expansion, we continue to expand our digital capabilities as more of our guests choose to engage with us across physical and digital platforms. In fiscal 2024, 18% of our loyalty members shopped both in Ulta Beauty stores and through our digital platforms. Our omnichannel guests are extremely valuable, historically spending nearly three times as much as retail-only guests.\nOur e-commerce platform has two key roles: generating direct channel sales and profits by engaging our guests in an interactive, enjoyable way that reinforces the Ulta Beauty brand; and driving traffic to our stores, website, and native applications. As part of our digital store transformation, we recently completed a large-scale upgrade of our digital and e-commerce infrastructure to enable us to deliver immersive commerce experiences and position our e-commerce business for growth and scalability. We continue to develop and add new website and mobile features and functionality, marketing programs, new products and brands, and omnichannel integration points. In 2024, we launched Ulta Beauty Community, an online destination where beauty enthusiasts can connect and engage with one another over their shared joy for all things beauty. We continue to grow our digital business by providing our guests with a unique, rich online experience, with personalized recommendations, expanded assortments, engaging experiences, including virtual try-on and analysis capabilities, and social media content. \nWe continue to improve our order fulfillment capabilities with increased speed of delivery through existing distribution centers, fast fulfillment center (e-commerce only), market fulfillment centers, and select retail stores, through more \n7\n\n\nTable of Contents\nefficient processes designed for e-commerce order fulfillment. In addition to ship to home order fulfillment, we offer guests “Buy Online, Pick-up in Store,” “Curbside Pickup,” and “Store 2 Door,” which provides the ability for customers to order in-store and have products delivered to their homes. In addition, we offer same-day delivery for e-commerce orders in virtually all markets. \nPartnerships\nTo expand loyalty member engagement and introduce new guests to Ulta Beauty, we have a partnership with Target Corporation to create Ulta Beauty at Target, a “shop-in-shop” concept that offers a curated assortment of more than 60 established and emerging prestige brands across a variety of categories. Co-designed by Ulta Beauty and Target, the Ulta Beauty at Target shop is intended to reflect the Ulta Beauty experience with a unique and elevated presentation in 1,000 square feet of dedicated space separate but adjacent to Target’s core beauty department. The shop is staffed by Target team members who are trained by Ulta Beauty to provide recommendations and answer product questions. Members in our loyalty program, Ulta Beauty Rewards, can earn points for purchases made in the Ulta Beauty at Target shop.  Loyalty points can only be redeemed in Ulta Beauty stores, on Ulta.com or through our mobile applications. As of February 1, \n2025, Ulta Beauty at Target was available in over 600 Target locations and on target.com.  Over time, we believe Ulta Beauty at Target could be in up to 800 Target locations, in addition to our freestanding Ulta Beauty stores.\nWe are committed to growing our business outside of the U.S. through international expansion in Mexico and the Middle East. In Mexico, we have a joint venture partnership with Grupo Axo, an experienced operator of global brands to launch and operate Ulta Beauty in Mexico beginning in 2025. In the Middle East, we entered into a franchise partnership with Alshaya Group, a leading international franchise operator, whereby Alshaya will license the Ulta Beauty brand name and operating model in the Middle East.\nMerchandising \nOverview\nWe offer one of the most extensive product and brand selections in our industry, including a broad assortment of branded and private label beauty and wellness products in cosmetics, fragrance, haircare, skincare, bath and body products, and salon styling tools. Across our stores, Ulta.com and our mobile applications, we offer approximately 29,000 products from approximately 600 well-established and emerging beauty and wellness brands across all categories and price points, including Ulta Beauty’s own private label, Ulta Beauty Collection. Our merchandising team continually monitors beauty and wellness trends, sales trends, and new product launches to keep Ulta Beauty’s product assortment fresh and relevant and to ensure that our assortment reflects the diversity of our guests. We believe our broad selection of merchandise, from moderately-priced brands to higher-end luxury brands, creates a unique shopping experience for our guests.\nIn addition to our partners’ brands, we believe our recently relaunched private label brand, Ulta Beauty Collection, is a strategically important opportunity for growth and profit contribution. Our objective is to provide quality, trend-right private label products to continue to strengthen our guests’ perception of Ulta Beauty, and serve as an important pillar of the Conscious Beauty at Ulta Beauty\n®\n program. Ulta Beauty manages the full development cycle of these products from concept through production to deliver differentiated packaging and formulas that enhance our brand image. Ulta Beauty Collection has been certified in the Clean Ingredients and Cruelty Free pillars within the Conscious Beauty at Ulta Beauty\n®\n program. We also offer products such as Tarte Double Duty Beauty cosmetics and IT Brushes for Ulta that are permanently exclusive to Ulta Beauty. Similarly, we offer a number of brands and products that are exclusive for a limited period of time or are offered in advance of our competitors, such as Morphe, Peach & Lily, and R.E.M Beauty. Ulta Beauty Collection and permanent Ulta Beauty exclusive products represented approximately 4% of our net sales in fiscal 2024. Both permanent and temporary exclusive products represented approximately 9% of our net sales in fiscal 2024.\nCategories\nWe offer a balanced portfolio across six primary categories: (1) cosmetics; (2) skincare; (3) haircare; (4) fragrance; (5) services; and (6) other, which includes other revenue sources such as the private label and co-branded credit card \n8\n\n\nTable of Contents\nprograms, royalties derived from the partnership with Target Corporation, and deferred revenue related to the loyalty program and gift card breakage. \nThe following table sets forth the approximate percentage of net sales attributed to each category for the periods presented: \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal year ended\n​\n​\nFebruary 1,\n​\nFebruary 3,\n​\nJanuary 28,\n(Percentage of net sales)\n​\n2025\n​\n2024\n​\n2023\nCosmetics\n​\n39%\n  \n41%\n  \n42%\nSkincare\n​\n23%\n​\n22%\n​\n20%\nHaircare\n​\n19%\n​\n20%\n​\n22%\nFragrance\n​\n13%\n​\n11%\n​\n11%\nServices\n​\n4%\n​\n4%\n​\n3%\nOther\n​\n2%\n​\n2%\n​\n2%\n​\n​\n100%\n​\n100%\n​\n100%\n​\nOrganization\n​\nOur merchandising team consists of a Chief Merchandising and Digital Officer who oversees the Senior Vice President of Cosmetics, Fragrance and Private Label and the Senior Vice President of Haircare, Skincare, Bodycare and Wellness, who in turn oversee category Vice Presidents who in turn oversee Divisional Merchandise Managers and their teams of buyers. Our Chief Merchandising and Digital Officer also oversees our e-commerce business and our centralized merchandise planning and forecasting group to ensure consistent execution across our omnichannel platforms and our planogram team. \nIn stores, we present products in an open-sell environment using centrally produced planograms (detailed schematics showing product placement in the store) and promotional merchandising planners. Our planogram team assists the merchants and inventory teams to keep new products flowing into stores on a timely basis. All major product categories undergo planogram revisions on a regular basis, and adjustments are made to assortment mix and product placement based on current sales trends. Our visual marketing team works with our merchandising team to develop strategic placement of promotional merchandise, functional and educational signage, and creative product presentation standards in all of our stores. All stores receive centrally produced promotional merchandising planners to ensure consistent implementation of our marketing programs.\nPlanning and allocation\nWe have developed a disciplined approach to buying and a dynamic inventory planning and allocation process to support our merchandising strategy. We centrally manage product replenishment to our stores through our merchandise planning group. This group serves as a strategic partner to, and provides financial oversight of, the merchandising team. The merchandising team creates a sales forecast by category for the year. Our merchandise planning group creates an open-to-buy plan, approved by senior executives, for each product category. The open-to-buy plan is updated weekly with point-of-sale (POS) data, receipts, and inventory levels and is used throughout the year to balance buying opportunities and inventory return on investment. We believe this structure maximizes our buying opportunities while maintaining organizational and financial control. POS data is used to calculate sales forecasts and to determine replenishment levels. We determine promotional product replenishment levels using sales history from similar or comparable events. To ensure our inventory remains productive, our planning and replenishment group, along with senior executives, monitor the levels of clearance and aged inventory in our stores on a weekly basis. \nBrand partnerships\nWe have strong, active relationships with our brand partners. Our top ten brand partners, such as L’Oréal and Estée Lauder Companies, among others, represented 54% and 55% of our total net sales in fiscal 2024 and our fiscal year \n9\n\n\nTable of Contents\nended February 3, 2024 (fiscal 2023), respectively. We believe our brand partners view us as a significant distribution channel for growth and brand enhancement, and we work closely with them to market both new and existing brands.\nAll brand partners and respective subcontractors and their facilities are subject to the applicable Ulta Vendor Standards, which set forth the ethical, legal, social, and workplace standards to meet in order to do business with Ulta Beauty. In addition to complying with Ulta Vendor Standards, many brand partners have committed to help advance our mission to \nmaintain the beauty of our environment \nand\n minimize our impact on the world around us by offering sustainable packaging. We have made a commitment that 50% of packaging from products sold at our stores will be recyclable, refillable, or made from recycled or bio-sourced materials by the end of fiscal 2025.  \nMarketing and advertising\nWe employ a multi-faceted marketing strategy to increase brand awareness, drive traffic to our stores, website, and mobile applications, acquire new loyalty program members, improve guest retention, increase frequency of shopping, and increase spend per member. We communicate with our guests and prospective guests through multiple vehicles, including print advertising, digital and social media, television and radio. These vehicles highlight the breadth of our selection of prestige, mass and salon beauty products, new products and services, and special offers, as well as build an emotional connection with guests. Our comprehensive public relations strategy enhances Ulta Beauty’s reputation as a beauty destination, increases brand awareness, and drives awareness of new products, in-store events, and new store openings.\nThe Ulta Beauty Rewards loyalty program is an important tool to increase retention of existing guests and to enhance their loyalty to the Ulta Beauty brand. Our CRM platform enables sophisticated analysis of the customer data in our loyalty member database as well as greater personalization of our marketing campaigns, digital experiences, and day-to-day communications. Our data demonstrates that loyalty members spend more per visit as compared to non-members. Ulta Beauty Rewards enables customers to earn points based on their purchases at Ulta Beauty stores, through our digital platforms, and at Ulta Beauty at Target. Points earned are valid for at least one year and may be redeemed on any product we sell or service we provide in Ulta Beauty stores or through our digital platforms. To enhance our loyalty program, we offer co-branded and private label credit cards. The credit cards drive higher wallet share and greater loyalty from our rewards members, provide increased consumer insights, and offer attractive economics. \nWe are directing a growing percentage of our marketing expense towards digital, social media, and streaming advertising. We believe these channels are highly effective in communicating with existing guests, as well as driving consideration amongst those who have not yet shopped with us. In social media channels, influencers and affiliates play an important role in beauty, and we engage talent from our UB Collective, our affiliate program, and Ulta Beauties, our associate ambassador program to support our marketing efforts. Our digital marketing strategy includes search engine optimization, paid search, mobile advertising, social media, display advertising, and other digital marketing channels. Digital marketing, coupled with our national TV and radio advertising, has helped us increase brand awareness and consideration among those not familiar with Ulta Beauty, which we believe has resulted in new guests. \nRetail media network\nWe have a deep understanding of our Ulta Beauty Rewards loyalty members and their preferences. This unique understanding, combined with our ongoing investment in data analytics and CRM capabilities, enables us to create personalized experiences and value for our guests and has unlocked new ways for us to support our brand partners and drive additional vendor income. In 2022, we launched our retail media network, UB Media, to transform the way our brand partners can connect with beauty enthusiasts. UB Media offers brands a suite of media and advertising capabilities that aim to personalize guest engagement and drive the acquisition of new guests.\n​\n10\n\n\nTable of Contents\nStaffing and operations\nRetail stores\nOur current Ulta Beauty store format is typically staffed with a general manager, a services manager, and three associate managers, along with approximately 28 full- and part-time associates, including approximately four to eight prestige advisors and five to ten licensed salon professionals. The management team in each store reports to the General Manager. The General Manager oversees all store activities including salon management, inventory management, merchandising, cash management, scheduling, hiring, and guest services. Members of store management receive bonuses depending on their position and based upon various performance metrics. Each General Manager reports to a District Manager, who in turn reports to a Regional Vice President of Operations, who in turn reports to a Senior Vice President of Stores, who in turn reports to the Chief Retail Officer, who in turn reports to the Chief Executive Officer. Each store team receives additional support from time to time from recruiting specialists for the retail and salon operations, regionally based talent development managers, a field loss prevention team, service district educators and service district leaders, and brand partners.\nUlta Beauty stores are open seven days a week, typically eleven hours a day, Monday through Saturday, and seven hours on Sunday. Our stores have extended hours during the holiday season. \nSalon services\nA typical salon is staffed with five to ten licensed salon professionals, including six or more stylists, and select stores have an esthetician. Our most productive salons have a guest coordinator and an assistant manager. Our services district educators and brand partner education classes create a comprehensive educational program for approximately 7,500 Ulta Beauty salon professionals.\nSupply chain\nOur vision is to build and operate a dynamic and agile end-to-end supply chain that improves operational efficiency, performance, and guest experience to fuel organizational growth effectively. This includes enhanced systems and processes as well as a modernized distribution center network to support our new store and e-commerce growth. We operate four regional distribution centers and two market fulfillment centers that support both stores and e-commerce demand, and one fast fulfillment center that supports e-commerce orders only. Market fulfillment centers are smaller than our regional distribution centers and focus on our most productive products enabling us to improve service and responsiveness, especially in markets with high store and population density. In addition, approximately 500 stores fulfill e-commerce orders as part of our ship-from-store program.\nInventory is shipped from our suppliers to our distribution centers, market fulfillment centers and fast fulfillment center. We replenish our stores with such products primarily in eaches (i.e., less-than-case quantities), which allows us to ship less than an entire case when only one or two of a particular product is required. Our distribution centers, market fulfillment centers, and fast fulfillment center use warehouse management software systems to manage inventory to support product purchase decisions. Product is delivered to stores using a broad network of contract and local pool (final mile) carriers.\nHuman capital management\nWe believe our associates, with their combined skills, knowledge, experiences, and commitment to serving our guests, are among our most important resources and are critical to our continued success. We strive to make Ulta Beauty a great place to work by leading with our hearts, caring for each other in everything we do, and demonstrating integrity, authenticity and inclusivity in our daily actions.  \n​\n11\n\n\nTable of Contents\nThe following table sets forth the approximate number of associates employed as of February 1, 2025: \n​\n​\n​\n​\n​\n​\n​\n​\nFull-time\n​\n​\n​\n​\n​\n 20,000\nPart-time\n​\n​\n​\n​\n​\n 38,000\nTotal associates\n​\n​\n​\n​\n​\n 58,000\n​\n​\n​\n​\n​\n​\n​\nWe have no collective bargaining agreements and have not experienced any work stoppages. We believe we have good relationships with our associates.\nDiversity, equity, and inclusion\nThe beauty industry is inherently diverse, and because of that, we embed inclusion efforts through a cross-functional approach, led by our Chief Executive Officer, to ensure teams remain energized and motivated to lead in this critical space. At Ulta Beauty, our mission is to make beauty accessible, inclusive, and empowering for everyone. Ulta Beauty believes that everyone deserves to feel good in their own skin. We believe that when you are free to be your full self, you feel like you belong. As a values-driven company, we believe we have a responsibility to drive inclusivity and a sense of belonging for our guests and associates. We accomplish this through evolving our assortment to ensure we offer relevant products to our diverse customer base, inclusive recruitment strategies, dedicating time to celebrate diversity and inclusion, and encouraging associates to build personal habits through everyday inclusive actions.\nIn addition, we aim to ensure that all in-store experiences are equitable, fair, and unbiased. We take action to support this goal by providing quarterly trainings for in-store associates and providing weekly learning opportunities to focus on guest perspectives and reinforce key takeaways. We offer similar training across the organization to help key decision-makers and associates in their own learning journeys and support our Champion Diversity value and inclusion competency. \nThe following table sets forth key metrics as of February 1, 2025:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nBoard of\n​\n​\n​\nAll Other\n​\n​\nDirectors\n​\nLeadership\n​\nAssociates\nWomen\n​\n64%\n​\n67%\n​\n91%\nMen\n​\n36%\n​\n33%\n​\n9%\nPeople of color\n​\n36%\n​\n28%\n​\n57%\n​\nOversight and management\nWe strive to make sure that our associates are at the heart of every decision we make. The Chief Human Resources Officer, along with the entire executive team, is responsible for developing and executing the Company’s human capital strategy. This includes the attraction, acquisition, development, and engagement of talent and the design of associate compensation and benefits programs. Our human capital objectives and initiatives, including the risks related to compensation policies and practices, management development and leadership succession, inclusion practices, and implementation and compliance monitoring of our code of business conduct, are also overseen by individual Board committees as described in our corporate governance guidelines.\nWe believe open and honest two-way communication is critical to maintaining strong associate engagement. We regularly conduct an associate engagement survey to determine associates’ satisfaction with their roles, their leaders, and the Company as a whole, which our executive team reviews and monitors. Our leadership team also hosts roundtable sessions, as well as additional forums, including department town halls, store and distribution center visits, and other small group gatherings, to dive deeper on specific topics.\nTraining and development\nOur success is dependent, in part, on our ability to attract, train, retain, and motivate qualified associates at all levels of the organization. We are committed to continually developing our associates and providing career advancement \n12\n\n\nTable of Contents\nopportunities. Our associates and management teams are essential to our store expansion strategy. We use a combination of existing managers, promoted associates, and outside hires to support our new stores. The majority of our promotions are internal. As we continue to promote and develop from within, we are building a bench of associates and leaders who understand our business well and support our values-driven culture.\nAll of our associates participate in an interactive new-hire orientation through which each associate becomes acquainted with Ulta Beauty’s mission, vision, and values. Through our learning management system and our digital workplace system, we provide continuing education to associates throughout their careers at Ulta Beauty. Additionally, our leadership development program prepares promising future leaders for new levels of responsibility.\nCompensation and benefits\nOur commitment to our associates and their well-being is one of our highest priorities. We have assembled a suite of benefits that affirms and supports all that our associates contribute every day, including\n:\n●\nHealth care coverage is offered to those who work more than 30 hours a week in any position. Coverage extends to eligible dependents, including spouses, domestic partners, and children under the age of 26. We offer \ncomprehensive medical plans that empower associates to choose the coverage that best suits them;\n●\n401(k) plan with up to a 4% company match;\n●\nDisability and life insurance;\n●\nCompany-paid short-term disability pay at 80% of pay;\n●\nAdditional insurance options, including legal, pet, home, and auto;\n●\nTuition reimbursement program;\n●\nPaid time off, including an extended illness bank; and\n●\nDiscounts on retail products and salon services.\nIn addition, we believe wellness, like beauty, is more than skin deep, so we offer mental health resources, such as counseling services and access to mobile applications, financial wellness planning and guidance, and health mobile applications and educational resources for soon-to-be parents.\nThe Ulta Beauty Charitable Foundation supports the Associate Relief Program to assist associates facing unforeseen financial hardship. The Associate Relief Program provides short-term financial support to reimburse medical bills or support temporary housing. \nSustainability\nWe strive to operate in an environmentally responsible manner. Our retail stores are focused on energy reduction efforts by maintaining safe indoor air for all customers while products are being used in our salons, using adequate energy-efficient lighting, managing the in-store temperatures, and making efficient use of water needed for our salon services. In addition, we will continue to look for ways to reduce our carbon footprint by investments in renewable energy credits and working with our brand partners to identify ways to work together to reduce Scope 3 emissions.  \n​\nInformation technology \nWe are committed to using technology to enhance our competitive position. We intend to leverage our technology infrastructure and systems to gain operational efficiencies through more effective use of our systems, people, and processes. In fiscal 2024, we completed several multi-year strategic investment projects to upgrade key elements of our technology infrastructure including upgrading our enterprise resource planning platform and refreshing our POS system in all stores, transitioning our digital store to a new architecture,  and building a modern ecosystem for future analytics and data-driven decisioning capabilities. Collectively, we expect these investments to provide a flexible and scalable operating environment allowing for greater business efficiency and enhancing the guest experience. We will continue to make investments in our information systems to facilitate growth and enhance our competitive position. Also see “Cybersecurity” included as part of Item 1C. of this Annual Report on Form 10-K.\n13\n\n\nTable of Contents\nIntellectual property\nWe have registered trademarks in the United States and other countries. The majority of our trademark registrations contain the ULTA mark, including Ulta Beauty\n®\n and two related designs, Ulta.com and Ulta Salon, Cosmetics & Fragrance (and design). We maintain our marks and monitor filing deadlines for renewal and continued validity. All marks that are deemed material to our business have been applied for or registered in the United States and select foreign countries, including Canada, Mexico and other countries in Latin America, Europe, and Asia.\nWe believe our trademarks, especially those related to the Ulta Beauty brand, “All Things Beauty. All In One Place.\n ®”\n, “The Possibilities are Beautiful\n®\n”, “21 Days of Beauty\n®\n”, and “Conscious Beauty at Ulta Beauty\n®\n” have significant value and are important to building brand recognition.\nGovernment regulation\nWe are affected by extensive laws, governmental regulations, administrative determinations, court decisions, and similar constraints. Such laws, regulations, and other constraints exist at the federal, state, or local levels in the United States. The products we sell, such as cosmetics (including products with cannabidiol), dietary supplements, food, over-the-counter (OTC) drugs, medical devices, and styling tools, including our Ulta Beauty branded products, may be subject to regulation by the U.S. Food and Drug Administration (FDA), the U.S. Federal Trade Commission (FTC), the Consumer Product Safety Commission (CPSC), the Environmental Protection Agency (EPA), state regulatory agencies, and State Attorneys General (State AGs). Such regulations principally relate to the safety, labeling, manufacturing, advertising, and distribution of the products. In addition, the salon services provided in our stores may be subject to state and local regulations.\nCosmetics, OTC drugs, medical devices, and dietary supplements have specific regulatory requirements, including but not limited to ingredient, labeling, manufacturing, and holding requirements. Products such as wrinkle reducing lights may be classified as medical devices and, in addition to being subject to labeling and manufacturing requirements, may also be subject to premarketing review by the FDA. Finally, products such as styling tools (e.g., blow dryers and curling irons) are regulated by the CPSC, which has strict requirements including the requirement to report certain product defects. The labeling and packaging of all of these products may also be subject to the requirements of the Fair Packaging and Labeling Act and state specific requirements.\nFurther, statements we make in advertising, including statements about the safety or efficacy of products, pricing, and environmental claims, are subject to federal and state consumer protection laws, which generally prohibit unfair or deceptive practices.\nFederal, state, municipal, and local labor and employment statutes, laws, ordinances, regulations, mandates, and taxation laws, to which most retailers are typically subject, also impact our day-to-day operations. We are also subject to typical governmental and real estate land use restrictions and typical advertising and consumer protection laws (both federal and state). Our services operations are subject to state board regulations and state licensing requirements. \nIn our store leases, we require our landlords to obtain all necessary governmental approvals and permits for the site to be used as a retail site, and we also ask them to obtain any governmental approvals and permits for our specific use (but at times the responsibility for obtaining governmental approvals and permits for our specific use falls to us). As applicable, we require our landlords to deliver a certificate of occupancy for any work they perform on our buildings or the shopping centers in which our stores are located. If required by the municipality, we are responsible for delivering a certificate of occupancy for any remodeling or build-outs that we perform and are responsible for complying with all applicable laws in connection with such construction projects or build-outs.\nSeasonality\nOur business is subject to seasonal fluctuation. Significant portions of our net sales and profits are realized during the fourth quarter of the fiscal year due to the holiday selling season. To a lesser extent, our business is also affected by Mother’s Day and Valentine’s Day.\n14\n\n\nTable of Contents\nAvailable information\nOur principal website address is www.ulta.com. We make available at this address under investor relations (at https://ulta.com/investor), free of charge, our proxy statement, annual report to shareholders, annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and all amendments to those reports as soon as reasonably practicable after such material is electronically filed with or furnished to the SEC. Information available on our website is not incorporated by reference in and is not deemed a part of this Form 10-K. In addition, our filings with the SEC may be accessed through the SEC’s website at www.sec.gov. All statements made in any of our securities filings, including all forward-looking statements or information, are made as of the date of the document in which the statement is included, and we do not assume or undertake any obligation to update any of those statements or documents unless we are required to do so by law.",
  "item7": "Item 7.\n   Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our financial statements and related notes included elsewhere in this Annual Report on Form 10-K.\nOverview \nWe were founded in 1990 as a beauty retailer at a time when prestige, mass, and salon products were sold through distinct channels – department stores for prestige products; drug stores and mass merchandisers for mass products; and salons and authorized retail outlets for professional hair care products. We developed a unique specialty retail concept that offers a broad range of brands and price points, select beauty services, and a convenient and welcoming shopping environment. We define our target consumer as a beauty enthusiast, a consumer who is passionate about the beauty category, uses beauty for self-expression, experimentation, and self-investment, and has high expectations for the shopping experience. We estimate there are approximately 140 million beauty enthusiasts in the U.S. We believe our strategy provides us with the competitive advantages that have contributed to our financial performance.\nToday, we are the largest specialty beauty retailer in the United States and the premier beauty destination for cosmetics, fragrance, skin care products, hair care products, wellness products, and salon services. Key aspects of our business include: a differentiated assortment of approximately 29,000 beauty products across a variety of categories and price points as well as a variety of beauty services, including salon services, in more than 1,400 stores predominantly located in convenient, high-traffic locations; engaging digital experiences delivered through our website, Ulta.com, and our mobile applications; our best-in-class loyalty program that enables members to earn points for every dollar spent on products and beauty services and provides us with deep, proprietary customer insights; and our ability to cultivate human connection with warm and welcoming guest experiences across all of our channels. \nThe continued growth of our business and any future increases in net sales, net income, and cash flows is dependent on our ability to execute our strategic priorities across four foundational focus areas: 1) Assortment: curating the best of all things beauty and wellness for all beauty enthusiasts; 2) Experience: fostering authentic, empowering human connections that inspire, delight and engage guests at every touchpoint; 3) Loyalty: building lifelong loyalty and brand love through member growth and personalization; and 4) Access: engaging our guests wherever they want to shop by expanding our reach through seamless and immersive omnichannel experiences. We operate in an attractive and growing U.S. beauty products and salon services industry, and believe our strong operating model, competitive advantages, and financial foundation, paired with our investments to drive our growth, position us to capture additional market share in the industry.\nComparable sales is a key metric that is monitored closely within the retail industry. Our comparable sales have fluctuated in the past, and we expect them to continue to fluctuate in the future. A variety of factors affect our comparable sales, including general U.S. economic conditions, changes in merchandise strategy or mix, and timing and effectiveness of our marketing activities, among others.\nOver the long term, our growth strategy is to drive profitable growth and market share leadership in beauty and wellness through growing our comparable sales, expanding omnichannel capabilities, and opening new stores. Long-term operating profit is expected to increase as a result of our efforts to drive revenue growth, leverage fixed costs, improve \n33\n\n\nTable of Contents\nmerchandise margin, increase operating efficiencies, and grow other revenue, partially offset by incremental investments in new stores and technology to enhance the guest experience, people, assortment, advertising, and depreciation.\nCurrent Trends\nIndustry trend\ns\n​\nThe overall beauty market expanded in 2023 and 2024, supported by on-going consumer engagement with the beauty category. We remain confident that our differentiated and diverse business model, our commitment to strategic investments, and our highly engaged associates will continue to drive market share gains over the long term.\n​\nImpact of inflation and other macroeconomic trends\n \nPersistent inflationary and macroeconomic pressures have impacted consumer spending habits broadly, which we believe may have contributed to lower sales trends throughout fiscal 2024. The continuation of inflationary and macroeconomic pressures could further impact our ability to grow sales and maintain historical profitability levels. In addition, inflation could cause the interest rates on any future debt to remain at an elevated level or increase.\n​\nBasis of presentation\n​\nThe Company has one reportable segment, which includes retail stores, salon services, and e-commerce.  \nWe recognize merchandise revenue at the point of sale in our retail stores. E-commerce sales are recognized upon shipment or guest pickup of the merchandise\n \nbased on meeting the transfer of control criteria. Retail store and e-commerce sales are recorded net of estimated returns. Shipping and handling are treated as costs to fulfill the contract and not a separate performance obligation. Accordingly, we recognize revenue for our single performance obligation related to online sales at the time control of the merchandise passes to the customer, which is at the time of shipment or guest pickup. We provide refunds for merchandise returns within 30 days from the original purchase date. State sales taxes are presented on a net basis as we consider our self a pass-through conduit for collecting and remitting state sales tax. Salon service revenue is recognized at the time the service is provided to the guest. Gift card sales revenue is deferred until the guest redeems the gift card. Company coupons and other incentives are recorded as a reduction of net sales. Other revenue includes the private label and co-branded credit card programs, royalties derived from the partnership with Target Corporation, and deferred revenue related to the loyalty program and gift card breakage.\n​\nComparable sales reflect sales for stores beginning on the first day of the 14\nth\n month of operation. Therefore, a store is included in our comparable store base on the first day of the period after one year of operations plus the initial one-month grand opening period. Non-comparable store sales include sales from new stores that have not yet completed their 13\nth\n month of operation and stores that were closed for part or all of the period in either year. Remodeled stores are included in comparable sales unless the store was closed for a portion of the current or prior period. Comparable sales include retail sales, salon services, and e-commerce. In fiscal years with 53 weeks, the 53\nrd\n week of comparable sales is included in the calculation. In the year following a 53-week year, the prior year period is shifted by one week to compare similar calendar weeks. There may be variations in the way in which some of our competitors and other retailers calculate comparable or same store sales.\nMeasuring comparable sales allows us to evaluate the performance of our store base as well as several other aspects of our overall strategy. Several factors could positively or negatively impact our comparable sales results:\n●\nthe general national, regional, and local economic conditions and corresponding impact on customer spending levels;\n●\nthe introduction of new products or brands;\n●\nthe location of new stores in existing store markets;\n●\ncompetition / alternative distribution channels;\n●\nour ability to respond on a timely basis to changes in consumer preferences;\n●\nthe effectiveness of our various merchandising and marketing activities; and\n34\n\n\nTable of Contents\n●\nthe number of new stores opened and the impact on the average age of all of our comparable stores.\nCost of sales includes:\n●\nthe cost of merchandise sold, offset by vendor income that is not a reimbursement of specific, incremental, and identifiable costs;\n●\ndistribution costs including labor and related benefits, freight, rent, depreciation and amortization, real estate taxes, utilities, and insurance;\n●\nshipping and handling costs for e-commerce orders;\n●\nretail store occupancy costs including rent, depreciation and amortization, real estate taxes, utilities, repairs and maintenance, insurance, and licenses;\n●\nsalon services payroll and benefits; and\n●\nshrink and inventory valuation reserves.\nOur cost of sales may be negatively impacted as we open new stores. Changes in our merchandise or channel mix may also have an impact on cost of sales. This presentation of items included in cost of sales may not be comparable to the way in which our competitors or other retailers compute their cost of sales.\nSelling, general and administrative (SG&A) expenses include:\n●\npayroll, bonus, and benefit costs for retail store and corporate employees;\n●\nadvertising and marketing costs, offset by vendor income that is a reimbursement of specific, incremental, and identifiable costs;\n●\noccupancy costs related to our corporate office facilities;\n●\nstock-based compensation expense;\n●\ndepreciation and amortization for all assets, except those related to our retail stores and distribution operations, which are included in cost of sales; and\n●\nlegal, finance, information systems, and other corporate overhead costs.\nThis presentation of items in selling, general and administrative expenses may not be comparable to the way in which our competitors or other retailers compute their selling, general and administrative expenses.\nPre-opening expenses include non-capital expenditures during the period prior to store opening for new, remodeled, and relocated stores including rent during the construction period for new and relocated stores, store set-up labor, management and employee training, and grand opening advertising.\nInterest income represents interest from cash equivalents, which include highly liquid investments such as money market funds and certificates of deposit with an original maturity of three months or less from the date of purchase. Interest expense includes interest costs and facility fees associated with our credit facility, which is structured as an asset-based lending instrument. Our credit facility interest is based on a variable interest rate structure which can result in increased cost in periods of rising or elevated interest rates. \nIncome tax expense reflects the federal statutory tax rate and the weighted average state statutory tax rate for the states in which we operate stores.\nResults of operations\nOur fiscal years are the 52- or 53-week periods ending on the Saturday closest to January 31. The Company’s fiscal years ended February 1, 2025 (fiscal 2024), February 3, 2024 (fiscal 2023), and January 28, 2023 (fiscal 2022) were 52, 53, and 52 week years, respectively.\n35\n\n\nTable of Contents\nAs of February 1, 2025, we operated 1,445 stores across 50 states. The following tables present the components of our consolidated results of operations for the periods indicated:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal year ended\n​\n​\nFebruary 1,\n​\nFebruary 3,\n​\nJanuary 28,\n(Dollars in thousands)\n​\n2025\n    \n2024\n    \n2023\nNet sales \n​\n$\n 11,295,654\n​\n$\n 11,207,303\n​\n$\n 10,208,580\nCost of sales\n​\n​\n 6,908,401\n​\n​\n 6,826,203\n​\n​\n 6,164,070\nGross profit\n​\n​\n 4,387,253\n​\n​\n 4,381,100\n​\n​\n 4,044,510\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSelling, general and administrative expenses\n​\n​\n 2,808,592\n​\n​\n 2,694,561\n​\n​\n 2,395,299\nPre-opening expenses\n​\n​\n 13,689\n​\n​\n 8,510\n​\n​\n 10,601\nOperating income\n​\n​\n 1,564,972\n​\n​\n 1,678,029\n​\n​\n 1,638,610\nInterest income, net\n​\n​\n (15,094)\n​\n​\n (17,622)\n​\n​\n (4,934)\nIncome before income taxes\n​\n​\n 1,580,066\n​\n​\n 1,695,651\n​\n​\n 1,643,544\nIncome tax expense\n​\n​\n 378,948\n​\n​\n 404,646\n​\n​\n 401,136\nNet income\n​\n$\n 1,201,118\n​\n$\n 1,291,005\n​\n$\n 1,242,408\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nOther operating data:\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNumber of stores end of period\n​\n​\n1,445\n​\n​\n1,385\n​\n​\n1,355\nComparable sales\n​\n​\n0.7%\n​\n​\n5.7%\n​\n​\n15.6%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal year ended\n​\n​\nFebruary 1,\n​\nFebruary 3,\n​\nJanuary 28,\n(Percentage of net sales)\n​\n2025\n    \n2024\n    \n2023\nNet sales \n​\n​\n100.0%\n​\n​\n100.0%\n​\n​\n100.0%\nCost of sales\n​\n​\n61.2%\n​\n​\n60.9%\n​\n​\n60.4%\nGross profit\n​\n​\n38.8%\n​\n​\n39.1%\n​\n​\n39.6%\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nSelling, general and administrative expenses\n​\n​\n24.9%\n​\n​\n24.0%\n​\n​\n23.5%\nPre-opening expenses\n​\n​\n0.1%\n​\n​\n0.1%\n​\n​\n0.1%\nOperating income\n​\n​\n13.9%\n​\n​\n15.0%\n​\n​\n16.1%\nInterest income, net\n​\n​\n(0.1%)\n​\n​\n(0.2%)\n​\n​\n0.0%\nIncome before income taxes\n​\n​\n14.0%\n​\n​\n15.1%\n​\n​\n16.1%\nIncome tax expense\n​\n​\n3.4%\n​\n​\n3.6%\n​\n​\n3.9%\nNet income\n​\n​\n10.6%\n​\n​\n11.5%\n​\n​\n12.2%\n​\nFiscal year 2024 versus fiscal year 2023\nNet sales\nNet sales increased $88.4 million, or 0.8%, to $11.3 billion in fiscal 2024 compared to $11.2 billion in fiscal 2023. The net sales increase was primarily due to new store performance, increased comparable sales, and an increase of $3.7 million in other revenue, partially offset by the benefit of an extra week of sales in fiscal 2023. Net sales for the 53\nrd\n week of fiscal 2023 were approximately $181.9 million. The total comparable sales increase of 0.7% in fiscal 2024,  was driven by \na 1.1% increase in average ticket and a 0.4% decrease in transactions. The total comparable sales increase in fiscal 2023 was 5.7%.\n​\n​\n36\n\n\nTable of Contents\nGross profit\nGross profit increased $6.2 million, or 0.1%, to $4.39 billion in fiscal 2024, compared to $4.38 billion in fiscal 2023. Gross profit as a percentage of net sales decreased 30 basis points to 38.8% in fiscal 2024 compared to 39.1% in fiscal 2023. The decrease in gross profit margin was primarily due to:\n●\n40 basis points of deleverage in merchandise margins driven by lapping favorable price increase impacts from the prior year and higher promotional activity;\n●\n20 basis points of deleverage of store fixed costs driven by more net new store openings; and\n●\n10 basis points of deleverage due to higher supply chain costs; partially offset by\n●\n20 basis points of leverage in inventory shrink; and\n●\n20 basis points of leverage due to favorable channel mix.\n​\nSelling, general and administrative expenses\nSG&A expenses increased $114.0 million, or 4.2%, to $2.8 billion in fiscal 2024 compared to $2.7 billion in fiscal 2023. As a percentage of net sales, SG&A expenses increased 90 basis points to 24.9% in fiscal 2024 compared to 24.0% in fiscal 2023. The deleverage of SG&A expenses was primarily due to:\n●\n60 basis points of deleverage of store payroll and benefits due to wage investments; \n●\n40 basis points of deleverage of corporate overhead primarily due to strategic investments; and\n●\n10 basis points of deleverage of store expenses due to ongoing inflationary pressures; partially offset by\n●\n20 basis points of leverage due to lower incentive compensation.\n​\nPre-opening expenses\nPre-opening expenses increased $5.2 million, or 60.9%, to $13.7 million in fiscal 2024 compared to $8.5 million in fiscal 2023.\nInterest income, net\nNet interest income was $15.1 million in fiscal 2024 compared to $17.6 million in fiscal 2023, due to lower average cash balances. We did not have any outstanding borrowings on our credit facility as of February 1, 2025 and February 3, 2024. \nIncome tax expense\nIncome tax expense of $378.9 million in fiscal 2024 represents an effective tax rate of 24.0%, compared to fiscal 2023 income tax expense of $404.6 million and an effective tax rate of 23.9%.\n​\nNet income\nNet income decreased $89.9 million to $1.2 billion in fiscal 2024 compared to $1.3 billion in fiscal 2023. The decrease in net income was primarily due to a $114.0 million increase in SG&A expenses and a $5.2 million increase in pre-opening expenses, partially offset by a $25.7 million decrease in income taxes and a $6.2 million increase in gross profit. \nFiscal year 2023 versus fiscal year 2022\nNet sales\nNet sales increased $998.7 million, or 9.8%, to $11.2 billion in fiscal 2023 compared to $10.2 billion in fiscal 2022. The net sales increase was primarily due to increased comparable sales, strong new store performance, an increase of $68.3 million in other revenue and the benefit of an extra week of sales in fiscal 2023. Net sales for the 53\nrd\n week of fiscal \n37\n\n\nTable of Contents\n2023 were approximately $181.9 million. The total comparable sales increase of 5.7% in fiscal 2023, compared to an increase of 15.6% in fiscal 2022, was driven by a 7.4% increase in transactions and a 1.5% decrease in average ticket. \n​\nGross profit\n​\nGross profit increased $336.6 million, or 8.3%, to $4.4 billion in fiscal 2023, compared to $4.0 billion in fiscal 2022. Gross profit as a percentage of net sales decreased 50 basis points to 39.1% in fiscal 2023 compared to 39.6% in fiscal 2022. The decrease in gross profit margin was primarily due to:\n●\n80 basis points of deleverage in merchandise margins driven by higher promotional activity and category mix, as well as lapping of benefits from price increases; and\n●\n40 basis points of deleverage in inventory shrink; partially offset by\n●\n50 basis points of leverage in other revenue primarily due to credit card income growth, an increase in royalty income from our partnership with Target, and higher loyalty point redemptions; and\n●\n20 basis points of leverage of store fixed costs attributed to the impact of higher sales.\n​\nSelling, general and administrative expenses\nSG&A expenses increased $299.3 million, or 12.5%, to $2.7 billion in fiscal 2023 compared to $2.4 billion in fiscal 2022. As a percentage of net sales, SG&A expenses increased 50 basis points to 24.0% in fiscal 2023 compared to 23.5% in fiscal 2022. The deleverage of SG&A expenses was primarily due to:\n●\n60 basis points of deleverage of corporate overhead primarily due to strategic investments; \n●\n20 basis points of deleverage of store payroll and benefits due to wage investments; \n●\n10 basis points of deleverage of store expenses due to ongoing inflationary pressures; and\n●\n10 basis points of deleverage due to higher marketing expenses; partially offset by\n●\n50 basis points of leverage due to lower incentive compensation.\n​\nPre-opening expenses\nPre-opening expenses decreased $2.1 million, or 19.7%, to $8.5 million in fiscal 2023 compared to $10.6 million in fiscal 2022.\nInterest income, net\nNet interest income was $17.6 million in fiscal 2023 compared to $4.9 million in fiscal 2022, due to higher average interest rates on cash balances. We did not have any outstanding borrowings on our credit facility as of February 3, 2024 and January 28, 2023. \nIncome tax expense\nIncome tax expense of $404.6 million in fiscal 2023 represents an effective tax rate of 23.9%, compared to fiscal 2022 income tax expense of $401.1 million and an effective tax rate of 24.4%. The lower income tax rate is primarily due to a decrease in state income taxes compared to fiscal 2022 and a tax benefit from the income tax accounting for stock-based compensation.\n​\nNet income\nNet income increased $48.6 million to $1.3 billion in fiscal 2023 compared to $1.2 billion in fiscal 2022. The increase in net income was primarily due to a $336.6 million increase in gross profit, partially offset by a $299.3 million increase in SG&A expenses and a $3.5 million increase in income taxes. \n38\n\n\nTable of Contents\nLiquidity and capital resources\nOur primary sources of liquidity are cash and cash equivalents, cash flows from operations, and borrowings under our credit facility. The most significant components of our working capital are merchandise inventories, cash and cash equivalents, and receivables, reduced by accounts payable, deferred revenue, and accrued liabilities. As of February 1, 2025 and February 3, 2024, we had cash and cash equivalents of $703.2 million and $766.6 million, respectively.\nOur primary cash needs are for rent, capital expenditures for new, remodeled, and relocated stores, increased merchandise inventories related to store expansion and new brand additions, supply chain improvements, share repurchases, and continued investment in our information technology systems.\nOur most significant ongoing short-term cash requirements relate primarily to funding operations (including expenditures for lease expenses, inventory, labor, distribution, advertising and marketing, and tax liabilities) as well as periodic spend for capital expenditures, investments, and share repurchases. Our working capital needs are greatest from August through November each year as a result of our inventory build-up during this period for the approaching holiday season. \nLong-term cash requirements primarily relate to funding lease expenses and other purchase commitments.\nWe generally fund short-term and long-term cash requirements with cash from operating activities. We believe our primary sources of liquidity will satisfy our cash requirements over both the short term (the next twelve months) and long term.\nThe following table summarizes contractual cash requirements as of February 1, 2025:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nLess Than \n​\n1 to 3\n​\n3 to 5\n​\nMore than 5\n(In thousands)\n    \nTotal\n    \n1 Year\n    \nYears\n    \nYears\n    \nYears\nOperating lease obligations (1)\n​\n$\n 2,357,226\n​\n$\n 366,106\n​\n$\n 757,852\n​\n$\n 527,070\n​\n$\n 706,198\nPurchase obligations \n​\n​\n 16,806\n​\n​\n 13,471\n​\n​\n 3,335\n​\n​\n —\n​\n​\n —\nTotal (2)\n​\n$\n 2,374,032\n​\n$\n 379,577\n​\n$\n 761,187\n​\n$\n 527,070\n​\n$\n 706,198\n(1)\nThese amounts are for our undiscounted lease obligations recorded in our consolidated balance sheets as operating lease liabilities. Also included are legally binding minimum lease payments for leases signed but not yet commenced of $172.6 million, which are excluded from operating lease liabilities shown on our consolidated balance sheets. \n(2)\nThe unrecognized tax benefit of $5.2 million as of February 1, 2025 is excluded due to uncertainty regarding the realization and timing of the related future cash flows, if any.\nPurchase obligations reflect legally binding agreements entered into by the Company to purchase goods or services. The amount of purchase obligations relates to commitments for products and services and other goods and service contracts entered into as of February 1, 2025. Excluded from purchase obligations are normal purchases and contracts entered into in the ordinary course of business. \nCash flows\nWe believe our ability to generate substantial cash from operating activities and readily secure financing at competitive rates are key strengths that give us significant flexibility to meet our short and long-term financial commitments. \n​\n​\n39\n\n\nTable of Contents\n​\nThe following table presents a summary of our cash flows during the last three years:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal year ended\n​\n​\nFebruary 1,\n​\nFebruary 3,\n​\nJanuary 28,\n(In thousands)\n    \n2025\n    \n2024\n    \n2023\nNet cash provided by operating activities\n​\n$\n 1,338,605\n​\n$\n 1,476,266\n​\n$\n 1,481,915\nNet cash used in investing activities\n​\n​\n (383,089)\n​\n​\n (441,425)\n​\n​\n (314,584)\nNet cash used in financing activities\n​\n​\n (1,018,909)\n​\n​\n (1,006,124)\n​\n​\n (861,014)\nOperating activities\nOperating activities consist of net income adjusted for certain non-cash items, including depreciation and amortization, non-cash lease expense, deferred income taxes, stock-based compensation expense, realized gains or losses on disposal of property and equipment, and the effect of working capital changes. \nThe decrease in net cash provided by operating activities in fiscal 2024 compared to fiscal 2023 is mainly due to the decrease in net income, a larger increase in merchandise inventories in fiscal 2024, and timing of deferred income taxes, prepaid expenses and other current assets, accrued liabilities, accounts payable, and deferred revenue. \nMerchandise inventories, net were $2.0 billion at February 1, 2025, compared to $1.7 billion at February 3, 2024, representing an increase of $226.1 million or 13.0%. The increase in total inventory is primarily due to the following:\n●\n$131 million increase due to new key brand launches and inventory investments; and\n●\n$95 million increase due to the addition of 60 net new stores opened since February 3, 2024.\n​\nThe decrease in net income was primarily due to an increase in SG&A expenses and pre-opening expenses, partially offset by a decrease in income taxes and an increase in gross profit.\nThe decrease in net cash provided by operating activities in fiscal 2023 compared to fiscal 2022 is mainly due to the timing of accrued liabilities, accounts payable, receivable collections, prepaid income taxes, and prepaid expenses and other current assets and a larger increase in merchandise inventories in fiscal 2023, partially offset by the increase in net income and non-cash lease expense. \n​\nInvesting activities\nWe have historically used cash primarily for new, remodeled, relocated, and refreshed stores, supply chain investments, short-term investments, and investments in information technology systems. Investment activities for capital expenditures were $374.5 million during fiscal 2024, compared to $435.3 million during fiscal 2023.\nThe decrease in net cash used in investing activities in fiscal 2024 relative to fiscal 2023 was primarily due to less capital expenditures for information technology systems and supply chain, partially offset by more capital expenditures for new, remodeled, and relocated stores compared to fiscal 2023. \nThe increase in net cash used in investing activities in fiscal 2023 relative to fiscal 2022 was primarily due to more capital expenditures for new, remodeled, and relocated stores and information technology systems compared to fiscal 2022. \n​\n​\n40\n\n\nTable of Contents\nCapital expenditures\n​\nThe following table presents a summary of our store activities during the last three years: \n​\n​\n​\n​\n​\n​\n​\n​\n    \nFiscal year ended\n​\n​\nFebruary 1,\n   \nFebruary 3,\n    \nJanuary 28,\n​\n​\n2025\n​\n2024\n​\n2023\nStores opened\n​\n 66\n​\n 33\n​\n 47\nStores remodeled\n​\n 41\n​\n 18\n​\n 20\nStores relocated\n​\n 2\n​\n 7\n​\n 12\n​\nDuring fiscal 2024, the average investment required to open a new Ulta Beauty store was approximately $2.1 million, which includes capital investment net of landlord contributions, pre-opening expenses, and initial inventory net of payables. \nCapital expenditures during the last three years by major category are as follows:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nBudget\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal \n​\nFiscal\n​\nFiscal\n​\nFiscal\n(In millions)\n   \n2025\n   \n2024\n   \n2023\n   \n2022\nNew, Remodeled, and Relocated Stores\n​\n$\n 210\n​\n$\n 176\n​\n$\n 141\n​\n$\n 102\nMerchandising and Refreshed Stores\n​\n​\n 67\n​\n​\n 52\n​\n​\n 37\n​\n​\n 34\nInformation Technology Systems\n​\n​\n 97\n​\n​\n 70\n​\n​\n 124\n​\n​\n 74\nSupply Chain\n​\n​\n 70\n​\n​\n 27\n​\n​\n 73\n​\n​\n 70\nStore Maintenance and Other\n​\n​\n 56\n​\n​\n 49\n​\n​\n 60\n​\n​\n 32\nTotal\n​\n$\n500\n​\n$\n374\n​\n$\n 435\n​\n$\n312\n​\nOur future investments will depend primarily on the number of new, remodeled, and relocated stores, information technology systems investments, and supply chain investments that we undertake and the timing of these expenditures. Based on past performance and current expectations, we believe our sources of liquidity will be sufficient to fund future capital expenditures. We expect fiscal 2025 capital expenditures will be up to $500 million and will be used primarily to fund our new, remodeled, and relocated stores and strategic priorities, including investments in information technology systems and supply chain optimization.\nFinancing activities\nFinancing activities include share repurchases, borrowing and repayment of our revolving credit facility, and capital stock transactions. Purchases of treasury shares represent the fair value of common shares repurchased from plan participants in connection with shares withheld to satisfy minimum statutory tax obligations upon the vesting of restricted stock.\nThe increase in net cash used in financing activities in fiscal 2024 relative to fiscal 2023 was primarily due to an increase in share repurchases. \nThe increase in net cash used in financing activities in fiscal 2023 relative to fiscal 2022 was primarily due to an increase in share repurchases and less stock options exercised. \nWe had no borrowings outstanding under the credit facility at the end of fiscal 2024, 2023, and 2022. The zero outstanding borrowings position is due to a combination of factors including sales demand, overall performance of management initiatives including expense control, and inventory and other working capital reductions. We may require borrowings under the facility from time to time in future periods for unexpected business disruptions, to support our new store program, seasonal inventory needs, or share repurchases. \n41\n\n\nTable of Contents\nShare repurchase program\nIn March 2022, the Board of Directors authorized a share repurchase program (the 2022 Share Repurchase Program) pursuant to which the Company could repurchase up to $2.0 billion of the Company’s common stock. The 2022 Share Repurchase Program revoked the previously authorized but unused amounts from the earlier share repurchase program. The 2022 Share Repurchase Program did not have an expiration date but provided for suspension or discontinuation at any time.\nIn March 2024, the Board of Directors authorized a share repurchase program (the March 2024 Share Repurchase Program) pursuant to which the Company could repurchase up to $2.0 billion of the Company’s common stock. The March 2024 Share Repurchase Program authorization revoked the previously authorized but unused amounts from the 2022 Share Repurchase Program. The March 2024 Share Repurchase Program did not have an expiration date but provided for suspension or discontinuation at any time.\n​\nIn October 2024, the Board of Directors authorized a share repurchase program (the October 2024 Share Repurchase Program) pursuant to which the Company may repurchase up to $3.0 billion of the Company’s common stock. The October 2024 Share Repurchase Program authorization revoked the previously authorized but unused amounts from the March 2024 Share Repurchase Program. The October 2024 Share Repurchase Program does not have an expiration date and may be suspended or discontinued at any time.\n​\nA summary of common stock repurchase activity is presented in the following table:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nFiscal year ended\n​\n​\nFebruary 1,\n​\nFebruary 3,\n​\nJanuary 28,\n(Dollars in millions)\n​\n2025\n​\n2024\n​\n2023\nShares repurchased\n​\n​\n 2,489,367\n​\n​\n 2,173,431\n​\n​\n 2,192,556\nTotal cost of shares repurchased\n​\n$\n 1,023.5\n​\n$\n 1,009.3\n​\n$\n 900.0\n​\n​\nCredit facility\nOn March 13, 2024, we entered into Amendment No. 3 to the Second Amended and Restated Loan Agreement (as so amended, the Loan Agreement) with Wells Fargo Bank, National Association, as Administrative Agent, Collateral Agent and a Lender thereunder; Wells Fargo Bank, National Association and JPMorgan Chase Bank, N.A., as Lead Arrangers and Bookrunners; JPMorgan Chase Bank, N.A., as Syndication Agent and a Lender; PNC Bank, National Association, as Documentation Agent and a Lender; and the other lenders party thereto. The Loan Agreement matures on March 13, 2029, provides maximum revolving loans equal to the lesser of $800.0 million or a percentage of eligible owned inventory and eligible owned receivables (which borrowing base may, at the election of the Company and satisfaction of certain conditions, include a percentage of qualified cash), contains a $50.0 million subfacility for letters of credit and allows the Company to increase the revolving facility by an additional $200.0 million, subject to the consent by each lender and other conditions. The Loan Agreement contains a requirement to maintain a fixed charge coverage ratio of not less than 1.0 to 1.0 during such periods when availability under the Loan Agreement falls below a specified threshold. Substantially all of the Company’s assets are pledged as collateral for outstanding borrowings under the Loan Agreement. Outstanding borrowings bear interest, at the Company’s election, at either a base rate plus a margin of 0.5% to 1.0% or the Term Secured Overnight Financing Rate plus a margin of 1.5% to 2.0%, and a credit spread adjustment of 0.10%, with such margins based on the Company’s borrowing availability, and the unused line fee is 0.25% to 0.375% per annum.\nAs of February 1, 2025 and February 3, 2024, we had no borrowings outstanding under the credit facility and we were in compliance with all terms and covenants of the Loan Agreement.\nSeasonality\nOur business is subject to seasonal fluctuation. Significant portions of our net sales and profits are realized during the fourth quarter of the fiscal year due to the holiday selling season. To a lesser extent, our business is also affected by \n42\n\n\nTable of Contents\nMother’s Day and Valentine’s Day. Any decrease in sales during these higher sales volume periods could have an adverse effect on our business, financial condition, or operating results for the entire fiscal year. Our quarterly results of operations have varied in the past and are likely to do so again in the future. As such, we believe that period-to-period comparisons of our results of operations should not be relied upon as an indication of our future performance.\nCritical accounting policies and estimates\nManagement’s discussion and analysis of financial condition and results of operations is based upon our consolidated financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles. The preparation of these financial statements required the use of estimates and judgments that affect the reported amounts of our assets, liabilities, revenues, and expenses. Management bases estimates on historical experience and other assumptions it believes to be reasonable under the circumstances and evaluates these estimates on an on-going basis. Actual results may differ from these estimates. A discussion of our more significant estimates follows. Management has discussed the development, selection, and disclosure of these estimates and assumptions with the Audit Committee of the Board of Directors.\nInventory valuation\nMerchandise inventories are carried at the lower of cost or net realizable value. Cost is determined using the moving average cost method and includes costs incurred to purchase and distribute goods as well as related vendor allowances including co-op advertising, markdowns, and volume discounts. We record valuation adjustments to our inventories if the cost of a specific product on hand exceeds the amount we expect to realize from the ultimate sale or disposal of the inventory as well as for any excess or discontinued inventory. These estimates are based on management’s judgment regarding future demand, age of inventory, and analysis of historical experience. If actual demand or market conditions are different than those projected by management, future merchandise margin rates may be affected by adjustments to these estimates.\nInventories are adjusted for the results of periodic physical inventory counts at each of our locations. We record a shrink reserve representing management’s estimate of inventory losses by location that have occurred since the date of the last physical count. This estimate is based on management’s analysis of historical results, including consideration of current loss rates.\nWe do not believe that there is a reasonable likelihood that there will be a material change in the future estimates or assumptions we use to calculate our inventory reserves. Adjustments to earnings resulting from revisions to management’s estimates of the inventory reserves have been insignificant during fiscal 2024, 2023, and 2022. An increase or decrease in the lower of cost or net realizable value reserve of 10% would not have a material impact on our operating income for fiscal 2024. An increase or decrease in the shrink rate included in the shrink reserve calculation of 10% would not have a material impact on our operating income for fiscal 2024.\nVendor allowances\nThe majority of cash consideration received from a vendor is considered to be a reduction of the cost of the related products and is reflected in cost of sales in our consolidated statements of income as the related products are sold unless it is in exchange for an asset or service or a reimbursement of a specific, incremental, identifiable cost incurred by the Company in selling the vendors’ products. We estimate the amount recorded as a reduction of inventory at the end of each period based on a detailed analysis of inventory turns and management’s analysis of the facts and circumstances of the various contractual agreements with vendors. We record cash consideration expected to be received from vendors in receivables. We do not believe there is a reasonable likelihood there will be a material change in the future estimates or assumptions we use to calculate our reduction of inventory. An increase or decrease in inventory turns of five basis points would not have a material impact on our operating income for fiscal 2024.\n43\n\n\nTable of Contents\nImpairment of long-lived tangible assets\nWe review long-lived tangible assets whenever events or circumstances indicate these assets might not be recoverable. Assets are primarily reviewed at the store level, which is the lowest level for which cash flows can be identified. Significant estimates are used in determining future operating results of each store over its remaining lease term. An impairment loss would be recorded if the carrying amount of the long-lived asset exceeds its fair value. We do not believe there is a reasonable likelihood there will be a material change in the future estimates or assumptions we use to calculate our impairment charges. No impairment charges were recognized in fiscal 2024, 2023, and 2022.\nLoyalty program\nWe maintain a customer loyalty program, Ulta Beauty Rewards, which allows members to earn points based on purchases of merchandise or services. Points earned are valid for at least one year. The loyalty program represents a material right to the customer and points may be redeemed on future products and services. Revenue from the loyalty program is recognized when the members redeem points or points expire. We defer revenue related to points earned that have not yet been redeemed. The amount of deferred revenue includes estimates for the standalone selling price of points earned by members and the percentage of points expected to be redeemed. The expected redemption percentage is based on historical redemption patterns and considers current information or trends. The standalone selling price of points earned and the estimated redemption rate is evaluated each reporting period. We do not believe there is a reasonable likelihood there will be a material change in the future estimates or assumptions used to calculate the estimated redemption rate. \nAdjustments to earnings resulting from revisions to management’s estimates of the redemption rates have been insignificant during fiscal 2024, 2023, and 2022. An increase or decrease in the estimated redemption rate of 5% would not have a material impact on our operating income in fiscal 2024. \n​\nIncome taxes\n​\nWe are subject to income taxes in the United States. Judgment is required in determining our provision for income taxes and income tax assets and liabilities, including evaluating uncertainties in the application of accounting principles and complex tax laws.\n​\nWe recognize deferred income taxes for the estimated future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which temporary differences are anticipated to be recovered or settled. The effect on deferred taxes of a change in income tax rates is recognized in the consolidated statements of income in the period of enactment. A valuation allowance is recorded to reduce the carrying amounts of deferred tax assets to the amount expected to be realized unless it is more-likely-than-not that such assets will be realized in full. The estimated tax benefit of an uncertain tax position is recorded in our consolidated financial statements only after determining a more-likely-than-not probability that the uncertain tax position will withstand challenge, if any, from applicable taxing authorities.   \n​\nJudgment is required in assessing the future tax consequences of events that have been recognized on our consolidated financial statements or tax returns. Variations in the actual outcome of these future tax consequences could materially impact our consolidated financial statements.\nRecently adopted accounting pronouncements\nSee Note 2 to our consolidated financial statements, “Summary of significant accounting policies – Recently adopted accounting pronouncements.”\n​\n​\n44\n\n\nTable of Contents\nRecent accounting pronouncements not yet adopted\nSee Note 2 to our consolidated financial statements, “Summary of significant accounting policies – Recent accounting pronouncements not yet adopted.”",
  "item2": null
}