{
  "source_file": "unh-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM  1.    BUSINESS \nOUR BUSINESSES\nOverview \nThe terms “we,” “our,” “us,” “its,” “UnitedHealth Group,” or the “Company” used in this report refer to UnitedHealth Group Incorporated and its subsidiaries.\nUnitedHealth Group Incorporated is a health care and well-being company with a mission to help people live healthier lives and help make the health system work better for everyone. Our two distinct, yet complementary businesses — Optum and UnitedHealthcare — are working to help build a modern, high-performing health system through improved access, affordability, outcomes and experiences for the individuals and organizations we are privileged to serve.\nThe ability to analyze complex data and apply deep health care expertise and insights allows us to serve patients, consumers, care providers, businesses, communities and governments with more innovative products and complete, end-to-end offerings for many of the biggest challenges facing health care today.\nOptum seeks to create a higher-performing, value-oriented and more connected approach to health care. Bringing together clinical expertise, technology and data to make care simpler, more effective and more affordable, we seek to advance whole-person health, creating a seamless consumer experience and supporting clinicians with insights to deliver personalized, evidence-based care. Optum serves the broad health care marketplace, including patients and consumers, payers, care providers, employers, governments and life sciences companies, through its Optum Health, Optum Insight and Optum Rx businesses. These businesses improve overall health system performance by optimizing health care quality and delivery, reducing costs and improving patient, consumer and provider experience, leveraging distinctive capabilities in data and analytics, pharmacy care services, health care operations, population health and health financial services.\nUnitedHealthcare offers a full range of health benefits, designed to simplify the health care experience and make it more affordable for consumers to access high-quality care. UnitedHealthcare Employer & Individual serves consumers and employers, ranging from sole proprietorships to large, multi-site and national employers and public sector employers. UnitedHealthcare Medicare & Retirement delivers health and well-being benefits to seniors and other Medicare eligible consumers. UnitedHealthcare Community & State serves consumers who are economically disadvantaged, the medically underserved and those without the benefit of employer sponsored health benefits coverage.\nWe have four reportable segments: \n•\nOptum Health; \n•\nOptum Insight;\n•\nOptum Rx; and\n•\nUnitedHealthcare, which includes UnitedHealthcare Employer & Individual, UnitedHealthcare Medicare & Retirement and UnitedHealthcare Community & State. \nOptum\nOptum is an information and technology-enabled health services business serving the broad health care marketplace, including:\n•\nThose who need care: patients who need the right care, information, resources, products and engagement to improve their health, achieve their health goals and receive an improved patient experience that is personalized, comprehensive and delivered in all care settings, including in-home and virtually.\n•\nThose who provide care: physicians, hospitals, pharmacies and others seeking to improve the health system and reduce the administrative burden, allowing for providers to focus time on patients leading to the best possible patient care and experiences while achieving better health outcomes at lower costs. Improved health outcomes are achieved by utilizing our clinical expertise, data and analytics to better understand, treat and prevent consumers’ health conditions and ensure they receive the best evidence-based care.\n•\nThose who pay for care: consumers; employers; health plans; and state, federal and municipal agencies devoted to ensuring the people they sponsor receive high-quality care, administered and delivered efficiently and effectively, all while driving health equity so that every individual, family and community has access to the care they need.\n•\nThose who innovate for care: global life sciences organizations dedicated to developing more effective approaches to care, enabling technologies and medicines to improve care delivery and health outcomes.\n1\nTable of Contents\nOptum operates three business segments which combine distinctive capabilities in value-based care, population health, health care operations, data and analytics and pharmacy care services:\n•\nOptum Health delivers patient-centered care, care management, wellness and consumer engagement, and health financial services;\n•\nOptum Insight offers data, analytics, research, consulting, technology and managed services solutions; and \n•\nOptum Rx provides diversified pharmacy care services. \nOptum Health\nOptum Health provides comprehensive and patient-centered care, addressing the physical, mental, social, and financial well-being of 100 million consumers and serves more than 100 health payer partners. We engage people in the most appropriate care settings, including clinical sites, in-home and virtual. Optum Health delivers primary, specialty and surgical care; helps patients and providers navigate and address complex, chronic and behavioral health needs; offers post-acute care planning services; and serves consumers and care providers through advanced, on-demand digital health technologies, such as telehealth and remote patient monitoring, and innovative health care financial services. Optum Health works directly with patients, consumers, care delivery systems, providers, employers, payers, and public-sector entities to provide high quality, accessible and equitable care with improved health outcomes and reduced total cost of care. Optum Health enables care providers to transition from traditional fee-for-service payment models to performance-based delivery and payment models designed to improve patient health outcomes and experience through value-based care.\nOptum Health offerings include fully accountable value-based arrangements, where Optum Health assumes responsibility for health care costs in exchange for a monthly premium. Offerings also include administrative fee arrangements, where Optum Health manages or administers products and services in exchange for a monthly fee, and fee-for-service arrangements, where Optum Health delivers health-related products and medical services for patients at a contracted fee.\nOptum Financial, including Optum Bank, serves consumers through more than 27 million consumer accounts with $24 billion in assets under management as of December 31, 2024. Organizations across the health system rely on Optum Financial to manage and improve payment flows through its highly automated, scalable, end-to-end digital payment and financing systems and integrated card solutions. For financial services offerings, Optum Financial charges fees and earns investment income on managed funds.\nOptum Health sells its products primarily through its direct sales force, strategic collaborations and external producers in three key areas: employers, including large, mid-sized and small employers; payers including health plans, third-party administrators (TPAs), underwriter/stop-loss carriers and individual product intermediaries; and public entities, including the U.S. Departments of Health and Human Services (HHS), Veterans Affairs, Defense, and other federal, state and local health care agencies.\nOptum Insight\nOptum Insight connects the health care system with services, analytics and platforms that make clinical, administrative and financial processes simpler and more efficient for all participants in the health care system. Hospital systems, physicians, health plans, public entities, life sciences companies and other organizations comprising the health care industry depend on Optum Insight to help them improve performance and reduce costs through administrative efficiency and payment simplification, advance care quality through evidence-based standards built directly into clinical workflows, meet compliance mandates and modernize their core operating systems to meet the changing needs of the health system.\nHealth Systems. \nServes hospitals, physicians and other care providers to improve operating performance, better coordinate care and reduce administrative costs through technology and services to improve population health management, patient engagement, revenue cycle management and strategic growth plans. \nHealth Plans. \nServes health plans\n \nby improving financial performance and enhancing outcomes through proactive analytics, a comprehensive payment integrity portfolio and technology-enabled and staff-supported risk and quality services. Optum Insight helps health plans navigate a dynamic environment defined by shifts in employer vs. public-sector coverage, the demand for affordable benefit plans and the need to leverage new technology to reduce complexity. \nState Governments. \nProvides advanced technology and analytics services to modernize the administration of critical safety net programs, such as Medicaid, while improving cost predictability. \nLife Sciences Companies. \nCombines data and analytics expertise with comprehensive technologies and health care knowledge to help life sciences companies, including those in pharmaceuticals and medical technology, adopt a more comprehensive approach to advancing therapeutic discoveries and improving clinical outcomes. \n2\nTable of Contents\nMany of Optum Insight’s software and information products and professional services are delivered over extended periods, often several years. Optum Insight maintains an order backlog to track unearned revenues under these long-term arrangements. The backlog consists of estimated revenue from signed contracts, other legally binding agreements and anticipated contract renewals based on historical experience with Optum Insight’s customers. Optum Insight’s aggregate backlog as of December 31, 2024 was approximately $32.8 billion, of which $19.8 billion is expected to be realized within the next 12 months. The aggregate backlog includes $12.5 billion related to affiliated agreements. Optum Insight’s aggregate backlog as of December 31, 2023, was $32.1 billion, including $11.9 billion related to affiliated agreements.\nOptum Insight’s products and services are sold primarily through a direct sales force. Optum Insight’s products are also supported and distributed through an array of alliances and business partnerships with other technology vendors, who integrate and interface Optum Insight’s products with their applications.\nOptum Rx\nOptum Rx provides a full spectrum of pharmacy care services through its network of more than 65,000 retail pharmacies, through home delivery, specialty and community health pharmacies, the provision of in-home and community-based infusion services and through rare disease and gene therapy support services. It also offers direct-to-consumer solutions.\nOptum Rx manages a broad range of prescription drug spend, including widely available retail drugs as well as limited and ultra-limited distribution drugs in oncology, HIV, pain management and ophthalmology. Optum Rx serves the growing pharmacy needs of people with behavioral health and substance use disorders. In 2024, Optum Rx managed $178 billion in pharmaceutical spending, including $74 billion in specialty pharmaceutical spending.\nOptum Rx serves health benefits providers, large national employer plans, unions and trusts, purchasing coalitions and public-sector entities. Optum Rx sells its services through direct sales, health insurance brokers and other health care consultants. \nOptum Rx offers multiple clinical programs, digital tools and services to help clients manage overall pharmacy and health care costs in a clinically appropriate manner which are designed to deliver improved consumer experiences, better health outcomes and a lower total cost of care. Optum Rx provides various utilization management, medication management, quality assurance, adherence and counseling programs to complement each client’s plan design and clinical strategies. Optum Rx is accelerating the integration of medical, pharmacy and behavioral care and treating the whole patient by embedding our pharmacists as key members of the patient care team.\nUnitedHealthcare\nThrough its health benefits offerings, UnitedHealthcare is enabling better health, creating a better health care experience for its customers and helping to control rising health care costs. UnitedHealthcare’s market position is built on:\n•\nstrong local-market relationships;\n•\nthe breadth of product offerings, based upon extensive expertise in distinct market segments in health care;\n•\nservice and advanced technology, including digital consumer engagement; \n•\ncompetitive medical and operating cost positions;\n•\neffective clinical engagement; and\n•\ninnovation for customers and consumers.\nUnitedHealthcare arranges for discounted access to care through its extensive networks and uses Optum’s capabilities to help coordinate and provide patient care, improve affordability of medical care, analyze cost trends, manage pharmacy care services, work with care providers more effectively and create a simpler and more satisfying consumer and physician experience.\nUnitedHealthcare is subject to extensive government regulation. See further discussion of our regulatory environment below under \n“Government Regulation”\n and in \nPart II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\nUnitedHealthcare Employer & Individual\nDomestically, UnitedHealthcare Employer & Individual offers a comprehensive array of consumer-oriented health benefit plans and services for large national employers, public sector employers, mid-sized employers, small businesses, and individuals. As of December 31, 2024, UnitedHealthcare Employer & Individual provides access to medical services for 29.7 million people. \nThrough its risk-based product offerings, UnitedHealthcare Employer & Individual assumes the risk of both medical and administrative costs for its customers in return for a monthly premium which is typically a fixed rate per individual served for a one-year period. Through its administrative and other management services arrangements to customers who elect to self-fund the health care costs of their employees and employees’ dependents, UnitedHealthcare Employer & Individual receives a fixed \n3\nTable of Contents\nmonthly service fee per individual served. These customers retain the risk of financing medical benefits for their employees and employees’ dependents, while UnitedHealthcare Employer & Individual provides services such as coordination and facilitation of medical and related services to customers, consumers and health care professionals, administration of transaction processing and access to a contracted network of physicians, hospitals and other health care professionals, including dental and vision professionals. UnitedHealthcare Employer & Individual is focused on providing informed benefit solutions that create customized plan designs and clinical programs for employers that contribute to well-being and reduce the total cost of care along with providing simpler consumer experiences in response to market dynamics. \nUnitedHealthcare Employer & Individual typically distributes its products through a variety of channels, dependent upon the specific product, including: through consultants or direct sales, in collaboration with brokers and agents, through wholesale agents or agencies who contract with health insurance carriers to distribute individual or group benefits, through professional employer organizations and associations and through both multi-carrier and its own proprietary private exchange marketplaces. \nUnitedHealthcare Employer & Individual’s major product families include consumer engagement products, such as high-deductible consumer driven benefit plans and a variety of innovative consumer centric products; traditional products; clinical and pharmacy products; and specialty benefits, such as vision, dental, accident protection, critical illness, disability and hospital indemnity offerings.\nUnitedHealthcare Medicare & Retirement\nUnitedHealthcare Medicare & Retirement provides health and well-being services to seniors and other Medicare eligible consumers, addressing their unique needs. UnitedHealthcare Medicare & Retirement has distinct benefit designs, pricing, underwriting, clinical program management and marketing capabilities dedicated to health products and services in this market.\nUnitedHealthcare Medicare & Retirement offers a selection of products allowing people choice in obtaining the health coverage and services they need as their circumstances change. These offerings include care management and health system navigator services, clinical management programs, nurse health line services, 24-hour access to health care information, access to discounted health services from a network of care providers and administrative services. \nUnitedHealthcare Medicare & Retirement has extensive distribution capabilities and experience, including direct marketing to consumers on behalf of its key clients, a membership organization, and state and U.S. government agencies. Products are also offered through agents, employer groups and digital channels.\nMajor product categories include:\nMedicare Advantage.\n \nProvides health care coverage for seniors and other eligible Medicare beneficiaries through the Medicare Advantage program administered by the Centers for Medicare & Medicaid Services (CMS), including Medicare Advantage HMO plans, Preferred Provider Organization (PPO) plans, Point-of-Service plans, Private-Fee-for-Service plans and Special Needs Plans (SNPs). Under the Medicare Advantage program, UnitedHealthcare Medicare & Retirement provides health benefits coverage in exchange for a fixed monthly premium per member from CMS plus, in some cases, monthly consumer premiums. Premium amounts received from CMS vary based on the geographic areas in which individuals reside; demographic factors such as age, gender and institutionalized status; and the health status of the individual. UnitedHealthcare Medicare & Retirement served 7.8 million people through its Medicare Advantage products as of December 31, 2024.\nWe have continued to enhance our offerings, focusing on more digital and physical care resources in the home, expanding our concierge navigation services and enabling the home as a safe and effective setting for care. For example, through our HouseCalls program, nurse practitioners performed 2.9 million clinical preventive home care visits in 2024 to address unmet care opportunities and close gaps in care.\nMedicare Part D.\n Provides Medicare Part D benefits to beneficiaries through its Medicare Advantage and stand-alone Medicare Part D plans. The stand-alone Medicare Part D plans address a large spectrum of people’s needs and preferences for their prescription drug coverage, including low-cost prescription options. As of December 31, 2024, UnitedHealthcare enrolled 10.1 million people in the Medicare Part D programs, including 3.1 million individuals in stand-alone Medicare Part D plans, with the remainder in Medicare Advantage plans incorporating Medicare Part D coverage. \nMedicare Supplement.\n \nProvides a full range of supplemental products at diverse price points. These products cover various levels of coinsurance and deductible gaps to which seniors are exposed in the traditional Medicare program. UnitedHealthcare Medicare & Retirement served 4.3 million seniors nationwide through various Medicare Supplement products as of December 31, 2024. \nPremium revenues from CMS represented 40% of UnitedHealth Group’s total consolidated revenues for the year ended December 31, 2024, most of which were generated by UnitedHealthcare Medicare & Retirement. \n4\nTable of Contents\nUnitedHealthcare Community & State\nUnitedHealthcare Community & State is dedicated to serving state programs caring for the economically disadvantaged, the medically underserved and those without the benefit of employer-funded health care coverage, typically in exchange for a monthly premium per member from the state program. UnitedHealthcare Community & State’s primary customers oversee Medicaid plans, including Temporary Assistance to Needy Families; Children’s Health Insurance Programs (CHIP); Dual SNPs (DSNPs); Long-Term Services and Supports (LTSS); Aged, Blind and Disabled; and other federal, state and community health care programs. As of December 31, 2024, UnitedHealthcare Community & State participated in programs in 33 states and the District of Columbia, and served more than 7.4 million people; including 1.2 million people through Medicaid expansion programs in 20 states under the Patient Protection and Affordable Care Act (ACA).\nStates using managed care services for Medicaid beneficiaries select health plans by using a formal bid process or by awarding individual contracts. These health plans and care programs are designed to address the complex needs of the populations they serve, including the chronically ill, people with disabilities and people with a higher risk of medical, behavioral and social conditions. UnitedHealthcare Community & State administers benefits for the unique needs of children, pregnant women, adults, seniors and those who are institutionalized or are nursing home eligible. These individuals often live in medically underserved areas and are less likely to have a consistent relationship with the medical community or a care provider. They also often face significant social and economic challenges.\nGOVERNMENT REGULATION \nOur businesses are subject to comprehensive U.S. federal and state and international laws and regulations. We are regulated by agencies which generally have discretion to issue regulations and interpret and enforce laws and rules. U.S. federal and state and international governments continue to consider and enact various legislative and regulatory proposals which could materially impact certain aspects of the health care system. New laws, regulations and rules, or changes in the interpretation of existing laws, regulations and rules, including as a result of changes in the political environment, could adversely affect our businesses. \nSee \nPart I, Item 1A, “Risk Factors”\n for a discussion of the risks related to our compliance with U.S. federal and state and international laws and regulations.\nU.S. Federal Laws and Regulation \nWhen we contract with the federal government, we are subject to federal laws and regulations relating to the award, administration and performance of U.S. government contracts. CMS regulates our UnitedHealthcare businesses and certain aspects of our Optum businesses. Payments by CMS to our businesses are subject to regulations, including those governing fee-for-service and the submission of information relating to the health status of enrollees for purposes of determining the amounts of certain payments to us. CMS also has the right to audit our performance to determine our compliance with CMS contracts and regulations and the quality of care we provide to Medicare beneficiaries. Our commercial business is further subject to CMS audits related to medical loss ratios (MLRs) and risk adjustment data.\nUnitedHealthcare Community & State has Medicaid and CHIP contracts, which are subject to federal regulations regarding services to be provided to Medicaid enrollees, payment for those services and other aspects of these programs. There are many regulations affecting Medicare and Medicaid compliance, and the regulatory environment with respect to these programs is complex. \nOur businesses are also subject to laws and regulations relating to consumer protection, anti-fraud and abuse, anti-kickbacks, false claims, prohibited referrals, inappropriate reduction or limitation of health care services, anti-money laundering and securities and antitrust compliance. \nPrivacy, Security and Data Standards Regulation.\n Certain of our operations are subject to regulation under the administrative simplification provisions of the Health Insurance Portability and Accountability Act of 1996, as amended (HIPAA), which apply to both the group and individual health insurance markets, including self-funded employee benefit plans. Federal regulations related to HIPAA contain minimum standards for electronic transactions and code sets and for the privacy and security of protected health information.\nOur businesses must comply with the Health Information Technology for Economic and Clinical Health Act (HITECH), which regulates matters relating to privacy, security and data standards. HITECH imposes requirements on uses and disclosures of health information; includes contracting requirements for HIPAA business associate agreements; extends parts of HIPAA privacy and security provisions to business associates; adds federal data breach notification requirements for covered entities and business associates and reporting requirements to HHS and the Federal Trade Commission (FTC) and, in some cases, to the local media; strengthens enforcement and imposes higher financial penalties for HIPAA violations and, in certain cases, imposes criminal penalties for individuals, including employees. In the conduct of our business, depending on the circumstances, we may act as either a covered entity or a business associate.\n5\nTable of Contents\nThe use and disclosure of individually identifiable health data by our businesses are also regulated in some instances by other federal laws, including the Gramm-Leach-Bliley Act (GLBA) or state statutes implementing GLBA. These federal laws and state statutes generally require insurers to provide customers with notice regarding how their non-public personal health and financial information is used and the opportunity to “opt out” of certain disclosures before the insurer shares such information with a third party, and generally prescribe safeguards for the protection of personal information. Neither the GLBA nor HIPAA privacy regulations preempt more stringent state laws and regulations, which may apply to us, as discussed below. Federal consumer protection laws may also apply in some instances to privacy and security practices related to personally identifiable information.\nERISA. \nThe Employee Retirement Income Security Act of 1974, as amended (ERISA), regulates how our services are provided to or through certain types of employer-sponsored health benefit plans. ERISA is a set of laws and regulations subject to interpretation by the U.S. Department of Labor (DOL) as well as the federal courts. ERISA sets forth standards on how our business units may do business with employers who sponsor employee health benefit plans, particularly those who maintain self-funded plans. Regulations established by the DOL subject us to additional requirements for administration of benefits, claims payment and member appeals under health care plans governed by ERISA. \nState Laws and Regulation \nHealth Care Regulation.\n \nOur insurance and HMO subsidiaries must be licensed by the jurisdictions in which they conduct business. All of the states in which our subsidiaries offer insurance and HMO products regulate those products and operations. The states require periodic financial reports and establish minimum capital or restricted cash reserve requirements. The National Association of Insurance Commissioners (NAIC) has adopted model regulations, which require expanded governance practices and risk and solvency assessment reporting. Most states have adopted these or similar measures to expand the scope of regulations relating to corporate governance and internal control activities of HMOs and insurance companies. We are required to maintain a risk management framework and file a confidential self-assessment report with state insurance regulators. We file reports annually with Connecticut, our lead regulator, and with New York, as required by the state’s regulation.\nOur health plans and insurance companies are regulated under state insurance holding company regulations. Such regulations generally require registration with applicable state departments of insurance and the filing of reports describing capital structure, ownership, financial condition, certain affiliated transactions and general business operations. Most state insurance holding company laws and regulations require prior regulatory approval of acquisitions and material affiliated transfers of assets, as well as transactions between the regulated companies and their parent holding companies or affiliates. These laws may restrict the ability of our regulated subsidiaries to pay dividends to our holding companies. \nSome of our business activity is subject to other health care-related regulations and requirements, including PPO, Managed Care Organization (MCO), utilization review (UR), TPA, pharmacy care services, durable medical equipment or care provider-related regulations and licensure requirements. These regulations differ from state to state and may contain network, contracting, product and rate, licensing and financial and reporting requirements. Health care-related laws and regulations set specific standards for delivery of services, appeals, grievances and payment of claims, adequacy of health care professional networks, fraud prevention, protection of consumer health information, pricing and underwriting practices and covered benefits and services. State health care anti-fraud and abuse prohibitions encompass a wide range of activities, including kickbacks for referral of members, billing for unnecessary medical services and improper marketing. Certain of our businesses are subject to state general agent, broker and sales distribution laws and regulations. UnitedHealthcare Community & State and certain of our Optum businesses are subject to regulation by state Medicaid agencies which oversee the provision of benefits to our Medicaid and CHIP beneficiaries and to our beneficiaries dually eligible for Medicare and Medicaid. We also contract with state governmental entities and are subject to state laws and regulations relating to the award, administration and performance of state government contracts. \nState Privacy and Security Regulations. \nA number of states have adopted laws and regulations which may affect our privacy and security practices, such as state laws governing the use, disclosure and protection of social security numbers and protected health information or which are designed to implement GLBA or protect credit card account data. State and local authorities increasingly focus on the importance of protecting individuals from identity theft, with a significant number of states enacting laws requiring businesses to meet minimum cyber-security standards and notify individuals of security breaches involving personal information. State consumer protection laws may also apply to privacy and security practices related to personally identifiable information, including information related to consumers and care providers. Different approaches to state privacy and insurance regulation and varying enforcement philosophies may materially and adversely affect our ability to standardize our products and services across state lines. See \nPart I, Item 1A, “Risk Factors”\n for a discussion of the risks related to compliance with state privacy and security regulations. \n6\nTable of Contents\nCorporate Practice of Medicine and Fee-Splitting Laws. \nCertain of our businesses function as direct medical service providers and, as such, are subject to additional laws and regulations. Some states have corporate practice of medicine laws prohibiting specific types of entities from practicing medicine or employing physicians to practice medicine. Moreover, some states prohibit certain entities from engaging in fee-splitting practices, which involve sharing in the fees or revenues of a professional practice. These prohibitions may be statutory or regulatory, or may be imposed through judicial or regulatory interpretation. The laws, regulations and interpretations in certain states have been subject to limited judicial and regulatory interpretation and are subject to change.\nPharmacy and Pharmacy Benefits Management (PBM) Regulations \nOptum Rx’s businesses include home delivery, specialty and compounding pharmacies, as well as clinic-based pharmacies which must be licensed as pharmacies in the states in which they are located. Certain of our pharmacies must also register with the U.S. Drug Enforcement Administration (DEA) and individual state controlled substance authorities to dispense controlled substances. In addition to adhering to the laws and regulations in the states where our pharmacies are located, we also are required to comply with laws and regulations in some non-resident states where we deliver pharmaceuticals, including those requiring us to register with the board of pharmacy in the non-resident state. These non-resident states generally expect our  pharmacies to follow the laws of the state in which the pharmacies are located, but some non-resident states also require us to comply with their laws where pharmaceuticals are delivered. Additionally, certain of our pharmacies which participate in programs for Medicare and state Medicaid providers are required to comply with applicable Medicare and Medicaid provider rules and regulations. Other laws and regulations affecting our pharmacies include federal and state statutes and regulations governing the labeling, packaging, advertising and adulteration of prescription drugs and dispensing of controlled substances. See \nPart I, Item 1A, “Risk Factors”\n for a discussion of the risks related to our pharmacy care services businesses.\nFederal and state legislation regulating PBM activities affects both our ability to limit access to a pharmacy provider network or remove network providers. Additionally, many states limit our ability to manage and establish maximum allowable costs for generic prescription drugs. With respect to formulary services, a number of government entities, including CMS, HHS and state departments of insurance, regulate the administration of prescription drug benefits offered through federal or state exchanges. Many states also regulate the scope of prescription drug coverage, as well as the delivery channels to receive such prescriptions, for insurers, MCOs and Medicaid managed care plans. These regulations could limit or preclude (i) certain plan designs, (ii) limited networks, (iii) use of particular care providers or distribution channels, (iv) copayment differentials among providers and (v) formulary tiering practices.\nLegislation seeking to regulate PBM activities introduced or enacted at the federal or state level could impact our business practices with others in the pharmacy supply chain, including pharmaceutical manufacturers and network providers. In addition, organizations like the NAIC periodically issue model regulations while credentialing organizations, like the National Committee for Quality Assurance (NCQA) and the Utilization Review Accreditation Commission (URAC), may establish standards impacting PBM pharmacy activities. Although these model regulations and standards do not have the force of law, they may influence states to adopt their recommendations and impact the services we deliver to our clients. \nConsumer Protection Laws\nCertain of our businesses participate in direct-to-consumer activities and are subject to regulations applicable to online communications and other general consumer protection laws and regulations such as the Federal Tort Claims Act, the Federal Postal Service Act and the FTC’s Telemarketing Sales Rule. Most states also have similar consumer protection laws. \nCertain laws, such as the Telephone Consumer Protection Act, give the FTC, the Federal Communications Commission (FCC) and state attorneys general the ability to regulate, and bring enforcement actions relating to, telemarketing practices and certain automated outbound contacts such as phone calls, texts or emails. Under certain circumstances, these laws may provide consumers with a private right of action. Violations of these laws could result in substantial statutory penalties and other sanctions.\nBanking Regulation\nOptum Bank is subject to regulation by federal banking regulators, including the Federal Deposit Insurance Corporation (FDIC), which performs annual examinations to ensure the bank is operating in accordance with federal safety and soundness requirements, and the Consumer Financial Protection Bureau, which may perform periodic examinations to ensure the bank is in compliance with applicable consumer protection statutes, regulations and agency guidelines. Optum Bank is also subject to supervision and regulation by the Utah State Department of Financial Institutions, which carries out annual examinations to ensure the bank is operating in accordance with state safety and soundness requirements and performs periodic examinations of the bank’s compliance with applicable state banking statutes, regulations and agency guidelines. In the event of unfavorable examination results from any of these agencies, the bank could become subject to increased operational expenses and capital requirements, enhanced governmental oversight and monetary penalties.\n7\nTable of Contents\nNon-U.S.  Regulation\nCertain of our businesses operate internationally and are subject to regulation in the jurisdictions in which they are organized or conduct business. These regulatory regimes vary from jurisdiction to jurisdiction. In addition, our non-U.S. businesses and operations are subject to U.S. laws regulating the conduct and activities of U.S.-based businesses operating outside the United States, such as the Foreign Corrupt Practices Act (FCPA), which prohibits offering, promising, providing or authorizing others to give anything of value to a foreign government official to obtain or retain business or otherwise secure a business advantage. \nCOMPETITION\nAs a diversified health care company, we operate in highly competitive markets across the full expanse of health care benefits and services. Our competitors include organizations ranging from startups to highly sophisticated Fortune 50 global enterprises, for-profit and non-profit companies, and private and government-sponsored entities. New entrants to our markets and business combinations among our competitors and suppliers also contribute to a dynamic and competitive environment. We compete fundamentally on the quality and value we provide to those we serve which can include elements such as product and service innovation; use of technology; consumer and provider engagement and satisfaction; and sales, marketing and pricing. See \nPart I, Item 1A, “Risk Factors”\n for additional discussion of our risks related to competition. \n \nINTELLECTUAL PROPERTY RIGHTS\nWe have obtained trademark registration for the UnitedHealth Group, Optum and UnitedHealthcare names and logos. We own registrations for certain of our other trademarks in the United States and abroad. We hold a portfolio of patents and have patent applications pending from time to time. We are not substantially dependent on any single patent or group of related patents.\nUnless otherwise noted, trademarks appearing in this report are trademarks owned by us. We disclaim any proprietary interest in the marks and names of others.\nHUMAN CAPITAL RESOURCES\nOur nearly 400,000 employees, as of December 31, 2024, including more than 140,000 clinical professionals, are guided by our mission to help people live healthier lives and help make the health system work better for everyone. Our mission and cultural values of integrity, compassion, inclusion, relationships, innovation, performance and quality align with our long-term business strategy to increase access to care, make care more affordable, enhance the care experience, improve health outcomes and advance health equity. Our mission and values attract individuals who are determined to make a difference – individuals whose talent, innovation, engagement and empowerment are critical in our ability to achieve our mission. \nWe are committed to developing our people and culture by creating an inclusive environment where people of diverse talents, backgrounds, experiences and perspectives make us better. Our approach is data-driven and leader-led and uses enterprise and business scorecards to ensure our leaders are accountable for a consistent focus on hiring, developing, advancing and retaining diverse talent. We have embedded inclusion and diversity throughout our culture, including in our talent acquisition and talent management practices; leadership development; careers; learning and skills; and systems and processes. We strive to maintain a skilled, sustainable and diverse talent pipeline by building strong strategic partnerships and outreach through early career programs, internships and apprenticeships. We support career coaching, mentorship and accelerated leadership development programs to ensure mobility and advancement for our diverse talent. To foster an engaged workforce and an inclusive culture, we invest in a broad array of skills-based learning and culture development\n \nprograms. We rely on a shared leadership framework, which clearly and objectively defines our expectations, enables an environment where everyone has the opportunity to learn and grow, and helps us identify, develop and deploy talent to help achieve our mission.\nWe prioritize pay equity by objectively and regularly evaluating and reviewing our compensation practices by performance, age, experience, gender, ethnicity and race. Receiving on-going feedback from our team members is another way to strengthen and reinforce a culture of inclusion. Our Employee Experience Index measures an employee’s sense of commitment and belonging to our company and is a metric in the Stewardship section of our annual incentive plan. Our Sustainability Report, which can be accessed on our website at www.unitedhealthgroup.com, provides further information about our people and culture.\n8\nTable of Contents\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nThe following sets forth certain information regarding our executive officers as of February 27, 2025, including the business experience of each executive officer during the past five years:\nName\nAge\nPosition\nAndrew Witty\n60\nChief Executive Officer\nJohn Rex\n63\nPresident and Chief Financial Officer\nHeather Cianfrocco\n51\nChief Executive Officer, Optum\nErin McSweeney\n60\nExecutive Vice President and Chief People Officer\nTimothy Noel\n53\nChief Executive Officer, UnitedHealthcare\nThomas Roos\n52\nSenior Vice President and Chief Accounting Officer\nChristopher Zaetta\n53\nExecutive Vice President and Chief Legal Officer and Corporate Secretary\nOur Board of Directors elects executive officers annually. Our executive officers serve until their successors are duly elected and qualified, or until their earlier death, resignation, removal or disqualification.\nAndrew Witty\n has served as Chief Executive Officer and a member of the Board of Directors of UnitedHealth Group since February 2021. Previously, Andrew served as Chief Executive Officer of Optum from July 2018 to April 2021, President of UnitedHealth Group from November 2019 to February 2021 and as a UnitedHealth Group director from August 2017 to March 2018. Prior to joining UnitedHealth Group, he was Chief Executive Officer and a board member of GlaxoSmithKline, a global pharmaceutical company, from 2008 to 2017.\nJohn Rex\n has served as President and Chief Financial Officer of UnitedHealth Group since April 2024. Previously, John served as Chief Financial Officer of UnitedHealth Group since June 2016. From March 2012 to June 2016, he served as Executive Vice President and Chief Financial Officer of Optum. Prior to joining Optum in 2012, John was a Managing Director at JP Morgan, a global financial services firm.\nHeather Cianfrocco\n has served as Chief Executive Officer of Optum since April 2024. Previously, Heather served as Optum's President and held numerous leadership roles since joining UnitedHealth Group from 2008 until April 2024, including serving as Chief Executive Officer of Optum Rx, Chief Executive Officer for Optum's Health Services and Chief Executive Officer of UnitedHealthcare Community & State.\nErin McSweeney\n has served as Executive Vice President and Chief People Officer of UnitedHealth Group since March 2022. From February 2021 to March 2022, Erin served as chief of staff to UnitedHealth Group’s Office of the Chief Executive. From January 2017 to February 2021, she served as Executive Vice President and Chief Human Resources Officer at Optum. Prior to joining UnitedHealth Group, Erin was Executive Vice President and Chief Human Resources Officer for EMC Corporation, an international technology company.\nTim Noel\n has served as Chief Executive Officer of UnitedHealthcare since January 2025. Previously, Tim served as Chief Executive Officer of UnitedHealthcare’s Medicare & Retirement business and held numerous leadership roles since joining UnitedHealth Group from 2007 until January 2025, including serving as Chief Financial Officer and Senior Vice President of federal products for Medicare & Retirement.\nTom Roos\n has served as Senior Vice President and Chief Accounting Officer of UnitedHealth Group since August 2015. Prior to joining UnitedHealth Group, Tom was a Partner at Deloitte & Touche LLP, an independent registered public accounting firm.\nChris Zaetta \nhas served as Executive Vice President, Chief Legal Officer and Corporate Secretary of UnitedHealth Group since May 2024. Previously, Chris served as Chief Legal Officer of Optum from September 2020 until May 2024. Prior to joining Optum in 2020, Chris was Vice President at Johnson & Johnson, a pharmaceutical company. Chris also held several leadership roles at UnitedHealth Group from May 2011 to September 2019, including Head of Litigation and General Counsel of the organization’s government businesses.\nADDITIONAL INFORMATION\nOur executive offices are located at 1 Health Drive, Eden Prairie, Minnesota 55344 and 655 New York Avenue, Washington, DC 20001; our telephone number is (800) 328-5979. You can access our website at www.unitedhealthgroup.com to learn more about our company. We make periodic and current reports and amendments available, free of charge, on our website, as soon as reasonably practicable after we file or furnish these reports to the Securities and Exchange Commission (SEC). Information on or linked to our website is neither part of nor incorporated by reference into this Annual Report on Form 10-K or any other SEC filings.\n9\nTable of Contents",
  "item7": "ITEM 7. \n    \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read together with the accompanying \nConsolidated Financial Statements and Notes to the Consolidated Financial Statements thereto included in Part II Item 8, “Financial Statements and Supplementary Data\n.” Readers are cautioned the statements, estimates, projections or outlook contained in this report, including discussions regarding financial prospects, economic conditions, trends and uncertainties contained in this Item 7, may constitute forward-looking statements within the meaning of the PSLRA. These forward-looking statements involve risks and uncertainties which may cause our actual results to differ materially from the expectations expressed or implied in the forward-looking statements. A description of some of the risks and uncertainties can be found further below in this Item 7 and in \nPart I, Item 1A, “Risk Factors.”\n \nDiscussions of year-over-year comparisons between 2023 and 2022 are not included in this Form 10-K and can be found in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” of the Company’s Form 10-K for the fiscal year ended December 31, 2023.\nEXECUTIVE OVERVIEW \nGeneral\nUnitedHealth Group is a health care and well-being company with a mission to help people live healthier lives and help make the health system work better for everyone. Our two distinct, yet complementary businesses — Optum and UnitedHealthcare — are working to help build a modern, high-performing health system through improved access, affordability, outcomes and experiences for the individuals and organizations we are privileged to serve.\nWe have four reportable segments across our two businesses:\n•\nOptum Health;\n•\nOptum Insight;\n•\nOptum Rx; and\n•\nUnitedHealthcare, which includes UnitedHealthcare Employer & Individual, UnitedHealthcare Medicare & Retirement and UnitedHealthcare Community & State.\nFurther information on our business and reportable segments is presented in \nPart I, Item 1, “Business”\n and in\n Note 14 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\nChange Healthcare Cyberattack\nAs previously announced, on February 21, 2024, we identified that cybercrime threat actors had gained access to certain Change Healthcare information technology systems. Upon detection of this outside threat, we isolated the impacted systems to protect our partners and customers. \nWe have substantially mitigated the impact to consumers and care providers of the unprecedented cyberattack on the U.S. health system and restored or replaced the majority of the affected Change Healthcare services. To support care providers we provided interest-free loans of more than $9 billion through December 31, 2024. For the year ended December 31, 2024, we incurred $2.2 billion of direct response costs, including costs associated with providing interest-free loans; increased medical care expenditures, as we suspended some care management activities to help care providers with their workflow processes; network restoration; and notifications of impacted persons. Optum Insight also experienced estimated business disruption impacts of $867 million for the year ended December 31, 2024, reflecting lost revenue while maintaining full readiness of the affected Change Healthcare services. We expect to continue to incur direct response costs and experience business disruption impacts at a lesser extent in 2025 as we work to bring transaction volumes back to pre-event levels and win new business.\nWe have determined the estimated total number of individuals impacted by the Change Healthcare cyberattack is approximately 190 million. The vast majority of those people have already been provided individual or substitute notice. The final number will be confirmed and filed with the Office for Civil Rights. Change Healthcare is not aware of any misuse of individuals’ information as a result of this incident and has not seen electronic medical record databases appear in the data during the analysis. It is possible that future risks and uncertainties resulting from the Change Healthcare cyberattack, including risks related to impacted data, litigation, reputational harm, and regulatory actions could adversely affect our financial condition or results of operations.\n24\nTable of Contents\nBusiness Trends\nOur businesses participate in the United States and certain other international health markets. In the United States, health care spending has grown consistently for many years and comprises 18% of gross domestic product (GDP). We expect overall spending on health care to continue to grow in the future, due to inflation, medical technology and pharmaceutical advancement, regulatory requirements, demographic trends in the population and national interest in health and well-being. The rate of market growth may be affected by a variety of factors, including macroeconomic conditions, which could impact our results of operations, including our continued efforts to control health care costs.\nPricing Trends.\n To price our health care benefits, products and services, we start with our view of expected future costs, including medical care patterns, inflation and labor market dynamics. We frequently evaluate and adjust our approach in each of the local markets we serve, considering relevant factors, such as product positioning, price competitiveness and environmental, competitive, legislative and regulatory considerations, including minimum medical loss ratio (MLR) thresholds and similar revenue adjustments. We will continue seeking to balance growth and profitability across all these dimensions.\nThe commercial risk market remains highly competitive in the small group, large group and individual segments. We expect broad-based competition to continue as the industry adapts to individual and employer needs.\nMedicare Advantage funding continues to be pressured, as discussed below in \n“Regulatory Trends and Uncertainties”\n and we have observed increased care patterns as discussed below in “Medical Cost Trends.” Our 2025 benefit design approach contemplates these trends.\nIn Medicaid, we believe the payment rate environment creates the risk of continued downward pressure on Medicaid margin percentages. We continue to take a prudent, market-sustainable posture for both new business and maintenance of existing relationships. We continue to advocate for actuarially sound rates commensurate with our medical cost trends and we remain dedicated to partnering with those states that are committed to the long-term viability of their programs.\nMedical Cost Trends. \nOur medical cost trends primarily relate to changes in unit costs, care activity and prescription drug costs. As expected and contemplated in our benefits design, we have continued to observe increased care patterns, which may continue in future periods. We also observed an upshift in hospital coding intensity and an acceleration in the prescribing of certain high-cost medications in early response to the Inflation Reduction Act (IRA). We expect these additional factors to continue into future periods. We endeavor to mitigate those increases by engaging hospitals, physicians and consumers with information and helping them make clinically sound choices, with the objective of helping them achieve high-quality, affordable care.\nAs a result of the Change Healthcare cyberattack, we incurred medical costs related to the impact of the temporary suspension of some care management activities, impacting our UnitedHealthcare and Optum Health businesses, to help care providers with their workflow processes. Early in the second quarter we resumed these activities. For the year ended December 31, 2024, medical costs related to the temporary suspension of some care management activities were approximately $640 million.\nMedicaid Redeterminations. \nMedicaid redeterminations have impacted the number of people served through our Medicaid offerings, partially offset by an increase in consumers served through our commercial offerings as we endeavor to ensure that people and families have continued access to care. The Medicaid redetermination process has also caused a timing mismatch between the current health status of people served through Medicaid and state rate updates, which remained well short of current care activity. We expect this gap between people’s health status and rates will narrow in 2025.\nDelivery System and Payment Modernization.\n The health care market continues to change based on demographic shifts, new regulations, political forces and both payer and patient expectations. Health plans and care providers are being called upon to work together to close gaps in care and improve overall care quality and patient experience, improve the health of populations and reduce costs. We are working to accelerate this vision through the innovation and integration of our care delivery models including in-clinic, in-home, behavioral and virtual care, and by using our data and analytics to provide clinicians with the necessary information in order to provide the best possible care in the most cost efficient setting. We continue to see a greater number of people enrolled in fully accountable value-based plans rewarding high-quality, affordable care and fostering collaboration. \nThis trend is creating needs for health management services which can coordinate care around the primary care physician, including new primary care channels, and for investments in new clinical and administrative information and management systems, which we believe provide growth opportunities for our Optum business platform. A key focus of our future growth is to accelerate the transition from fee-for-service care delivery and payment models to fully accountable value-based care. This transition requires initial costs such as system enhancements, integrated care coordination technology, physician training and clinical engagement. Enhanced clinical engagement is a critical step to improving the experience and health outcomes of the people we serve and should result in lower costs to the overall health system over time.\n25\nTable of Contents\nRegulatory Trends and Uncertainties\nFollowing is a summary of management’s view of the trends and uncertainties related to regulatory matters. For additional information regarding regulatory trends and uncertainties, see \nPart I, Item 1 “Business - Government Regulation”\n and \nItem 1A, “Risk Factors.”\nMedicare Advantage Rates. \nMedicare Advantage rate notices over the years have at times resulted in industry base rates well below industry forward medical trend. For example, the Final Notice for 2024 and 2025 rates resulted in an industry base rate decrease, both of which are well short of what is an increasing industry forward medical cost trend. The Advance Notice for 2026 rates proposes an industry base rate increase also well short of forward medical cost trend, creating continued pressure in the Medicare Advantage program. Further, substantial revisions to the risk adjustment model, which serves to adjust rates to reflect a patient’s health status and care resource needs, will result in reduced funding and potentially benefits for people, especially those with some of the greatest health and social challenges.\nAs a result of ongoing Medicare funding pressures, there are adjustments we can make to partially offset these rate pressures and reductions for a particular period. For example, we can seek to intensify our medical and operating cost management, make changes to the size and composition of our care provider networks, adjust member benefits and implement or increase the member premiums supplementing the monthly payments we receive from the government. Additionally, we decide annually on a county-by-county basis where we will offer Medicare Advantage plans.\nSELECTED OPERATING PERFORMANCE ITEMS\nThe following summarizes select 2024 year-over-year operating comparisons to 2023 and other financial results.\n•\nConsolidated revenues grew 8%, UnitedHealthcare revenues grew 6% and Optum revenues grew 12%. \n•\nUnitedHealthcare served 2.1 million more people domestically, driven by growth in commercial offerings, partially offset by the impact of Medicaid redeterminations.\n•\nEarnings from operations of $32.3 billion compared to $32.4 billion last year.\n•\nDiluted earnings per common share was $15.51, impacted by the loss on sale of subsidiary and subsidiaries held for sale.\n•\nCash flows from operations were $24.2 billion.\n26\nTable of Contents\nRESULTS SUMMARY\nThe following table summarizes our consolidated results of operations and other financial information:\n(in millions, except percentages and per share data)\nFor the Years Ended December 31,\nChange\n2024\n2023\n2022\n2024 vs. 2023\nRevenues:\nPremiums\n$\n308,810 \n$\n290,827 \n$\n257,157 \n$\n17,983 \n6 \n%\nProducts\n50,226 \n42,583 \n37,424 \n7,643 \n18 \nServices\n36,040 \n34,123 \n27,551 \n1,917 \n6 \nInvestment and other income\n5,202 \n4,089 \n2,030 \n1,113 \n27 \nTotal revenues\n400,278 \n371,622 \n324,162 \n28,656 \n8 \nOperating costs:\nMedical costs\n264,185 \n241,894 \n210,842 \n22,291 \n9 \nOperating costs\n53,013 \n54,628 \n47,782 \n(1,615)\n(3)\nCost of products sold\n46,694 \n38,770 \n33,703 \n7,924 \n20 \nDepreciation and amortization\n4,099 \n3,972 \n3,400 \n127 \n3 \nTotal operating costs\n367,991 \n339,264 \n295,727 \n28,727 \n8 \nEarnings from operations\n32,287 \n32,358 \n28,435 \n(71)\n— \nInterest expense\n(3,906)\n(3,246)\n(2,092)\n(660)\n20 \nLoss on sale of subsidiary and subsidiaries held for sale\n(8,310)\n— \n— \n(8,310)\nnm\nEarnings before income taxes\n20,071 \n29,112 \n26,343 \n(9,041)\n(31)\nProvision for income taxes\n(4,829)\n(5,968)\n(5,704)\n1,139 \n(19)\nNet earnings\n15,242 \n23,144 \n20,639 \n(7,902)\n(34)\nEarnings attributable to noncontrolling interests\n(837)\n(763)\n(519)\n(74)\n10 \nNet earnings attributable to UnitedHealth Group common shareholders\n$\n14,405 \n$\n22,381 \n$\n20,120 \n$\n(7,976)\n(36)\n%\nDiluted earnings per share attributable to UnitedHealth Group common shareholders\n$\n15.51 \n$\n23.86 \n$\n21.18 \n$\n(8.35)\n(35)\n%\nMedical care ratio (a)\n85.5 \n%\n83.2 \n%\n82.0 \n%\n2.3 \n%\nOperating cost ratio\n13.2 \n14.7 \n14.7 \n(1.5)\nOperating margin\n8.1 \n8.7 \n8.8 \n(0.6)\nTax rate\n24.1 \n20.5 \n21.7 \n3.6 \nNet earnings margin (b)\n3.6 \n6.0 \n6.2 \n(2.4)\nReturn on equity (c)\n15.9 \n%\n27.0 \n%\n27.2 \n%\n(11.1)\n%\n________ \nnm = not meaningful\n(a)\nMedical care ratio (MCR) is calculated as medical costs divided by premium revenue.\n(b)\nNet earnings margin attributable to UnitedHealth Group common shareholders.\n(c)\nReturn on equity is calculated as net earnings attributable to UnitedHealth Group common shareholders divided by average shareholders’ equity. Average shareholders’ equity is calculated using the shareholders’ equity balance at the end of the preceding year and the shareholders’ equity balances at the end of each of the four quarters of the year presented.\n2024 RESULTS OF OPERATIONS COMPARED TO 2023 RESULTS\nConsolidated Financial Results\nRevenues\nThe increases in revenues were primarily driven by growth in Optum Rx, UnitedHealthcare’s domestic offerings and Optum Health, partially offset by the sale of UnitedHealthcare’s Brazil operations.\nMedical Costs and MCR\nMedical costs increased primarily due to growth in people served through Medicare Advantage and domestic commercial offerings and member mix. The MCR increased as a result of the revenue effects of the Medicare funding reductions, Medicaid timing mismatch between people’s health status and rates, upshift in hospital coding intensity, specialty pharmaceutical prescribing patterns, member mix and due to incremental medical costs for accommodations made to care providers as a result of the Change Healthcare cyberattack.\n27\nTable of Contents\nOperating Cost Ratio\nThe operating cost ratio decreased primarily due to operating cost management and gains related to business portfolio refinement, including strategic transactions, partially offset by the impact of our direct response efforts to the Change Healthcare cyberattack and investments to support future growth.\nLoss on Sale of Subsidiary and Subsidiaries Held for Sale\nOn February 6, 2024, the Company completed the sale of its Brazil operations. During the year ended December 31, 2024, we recorded a loss of $7.1 billion, of which $4.1 billion related to the impact of cumulative foreign currency translation losses previously included in accumulated other comprehensive loss. \nIn the second quarter of 2024, the Company initiated a plan to sell its remaining South American operations, which were classified as held for sale as of December 31, 2024. During the year ended December 31, 2024, we recorded a loss of $1.2 billion, of which $855 million related to the impact of cumulative foreign currency translation losses. \nReportable Segments\nSee \nNote 14 of Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data”\n for more information on our segments. We utilize various metrics to evaluate and manage our reportable segments, including individuals served by UnitedHealthcare by major market segment and funding arrangement, people served by Optum Health and adjusted scripts for Optum Rx. These metrics are the main drivers of revenue, earnings and cash flows at each business. The metrics also allow management and investors to evaluate and understand business mix, including the level and scope of services provided to people and pricing trends when comparing the metrics to revenue by segment.\nThe following table presents a summary of the reportable segment financial information:\n \nFor the Years Ended December 31,\nChange\n(in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\nRevenues\nUnitedHealthcare\n$\n298,208 \n$\n281,360 \n$\n249,741 \n$\n16,848 \n6 \n%\nOptum Health\n105,358 \n95,319 \n71,174 \n10,039 \n11 \nOptum Insight\n18,757 \n18,932 \n14,581 \n(175)\n(1)\nOptum Rx\n133,231 \n116,087 \n99,773 \n17,144 \n15 \nOptum eliminations\n(4,389)\n(3,703)\n(2,760)\n(686)\n19 \nOptum\n252,957 \n226,635 \n182,768 \n26,322 \n12 \nEliminations\n(150,887)\n(136,373)\n(108,347)\n(14,514)\n11 \nConsolidated revenues\n$\n400,278 \n$\n371,622 \n$\n324,162 \n$\n28,656 \n8 \n%\nEarnings from operations\nUnitedHealthcare\n$\n15,584 \n$\n16,415 \n$\n14,379 \n$\n(831)\n(5)\n%\nOptum Health\n7,770 \n6,560 \n6,032 \n1,210 \n18 \nOptum Insight\n3,097 \n4,268 \n3,588 \n(1,171)\n(27)\nOptum Rx\n5,836 \n5,115 \n4,436 \n721 \n14 \nOptum\n16,703 \n15,943 \n14,056 \n760 \n5 \nConsolidated earnings from operations\n$\n32,287 \n$\n32,358 \n$\n28,435 \n$\n(71)\n— \n%\nOperating margin\nUnitedHealthcare\n5.2 \n%\n5.8 \n%\n5.8 \n%\n(0.6)\n%\nOptum Health\n7.4 \n6.9 \n8.5 \n0.5 \nOptum Insight\n16.5 \n22.5 \n24.6 \n(6.0)\nOptum Rx\n4.4 \n4.4 \n4.4 \n— \nOptum\n6.6 \n7.0 \n7.7 \n(0.4)\nConsolidated operating margin\n8.1 \n%\n8.7 \n%\n8.8 \n%\n(0.6)\n%\n28\nTable of Contents\nUnitedHealthcare\nThe following table summarizes UnitedHealthcare revenues by business:\n \nFor the Years Ended December 31,\nChange\n(in millions, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\nUnitedHealthcare Employer & Individual - Domestic\n$\n74,489 \n$\n67,187 \n$\n63,599 \n$\n7,302 \n11 \n%\nUnitedHealthcare Employer & Individual - Global\n3,667 \n9,307 \n8,668 \n(5,640)\n(61)\nUnitedHealthcare Employer & Individual - Total\n78,156 \n76,494 \n72,267 \n1,662 \n2 \nUnitedHealthcare Medicare & Retirement\n139,482 \n129,862 \n113,671 \n9,620 \n7 \nUnitedHealthcare Community & State\n80,570 \n75,004 \n63,803 \n5,566 \n7 \nTotal UnitedHealthcare revenues\n$\n298,208 \n$\n281,360 \n$\n249,741 \n$\n16,848 \n6 \n%\nThe following table summarizes the number of individuals served by our UnitedHealthcare businesses, by major market segment and funding arrangement:\n \nDecember 31,\nChange\n(in thousands, except percentages)\n2024\n2023\n2022\n2024 vs. 2023\nCommercial - domestic:\nRisk-based\n8,845 \n8,115 \n8,045 \n730 \n9 \n%\nFee-based\n20,885 \n19,200 \n18,640 \n1,685 \n9 \nTotal commercial - domestic\n29,730 \n27,315 \n26,685 \n2,415 \n9 \nMedicare Advantage\n7,845 \n7,695 \n7,105 \n150 \n2 \nMedicaid\n7,435 \n7,845 \n8,170 \n(410)\n(5)\nMedicare Supplement (Standardized)\n4,335 \n4,355 \n4,375 \n(20)\n— \nTotal community and senior\n19,615 \n19,895 \n19,650 \n(280)\n(1)\nTotal UnitedHealthcare - domestic medical\n49,345 \n47,210 \n46,335 \n2,135 \n5 \nCommercial - global\n1,330 \n5,540 \n5,360 \n(4,210)\n(76)\nTotal UnitedHealthcare - medical\n50,675 \n52,750 \n51,695 \n(2,075)\n(4)\n%\nSupplemental Data:\nMedicare Part D stand-alone\n3,050 \n3,315 \n3,295 \n(265)\n(8)\n%\nUnitedHealthcare’s revenues increased due to growth in the number of people served through Medicare Advantage and domestic commercial offerings, partially offset by decreased people served globally due to the sale of the Brazil operations and in Medicaid offerings due to redeterminations. Earnings from operations decreased due to Medicare Advantage funding reductions, the impacts of Medicaid redeterminations, member mix and incremental medical costs for accommodations to support care providers as a result of the Change Healthcare cyberattack, partially offset by gains related to business portfolio refinement, including strategic transactions, and the growth in the number of people served through Medicare Advantage and domestic commercial offerings.\nOptum\nTotal revenues increased due to growth at Optum Rx and Optum Health. Earnings from operations increased with growth at Optum Health and Optum Rx, partially offset by decreased earnings from operations at Optum Insight. The results by segment were as follows:\nOptum Health\nRevenues at Optum Health increased primarily due to organic growth in patients served under value-based care arrangements. Earnings from operations increased due to gains related to business portfolio refinement, including strategic transactions, increased investment income and cost management initiatives, partially offset by Medicare Advantage funding reductions, costs associated with serving newly added patients under value-based care arrangements and medical care activity. Optum Health served approximately 100 million people as of December 31, 2024 compared to 103 million people as of December 31, 2023. \n29\nTable of Contents\nOptum Insight\nRevenues at Optum Insight decreased primarily due the business disruption impacts from the Change Healthcare cyberattack, partially offset by growth in technology services. Earnings from operations decreased primarily due to direct response costs and business disruption impacts related to the Change Healthcare cyberattack, partially offset by gains related to business portfolio refinement, including strategic transactions.\nOptum Rx\nRevenues and earnings from operations at Optum Rx increased due to higher script volumes from both new clients and growth in existing clients and growth in pharmacy services. Earnings from operations also increased due to operating cost efficiencies and supply chain initiatives. Optum Rx fulfilled 1,623 million and 1,542 million adjusted scripts in 2024 and 2023, respectively.\nLIQUIDITY, FINANCIAL CONDITION AND CAPITAL RESOURCES\nLiquidity\nIntroduction\nWe manage our liquidity and financial position in the context of our overall business strategy. We continually forecast and manage our cash, investments, working capital balances and capital structure to meet the short-term and long-term obligations of our businesses while seeking to maintain liquidity and financial flexibility. Cash flows generated from operating activities are principally derived from earnings before noncash expenses. \nOur regulated subsidiaries generate significant cash flows from operations and are subject to, among other things, minimum levels of statutory capital, as defined by their respective jurisdictions, and restrictions on the timing and amount of dividends paid to their parent companies.\nOur U.S. regulated subsidiaries paid their parent companies dividends of $9.2 billion and $8.0 billion in 2024 and 2023, respectively. \nSee Note 10 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data”\n for further detail concerning our regulated subsidiary dividends.\nOur nonregulated businesses also generate significant cash flows from operations available for general corporate use. Cash flows generated by these entities, combined with dividends from our regulated entities and financing through the issuance of long-term debt as well as issuance of commercial paper or the ability to draw under our committed credit facilities, further strengthen our operating and financial flexibility. We use these cash flows to expand our businesses through acquisitions, reinvest in our businesses through capital expenditures, repay debt and return capital to our shareholders through dividends and repurchases of our common stock.\n30\nTable of Contents\nSummary of our Major Sources and Uses of Cash and Cash Equivalents\n \nFor the Years Ended December 31,\nChange\n(in millions)\n2024\n2023\n2022\n2024 vs. 2023\nSources of cash:\nCash provided by operating activities\n$\n24,204 \n$\n29,068 \n$\n26,206 \n$\n(4,864)\nIssuances of long-term debt and short-term borrowings, net of repayments\n14,660 \n4,280 \n12,536 \n10,380 \nProceeds from common share issuances\n1,846 \n1,353 \n1,253 \n493 \nCustomer funds administered\n— \n— \n5,548 \n— \nCash received for dispositions\n2,041 \n685 \n3,414 \n1,356 \nSales and maturities of investments, net of purchases\n525 \n— \n— \n525 \nTotal sources of cash\n43,276 \n35,386 \n48,957 \n7,890 \nUses of cash:\nCash paid for acquisitions and other transactions, net of cash assumed\n(13,408)\n(10,136)\n(21,458)\n(3,272)\nCommon share repurchases\n(9,000)\n(8,000)\n(7,000)\n(1,000)\nCash dividends paid\n(7,533)\n(6,761)\n(5,991)\n(772)\nPurchases of property, equipment and capitalized software\n(3,499)\n(3,386)\n(2,802)\n(113)\nPurchases of investments, net of sales and maturities \n— \n(1,777)\n(6,837)\n1,777 \nPurchases of redeemable noncontrolling interests\n(280)\n(730)\n(176)\n450 \nLoans to care providers - cyberattack, net of repayments\n(4,519)\n— \n— \n(4,519)\nCustomer funds administered\n(1,560)\n(521)\n— \n(1,039)\nOther\n(3,312)\n(2,110)\n(2,737)\n(1,202)\nTotal uses of cash\n(43,111)\n(33,421)\n(47,001)\n(9,690)\nEffect of exchange rate changes on cash and cash equivalents\n(61)\n97 \n34 \n(158)\nNet increase in cash and cash equivalents, including cash within businesses held for sale \n$\n104 \n$\n2,062 \n$\n1,990 \n$\n(1,958)\nLess: cash within businesses held for sale\n(219)\n— \n— \n(219)\nNet (decrease) increase in cash and cash equivalents\n$\n(115)\n$\n2,062 \n$\n1,990 \n$\n(2,177)\n2024 Cash Flows Compared to 2023 Cash Flows\nDecreased cash flows provided by operating activities were primarily driven by CMS Medicare funding reductions, Change Healthcare cyberattack response actions, increased medical costs and changes in working capital accounts. Other significant changes in sources or uses of cash year-over-year included increased net issuances of short-term borrowings and long-term debt, net sales and maturities of investments and cash received from dispositions, offset by loans to care providers in response to the Change Healthcare cyberattack, increased cash paid for acquisitions and other transactions, decreased customer funds administered and increased share repurchases.\nFinancial Condition\nAs of December 31, 2024, our cash, cash equivalent, available-for-sale debt securities and equity securities balances of $77.1 billion included $25.3 billion of cash and cash equivalents (of which approximately $800 million was available for general corporate use), $46.9 billion of debt securities and $4.9 billion of equity securities. Given the significant portion of our portfolio held in cash equivalents, we do not anticipate fluctuations in the aggregate fair value of our financial assets to have a material impact on our liquidity or capital position. Other sources of liquidity, primarily from operating cash flows and our commercial paper program, which is fully supported by our bank credit facilities, reduce the need to sell investments during adverse market conditions. See \nNote 4 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data”\n for further detail concerning our fair value measurements.\nOur available-for-sale debt portfolio had a weighted-average duration of 4.2 years and a weighted-average credit rating of “Double A” as of December 31, 2024. When multiple credit ratings are available for an individual security, the average of the available ratings is used to determine the weighted-average credit rating.\n31\nTable of Contents\nCapital Resources and Uses of Liquidity\nCash Requirements. \nThe Company’s cash requirements within the next twelve months include medical costs payable, accounts payable and accrued liabilities, short-term borrowings and current maturities of long-term debt, other current liabilities, and purchase commitments and other obligations. We expect the cash required to meet these obligations to be primarily generated through cash flows from current operations; cash available for general corporate use; and the realization of current assets, such as accounts receivable. \nOur long-term cash requirements under our various contractual obligations and commitments include:\n•\nDebt obligations.\n See \nNote 8 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements \nand Supplementary Data\n”\n for further detail of our long-term debt and the timing of expected future payments. Interest coupon payments are typically paid semi-annually.\n•\nOperating leases.\n See \nNote 12 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements \nand Supplementary Data\n”\n for further detail of our obligations and the timing of expected future payments.\n•\nPurchase and other obligations.\n These include $11.5 billion, $2.4 billion of which is expected to be paid within the next twelve months, of fixed or minimum commitments under existing purchase obligations for goods and services, including agreements cancelable with the payment of an early termination penalty, and remaining capital commitments for venture capital funds, strategic transactions and other funding commitments. These amounts exclude agreements cancelable without penalty and liabilities to the extent recorded in our Consolidated Balance Sheets as of December 31, 2024.\n•\nOther liabilities.\n These include other long-term liabilities reflected in our Consolidated Balance Sheets as of December 31, 2024, including obligations associated with certain employee benefit programs, unrecognized tax benefits and various long-term liabilities, which have some inherent uncertainty in the timing of these payments.\n•\nRedeemable noncontrolling interests.\n \nSee \nNote 2 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements \nand Supplementary Data\n”\n for further detail. We do not have any material potential required redemptions in the next twelve months.\nWe expect the cash required to meet our long-term obligations to be primarily generated through future cash flows from operations. However, we also have the ability to generate cash to satisfy both our current and long-term requirements through the issuance of commercial paper, issuance of long-term debt, or drawing under our committed credit facilities or the ability to sell investments. We believe our capital resources are sufficient to meet future, short-term and long-term, liquidity needs.\nShort-Term Borrowings.\n Our revolving bank credit facilities provide liquidity support for our commercial paper borrowing program, which facilitates the private placement of senior unsecured debt through independent broker-dealers, and are available for general corporate purposes. For more information on our commercial paper and bank credit facilities, see \nNote 8 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\nAs of December 31, 2024, we were in compliance with the various covenants under our bank credit facilities.\nLong-Term Debt.\n Periodically, we access capital markets to issue long-term debt for general corporate purposes, such as to meet our working capital requirements, to refinance debt, to finance acquisitions or for share repurchases. For more information on our debt, see \nNote 8 of the Notes to the Consolidated Financial Statements included in Part II, Item 8 “Financial Statements and Supplementary Data.”\nCredit Ratings.\n Our credit ratings as of December 31, 2024 were as follows: \n \n \nMoody’s\nS&P Global\nFitch\nA.M. Best\n \nRatings\nOutlook\nRatings\nOutlook\nRatings\nOutlook\nRatings\nOutlook\nSenior unsecured debt\nA2\nStable\nA+\nStable\nA\nStable\nA\nStable\nCommercial paper\nP-1\nn/a\nA-1\nn/a\nF1\nn/a\nAMB-1+\nn/a\nThe availability of financing in the form of debt or equity is influenced by many factors, including our profitability, operating cash flows, debt levels, credit ratings, debt covenants and other contractual restrictions, regulatory requirements and economic and market conditions. A significant downgrade in our credit ratings or adverse conditions in the capital markets may increase the cost of borrowing for us or limit our access to capital.\n32\nTable of Contents\nShare Repurchase Program.\n In June 2024, our Board of Directors amended our share repurchase program to authorize the repurchase of up to 35 million shares of Common Stock, in addition to all remaining shares authorized to be repurchased under the Board’s 2018 renewal of the program. As of December 31, 2024, we had Board of Directors’ authorization to purchase up to 33 million shares of our common stock. The Board of Directors from time to time may further amend the share repurchase program in order to increase the authorized number of shares which may be repurchased under the program. For more information on our share repurchase program, see \nNote 10 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\nDividends. \nIn June 2024, our Board of Directors increased the Company’s quarterly cash dividend to shareholders to an annual rate of $8.40 compared to $7.52 per share. For more information on our dividend, see \nNote 10 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\nPending Acquisitions.\n As of December 31, 2024, we have entered into agreements to acquire companies in the health care sector, subject to regulatory approval and other customary closing conditions. The total anticipated capital required for these acquisitions, excluding the payoff of acquired indebtedness, is approximately $4 billion.\nWe do not have other significant contractual obligations or commitments requiring cash resources. However, we continually evaluate opportunities to expand our operations, which include internal development of new products, programs and technology applications and may include acquisitions.\nCRITICAL ACCOUNTING ESTIMATES\nCritical accounting estimates are those estimates requiring management to make challenging, subjective or complex judgments, often because they must estimate the effects of matters inherently uncertain and may change in subsequent periods. Critical accounting estimates involve judgments and uncertainties which are sufficiently sensitive and may result in materially different results under different assumptions and conditions. \nMedical Costs Payable\nMedical costs and medical costs payable include estimates of our obligations for medical care services rendered on behalf of consumers, but for which claims have either not yet been received or processed. Depending on the health care professional and type of service, the typical billing lag for services can be up to 90 days from the date of service. Approximately 90% of claims related to medical care services are known and settled within 90 days from the date of service.\nIn each reporting period, our operating results include the effects of more completely developed medical costs payable estimates associated with previously reported periods. If the revised estimate of prior period medical costs is less than the previous estimate, we will decrease reported medical costs in the current period (favorable development). If the revised estimate of prior period medical costs is more than the previous estimate, we will increase reported medical costs in the current period (unfavorable development). Medical costs in 2024, 2023 and 2022 included favorable medical cost development related to prior years of $700 million, $840 million and $410 million, respectively.\nIn developing our medical costs payable estimates, we apply different estimation methods depending on the month for which incurred claims are being estimated. For example, for the most recent two months, we estimate claim costs incurred by applying observed medical cost trend factors to the average per member per month (PMPM) medical costs incurred in prior months for which more complete claim data is available, supplemented by a review of near-term completion factors.\nCompletion Factors.\n A completion factor is an actuarial estimate, based upon historical experience and analysis of current trends, of the percentage of incurred claims during a given period adjudicated by us at the date of estimation. Completion factors are the most significant factors we use in developing our medical costs payable estimates for periods prior to the most recent two months. Completion factors include judgments in relation to claim submissions such as the time from date of service to claim receipt, claim levels and processing cycles, as well as other factors. If actual claims submission rates from providers (which can be influenced by a number of factors, including provider mix and electronic versus manual submissions), actual care activity incurred (which can be influenced by pandemics or seasonal illnesses, such as influenza), or our claim processing patterns are different than estimated, our reserve estimates may be significantly impacted.\n33\nTable of Contents\nThe following table illustrates the sensitivity of these factors and the estimated potential impact on our medical costs payable estimates for those periods as of December 31, 2024: \nCompletion Factors\n(Decrease) Increase in Factors\nIncrease (Decrease)\nIn Medical Costs Payable\n(in millions)\n(0.75)%\n$\n973 \n(0.50)\n647 \n(0.25)\n322 \n0.25\n(321)\n0.50\n(640)\n0.75\n(958)\nMedical Cost Per Member Per Month Trend Factors.\n Medical cost PMPM trend factors are significant factors we use in developing our medical costs payable estimates for the most recent two months. Medical cost trend factors are developed through a comprehensive analysis of claims incurred in prior months, provider contracting and expected unit costs, benefit design and a review of a broad set of health care utilization indicators. These factors include but are not limited to pharmacy utilization trends, inpatient hospital authorization data and seasonal and other incidence data from the National Centers for Disease Control. We also consider macroeconomic variables such as GDP growth, employment and disposable income. A large number of factors can cause the medical cost trend to vary from our estimates, including: our ability and practices to manage medical and pharmaceutical costs, changes in level and mix of services utilized; mix of benefits offered, including the impact of co-pays and deductibles; changes in medical practices; and catastrophes, epidemics and pandemics. \nThe following table illustrates the sensitivity of these factors and the estimated potential impact on our medical costs payable estimates for the most recent two months as of December 31, 2024: \nMedical Cost PMPM Quarterly Trend\nIncrease (Decrease) in Factors\nIncrease (Decrease)\nIn Medical Costs Payable\n(in millions)\n3%\n$\n1,264 \n2\n843 \n1\n421 \n(1)\n(421)\n(2)\n(843)\n(3)\n(1,264)\nThe completion factors and medical costs PMPM trend factors analyses above include outcomes considered reasonably likely based on our historical experience estimating liabilities for incurred but not reported benefit claims. \nManagement believes the amount of medical costs payable is reasonable and adequate to cover our liability for unpaid claims as of December 31, 2024; however, actual claim payments may differ from established estimates as discussed above. Assuming a hypothetical 1% difference between our December 31, 2024 estimates of medical costs payable and actual medical costs payable, 2024 net earnings would have increased or decreased by approximately $260 million. \nFor more detail related to our medical cost estimates, see \nNote 2 of the Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\n \nGoodwill\nWe evaluate goodwill for impairment annually or more frequently when an event occurs or circumstances change indicating the carrying value may not be recoverable. When testing goodwill for impairment, we may first assess qualitative factors to determine if it is more likely than not the carrying value of a reporting unit exceeds its estimated fair value. During a qualitative analysis, we consider the impact of changes, if any, to the following factors: macroeconomic, industry and market factors; cost factors; changes in overall financial performance; and any other relevant events and uncertainties impacting a reporting unit. If our qualitative assessment indicates a goodwill impairment is more likely than not, we perform additional quantitative analyses. We may also elect to skip the qualitative testing and proceed directly to the quantitative testing. For reporting units where a quantitative analysis is performed, we perform a test measuring the fair values of the reporting units and comparing them to their carrying values, including goodwill. If the fair value is less than the carrying value of the reporting unit, an impairment is recognized for the difference, up to the carrying amount of goodwill.\n34\nTable of Contents\nWe estimate the fair values of our reporting units using a discounted cash flow method which includes assumptions about a wide variety of internal and external factors. Significant assumptions used in the discounted cash flow method include financial projections of free cash flow, including revenue trends, medical costs trends, operating productivity, income taxes and capital levels; long-term growth rates for determining terminal value beyond the discretely forecasted periods; and discount rates. For each reporting unit, comparative market multiples are used to corroborate the results of our discounted cash flow test.\nFinancial projections and long-term growth rates used for our reporting units are consistent with, and use inputs from, our internal long-term business plan and strategies. Discount rates are determined for each reporting unit and include consideration of the implied risk inherent in their forecasts. Our most significant estimate in the discount rate determinations involves our adjustments to the peer company weighted average costs of capital reflecting reporting unit-specific factors. We have not made any adjustments to decrease a discount rate below the calculated peer company weighted average cost of capital for any reporting unit. Company-specific adjustments to discount rates are subjective and thus are difficult to measure with certainty. The passage of time and the availability of additional information regarding areas of uncertainty with respect to the reporting units’ operations could cause these assumptions to change in the future. Additionally, as part of our quantitative impairment testing, we perform various sensitivity analyses on certain key assumptions, such as discount rates and cash flow projections to analyze the potential for a material impact. As of October 1, 2024, we completed our annual impairment tests for goodwill with all of our reporting units having fair values substantially in excess of their carrying values.\nLEGAL MATTERS\nA description of our legal proceedings is presented in \nNote 12 of Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data.”\n \nCONCENTRATIONS OF CREDIT RISK\nInvestments in financial instruments such as marketable securities and accounts receivable may subject us to concentrations of credit risk. Our investments in marketable securities are managed under an investment policy authorized by our Board of Directors. This policy limits the amounts which may be invested in any one issuer and generally limits our investments to U.S. government and agency securities, state and municipal securities and corporate debt obligations of investment grade. Concentrations of credit risk with respect to accounts receivable are limited due to the large number of employer groups and other customers constituting our client base. As of December 31, 2024, there were no significant concentrations of credit risk.\n35\nTable of Contents",
  "item2": null
}