{
  "item1": "improving financial performance enhancing outcomes through proactive analytics, comprehensive payment integrity portfolio technology-enabled staff-supported risk quality services. Optum Insight helps health plans navigate dynamic environment defined shifts employer vs. public-sector coverage, demand affordable benefit plans need leverage new technology reduce complexity. Provides advanced technology analytics services modernize administration critical safety net programs, such Medicaid, while improving cost predictability.",
  "item7": "EXECUTIVE OVERVIEW UnitedHealth Group health care well-being company mission help people live healthier lives help make health system work better everyone. two distinct, yet complementary businesses — Optum UnitedHealthcare — working help build modern, high-performing health system through improved access, affordability, outcomes experiences individuals organizations privileged serve. four reportable segments across two businesses: UnitedHealthcare, which includes UnitedHealthcare Employer & Individual, UnitedHealthcare Medicare & Retirement UnitedHealthcare Community & State. Further information business reportable segments presented Part I, Item 1, “Business” Note 14 Notes Consolidated Financial Statements included Part II, Item 8, “Financial Statements Supplementary Data.” Change Healthcare Cyberattack previously announced, February 21, 2024, identified cybercrime threat actors gained access certain Change Healthcare information technology systems.",
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS following discussion should read together accompanying Condensed Consolidated Financial Statements Notes 2024 10-K, including Consolidated Financial Statements Notes included Part II, Item 8, “Financial Statements Supplementary Data” report. Unless context indicates otherwise, references terms “UnitedHealth Group,” “Company,” “we,” “our” “us” used throughout Management’s Discussion Analysis Financial Condition Results Operations refer UnitedHealth Group Incorporated its consolidated subsidiaries. Readers cautioned statements, estimates, projections outlook contained Management's Discussion Analysis Financial Condition Results Operations, including discussions regarding financial prospects, economic conditions, trends uncertainties contained Item 2, may constitute forward-looking statements within meaning Private Securities Litigation Reform Act 1995 (PSLRA)."
}