{
  "source_file": "unh-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read together with the accompanying Condensed Consolidated Financial Statements and Notes and with our 2024 10-K, including the Consolidated Financial Statements and Notes included in Part II, Item 8, “Financial Statements and Supplementary Data” in that report. Unless the context indicates otherwise, references to the terms “UnitedHealth Group,” the “Company,” “we,” “our” or “us” used throughout this Management’s Discussion and Analysis of Financial Condition and Results of Operations refer to UnitedHealth Group Incorporated and its consolidated subsidiaries.\nReaders are cautioned that the statements, estimates, projections or outlook contained in this Management's Discussion and Analysis of Financial Condition and Results of Operations, including discussions regarding financial prospects, economic conditions, trends and uncertainties contained in this Item 2, may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 (PSLRA). These forward-looking statements involve risks and uncertainties that may cause our actual results to differ materially from the results discussed or implied in the forward-looking statements. A description of some of the risks and uncertainties is set forth in Part I, Item 1A, “Risk Factors” in our 2024 10-K and in the discussion below. \nEXECUTIVE OVERVIEW \nGeneral\nUnitedHealth Group is a health care and well-being company with a mission to help people live healthier lives and help make the health system work better for everyone. Our two distinct, yet complementary businesses — Optum and UnitedHealthcare — are working to help build a modern, high-performing health system through improved access, affordability, outcomes and experiences for the individuals and organizations we are privileged to serve.\nWe have four reportable segments:\n•\nOptum Health;\n•\nOptum Insight;\n•\nOptum Rx; and\n•\nUnitedHealthcare, which includes UnitedHealthcare Employer & Individual, UnitedHealthcare Medicare & Retirement and UnitedHealthcare Community & State.\nFurther information on our business is presented in Part I, Item 1, “Business” and Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our 2024 10-K and additional information on our segments can be found in this Item 2 and in \nNote 10 of Notes to the Condensed Consolidated Financial Statements\n included in Part I, Item 1 of this report.\nBusiness Trends\nOur businesses participate primarily in the United States health markets. We expect overall spending on health care to continue to grow in the future, due to inflation, medical technology and pharmaceutical advancement, regulatory requirements, demographic trends in the population and national interest in health and well-being. The rate of market growth may be affected by a variety of factors, including macroeconomic conditions and regulatory changes, which could impact our results of operations, including our continued efforts to control health care costs.\nPricing Trends.\n To price our health care benefits, products and services, we start with our view of expected future costs, including medical care patterns, the mix and health status of people served, inflation and labor market dynamics. For 2025, our  pricing trends and patient and member health status assumptions were well-short of the medical cost trends incurred, significantly impacting our earnings. We continually evaluate and adjust our approach in each of the local markets we serve, considering relevant factors, such as product positioning, price competitiveness and environmental, competitive, legislative and regulatory considerations, including minimum medical loss ratio thresholds and similar revenue adjustments. We seek to balance growth and profitability across all these dimensions.\nThe commercial risk market remains highly competitive in the small group, large group and individual segments. We expect broad-based competition to continue as the industry adapts to individual and employer needs. Continued increased medical costs may impact both future pricing and benefit design, including for our individual exchange products in markets where we choose to remain, and result in shifts between product categories for our employer benefits. These potential changes, along with certain regulatory impacts, may result in decreased membership in future periods. \nMedicare Advantage funding continues to be pressured, as discussed below in \n“Regulatory Trends and Uncertainties\n,\n”\n and we have observed increased care patterns as discussed below in “Medical Cost Trends,” which may impact pricing and benefit design in future periods.\n17\nTable of Contents\nOptum Health’s fully accountable value-based care businesses have been impacted by Medicare funding reductions and have also seen continued medical cost trend pressures, which may impact future pricing in the markets we continue to participate.\nThe Medicaid redetermination process has caused a timing mismatch between the health status of people served through Medicaid and state rate updates. Due to elevated care activity, specifically related to behavioral, pharmacy and home health, there continues to be a mismatch between the updated rates in 2025 and underlying member acuity. The funding and payment rate environment remains insufficient to meet the health needs of patients and creates the risk of continued downward pressure on Medicaid margin percentages. We continue to take a prudent, market-sustainable posture for both new business and maintenance of existing relationships. We continue to advocate for actuarially sound rates commensurate with our medical cost trends and we remain dedicated to partnering with those states that are committed to the long-term viability of their programs. Additionally, we expect some Medicaid membership losses in 2026 as a result of early adoption of recent legislation.\nMedical Cost Trends.\n Our medical cost trends primarily relate to changes in unit costs, care activity and prescription drug costs. We have observed increased care patterns, more notably related to physician and outpatient care, and to a lesser extent inpatient and emergency room utilization, that are above what we expected and contemplated in our pricing and benefits design. We have also observed an increase in health care unit costs and in the intensity of services delivered, driven by increases in provider pricing and additional services bundled per visit. Additionally, the member profile of newly added patients under value-based care arrangements, people served in Medicare Advantage in markets where other have plans exited, and people served within our individual exchange business have contributed to increased medical costs. These trends may continue in future periods.\nThe Inflation Reduction Act (IRA) altered the Medicare Part D model and benefits, shifting more risk to plans, which results in both increased premiums and medical costs. The IRA also changed the quarterly relationship of medical costs to premiums, altering the seasonal progression and creating a more consistent relationship between medical costs and premiums throughout the year. \nWe endeavor to mitigate medical cost increases by engaging hospitals, physicians and consumers with information and helping them make clinically sound choices, with the objective of helping them achieve high-quality, affordable care. Additionally, we have elevated our audit, clinical policy and payment integrity tools to protect customers and patients from unnecessary costs. \nRegulatory \nTrends and Uncertainties\nMedicare Advantage Rates. \nMedicare Advantage rate notices for numerous years have resulted in industry base rates well below the industry forward medical cost trend, with the Final Notice for 2026 beginning to approach the industry forward medical cost trend. Additionally, increased medical costs in 2025, which are significantly above initial cost trend estimates, adds to the compounding impact of the previous multi-year rate shortfalls creating sustained pressure on the Medicare Advantage program. Further, substantial revisions to the risk adjustment model, which serves to adjust rates to reflect a patient’s health status and care resource needs, have resulted and will continue to result in reduced funding and potentially benefits for people, especially those with some of the greatest health and social challenges. \nAs a result of ongoing Medicare funding pressures, there are adjustments we can make to partially offset these rate pressures and reductions for a particular period. For example, we can seek to intensify our medical and operating cost management, make changes to the size and composition of our care provider networks, adjust member benefits and implement or increase the member premiums supplementing the monthly payments we receive from the government. Additionally, we decide annually on a county-by-county basis where we will offer Medicare Advantage plans.\nSELECTED OPERATING PERFORMANCE AND OTHER SIGNIFICANT ITEMS\nThe following summarizes select \nthird quarter\n 2025 year-over-year operating comparisons to \nthird quarter\n 2024 and other financial results.\n•\nConsolidated revenues grew 12%, UnitedHealthcare revenues grew 16% and Optum revenues grew 8%.\n•\nUnitedHealthcare served 795,000 more people, primarily driven by growth in Medicare Advantage.\n•\nConsolidated earnings from operations of $4.3 billion compared to $8.7 billion last year, with 2025 impacted by elevated medical cost trend and 2024 impacted by the Change Healthcare cyberattack.\n•\nDiluted earnings per common share were $2.59.\n•\nCash flows from operations for the nine months ended September 30, 2025 were $18.6 billion.\n18\nTable of Contents\nRESULTS SUMMARY\nThe following table summarizes our consolidated results of operations and other financial information:\n(in millions, except percentages and per share data)\nThree Months Ended \nSeptember 30,\nIncrease/\n(Decrease)\nNine Months Ended \nSeptember 30,\nIncrease/\n(Decrease)\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\nRevenues:\nPremiums\n$\n88,979 \n$\n77,442 \n$\n11,537 \n15 \n%\n$\n263,418 \n$\n232,327 \n$\n31,091 \n13 \n%\nProducts\n13,296 \n12,631 \n665 \n5 \n39,896 \n36,751 \n3,145 \n9 \nServices\n9,754 \n9,104 \n650 \n7 \n27,765 \n26,742 \n1,023 \n4 \nInvestment and other income\n1,132 \n1,643 \n(511)\n(31)\n3,273 \n3,651 \n(378)\n(10)\nTotal revenues\n113,161 \n100,820 \n12,341 \n12 \n334,352 \n299,471 \n34,881 \n12 \nOperating costs:\nMedical costs\n79,958 \n65,957 \n14,001 \n21 \n231,954 \n197,150 \n34,804 \n18 \nOperating costs\n15,223 \n13,280 \n1,943 \n15 \n42,595 \n40,519 \n2,076 \n5 \nCost of products sold\n12,566 \n11,834 \n732 \n6 \n37,975 \n34,230 \n3,745 \n11 \nDepreciation and amortization\n1,099 \n1,041 \n58 \n6 \n3,244 \n3,058 \n186 \n6 \nTotal operating costs\n108,846 \n92,112 \n16,734 \n18 \n315,768 \n274,957 \n40,811 \n15 \nEarnings from operations\n4,315 \n8,708 \n(4,393)\n(50)\n18,584 \n24,514 \n(5,930)\n(24)\nInterest expense\n(1,003)\n(1,074)\n71 \n(7)\n(3,028)\n(2,903)\n(125)\n4 \nLoss on sale of subsidiary and subsidiaries held for sale\n(83)\n(20)\n(63)\n315 \n(139)\n(8,331)\n8,192 \n(98)\nEarnings before income taxes\n3,229 \n7,614 \n(4,385)\n(58)\n15,417 \n13,280 \n2,137 \n16 \nProvision for income taxes\n(686)\n(1,356)\n670 \n(49)\n(2,828)\n(3,822)\n994 \n(26)\nNet earnings\n2,543 \n6,258 \n(3,715)\n(59)\n12,589 \n9,458 \n3,131 \n33 \nEarnings attributable to noncontrolling interests\n(195)\n(203)\n8 \n(4)\n(543)\n(596)\n53 \n(9)\nNet earnings attributable to UnitedHealth Group common shareholders\n$\n2,348 \n$\n6,055 \n$\n(3,707)\n(61)\n%\n$\n12,046 \n$\n8,862 \n$\n3,184 \n36 \n%\nDiluted earnings per share attributable to UnitedHealth Group common shareholders \n$\n2.59 \n$\n6.51 \n$\n(3.92)\n$\n13.21 \n$\n9.53 \n$\n3.68 \nMedical care ratio (a)\n89.9 \n%\n85.2 \n%\n4.7 \n%\n88.1 \n%\n84.9 \n%\n3.2 \n%\nOperating cost ratio\n13.5 \n13.2 \n0.3 \n12.7 \n13.5 \n(0.8)\nOperating margin\n3.8 \n8.6 \n(4.8)\n5.6 \n8.2 \n(2.6)\nTax rate\n21.2 \n17.8 \n3.4 \n18.3 \n28.8 \n(10.5)\nNet earnings margin (b)\n2.1 \n6.0 \n(3.9)\n3.6 \n3.0 \n0.6 \nReturn on equity (c)\n9.9 \n%\n26.3 \n%\n(16.4)\n17.0 \n%\n13.2 \n%\n3.8 \n \n(a)\nMedical care ratio (MCR) is calculated as medical costs divided by premium revenue.\n(b)\nNet earnings margin attributable to UnitedHealth Group shareholders.\n(c)\nReturn on equity is calculated as annualized net earnings attributable to UnitedHealth Group common shareholders divided by average shareholders’ equity. Average shareholders’ equity is calculated using the shareholders’ equity balance at the end of the preceding year and the shareholders’ equity balances at the end of each of the quarters in the year presented. \n19\nTable of Contents\n2025 RESULTS OF OPERATIONS COMPARED TO 2024 RESULTS OF OPERATIONS\nConsolidated Financial Results\nRevenues\nThe increases in revenues were primarily driven by growth in people served through Medicare Advantage and those with higher acuity needs within Medicaid, growth at Optum Rx and pricing trends.\nMedical Costs and MCR\nMedical costs increased primarily due to the IRA-driven impacts on Medicare Part D plans, elevated medical cost trend and growth in people served through Medicare Advantage and those with higher acuity needs. The MCR increased as a result of the revenue effects of the Medicare funding reductions, elevated medical cost trend, the member profile of newly added patients under value-based care arrangements, the seasonal impacts of the IRA on Medicare Part D and the impacts of market morbidity changes on our individual exchange offerings. For the nine months ended September 30, 2025, the MCR also increased due to decreased favorable reserve development, partially offset by the incremental medical costs for accommodations made to care providers in 2024 as a result of the Change Healthcare cyberattack. The acceleration of anticipated future losses related to our individual exchange offerings recorded in the second quarter of 2025 decreased the MCR for the three months ended September 30, 2025 and increased the MCR for the nine months ended September 30, 2025.\nOperating Cost Ratio\nThe operating cost ratio for the three months ended September 30, 2025, increased primarily due to decreased gains related to business portfolio refinement, business mix and investments to support future growth; partially offset by the revenue impacts of government programs, including the IRA-driven impacts on Medicare Part D plans and operating cost management. For the nine months ended September 30, 2025 the operating cost ratio decreased due to the revenue impacts of government programs, including the IRA-driven impacts on Medicare Part D plans; operating cost management and our direct response efforts to the Change Healthcare cyberattack in 2024; partially offset by business mix, investments to support future growth and decreased gains related to business portfolio refinement.\nTax Rate\nThe effective income tax rate decreased for the nine months ended September 30, 2025 due to non-deductible losses on the sale of subsidiary and subsidiaries held for sale in 2024.\nReportable Segments\nSee \nNote 10 of Notes to the Condensed Consolidated Financial Statements\n included in Part I, Item 1 of this report for more information on our segments. We utilize various metrics to evaluate and manage our reportable segments, including people served by UnitedHealthcare by major market segment and funding arrangement, people served by Optum Health and adjusted scripts for Optum Rx. These metrics are the main drivers of revenue, earnings and cash flows at each business. The metrics also allow management and investors to evaluate and understand business mix, including the level and scope of services provided to people, and pricing trends when comparing the metrics to revenue by segment.\n20\nTable of Contents\nThe following table presents a summary of the reportable segment financial information:\n \nThree Months Ended\nSeptember 30,\nIncrease/\n(Decrease)\nNine Months Ended\n September 30,\nIncrease/\n(Decrease)\n(in millions, except percentages)\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\nRevenues\nUnitedHealthcare\n$\n87,070 \n$\n74,853 \n$\n12,217 \n16 \n%\n$\n257,790 \n$\n224,076 \n$\n33,714 \n15 \n%\nOptum Health\n25,900 \n25,917 \n(17)\n— \n76,414 \n79,698 \n(3,284)\n(4)\nOptum Insight\n4,915 \n4,931 \n(16)\n— \n14,373 \n13,976 \n397 \n3 \nOptum Rx\n39,679 \n34,207 \n5,472 \n16 \n113,270 \n97,457 \n15,813 \n16 \nOptum eliminations\n(1,317)\n(1,130)\n(187)\n17 \n(3,770)\n(3,275)\n(495)\n15 \nOptum\n69,177 \n63,925 \n5,252 \n8 \n200,287 \n187,856 \n12,431 \n7 \nEliminations\n(43,086)\n(37,958)\n(5,128)\n14 \n(123,725)\n(112,461)\n(11,264)\n10 \nConsolidated revenues\n$\n113,161 \n$\n100,820 \n$\n12,341\n12 \n%\n$\n334,352 \n$\n299,471 \n$\n34,881 \n12 \n%\nEarnings from operations\nUnitedHealthcare\n$\n1,805 \n$\n4,212 \n$\n(2,407)\n(57)\n%\n$\n9,106 \n$\n12,611 \n$\n(3,505)\n(28)\n%\nOptum Health\n255 \n2,161 \n(1,906)\n(88)\n2,505 \n5,979 \n(3,474)\n(58)\nOptum Insight\n706 \n791 \n(85)\n(11)\n2,665 \n1,827 \n838 \n46 \nOptum Rx\n1,549 \n1,544 \n5 \n— \n4,308 \n4,097 \n211 \n5 \nOptum\n2,510 \n4,496 \n(1,986)\n(44)\n9,478 \n11,903 \n(2,425)\n(20)\nConsolidated earnings from operations\n$\n4,315 \n$\n8,708 \n$\n(4,393)\n(50)\n%\n$\n18,584 \n$\n24,514 \n$\n(5,930)\n(24)\n%\nOperating margin\nUnitedHealthcare\n2.1 \n%\n5.6 \n%\n(3.5)\n%\n3.5 \n%\n5.6 \n%\n(2.1)\n%\nOptum Health\n1.0 \n8.3 \n(7.3)\n3.3 \n7.5 \n(4.2)\nOptum Insight\n14.4 \n16.0 \n(1.6)\n18.5 \n13.1 \n5.4 \nOptum Rx\n3.9 \n4.5 \n(0.6)\n3.8 \n4.2 \n(0.4)\nOptum\n3.6 \n7.0 \n(3.4)\n4.7 \n6.3 \n(1.6)\nConsolidated operating margin\n3.8 \n%\n8.6 \n%\n(4.8)\n%\n5.6 \n%\n8.2 \n%\n(2.6)\n%\nUnitedHealthcare\nThe following table summarizes UnitedHealthcare revenues by business: \n \nThree Months Ended \nSeptember 30,\nIncrease/\n(Decrease)\nNine Months Ended \nSeptember 30,\nIncrease/\n(Decrease)\n(in millions, except percentages)\n2025\n2024\n2025 vs. 2024\n2025\n2024\n2025 vs. 2024\nUnitedHealthcare Employer & Individual - Domestic\n$\n19,049 \n$\n18,985 \n$\n64 \n— \n%\n$\n57,065 \n$\n55,470 \n$\n1,595 \n3 \n%\nUnitedHealthcare Employer & Individual - Global\n826 \n769 \n57 \n7 \n2,427 \n2,892 \n(465)\n(16)\nUnitedHealthcare Employer & Individual - Total\n19,875 \n19,754 \n121 \n1 \n59,492 \n58,362 \n1,130 \n2 \nUnitedHealthcare Medicare & Retirement\n43,356 \n34,904 \n8,452 \n24 \n127,684 \n105,294 \n22,390 \n21 \nUnitedHealthcare Community & State\n23,839 \n20,195 \n3,644 \n18 \n70,614 \n60,420 \n10,194 \n17 \nTotal UnitedHealthcare revenues\n$\n87,070 \n$\n74,853 \n$\n12,217 \n16 \n%\n$\n257,790 \n$\n224,076 \n$\n33,714 \n15 \n%\n21\nTable of Contents\nThe following table summarizes the number of people served by our UnitedHealthcare businesses, by major market segment and funding arrangement:\nSeptember 30,\nIncrease/(Decrease)\n(in thousands, except percentages)\n2025\n2024\n2025 vs. 2024\nCommercial:\nRisk-based\n8,440 \n8,900 \n(460)\n(5)\n%\nFee-based\n21,490 \n20,830 \n660 \n3 \nTotal Commercial\n29,930 \n29,730 \n200 \n1 \nMedicare Advantage\n8,435 \n7,810 \n625 \n8 \nMedicaid\n7,460 \n7,450 \n10 \n— \nMedicare Supplement (Standardized)\n4,300 \n4,340 \n(40)\n(1)\nTotal Community and Senior\n20,195 \n19,600 \n595 \n3 \nTotal UnitedHealthcare - Medical\n50,125 \n49,330 \n795 \n2 \n%\nSupplemental Data:\nMedicare Part D stand-alone\n2,795 \n3,055 \n(260)\n(9)\n%\nSouth American businesses held for sale\n1,160 \n1,335 \n(175)\n(13)\n%\nUnitedHealthcare’s revenues increased due to the IRA-driven impacts on Medicare Part D plans and growth in the number of people served through Medicare Advantage, fee-based commercial offerings and those with higher acuity needs, partially offset by decreased people served through risk-based commercial offerings and Medicaid offerings. \nEarnings from operations decreased primarily due to the impacts of Medicare Advantage funding reductions, elevated medical cost trend, the impacts of market morbidity changes on our individual exchange offerings and other write-offs and settlements. For the three months ended September 30, 2025, decreased earnings from operations was also due to the seasonal impact of the IRA on Medicare Part D. For the nine months ended September 30, 2025, decreased earnings from operations was partially offset by the seasonal impact of the IRA on Medicare Part D and the incremental medical costs for accommodations to support care providers in 2024 as a result of the Change Healthcare cyberattack. The acceleration of anticipated future losses related to our individual exchange offerings recorded in the second quarter of 2025 increased earnings from operations for the three months ended September 30, 2025 and decreased operating earnings for the nine months ended September 30, 2025.\nOptum\nTotal revenues increased primarily due to growth at Optum Rx. For the nine months ended September 30, 2025, increased revenues were partially offset by Optum Health. Earnings from operations decreased due to Optum Health, partially offset by the impacts of the Change Healthcare cyberattack in 2024. The results by segment were as follows:\nOptum Health\nRevenues at Optum Health decreased primarily due to the conversion of risk-based contracts, Medicare Advantage funding reductions and the profile of members served, partially offset by growth in patients served under value-based arrangements. Earnings from operations decreased due to Medicare Advantage funding reductions, the member profile of newly added patients under value-based care arrangements, elevated medical cost trends and decreased gains related to business portfolio refinement, partially offset by cost management initiatives. For the three months ended September 30, 2025 decreased earnings from operations was also due to lower investment income, partially offset by decreased contractual settlements. For the nine months ended September 30, 2025, decreased earnings from operations was also partially offset by the incremental medical costs for accommodations to support care providers in 2024 as a result of the Change Healthcare cyberattack. Optum Health served approximately 96 million people and 104 million people as of September 30, 2025 and September 30, 2024, respectively.\nOptum Insight\nRevenues and earnings from operations at Optum Insight decreased for the three months ended September 30, 2025 due to lower volumes within business services, partially offset by growth in technology services and decreased impacts related to the Change Healthcare cyberattack. Revenues and earnings from operations increased for the nine months ended September 30, 2025 due to decreased impacts related to the Change Healthcare cyberattack and growth in technology services, partially offset by lower volumes within business services.\n22\nTable of Contents\nOptum Rx\nRevenues at Optum Rx increased due to higher script volumes from both new clients and growth in existing clients and growth in pharmacy services. Earnings from operations increased due to the factors impacting revenue and operating cost efficiencies, partially offset by decreased investment income. Optum Rx fulfilled 414 million and 407 million adjusted scripts in the third quarters of 2025 and 2024, respectively.\nLIQUIDITY, FINANCIAL CONDITION AND CAPITAL RESOURCES\nLiquidity\nSummary of our Major Sources and Uses of Cash and Cash Equivalents\n \nNine Months Ended September 30,\nIncrease/(Decrease)\n(in millions)\n2025\n2024\n2025 vs. 2024\nSources of cash:\nCash provided by operating activities\n$\n18,589 \n$\n21,835 \n$\n(3,246)\nIssuances of short-term borrowings and long-term debt, net of repayments\n2,438 \n15,120 \n(12,682)\nProceeds from common stock issuances\n803 \n1,611 \n(808)\nSales and maturities of investments, net of purchases\n1,657 \n1,852 \n(195)\nRepayments of care provider loans - cyberattack\n1,543 \n3,189 \n(1,646)\nTotal sources of cash\n25,030 \n43,607 \n(18,577)\nUses of cash:\nCommon stock repurchases\n(5,545)\n(4,028)\n(1,517)\nCash paid for acquisitions and other transactions, net of cash assumed\n(4,436)\n(11,674)\n7,238 \nPurchases of property, equipment and capitalized software\n(2,674)\n(2,587)\n(87)\nCash dividends paid\n(5,914)\n(5,601)\n(313)\nLoans to care providers - cyberattack\n— \n(8,904)\n8,904 \nCustomer funds administered\n(1,792)\n(1,059)\n(733)\nOther\n(2,767)\n(2,497)\n(270)\nTotal uses of cash\n(23,128)\n(36,350)\n13,222 \nEffect of exchange rate changes on cash and cash equivalents\n25 \n(30)\n55 \nIncrease in cash and cash equivalents, including cash within businesses held for sale\n$\n1,927 \n$\n7,227 \n$\n(5,300)\nLess: net increase in cash within businesses held for sale\n(29)\n(254)\n225 \nNet increase in cash and cash equivalents\n$\n1,898 \n$\n6,973 \n$\n(5,075)\n2025 Cash Flows Compared to 2024 Cash Flows\nDecreased cash flows provided by operating activities were driven by decreased net earnings, partially offset by changes in working capital accounts and the impacts of the Change Healthcare cyberattack in 2024. Other significant changes in sources or uses of cash year-over-year included net repayments of loans to care providers in response to the Change Healthcare cyberattack and decreased cash paid for acquisitions and other transactions, offset by decreased net issuances of short-term borrowings and long-term debt, increased share repurchases, decreased proceeds from common stock issuances and decreased customer funds administered.\nFinancial Condition\nAs of September 30, 2025, our cash, cash equivalent, available-for-sale debt securities and marketable equity securities balances of $76.3 billion included approximately $27.2 billion of cash and cash equivalents (of which $1.2 billion was available for general corporate use), $46.8 billion of debt securities and $2.2 billion of investments in marketable equity securities. Given the significant portion of our portfolio held in cash and cash equivalents, we do not anticipate fluctuations in the aggregate fair value of our financial assets to have a material impact on our liquidity or capital position. Our available-for-sale debt securities portfolio had a weighted-average duration of 4.3 years and a weighted-average credit rating of “Double A” as of September 30, 2025. When multiple credit ratings are available for an individual security, the average of the available ratings is used to determine the weighted-average credit rating.\n23\nTable of Contents\nCapital Resources and Uses of Liquidity\nIn addition to cash flows from operations and cash and cash equivalent balances available for general corporate use, our capital resources and uses of liquidity are as follows:\nCash Requirements. \nA summary of our cash requirements as of December 31, 2024 was disclosed in Part II, Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our 2024 10-K. During the nine months ended September 30, 2025, there were no material changes to this previously disclosed information outside the ordinary course of business. We believe our capital resources are sufficient to meet future, short-term and long-term, liquidity needs. We continually evaluate opportunities to expand our operations, including through internal development of new products, programs and technology applications and business combinations.\nShort-Term Borrowings. \nOur revolving bank credit facilities provide liquidity support for our commercial paper borrowing program, which facilitates the private placement of unsecured debt through independent broker-dealers, and are available for general corporate purposes. For more information on our commercial paper and bank credit facilities, see \nNote 5 of the Notes to the Condensed Consolidated Financial Statements\n included in Part I, Item 1 of this report and Note 8 of Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data” in our 2024 10-K. As of September 30, 2025, we were in compliance with the various covenants under our bank credit facilities.\nLong-Term Debt.\n Periodically, we access capital markets and issue long-term debt for general corporate purposes, such as to meet our working capital requirements, to refinance debt, to finance acquisitions or for share repurchases. For more information on our long-term debt, see \nNote 5 of the Notes to the Condensed Consolidated Financial Statements\n included in Part I, Item 1 of this report and Note 8 of Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data” in our 2024 10-K.\nCredit Ratings.\n Our credit ratings as of September 30, 2025 were as follows:\n \n \nMoody’s\nS&P Global\nFitch\nA.M. Best\n \nRatings\nOutlook\nRatings\nOutlook\nRatings\nOutlook\nRatings\nOutlook\nSenior unsecured debt\nA2\nNegative\nA+\nNegative\nA\nNegative\nA-\nStable\nCommercial paper\nP-1\nn/a\nA-1\nn/a\nF1\nn/a\nAMB-1\nn/a\nThe availability of financing in the form of debt or equity is influenced by many factors, including our profitability, operating cash flows, debt levels, credit ratings, debt covenants and other contractual restrictions, regulatory requirements and economic and market conditions. A significant downgrade in our credit ratings or adverse conditions in the capital markets may increase the cost of borrowing for us or limit our access to capital.\nRegulatory Capital. \nAs a result of an increased MCR impacting our regulated insurance and HMO subsidiaries, the specified levels of required statutory capital required to be maintained are expected to increase. We entered into various agreements with reinsurers that could limit our risk of loss under certain circumstances, thus reducing our capital and surplus requirements. These agreements do not qualify for reinsurance accounting and are therefore accounted for under deposit accounting. \nWhile we continue to maintain significant levels of excess statutory capital in our subsidiaries, the amount of dividends our subsidiaries are able to pay to their parent companies during the remainder of 2025 will be impacted. During the nine months ended September 30, 2025, our domestic insurance and HMO subsidiaries paid their parent companies dividends, net of capital infusions, of $841 million.\nShare Repurchase Program.\n During the nine months ended September 30, 2025, we repurchased approximately 12.1 million shares of common stock at an average price of $454.82 per share. As of September 30, 2025, we had Board of Directors’ authorization to purchase up to 21.0 million shares of our common stock. The Board of Directors from time to time may further amend the share repurchase program in order to increase the authorized number of shares which may be repurchased under the program.\nDividends.\n In June 2025, our Board of Directors increased our quarterly cash dividend to an annual rate of $8.84 compared to $8.40 per share, which we had paid since June 2024. For more information on our dividend, see \nNote 6 of Notes to the Condensed Consolidated Financial Statements\n included in Part I, Item 1 of this report.\nFor additional liquidity discussion, see Note 10 of Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in Part II, Item 7 in our 2024 10-K.\n24\nTable of Contents\nRECENTLY ISSUED ACCOUNTING STANDARDS \nThere are no recently issued accounting standards that are expected to have a material impact on our Condensed Consolidated Financial Statements.\nCRITICAL ACCOUNTING ESTIMATES\nIn preparing our Condensed Consolidated Financial Statements, we are required to make judgments, assumptions and estimates, which we believe are reasonable and prudent based on the available facts and circumstances. These judgments, assumptions and estimates affect certain of our revenues and expenses and their related balance sheet accounts and disclosure of our contingent liabilities. We base our assumptions and estimates primarily on historical experience and consider known and projected trends. On an ongoing basis, we re-evaluate our selection of assumptions and the method of calculating our estimates. Actual results, however, may materially differ from our calculated estimates, and this difference would be reported in our current operations.\nOur critical accounting estimates include medical costs payable and goodwill. For a detailed description of our critical accounting estimates, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in Part II, Item 7 in our 2024 10-K. For a detailed discussion of our significant accounting policies, see Note 2 of Notes to the Consolidated Financial Statements included in Part II, Item 8, “Financial Statements and Supplementary Data” in our 2024 10-K.\nFORWARD-LOOKING STATEMENTS\nThe statements, estimates, projections, guidance or outlook contained in this document include “forward-looking” statements which are intended to take advantage of the “safe harbor” provisions of the federal securities laws. The words “believe,” “expect,” “intend,” “estimate,” “anticipate,” “forecast,” “outlook,” “plan,” “project,” “should” and similar expressions identify forward-looking statements. These statements may contain information about financial prospects, economic conditions and trends and involve risks and uncertainties. Actual results could differ materially from those that management expects, depending on the outcome of certain factors including: our ability to effectively estimate, price for and manage medical costs; new or changes in existing health care laws or regulations, or their enforcement or application; cyberattacks, other privacy/data security incidents, or our failure to comply with related regulations; reductions in revenue or delays to cash flows received under government programs; changes in Medicare, the CMS star ratings program or the application of risk adjustment data validation audits; the DOJ’s legal actions concerning our participation in the Medicare program; our ability to maintain and achieve improvement in quality scores impacting revenue; failure to maintain effective and efficient information systems or if our technology products do not operate as intended; risks and uncertainties associated with our businesses providing pharmacy care services; competitive pressures, including our ability to maintain or increase our market share; changes in or challenges to our public sector contract awards; failure to achieve targeted operating cost productivity improvements; failure to develop and maintain satisfactory relationships with health care payers, physicians, hospitals and other service providers; the impact of potential changes in tax laws and regulations; increases in costs and other liabilities associated with litigation, government investigations, audits or reviews; failure to complete, manage or integrate strategic transactions; risk and uncertainties associated with the sale of our remaining operations in South America; risks associated with public health crises arising from large-scale medical emergencies, pandemics, natural disasters and other extreme events; failure to attract, develop, retain, and manage the succession of key employees and executives; our investment portfolio performance; impairment of our goodwill and intangible assets; failure to protect proprietary rights to our databases, software and related products; downgrades in our credit ratings; and our ability to obtain sufficient funds from our regulated subsidiaries or from external financings to fund our obligations, reinvest in our business, maintain our debt to total capital ratio at targeted levels, maintain our quarterly dividend payment cycle, or continue repurchasing shares of our common stock. \nThis above list is not exhaustive. We discuss these matters, and certain risks that may affect our business operations, financial condition and results of operations, more fully in our filings with the SEC, including our reports on Forms 10-K, 10-Q and 8-K. By their nature, forward-looking statements are not guarantees of future performance or results and are subject to risks, uncertainties and assumptions that are difficult to predict or quantify. Actual results may vary materially from expectations expressed or implied in this document or any of our prior communications. You should not place undue reliance on forward-looking statements, which speak only as of the date they are made. We do not undertake to update or revise any forward-looking statements, except as required by law.\n25\nTable of Contents"
}