{
  "source_file": "unp-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nUNION PACIFIC CORPORATION AND SUBSIDIARY COMPANIES\nRESULTS OF OPERATIONS\nThree and nine months ended September 30, 2025, compared to \nthree and nine months ended September 30, 2024\nFor purposes of this report, unless the context otherwise requires, all references herein to \"Union Pacific\", “UPC”, “Corporation”, “Company”, “we”, “us”, and “our” shall mean Union Pacific Corporation and its subsidiaries, including Union Pacific Railroad Company, which we separately refer to as “UPRR” or the “Railroad”.\nThe following discussion should be read in conjunction with the Condensed Consolidated Financial Statements and applicable notes to the Condensed Consolidated Financial Statements, Item 1, and other information included in this report. Our Condensed Consolidated Financial Statements are unaudited and reflect all adjustments (consisting only of normal and recurring adjustments) that are, in the opinion of management, necessary for their fair presentation in conformity with accounting principles generally accepted in the United States of America (GAAP).\nThe Railroad, along with its subsidiaries and rail affiliates, is our one reportable business segment. Although revenues are analyzed by commodity, we analyze the net financial results of the Railroad as one segment due to the integrated nature of the rail network.\nCritical accounting estimates\nThe preparation of these financial statements requires estimation and judgment that affect the reported amounts of revenues, expenses, assets, and liabilities. We base our estimates on historical experience and on various other assumptions that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources. If these estimates differ materially from actual results, the impact on the Condensed Consolidated Financial Statements may be material. Our critical accounting estimates are available in Item 7 of our 2024 Annual Report on Form 10-K. During the first nine months of 2025, there have not been any significant changes with respect to our critical accounting estimates.\nRESULTS OF OPERATIONS\nQuarterly summary\nThe Company reported earnings of $3.01 per diluted share on net income of $1.8 billion and an operating ratio of 59.2% in the third quarter of 2025 compared to earnings of $2.75 per diluted share on net income of $1.7 billion and an operating ratio of 60.3% in the third quarter of 2024. Freight revenues increased 3% on slightly negative carloads in the third quarter of 2025 compared to the same period in 2024 driven by core pricing gains and a more favorable business mix, partially offset by lower fuel surcharge revenue. Increased carloads in coal, industrial chemicals and plastics, and grain and grain products were offset by lower international intermodal carloads, which declined 17% in the third quarter of 2025. \nOur rail network operations remained fluid in the third quarter of 2025 compared to 2024 resulting in record performance for many of our key operating metrics. Freight car velocity increased 8% and terminal dwell improved 9%. Although volumes were essentially unchanged from the third quarter of 2024, we efficiently handled the shift in business traffic as we moved more bulk and manifest carloads and fewer international intermodal carloads with the traffic shifting back to historical trade patterns. In t\nhird quarter of 2025 compared to 2024, \nw\norkforce productivity improved 6% and locomotive productivity improved 4% to record results  as we efficiently utilized our resources and adjusted to the changing demand environments. Both manifest and intermodal service performance index measures improved over 10 points compared to last year, while train length continued to improve, increasing \n2%\n.\nOperating expenses slightly increased compared to the third quarter of 2024 due to inflation, acquisition-related expenses (see Note 18 to the Condensed Consolidated Financial Statements, Item 1), and higher depreciation.\n These increases were partially offset by productivity, lower casualty costs, and lower fuel prices. Compared to third quarter of last year, operating income \nincreased\n \n6%\n to $2.5 billion, and the operating ratio of 59.2% \nimproved\n \n1.1 points\n, reflecting top-line growth, solid operational performance, and productivity gains.\n21\nTable of Contents\nOperating revenues\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\nMillions\n2025\n2024\nChange\n2025\n2024\nChange\nFreight revenues\n$\n5,927\n \n$\n5,768 \n3%\n$\n17,461\n \n$\n17,022 \n3%\nOther subsidiary revenues\n172\n \n179 \n(4)\n547\n \n608 \n(10)\nAccessorial revenues\n124\n \n122 \n2\n \n349\n \n427 \n(18)\nOther\n21\n \n22 \n(5)\n68\n \n72 \n(6)\nTotal\n$\n6,244\n \n$\n6,091 \n3%\n$\n18,425\n \n$\n18,129 \n2%\nWe generate freight revenues by transporting products from our three commodity groups. Freight revenues vary with volume (carloads) and\n average revenue per car (ARC).\n Changes in price, traffic mix, and fuel surcharges drive ARC. Customer incentives, which are primarily provided for shipping to/from specific locations or based on cumulative volume, are recorded as a reduction to operating revenues. Customer incentives that include variable consideration based on cumulative volume are estimated using the expected value method, which is based on available historical, current, and forecasted volume, and recognized as the related performance obligation is satisfied. We recognize freight revenues over time as shipments move from origin to destination. The allocation of revenues between reporting periods is based on the relative transit time in each reporting period with expenses recognized as incurred.\nOther subsidiary revenues (primarily logistics and commuter rail operations) are generally recognized over time as shipments move from origin to destination. The allocation of revenues between reporting periods is based on the relative transit time in each reporting period with expenses recognized as incurred. Accessorial revenues are recognized at a point in time as performance obligations are satisfied.\nFreight revenues increased 3% on slightly negative carloads in the third quarter of 2025 compared to the same period in 2024 as a result of core pricing gains and a more favorable business mix, partially offset by lower fuel surcharge revenue. Increased carloads in coal, industrial chemicals and plastics, and grain and grain products were offset by lower international intermodal carloads, which declined 17% in the third quarter of 2025. For the year-to-date period of 2025, freight revenues also increased 3% driven by core pricing gains and 3% volume growth, partially offset by unfavorable business mix (for example, relative increases in shipments with lower ARC such as intermodal and coal) and lower fuel surcharge revenues. Increased shipments of intermodal, coal, and grain and grain products were partially offset by lower automotive shipments.\nEach of our commodity groups includes revenues from fuel surcharges. Freight revenues from fuel surcharge programs decreased $33 million to $602 million in the third quarter of 2025 compared to $635 million in the same period of 2024 due the lag impact on fuel prices (it can generally take up to two months for changing fuel prices to affect fuel surcharge recoveries) and lower volumes, partially offset by higher fuel prices. For the year-to-date period of 2025, freight revenues from fuel surcharge programs declined $233 million compared to 2024 driven by lower fuel prices and the related price lag impact, partially offset by higher volume levels. \nOther subsidiary revenues decreased in the third quarter and year-to-date periods of 2025 compared to 2024 primarily driven by the transfer of commuter operations to Metra and a wea\nker demand for auto parts shipments at our subsidiary that brokers intermodal and transload logistics services. Accessorial revenues increased in the third quarter 2025 compared to 2024 driven by improved intermodal accessorial revenues. For the year-to-date period, accessorial revenues decreased due to the sale of our intermodal equipment in the second quarter of 2024, resulting in lower intermodal accessorial revenues, and the comparison period was also negatively impacted by a one-time contract settlement recognized in the first quarter of 2024.\n22\nTable of Contents\nThe following tables summarize the year-over-year changes in freight revenues, revenue carloads, and ARC by commodity type:\nFreight revenues\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\nMillions\n2025\n2024\nChange\n2025\n2024\nChange\nGrain & grain products\n$\n975\n \n$\n923 \n6%\n$\n2,889\n \n$\n2,767 \n4%\nFertilizer\n227\n \n208 \n9\n638\n \n612 \n4\nFood & refrigerated\n258\n \n269 \n(4)\n785\n \n832 \n(6)\nCoal & renewables\n470\n \n405 \n16\n1,355\n \n1,132 \n20\nBulk\n1,930\n \n1,805 \n7\n5,667\n \n5,343 \n6\nIndustrial chemicals & plastics\n647\n \n598 \n8\n1,900\n \n1,763 \n8\nMetals & minerals\n568\n \n529 \n7\n1,650\n \n1,574 \n5\nForest products\n327\n \n322 \n2\n988\n \n1,002 \n(1)\nEnergy & specialized markets\n652\n \n672 \n(3)\n1,950\n \n2,009 \n(3)\nIndustrial\n2,194\n \n2,121 \n3\n6,488\n \n6,348 \n2\nAutomotive\n604\n \n601 \n-\n1,817\n \n1,871 \n(3)\nIntermodal\n1,199\n \n1,241 \n(3)\n3,489\n \n3,460 \n1\nPremium\n1,803\n \n1,842 \n(2)\n5,306\n \n5,331 \n-\nTotal\n$\n5,927\n \n$\n5,768 \n3%\n$\n17,461\n \n$\n17,022 \n3%\nRevenue carloads\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\nThousands\n2025\n2024\nChange\n2025\n2024\nChange\nGrain & grain products\n215\n \n206 \n4%\n645\n \n616 \n5%\nFertilizer\n58\n \n53 \n9\n162\n \n162 \n-\nFood & refrigerated\n41\n \n45 \n(9)\n127\n \n137 \n(7)\nCoal & renewables\n216\n \n192 \n13\n606\n \n527 \n15\nBulk\n530\n \n496 \n7\n1,540\n \n1,442 \n7\nIndustrial chemicals & plastics\n182\n \n169 \n8\n528\n \n502 \n5\nMetals & minerals\n193\n \n186 \n4\n558\n \n540 \n3\nForest products\n52\n \n53 \n(2)\n155\n \n161 \n(4)\nEnergy & specialized markets\n147\n \n152 \n(3)\n439\n \n453 \n(3)\nIndustrial\n574\n \n560 \n3\n1,680\n \n1,656 \n1\nAutomotive\n199\n \n202 \n(1)\n603\n \n627 \n(4)\nIntermodal [a]\n860\n \n909 \n(5)\n2,551\n \n2,446 \n4\nPremium\n1,059\n \n1,111 \n(5)\n3,154\n \n3,073 \n3\nTotal\n2,163\n \n2,167 \n-%\n6,374\n \n6,171 \n3%\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\nAverage revenue per car\n2025\n2024\nChange\n2025\n2024\nChange\nGrain & grain products\n$\n4,532\n \n$\n4,498 \n1%\n$\n4,478\n \n$\n4,495 \n-%\nFertilizer\n3,875\n \n3,872 \n-\n \n3,929\n \n3,775 \n4\n \nFood & refrigerated\n6,306\n \n6,099 \n3\n \n6,199\n \n6,090 \n2\n \nCoal & renewables\n2,181\n \n2,101 \n4\n \n2,237\n \n2,147 \n4\n \nBulk\n3,641\n \n3,641 \n-\n \n3,680\n \n3,706 \n(1)\nIndustrial chemicals & plastics\n3,548\n \n3,534 \n-\n \n3,598\n \n3,509 \n3\n \nMetals & minerals\n2,944\n \n2,847 \n3\n \n2,959\n \n2,918 \n1\n \nForest products\n6,315\n \n6,157 \n3\n \n6,363\n \n6,235 \n2\n \nEnergy & specialized markets\n4,462\n \n4,415 \n1\n \n4,445\n \n4,431 \n-\n \nIndustrial\n3,828\n \n3,791 \n1\n \n3,863\n \n3,833 \n1\n \nAutomotive\n3,027\n \n2,968 \n2\n \n3,011\n \n2,983 \n1\n \nIntermodal [a]\n1,393\n \n1,365 \n2\n \n1,368\n \n1,414 \n(3)\nPremium\n1,701\n \n1,657 \n3\n \n1,682\n \n1,735 \n(3)\nAverage\n$\n2,740\n \n$\n2,662 \n3%\n$\n2,740\n \n$\n2,758 \n(1)%\n[a]\nFor intermodal shipments each container or trailer equals one carload.\n23\nTable of Contents\nBulk\n – Bulk includes shipments of grain and grain products, fertilizer, food and refrigerated, and coal and renewables. Freight revenues from bulk shipments increased in the third quarter and year-to-date periods of 2025 compared to 2024 due to 7% volume growth for both periods and core pricing gains, partially offset by business mix (from increased coal shipments) and lower fuel surcharge revenues. The volume increases\n were driven by higher demand for coal used in electricity generation due to higher natural gas prices and business wins and strength in grain and grain products from increased exports and soybean crush production. Lower food and refrigerated carloads partially offset the volume growth.\nIndustrial\n – Industrial includes shipments of industrial chemicals and plastics, metals and minerals, forest products, and energy and specialized markets. Freight revenues from industrial shipments increased in the third quarter and year-to-date periods of 2025 compared to 2024 due to core pricing gains and volume increases, partially offset by business mix and lower fuel surcharge revenues. Quarterly increases in plastics, industrial chemicals, and steel carloads more than offset the reduced iron ore (as a result of tariff uncertainties) and government carloads. Year-to-date volume growth in industrial chemicals, rock, and plastics was partially offset by lower iron ore, petroleum products, waste shipments, and lumber.\nPremium\n – Premium includes shipments of finished automobiles, automotive parts, and merchandise in intermodal containers, both domestic and interna\ntional. Premium freight revenues decreased 2% in the third quarter of 2025 compared to 2024 driven by 5% lower volumes, partially offset by business mix and core pricing gains. Third quarter of 2025 intermodal volumes were down 5% driven by a 17% reduction in international intermodal carloads, partially offset by strong domestic intermodal growth. In 2024, international intermodal benefited from heavy demand due to a trade flow shift from the East Coast and Canadian ports to the West Coast that have now shifted back to \nhistorical trade patterns\n. Automotive shipments decreased in the third quarter of 2025 compared to 2024 due to reduced production. For the year-to-date period of 2025 compared to 2024, premium freight revenues were flat as 3% volume increases and core pricing gains were offset by lower fuel surcharge revenues and business mix. Year-to-date intermodal volumes are up 4% driven by strong domestic intermodal growth in addition to elevated U.S. West Coast imports in the first half of 2025. Automotive shipments decreased in the year-to-date periods of 2025 compared to 2024 due to reduced production and tariff uncertainties in the first half of the year.\nMexico business\n – Freight revenue\ns from each of our commodity groups includes revenu\nes from shipments to and from Mexico, which increased 4% to $752 million in the third quarter of 2025 compared to 2024 driven by 4% volume growth due to increased intermodal and grain shipments, partially offset by lower beverage and steel shipments. For the year-to-date period of 2025, Mexico related freight revenues declined 2% on essentially flat volume driven by lower auto parts, finished vehicles, and beverage carloads, which offset growth in intermodal, grain, and petroleum product shipments.\nOperating expenses\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\nMillions\n2025\n2024\nChange\n2025\n2024\nChange\nCompensation and benefits\n1,214\n \n1,228 \n(1)%\n$\n3,675\n \n$\n3,638 \n1%\nPurchased services and materials\n683\n \n644 \n6\n \n1,956\n \n1,901 \n3\n \nDepreciation\n618\n \n602 \n3\n \n1,841\n \n1,792 \n3\n \nFuel\n616\n \n610 \n1\n \n1,795\n \n1,893 \n(5)\nEquipment and other rents\n212\n \n237 \n(11)\n683\n \n672 \n2\n \nOther\n352\n \n354 \n(1)\n1,030\n \n1,045 \n(1)\nTotal\n$\n3,695\n \n$\n3,675 \n1%\n$\n10,980\n \n$\n10,941 \n-%\nOperating expenses slightly increased compared to the third quarter and year-to-date periods of 2024 due to inflation, acquisition-related expenses (see Note 18 to the Condensed Consolidated Financial Statements, Item 1), and higher depreciation\n. These increases were partially offset by productivity and lower fuel prices. \nCompensation and benefits\n – Compensation and benefits include wages, payroll taxes, health and welfare costs, pension costs, and incentive costs. For the third quarter of 2025, compensation and benefits expense decreased 1% compared to 2024 due to lower employee levels, partially offset by wage inflation and higher incentive compensation. For the year-to-date period, compensation and benefits expense increased 1% compared to 2024 due to wage inflation, volume-related costs, a $55 million crew staffing agreement ratification charge, and higher incentive compensation, partially offset by lower employee levels. \n24\nTable of Contents\nPurchased services and materials\n – Expense for purchased services and materials includes the costs of services purchased from outside contractors and other service providers (including equipment maintenance and contract expense incurred by our subsidiaries for external transportation services); materials used to maintain the Railroad’s lines, structures, and equipment; costs of operating facilities jointly used by UPRR and other railroads; transportation and lodging for train crew employees; trucking and contracting costs for intermodal containers; leased automobile maintenance expense; and tools and supplies. Purchased services and materials increased 6% and 3%, respectively, in the third quarter and year-to-date periods of 2025 compared to 2024 driven by acquisition-related expenses, inflation, and an increase in derailment related expenses, offset by lower costs associated with improved locomotive productivity. The year-to-date period was also impacted by higher volume related cost and a 2024 favorable contract settlement.\nDepreciation\n – The majority of depreciation relates to road property, including rail, ties, ballast, and other track material. Depreciation expense increased 3% for both the third quarter and year-to-date periods of 2025 compared to 2024 driven by a higher depreciable asset base.\nFuel \n– Fuel includes locomotive fuel and gasoline for highway and non-highway vehicles and heavy equipment. Fuel expense increased in the third quarter of 2025 compared to the same period in 2024 driven by an increase in gross ton-miles, partially offset by a decrease in locomotive diesel fuel prices and an improvement in the fuel consumption rate (computed as gallons of fuel consumed divided by gross ton-miles in thousands). For the year-to-date period of 2025, fuel expense decreased compared to 2024 driven by lower fuel prices and an improvement in the fuel consumption rate, partially offset by increased gross ton-miles. Locomotive diesel fuel prices averaged $2.56 and $2.60 per gallon (including taxes and transportation costs) in the third quarter of 2025 and 2024, respectively. For the year-to-date period, locomotive diesel fuel prices averaged $2.49 per gallon in 2025 compared to $2.71 per gallon in 2024. \nEquipment and other rents\n – Equipment and other rents expense primarily includes rental expense that the Railroad pays for freight cars owned by other railroads or private companies; freight car, intermodal, and locomotive leases; and office and other rent expense, offset by equity income \nfrom certain equity method investments. Equipment and other rents expense decreased 11% in the third quarter of 2025 driven by favorable contract settlements, improved cycle times, \nand lower car hire related to the year-over-year decline in international intermodal demand,\n partially offset by lower equity income. The year-to-date period of 2025 compared to 2024 increased 2% driven by increased car hire for autoracks, \nhigher demand for business utilizing freight cars owned by others (mainly intermodal), inflation, and lower equity income, partially offset by lower operating equipment lease expense\n.\nOther \n– Other expense includes state and local taxes; freight, equipment, and property damage; utilities; insurance; personal injury; environmental remediation; employee travel; telephone and cellular; computer software; bad debt; and other general expenses. Other expense decreased 1% in the third quarter and year-to-date periods of 2025 compared to 2024 driven by lower environmental remediation and freight loss and damage costs, partially offset by higher state and local taxes. The year-to-date period was also negatively impacted by the 2024 gain on the sale of intermodal equipment.\nNon operating items\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\nMillions\n2025\n2024\nChange\n2025\n2024\nChange\nOther income, net\n$\n96\n \n$\n87 \n10%\n$\n297\n \n$\n282 \n5%\nInterest expense\n(327)\n(314)\n4\n \n(984)\n(957)\n3\n \nIncome tax expense\n(530)\n(518)\n2\n \n(1,468)\n(1,528)\n(4)\nOther income, net\n – Other income increased in the third quarter and year-to-date periods of 2025 compared to 2024 driven by higher real estate income. The year-to-date period of 2025 was also negatively impacted by the interest received in the second quarter of 2024 from the IRS on refund claims. See Note 6 to the Condensed Consolidated Financial Statements, Item 1, for additional detail. \nInterest expense\n – Interest expense increased in the third quarter and year-to-date periods of 2025 compared to 2024 as a result of higher effective interest rates and higher weighted-average debt levels. The effective interest rate for both 2025 periods was 4.1% compared to 4.0% for both periods in 2024. The weighted-average debt levels were $32.2 billion and $31.4 billion for third quarter of 2025 and 2024, respectively, and $32.2 billion and $31.8 billion for the year-to-date periods of 2025 and 2024, respectively.\n25\nTable of Contents\nIncome tax expense\n – Income tax expense increased 2% in the third quarter of 2025 compared to 2024 due to higher pre-tax income and decreased 4% in the year-to-date period compared to 2024. In the second quarter of 2025, the state of Kansas enacted legislation modifying the corporate income tax apportionment formula for future years resulting in a $115 million reduction of our deferred tax expense. In the second quarter of 2024, the state of Arkansas enacted legislation to reduce its corporate income tax rate for future years resulting in an $8 million reduction of our deferred tax expense. Our effective tax rates were 22.9% and 23.7% for the third quarter of 2025 and 2024, respectively, and 21.7% and 23.5% for the year-to-date periods of 2025 and 2024, respectively.\nOTHER OPERATING/PERFORMANCE AND FINANCIAL STATISTICS\nWe report a number of key performance measures weekly to the STB. We provide these on our website at https://investor.unionpacific.com/key-performance-metrics.\nOperating/performance statistics\nManagement continuously monitors these key operating metrics to evaluate our operational efficiency in striving to deliver the service product we sold to our customers.\nRailroad performance measures are included in the table below:\nThree months ended\nSeptember 30,\nNine months ended\nSeptember 30,\n2025\n2024\nChange\n2025\n2024\nChange\nGross ton-miles (GTMs) (billions)\n223.0\n216.0\n3%\n656.1\n628.8\n4%\nRevenue ton-miles (billions)\n108.9\n104.0\n5\n \n320.4\n305.3\n5\n \nFreight car velocity (daily miles per car)\n226\n210\n8\n \n220\n205\n7\n \nAverage train speed (miles per hour) [a]\n24.2\n23.3\n4\n \n23.9\n23.5\n2\n \nAverage terminal dwell time (hours) [a]\n20.4\n22.4\n(9)\n21.3\n22.8\n(7)\nLocomotive productivity (GTMs per horsepower day)\n140\n135\n4\n \n139\n135\n3\n \nTrain length (feet)\n9,801\n9,580\n2\n \n9,661\n9,472\n2\n \nIntermodal service performance index (%)\n98\n \n86 \n12 pts\n97\n \n90 \n7 pts\nManifest service performance index (%)\n100\n \n89 \n11 pts\n98\n \n87 \n11 pts\nWorkforce productivity (car miles per employee)\n1,165\n1,102\n6\n \n1,126\n1,044\n8\n \nTotal employees (average)\n28,871\n29,946\n(4)\n29,576\n30,518\n(3)\nOperating ratio (%)\n59.2\n \n60.3 \n(1.1) pts\n59.6\n \n60.4 \n(0.8) pts\n[a]\nAs reported to the STB.\nGross and revenue ton-miles\n – Gross ton-miles are calculated by multiplying the weight of loaded and empty freight cars by the \nnumber of miles hauled. Revenue ton-miles are calculated by multiplying the weight of freight by the number of rate miles. Gross ton-miles and revenue ton-miles increased 3% and 5%, respectively, in the third quarter of 2025 compared to 2024, while corresponding carloads were flat. For the year-to-date period, gross ton-miles, revenue ton-miles, and carloads increased 4%, 5%, and 3%, respectively, compared to 2024. Changes in business mix drove the variances between gross ton-miles, revenue ton-miles, and carloads due to higher coal shipments that are generally heavier. \nFreight car velocity\n – Freight car velocity measures the average daily miles per car on our network. The two key drivers of this metric are the speed of the train between terminals (average train speed) and the time a rail car spends at the terminals (average terminal dwell time). Freight car velocity increased 8% and 7%, respectively, in the third quarter and year-to-date periods of 2025 compared to 2024 driven by improvements in terminal dwell and train speed.\nLocomotive productivity\n – Locomotive productivity is gross ton-miles per average daily locomotive horsepower available. Locomotive productivity increased 4% and 3% in the third quarter and year-to-date periods of 2025, respectively, driven by improved network fluidity and asset utilization.\nTrain length\n – Train length is the average maximum train length on a route measured in feet. Our train length increased 2% in both the third quarter and year-to-date periods of 2025 compared to 2024 due to train length improvement initiatives, specifically driven by increased coal and grain train volume moving on longer trains.\n26\nTable of Contents\nService performance index (SPI)\n – SPI is a ratio of the service customers are currently receiving relative to the best monthly performance over the last three years. Measuring our performance relative to a historical benchmark demonstrates our focus on continuously improving service for our customers. Our SPI is calculated for intermodal and manifest products. Intermodal SPI improved 12 and 7 points, respectively, in the third quarter and year-to-date periods of 2025 compared to 2024, while we adjusted to changing intermodal demand levels as volumes were down 5% during the third quarter and up 4% for the year-to-date period. Manifest SPI improved 11 points in both the third quarter and year-to-date periods of 2025 compared to 2024 driven by improved network fluidity, while we handled higher volume.\nWorkforce productivity\n – Workforce productivity is average daily car miles per employee. Workforce productivity improved 6% in the third quarter and 8% in the year-to-date periods of 2025 compared to 2024, respectively, as average daily car miles increased 2% and 5%, respectively, while employees decreased 4% and 3%, respectively, compared to 2024. We continually align our active train, engine, and yard (TE&Y) workforce to meet customer needs in a dynamic demand environment, while maintaining operational fluidity. As a result, our active TE&Y decreased 4% during the third quarter of 2025 on slightly negative volume levels compared to the same period in 2024. For the year-to-date period of 2025, we were able to handle 3% more volume with 2% fewer active TE&Y employees over the same period. \nOperating ratio\n – Operating ratio is our operating expe\nnses reflected as a percentage of operating revenues. For the third quarter of 2025, our operating ratio of 59.2% improved \n1.1\n points driven by productivity initiatives and core pricing gains, partially offset by inflation, and acquisition-related expenses. For the year-to-date period of 2025 compared to 2024, our operating ratio improved \n0.8\n points to 59.6% as a result of core pricing gains, productivity, and volume growth which more than offset the impact of unfavorable business mix, inflation, the year-over-year impact of changes in fuel price, a crew staffing agreement ratification charge in the second quarter of 2025, and acquisition-related expenses. In addition, the year-to-date period was negatively impacted by a gain on the sale of intermodal equipment in the second quarter of 2024 and contract settlements in the first quarter of 2024. \nDebt / net income\nMillions, except ratios\nfor the trailing twelve months ended [1]\nSep. 30,\n2025\nDec. 31,\n2024\nDebt\n$\n31,807\n \n$\n31,192 \nNet income\n7,052\n \n6,747 \nDebt / net income\n4.5\n4.6\nAdjusted debt / adjusted EBITDA\nMillions, except ratios\nfor the trailing twelve months ended [1]\nSep. 30,\n2025\nDec. 31,\n2024\nNet income\n$\n7,052\n \n$\n6,747 \nAdd:\nIncome tax expense\n1,987\n \n2,047 \nDepreciation\n2,447\n \n2,398 \nInterest expense\n1,296\n \n1,269 \nEBITDA\n$\n12,782\n \n$\n12,461 \nAdjustments:\nOther income, net\n(365)\n(350)\nInterest on operating lease liabilities [2]\n42\n \n48 \nAdjusted EBITDA (a)\n$\n12,459\n \n$\n12,159 \nDebt\n$\n31,807\n \n$\n31,192 \nOperating lease liabilities\n1,041\n \n1,271 \nAdjusted debt (b)\n$\n32,848\n \n$\n32,463 \nAdjusted debt / adjusted EBITDA (b/a)\n2.6\n2.7\n[1]\nThe trailing twelve months income statement information ended September 30, 2025, is recalculated by taking the twelve months ended December 31, 2024, subtracting the nine months ended September 30, 2024, and adding the nine months ended September 30, 2025.\n[2]\nRepresents the hypothetical interest expense we would incur (using the incremental borrowing rate) if the property under our operating leases were owned or accounted for as finance leases.\n27\nTable of Contents\nAdjusted debt (total debt plus operating lease liabilities plus after-tax unfunded pension and OPEB (other post-retirement benefit) obligations) to adjusted EBITDA (earnings before interest, taxes, depreciation, amortization, and adjustments for other income and interest on present value of operating leases) is considered a non-GAAP financial measure by SEC Regulation G and Item 10 of SEC Regulation S-K and may not be defined and calculated by other companies in the same manner. We believe this measure is important to management and investors in evaluating the Company’s ability to sustain given debt levels (including leases) with the cash generated from operations. In addition, a comparable measure is used by rating agencies when reviewing the Company’s credit rating. Adjusted debt to adjusted EBITDA should be considered in addition to, rather than as a substitute for, other information provided in accordance with GAAP. The most comparable GAAP measure is debt to net income ratio. The tables above provide reconciliations from net income to adjusted EBITDA, debt to adjusted debt, and debt to net income to adjusted debt to adjusted EBITDA. At September 30, 2025, and December 31, 2024, the incremental borrowing rate on operating leases was 4.0%\n and \n3.8%, respectively. Pension and OPEB were funded at September 30, 2025, and December 31, 2024.\nLIQUIDITY AND CAPITAL RESOURCES\nFinancial condition\nCash flows\nMillions, for the nine months ended September 30,\n2025\n2024\nCash provided by operating activities\n$\n7,065\n \n$\n6,684 \nCash used in investing activities\n(2,791)\n(2,426)\nCash used in financing activities\n(4,472)\n(4,375)\nNet change in cash, cash equivalents, and restricted cash\n$\n(198)\n$\n(117)\nOperating activities\nCash provided by operating activities increased in the first nine months of 2025 compared to the same period of 2024 driven by higher net income and lower income taxes paid.\nOn July 4, 2025, H.R.1 was enacted that makes key elements of the 2017 Tax Cuts and Jobs Act permanent, including provisions for 100% bonus depreciation on qualified property and fully expensing internally developed software, which has favorable impacts to our current and future cash provided by operating activities.\nInvesting activities\nCash used in investing activities increased in the first nine months of 2025 compared to the same period of 2024 driven by the timing of capital investments, including an increase in early lease buyouts, and lower proceeds from a 2024 sale of intermodal equipment.\nThe table below details cash capital investments:\nMillions, for the nine months ended September 30,\n2025\n2024\nRail and other track material\n$\n395\n \n$\n373 \nTies\n447\n \n369 \nBallast\n158\n \n145 \nOther [a]\n474\n \n480 \nTotal road infrastructure replacements\n1,474\n \n1,367 \nLine expansion and other capacity projects\n184\n \n137 \nCommercial facilities\n251\n \n196 \nTotal capacity and commercial facilities\n435\n \n333 \nLocomotives and freight cars [b]\n642\n \n643 \nTechnology and other\n241\n \n187 \nTotal cash capital investments [c]\n$\n2,792\n \n$\n2,530 \n[a]\nOther includes bridges and tunnels, signals, other road assets, and road work equipment.\n[b]\nLocomotives and freight cars include early lease buyouts of $311 million in 2025 and $96 million in 2024.\n[c]\nWeather-related damages for the nine months ended September 30, 2025 and 2024, are immaterial. \n28\nTable of Contents\nSee Note 18 of the Condensed Consolidated Financial Statements, Item 1, for the pending acquisition of Norfolk Southern.\nCapital plan\nIn 2025, we expect our capital plan to be approximately $3.4 billion, consistent with 2024. We plan to continue to make investments to support our growth strategy, improve the safety, resiliency, and operational efficiency of the network, harden our infrastructure, and replace older assets, including modernization of our locomotive fleet and acquiring freight cars to support replacement and growth opportunities. In addition, the plan includes investments in growth-related projects to drive more carloads to the network and enhance productivity. This includes siding construction and extension projects, terminal investments supporting our manifest network, and investments in certain ramps to efficiently handle volume from new and existing intermodal customers. The capital plan may be revised if business conditions warrant or if laws or regulations affect our ability to generate sufficient returns on these investments.\nFinancing activities\nCash used in financing activities increased in the first nine months of 2025 compared to the same period of 2024 driven by more share repurchases, including the 2025 accelerated share repurchase programs, partially offset by an increase of debt issued and less debt repaid.\nSee Note 14 of the Condensed Consolidated Financial Statements, Item 1, for a description of all our outstanding financing arrangements and significant new borrowings, Note 16 of the Condensed Consolidated Financial Statements, Item 1, for a description of our share repurchase programs, and Note 18 of the Condensed Consolidated Financial Statements, Item 1, for the pending acquisition of Norfolk Southern.\nFree cash flow\n – Free cash flow is defined as cash provided by operating activities less cash used in investing activities and dividends paid. Cash flow conversion rate is defined as cash provided by operating activities less cash used for capital investments as a ratio of net income.\nFree cash flow and cash flow conversion rate are considered non-GAAP financial measures by SEC Regulation G and Item 10 of SEC Regulation S-K and may not be defined and calculated by other companies in the same manner. We believe free cash flow and cash flow conversion rate are important to management and investors in evaluating our financial performance and measures our ability to generate cash without additional external financing. Free cash flow and cash flow conversion rate should be considered in addition to, rather than as a substitute for, cash provided by operating activities.\nThe following table reconciles cash provided by operating activities (GAAP measure) to free cash flow (non-GAAP measure):\nMillions, for the nine months ended September 30,\n2025\n2024\nCash provided by operating activities\n$\n7,065\n \n$\n6,684 \nCash used in investing activities\n(2,791)\n(2,426)\nDividends paid\n(2,418)\n(2,403)\nFree cash flow\n$\n1,856\n \n$\n1,855 \nThe following table reconciles cash provided by operating activities (GAAP measure) to cash flow conversion rate (non-GAAP measure):\nMillions, except percentages, for the nine months ended September 30,\n2025\n2024\nCash provided by operating activities\n$\n7,065\n \n$\n6,684 \nCash used in capital investments\n(2,792)\n(2,530)\nTotal (a)\n$\n4,273\n \n$\n4,154 \nNet income (b)\n$\n5,290\n \n$\n4,985 \nCash flow conversion rate (a/b)\n81%\n83%\nCurrent liquidity status\nWe are continually evaluating our financial condition and liquidity. We analyze a wide range of economic scenarios and the impact on our ability to generate cash. These analyses inform our liquidity plans and activities outlined below and indicate we have sufficient borrowing capacity to sustain an extended period of lower volume.\n29\nTable of Contents\nDuring the third quarter of 2025, we generated $2.5 billion of cash provided by operating activities and paid our quarterly dividend. Also within the third quarter of 2025, we announced the pending acquisition of Norfolk Southern described in Note 18 of the Condensed Consolidated Financial Statements, Item 1, and paused our share repurchase program. On September 30, 2025, we had $808 million of cash and cash equivalents, $2.0 billion of credit available under our revolving credit facility, and up to $600 million undrawn on the Receivables Facility. We have been, and we expect to continue to be, in compliance with our debt covenants.\nAs described in the notes to the Condensed Consolidated Financial Statements and as referenced in the table below, we have contractual obligations that may affect our financial condition. Based on our assessment of the underlying provisions and circumstances of our contractual obligations, other than the risks that we and other similarly situated companies face with respect to the condition of the capital markets, as of the date of this filing, there is no known trend, demand, commitment, event, or uncertainty that is reasonably likely to occur that would have a material adverse effect on our consolidated results of operations, financial condition, or liquidity. In addition, our commercial obligations, financings, and commitments are customary transactions that are like those of other comparable corporations, particularly within the transportation industry.\nThe following table identifies material contractual obligations as of September 30, 2025:\nOct. 1, through Dec. 31, 2025\nPayments Due by Dec. 31,\nMillions\nTotal\n2026\n2027\n2028\n2029\nAfter 2029\nDebt [a]\n$\n59,635 \n$\n212 \n$\n2,724 \n$\n2,455 \n$\n2,401 \n$\n2,360 \n$\n49,483 \nPurchase obligations [b]\n1,582 \n199 \n804 \n258 \n187 \n126 \n8 \nOperating leases [c]\n1,166 \n55 \n273 \n236 \n188 \n121 \n293 \nOther post-retirement benefits [d]\n349 \n10 \n39 \n38 \n38 \n38 \n186 \nFinance lease obligations [e]\n117 \n4 \n42 \n36 \n14 \n21 \n- \nTotal contractual obligations\n$\n62,849 \n$\n480 \n$\n3,882 \n$\n3,023 \n$\n2,828 \n$\n2,666 \n$\n49,970 \n[a]\nExcludes finance lease obligations of $108 million as well as unamortized discount and deferred issuance costs of ($1,688) million. Includes an interest component of $26,248 million.\n[b]\nPurchase obligations include locomotive maintenance contracts; purchase commitments for ties, ballast, and rail; and agreements to purchase other goods and services.\n[c]\nIncludes leases for locomotives, freight cars, other equipment, and real estate. Includes an interest component of $125 million.\n[d]\nIncludes estimated other post-retirement, medical, and life insurance payments and payments made under the unfunded pension plan for the next ten years.\n[e]\nRepresents total obligations, including interest component of $9 million.\nOTHER MATTERS\nAsserted and unasserted claims\n – See Note 15 to the Condensed Consolidated Financial Statements, Item 1.\nIndemnities\n – See Note 15 to the Condensed Consolidated Financial Statements, Item 1.\nPending Acquisition \n– See Note 18 to the Condensed Consolidated Financial Statements, Item 1, and the Agreement and Plan of Merger dated as of July 28, 2025, by and among UPC, Ruby Merger Sub 1 Corporation, Ruby Merger Sub 2 LLC, and Norfolk Southern, which is incorporated herein by reference to Exhibit 2.1 to the Corporation’s Current Report on Form 8-K dated July 29, 2025.\n30\nTable of Contents\nCAUTIONARY INFORMATION\nCertain statements in this report, and statements in other reports or information filed or to be filed with the SEC (as well as information included in oral statements or other written statements made or to be made by us), are, or will be, forward-looking statements as defined by the Securities Act of 1933 and the Securities Exchange Act of 1934. These forward-looking statements and information include, without limitation, statements and information set forth under the captions “Liquidity and Capital Resources” regarding our capital plan, share repurchase programs, contractual obligations, and \"Other Matters\" in this Item 2 of Part I. Forward-looking statements and information also include any other statements or information in this report (including information incorporated herein by reference) regarding: the merger agreement and the transactions contemplated therein (described in Note 18 to the Condensed Consolidated Financial Statements, Item 1), potential impacts of public health crises, including pandemics, epidemics, and the outbreak of other contagious disease, such as the coronavirus and its variant strains (COVID); the Russia-Ukraine and Israel-Hamas wars and other geopolitical tensions in the Middle East, and any impacts on our business operations, financial results, liquidity, and financial position, and on the world economy (including customers, employees, and supply chains), including as a result of fluctuations in volume and carloadings; closing of customer manufacturing, distribution or production facilities; expectations as to operational or service improvements; expectations as to hiring challenges; availability of employees; expectations regarding the effectiveness of steps taken or to be taken to improve operations, service, infrastructure improvements, and transportation plan modifications (including those discussed in response to increased traffic); expectations as to cost savings, revenue growth, and earnings; the time by which goals, targets, aspirations, or objectives will be achieved; projections, predictions, expectations, estimates, or forecasts as to our business, financial, and operational results, future economic performance, and general economic conditions; proposed new products and services; estimates of costs relating to environmental remediation and restoration; estimates and expectations regarding tax matters; estimates and expectations regarding current or potential tariffs; potential impacts of H.R.1, which was enacted on July 4, 2025; expectations that claims, litigation, environmental costs, commitments, contingent liabilities, labor negotiations or agreements, cyber-attacks, or other matters will not have a material adverse effect on our consolidated results of operations, financial condition, or liquidity and any other similar expressions concerning matters that are not historical facts. Forward-looking statements may be identified by their use of forward-looking terminology, such as “believes,” “expects,” “may,” “should,” “would,” “will,” “intends,” “plans,” “estimates,” “anticipates,” “projects,” and similar words, phrases, or expressions.\nForward-looking statements should not be read as a guarantee of future performance, results, or outcomes, and will not necessarily be accurate indications of the times that, or by which, such performance, results, or outcomes will be achieved, if ever. Forward-looking statements and information are subject to risks and uncertainties that could cause actual performance or results to differ materially from those expressed in the statements and information. Forward-looking statements and information reflect the good faith consideration by management of currently available information, and may be based on underlying assumptions believed to be reasonable under the circumstances. However, such information and assumptions (and, therefore, such forward-looking statements and information) are or may be subject to variables or unknown or unforeseeable events or circumstances over which management has little or no influence or control, and many of these risks and uncertainties are currently amplified by and may continue to be amplified by, or in the future may be amplified by, among other things, macroeconomic and geopolitical conditions.\nThe Risk Factors in Item 1A of our 2024 Annual Report on Form 10-K, filed February 7, 2025, as well as the risk factors disclosed in the \"Risk Factors\" section of the joint proxy statement/prospectus contained in our registration statement on Form S-4 (File No. 333-290282), as amended by our definitive proxy statement filed with the SEC on October 1, 2025, could affect our future results and could cause those results or other outcomes to differ materially from those expressed or implied in any forward-looking statements or information. To the extent circumstances require or we deem it otherwise necessary, we will update or amend these risk factors in a Form 10-Q, Form 8-K, or subsequent Form 10-K. All forward-looking statements are qualified by, and should be read in conjunction with, these Risk Factors. \nForward-looking statements speak only as of the date the statement was made. We assume no obligation to update forward looking information to reflect actual results, changes in assumptions, or changes in other factors affecting forward-looking information. If we do update one or more forward-looking statements, no inference should be drawn that we will make additional updates with respect thereto or with respect to other forward-looking statements.\n31\nTable of Contents\nAVAILABLE INFORMATION\nOur Internet website is www.up.com. We make available free of charge on our website (under the “Investors” caption link) our Annual Reports on Form 10-K; our Quarterly Reports on Form 10-Q; our current reports on Form 8-K; our proxy statements; Forms 3, 4, and 5, filed on behalf of directors and certain executive officers; and amendments to such reports filed or furnished pursuant to the Securities Exchange Act of 1934, as amended (the Exchange Act). We provide these reports and statements as soon as reasonably practicable after such material is electronically filed with, or furnished to, the SEC. We also make available on our website previously filed SEC reports and exhibits via a link to EDGAR on the SEC’s Internet site at www.sec.gov. We provide these previously filed reports as a convenience and their contents reflect only information that was true and correct as of the date of the report. We assume no obligation to update this historical information. Additionally, our corporate governance materials, including By-Laws, Board Committee charters, governance guidelines and policies, and codes of conduct and ethics for directors, officers, and employees are available on our website. From time to time, the corporate governance materials on our website may be updated as necessary to comply with rules issued by the SEC and the New York Stock Exchange or as desirable to promote the effective and efficient governance of our Company. Any security holder wishing to receive, without charge, a copy of any of our SEC filings or corporate governance materials should send a written request to: Secretary, Union Pacific Corporation, 1400 Douglas Street, Omaha, NE 68179.\nReferences to our website address in this report, including references in Management’s Discussion and Analysis of Financial Condition and Results of Operations, Item 2, are provided as a convenience and do not constitute, and should not be deemed, an incorporation by reference of the information contained on, or available through, the website. Therefore, such information should not be considered part of this report."
}