{
  "source_file": "ups-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\nBusiness\nOverview\nUnited Parcel Service, Inc. (\"UPS\"), founded in 1907, is a global package delivery and logistics provider. We offer a broad range of industry-leading products and services through our extensive global presence, serving over 200 countries and territories. Our services include transportation and delivery through our integrated air and ground network, distribution, contract logistics, ocean freight, airfreight, customs brokerage and insurance. In 2024, we delivered an average of 22.4 million packages per day, totaling 5.7 billion packages during the year. Total revenue in 2024 was $91.1 billion.\nStrategy\nOur strategy focuses on growing in the parts of our market that value our end-to-end network, including healthcare, business to business (“B2B”), small- and medium-sized businesses (“SMBs”), and international. We are continuing our journey to execute our \nCustomer First, People Led, Innovation Driven\n strategy. \nCustomer First\n is about reducing friction in the customer experience by anticipating and solving for customers' needs. We are focused on providing differentiated value through our capabilities and service. We strive to enable our customers to better compete and succeed by delivering what they tell us matters the most: speed, ease and service reliability.\nPeople Led\n focuses on our employee experience and how likely an employee is to recommend UPS employment to a friend or family member. We know successful outcomes are built from a strong culture and sense of partnership. We believe that when we take care of our people, they will take care of our customers. \nInnovation Driven\n is our focus on leveraging technology to optimize the volume that flows through our network. We continually seek to improve the productivity and efficiency of our global integrated network by using technology to move from a scanning to a sensing network, including using RFID technology in our\n Smart Package Smart Facilities\n.\n1\nIn the first quarter of 2025, we entered into an agreement in principle with our largest customer to significantly reduce the volume we deliver for them. We are making a deliberate shift to increase our focus on growing higher yielding volume. For additional information on the expected operational and financial impacts of this agreement, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations”.\nCompetitive Strengths\nOur competitive strengths include:\nGlobal Smart Logistics Network\n. We believe that our integrated global air and ground network is the most extensive in the industry. We provide all types of package services (air, ground, domestic, international, commercial and residential) through a single pickup and delivery network that can be configured to meet customers' needs. Our sophisticated systems, including our RFID-enabled \nSmart Package Smart Facility\n technology, enable us to optimize network efficiency, asset utilization and enhance end-to-end visibility.\nGlobal Presence\n. We serve more than 200 countries and territories. We have a significant presence in all of the world’s major economies, allowing us to effectively and efficiently operate around the world.\nCutting-Edge Technologies\n. We are a global leader in developing technologies that help customers enhance their shipping and logistics business processes to lower costs, improve service and increase efficiency. We offer a variety of digital tools and capabilities that enable customers to integrate UPS functionality into their distribution channels, intended to deepen customer relationships. These tools allow customers to send, manage and track their shipments, and also provide their customers with value-added data about their shipments.\nBroad Portfolio of Services\n. Our service portfolio allows customers of all sizes to choose their most appropriate option. Increasingly, our customers benefit from UPS capabilities and solutions that integrate our services beyond package delivery. We continue to invest in specialized capabilities like our cold chain and thermal monitoring technologies, which we believe allow us to better serve our healthcare customers.\nCustomer Relationships\n. We focus on building and maintaining long-term customer relationships. We believe value-added services beyond package delivery and connecting our small package, supply chain, digital and on-demand services across our customer base, are important to customer retention and growth.\nBrand Equity\n. We have built a leading and trusted brand that stands for service quality, reliability and innovation. Our vehicles and the professional courtesy of our drivers are major contributors to our brand equity.\nDistinctive Culture\n. We believe that the dedication of our employees comes in large part from our strong, purpose-driven culture that fosters trust, partnership and empowerment. We encourage our people to bring their unique perspectives, background, talents and skills to work every day. \nFinancial Strength\n. Our financial strength allows us to continue to pursue strategic opportunities that facilitate our growth. This includes investing in digital technology, acquisitions, transportation equipment, facilities and employee development to generate value for shareholders. We seek to maintain a strong credit rating to give us additional flexibility in running the business.\nProducts and Services; Reporting Segments \nWe have two reporting segments: U.S. Domestic Package and International Package. Our remaining businesses are reported as Supply Chain Solutions. U.S. Domestic Package and International Package are together referred to as our global small package operations.\nGlobal Small Package\nOur global small package operations provide time-definite delivery services for express letters, documents, packages and palletized freight via air and ground services. These services are supported by numerous shipping, visibility and billing technologies including our Digital Access Program, which embeds our shipping solutions directly into leading e-commerce platforms, enabling us to reach SMBs and e-commerce markets more broadly.\nWe combine all packages within our single, global network, unless dictated by specific service commitments. This enables efficiently scheduled pick ups for any service level. Our network provides unique operational and capital efficiencies that also have a smaller environmental impact than single service network designs.\n2\nWe offer same-day pickup of air and ground packages seven days a week through a broad variety of network access points including, UPS drop boxes, UPS Access Point locations and The UPS Store locations. UPS drivers can also directly accept packages. \nWe offer a portfolio of returns services in approximately 150 countries. These returns services are driven by the continued prevalence of e-commerce that has increased our customers' needs for efficient and reliable returns and are designed to promote efficiency and a friction-free consumer experience.\nOur global air operations hub is located in Louisville, Kentucky, and is supported by air hubs across the United States (\"U.S.\") and internationally. We operate international air hubs in Germany, China, Hong Kong, Canada and Florida (for Latin America and the Caribbean). This design enables cost-effective package processing using fewer, larger and more fuel-efficient aircraft.\nU.S. Domestic Package\nWe are a leader in time-definite, guaranteed small package delivery services in the United States. We offer a full spectrum of U.S. domestic air and ground package transportation services. Our U.S. ground fleet serves all business and residential zip codes in the contiguous United States. \n•\nOur air portfolio offers time-definite, same-day, next-day, two-day and three-day delivery alternatives as well as air cargo services.\n•\nOur ground network enables customers to ship using our day-definite ground service. We deliver approximately 16 million ground packages per day, most within one to three business days.\n•\nUPS SurePost provides residential ground service for customers with non-urgent, lightweight residential shipments. Through 2024, final delivery was often provided by the United States Postal Service (\"USPS\"). Beginning January 1, 2025, in order to have more control over our ability to provide our customers industry-leading service, we have insourced this product. For additional information, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations”.\nInternational Package\nInternational Package consists of our small package operations in Europe, the Indian sub-continent, Middle East and Africa (together \"EMEA\"), Canada and Latin America (together \"Americas\") and Asia. We offer a wide selection of guaranteed day- and time-definite international shipping services.\nFor international package shipments that do not require express services, UPS Worldwide Expedited offers a reliable, deferred, day-definite service option. For cross-border ground package delivery, we offer UPS Standard delivery services within Europe, between the U.S. and Canada, and between the U.S. and Mexico. Worldwide Economy offers a contract-only, e-commerce solution for non-urgent, cross-border shipments. UPS Worldwide Express Freight is a premium international service for urgent, palletized shipments over 150 pounds.\nSupply Chain Solutions\nSupply Chain Solutions consists of our forwarding, logistics, digital and other businesses. Serving more than 200 countries and territories, we strategically seek to provide integration across increasingly complex, specialized and fragmented supply chains.\nForwarding\nWe are one of the largest U.S. domestic airfreight carriers and airfreight forwarders globally. We offer a portfolio of guaranteed and non-guaranteed global airfreight services. Additionally, as one of the world’s leading non-vessel operating common carriers, we provide ocean freight full container load, less-than-container load and multimodal transportation services between most major ports around the world. We also provide customs brokerage as well as various related services. \nIn September 2024, we completed the divestiture of our truckload brokerage business (\"Coyote\"). For additional information on this divestiture, see note 8 to the audited, consolidated financial statements.\nLogistics\nOur global logistics and distribution business provides value-added fulfillment and transportation management services. We operate both multi-client and dedicated facilities across our network, many of which are strategically located near UPS air \n3\nand ground transportation hubs to support rapid delivery to business and consumer markets. We continue to invest in facility automation to enhance operational efficiency.\nWe offer world-class technology, deep expertise and a highly sophisticated suite of healthcare logistics services. With a strategic focus on serving the unique, priority-handling needs of healthcare and life sciences customers, we continue to increase our complex cold-chain logistics capabilities both in the U.S. and internationally. In furtherance of this strategy, we have continued to grow organically, making investments in facilities to expand our network, and inorganically, including through the acquisitions of Frigo-Trans and Biotech & Pharma Logistics in January 2025.\nDigital and other Supply Chain Solutions businesses\nOur digital businesses leverage technology to enable a range of on-demand services. Roadie, our crowdsourced delivery platform, offers the convenience of same-day delivery and efficient service for packages that are not compatible with our small package network. Happy Returns offers innovative end-to-end return services that leverage The UPS Store network. We also offer integrated supply chain and high-value shipment insurance solutions through UPS Capital, as well as a range of services through our other Supply Chain Solutions businesses. We believe these services better enable us to meet customers' needs and deepen customer relationships.\nHuman Capital\nOur success is dependent upon our people, working together with a shared purpose. As we seek to capture new opportunities and pursue growth, we are focused on maintaining the culture we have cultivated over our nearly 118-year history and incorporating the new perspectives we need to take the business into the future.\nTo assist with employee recruitment and retention, we continue to review the competitiveness of our employee value proposition, including benefits and pay, training, talent development and advancement opportunities. For additional information on the importance of our human capital efforts, see \"Risk Factors - Business and Operating Risks -\n \nFailure to attract or retain qualified employees could materially adversely affect us\" and \"- Strikes, work stoppages or slowdowns by our employees could materially adversely affect us\".\nWe have approximately 490,000 employees (excluding temporary seasonal employees), of which 406,000 are in the U.S. and 84,000 are located internationally. Our global workforce includes approximately 78,000 management employees (38% of whom are part-time) and 412,000 hourly employees (50% of whom are part-time). More than 75% of our U.S. employees are represented by unions, primarily those employees handling or transporting packages. Many of these employees are employed under a national master agreement and various supplemental agreements with local unions affiliated with the International Brotherhood of Teamsters (\"Teamsters\"). Our national master agreement with the Teamsters expires on July 31, 2028. In addition, approximately 3,300 of our pilots are represented by the Independent Pilots Association (\"IPA\"). Our agreement with the IPA becomes amendable September 1, 2025. We have approximately 1,900 airline mechanics who are covered by a collective bargaining agreement with Teamsters Local 2727 which becomes amendable November 1, 2026. In addition, approximately 3,000 of our auto and maintenance mechanics who are not represented by the IBT are employed under a collective bargaining agreement with the International Association of Machinists and Aerospace Workers (\"IAM\"). In July 2024, the IAM ratified a new collective bargaining agreement that will expire on July 31, 2029.\nDuring 2024, we executed under our \"Fit to Serve\" initiative, intended to right-size our business and create a more efficient operating model to enhance responsiveness to changing market dynamics. During 2024, we reduced our workforce by approximately 14,000 positions, primarily within management. Fit to Serve is expected to conclude in 2025.\nIn January 2025, we announced a reconfiguration of our U.S. network and \nEfficiency Reimagined\n initiatives. We expect these actions to result in decreases in the size of our operational and management workforce. For additional information on the expected operational and financial impacts of these initiatives, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations”.\nOversight and management\nOur board, directly and through the Compensation and Human Capital Committee, is responsible for oversight of human capital matters. Effective oversight is accomplished through a variety of methods and processes including regular updates and discussions around human capital transformation efforts, technology initiatives impacting the workforce, health and safety matters, employee survey results related to culture and other matters, hiring and retention, employee backgrounds, labor relations and contract negotiations, compensation and benefits, succession planning and employee training initiatives.\n4\nIn addition, the Compensation and Human Capital Committee charter includes oversight responsibility for performance and talent management, workforce representation, work culture and employee development and retention. We believe the board’s oversight of these matters helps identify and mitigate exposure to labor and human capital management risks and is part of the broader framework that guides how we attract, retain and develop a workforce that aligns with our values and strategies.\nAdditional information on our human capital efforts is contained in our annual sustainability report, which describes our activities that support our commitment to acting responsibly and contributing to society. This report is available under the heading \"Our Impact\" at www.about.ups.com.\nCollective bargaining\nWe bargain in good faith with the unions that represent our employees. We frequently engage union leaders at the national level and at local chapters throughout the United States. We participate in works councils and associations outside the U.S., which allows us to respond to emerging issues abroad. This work helps our operations to build and maintain productive relationships with our employees. For additional information regarding employees employed under collective bargaining agreements, see note 6 to the audited, consolidated financial statements.\nEmployee health and safety\nWe seek to provide industry-leading employee health, safety and wellness programs across our workforce. UPS's Comprehensive Health and Safety Program (\"CHSP\") is an occupational health and safety system tailored to our varied operational environments. \nOur CHSP covers a wide array of roles, from package handling to administration, and spans geographical boundaries to include sorting facilities, mobile logistics, administrative offices, and other locations worldwide. UPS conducts audits to assess specific risks and hazards, including equipment safety, workplace environment, and emergency response protocols. We monitor our safety performance through various measurable targets, including recordable injury frequency, lost time injury frequency and the number of recorded auto accidents.\nCustomers\nBuilding and maintaining long-term customer relationships through superior service is a competitive strength of UPS. In 2024, we served 1.6 million shipping customers and more than 10.1 million delivery recipients daily. For the year ended December 31, 2024, one customer, Amazon.com, Inc. and its affiliates, represented approximately 11.8% of our consolidated revenues, substantially all of which was within our U.S. Domestic Package segment. In the first quarter of 2025, we entered into an agreement in principle with this customer that will provide for a reduction in their volume by more than 50% by June 2026. For additional information on the expected operational and financial impacts arising from this agreement, see “Management’s Discussion and Analysis of Financial Condition and Results of Operations”. For additional information on this and other customers, see \"Risk Factors - Business and Operating Risks - Changes in our relationships with any of our significant customers, including the loss or reduction in business from one or more of them, could have a material adverse effect on us\" and note 14 to the audited, consolidated financial statements.\nCompetition\nWe offer a broad array of transportation and logistics services and compete with many local, regional, national and international logistics providers as well as national postal services. We believe our strategy, network and competitive strengths position us well to compete in the marketplace. For additional information on our competitive environment, see \"Risk Factors - Business and Operating Risks - Our industry is rapidly evolving. We expect to continue to face significant competition, which could materially adversely affect us\".\nGovernment Regulation\nWe are subject to numerous laws and regulations in the countries in which we operate. Continued compliance with increasingly stringent laws, regulations and policies in the U.S. and in the other countries in which we operate may result in materially increased costs, or we could be subject to substantial fines or possible revocation of our authority to conduct our operations.\n5\nAir Operations\nThe U.S. Department of Transportation (\"DOT\"), the Federal Aviation Administration (\"FAA\") and the U.S. Department of Homeland Security, through the Transportation Security Administration (\"TSA\"), have primary regulatory authority over our air transportation services. \nThe DOT’s authority primarily relates to economic aspects of air transportation, such as operating authority, insurance requirements, pricing, non-competitive practices, interlocking relations and cooperative agreements. The DOT also regulates international routes, fares, rates and practices and is authorized to investigate and take action against discriminatory treatment of U.S. air carriers abroad. International operating rights for U.S. airlines are usually subject to bilateral agreements between the U.S. and foreign governments or, in the absence of such agreements, by principles of reciprocity. We are also subject to current and potential aviation, health, customs and immigration regulations imposed by governments in other countries in which we operate, including registration and license requirements and security regulations. We have international route operating rights granted by the DOT and we may apply for additional authorities when those operating rights are available and are required for the efficient operation of our international network. The efficiency and flexibility of our international air transportation network is subject to DOT and foreign government regulations and operating restrictions.\nThe FAA’s authority primarily relates to operational, technical and safety aspects of air transportation, including certification, aircraft operating procedures, transportation of hazardous materials, record keeping standards and maintenance activities and personnel. In addition, we are subject to non-U.S. government regulation of aviation rights involving non-U.S. jurisdictions and non-U.S. customs regulation.\nUPS's aircrew, dispatch and aircraft maintenance certification, training, programs and procedures, including aircraft inspection and repair at periodic intervals, are approved for all aircraft and carrier operations under FAA regulations. The future cost of changes and repairs pursuant to these programs and procedures may fluctuate according to aircraft condition, age and the enactment of additional FAA regulatory requirements.\nThe TSA regulates various security aspects of air cargo transportation. Our airport and off-airport locations, as well as our personnel, facilities and procedures involved in air cargo transportation must comply with TSA regulations.\nWe participate in the Civil Reserve Air Fleet (\"CRAF\") program. Our participation in this program allows the U.S. Department of Defense (\"DOD\") to requisition specified UPS aircraft for military use during a national defense emergency. The DOD is required to compensate us for any use of aircraft under the CRAF program. In addition, participation in the CRAF program entitles us to bid for other U.S. Government opportunities including small package and airfreight. \nGround Operations\nOur ground transportation of packages in the U.S. is subject to regulation by the DOT and its agency, the Federal Motor Carrier Safety Administration (the \"FMCSA\"). Ground transportation also falls under state jurisdiction with respect to the regulation of operations, safety and insurance. Our ground transportation of hazardous materials in the U.S. is subject to regulation by the DOT's Pipeline and Hazardous Materials Safety Administration. We also must comply with safety and fitness regulations promulgated by the FMCSA, including those relating to drug and alcohol testing and hours of service for drivers. Ground transportation of packages outside of the U.S. is subject to similar regulatory schemes in the countries in which we transport those packages.\nThe Postal Reorganization Act of 1970 created the USPS as an independent establishment of the executive branch of the federal government, and created the Postal Rate Commission, an independent agency, to recommend postal rates. The Postal Accountability and Enhancement Act of 2006 amended the 1970 Act to give the re-named Postal Regulatory Commission revised oversight authority over many aspects of the USPS, including postal rates, product offerings and service standards. As a result of recent changes in the USPS operating model, in January 2025 we announced that we have begun delivering 100% of our SurePost volume. We sometimes participate in proceedings before the Postal Regulatory Commission in an attempt to facilitate compliance with fair competition requirements for competitive services.\nOur ground operations are also subject to compliance with various cargo-security and transportation regulations issued by the U.S. Department of Homeland Security, including regulation by the TSA in the U.S., and similar regulations issued by foreign governments in other countries.\nCustoms\nWe are subject to the customs laws regarding the import and export of shipments in the countries in which we operate, including those related to the filing of documents on behalf of client importers and exporters. Our activities in the U.S., \n6\nincluding customs brokerage and freight forwarding, are subject to regulation by the Bureau of Customs and Border Protection, the TSA, the U.S. Federal Maritime Commission and the DOT. Our international operations are subject to similar regulatory structures in their respective jurisdictions. \nFor additional information, see \"Risk Factors – Business and Operating    Risks – We maintain significant physical operations. Increases in operational security requirements impose substantial costs on us and we could be the target of an attack or have a security breach, which could materially adversely affect us\".\nEnvironmental\nWe are subject to U.S. and international federal, state and local environmental laws and regulations across all of our operations. These laws and regulations cover a variety of matters such as disclosures, operations and processes, including, but not limited to: properly storing, handling and disposing of waste materials; appropriately managing waste water and storm water; monitoring and maintaining the integrity of underground storage tanks; complying with laws regarding clean air, including those governing emissions; protecting against and appropriately responding to spills and releases and communicating the presence of reportable quantities of hazardous materials to local responders. We maintain site- and activity-specific environmental compliance and pollution prevention programs to address our environmental responsibilities and remain compliant. In addition, we maintain numerous programs which seek to minimize waste and prevent pollution within our operations.\nPursuant to the Federal Aviation Act, the FAA - with the assistance of the Environmental Protection Agency - is authorized to establish standards governing aircraft noise. Our aircraft fleet complies with current noise standards of the federal aviation regulations. Our international operations are also subject to noise regulations in certain other countries in which we operate. \nFor additional information, see \"Risk Factors – Regulatory and Legal Risks – Increasingly stringent regulations related to climate change, including reporting obligations, could materially increase our operating costs\". \nCommunications and Data Protection\nAs we use radio and other communication facilities in our operations, we are subject to the Federal Communications Act of 1934, as amended. In addition, the Federal Communications Commission regulates and licenses our activities pertaining to satellite communications. \nWe are subject to a variety of evolving laws and regulations in the U.S. and abroad regarding privacy, cybersecurity, data protection and data security, including the European Union General Data Protection Regulation and China's Personal Information Protection Law. There has recently been increased regulatory and enforcement focus on data protection in the U.S. (at both the state and federal level) and in other countries. \nFor additional information, see \"Risk Factors – Business and Operating Risks – A significant cybersecurity incident, or increased data protection regulations, could materially adversely affect us\".\nHealth and Safety\nWe are subject to numerous federal, state and local laws and regulations governing employee health and safety, both in the U.S. and in other countries. Compliance with changing laws and regulations from time to time, including those promulgated by the U.S. Occupational Safety and Health Administration and state agencies, could result in materially increased operating costs and capital expenditures, and negatively impact our ability to attract and retain employees.\nFor additional information on governmental regulations and their potential impact on us generally, see \"Risk Factors – Regulatory and Legal Risks\".\nWhere You Can Find More Information\nWe maintain websites for business and customer matters at \nwww.ups.com\n, and for investor relations matters at \nwww.investors.ups.com\n. Our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to those reports filed with or furnished to the SEC pursuant to Section 13(a) of the Securities Exchange Act of 1934 are made available free of charge on our investor relations website under the heading \"Investors - SEC Filings\" as soon as reasonably practical after we electronically file or furnish the reports to the SEC. \nOur Code of Business Conduct, which applies to all of our directors, officers and employees, including our principal executive and financial officers, our Corporate Governance Guidelines and the charters for our Audit, Compensation and \n7\nHuman Capital, Risk, and Nominating and Corporate Governance Committees are also available on our investor relations website under the heading \"Investors – Corporate Governance\". In the event that we make changes in, or provide waivers from, the provisions of the Code of Business Conduct that the SEC requires us to disclose, we intend to disclose these events within four business days following the date of the amendment or waiver under that heading on our investor relations website.\nOur sustainability reporting, which describes our activities that support our commitment to acting responsibly and contributing to society, is available under the heading \"Our Impact\" at \nwww.about.ups.com\n.\nWe provide the addresses to our websites solely for information. We do not intend for any addresses to be active links or to otherwise incorporate the contents of any website into this or any other report we file with the SEC.\nDisclosures Required Pursuant to Section 13(r) of the Securities Exchange Act of 1934\nThe Company had no reportable transactions during the quarter ended December 31, 2024. The information provided pursuant to Section 13(r) of the Exchange Act in Item 5 of Part II of the Company's \nQuarterly Report on Form 10-Q\n for the quarter ended September 30, 2024 is incorporated by reference herein.\n8",
  "item7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n22\nOverview\n22\nSupplemental Information - Items Affecting Comparability\n26\nU.S. Domestic Package Operations\n33\nInternational Package Operations\n36\nSupply Chain Solutions Operations\n39\nConsolidated Operating Expenses\n42\nOther Income and (Expense)\n46\nIncome Tax Expense\n47\nLiquidity and Capital Resources\n48\nCollective Bargaining Agreements\n53\nNew Accounting Pronouncements\n53\nCritical Accounting Estimates\n54",
  "item2": null
}