{
  "source_file": "uri-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\n    \nBusiness \nUnited Rentals is the largest equipment rental company in the world, operates throughout the United States and Canada, and has a smaller presence in Europe, Australia and New Zealand. The table below presents key information about our business as of and for the years ended December 31, 2024 and 2023. Our business is discussed in more detail below. The data below should be read in conjunction with, and is qualified by reference to, our Management’s Discussion and Analysis and our consolidated financial statements and notes thereto contained elsewhere in this report.\n1\nTable of Contents\n2024\n2023\nPERFORMANCE MEASURES\nTotal revenues (in millions)\n$15,345\n$14,332\nEquipment rental revenue percent of total revenues\n85%\n84%\nEquipment rental revenue variance components:\nYear-over-year change in average original equipment cost (“OEC”)\n3.5%\n21.9%\nAssumed year-over-year inflation impact (1)\n(1.5)%\n(1.5)%\nFleet productivity (2) \n4.1%\n(0.7)%\nContribution from ancillary and re-rent revenue (3)\n1.9%\n(0.4)%\nTotal equipment rental revenue variance\n8.0%\n19.3%\nPro forma equipment rentals variance components (4):\nYear-over-year change in average OEC\n10.4%\nAssumed year-over-year inflation impact (1) \n(1.5)%\nFleet productivity (2) \n2.8%\nContribution from ancillary and re-rent revenue (3) \n(0.4)%\nTotal equipment rental revenue variance\n11.3%\nKey account percent of equipment rental revenue\n68%\n67%\nNational account percent of equipment rental revenue\n44%\n43%\nFLEET\nFleet OEC (in billions)\n$21.43\n$20.66\nEquipment units\n1,120,000\n995,000\nFleet age in months\n51.3\n52.4\nEquipment rental revenue percent by fleet type:\nGeneral construction and industrial equipment\n40%\n42%\nAerial work platforms\n23%\n25%\nGeneral tools and light equipment\n9%\n8%\nPower and HVAC (heating, ventilating and air conditioning) equipment\n11%\n10%\nTrench safety equipment\n5%\n5%\nFluid solutions equipment\n7%\n7%\nMobile storage equipment and modular office space\n3%\n3%\nSurface protection mats (5)\n2%\n—%\nLOCATIONS/PERSONNEL\nRental locations\n1,686\n1,584\nApproximate range of branches per district\n4-13\n5-14\nApproximate range of districts per region\n5-10\n6-11\nRange of regions per division\n2-7\n3-6\nHourly employees\n19,900\n18,900\nSalaried employees\n8,000\n7,400\nTotal employees\n27,900\n26,300\nINDUSTRY\nEstimated North American market share (6)\n15%\n15%\nEstimated North American equipment rental industry revenue growth (6)\n8%\n12%\nCUSTOMERS/SUPPLIERS\nLargest customer percent of total revenues\n1%\n1%\nTop 10 customers percent of total revenues\n5%\n4%\nLargest supplier percent of capital expenditures\n12%\n15%\nTop 10 supplier percent of capital expenditures\n51%\n48%\n2\nTable of Contents\n(1)\nReflects the estimated impact of inflation on the revenue productivity of fleet based on OEC, which is recorded at cost.\n(2)\nReflects the combined impact of changes in rental rates, time utilization, and mix that contribute to the variance in owned equipment rental revenue. See note 3 to the consolidated financial statements for a discussion of the different types of equipment rentals revenue. Rental rate changes are calculated based on the year-over-year variance in average contract rates, weighted by the prior period revenue mix. Time utilization is calculated by dividing the amount of time an asset is on rent by the amount of time the asset has been owned during the year. Mix includes the impact of changes in customer, fleet, geographic and segment mix. \n(3)\nReflects the combined impact of changes in the other types of equipment rentals revenue (see note 3 for further detail), excluding owned equipment rental revenue.\n(4)\nWe completed the acquisition of Ahern Rentals, Inc. (“Ahern Rentals”) in December 2022. The pro forma information includes the standalone, pre-acquisition results of Ahern Rentals. Pro forma information is not reflected above for 2024 versus 2023 because Ahern Rentals was fully included in our results for both years. \n(5)\nAs discussed in note 4 to the consolidated financial statements, in March 2024, we completed the acquisition of Yak Access, LLC, Yak Mat, LLC and New South Access & Environmental Solutions, LLC (collectively, “Yak”), which was a leading provider of surface protection mats. Prior to the Yak acquisition, we did not rent material amounts of such equipment. \n(6)\nAs discussed below (see “Industry Overview and Economic Outlook”), North American market share and equipment rental industry revenue are based on industry estimates (excluding party and event rentals) from the American Rental Association (“ARA”). As discussed above, in March 2024, we completed the acquisition of Yak. Estimated North American market share as of December 31, 2024 includes the standalone, pre-acquisition revenue of Yak.\nHuman Capital\nThe Company’s key human capital management objectives are to attract, retain and develop talent to deliver on the Company’s strategy. To support these objectives, the Company’s human resources programs are designed to: keep people safe and healthy; enhance the Company’s culture through efforts aimed at making the workplace more inclusive; acquire and retain high-performing talent; ensure employees are supported and engaged so they can provide outstanding customer service; reward and support employees through competitive pay and benefit programs; develop talent to prepare them for critical roles and leadership positions; and facilitate internal talent mobility to create a high-performing workforce. See “Locations/Personnel” in the table above for information on employee counts. \nThe Company focuses on the following in managing its human capital:\n•\nHealth and safety:\n We have a safety program that focuses on implementing management systems, policies and training programs and performing assessments designed to promote proper training of workers and prevention of injuries and incidents. All of our employees are empowered with stop-work authority which enables them to immediately stop any unsafe or potentially hazardous working condition or behavior they may observe. We utilize a mixture of indicators to assess the safety performance of our operations, including total recordable injury rate (TRIR), preventable motor vehicle incidents per million miles, corrective actions and near miss frequency and have disclosed an aspirational goal to further reduce our TRIR. We also recognize outstanding safety behaviors through our annual awards program.  \n•\nEmployee wellness:\n The Company’s Live Well, Safe & Healthy program is a comprehensive approach to wellness that encourages healthy behaviors and is intended to raise morale, productivity and overall employee engagement. Through the program, eligible employees can reduce medical plan costs if they complete a health assessment and participate in a biometric screening at work or off-site, and, in 2024, 56 percent of eligible employees did so. The program also includes (i) a paid day off to be used for a wellness exam or day of service, which was used by 91 percent of eligible employees in 2024, (ii) tobacco cessation support and (iii) participation incentives. Additionally, employees and family members can participate in virtual health challenges to encourage daily activity. \n•\nCompensation programs and employee benefits: \nOur compensation and benefits programs provide a package designed to attract, retain and motivate employees. In addition to competitive base salaries, the Company provides a variety of short-term, long-term and commission-based incentive compensation programs to reward performance relative to key financial, human capital and customer experience metrics. We offer comprehensive benefit options including paid time off, retirement savings plans, medical and prescription drug benefits, dental and vision benefits, accident and critical illness insurance, life and disability insurance, health savings accounts, flexible spending accounts, parental leave, legal coverage, auto/home insurance, identity theft insurance and tuition assistance. Additionally, we have conducted five company-wide stock grant programs for employees since 2014 – the most recent grant took place in 2024.\n3\nTable of Contents\n•\nEmployee experience and retention:\n To evaluate our employee experience and retention efforts, we monitor a number of employee measures, such as employee retention, internal promotions and referrals. For example, voluntary employee turnover, which represents voluntary terminations during the year divided by average headcount during the year, was 11.9 percent, 12.4 percent and 13.1 percent for 2024, 2023 and 2022, respectively. We also conduct an annual employee experience survey, with Peakon (a Workday company) serving as administrator, which provides information on drivers of engagement and areas where we can improve. Our 2024 employee experience survey showed strong results with average responses ranging from 8.3 to 9.1 out of 10 in each of our four survey categories: Engagement (8.4), Belonging (8.3), Health & Wellbeing (8.4) and Safety Commitment (9.1). Our 2024 results were consistent with our strong 2023 results, with scores in all four categories flat or within 0.1 year-over-year. Our employee Net Promoter Score places us in the top five percent of the Peakon Benchmark for Commercial and Professional Services Companies for the Engagement category, in the top 10 percent for the Health & Wellbeing category and in the top 25 percent for the Belonging category. There is no external benchmark reference for our Safety Commitment category. \n•\nEmployee inclusion and engagement:\n Our commitment to inclusion is demonstrated through many efforts such as employee-led employee resource groups (“ERGs”). Our many ERGs are open to all employees and aim to foster a diverse and inclusive workplace by facilitating: networking and connecting with peers; education and awareness efforts; and professional development. As part of its inclusion efforts, the Company is committed to supporting its military veterans and has made the fair inclusion of veterans a priority, through its veterans ERG and external partnerships. To provide an open and frequent line of communication for all employees, we host town hall meetings and quarterly all employee conference calls, and utilize Workplace, a virtual collaboration platform for our employees, to engage with our full team. The Company also sponsors the United Compassion Fund, an employee-funded 501(c)(3) charity that provides financial assistance to fellow employees in need. In 2024, employees voluntarily donated approximately $1.6 million to the fund, and employees received 845 grants totaling approximately $2.2 million.\n•\nTraining and development:\n The Company is committed to the continual development of its employees. We aim for all new hires to attend JumpSTART, a new hire orientation, to quickly acclimate them to our culture, as well as applicable new hires to attend Center of Excellence (job related) training within 90 days of hire. We offer a wide array of training solutions (instructor led in-person, virtual, digital, hands-on, e-learning and experience maps) for further development of our employees to help them achieve their career goals. In addition, as we did in 2024, we aim to regularly develop new training programs, launch pilot programs and expand leadership opportunities for our employees. In 2024, our employees enhanced their skills through approximately 1.2 million hours of training, including safety training, sales and leadership training and equipment-related training from our suppliers. Our performance process encourages employee check-ins throughout the year to discuss performance and career goals, as well as development opportunities at all levels across the Company.\nStrategy\nFor the past several years, we have executed a strategy focused on improving the profitability of our core equipment rental business through revenue growth, margin expansion and operational efficiencies. In particular, we have focused on customer segmentation, customer service differentiation, rate management, fleet management and operational efficiency. Our general strategy focuses on profitability and return on invested capital, and, in particular, calls for:\n•\nA consistently superior standard of service to customers\n,\n often provided through a single lead contact who can coordinate the cross-selling of the various services we offer throughout our network. We utilize a proprietary software application, Total Control\n®\n, which provides our key customers with a single in-house software application that enables them to monitor and manage all their equipment needs. Total Control\n®\n is a unique customer offering that enables us to develop strong, long-term relationships with our larger customers. Our digital capabilities, including our Total Control\n®\n platform, allow our sales teams to provide contactless end-to-end customer service;\n•\nThe further optimization of our customer mix and fleet mix, with a dual objective\n:\n to enhance our performance in serving our current customer base, and to focus on the accounts and customer types that are best suited to our strategy for profitable growth. We believe these efforts will lead to even better service of our target accounts, primarily large construction and industrial customers, as well as select local contractors. Our fleet team's analyses are aligned with these objectives to identify trends in equipment categories and define action plans that can generate improved returns;\n•\nA continued focus on “Lean” management techniques, including kaizen processes focused on continuous improvement\n.\n We have a dedicated team responsible for reducing waste in our operational processes, with the objectives of: condensing the cycle time associated with preparing equipment for rent; optimizing our resources for \n4\nTable of Contents\ndelivery and pickup of equipment; improving the effectiveness and efficiency of our repair and maintenance operations; and implementing customer service best practices; \n•\nThe continued expansion and cross-selling of adjacent specialty and services products, which enables us to provide a “one-stop” shop for our customers\n. \nWe believe that the expansion of our specialty business, as exhibited by our acquisition of Yak in March 2024, which is discussed in note 4 to the consolidated financial statements, as well as our tools and onsite services offerings, further positions United Rentals as a single source provider of total jobsite solutions through our extensive product and service resources and technology offerings; and\n•\nThe pursuit of strategic acquisitions to continue to expand our core equipment rental business,\n as exhibited by our acquisition of assets of Ahern Rentals in December 2022, as well as the pending acquisition of H&E Equipment Services, Inc. d/b/a H&E Rentals (“H&E”) that is discussed in note 19 to the consolidated financial statements, which is expected to close in the first quarter of 2025. Strategic acquisitions allow us to invest our capital to expand our business, further driving our ability to accomplish our strategic goals. \nIndustry Overview and Economic Outlook \nUnited Rentals serves the following three principal end-markets for equipment rental in North America: industrial and other non-construction; commercial (or private non-residential) construction; and residential construction, which includes remodeling. We also have a smaller presence in Europe, Australia and New Zealand. See Item 2—Properties for further geographical detail on our rental network. In 2024, based on our classification of the vertical market segments in which our equipment was used:\n•\nIndustrial and other non-construction rentals represented approximately 49 percent of our rental revenue, primarily reflecting rentals to manufacturers, energy companies, chemical companies, paper mills, railroads, shipbuilders, utilities, retailers and infrastructure entities; \n•\nCommercial construction rentals represented approximately 46 percent of our rental revenue, primarily reflecting rentals related to the construction and remodeling of facilities for office space, lodging, healthcare, entertainment and other commercial purposes; and\n•\nResidential rentals represented approximately five percent of our rental revenue, primarily reflecting rentals of equipment for the construction and renovation of homes. \nBased on industry estimates (excluding party and event rentals) from the ARA, 2024 North American equipment rental industry revenue grew an estimated 8 percent year-over-year. In 2024, our full year rental revenue increased by 8.0 percent year-over-year, which included the impact of the Yak acquisition that was completed in March 2024 and is discussed in note 4 to the consolidated financial statements. Our estimated North American market share of approximately 15 percent as of December 31, 2024, which includes the standalone, pre-acquisition revenue of Yak, did not change materially from our market share as of December 31, 2023.\nCompetitive Advantages \nWe believe that we benefit from the following competitive advantages: \nLarge and Diverse Rental Fleet\n. Our large and diverse fleet allows us to serve large customers that require substantial quantities and/or wide varieties of equipment. We believe our ability to serve such customers should allow us to improve our performance and enhance our market leadership position. \nWe manage our rental fleet, which is the largest and most comprehensive in the industry, utilizing a life-cycle approach that focuses on satisfying customer demand and optimizing utilization levels. As part of this life-cycle approach, we closely monitor repair and maintenance expense and can anticipate, based on our extensive experience with a large and diverse fleet, the optimum time to dispose of an asset. \nSignificant Purchasing Power\n. We purchase large amounts of equipment, contractor supplies and other items, which enables us to negotiate favorable pricing, warranty and other terms with our vendors. \nNational Account Program\n. Our national account sales force is dedicated to establishing and expanding relationships with large companies, particularly those with a national or multi-regional presence. National accounts are generally defined as customers with potential annual equipment rental spend of at least $500,000 or customers doing business in multiple states. We offer our national account customers the benefits of a consistent level of service across North America, a wide selection of equipment and a single point of contact for all their equipment needs. National accounts are a subset of key accounts, which are our accounts that are managed by a single point of contact. Establishing a single point of contact for our key accounts helps us provide customer service management that is more consistent and satisfactory.\n5\nTable of Contents\nOperating Efficiencies\n. We benefit from the following operating efficiencies: \n•\nEquipment Sharing Among Branches\n. Each branch within a region can access equipment located elsewhere in the region. This fleet sharing increases equipment utilization because equipment that is idle at one branch can be marketed and rented through other branches. Additionally, fleet sharing allows us to be more disciplined with our capital spend. \n•\nCustomer Care Center\n. We have a Customer Care Center (“CCC”) in Charlotte, North Carolina that handles all telephone calls to our customer service telephone line, 1-800-UR-RENTS. The CCC handles many of the 1-800-UR-RENTS telephone calls without having to route them to individual branches, and allows us to provide a more uniform quality experience to customers, manage fleet sharing more effectively and free up branch employee time.\n•\nConsolidation of Common Functions\n. We reduce costs through the consolidation of functions that are common to our branches, such as accounts payable, payroll, benefits and risk management, information technology and credit and collection. \nOur \ninformation technology systems\n, some of which are proprietary and some of which are licensed, support our operations. Our information technology infrastructure facilitates our ability to make rapid and informed decisions, respond quickly to changing market conditions and share rental equipment among branches. We have an in-house team of information technology specialists that supports our systems.\nOur information technology systems are accessible to management, branch and call center personnel. Leveraging information technology to achieve greater efficiencies and improve customer service is a critical element of our strategy. Each branch is equipped with one or more computers that are electronically linked to our other locations and to our data center. Rental transactions can be entered at these computers, or through various web/mobile applications, to be processed on a real-time basis. \nOur information technology systems: \n•    enable branch personnel to (i) determine equipment availability, (ii) access all equipment within a geographic region and arrange for equipment to be delivered from anywhere in the region directly to the customer, (iii) monitor business activity on a real-time basis and (iv) obtain customized reports on a wide range of operating and financial data, including equipment utilization, rental rate trends, maintenance histories and customer transaction histories; \n•    allow our mobile sales and service team members to support our customers efficiently while in the field; \n•    permit customers to access and manage their accounts online; and \n•    allow management to obtain a wide range of operational and financial data. \nWe have a back-up facility designed to enable business continuity for our core rental and financial systems in the event that our main computer facility becomes inoperative. This back-up facility also allows us to perform system upgrades and maintenance without interfering with the normal ongoing operation of our information technology systems.\nStrong Brand Recognition\n. As the largest equipment rental company in the world, we have strong brand recognition, which helps us attract new customers and build customer loyalty. \nGeographic and Customer Diversity\n. We primarily operate in the United States and Canada, and have a smaller presence in Europe, Australia and New Zealand, and our global branch network includes 1,686 rental locations. See Item 2—Properties for further geographical detail on our branch network. Our North American network operates in 49 U.S. states and every Canadian province, and serves customers that range from Fortune 500 companies to small businesses and homeowners. We believe that our geographic and customer diversity provides us with many advantages including: \n•\nenabling us to better serve national account customers with multiple locations; \n•\nhelping us achieve favorable resale prices by allowing us to access used equipment resale markets across North America; and \n•\nreducing our dependence on any particular customer. \n \nOur foreign operations are subject to the risks normally associated with international operations. These include (i) the need to convert currencies, which could result in a gain or loss depending on fluctuations in exchange rates and (ii) the need to comply with foreign laws and regulations, as well as U.S. laws and regulations applicable to our operations in foreign jurisdictions. For additional financial information regarding our geographic diversity, see note 5 to our consolidated financial statements.\n6\nTable of Contents\nStrong and Motivated Branch Management\n. Each of our full-service branches has a manager who is supervised by a district manager. We believe that our managers are among the most knowledgeable and experienced in the industry, and we empower them, within budgetary guidelines, to make day-to-day decisions concerning branch matters. Each regional office has a management team that monitors branch, district and regional performance with extensive systems and controls, including performance benchmarks and detailed monthly operating reviews. \nRisk Management and Safety Programs\n. Our risk management department is staffed by experienced professionals directing the procurement of insurance, managing claims made against the Company, and developing loss prevention programs to address workplace safety, driver safety and customer safety. The department’s primary focus is on the protection of our employees and assets, as well as protecting the Company from liability for accidental loss.\nSegment Information \nWe have two reportable segments– general rentals and specialty. Segment financial information is presented in note 5 to our consolidated financial statements. \nThe general rentals segment includes the rental of construction, aerial and industrial equipment, general tools and light equipment, and related services and activities. The general rentals segment’s customers include construction and industrial companies, manufacturers, utilities, municipalities and homeowners. The general rentals segment reflects the aggregation of four geographic divisions—Central, Northeast, Southeast and West—and operates throughout the United States and Canada. \nThe specialty segment rents products (and provides setup and other services on such rented equipment) including (i) trench safety equipment, such as trench shields, aluminum hydraulic shoring systems, slide rails, crossing plates, construction lasers and line testing equipment for underground work, (ii) power and HVAC equipment, such as portable diesel generators, electrical distribution equipment, and temperature control equipment, (iii) fluid solutions equipment primarily used for fluid containment, transfer and treatment, (iv) mobile storage equipment and modular office space and (v) surface protection mats. The specialty segment’s customers include construction companies involved in infrastructure projects, municipalities and industrial companies. This segment primarily operates in the United States and Canada, and has a smaller presence in Europe, Australia and New Zealand.\nProducts and Services \nOur principal products and services are described below. \nEquipment Rental\n. We offer a fleet of rental equipment with total OEC of $21.4 billion for rent on an hourly, daily, weekly or monthly basis. The types of equipment that we offer include general construction and industrial equipment; aerial work platforms; trench safety equipment; power and HVAC equipment; fluid solutions equipment; mobile storage equipment and modular office space; surface protection mats; and general tools and light equipment.  \nSales of Rental Equipment\n.\n We routinely sell used rental equipment and invest in new equipment in order to manage repair and maintenance costs, as well as the composition and size of our fleet. We also sell used equipment in response to customer demand for the equipment. Consistent with the life-cycle approach we use to manage our fleet, the rate at which we replace used equipment with new equipment depends on a number of factors, including changing general economic conditions, growth opportunities, the market for used equipment, the age of our fleet and the need to adjust fleet composition to meet customer demand. \nWe utilize many channels to sell used equipment: through our national and export sales forces, which can access many resale markets across our network; at auction; through brokers; and directly to manufacturers. We also sell used equipment through our website, which includes an online database of used equipment available for sale.\nSales of New Equipment\n. We sell equipment such as aerial lifts, reach forklifts, telehandlers, compressors and generators from many leading equipment manufacturers. The type of new equipment that we sell varies by location. \nContractor Supplies Sales\n. We sell a variety of contractor supplies including construction consumables, tools, small equipment and safety supplies.  \nService and Other Revenues\n. We offer repair and maintenance services and sell parts for equipment that is owned by our customers.  \nCustomers \nOur customer base is highly diversified and ranges from Fortune 500 companies to small businesses and homeowners. Our customer base varies by branch and is determined by several factors, including the equipment mix and marketing focus of \n7\nTable of Contents\nthe particular branch as well as the business composition of the local economy, including construction opportunities with different customers. Our customers include: \n•\nconstruction companies that use equipment for constructing and renovating commercial buildings, warehouses, industrial and manufacturing plants, office parks, airports, residential developments and other facilities; \n•\nindustrial companies—such as manufacturers, chemical companies, paper mills, railroads, ship builders and utilities—that use equipment for plant maintenance, upgrades, expansion and construction; \n•\nmunicipalities that require equipment for a variety of purposes; and \n•\nhomeowners and other individuals that use equipment for projects that range from simple repairs to major renovations. \nOur business is seasonal, with demand for our rental equipment tending to be lower in the winter months. \nSales and Marketing \nWe market our products and services through multiple channels as described below. \nSales Force\n. Our sales representatives work in our branches and at our customer care center, and are responsible for calling on existing and potential customers as well as assisting our customers in planning for their equipment needs. We have ongoing programs for training our employees in sales and service skills and on strategies for maximizing the value of each transaction. \nNational Account Program\n. Our national account sales force is dedicated to establishing and expanding relationships with large customers, particularly those with a national or multi-regional presence. Our national account team closely coordinates its efforts with the local sales force in each area.\nOnline Rental Platform (UROne\n®\n)\n. Our customers can check equipment availability and pricing, and reserve equipment online, 24 hours a day, seven days a week, by accessing our equipment catalog and used equipment listing, which can be found at\n www.unitedrentals.com.\n \nTotal Control\n®\n. We utilize a proprietary software application, Total Control\n®\n, which provides our key customers with a single in-house software application that enables them to monitor and manage all their equipment needs. This software can be integrated into the customers' enterprise resource planning system. Total Control\n®\n is a unique customer offering that enables us to develop strong, long-term relationships with our larger customers.\nAdvertising\n. We promote our business through local and national advertising across marketing channels, including digital media (including organic and paid search), customer engagement (lifecycle marketing and direct mail), television (connected and linear), trade publications (digital and print), earned media, tradeshows and sponsorships.  \nSuppliers \nOur strategic approach with respect to our suppliers is to maintain the minimum number of suppliers per category of equipment that can satisfy our anticipated volume and business requirements. This approach is designed to ensure that the terms we negotiate are competitive and that there is sufficient product available to meet anticipated customer demand. We utilize a comprehensive selection process to determine our equipment vendors. We consider product capabilities and industry position, the terms being offered, product liability history, customer acceptance and financial strength. We believe we have sufficient alternative sources of supply available for each of our major equipment categories.\nCompetition\nWe primarily operate in the United States and Canada, and have a smaller presence in Europe, Australia and New Zealand. The North American equipment rental industry is highly fragmented and competitive. \nAs discussed in note 4 to the consolidated financial statements, in March 2024, we completed the acquisition of Yak. As the largest equipment rental company in the industry, we estimate that we have an approximate 15 percent market share, which includes the standalone, pre-acquisition revenue of Yak, in North America based on 2024 total equipment rental industry revenues (excluding party and event rentals) as measured by the ARA. Estimated market share is calculated by dividing our total 2024 North American rental revenue, including the standalone, pre-acquisition revenue of Yak, by ARA’s forecasted 2024 industry revenue (excluding party and event rentals). Our competitors primarily include small, independent businesses with one or two rental locations; regional competitors that operate in one or more states; public companies or divisions of public companies that operate nationally or internationally; and equipment vendors and dealers who both sell and rent equipment \n8\nTable of Contents\ndirectly to customers. We believe we are well positioned to take advantage of this environment because, as a larger company, we have more resources and certain competitive advantages over our smaller competitors. These advantages include greater purchasing power, the ability to provide customers with a broader range of equipment and services, and greater flexibility to transfer equipment among locations in response to, and in anticipation of, customer demand. The fragmented nature of the industry and our relatively small market share, however, may adversely impact our ability to mitigate rental rate pressure. See “Industry Overview and Economic Outlook” above for a discussion of our end-markets. \nEnvironmental and Safety Regulations\nOur operations are subject to numerous laws governing environmental protection and occupational health and safety matters. These laws regulate issues such as wastewater, storm water, solid and hazardous wastes and materials, and air quality. Our operations generally do not raise significant environmental risks, but we use and store hazardous materials as part of maintaining our rental equipment fleet and the overall operations of our business, dispose of solid and hazardous waste and wastewater from equipment washing, and store and dispense petroleum products from storage tanks at certain locations. Under environmental and safety laws, we may be liable for, among other things, (i) the costs of investigating and remediating contamination at our sites as well as sites to which we send hazardous wastes for disposal or treatment, regardless of fault, and (ii) fines and penalties for non-compliance. We incur ongoing expenses associated with the performance of appropriate investigation and remediation activities at certain locations.\nEmployees \nApproximately 8,000 of our employees are salaried and approximately 19,900 are hourly. Collective bargaining agreements relating to approximately 164 separate locations cover approximately 1,800 of our employees. We monitor employee satisfaction through ongoing surveys and consider our relationship with our employees to be good.\nAvailable Information \nWe make our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to these reports, as well as our other SEC filings, available on our website, free of charge, as soon as reasonably practicable after they are electronically filed with or furnished to the SEC. Our website address is\n www.unitedrentals.com\n. The information contained on our website is not incorporated by reference in this document.",
  "item7": "Item 7. \n    \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (dollars in millions, except per share data and unless otherwise indicated) \nWe have omitted discussions comparing 2023 and 2022 results, as such disclosures were included in our Annual Report on Form 10-K for the year ended December 31, 2023.\nGlobal Economic Conditions\nOur operations are impacted by global economic conditions, including inflation, tariffs, interest rate fluctuations and supply chain constraints, and we take actions to modify our plans to address such economic conditions. In 2022, for example, we intentionally held back on sales of rental equipment to ensure we had sufficient rental capacity for our customers. To date, the impact from supply chain disruptions has been limited, but we may experience more severe supply chain disruptions in the future. Interest rates on our debt instruments have increased in recent years. For example, in March 2024, United Rentals (North America), Inc. (“URNA”) issued $1.1 billion aggregate principal amount of senior unsecured notes at a 6 \n1\n/\n8\n percent interest rate, while URNA's issuance in August 2021 of $750 aggregate principal amount of senior unsecured notes was at a 3 ¾ percent interest rate. Additionally, the weighted average interest rates on our variable debt instruments were 6.3 percent in 2024 and 1.4 percent in 2021. We have experienced and are continuing to experience inflationary pressures. A portion of inflationary cost increases is passed on to customers. The most significant cost increases that are passed on to customers are for fuel and delivery, and there are other costs for which the pass through to customers is less direct, such as repairs and maintenance, and labor. Tariffs could result in the costs we incur being more than anticipated. The impact of inflation, tariffs and interest rate fluctuations may be significant in the future. \nWe continue to assess the economic environment in which we operate and take appropriate actions to address the economic challenges we face. See “Item 1. Business-Industry Overview and Economic Outlook” for a discussion of our end-markets, and Item 1A- Risk Factors for further discussion of the risks related to us and our business.\nExecutive Overview\nWe are the largest equipment rental company in the world, with an integrated network of 1,686 rental locations. We primarily operate in the United States and Canada, and have a smaller presence in Europe, Australia and New Zealand (see Item 2—Properties for further detail). Although the equipment rental industry is highly fragmented and diverse, we believe that we are well positioned to take advantage of this environment because, as a larger company, we have more extensive resources and certain competitive advantages. These include a fleet of rental equipment with a total original equipment cost (“OEC”) of $21.4 billion, and a North American branch network that operates in 49 U.S. states and every Canadian province, and serves 99 of the 100 largest metropolitan areas in the U.S. Our size also gives us greater purchasing power, the ability to provide customers with a broader range of equipment and services, the ability to provide customers with equipment that is more consistently well-maintained and therefore more productive and reliable, and the ability to enhance the earning potential of our assets by transferring equipment among branches to satisfy customer needs.  \nWe offer our equipment for rent to a diverse customer base that includes construction and industrial companies, manufacturers, utilities, municipalities, homeowners and government entities. Our revenues are derived from the following sources: equipment rentals, sales of rental equipment, sales of new equipment, contractor supplies sales and service and other revenues. In 2024, equipment rental revenues represented 85 percent of our total revenues. \nFor the past several years, we have executed a strategy focused on improving the profitability of our core equipment rental business through revenue growth, margin expansion and operational efficiencies. In particular, we have focused on customer segmentation, customer service differentiation, rate management, fleet management and operational efficiency. Our general strategy focuses on profitability and return on invested capital, and, in particular, calls for:\n•\nA consistently superior standard of service to customers\n,\n often provided through a single lead contact who can coordinate the cross-selling of the various services we offer throughout our network. We utilize a proprietary software application, Total Control®, which provides our key customers with a single in-house software application that enables them to monitor and manage all their equipment needs. Total Control® is a unique customer offering that enables us to develop strong, long-term relationships with our larger customers. Our digital capabilities, including our Total Control® platform, allow our sales teams to provide contactless end-to-end customer service;\n•\nThe further optimization of our customer mix and fleet mix, with a dual objective\n:\n to enhance our performance in serving our current customer base, and to focus on the accounts and customer types that are best suited to our strategy for profitable growth. We believe these efforts will lead to even better service of our target accounts, primarily large construction and industrial customers, as well as select local contractors. Our fleet team's analyses are aligned with these objectives to identify trends in equipment categories and define action plans that can generate improved returns;\n27\nTable of Contents\n•\nA continued focus on “Lean” management techniques, including kaizen processes focused on continuous improvement\n.\n We have a dedicated team responsible for reducing waste in our operational processes, with the objectives of: condensing the cycle time associated with preparing equipment for rent; optimizing our resources for delivery and pickup of equipment; improving the effectiveness and efficiency of our repair and maintenance operations; and implementing customer service best practices;\n•\nThe continued expansion and cross-selling of adjacent specialty and services products, which enables us to provide a “one-stop” shop for our customers\n. We believe that the expansion of our specialty business, as exhibited by our acquisition of Yak Access, LLC, Yak Mat, LLC and New South Access & Environmental Solutions, LLC (collectively, “Yak”) in March 2024, which is discussed in note 4 to the consolidated financial statements, as well as our tools and onsite services offerings, further positions United Rentals as a single source provider of total jobsite solutions through our extensive product and service resources and technology offerings; and\n•\nThe pursuit of strategic acquisitions to continue to expand our core equipment rental business,\n as exhibited by our acquisition of assets of Ahern Rentals, Inc. (“Ahern Rentals”) in December 2022, as well as the pending acquisition of H&E Equipment Services, Inc. d/b/a H&E Rentals (“H&E”) that is discussed below, which is expected to close in the first quarter of 2025. Strategic acquisitions allow us to invest our capital to expand our business, further driving our ability to accomplish our strategic goals.\nAs discussed below, fleet productivity is a comprehensive metric that reflects the combined impact of changes in rental rates, time utilization, and mix that contribute to the variance in owned equipment rental revenue. For the full year 2024: \n•\nEquipment rentals increased 8.0 percent year-over-year, including the impact of the Yak acquisition that is discussed in note 4 to the consolidated financial statements;\n•\nAverage OEC increased 3.5 percent year-over-year;\n•\nFleet productivity increased 4.1 percent including the impact of the Yak acquisition, and increased 2.7 percent excluding the impact of the Yak acquisition; and\n•\n68 percent of equipment rental revenue was derived from key accounts. Key accounts are each managed by a single point of contact to enhance customer service.\nPending Acquisition of H&E\nOn January 13, 2025, we entered into an Agreement and Plan of Merger (the “H&E Merger Agreement”) that provides for our acquisition of H&E. Pursuant to the H&E Merger Agreement, we expect to acquire H&E for $92 per share in cash, reflecting a total enterprise value of approximately $4.8 billion, including approximately $1.4 billion of net debt. H&E provides its customers with a comprehensive mix of high-quality general rental fleet including aerial work platforms, earthmoving equipment, material handling equipment, and other general and specialty lines of equipment. With approximately $2.9 billion of rental fleet at original cost as of September 30, 2024, H&E serves a diverse mix of customers across both construction and industrial markets through its network of approximately 160 branches in over 30 U.S. states. For the 12 months ending September 30, 2024, H&E had revenues of $1.518 billion. \nThe transaction is subject to customary closing conditions, including a minimum tender of at least one share more than 50 percent of then-outstanding H&E common shares and the expiration of the waiting period under the Hart-Scott-Rodino Antitrust Improvements Act of 1976. We commenced a tender offer on January 28, 2025 to acquire all of the outstanding shares of H&E common stock for $92 per share in cash. Following completion of the tender offer, we intend to acquire all remaining shares not tendered in the offer through a second-step merger at the same price as in the tender offer. The transaction is expected to close in the first quarter of 2025.\nFinancial Overview \nPrior to taking actions pertaining to our financial flexibility and liquidity, we assess our available sources and anticipated uses of cash, including, with respect to sources, cash generated from operations and from the sale of rental equipment. In 2024, we took the following actions to improve our financial flexibility and liquidity, and to position us to invest the necessary capital in our business (see note 12 to the consolidated financial statements for further discussion of our debt instruments):\n•\nIssued $1.1 billion aggregate principal amount of 6 \n1\n/\n8\n percent Senior Notes due 2034. The issued debt, together with drawings on our ABL facility, was used to fund the Yak acquisition that is discussed in note 4 to the consolidated financial statements;\n•\nAmended our term loan facility, primarily to extend the maturity date to February 2031 and to increase the facility size to $1.0 billion; and\n28\nTable of Contents\n•\nAmended our accounts receivable securitization facility, primarily to extend the maturity date and to increase the facility size from $1.3 billion to $1.5 billion. The facility expires in June 2025 and may be extended on a 364-day basis by mutual agreement with the purchasers under the facility.\nAs of December 31, 2024, we had available liquidity of $2.845 billion, comprised of cash and cash equivalents, and availability under the ABL and accounts receivable securitization facilities. \nIn October 2022, our Board of Directors authorized a $1.25 billion share repurchase program, which was completed in the first quarter of 2024. In January 2024, our Board of Directors authorized a $1.5 billion share repurchase program, and repurchases under this program began in March 2024, following the completion of the $1.25 billion program. We repurchased $1.25 billion under this program in 2024. We have paused repurchases under the program due to our pending acquisition of H&E. As discussed above, on January 13, 2025, we entered into a definitive merger agreement to acquire H&E, which is expected to close in the first quarter of 2025. We currently intend to complete the share repurchase program; however, we will re-evaluate the timing over which we expect to do so as we integrate H&E and assess other potential uses of capital. A 1 percent excise tax is imposed on “net repurchases” (certain purchases minus certain issuances) of common stock. The repurchases above (as well as the total program sizes) do not include the excise tax, which totaled $13 in 2024.\nOur Board of Directors also approved our first-ever quarterly dividend program in January 2023, and the first dividend under the program was paid in February 2023. We did not pay any dividends prior to 2023, and in 2024 and 2023, we paid dividends totaling $434 ($6.52 per share) and $406 ($5.92 per share), respectively. On January 29, 2025, our Board of Directors declared a quarterly dividend of $1.79 per share, payable on February 26, 2025 to stockholders of record as of February 12, 2025.\nNet income\n. Net income and diluted earnings per share for each of the three years in the period ended December 31, 2024 are presented below.\nYear Ended December 31,  \n2024\n2023\n2022\nNet income\n$\n2,575 \n$\n2,424 \n$\n2,105 \nDiluted earnings per share\n$\n38.69 \n$\n35.28 \n$\n29.65 \nNet income and diluted earnings per share for each of the three years in the period ended December 31, 2024 include the after-tax impacts of the items below. The tax rates applied to the items below reflect the statutory rates in the applicable entities.\nYear Ended December 31,  \n2024\n2023\n2022\nTax rate applied to items below\n25.3 \n%\n25.3 \n%\n25.3 \n%\nContribution to net income (after-tax)\nImpact on diluted earnings per share\nContribution to net income (after-tax)\nImpact on diluted earnings per share\nContribution to net income (after-tax)\nImpact on diluted earnings per share\nMerger related intangible asset amortization (1)\n$\n(143)\n$\n(2.14)\n$\n(160)\n$\n(2.33)\n$\n(126)\n$\n(1.79)\nImpact on depreciation related to acquired fleet and property and equipment (2)\n(102)\n(1.53)\n(113)\n(1.65)\n(40)\n(0.56)\nImpact of the fair value mark-up of acquired fleet (3)\n(47)\n(0.71)\n(81)\n(1.17)\n(20)\n(0.29)\nRestructuring charge (4)\n(2)\n(0.04)\n(21)\n(0.31)\n— \n— \nAsset impairment charge (5)\n(3)\n(0.05)\n— \n— \n(2)\n(0.03)\nLoss on repurchase/redemption/amendment of debt (6)\n(1)\n(0.01)\n— \n— \n(13)\n(0.18)\n \n(1)\nThis reflects the amortization of the intangible assets acquired in the major acquisitions that significantly impact our operations (the “major acquisitions,” each of which had annual revenues of over $200 prior to acquisition).\n(2)\nThis reflects the impact of extending the useful lives of equipment acquired in certain major acquisitions, net of the impact of additional depreciation associated with the fair value mark-up of such equipment. The increase in 2023 primarily reflects the impact of the Ahern Rentals acquisition.\n(3)\nThis reflects additional costs recorded in cost of rental equipment sales associated with the fair value mark-up of rental equipment acquired in certain major acquisitions that was subsequently sold. The year-over-year increase in 2023 and decrease in 2024 primarily reflect the impact of the Ahern Rentals acquisition. \n29\nTable of Contents\n(4)\nThis primarily reflects severance and branch closure charges associated with our restructuring programs. For additional information on the restructuring charges, which generally involve the closure of a large number of branches over a short period of time, often in periods following a major acquisition, see “Results of Operations-Other costs/(income)-restructuring charges” below. The amounts above primarily reflect charges associated with a restructuring program initiated following the closing of the Ahern Rentals acquisition. As of December 31, 2024, there were no open restructuring programs. \n(5)\nThis reflects write-offs of leasehold improvements and other fixed assets. \n(6)\nThis primarily reflects the difference between the net carrying amount and the total purchase price of the redeemed notes.\nEBITDA GAAP Reconciliations\n.\n EBITDA represents the sum of net income, provision for income taxes, interest expense, net, depreciation of rental equipment and non-rental depreciation and amortization. Adjusted EBITDA represents EBITDA plus the sum of the restructuring charge, stock compensation expense, net, and the impact of the fair value mark-up of acquired fleet. See below for further detail on each adjusting item. These items are excluded from adjusted EBITDA internally when evaluating our operating performance and for strategic planning and forecasting purposes, and allow investors to make a more meaningful comparison between our core business operating results over different periods of time, as well as with those of other similar companies. The net income and adjusted EBITDA margins represent net income or adjusted EBITDA divided by total revenue. Management believes that EBITDA and adjusted EBITDA, when viewed with the Company’s results under U.S. generally accepted accounting principles (“GAAP”) and the accompanying reconciliations, provide useful information about operating performance and period-over-period growth, and provide additional information that is useful for evaluating the operating performance of our core business without regard to potential distortions. Additionally, management believes that EBITDA and adjusted EBITDA help investors gain an understanding of the factors and trends affecting our ongoing cash earnings, from which capital investments are made and debt is serviced. However, EBITDA and adjusted EBITDA are not measures of financial performance or liquidity under GAAP and, accordingly, should not be considered as alternatives to net income or cash flow from operating activities as indicators of operating performance or liquidity. \nThe table below provides a reconciliation between net income and EBITDA and adjusted EBITDA:\nYear Ended December 31,  \n2024\n2023\n2022\nNet income\n$\n2,575 \n$\n2,424 \n$\n2,105 \nProvision for income taxes\n813 \n787 \n697 \nInterest expense, net\n691 \n635 \n445 \nDepreciation of rental equipment\n2,466 \n2,350 \n1,853 \nNon-rental depreciation and amortization\n437 \n431 \n364 \nEBITDA\n6,982\n \n6,627\n \n5,464\n \nRestructuring charge (1)\n3 \n28 \n— \nStock compensation expense, net (2)\n112 \n94 \n127 \nImpact of the fair value mark-up of acquired fleet (3)\n63 \n108 \n27 \nAdjusted EBITDA\n$\n7,160\n \n$\n6,857\n \n$\n5,618\n \nNet income margin\n16.8 \n%\n16.9 \n%\n18.1 \n%\nAdjusted EBITDA margin\n46.7 \n%\n47.8 \n%\n48.3 \n%\nThe table below provides a reconciliation between net cash provided by operating activities and EBITDA and adjusted EBITDA:\n30\nTable of Contents\nYear Ended December 31,  \n2024\n2023\n2022\nNet cash provided by operating activities\n$\n4,546 \n$\n4,704 \n$\n4,433 \nAdjustments for items included in net cash provided by operating activities but excluded from the calculation of EBITDA:\nAmortization of deferred financing costs and original issue discounts\n(15)\n(14)\n(13)\nGain on sales of rental equipment\n710 \n786 \n566 \nGain on sales of non-rental equipment\n17 \n21 \n9 \nInsurance proceeds from damaged equipment\n51 \n38 \n32 \nRestructuring charge (1)\n(3)\n(28)\n— \nStock compensation expense, net (2)\n(112)\n(94)\n(127)\nLoss on repurchase/redemption/amendment of debt (4)\n(1)\n— \n(17)\nChanges in assets and liabilities\n121 \n107 \n(151)\nCash paid for interest\n674 \n614 \n406 \nCash paid for income taxes, net\n994 \n493 \n326 \nEBITDA\n6,982\n \n6,627\n \n5,464\n \nAdd back:\nRestructuring charge (1)\n3 \n28 \n— \nStock compensation expense, net (2)\n112 \n94 \n127 \nImpact of the fair value mark-up of acquired fleet (3)\n63 \n108 \n27 \nAdjusted EBITDA\n$\n7,160\n \n$\n6,857\n \n$\n5,618\n \n_________________\n(1)\nThis primarily reflects severance and branch closure charges associated with our restructuring programs. For additional information on the restructuring charges, which generally involve the closure of a large number of branches over a short period of time, often in periods following a major acquisition, see “Results of Operations-Other costs/(income)-restructuring charges” below. The amounts above primarily reflect charges associated with a restructuring program initiated following the closing of the Ahern Rentals acquisition. As of December 31, 2024, there were no open restructuring programs.\n(2)\nRepresents non-cash, share-based payments associated with the granting of equity instruments.\n(3)\nThis reflects additional costs recorded in cost of rental equipment sales associated with the fair value mark-up of rental equipment acquired in certain major acquisitions that was subsequently sold. The year-over-year increase in 2023 and decrease in 2024 primarily reflect the impact of the Ahern Rentals acquisition.\n(4)\nThis primarily reflects the difference between the net carrying amount and the total purchase price of the redeemed notes. \nFor the year ended December 31, 2024, year-over-year, net income increased $151, or 6.2 percent, and net income margin decreased 10 basis points to 16.8 percent (because net income margin did not change significantly year-over-year, further explanation of the change is not included herein). For the year ended December 31, 2024, year-over-year, adjusted EBITDA increased $303, or 4.4 percent, and adjusted EBITDA margin decreased 110 basis points to 46.7 percent. \nThe year-over-year decrease in the adjusted EBITDA margin primarily reflects a 50 basis point decrease in equipment rentals gross margin (excluding depreciation and stock compensation expense) and a 600 basis point decrease in gross margin from sales of rental equipment (excluding the adjustment reflected in the table above for the impact of the fair value mark-up of acquired fleet). The decreased gross margin from equipment rentals (excluding depreciation and stock compensation expense) primarily reflects the (i) impact of a higher proportion of 2024 revenue from ancillary revenues, which generate lower margins than owned equipment rentals, (ii) inflation and (iii) normal cost variability. The decreased gross margin from sales of rental equipment (excluding the adjustment for the impact of the fair value mark-up of acquired fleet) primarily reflects the continued normalization of the used equipment market, including pricing. \nRevenues.\n Revenues for each of the three years in the period ended December 31, 2024 were as follows: \n \n31\nTable of Contents\nYear Ended December 31,\nChange \n2024\n2023\n2022\n2024\n2023\nEquipment rentals*\n$\n13,029 \n$\n12,064 \n$\n10,116 \n8.0%\n19.3%\nSales of rental equipment\n1,521 \n1,574 \n965 \n(3.4)%\n63.1%\nSales of new equipment\n282 \n218 \n154 \n29.4%\n41.6%\nContractor supplies sales\n155 \n146 \n126 \n6.2%\n15.9%\nService and other revenues\n358 \n330 \n281 \n8.5%\n17.4%\nTotal revenues\n$\n15,345\n \n$\n14,332\n \n$\n11,642\n \n7.1%\n23.1%\n*Equipment rentals variance components:\nYear-over-year change in average OEC\n3.5%\n21.9%\nAssumed year-over-year inflation impact (1)\n(1.5)%\n(1.5)%\nFleet productivity (2) \n4.1%\n(0.7)%\nContribution from ancillary and re-rent revenue (3)\n1.9%\n(0.4)%\nTotal change in equipment rentals\n8.0%\n19.3%\n*Pro forma equipment rentals variance components (4):\nYear-over-year change in average OEC \n10.4%\nAssumed year-over-year inflation impact (1) \n(1.5)%\nFleet productivity (2) \n2.8%\nContribution from ancillary and re-rent revenue (3) \n(0.4)%\nTotal change in equipment rentals \n11.3%\n_________________\n(1)\nReflects the estimated impact of inflation on the revenue productivity of fleet based on OEC, which is recorded at cost.\n(2)\nReflects the combined impact of changes in rental rates, time utilization, and mix that contribute to the variance in owned equipment rental revenue. See note 3 to the consolidated financial statements for a discussion of the different types of equipment rentals revenue. Rental rate changes are calculated based on the year-over-year variance in average contract rates, weighted by the prior period revenue mix. Time utilization is calculated by dividing the amount of time an asset is on rent by the amount of time the asset has been owned during the year. Mix includes the impact of changes in customer, fleet, geographic and segment mix. \n(3)\nReflects the combined impact of changes in the other types of equipment rentals revenue (see note 3 for further detail), excluding owned equipment rental revenue.\n(4)\nWe completed the acquisition of Ahern Rentals in December 2022. The pro forma information includes the standalone, pre-acquisition results of Ahern Rentals. Pro forma information is not reflected above for 2024 versus 2023 because Ahern Rentals was fully included in our results for both years. \nEquipment rentals include our revenues from renting equipment, as well as revenue related to the fees we charge customers: for equipment delivery and pick-up; to protect the customer against liability for damage to our equipment while on rent; for fuel; and for environmental costs. Collectively, these “ancillary fees” represented approximately 17 percent of equipment rental revenue in 2024. Delivery and pick-up revenue, which represented approximately eight percent of equipment rental revenue in 2024, is the most significant ancillary revenue component. Sales of rental equipment represent our revenues from the sale of used rental equipment. Sales of new equipment represent our revenues from the sale of new equipment. Contractor supplies sales represent our sales of supplies utilized by contractors, which include construction consumables, tools, small equipment and safety supplies. Services and other revenues primarily represent our revenues earned from providing repair and maintenance services on our customers’ fleet (including parts sales). See note 3 to our consolidated financial statements for further discussion of our revenue recognition accounting.\n2024 total revenues of $15.3 billion increased 7.1 percent compared with 2023. Equipment rentals and sales of rental equipment are our largest revenue types (together, they accounted for 95 percent of total revenue for the year ended December 31, 2024). Equipment rentals increased 8.0 percent, primarily due to a 4.1 percent increase in fleet productivity, which includes the impact of the Yak acquisition, and a 3.5 percent increase in average OEC. Fleet productivity increased 2.7 percent excluding the impact of the Yak acquisition. Sales of rental equipment did not change significantly year-over-year.\nCritical Accounting Policies \n32\nTable of Contents\nWe prepare our consolidated financial statements in accordance with GAAP. A summary of our significant accounting policies is contained in note 2 to our consolidated financial statements. In applying many accounting principles, we make assumptions, estimates and/or judgments. These assumptions, estimates and/or judgments are often subjective and may change based on changing circumstances or changes in our analysis. Material changes in these assumptions, estimates and/or judgments have the potential to materially alter our results of operations. We have identified below our accounting policies that we believe could potentially produce materially different results if we were to change underlying assumptions, estimates and/or judgments. Although actual results may differ from those estimates, we believe the estimates are reasonable and appropriate. \nAllowance for Credit Losses\n. We maintain allowances for credit losses. These allowances reflect our estimate of the amount of our receivables that we will be unable to collect based on historical write-off experience and, as applicable, current conditions and reasonable and supportable forecasts that affect collectibility. Our estimate could require change based on changing circumstances, including changes in the economy or in the particular circumstances of individual customers. Accordingly, we may be required to increase or decrease our allowances. Trade receivables that have contractual maturities of one year or less are written-off when they are determined to be uncollectible based on the criteria necessary to qualify as a deduction for federal tax purposes. Write-offs of such receivables require management approval based on specified dollar thresholds. See note 3 to our consolidated financial statements for further detail.\nUseful Lives and Salvage Values of Rental Equipment and Property and Equipment.\n We depreciate rental equipment and property and equipment over their estimated useful lives, after giving effect to an estimated salvage value which ranges from zero percent to 50 percent of cost. The weighted average salvage value of our rental equipment is 12 percent of cost (immaterial salvage values are assigned to our property and equipment). Rental equipment is depreciated whether or not it is out on rent.\nThe useful life of an asset is determined based on our estimate of the period over which the asset can generate revenues; such periods are periodically reviewed for reasonableness. In addition, the salvage value, which is also reviewed periodically for reasonableness, is determined based on our estimate of the minimum value we will realize from the asset after such period. We may be required to change these estimates based on changes in our industry or other changing circumstances. If these estimates change in the future, we may be required to recognize increased or decreased depreciation expense for these assets.\nTo the extent that the useful lives of all of our rental equipment were to increase or decrease by one year, we estimate that our annual depreciation expense would decrease or increase by approximately $297 or $391, respectively. If the estimated salvage values of all of our rental equipment were to increase or decrease by one percentage point, we estimate that our annual depreciation expense would change by approximately $29. Any change in depreciation expense as a result of a hypothetical change in either useful lives or salvage values would generally result in a proportional increase or decrease in the gross profit we would recognize upon the ultimate sale of the asset. To the extent that the useful lives of all of our depreciable property and equipment were to increase or decrease by one year, we estimate that our annual non-rental depreciation expense would decrease or increase by approximately $44 or $66, respectively.\nAcquisition Accounting\n. We have made a number of acquisitions in the past and may continue to make acquisitions in the future. The assets acquired and liabilities assumed are recorded based on their respective fair values at the date of acquisition. Long-lived assets (principally rental equipment), goodwill and other intangible assets generally represent the largest components of our acquisitions. Rental equipment is valued utilizing either a cost, market or income approach, or a combination of certain of these methods, depending on the asset being valued and the availability of market or income data. Goodwill is calculated as the excess of the cost of the acquired business over the net of the fair value of the assets acquired and the liabilities assumed. The intangible assets that we have acquired are non-compete agreements, customer relationships and trade names and associated trademarks. The estimated fair values of these intangible assets reflect various assumptions about discount rates, revenue growth rates, operating margins, terminal values, useful lives and other prospective financial information. Non-compete agreements, customer relationships and trade names and associated trademarks are valued based on an excess earnings or income approach based on projected cash flows.\nDetermining the fair value of the assets and liabilities acquired can be judgmental in nature and can involve the use of significant estimates and assumptions. The significant judgments include estimation of future cash flows, which is dependent on forecasts; estimation of the long-term rate of growth; estimation of the useful life over which cash flows will occur; and determination of a risk-adjusted weighted average cost of capital. When appropriate, our estimates of the fair values of assets and liabilities acquired include assistance from independent third-party appraisal firms. The judgments made in determining the estimated fair value assigned to the assets acquired, as well as the estimated life of the assets, can materially impact net income in periods subsequent to the acquisition through depreciation and amortization, and in certain instances through impairment charges, if the asset becomes impaired in the future. As discussed below, we regularly review for impairments.\n33\nTable of Contents\nWhen we make an acquisition, we also acquire other assets and assume liabilities. These other assets and liabilities typically include, but are not limited to, parts inventory, accounts receivable, accounts payable and other working capital items. Because of their short-term nature, the fair values of these other assets and liabilities generally approximate the book values on the acquired entities' balance sheets.  \nEvaluation of Goodwill Impairment\n. Goodwill is tested for impairment annually or more frequently if an event or circumstance indicates that an impairment loss may have been incurred. Application of the goodwill impairment test requires judgment, including: the identification of reporting units; assignment of assets and liabilities to reporting units; assignment of goodwill to reporting units; determination of the fair value of each reporting unit; and an assumption as to the form of the transaction in which the reporting unit would be acquired by a market participant (either a taxable or nontaxable transaction). \nWhen conducting the goodwill impairment test, we are required to compare the fair value of our reporting units (which are our regions) with the carrying amount. As discussed in note 5 to our consolidated financial statements, our divisions are our operating segments. We conduct the goodwill impairment test at the reporting unit level, which is one level below the operating segment level. \nFinancial Accounting Standards Board (“FASB”) guidance permits entities to first assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount. We estimate the fair value of our reporting units using a combination of an income approach based on the present value of estimated future cash flows and a market approach based on market price data of shares of our Company and other corporations engaged in similar businesses as well as acquisition multiples paid in recent transactions. We believe this approach, which utilizes multiple valuation techniques, yields the most appropriate evidence of fair value. \nInherent in our preparation of cash flow projections are assumptions and estimates derived from a review of our operating results, business plans, expected growth rates, cost of capital and tax rates. We also make certain forecasts about future economic conditions, interest rates and other market data. Many of the factors used in assessing fair value are outside the control of management, and these assumptions and estimates may change in future periods. Changes in assumptions or estimates could materially affect the estimate of the fair value of a reporting unit, and therefore could affect the likelihood and amount of potential impairment. The following assumptions are significant to our income approach:\n    \nBusiness Projections\n- We make assumptions about the level of equipment rental activity in the marketplace and cost levels. These assumptions drive our planning assumptions for pricing and utilization and also represent key inputs for developing our cash flow projections. These projections are developed using our internal business plans over a ten-year planning period that are updated at least annually; \n    \nLong-term Growth Rates\n- Beyond the planning period, we also utilize an assumed long-term growth rate representing the expected rate at which a reporting unit's cash flow stream is projected to grow. These rates are used to calculate the terminal value of our reporting units, and are added to the cash flows projected during our ten-year planning period; and \n    \nDiscount Rates\n- Each reporting unit's estimated future cash flows are discounted at a rate that is consistent with a weighted-average cost of capital that is likely to be expected by market participants. The weighted-average cost of capital is an estimate of the overall after-tax rate of return required by equity and debt holders of a business enterprise. \nThe market approach is one of the other methods used for estimating the fair value of our reporting units' business enterprise. This approach takes two forms: The first is based on the market value (market capitalization plus interest-bearing liabilities) and operating metrics (e.g., revenue and EBITDA) of companies engaged in the same or similar line of business. The second form is based on multiples paid in recent acquisitions of companies. \nIn connection with our goodwill impairment test that was conducted as of October 1, 2024, we bypassed the optional qualitative assessment for each reporting unit and quantitatively compared the fair values of our reporting units with their carrying amounts. Our goodwill impairment testing as of this date indicated that all of our reporting units, including our Matting Solutions reporting unit, which was created following the March 2024 acquisition of Yak that is discussed in note 4 to the consolidated financial statements and which includes the assets acquired in the Yak acquisition, and our Mobile Storage reporting unit, which is discussed below associated with the goodwill impairment test that was conducted as of October 1, 2023, had estimated fair values which exceeded their respective carrying amounts by at least 60 percent.\nIn connection with our goodwill impairment test that was conducted as of October 1, 2023, we bypassed the optional qualitative assessment for each reporting unit and quantitatively compared the fair values of our reporting units with their carrying amounts. Our goodwill impairment testing as of this date indicated that all of our reporting units, excluding our Mobile Storage reporting unit, had estimated fair values which exceeded their respective carrying amounts by at least 54 percent. We \n34\nTable of Contents\ncompleted the acquisition of General Finance in May 2021, and all of the assets in the Mobile Storage reporting unit were acquired in the General Finance acquisition. The estimated fair value of our Mobile Storage reporting unit exceeded its carrying amount by eight percent. As all of the assets in the Mobile Storage reporting unit were recorded at fair value as of the May 2021 acquisition date, we expected the percentage by which the fair value for this reporting unit exceeded the carrying value to be significantly less than the equivalent percentages determined for our other reporting units. \nImpairment of Long-lived Assets (Excluding Goodwill).\n We review the recoverability of our rental equipment, property and equipment, lease assets and other intangible assets when events or changes in circumstances occur that indicate that the carrying value of the assets may not be recoverable. If there are such indications, we assess our ability to recover the carrying value of the assets from their expected future pre-tax cash flows (undiscounted and without interest charges). If the expected cash flows are less than the carrying value of the assets, an impairment loss is recognized for the difference between the estimated fair value and carrying value. We also conduct impairment reviews in connection with branch consolidations and other changes in our business. During each of the three years in the period ended December 31, 2024, we recognized asset impairment charges, primarily in depreciation of rental equipment in our consolidated statements of income, that were not significant to our operating results ($4 or less for each year).\nIn support of our review for indicators of impairment, we perform a review of all assets at the district level relative to district performance and conclude whether indicators of impairment exist associated with our long-lived assets, including rental equipment. We also specifically review the financial performance of our rental equipment. Such review includes an estimate of the future rental revenues from our rental assets based on current and expected utilization levels, the age of the assets and their remaining useful lives. Additionally, we estimate when the assets are expected to be removed or retired from our rental fleet as well as the expected proceeds to be realized upon disposition. Based on our most recently completed quarterly reviews, there were no indications of impairment associated with our rental equipment, property and equipment, lease assets or other intangible assets.\nIncome Taxes\n. We recognize deferred tax assets and liabilities for certain future deductible or taxable temporary differences expected to be reported in our income tax returns. These deferred tax assets and liabilities are computed using the tax rates that are expected to apply in the periods when the related future deductible or taxable temporary difference is expected to be settled or realized. In the case of deferred tax assets, the future realization of the deferred tax benefits and carryforwards are determined with consideration to historical profitability, projected future taxable income, the expected timing of the reversals of existing temporary differences, and tax planning strategies. After consideration of all these factors, we recognize deferred tax assets when we believe that it is more likely than not that we will realize them. The most significant positive evidence that we consider in the recognition of deferred tax assets is the expected reversal of cumulative deferred tax liabilities resulting from book versus tax depreciation of our rental equipment fleet that is well in excess of the deferred tax assets. \nWe use a two-step approach for recognizing and measuring tax benefits taken or expected to be taken in a tax return regarding uncertainties in income tax positions. The first step is recognition: we determine whether it is more likely than not that a tax position will be sustained upon examination, including resolution of any related appeals or litigation processes, based on the technical merits of the position. In evaluating whether a tax position has met the more-likely-than-not recognition threshold, we presume that the position will be examined by the appropriate taxing authority with full knowledge of all relevant information. The second step is measurement: a tax position that meets the more-likely-than-not recognition threshold is measured to determine the amount of benefit to recognize in the financial statements. The tax position is measured at the largest amount of benefit that is greater than 50 percent likely of being realized upon ultimate settlement. \nWe are subject to ongoing tax examinations and assessments in various jurisdictions. Accordingly, accruals for tax contingencies are established based on the probable outcomes of such matters. Our ongoing assessments of the probable outcomes of the examinations and related tax accruals require judgment and could increase or decrease our effective tax rate as well as impact our operating results. \nWe have historically considered the undistributed earnings of our foreign subsidiaries to be indefinitely reinvested, and, accordingly, no taxes were provided on such earnings prior to the fourth quarter of 2020. In 2021, we remitted the cumulative amount of identified cash in our foreign operations in excess of near-term working capital needs. The taxes recorded associated with the remitted cash were immaterial. We continue to expect that the remaining balance of our undistributed foreign earnings will be indefinitely reinvested. If we determine that all or a portion of such foreign earnings are no longer indefinitely reinvested, we may be subject to additional foreign withholding taxes and U.S. state income taxes.\nResults of Operations \nAs discussed in note 5 to our consolidated financial statements, our reportable segments are general rentals and specialty. The general rentals segment includes the rental of construction, aerial, industrial and homeowner equipment and related services and activities. The general rentals segment’s customers include construction and industrial companies, manufacturers, \n35\nTable of Contents\nutilities, municipalities, homeowners and government entities. This segment operates throughout the United States and Canada. The specialty segment rents products (and provides setup and other services on such rented equipment) including (i) trench safety equipment, such as trench shields, aluminum hydraulic shoring systems, slide rails, crossing plates, construction lasers and line testing equipment for underground work, (ii) power and HVAC equipment, such as portable diesel generators, electrical distribution equipment, and temperature control equipment, (iii) fluid solutions equipment primarily used for fluid containment, transfer and treatment, (iv) mobile storage equipment and modular office space, and (v) surface protection mats. The specialty segment’s customers include construction companies involved in infrastructure projects, municipalities and industrial companies. This segment primarily operates in the United States and Canada, and has a smaller presence in Europe, Australia and New Zealand. \nAs discussed in note 5 to our consolidated financial statements, our general rentals reporting segment reflects the aggregation of four geographic divisions—Central, Northeast, Southeast and West. Historically, there have occasionally been variances in the levels of equipment rentals gross margins achieved by these divisions, though such variances have generally been small (close to or less than 10 percent, measured versus the equipment rentals gross margins of the aggregated general rentals' divisions). For the five year period ended December 31, 2024, there was no general rentals' division with an equipment rentals gross margin that differed materially from the equipment rentals gross margin of the aggregated general rentals' divisions. The rental industry is cyclical, and there historically have occasionally been divisions with equipment rentals gross margins that varied by greater than 10 percent from the equipment rentals gross margins of the aggregated general rentals' divisions, though the specific divisions with margin variances of over 10 percent have fluctuated, and such variances have generally not exceeded 10 percent by a significant amount. We monitor the margin variances and confirm margin similarity between divisions on a quarterly basis.\nWe believe that the divisions that are aggregated into our segments have similar economic characteristics, as each division is capital intensive, offers similar products to similar customers, uses similar methods to distribute its products, and is subject to similar competitive risks. The aggregation of our divisions also reflects the management structure that we use for making operating decisions and assessing performance. Although we believe aggregating these divisions into our reporting segments for segment reporting purposes is appropriate, to the extent that there are significant margin variances that do not converge, we may be required to disaggregate the divisions into separate reporting segments. Any such disaggregation would have no impact on our consolidated results of operations.\nThese reporting segments align our external segment reporting with how management evaluates business performance and allocates resources. We evaluate segment performance primarily based on segment equipment rentals gross profit. Our revenues, operating results, and financial condition fluctuate from quarter to quarter reflecting the seasonal rental patterns of our customers, with rental activity tending to be lower in the winter.\nRevenues by segment were as follows: \n \n36\nTable of Contents\nGeneral \nrentals\nSpecialty\nTotal\nYear Ended December 31, 2024\nEquipment rentals\n$\n8,945 \n$\n4,084 \n$\n13,029 \nSales of rental equipment\n1,328 \n193 \n1,521 \nSales of new equipment\n159 \n123 \n282 \nContractor supplies sales\n87 \n68 \n155 \nService and other revenues\n326 \n32 \n358 \nTotal revenue\n$\n10,845 \n$\n4,500 \n$\n15,345 \nYear Ended December 31, 2023\nEquipment rentals\n$\n8,803 \n$\n3,261 \n$\n12,064 \nSales of rental equipment\n1,411 \n163 \n1,574 \nSales of new equipment\n95 \n123 \n218 \nContractor supplies sales\n89 \n57 \n146 \nService and other revenues\n299 \n31 \n330 \nTotal revenue\n$\n10,697 \n$\n3,635 \n$\n14,332 \nYear Ended December 31, 2022\nEquipment rentals\n$\n7,345 \n$\n2,771 \n$\n10,116 \nSales of rental equipment\n835 \n130 \n965 \nSales of new equipment\n73 \n81 \n154 \nContractor supplies sales\n81 \n45 \n126 \nService and other revenues\n250 \n31 \n281 \nTotal revenue\n$\n8,584 \n$\n3,058 \n$\n11,642 \nEquipment rentals.\n \nEquipment rentals represented 85 percent of total revenues in 2024. 2024 equipment rentals of $13.0 billion increased 8.0 percent year-over-year, primarily due to a 4.1 percent increase in fleet productivity, which includes the impact of the Yak acquisition, and a 3.5 percent increase in average OEC. Fleet productivity increased 2.7 percent excluding the impact of the Yak acquisition. \nOn a segment basis, equipment rentals represented 82 percent and 91 percent of total revenues for general rentals and specialty, respectively. General rentals equipment rentals increased 1.6 percent as compared to 2023. Specialty rentals increased 25.2 percent as compared to 2023, primarily due to the impact of the Yak acquisition and increased average OEC. Specialty equipment rentals increased 16.9 percent year-over-year excluding the revenue from the acquired Yak locations. \nSales of rental equipment\n.\n For the three years in the period ended December 31, 2024, sales of rental equipment represented approximately 10 percent of our total revenues. 2024 sales of rental equipment of $1.5 billion did not change significantly year-over-year.\nSales of new equipment\n.\n For the three years in the period ended December 31, 2024, sales of new equipment represented approximately 2 percent of our total revenues. 2024 sales of new equipment of $282 increased 29.4 percent from 2023, primarily due to the impact of the Yak acquisition and supply chain normalization.\nContractor supplies sales\n.\n For the three years in the period ended December 31, 2024, sales of contractor supplies represented approximately 1 percent of our total revenues. 2024 sales of contractor supplies did not change significantly from 2023. \nService and other revenues\n.\n For the three years in the period ended December 31, 2024, service and other revenues represented approximately 2 percent of our total revenues. 2024 service and other revenues did not change significantly from 2023.\n \nFourth Quarter Items\n. There were no unusual or infrequently occurring items recognized in the fourth quarter of 2024 or 2023 that had a material impact on our financial statements. \n \nSegment Equipment Rentals Gross Profit\n37\nTable of Contents\nSee note 5 to our consolidated financial statements for additional information on segment performance. Segment equipment rentals gross profit and gross margin for each of the three years in the period ended December 31, 2024 were as follows: \nGeneral \nrentals\nSpecialty\nTotal\n2024\nEquipment Rentals Gross Profit\n$\n3,232 \n$\n1,966 \n$\n5,198 \nEquipment Rentals Gross Margin\n36.1 \n%\n48.1 \n%\n39.9 \n%\n2023\nEquipment Rentals Gross Profit\n$\n3,219 \n$\n1,595 \n$\n4,814 \nEquipment Rentals Gross Margin\n36.6 \n%\n48.9 \n%\n39.9 \n%\n2022\nEquipment Rentals Gross Profit\n$\n2,905 \n$\n1,340 \n$\n4,245 \nEquipment Rentals Gross Margin\n39.6 \n%\n48.4 \n%\n42.0 \n%\nGeneral rentals.\n For the three years in the period ended December 31, 2024, general rentals accounted for 71 percent of total equipment rentals and 66 percent of total equipment rentals gross profit. For the year ended December 31, 2024, general rentals’ equipment rentals gross profit increased by $13, and equipment rentals gross margin decreased by 50 basis points, from 2023, primarily due to the impact of inflation and normal cost variability, including increases in insurance and certain other costs. \nSpecialty\n. For the year ended December 31, 2024, equipment rentals gross profit increased by $371, and equipment rentals gross margin decreased by 80 basis points from 2023. Gross margin decreased primarily due to increased depreciation expense, which largely reflected the impact of the Yak acquisition.\nGross Margin\n. Gross margins by revenue classification were as follows: \n \nYear Ended December 31, \nChange\n2024\n2023\n2022\n2024\n2023\nTotal gross margin\n40.1%\n40.6%\n42.9%\n(50) bps\n(230) bps\nEquipment rentals\n39.9%\n39.9%\n42.0%\n— bps\n(210) bps\nSales of rental equipment\n46.7%\n49.9%\n58.7%\n(320) bps\n(880) bps\nSales of new equipment\n18.8%\n17.9%\n19.5%\n90 bps\n(160) bps\nContractor supplies sales\n33.5%\n32.2%\n33.3%\n130 bps\n(110) bps\nService and other revenues\n38.3%\n38.5%\n40.2%\n(20) bps\n(170) bps\n2024 gross margin of 40.1 percent decreased 50 basis points from 2023. Equipment rentals gross margin for 2024 was flat year-over-year. Gross margin from sales of rental equipment decreased 320 basis points from 2023, which primarily reflected the continued normalization of the used equipment market, including pricing. The gross margin fluctuations from sales of new equipment, contractor supplies sales and service and other revenues generally reflect normal variability, and such revenue types did not account for a significant portion of total gross profit (gross profit for these revenue types represented 4 percent of total gross profit for the year ended December 31, 2024). \nOther costs/(income)\nThe table below includes the other costs/(income) in our consolidated statements of income, as well as key associated metrics, for the three years in the period ended December 31, 2024: \n \n38\nTable of Contents\nYear Ended December 31,\nChange \n2024\n2023\n2022\n2024\n2023\nSelling, general and administrative (“SG&A”) expense\n$\n1,645 \n$\n1,527 \n$\n1,400 \n7.7%\n9.1%\nSG&A expense as a percentage of revenue\n10.7 \n%\n10.7 \n%\n12.0 \n%\n— bps\n(130) bps\nRestructuring charge\n3 \n28 \n— \n(89.3)%\n—\nNon-rental depreciation and amortization\n437 \n431 \n364 \n1.4%\n18.4%\nInterest expense, net\n691 \n635 \n445 \n8.8%\n42.7%\nOther income, net\n(14)\n(19)\n(15)\n(26.3)%\n26.7%\nProvision for income taxes\n813 \n787 \n697 \n3.3%\n12.9%\nEffective tax rate\n24.0 \n%\n24.5 \n%\n24.9 \n%\n(50) bps\n(40) bps\nSG&A expense\n primarily includes sales force compensation, information technology costs, third party professional fees, management salaries, bad debt expense and clerical and administrative overhead. SG&A expense as a percentage of revenue for the year ended December 31, 2024 was flat year-over-year.\nThe \nrestructuring charges\n primarily reflect severance and branch closure charges associated with our restructuring programs. We incur severance costs and branch closure charges in the ordinary course of our business. We only include such costs that are part of a restructuring program as restructuring charges. The designated restructuring programs generally involve the closure of a large number of branches over a short period of time, often in periods following a major acquisition, and result in significant costs that we would not normally incur absent a major acquisition or other triggering event that results in the initiation of a restructuring program. The year-over-year decrease in restructuring charges for the year ended December 31, 2024 primarily reflects 2023 charges associated with the restructuring program initiated following the December 2022 acquisition of Ahern Rentals. Since the first such program was initiated in 2008, we have completed seven restructuring programs and have incurred total restructuring charges of $383. We currently have no open restructuring programs, and the total liability associated with our restructuring programs was $17 as of December 31, 2024.\nNon-rental depreciation and amortization\n includes (i) the amortization of other intangible assets and (ii) depreciation expense associated with equipment that is not offered for rent (such as computers and office equipment) and amortization expense associated with leasehold improvements. Our other intangible assets consist of customer relationships, non-compete agreements and trade names and associated trademarks.\nInterest expense, net\n for the year ended December 31, 2024 increased by 8.8 percent year-over-year primarily due to increased average debt, including the debt issued to partially fund the Yak acquisition discussed above.\nOther income, net\n primarily includes (i) currency gains and losses, (ii) finance charges, (iii) gains and losses on sales of non-rental equipment and (iv) other miscellaneous items.\nA detailed reconciliation of the \neffective tax rates\n to the U.S. federal statutory income tax rate is included in note 14 to our consolidated financial statements.\nBalance sheet.\n Prepaid expenses and other assets increased by $100, or 74.1 percent, from December 31, 2023 to December 31, 2024, primarily due to an increase in income taxes receivable which reflected required tax payments exceeding the estimated tax accruals (see note 6 to the consolidated financial statements for further detail). Operating lease right-of-use assets increased by $238, or 21.7 percent, and operating lease liabilities increased by $194, or 21.7 percent, from December 31, 2023 to December 31, 2024, and both increases primarily reflected increased amounts of real estate and equipment leased under operating leases. Accounts payable decreased by $157, or 17.3 percent, from December 31, 2023 to December 31, 2024, primarily reflecting normal variability in business activity and the timing of payments. See the consolidated statements of cash flows for further information on changes in cash and cash equivalents, the consolidated statements of stockholders’ equity for further information on changes in stockholders’ equity, note 8 for further detail on property and equipment, net, note 9 for further detail on goodwill, note 10 for further detail on accrued expenses and other liabilities, and note 12 for further detail on short-term and long-term debt.  \nLiquidity and Capital Resources. \nWe manage our liquidity using internal cash management practices, which are subject to (i) the policies and cooperation of the financial institutions we utilize to maintain and provide cash management services, (ii) the terms and other requirements of the agreements to which we are a party and (iii) the statutes, regulations and practices of each of the local jurisdictions in which we operate. See “Financial Overview” above for a summary of the 2024 capital structure actions taken to improve our financial flexibility and liquidity. \n39\nTable of Contents\nIn October 2022, our Board of Directors authorized a $1.25 billion share repurchase program, which was completed in the first quarter of 2024. In January 2024, our Board of Directors authorized a $1.5 billion share repurchase program, and repurchases under this program began in March 2024, following the completion of the $1.25 billion program. We repurchased $1.25 billion under this program in 2024. We have paused repurchases under the program due to our pending acquisition of H&E. As discussed in note 19 to the consolidated financial statements, on January 13, 2025, we entered into a definitive merger agreement to acquire H&E, which is expected to close in the first quarter of 2025. We currently intend to complete the share repurchase program; however, we will re-evaluate the timing over which we expect to do so as we integrate H&E and assess other potential uses of capital. A 1 percent excise tax is imposed on “net repurchases” (certain purchases minus certain issuances) of common stock. The repurchases above (as well as the total program sizes) do not include the excise tax, which totaled $13 in 2024. Since 2012, we have repurchased a total of $7.478 billion (inclusive of immaterial excise taxes, which were first imposed in 2023) of Holdings' common stock under our share repurchase programs (comprised of eight programs that have ended and the current program).\nOur Board of Directors also approved our first-ever quarterly dividend program in January 2023, and the first dividend under the program was paid in February 2023. We did not pay any dividends prior to 2023, and during 2024 and 2023, we paid dividends totaling $434 ($6.52 per share) and $406 ($5.92 per share), respectively. On January 29, 2025, our Board of Directors declared a quarterly dividend of $1.79 per share, payable on February 26, 2025 to stockholders of record as of February 12, 2025.\nOur principal existing sources of cash are cash generated from operations and from the sale of rental equipment, and borrowings available under our ABL and accounts receivable securitization facilities. As of December 31, 2024, we had cash and cash equivalents of $457. Cash equivalents at December 31, 2024 consist of direct obligations of financial institutions rated A or better. We believe that our existing sources of cash will be sufficient to support our existing operations over the next 12 months. The table below presents financial information associated with our principal sources of cash as of and for the year December 31, 2024:\nABL facility:\nBorrowing capacity, net of letters of credit\n$\n1,973 \nOutstanding debt, net of debt issuance costs (1)\n2,253 \nInterest rate at December 31, 2024\n5.6 \n%\nAverage month-end principal amount of debt outstanding (1)\n1,634 \nWeighted-average interest rate on average debt outstanding\n6.2 \n%\nMaximum month-end principal amount of debt outstanding (1)\n2,259 \nAccounts receivable securitization facility (2):\nBorrowing capacity\n415 \nOutstanding debt, net of debt issuance costs\n1,085 \nInterest rate at December 31, 2024\n5.4 \n%\nAverage month-end principal amount of debt outstanding (3)\n1,219 \nWeighted-average interest rate on average debt outstanding\n6.1 \n%\nMaximum month-end principal amount of debt outstanding (3)\n1,424 \n_________________\n(1)    The outstanding and maximum amounts of debt under the ABL facility exceeded the average outstanding amount primarily due to the use of borrowings under the facility to fund seasonal expenditures and acquisition activity. \n(2)    As discussed in note 12 to the consolidated financial statements, the accounts receivable securitization facility expires on June 24, 2025 and may be extended on a 364-day basis by mutual agreement with the purchasers under the facility. \n(3)    The maximum amount of debt under the accounts receivable securitization facility exceeded the average outstanding amount primarily due to normal usage of increased availability under the facility. Borrowings under the accounts receivable securitization facility are permitted only to the extent that the face amount of the receivables in the collateral pool, net of applicable reserves and other deductions, exceeds the outstanding loans. The maximum amount of debt above reflects normal usage of the available borrowings based on the amount of the receivables in the collateral pool (see note 12 to the consolidated financial statements for further detail). In May 2024, the accounts receivable securitization facility was amended, primarily to extend the maturity date and to increase the facility size from $1.3 billion to $1.5 billion, which also contributed to the difference in the average and maximum amounts outstanding.\n40\nTable of Contents\nWe expect that our principal short-term (over the next 12 months) and long-term needs for cash relating to our operations will be to fund (i) operating activities and working capital, (ii) the purchase of rental equipment and inventory items offered for sale, (iii) payments due under operating leases, (iv) debt service, (v) debt repayment or redemption, (vi) share repurchases, (vii) dividends and (viii) acquisitions. We plan to fund such cash requirements from our existing sources of cash. We may also seek additional financing through the securitization of some of our real estate, the use of additional operating leases or other financing sources as market conditions permit, and the financing for our pending acquisition of H&E may include the issuance of debt securities and/or term loan borrowings. The table below presents information on payments coming due under the most significant categories of our needs for cash (excluding operating cash flows pertaining to normal business operations, such as human capital costs, which are not accurately estimable) as of December 31, 2024:\n2025\n2026\n2027\n2028\n2029\nThereafter\nTotal \nDebt and finance leases (1)\n$\n1,178 \n$\n77 \n$\n3,571 \n$\n1,707 \n$\n1,513 \n$\n5,426 \n$\n13,472 \nInterest due on debt (2)\n659 \n632 \n546 \n364 \n354 \n482 \n3,037 \nOperating leases (1)\n351 \n318 \n266 \n212 \n152 \n300 \n1,599 \nPurchase obligations (3)\n3,469 \n10 \n— \n— \n— \n— \n3,479 \n \n_________________\n(1)    The payments due with respect to a period represent (i) in the case of debt and finance leases, the scheduled principal payments due in such period, and (ii) in the case of operating leases, the payments due in such period for non-cancelable operating leases with initial or remaining terms of one year or more. See note 12 to the consolidated financial statements for further debt information, and note 13 for further finance lease and operating lease information.\n(2)    Estimated interest payments have been calculated based on the principal amount of debt and the applicable interest rates as of December 31, 2024. \n(3)    As of December 31, 2024, we had outstanding advance purchase orders, which were negotiated in the ordinary course of business, with our equipment and inventory suppliers. These purchase orders can generally be cancelled by us without cancellation penalties. The equipment and inventory receipts from the suppliers pursuant to these purchase orders and the related payments to the suppliers are expected to be completed primarily throughout 2025.\nThe amount of our future capital expenditures will depend on a number of factors, including general economic conditions and growth prospects. We expect that we will fund such expenditures from cash generated from operations, proceeds from the sale of rental and non-rental equipment and, if required, borrowings available under the ABL and accounts receivable securitization facilities. Net payments for rental capital expenditures (defined as payments for purchases of rental equipment less the proceeds from sales of rental equipment) were $2.232 billion, $2.140 billion and $2.471 billion in 2024, 2023 and 2022, respectively. \nTo access the capital markets, we rely on credit rating agencies to assign ratings to our securities as an indicator of credit quality. Lower credit ratings generally result in higher borrowing costs and reduced access to debt capital markets. Credit ratings also affect the costs of derivative transactions, including interest rate and foreign currency derivative transactions. As a result, negative changes in our credit ratings could adversely impact our costs of funding. Our credit ratings as of January 27, 2025 were as follows: \n \nCorporate Rating\nOutlook \nMoody’s\nBa1\nStable\nStandard & Poor’s\nBB+\nStable\nA security rating is not a recommendation to buy, sell or hold securities. There is no assurance that any rating will remain in effect for a given period of time or that any rating will not be revised or withdrawn by a rating agency in the future. \nLoan Covenants and Compliance.\n As of December 31, 2024, we were in compliance with the covenants and other provisions of the ABL, accounts receivable securitization and term loan facilities and the senior notes. Any failure to be in compliance with any material provision or covenant of these agreements could have a material adverse effect on our liquidity and operations. \nThe only financial covenant that currently exists under the ABL facility is the fixed charge coverage ratio. Subject to certain limited exceptions specified in the ABL facility, the fixed charge coverage ratio covenant under the ABL facility will only apply in the future if specified availability under the ABL facility falls below 10 percent of the maximum revolver amount under the ABL facility. When certain conditions are met, cash and cash equivalents and borrowing base collateral in excess of the ABL facility size may be included when calculating specified availability under the ABL facility. As of December 31, 2024, specified availability under the ABL facility exceeded the required threshold and, as a result, this financial covenant was inapplicable. Under our accounts receivable securitization facility, we are required, among other things, to maintain certain \n41\nTable of Contents\nfinancial tests relating to: (i) the default ratio, (ii) the delinquency ratio, (iii) the dilution ratio and (iv) days sales outstanding. The accounts receivable securitization facility also requires us to comply with the fixed charge coverage ratio under the ABL facility, to the extent the ratio is applicable under the ABL facility.\nCovenants in the agreements governing our ABL facility, term loan facility and certain other debt instruments impose limitations on our ability to make share repurchases and dividend payments, subject to important exceptions that would allow us to make such repurchases or payments under certain conditions. Based on our current total indebtedness leverage ratio (as defined in the applicable debt agreements) and usage of the ABL facility as of December 31, 2024, we met the criteria under the applicable debt agreements for these exceptions, and as a result we were not restricted in our ability to make share repurchases and dividend payments. \nSources and Uses of Cash\n. During 2024, we (i) generated cash from operating activities of $4.546 billion, (ii) generated cash from the sale of rental and non-rental equipment of $1.588 billion and (iii) received cash from debt proceeds, net of payments, of $1.748 billion. We used cash during this period principally to (i) make payments for purchases of rental and non-rental equipment and intangible assets of $4.127 billion, (ii) purchase other companies for $1.655 billion, (iii) purchase shares of our common stock for $1.571 billion and (iv) pay dividends of $434. During 2023, we (i) generated cash from operating activities of $4.704 billion and (ii) generated cash from the sale of rental and non-rental equipment of $1.634 billion. We used cash during this period principally to (i) make payments for purchases of rental and non-rental equipment and intangible assets of $4.070 billion, (ii) purchase other companies for $574, (iii) purchase shares of our common stock for $1.070 billion and (iv) pay dividends of $406. \nFree Cash Flow GAAP Reconciliation \nWe define “free cash flow” as net cash provided by operating activities less payments for purchases of, and plus proceeds from, equipment and intangible assets. The equipment and intangible asset items are included in cash flows from investing activities. Management believes that free cash flow provides useful additional information concerning cash flow available to meet future debt service obligations and working capital requirements. However, free cash flow is not a measure of financial performance or liquidity under GAAP. Accordingly, free cash flow should not be considered an alternative to net income or cash flow from operating activities as an indicator of operating performance or liquidity. The table below provides a reconciliation between net cash provided by operating activities and free cash flow.\n \nYear Ended December 31, \n2024\n2023\n2022\nNet cash provided by operating activities\n$\n4,546\n \n$\n4,704\n \n$\n4,433\n \nPayments for purchases of rental equipment\n(3,753)\n(3,714)\n(3,436)\nPayments for purchases of non-rental equipment and intangible assets\n(374)\n(356)\n(254)\nProceeds from sales of rental equipment\n1,521 \n1,574 \n965 \nProceeds from sales of non-rental equipment\n67 \n60 \n24 \nInsurance proceeds from damaged equipment\n51 \n38 \n32 \nFree cash flow\n$\n2,058\n \n$\n2,306\n \n$\n1,764\n \nFree cash flow for the year ended December 31, 2024 was $2.058 billion, a decrease of $248 as compared to $2.306 billion for the year ended December 31, 2023. Free cash flow decreased primarily due to lower cash provided by operating activities, which largely reflected the impact of higher cash tax payments and other working capital activities, partially offset by increased net income.  \nRelationship between Holdings and URNA\n. Holdings is principally a holding company and primarily conducts its operations through its wholly owned subsidiary, URNA, and subsidiaries of URNA. Holdings licenses its tradename and other intangibles and provides certain services to URNA in connection with its operations. These services principally include: (i) senior management services; (ii) finance and tax-related services and support; (iii) information technology systems and support; (iv) acquisition-related services; (v) legal services; and (vi) human resource support. In addition, Holdings leases certain equipment and real property that are made available for use by URNA and its subsidiaries.   \nInformation Regarding Guarantors of URNA Indebtedness\nURNA is 100 percent owned by Holdings and has certain outstanding indebtedness that is guaranteed by both Holdings and, with the exception of its U.S. special purpose vehicle which holds receivable assets relating to the Company’s accounts receivable securitization facility (the “SPV”) and a foreign subsidiary holding company acquired in connection with the General Finance acquisition, all of URNA’s U.S. subsidiaries (the “guarantor subsidiaries”). Other than the guarantee by our Canadian \n42\nTable of Contents\nsubsidiary of URNA's indebtedness under the ABL facility, none of URNA’s indebtedness is guaranteed by URNA's foreign subsidiaries, the SPV, or the foreign subsidiary holding company acquired in connection with the General Finance acquisition (together, the “non-guarantor subsidiaries”). The receivable assets owned by the SPV have been sold or contributed by URNA to the SPV and are not available to satisfy the obligations of URNA or Holdings’ other subsidiaries. Holdings consolidates each of URNA and the guarantor subsidiaries in its consolidated financial statements. URNA and the guarantor subsidiaries are all 100 percent-owned and controlled by Holdings. Holdings’ guarantees of URNA’s indebtedness are full and unconditional, except that the guarantees may be automatically released and relieved upon satisfaction of the requirements for legal defeasance or covenant defeasance under the applicable indenture being met. The Holdings guarantees are also subject to subordination provisions (to the same extent that the obligations of the issuer under the relevant notes are subordinated to other debt of the issuer) and to a standard limitation which provides that the maximum amount guaranteed by Holdings will not exceed the maximum amount that can be guaranteed without making the guarantee void under fraudulent conveyance laws.\nThe guarantees of Holdings and the guarantor subsidiaries are made on a joint and several basis. The guarantees of the guarantor subsidiaries are not full and unconditional because a guarantor subsidiary can be automatically released and relieved of its obligations under certain circumstances, including sale of the guarantor subsidiary, the sale of all or substantially all of the guarantor subsidiary's assets, the requirements for legal defeasance or covenant defeasance under the applicable indenture being met, designating the guarantor subsidiary as an unrestricted subsidiary for purposes of the applicable covenants or the notes being rated investment grade by both Standard & Poor’s Ratings Services and Moody’s Investors Service, Inc., or, in certain circumstances, another rating agency selected by URNA. Like the Holdings guarantees, the guarantees of the guarantor subsidiaries are subject to subordination provisions (to the same extent that the obligations of the issuer under the relevant notes are subordinated to other debt of the issuer) and to a standard limitation which provides that the maximum amount guaranteed by each guarantor will not exceed the maximum amount that can be guaranteed without making the guarantee void under fraudulent conveyance laws. \nAll of the existing guarantees by Holdings and the guarantor subsidiaries rank equally in right of payment with all of the guarantors' existing and future senior indebtedness. The secured indebtedness of Holdings and the guarantor subsidiaries (including guarantees of URNA’s existing and future secured indebtedness) will rank effectively senior to guarantees of any unsecured indebtedness to the extent of the value of the assets securing such indebtedness. Future guarantees of subordinated indebtedness will rank junior to any existing and future senior indebtedness of the guarantors. The guarantees of URNA’s indebtedness are effectively junior to any indebtedness of our subsidiaries that are not guarantors, including our foreign subsidiaries. As of December 31, 2024, the indebtedness of our non-guarantors was comprised of (i) $1.085 billion of outstanding borrowings by the SPV in connection with the Company’s accounts receivable securitization facility, (ii) $104 of outstanding borrowings under the ABL facility by non-guarantor subsidiaries and (iii) $11 of finance leases of our non-guarantor subsidiaries.\nCovenants in the agreements governing our ABL facility, term loan facility and certain other debt instruments impose limitations on our ability to make share repurchases and dividend payments, subject to important exceptions that would allow us to make such repurchases or payments under certain conditions. Based on our current total indebtedness leverage ratio (as defined in the applicable debt agreements) and usage of the ABL facility as of December 31, 2024, we met the criteria under the applicable debt agreements for these exceptions, and as a result we were not restricted in our ability to make share repurchases and dividend payments. \nBased on our understanding of Rule 3-10 of Regulation S-X (“Rule 3-10”), we believe that Holdings’ guarantees of URNA indebtedness comply with the conditions set forth in Rule 3-10, which enables us to present summarized financial information for Holdings, URNA and the consolidated guarantor subsidiaries in accordance with Rule 13-01 of Regulation S-X. The summarized financial information excludes the financial information of the non-guarantor subsidiaries. In accordance with Rule 3-10, separate financial statements of the guarantor subsidiaries have not been presented. Our presentation below excludes the investment in the non-guarantor subsidiaries and the related income from the non-guarantor subsidiaries.\nThe summarized financial information of Holdings, URNA and the guarantor subsidiaries on a combined basis is as follows:\n43\nTable of Contents\nDecember 31, 2024\nCurrent receivable from non-guarantor subsidiaries\n$8\nOther current assets\n438\nTotal current assets\n446\nLong-term assets\n22,729\nTotal assets\n23,175\nCurrent liabilities\n2,018\nLong-term liabilities\n15,813\nTotal liabilities\n17,831\nYear Ended December 31, 2024\nTotal revenues\n$13,989\nGross profit\n5,659\nNet income\n2,304",
  "item2": null
}