{
  "source_file": "v-20250630.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThis management’s discussion and analysis provides a review of the results of operations, financial condition and liquidity and capital resources of Visa Inc. and its subsidiaries (Visa, we, us, our or the Company) on a historical basis and outlines the factors that have affected recent earnings, as well as those factors that may affect future earnings. The following discussion and analysis should be read in conjunction with our unaudited consolidated financial statements and related notes included in \nItem 1—Financial Statements\n of this report.\nForward-Looking Statements\nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of the U.S. Private Securities Litigation Reform Act of 1995 that relate to, among other things, the impact on our future financial position, results of operations and cash flows; prospects, developments, strategies and growth of our business; anticipated expansion of our products in certain countries; industry developments; anticipated timing and benefits of our acquisitions; expectations regarding litigation matters, investigations and proceedings; timing and amount of stock repurchases; sufficiency of sources of liquidity and funding; effectiveness of our risk management programs; and expectations regarding the impact of recent accounting pronouncements on our unaudited consolidated financial statements. Forward-looking statements generally are identified by words such as “anticipates,” “believes,” “estimates,” “expects,” “intends,” “may,” “projects,” “could,” “should,” “will,” “continue” and other similar expressions. All statements other than statements of historical fact could be forward-looking statements, which speak only as of the date they are made, are not guarantees of future performance and are subject to certain risks, uncertainties and other factors, many of which are beyond our control and are difficult to predict. We describe risks and uncertainties that could cause actual results to differ materially from those expressed in, or implied by, any of these forward-looking statements in our SEC filings, including our Annual Report on Form 10-K, for the year ended September 30, 2024, and any subsequent reports on Forms 10-Q and 8-K. Except as required by law, we do not intend to update or revise any forward-looking statements as a result of new information, future events or otherwise.\n29\nTable of Contents\nOverview\nVisa is a global payments technology company that facilitates global commerce and money movement across more than 200 countries and territories among a global set of consumers, merchants, financial institutions and government entities through innovative technologies. We provide transaction processing services (primarily authorization, clearing and settlement) to our financial institution and merchant clients through VisaNet, our proprietary advanced transaction processing network. We offer products, solutions and services that facilitate secure, reliable and efficient money movement for all participants in the ecosystem. \nFinancial overview.\n A summary of our GAAP and non-GAAP operating results is as follows:\n \nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n2025\n2024\n%\nChange\n(1)\n2025\n2024\n%\nChange\n(1)\n(in millions, except percentages and per share data)\nNet revenue\n$\n10,172\n \n$\n8,900 \n14 \n%\n$\n29,276\n \n$\n26,309 \n11 \n%\nOperating expenses\n$\n3,995\n \n$\n2,962 \n35 \n%\n$\n11,430\n \n$\n9,063 \n26 \n%\nNet income\n$\n5,272\n \n$\n4,872 \n8 \n%\n$\n14,968\n \n$\n14,425 \n4 \n%\nDiluted earnings per share\n$\n2.69\n \n$\n2.40 \n12 \n%\n$\n7.59\n \n$\n7.08 \n7 \n%\nNon-GAAP operating expenses\n(2)\n$\n3,307\n \n$\n2,927 \n13 \n%\n$\n9,295\n \n$\n8,417 \n10 \n%\nNon-GAAP net income\n(2)\n$\n5,834\n \n$\n4,909 \n19 \n%\n$\n16,739\n \n$\n14,964 \n12 \n%\nNon-GAAP diluted earnings per share\n(2)\n$\n2.98\n \n$\n2.42 \n23 \n%\n$\n8.49\n \n$\n7.34 \n16 \n%\n(1)\nFigures in the table may not recalculate exactly due to rounding. Percentage changes are calculated based on unrounded numbers.\n(2)\nFor a full reconciliation of our GAAP to non-GAAP financial results, see tables in\n Non-GAAP financial results\n below.\nHighlights.\n For the three and nine months ended June 30, 2025, net revenue increased 14% and 11% over the prior-year comparable periods, respectively, primarily due to the growth in processed transactions, nominal cross-border volume and nominal payments volume, partially offset by higher client incentives. For the three months ended June 30, 2025, exchange rate movements did not have a material impact on net revenue growth. For the nine months ended June 30, 2025, exchange rate movements lowered our net revenue growth by approximately one percentage point. See \nResults of Operations—Net Revenue\n below for further discussion.\nFor the three and nine months ended June 30, 2025, operating expenses increased 35% and 26% over the prior-year comparable periods, respectively, primarily driven by higher litigation provision and personnel expenses. See \nResults of Operations—Operating Expenses\n below for further discussion. For the three and nine months ended June 30, 2025, exchange rate movements lowered our operating expense growth by approximately half a percentage point and one percentage point, respectively.\nFor the three and nine months ended June 30, 2025, non-GAAP operating expenses increased 13% and 10% over the prior-year comparable periods, respectively, primarily driven by higher personnel, general and administrative, and depreciation and amortization expenses.\nSenior notes.\n In May 2025, we issued Euro-denominated fixed-rate senior notes in a public offering in an aggregate principal amount of €3.5 billion ($3.9 billion), with maturities ranging between 3 and 19 years. See \nNote 7—Debt\n to our unaudited consolidated financial statements.\nAcquisition.\n In December 2024, we acquired Featurespace Limited (Featurespace), a developer of real-time artificial intelligence payments protection technology that prevents and mitigates payments fraud and financial crime risks, for a purchase consideration of $946 million. See \nNote 2—Acquisitions\n to our unaudited consolidated financial statements.\n30\nTable of Contents\nInterchange multidistrict litigation\n. For the nine months ended June 30, 2025, we recorded additional accruals of $1.5 billion to address claims associated with the interchange multidistrict litigation. We also made deposits of $375 million into the U. S. litigation escrow account. The additional accruals related to the interchange multidistrict litigation could be higher or lower than deposits made into the U.S. litigation escrow account. See \nNote 5—U.S. and Europe Retrospective Responsibility Plans\n and \nNote 13—Legal Matters\n to our unaudited consolidated financial statements.\nCommon stock repurchases. \nIn April 2025, our board of directors authorized a $30.0 billion share repurchase program, providing multi-year flexibility. For the nine months ended June 30, 2025, we repurchased 40 million shares of our class A common stock in the open market for $13.2 billion. As of June 30, 2025, our share repurchase program had remaining authorized funds of $29.8 billion. See \nNote 9—Stockholders’ Equity\n to our unaudited consolidated financial statements.\nNon-GAAP financial results. \nWe use non-GAAP financial measures of our performance which exclude certain items which we believe are not representative of our continuing operations, as they may be non-recurring or have no cash impact, and may distort our longer-term operating trends. We consider non-GAAP measures useful to investors because they provide greater transparency into management’s view and assessment of our ongoing operating performance.\n•\nGains and losses on equity investments. \nGains and losses on equity investments include periodic non-cash fair value adjustments and gains and losses upon sale of an investment.\n \nThese long-term investments are strategic in nature and are primarily private company investments. Gains and losses associated with these investments are tied to the performance of the\n \ncompanies that we invest in\n \nand therefore do not correlate to the underlying performance of our business.\n•\nAmortization of acquired intangible assets. \nAmortization of acquired intangible assets consists of amortization of intangible assets such as technology and customer relationships acquired in connection with business combinations executed beginning in fiscal 2019. Amortization charges for our acquired intangible assets are non-cash and are significantly affected by the timing, frequency and size of our acquisitions, rather than our core operations. As such, we have excluded this amount to facilitate an evaluation of our current operating performance and comparison to our past operating performance.\n•\nAcquisition-related costs. \nAcquisition-related costs consist primarily of one-time transaction and integration costs associated with our business combinations. These costs include professional fees, technology integration fees, restructuring activities and other direct costs related to the purchase and integration of acquired entities. These costs also include retention equity and deferred compensation when they are agreed upon as part of the purchase price of the transaction but are required to be recognized as expense post-combination. We have excluded these amounts as the expenses are recognized for a limited duration and do not reflect the underlying performance of our business.\n•\nSeverance costs. \nFor the nine months ended June 30, 2025, we recorded severance costs within personnel expense to realign our organizational structure and focus on areas that will drive higher long-term growth. This broad-based optimization effort has been excluded as it is not representative of our ongoing operations.\n•\nLease consolidation costs. \nFor the nine months ended June 30, 2025 and 2024, we recorded charges within general and administrative expense associated with the consolidation of certain leased office spaces. We have excluded these amounts as it does not reflect the underlying performance of our business.\n•\nLitigation provision.\n Litigation provision includes significant accruals related to certain legal matters that are not covered by the U.S. retrospective responsibility plan or the Europe retrospective responsibility plan (uncovered legal matters) and additional accruals associated with the interchange multidistrict litigation which are covered by the U.S. retrospective responsibility plan (U.S. covered litigation). Litigation provision associated with these matters can vary significantly based on the facts and circumstances related to each matter and do not correlate to the underlying performance of our business. For the three and nine months ended June 30, 2025 and 2024, we have excluded these amounts to facilitate a comparison to our past operating performance.\nUnder the U.S. retrospective responsibility plan, we recover the monetary liabilities related to the U.S. covered litigation through a downward adjustment to the rate at which shares of our class B-1 and class B-2 common stock ultimately convert into shares of class A common stock. For the three months ended June \n31\nTable of Contents\n30, 2025 and the three and nine months ended June 30, 2024, there was no conversion rate adjustment. For the nine months ended June 30, 2025, basic and diluted earnings per class A common stock was unchanged. See \nNote 5—U.S. and Europe Retrospective Responsibility Plans\n and \nNote 13—Legal Matters\n to our unaudited consolidated financial statements.\n•\nIndirect taxes.\n During the three and nine months ended June 30, 2024, as a result of the resolution of an audit, we recognized a benefit within general and administrative expense related to the release of the reserve previously recognized in fiscal 2021. This one-time benefit is not representative of our ongoing operations.\n•\nCharitable contribution.\n During the three and nine months ended June 30, 2024, we donated investment securities to the Visa Foundation and recognized a non-cash general and administrative expense. We have excluded this amount as it does not reflect the underlying performance of our business.\nNon-GAAP operating expenses, non-operating income (expense), income tax provision, effective income tax rate, net income and diluted earnings per share should not be relied upon as substitutes for, or considered in isolation from, measures calculated in accordance with GAAP. The following tables reconcile our GAAP to non-GAAP financial measures:\nThree Months Ended\nJune 30, 2025\nOperating Expenses\nNon-operating Income (Expense)\nIncome Tax Provision\n(1)\nEffective Income Tax Rate\n(2)\nNet \nIncome\nDiluted Earnings Per Share\n(2)\n(in millions, except percentages and per share data)\nGAAP\n$\n3,995 \n$\n156 \n$\n1,061 \n16.7 \n%\n$\n5,272 \n$\n2.69 \n(Gains) losses on equity investments, net\n— \n35 \n7 \n28 \n0.01 \nAmortization of acquired intangible assets\n(54)\n— \n14 \n40 \n0.02 \nAcquisition-related costs\n(19)\n— \n1 \n18 \n0.01 \nLitigation provision\n(615)\n— \n139 \n476 \n0.24 \nNon-GAAP\n$\n3,307 \n$\n191 \n$\n1,222 \n17.3 \n%\n$\n5,834 \n$\n2.98 \nNine Months Ended\nJune 30, 2025\nOperating Expenses\nNon-operating Income (Expense)\nIncome Tax Provision\n(1)\nEffective Income Tax Rate\n(2)\nNet \nIncome\nDiluted Earnings Per Share\n(2)\n(in millions, except percentages and per share data)\nGAAP\n$\n11,430 \n$\n125 \n$\n3,003 \n16.7 \n%\n$\n14,968 \n$\n7.59 \n(Gains) losses on equity investments, net\n— \n133 \n29 \n104 \n0.05 \nAmortization of acquired intangible assets\n(164)\n— \n41 \n123 \n0.06 \nAcquisition-related costs\n(85)\n— \n6 \n79 \n0.04 \nSeverance costs\n(213)\n— \n45 \n168 \n0.08 \nLease consolidation costs\n(39)\n— \n9 \n30 \n0.02 \nLitigation provision\n(1,634)\n— \n367 \n1,267 \n0.64 \nNon-GAAP\n$\n9,295 \n$\n258 \n$\n3,500 \n17.3 \n%\n$\n16,739 \n$\n8.49 \n32\nTable of Contents\nThree Months Ended\nJune 30, 2024\nOperating Expenses\nNon-operating Income (Expense)\nIncome Tax Provision\n(1)\nEffective Income Tax Rate\n(2)\nNet \nIncome\nDiluted Earnings Per Share\n(2)\n(in millions, except percentages and per share data)\nGAAP\n$\n2,962 \n$\n51 \n$\n1,117 \n18.6 \n%\n$\n4,872 \n$\n2.40 \n(Gains) losses on equity investments, net\n— \n22 \n5 \n17 \n0.01 \nAmortization of acquired intangible assets\n(48)\n— \n13 \n35 \n0.02 \nAcquisition-related costs\n(28)\n— \n3 \n25 \n0.01 \nLitigation provision\n(10)\n— \n2 \n8 \n— \nIndirect taxes\n118 \n— \n(29)\n(89)\n(0.04)\nCharitable contribution\n(67)\n— \n26 \n41 \n0.02 \nNon-GAAP\n$\n2,927 \n$\n73 \n$\n1,137 \n18.8 \n%\n$\n4,909 \n$\n2.42 \nNine Months Ended\nJune 30, 2024\nOperating Expenses\nNon-operating Income (Expense)\nIncome Tax Provision\n(1)\nEffective Income Tax Rate\n(2)\nNet \nIncome\nDiluted Earnings Per Share\n(2)\n(in millions, except percentages and per share data)\nGAAP\n$\n9,063 \n$\n298 \n$\n3,119 \n17.8 \n%\n$\n14,425 \n$\n7.08 \n(Gains) losses on equity investments, net\n— \n48 \n11 \n37 \n0.02 \nAmortization of acquired intangible assets\n(131)\n— \n32 \n99 \n0.05 \nAcquisition-related costs\n(75)\n— \n5 \n70 \n0.03 \nLitigation provision\n(434)\n— \n97 \n337 \n0.17 \nLease consolidation costs\n(57)\n— \n13 \n44 \n0.02 \nIndirect taxes\n118 \n— \n(29)\n(89)\n(0.04)\nCharitable contribution\n(67)\n— \n26 \n41 \n0.02 \nNon-GAAP\n$\n8,417 \n$\n346 \n$\n3,274 \n17.9 \n%\n$\n14,964 \n$\n7.34 \n(1)\nDetermined by applying applicable tax rates.\n(2)\nFigures in the table may not recalculate exactly due to rounding. Effective income tax rate, diluted earnings per share and their respective totals are calculated based on unrounded numbers.\nPayments volume and processed transactions.\n Payments volume is the primary driver for our service revenue, and the number of processed transactions is the primary driver for our data processing revenue. \nPayments\n \nvolume represents the aggregate dollar amount of purchases made with cards and other form factors carrying the Visa, Visa Electron, V PAY and Interlink brands and excludes Europe co-badged volume. Nominal payments volume is denominated in U.S. dollars and is calculated each quarter by applying an established U.S. dollar/foreign currency exchange rate for each local currency in which our volumes are reported.\n \nProcessed transactions include payments and cash transactions, and represent transactions using cards and other form factors carrying the Visa, Visa Electron, V PAY, Interlink and PLUS brands processed on Visa’s networks.\n33\nTable of Contents\nThe following tables present nominal payments and cash volume:\nU.S.\nInternational\nVisa\nThree Months Ended \nMarch 31,\n(1)\nThree Months Ended \nMarch 31,\n(1)\nThree Months Ended \nMarch 31,\n(1)\n2025\n2024\n% Change\n(2)\n2025\n2024\n% Change\n(2)\n2025\n2024\n% Change\n(2)\n(in billions, except percentages)\nNominal payments volume\nConsumer credit\n$\n592\n \n$\n564 \n5 \n%\n$\n745\n \n$\n725 \n3 \n%\n$\n1,337\n \n$\n1,289 \n4 \n%\nConsumer debit\n(3)\n802\n \n745 \n8 \n%\n789\n \n739 \n7 \n%\n1,591\n \n1,483 \n7 \n%\nCommercial\n(4)\n261\n \n253 \n3 \n%\n156\n \n149 \n5 \n%\n416\n \n401 \n4 \n%\nTotal nominal payments volume\n(2)\n$\n1,654\n \n$\n1,561 \n6 \n%\n$\n1,690\n \n$\n1,612 \n5 \n%\n$\n3,344\n \n$\n3,173 \n5 \n%\nCash volume\n(5)\n145\n \n148 \n(2 \n%)\n454\n \n461 \n(2 \n%)\n599\n \n609 \n(2 \n%)\nTotal nominal volume\n(2),(6)\n$\n1,800\n \n$\n1,709 \n5 \n%\n$\n2,144\n \n$\n2,073 \n3 \n%\n$\n3,943\n \n$\n3,782 \n4 \n%\nU.S.\nInternational\nVisa\nNine Months Ended \nMarch 31,\n(1)\nNine Months Ended \nMarch 31,\n(1)\nNine Months Ended \nMarch 31,\n(1)\n2025\n2024\n% \nChange\n(2)\n2025\n2024\n% \nChange\n(2)\n2025\n2024\n% \nChange\n(2)\n(in billions, except percentages)\nNominal payments volume\nConsumer credit\n$\n1,844\n \n$\n1,744 \n6 \n%\n$\n2,312\n \n$\n2,218 \n4 \n%\n$\n4,156\n \n$\n3,961 \n5 \n%\nConsumer debit\n(3)\n2,379\n \n2,219 \n7 \n%\n2,458\n \n2,251 \n9 \n%\n4,838\n \n4,470 \n8 \n%\nCommercial\n(4)\n801\n \n773 \n4 \n%\n483\n \n457 \n6 \n%\n1,284\n \n1,230 \n4 \n%\nTotal nominal payments volume\n(2)\n$\n5,024\n \n$\n4,735 \n6 \n%\n$\n5,253\n \n$\n4,925 \n7 \n%\n$\n10,277\n \n$\n9,660 \n6 \n%\nCash volume\n(5)\n445\n \n452 \n(2 \n%)\n1,412\n \n1,423 \n(1 \n%)\n1,857\n \n1,876 \n(1 \n%)\nTotal nominal volume\n(2),(6)\n$\n5,469\n \n$\n5,188 \n5 \n%\n$\n6,665\n \n$\n6,348 \n5 \n%\n$\n12,134\n \n$\n11,536 \n5 \n%\nThe following table presents the change in nominal and constant payments and cash volume:\nInternational\nVisa\nInternational\nVisa\n \nThree Months Ended \nMarch 31,\n2025 vs. 2024\n(1),(2)\nThree Months Ended \nMarch 31,\n2025 vs. 2024\n(1),(2)\nNine Months Ended March 31, \n2025 vs. 2024\n(1),(2)\nNine Months Ended March 31, \n2025 vs. 2024\n(1),(2)\n \nNominal\nConstant\n(7)\nNominal\nConstant\n(7)\nNominal\nConstant\n(7)\nNominal\nConstant\n(7)\nPayments volume growth\nConsumer credit growth\n3 \n%\n8 \n%\n4 \n%\n6 \n%\n4 \n%\n8 \n%\n5 \n%\n7 \n%\nConsumer debit growth\n(3)\n7 \n%\n11 \n%\n7 \n%\n9 \n%\n9 \n%\n12 \n%\n8 \n%\n10 \n%\nCommercial growth\n(4)\n5 \n%\n10 \n%\n4 \n%\n6 \n%\n6 \n%\n9 \n%\n4 \n%\n6 \n%\nTotal payments volume growth\n5 \n%\n9 \n%\n5 \n%\n8 \n%\n7 \n%\n10 \n%\n6 \n%\n8 \n%\nCash volume growth\n(5)\n(2 \n%)\n4 \n%\n(2 \n%)\n2 \n%\n(1 \n%)\n4 \n%\n(1 \n%)\n3 \n%\nTotal volume growth\n3 \n%\n8 \n%\n4 \n%\n7 \n%\n5 \n%\n9 \n%\n5 \n%\n7 \n%\n(1)\nService revenue in a given quarter is primarily assessed based on nominal payments volume in the prior quarter. Therefore, service revenue reported for the three and nine months ended June 30, 2025 and 2024, respectively, was based on nominal payments volume reported by our financial institution clients for the three and nine months ended March 31, 2025 and 2024, respectively. On occasion, previously presented volume information may be updated. Prior period updates are not material.\n(2)\nFigures in the table may not recalculate exactly due to rounding. Percentage changes and totals are calculated based on unrounded numbers. \n(3)\nIncludes consumer prepaid volume and Interlink volume.\n(4)\nIncludes large, medium and small business credit and debit, as well as commercial prepaid volume.\n(5)\nCash volume generally consists of cash access transactions, balance access transactions, balance transfers and convenience checks.\n(6)\nTotal nominal volume is the sum of total nominal payments volume and cash volume. Total nominal volume is provided by our financial institution clients, subject to review by Visa.\n(7)\nGrowth on a constant-dollar basis excludes the impact of foreign currency fluctuations against the U.S. dollar.\n34\nTable of Contents\nThe following table presents the number of processed transactions:\n \nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n2025\n2024\n% \nChange\n(1)\n2025\n(1)\n2024\n(1)\n% \nChange\n(1)\n(in millions, except percentages)\nVisa processed transactions\n65,443\n \n59,318 \n10 \n%\n189,891\n \n172,247 \n10 \n%\n(1)\nFigures in the table may not recalculate exactly due to rounding. Percentage change is calculated based on unrounded numbers. On occasion, previously presented information may be updated. Prior period updates are not material. \nResults of Operations\nNet Revenue\nThe following table presents our net revenue earned in the U.S. and internationally:\n \nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n \n2025\n2024\n%\nChange\n(1)\n2025\n2024\n%\nChange\n(1)\n \n(in millions, except percentages)\nU.S.\n$\n3,927\n \n$\n3,621 \n8 \n%\n$\n11,476\n \n$\n10,909 \n5 \n%\nInternational\n6,245\n \n5,279 \n18 \n%\n17,800\n \n15,400 \n16 \n%\nNet revenue\n$\n10,172\n \n$\n8,900 \n14 \n%\n$\n29,276\n \n$\n26,309 \n11 \n%\n(1)\nFigures in the table may not recalculate exactly due to rounding. Percentage changes are calculated based on unrounded numbers.\nNet revenue increased over the three and nine-month prior-year comparable periods primarily due to the growth in processed transactions, nominal cross-border volume and nominal payments volume, partially offset by higher client incentives.\nOur net revenue is impacted by the overall strengthening or weakening of the U.S. dollar as payments volume and related revenue denominated in local currencies are converted to U.S. dollars. For the three months ended June 30, 2025, exchange rate movements did not have a material impact on net revenue growth. For the nine months ended June 30, 2025, exchange rate movements lowered our net revenue growth by approximately one percentage point. \n35\nTable of Contents\nThe following table presents the components of our net revenue:\n \nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n \n2025\n2024\n%\nChange\n(1)\n2025\n2024\n%\nChange\n(1)\n \n(in millions, except percentages)\nService revenue\n$\n4,330\n \n$\n3,967 \n9 \n%\n$\n12,937\n \n$\n11,915 \n9 \n%\nData processing revenue\n5,153\n \n4,489 \n15 \n%\n14,599\n \n13,104 \n11 \n%\nInternational transaction revenue\n3,633\n \n3,194 \n14 \n%\n10,366\n \n9,197 \n13 \n%\nOther revenue\n1,028\n \n780 \n32 \n%\n2,877\n \n2,228 \n29 \n%\nClient incentives\n(3,972)\n(3,530)\n13 \n%\n(11,503)\n(10,135)\n13 \n%\nNet revenue \n$\n10,172\n \n$\n8,900 \n14 \n%\n$\n29,276\n \n$\n26,309 \n11 \n%\n(1)\nFigures in the table may not recalculate exactly due to rounding. Percentage changes are calculated based on unrounded numbers.\n•\nService revenue\n increased over the three and nine-month prior-year comparable periods primarily due to growth in nominal payments volume of 5% and 6%, respectively, select pricing modifications and card benefits.\n•\nData processing revenue \nincreased over the three and nine-month prior-year comparable periods primarily due to growth in processed transactions of 10%. In addition, the increase over the three-month prior-year comparable period reflected the impact of select pricing modifications.\n•\nInternational transaction revenue \nincreased over the three and nine-month prior-year comparable periods primarily due to growth in nominal cross-border volumes of 13%, excluding transactions within Europe, and higher volatility of a broad range of currencies, partially offset by business mix.\n•\nOther revenue \nincreased over the three and nine-month prior-year comparable periods primarily due to growth in advisory and other services and select pricing modifications.\n•\nClient incentives\n increased over the three and nine-month prior-year comparable periods primarily due to growth in payments volume. The amount of client incentives we record in future periods will vary based on changes in performance expectations, actual client performance, amendments to existing contracts or the execution of new contracts.\nFor the three months ended June 30, 2025 and 2024, revenue from value-added services was $2.8 billion and $2.2 billion, respectively. For the nine months ended June 30, 2025 and 2024, revenue from value-added services was $7.8 billion and $6.4 billion, respectively. Value-added services revenue increased 28% and 22% over the three and nine-month prior-year comparable periods, respectively, primarily due to growth in advisory and other services, issuing solutions and acceptance solutions.\n36\nTable of Contents\nOperating Expenses\nThe following table presents the components of our total operating expenses:\n \nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n2025\n2024\n%\nChange\n(1)\n2025\n2024\n%\nChange\n(1)\n \n(in millions, except percentages)\nPersonnel\n$\n1,749\n \n$\n1,573 \n11 \n%\n$\n5,219\n \n$\n4,655 \n12 \n%\nMarketing\n421\n \n378 \n11 \n%\n1,108\n \n1,009 \n10 \n%\nNetwork and processing\n224\n \n200 \n12 \n%\n655\n \n570 \n15 \n%\nProfessional fees\n187\n \n152 \n23 \n%\n503\n \n443 \n13 \n%\nDepreciation and amortization\n317\n \n264 \n20 \n%\n904\n \n760 \n19 \n%\nGeneral and administrative\n482\n \n382 \n26 \n%\n1,382\n \n1,174 \n18 \n%\nLitigation provision\n615\n \n13 \nNM\n1,659\n \n452 \nNM\nTotal operating expenses\n$\n3,995\n \n$\n2,962 \n35 \n%\n$\n11,430\n \n$\n9,063 \n26 \n%\nNM – Not meaningful\n(1)\nFigures in the table may not recalculate exactly due to rounding. Percentage changes are calculated based on unrounded numbers.\n•\nPersonnel expenses\n \nincreased over the three and nine-month prior-year comparable periods primarily due to a higher number of employees and compensation focused on areas that will drive higher long-term growth, including acquisitions. In addition, the increase over the nine-month prior-year comparable period was due to severance costs in the current period to realign our organizational structure.\n•\nMarketing expenses\n increased over the three and nine-month prior-year comparable periods primarily due to higher spending for client marketing.\n•\nNetwork and processing expenses\n increased over the three and nine-month prior-year comparable periods primarily due to continued technology and processing network investments to support growth and acquisitions.\n•\nProfessional fees\n increased over the three and nine-month prior-year comparable periods primarily due to higher legal fees.\n•\nDepreciation and amortization expenses \nincreased over the three and nine-month prior-year comparable periods primarily due to additional amortization and depreciation from our on-going investments and acquisitions.\n•\nGeneral and administrative expenses\n increased over the three and nine-month prior-year comparable periods primarily due to the absence of the release of the reserve on indirect taxes previously recognized in fiscal 2021, higher usage of travel related card benefits and higher indirect taxes, partially offset by a charitable contribution to the Visa Foundation in the prior year and favorable foreign currency fluctuations.\n•\nLitigation provision \nincreased over the three-month prior-year comparable period primarily due to higher accruals related to the U.S. covered litigation and uncovered litigation. Litigation provision increased over the nine-month prior-year comparable period primarily due to higher accruals related to the U.S. covered litigation, partially offset by lower accruals related to uncovered litigation. See \nNote 13—Legal Matters\n to our unaudited consolidated financial statements.\n37\nTable of Contents\nNon-operating Income (Expense) \nThe following table presents the components of our non-operating income (expense): \n \nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n2025\n2024\n%\nChange\n(1)\n2025\n2024\n%\nChange\n(1)\n \n(in millions, except percentages)\nInterest expense\n$\n(39)\n$\n(196)\n(80 \n%)\n$\n(379)\n$\n(465)\n(19 \n%)\nInvestment income (expense) and other \n195\n \n247 \n(21 \n%)\n504\n \n763 \n(34 \n%)\nTotal non-operating income (expense)\n$\n156\n \n$\n51 \n208 \n%\n$\n125\n \n$\n298 \n(58 \n%)\n(1)\nFigures in the table may not recalculate exactly due to rounding. Percentage changes are calculated based on unrounded numbers.\n•\nInterest expense\n decreased over the three and nine-month prior-year comparable periods primarily due to higher interest benefit related to taxes and lower losses from derivatives, partially offset by higher interest expense related to the issuance of debt in the three months ended June 30, 2025.\n•\nInvestment income (expense) and other\n decreased over the three and nine-month prior-year comparable periods primarily due to lower interest income on our cash and investments. In addition, the decrease over the nine-month prior-year comparable period was due to higher losses on our equity investments.\nEffective Income Tax Rate\nThe following table presents our effective income tax rates:\n \n \nThree Months Ended\nJune 30,\nNine Months Ended\nJune 30,\n \n2025\n2024\n2025\n2024\nEffective income tax rate\n17\n \n%\n19 \n%\n17\n \n%\n18 \n%\nThe effective income tax rates for the three and nine-month prior-year comparable periods differ due to a change in the geographic mix of earnings as well as the following:\n•\nFor the three and nine months ended June 30, 2025, a $60 million net tax benefit due to the reassessment of uncertain tax positions as a result of new information obtained during a tax examination;\n•\nFor the nine months ended June 30, 2025, a $222 million tax benefit as a result of a tax position taken on certain expenses, partially offset by a $71 million tax expense related to the resolution of a tax matter; and\n•\nFor the nine months ended June 30, 2024, a $184 million tax benefit as a result of the conclusion of an audit.\nThe Organization for Economic Cooperation and Development (OECD) published administrative guidance around the implementation of a 15% global minimum tax (Pillar Two). Various OECD member countries have either enacted or are in the process of enacting Pillar Two legislation. While we do not expect a material tax impact in fiscal 2025, we are monitoring developments and evaluating the potential impact of Pillar Two on future years.\nOn July 4, 2025, U.S. tax legislation was enacted into law, including the allowance of accelerated tax deductions for qualified property and research expenditures, as well as changes in international provisions. The changes are applicable to Visa with effective dates ranging from January 2025 through fiscal 2027. We are in the process of evaluating the impact to our consolidated financial statements.\n38\nTable of Contents\nLiquidity and Capital Resources\nCash Flow Data\nThe following table summarizes our cash flow activity for the periods presented:\n \nNine Months Ended\nJune 30,\n \n2025\n2024\n \n(in millions)\nTotal cash provided by (used in):\nOperating activities\n$\n16,821\n \n$\n13,286 \nInvesting activities\n$\n404\n \n$\n(2,510)\nFinancing activities\n$\n(12,963)\n$\n(13,564)\nOperating activities.\n Cash provided by operating activities increased over the nine-month prior-year comparable period primarily due to growth in our underlying business and the timing of payments related to income taxes, partially offset by higher incentive payments.\nInvesting activities. \nCash provided by investing activities increased over the nine-month prior-year comparable period primarily due to the absence of investment securities purchases, partially offset by lower proceeds from maturities and sales of investment securities.\nFinancing activities.\n Cash used in financing activities decreased over the nine-month prior-year comparable period primarily due to proceeds received from the issuance of senior notes, partially offset by higher share repurchases, lower funds held on behalf of clients and higher dividends paid.\nSources of Liquidity\nOur primary sources of liquidity are cash on hand, cash flow from our operations, our investment portfolio and access to various equity and borrowing arrangements. Funds from operations are maintained in cash and cash equivalents and short-term or long-term investment securities based upon our funding requirements, access to liquidity from these holdings and the returns that these holdings provide. Based on our current cash flow budgets and forecasts of our short-term and long-term liquidity needs, we believe that our current and projected sources of liquidity will be sufficient to meet our projected liquidity needs for more than the next 12 months. We will continue to assess our liquidity position and potential sources of supplemental liquidity in view of our operating performance, current economic and capital market conditions and other relevant circumstances.\nSenior notes.\n In May 2025, we issued Euro-denominated fixed-rate senior notes in a public offering in an aggregate principal amount of €3.5 billion ($3.9 billion), with maturities ranging between 3 and 19 years. See \nNote 7—Debt\n to our unaudited consolidated financial statements.\nUses of Liquidity\nThere has been no significant change to our primary uses of liquidity since September 30, 2024, except as discussed below.\nCommon stock repurchases. \nFor the nine months ended June 30, 2025, we repurchased\n \nshares\n \nof our class A common stock in the open market for $13.2 billion. As of June 30, 2025, our share repurchase program had remaining authorized funds of $29.8 billion. See \nNote 9—Stockholders’ Equity\n to our unaudited consolidated financial statements.\nDividends\n. For the nine months ended June 30, 2025, we declared and paid $3.5 billion in dividends to holders of our common and preferred stock. On July 29, 2025, our board of directors declared a quarterly cash dividend of $0.59 per share of class A common stock (determined in the case of all other outstanding common and preferred stock on an as-converted basis). We expect to continue paying quarterly dividends in cash, subject to approval by the board of directors. See \nNote 9—Stockholders’ Equity\n to our unaudited consolidated financial statements.\n39\nTable of Contents\nSenior notes. \nPrincipal payments on our senior notes of $4.0 billion and €1.4 billion ($1.6 billion) are due in December 2025 and June 2026, respectively, for which we have sufficient liquidity. See \nNote 7—Debt\n to our unaudited consolidated financial statements.\nAcquisition\n. In December 2024, we acquired Featurespace for a purchase consideration of $946 million. See \nNote 2—Acquisitions\n to our unaudited consolidated financial statements.\nLitigation. \nFor the nine months ended June 30, 2025, we deposited $375 million into the U.S. litigation escrow account to address claims associated with the interchange multidistrict litigation. The balance of this account as of June 30, 2025 was $2.7 billion and is reflected as restricted cash in our consolidated balance sheets. See \nNote 5—U.S. and Europe Retrospective Responsibility Plans\n and \nNote 13—Legal Matters\n to our unaudited consolidated financial statements.\nAccounting Pronouncements Not Yet Adopted\nIn November 2023, the Financial Accounting Standards Board (FASB) issued Accounting Standards Update (ASU) 2023-07, which is intended to \nimprove reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expense\ns. This standard also enhances interim disclosure requirements and provides new segment disclosure requirements for entities with a single reportable segment. This ASU is effective for our annual periods beginning October 1, 2024, and interim periods beginning October 1, 2025, and requires \nretrospective application to all prior periods presented.\n The adoption of this ASU is expected to result in additional disclosures.\nIn December 2023, the FASB issued ASU 2023-09, which provides improvements to income tax disclosures. This standard requires disaggregated information related to the effective tax rate reconciliation as well as information on income taxes paid. This ASU is effective for our annual periods beginning October 1, 2025, and requires prospective application with the option to apply the standard retrospectively. We are currently evaluating the impact of the ASU on our disclosures. \nIn November 2024, the FASB issued ASU 2024-03, which requires disclosure of additional information about specific expense categories underlying certain income statement expense line items. Subsequently, the FASB also issued an amendment to this standard. The amendments in the ASU are effective for our annual periods beginning October 1, 2027, and interim periods beginning October 1, 2028, and require either prospective or retrospective application. We are currently evaluating the impact of the ASU on our disclosures."
}