{
  "source_file": "vici-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.        Management’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of the financial position and operating results of VICI Properties Inc. and VICI Properties L.P. for the three and nine months ended September 30, 2025 should be read in conjunction with the Financial Statements and related notes thereto and other financial information contained elsewhere in this Quarterly Report on Form 10-Q and the audited consolidated financial statements and related notes for the year ended December 31, 2024, which were included in our \nAnnual Report on Form 10-K for the year ended December 31, 2024\n. All defined terms included herein have the same meaning as those set forth in the \nNotes to the Consolidated Financial Statements\n contained within this Quarterly Report on Form 10-Q. \nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\nCertain statements in this Quarterly Report on Form 10-Q, including statements such as “anticipate,” “believe,” “estimate,” “expect,” “intend,” “plan,” “project,” “target,” “can,” “could,” “may,” “should,” “will,” “would” or similar expressions, constitute “forward-looking statements” within the meaning of the federal securities laws. Forward-looking statements are based on our current plans, expectations and projections about future events. We therefore caution you against relying on any of these forward-looking statements. They give our expectations about the future and are not guarantees. These statements involve known and unknown risks, uncertainties and other factors that may cause our actual results, performance and achievements to materially differ from any future results, performance and achievements expressed in or implied by such forward-looking statements.\nThe forward-looking statements included herein are based upon our current expectations, plans, estimates, assumptions and beliefs that involve numerous risks and uncertainties. Assumptions relating to the foregoing involve judgments with respect to, among other things, future economic, competitive and market conditions and future business decisions, all of which are difficult or impossible to predict accurately and many of which are beyond our control. Although we believe that the expectations reflected in such forward-looking statements are based on reasonable assumptions, our actual results, performance and achievements could differ materially from those set forth in the forward-looking statements and may be affected by a variety of risks and other factors, including, among others: the impact of changes in general economic conditions and market developments, including inflation, interest rate changes and volatility, tariffs and trade barriers, supply chain disruptions, changes in consumer spending, consumer confidence levels, unemployment levels, governmental action (including significant layoffs or reductions in force among federal government employees or a prolonged U.S. federal government shutdown), and depressed real estate prices resulting from the severity and duration of any downturn or recession in the U.S. or global economy; our ability to successfully pursue and consummate transactions, including investments in, and acquisitions of, real estate and to obtain debt financing for such investments at attractive interest rates, or at all; risks associated with our pending and completed transactions, including our ability or failure to realize the anticipated benefits thereof; our dependence on our tenants at our properties and their affiliates that serve as guarantors of the lease payments, and the negative consequences any material adverse effect on their respective businesses could have on us; the possibility that any future transactions may not be consummated on the terms or timeframes contemplated, or at all, including our ability to obtain the financing necessary to complete any acquisitions on the terms we expect in a timely manner, or at all; the ability of the parties to satisfy the conditions set forth in the definitive transaction documents, including the receipt of, or delays in obtaining, governmental and regulatory approvals and consents required to consummate such transactions, or other delays or impediments to completing the transactions; the anticipated benefits of certain arrangements with certain tenants in connection with our funding of “same store” capital improvements in exchange for increased rent pursuant to the terms of our agreements with such tenants, which we refer to as the Partner Property Growth Fund strategy; our decision and ability to exercise our purchase rights under our put-call agreements, call agreements, right of first refusal agreements and right of first offer agreements; our borrowers’ ability to repay their outstanding loan obligations to us; our dependence on the gaming industry; our ability to pursue our business and growth strategies may be limited by the requirement that we distribute 90% of our REIT taxable income in order to qualify for taxation as a REIT and that we distribute 100% of our REIT taxable income in order to avoid current entity-level U.S. federal income taxes; the impact of extensive regulation from gaming and other regulatory authorities; the ability of our tenants to obtain and maintain regulatory approvals in connection with the operation of our properties, or the imposition of conditions to such regulatory approvals; the possibility that our tenants may choose not to renew their respective lease agreements following the initial or subsequent terms of the leases; restrictions on our ability to sell our properties subject to the lease agreements; our tenants and any guarantors’ historical results may not be a reliable indicator of their future results; our substantial amount of indebtedness and ability to service, refinance (at attractive interest rates, or at all), and otherwise fulfill our obligations under such indebtedness; our historical financial information may not be reliable indicators of our future results of operations, financial condition and cash flows; the possibility that we identify significant environmental, tax, legal or other issues, \n45\nTable of Contents\nincluding additional costs or liabilities, that materially and adversely impact the value of assets acquired or secured as collateral (or other benefits we expect to receive) in any of our pending and completed transactions; the impact of changes to tax laws and regulations, including U.S. federal income tax laws, state tax laws or global tax laws; the impact of changes in governmental or regulatory actions and initiatives; the possibility of adverse tax consequences as a result of our pending and completed transactions, including pursuant to tax protection agreements to which we are a party; increased volatility in our stock price, including as a result of our pending and completed transactions; our inability to maintain our qualification for taxation as a REIT; the impact of climate change, natural disasters or other severe weather events, war or conflict, political and public health conditions, uncertainty or civil unrest, violence or terrorist activities or threats on our properties, or in areas where our properties are located and changes in economic conditions or heightened travel security, and any measures instituted in response to these events; the loss of the services of key personnel; the inability to attract, retain and motivate employees; the costs and liabilities associated with environmental compliance; failure to establish and maintain an effective system of integrated internal controls; the risks related to us or our tenants not having adequate insurance to cover potential losses; the potential impact on the amount of our cash distributions if we determine to sell or divest any of our properties in the future or are unable to redeploy capital returned from investments at attractive rates, or at all; our ability to continue to make distributions to holders of our common stock or maintain anticipated levels of distributions over time, including our reliance on distributions received from our subsidiaries, including VICI OP, to make such distributions to our stockholders; competition for transaction opportunities, including from other REITs, investment companies, private equity firms and hedge funds, sovereign funds, lenders, gaming companies and other investors that may have greater resources and access to capital and a lower cost of capital or different investment parameters than us; and additional factors discussed herein and listed from time to time as “Risk Factors” in our filings with the SEC, including without limitation, in our subsequent reports on Form 10-K, Form 10-Q and Form 8-K.\nAny of the assumptions underlying forward-looking statements could be inaccurate. You are cautioned not to place undue reliance on any forward-looking statements. All forward-looking statements are made as of the date of this Quarterly Report on Form 10-Q and the risk that actual results, performance and achievements will differ materially from the expectations expressed herein will increase with the passage of time. Except as otherwise required by the Federal securities laws, we undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events, changed circumstances or any other reason. In light of the significant uncertainties inherent in forward-looking statements, the inclusion of such forward-looking statements should not be regarded as a representation by us.\nOVERVIEW\nWe are primarily engaged in the business of owning and acquiring gaming, hospitality, wellness, entertainment and leisure destinations, subject to long-term triple-net leases. We own 93 experiential assets across a geographically diverse portfolio consisting of 54 gaming properties and 39 other experiential properties across the United States and Canada, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort, three of the most iconic entertainment facilities on the Las Vegas Strip. Our gaming and entertainment facilities are leased to leading brands that seek to drive consumer loyalty and value with guests through superior services, experiences, products and continuous innovation. Across approximately \n127 \nmillion square feet, our well-maintained properties are curren\ntly located across urban, destination and drive-to markets in twenty-six states and Canada, contain approximately 60,300 hotel rooms and feature over 500 restaurants, bars, nightclubs and sportsbooks.\n \nAs of \nSeptember 30, 2025\n, our properties are 100% leased with a weighted average lease term based on contractual rent, including extension options, of approximately 40.0 years.\nWe also have a growing array of real estate and financing partnerships with leading developers and operators in other experiential sectors, including Cabot, Cain, Canyon Ranch, Chelsea Piers, Great Wolf Resorts, Homefield, Kalahari Resorts and Lucky Strike Entertainment. This portfolio includes certain real estate debt investments that we have originated for strategic reasons, primarily in connection with transactions that either do or may provide the potential to convert our investment into the ownership of certain of the underlying real estate in the future. In addition, we own approximately 33 acres of undeveloped or underdeveloped land on and adjacent to the Las Vegas Strip that is leased to Caesars, which we may look to monetize as appropriate.\n \nVICI also owns four championship golf courses located near certain of our properties, two of which are in close proximity to the Las Vegas Strip. \nOur portfolio is competitively positioned and well-maintained. Pursuant to the terms of our lease agreements, which require our tenants to invest in our properties, and in line with our tenants’ commitment to build guest loyalty, we anticipate our tenants will continue to make strategic value-enhancing investments in our properties over time, helping to maintain their competitive position. Our long-term triple-net leases provide our tenants with complete control over management at our leased properties, including sole responsibility for all operations and related expenses, including property taxes, insurance and maintenance, \n46\nTable of Contents\nrepair, improvement and other capital expenditures, as well as over the implementation of environmental sustainability and other initiatives.\nWe conduct our operations as a REIT for U.S. federal income tax purposes. We generally will not be subject to U.S. federal income taxes on our taxable income to the extent that we annually distribute all of our net taxable income to stockholders and maintain our qualification as a REIT. We believe VICI’s election of REIT status, combined with the income generation from the lease agreements and loans, will enhance our ability to make distributions to our stockholders, providing investors with current income as well as long-term growth, subject to the macroeconomic environment, other global events and market conditions more broadly. We conduct our real property business through VICI OP and our golf course business through a TRS, VICI Golf.\nThe financial information included in this Quarterly Report on Form 10-Q is our consolidated results (including the real property business and the golf course business) for the three and nine months ended September 30, 2025. \nImpact of Material Trends on Our Business \nMacroeconomic volatility has introduced significant uncertainty and heightened risk for businesses, including us and our tenants, including the impact of interest rate changes and volatility, inflation, increased cost of capital, threat of recession, and geopolitical uncertainty. Our tenants also face additional challenges, including potential changes in consumer confidence levels, behavior and spending, increased supply and competition for gaming and other experiential activities, potential supply chain issues and increased operational expenses (including the impact of tariffs and trade barriers), such as with respect to material, labor or energy costs. \nAs a triple-net lessor, increased operational expenses at our leased properties are borne by our tenants and do not directly impact their rent obligations (other than with respect to underlying inflation as applied to the CPI-based escalators) or other obligations under our lease agreements. \nThe full extent to which these trends adversely affect our tenants and/or ultimately impact us depends on future developments that cannot be predicted with confidence, including our tenants’ financial performance, the direct and indirect effects of such trends (including among other things, interest rate changes and volatility, inflation, tariffs and trade barriers, economic recessions, consumer confidence levels and general conditions in the equity and credit markets) and the impact of any future measures taken in response to such trends by our tenants.\nFor more information, refer to the sections entitled “Key Trends That May Affect Our Business” and “Risk Factors” in our \nAnnual Report on Form 10-K for the year ended December 31, 2024\n and as updated from time to time in our other filings with the SEC.\nSIGNIFICANT ACTIVITIES DURING 2025\nLeasing Activity\n•\nNorthfield Park Severance Lease. \nSubsequent to quarter-end, on October 16, 2025, we announced that, in connection with MGM’s agreement to sell the operations of Northfield Park, located in Northfield, Ohio, to an affiliate of funds managed by Clairvest, we agreed to enter into (i) the Northfield Park Lease, a new triple-net lease agreement with an affiliate of Clairvest with respect to the real property of Northfield Park, and (ii) an amendment to the MGM Master Lease in order to account for MGM’s divestiture of the operations of Northfield Park and to reduce the annual base rent under the MGM Master Lease by the initial base rent under the Northfield Park Lease. The Northfield Park Lease will have an initial annual base rent of $53.0 million ($54.0 million if the transaction closes on or after May 1, 2026 to reflect the 2.0% annual escalation provided under the MGM Master Lease). Upon closing, the Northfield Park Lease will begin a new 25-year lease term with three 10-year tenant renewal options, with other economic terms substantially similar to the MGM Master Lease, including escalation of 2.0% per annum (with escalation equal to the greater of 2.0% and the change in CPI (capped at 3.0%) beginning at the same time as the MGM Master Lease in 2032) and a minimum capital expenditure requirement equal to 1.0% of annual net revenue. The Northfield Park Lease will be guaranteed by an affiliate of funds managed by Clairvest that will own the operations of Northfield Park. The transaction is subject to customary closing conditions and regulatory approvals and is expected to be completed in the first half of 2026.\n47\nTable of Contents\nReal Estate Debt Investment Activity\n•\nOne Beverly Hills Mezzanine Loan.\n On February 19, 2025, we purchased a $300.0 million interest in an existing mezzanine loan related to the development of One Beverly Hills, a landmark 17.5-acre luxury experiential lifestyle hub in Beverly Hills, California. On June 23, 2025, we purchased an additional $150.0 million interest in the existing mezzanine loan. One Beverly Hills is being developed by Cain and will be anchored by Aman Beverly Hills, featuring an Aman Hotel and Aman-branded residences, and include a full-scale refurbishment of The Beverly Hilton, additional retail, food and beverage offerings, and 10 acres of botanical gardens and open space. Construction of the development has commenced and is expected to be completed in phases in 2028.\nThe mezzanine loan has an initial maturity in March 2026 and one 12-month extension option, subject to certain conditions. Our investments were each funded with a combination of cash on hand and a draw under the Revolving Credit Facility.\n•\nNorth Fork Casino Loan.\n \nOn April 4, 2025, we provided a commitment of up to $510.0 million of the $725.0 million Term Loan Arrangement to the North Fork Rancheria Economic Development Authority, a wholly owned entity of the North Fork Rancheria of Mono Indians of California. Proceeds from the Term Loan Arrangement will be used to develop North Fork located near Madera, California, which will be developed and managed by affiliates of Red Rock Resorts. The Term Loan Arrangement consists of a $340.0 million Term Loan A, of which we have committed up to $125.0 million, and a $385.0 million Term Loan B, of which we have committed up to the full $385.0 million, for a total commitment of $510.0 million. The Term Loan A has an initial term of five years and the Term Loan B has an initial term of six years. The project is expected to be funded in accordance with a construction draw schedule and is expected to be completed in the second half of 2026.\nThe following table summarizes our real estate debt investment activity (each as defined in the column titled “Real Estate Debt Investment”) for the nine months ended September 30, 2025:\n(In millions)\nReal Estate Debt Investment\nInvestment Type\nMaximum Principal Amount\nCollateral\nOne Beverly Hills Loan\nMezzanine\n$\n450.0 \nLuxury experiential lifestyle hub in Beverly Hills, California\nNorth Fork Casino Loan\nSenior Secured Loan\n510.0 \nThe personal property and revenues of the North Fork Mono Casino & Resort located near Madera, California\nTotal\n$\n960.0 \nFinancing and Capital Markets Activity\n•\nNew Revolving Credit Facility. \nOn February 3, 2025, we entered into the Credit Agreement providing for the Revolving Credit Facility in the amount of $2.5 billion scheduled to mature on February 3, 2029. Concurrently, we terminated our 2022 Revolving Credit Facility and 2022 Credit Agreement\n. \nThe Revolving Credit Facility includes two six-month maturity extension options (or one twelve-month extension option), the exercise of which in each case is subject to customary conditions and the payment of an extension fee. The Revolving Credit Facility includes the option to increase the revolving loan commitments by up to $1.0 billion in the aggregate to the extent that any one or more lenders (from the syndicate or otherwise) agree to provide such additional credit extension. Borrowings under the Revolving Credit Facility will bear interest, at VICI LP’s option, for U.S. Dollar borrowings at either (i) a rate based on SOFR plus a margin ranging from 0.70% to 1.40%, or (ii) a base rate plus a margin ranging from 0.00% to 0.40%, in each case, with the actual margin determined according to VICI LP’s debt ratings (as the borrower under the Credit Agreement) and total leverage ratio. In addition to U.S. Dollar borrowings, borrowings under the Revolving Credit Facility are also available in certain specific foreign currencies, bearing interest based on rates customary for such foreign currencies and subject to the same applicable margins for U.S. Dollar borrowings. In addition, the Credit Agreement includes the option to add one or more tranches of term loans of up to $2.0 billion in the aggregate, in each case, to the extent that any one or more lenders (from the syndicate or otherwise) agree to provide such additional credit extensions.\n•\nAt-The-Market Offering Program. \nDuring the nine months ended September 30, 2025, we sold an aggregate of 7,835,973 shares under the ATM Program, all of which were subject to ATM forward sale agreements, for estimated aggregate total proceeds of $252.8 million based on the weighted average initial forward sale price of $32.27 per share. We did not initially receive any proceeds from the sale of the shares of common stock under the ATM forward sale \n48\nTable of Contents\nagreements, which were sold to the underwriters by the forward purchasers or their respective affiliates. On July 1, 2025 and August 11, 2025, we physically settled 9,662,116 and 2,439,256 forward shares, respectively, under the ATM Program in exchange for total net settlement proceeds of approximately $296.0 million and $79.8 million, respectively.\n•\nSenior Unsecured Notes Offering.\n On April 7, 2025, VICI LP issued $1.3 billion aggregate principal amount of April 2025 Notes comprised of (i) $400.0 million in aggregate principal amount of 4.750% Senior Notes due 2028, which mature on April 1, 2028 and (ii) $900.0 million in aggregate principal amount of 5.625% Senior Notes due 2035, which mature on April 1, 2035, in each case under a supplemental indenture dated as of April, 7, 2025, between VICI LP and the trustee. We used the net proceeds of the offering to redeem (i) $799.4 million in aggregate principal amount of the 4.625% Exchange Notes due 2025, (ii) $500.0 million in aggregate principal amount of the 4.375% April 2022 Notes due 2025 and (iii) $0.6 million in aggregate principal amount of the 4.625% MGP OP Notes due 2025.\n•\nForward-Starting Interest Rate Swaps. \nDuring the nine months ended September 30, 2025, we entered into eight forward-starting interest rate swap agreements for an aggregate notional amount of $400.0 million and three U.S. Treasury Rate Lock agreements for an aggregate a notional amount of $150.0 million to hedge against changes in future cash flows resulting from changes in interest rates from the trade date through the forecasted issuance of senior unsecured notes expected to be issued in connection with the refinancing of our senior unsecured notes maturing in May 2025 and June 2025, which April 2025 Notes were issued on April 7, 2025. On March 28, 2025, we settled twelve outstanding forward-starting interest rate swap agreements with an aggregate notional amount of $600.0 million and the three U.S. Treasury Rate Lock agreements with an aggregate notional amount of $150.0 million, resulting in net proceeds of $1.8 million. Since the forward-starting swaps are hedging the interest rate risk on the April 2025 Notes, the unrealized gain in Accumulated other comprehensive income will be amortized over the term of the respective derivative instruments, which matches that of the underlying note, as a decrease in interest expense. \n49\nTable of Contents\nRESULTS OF OPERATIONS\nThe results of operations discussion of VICI and VICI LP are presented combined as there are no material differences between the two reporting entities. Further, Golf revenues and Golf expenses, which are wholly attributable to VICI and not VICI LP, are shown as separate line items in the Statement of Operations of VICI. \nThree Months Ended\n September 30,\nNine Months Ended\n September 30,\n(In thousands)\n2025\n2024\nVariance\n2025\n2024\nVariance\nRevenues\nIncome from sales-type leases\n$\n531,765 \n$\n518,691 \n$\n13,074 \n$\n1,590,717 \n$\n1,543,752 \n$\n46,965 \nIncome from lease financing receivables, loans and securities\n447,986 \n419,115 \n28,871 \n1,314,726 \n1,242,151 \n72,575 \nOther income\n19,547 \n19,315 \n232 \n58,596 \n57,950 \n646 \nGolf revenues\n8,190 \n7,548 \n642 \n28,987 \n29,300 \n(313)\nTotal revenues\n1,007,488 \n964,669 \n42,819 \n2,993,026 \n2,873,153 \n119,873 \nOperating expenses\nGeneral and administrative\n16,344 \n16,458 \n(114)\n45,765 \n48,418 \n(2,653)\nDepreciation\n937 \n1,008 \n(71)\n2,674 \n3,133 \n(459)\nOther expenses\n19,547 \n19,315 \n232 \n58,596 \n57,950 \n646 \nGolf expenses\n6,765 \n6,824 \n(59)\n19,736 \n20,148 \n(412)\nChange in allowance for credit losses\n(20,153)\n(31,626)\n11,473 \n24,803 \n32,292 \n(7,489)\nTransaction and acquisition expenses\n9 \n1,164 \n(1,155)\n7,488 \n1,728 \n5,760 \nTotal operating expenses\n23,449 \n13,143 \n10,306 \n159,062 \n163,669 \n(4,607)\nInterest expense\n(210,333)\n(207,317)\n(3,016)\n(633,381)\n(617,976)\n(15,405)\nInterest income\n3,881 \n2,797 \n1,084 \n9,871 \n12,016 \n(2,145)\nOther (losses) gains\n(82)\n(64)\n(18)\n792 \n770 \n22 \nIncome before income taxes\n777,505 \n746,942 \n30,563 \n2,211,246 \n2,104,294 \n106,952 \nProvision for income taxes\n(3,885)\n(2,461)\n(1,424)\n(6,993)\n(7,257)\n264 \nNet income\n773,620 \n744,481 \n29,139 \n2,204,253 \n2,097,037 \n107,216 \nLess: Net income attributable to non-controlling interests\n(11,580)\n(11,583)\n3 \n(33,527)\n(32,821)\n(706)\nNet income attributable to common stockholders \n$\n762,040 \n$\n732,898 \n$\n29,142 \n$\n2,170,726 \n$\n2,064,216 \n$\n106,510 \n50\nTable of Contents\nRevenue \nFor the three and nine months ended September 30, 2025 and 2024, our revenue was comprised of the following items:\nThree Months Ended\nSeptember 30,\nNine Months Ended\n September 30,\n(In thousands)\n2025\n2024\nVariance\n2025\n2024\nVariance\nLeasing revenue\n$\n918,775 \n$\n901,559 \n$\n17,216 \n$\n2,747,275 \n$\n2,689,029 \n$\n58,246 \nIncome from loans and securities\n60,976 \n36,247 \n24,729 \n158,168 \n96,874 \n61,294 \nOther income\n19,547 \n19,315 \n232 \n58,596 \n57,950 \n646 \nGolf revenues\n8,190 \n7,548 \n642 \n28,987 \n29,300 \n(313)\n     Total revenues\n$\n1,007,488 \n$\n964,669 \n$\n42,819 \n$\n2,993,026 \n$\n2,873,153 \n$\n119,873 \nLeasing Revenue\nThe following table details the components of our income from sales-type and financing receivables leases:\nThree Months Ended\nSeptember 30,\nNine Months Ended\n September 30,\n(In thousands)\n2025\n2024\nVariance\n2025\n2024\nVariance\nIncome from sales-type leases\n$\n531,765 \n$\n518,691 \n$\n13,074 \n$\n1,590,717 \n$\n1,543,752 \n$\n46,965 \nIncome from lease financing receivables \n(1)\n387,010 \n382,868 \n4,142 \n1,156,558 \n1,145,277 \n11,281 \n     Total leasing revenue\n918,775 \n901,559 \n17,216 \n2,747,275 \n2,689,029 \n58,246 \nNon-cash adjustment \n(2)\n(131,247)\n(135,944)\n4,697 \n(393,370)\n(402,989)\n9,619 \n     Total contractual leasing revenue\n$\n787,528 \n$\n765,615 \n$\n21,913 \n$\n2,353,905 \n$\n2,286,040 \n$\n67,865 \n____________________\n(1) Represents our asset acquisitions structured as sale leaseback transactions. In accordance with ASC 842, since the lease agreements were determined to meet the definition of a sales-type lease and control of the asset is not considered to have transferred to us, such lease agreements are accounted for as financings under ASC 310.\n(2) Amounts represent the non-cash adjustment to income from sales-type leases and lease financing receivables in order to recognize income on an effective interest basis at a constant rate of return over the term of the leases. \nLeasing revenue is generated from rent from our lease agreements. Total leasing revenue increased $17.2 million and $58.2 million during the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, respectively. Total contractual leasing revenue increased $21.9 million and $67.9 million during the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, respectively. The increases were primarily driven by the incremental rent increases from our agreement through our Partner Property Growth Fund strategy to fund capital investments into the Venetian Resort for several reinvestment projects (the “Venetian Capital Investment”) (which occurred in July 2024, October 2024 and January 2025), as well as the annual rent escalators from certain of our other lease agreements.\nIncome From Loans and Securities\nIncome from loans and securities increased $24.7 million and $61.3 million during the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, respectively. The increase was primarily driven by the origination and subsequent funding, as applicable, of our debt investments and the related interest income from the increased principal balances outstanding under such debt investments.\n51\nTable of Contents\nOperating Expenses\nFor the three and nine months ended September 30, 2025 and 2024, our operating expenses were comprised of the following items:\nThree Months Ended\nSeptember 30,\nNine Months Ended\n September 30,\n(In thousands)\n2025\n2024\nVariance\n2025\n2024\nVariance\nGeneral and administrative\n$\n16,344 \n$\n16,458 \n$\n(114)\n$\n45,765 \n$\n48,418 \n$\n(2,653)\nDepreciation\n937 \n1,008 \n(71)\n2,674 \n3,133 \n(459)\nOther expenses\n19,547 \n19,315 \n232 \n58,596 \n57,950 \n646 \nGolf expenses\n6,765 \n6,824 \n(59)\n19,736 \n20,148 \n(412)\nChange in allowance for credit losses\n(20,153)\n(31,626)\n11,473 \n24,803 \n32,292 \n(7,489)\nTransaction and acquisition expenses\n9 \n1,164 \n(1,155)\n7,488 \n1,728 \n5,760 \n     Total operating expenses\n$\n23,449 \n$\n13,143 \n$\n10,306 \n$\n159,062 \n$\n163,669 \n$\n(4,607)\nGeneral and Administrative Expenses\nGeneral and administrative expenses decreased $0.1 million and $2.7 million for the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, respectively. The decrease was primarily driven by a decrease in compensation, including stock-based compensation.\nChange in Allowance for Credit Losses\nChange in allowance for credit losses increased $11.5 million during the three months ended September 30, 2025, compared to the three months ended September 30, 2024, primarily as a result of negative changes in the macroeconomic forecast during the period partially offset by changes to the reasonable and supportable period, or R&S Period, probability of default, or PD, and loss given default, or LGD, of our existing tenants and their parent guarantors (as applicable) due to market performance. Refer to \nNote 5 - Allowance for Credit Losses\n for further details.\nChange in allowance for credit losses decreased $7.5 million during the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024, primarily driven by a decrease in the volatility of the equity market performance of our tenants partially offset by negative changes in the macroeconomic forecast during the period.\nTransaction and Acquisition Expenses\nTransaction and acquisition expenses decreased $1.2 million and increased $5.8 million during the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, respectively. Changes in transaction and acquisition expenses are related to fluctuations in (i) costs incurred for investments during the period that are not capitalizable under GAAP, and (ii) costs incurred for investments that we are no longer pursuing.\n52\nTable of Contents\nNon-Operating Income and Expenses\nFor the three and nine months ended September 30, 2025 and 2024, our non-operating income and expenses were comprised of the following items:\nThree Months Ended\nSeptember 30,\nNine Months Ended\n September 30,\n(In thousands)\n2025\n2024\nVariance\n2025\n2024\nVariance\nInterest expense\n$\n(210,333)\n$\n(207,317)\n$\n(3,016)\n$\n(633,381)\n$\n(617,976)\n$\n(15,405)\nInterest income\n3,881 \n2,797 \n1,084 \n9,871 \n12,016 \n(2,145)\nOther (losses) gains\n(82)\n(64)\n(18)\n792 \n770 \n22 \nInterest Expense \nInterest expense increased $3.0 million and $15.4 million during the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, respectively. The increase during the three and nine months ended September 30, 2025 was primarily related to the increase in debt from the $175.0 million, £5.5 million and £2.0 million draws on the Revolving Credit Facility to partially finance the One Beverly Hills mezzanine loan investment in February 2025 and the upsizes of the Cabot Highlands loan in June 2024 and September 2025, respectively, partially offset by principal repayments under the Revolving Credit Facility of C$27.0 million in 2024 and C$13.0 million and $175.0 million in the nine months ended September 30, 2025.\nAdditionally, the weighted average annualized interest rate of our debt, net of the impact of the forward-starting interest rate swaps and treasury locks, increased to 4.45% from 4.34% for the three months ended September 30, 2025 compared to the three months ended September 30, 2024, and increased to 4.47% from 4.34% for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024, as a result of a higher effective interest rate on the March 2024 Notes, the December 2024 Notes and the April 2025 Notes as compared to the debt that was refinanced by such notes. \nInterest Income\nInterest income, representing interest earned on our excess cash, increased $1.1 million and decreased $2.1 million during the three and nine months ended September 30, 2025, respectively, compared to the three and nine months ended September 30, 2024, respectively. The changes were primarily driven by fluctuations in our cash on hand throughout the current periods as compared to the prior periods.\n53\nTable of Contents\nRECONCILIATION OF NON-GAAP MEASURES\nWe present VICI’s Funds From Operations (“FFO”), FFO per share, Adjusted Funds From Operations (“AFFO”), AFFO per share, and Adjusted EBITDA, which are not required by, or presented in accordance with, generally accepted accounting principles in the United States (“GAAP”). These are non-GAAP financial measures and should not be construed as alternatives to net income or as an indicator of operating performance (as determined in accordance with GAAP). We believe FFO, FFO per share, AFFO, AFFO per share and Adjusted EBITDA provide a meaningful perspective of the underlying operating performance of VICI’s business.\nFFO is a non-GAAP financial measure that is considered a supplemental measure for the real estate industry and a supplement to GAAP measures. Consistent with the definition used by the National Association of Real Estate Investment Trusts (NAREIT), we define FFO as VICI’s net income (or loss) attributable to common stockholders (computed in accordance with GAAP) excluding (i) gains (or losses) from sales of certain real estate assets, (ii) depreciation and amortization related to real estate, (iii) gains and losses from change in control and (iv) impairment write-downs of certain real estate assets and investments in entities when the impairment is directly attributable to decreases in the value of depreciable real estate held by the entity.\nAFFO is a non-GAAP financial measure that we use as a supplemental operating measure to evaluate VICI’s performance. We calculate VICI’s AFFO by adding or subtracting from FFO non-cash leasing and financing adjustments, non-cash change in allowance for credit losses, non-cash stock-based compensation expense, transaction costs incurred in connection with the acquisition of real estate investments, amortization of debt issuance costs and original issue discount, other non-cash interest expense, non-real estate depreciation (which is comprised of the depreciation related to our golf course operations), capital expenditures (which are comprised of additions to property, plant and equipment related to our golf course operations), impairment charges related to non-depreciable real estate, gains (or losses) on debt extinguishment and interest rate swap settlements, other gains (or losses), deferred income tax expenses and benefits, other non-recurring non-cash transactions and non-cash adjustments attributable to non-controlling interest with respect to certain of the foregoing. \nWe calculate VICI’s Adjusted EBITDA by adding or subtracting from AFFO contractual interest expense (including the impact of the forward-starting interest rate swaps and treasury locks) and interest income (collectively, interest expense, net), current income tax expense and adjustments attributable to non-controlling interests.\nThese non-GAAP financial measures: (i) do not represent VICI’s cash flow from operations as defined by GAAP; (ii) should not be considered as an alternative to VICI’s net income as a measure of operating performance or to cash flows from operating, investing and financing activities; and (iii) are not alternatives to VICI’s cash flow as a measure of liquidity. In addition, these measures should not be viewed as measures of liquidity, nor do they measure our ability to fund all of our cash needs, including our ability to make cash distributions to our stockholders, to fund capital improvements, or to make interest payments on our indebtedness. Investors are also cautioned that FFO, FFO per share, AFFO, AFFO per share and Adjusted EBITDA, as presented, may not be comparable to similarly titled measures reported by other real estate companies, including REITs, due to the fact that not all real estate companies use the same definitions. Our presentation of these measures does not replace the presentation of VICI’s financial results in accordance with GAAP.\n54\nTable of Contents\nReconciliation of VICI’s Net Income to FFO, FFO per Share, AFFO, AFFO per Share and Adjusted EBITDA\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n(In thousands, except share data and per share data)\n2025\n2024\n2025\n2024\nNet income attributable to common stockholders\n$\n762,040 \n$\n732,898 \n$\n2,170,726 \n$\n2,064,216 \nReal estate depreciation\n— \n— \n— \n— \nFFO attributable to common stockholders\n762,040\n \n732,898\n \n2,170,726\n \n2,064,216\n \nNon-cash leasing and financing adjustments\n(131,171)\n(135,890)\n(393,240)\n(402,839)\nNon-cash change in allowance for credit losses\n(20,153)\n(31,626)\n24,803 \n32,292 \nNon-cash stock-based compensation\n4,415 \n4,601 \n11,758 \n12,973 \nTransaction and acquisition expenses\n9 \n1,164 \n7,488 \n1,728 \nAmortization of debt issuance costs and original issue discount\n17,395 \n18,747 \n54,909 \n52,900 \nOther depreciation\n806 \n883 \n2,284 \n2,564 \nCapital expenditures\n(189)\n(878)\n(939)\n(1,943)\nOther losses (gains) \n(1)\n82 \n64 \n(792)\n(770)\nDeferred income tax provision\n2,776 \n1,945 \n2,848 \n4,233 \nNon-cash adjustments attributable to non-controlling interests\n1,559 \n1,950 \n3,884 \n4,100 \nAFFO attributable to common stockholders\n637,569\n \n593,858\n \n1,883,729\n \n1,769,454\n \nInterest expense, net\n189,057 \n185,773 \n568,601 \n553,060 \nCurrent income tax expense\n1,109 \n516 \n4,145 \n3,024 \nAdjustments attributable to non-controlling interests\n(2,153)\n(2,152)\n(6,518)\n(6,420)\nAdjusted EBITDA attributable to common stockholders\n$\n825,582\n \n$\n777,995\n \n$\n2,449,957\n \n$\n2,319,118\n \nNet income per common share\nBasic\n$\n0.71 \n$\n0.70 \n$\n2.05 \n$\n1.98 \nDiluted\n$\n0.71 \n$\n0.70 \n$\n2.05 \n$\n1.98 \nFFO per common share\n     Basic\n$\n0.71 \n$\n0.70 \n$\n2.05 \n$\n1.98 \nDiluted\n$\n0.71 \n$\n0.70 \n$\n2.05 \n$\n1.98 \nAFFO per common share\nBasic\n$\n0.60 \n$\n0.57 \n$\n1.78 \n$\n1.70 \nDiluted\n$\n0.60 \n$\n0.57 \n$\n1.78 \n$\n1.69 \nWeighted average number of shares of common stock outstanding\nBasic\n1,067,253,644 \n1,046,626,838 \n1,059,870,808 \n1,043,921,660 \nDiluted\n1,068,369,218 \n1,048,338,348 \n1,060,732,039 \n1,044,897,468 \n____________________\n(1)\nRepresents non-cash foreign currency remeasurement adjustment and gain on sale of certain land parcels.\n55\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity \nAs of September 30, 2025, our available cash and cash-equivalents balance, short-term investments, capacity under our Revolving Credit Facility and proceeds available from outstanding forward sale agreements were as follows:\n(In thousands)\nSeptember 30, 2025\nCash and cash equivalents\n$\n507,503 \nCapacity under Revolving Credit Facility \n(1)\n \n2,352,094 \nNet proceeds available from settlement of Forward Sale Agreements \n(2)\n244,886 \nTotal\n$\n3,104,483 \n____________________\n(1)\nIn addition, the Credit Agreement includes the option (i) to increase the revolving loan commitments by up to $1.0 billion and (ii) to add one or more tranches of term loans of up to $2.0 billion in the aggregate, in each case, to the extent that any one or more lenders (from the syndicate or otherwise) agree to provide such additional credit extensions.  \n(2)\nAssumes the physical settlement of the 7,750,000 shares remaining to be settled as of September 30, 2025 under our ATM forward sale agreements at a forward sales price of $31.60, calculated as of September 30, 2025.\nWe believe that we have sufficient liquidity to meet our material cash requirements, including our contractual obligations, debt maturities and commitments as well as our additional funding requirements, primarily through currently available cash and cash equivalents, cash received under our lease agreements, existing borrowings from banks, including our undrawn capacity under our Revolving Credit Facility, net proceeds available under our outstanding forward sale agreements, and proceeds from any future issuances of debt and equity securities (including issuances under the ATM Program or any future “at-the-market” program) for the next 12 months and in future periods. \nAll of our lease agreements call for an initial term of between fifteen and thirty-two years with additional tenant renewal options and, along with our loans, are designed to provide us with a reliable and predictable long-term revenue stream. Our cash flows from operations and our ability to access capital resources could be adversely affected due to uncertain economic factors and volatility in the financial and credit markets, including as a result of the current interest rate environment, inflationary pressures, equity market volatility, and changes in consumer behavior and spending. In particular, we can provide no assurances that our tenants will not default on their leases or fail to make full rental payments if their businesses become challenged due to, among other things, current or future adverse economic conditions. See “Overview — Impact of Material Trends on our Business” above for additional detail. In the event our tenants are unable to make all of their contractual rent payments as provided by our lease agreements, we believe we have sufficient liquidity from the other sources discussed above to meet all of our contractual obligations for a significant period of time. For more information, refer to the risk factors incorporated by reference into \nPart II. Item 1A. Risk Factors\n herein from our \nAnnual Report on Form 10-K for the year ended December 31, 2024\n.\nOur ability to raise funds through the issuance of debt and equity securities and access to other third-party sources of capital in the future will be dependent on, among other things, general economic conditions, general market conditions for REITs and investment grade issuers, market perceptions, the trading price of our stock, the trading value of our unsecured debt and uncertainties related to the macroeconomic environment. We will continue to analyze which sources of capital are most advantageous to us at any particular point in time and with respect to any specific funding requirements, but financing through the capital markets may not be consistently available on terms we deem attractive, or at all.\nMaterial Cash Requirements\nContractual Obligations\nOur short-term obligations consist primarily of regular interest payments on our debt obligations, dividends to our common stockholders, distributions to the VICI OP Unit holders, Lucky Strike OP Units holders and to the 20% third-party owners of Harrah’s Joliet LandCo LLC, normal recurring operating expenses, recurring expenditures for corporate and administrative needs, certain lease and other contractual commitments related to our golf operations and certain non-recurring expenditures. For more information on our material contractual commitments, refer to \nNote 10 - Commitments and Contingent Liabilities\n.\nOur long-term obligations consist primarily of principal payments on our outstanding debt obligations and future funding commitments under our lease and loan agreements. As of September 30, 2025, we had $17.1 billion of debt obligations outstanding, of which $500.0 million matures on September 1, 2026. For a summary of principal debt balances and their \n56\nTable of Contents\nmaturity dates and principal terms, refer to \nNote 7 - Debt\n. For a summary of our future funding commitments under our loan portfolio, refer to \nNote 4 - Real Estate Portfolio\n.\nPursuant to our lease agreements, capital expenditures, insurance and taxes for our properties are the responsibility of the tenants. Minimum capital expenditure spending requirements of the tenants pursuant to our gaming lease agreements are described in \nNote 4 - Real Estate Portfolio\n.\nInformation concerning our material contractual obligations and commitments to make future payments under contracts such as our indebtedness, future funding commitments under our loans and Partner Property Growth Fund strategy and future contractual operating commitments (such as future lease payments under our corporate lease) are included in the following table as of September 30, 2025. Amounts in this table omit, among other things, non-contractual commitments and items such as dividends and recurring or non-recurring operating expenses and other expenditures, including acquisitions and other investments:\nPayments Due By Period\n(In thousands)\nTotal\n2025 (remaining)\n2026\n2027\n2028\n2029 and Thereafter\nLong-term debt, principal\nSenior Unsecured Notes\n$\n13,950,000 \n$\n— \n$\n1,750,000 \n$\n1,500,000 \n$\n2,000,000 \n$\n8,700,000 \nMGM Grand/Mandalay Bay CMBS Debt\n3,000,000 \n— \n— \n— \n— \n3,000,000 \nRevolving Credit Facility\n147,906 \n— \n— \n— \n— \n147,906 \nScheduled interest payments \n(1)\n5,503,498 \n189,094 \n796,056 \n684,806 \n602,496 \n3,231,046 \nTotal debt contractual obligations\n22,601,404 \n189,094 \n2,546,056 \n2,184,806 \n2,602,496 \n15,078,952 \nLeases and contracts \n(2)\nFuture funding commitments – loan investments \n(3)\n730,553 \n86,845 \n610,938 \n22,191 \n3,526 \n7,053 \nGolf course operating lease and contractual commitments\n38,396 \n540 \n2,197 \n2,241 \n2,286 \n31,132 \nCorporate office leases\n15,356 \n— \n1,742 \n871 \n1,742 \n11,001 \nTotal leases and contractual obligations\n784,305 \n87,385 \n614,877 \n25,303 \n7,554 \n49,186 \nTotal contractual commitments\n$\n23,385,709 \n$\n276,479 \n$\n3,160,933 \n$\n2,210,109 \n$\n2,610,050 \n$\n15,128,138 \n____________________\n(1) Estimated interest payments on variable interest debt under our Revolving Credit Facility are based on the applicable SOFR, CORRA and SONIA rates as of September 30, 2025.\n(2) Excludes ground and use leases which are paid directly by our tenants to the primary lease holder.\n(3) The allocation of our future funding commitments is based on construction draw schedules, commitment funding dates, expiration dates or other information, as applicable; however, we may be obligated to fund these commitments earlier than such applicable date.\nAdditional Funding Requirements\nIn addition to the contractual obligations and commitments set forth in the table above, we have and may enter into additional agreements that commit us to potentially acquire properties in the future, fund future property improvements or otherwise provide capital to our tenants, borrowers and other counterparties, including through our Partner Property Growth Fund strategy. As of September 30, 2025, we had $300.0 million of additional potential future funding commitments in connection with the Venetian Capital Investment entered into on May 1, 2024, pursuant to which the tenant has the option, but not the obligation, to draw our future funds, prior to November 1, 2026. The utilization of funding commitments under the Partner Property Growth Fund strategy, as well as the total funding ultimately provided under such arrangements, is at the discretion of the respective tenant and will be dependent upon independent decisions made by such tenant with respect to any capital improvement projects and the source of funds for such projects. \n57\nTable of Contents\nCash Flow Analysis\nThe table below summarizes our cash flows for the nine months ended September 30, 2025 and 2024:\nNine Months Ended September 30,\n(In thousands)\n2025\n2024\nVariance\nCash, cash equivalents and restricted cash\nProvided by operating activities\n$\n1,818,047 \n$\n1,737,401 \n$\n80,646 \nUsed in investing activities\n(765,460)\n(662,606)\n(102,854)\nUsed in financing activities\n(1,070,208)\n(1,242,227)\n172,019 \nEffect of exchange rate changes on cash, cash equivalents and restricted cash \n509 \n525 \n(16)\nNet decrease in cash, cash equivalents and restricted cash\n(17,112)\n(166,907)\n149,795 \nCash, cash equivalents and restricted cash, beginning of period\n524,615 \n522,574 \n2,041 \nCash, cash equivalents and restricted cash, end of period\n$\n507,503 \n$\n355,667 \n$\n151,836 \nCash Flows from Operating Activities\nNet cash provided by operating activities increased $80.6 million for the nine months ended September 30, 2025 compared with the nine months ended September 30, 2024. The increase was primarily driven by the annual rent escalators on certain of our lease agreements and the incremental rent increases from the Venetian Capital Investment (which occurred in July 2024, October 2024 and January 2025), as well as the incremental interest income associated with additional loan fundings and originations.\nCash Flows from Investing Activities\nNet cash used in investing activities increased $102.9 million for the nine months ended September 30, 2025 compared with the nine months ended September 30, 2024. \nDuring the nine months ended September 30, 2025, the primary sources and uses of cash from investing activities included: \n•\nDisbursements to fund investments in our loan and securities portfolio in the amount of $786.4 million; and\n•\nProceeds from the partial repayment of the Cabot Saint Lucia and Homefield loans and the Hard Rock Ottawa Notes and deferred fees in the amount of \n$20.3 million.\nDuring the \nnine months ended September 30, 2024\n, the primary sources and uses of cash from investing activities included: \n•\nDisbursements to fund investments in our loan and securities portfolio in the amount of \n$473.7 million\n;\n•\nPayments to fund the Venetian Capital Investment and Property Growth Fund investment at Caruthersville in the amount of \n$261.8 million;\n•\nProceeds from the repayment of the Great Wolf Lodge Maryland mezzanine loan in the amount of \n$79.5 million;\n•\nInvestments and maturities of short-term investments of \n$29.6 million; and\n•\nPayments for property and equipment costs of $6.4 million.\nCash Flows from Financing Activities\nNet cash used in financing activities decreased $172.0 million for the nine months ended September 30, 2025, compared with the nine months ended September 30, 2024.\nDuring the nine months ended September 30, 2025, the primary sources and uses of cash in financing activities included: \n•\nNet proceeds from the issuance of the April 2025 Notes in the amount of $1,284.4 million;\n•\nRedemption of the outstanding (i) $799.4 million in aggregate principal amount of the 4.625% Exchange Notes due 2025, (ii) $500.0 million in aggregate principal amount of the 4.375% April 2022 Notes due 2025, and (iii) $0.6 million in aggregate principal amount of the 4.625% MGP OP Notes due 2025;\n58\nTable of Contents\n•\nDividend payments of $1,372.7 million;\n•\nNet proceeds of $375.4 million from the physical settlement of 12,101,372 forward shares under our ATM Program;\n•\nDraws of $426.0 million and repayments of $432.7 million on our Revolving Credit Facility;\n•\nDistributions of $24.0 million to non-controlling interests;\n•\nPayments of debt issuance costs of $19.4 million; and\n•\nRepurchase of shares of common stock for tax withholding in connection with the vesting of employee stock compensation of $7.2 million.\nDuring the nine months ended September 30, 2024, the primary sources and uses of cash from financing activities included: \n•\nNet proceeds from the issuance of the March 2024 Notes in the amount of $1,028.5 million;\n•\nRedemption of the outstanding (i) $1,024.2 million in aggregate principal amount of the 5.625% Senior Notes due 2024 and (ii) $25.8 million in aggregate principal amount of the 5.625% MGP OP Notes due 2024;\n•\nDividend payments of $1,300.3 million;\n•\nNet proceeds of $115.1 million from the physical settlement of 4,000,000 forward shares under our ATM Program;\n•\nRepayment of $85.9 million on our Revolving Credit Facility;\n•\nDraw of $82.2 million on our Revolving Credit Facility;\n•\nDistributions of $23.2 million to non-controlling interests;\n•\nRepurchase of shares of common stock for tax withholding in connection with the vesting of employee stock compensation of $5.3 million; and\n•\nPayments of debt issuance costs of $3.3 million.\nDebt\nFor a summary of our debt obligations as of September 30, 2025, refer to \nNote 7 - Debt\n.\nCovenants\nOur debt obligations are subject to certain customary financial and protective covenants that restrict our ability to incur additional debt, sell certain assets and restrict certain payments, among other things. In addition, these covenants are subject to a number of important exceptions and qualifications, including, with respect to the restricted payments covenant, the ability to make unlimited restricted payments to maintain our REIT status. At September 30, 2025, we were in compliance with all debt-related covenants.\nDistribution Policy\nWe intend to make regular quarterly distributions to holders of shares of our common stock. Dividends declared (on a per share basis) during the nine months ended September 30, 2025 and 2024 were as follows:\nNine Months Ended September 30, 2025\nDeclaration Date\nRecord Date\nPayment Date\nPeriod\nDividend\nMarch 6, 2025\nMarch 20, 2025\nApril 3, 2025\nJanuary 1, 2025 – March 31, 2025\n$\n0.4325 \nJune 5, 2025\nJune 18, 2025\nJuly 10, 2025\nApril 1, 2025 – June 30, 2025\n$\n0.4325 \nSeptember 4, 2025\nSeptember 18, 2025\nOctober 9, 2025\nJuly 1, 2025 - September 30, 2025\n$\n0.4500 \nNine Months Ended September 30, 2024\nDeclaration Date\nRecord Date\nPayment Date\nPeriod\nDividend\nMarch 7, 2024\nMarch 21, 2024\nApril 4, 2024\nJanuary 1, 2024 – March 31, 2024\n$\n0.4150 \nJune 7, 2024\nJune 18, 2024\nJuly 3, 2024\nApril 1, 2024 – June 30, 2024\n$\n0.4150 \nSeptember 5, 2024\nSeptember 18, 2024\nOctober 3, 2024\nJuly 1, 2024 - September 30, 2024\n$\n0.4325 \n59\nTable of Contents\nFederal income tax law requires that a REIT distribute annually at least 90% of its REIT taxable income (with certain adjustments), determined without regard to the dividends paid deduction and excluding any net capital gains, and that it pay tax at regular corporate rates to the extent that it annually distributes less than 100% of its REIT taxable income, determined without regard to the dividends paid deduction and including any net capital gains. In addition, a REIT will be required to pay a 4% nondeductible excise tax on the amount, if any, by which the distributions it makes in a calendar year are less than the sum of 85% of its ordinary income, 95% of its capital gain net income and 100% of its undistributed income from prior years.\nWe intend to continue to make distributions to our stockholders to comply with the REIT requirements of the Internal Revenue Code of 1986, as amended (the “Code”), and to avoid or otherwise minimize paying entity level federal income or excise tax (other than at any TRS of ours). We may generate taxable income greater than our income for financial reporting purposes prepared in accordance with GAAP. Further, we may generate REIT taxable income greater than our cash flow from operations after operating expenses and debt service as a result of differences in timing between the recognition of REIT taxable income and the actual receipt of cash or the effect of nondeductible capital expenditures, the creation of reserves or required debt or amortization payments.\nCritical Accounting Policies and Estimates\nA complete discussion of our critical accounting policies and estimates is included in our \nAnnual Report on Form 10-K for the year ended December 31, 2024\n. There have been no significant changes in our critical policies and estimates for the nine months ended September 30, 2025."
}