{
  "source_file": "vici-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\nBusiness\nWe are a Maryland corporation that is primarily engaged in the business of owning and acquiring gaming, hospitality, wellness, entertainment and leisure destinations, subject to long-term triple net leases. As of December 31, 2024, we own 93 experiential assets across a geographically diverse portfolio consisting of 54 gaming properties and 39 other experiential properties across the United States and Canada, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort Las Vegas (the “Venetian Resort”), three of the most iconic entertainment facilities on the Las Vegas Strip. Our gaming and entertainment facilities are leased to leading brands that seek to drive consumer loyalty and value with guests through superior services, experiences, products and continuous innovation. Across approximately \n127 \nmillion square feet, our well-maintained properties are curren\ntly located across urban, destination and drive-to markets in twenty-six states and Canada, contain approximately 60,300 hotel rooms and feature over 500 restaurants, bars, nightclubs and sportsbooks. As of \nDecember 31, 2024,\n our properties are 100% leased with a weighted average lease term, including extension options, of approximately \n40.7 years\n.\n2\nTable of Contents\nWe also have a growing array of real estate and financing partnerships with leading operators in other experiential sectors, including Cabot, Canyon Ranch, Chelsea Piers, Great Wolf Resorts, Homefield, Kalahari Resorts, and Lucky Strike Entertainment. This portfolio includes certain real estate debt investments that we have originated for strategic reasons, primarily in connection with transactions that either do or may provide the potential to convert our investment into the ownership of certain of the underlying real estate in the future. In addition, we own approximately 33 acres of undeveloped or underdeveloped land on and adjacent to the Las Vegas Strip that is leased \nto Caesars Entertainment, Inc. (together with, as the context requires, its subsidiaries, “Caesars”), \nwhich we may look to monetize as appropriate. VICI also owns four championship golf courses located near certain of our properties, two of which are in close proximity to the Las Vegas Strip. \nOur portfolio is competitively positioned and well-maintained. Pursuant to the terms of our lease agreements, which require our tenants to invest in our properties, and in line with our tenants’ commitment to build guest loyalty, we anticipate our tenants will continue to make strategic value-enhancing investments in our properties over time, helping to maintain their competitive position. Our long-term triple-net leases provide our tenants with complete control over management at our leased properties, including sole responsibility for all operations and related expenses, including property taxes, insurance and maintenance, repair, improvement and other capital expenditures, as well as over the implementation of environmental sustainability and other initiatives.\nWe conduct our operations as a real estate investment trust (“REIT”) for U.S. federal income tax purposes. We generally will not be subject to U.S. federal income taxes on our taxable income to the extent that we annually distribute all of our net taxable income to stockholders and maintain our qualification as a REIT. We believe VICI’s election of REIT status, combined with the income generation from the lease agreements and loans, will enhance our ability to make distributions to our stockholders, providing investors with current income as well as long-term growth, subject to the macroeconomic environment, other global events and market conditions more broadly. We conduct our real property business through VICI OP and our golf course business through a taxable REIT subsidiary (a “TRS”), VICI Golf LLC (“VICI Golf”).\nOur Investment Highlights\n•\nDemonstrated track record of growth with significant scale. \nWe have made approximately $37.0 billion of domestic and international investments across gaming and other experiential assets since our formation in October 2017. Following our growth and resulting scale, we were added to the S&P 500 Index in June 2022. \n•\nStable and transparent cash flows by leading operators.\n Our properties are 100% occupied pursuant to our long-term triple-net lease agreements, which provide us with a predictable level of rental revenue to support future cash distributions to our stockholders, with 100% rent collection since our formation in October 2017. Our tenants are market-leading gaming and experiential operators, with the majority of our rent derived from properties operated by SEC reporting companies, providing transparency into our tenants’ performance and health. \n•\nContractual escalation with inflation protection. \nAll of our lease agreements provide for annual base rent escalations, which may be fixed or variable over the life of the lease. The rent escalation provisions range from providing for a flat annual increase of 1% to 2% to an annual increase of 1% in the earlier years and the greater of 2% or the U.S consumer price index (“CPI”) in the later years, which may be subject to a maximum CPI-based cap with respect to each annual rent increase. Among our leases, 15 of 18 are subject to a CPI-linked escalation over the life of the lease (subject to applicable caps). As of December, 31, 2024, 40% of our annualized rental revenue was subject to CPI-linked escalation.\n•\nMission critical complex real estate\n.\n Our portfolio benefits from a strong mix of demand generators, including casinos, hotels, restaurants, entertainment facilities, bars and nightclubs and convention space. Our Las Vegas properties, including Caesars Palace Las Vegas, MGM Grand and the Venetian Resort, which are located on the Las Vegas Strip, are among the most iconic entertainment facilities in Las Vegas, featuring gaming entertainment, large-scale hotels, extensive food and beverage options, state-of-the-art convention facilities, retail outlets and entertainment venues. The size, use and location of our real estate drives our tenants’ continued investment into our leased properties, which “same-store” capital improvements we seek to fund in exchange for increased rent through our Partner Property Growth Fund strategy. Additionally, the gaming regulatory environment in which we operate creates a high barrier to entry and limits our tenants’ ability to move locations. \n•\nStrategic financing relationships with leading experiential operators. \nIn addition to our relationships with leading gaming operators, we have entered into strategic financing relationships with other experiential operators in sectors such as world-class destination golf resorts and communities, integrative wellness centers, premier sports and entertainment complexes and family-oriented indoor waterpark resorts, which we refer to as our VICI Experiential Credit Solutions strategy. We believe the relationships established through this strategy may lead to additional \n3\nTable of Contents\nmutually beneficial growth opportunities with these industry-leading experiential operators in the future, including the potential to convert certain of our investments into ownership of the underlying real estate.\nOur Properties and Lease Agreements\nOur experiential portfolio features world-renowned assets on the Las Vegas Strip and market-leading urban, destination and regional properties with significant scale. Our properties are leased to leading operators that seek to drive loyalty and value with guests through superior services, experiences and products and continuous innovation. \nWe derive a substantial majority of our revenues from rental revenue from the lease agreements for our properties, each of which are “triple-net” leases, pursuant to which the tenant bears responsibility for all property costs and expenses associated with ongoing maintenance and operation, including utilities, property tax and insurance. Our lease agreements are generally long term in nature with initial terms ranging from 15 to 32 years and are generally structured with several tenant renewal options extending the term of the lease for another 5 to 30 years. All of our lease agreements provide for annual base rent escalations, which may be fixed or variable over the life of the lease. The rent escalation provisions range from providing for a flat annual increase of 1% to 2% to an annual increase of 1% in the earlier years and the greater of 2% or CPI in the later years, which may be subject to a maximum CPI-based cap with respect to each annual rent increase. For an overview of the provisions of certain of our lease agreements, including the related capital expenditure requirements, refer to \nNote 4 - Real Estate Portfolio\n. \nThe following tables summarize our lease agreements between us and our respective tenants and guarantors (each, as may be amended from time to time, and each individually, as defined in the column titled “Lease Agreement”) and the properties under each our respective lease agreements, as of the date of this Annual Report. \nLease Agreement \n(1)\nProperty\nLocation\nTenant/Guarantor \n(2)\nInitial Expiration\n (3)\nGaming Portfolio\nCaesars Joliet Lease\nCaesars\nJuly 31, 2035\nHarrah’s Joliet \n(4)\nJoliet, IL\nCaesars Las Vegas Master Lease\nCaesars\nJuly 31, 2035\nCaesars Palace Las Vegas\nLas Vegas, NV\nHarrah’s Las Vegas\nLas Vegas, NV\nCaesars Regional Master Lease\nCaesars\nJuly 31, 2035\nCaesars Atlantic City\nAtlantic City, NJ\nHarrah’s Atlantic City\nAtlantic City, NJ\nHarrah’s Council Bluffs\nCouncil Bluffs, IA\nHarrah’s Gulf Coast \n(5)\nBiloxi, MS\nHarrah’s Lake Tahoe\nStateline, NV\nHarrah’s Laughlin\nLaughlin, NV\nHarrah’s Metropolis \n(5)\nMetropolis, IL\nHarrah’s New Orleans \n(5)\nNew Orleans, LA\nHarrah’s North Kansas City \n(5)\nNorth Kansas City, MO\nHarrah’s Philadelphia\nChester, PA\nHarvey’s Lake Tahoe \n(5)\nStateline, NV\nHorseshoe Bossier City \n(5)\nBossier City, LA\nHorseshoe Council Bluffs\nCouncil Bluffs, IA\nHorseshoe Hammond \n(5)\nHammond, IN\nHorseshoe Tunica\nRobinsonville, MS\nCentury Master Lease\nCentury Casinos, Inc.\nSeptember 30, 2038\nCentury Casino & Hotel Edmonton \n(6)\nEdmonton, AB\nCentury Casino Cape Girardeau\nCape Girardeau, MO\nCentury Casino Caruthersville\nCaruthersville, MO\nCentury Casino St. Albert \n(6)\nEdmonton, AB\nCentury Downs Racetrack and Casino \n(6)\nCalgary, AB\nCentury Mile Racetrack \n(5) (6)\nEdmonton, AB\n4\nTable of Contents\nLease Agreement \n(1)\nProperty\nLocation\nTenant/Guarantor \n(2)\nInitial Expiration\n (3)\nMountaineer Casino Resort & Racetrack\nNew Cumberland, WV\nRocky Gap Casino Resort \n(5)\nFlintstone, MD\nCNE Gold Strike Lease\nCherokee Nation Businesses, L.L.C. (“CNB”) \n(7)\nApril 30, 2048\nGold Strike Tunica\nRobinsonville, MS\nEBCI Southern Indiana Lease\nEastern Band of Cherokee Indians (“EBCI”)\nAugust 31, 2036\nCaesars Southern Indiana\nElizabeth, IN\nFoundation Master Lease\nFoundation Gaming & Entertainment, LLC\nDecember 31, 2037\nFitz\nRobinsonville, MS\nWaterView\nVicksburg, MS\nHard Rock Cincinnati Lease\nSeminole Hard Rock International (“Hard Rock”)\nDecember 31, 2047\nHard Rock Cincinnati\nCincinnati, OH\nHard Rock Mirage Lease\nHard Rock\nDecember 31, 2047\nThe Mirage\nLas Vegas, NV\nJACK Master Lease\nJACK Ohio LLC\nJanuary 31, 2040\nJACK Cleveland\nCleveland, OH\nJACK Thistledown Racino\nNorth Randall, OH\nMGM Master Lease\nMGM\nApril 30, 2047\nBeau Rivage \n(5)\nBiloxi, MS\nBorgata \n(5)\nAtlantic City, NJ\nEmpire City\nYonkers, NY\nExcalibur\nLas Vegas, NV\nLuxor\nLas Vegas, NV\nMGM Grand Detroit\nDetroit, MI\nMGM National Harbor \n(5)\nPrince George’s County, MD\nMGM Northfield Park\nNorthfield, OH\nMGM Springfield\nSpringfield, MA\nNew York - New York/The Park\nLas Vegas, NV\nPark MGM\nLas Vegas, NV\nMGM Grand/Mandalay Bay Lease\nMGM\nFebruary 28, 2050\nMandalay Bay\nLas Vegas, NV\nMGM Grand\nLas Vegas, NV\nPENN Greektown Lease\nPENN Entertainment, Inc.\nMay 23, 2034\nHollywood Casino at  Greektown\nDetroit, MI\nPENN Margaritaville Lease\nPENN Entertainment, Inc.\nJanuary 31, 2034\nMargaritaville Resort Casino \n(5)\nBossier City, LA\nPURE Master Lease\nIndigenous Gaming Partners Inc. (“IGP”) \n(8)\nJanuary 31, 2048\nPURE Casino Calgary \n(9)\nCalgary, AB\nPURE Casino Edmonton \n(9)\nEdmonton, AB\nPURE Casino Lethbridge \n(9)\nLethbridge, AB\nPURE Casino Yellowhead \n(9)\nEdmonton, AB\nVenetian Lease\nFunds managed by Apollo Global Management, Inc.\nFebruary 29, 2052\nVenetian Resort\nLas Vegas, NV\nTotal Gaming Portfolio\n54\n5\nTable of Contents\nLease Agreement \n(1)\nProperty\nLocation\nTenant/Guarantor \n(2)\nInitial Expiration\n (3)\nOther Experiential Portfolio\nLucky Strike Master Lease\nLucky Strike Entertainment Corporation (“Lucky Strike Entertainment”) \n(10)\nOctober 18, 2048\nBowling Entertainment Centers\nVarious U.S. Cities (38)\nChelsea Piers Lease\nChelsea Piers\nDecember 31, 2055 \n(11)\nChelsea Piers \n(5)\nNew York, NY\nTotal Other Experiential Portfolio\n39\nTotal\n93\n____________________\n(1) Reflects the lease agreement currently in effect between us and the applicable tenant. \n(2) The tenants under our lease agreements are subsidiaries and/or affiliates of the guarantors set forth in this table.\n(3) Represents the expiration date assuming no tenant renewal option is exercised. \n(4) Owned by Harrah’s Joliet Landco LLC, a joint venture of which a wholly owned subsidiary of VICI LP is the 80% owner and the managing member.\n(5) The core property, or a portion thereof, is leased by us pursuant to a ground lease. Rent due under any such ground lease is paid directly by our tenant to the primary landlord pursuant to their respective lease agreement.\n(6) Collectively, the “Century Canadian Portfolio”.\n(7) CNB is the parent entity of CNE Holdings, LLC also known as Cherokee Nation Entertainment.\n(8) IGP is a gaming partnership established by five institutional Nova Scotia-based First Nations (Glooscap First Nation, Millbrook First Nation, Annapolis Valley First Nation, We’koqma’q L’nue’kati, and Paqtnkek Mi’kmaw Nation) to acquire gaming assets in North America. \n(9) Collectively, the “PURE Canadian Portfolio”. \n(10) Effective December 12, 2024, Bowlero Corporation was rebranded as Lucky Strike Entertainment Corporation.\n(11) Subject to a mandatory 10-year tenant extension to the extent all conditions under the applicable ground lease are met.\nOur Real Estate Debt Investments\nThe following is a summary of our investments in real estate debt as of December 31, 2024: \n($ In thousands)\nInvestment Type\nPrincipal Balance\nFuture Funding Commitments \n(1)\nWeighted Average Interest Rate \n(2)\nWeighted Average Term \n(3)\nSenior Secured Notes\n$\n85,000 \n$\n— \n11.0 \n%\n6.3 years\nSenior Secured Loans\n684,686 \n308,776 \n8.0 \n%\n4.7 years\nMezzanine Loans and Preferred Equity\n908,461 \n239,748 \n9.2 \n%\n4.1 years\nTotal\n$\n1,678,147 \n$\n548,524 \n8.8 \n%\n4.4 years\n____________________\n(1) Our future funding commitments are subject to our borrowers' compliance with the financial covenants and other applicable provisions of each respective loan agreement.\n(2) The weighted average interest rate is based on current outstanding principal balance and SOFR, as applicable for floating rate loans, as of December 31, 2024. \n(3) Assumes all extension options are exercised; however, our loans may be repaid, subject to certain conditions, prior to such date.\nOur Embedded Growth Pipeline\nWe have entered into several put-call, call right, right of first refusal and right of first offer agreements, as well as other strategic arrangements, which we believe provide the opportunity for embedded growth as we pursue our future strategic objectives. Each of the transactions contemplated by the following agreements remains subject to the terms and conditions of the applicable agreements, including with respect to due diligence, applicable regulatory approvals and customary closing conditions. \nPut-Call Agreements\n•\nCaesars Forum Put-Call. \nWe have a put-call agreement with Caesars with respect to the Caesars Forum Convention Center, which provides for (i) a call right in our favor, which, if exercised, would result in the sale by Caesars to us and simultaneous leaseback by us to Caesars of the Caesars Forum Convention Center, exercisable by us from September 18, 2025 until December 31, 2028, and (ii) a put right in favor of Caesars, which was exercisable by Caesars between January 1, 2024 and December 31, 2024. The put right was not exercised by Caesars and terminated as of December 31, 2024.\n6\nTable of Contents\nCall Right Agreements\n•\nCanyon Ranch Austin Call Right. \nWe entered into a call right agreement with Canyon Ranch pursuant to which we will have the right to acquire the real estate assets of Canyon Ranch Austin for up to 24 months following stabilization (with the Canyon Ranch Austin Loan balance being settled in connection with the exercise of such call right), which transaction will be structured as a sale leaseback (with the simultaneous entry into a triple-net lease with Canyon Ranch that will have an initial term of 25 years, with eight 5-year tenant renewal options).  \n•\nCanyon Ranch Lenox and Canyon Ranch Tucson Call Right. \nWe entered into a call right agreement with Canyon Ranch pursuant to which we will have the right to acquire the real estate assets of each of Canyon Ranch Tucson in Tucson, Arizona and Canyon Ranch Lenox in Lenox, Massachusetts, at pre-negotiated terms in a sale-leaseback transaction following stabilization, subject to certain conditions. If the call right(s) are exercised, Canyon Ranch would continue to operate the applicable wellness resort(s) subject to a long-term triple-net master lease with VICI.\n•\nHomefield Kansas City Call Right. \nWe entered into a call right agreement with affiliates of Homefield Kansas City (“Homefield”) that provides us with a call option on (i) the Margaritaville Resort in Kansas City, Kansas, (ii) the new Homefield youth sports training facility in Kansas City, Kansas, (iii) the new Homefield baseball center in Kansas City, Kansas, and (iv) the existing Homefield youth sports complex in Olathe, Kansas. If the call right is exercised, all of the properties, including the Margaritaville Resort, will be subject to a single long-term triple net master lease with us.\n Right of First Refusal (“ROFR”) and Right of First Offer (“ROFO”) Agreements\n•\nLas Vegas Strip Assets ROFR. \nWe have a ROFR agreement with Caesars (the “Las Vegas Strip ROFR Agreement”), pursuant to which we have the first right, with respect to the first two Las Vegas Strip assets described below that Caesars proposes to sell, whether pursuant to a sale leaseback or a sale of the real estate and operations (a “WholeCo sale”), to a third party, to acquire any such asset (it being understood that we will have the opportunity to find an operating company should Caesars elect to pursue a WholeCo sale). The Las Vegas Strip assets subject to the Las Vegas Strip ROFR Agreement are the land and real estate assets associated (i) with respect to the first such asset subject to the Las Vegas Strip ROFR Agreement, the Flamingo Las Vegas, Paris Las Vegas, Planet Hollywood and Bally’s Las Vegas gaming facilities, and (ii) with respect to the second such asset subject to the Las Vegas Strip ROFR Agreement, the foregoing assets still unsold plus The LINQ gaming facility. If we enter into a sale leaseback transaction with Caesars with respect to any of these facilities, the leaseback may be implemented through the addition of such properties to the Las Vegas Master Lease Agreement.\n•\nHorseshoe Baltimore ROFR. \nWe have a ROFR agreement with Caesars pursuant to which we have the first right to enter into a sale leaseback transaction with respect to the land and real estate assets associated with the Horseshoe Baltimore gaming facility\n.\n•\nCaesars Virginia Development ROFR. \nWe have a ROFR agreement with EBCI and Caesars pursuant to which we have the first right to enter into a sale leaseback transaction with respect to the real property associated with the development of a new casino resort in Danville, Virginia.  \n•\nCanyon Ranch ROFO.\n We have a ROFO agreement with Canyon Ranch with respect to future financing opportunities for Canyon Ranch and certain of its affiliates for the funding of certain facilities (including Canyon Ranch Austin, Canyon Ranch Tucson and Canyon Ranch Lenox, and any other fee owned Canyon Ranch branded wellness resort), until the date that is the earlier of five years from commencement of the Canyon Ranch Austin lease (to the extent applicable) and the date that neither VICI nor any of its affiliates are landlord under such lease, subject to certain specified terms, conditions and exceptions. On July 26, 2023, we entered into a right of first financing agreement pursuant to which we will have the first right, but not the obligation, to serve as the real estate capital financing partner for Canyon Ranch with respect to the acquisition, build-out and/or redevelopment of future greenfield and build-to-suit wellness resorts.\n•\nLucky Strike ROFO.\n The Lucky Strike Master Lease contains a ROFO with respect to the real estate assets of any current or future Lucky Strike properties in the event that Lucky Strike elects to enter into a sale-leaseback transaction for such properties during the first eight years of the initial term of the Lucky Strike Master Lease.\n•\nHomefield ROFR. \nWe have a ROFR agreement to acquire the real estate of any future Homefield property in a sale leaseback transaction, should Homefield elect to sell such assets.\n7\nTable of Contents\n•\nIndigenous Gaming Partners ROFO.\n We have a five-year ROFO on future sale-leaseback transactions with IGP. Any additional properties acquired pursuant to the ROFO will be added to the PURE Master Lease.\nOther Embedded Growth Agreements\n•\nCabot Citrus Farms Purchase and Sale Agreement.\n We entered into a purchase and sale agreement with Cabot, pursuant to which we will convert a portion of the $120.0 million Cabot Citrus Farms delayed draw development loan into the ownership of certain Cabot Citrus Farms real estate assets and simultaneously enter into a triple-net lease with Cabot that will have an initial term of 25 years, with five 5-year tenant renewal options.\nPrior to December 31, 2024, we had certain rights pursuant to a put-call right agreement with Caesars (the “Caesars Indianapolis Put-Call Agreement”) with respect to two gaming facilities in Indiana, Harrah’s Hoosier Park and Horseshoe Indianapolis, whereby either party was able to trigger its respective put or call on the associated land and real estate assets, as applicable, through December 31, 2024. The Caesars Indianapolis Put-Call Agreement was not exercised by either party and terminated on December 31, 2024.\nOur Partner Property Growth Fund Strategy\nAs part of our ongoing dialogue with our tenants, we continually seek opportunities to further our long-term partnerships and pursue our respective strategic objectives. We have entered into certain arrangements, which we collectively refer to as the “Partner Property Growth Fund”, with certain tenants relating to our funding of “same-store” capital improvements, including redevelopment, new construction projects and other property improvements, in exchange for increased rent pursuant to the terms of our existing lease agreements with such tenants (and subject to the specific terms and conditions included in any such agreement). Each of our lease agreements includes provisions that provide a mechanism for us to pursue such opportunities. We continue to evaluate Partner Property Growth Fund opportunities with certain of our tenants from time to time and expect to pursue further investment as one component of our strategic growth plans, consistent with our aim to work collaboratively with such tenants to invest in growth opportunities and capital improvements that achieve mutually beneficial outcomes. \nMost recently, on May 1, 2024, we entered into agreements to fund up to $700.0 million of capital investment into the Venetian Resort for several reinvestment projects (the “Venetian Capital Investment”), which funding is earning a return through the addition of incremental rent to the Venetian Lease. The up to $700.0 million of funding through our Partner Property Growth Fund strategy is comprised of $400.0 million that has already been funded and an incremental $300.0 million that the Venetian Resort will have the option, but not the obligation, to draw in whole or in part until November 1, 2026. \nThe benefits of any Partner Property Growth Fund opportunities will be dependent upon independent decisions made by our tenants with respect to any capital improvement projects and the source of funds for such projects, as well as the total funding ultimately provided under such arrangements and there are no assurances that any Partner Property Growth Fund opportunities will occur on the contemplated terms, including through our financing, or at all. See \nItem 1A - “Risk Factors—Risks Related to Our Business and Operations”\n for additional information.\nOur Golf Courses\nWe own four championship golf courses located near certain of our properties, Rio Secco in Henderson, Nevada, Cascata in Boulder City, Nevada, Chariot Run in Laconia, Indiana and Grand Bear in Saucier, Mississippi (the “Golf Courses”). In addition, Rio Secco and Cascata are in close proximity to the Las Vegas Strip. These golf courses are operated by a third-party golf resort operator, Cabot-Managed Properties, an affiliate of Cabot, pursuant to a golf course management agreement. We have a golf course use agreement (the “Golf Course Use Agreement”) with Caesars which provides them with preferred access and tee times for their guests at our golf courses. As of December 31, 2024, contractual minimum fees under the Golf Course Use Agreement and certain other golf course related agreements with Caesars were $17.2 million per year.\nOur Relationship with Caesars and MGM\nCaesars and MGM, our two largest tenants representing 39% and 35%, respectively, of our annualized rent as of December 31, 2024, are leading owners and operators of gaming, entertainment and leisure properties. Caesars and MGM maintain a diverse brand portfolio with a wide range of options that appeal to a variety of gaming, sports betting, travel and entertainment consumers.\nTo govern the ongoing relationship between us and Caesars and us and MGM, in addition to the applicable lease agreements, we have entered into various agreements with Caesars and MGM and/or their subsidiaries as described herein. The summaries presented herein are not complete and are qualified in their entirety by reference to the full text of the applicable agreements, certain of which are included as exhibits to this Annual Report on Form 10-K.\n8\nTable of Contents\n•\nCaesars Guaranty. \nCaesars has executed guaranties with respect to the Caesars Las Vegas Master Lease, the Caesars Regional Master Lease and the Caesars Joliet Lease, guaranteeing the prompt and complete payment and performance in full of: (i) all monetary obligations of the tenants under the Caesars Leases, including all rent and other sums payable by the tenants under the Caesars Leases and any obligation to pay monetary damages in connection with any breach and to pay any indemnification obligations of the tenants under the Caesars Leases, (ii) the performance when due of all other covenants, agreements and requirements to be performed and satisfied by the tenants under the Caesars Leases, and (iii) all monetary obligations under the Golf Course Use Agreement.\n•\nMGM Guaranty. \nMGM has executed guaranties with respect to the MGM Master Lease and MGM Grand/Mandalay Bay Lease guaranteeing the prompt and complete payment and performance in full of all monetary obligations of the tenants under the MGM Master Lease and MGM Grand/Mandalay Bay Lease, including all rent and other sums payable by the tenants under the MGM Master Lease and MGM Grand/Mandalay Bay Lease and any obligation to pay monetary damages in connection with any breach and to pay any indemnification obligations of the tenants under the MGM Master Lease and MGM Grand/Mandalay Bay Lease and the performance when due of all other covenants, agreements and requirements to be performed and satisfied by the tenants under the MGM Master Lease and MGM Grand/Mandalay Bay Lease.\n•\nMGM Tax Protection Agreements. \nWe entered into a tax protection agreement with MGM (the “MGM Tax Protection Agreement”) pursuant to which VICI OP has agreed, subject to certain exceptions, for a period of 15 years (subject to early termination under certain circumstances) following the closing of our acquisition of MGM Growth Properties LLC (“MGP”) in April 2022, to indemnify MGM and certain of its subsidiaries (the “Protected Parties”) for certain tax liabilities resulting from (1) the sale, transfer, exchange or other disposition of a property owned directly or indirectly by MGM Growth Properties Operating Partnership LP (“MGP OP”) immediately prior to the closing date of the acquisition of MGP (each, a “Protected Property”), (2) a merger, consolidation, transfer of all assets of, or other significant transaction involving VICI OP pursuant to which the ownership interests of the Protected Parties in VICI OP are required to be exchanged in whole or in part for cash or other property, (3) the failure of VICI OP to maintain approximately $8.5 billion of nonrecourse indebtedness allocable to MGM, which amount may be reduced over time in accordance with the MGM Tax Protection Agreement, and (4) the failure of VICI OP or VICI to comply with certain tax covenants that would impact the tax liabilities of the Protected Parties. In the event that VICI OP or VICI breaches restrictions in the MGM Tax Protection Agreement, VICI OP will be liable for grossed-up tax amounts associated with the income or gain recognized as a result of such breach. In addition, the joint venture that holds the real estate assets of MGM Grand Las Vegas and Mandalay Bay\n (“\nMGM Grand/Mandalay Bay JV”) previously entered into a tax protection agreement with MGM with respect to built-in gain and debt maintenance related to MGM Grand Las Vegas and Mandalay Bay, which is effective through mid-2029, and by acquiring MGP in April 2022 and subsequently acquiring the remaining 49.9% interest in the MGM Grand/Mandalay Bay JV in January 2023, we bear any indemnity under this existing tax protection agreement.\nCompetition\nWe compete for real property investments with other REITs, gaming companies, investment companies, private equity firms, hedge funds, sovereign funds, lenders and other private investors. In addition, revenues from our properties pursuant to the lease agreements are dependent on the ability of our tenants and operators to compete with other gaming operators in their respective markets. The operators of our properties compete on a local, regional, national and international basis for customers. The gaming industry is characterized by a high degree of competition among a large number of participants, including traditional brick and mortar casinos, video lottery, sweepstakes and poker machines not located in casinos, Native American gaming, emerging varieties of Internet gaming, sports betting and other forms of gaming in the United States.\nAs a landlord, we compete in the real estate market with numerous developers, owners and acquirors of properties. Some of our competitors may be significantly larger, have greater financial resources and lower costs of capital than we have, have greater economies of scale and have greater name recognition than we do. Increased competition will make it more challenging to identify and successfully capitalize on acquisition opportunities that meet our investment objectives. Our ability to compete is also impacted by national and local economic trends, availability of investment alternatives, availability and cost of capital, construction and renovation costs, existing laws and regulations, new legislation and population trends.\n9\nTable of Contents\nHuman Capital Management\nAs of December 31, 2024, we employed 27\n employees, all\n of which are full-time. All of our employees \na\nre employed at VICI LP in support of our primary business as a triple-\nnet lease REIT and are primarily located at our corporate headquarters in New York, New York\n.\n•\nCorporate Culture and Engagement.\n \nWe are committed to creating and sustaining a positive work environment and corporate culture that fosters trust, cooperation and inclusion, including through the instillation of our core values, which we refer to as the VICI Values, competitive compensation and benefit programs, training and professional development opportunities, corporate giving and community service events and employee involvement in company initiatives. To assist in fulfilling that commitment, we measure our organizational culture, degree of inclusion and employee engagement through, among other things, an annual, independent third-party employee satisfaction survey and periodic pulse surveys, all of which provide management with insights regarding key issues and priorities to maintain and improve the health, well-being and satisfaction of our employees.  \n•\nBoard Oversight\n.\n Our management reports to the Compensation Committee of the Board of Directors on a regular basis, as well as the full Board of Directors, as necessary, to periodically review our human capital management programs, including those relating to employee engagement, employee compensation and benefits, and related matters, such as training and recruiting, retention and hiring practices.\n•\nDemographics\n.\n \nAs of December 31, 2024, 43% of our directors (and 50% of our independent directors), 44% of our employees and 25% of our executive officers were female. Additionally, 50% of the leadership of our Board of Directors were female as of December 31, 2024. Further, 14% of our directors and 26% of our employees identified as members of an ethnic and/or racial minority group. \n•\nCompensation and Benefits.\n \nWe offer a comprehensive employee benefits package, including a 401(k) plan, medical, dental and vision insurance, disability insurance, life insurance, paid maternity/paternity leave for birth and foster/adoption placements and other parenthood pursuit benefits, wellness, technology and travel stipends, and access to an employee assistance program, including mental health and wellness support services. We also seek to provide differentiated benefits to our employees, such as our Portfolio Experience Benefit, which enables employees to experience our properties with an annual stipend, and our charitable matching program administered through the Groundswell Charitable Giving platform. We continually evaluate existing benefits and explore new or expanded benefits to be responsive to employee feedback and seek to improve employee utilization of available benefits and meaningfully enhance employee benefits over time.\n•\nEducation, Training and Development. \nWe invest in employee education, training and development by conducting regular training programs, including our “VICI U” program (formerly VICI 101) and our “Lunch and Learn” seminar series, to educate and advance our employees’ understanding of concepts relevant to our business, led by internal and external subject-matter experts, as well as periodic training opportunities with respect to issues such as compliance, communication and feedback, public speaking and engagement, and anti-harassment and other matters outlined in our Code of Business Conduct. We encourage our employees to pursue professional development through external education and certifications through a broadly applicable and flexible professional development reimbursement policy, and continually focus on enhancing our professional development and performance management processes to provide further development opportunities to our employees. We have also enhanced our performance management processes through our semi-annual performance and career development reviews provided to all of our employees. \nGovernmental Regulation and Licensing\nThe ownership, operation and management of gaming and racing facilities are subject to pervasive regulation. Each of our gaming and racing facilities is subject to regulation under the laws, rules, and regulations of the jurisdiction in which it is located. Gaming laws and regulations generally require gaming industry participants to: ensure that unsuitable individuals and organizations have no role in gaming operations; establish and maintain responsible accounting practices and procedures; maintain effective controls over their financial practices, including establishment of minimum procedures for internal fiscal affairs and the safeguarding of assets and revenues; maintain systems for reliable record keeping; file periodic reports with gaming regulators; and ensure that contracts and financial transactions are commercially reasonable, reflect fair market value and are arm’s length transactions. \nGaming laws and regulations primarily impact our business in two respects: (1) our ownership and acquisition of land and buildings in which gaming activities are operated by our tenants; and (2) the operations of our tenants as operators in the gaming industry. Further, many gaming and racing regulatory agencies in the jurisdictions in which our tenants operate require \n10\nTable of Contents\nus and our affiliates to apply for and maintain a finding of suitability or a license as a key business entity or supplier because of our status as landlord. If we, our subsidiaries or the tenants of our properties violate applicable gaming laws, our gaming licenses, or the tenants’ gaming licenses, could be limited, conditioned, suspended or revoked by gaming authorities, and we and any persons involved may face other disciplinary actions, including substantial fines, appointment of a supervisor or conservator to operate our gaming properties, or in some jurisdictions, take title to our gaming assets in the jurisdiction, and under certain circumstances, earnings generated during such appointment could be forfeited to the applicable jurisdictions. Violations of laws in one jurisdiction could result in disciplinary action in other jurisdictions. Finally, the loss or suspension of our gaming licenses could result in a material breach under certain of our leases or an event of default under certain of our indebtedness, including through cross-default provisions in our debt agreements. As a result, violations by us of applicable gaming laws could have a material effect on us. \nIn addition, various corporate actions and transactions must be reported to and, in some cases, approved by certain gaming authorities, including substantially all material loans, leases, sales of securities (including public offerings) and similar financing transactions, management or consulting agreements and changes in control through merger, consolidation, stock or asset acquisitions, or otherwise. \nOur business and the businesses of our tenants are also subject to various federal, state and local laws and regulations in addition to gaming regulations. These laws and regulations include, but are not limited to, restrictions and conditions concerning alcoholic beverages, environmental matters, labor and employees, anti-discrimination, health care, currency transactions, taxation, zoning and building codes and marketing and advertising. Such laws and regulations could change or could be interpreted differently in the future, or new laws and regulations could be enacted. Material changes, new laws or regulations, or material differences in interpretations by courts or governmental authorities could adversely affect our operating results.\nEnvironmental Matters\nOur properties are subject to environmental laws regulating, among other things, air emissions, wastewater discharges and the handling and disposal of wastes, the utilization of above or underground storage tanks, or properties that include asbestos-containing building materials. Pursuant to federal, state and local environmental laws and regulations, a current or previous owner or operator of real property may be required to investigate, remove and/or remediate a release of hazardous substances or other regulated materials at, or emanating from, such property. Further, under certain circumstances, such owners or operators of real property may be held liable for property damage, personal injury and/or natural resource damage resulting from or arising in connection with such releases, including for damage that occurred prior to our ownership of a property or at a site where the current or previous operator of the property sent wastes for disposal. \nOur properties may also be (or in the future become) subject to additional building and zoning laws, ordinances and codes relating to building performance standards, such as those intended to reduce energy and/or greenhouse gas emissions, which we may be subject to as the owner of real estate. Although we do not operate or manage our properties subject to triple-net leases and our tenants are generally contractually responsible for such operating and management costs, we may be held primarily or jointly and severally liable for costs relating to maintaining compliance with such laws, ordinances and codes. \nIn connection with our real estate ownership, we could be legally responsible for environmental liabilities or costs relating to a release of hazardous substances or other regulated materials at or emanating from such property or compliance with applicable laws, ordinances and codes. The failure to properly maintain compliance with such laws or remediate a property in the event of such release may also adversely affect our ability to lease, sell or rent the property or to borrow funds using the property as collateral. The lease agreements generally obligate our tenants to comply with applicable environmental laws, regulations and ordinances and to indemnify us if their noncompliance results in losses or claims against us, and we expect that any future leases will include the same provisions for other operators. A tenant’s failure to comply could result in fines and penalties or the requirement to undertake corrective actions, which may result in significant costs to the operator and thus adversely affect their ability to meet their obligations to us. We are not aware of any environmental issues that are expected to have a material impact on the operations of any of our properties.\nNew laws and regulations relating to sustainability and climate change may include specific disclosure requirements or other obligations that may require additional investments and implementation of new practices and reporting processes. Our tenants’ control of our leased properties (which is inherent to the triple-net lease structure) presents challenges with respect to our ability to collect property-level environmental data and metrics and implement sustainability initiatives (including energy and emissions reduction), which may in turn impact our ability to comply with certain regulatory requirements to which we are or may become subject. \n11\nTable of Contents\nSustainability \nWe continue to focus on developing our efforts related to implementing and reporting on environmental sustainability efforts at our properties, including our corporate headquarters, our Golf Courses (operated by Cabot-Managed Properties) and our triple-net leased portfolio. We are committed to the improvement of environmental conditions through our business activities within the scope of our capabilities, and we periodically engage with key stakeholders with regard to environmental sustainability priorities, among other things, including through a stakeholder materiality assessment performed in 2023.\n•\nGovernance and Strategy\n.\n Our ESG Committee, comprised of employees across multiple functional areas and professional levels, including our Chief Financial Officer and General Counsel, leads our environmental sustainability initiatives (including with respect to climate change). Management retains ultimate responsibility over our environmental sustainability initiatives, engages with the ESG Committee and reports to the Nominating and Governance Committee of our Board of Directors on a quarterly basis, and more frequently as necessary, with respect to environmental sustainability matters. Additionally, we engage a strategic ESG consultant to advise us on our continued enhancement of, among other things, our sustainability performance, our tenant and stakeholder engagement initiatives, and our related reporting (including pursuant to external disclosure frameworks and standards). We continue to progress our ESG program in accordance with an internal multi-year strategic roadmap for the development and implementation of additional initiatives across a broad range of ESG topics, including sustainability initiatives at our golf courses, expanded tenant engagement efforts, greenhouse gas emissions evaluation and reporting, participation in additional evaluation and scoring frameworks, and the development of internal processes to support and facilitate these initiatives.\n•\nGolf Courses.\n \nWe have implemented recording and reporting protocols through a third-party service provider to facilitate the monitoring of utility data in order to more fully understand the environmental impact of our operations, key drivers and trends with respect to utility usage at each of our courses and identify opportunities to improve sustainability performance, including with respect to energy and water consumption, recycling and waste, and promoting biodiversity. We have also performed energy and water audits and regulatory assessments at each of the Golf Courses to further inform our sustainability initiatives. A portion of capital expenditures at our Golf Courses is allocated to improving the sustainability of the courses, including projects to reduce electricity and fuel usage (and thus, energy usage and emissions), reduce water consumption and improve efficiency, and reduce waste in favor of recycling and repurposing. Pursuant to our management agreement with Cabot-Managed Properties with respect to the Golf Courses, we work in partnership with Cabot-Managed Properties to continue to implement sustainability initiatives at the Golf Courses and improve their environmental performance. \n•\nTriple-Net Portfolio.\n We continue to pursue tenant engagement initiatives designed to assist us in understanding the environmental impact of our leased properties, collecting environmental sustainability data in order to monitor sustainability metrics throughout our leased property portfolio, and encouraging our tenants to pursue sustainability initiatives in their operations at our leased properties. Our leased properties are leased pursuant to long-term triple-net leases, which provide our tenants with complete control over operations at our leased properties, including the implementation of environmental sustainability initiatives consistent with their business strategies and revenue objectives. Certain of our leases permit us to require the collection or reporting of environmental sustainability data (including pursuant to relevant “green lease” provisions). Although not all of our leases include such provisions, certain of our tenants also report voluntarily regarding such matters, including with respect to, among other things, water, electricity/fuel and energy use, greenhouse gas emissions, waste generation and diversion, green building certifications and the implementation of efficiency measures with respect to the foregoing. Our tenants pursue a broad range of ESG programs and initiatives, such as the implementation of energy, water and waste-related efficiency measures at our properties, on-site renewable energy, operational improvements, and sustainable hospitality programs, and independently report to their respective investors and other stakeholders regarding such efforts. Certain of our tenants, including Caesars and MGM, have also independently set sustainability-related targets with respect to their overall business and portfolio, which include our leased properties.\n•\nClimate Change.\n We evaluate climate change risk throughout our portfolio, including property-specific physical climate risk assessments in connection with transactional due diligence (and subsequently on a periodic basis) and more broadly with respect to our overall portfolio (including the identification of material risks and the concentration/distribution of such risks across our portfolio). We have shared certain climate risk findings with our tenants to facilitate their independent climate risk management and mitigation efforts in connection with their operations at our properties. We also assess transition-related climate risks, such as potential legal and regulatory, technological, market-based, and reputational impacts, in light of our triple-net lease operating model. With the assistance of an environmental due diligence provider and consultant, we have performed, and expect to continue to perform on a \n12\nTable of Contents\nperiodic basis, climate-related risk assessments with respect to our property portfolio. Our most recent climate-related risk analysis performed in early 2025 was comprised of individual property-level risk analyses, multiple climate scenario analyses within our identified time horizons, a regulatory review of active and impending sustainable building regulations, and additional community resilience assessments with respect to certain geographies in which we own multiple properties (such as Las Vegas, Nevada and Atlantic City, New Jersey). We have disclosed our climate change strategy, governance, risk management and certain metrics and targets in alignment with the Task Force on Climate-Related Financial Disclosures (TCFD) guidelines and incorporated climate change-related risk into our enterprise risk management framework. \nInvestment Policies\nOur investment objectives are to increase cash flow from operations, achieve sustainable long-term growth and maximize stockholder value to allow for stable dividends and stock appreciation. We have not established a specific policy regarding the relative priority of these investment objectives. Our future investment activities will not be limited to any geographic area or to a specific percentage of our assets. We intend to engage in such future investment activities in a manner that is consistent with our qualification as a REIT for U.S. federal income tax purposes.\n•\nInvestment in Real Estate or Interests in Real Estate. \nOur business is focused primarily on gaming, hospitality, wellness, entertainment and leisure sector properties and activities directly related thereto, which we refer to as “experiential assets”. We believe there are significant, ongoing opportunities to acquire or invest in additional gaming, hospitality, wellness, entertainment and leisure assets, both domestically and internationally. We do not have a specific policy to acquire assets primarily for capital gain or primarily for income. In addition, we may purchase or lease income-producing commercial and other types of properties for long-term investment, expand and improve the properties we presently own or other acquired properties, or sell such properties, in whole or in part, when circumstances warrant.\nWe may participate with third parties in property ownership, through joint ventures or other types of co-ownership, and we may engage in such activities in the future if we determine that doing so would be the most effective means of owning or acquiring properties. We do not expect, however, to enter into a joint venture or other partnership arrangement to make an investment that would not otherwise meet our investment policies. We also may acquire real estate or interests in real estate in exchange for the issuance of common stock, preferred stock or options to purchase stock or interests in our subsidiaries, including VICI OP. We may also pursue opportunities to provide mortgage or mezzanine financing, preferred equity investments or other forms of financing for investment in certain situations where such structure provides for strategic growth opportunities and/or partnerships, and may in certain circumstances provide the potential to convert our investment into the ownership of the underlying real estate in a future period.\nEquity investments in acquired properties may be subject to existing mortgage financing and other indebtedness or to new indebtedness, which may be incurred in connection with acquiring or refinancing these investments. Principal and interest on our debt will have priority over any dividends with respect to our common stock. Investments are also subject to our policy not to be required to register as an investment company under the Investment Company Act of 1940, as amended.\n•\nInvestments in Real Estate Debt.  \nWe have made, and may continue to make, investments in mortgages or other forms of real estate-related debt, including, without limitation, traditional mortgages, participating or convertible mortgages, mezzanine loans or preferred equity investments; provided, in each case, that such investment is consistent with our qualification as a REIT. These investments are generally made for strategic purposes, including (i) the potential to convert our investment into the ownership of the underlying real estate in a future period, (ii) the opportunity to develop relationships with owners and operators that may lead to other investments in experiential asset classes that fit within our investment policies and objectives and (iii) the ability to make initial investments in experiential asset classes outside of gaming with the goal of increasing our investment activity in these asset classes over time. Investments in real estate-related debt are subject to various risks, including the risk that a borrower may default under certain provisions governing the debt investment and that the collateral securing the investment may not be sufficient to enable us to recover our full investment.\n•\nSecurities of or Interests in Persons Primarily Engaged in Real Estate Activities and Other Issuers. \nWe may invest in securities of other REITs, other entities engaged in real estate activities or securities of other issuers, including for the purpose of exercising control over such entities, subject to the asset tests and gross income tests necessary for our qualification as a REIT. We do not currently have any policy limiting the types of entities in which we may invest or \n13\nTable of Contents\nthe proportion of assets to be so invested, whether through acquisition of an entity’s common stock, limited liability or partnership interests, interests in another REIT or entry into a joint venture. We have no current plans to make additional investments in entities that are not engaged in real estate activities. Our investment objectives are to maximize the cash flow of our investments, acquire investments with growth potential and provide cash distributions and long-term capital appreciation to our stockholders through increases in the value of our company. We have not established a specific policy regarding the relative priority of these investment objectives.\n•\nInvestments in Short-term Commercial Paper and Discount Notes. \nWe may invest our excess cash in short-term investment grade commercial paper as well as discount notes issued by government-sponsored enterprises, including the Federal Home Loan Mortgage Corporation and certain of the Federal Home Loan Banks. These investments generally have original maturities of up to 180 days. \nFinancing Policies\nWe expect to employ leverage in our capital structure in amounts that we determine appropriate from time to time. Our Board of Directors has not adopted a policy that limits the total amount of indebtedness that we may incur, but will consider a number of factors in evaluating our level of indebtedness from time to time, as well as the amount of such indebtedness that will be either fixed or variable rate. We are, however, and expect to continue to be, subject to certain indebtedness limitations pursuant to the restrictive covenants of our outstanding indebtedness. We may from time to time modify our debt policy in light of then-current economic conditions, relative availability and costs of debt and equity capital, market values of our properties, general market conditions for debt and equity securities, fluctuations in the market price of our shares of common stock, growth and acquisition opportunities and other factors. If these limits are relaxed, we could potentially become more highly leveraged, resulting in an increased risk of default on our obligations and a related increase in debt service requirements that could adversely affect our financial condition, liquidity and results of operations and our ability to make distributions to our stockholders. To the extent that our Board of Directors or management determines that it is necessary to raise additional capital, we may, without stockholder approval, borrow money under the Revolving Credit Facility (as defined in Note 7 - Debt), issue debt or equity securities, including securities senior to our shares, retain earnings (subject to the REIT distribution requirements for U.S. federal income tax purposes), assume indebtedness, obtain mortgage financing on a portion of our owned properties, engage in a joint venture, or employ a combination of these methods.\nIntellectual Property\nMost of the properties within our portfolio are currently operated and promoted under trademarks and brand names not owned by us. In addition, properties that we may acquire in the future may be operated and promoted under these same trademarks and brand names, or under different trademarks and brand names we do not, or will not, own. During the term that our properties are managed by our tenants, we are reliant on them to maintain and protect the trademarks, brand names and other licensed intellectual property used in the operation or promotion of the leased properties. Operation of the leased properties, as well as our business and financial condition, could be adversely impacted by infringement, invalidation, unauthorized use or litigation affecting any such intellectual property. In addition, if any of our properties are rebranded, it could have a material adverse effect on us, as we may not enjoy comparable recognition or status under a different brand.\nCorporate Information\nWe were initially organized as a limited liability company in the State of Delaware on July 5, 2016 as a wholly owned subsidiary of Caesars Entertainment Operating Company, Inc. (“CEOC”). On May 5, 2017, we subsequently converted to a corporation under the laws of the State of Maryland and issued shares of common stock to CEOC as part of our formation transactions, which shares were subsequently transferred by CEOC to our initial stockholders.\nOur principal executive offices are located at 535 Madison Avenue, 28th Floor, New York, New York 10022 and our main telephone number at that location is (646) 949-4631. Our website address is www.viciproperties.com. None of the information on, or accessible through, our website or any other website identified herein is incorporated in, or constitutes a part of, this Annual Report on Form 10-K. Our electronic filings with the SEC (including annual reports on Form 10-K, quarterly reports on Form 10-Q, and current reports on Form 8-K, and any amendments to these reports), including the exhibits, are available free of charge through our website as soon as reasonably practicable after we electronically file them with or furnish them to the SEC.\n14\nTable of Contents\nCAUTIONARY NOTE REGARDING FORWARD-LOOKING STATEMENTS\nCertain statements in this Annual Report on Form 10-K, including statements such as “anticipate,” “believe,” “estimate,” “expect,” “intend,” “plan,” “project,” “target,” “can,” “could,” “may,” “should,” “will,” “would” or similar expressions, constitute “forward-looking statements” within the meaning of the federal securities law. Forward-looking statements are based on our current plans, expectations and projections about future events. We therefore caution you against relying on any of these forward-looking statements. They give our expectations about the future and are not guarantees. These statements involve known and unknown risks, uncertainties and other factors that may cause our actual results, performance and achievements to materially differ from any future results, performance and achievements expressed in or implied by such forward-looking statements.\nThe forward-looking statements included herein are based upon our current expectations, plans, estimates, assumptions and beliefs that involve numerous risks and uncertainties. Assumptions relating to the foregoing involve judgments with respect to, among other things, future economic, competitive and market conditions and future business decisions, all of which are difficult or impossible to predict accurately and many of which are beyond our control. Although we believe that the expectations reflected in such forward-looking statements are based on reasonable assumptions, our actual results, performance and achievements could differ materially from those set forth in the forward-looking statements and may be affected by a variety of risks and other factors, including, among others: \n•\nthe impact of changes in general economic conditions and market developments, including inflation, interest rates, supply chain disruptions, consumer confidence levels, changes in consumer spending, unemployment levels and depressed real estate prices resulting from the severity and duration of any downturn in the U.S. or global economy; \n•\nthe impact of the changing interest rate environment on us, including our ability to successfully pursue investments in, and acquisitions of, additional properties and to obtain debt financing for such investments at attractive interest rates, or at all; \n•\nrisks associated with our transactions, including our ability or failure to realize the anticipated benefits thereof; \n•\nour dependence on our tenants at our properties and their affiliates that serve as guarantors of the lease payments, and the negative consequences any material adverse effect on their respective businesses could have on us;\n•\nthe possibility that any transactions may not be consummated on the terms or timeframes contemplated, or at all, including our ability to obtain the financing necessary to complete any acquisitions on the terms we expect in a timely manner, or at all, the ability of the parties to satisfy the conditions set forth in the definitive transaction documents, including the receipt of, or delays in obtaining, governmental and regulatory approvals and consents required to consummate such transactions, or other delays or impediments to completing the transactions; \n•\nthe anticipated benefits of certain arrangements with certain tenants in connection with our funding of “same store” capital improvements in exchange for increased rent pursuant to the terms of our agreements with such tenants, which we refer to as the Partner Property Growth Fund strategy; \n•\nour decision and ability to exercise our purchase rights under our put-call agreements, call agreements, right of first refusal agreements and right of first offer agreements; \n•\nour borrowers’ ability to repay their outstanding loan obligations to us; \n•\nour dependence on the gaming industry; \n•\nour ability to pursue our business and growth strategies may be limited by the requirement that we distribute 90% of our REIT taxable income in order to qualify for taxation as a REIT and that we distribute 100% of our REIT taxable income in order to avoid current entity-level U.S. federal income taxes; \n•\nthe impact of extensive regulation from gaming and other regulatory authorities; \n•\nthe ability of our tenants to obtain and maintain regulatory approvals in connection with the operation of our properties, or the imposition of conditions to such regulatory approvals; \n•\nthe possibility that our tenants may choose not to renew their respective lease agreements following the initial or subsequent terms of the leases; \n•\nrestrictions on our ability to sell our properties subject to the lease agreements; \n•\nour tenants and any guarantors’ historical results may not be a reliable indicator of their future results; \n•\nour substantial amount of indebtedness, and ability to service, refinance (at attractive interest rates, or at all), and otherwise fulfill our obligations under such indebtedness; \n•\nour historical financial information may not be reliable indicators of our future results of operations, financial condition and cash flows; \n15\nTable of Contents\n•\nthe possibility that we identify significant environmental, tax, legal or other issues, including additional costs or liabilities, that materially and adversely impact the value of assets acquired or secured as collateral (or other benefits we expect to receive) in any of our completed transactions; \n•\nthe impact of changes to tax laws and regulations, including U.S. federal income tax laws or global tax laws; \n•\nthe impact of changes in governmental or regulatory actions and initiatives;\n•\nthe possibility of adverse tax consequences as a result of our completed transactions, including tax protection agreements to which we are a party; \n•\nincreased volatility in our stock price, including as a result of our completed transactions; \n•\nour inability to maintain our qualification for taxation as a REIT; \n•\nthe impact of climate change, natural disasters, war, political and public health conditions or uncertainty or civil unrest, violence or terrorist activities or threats on our properties, or in areas where our properties are located and changes in economic conditions or heightened travel security and health measures instituted in response to these events; \n•\nthe loss of the services of key personnel; \n•\nthe inability to attract, retain and motivate employees; \n•\nthe costs and liabilities associated with environmental compliance; \n•\nfailure to establish and maintain an effective system of integrated internal controls; \n•\nthe risks related to us or our tenants not having adequate insurance to cover potential losses;\n•\nour reliance on distributions received from our subsidiaries, including VICI OP, to make distributions to our stockholders;\n•\nthe potential impact on the amount of our cash distributions if we were to sell any of our properties in the future; \n•\nour ability to continue to make distributions to holders of our common stock or maintain anticipated levels of distributions over time; \n•\ncompetition for transaction opportunities, including from other REITs, investment companies, private equity firms and hedge funds, sovereign funds, lenders, gaming companies and other investors that may have greater resources and access to capital and a lower cost of capital or different investment parameters than us; and\n•\nadditional factors discussed herein and listed from time to time as “Risk Factors” in our filings with the SEC, including without limitation, in our subsequent reports on Form 10-K, Form 10-Q and Form 8-K.\nAny of the assumptions underlying forward-looking statements could be inaccurate. You are cautioned not to place undue reliance on any forward-looking statements. All forward-looking statements are made as of the date of this Annual Report on Form 10-K and the risk that actual results, performance and achievements will differ materially from the expectations expressed herein will increase with the passage of time. Except as otherwise required by the federal securities laws, we undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events, changed circumstances or any other reason. In light of the significant uncertainties inherent in forward-looking statements, the inclusion of such forward-looking statements should not be regarded as a representation by us.\n16\nTable of Contents",
  "item7": "ITEM 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis of the financial condition and results of operations of VICI Properties Inc. and VICI Properties L.P. for the year ended December 31, 2024 should be read in conjunction with the audited consolidated Financial Statements and notes thereto and other financial information included elsewhere in this Annual Report on Form 10-K. Some of the information contained in this discussion and analysis or set forth elsewhere in this Annual Report on Form 10-K, including information with respect to our business and growth strategies, statements regarding the industry outlook and our expectations regarding the future performance of our business contained herein are forward-looking statements. See “Cautionary Note Regarding Forward-Looking Statements.” You should also review the \n“Risk Factors”\n section in Item 1A. of this Annual Report on Form 10-K for a discussion of important factors that could cause actual results to differ materially from the results described in or implied by such forward-looking statements\n.\nOVERVIEW\nWe are an owner and acquirer of experiential real estate assets across leading gaming, hospitality, wellness, entertainment and leisure destinations. Our geographically diverse portfolio currently consists of 93 experiential assets consisting of 54 gaming properties and 39 other experiential properties across the United States and Canada. Our portfolio also includes certain real estate debt investments, most of which we have originated for strategic reasons in connection with transactions that either do or may provide the potential to convert our investment into the ownership of certain of the underlying real estate in the future. In addition, we own approximately 33 acres of undeveloped or underdeveloped land on and adjacent to the Las Vegas Strip that is leased to Caesars, which we may look to monetize as appropriate. We also own four championship golf courses located near certain of our properties, two of which are in close proximity to the Las Vegas Strip. We conduct our operations as a REIT for U.S. federal income tax purposes. We conduct our real property business through our operating partnership, VICI OP, and our golf course business through a TRS, VICI Golf. For additional information with respect to our business and operations, refer to \nItem 1. - Business\n. \nKey 2024 Highlights\nOperating Results\n•\nCollected 100% of contractual rent in cash.\n•\nTotal revenues increased 6.6% year-over-year to $3.8 billion.\n•\nNet income attributable to common stockholders increased 6.6% year-over-year to $2.7 billion, and net income attributable to common stockholders per diluted share increased 3.3% to $2.56.\n•\nAFFO increased 8.4% year-over-year to $2.4 billion and AFFO per diluted share increased 5.1% to $2.26.\nSignificant Achievements\n•\nInvested $411.8 million through our Partner Property Growth Fund adding $33.2 million in annualized rent to our portfolio. \n•\nOriginated three debt investments totaling $365.0 million of commitments.\n◦\nFunded new and existing loan commitments totaling $579.1 million.\n•\nAnnounced an increase in our quarterly cash dividend to $0.4325 per share (or $1.73 per share on an annualized basis) in the third quarter of 2024, representing a 4.2% increase compared to our previous quarterly dividend.\n•\nIssued $1,050.0 million and $750.0 million of investment grade senior notes in March and December 2024, respectively, to refinance existing debt.\n•\nSold 12,015,399 forward shares under our ATM Program (as defined in \nNote 11 - Stockholders Equity\n) during the year with an estimated aggregate net offering value of $376.3 million and settled 13,194,739 forward shares outstanding under our ATM Program for aggregate net proceeds of $379.4 million.\n38\nTable of Contents\nSUMMARY OF SIGNIFICANT ACTIVITIES\nAcquisition and Leasing Activity\n•\nIndigenous Gaming Partners - PURE Lease Assignment\n. \nOn December 10, 2024, we entered into an amendment and consented to the assignment of the PURE Master Lease to an affiliate of IGP, in connection with the acquisition of the operating assets of PURE Canadian Gaming Corp. by a subsidiary of IGP. The economic terms of the PURE Master Lease remain unchanged.\nIn connection with the assignment of the PURE Master Lease, we received a 5-year ROFO on future sale-leaseback transactions with IGP. Any additional properties acquired pursuant to the ROFO will be added to the PURE Master Lease.\n•\nVenetian Capital Investment. \nOn May 1, 2024, we entered into agreements to fund the up to $700.0 million Venetian Capital Investment for extensive reinvestment projects at the Venetian Resort through our Partner Property Growth Fund strategy. The invested capital will earn a return through the addition of incremental rent to the Venetian Lease. The up to $700.0 million of funding through our Partner Property Growth Fund strategy is comprised of $400.0 million that has already been funded and an incremental $300.0 million that the Venetian Resort will have the option, but not the obligation, to draw in whole or in part until November 1, 2026. The initial $400.0 million investment was funded based on a fixed schedule: $100.0 million was funded in the second quarter of 2024, $150.0 million was funded in the third quarter of 2024 and $150.0 million was funded on October 1, 2024. The previous Property Growth Fund Agreement entered into with the tenant in connection with the Venetian Resort acquisition providing for up to $1.0 billion of future development and construction project funding was terminated on May 1, 2024 concurrently with the entry into the agreement to fund the Venetian Capital Investment.\nIn connection with the Venetian Capital Investment, annual rent under the Venetian Lease will increase commencing on the first day of the quarter immediately following each capital funding at a 7.25% yield (the “Incremental Venetian Rent”). In addition to any increase pursuant to the Incremental Venetian Rent, annual rent under the Venetian Lease will begin escalating annually at 2.0% on March 1, 2029 and, commencing on March 1, 2031, will begin escalating on the same terms as the rest of the rent payable under the Venetian Lease with annual escalation equal to the greater of 2.0% or CPI, capped at 3.0%. The aggregate annual rent under the Venetian Lease increased by $29.0 million as a result of the $400.0 million of funding under the Venetian Capital Investment.\nReal Estate Debt Investment Activity\n•\nOne Beverly Hills Mezzanine Loan. \nSubsequent to year end, on February 19, 2025, we purchased a $300.0 million interest in an existing mezzanine loan related to the development of One Beverly Hills, a landmark 17.5-acre luxury mixed-use development. One Beverly Hills is being developed by Cain International and will be anchored by Aman Beverly Hills and will also include a full-scale refurbishment of The Beverly Hilton, Aman-branded hospitality and residential offerings, and 10 acres of botanical gardens and open space. The development project has already commenced construction and is expected to be completed late 2027.\nThe mezzanine loan has an initial maturity in March 2026 and has one 12-month extension option subject to certain conditions. We funded the investment with a combination of cash on hand and drawing down funds under our Revolving Credit Facility (as defined in\n \nNote 7 - Debt\n).\nThe following table summarizes our real estate debt investment activity (each as defined in the column titled “Real Estate Debt Investment”) for the year ended December 31, 2024:\n($ in millions)\nReal Estate Debt Investment\nDate\nInvestment Type\nCommitment\nCollateral\nGreat Wolf Mezzanine Loan \n(1)\nMay 9, 2024\nMezzanine\n$\n250.0 \nPortfolio of nine Great Wolf Lodge resorts across the United States\nChelsea Piers One Madison Loan\nFebruary 7, 2024\nSenior Secured Loan\n10.0 \nCertain equipment of the fitness club at the One Madison building in New York, NY\nHomefield Margaritaville Loan \n(2)\nJanuary 23, 2024\nSenior Secured Loan\n105.0 \nMargaritaville Resort in Kansas City, Kansas, under development\nTotal\n$\n365.0 \n____________________\n(1) In connection with the Great Wolf Mezzanine Loan, the  $79.5 million mezzanine loan for Great Wolf Lodge Maryland was repaid in full.\n(2) Simultaneous with entering into the loan agreement, we entered into a call right agreement that provides us with a call option on (i) the Margaritaville Resort, (ii) the new Homefield Kansas City youth sports training facility, (iii) the new Homefield baseball center, and (iv) the existing Homefield youth sports \n39\nTable of Contents\ncomplex in Olathe, Kansas. We also received a right of first refusal to acquire the real estate of any future Homefield property, should Homefield elect to monetize such assets in a sale-leaseback transaction. If the call option is exercised, all of the properties, including the Margaritaville Resort, will be subject to a single long-term triple-net master lease with us.\nFinancing and Capital Markets Activity\n•\nNew Revolving Credit Facility. \nSubsequent to year end, on February 3, 2025, we entered into the Credit Agreement (as defined in\n \nNote 7 - Debt\n) providing for the Revolving Credit Facility in the amount of $2.5 billion scheduled to mature on February 3, 2029. Concurrently, we terminated our 2022 Revolving Credit Facility and 2022 Credit Agreement (each as defined in \nNote 7 - Debt\n). \nThe Credit Facility includes two six-month maturity extension options (or one twelve-month extension option), the exercise of which in each case is subject to customary conditions and the payment of an extension fee. The Revolving Credit Facility includes the option to increase the revolving loan commitments by up to $1.0 billion in the aggregate to the extent that any one or more lenders (from the syndicate or otherwise) agree to provide such additional credit extension. Borrowings under the Credit Facility will bear interest, at VICI LP’s option, for U.S. Dollar borrowings at either (i) a rate based on SOFR plus a margin ranging from 0.70% to 1.40%, or (ii) a base rate plus a margin ranging from 0.00% to 0.40%, in each case, with the actual margin determined according to the Borrower’s debt ratings and total leverage ratio. In addition to U.S. Dollar borrowings, borrowings under the Credit Facility are also available in certain specific foreign currencies, bearing interest based on rates customary for such foreign currencies and subject to the same applicable margins for U.S. Dollar borrowings. In addition, the Credit Agreement includes the option to add one or more tranches of term loans of up to $2.0 billion in the aggregate, in each case, to the extent that any one or more lenders (from the syndicate or otherwise) agree to provide such additional credit extensions. Re\nfer to \nNote 7 - Debt\n included in this Annual Report on Form 10-K \nfor additional information.\n•\nAt-The-Market Offering Programs. \nDuring the year ended December 31, 2024, we sold an aggregate of 12,015,399 shares under the ATM Program, all of which were subject to forward sale agreements, for estimated aggregate net offering value of $376.3 million based on the initial forward sale price with respect to each forward sale agreement. We did not initially receive any proceeds from the sale of the shares of common stock under the ATM Program, which were sold to the underwriters by the forward purchasers or their respective affiliates. In July, October and November 2024, we physically settled certain outstanding forward shares issued under the ATM Program in exchange for aggregate net proceeds of approximately $379.4 million.\n•\nSenior Notes Offerings. \n◦\nOn March 18, 2024, VICI LP issued (i) $550.0 million in aggregate principal amount of 5.750% Senior Notes due 2034, which mature on April 1, 2034 and (ii) $500.0 million in aggregate principal amount of 6.125% Senior Notes due 2054, which mature on April 1, 2054, in each case under a supplemental indenture (the “March 2024 Notes”). We used the net proceeds of the offering to redeem (i) $1,024.2 million in aggregate principal amount of 5.625% Senior Notes due May 1, 2024 and (ii) $25.8 million in aggregate principal amount of 5.625% Senior Notes due May 1, 2024.\n◦\nOn December 19, 2024, VICI LP issued $750.0 million in aggregate principal amount of 5.125% Senior Notes due 2031, which mature on November 15, 2031 under a supplemental indenture (the “December 2024 Notes”). We used the net proceeds of the offering to redeem $750.0 million in aggregate principal amount of 3.500% Senior Notes due February 15, 2025.\n•\nForward-Starting Interest Rate Swap Agreements.  \n◦\nIn connection with our March 2024 Notes offering, we settled seven outstanding forward-starting interest rate swap agreements with an aggregate notional amount of $500.0 million resulting in net proceeds of $2.8 million. \n◦\nDuring the year ended December 31, 2024, we entered into seven forward-starting interest rate swap agreements and five U.S. Treasury Rate Lock agreements for an aggregate notional amount of $650.0 million to hedge against changes in future cash flows resulting from changes in interest rates from the trade date through the forecasted issuance of senior unsecured notes expected to be issued in connection with the refinancing of our senior unsecured notes maturing in February 2025. In connection with our December 2024 Notes offering, we settled the outstanding forward-starting interest rate swap agreements and U.S. Treasury Rate Lock agreements resulting in net proceeds of $6.8 million. Since the forward-starting interest rate swaps and U.S. Treasury Rate Lock agreements were hedging the interest rate risk on the respective senior unsecured notes offering, the unrealized gain in Accumulated other comprehensive income is being amortized over the term of the respective derivative instruments, which matches that of the underlying notes, as a decrease in interest expense.\n40\nTable of Contents\n◦\nDuring the year ended December 31, 2024, we entered into four forward-starting interest rate swap agreements for an aggregate notional amount of $200.0 million to hedge against changes in future cash flows resulting from changes in interest rates from the trade date through the forecasted issuance of senior unsecured notes expected to be issued in connection with the refinancing of our senior unsecured notes maturing in May 2025. These four forward-starting interest rate swap agreements were outstanding as of December 31, 2024.\nKEY TRENDS THAT MAY AFFECT OUR BUSINESS\nTenant and Industry Performance\nOur tenants (and respective guarantors, as applicable) under our lease agreements are leading gaming and experiential operators across the United States, Canada and abroad. Rental payments under our\n lease agreements comprise, and are expected to continue to comprise, a substantial majority of our revenues. Accordingly, we are dependent on, among other things, our tenants’ (and respective guarantors’, as applicable) financial performance, the performance of the gaming and other experiential industries and the health of the economies in the areas where our properties are located for the foreseeable future, and an event that has a material adverse effect on any of our tenant’s business, financial condition, liquidity, results of operations or prospects could have a material adverse effect on our business, financial condition, liquidity, results of operations and prospects. In addition, the financial performance of our tenants (and respective guarantors, as applicable) also has a direct impact on our financial results in a given reporting period due to the impact of ASC 326 “Credit Losses” (“ASC 326”), which requires us to estimate and record non-cash expected credit losses related to our investments, including changes on a quarterly basis, that are recorded in our Statement of Operations and impact our reported net income. The change in non-cash allowance for credit losses for a given period is dependent upon, among other things, our tenants’ and guarantors’ financial performance. For more information regarding ASC 326, refer to \nNote 5 - Allowance for Credit Losses\n included in this Annual Report on Form 10-K.\nBusiness Strategy\nOur business prospects and future growth will be significantly influenced by the success of our business strategy, and the timing, availability and terms of financing for any acquisitions and investments that we may complete, as well as broader macroeconomic and other conditions that affect our tenants’ operating and financial performance and the gaming and other experiential industries in which they operate, including those described herein. Further, the pricing of any acquisitions or other investments we may consummate and the terms of any leases that we may enter into will significantly impact our future results. Competition to enter into transactions with attractive properties and desirable tenants is intense, and we can provide no assurance that any future acquisitions, investments or leases will be on terms as favorable to us as those from comparable recent or historical transactions.\nImpact of the Macroeconomic Environment\nWe anticipate that we will finance our future growth with a combination of debt and equity, although no assurance can be given that we will be able to issue equity and/or debt in such amounts on favorable terms, or at all, or that we would not determine to incur more debt on a relative basis at the relevant time due to market conditions or otherwise. M\nacroeconomic volatility has introduced significant uncertainty and heightened risk for businesses, including us and our tenants, including the impact of  changing interest rates, inflation, threat of recession, geopolitical uncertainty, and increased cost of capital. Our tenants also face additional challenges, including potential changes in consumer confidence levels, behavior and spending and increased operational expenses, such as with respect to labor or energy costs. As a triple-net lessor, increased operational expenses at our leased properties are borne by our tenants and do not directly impact their rent obligations (other than with respect to underlying inflation as applied to the CPI-based escalators described below) or other obligations under our lease agreements. \nHowever, the current macroeconomic environment, including heightened interest rates and market volatility, impacts our business in certain respects, such as by increasing interest expense with respect to any borrowings under our Revolving Credit Facility and refinancing of recent and upcoming debt maturities, volatility of our share price with respect to sales of common stock, and, with respect to potential transactions, evaluating asset and property values in discussions with potential counterparties and obtaining transaction financing on attractive terms, all of which could increase our cost of capital, limit the benefits of any such transactions, and negatively impact our growth prospects. \nWith respect to our lease agreements, which generally provide for annual rent escalation based on a specified percentage increase and/or increases in CPI, we expect that current inflation levels will result in additional rent increases over time under our CPI-based lease provisions (subject to any applicable caps or periods in which such provisions do not apply). However, these rent increases may not match increasing inflation during periods when inflation rates are greater than the applicable CPI-\n41\nTable of Contents\nbased caps. \nOverall Implications of Such Material Trends on Our Business\nAs a triple-net lessor, we believe we are generally in a strong creditor position and structurally insulated from operational and performance impacts of our tenants, both positive and negative. However, the full extent to which the trends set forth herein adversely affect our tenants, the industries in which they operate, and/or ultimately impact our business depends on future developments that cannot be predicted with confidence, including our tenants’ financial performance, the direct and indirect effects of such trends discussed herein (including among other things, heightened interest rates, inflation, economic recessions, consumer confidence levels and general conditions in the capital and credit markets) and the impact of any future measures taken in response to such trends on our tenants. \nFor more information, refer to “\nPart I – Item 1A. Risk Factors\n” included in this Annual Report on Form 10-K.\nDISCUSSION OF OPERATING RESULTS\nResults of Operations for the Years Ended December 31, 2024 and December 31, 2023 \n(In thousands)\n2024\n2023\nVariance\nRevenues\nIncome from sales-type leases\n$\n2,068,443 \n$\n1,980,178 \n$\n88,265 \nIncome from lease financing receivables, loans and securities\n1,662,889 \n1,519,516 \n143,373 \nOther income\n77,422 \n73,326 \n4,096 \nGolf revenues\n40,451 \n38,968 \n1,483 \nTotal revenues\n3,849,205 \n3,611,988 \n237,217 \nOperating expenses\nGeneral and administrative\n69,109 \n59,603 \n9,506 \nDepreciation\n4,125 \n4,298 \n(173)\nOther expenses\n77,422 \n73,326 \n4,096 \nGolf expenses\n26,895 \n27,089 \n(194)\nChange in allowance for credit losses\n126,720 \n102,824 \n23,896 \nTransaction and acquisition expenses\n4,567 \n8,017 \n(3,450)\nTotal operating expenses\n308,838 \n275,157 \n33,681 \nIncome from unconsolidated affiliate\n— \n1,280 \n(1,280)\nInterest expense\n(826,097)\n(818,056)\n(8,041)\nInterest income\n16,095 \n23,970 \n(7,875)\nOther gains\n581 \n4,456 \n(3,875)\nIncome before income taxes\n2,730,946 \n2,548,481 \n182,465 \n(Provision for) benefit from income taxes\n(9,704)\n6,141 \n(15,845)\nNet income\n2,721,242 \n2,554,622 \n166,620 \nLess: Net income attributable to non-controlling interests\n(42,432)\n(41,082)\n(1,350)\nNet income attributable to common stockholders\n$\n2,678,810 \n$\n2,513,540 \n$\n165,270 \n42\nTable of Contents\nRevenue \nFor the years ended December 31, 2024 and 2023, our revenue was comprised of the following items:\n(In thousands)\n2024\n2023\nVariance\nLeasing revenue\n$\n3,596,884 \n$\n3,420,934 \n$\n175,950 \nIncome from loans\n134,448 \n78,760 \n55,688 \nOther income\n77,422 \n73,326 \n4,096 \nGolf revenues\n40,451 \n38,968 \n1,483 \n     Total revenues\n$\n3,849,205 \n$\n3,611,988 \n$\n237,217 \nLeasing Revenue\nThe following table details the components of our income from sales-type lease and lease financing receivables:\n(In thousands)\n2024\n2023\nVariance\nIncome from sales-type leases\n$\n2,068,443 \n$\n1,980,178 \n$\n88,265 \nIncome from lease financing receivables \n(1)\n1,528,441 \n1,440,756 \n87,685 \nTotal leasing revenue\n3,596,884 \n3,420,934 \n175,950 \nNon-cash adjustment \n(2)\n(537,927)\n(515,556)\n(22,371)\nTotal contractual leasing revenue\n$\n3,058,957 \n$\n2,905,378 \n$\n153,579 \n____________________\n(1) Represents our asset acquisitions structured as sale leaseback transactions. In accordance with ASC 842, since the lease agreements were determined to meet the definition of a sales-type lease and control of the asset is not considered to have transferred to us, such lease agreements are accounted for as financings under ASC 310.\n(2) Amounts represent the non-cash adjustment to income from sales-type leases and lease financing receivables in order to recognize income on an effective interest basis at a constant rate of return over the term of the leases. \nLeasing revenue is generated from rent from our lease agreements. Total leasing revenue increased $176.0 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. Total contractual leasing revenue increased $153.6 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The increases were primarily driven by the acquisition of the remaining 49.9% of the MGM Grand/Mandalay Bay portfolio, and the addition to our portfolio of the PURE Master Lease in January 2023, the Rocky Gap Casino component of the Century Master Lease in July 2023, the Century Canadian Portfolio component of the Century Master Lease in September 2023, the Lucky Strike (formerly known as Bowlero) Master Lease in October 2023, the Chelsea Piers Lease in December 2023 and the incremental rent increase from the Venetian Capital Investment in July and October 2024, as well as the annual rent escalators from certain of our other lease agreements.\nIncome From Loans\nIncome from loans increased $55.7 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase was driven by the origination and subsequent funding, as applicable, of our debt investments and the related interest income from the increased principal balances outstanding under such debt investments, partially offset by the full repayment of certain loan investments. \nOther Income\nOther income increased $4.1 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase was driven primarily by the additional income as a result of the assumption of certain ground leases in connection with the closing of the acquisition of the Rocky Gap Casino in July 2023 and the sale-leaseback transaction with Chelsea Piers in December 2023. We determined that we are the primary obligor of the respective ground and use leases and, accordingly, record the related income and expense on a gross basis on our Income Statement. The lease agreements require our tenants to cover all costs associated with such ground and use sub-leases and provide for their direct payment to the primary landlord.\n43\nTable of Contents\nOperating Expenses\nFor the years ended December 31, 2024 and 2023, our operating expenses were comprised of the following items:\n(In thousands)\n2024\n2023\nVariance\nGeneral and administrative\n$\n69,109 \n$\n59,603 \n$\n9,506 \nDepreciation\n4,125 \n4,298 \n(173)\nOther expenses\n77,422 \n73,326 \n4,096 \nGolf expenses\n26,895 \n27,089 \n(194)\nChange in allowance for credit losses\n126,720 \n102,824 \n23,896 \nTransaction and acquisition expenses\n4,567 \n8,017 \n(3,450)\nTotal operating expenses\n$\n308,838 \n$\n275,157 \n$\n33,681 \nGeneral and Administrative Expenses\nGeneral and administrative expenses increased $9.5 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase was primarily driven by a one-time charitable contribution to facilitate the Company’s corporate giving initiatives and by an increase in compensation, including stock-based compensation.\nOther Expenses\nOther expenses increased $4.1 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase was driven primarily by the additional expense as a result of the assumption of certain ground leases in connection with the closing of the acquisition of the Rocky Gap Casino in July 2023 and the sale-leaseback transaction with Chelsea Piers in December 2023. We determined we are the primary obligor of the respective ground and use leases and, accordingly, record the related income and expense on a gross basis on our Income Statement. The lease agreements require our tenants to cover all costs associated with such ground and use sub-leases and provide for their direct payment to the primary landlord.\nChange in Allowance for Credit Losses\nChange in allowance for credit losses increased $23.9 million during the year ended December 31, 2024 compared to the year ended December 31, 2023, \nprimarily driven by changes to the reasonable and supportable period, or R&S Period probability of default, or PD, and loss given default, LGD, of our existing tenants and their parent guarantors (as applicable) as a result of market performance and changes in the macroeconomic model used to scenario condition such inputs, partially offset by lower initial CECL allowances recorded on our acquisition and loan origination activity. We recorded\n initial CECL allowances of $2.9 million on our $365.0 million of loan origination activity during the year ended December 31, 2024, compared to initial CECL allowances of $279.0 million on our $4.1 billion of property acquisition activity and $14.0 million on our $698.2 million of loan origination activity during the year ended December 31, 2023\n.\nFurther fluctuation in the change in allowance for credit losses are the result of (i) changes to the long-term period PD as a result of changes in the credit ratings of our existing tenants and their parent guarantors, which are used to estimate the long-term PD and (ii) annual standard updates to the model used to estimate the CECL allowance. Refer to \nNote 5 - Allowance for Credit Losses\n for further details.\nTransaction and Acquisition Expenses\nTransaction and acquisition costs decreased $3.5 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. Changes in transaction and acquisition expenses are related to fluctuations in (i) costs incurred for investments during the period that are not capitalizable under GAAP, and (ii) costs incurred for investments that we are no longer pursuing.\n44\nTable of Contents\nNon-Operating Income and Expenses\nFor the years ended December 31, 2024 and 2023, our non-operating income and expenses were comprised of the following items:\n(In thousands)\n2024\n2023\nVariance\nIncome from unconsolidated affiliate\n$\n— \n$\n1,280 \n$\n(1,280)\nInterest expense\n(826,097)\n(818,056)\n(8,041)\nInterest income\n16,095 \n23,970 \n(7,875)\nOther gains\n581 \n4,456 \n(3,875)\nIncome from Unconsolidated Affiliate\nIncome from unconsolidated affiliate during the year ended December 31, 2023 represents our 50.1% share of the income of the MGM Grand/Mandalay Bay JV for the period from January 1, 2023 through January 8, 2023, immediately prior to the closing of the MGM Grand/Mandalay Bay JV Interest Acquisition (as defined in \nNote 3 - Real Estate Transactions\n). Beginning on January 9, 2023, upon the closing of the MGM Grand/Mandalay Bay JV Interest Acquisition, we consolidated the operations of the MGM Grand/Mandalay Bay JV and, subsequently, such income is included in Income from sales-type lease on our Statement of Operations and, accordingly, no Income from unconsolidated affiliate was recognized for the year ended December 31, 2024.\nInterest Expense\nInterest expense increased $8.0 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The increase was primarily related to an increase in debt outstanding from the (i) C$140.0 million, C$75.0 million and £14.5 million draws on the 2022 Revolving Credit Facility to finance the acquisition of the PURE Canadian Portfolio in January 2023, the acquisition of the Canadian portfolio component of the Century Master Lease in September 2023 and the Cabot Highlands loan in December 2023, respectively, partially offset by C$27.0 million of principal paydowns under the 2022 Revolving Credit Facility, and (ii) assumption of $3.0 billion aggregate principal amount of CMBS debt on January 9, 2023, in connection with the MGM Grand/Mandalay Bay JV Interest Acquisition, the combination of which resulted in an additional $3.2 billion in notional amount of debt in 2024 compared to 2023.   \nAdditionally, the weighted average annualized interest rate of our debt, net of the impact of the forward-starting interest rate swaps and treasury locks, increased to 4.34% during the year ended December 31, 2024 from 4.33% during the year ended December 31, 2023, as a result of a higher effective interest rate on (i) the draws on the 2022 Revolving Credit Facility, and (ii) the March 2024 Notes and December 2024 Notes as compared to the debt that was refinanced by such notes.\nInterest Income\nInterest income decreased $7.9 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The decrease was primarily driven by an overall decrease in our cash on hand throughout the current year as compared to the prior year.\nOther Gains\nOther gains decreased $3.9 million during the year ended December 31, 2024 compared to the year ended December 31, 2023. The change primarily relates to the sale of excess land in April 2023 and foreign currency remeasurement adjustments associated with our investments in Canada and the United Kingdom. In connection with such investments, we entered into foreign-denominated debt on the 2022 Revolving Credit Facility, of which \nC$188.0 million and £14.5 million\n is currently outstanding on the Revolving Credit Facility and, since such debt is held at entities with USD as their functional currency, certain of the related assets and liabilities are remeasured through the Statement of Operations.\nResults of Operations of VICI Properties L.P.\nThe operating results of VICI LP are materially consistent with those of the consolidated results of operations of VICI. However certain differences arise primarily related to the operations of VICI Golf which resulted in additional revenue and income to VICI which are not recognized at VICI LP, partially offset by additional VICI Golf expenses, including depreciation and income taxes and certain general and administrative expenses recognized at VICI but not recognized at VICI LP. Refer to the Explanatory Note at the beginning of this Form 10-K for additional information on the presentation of VICI and VICI LP and the differences between the two Financial Statements.\n45\nTable of Contents\nResults of Operations for the Years Ended December 31, 2023 and 2022\nFor a comparison of our results of operations for the fiscal years ended December 31, 2023 and 2022, see “\nPart II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\n” of our annual report on Form 10-K for the fiscal year ended December 31, 2023, filed with the SEC on February 22, 2024 and incorporated by reference herein.\n \nRECONCILIATION OF NON-GAAP MEASURES\nWe present VICI’s Funds From Operations (“FFO”), FFO per share, Adjusted Funds From Operations (“AFFO”), AFFO per share, and Adjusted EBITDA, which are not required by, or presented in accordance with, generally accepted accounting principles in the United States (“GAAP”). These are non-GAAP financial measures and should not be construed as alternatives to net income or as an indicator of operating performance (as determined in accordance with GAAP). We believe FFO, FFO per share, AFFO, AFFO per share and Adjusted EBITDA provide a meaningful perspective of the underlying operating performance of VICI’s business.\nFFO is a non-GAAP financial measure that is considered a supplemental measure for the real estate industry and a supplement to GAAP measures. Consistent with the definition used by the National Association of Real Estate Investment Trusts (NAREIT), we define FFO as VICI’s net income (or loss) attributable to common stockholders (computed in accordance with GAAP) excluding (i) gains (or losses) from sales of certain real estate assets, (ii) depreciation and amortization related to real estate, (iii) gains and losses from change in control, (iv) impairment write-downs of certain real estate assets and investments in entities when the impairment is directly attributable to decreases in the value of depreciable real estate held by the entity and (v) our proportionate share of such adjustments from our investment in unconsolidated affiliate. \nAFFO is a non-GAAP financial measure that we use as a supplemental operating measure to evaluate VICI’s performance. We calculate VICI’s AFFO by adding or subtracting from FFO non-cash leasing and financing adjustments, non-cash change in allowance for credit losses, non-cash stock-based compensation expense, transaction costs incurred in connection with the acquisition of real estate investments, amortization of debt issuance costs and original issue discount, other non-cash interest expense, non-real estate depreciation (which is comprised of the depreciation related to our golf course operations), capital expenditures (which are comprised of additions to property, plant and equipment related to our golf course operations), impairment charges related to non-depreciable real estate, gains (or losses) on debt extinguishment and interest rate swap settlements, other gains, deferred income tax benefits and expenses, other non-recurring non-cash transactions, our proportionate share of non-cash adjustments from our investment in unconsolidated affiliate (including the amortization of any basis differences) with respect to certain of the foregoing and non-cash adjustments attributable to non-controlling interest with respect to certain of the foregoing. \nWe calculate VICI’s Adjusted EBITDA by adding or subtracting from AFFO contractual interest expense (including the impact of the forward-starting interest rate swaps and treasury locks) and interest income (collectively, interest expense, net), current income tax expense and our proportionate share of such adjustments from our investment in unconsolidated affiliate.\nThese non-GAAP financial measures: (i) do not represent VICI’s cash flow from operations as defined by GAAP; (ii) should not be considered as an alternative to VICI’s net income as a measure of operating performance or to cash flows from operating, investing and financing activities; and (iii) are not alternatives to VICI’s cash flow as a measure of liquidity. In addition, these measures should not be viewed as measures of liquidity, nor do they measure our ability to fund all of our cash needs, including our ability to make cash distributions to our stockholders, to fund capital improvements, or to make interest payments on our indebtedness. Investors are also cautioned that FFO, FFO per share, AFFO, AFFO per share and Adjusted EBITDA, as presented, may not be comparable to similarly titled measures reported by other real estate companies, including REITs, due to the fact that not all real estate companies use the same definitions. Our presentation of these measures does not replace the presentation of VICI’s financial results in accordance with GAAP.\n46\nTable of Contents\nReconciliation of VICI’s Net Income to FFO, FFO per Share, AFFO, AFFO per Share and Adjusted EBITDA\nYear Ended December 31,\n(In thousands, except share data and per share data)\n2024\n2023\nNet income attributable to common stockholders\n$\n2,678,810 \n$\n2,513,540 \nReal estate depreciation\n— \n— \nJoint venture depreciation and non-controlling interest adjustments\n— \n1,426 \nFFO attributable to common stockholders\n2,678,810\n \n2,514,966\n \nNon-cash leasing and financing adjustments\n(537,708)\n(515,488)\nNon-cash change in allowance for credit losses\n126,720 \n102,824 \nNon-cash stock-based compensation\n17,511 \n15,536 \nTransaction and acquisition expenses\n4,567 \n8,017 \nAmortization of debt issuance costs and original issue discount\n71,592 \n70,452 \nOther depreciation\n3,428 \n3,741 \nCapital expenditures\n(3,007)\n(2,842)\nOther gains \n(1)\n(581)\n(4,456)\nDeferred income tax provision (benefit)\n5,439 \n(10,426)\nJoint venture non-cash adjustments and non-controlling interest adjustments\n4,022 \n4,716 \nAFFO attributable to common stockholders\n2,370,793\n \n2,187,040\n \nInterest expense, net\n738,410 \n723,634 \nCurrent income tax expense\n4,265 \n4,285 \nJoint venture interest expense and non-controlling interest adjustments\n(8,551)\n(5,287)\nAdjusted EBITDA attributable to common stockholders\n$\n3,104,917\n \n$\n2,909,672\n \nNet income per common share\nBasic\n$\n2.56 \n$\n2.48 \nDiluted\n$\n2.56 \n$\n2.47 \nFFO per common share\nBasic\n$\n2.56 \n$\n2.48 \nDiluted\n$\n2.56 \n$\n2.48 \nAFFO per common share\nBasic\n$\n2.26 \n$\n2.16 \nDiluted\n$\n2.26 \n$\n2.15 \nWeighted average number of shares of common shares outstanding\n     Basic\n1,046,739,537 \n1,014,513,195 \n     Diluted\n1,047,675,111 \n1,015,776,697 \n____________________\n(1) Represents non-cash foreign currency remeasurement adjustments and gain on sale of land. \n47\nTable of Contents\nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity\nAs of December 31, 2024, our available cash and cash equivalents balance, short-term investments and capacity under our 2022 Revolving Credit Facility were as follows:\n(In thousands)\nDecember 31, 2024\nCash and cash equivalents\n$\n524,615 \nCapacity under 2022 Revolving Credit Facility \n(1)\n2,351,154 \nProceeds available from settlement of Forward Sale Agreements \n(2)\n376,253 \nTotal\n$\n3,252,022 \n____________________\n(1)\nSubsequent to year end, on February 3, 2025, we entered into the Credit Agreement providing for the Revolving Credit Facility in the amount of $2.5 billion and concurrently terminated our 2022 Revolving Credit Facility and 2022 Credit Agreement. The Revolving Credit Facility includes the option to increase the revolving loan commitments by up to $1.0 billion to the extent that any one or more lenders (from the syndicate or otherwise) agree to provide such additional extensions of credit. In addition, the Credit Agreement includes the option to add one or more tranches of term loans of up to $2.0 billion in the aggregate, in each case, to the extent that any one or more lenders (from the syndicate or otherwise) agree to provide such additional credit extensions.  \n(2)\nAssumes the physical settlement of the 12.0 million outstanding forward shares as of December 31, 2024 under our at-the-market forward sale agreements at a forward sales price of $31.31 calculated as of December 31, 2024. \nWe believe that we have sufficient liquidity to meet our material cash requirements, including our contractual obligations, debt maturities and commitments as well as our additional funding requirements, primarily through currently available cash and cash equivalents, cash received under our lease agreements, existing borrowings from banks, including our undrawn capacity under our Revolving Credit Facility, net proceeds available under our outstanding forward sale agreements, and proceeds from future issuances of debt and equity securities (including issuances under any future “at-the-market” program) for the next 12 months and in future periods. \nAll of our lease agreements call for an initial term of between fifteen and thirty-two years with additional tenant renewal options and, along with our loans, are designed to provide us with a reliable and predictable long-term revenue stream. Our cash flows from operations and our ability to access capital resources could be adversely affected due to uncertain economic factors and volatility in the financial and credit markets, including as a result of the current inflationary environment, higher interest rates, equity market volatility, and changes in consumer behavior and spending. In particular, we can provide no assurances that our tenants will not default on their leases or fail to make full rental payments if their businesses become challenged due to, among other things, current or future adverse economic conditions. See “Overview — Impact of Material Trends on our Business” above for additional detail. In the event our tenants are unable to make all of their contractual rent payments as provided by our lease agreements, we believe we have sufficient liquidity from the other sources discussed above to meet all of our contractual obligations for a significant period of time. For more information, refer to the risk factors incorporated by reference into \nPart I. Item 1A. Risk Factors\n.\nOur ability to raise funds through the issuance of debt and equity securities and access to other third-party sources of capital in the future will be dependent on, among other things, general economic conditions, general market conditions for REITs and investment grade issuers, market perceptions, the trading price of our stock, trading value of our unsecured debt and uncertainties related to the macroeconomic environment. We will continue to analyze which sources of capital are most advantageous to us at any particular point in time and with respect to any specific funding requirements, but financing through the capital markets may not be consistently available on terms we deem attractive, or at all.\nMaterial Cash Requirements\nContractual Obligations\nOur short-term obligations consist primarily of regular interest payments on our debt obligations, dividends to our common stockholders, distributions to the VICI OP Unit holders, normal recurring operating expenses, recurring expenditures for corporate and administrative needs, certain lease and other contractual commitments related to our golf operations and certain non-recurring expenditures. For more information on our material contractual commitments, refer to \nNote 10 - Commitments and Contingent Liabilities\n.\nOur long-term obligations consist primarily of principal payments on our outstanding debt obligations and future funding commitments under our lease and loan agreements. As of December 31, 2024, we had $17.1 billion of debt obligations \n48\nTable of Contents\noutstanding of which $500.0 million matures on May 15, 2025 and $800.0 million matures on June 15, 2025. For a summary of principal debt balances and their maturity dates and principal terms, refer to \nNote 7 - Debt\n. For a summary of our future funding commitments under our loan portfolio, refer to \nNote 4 - Real Estate Portfolio\n. \nPursuant to our lease agreements, capital expenditures, insurance and taxes for our properties are the responsibility of the tenants. Minimum capital expenditure spending requirements of the tenants pursuant to our gaming lease agreements are described in \nNote 4 - Real Estate Portfolio\n.\nInformation concerning our material contractual obligations and commitments to make future payments under contracts such as our indebtedness, future funding commitments under our loans and Partner Property Growth Fund strategy and future contractual operating commitments (such as future lease payments under our corporate lease) are included in the following table as of December 31, 2024. Amounts in this table omit, among other things, non-contractual commitments and items such as dividends and recurring or non-recurring operating expenses and other expenditures, including acquisitions and other investments:\nPayments Due By Period\n(In thousands)\nTotal\n2025\n2026\n2027\n2028\n2029 and Thereafter\nLong-term debt, principal\nSenior unsecured notes\n$\n13,950,000 \n$\n1,300,000 \n$\n1,750,000 \n$\n1,500,000 \n$\n1,600,000 \n$\n7,800,000 \nMGM Grand/Mandalay Bay CMBS debt\n3,000,000 \n— \n— \n— \n— \n3,000,000 \nRevolving credit facility \n(1)\n148,846 \n— \n148,846 \n— \n— \n— \nScheduled interest payments \n(2)\n5,510,383 \n753,796 \n720,368 \n604,785 \n531,894 \n2,899,540 \nTotal debt contractual obligations\n22,609,229 \n2,053,796 \n2,619,214 \n2,104,785 \n2,131,894 \n13,699,540 \nLeases and contracts \n(3)\nFuture funding commitments – loan investments and Partner Property Growth Fund \n(4)\n548,524 \n341,445 \n205,930 \n1,149 \n— \n— \nGolf course operating lease and contractual commitments\n40,009 \n2,153 \n2,197 \n2,241 \n2,285 \n31,133 \nCorporate office lease\n15,429 \n73 \n1,742 \n871 \n1,742 \n11,001 \nTotal leases and contractual obligations\n603,962 \n343,671 \n209,869 \n4,261 \n4,027 \n42,134 \nTotal contractual commitments\n$\n23,213,191 \n$\n2,397,467 \n$\n2,829,083 \n$\n2,109,046 \n$\n2,135,921 \n$\n13,741,674 \n__________________\n(1) Subsequent to year end, on February 3, 2025, we entered into the Credit Agreement providing for the Revolving Credit Facility in the amount of $2.5 billion  scheduled to mature on February 3, 2029, and concurrently terminated the 2022 Revolving Credit Facility and 2022 Credit Agreement.  \n(2) Estimated interest payments on variable interest debt under our Revolving Credit Facility are based on the CORRA and SONIA rates as of December 31, 2024.\n(3) Excludes ground and use leases which are paid directly by our tenants to the primary lease holder. \n(4) The allocation of our future funding commitments is based on construction draw schedules, commitment funding dates, expiration dates or other information, as applicable; however, we may be obligated to fund these commitments earlier than such applicable date. \nAdditional Funding Requirements\nIn addition to the contractual obligations and commitments set forth in the table above, we have and may enter into additional agreements that commit us to potentially acquire properties in the future, fund future property improvements or otherwise provide capital to our tenants, borrowers and other counterparties, including through our Partner Property Growth Fund. As of December 31, 2024, we had $300.0 million of additional potential future funding commitments in connection with the Venetian Capital Investment entered into on May 1, 2024, pursuant to which the tenant has the option, but not the obligation, to draw such funds. The utilization of funding commitments under the Partner Property Growth Fund, as well as the total funding ultimately provided under such arrangements, is at the discretion of the respective tenant and will be dependent upon independent decisions made by such tenant with respect to any capital improvement projects and the source of funds for such projects. For further information, refer to \nNote 3 – Real Estate Transactions\n.\n49\nTable of Contents\nCash Flow Analysis\nThe table below summarizes our cash flows for the years ended December 31, 2024 and 2023:\n(In thousands)\n2024\n2023\nVariance ($)\nCash, cash equivalents and restricted cash\nProvided by operating activities\n$\n2,381,498 \n$\n2,181,009 \n$\n200,489 \nUsed in investing activities\n(922,781)\n(2,899,095)\n1,976,314 \n(Used in) provided by financing activities\n(1,457,121)\n1,031,790 \n(2,488,911)\nNet increase in cash, cash equivalents and restricted cash\n$\n2,041 \n$\n313,641 \n$\n(311,600)\nCash Flows from Operating Activities\nNet cash provided by operating activities increased $200.5 million for the year ended December 31, 2024 compared with the year ended December 31, 2023. The increase was primarily driven by the acquisition of the remaining 49.9% of the MGM Grand/Mandalay Bay portfolio in January 2023, and an increase in rental payments from the addition of the Rocky Gap Casino component of the Century Master Lease in July 2023, the Canadian portfolio component of the Century Master Lease in September 2023, the Lucky Strike Master Lease in October 2023, the Chelsea Piers Lease in December 2023, the annual rent escalators on our Caesars Leases and certain of our other lease agreements, and the incremental rent increase from the Venetian Capital Investment in July and October 2024, as well as the incremental interest income associated with additional loan fundings and originations.\nCash Flows from Investing Activities\nNet cash used in investing activities decreased $1,976.3 million for the year ended December 31, 2024 compared with the year ended December 31, 2023. \nDuring the year ended December 31, 2024, the primary sources and uses of cash from investing activities included:\n•\nDisbursements to fund investments in our loan and securities portfolio in the amount of $579.1 million;\n•\nPayments to fund the Venetian Capital Investment and Partner Property Growth Fund investment at Caruthersville in the aggregate amount of \n$411.8 million;\n•\nProceeds from the repayment of the Great Wolf Lodge Maryland mezzanine loan in the amount of $79.5 million;\n•\nInvestments and maturities of short-term investments of $29.6 million;\n•\nAcquisition of property and equipment costs of $7.5 million; and\n•\nCapitalized transaction costs of $5.9 million.\n \nDuring the year ended December 31, 2023, the primary sources and uses of cash from investing activities included:\n•\nNet payments of \n$1,266.9 million\n, including acquisition costs, in connection with the MGM Grand/Mandalay Bay JV Interest Acquisition;\n•\nPayments for property acquisitions during the year for a total cost of \n$1,373.1 million\n, including acquisition costs, of which \n$1,132.0 million\n was classified as investments in financing receivables and \n$241.1 million\n was classified as investments sales-type lease;\n•\nDisbursements to fund investments in our loan and securities portfolio in the amount of \n$959.1 million\n;\n•\nPrincipal repayment of loans in the amount of $482.0 million, of which $400.0 million related to the full repayment of the \nCaesars Forum Convention Center mortgage loan\n;\n•\nMaturities of short-term investments, net of investments of \n$217.3 million\n;\n•\nProceeds from the sale of land of \n$6.2 million\n; and\n•\nAcquisition of property and equipment costs of \n$4.0 million.\n50\nTable of Contents\nCash Flows from Financing Activities\nNet cash used in financing activities increased $2,488.9 million for the year ended December 31, 2024 compared with the year ended December 31, 2023. \nDuring the year ended December 31, 2024, the primary sources and uses of cash from financing activities included:\n•\nRedemption of the outstanding (i) $1,050.0 million in aggregate principal amount of the 5.625% senior unsecured notes due 2024, and (ii) $750.0 in aggregate principal amount of 3.500% senior unsecured notes due 2025;\n•\nNet proceeds from the issuance of the March 2024 Notes and December 2024 Notes in the amount of $1,771.2 million;\n•\nDividend payments of $1,753.0 million;\n•\nProceeds of $378.7 million from the physical settlement of 13,194,739 forward shares under our ATM Program, net of equity offering costs paid in the current year; \n•\nPaydowns of $94.3 million in aggregate on our 2022 Revolving Credit Facility;\n•\nDraws of $82.2 million in aggregate on our 2022 Revolving Credit Facility;\n•\nDistributions of $31.2 million to non-controlling interests;\n•\nRepurchase of shares of common stock for tax withholding in connection with the vesting of employee stock compensation of $5.3 million; and\n•\nPayments of debt issuance costs of  $5.3 million.\nDuring the year ended December 31, 2023, the primary sources and uses of cash from financing activities included: \n•\nNet proceeds of $2,480.1 million from the issuance of an aggregate 79,065,750 shares of our common stock pursuant to the full physical settlement of certain of our forward sale agreements, net of equity offering costs paid in the current year;\n•\nDividend payments of $1,583.8 million;\n•\nDraws of $419.1 million in aggregate on our 2022 Revolving Credit Facility and subsequent paydown of $250.0 million on our 2022 Revolving Credit Facility;\n•\nDistributions of $28.6 million to non-controlling interests; and \n•\nRepurchase of shares of common stock for tax withholding in connection with the vesting of employee stock compensation of $5.0 million.\nDebt\nFor a summary of our debt obligations as of December 31, 2024, refer to \nNote 7 - Debt\n. For a summary of our financing activities in 2024 refer to “Summary of Significant 2024 Activity - Financing and Capital Markets Activity” above\n.\nCovenants\nOur debt obligations are subject to certain customary financial and operating covenants that restrict our ability to incur additional debt, sell certain assets and restrict certain payments, among other things. In addition, these covenants are subject to a number of important exceptions and qualifications, including, with respect to the restricted payments covenant, the ability to make unlimited restricted payments to maintain our REIT status.\nAt December 31, 2024, we were in compliance with all required debt-related covenants, including financial covenants.\nCRITICAL ACCOUNTING ESTIMATES\nOur Financial Statements are prepared in accordance with GAAP which requires us to make estimates and assumptions about future events that affect the amounts reported in the financial statements and accompanying notes. We believe that the following discussion addresses our most critical accounting estimates, which are those that have a significant level of estimation uncertainty, requiring our most difficult, subjective and complex judgments, and significantly impacts the Balance Sheets and Statement of Operations in the reporting period. Actual results may differ from the estimates. Refer to \nNote 2 - Summary of Significant Accounting Policies\n for a full discussion of our accounting policies. \n51\nTable of Contents\nLease Accounting\nWe account for our investments in leases under ASC 842 “Leases” (“ASC 842”), which requires us to use significant estimates and judgment in applying the accounting standard. Upon lease inception or lease modification, we assess the lease classification of the different components of the property, generally land and building, to determine whether each component should be classified as a direct financing, sales-type or operating lease. The determination of lease classification requires the calculation of the rate implicit in the lease, which is driven by (i) significant judgments around the inclusion of renewal terms in the non-cancelable lease period and whether such renewal terms are reasonably certain to be exercised and (ii) the estimation of both the value assigned to the land and building property components upon acquisition and the estimation of the unguaranteed residual value of such components at the end of the lease term. If the lease component is determined to be a direct financing or sales-type lease, revenue is recognized over the life of the lease using the rate implicit in the lease. \nWe use industry standard practices to estimate both the value assigned to the land and building property components upon acquisition and the unguaranteed residual value of such components, including comparable sales and replacement cost analyses. Although we believe our estimate of both the value assigned to the land and building property components upon acquisition and the unguaranteed residual value of such components is reasonable, no assurance can be given that such amounts will be correct. In particular a change in the estimates could have a material impact on the lease classification determination and the timing and amount of income recognized over the life of the lease. \nAllowance for Credit Losses\nASC 326 “Financial Instruments-Credit Losses” (“ASC 326”) requires that we measure and record current expected credit losses (“CECL”) for the majority of our investments, the scope of which includes our Investments in leases - sales-type, Investments in leases - financing receivables and Investments in loans. We have elected to use a discounted cash flow model to estimate the Allowance for credit losses, or CECL allowance for our leases. This model requires us to develop cash flows that project estimated credit losses over the life of the lease and discount these cash flows at the investment’s effective interest rate. We then record a CECL allowance equal to the difference between the amortized cost basis of the investment and the present value of the expected credit loss cash flows.\nExpected losses within our cash flows are determined by estimating the probability of default (“PD”) and loss given default (“LGD”) of our tenants and their parent guarantors over the life of each individual lease or financial asset. The PD and LGD are estimated during a reasonable and supportable period for which we believe we are able to estimate future economic conditions (the “R&S Period”) and a long-term period for which we revert to long-term historical averages (the “Long-Term Period”). We are unable to use our historical data to estimate losses as we have no loss history to date. \nGiven the length of our leases, the Long-Term Period PD and LGD are the most material and significant drivers of the CECL allowance. The PD and LGD for the Long-Term Period are estimated using the average historical default rates and historical loss rates, respectively, of public companies over the past 40 years that have similar credit profiles or characteristics to our tenants and their parent guarantors. We have engaged a nationally recognized data analytics firm to assist us with estimating both the PD and LGD of our tenants and their parent guarantors. Changes to the Long-Term Period PD and LGD are generally driven by (i) updated studies from the nationally recognized data analytics firm we employ to assist us with calculating the allowance and (ii) changes in the credit rating assigned to our tenants and their parent guarantors. \nThe following table illustrates the impact on the CECL allowance of our investment portfolio as a result of a 10% increase and decrease in the weighted average percentages used to estimate Long-Term PD and LGD of all of our tenants and their parent guarantors. Refer to \nNote 5 - Allowance\n \nfor Credit Losses\n for further information on our CECL Allowance and related balances as of December 31, 2024. \n($ in thousands)\nLong-Term PD\nLong-Term LGD\nChange\nChange in CECL Allowance %\nChange in CECL Allowance $\nChange in CECL Allowance %\nChange in CECL Allowance $\n10% increase\n0.21 \n%\n$\n91,990 \n0.25 \n%\n$\n110,597 \n10% decrease\n(0.21)\n%\n$\n(93,927)\n(0.25)\n%\n$\n(110,602)\nAlthough management believes its estimate of the Long-Term PD and LGD described above is reasonable, no assurance can be given that the Long-Term PD and LGD for our tenants, or other drivers of the CECL allowance, will be correct. Any significant variation of Long-Term PD or LGD from management’s expectations could have a material impact on our financial condition and operating results. \n52\nTable of Contents",
  "item2": null
}