{
  "source_file": "vlto-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.  BUSINESS\nOur Company\n \nVeralto Corporation’s unifying purpose is \nSafeguarding the World’s Most Vital Resources\nTM\n.  Our diverse group of leading operating companies provide essential technology solutions that monitor, enhance and protect key resources around the globe.  We are committed to the advancement of public health and safety and believe we are positioned to support our customers as they address large global challenges including environmental resource sustainability, water scarcity, management of severe weather events, food and pharmaceutical security, and the impact of an aging workforce.  For decades, we have used our scientific expertise and innovative technologies to address complex challenges our customers face across regulated industries – including municipal utilities, food and beverage, pharmaceutical and industrials – where the consequence of failure is high.  Through our core offerings in water analytics, water treatment, marking and coding, and packaging and color, customers look to our solutions to help ensure the safety, quality, efficiency and reliability of their products, processes and people globally.  Veralto is headquartered in Waltham, Massachusetts with a workforce of nearly 17,000 employees (whom we refer to as “associates”) as of December 31, 2024, of whom approximately 6,500 were employed in North America, 5,000 were employed in Western Europe, 500 were employed in other developed markets and 5,000 were employed in high-growth markets.  Veralto defines high-growth markets as developing markets of the world which include Asia (with the exception of Japan, Australia and New Zealand), Latin America (including Mexico), the Middle East, Eastern Europe and Africa.  Veralto defines developed markets as all markets of the world that are not high-growth markets. \nVeralto Corporation is a Delaware corporation and was incorporated in 2023 in connection with the separation of Veralto from Danaher Corporation (“Danaher” or “Former Parent”) on September 30, 2023 as an independent, publicly traded company, listed on the New York Stock Exchange (the “Separation”).  At the time of the Separation, Veralto Corporation consisted of Danaher’s former Environmental & Applied Solutions segment.  The Separation was effectuated through a pro-rata dividend distribution on September 30, 2023 of all of the issued and outstanding shares of Veralto common stock held by Danaher as of September 13, 2023.  Each Danaher stockholder of record as of the close of business on September 13, 2023 received one share of Veralto common stock for every three shares of Danaher common stock held on the record date.\nVeralto operates through two segments – Water Quality (“WQ”) and Product Quality & Innovation (“PQI”).  Our businesses within these segments have strong globally recognized brands as a result of our leadership in served markets over several decades.  Our WQ segment provides innovative products and services that improve the quality and reliability of water with leading brands including Hach, Trojan Technologies and ChemTreat.  Our PQI segment enables our customers to promote consumer trust in their products and help enable product innovation with leading brands including Videojet, Linx, Esko, X-Rite and Pantone.  We believe our leading positions result from the strength of our commercial organizations, our legacy of innovation, and our close and long-term connectivity to our customers and knowledge of their workflows, underpinned by our culture of continuous improvement.  This has resulted in a large installed base of instruments that drive ongoing consumables and software sales to support our customers.  As a result, our business generates recurring sales which represented approximately 61% of total sales during the year ended December 31, 2024.  Our business model also supports a strong margin profile with limited capital expenditure requirements and has generated attractive cash flows.  We believe these attributes allow us to deliver financial performance that is resilient across economic cycles.\nWe also believe that the Veralto Enterprise System (“VES”) provides us with a strong foundation for competitive differentiation.  VES is a business management system that consists of a philosophy, processes and tools that guide what Veralto does and measure how well Veralto executes, grounded in a culture of continuous improvement.  VES processes and tools are organized around the areas of Operational Excellence, Growth and Leadership, and are rooted in foundational tools known as the VES Fundamentals, which are relevant to every associate and business function.  The VES Fundamentals are focused on core competencies such as using visual representations of processes to identify inefficiencies, creating standard work, defining and solving problems in a structured way, and continuously improving processes to drive long term impact.\nVeralto uses VES tools to improve our profitability and cash flows, which support our ability to expand our addressable market and improve our market position through investments in areas such as our commercial organization and research and development (“R&D”), including software and digital solutions.  Our cash flows also \n4\nsupport acquisitions to enhance our product capabilities and expansion into new and attractive markets, which we have successfully done through the acquisition of over 80 businesses over more than two decades. \nOur two segments are described below: \nWater Quality\nOur Water Quality segment provides one of the most comprehensive portfolios of water analytics, and differentiated water treatment solutions that enable the reliable delivery of safe drinking water by public and private utilities - from source water to the consumer and back into the water cycle.  In addition, we help improve the efficiency of processes and production operations of our customers and ensure that their wastewater discharge meets regulatory standards and their environmental and sustainability targets.  Under our Hach, Trojan Technologies, ChemTreat, and other globally recognized WQ brands, we provide proprietary precision instrumentation and advanced water treatment technologies that our customers rely on to measure, analyze and treat the world’s water in residential, commercial, municipal, industrial, research and natural resource applications.  In addition to instrumentation, our suite of water solutions includes elements used on a recurring basis such as chemical reagents, services and software.  Together, these offerings help promote the quality and reliability of water and optimize our customers’ operations, decision making and regulatory compliance activities.\nWQ focuses on what management believes are the most attractive sub-segments of the water value chain helping our customers address some of their most pressing and complex challenges, such as water scarcity, water safety, severe weather events and management of precious natural resources.  Our businesses have been at the forefront of delivering breakthrough innovations to our customers.  For example, Hach has been a leading player in the field of turbidity testing for over 60 years, pioneering the first regulated method and introducing multiple new generations of instruments and related products.  Today, we have one of the most comprehensive portfolios of solutions allowing our customers to test the broadest range of analytical parameters and the ability to harness their data across installed assets.  Increasingly, our customers leverage our digital solutions to support regulatory compliance, automate workflows and allow for remote operations and predictive capabilities to address new challenges posed by changing regulations and an aging and less experienced workforce.\nOur key WQ brands provide solutions that our customers rely upon to manage critical operations involving water.\n•\nHach, the best known of our global brands in the WQ segment, recognized for simple and reliable tests, offers analytical measurement instruments, digital solutions and related consumables that test water quality; we serve over 149,000 customers, including small community water utilities, large public and private water utilities and industrial customers and help to ensure safe water for more than 3.4 billion people every day - approximately 40% of the global population. \n•\nChemTreat associates work alongside customers across many industries to understand their water challenges and tailor chemical treatment plans and dosing protocols to help optimize customers’ water usage and maximize reuse, and reduce water pollution; our solutions helped customers save over 85 billion gallons of water in 2024. \n•\nTrojan Technologies offers UV and membrane filtration systems for water disinfection and contaminant removal; our systems support the treatment of 13 trillion gallons of water annually and in turn help to improve access to clean water for more than 275 million people every day. \nProduct Quality & Innovation\nOur Product Quality & Innovation segment provides a broad set of essential solutions for brand owners and consumer packaged goods companies that enable speed to market as well as traceability and quality control of their products.  Our solutions play a central role in helping our customers convey the quality and safety of their products and build trust with consumers.  Under our Videojet, Linx, Esko, X-Rite, Pantone and other globally recognized PQI brands, we provide marking and coding, and packaging and color instrumentation and related consumables.  Our customers across consumer, pharmaceutical and industrial sectors utilize our offerings to bring products to market, mark packaging in compliance with industry and regulatory standards and convey the safety of products to customers.  Our solutions also enable the effective execution of product recalls, thereby helping to mitigate public health risks.  Our software solutions are designed to address higher-value, design-oriented portions of the packaging management value chain, such as digital asset management (“DAM”), marketing resource management (“MRM”) and product information management (“PIM”), that help our customers maximize efficiency of operations while generating an attractive source of recurring sales for us.  We estimate that 80% of the top 25 global consumer packaged goods (“CPG”) brands (based on 2024 revenues) and a majority of the top 20 pharmaceutical brands \n5\n(based on 2024 revenues) use PQI’s solutions, enabling confidence and trust in the brands and products consumers use daily. \nOur PQI brands provide brand owners and consumer packaged goods companies with essential solutions that improve their ability to develop, maintain and ensure the authenticity of their brands.\n•\nVideojet, our largest operating company within PQI, and Linx offer technologies that mark and code packaged goods and related consumables.  Videojet is a leading provider of inline printing solutions for products and packaging with marking and coding systems used by many of the top global consumer brands.  Our solutions help ensure transparency, safety, authenticity, tracking and traceability of an estimated more than 10 billion codes printed around the world daily. \n•\nEsko facilitates the creation of new packaging designs through design software and imaging systems.  Esko’s offerings are used by over 25,000 established and emerging brands and their suppliers in over 140 countries.  TraceGains, acquired in 2024, provides leading cloud-based software solutions that enable connected data and digital workflow management to help consumer brands meet increasingly stringent compliance and reporting regulations for food and beverage safety and traceability. \n•\nX-Rite serves over 13,000 brands across 140 countries by providing color management solutions that measure the quality and consistency of color and appearance on printed packages and consumer and industrial products.\n•\nPantone is the preeminent color standard in the design industry leveraged by more than 10 million designers, marketers and others in the creative community, not only to ensure color standardization but also to understand the impact of color on consumers. \nSales and Distribution\nIn 2024, Veralto generated $5.2 billion in sales derived from a business mix that is highly diversified by geography and end-market.  Our business model is highly resilient with approximately 61% of our sales derived from consumables (e.g., reagents, inks and process chemicals), spare parts, services (e.g., maintenance and inspection), and software (including Software-as-a-Service, or “SaaS”, and term-based licenses).  We serve a broad range of customers spanning the municipal, industrial, food and beverage (“F&B”) and CPG end markets, many of which are highly regulated.  We generated 48% of our 2024 sales from North America, 22% from Western Europe, 2% from other developed markets and 28% from high-growth markets.  We define other developed markets as Japan, Australia and New Zealand.  We define high-growth markets as developing markets of the world which include Asia (with the exception of Japan, Australia and New Zealand), Latin America (including Mexico), the Middle East, Eastern Europe and Africa.  Our strategic investments in these markets have scaled our presence in high-growth markets to approximately 5,000 associates with 10 local manufacturing facilities. \nVeralto distributes approximately 23% of its technology and equipment products through third-party distributors.  No individual customer accounted for more than 10% of combined sales in 2024, 2023 or 2022.\nAcquisition Activities\nVeralto views acquisitions as a key part of its growth strategy.  These acquisition activities are intended to supplement Veralto’s core growth and support ongoing expansion of its business, including through new technologies, additional products, organizational strength and geographic breadth.\nSustainability\nWe are deeply aware of our responsibility to our stakeholders and the opportunities before us to make a global difference-through our innovative products, our impact on the planet, and our people-as reflected in our unifying purpose, \nSafeguarding the World’s Most Vital Resources\nTM\n.  In particular:\n•\nAt our core, the products and services we provide underscore our commitment to advancing broad sustainability objectives for our customers.  For example:\n◦\nOur WQ segment offers products and services that enable municipalities to deliver clean water while helping industrial customers to be good stewards of water in their processes.\n◦\nOur PQI segment allows brands to drive consumer transparency, measure and reduce packaging waste, and accelerate time-to-market for new packaging innovations.\n6\n•\nOur leadership has conducted a sustainability prioritization assessment to inform our sustainability priorities.  \n•\nInformed by our prioritization assessment, we intend to set and communicate additional public sustainability goals and we expect to rigorously track our progress towards achieving those goals.\n•\nOur sustainability program is organized around the three pillars of Products, Planet, and People.  Coupled with strong corporate governance practices to provide oversight and management support, the sustainability program is positioned to iteratively prioritize initiatives using the insights we learn from engaging with our stakeholders.\n•\nAs delegated by Veralto’s Board of Directors, the Nominating and Governance Committee assumes primary oversight responsibility (interacting with the Audit and the Compensation Committees, as appropriate for certain matters) to provide oversight for Veralto’s sustainability program, including Veralto’s sustainability strategy, targets, and metrics.  Veralto’s Board reviews our sustainability program at least annually.\n•\nAt the managerial level, Veralto’s Senior Vice President of Strategy & Sustainability, who reports directly to our President and CEO, oversees our sustainability program and the Veralto Sustainability Council and is responsible for reviewing and approving Veralto’s sustainability reports.  Veralto’s Sustainability Council develops and drives our roadmap of sustainability initiatives.  This council and its working groups include representation from our WQ and PQI segments, as well as the corporate human resources; environment, health, and safety; VES; procurement; investor relations; finance; IT; corporate communications; and legal functions.\n•\nIn addition to outreach conducted as part of our prioritization assessment, we engage with stakeholders to inform our priorities and goals and the strategies through which we can achieve them.  We intend to proactively solicit the voice of our stakeholders, including through associate surveys, meetings with investors, collaboration with our customers and partners, and participation in industry associations.\n•\nWe are evaluating opportunities to make an impact through collective actions such as sustainability-focused partnerships, initiatives, industry alliances, and grant-making opportunities.\n•\nWe will continue to leverage VES to help us achieve our sustainability goals and facilitate continuous improvement in our sustainability program.\nThe following discussion includes information common to all of Veralto’s segments.\nMaterials\nVeralto’s manufacturing operations employ a wide variety of raw materials, including metallic-based components, electronic components, chemistries, OEM products, plastics and other petroleum-based products.  Prices of oil and gas affect Veralto’s costs for freight and utilities and also have an indirect impact on the cost of other purchased materials.  While the price of, and global instability with respect to the supply of, oil and gas did not materially, adversely affect Veralto’s operations in 2024, Veralto is continuing to monitor the oil and gas and other commodity markets and will seek to mitigate price and/or availability risks as needed.  Veralto purchases raw materials from a large number of independent sources around the world.  No single supplier is material, although for some components that require particular specifications or regulatory or other qualifications there may be a single supplier or a limited number of suppliers that can readily provide such components.  Veralto utilizes a number of techniques to address potential disruption in and other risks relating to its supply chain, including in certain cases the use of safety stock, alternative materials and qualification of multiple supply sources.  \nThe supply chain disruptions, labor availability constraints, and labor cost increases that began in 2021 for a number of our businesses eased in 2024.  Through the application of VES tools and processes (including the implementation of price increases), Veralto largely mitigated the impact of these pressures on Veralto’s profitability and as a result these pressures did not have a material, adverse effect on the business in 2024.  These pressures continue to varying degrees as of the date of this annual report.  We are continuing to work with our suppliers to understand the existing and potential future impacts of these trends on our supply chain and we continue to take actions in an effort to mitigate such impacts, including purchasing components in the open market and qualifying additional suppliers.  Due to the uncertainty regarding the duration and impact of these trends in 2025, there can be no assurance that these factors will not have an adverse impact on our business and financial statements in the future.  For a further discussion of risks related to the materials and components required for Veralto’s operations, refer to “Item 1A. Risk Factors.”\n7\nGlobal Military Conflicts\nIn 2022, Veralto suspended the shipment of products to Russia.  In the first quarter of 2022, Veralto recorded a pretax charge of $1 million, primarily related to the impairment of accounts receivable and inventory related to Russian operations.  Russia has significantly reduced the export of natural gas to Europe, creating uncertainty on natural gas prices and a reduced supply of natural gas.  If this trend continues, Veralto’s European manufacturing facilities could face increased costs and risks of production disruptions.  Veralto’s European customers and suppliers could experience similar adverse impacts, which could further adversely impact Veralto’s supply chain and also adversely impact the demand for its products.  Veralto will continue monitoring the military, social, political, regulatory and economic environment and its broader impacts, and will consider further actions as appropriate.  For a discussion of risks related to Veralto’s operations as a result of global military conflicts, refer to “Item 1A. Risk Factors.”  \nIntellectual Property\nVeralto owns numerous patents, trademarks, copyrights, trade secrets and licenses to intellectual property owned by others.  Although in aggregate, our intellectual property is important to our operations, Veralto does not consider any single patent, trademark, copyright, trade secret or license (or any related group of any such items) to be of material importance to any segment or to the business as a whole.  From time to time, we engage in litigation to protect our intellectual property rights.  For a discussion of risks related to our intellectual property, refer to “Item 1A. Risk Factors.” All capitalized brands and product names throughout this document are trademarks owned by, or licensed to, Veralto.\nCompetition\nAlthough Veralto’s businesses generally operate in highly competitive markets, Veralto’s competitive position cannot be determined accurately in the aggregate or by segment since none of its competitors offer all of the same product and service lines or serve all of the same markets as Veralto, or any of its segments, does.  Because of the range of the products and services Veralto sells and the variety of markets it serves, Veralto encounters a wide variety of competitors, including well-established regional competitors, competitors who are more specialized than it is in particular markets, as well as large companies or divisions of large companies with substantial sales, marketing, research and financial capabilities.  Veralto is facing increased competition in a number of its served markets as a result of the entry of well-resourced companies into certain markets, the entry of competitors based in low-cost manufacturing locations, the development of competitive technologies by early-stage and emerging companies and increasing consolidation in particular markets.  The number of competitors varies by product and service line.  Management believes that Veralto has a leadership position in many of the markets it serves.  Key competitive factors vary among Veralto’s businesses and product and service lines, but include the specific factors noted above with respect to each particular business and typically also include price, quality, performance, delivery speed, application expertise, service and support, technology and innovation, distribution network, breadth of product, service and software offerings and brand name recognition.  For a discussion of risks related to competition, refer to “Item 1A. Risk Factors.”\nHuman Capital\nAs of December 31, 2024, Veralto had nearly 17,000 employees (whom we refer to as “associates”), of whom approximately 6,500 were employed in the North America, 5,000 were employed in Western Europe, 500 were employed in other developed markets and 5,000 were employed in high-growth markets.  Approximately 16,500 of our total employees were full-time and 500 were part-time employees.  Outside the United States, we have government-mandated collective bargaining arrangements and union contracts in certain countries, particularly in Europe, where many of our employees are represented by unions and/or works councils.  \nVeralto is committed to attracting, developing, engaging and retaining the best people from around the world to sustain and grow our science and technology leadership.  Our human capital strategy spans multiple key dimensions, including culture, governance, recruitment, engagement, competitive compensation and benefits, performance management, talent development, and career mobility.\nResearch and Development\nVeralto conducts R&D activities for the purpose of developing new products, enhancing the functionality, effectiveness, ease of use and reliability of its existing products and expanding the applications for which uses of its products are appropriate.  Veralto conducts R&D activities primarily in North America, Europe and Asia and generally on a business-by-business basis.  Veralto anticipates that it will continue to make significant expenditures \n8\nfor R&D as it seeks to provide a continuous flow of innovative products and services to maintain and improve its competitive position.  For a discussion of the risks related to the need to develop and commercialize new products and product enhancements, refer to “Item 1A. Risk Factors.” \nGovernment Contracts\nAlthough the substantial majority of Veralto’s revenue in 2024 was from customers other than governmental entities, Veralto has agreements relating to the sale of products to government entities.  As a result, Veralto is subject to various statutes and regulations that apply to companies doing business with governments.  For a discussion of risks related to government contracting requirements, refer to “Item 1A. Risk Factors.” No material portion of Veralto’s business is subject to renegotiation of profits or termination of contracts at the election of a government entity.\nRegulatory Matters\nVeralto faces extensive government regulation both within and outside the United States relating to the development, manufacture, marketing, sale and distribution of its products and services.  The following sections describe certain significant regulations that Veralto is subject to.  These are not the only regulations that Veralto’s businesses must comply with.  For a description of the risks related to the regulations that Veralto’s businesses are subject to, refer to “Item 1A. Risk Factors.”\nData Privacy and Security Laws\nAs a global organization, we are subject to data privacy and security laws, regulations, and customer-imposed controls in numerous jurisdictions as a result of having access to and processing confidential, personal and/or sensitive data in the course of our business.  For example, the European Union’s General Data Protection Regulation (“GDPR”) imposes significant restrictions on how we collect, transmit, process and retain personal data, including, among other things, in certain circumstances a requirement for almost immediate notice of data breaches to supervisory authorities with significant fines for non-compliance.  State privacy laws in California impose some of the same features as the GDPR and have prompted several other states to enact similar laws.  Additionally, a bipartisan bill under consideration in Congress would, if adopted, impose broad privacy requirements at the federal level.  Several other countries such as China and Russia have passed, and other countries are considering passing, privacy laws that require personal data relating to their citizens to be maintained on local servers or impose significant restrictions on data transfer.  For a discussion of risks related to these laws, refer to “Item 1A. Risk Factors.”\nEnvironmental Laws and Regulations\nVeralto’s operations, products and services are subject to numerous U.S. federal, state, local and non-U.S. environmental, health and safety laws and regulations concerning, among other things, the health and safety of our employees, the generation, storage, use and transportation of hazardous materials, emissions or discharges of substances into the environment, investigation and remediation of hazardous substances or materials at various sites, chemical constituents in products and end-of-life disposal and take-back programs for products sold.  A number of Veralto’s operations involve the handling, manufacturing, use or sale of substances that are or could be classified as hazardous materials within the meaning of applicable laws.  Compliance with these laws and regulations has not had and, based on current information and the applicable laws and regulations currently in effect, is not expected to have a material effect on Veralto’s capital expenditures, earnings or competitive position, and Veralto does not anticipate material capital expenditures for environmental control facilities. \nIn addition to environmental compliance costs, Veralto from time to time incurs costs related to remedial efforts or alleged environmental damage associated with past or current waste disposal practices or other hazardous materials handling practices.  Veralto may also from time to time become party to personal injury, property damage or other claims brought by private parties alleging injury or damage due to the presence of, or exposure to, hazardous substances.  If Veralto determines that potential liability for a particular site or with respect to a personal injury claim is known or considered probable and reasonably estimable, Veralto accrues the total estimated loss, including investigation and remediation costs, associated with the site or claim.  For a discussion of risks related to compliance with environmental and health and safety laws and risks related to past or future releases of, or exposures to, hazardous substances, refer to “Item 1A. Risk Factors.”\nAntitrust Laws\nThe U.S. federal government, most U.S. states and many other countries have laws that prohibit certain types of conduct deemed to be anti-competitive.  Violations of these laws can result in various sanctions, including criminal \n9\nand civil penalties.  Private plaintiffs also could bring civil lawsuits against us in the United States for alleged antitrust law violations, including claims for treble damages.\nExport/Import Compliance\nVeralto is required to comply with various U.S. export/import control and economic sanctions laws, including:\n•\nthe International Traffic in Arms Regulations administered by the U.S. Department of State, Directorate of Defense Trade Controls, which, among other things, imposes license requirements on the export from the United States of defense articles and defense services listed on the U.S. Munitions List;\n•\nthe Export Administration Regulations administered by the U.S. Department of Commerce, Bureau of Industry and Security, which, among other things, impose licensing requirements on the export, in-country transfer and re-export of certain dual-use goods, technology and software (which are items that have both commercial and military or proliferation applications);\n•\nthe regulations administered by the U.S. Department of Treasury, Office of Foreign Assets Control, which implement economic sanctions imposed against designated countries, governments and persons based on United States foreign policy and national security considerations; and\n•\nthe import regulatory activities of the U.S. Customs and Border Protection and other U.S. government agencies.\nOther nations’ governments have implemented similar export/import control and economic sanction regulations, which may affect Veralto’s operations or transactions subject to their jurisdictions.\nIn addition, under U.S. laws and regulations, U.S. companies and their subsidiaries and affiliates outside the United States are prohibited from participating or agreeing to participate in unsanctioned foreign boycotts in connection with certain business activities, including the sale, purchase, transfer, shipping or financing of goods or services within the United States or between the United States and other countries.  If we, or third parties through which we sell or provide goods or services, violate anti-boycott laws and regulations, we may be subject to civil or criminal enforcement action and varying degrees of liability.\nFor a discussion of risks related to export/import control and economic sanctions laws, refer to “Item 1A. Risk Factors.”\nInternational Operations\nVeralto’s products and services are available worldwide, and its principal markets outside the United States are in Europe, Asia and Latin America.  In 2024, Veralto generated 48% of its sales in North America, 22% of its sales in Western Europe, 2% of its sales in other developed markets and 28% of its sales in high-growth markets.\nOur geographic diversity allows Veralto to draw on the skills of a worldwide workforce, provides greater stability to its operations, allows Veralto to drive economies of scale, provides revenue streams that may help offset economic trends that are specific to individual economies and offers Veralto an opportunity to access new markets for products.  In addition, Veralto believes that future growth depends in part on its ability to continue developing products and sales models that successfully target high-growth markets.\nThe manner in which Veralto’s products and services are sold outside the United States differs by business and by region.  Most of Veralto’s sales in non-U.S. markets are made by its subsidiaries located outside the United States, though Veralto also sells directly from the United States into non-U.S. markets through various representatives and distributors and, in some cases, directly.  In countries with low sales volumes, Veralto generally sells through representatives and distributors.\nInformation about the effects of foreign currency fluctuations on Veralto’s business is set forth in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in this annual report.  For a discussion of risks related to Veralto’s non-U.S. operations and foreign currency exchange, refer to “Item 1A. Risk Factors.”\nProperties\nOur corporate headquarters is located in Waltham, Massachusetts in a facility that we lease.  As of December 31, 2024, Veralto had facilities in approximately 50 countries, including approximately 58 principal administrative, sales, research and development, manufacturing and distribution facilities.  22 of these facilities are located in the United \n10\nStates in 12 states and 36 are located outside the United States, primarily in Europe and to a lesser extent in Latin America, Asia and Canada.  Refer to Note 8 to the audited Consolidated and Combined Financial Statements included in this annual report for additional information with respect to our lease commitments.  Veralto does not believe that any individual lease agreement is material to the Company as a whole.\nLegal Proceedings\nWe are, from time to time, subject to a variety of litigation and other legal and regulatory proceedings and claims incidental to our business.  Based upon our experience, current information and applicable law, we do not believe that these proceedings and claims will have a material effect on our business and financial statements.  Refer to Note 16 to the audited Consolidated and Combined Financial Statements included in this annual report for additional information.",
  "item7": "ITEM 7.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations (“MD&A”) is designed to provide material information relevant to an assessment of the Company’s financial condition and results of operations, including an evaluation of the amounts and certainty of cash flows from operations and from outside sources.  The MD&A is designed to focus specifically on material events and uncertainties known to management that are reasonably likely to cause reported financial information not to be necessarily indicative of future operating results or of future financial condition.  This includes descriptions and amounts of matters that have had a material impact on reported operations, as well as matters that are reasonably likely based on management’s assessment to have a material impact on future operations.\nThis MD&A is designed to provide a reader of the accompanying financial statements with a narrative from the perspective of management.  The MD&A is divided into seven sections:\n•\nBasis of Presentation\n•\nOverview\n•\nResults of Operations\n•\nFinancial Instruments and Risk Management\n•\nLiquidity and Capital Resources\n•\nCritical Accounting Estimates\n•\nNew Accounting Standards\nThe following MD&A should be read together with Part I, “Item 1A. Risk Factors” and the accompanying Consolidated and Combined Financial Statements and Notes to Consolidated and Combined Financial Statements (“Notes”) included in Item 8. of this Form 10-K.  The MD&A generally discusses 2024 and 2023 items and year-over-year comparisons between 2024 and 2023.  Discussions of 2022 items and year-over-year comparisons between 2023 and 2022 are not included, and can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” (“MD&A”) in Part II, Item 7 of the Company’s Annual Report on Form 10-K filed for the fiscal year ended December 31, 2023 with the Securities and Exchange Commission on February 28, 2024.  The MD&A includes forward-looking statements.  For a discussion of important factors that could cause actual results to differ materially from the results referred to in these forward-looking statements, see “Information Relating to Forward-Looking Statements.”\nBASIS OF PRESENTATION\nThe accompanying Consolidated and Combined Financial Statements present the historical financial position, results of operations, changes in equity and cash flows of the Company in accordance with generally accepted accounting principles in the United States (“GAAP”).  Prior to the Separation from Danaher Corporation (“Danaher” or “Former Parent”) on September 30, 2023, Veralto businesses were comprised of certain Danaher operating units.  Veralto Corporation and the Veralto Businesses (including the periods prior to the Separation) are collectively referred to as “Veralto” or the “Company” herein.\nThe Combined Financial Statements for periods prior to the Separation were derived from Danaher’s consolidated financial statements and accounting records and prepared in accordance with GAAP for the preparation of carved-out combined financial statements.  Prior to the Separation, all revenues and costs as well as assets and liabilities directly associated with Veralto have been included in the Combined Financial Statements.  Additionally, the Combined Financial Statements for periods prior to the Separation included allocations of certain general, administrative, sales and marketing expenses and cost of sales from Danaher’s corporate office and from other Danaher businesses to Veralto, and allocations of related assets, liabilities, and the Former Parent’s investment, as applicable.  The allocations were determined on a reasonable basis; however, the amounts are not necessarily representative of the amounts that would have been reflected in the financial statements had the Company been an entity that operated independently of Danaher during the applicable periods.  Accordingly, the Consolidated and Combined Financial Statements may not be indicative of Veralto’s results had the Company been a separate stand-alone entity throughout the periods presented.  For further discussion of related party allocations prior to the \n30\nTable of Contents\nSeparation, including the method for such allocation, refer to Note 18 to the Consolidated and Combined Financial Statements.\nFollowing the Separation, the Consolidated Financial Statements include the accounts of Veralto and those of the Company’s wholly-owned subsidiaries and no longer include any allocations from Danaher.\nOVERVIEW\nGeneral\nRefer to “Item 1. Business” for a discussion of Veralto’s strategic objectives and methodologies for delivering long-term shareholder value.  Veralto is a multinational business with global operations.  During 2024, approximately 55% of Veralto’s sales were derived from customers outside the United States.  As a diversified, global business, Veralto’s operations are affected by worldwide, regional and industry-specific economic and political factors.  Veralto’s geographic and industry diversity, as well as the range of its products and services, help limit the impact of any one industry or the economy of any single country on its consolidated operating results.  The Company’s individual businesses monitor key competitors and customers, including to the extent possible their sales, to gauge relative performance and the outlook for the future.\nAs a result of the Company’s geographic and industry diversity, the Company faces a variety of opportunities and challenges, including rapid technological development in most of the Company’s served markets, the expansion and evolution of high-growth markets, trends and costs associated with a global labor force, consolidation of the Company’s competitors and increasing regulation.  The Company operates in a highly competitive business environment in most markets, and the Company’s long-term growth and profitability will depend in particular on its ability to identify, consummate and integrate appropriate acquisitions and identify and consummate appropriate investments and strategic partnerships, develop innovative and differentiated new products and services with higher gross profit margins, expand and improve the effectiveness of the Company’s sales force, continue to reduce costs and improve operating efficiency and quality, effectively address the demands of an increasingly regulated global environment and expand its business in high-growth geographies and high-growth market segments.  The Company is making significant investments, organically and through acquisitions and investments, to address the rapid pace of technological change in its served markets and to globalize its manufacturing, research and development and customer-facing resources to be responsive to the Company’s customers throughout the world and improve the efficiency of the Company’s operations.  The Company defines high-growth markets as developing markets of the world which include Asia (with the exception of Japan, Australia and New Zealand), Latin America (including Mexico), the Middle East, Eastern Europe and Africa.  The Company defines developed markets as all markets of the world that are not high-growth markets.\nBusiness Performance\nThe Company’s overall revenues for the year ended December 31, 2024 increased 3.4% as compared to 2023.  Core sales for the year ended December 31, 2024 increased 3.7% as compared to 2023.  Currency exchange rates decreased reported sales by 0.3%.  For the definition of “core sales,” refer to “—Results of Operations” below.  \nGeographically, the Company’s sales during 2024 in developed markets increased year-over-year by 4.6% driven by increased sales of 5.9% in North America and 2.6% in Western Europe while high-growth markets were flat, primarily driven by year-over-year sales increases in the majority of countries within the high-growth markets offset by low double digit sales declines in China due to lower demand.\nThe Company’s core sales during 2024 in developed markets increased 4.2% year-over-year driven by a 5.3% increase in North America and a 2.2% increase in Western Europe.  Core sales in high-growth markets increased 2.5% driven by high-single digit increases in Latin America partially offset by mid-single digit decreases in China.\nNet earnings for the year ended December 31, 2024 totaled approximately $833 million, or $3.34 per diluted common share, compared to approximately $839 million, or $3.40 per diluted common share, for the year ended December 31, 2023.  The decrease in net earnings in 2024 as compared to 2023 was driven by higher operating expenses, standalone public company costs and interest expense post separation from Danaher.  Refer to “—Results of Operations” for further discussion of the year-over-year changes in net earnings for the year ended December 31, 2024.   \nOutlook\nThe Company anticipates 2025 results will be driven by the following expectations in each of the Company’s reportable segments:\n31\nTable of Contents\n•\nWater Quality: the Company expects continued year-over-year growth driven by on-going strong demand for industrial water treatment, particularly in North America, with steady demand across municipal end-markets in North America and Europe, partially offset by continued weakness in China.\n•\nProduct Quality & Innovation: the Company expects continued year-over-year growth driven by improved demand in the consumer packaged goods market globally.\nThe Company has access to capital resources and continues to focus on profitability improvements and leveraging Veralto Enterprise System (“VES”) to manage the anticipated impact of the challenging macroeconomic environment on business operations. \nThe Company’s outlook for 2025 reflects our current visibility and expectations based on current market factors.  Our ability to meet our expectations are subject to numerous risks, including, but not limited to, those described in “Item 1A. Risk Factors” within this annual report.\nAcquisitions and Strategic Investments\nOn October 4, 2024, the Company completed its acquisition of Information Exchange Holdings, Inc., the holding company that owns TraceGains, for $349 million, net of cash acquired.  The Company believes this business complements the PQI segment, specifically the packaging and color solutions business.  TraceGains is a leading provider of cloud-based software solutions that enable connected data and digital workflow management to help consumer brands meet increasingly stringent compliance and reporting regulations for food and beverage safety and traceability.  Its solutions enable consumer brands to efficiently track ingredient inputs, monitor supplier quality and develop new products with greater safety and increased velocity.\nOn November 12, 2024, the Company completed an investment of CAD $20 million to establish a minority interest in Axine Water Technologies (“Axine”), a leading provider of electrochemical oxidation technology for contaminant destruction.  Axine's electraCLEAR\nTM\n solution provides simple, safe, efficient, and cost-effective destruction of organic contaminants in pharmaceuticals and industrial wastewater, including long- and short-chain PFAS.  The strategic collaboration with Axine builds upon Veralto's diverse portfolio of water solutions for customers in the Company’s WQ segment. \nRefer to Note 2 to the Consolidated and Combined Financial Statements for discussion regarding the Company’s acquisitions.\nPublic Company Expenses\nAs a result of the Separation, the Company is subject to the Sarbanes-Oxley Act and reporting requirements of the Securities Exchange Act of 1934, as amended (the “Exchange Act”).  The Company is now required to have additional procedures and practices as a separate public company.  As a result, the Company has incurred and will continue to incur additional personnel and corporate governance costs, such as internal and external audit, investor relations, stock administration and regulatory compliance costs.\nRESULTS OF OPERATIONS\nNon-GAAP Measures\nIn this report, references to the non-GAAP measure of core sales refer to sales from continuing operations calculated according to GAAP but excluding:\n•\nsales from acquired or divested businesses (as defined below, as applicable); and\n•\nthe impact of currency translation.\nReferences to sales or operating profit attributable to acquisitions or acquired businesses refer to sales or operating profit, as applicable, from acquired businesses recorded prior to the first anniversary of the acquisition less any sales and operating profit, during the applicable period, attributable to divested product lines not considered discontinued operations.  The portion of revenue attributable to currency translation is calculated as the difference between:\n•\nthe period-to-period change in revenue (excluding sales from acquired/divested businesses (as defined above, as applicable)); and\n32\nTable of Contents\n•\nthe period-to-period change in revenue (excluding sales from acquired/divested businesses (as defined above, as applicable)) after applying current period foreign exchange rates to the prior year period.\nCore sales growth should be considered in addition to, and not as a replacement for or superior to, sales growth, and may not be comparable to similarly titled measures reported by other companies.  Management believes that reporting these non-GAAP financial measures provides useful information to investors by helping identify underlying growth trends in the Company’s business and facilitating comparisons of the Company’s revenue performance with its performance in prior and future periods and to the Company’s peers.  Management also uses these non-GAAP financial measures to measure the Company’s operating and financial performance and uses core sales growth as one of the performance measures in the Company’s executive short-term cash incentive program.  The Company excludes the effect of currency translation from these measures because currency translation is not under management’s control, is subject to volatility, and can obscure underlying business trends. In addition, the Company excludes the effect of acquisitions and divestiture-related items because the nature, size, timing and number of acquisitions and divestitures can vary dramatically from period-to-period and between the Company and its peers, and can also obscure underlying business trends making comparisons of long-term performance difficult.\nThroughout this discussion, references to sales growth or decline refer to the impact of both price and unit sales and references to productivity improvements generally refer to improved cost efficiencies resulting from the ongoing application of VES.\nSales Growth and Core Sales Growth\n2024 vs. 2023\n2023 vs. 2022\nTotal sales growth GAAP\n3.4 \n%\n3.1 \n%\nImpact of:\nAcquisitions/divestitures\n— \n%\n(0.3)\n%\nCurrency exchange rates \n0.3 \n%\n(0.2)\n%\nCore sales growth (non-GAAP)\n3.7 \n%\n2.6 \n%\n2024 Sales Compared to 2023\nTotal sales increased 3.4% on a year-over-year basis during 2024 as compared to 2023 primarily as a result of a 3.7% increase in core sales resulting from the factors discussed below by segment.  Currency exchange rates decreased reported sales by 0.3% during 2024 as compared to 2023.  The impact of acquisitions was flat on a year-over-year basis during 2024 as compared to 2023.   \nPrice increases contributed 1.8% to sales growth on a year-over-year basis during 2024 as compared to 2023 and is reflected as a component of core sales growth above.\nBusiness Segments\nSales by business segment for the years ended December 31 are as follows:\n($ in millions)\n2024\n2023\n2022\nWater Quality\n$\n3,138 \n$\n3,039 \n$\n2,887 \nProduct Quality & Innovation\n2,055 \n1,982 \n1,983 \nTotal\n$\n5,193 \n$\n5,021 \n$\n4,870 \nSales and operating profit at the business segment level are discussed in detail below.  For information regarding the Company’s sales by geographical region, refer to Note 4 to the Consolidated and Combined Financial Statements.\n33\nTable of Contents\nCost of Sales and Gross Profit\n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n5,193 \n$\n5,021 \n$\n4,870 \nCost of sales\n(2,088)\n(2,120)\n(2,110)\nGross profit\n$\n3,105 \n$\n2,901 \n$\n2,760 \nGross profit margin\n59.8 \n%\n57.8 \n%\n56.7 \n%\nCost of sales decreased $32 million, or 1.5%, on a year-over-year basis during 2024 as compared to 2023 primarily due to the impact of lower year-over-year material costs.\nGross profit margins increased 200 basis points on a year-over-year basis during 2024 as compared to 2023, driven by positive pricing actions and higher volume as discussed below and to a lesser extent lower material costs, and the impacts from foreign currency exchange rates.\nOperating Expenses\n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n5,193 \n$\n5,021 \n$\n4,870 \nSelling, general and administrative (“SG&A”) expenses\n(1,644)\n(1,536)\n(1,431)\nResearch and development (“R&D”) expenses\n(253)\n(225)\n(217)\nSG&A as a % of sales\n31.7 \n%\n30.6 \n%\n29.4 \n%\nR&D as a % of sales\n4.9 \n%\n4.5 \n%\n4.5 \n%\nSG&A expenses as a percentage of sales increased 110 basis points on a year-over-year basis during 2024 as compared to 2023 primarily due to select investments in sales and marketing growth initiatives, as well as the costs to operate as a stand-alone company.\nR&D expenses as a percentage of sales increased by 40 basis points on a year-over-year basis during 2024 as compared to 2023 driven by growth related R&D initiatives.\nOperating Profit Performance\nOperating profit margins were 23.3% for the year ended December 31, 2024 as compared to 22.7% in 2023.  The following factors impacted year-over-year operating profit margin comparisons.\n2024 vs. 2023 operating profit margin comparisons were favorably impacted by:\n•\nThe impact of Argentine Peso devaluation on operations within the Product Quality & Innovation segment during 2023 - 60 basis points\n•\n2023 impairment charge related to customer relationships and a trade name in the Product Quality and Innovation segment -  20 basis points\n•\nOne-time costs incurred in 2023 as a result of the Separation from Danaher - 10 basis points  \n2024 vs. 2023 operating profit margin comparisons were unfavorably impacted by:\n•\nThe net dilutive impact of 2024 acquisitions and dispositions  - 10 basis points\n•\nThe impact of incremental costs associated with operating as a stand-alone company, labor, R&D growth initiatives, and sales and marketing growth initiatives partially offset by higher 2024 core sales, foreign currency exchange rates, lower material costs and cost savings associated with continuing productivity improvement initiatives - 20 basis points\n34\nTable of Contents\nWATER QUALITY\nThe Company’s Water Quality segment provides proprietary precision instrumentation, consumables, software, services and advanced water treatment technologies to help measure, analyze and treat the world’s water in municipal, industrial, commercial, residential, research and natural resource applications. \nWater Quality Selected Financial Data \n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n3,138 \n$\n3,039 \n$\n2,887 \nOperating profit\n768 \n730 \n668 \nDepreciation \n25 \n24 \n24 \nAmortization of intangible assets\n16 \n21 \n22 \nOperating profit as a % of sales\n24.5 \n%\n24.0 \n%\n23.1 \n%\nDepreciation as a % of sales\n0.8 \n%\n0.8 \n%\n0.8 \n%\nAmortization as a % of sales\n0.5 \n%\n0.7 \n%\n0.8 \n%\nSales Growth and Core Sales Growth\n2024 vs. 2023\n2023 vs. 2022\nTotal sales growth GAAP\n3.2 \n%\n5.3 \n%\nImpact of:\nAcquisitions/divestitures\n0.3 \n%\n— \n%\nCurrency exchange rates \n0.4 \n%\n(0.2)\n%\nCore sales growth (non-GAAP)\n3.9 \n%\n5.1 \n%\n2024 Sales Compared to 2023 \nTotal Water Quality segment sales increased 3.2% on a year-over-year basis during 2024 as compared to 2023\n primarily as a result of core sales growth driven by the factors discussed belo\nw.  Currency exchange rates and the impact of divestitures decreased reported sales by 0.4% and 0.3%, respectively, during 2024 as compared to 2023.  Geographically, the increase in reported sales was driven by an increase of 6.5% in North America, partially offset by a decrease of 2.8% in high-growth markets.\nPrice increases in the segment contributed \n2.1%\n to sales growth on a year-over-year basis during 2024 as compared to 2023 and are reflected as a component of the change in core sales growth.\nCore sales in the Water Quality segment increased 3.9% on a year-over-year basis during 2024 as compared to 2023.  Geographically, core sales growth was driven by increases of 6.2% in North America and 2.2% in Western Europe.  Core sales were flat in high-growth markets, as a mid-single digits core sales increase in Latin America was mostly offset by a high-single digit percentage core sales decline in China.\nThe increase in core sales was driven primarily by the chemical treatment solutions business and to a lesser extent by the analytical instrumentation business, and the ultraviolet water disinfection and filtration business.  Year-over-year core sales in the chemical treatment solutions business increased 7.2% as a result of higher core sales across most major end-markets.  Core sales in the analytical instrumentation business increased 2.9% as a result of increased core sales across North America and Western Europe.  Core sales in the ultraviolet water disinfection and filtration business increased 1.5% in 2024, driven primarily by the municipal end-market.\nOperating Profit Performance\nOperating profit margins were 24.5% for the year ended December 31, 2024 as compared to 24.0% in 2023.  The following factors impacted year-over-year operating profit margin comparisons:\n2024 vs. 2023 operating profit margin comparisons were favorably impacted by:\n•\nHigher 2024 core sales and incremental year-over-year cost savings associated with material costs, net of the impact of incremental year-over-year costs associated with labor and sales and marketing growth initiatives - 40 basis points\n35\nTable of Contents\n•\nOne-time costs incurred in 2023 as a result of the Separation from Danaher - 10 basis points\nPRODUCT QUALITY & INNOVATION\nThe Company’s Product Quality & Innovation segment provides equipment, consumables, software and services for various marking and coding, traceability, printing, packaging design and quality management, packaging converting and color and appearance management applications for consumer-packaged goods and industrial products. \nProduct Quality & Innovation Selected Financial Data \n \nYear Ended December 31\n($ in millions)\n2024\n2023\n2022\nSales\n$\n2,055 \n$\n1,982 \n$\n1,983 \nOperating profit\n529 \n472 \n488 \nDepreciation \n14 \n15 \n16 \nAmortization of intangible assets\n22 \n27 \n28 \nOperating profit as a % of sales\n25.7 \n%\n23.8 \n%\n24.6 \n%\nDepreciation as a % of sales\n0.7 \n%\n0.8 \n%\n0.8 \n%\nAmortization as a % of sales\n1.1 \n%\n1.4 \n%\n1.4 \n%\nSales Growth and Core Sales Growth (Decline)\n2024 vs. 2023\n2023 vs. 2022\nTotal sales growth GAAP\n3.7 \n%\n— \n%\nImpact of:\nAcquisitions/divestitures\n(0.4)\n%\n(0.7)\n%\nCurrency exchange rates \n— \n%\n(0.3)\n%\nCore sales growth (decline) (non-GAAP)\n3.3 \n%\n(1.0)\n%\n2024 Sales Compared to 2023 \nTotal Product Quality & Innovation segment sales increased 3.7% on a year-over-year basis during 2024 as compared to 2023\n primarily as a result of core sales growth driven by the factors discussed below.  \nThe impact of acquisitions increased reported sales by 0.4% during 2024 as compared to 2023.  Geographically, reported sales increased by 4.5% in North America, 3.3% in Western Europe, and 4.0% in high-growth markets.\nPrice increases in the segment contributed 1.4% to sales growth on a year-over-year basis during 2024 as compared to 2023 and are reflected as a component of the change in core sales growth.\nCore sales in the Product Quality & Innovation segment increased 3.3% on a year-over-year basis during 2024 as compared to 2023.  Geographically, core sales growth was driven by increases of 3.0% in North America, 5.1% in high-growth markets, and 2.3% in Western Europe. Core sales growth in the high-growth markets was driven by high-single digit core sales increases in Latin America and mid-single digit core sales increases in China. \nFrom a product line perspective, core sales in the marking and coding business increased 2.8% on a year-over-year basis during 2024 as compared to 2023 driven by higher consumable demand in the industrial and consumer packaged goods end-markets. Core sales in the packaging and color solutions business increased 4.5% on a year-over-year basis during 2024 as compared to 2023 driven by increased demand across the consumer-packaged goods and industrial end-markets.\nOperating Profit Performance\nOperating profit margins were 25.7% for the year ended December 31, 2024 as compared to 23.8% in 2023.  The following factors impacted year-over-year operating profit margin comparisons.\n2024 vs. 2023 operating profit margin comparisons were favorably impacted by:\n•\nThe impact of Argentine Peso devaluation on operations during 2023 - 140 basis points\n•\n2023 impairment charge related to customer relationships and a trade name - 60 basis points\n36\nTable of Contents\n•\nOne-time costs incurred in 2023 as a result of the Separation from Danaher - 10 basis points\n•\nHigher 2024 core sales, foreign currency exchange rates and cost savings associated with continuing productivity improvement initiatives, partially offset by incremental labor and sales and marketing growth initiatives - 30 basis points\n2024 vs. 2023 operating profit margin comparisons were unfavorably impacted by:\n•\nCosts incurred during 2024 related to certain strategic initiatives  - 20 basis points\n•\nThe net dilutive impact of 2024 acquisitions and dispositions - 30 basis points\nOTHER INCOME (EXPENSE), NET\nFor a description of the Company’s other income (expense), net during the years ended December 31, 2024 and 2023, refer to Note 7 to the accompanying Consolidated and Combined Financial Statements. \nINTEREST COSTS AND FINANCING\nFor a discussion of the Company’s outstanding indebtedness, refer to Note 12 to the accompanying Consolidated and Combined Financial Statements. \nNet interest expense was $113 million during 2024 as compared to $30 million in 2023, arising from the Company’s outstanding indebtedness, which was incurred in September 2023.  Before the Separation, Veralto depended on Danaher for all of its working capital and financing requirements under Danaher’s centralized approach to cash management and financing of operations of its subsidiaries.  As a result, with the exception of cash, cash equivalents and borrowings clearly associated with Veralto and related to the Separation, the Company recorded no interest expense in the Combined Condensed Financial Statements for periods prior to the Separation.\nINCOME TAXES\nGeneral\nIncome tax expense and deferred tax assets and liabilities reflect management’s assessment of future taxes expected to be paid on items reflected in the Company’s Consolidated and Combined Financial Statements.  The Company records the tax effect of discrete items and items that are reported net of their tax effects in the period in which they occur. \nThe Company’s effective tax rate can be impacted by changes in the mix of earnings in countries with different statutory tax rates, changes in the valuation of deferred tax assets and liabilities, accruals related to contingent tax liabilities and period-to-period changes in such accruals, the results of audits and examinations of previously filed tax returns (as discussed below), the expiration of statutes of limitations, the implementation of tax planning strategies, tax rulings, court decisions, and changes in tax laws and regulations, and legislative policy changes.  For a description of the tax treatment of earnings that are planned to be reinvested indefinitely outside the United States, refer to “Liquidity and Capital Resources” below. \nThe following table summarizes the Company’s effective tax rate:\nYear Ended December 31\n2024\n2023\n2022\nEffective tax rate\n23.3 \n%\n23.4 \n%\n24.1 \n%\nThe Company’s effective tax rate for 2024 differs from the U.S. federal statutory rate of 21.0% due principally to the Company’s earnings outside the United States that are taxed at rates different than the U.S. federal statutory rate, and state taxes, partially offset by a net discrete tax provision of $6 million.  The net discrete tax provision related primarily to changes in estimates associated with prior period uncertain tax positions and audit settlements offset by excess tax benefits from stock-based compensation.\nThe Company’s effective tax rate for 2023 differs from the U.S. federal statutory rate of 21.0% due principally to the Company’s earnings outside the United States that are taxed at rates different than the U.S. federal statutory rate, and state taxes, partially offset by net discrete tax benefits of $12 million.  The net discrete tax benefits related primarily to excess tax benefits from stock-based compensation.\n37\nTable of Contents\nThe Company’s effective tax rate for 2022 differs from the U.S. federal statutory rate of 21.0% due principally to the Company’s earnings outside the United States that are taxed at rates different than the U.S. federal statutory rate, and state taxes, partially offset by net discrete tax benefits of $4 million.  The net discrete tax benefits related primarily to excess tax benefits from stock-based compensation, partially offset by changes in estimates associated with prior period uncertain tax positions and audit settlements. \nThe Company conducts business globally, and the Former Parent filed numerous consolidated and separate income tax returns in the U.S. federal and state and non-U.S. jurisdictions.  The non-U.S. countries in which the Company has a significant presence include Belgium, Brazil, Canada, China, Germany, the Netherlands and the United Kingdom.  Excluding these non-U.S. jurisdictions, the Company believes that a change in the statutory tax rate of any individual non-U.S. country would not have a material effect on the Company’s Consolidated and Combined Financial Statements given the geographic dispersion of the Company’s income. \nThe Company is routinely examined by various domestic and international taxing authorities.  In connection with the Separation, the Company entered into certain agreements with Danaher, including a tax matters agreement.  The tax matters agreement distinguishes between the treatment of tax matters for “Joint” filings compared to “Separate” filings prior to the Separation.  “Joint” filings involve legal entities, such as those in the United States, that include operations from both Danaher and the Company.  By contrast, “Separate” filings involve certain entities (primarily outside of the United States) that exclusively include either Danaher’s or the Company’s operations, respectively.  In accordance with the tax matters agreement, Danaher is liable for and has indemnified the Company against all income tax liabilities involving “Joint” filings for periods prior to the Separation.  The Company remains liable for certain pre-Separation income tax liabilities including those related to the Company’s “Separate” filings. \nThe amount of income taxes the Company pays is subject to ongoing audits by federal, state and foreign tax authorities, which often result in proposed assessments.  Management performs a comprehensive review of its global tax positions on a quarterly basis.  Based on these reviews, the results of discussions and resolutions of matters with certain tax authorities, tax rulings and court decisions and the expiration of statutes of limitations, reserves for contingent tax liabilities are accrued or adjusted, as necessary.  For a discussion of risks related to these and other tax matters, refer to “Item 1A. Risk Factors”. \nCOMPREHENSIVE INCOME\nComprehensive income decreased by $123 million in 2024 as compared to 2023, primarily driven by losses from foreign currency translation adjustments partially offset by unrealized gains on a net investment hedge, and to a lesser extent, pension and post-retirement plan benefit adjustments.  The Company recorded a foreign currency translation loss of $139 million in 2024 primarily driven by the strengthening of the U.S. dollar against most major currencies in the period compared to a gain of $29 million in 2023 primarily driven by the weakening of the U.S. dollar against most major currencies in the period.  The Company recorded a pension and postretirement plan benefit loss of $4 million in 2024 compared to a loss of $15 million in 2023.  The Company recorded a gain from net investment hedge adjustments related to the Company’s long-term debt in 2024 of $26 million compared to a loss of $14 million in 2023.\nFINANCIAL INSTRUMENTS AND RISK MANAGEMENT\nThe Company is exposed to market risk from changes in interest rates, foreign currency exchange rates, and commodity prices as well as credit risk, each of which could impact its Consolidated and Combined Financial Statements.  The Company generally addresses its exposure to these risks through its normal operating and financing activities.  The Company may also use derivative financial instruments to manage foreign exchange risks and interest rate risks.  In addition, the Company’s broad-based business activities help to reduce the impact that volatility in any particular area or related areas may have on its financial statements as a whole.\nInterest Rate Risk\nThe Company manages interest cost using a mixture of fixed-rate and at times variable-rate debt.  A change in interest rates on fixed-rate debt impacts the fair value of the debt but not the Company’s earnings or cash flow because the interest on such debt is fixed.  Generally, the fair market value of fixed-rate debt will increase as interest rates fall and decrease as interest rates rise.  As of December 31, 2024, an increase of 100 basis points in interest rates would have decreased the fair value of the Company’s fixed-rate long-term debt by approximately $112 million.\n38\nTable of Contents\nCurrency Exchange Rate Risk\nThe Company faces transactional exchange rate risk from transactions with customers in countries outside the United States and from intercompany transactions between affiliates.  Transactional exchange rate risk arises from the purchase and sale of goods and services in currencies other than the Company’s functional currency or the functional currency of its applicable subsidiary.  The Company also faces translational exchange rate risk related to the translation of financial statements of its foreign operations into U.S. dollars, the Company’s functional currency.  Costs incurred and sales recorded by subsidiaries operating outside of the United States are translated into U.S. dollars using exchange rates effective during the respective period.  As a result, the Company is exposed to movements in the exchange rates of various currencies against the U.S. dollar.  In particular, the Company has more sales in European currencies than it has expenses in those currencies.  Therefore, when European currencies strengthen or weaken against the U.S. dollar, operating profits are increased or decreased, respectively.  The effect of a change in currency exchange rates on the Company’s net investment in non-U.S. subsidiaries is reflected in the accumulated other comprehensive income (loss) component of equity. \nCurrency exchange rates negatively impacted 2024 reported sales on a year-over-year basis primarily due to the strengthening of the U.S. dollar against most major currencies during 2024.  Weakening of the U.S. dollar against other major currencies compared to the exchange rates in effect as of December 31, 2024 would positively impact the Company’s sales and results of operations on an overall basis.  Any further strengthening of the U.S. dollar against other major currencies compared to the exchange rates in effect as of December 31, 2024 would negatively impact the Company’s sales and results of operations.\nThe Company has generally accepted the exposure to exchange rate movements without using derivative financial instruments to manage this transactional exchange risk, although the Company has used foreign currency-denominated debt to hedge a portion of its net investments in non-U.S. operations against adverse movements in exchange rates.  Both positive and negative movements in currency exchange rates against the U.S. dollar will continue to affect the reported amount of sales and net earnings in the Company’s Consolidated and Combined Financial Statements.  In addition, the Company has assets and liabilities held in foreign currencies.  A 10% depreciation in major currencies relative to the U.S. dollar as of December 31, 2024 would have reduced foreign currency-denominated net assets and equity by approximately $118 million.  Refer to Note 13 to the Consolidated and Combined Financial Statements for information regarding the Company’s hedging of a portion of its net investment in non-U.S. operations.  \nCommodity Price Risk\nFor a discussion of risks relating to commodity prices, refer to “Item 1A. Risk Factors.”\nCredit Risk\nThe Company is exposed to potential credit losses in the event of nonperformance by counterparties to its financial instruments.  Financial instruments that potentially subject the Company to credit risk consist of cash and temporary investments, receivables from customers.  The Company places cash and temporary investments with various high-quality financial institutions throughout the world and exposure is limited at any one institution.  Although the Company typically does not obtain collateral or other security to secure these obligations, it does regularly monitor the third-party depository institutions that hold its cash and cash equivalents.  The Company’s emphasis is primarily on safety and liquidity of principal and secondarily on maximizing yield on those funds.\nIn addition, concentrations of credit risk arising from receivables from customers are limited due to the diversity of the Company’s customers.  The Company’s businesses perform credit evaluations of their customers’ financial conditions as deemed appropriate and also obtain collateral or other security when deemed appropriate.\nThe Company enters into derivative transactions infrequently and typically with high-quality financial institutions, so that exposure at any one institution is limited.\nLIQUIDITY AND CAPITAL RESOURCES\nManagement assesses the Company’s liquidity in terms of its ability to generate cash to fund its operating, investing and financing activities.  The Company continues to generate substantial cash from operating activities and believes that its operating cash flow and other sources of liquidity will be sufficient to allow it to continue to invest in existing businesses, consummate strategic acquisitions, make interest payments on its outstanding indebtedness, and manage its capital structure on a short and long-term basis.\n39\nTable of Contents\nShelf Registration Statement\nOn October 24, 2024, the Company filed a shelf registration statement on Form S-3 with the SEC (the “Shelf Registration Statement”) that registers an indeterminate amount of debt securities, common stock, preferred stock, depositary shares, subscription rights, purchase contracts, units and warrants that may be issued in the future in one or more offerings.  Unless otherwise specified in the corresponding prospectus supplement, the Company expects to use net proceeds realized from future securities issuances off the Shelf Registration Statement for general corporate purposes, including without limitation repayment or refinancing of debt or other corporate obligations, acquisitions, capital expenditures, and working capital.\n2023 Financing Transactions\nDuring 2023, the Company completed the following financing transactions:\n•\nIssued approximately $2.1 billion aggregate principal amount of senior unsecured notes in three series with maturity dates ranging from 2026 through 2033 (collectively, the “U.S. Dollar Notes”).  Additionally, the Company issued €500 million principal amount of senior unsecured notes with a maturity date of 2031 (together with the U.S. Dollar Notes, the “Private Notes”).\n•\nEntered into a credit agreement providing for a five-year unsecured revolving credit facility in an aggregate committed amount of $1.5 billion (the “Credit Facility”).  There were no outstanding amounts under the Credit Facility as of December 31, 2024.  The Credit Facility includes an alternative currency sublimit up to an amount equal to 90% of the aggregate commitments and a $100 million swingline sublimit and provides for the issuance of swing loans.  This facility provides backing for the Company’s commercial paper program, and outstanding commercial paper directly reduces borrowing capacity under the Credit Facility.  There were no amounts outstanding under the Company’s commercial paper program as of December 31, 2024.\nThese financing activities yielded net proceeds of approximately $2.6 billion, of which approximately $2.6 billion was paid to Danaher in September 2023 as consideration for the contribution of assets to Veralto by Danaher in connection with the Separation.  Refer to Note 12 of the Consolidated and Combined Financial Statements for more information related to the Company’s long-term indebtedness.\nRegistration Rights Agreement\nIn connection with the issuance of the Private Notes, the Company entered into a registration rights agreement, pursuant to which the Company was obligated to use commercially reasonable efforts to file with the SEC, and cause to be declared effective, a registration statement with respect to an offer to exchange each series of Private Notes for registered notes (the “Registered Notes”) with substantially identical terms (the “Exchange Offer”).  Accordingly, on July 26, 2024, the Company filed a Form S-4 with the SEC (the “Registration Statement”), which Registration Statement was declared effective on August 5, 2024.  On August 5, 2024, the Company launched the Exchange Offer, which expired on September 3, 2024.  Substantially all Private Notes were tendered and exchanged for Registered Notes in the Exchange Offer.\nOther\nBefore the Separation, the Company was dependent upon Danaher for all of its working capital and financing requirements under Danaher’s centralized approach to cash management and financing of operations of its subsidiaries.  Because the Company was part of Danaher during the nine-month period ended September 29, 2023, only cash, cash equivalents and borrowings clearly associated with Veralto and related to the Separation, including the financing transactions described below, were included in the Combined Financial Statements.  Other financial transactions relating to the business operations of the Company during the period were accounted for through the Net Former Parent investment account of the Company.  As a result of the Separation, the Company no longer participates in Danaher’s cash management and financing operations.  \n40\nTable of Contents\nOverview of Cash Flows and Liquidity\nFollowing is an overview of the Company’s cash flows and liquidity for the years ended December 31:\n($ in millions)\n2024\n2023\n2022\nNet cash provided by operating activities\n$\n875 \n$\n963 \n$\n870 \nCash paid for acquisitions, net of cash acquired\n$\n(363)\n$\n— \n$\n(55)\nPayments for additions to property, plant and equipment\n(55)\n(54)\n(34)\nProceeds from sales of property, plant and equipment\n— \n2 \n— \nAll other investing activities\n(16)\n(3)\n— \nNet cash used in investing activities\n$\n(434)\n$\n(55)\n$\n(89)\nProceeds from the issuance of common stock in connection with stock-based compensation\n$\n24 \n$\n4 \n$\n— \nNet transfers to Former Parent\n— \n(147)\n(781)\nConsideration paid to Former Parent in connection with Separation\n— \n(2,600)\n— \nProceeds from borrowings (maturities longer than 90 days)\n— \n2,608 \n— \nPayment of dividends\n(89)\nNet cash used in financing activities\n$\n(65)\n$\n(135)\n$\n(781)\n•\nOperating cash flows from continuing operations decreased $88 million, or 9%, during 2024 as compared to 2023, primarily due to cash interest payments of $137 million, cash tax payments of $293 million, increased operating expenses, and year-over-year increases in cash outflows related to accounts payable, prepaid expenses and other current assets partially offset by cash inflows from accrued expenses and other liabilities.\n•\nNet cash used in investing activities consisted primarily of cash paid for acquisitions and capital expenditures.  Refer to Note 2 to the Consolidated and Combined Financial Statements included in this Annual Report for a discussion of the Company’s acquisitions. \n•\nNet cash used in financing activities consisted of cash dividend payments offset by proceeds from the issuance of common stock in connection with stock-based compensation.  Net cash used in financing activities decreased $70 million from 2024 to 2023 primarily as a result of transfers to Former Parent in connection with the Separation. \nDividends\nThe Company’s board of directors authorized a quarterly dividend of $0.11 per share of Company common stock totaling $27 million that was paid \non\n January 31, 2025\n to holders of record at the close of business on\n December 31, 2024.  \nAggregate cash payments for dividends during the year ended December 31, 2024 were $89 million.  There were no dividends paid during 2023.\nCash and Cash Requirements\nAs of December 31, 2024, the Company held approximately $1.1 billion of cash and cash equivalents that were on deposit with financial institutions or invested in highly liquid investment-grade debt instruments with a maturity of 90 days or less with an approximate weighted average annual interest rate of 4.48%.  Of the cash and cash equivalents, approximately $342 million was held within the United States and approximately $759 million was held outside of the United States.  The Company will continue to have cash requirements to support general corporate purposes, which may include working capital needs, capital expenditures, acquisitions and investments, paying interest and servicing debt, paying taxes and any related interest or penalties, funding its restructuring activities and pension plans as required, paying dividends to shareholders, repurchasing shares of the Company’s common stock and supporting other business needs.  \n41\nTable of Contents\nThe Company generally intends to use available cash and internally generated funds to meet these cash requirements, but in the event that additional liquidity is required, the Company may also borrow under its commercial paper programs (if available) or borrow under the Company’s Credit Facility, enter into new credit facilities and either borrow directly thereunder or use such credit facilities to backstop additional borrowing capacity under its commercial paper programs (if available) and/or access the capital markets.  The Company also may from time to time seek to access the capital markets to take advantage of favorable interest rate environments or other market conditions.  \nRepatriation of some cash held outside the United States may be restricted by local laws.  Following enactment of the Tax Cuts and Jobs Act and the associated Transition Tax, in general, repatriation of cash to the United States can be completed with no material incremental U.S. tax; however, repatriation of cash could subject the Company to non-U.S. taxes on distributions.  The cash that the Company’s non-U.S. subsidiaries hold for indefinite reinvestment is generally used to finance foreign operations and investments, including acquisitions.  The income taxes, if any, applicable to such earnings including basis differences in Veralto’s foreign subsidiaries are not readily determinable.  As of December 31, 2024, management believes that it has sufficient sources of liquidity to satisfy its cash needs, including its cash needs in the United States. \nDuring 2024, the Company contributed $6 million to its defined benefit pension plans.  During 2025, the Company’s cash contribution requirements for its defined benefit pension plans are forecasted to be approximately $5 million.  The ultimate amounts to be contributed depend upon, among other things, legal requirements, underlying asset returns, the plan’s funded status, the anticipated tax deductibility of the contribution, local practices, market conditions, interest rates and other factors.\nContractual and Other Obligations\nFor a description of the Company’s debt and lease obligations, commitments, and litigation and contingencies, refer to Notes 8, 12, 15 and 16 to the Consolidated and Combined Financial Statements.\nLegal Proceedings\nRefer to Note 16 to the Consolidated and Combined Financial Statements for information regarding legal proceedings and contingencies, and for a discussion of risks related to legal proceedings and contingencies, refer to “Item 1A. Risk Factors.”\nThe Company’s amended and restated certificate of incorporation require it to indemnify to the full extent authorized or permitted by law any person made, or threatened to be made a party to any action or proceeding by reason of his or her service as a director or officer of the Company, or by reason of serving at the request of the Company as a director or officer of any other entity, subject to limited exceptions.  The Company’s amended and restated by-laws provide for similar indemnification rights.  While the Company maintains insurance for this type of liability, a significant deductible apply to this coverage and any such liability could exceed the amount of the insurance coverage.\nCRITICAL ACCOUNTING ESTIMATES\nManagement’s discussion and analysis of the Company’s financial condition and results of operations is based upon the Company’s Consolidated and Combined Financial Statements, which have been prepared in accordance with accounting principles generally accepted in the United States.  The preparation of these financial statements requires management to make estimates and judgments that affect the reported amounts of assets, liabilities, revenues and expenses, and related disclosure of contingent assets and liabilities.  The Company bases these estimates and judgments on historical experience, the current economic environment and on various other assumptions that are believed to be reasonable under the circumstances.  Actual results may differ materially from these estimates and judgments.\nThe Company believes the following accounting estimates are most critical to an understanding of its financial statements.  Estimates are considered to be critical if they meet both of the following criteria: (1) the estimate requires assumptions about material matters that are uncertain at the time the estimate is made, and (2) material changes in the estimate are reasonably likely from period-to-period.  For a detailed discussion on the application of these and other accounting estimates, refer to Note 1 to the Consolidated and Combined Financial Statements.\nAcquired Intangibles\n—The Company’s business acquisitions typically result in the recognition of goodwill, customer relationships, developed technology and other intangible assets, which affect the amount of future period amortization expense and possible impairment charges that the Company may incur.  The fair values of acquired intangibles are determined using information available near the acquisition date based on estimates and \n42\nTable of Contents\nassumptions that are deemed reasonable by the Company.  Significant assumptions include the discount rates and certain assumptions that form the basis of the forecasted results of the acquired business including earnings before interest, taxes, depreciation and amortization (“EBITDA”), revenue, revenue growth rates, royalty rates and technology obsolescence rates.  These assumptions are forward looking and could be affected by future economic and market conditions.  The Company engages third-party valuation specialists who review the Company’s critical assumptions and calculations of the fair value of acquired intangible assets in connection with significant acquisitions.  Refer to Notes 1, 2 and 9 to the Consolidated and Combined Financial Statements for a description of the Company’s policies relating to goodwill, acquired intangibles and acquisitions.\nIn performing its goodwill impairment testing, the Company estimates the fair value of its reporting units primarily using a market-based approach which relies on current trading multiples of forecasted EBITDA for peer companies and recent transactions for comparable companies operating in businesses similar to each of the Company’s reporting units to calculate an estimated fair value of each reporting unit.  In evaluating the estimates derived by the market-based approach, management makes judgments about the relevance and reliability of the multiples by considering factors unique to its reporting units, including operating results, business plans, economic projections, anticipated future cash flows, as well as judgments about recent market sale transactions of comparable companies and the comparability of selected peer companies.  There are inherent uncertainties related to these assumptions and management’s judgment in applying them to the analysis of goodwill impairment. \nAs of December 31, 2024, the Company had three reporting units for goodwill impairment testing.  Reporting units resulting from recent acquisitions generally present the highest risk of impairment.  Management believes the impairment risk associated with these reporting units generally decreases as these businesses are integrated into the Company and better positioned for potential future earnings growth.  The Company’s annual goodwill impairment analysis indicated that in all instances, the fair values of the Company’s reporting units exceeded their carrying values and consequently did not result in an impairment charge.  The excess of the estimated fair value over carrying value (expressed as a percentage of carrying value for the respective reporting unit) for each of the Company’s reporting units as of the annual testing date ranged from approximately 202% to approximately 991%.  To evaluate the sensitivity of the fair value calculations used in the goodwill impairment test, the Company applied a hypothetical 10% decrease to the fair values of each reporting unit and compared those hypothetical values to the reporting unit carrying values.  Based on this hypothetical 10% decrease, the excess of the estimated fair value over carrying value (expressed as a percentage of carrying value for the respective reporting unit) for each of the Company’s reporting units ranged from approximately 144% to approximately 783%. \nThe Company reviews identified intangible assets for impairment whenever events or changes in circumstances indicate that the related carrying amounts may not be recoverable.  Determining whether an impairment loss occurred for finite-lived intangibles requires a comparison of the carrying amount to the sum of undiscounted cash flows expected to be generated by the asset.  These analyses require management to make judgments and estimates about future revenues, expenses, market conditions and discount rates related to these assets.  Indefinite-lived intangibles are subject to impairment testing at least annually or more frequently if events or changes in circumstances indicate that potential impairment exists.  Determining whether an impairment loss occurred for indefinite-lived intangible assets involves calculating the fair value of the indefinite-lived intangible assets and comparing the fair value to their carrying value.  If the fair value is less than the carrying value, the difference is recorded as an impairment loss.  There were no intangible asset impairment charges recorded during 2024.  Refer to Note 9 to the Consolidated and Combined Financial Statements for a description of intangible asset impairment charges recorded during 2023.\nIf actual results are not consistent with management’s estimates and assumptions, goodwill and other intangible assets may be overstated and a charge would need to be taken against net earnings which would adversely affect the Company’s financial statements.  Historically, the Company’s estimates of goodwill and intangible assets have been materially correct.\nContingent Liabilities\n—As discussed in “Item 3.  Legal Proceedings” and Note 16 to the Consolidated and Combined Financial Statements, the Company is, from time to time, subject to a variety of litigation and similar contingent liabilities incidental to its business (or the business operations of previously owned entities).  The Company recognizes a liability for any legal contingency or contract settlement expense that is known or probable of occurrence and reasonably estimable.  These assessments require judgments concerning matters such as litigation developments and outcomes, the anticipated outcome of negotiations, the number of future claims, the cost of both pending and future claims and the value of the elements in the outcome.  In addition, because most contingencies are resolved over long periods of time, liabilities may change in the future due to various factors, including those discussed in Note 16 to the Consolidated and Combined Financial Statements.  If the reserves \n43\nTable of Contents\nestablished by the Company with respect to these contingent liabilities are inadequate, the Company would be required to incur an expense equal to the amount of the loss incurred in excess of the reserves, which would adversely affect the Company’s financial statements.  \nIncome Taxes\n—For a description of the Company’s income tax accounting policies, refer to Notes 1 and 6 to the Consolidated and Combined Financial Statements.  The Company establishes valuation allowances for its deferred tax assets if it is more likely than not that some or all of the deferred tax asset will not be realized.  This requires management to make judgments and estimates regarding: (1) the timing and amount of the reversal of taxable temporary differences, (2) expected future taxable income and (3) the impact of tax planning strategies.  Future changes to tax rates would also impact the amounts of deferred tax assets and liabilities and could have an adverse impact on the Company’s financial statements. \nThe Company provides for unrecognized tax benefits when, based upon the technical merits, it is “more likely than not” that an uncertain tax position will not be sustained upon examination.  Judgment is required in evaluating tax positions and determining income tax provisions.  The Company re-evaluates the technical merits of its tax positions and may recognize an uncertain tax benefit in certain circumstances, including when: (1) a tax audit is completed; (2) applicable tax laws change, including a tax case ruling or legislative guidance; or (3) the applicable statute of limitations expires.\nIn addition, certain of the Company’s tax returns are currently under review by tax authorities (refer to “—Results of Operations—Income Taxes” and Note 6 to the Consolidated and Combined Financial Statements).  Management believes the positions taken in these returns are in accordance with the relevant tax laws.  However, the outcome of these audits is uncertain and could result in the Company being required to record charges for prior year tax obligations which could have a material adverse impact to the Company’s financial statements, including its effective tax rate.\nCorporate Allocations\n—Prior to the Separation, the Company operated as part of Danaher and not as a separate, publicly traded company.  Accordingly, certain shared costs have been allocated to the Company and are reflected as expenses in the accompanying Combined Financial Statements.  The Company considers the allocation methodologies used to be reasonable and appropriate reflections of the related expenses attributable to Veralto for purposes of the carve-out financial statements; however, the expenses reflected in these financial statements may not be indicative of the actual expenses that would have been incurred during the periods presented if Veralto had operated as a separate stand-alone entity.  In addition, the expenses reflected in the financial statements may not be indicative of expenses that will be incurred in the future by Veralto.  Refer to Note 18 to the Consolidated and Combined Financial Statements for a description of corporate allocations and related party transactions.\nNEW ACCOUNTING STANDARDS\nFor a discussion of the new accounting standards impacting the Company, refer to Note 1 to the Consolidated and Combined Financial Statements.",
  "item2": null
}