{
  "source_file": "vmc-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1\nBUSINESS\nVulcan Materials Company operates primarily in the U.S. and is the nation’s largest supplier of construction aggregates (primarily crushed stone, sand and gravel) and a major producer of aggregates-intensive downstream products such as asphalt mix and ready-mixed concrete. We provide the basic materials for the infrastructure needed to maintain and expand the U.S. economy. Delivered by trucks, ships, barges and trains, our products are the indispensable materials building homes, offices, places of worship, schools, hospitals and factories, as well as vital infrastructure including highways, bridges, roads, ports and harbors, water systems, campuses, dams, airports and rail networks. As of December 31, 2024, we had 423 active aggregates facilities as shown below.\nProduction and sales are currently halted at our Calica operations in Mexico. For additional information, see Note 12 “\nCommitments and Contingencies\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nAdditionally, we further serve our customers through our 70 asphalt facilities and 74 concrete facilities located in Alabama, Arizona, California, Maryland, New Mexico, Tennessee, Texas, Virginia, the U.S. Virgin Islands and Washington D.C.\nOur top ten revenue producing states accounted for 89% of our 2024 revenues while our top five accounted for 63%.\nVULCAN’S TOP TEN REVENUE PRODUCING STATES IN 2024\n1.\nCalifornia\n6.\nFlorida\n2.\nTexas\n7.\nArizona\n3.\nGeorgia\n8.\nSouth Carolina\n4.\nTennessee\n9.\nNorth Carolina\n5.\nVirginia\n10.\nAlabama\nPart I\n3\nBUSINESS STRATEGY\nOur strategy and competitive advantage are based on our strength in aggregates which are used in most types of construction and in the production of asphalt mix and ready-mixed concrete. Our strategy for long-term value creation is built on: (1) an aggregates-focused business, (2) an emphasis on durable growth, (3) a holistic approach to land management, and (4) our commitment to safety, health and the environment.\n1.\nAGGREGATES FOCUS\nAggregates are an essential product with high barriers to entry, limited substitutes and very favorable pricing characteristics. Vulcan is uniquely positioned as the largest aggregates supplier in the U.S. and the most aggregates-focused public company. \nGiven our focus on aggregates, we:\n▪\nTAKE ADVANTAGE OF SIZE AND SCALE\n: While certain aspects of each aggregates operation are unique, such as its location within a local market and its particular geological characteristics, every operation uses a similar group of assets to produce saleable aggregates and provide customer service. Our 423 active aggregates facilities as of December 31, 2024 provide opportunities to share and scale best practices across our operations and to procure equipment (fixed and mobile), parts, supplies and services in an efficient and cost-effective manner, both regionally and nationally. Additionally, we are able to leverage our size for administrative support, customer service, accounting, procurement, technical support and engineering.\n▪\nBUILD AND HOLD SUBSTANTIAL RESERVES\n: Our reserves are critical to our long-term success. We currently have 16.5 billion tons of proven and probable aggregates reserves. They are strategically located to economically serve high-growth areas in the United States that are expected to require large amounts of aggregates to meet future construction demand. Moreover, there are significant barriers to entry in many metropolitan markets due to stringent zoning and permitting regulations. These restrictions curtail expansion in certain areas, but they also increase the value of our reserves at existing locations.\nWhile aggregates are the core of our business, complementary aggregates-intensive asphalt and concrete products in select markets support our aggregates-driven returns throughout the cycle.\nPart I\n4\nDemand for our products is dependent on construction activity and correlates positively with changes in population, employment and household formations. As such, we have pursued a strategy to increase our presence in U.S. metropolitan areas that are expected to grow the most rapidly and to divest assets that are no longer considered part of our long-term growth strategy. During the next decade (2024 - 2034), Woods & Poole Economics projects that 76% of the U.S. population growth, 75% of new jobs and 74% of household formations will occur in Vulcan-served states. Our coast-to-coast footprint serves 35 of the top 50 highest-growth metropolitan statistical areas in 23 states plus Washington D.C. The close proximity of our aggregates reserves and our production facilities to this projected population growth creates many opportunities to invest capital in high-return projects.\nProjected Demographic Growth, 2024 to 2034\nin millions\nSource: Woods & Poole Economics, Complete Economic and Demographic Data Source (CEDDS) 2024\n2.\nDURABLE GROWTH\nOur durable growth comes from organic growth in our existing business as well as inorganic growth through mergers and acquisitions supplemented with greenfield developments. Together, this three-pronged approach enables us to enhance our core and expand our reach. The result is an ability to grow our aggregates unit profitability throughout the cycle.\nENHANCING OUR CORE\n: We drive organic growth and differentiate ourselves from other aggregates producers through our strategic disciplines, the Vulcan Way of Selling (Commercial Excellence & Logistics Innovation) and the Vulcan Way of Operating (Operational Excellence & Strategic Sourcing). The Vulcan Way of Selling uses technology, innovation and analytics to win work and capture value. Custom, proprietary technology gives us real-time, forward-looking insight into all our end markets. Coaching and development of our people, along with clear performance metrics and accountability, drive sales execution. The Vulcan Way of Operating is the combination of tools, processes and approaches used by our teams to drive value in our operations every day. By focusing on consistent execution, production efficiency and controlling costs, we provide the highest quality material and the best service to our customers. Expanding on these strategic disciplines:\n▪\nCommercial Excellence — We place great emphasis on the unique characteristics of each geographic market, and we interact with our customers accordingly. We leverage our coast-to-coast presence, sharing best practices and real-time, forward-looking metrics with our sales teams to drive high quality discussions, value selling and improved solutions for our customers. We have clearly defined roles and responsibilities which enable our sales teams to spend less time on non-selling activities and more time responding to our customers’ needs.\n▪\nLogistics Innovation — Our industry-leading logistics team manages the shipments of nearly half of our products. Our logistics systems produce real-time information including on-site and mobile visibility to orders, deliveries and digital shipping records. Partnering with our customers (truck drivers and contractors), our bundled logistics solutions enable streamlined scheduling, speed and accuracy of delivery, as well as efficient back-office processes.\n▪\nOperational Excellence — We strive for continuous and sustainable improvements in our operating disciplines and our industry-leading safety performance. Leveraging our size and diversity, we harness technology and innovation to equip our operators with the tools and information they need to improve our customer service, asset utilization and production efficiencies. We are dedicated to continuous improvement of our safety programs through ongoing internal inspections, regulatory audits and sharing of best practices.\n▪\nStrategic Sourcing — We focus on value preservation and creation in our sourcing, leveraging our scale to save money across the organization while making sure our employees have the supplies and equipment they need. Deploying best practices and innovation allows us to spend more time in our plants and with our suppliers to deliver the right parts and services at the right time and optimize the total cost of ownership.\nAs a result of these strategic disciplines, from 2022 to 2024, aggregates gross profit per ton has increased from $5.96 to $8.26 (an increase of 39%), and aggregates cash gross profit per ton has increased from $7.83 to $10.61 (an increase of 36%). Aggregates cash gross profit per ton is a Non-GAAP financial measure. Non-GAAP financial measures are defined and reconciled within Item 7 “\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n” under the caption “\nReconciliation of Non-GAAP Financial Measures\n.”\nPart I\n5\nEXPANDING OUR REACH\n: We also drive growth by expanding our reach through mergers and acquisitions and by pursuing greenfield development in anticipation of future growth. Our disciplined approach focuses on aggregates, aims to achieve a number one or number two position in the fastest growing markets in the United States and strategically pursues downstream asphalt and concrete businesses complementary to our aggregates position in select markets.\nSince becoming a public company in 1956, Vulcan has principally grown by mergers and acquisitions. In 1999, we acquired CalMat Co., thereby expanding our aggregates operations into California and Arizona and making us one of the nation’s leading producers of asphalt mix. In 2007, we acquired Florida Rock Industries, Inc., expanding our aggregates business in Florida and our aggregates and ready-mixed concrete businesses in other Mid-Atlantic and Southeastern states. In 2017, we acquired Aggregates USA, greatly expanding our ability to serve customers in Florida, Georgia and South Carolina. In 2021, we acquired U.S. Concrete, enhancing and expanding our aggregates-led business in attractive growing metropolitan areas. In 2024, we acquired Wake Stone Corporation (Wake Stone), which expanded our reach in high-growth geographies in the Carolinas, and Superior Ready Mix, L.P. (Superior), which solidified our position as the leading aggregates producer in Southern California. During the last 10 years, we have completed almost 40 acquisitions, including more than 75 aggregates quarries and sales yards in our top 10 revenue states.\nWhile an aggregates-focused business, we selectively make investments in downstream asphalt and concrete products that drive local market profitability. Our downstream businesses use internally produced aggregates almost exclusively when available in the market from a Vulcan aggregates operation. Over the past ten years, we entered the asphalt markets in Tennessee and Alabama and also expanded our asphalt operations and services in Texas through acquisitions. Through our 2021 acquisition of U.S. Concrete, we entered the New Jersey, New York, Pennsylvania and U.S. Virgin Islands concrete markets and expanded our California, Texas and Washington D.C. concrete markets. To optimize our asset portfolio consistent with our aggregates-focused business model, we subsequently exited the New Jersey, New York and Pennsylvania concrete markets in 2022 and exited the Texas concrete market in 2023.\nAdditionally, throughout our history, we have completed many bolt-on aggregates and downstream acquisitions that have contributed significantly to our growth. In 2024, we completed two bolt-on acquisitions in Alabama and Texas, strengthening our position in two of our top 10 revenue states. From 2022 to 2024, we invested $2,890.8 million in acquisitions as outlined in Note 19 “\nAcquisitions and Divestitures\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nOur annual Return on Invested Capital (ROIC) decreased 0.1 percentage points (10 basis points) in 2024. Adjusted EBITDA increased 2% in 2024 and invested capital increased by 3%, primarily as a result of the fourth quarter acquisitions of Wake Stone and Superior.\n1\nROIC and Adjusted EBITDA are Non-GAAP financial measures. Non-GAAP financial measures are defined and reconciled within Item 7 “\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n” under the caption “\nReconciliation of Non-GAAP Financial Measures\n.”\n3.\nLAND MANAGEMENT\nWith approximately 310,000 acres in our land portfolio, a long-term holistic approach to preserving land and water is integral to sustaining our success. From pre-mining to mining to reclamation, we are actively managing the entire life cycle of our land to create maximum value for the business, our shareholders and our communities.\nWe are putting land to use before we mine by creating opportunities such as agricultural use and timber development. After mining, our land and water assets will be converted to other valuable uses including drinking water reservoirs, aquifer recharge basins, public parks, habitat mitigation banks, wetlands, productive farmland and residential and commercial developments. In 2024, we sold real estate associated with a former sales yard in Virginia for net proceeds of $37.6 million resulting in a pretax gain of $36.7 million. In 2023, we sold excess real estate in Virginia for net proceeds of $66.1 million resulting in a pretax gain of $65.7 million and real estate associated with a former recycled concrete facility in Illinois for net proceeds of $16.5 million resulting in a pretax gain of $15.2 million. In 2022, we sold excess real estate in Southern California for net proceeds of $23.6 million resulting in a pretax gain of $23.5 million. \nPart I\n6\nBecause of the evolving needs of our communities, we listen to and collaborate with our neighbors to prepare the land for its highest and best use. Many of our operations not only meet regulatory requirements for reclamation planning at the end of a quarry’s life but they also use a proactive approach to conservation and engagement while the quarries are in operation. For example, we originally purchased land in Polk County, Florida with the intention of building a quarry. However, after an extensive review of the environmental impacts to sensitive species, our environmental team collaborated with various governmental agencies to identify an alternative beneficial use for the land. The property became the Tiger Creek Conservation Bank and now serves as a protected habitat for endangered or sensitive species. Designation as a conservation bank allows us to generate revenue by selling mitigation credits for third party impacts to endangered or sensitive species or to utilize those credits for our impacts.\n \nOur engagement with state, regional and local governments to develop solutions like this today will benefit future generations.\n4.\nSAFETY, HEALTH AND THE ENVIRONMENT\nA strategy for sustainable, long-term value creation must include doing right by our employees, our neighbors and the environment in which we operate.\nOur leadership recognized decades ago the significance and importance of leadership in the Safety, Health and Environmental areas. The Safety, Health and Environmental Affairs Committee of our Board of Directors, along with the full Board, has oversight responsibility for our safety, health and environmental programs and results. Our Safety, Health & Environmental Management Committee, made up of the senior leadership team along with other key senior personnel from cross-functional operations and staff disciplines, has the ongoing management responsibility for all of our safety, health and environmental initiatives. We are a leader in our industry in safety performance by applying the shared experiences, expertise and resources at each of our locally led sites with an emphasis on taking care of one another. In 2024, we experienced an overall Mine Safety and Health Administration (MSHA) safety performance of 1.2 injuries per 200,000 employee hours worked, which is well below the 2023 industry average of 1.8 injuries.\nOur community relations programs serve our neighbors while ensuring that we grow and thrive in the communities where we operate. We leverage our charitable foundation and company funds to support food banks, healthcare services, childhood education remote learning programs and other initiatives designed to lessen the difficulties experienced in many of our communities. Our charitable foundation alone has provided over $70 million in support over the past 20 years to essential charitable, civic and educational organizations that strengthen and enrich our communities. In 2024, unprecedented extreme weather had a severe impact on our communities and operations. Most notably, Hurricane Helene caused extensive damage throughout the Southeast, impacting our teams in North Carolina, South Carolina, Tennessee and Georgia. In a time of great need, the true character and spirit of our Vulcan employees remained strong, and our teams lived out the Vulcan Way (doing the right thing, the right way, at the right time) to respond to the many challenges in the aftermath of the hurricane. Our operations have been directly involved in major restoration projects in the hardest hit areas to restore normalcy in the communities where we operate.\nOur environmental stewardship commitment is designed to protect plant and animal species and habitats, as well as the air we breathe, the water we use and the planet we all share. In all parts of our company, from local operations to our corporate and regional offices to our international business and ocean-going shipping, we are focused on ensuring that our operations are efficient in ways that are economically and environmentally sustainable. As an example of our commitment to environmental stewardship, we have been a proud national partner of the Wildlife Habitat Council (WHC) since 1990 when our Sanders quarry became the first site in the U.S. to obtain certification by WHC. We currently maintain 33 WHC certified sites containing wildlife enhancement programs in addition to several other sites working towards certification. Our commitment to environmental stewardship is also demonstrated in the expansion of our renewable energy strategy. We have two additional solar projects planned in 2025, building upon the successful first year of solar facility operations at our San Emidio quarry in Bakersfield, California. We believe these projects will provide clean electricity to our operations while also benefiting the local electric grid through lessened reliance and supply of excess electricity from the facility back to the grid in peak hours. We are committed to growing our sourcing of renewable energy, reducing the carbon intensity of our products and improving energy resiliency.\nIn addition, the recycling of aggregates-containing construction materials including concrete and recycled asphalt pavement (RAP) is an important part of our business. The sources of these materials are highway, infrastructure and other demolition projects where concrete structures or asphalt paving is being removed. During 2024, we reused 2.1 million tons of RAP and recycled 1.7 million tons of concrete. The recycling of these aggregates-containing construction materials reduces carbon emissions that impact climate change while providing a valuable service to our customers and communities, extending the life of our aggregates reserves and helping us manage the cost of production.\nFor a discussion of our energy management and greenhouse gas emissions initiatives, see the Environmental Stewardship and Climate Change section later within this Item 1 under Other Business-Related Items.\nPart I\n7\nPRODUCT LINES\nOur products are used to build the roads, tunnels, bridges, railroads and airports that connect us, and to build the homes, offices, hospitals, schools, shopping centers, factories and places of worship that are essential to our lives, our communities and the economy. We have three operating (and reportable) segments (Aggregates, Asphalt and Concrete) organized around our principal product lines. As a result of a first quarter 2024 change in our internal management reporting structure, our previously reportable calcium operation is now included within our Aggregates reporting segment. This change in our reporting segments had no impact on previously reported consolidated financial results.\nAs of December 31, 2024, we had 423 active aggregates facilities, 70 asphalt facilities and 74 concrete facilities. Our 2024 total revenues and gross profit by segment are illustrated as follows: \n2024 Total Revenues\n2024 Gross Profit\nn\nAggregates\nn\nAsphalt\nn\nConcrete\nFor actual amounts, see Note 15 “\nSegment Reporting\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\n1.\nAGGREGATES\nOur construction aggregates are used in a number of ways:\n▪\nas a base material underneath highways, walkways, airport runways, parking lots and railroads\n▪\nto aid in water filtration, purification and erosion control\n▪\nas a raw material used in combination with other resources to construct many of the items we rely on to sustain our quality of life, including houses and apartments; roads, bridges and parking lots; schools and hospitals; commercial buildings and retail space; sewer systems; airports and runways; and power plants.\nAGGREGATES INDUSTRY\nKey strengths of the U.S. aggregates industry and our business include:\n▪\nLOCATION AND TRANSPORTATION OF RESERVES:\n Aggregates have a high weight-to-price ratio that makes transportation expensive relative to the cost of the material. In most cases, aggregates are produced near where they are used so that the transportation cost does not exceed the product cost. Where practical, we have operations located close to our local markets because the cost of trucking materials long distances is prohibitive. Approximately 80% of our total aggregates shipments are delivered exclusively from the producing location to the customer by truck. \nExceptions to this typical market structure include areas along the U.S. Gulf Coast and the Eastern Seaboard where there are limited supplies of locally available, high-quality aggregates. We serve these markets from quarries that have access to cost-effective long-haul transportation, including shipping by barge, rail and our fleet of Panamax-class, self-unloading ships. Additionally, we serve markets in California and Hawaii from our quarry in British Columbia, Canada by means of a long-term marine shipping agreement with CSL Americas. Approximately 15% of our total aggregates shipments are delivered by truck to the customer after reaching a sales yard by rail or water. Less than 5% of aggregates shipments are delivered directly to the customer by rail or water.\n▪\nLIMITED PRODUCT SUBSTITUTION:\n There are limited substitutes for quality aggregates. Recycled concrete and asphalt have certain applications as a lower-cost alternative to virgin aggregates. However, many types of construction projects cannot be served by recycled concrete and require the use of virgin aggregates to meet technical specifications and performance-based criteria for durability, strength and other qualities. Likewise, the amount of recycled asphalt included in asphalt mix as a substitute for aggregates is limited due to specifications.\nPart I\n8\n▪\nHIGHLY FRAGMENTED INDUSTRY:\n The U.S. aggregates industry is composed of over 5,800 companies that operated approximately 11,100 facilities during 2024. This fragmented structure provides many opportunities for consolidation. Companies in the industry commonly enter new markets or expand positions in existing markets through the acquisition of existing facilities.\nThrough strategic acquisitions and investments, we have developed an unmatched coast-to-coast footprint of strategically located permitted reserves concentrated in and serving the nation’s key growth centers. We have approximately 25,000 customers across the markets we serve.\n▪\nFLEXIBLE PRODUCTION CAPABILITIES:\n The production of aggregates is a mechanical process in which stone is crushed and, through a series of screens, separated into various sizes depending on how it will be used. Direct production costs of aggregates primarily include: a) wages and fringe benefits; b) depreciation, depletion, accretion and amortization of capital (or long-term) assets; c) operating parts and supplies; d) repair and maintenance; e) third-party contracted services and f) energy (primarily electricity and diesel). Production capacity is flexible by adjusting operating hours to meet changing market demand. We are currently operating considerably below full capacity, making us extremely well positioned to further benefit from economies of scale when additional growth materializes.\n▪\nRAW MATERIAL INPUTS LARGELY CONTROLLED:\n Unlike typical industrial manufacturing industries, the aggregates industry does not require the input of raw material beyond owned or leased aggregates reserves. Stone, sand and gravel are naturally occurring resources. However, production does require the use of explosives, hydrocarbon fuels and electric power.\n▪\nDEMAND CYCLES:\n Long-term growth in demand for aggregates is largely driven by growth in population, jobs and households. While short-term and medium-term demand for aggregates fluctuates with economic cycles, declines have historically been followed by strong recoveries.\nThe drivers underpinning long-term demand and sustained pricing growth remain firmly in place in both the public and private sectors of the economy. They include: population growth; gains in total employment and in household income; a continuing increase in household formations; the growing need for additional housing stock; a multi-year federal transportation law in place and continuing increases in transportation funding at state and local levels; stable state tax receipts; and a multi-year federal infrastructure investment law and continued political awareness and focus on the need to invest in infrastructure.\nAGGREGATES MARKETS\nWe focus on the U.S. markets with above-average long-term expected population growth and where construction is expected to expand. We produce and sell aggregates (crushed stone, sand and gravel, sand, and other aggregates) and related products and services in 23 states, the U.S. Virgin Islands, Washington D.C., Freeport (Bahamas), British Columbia (Canada), Puerto Cortés (Honduras) and Quintana Roo (Mexico) — see the NAFTA Arbitration section in Note 12 “\nCommitments and Contingencies\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.” We serve both the public and the private sectors.\nPublic sector construction activity has historically been more stable and less cyclical than private sector construction, and it generally requires more aggregates per dollar of construction spending. Private sector construction (primarily residential and nonresidential buildings) typically is more affected by general economic cycles than public sector projects (particularly highways, roads and bridges), which tend to receive more consistent levels of funding throughout economic cycles.\nPart I\n9\nPUBLIC SECTOR CONSTRUCTION MARKET\nPublic sector construction includes spending by federal, state and local governments for highways, bridges, buildings, airports, schools, prisons, sewer and waste disposal systems, water supply systems, dams, reservoirs and other public construction projects. Construction for power plants and other utilities is funded from both public and private sources. In 2024, publicly funded construction accounted for approximately 40% of our total aggregates shipments.\n▪\nPUBLIC SECTOR FUNDING:\n Generally, public sector construction spending is more stable than private sector construction spending; public sector spending is less sensitive to interest rates and has historically been supported by multi-year laws, which provide certainty in funding amounts, program structures, rules and regulations. Federal spending is governed by authorization, budget and appropriations laws. The level of state and local spending on infrastructure varies across the United States and depends on individual state needs and economies.\n▪\nSTATE AND LOCAL TRANSPORTATION FUNDING:\n \nSince 2013, 33 states and the District of Columbia have increased or adjusted taxes on motor fuel to increase revenues available for transportation investment, including 14 Vulcan-served states and the District of Columbia. Several states in our footprint have variable-rate fuel taxes linked to measures of inflation, gas prices, population or motor vehicle fuel efficiency standards, including Alabama, California, Florida, Georgia, Illinois, Maryland, North Carolina, Virginia and the District of Columbia.\nIn addition, we benefit from state and local transportation funding ballot measures. In 2024, voters in 12 states approved measures which will generate over $45 billion in one-time and recurring revenues for transportation investment. Major transportation funding measures in Vulcan-served areas approved in 2024 are estimated to result in over $33 billion in revenues and bond proceeds primarily dedicated to roads, streets and bridges.\n▪\nFEDERAL HIGHWAY FUNDING:\n In November 2021, President Biden signed a historic, bi-partisan infrastructure bill, the Infrastructure Investment and Jobs Act (IIJA), into law. The IIJA provides the largest increase in federal highway, road and bridge funding in more than six decades with a five-year reauthorization of Federal-Aid Highway Program funding. The total Federal-Aid Highway Program obligation limitation under IIJA started at $66.9 billion in Fiscal Funding Year (FFY) 2022 and increases to $72.1 billion in FFY 2026, for a cumulative total of nearly $350 billion.\nThese numbers include one-time additional funding for large road and bridge projects, such as $40 billion for bridge repair, replacement and rehabilitation. Of the bridge funds, approximately $16.2 billion is earmarked for projects in Vulcan-served states. Through September 30, 2024, states have committed highway and bridge formula funds to support over 85,000 new projects.\nThe FFY 2024 omnibus spending package fully funded the IIJA highway investment levels for FFY 2024. The long-term nature of the highway program reauthorization in the IIJA is important. The Federal-Aid Highway Program is the largest component of the law and has provided, on average, 50% of all state capital investment in roads and bridges over the last 10 years. This multi-year authorization and the associated dedicated funding provides state departments of transportation with the ability to plan and execute long-range, complex highway projects. In states where we operate, we are well positioned to serve the large general contractors who will compete for new freight and other major capacity projects that will move forward with IIJA and policy implementation.\nImportantly, building on improvements in the two prior reauthorization laws — The Fixing America’s Surface Transportation Act (FAST Act) and Moving Ahead for Progress in the 21\nst\n Century Act (MAP-21) — the IIJA further streamlines project delivery and environmental approval advancements.\nProject financing remains an important additional component of overall surface transportation spending. The IIJA expands access to private activity bonds for highway and intermodal projects and sets the Transportation Infrastructure Finance & Innovation Act (TIFIA) program authorized at $250 million per year.\n▪\nADDITIONAL FEDERAL PUBLIC INFRASTUCTURE INVESTMENTS UNDER THE IIJA: \nThe IIJA allocates a total of approximately $1.2 trillion in federal funds for infrastructure investment, including almost $550 billion in new spending. A little more than half of the new money is dedicated to transportation sector projects. Beyond highway infrastructure, Vulcan is benefiting from IIJA-funded, aggregates-intensive infrastructure projects, such as railroads, airports, seaports, and drinking and wastewater systems.\n▪\nFEDERAL WATER RESOURCES INFRASTRUCTURE:\n In December 2024, President Biden signed the Thomas R. Carper Water Resources Development Act of 2024 (WRDA 2024) into law, enacting the sixth consecutive biennial authorization for the U.S. Army Corps of Engineers (Army Corps) since 2014. WRDA 2024 reauthorizes needed investment in America’s ports, channels, locks, dams, and other infrastructure that supports the maritime and waterways transportation system. WRDA 2024 provides the Army Corps with authorization and funding for flood and coastal storm risk management and ecosystem restoration in support of resilience and sustainability. It also authorizes the Army Corps and United States Environmental Protection Agency’s (EPA) programs, which support drinking water, wastewater and storm management projects. Notably, WRDA 2024 includes a policy provision that increased the federal share of lock and dam construction and major rehabilitation project costs paid by the Inland Waterways Trust Fund (IWTF) from 65% to 75%, which reduces the non-federal share and enables the IWTF to help finance more projects.\nPart I\n10\nPRIVATE SECTOR CONSTRUCTION MARKET\nThe private sector construction markets include both nonresidential building construction and residential construction and are considerably more cyclical than public construction. In 2024, privately funded construction accounted for approximately 60% of our total aggregates shipments.\n▪\nNONRESIDENTIAL CONSTRUCTION:\n Private nonresidential building construction includes a wide array of projects. Such projects generally are more aggregates intensive than residential construction. Overall demand in private nonresidential construction generally is driven by job growth, vacancy rates, private infrastructure needs and demographic trends. The growth of the private workforce creates demand for offices, hotels and restaurants. Likewise, population growth generates demand for stores, shopping centers, warehouses and parking decks as well as hospitals, places of worship and entertainment facilities. Large industrial projects, such as a new manufacturing facility, can increase the need for other manufacturing plants to supply parts and assemblies. Construction activity in this end market is influenced by a firm's ability to finance a project and the cost of such financing. This end market also includes capital investments in public nonresidential facilities to meet the needs of a growing population.\n▪\nRESIDENTIAL CONSTRUCTION:\n Household formations in Vulcan-served states continue to outpace household formations in the rest of the United States. The majority of residential construction is for single-family housing with the remainder consisting of multi-family construction (i.e., two family houses, apartment buildings and condominiums). Public housing comprises only a small portion of housing demand. Construction activity in this end market is influenced by the cost and availability of mortgage financing and builders’ ability to maintain skilled labor.\nU.S. housing starts, as measured by Dodge Data & Analytics, peaked in early 2006 at over 2 million units annually. By the end of 2009, total housing starts had declined to less than 0.6 million units, well below prior historical lows of approximately 1 million units annually. In 2024, total annual housing starts in the U.S. reached 1.5 million units.\nADDITIONAL AGGREGATES PRODUCTS AND MARKETS\nWe sell aggregates that are used as ballast for construction and maintenance of railroad tracks. We also sell riprap and jetty stone for erosion control along roads and waterways. In addition, stone can be used as a feedstock for cement and lime plants and for making a variety of adhesives, fillers and extenders. Coal-burning power plants use limestone in scrubbers to reduce harmful emissions. Limestone that is crushed to a fine powder can be sold as agricultural lime.\nWe sell a relatively small amount of construction aggregates outside of the United States, principally in the areas surrounding our aggregates production facilities located in Freeport, Bahamas; British Columbia, Canada; Puerto Cortés, Honduras; and Quintana Roo, Mexico (see the NAFTA Arbitration section in Note 12 “\nCommitments and Contingencies\n” in Item 8 “\nFinancial Statements and Supplementary Data\n”). Nondomestic sales and long-lived assets outside the United States are reported in Note 15 “\nSegment Reporting\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nPart I\n11\nVERTICAL INTEGRATION\nWhile aggregates is our focus and primary business, we believe vertical integration between aggregates and downstream products, such as asphalt mix and ready-mixed concrete, can be managed effectively in certain markets to generate attractive financial returns and enhance financial returns in our core Aggregates segment. We produce and sell asphalt mix and/or ready-mixed concrete within each of our three geographic markets, as noted below. \nAggregates comprise approximately 95% of asphalt mix by weight and 80% of ready-mixed concrete by weight. In both of these downstream businesses, aggregates are primarily supplied from our operations.\n2.\nASPHALT\nWe produce and sell asphalt mix in Alabama, Arizona, California, New Mexico, Tennessee and Texas and provide asphalt construction paving services in Alabama, Tennessee and Texas. In 2022 and 2024, we strengthened our asphalt position in California and Texas by acquiring additional asphalt operations. For additional details, see Note 19 “\nAcquisitions and Divestitures\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nThis segment relies on our reserves of aggregates, functioning essentially as a customer to our aggregates operations. Aggregates are a major component in asphalt mix, comprising approximately 95% by weight of this product. We meet the aggregates requirements for our Asphalt segment primarily through our Aggregates segment. These product transfers are made at local market prices for the particular grade and quality of material required.\nBecause asphalt mix hardens rapidly, delivery typically is within close proximity to the producing facility. The asphalt mix production process requires liquid asphalt cement, which we purchase from third-party producers. We do not anticipate any significant difficulties in obtaining the raw materials necessary for this segment to operate. We serve our Asphalt segment customers directly from our local production facilities. \nPart I\n12\n3.\nCONCRETE\nWe produce and sell ready-mixed concrete in California, Maryland, Virginia, the U.S. Virgin Islands and Washington D.C. We strengthened our concrete positions in California in 2024 and in Virginia and California in 2022 through acquisitions. In 2021, through our acquisition of U.S. Concrete, we entered the New Jersey, New York, Pennsylvania and U.S. Virgin Islands concrete markets and expanded our service of the California, Texas and Washington D.C. concrete markets. Subsequently, we took steps to optimize our asset portfolio consistent with our aggregates-focused business model and in 2023, we exited the Texas concrete market, and in 2022, we exited the New Jersey, New York and Pennsylvania concrete markets. For additional details, see Note 19 “\nAcquisitions and Divestitures\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nThis segment relies on our reserves of aggregates, functioning essentially as a customer to our aggregates operations. Ready-mixed concrete consists of cement and other cement-related materials (such as fly ash and slag), aggregates (crushed stone and sand), chemical admixtures and water and is measured in cubic yards. Aggregates are a major component in ready-mixed concrete, comprising approximately 80% by weight of this product. We meet the aggregates requirements of our Concrete segment primarily through our Aggregates segment. These product transfers are made at local market prices for the particular grade and quality of material required.\nCement is the binding agent used to bind water, crushed stone and sand in the production of ready-mixed concrete. Other industrial byproducts, such as fly ash from coal burning power plants and slag from the manufacture of iron and silica fume, have cement-related properties that allow them to be used as substitutes for cement depending on the specifications. We purchase cement-related materials from a few suppliers in each of our major geographic markets. Chemical admixtures are generally purchased from suppliers under national purchasing agreements.\nWith the exception of chemical admixtures, each ready-mix facility typically maintains an inventory level of these raw materials sufficient to satisfy its operating needs for a few days. Inventory levels do not decline significantly or comparatively with declines in revenue during seasonally lower periods. We generally maintain inventory at specified levels to maximize purchasing efficiencies and to be able to respond quickly to customer demand.\nBecause ready-mixed concrete hardens rapidly, delivery typically is within close proximity to the producing facility. Ready-mixed concrete production also requires cement which we purchase from third-party producers. We do not anticipate any significant difficulties in obtaining the raw materials necessary for this segment to operate. We serve our Concrete segment customers from our local production facilities or by truck.\nPart I\n13\nOTHER BUSINESS-RELATED ITEMS\nSEASONALITY AND CYCLICAL NATURE OF OUR BUSINESS\nAlmost all of our products are produced and consumed outdoors. Seasonal changes and other weather-related conditions can affect the production and sales volumes of our products. Therefore, the financial results for any quarter do not necessarily indicate the results expected for the year. Normally, the highest sales and earnings are in the third quarter, and the lowest are in the first quarter. Furthermore, our sales and earnings are sensitive to national, regional and local economic conditions, demographic and population fluctuations, and particularly to cyclical swings in construction spending, primarily in the private sector.\nCOMPETITORS\nWe operate in a fragmented industry with a large number of small, privately-held companies. We estimate that the ten largest aggregates producers accounted for approximately 35% of the total U.S. aggregates production in 2024. Despite being the industry leader, Vulcan’s total U.S. market share is approximately 9%. As of December 31, 2024, other publicly traded companies among the ten largest U.S. aggregates producers include the following:\n▪\nArcosa, Inc.\n▪\nCemex S.A.B. de C.V.\n▪\nCRH plc \n▪\nHeidelberg Materials AG\n▪\nHolcim Ltd.\n▪\nMartin Marietta Materials, Inc.\n▪\nSummit Materials, Inc.\nBecause the U.S. aggregates industry is highly fragmented, many opportunities for consolidation exist. Therefore, companies in the industry tend to grow by acquiring existing facilities to enter new markets or extend their existing market positions.\nCUSTOMERS\nNo material part of our business depends upon any single customer whose loss would have a significant adverse effect on our business. In 2024, our five largest customers accounted for approximately 8% of our total revenues, and no single customer accounted for more than 3%\n \nof our total revenues. Although approximately 40% to 55% of our aggregates shipments have historically been used in publicly-funded construction, such as highways, airports and government buildings, a relatively small portion of our sales are made directly to federal, state, county or municipal governments/agencies. Therefore, although reductions in state and federal funding can curtail publicly-funded construction, the vast majority of our business is not directly subject to renegotiation of profits or termination of contracts with local, state or federal governments. In addition, our sales to government entities span several hundred entities coast-to-coast, ensuring that negative changes to various government budgets would have a muted impact across such a diversified set of government customers.\nENVIRONMENTAL STEWARDSHIP AND CLIMATE CHANGE\nAs an industry leader, we are and always have been committed to environmental stewardship which is necessary for our long-term sustainability and growth. Production of construction aggregates requires land, energy and water. Efficient use of these resources and management of the environmental impacts of our operations are embedded in our business planning. Our intentional approach to environmental stewardship also supports increased operational efficiency, cost reduction, new opportunities for growth and effective risk management.\nWe are committed to doing our part to reduce our greenhouse gas (GHG) emissions and to identifying, planning for, and mitigating physical and transitional climate risks to our business. Carbon dioxide and other GHG emissions from our operations are low: we are aggregates-focused and do not produce cement. Beginning in 2018, we chose to voluntarily report GHG emissions via the Carbon Disclosure Project. In 2022, we established interim goals and targets related to Scope 1 and 2 emissions. In 2024, we continued the second phase of our Scope 3 GHG emissions inventory project to further build the capacity to report on activities of assets not owned or controlled by Vulcan but that indirectly impact our value chain. We also enhanced our GHG emissions tracking and reporting capabilities in order to report Scope 1 and 2 emissions on an enterprise-wide basis by line of business and type of energy. \nMANAGING ENERGY AND OPERATIONAL EFFICIENCY\nCareful management of energy is embedded in our business strategy and our company culture. We routinely conduct energy audits of our operations to identify areas for operational efficiency improvements and energy savings. Some of the opportunities identified during these audits that are being implemented include: replacement of older motors with new ultra-high efficiency motors to power plant processing equipment; improvements in water handling systems to reduce water pumping needed; optimizing process equipment flow to maximize efficiency; reducing idle equipment hours; use of LED lighting; and optimization of air conditioning and lighting control to reduce energy consumption.\nPart I\n14\nWe continue to increase the fuel efficiencies of our off-road fleet vehicles. Tier IV machines performed over 64% of the off-road fleet’s work in \n2024\n, which positively impacts all air emissions in addition to having an impact on GHG emissions.\nOur strategy also includes producing low-embodied emissions products and supporting the construction of climate-resilient infrastructure. For example, our Concrete segment has licensed the CarbonCure technology that provides capture and sequestration of carbon dioxide within ready-mixed concrete. The carbon dioxide becomes chemically bound within the concrete matrix and is not released into the air, even when the concrete is recycled following use. This technology also reduces the demand for cement and other cement-related materials which reduces the supply side carbon footprint. The resulting concrete is also stronger than it would have been without use of the technology.\nScope 1 and Scope 2 GHG reductions will come by means of continuing heavy equipment replacement with higher efficiency models, seeking production efficiencies, and procuring energy from renewable sources. We are confident that there are many more opportunities to reduce the carbon footprint of our operations, distribution and transportation networks, and the projects in which our products are used. An example of an additional opportunity that we are exploring is the installation of battery storage for electricity at multiple locations so that energy can be stored during off peak periods to run the plant equipment, thereby minimizing peak load usage. This has significant implications for the ability of the utility company to meet peak demands and to reduce their use of older power plants that burn coal or oil and emit greater concentrations of GHG emissions.\nENVIRONMENTAL COSTS AND GOVERNMENTAL REGULATION\nWe are subject to a wide variety of federal, state and local laws and regulations in the communities where we conduct business. Compliance with these laws and regulations often requires the time and effort of our employees, as well as financial resources. The following describes certain significant regulations that may impact our business. For additional information about our risks related to government regulations, see Item 1A “\nRisk Factors\n.”\nOur operations are subject to numerous laws and regulations relating to the protection of the environment and worker health and safety including regulation of facility air emissions and water discharges, waste management, protection of wetlands, listed and threatened species, noise and dust exposure control for workers, and safety regulations under both Mine Safety and Health Administration (MSHA) and Occupational Safety and Health Administration (OSHA). Compliance with these various regulations requires capital investment and ongoing expenditures for the operation and maintenance of systems and implementation of programs. These anticipated investments and expenditures are not material to our earnings or competitive position.\nWe have received notices from the EPA or similar state or local agencies that we are considered a potentially responsible party (PRP) at a limited number of sites under the Comprehensive Environmental Response, Compensation and Liability Act (CERCLA or Superfund) or similar state and local environmental laws. Generally, we share the cost of remediation at these sites with other PRPs or alleged PRPs in accordance with negotiated or prescribed allocations. There is inherent uncertainty in determining the potential cost of remediating a given site and in determining any individual party's share of that cost. As a result, estimates can change substantially as additional information becomes available about the nature or extent of site contamination, remediation methods, other PRPs and their probable level of involvement, and actions by or against governmental agencies or private parties.\nFrequently, we are required by state and local regulations or contractual obligations to reclaim our former mining sites. These reclamation liabilities are recorded at fair value in our financial statements at the time the obligation arises. To determine the fair value, we estimate the cost for a third party to perform the legally required reclamation, which is adjusted for inflation and risk and includes a reasonable profit margin. Reclaimed quarries often have potential for use in commercial or residential development or as reservoirs or landfills. However, no projected cash flows from these anticipated uses have been considered to offset or reduce the estimated reclamation liability.\nFor additional information about environmental matters and reclamation obligations, see \nNote\n 12\n and \nNote\n 17\n, respectively, to the consolidated financial statements in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nHUMAN CAPITAL\nAs of January 1, 2025, we employed 11,436 people in the United States. Of these employees, 1,092 are represented by labor unions. Also, as of that date, we employed 313 people in Mexico, 149 people in Honduras, 72 people in Canada, and 1 person in the Bahamas. Of these employees, 248 are represented by labor unions. We believe we enjoy a satisfactory relationship with our employees, including our unionized workforce, and we do not anticipate any significant issues with any unions in 2025.\nVulcan’s commitment to our people has played a key role in the ongoing success and growth of our company throughout our long history. We are dedicated to fostering a culture of mutual respect, integrity, teamwork and trust among our workforce. Our employees receive tools and cutting edge, customized safety and health, technical, managerial and leadership training to enable them to perform safely and effectively. Our people share a competitive drive to be the best they can be and do the right thing, which benefits all of our stakeholders.\nIn 2024, we celebrated the tenth anniversary of The Vulcan Way. Inclusion has been one of the ten tenets of The Vulcan Way since its adoption. Our focus on inclusion fosters a positive work environment and enables Vulcan to attract, grow and retain talented employees while promoting unity of purpose. We are committed to a culture that values diverse styles, ideas, and perspectives. We believe that success is achieved when all individuals are represented, valued and included at all levels.\nPart I\n15\nWe believe that learning is fundamental to every job, and we encourage our people to expand and explore their capabilities for continued growth throughout their careers with Vulcan. Our industry-leading training and development programs encourage collaboration and enable people to innovate and flourish on the job and in the community. These programs:\n▪\nProvide our employees with a Tuition Reimbursement Program, which pays up to 100% of tuition costs based on academic performance\n▪\nEncourage personal and professional growth through our mentoring program\n▪\nPrepare future senior-level leaders through our Leadership Development Program in partnership with the University of North Carolina, Chapel Hill \n▪\nOffer mini MBA programs and other continuing education opportunities\n▪\nDeliver ongoing Vulcan Way of Operating technical and skills-based training modules\n▪\nProvide ongoing management and soft skill training through the Plant Manager Engagement Series\nEmployee Tenure\nin years\nEmployees by Age\nin years\nWorkforce by Race and Ethnicity\nSalaried Non-Exempt Employees\nby Gender\nPart I\n16\nSHAREHOLDER RETURN PERFORMANCE\nBelow is a graph comparing the performance of our common stock, with dividends reinvested, to that of the Standard & Poor’s 500 Stock Index (S&P 500) and the S&P 500 Materials Index (S&P 500 Materials) from December 31, 2019 to December 31, 2024. \n2019\n2020\n2021\n2022\n2023\n2024\nComparative Total Return \n1\nVulcan Materials Company\n$100.00\n$104.20\n$147.03\n$125.12\n$163.53\n$186.59\nS&P 500\n$100.00\n$118.40\n$152.38\n$124.80\n$157.62\n$197.03\nS&P 500 Materials\n$100.00\n$120.70\n$153.65\n$134.75\n$151.60\n$151.60\n1\nAssumes an initial investment at December 31, 2019 of $100 in each stock/index, with quarterly reinvestment of dividends.\nPart I\n17\nINVESTOR INFORMATION\nWe make available on our website, \nwww.vulcanmaterials.com\n, free of charge, copies of our: \n▪\nAnnual Report on Form 10-K\n▪\nQuarterly Reports on Form 10-Q\n▪\nCurrent Reports on Form 8-K\nOur website also includes amendments to those reports filed with or furnished to the Securities and Exchange Commission (SEC) pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 as well as all Forms 3, 4 and 5 filed with the SEC by our executive officers and directors, as soon as the filings are made publicly available by the SEC on its EDGAR database (\nwww.sec.gov\n).\nIn addition to accessing copies of our reports online, you may request a copy of our Annual Report on Form 10-K, including financial statements, by writing to Denson N. Franklin III, Senior Vice President, General Counsel and Secretary, Vulcan Materials Company, 1200 Urban Center Drive, Birmingham, Alabama 35242.\nWe have a: \n▪\nBusiness Conduct Policy applicable to all employees and directors\n▪\nCode of Ethics for the CEO and Senior Financial Officers\nCopies of the Business Conduct Policy and the Code of Ethics are available on our website under the “Investor Relations” tab (“Governance” section). If we make any amendment to, or waiver of, any provision of the Code of Ethics, we will disclose such information on our website as well as through filings with the SEC. \nOur Board of Directors has also adopted:\n▪\nCorporate Governance Guidelines\n▪\nCharters for our Audit, Compensation & Human Capital, Executive, Finance, Governance and Safety, Health & Environmental Affairs Committees\nThese documents meet all applicable SEC and New York Stock Exchange (NYSE) regulatory requirements.\nThe Charters of the Audit, Compensation & Human Capital and Governance Committees are available on our website under the “Investor Relations” tab (“Governance – Committee Composition” section) or you may request a copy of any of these documents by writing to Denson N. Franklin III, Senior Vice President, General Counsel and Secretary, Vulcan Materials Company, 1200 Urban Center Drive, Birmingham, Alabama 35242.\nInformation included on our website is not incorporated into, or otherwise made a part of, this report.\nCERTIFICATIONS AND ASSERTIONS\nThe certifications of our Chief Executive Officer and Chief Financial Officer made pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 are included as exhibits to this Annual Report on Form 10-K. Additionally, on June 10, 2024 our Chief Executive Officer submitted to the NYSE the annual written affirmation required by the rules of the NYSE certifying that he was not aware of any violations of Vulcan Materials Company of NYSE corporate governance listing standards. \nPart I\n18",
  "item7": "ITEM 7\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe objective of our management’s discussion and analysis is to help investors understand our operations and current business environment from the perspective of our management. The following discussion should be read in conjunction with the consolidated financial statements and the accompanying notes contained in this Annual Report. The following generally includes a comparison of our results of operations and liquidity and capital resources for 2024 and 2023. For the discussion of changes from 2022 to 2023 and other financial information related to 2022, refer to Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations, of our Form 10-K for the year ended December 31, 2023 filed with the Securities and Exchange Commission on February 22, 2024.\nEXECUTIVE SUMMARY\nFINANCIAL SUMMARY FOR 2024\nCOMPARED TO 2023:\n▪\nTotal revenues decreased $364.2 million, or 5%, to $7,417.7 million\n▪\nGross profit increased $51.1 million, or 3%, to $1,999.6 million\n▪\nSelling, administrative and general (SAG) expenses decreased 2% to $531.1 million and increased 20 basis points as a percentage of total revenues\n▪\nOperating earnings decreased $62.9 million, or 4%, to $1,364.5 million\n▪\nEarnings attributable to Vulcan from continuing operations were $6.91 per diluted share, compared to $7.06 per diluted share\n▪\nAdjusted earnings attributable to Vulcan from continuing operations were $7.53 per diluted share, compared to $7.00 per diluted share\n▪\nNet earnings attributable to Vulcan were $911.9 million, a decrease of $21.3 million, or 2%\n▪\nAdjusted EBITDA was $2,057.2 million, an increase of $45.9 million, or 2%\n▪\nAggregates segment sales increased $30.7 million, or 1%, to $5,949.6 million\n▪\nAggregates segment freight-adjusted revenues increased $174.9 million, or 4%, to $4,636.2 million\n▪\nShipments decreased 6%, or 14.6 million tons, to 219.9 million tons\n▪\nFreight-adjusted sales price increased 10.8%, or $2.06 per ton to $21.08\n▪\nAggregates segment gross profit increased $79.9 million, or 5%, to $1,816.7 million\n▪\nUnit profitability (as measured by gross profit per ton) increased 12% to $8.26 per ton\n▪\nUnit profitability (as measured by cash gross profit per ton) increased 12% to $10.61 per ton\n▪\nAsphalt and Concrete segment sales decreased $490.9 million, or 21%, to $1,899.1 million, collectively\n▪\nAsphalt and Concrete segment gross profit decreased $28.8 million, or 14%, to $182.9 million, collectively\n▪\nReturned capital to shareholders via dividends of $244.4 million at $1.84 per share versus $228.4 million at $1.72 per share\n▪\nReturned capital to shareholders via share repurchases of $68.8 million at $254.71 average price per share compared to $200.0 million at $204.52 average price per share\n \nOur aggregates-led business delivered a strong finish to the year. Adjusted EBITDA in the fourth quarter improved 16%, and Adjusted EBITDA margin expanded 370 basis points. The favorable pricing environment coupled with strong operational execution led to consistent year-over-year improvement in aggregates gross profit per ton each quarter (and double-digit improvement in cash gross profit per ton) – finishing 2024 with aggregates gross profit per ton of $9.02 and cash gross profit per ton of $11.50 for the fourth quarter. As we look to 2025, the pricing environment remains favorable, and we are focused on our operating disciplines to manage costs and improve efficiencies. By controlling what we can control, we expect to deliver approximately 19% growth in Adjusted EBITDA.\nAt year-end 2024, total debt to Adjusted EBITDA was 2.6 times (2.3 times on a net debt basis, reflecting $600.8 million of cash on hand). Our weighted-average debt maturity was 12.6 years, and our total weighted-average effective interest rate was 5.0%. Return on invested capital was 16.2%. We remain well positioned for continued growth with a strong liquidity position and balance sheet profile.\nAdjusted EBITDA, Aggregates segment freight-adjusted revenues, cash gross profit per ton, debt to Adjusted EBITDA and return on invested capital are non-GAAP measures. See the definitions and reconciliations within this Item 7 under the caption “\nReconciliation\n \nof Non-GAAP Financial Measures\n.”\nPart II\n32\nCAPITAL ALLOCATION\nOur balanced approach to capital allocation remains unchanged. Through economic cycles we intend to balance reinvestment in our business, growth through acquisitions and internal growth projects, and return of capital to shareholders while maintaining financial strength and flexibility evidenced by our strong balance sheet and investment-grade credit ratings. Our capital allocation priorities are as follows:\n1.\nOperating Capital (maintain and grow the value of our franchise)\n2.\nGrowth Capital (including acquisitions and greenfields)\n3.\nDividend Growth (with a keen focus on sustainability)\n4.\nReturn Excess Cash to Shareholders (primarily via share repurchases)\nOur first priority is to maintain and protect our valuable franchise by keeping our operations in good working order to ensure the production of high quality materials and timely delivery of goods and services to our customers. This capital requirement expands and contracts as production and shipment levels change. During 2024, we invested $638.0 million in capital expenditures to replace or improve existing property, plant & equipment.\nOur second priority is to grow our franchise, primarily through business acquisitions and complemented by internal growth investments. For business acquisitions, we tend to look for bolt-on acquisitions, which are easier to integrate, and will pursue large business combinations that are the right fit and the right price. We use strategic and returns-based criteria to price potential acquisitions and are disciplined in our approach. We evaluate many potential acquisitions and only make offers on a few. We closed six business acquisitions during 2024 for total consideration of $2,297.1 million, including our acquisitions of Wake Stone Corporation (Wake Stone) and Superior Ready Mix, L.P.\n \n(Superior). Wake Stone was a leading pure-play aggregates supplier in the Carolinas, and Superior was an integrated aggregates, asphalt and concrete producer in Southern California. These acquisitions add quality aggregates reserves to our existing franchise in three attractive states. We also completed bolt-on acquisitions in both Alabama and Texas. All of our 2024 acquisitions were in our top 10 revenue states, demonstrating consistency with our disciplined capital allocation priorities and aggregates-led strategy of continuing to expand our reach through value-enhancing acquisitions.\nOur third priority is growing the dividend with a keen focus on sustainability through the economic cycle. During 2024, we paid a dividend per share of $1.84 and paid total dividends of $244.4 million.\nAnd finally, if there is excess cash after fulfilling the prior capital allocation priorities, we will consider returning cash to shareholders via share repurchases. During 2024, we returned $68.8 million to our shareholders through share repurchases.\nFor a detailed discussion of our acquisitions and divestitures, see Note 19 “\nAcquisitions and Divestitures\n” in Item 8 “\nFinancial\n \nStatements and Supplementary Data\n.”\nMARKET DEVELOPMENTS AND OUTLOOK\nWe carry solid momentum into 2025 and are well positioned to deliver another year of strong earnings growth and cash generation. Continued strength in public construction activity and our recent acquisitions support our expectations for volume growth in 2025. The pricing environment remains positive, and inflationary pressures continue to moderate. This backdrop, coupled with our Vulcan Way of Selling and Vulcan Way of Operating disciplines, will lead to further expansion in our industry-leading aggregates cash gross profit per ton and value creation for our shareholders.\nOur expectations for 2025 include:\n▪\nA third consecutive year of double-digit year-over-year growth in Aggregates segment cash gross profit per ton ($10.61 in 2024)\n▪\nShipments growth of 3% to 5% (219.9 million tons in 2024)\n▪\nFreight-adjusted price improvement of 5% to 7% ($21.08 in 2024); inclusive of over 100 basis points of negative mix impact from recent acquisitions\n▪\nLow to mid-single digit increase in freight-adjusted unit cash cost (freight-adjusted price less segment cash gross profit per ton; $10.47 in 2024)\n▪\nTotal Asphalt and Concrete segment cash gross profit of approximately $360 million ($272 million in 2024)\n▪\nRelative contribution of approximately two-thirds from the Asphalt segment and one-third from the Concrete segment\n▪\nSelling, Administrative and General expenses of $550 million to $560 million ($531 million in 2024)\n▪\nInterest expense of approximately $245 million\n▪\nCapital spending for maintenance and growth projects of $750 million to $800 million\n▪\nDepreciation, depletion, accretion and amortization expense of approximately $800 million\n▪\nAn effective tax rate of 22% to 23%\n▪\nNet earnings attributable to Vulcan of $1,010 million to $1,170 million\n▪\nAdjusted EBITDA between $2,350 million and $2,550 million (includes $150 million contribution from acquisitions)\nPart II\n33\nPOSITIONED FOR GROWTH AND VALUE CREATION\nDURABLE BUSINESS MODEL TO EXTEND THE CYCLE AND SUSTAIN GROWTH\n▪\n39% improvement in Aggregates gross profit per ton since 2022 \n▪\n36% improvement in Aggregates cash gross profit per ton since 2022 \n▪\nIndustry-leading commercial, logistics, operational and sourcing capabilities\n▪\nEnd market fundamentals support continued growth outlook\n▪\nPoised to benefit from generational investment in infrastructure that could extend the growth cycle by mitigating private construction cyclicality\nWe have continued to deliver strong financial performance over time and through business cycles. Through our aggregates-led strategy and focus on our strategic disciplines — the Vulcan Way of Selling (Commercial Excellence & Logistics Innovation) and the Vulcan Way of Operating (Operational Excellence & Strategic Sourcing), as outlined in Item 1 “\nBusiness\n” under the “Business Strategy” heading — we have created one of the most profitable public companies in our industry as measured by aggregates gross profit per ton.\nIn 2019, we set a target of $9 of cash gross profit per ton on volumes of 230 to 240 million tons, which we exceeded in 2023. In 2022, we set a new target to achieve $11 to $12 cash gross profit per ton once we reach 260 to 270 million tons. We delivered $10.61 of cash gross profit per ton on 220 million tons in 2024, exiting the year with cash gross profit of $2,332 million. Our durable growth strategy gives us confidence that we will deliver more value to our shareholders on every ton of aggregates we sell.\nCash gross profit per ton is a non-GAAP measure. See the definitions and reconciliations within this Item 7 under the caption \"\nReconciliation of Non-GAAP Financial Measures\n.\"\nMore than an aggregates supplier, we are a business dedicated to customer service and finding creative solutions to meet our customers’ needs. Being a valued partner and trusted supplier means that we are providing the right product, with the right specifications, that is the right quality, delivered the right way — on time and safely. Our \nOne Vulcan, Locally Led \napproach, in which our employees work together to leverage the size and strengths of Vulcan as a whole, while running their operations with a strong entrepreneurial spirit and sense of ownership, allows us to deliver market-leading services to our customers.\nPart II\n34\nTransportation costs are passed along to our customers, and because aggregates have a very high weight-to-price ratio, those costs can add up quickly when transporting aggregates long distances. Having the most extensive distribution network of any aggregates producer sets us apart. Combining our trucking, rail, barge and ocean vessel shipping logistics capabilities allows us to provide better customer solutions and create a seamless customer experience at a competitive price. As an approximation, a truck has a capacity of 20-25 tons of aggregates; a railcar has a capacity of 4-5 truckloads; a barge has a capacity of 65 truckloads; and our ocean vessels have the capacity of 2,500 truckloads.\nProduction and sales are currently halted at our Calica operations in Mexico. For additional information, see Note 12 “\nCommitments and Contingencies\n” in Item 8 “\nFinancial Statements and Supplementary Data\n.”\nPart II\n35\nINDUSTRY LEADER WITH CLEAR COMPETITIVE ADVANTAGES\n▪\nLargest U.S. aggregates producer with strategic geographic diversity\n▪\n423 active aggregates facilities with 16.5 billion tons of reserves\n▪\nLeading unit profitability margins driven by operational expertise and pricing performance\n▪\n76% of the U.S. population growth over the next decade is projected to occur in Vulcan-served states\nOver time, we have strategically and systematically built one of the most valuable aggregates franchises in the U.S. with a footprint that is impossible to replicate. Zoning and permitting regulations have made it increasingly difficult to expand existing quarries or to develop new quarries. Such regulations, while curtailing expansion, also increase the value of our reserves that were zoned and permitted decades ago.\nDemand for aggregates correlates positively with changes in population, household formations and employment. We have a coast-to-coast footprint that serves 35 of the top 50 highest-growth metropolitan statistical areas (MSAs). As state and federal spending increase, Vulcan is poised to benefit greatly from growing private and public demand for aggregates, thereby delivering significant long-term value for our shareholders. \nSource: Woods & Poole CEDDS 2024\nBased on people added from 2024 to 2034\nPart II\n36\nSTRONG CASH FLOW GENERATION AND INVESTMENT-GRADE BALANCE SHEET\n▪\nFinancial capacity to sustain capital reinvestment in current asset base and to fund growth\n▪\nMaintain an investment-grade credit position\n▪\nContinue to leverage current capital base to grow earnings and maximize cash generation\n▪\nPrudently pursue attractive acquisitions and greenfields\n▪\nReturn value to shareholders with dividends and stock repurchases \nFree Cash Flow Growth\nin millions\n \nFree cash flow is a Non-GAAP measure and calculated by subtracting purchases of property, plant and equipment from operating cash flows. Free cash flow is useful to investors in understanding how existing cash from operations is utilized as a source for sustaining our current capital plan and future development growth.\nOur financial position is strong as evidenced by our long-term investment-grade credit ratings (Fitch BBB/Moody’s Baa2/Standard & Poor’s BBB+).\n \nAt December 31, 2024, our available liquidity was $2,064.5 million, including $559.7 million of unrestricted cash on hand, significantly higher than our liquidity needs. Our leverage ratio, as measured by total debt to Adjusted EBITDA, was 2.6 times at December 31, 2024 (our net debt to Adjusted EBITDA ratio at December 31, 2024 was 2.3 times). Our long-term leverage target is 2.0 to 2.5x.\n*\nThese years include significant acquisition activity (see \nPart I, Item 1 \n\"\nBusiness\n\"\n under the caption \"Business Strategy\" for further details).\nPart II\n37\nSAFETY, HEALTH AND ENVIRONMENTAL PERFORMANCE\nA strategy for sustainable, long-term value creation must include doing right by our employees, our neighbors and the environment in which we operate. Over our more than six decades as a public company, we have built a strong, resilient and vital business on this foundation of doing things the right way.\nWe are a leader in our industry in safety, health and environmental performance, with a safety record substantially better than the industry average. We apply the shared experiences, expertise and resources at each of our locally led sites with an emphasis on taking care of one another. The result is a record of safety excellence that consistently outperforms the industry.\nVulcan MSHA Injury Rate Compared to Aggregates Industry\nNumber of Injuries per 200,000 Hours Worked\nSource: Bureau of Labor Statistics records and internal Vulcan data.\n*\nThe aggregates industry MSHA injury rate for 2024 was not available as of the filing of this report.\nWe focus on our environmental stewardship programs with the same commitment that we bring to our health and safety initiatives resulting in 98% citation-free inspections out of all 2024 federal and state environmental inspections. As an industry leader, our aim is to meet — and strive to exceed — all federal, state and local environmental regulations. \nHowever, sustainability means looking beyond what is required of a company by governments and regulators. Sustainability is reflected in our business strategy. We lead community relations programs that serve our neighbors while ensuring that we grow and thrive in the communities where we operate. In all parts of our company, from local operations to our corporate and regional offices to our international business and ocean-going shipping, we are focused on ensuring that our operations are efficient in ways that are economically and environmentally sustainable. It’s the right thing to do for our business and our stakeholders.\nWe continue to make progress on reducing our carbon footprint, increasing our energy efficiency, and measuring and reducing our water use. We also manage our land with biodiversity in mind. During 2024, we operated 33 sites containing wildlife enhancement programs that are certified by the Wildlife Habitat Council in addition to several other sites that are working towards certification.\nWe recognize that the aggregates mining in which we engage is an interim use of the approximately 310,000 acres of land in our portfolio. Our land and water assets will be converted to other valuable uses at the end of mining. Effective management throughout the life cycle of our land — from pre-mining utilization as agriculture and timber development, to post-mining development as water reservoirs or residential and commercial development — not only generates significant additional value for our shareholders but greatly benefits the communities in which we operate.\nPart II\n38\nRESULTS OF OPERATIONS\nTotal revenues are primarily derived from our product sales of aggregates, asphalt mix and ready-mixed concrete, and include freight & delivery costs that we pass along to our customers to deliver these products. We also generate service revenues from our asphalt construction paving business and services related to our aggregates business. We present separately our discontinued operations, which consists of our former Chemicals business.\nThe following table highlights significant components of our consolidated operating results including EBITDA and Adjusted EBITDA.\nCONSOLIDATED OPERATING RESULTS HIGHLIGHTS\nFor the years ended December 31\nin millions, except per share and per unit data\n2024\n2023\n2022\nTotal revenues\n$\n7,417.7 \n$\n7,781.9 \n$\n7,315.2 \nCost of revenues\n(5,418.1)\n(5,833.4)\n(5,757.5)\nGross profit\n1,999.6 \n1,948.5 \n1,557.7 \nGross profit margin\n27.0 \n%\n25.0 \n%\n21.3 \n%\nSelling, administrative and general expenses\n(531.1)\n(542.8)\n(515.1)\nSAG as a percentage of total revenues\n7.2 \n%\n7.0 \n%\n7.0 \n%\nGain on sale of property, plant & equipment and businesses\n52.3 \n76.4 \n10.7 \nLoss on impairments\n(86.6)\n(28.3)\n(67.9)\nOperating earnings\n1,364.5 \n1,427.4 \n951.4 \nInterest expense\n(191.2)\n(196.1)\n(169.2)\nEarnings from continuing operations before income taxes\n1,172.1 \n1,245.1 \n788.1 \nIncome tax expense\n(251.4)\n(299.4)\n(193.0)\nEffective tax rate from continuing operations\n21.4 \n%\n24.0 \n%\n24.5 \n%\nEarnings from continuing operations\n920.7 \n945.7 \n595.1 \nLoss on discontinued operations, net of tax\n(7.6)\n(10.8)\n(18.6)\nEarnings attributable to noncontrolling interest\n(1.2)\n(1.7)\n(0.9)\nNet earnings attributable to Vulcan\n$\n911.9 \n$\n933.2 \n$\n575.6 \nDiluted earnings (loss) per share attributable to Vulcan\nContinuing operations \n$\n6.91 \n$\n7.06 \n$\n4.45 \nDiscontinued operations\n(0.06)\n(0.08)\n(0.14)\nNet earnings\n$\n6.85 \n$\n6.98 \n$\n4.31 \nEBITDA \n1\n$\n1,963.2 \n$\n2,025.4 \n$\n1,517.9 \nAdjusted EBITDA \n1\n$\n2,057.2 \n$\n2,011.3 \n$\n1,625.6 \nAverage Sales Price and Unit Shipments\nAggregates\nTons\n219.9 \n234.6 \n236.6 \nFreight-adjusted sales price\n$\n21.08 \n$\n19.02 \n$\n16.41 \nAsphalt Mix\nTons\n13.6 \n13.4 \n12.2 \nAverage sales price\n$\n80.09 \n$\n75.76 \n$\n71.29 \nReady-mixed concrete\nCubic yards\n3.6 \n7.5 \n10.5 \nAverage sales price\n$\n182.93 \n$\n166.95 \n$\n150.82 \n1\nNon-GAAP measures are defined and reconciled within this Item 7 under the caption \"\nReconciliation of Non-GAAP Financial\n \nMeasures\n.\"\nPart II\n39\nNet earnings attributable to Vulcan for 2024 were $911.9 million ($6.85 per diluted share) compared to $933.2 million ($6.98 per diluted share) in 2023. Each year's results were impacted by discrete items, as follows:\nNet earnings attributable to Vulcan for 2024 include:\n▪\npretax net gain of $36.7 million related to the sale of real estate in Virginia\n▪\npretax charges of $86.6 million associated with a goodwill impairment\n▪\npretax charges of $17.7 million for divested operations\n▪\npretax charges of $16.3 million associated with non-routine acquisitions\n▪\npretax loss on discontinued operations of $10.2 million\nNet earnings attributable to Vulcan for 2023 include:\n▪\npretax net gain of $67.1 million related to the sale of excess real estate and businesses\n▪\npretax charges of $28.3 million for long-lived asset impairments related to the sale of businesses\n▪\npretax charges of $7.9 million for divested operations\n▪\npretax charges of $2.1 million associated with non-routine acquisitions\n▪\npretax loss on discontinued operations of $14.7 million\n▪\n$12.9 million of tax charges related to a valuation allowance against Calica deferred tax assets, including net operating loss (NOL) carryforwards\nAdjusted for these discrete items, earnings attributable to Vulcan from continuing operations (Adjusted Diluted EPS) was $7.53 per diluted share for 2024 compared to $7.00 per diluted share for 2023. \nEARNINGS FROM CONTINUING OPERATIONS BEFORE INCOME TAXES\nYear-over-year changes in earnings from continuing operations before income taxes are summarized below:\n \nin millions\n2022\n$\n788.1 \n2023\n$\n1,245.1 \nHigher aggregates gross profit\n325.7 \n79.9 \nHigher asphalt gross profit\n92.3 \n20.5 \nLower concrete gross profit\n(27.2)\n(49.3)\nLower (higher) selling, administrative and general expenses\n(27.7)\n11.7 \nHigher (lower) gain on sale of property, plant & equipment and businesses\n65.7 \n(24.1)\nLower (higher) impairment charges\n39.6 \n(58.3)\nLower (higher) interest expense\n(26.9)\n9.3 \nLower (higher) acquisition related expenses\n8.4 \n(14.2)\nHigher environmental remediation expenses\n(1.4)\n(15.7)\nLower (higher) foreign currency transaction losses\n4.5 \n(16.5)\nAll other\n4.0 \n(16.3)\n2023\n$\n1,245.1 \n2024\n$\n1,172.1 \nPart II\n40\nOPERATING RESULTS BY SEGMENT\nWe present our results of operations by segment at the gross profit level. We have three operating (and reportable) segments organized around our principal product lines: (1) Aggregates, (2) Asphalt and (3) Concrete. Management reviews earnings for our reporting segments principally at the gross profit level.\n1.\nAGGREGATES\nSHIPMENTS\nin millions\nAggregates shipments decreased 6%, reflecting underlying demand as well as the impacts from severe weather events in the third quarter which were not all recovered during the fourth quarter of 2024.\nOur year-over-year freight-adjusted selling price\n1\n for aggregates:\n▪\nincreased 10.8% in 2024\n▪\nincreased 15.9% in 2023\n▪\nincreased 10.3% in 2022\n1\nWe routinely arrange the delivery of our aggregates to the customer. Additionally, we incur freight costs to move aggregates from the production site to remote distribution sites. These costs are passed on to our customers in the aggregates price. We remove these pass-through freight & delivery revenues (and any other aggregates-derived segment revenues, such as landfill tipping fees) from the freight-adjusted selling price for aggregates. See the \"\nReconciliation of Non-GAAP Financial Measures\n\"\n within this Item 7 for a reconciliation of freight-adjusted revenues.\nPart II\n41\nThe pricing environment remained positive. Freight-adjusted pricing increased 10.8% ($2.06 per ton) versus the prior year to $21.08, with all markets realizing year-over-year improvement. \nAGGREGATES GROSS PROFIT\nin millions\nAGGREGATES CASH GROSS PROFIT\nin millions\nAggregates segment gross profit increased 5% to $1,816.7 million (or $8.26 per ton), and gross profit margin expanded 120 basis points. Cash gross profit per ton increased 12% (or $1.15 per ton) from the prior year to $10.61 resulting from continued pricing growth and moderating cost trends. Improvements in unit profitability were widespread across our footprint.\nFreight-adjusted unit cash cost of sales increased 10%, or $0.91 per ton. Shipments in 2024 and 2023 were negatively impacted by the absence of tons available from our Mexico operations which were unexpectedly and arbitrarily shut down by the Mexican government in 2022 (f\nor additional information, see Note 12 “\nCommitments and Contingencies\n” in Item 8 “\nFinancial Statements and Supplementary D\nata\n”)\n. \n2\nASPHALT\nSHIPMENTS\nin millions\nAsphalt segment gross profit was $170.1 million (an increase of $20.5 million), and cash gross profit was $214.2 million, a 16% increase from the prior year. Shipments increased slightly, and pricing increased 5.7%, or $4.33 per ton. \nASPHALT GROSS PROFIT\nin millions\nASPHALT CASH GROSS PROFIT\nin millions\nOur year-over-year average sales price\n1\n for asphalt mix:\n•\nincreased 5.7% in 2024\n•\nincreased 6.3% in 2023\n•\nincreased 21.2% in 2022\n1\nAsphalt mix average sales price is calculated by dividing revenues generated from the shipment of asphalt mix by the total tons shipped. The sales price calculation excludes service revenues generated from our asphalt construction paving business.\nPart II\n42\n3.\nCONCRETE\nSHIPMENTS\nin millions\nConcrete segment gross profit was $12.8 million, a decrease of $49.3 million from the prior year which included earnings from our divested operations in Texas. Cash gross profit was $58.3 million, and unit cash gross profit was $16.35 per cubic yard.\nCONCRETE GROSS PROFIT\nin millions\nCONCRETE CASH GROSS PROFIT\nin millions\nOur year-over-year average sales price\n1\n for ready-mixed concrete:\n▪\nincreased 9.6% in 2024\n▪\nincreased 10.7% in 2023\n▪\nincreased 11.1% in 2022\n1\nReady-mixed concrete average sales price is calculated by dividing revenues generated from the shipment of ready-mixed concrete by the total cubic yards shipped. The sales price calculation excludes immaterial revenues generated from the sale of raw materials.\nPart II\n43\nSELLING, ADMINISTRATIVE AND GENERAL EXPENSES\nin millions\nAs a percentage of total revenues, SAG expense was:\n▪\n7.2% in 2024 — increased 20 basis points\n▪\n7.0% in 2023 — unchanged from the prior year\n▪\n7.0% in 2022 — decreased 50 basis points\nOur comparative headcount levels at year-end:\n▪\nincreased 9% in 2024\n▪\ndecreased 8% in 2023\n▪\nincreased 6% in 2022\nThe 2024 increase in our employment level was primarily the result of acquisitions (see Note 19 \"\nAcquisitions and Divestitures\n\" in",
  "item2": null
}