{
  "item1": "now operate one segment, Insurance, which primarily serves P&C insurance customers across most personal commercial lines business, focusing fundamental building blocks insurance programs, prediction loss, selection pricing risk, compliance reporting requirements each U.S. state which they operate. also develop utilize machine-learned artificially intelligent models forecast scenarios produce both standard customized analytics help customers better manage businesses, including detecting fraud before after loss event quantifying losses. customers, acquired over more than 50 years, include most P&C insurance providers U.S.",
  "item7": "Selling, general administrative expenses (\"SGA\") w illion year ended million year ended . recent acquisitions dispositions accounted increase $22.7 million SGA. increase primarily due acquisition-related earn-out credit $20.0 million prior year did not recur current period. offsetting decrease $ % primarily due prior year litigation reserve expense $38.2 million related former Financial Services segment, decreases fees membership costs $3.2 million, bad debt expense $1.1 million, other operating costs $1.2 million, partially offset increase professional consulting fees $15.8 million , salaries employee benefits $12.3 million, $6.5 million loss disposal assets primarily due write-off leasehold improvements related lease modification, increases insurance expense $2.0 million, information technology expense $1.3 million.",
  "item2": "syndicated revolving credit facility (\"Syndicated Revolving Credit Facility\") borrowing capacity $1,000.0 million Bank America N.A., HSBC Bank USA, N.A., JP Morgan Chase Bank, N.A., Wells Fargo Bank, National Association, Citibank, N.A., Morgan Stanley Bank, N.A., TD Bank, N.A., Goldman Sachs Bank USA, Northern Trust Company maturity date April 5, 2028. August 15, 2025, entered into Third Amended Restated Credit Agreement (the \"Amendment Restatement\") Syndicated Revolving Credit Facility Bank America, N.A. administrative agent. Amendment Restatement increased borrowing capacity $1,250.0 million extends maturity date August 15, 2030."
}