{
  "source_file": "vrsn-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nYou should read the following discussion in conjunction with the 2024 Form 10-K and the interim unaudited Condensed Consolidated Financial Statements and related notes included in Part I, Item I of this Quarterly Report on Form 10-Q.\nThis Quarterly Report on Form 10-Q contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). These forward-looking statements are based on current expectations and assumptions and involve risks, uncertainties, and other important factors, including, among other things, statements regarding the Company’s quarterly dividend and our expectations about the sufficiency of our existing cash, cash equivalents and marketable securities, and funds generated from operations, together with our borrowing capacity under the unsecured revolving credit facility. In some cases, you can identify forward-looking statements by terms such as “assumes,” “could,” “estimates,” “forecasts,” “may,” “plans,” “potential,” “predicts,” “projects,” “should,” “targets,” “will,” “would,” “seeks,”  “expects,” “anticipates,” “intends,” “believes” and similar language intended to identify forward-looking statements. Our actual results may differ significantly from those projected in the forward-looking statements. Factors that might cause or contribute to such differences include, but are not limited to, those discussed in the section titled “Risk Factors” in Part II, Item 1A of the Quarterly Report on Form 10-Q for the period ended March 31, 2025. You should also carefully review the risks described in other documents we file from time to time with the Securities and Exchange Commission, including the Quarterly Reports on Form 10-Q or Current Reports on Form 8-K that we file in 2025. You are cautioned not to place undue reliance on the forward-looking statements, which speak only as of the date of this Quarterly Report on Form 10-Q. We undertake no obligation to update publicly or revise such statements, whether as a result of new information, future events, or otherwise, except as required by law.\nFor purposes of this Quarterly Report on Form 10-Q, the terms “Verisign,” “the Company,” “we,” “us,” and “our” refer to VeriSign, Inc. and its consolidated subsidiaries.\nOverview\nWe are a global provider of critical internet infrastructure and domain name registry services, enabling internet navigation for many of the world’s most recognized domain names. We help enable the security, stability, and resiliency of the Domain Name System and the internet by providing Root Zone Maintainer Services, operating two of the thirteen global internet root servers, and providing registration services and authoritative resolution for the .\ncom\n and .\nnet\n generic top-level domains (“gTLDs”), which support the majority of global e-commerce.\nAs of September 30, 2025, we had 171.9 million \n.com\n and \n.net \nregistrations in the domain name base. The number of domain names registered is largely driven by continued growth in online advertising, e-commerce, and the number of internet users, which is partially driven by greater availability of internet access, as well as marketing activities carried out by us and our registrars. The number of domain name registrations under our management may be negatively impacted by certain factors, including overall economic conditions, competition from country code top-level domains (“ccTLDs”), other gTLDs, services that offer alternatives for an online presence, such as social media and artificial intelligence, and ongoing changes in the internet practices and behaviors of consumers and businesses. Factors such as the evolving practices and preferences of internet users, and how they navigate the internet, as well as the motivation of domain name registrants and how they will manage their investment in domain names, can negatively impact our business and the demand for new domain name registrations and renewals. \nBusiness Highlights and Trends\n•\nWe recorded revenues of $419.1 million and $1,231.3 million during the three and nine months ended September 30, 2025, which represents an increase of 7% and 6%, respectively, compared to the same periods in 2024. \n•\nWe recorded operating income of $284.3 million and $836.2 million during the three and nine months ended September 30, 2025, which represents an increase of 6% and 5%, respectively, compared to the same periods in 2024. \n•\nAs of September 30, 2025, we had 171.9 million \n.com\n and \n.net \nregistrations in the domain name base, which represents a 1.4% increase from September 30, 2024, and a net increase of 1.4 million domain name registrations from June 30, 2025.\n•\nDuring the three months ended September 30, 2025, we processed 10.6 million new domain name registrations for \n.com \nand \n.net\n compared to 9.3 million for the same period in 2024.\n \n•\nThe final .\ncom\n and .\nnet \nrenewal rate for the second quarter of 2025 was 75.5% compared to 72.7% for the second quarter of 2024. Renewal rates are not fully measurable until 45 days after the end of the quarter. \n•\nWe generated cash flows from operating activities of $801.5 million during the nine months ended September 30, 2025, compared to $671.1 million for the same period in 2024. \n13\nTable of Contents\n•\nDuring the three months ended September 30, 2025, we repurchased 0.8 million shares of common stock for an aggregate cost of $215.0 million. As of September 30, 2025, there was $1.33 billion remaining for future share repurchases under the share repurchase program.\n•\nOn October 21, 2025, the Board of Directors declared a cash dividend of $0.77 per share of the Company’s outstanding common stock to stockholders of record as of the close of business on November 18, 2025, payable on November 25, 2025.\nPursuant to our agreements with ICANN, we make available files containing all active domain names registered in the \n.com\n and \n.net\n registries. Further, we also make available a summary of the active zone count registered in the \n.com\n and\n .net\n registries and the number of \n.com\n and \n.net\n domain name registrations in the domain name base. The zone counts and information on how to obtain access to the zone files can be found at https://www.Verisign.com/zone. The domain name base is the active zone plus the number of domain names that are registered but not configured for use in the respective top-level domain zone file plus the number of domain names that are in a client or server hold status. The domain name base may also reflect compensated or uncompensated judicial or administrative actions to add or remove from the active zone an immaterial number of domain names. These files and the related summary data are updated daily. The update times may vary each day. The number of domain names provided in this Form 10-Q are as of midnight of the date reported. \nResults of Operations\nThe following table presents information regarding our results of operations as a percentage of revenues:\nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nRevenues\n100.0 \n%\n100.0 \n%\n100.0 \n%\n100.0 \n%\nCosts and expenses:\nCost of revenues\n11.6 \n12.0 \n12.0 \n12.3 \nResearch and development\n6.1 \n5.9 \n6.3 \n6.2 \nSelling, general and administrative\n14.5 \n13.2 \n13.8 \n13.1 \nTotal costs and expenses\n32.2 \n31.1 \n32.1 \n31.6 \nOperating income\n67.8 \n68.9 \n67.9 \n68.4 \nInterest expense\n(4.5)\n(4.8)\n(4.7)\n(4.9)\nNon-operating income, net\n1.5 \n2.7 \n1.6 \n3.1 \nIncome before income taxes\n64.8 \n66.8 \n64.8 \n66.6 \nIncome tax expense\n(14.0)\n(15.3)\n(14.5)\n(15.5)\nNet income\n50.8 \n%\n51.5 \n%\n50.3 \n%\n51.1 \n%\nRevenues\nOur revenues are primarily derived from registrations for domain names in the\n .com\n and \n.net\n domain name registries. We also derive revenues from operating domain name registries and technical systems for several other gTLDs and one ccTLD, all of which are not significant in relation to our consolidated revenues. For domain names registered in the .\ncom\n and .\nnet\n registries, we receive a fee from registrars per annual registration that is determined pursuant to our agreements with ICANN. Individual customers, called registrants, contract directly with registrars or their resellers, and the registrars, who are our direct customers, in turn register the domain names with Verisign. Changes in revenues are driven largely by changes in the number of new domain name registrations and the renewal rate for existing registrations as well as the impact of new and prior price increases, to the extent permitted by ICANN and the Department of Commerce. New registrations and the renewal rate for existing registrations are impacted by continued growth in online advertising, e-commerce, and the number of internet users, as well as marketing activities carried out by us and our registrars. We also offer promotional incentive-based discount programs to registrars based upon market conditions and the business environment in which the registrars operate. \nIn November 2024, we renewed the \n.com\n Registry Agreement with ICANN, pursuant to which we will remain the sole registry operator for the \n.com\n registry through November 30, 2030. Under the .\ncom\n Registry Agreement, we are permitted to increase the price of a \n.com\n domain name registration by up to 7% in each of the final four years of each six-year period. The current such six-year period began on October 26, 2024. We increased the annual registry-level wholesale fee for each new and renewal .\ncom\n domain name registration from $9.59 to $10.26 effective September 1, 2024. Under the \n.net \nRegistry Agreement, we are permitted to increase the price of \n.net \ndomain name registrations by up to 10% each year during the term of our agreement with ICANN, through June 30, 2029. We increased the annual registry-level wholesale fee for each new and \n14\nTable of Contents\nrenewal \n.net\n domain name registration from $9.92 to $10.91 effective February 1, 2024. All fees paid to us for \n.com\n and \n.net\n registrations are in U.S. dollars. \nA comparison of revenues is presented below:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n% Change\n2024\n2025\n% Change\n2024\n \n(Dollars in millions)\nRevenues\n$\n419.1 \n7%\n$\n390.6 \n$\n1,231.3 \n6%\n$\n1,162.0 \nThe following table compares the \n.com\n and \n.net \ndomain name registrations in the domain name base:\nSeptember 30, 2025\n% Change\nSeptember 30, 2024\n.com\n and \n.net\n domain name registrations in the domain name base\n171.9 million\n1%\n169.6 million\nRevenues increased during the three and nine months ended September 30, 2025, as compared to the same periods last year, primarily due to the .\ncom\n and .\nnet\n price increases and an increase in the domain name base as of September 30, 2025 compared to September 30, 2024.\nDemand for \n.com\n and \n.net\n domain names has been primarily driven by continued internet growth and marketing activities carried out by us and our registrars. However, the demand for .\ncom\n and .\nnet\n domain names may be limited by competitive pressure from other TLDs and alternatives for an online presence, such as social media and artificial intelligence.  Additionally, changes in internet practices, consumer behavior, and global economic conditions, as well as the motivation of existing domain name registrants managing their investment in domain names, such as for resale at increased prices or for revenue generation through website advertising, may impact demand for .\ncom\n and .\nnet\n domain names. Our domain name base increased during the three and nine months ended September 30, 2025 compared to December 31, 2024, with higher new registrations and renewal rates, as business conditions improved following a period of decline during 2024 and as registrars focus more on customer acquisition and have continued to engage with our marketing programs.\nGeographic revenues\nWe generate revenues in the U.S.; Europe, the Middle East and Africa (“EMEA”); Australia, China, Japan, Singapore, and other Asia Pacific countries (“APAC”); and certain other countries, including Canada and Latin American countries.\nThe following table presents a comparison of our geographic revenues:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n% Change\n2024\n2025\n% Change\n2024\n \n(Dollars in millions)\nU.S.\n$\n275.9 \n6%\n$\n260.2 \n$\n812.5 \n5%\n$\n773.2 \nEMEA\n71.2 \n13%\n62.8 \n207.0 \n12%\n184.7 \nAPAC\n47.0 \n8%\n43.5 \n136.9 \n4%\n132.2 \nOther\n25.0 \n4%\n24.1 \n74.9 \n4%\n71.9 \nTotal revenues\n$\n419.1 \n$\n390.6 \n$\n1,231.3 \n$\n1,162.0 \nRevenues in the table above are attributed to the country of domicile and the respective regions in which our registrars are located; however, this may differ from the regions where the registrars operate or where registrants are located. Revenue growth for each region may be impacted by registrars reincorporating, relocating, or from acquisitions or changes in affiliations of resellers. Revenue growth for each region may also be impacted by registrars domiciled in one region, registering domain names in another region. While revenues increased in all regions during the three and nine months ended September 30, 2025, compared to the same periods in 2024, the majority of our revenue growth was generated from registrars based in the U.S. and EMEA.\nCost of revenues\nCost of revenues consists primarily of salaries and employee benefits expenses for our personnel who manage the operational systems, depreciation expenses, operational costs associated with the delivery of our services, fees paid to ICANN, customer support and training, costs of facilities and computer equipment used in these activities, telecommunications expense and allocations of indirect costs such as corporate overhead. \n15\nTable of Contents\nA comparison of cost of revenues is presented below:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n% Change\n2024\n2025\n% Change\n2024\n \n(Dollars in millions)\nCost of revenues\n$\n48.8 \n4%\n$\n46.8 \n$\n147.3 \n3%\n$\n143.0 \nCost of revenues increased during the three months ended September 30, 2025, compared to the same period last year, due to a combination of individually insignificant factors.\nCost of revenues increased during the nine months ended September 30, 2025, compared to the same period last year, primarily due to increases in compensation and benefits expenses and a combination of individually insignificant factors, partially offset by a decrease in depreciation expenses. Compensation and benefits expenses increased by $4.4 million primarily due to annual salary increases, an increase in bonus expenses, an increase in average headcount, and a combination of other individually insignificant factors. Depreciation expenses decreased by $3.0 million due to a decrease in capital expenditures in recent periods.\nResearch and development\nResearch and development expenses consist primarily of costs related to research and development personnel, including salaries and other personnel-related expenses, consulting fees, facilities costs, computer and communications equipment, support services used in our service and technology development, and allocations of indirect costs such as corporate overhead. \nA comparison of research and development expenses is presented below:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n% Change\n2024\n2025\n% Change\n2024\n \n(Dollars in millions)\nResearch and development\n$\n25.4 \n10%\n$\n23.2 \n$\n77.1 \n7%\n$\n71.8 \nResearch and development expenses increased during the three months ended September 30, 2025, compared to the same period last year, due to a combination of individually insignificant factors.\nResearch and development expenses increased during the nine months ended September 30, 2025, compared to the same period last year, primarily due to a $3.8 million increase in compensation and benefit expenses as a result of an increase in bonus expenses and annual salary increases. \nSelling, general and administrative\nSelling, general and administrative expenses consist primarily of salaries and other personnel-related expenses for our executive, administrative, legal, finance, information technology, human resources, sales, and marketing personnel, travel and related expenses, trade shows, costs of computer and communications equipment and support services, consulting and professional service fees, costs of marketing programs, costs of facilities, management information systems, support services, and certain tax and license fees, offset by allocations of indirect costs such as facilities and shared services expenses to other cost types. \nA comparison of selling, general and administrative expenses is presented below:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n% Change\n2024\n2025\n% Change\n2024\n \n(Dollars in millions)\nSelling, general and administrative\n$\n60.6 \n18%\n$\n51.3 \n$\n170.7 \n12%\n$\n152.8 \nSelling, general and administrative expenses increased during the three months ended September 30, 2025, compared to the same period last year, primarily due to increases in compensation and benefits expenses, legal expenses, and a combination of individually insignificant factors. Compensation and benefits expenses increased by $4.0 million primarily due to an increase in average headcount, an increase in bonus expenses, annual salary increases, and a combination of other individually insignificant factors. Legal expenses increased by $2.8 million due to an increase in litigation expenses.\n16\nTable of Contents\nSelling, general and administrative expenses increased during the nine months ended September 30, 2025, compared to the same period last year, primarily due to increases in compensation and benefit expenses, stock-based compensation expenses, and equipment and software expenses, partially offset by an increase in overhead expenses allocated to other cost types. Compensation and benefits expenses increased by $8.7 million primarily due to an increase in average headcount, an increase in bonus expenses, higher expenses for certain employee health-insurance related benefits, and annual salary increases. Stock-based compensation expenses increased by $5.6 million primarily due to an increase in the total projected achievement levels on certain performance-based RSU grants and an increase in the total value of RSUs granted in 2025. Equipment and software expenses increased by $3.3 million primarily due to increases in expenses related to network security and other software services. Overhead expenses allocated to other cost types increased by $2.6 million due to an increase in total allocable expenses.\nInterest expense\nInterest expense increased slightly during the nine months ended September 30, 2025, compared to the same period last year, primarily due to the period of overlap between the issuance of the 2032 Notes and repayment of the 2025 Notes.\nNon-operating income, net\nThe following table presents the components of non-operating income, net:\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\n(In millions)\nInterest income\n$\n6.7 \n$\n8.7 \n$\n20.6 \n$\n30.4 \nOther, net\n(0.4)\n1.8 \n(1.3)\n5.5 \nTotal non-operating income, net\n$\n6.3 \n$\n10.5 \n$\n19.3 \n$\n35.9 \nInterest income is earned primarily from our surplus cash balances and marketable securities. The decrease in interest income during the three and nine months ended September 30, 2025, compared to the same periods last year, primarily reflects the lower amounts invested in debt securities in the current periods and slightly lower interest rates on our investments in debt securities. Other, net, reflects net gains and losses from our foreign currency exposure and related hedges.\nIncome tax expense\nThe following table presents income tax expense and the effective tax rate:\n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\n2025\n2024\n \n(Dollars in millions)\nIncome tax expense\n$\n58.9 \n$\n59.6 \n$\n177.9 \n$\n179.6 \nEffective tax rate\n22 \n%\n23 \n%\n22 \n%\n23 \n%\nThe effective tax rate for each of the periods in the table above differed from the statutory federal rate of 21%, due to state income taxes and U.S. taxes on foreign earnings, net of foreign tax credits, partially offset by a lower foreign effective tax rate. \nHouse Resolution 1, commonly referred to as the One Big Beautiful Bill Act, was enacted into law on July 4, 2025 (the “Act”).  The tax regulations included in the Act did not have a material impact on our effective tax rate for the periods presented, and we do not expect the Act to have a material impact on our effective tax rate for 2025. We are currently evaluating the impact that the tax regulations may have on our financial statements in future years.\n17\nTable of Contents\nLiquidity and Capital Resources\nThe following table presents our principal sources of liquidity:\nSeptember 30,\nDecember 31,\n2025\n2024\n \n(In millions)\nCash and cash equivalents\n$\n235.4 \n$\n206.7 \nMarketable securities\n382.3 \n393.2 \nTotal\n$\n617.7 \n$\n599.9 \nThe marketable securities primarily consist of debt securities issued by the U.S. Treasury meeting the criteria of our investment policy, which is focused on the preservation of our capital through investment in investment grade securities. The cash equivalents consist of amounts invested in money market funds, time deposits and U.S. Treasury bills purchased with original maturities of three months or less. As of September 30, 2025, all of our debt securities have contractual maturities of less than one year. Our cash and cash equivalents are readily accessible. For additional information on our investment portfolio, see Note 2, “Financial Instruments,” of our Notes to Condensed Consolidated Financial Statements in Part I, Item I of this Quarterly Report on Form 10-Q. \nEffective July 24, 2025, the Board of Directors authorized the repurchase of common stock in the amount of $913.1 million, in addition to the $586.9 million that remained available for repurchases under the prior share repurchase authorization, for a total repurchase authorization of up to $1.50 billion under the program. During the three months ended September 30, 2025, we repurchased 0.8 million shares of common stock for an aggregate cost of $215.0 million. As of September 30, 2025, there was $1.33 billion remaining available for future share repurchases under the share repurchase program.\nIn April 2025, we initiated a quarterly cash dividend. In the nine months ended September 30, 2025, we paid dividends of $144.1 million. On October 21, 2025, our Board of Directors declared a cash dividend of $0.77 per share of the Company’s outstanding common stock to stockholders of record as of the close of business on November 18, 2025, payable on November 25, 2025. We intend to continue to pay a cash dividend on a quarterly basis, subject to market conditions and approval by the Board of Directors.\nOn March 11, 2025, we issued $500.0 million of the 2032 Notes. On March 31, 2025, we used the net proceeds from the 2032 Notes, along with cash on hand, to fund the repayment of all of our $500.0 million aggregate principal amount of outstanding 2025 Notes. As of September 30, 2025, we also had $750.0 million principal amount outstanding of 2.70% senior unsecured notes due 2031 and $550.0 million principal amount outstanding of 4.75% senior unsecured notes due 2027. As of September 30, 2025, we had no outstanding borrowings and $200.0 million in borrowing capacity under our credit facility which matures in 2028.\nWe believe existing cash, cash equivalents and marketable securities, and funds generated from operations, together with our ability to arrange for additional financing should be sufficient to meet our working capital, capital expenditure requirements, fund our quarterly dividend, and to service our debt for the next 12 months and beyond. We regularly assess our cash management approach and activities in view of our current and potential future needs. Our cash requirements have not changed materially since the 2024 Form 10-K.\nIn summary, our cash flows for the nine months ended September 30, 2025 and 2024 were as follows:\nNine Months Ended September 30,\n \n2025\n2024\n \n(In millions)\nNet cash provided by operating activities\n$\n801.5 \n$\n671.1 \nNet cash provided by investing activities\n0.6 \n307.0 \nNet cash used in financing activities\n(777.3)\n(951.0)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n0.1 \n0.1 \nNet increase in cash, cash equivalents, and restricted cash\n$\n24.9 \n$\n27.2 \nCash flows from operating activities\nOur largest source of operating cash flows is cash collections from our customers. Our primary uses of cash from operating activities are for personnel-related expenditures and other general operating expenses, as well as payments related to taxes, interest and facilities.\n18\nTable of Contents\nNet cash provided by operating activities increased during the nine months ended September 30, 2025, compared to the same period last year, primarily due to an increase in cash received from customers, decreases in cash paid for income taxes and cash paid to employees and vendors, partially offset by an increase in cash paid for interest. Cash received from customers increased primarily due to the .\ncom\n and .\nnet\n price increases and higher .\ncom\n domain name registrations and renewals. Cash paid for income taxes decreased primarily due to the enactment of the Act which restored the immediate deduction of research and experimentation expenses for U.S. federal income taxes. Cash paid to employees and vendors decreased primarily due to the timing of payments. Cash paid for interest increased due to the payment of interest on our 2032 Notes in June 2025. \nCash flows from investing activities\nThe changes in cash flows from investing activities primarily relate to purchases, maturities and sales of marketable securities, and purchases of property and equipment. \nNet cash provided by investing activities decreased during the nine months ended September 30, 2025, compared to the same period last year, primarily due to a decrease in proceeds from maturities and sales of marketable securities, net of purchases of marketable securities.\nCash flows from financing activities\nThe changes in cash flows from financing activities primarily relate to proceeds from and repayment of borrowings, share repurchases, dividend payments, payment of excise tax on share repurchases, and proceeds from our employee stock purchase plan.\nNet cash used in financing activities decreased during the nine months ended September 30, 2025, compared to the same period last year, primarily due to proceeds received from the issuance of our 2032 Notes and a decrease in share repurchases, partially offset by the repayment of our 2025 Notes, dividend payments to shareholders, and payment of excise tax on share repurchases."
}