{
  "source_file": "vistra-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nMANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis of our financial condition and results of operations should be read together with the condensed consolidated financial statements and related notes included in Part I, Item 1 \nFinancial Statements\n.\nSignificant Activities and Events, and Items Influencing Future Performance\nAcquisition of Natural Gas Generation Facilities\nOn October 22, 2025 (Acquisition Date), pursuant to a purchase and sale agreement dated May 15, 2025, Vistra Operations acquired 100% of the membership interests of subsidiaries of Lotus (the Acquisition). The Acquisition resulted in the addition of seven natural gas generation facilities totaling 2,600 MW in Delaware and Pennsylvania (PJM), Rhode Island (ISO-NE), New York (NYISO), and California (CAISO) further geographically diversifying Vistra's natural gas fleet.\nThe aggregate purchase price consisted of a base purchase price of $1.9 billion, subject to certain customary adjustments, including the acquired companies' working capital, cash, indebtedness, and certain other adjustments. Vistra Operations funded the Acquisition with a combination of cash and the assumption of the acquired companies' indebtedness, which consisted of a senior secured credit facility, including an existing term loan with approximately $800 million principal outstanding, which reduced the cash consideration payable at closing. Cash consideration payable at closing, excluding adjustments for the acquired companies' working capital, cash, and certain other adjustments, was $1.1 billion. See Note 2 to the Financial Statements for more information concerning the Acquisition.\nComanche Peak Power Purchase Agreement\nIn September 2025, Vistra entered into a 20-year power purchase agreement (with options to extend for up to an additional 20 years) with a large, investment grade company (the Customer), pursuant to which Vistra has agreed to supply to the Customer 1,200 MW of carbon-free power from the Comanche Peak Nuclear Power Plant. Vistra anticipates power delivery to begin in the fourth quarter of 2027 and ramp to full capacity by 2032.\nCapacity Markets — PJM Auction Results\nIn July 2025, Vistra received its results from PJM's Reliability Pricing Model (RPM) auction results for planning year 2026-2027, and the table below lists clearing price per MW-day and our cleared capacity volumes by zone:\nClearing Price per MW-day\nTotal \nMW Cleared\nRTO zone\n$\n329.17 \n3,969 \nComEd zone\n$\n329.17 \n2,082 \nDEOK zone\n$\n329.17 \n952 \nEMAAC zone\n$\n329.17 \n615 \nMAAC zone\n$\n329.17 \n445 \nATSI zone\n$\n329.17 \n2,048 \nDOM zone\n$\n329.17 \n203 \nTotal\n10,314 \nNuclear Plant License Renewal\nIn July 2025, our application for license renewal at our Perry Nuclear Plant was approved by the NRC. The license now extends through 2046.\n57\nTable of Contents\nOBBBA and CAMT\nIn July 2025, the legislation known as the OBBBA was signed into law and we have accounted for the effects in our consolidated financial statements. Key changes include the immediate expensing of domestic research and development costs, the reinstatement of 100% bonus depreciation, and increases in the limitation of interest deductibility. Certain provisions of the OBBBA will change the timing of cash tax payments in the current fiscal year and future year periods, however the legislation did not have a material impact on our consolidated financial statements. We do not expect Vistra to be subject to the corporate alternative minimum tax (CAMT) in the 2025 tax year as it applies only to corporations with a three-year average annual adjusted financial statement income in excess of $1 billion. We have taken the CAMT and forecasted OBBBA impacts into account when forecasting cash taxes.\nMacroeconomic Conditions\n \nOur industry is subject to uncertainties associated with the impact of rapidly evolving technology on U.S. electricity demand, as well as evolving political, regulatory and economic uncertainties.\nElectricity Demand\nEmerging electricity demand drivers including the rise of large-scale data centers, the electrification of oil field operations, and electric vehicle load building are contributing to a faster-paced load growth in the regions we serve. Our integrated retail electricity and power generation operations allows us to quickly respond to electricity demand changes. We are actively engaged in discussions with various counterparties regarding the potential long-term sale of power from both our operating nuclear and gas facilities as well as facilities in development to support large-scale electricity consumers.\nOur business and these types of transactions are subject to inherent risks and uncertainties, including regulatory reviews, necessary approvals, and potential legislative actions. Such factors could affect the timing and feasibility of finalizing any definitive agreements with large scale electricity consumers.\nSupply Chain Constraints\nOur industry continues to face ongoing supply chain constraints and labor shortages, which have reduced the availability of essential equipment and supplies for constructing new generation facilities, increased lead times for procuring materials and raised labor costs associated with maintaining our natural gas, nuclear, and coal fleet.\nWe are proactively managing these constraints by continuously re-evaluating the business cases and timing of our planned development projects. This has led to the deferral or abandonment of some planned capital expenditures for our solar and battery projects and could impact the economic feasibility of additional projects in our new generation development pipeline. We are engaging with suppliers to secure key materials needed to maintain our existing generation facilities before future planned outages.\nRussia/Ukraine Conflict\nWe are closely monitoring developments in the Russia and Ukraine conflict, specifically sanctions (or potential sanctions) against Russian energy exports and Russian nuclear fuel supply and enrichment activities, and actions by Russia to limit energy deliveries, which may further impact commodity prices in Europe and globally. The Prohibiting Russian Uranium Imports Act (PRUI Act), which was signed into law on August 11, 2024, prohibits importation of Russian uranium; however, the Department of Energy can issue waivers (subject to decreasing annual caps) until December 31, 2027 if there is no alternate source of low-enriched uranium available to keep U.S. nuclear reactors operating or is in the national interest. Additionally, passage of the PRUI Act enabled the allocation of $2.72 billion in federal funding to ramp up production of domestic uranium fuel. On November 15, 2024, the Russian Federation temporarily suspended shipments of uranium to the U.S., stating that they would grant future export licenses on a case-by-case basis.\n58\nTable of Contents\nOur 2025 and 2026 refueling plans have not been affected by the Russia and Ukraine conflict, nor have we seen any disruption to the delivery of nuclear fuel impacting our refueling schedules. All nuclear fuel requirements for 2025 and 2026 are either in inventory or are onshore. We work with a diverse set of global nuclear fuel cycle suppliers to procure our nuclear fuel years in advance. We have nuclear fuel contracted to support all our refueling needs through 2030 without any additional Russian deliveries. We continue to take affirmative action by building strategic inventory and deploying mitigating strategies in our procurement portfolio to ensure we can secure the nuclear fuel needed to continue to operate our nuclear facilities through potential Russian supply disruption.\nMoss Landing 300 Incident\nOn January 16, 2025, we detected a fire at our Moss Landing 300 MW energy storage facility at the Moss Landing Power Plant site (the Moss Landing Incident) that resulted in ceasing operations at all facilities at the Moss Landing complex until the fire was contained. No injuries occurred due to the fire or the Company's response. The Moss Landing complex includes two other battery facilities and a gas plant. The gas plant returned to service in February 2025, but the two other battery facilities remain offline as we continue to investigate the cause of the fire. We expect the Moss Landing 350 MW battery to return to service in late 2025 or early 2026. There is less certainty about the return to service regarding the Moss Landing 100 MW battery. We will know more after the investigation of the cause of the Moss Landing Incident is complete. As of September 30, 2025, the net book value of the Moss Landing 100 facility was approximately $165 million.\nAs a result of the damage caused by the Moss Landing Incident, during the three months ended March 31, 2025, we wrote-off the net book value of Moss Landing 300 of approximately $400 million to depreciation expense and moved the asset to the Asset Closure segment as we have no plans to return the Moss Landing 300 facility to operations (see Notes 6 and 16 to the Financial Statements for additional information).\nIn July 2025, we entered into an Administrative Settlement Agreement and Order on Consent (ASAOC) with the EPA related to the Moss Landing 300 site. Under the ASAOC, we are required to perform specific battery removal and remediation activities, including battery removal and disposal, building demolition, and air and water monitoring. We estimate the total cost of these activities to be approximately $110 million. We have incurred expenses of approximately $29 million on ASAOC activities through September 30, 2025. As of September 30, 2025, our accrual for estimated future costs for the ASAOC activities is approximately $81 million, of which, $68 million is reflected in other current liabilities and $13 million is reflected in other noncurrent liabilities and deferred credits in the condensed consolidated balance sheets. This estimate assumes the ASAOC activities will be completed by the end of 2026. Aside from battery removal and disposal, our estimate does not reflect costs associated with removal of other hazardous waste that could be identified as the demolition progresses as we are unable to estimate such costs until sampling of waste material is complete. We will account for any adjustments to the accrual as a change in estimate in the period new information becomes available.\nAdditional impacts from the Moss Landing Incident include loss of revenue from the facilities being offline and may include litigation costs and penalties under contracts. We are currently unable to estimate the full impact the Moss Landing Incident will have on us as our estimate will evolve as demolition progresses. See Note 13 to the Financial Statements for additional information.\nWe have filed insurance claims against applicable insurance policies with combined business interruption and property loss limits of $500 million, net of deductibles. See Note 1 to the Financial Statements for additional information. Given uncertainty in timing of remaining insurance recoveries and additional expenses that could be incurred related to the fire, we cannot predict the full impact this event will have on our 2025 financial statements.\nMartin Lake Unit 1 Incident\nOn November 27, 2024, we experienced a fire at Unit 1 of our Martin Lake facility in ERCOT (the Martin Lake Incident), an 815 MW unit. We wrote-off the unit's net book value of less than $1 million to depreciation expense in December 2024. We expect the unit to return to service in late 2025 or early 2026. We estimate total cash capital expenditures required to restore the unit to service will be approximately $355 million, of which approximately $155 million in cash capital expenditures were incurred in the nine months ended September 30, 2025.\nWe expect to recover a majority of the expenditures associated with the Martin Lake Incident through property damage insurance and to receive additional business interruption proceeds. See Note 1 to the Financial Statements for additional information. Given uncertainty in timing of remaining insurance recoveries, we cannot predict the full impacts this event will have on our 2025 financial statements.\n59\nTable of Contents\nAcquisition of Noncontrolling Interest\nOn September 18, 2024 (the UPA Transaction Date), Vistra Operations and Vistra Vision Holdings I LLC, an indirect subsidiary of Vistra Operations (Vistra Vision Holdings), entered into separate Unit Purchase Agreements (as amended, the UPAs) with each of Nuveen Asset Management, LLC (Nuveen) and Avenue Capital Management II, L.P. (Avenue), pursuant to which Vistra Vision Holdings agreed to purchase each of Nuveen's and Avenue's combined 15% noncontrolling interest in Vistra Vision for approximately $3.2 billion in cash (collectively, the Transaction). The Transaction closed on December 31, 2024 and Vistra Vision Holdings now owns 100% of the equity interests in Vistra Vision. See Notes 2 and 9 to the Financial Statements for additional information.\nPlanned Gas-Fueled Dispatchable Power in ERCOT\nIn May 2024, we announced our intention to add up to 2,000 MW of dispatchable, natural gas-fueled electricity capacity in west, central, and north Texas consisting of the following projects:\n•\nBuilding up to 860 MW of advanced simple-cycle peaking plants to be located in west Texas to support the increasing power needs of the region, including the state's oil and gas industry.\n•\nRepowering the coal-fueled Coleto Creek Power Plant near Goliad, Texas, set to retire in 2027 to comply with EPA rules, as a natural-gas fueled plant with up to 600 MW of capacity.\n•\nCompleting upgrades at existing natural gas-fueled plants that will add more than 500 MW of summer capacity and 100 MW of winter capacity.\nIn July 2024, we filed applications with the PUCT under the Texas Energy Fund loan program seeking financing for the 860 MW of new advanced simple-cycle peaking plants referenced above. Both projects were selected for due diligence as part of the Texas Energy Fund loan program, which is ongoing. An invitation to due diligence does not mean an applicant is awarded a loan.\nIn September 2025, we announced we will move forward with construction of the 860 MW peaking plants discussed above. Early development work is underway, and we anticipate the units will be online in 2028.\nMerger with Energy Harbor\nOn March 1, 2024 (Merger Date), pursuant to a transaction agreement dated March 6, 2023, (i) Vistra Operations transferred certain of its subsidiary entities into Vistra Vision, (ii) Black Pen Inc., a wholly owned subsidiary of Vistra, merged with and into Energy Harbor, (iii) Energy Harbor became a wholly owned subsidiary of Vistra Vision, and (iv) affiliates of Nuveen and Avenue exchanged a portion of the Energy Harbor shares held by Nuveen and Avenue for a 15% equity interest of Vistra Vision (collectively, Energy Harbor Merger). The Energy Harbor Merger combined Energy Harbor's and Vistra's nuclear and retail businesses and certain Vistra Zero renewables and energy storage facilities to provide diversification and scale across multiple carbon-free technologies (dispatchable and renewables/storage) and the retail business. The cash consideration for Energy Harbor Merger was funded by Vistra Operations using a combination of cash on hand and borrowings under the Commodity-Linked Facility, the Receivables Facility, and the Repurchase Facility. See Note 2 to the Financial Statements for additional information.\n60\nTable of Contents\nInflation Reduction Act of 2022 (IRA)\nIn August 2022, the U.S. enacted the IRA, which, among other things, implements substantial new and modified energy tax credits, including recognizing the value of existing carbon-free nuclear power by providing for a nuclear PTC, a solar PTC, new technology-neutral ITCs and PTCs that apply to various different clean energy technologies and a first-time stand-alone battery storage investment tax credit. The IRA also implements a 15% corporate alternative minimum tax (CAMT) on book income of certain large corporations, and a 1% excise tax on net stock repurchases. The section 45U nuclear PTC is available to existing nuclear facilities from 2024 through 2032 and provides a federal tax credit of up to $15 per MWh, subject to phase out when annual gross receipts are between $25.00 per MWh and $43.75 per MWh and $26.00 per MWh and $44.75 per MWh for 2024 and 2025, respectively (each subject to annual inflation adjustments). The Company accounts for transferable ITCs and PTCs we expect to receive by analogy to the grant model within International Accounting Standards 20, \nAccounting for Government Grants and Disclosures of Government Assistance\n. As discussed in Note 1 to the Financial Statements in our 2024 Form 10-K, we recognized transferable nuclear PTC revenues of $545 million in the year ended December 31, 2024. As discussed in Note 4 to the Financial Statements, we recognized transferable nuclear PTC revenues of $145 million in each of the three and nine months ended September 30, 2025. U.S. Treasury regulations are expected to further define the scope of the legislation in many important respects, including interpretive guidance on the definition of gross receipts for the nuclear PTC. Any interpretive guidance on the definition of gross receipts that differs from the interpretation used in our estimates could result in a material change to PTC revenues recorded in 2024 and 2025 and would be reflected as a change in estimate in the period in which the guidance is received\nCritical Accounting Policies and Estimates\nThe Company's discussion and analysis of its financial position and results of operations is based upon its condensed consolidated financial statements. The preparation of these condensed consolidated financial statements requires estimation and judgment that affect the reported amounts of revenue, expenses, assets, and liabilities. The Company bases its estimates on historical experience and on various other factors that are believed to be reasonable under the circumstances, the results of which form the basis for making judgments about the accounting for assets and liabilities that are not readily apparent from other sources. If the estimates differ materially from actual results, the impact in the condensed consolidated financial statements may be material. The Company's critical accounting policies are disclosed in our 2024 Form 10-K.\nResults of Operations\nNet income decreased $1.185 billion to $652 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024. Net income decreased $1.611 billion to $711 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. For additional information see the following discussion of our results of operations.\nEBITDA and Adjusted EBITDA\nIn analyzing and planning for our business, we supplement our use of GAAP financial measures with non-GAAP financial measures, including EBITDA and Adjusted EBITDA as performance measures. These non-GAAP financial measures reflect an additional way of viewing aspects of our business that, when viewed (i) with our GAAP results and (ii) the accompanying reconciliations to corresponding GAAP financial measures may provide a more complete understanding of factors and trends affecting our business. Because EBITDA and Adjusted EBITDA are financial measures that management uses to allocate resources, determine our ability to fund capital expenditures, assess performance against our peers, and evaluate overall financial performance, we believe they provide useful information for investors.\nThese non-GAAP financial measures should not be relied upon to the exclusion of GAAP financial measures and are, by definition, an incomplete understanding of Vistra and must be considered in conjunction with GAAP measures. In addition, non-GAAP financial measures are not standardized; therefore, it may not be possible to compare these financial measures with other companies' non-GAAP financial measures having the same or similar names. We strongly encourage investors to review the condensed consolidated financial statements and publicly filed reports in their entirety and not rely on any single financial measure.\nWhen EBITDA or Adjusted EBITDA is discussed in reference to performance on a consolidated basis, the most directly comparable GAAP financial measure to EBITDA and Adjusted EBITDA is Net income (loss).\n61\nTable of Contents\nVistra Consolidated Financial Results — Three Months Ended September 30, 2025 Compared to the Three Months Ended September 30, 2024\nThe following table presents Net income (loss), EBITDA and Adjusted EBITDA for the three months ended September 30, 2025:\nThree Months Ended September 30, 2025\nRetail\nTexas\nEast\nWest\nAsset \nClosure\nEliminations / Corporate and Other\nVistra \nConsolidated\n(in millions)\nOperating revenues\n$\n4,139 \n$\n1,799 \n$\n1,750 \n$\n165 \n$\n2 \n$\n(2,884)\n$\n4,971 \nFuel, purchased power costs and delivery fees\n(3,815)\n(544)\n(866)\n(32)\n— \n2,887 \n(2,370)\nOperating costs\n(54)\n(243)\n(338)\n(15)\n(12)\n7 \n(655)\nDepreciation and amortization\n(23)\n(160)\n(244)\n(14)\n— \n(19)\n(460)\nSelling, general and administrative expenses\n(270)\n(38)\n(59)\n(2)\n(16)\n(59)\n(444)\nImpairment of long-lived assets\n— \n— \n(5)\n— \n— \n— \n(5)\nOperating income (loss)\n(23)\n814 \n238 \n102 \n(26)\n(68)\n1,037 \nOther income, net\n1 \n— \n100 \n1 \n1 \n2 \n105 \nInterest expense and related charges\n(18)\n9 \n16 \n2 \n(1)\n(294)\n(286)\nIncome (loss) before income taxes\n(40)\n823 \n354 \n105 \n(26)\n(360)\n856 \nIncome tax expense\n— \n— \n— \n— \n— \n(204)\n(204)\nNet income (loss)\n$\n(40)\n$\n823 \n$\n354 \n$\n105 \n$\n(26)\n$\n(564)\n$\n652 \nIncome tax expense\n— \n— \n— \n— \n— \n204 \n204 \nInterest expense and related charges (a)\n18 \n(9)\n(16)\n(2)\n1 \n294 \n286 \nDepreciation and amortization (b)\n23 \n195 \n338 \n14 \n— \n18 \n588 \nEBITDA before Adjustments\n1 \n1,009 \n676 \n117 \n(25)\n(48)\n1,730 \nUnrealized net (gain) loss resulting from commodity hedging transactions\n20 \n(239)\n93 \n(57)\n(1)\n— \n(184)\nPurchase accounting impacts\n8 \n1 \n8 \n— \n— \n— \n17 \nNon-cash compensation expenses\n— \n— \n— \n— \n— \n36 \n36 \nTransition and merger expenses\n3 \n— \n3 \n— \n— \n16 \n22 \nImpairment of long lived assets\n— \n— \n5 \n— \n— \n— \n5 \nDecommissioning-related activities (c)\n— \n5 \n(74)\n1 \n6 \n— \n(62)\nERP system implementation expenses\n— \n— \n1 \n— \n— \n— \n1 \nOther, net\n5 \n8 \n7 \n2 \n3 \n(26)\n(1)\nAdjusted EBITDA\n$\n37 \n$\n784 \n$\n719 \n$\n63 \n$\n(17)\n$\n(22)\n$\n1,564 \n____________\n(a)\nIncludes $10 million of unrealized mark-to-market net losses on interest rate swaps.\n(b)\nIncludes nuclear fuel amortization of $35 million and $94 million, respectively, in the Texas and East segments.\n(c)\nRepresents net of all NDT (income) loss of the PJM nuclear facilities and all ARO and environmental remediation expenses.\n62\nTable of Contents\nThe following table presents Net income (loss), EBITDA and Adjusted EBITDA for the three months ended September 30, 2024:\n \nThree Months Ended September 30, 2024\nRetail\nTexas\nEast\nWest\nAsset \nClosure\nEliminations / Corporate and Other\nVistra \nConsolidated\n(in millions)\nOperating revenues\n$\n4,251 \n$\n4,244 \n$\n1,853 \n$\n232 \n$\n11 \n$\n(4,303)\n$\n6,288 \nFuel, purchased power costs and delivery fees\n(5,117)\n(487)\n(859)\n(45)\n(2)\n4,303 \n(2,207)\nOperating costs\n(47)\n(242)\n(296)\n(11)\n(19)\n(1)\n(616)\nDepreciation and amortization\n(31)\n(155)\n(241)\n(15)\n(7)\n(17)\n(466)\nSelling, general and administrative expenses\n(266)\n(40)\n(32)\n(8)\n(9)\n(56)\n(411)\nOperating income (loss)\n(1,210)\n3,320 \n425 \n153 \n(26)\n(74)\n2,588 \nOther income, net\n— \n23 \n97 \n1 \n7 \n8 \n136 \nInterest expense and related charges\n(16)\n11 \n4 \n1 \n(1)\n(331)\n(332)\nIncome (loss) before income taxes\n(1,226)\n3,354 \n526 \n155 \n(20)\n(397)\n2,392 \nIncome tax expense\n— \n— \n— \n— \n— \n(555)\n$\n(555)\nNet income (loss)\n$\n(1,226)\n$\n3,354 \n$\n526 \n$\n155 \n$\n(20)\n$\n(952)\n$\n1,837 \nIncome tax expense\n— \n— \n— \n— \n— \n555 \n555 \nInterest expense and related charges (a) \n16 \n(11)\n(4)\n(1)\n1 \n331 \n332 \nDepreciation and amortization (b)\n31 \n183 \n336 \n15 \n7 \n17 \n589 \nEBITDA before Adjustments\n(1,179)\n3,526 \n858 \n169 \n(12)\n(49)\n3,313 \nUnrealized net (gain) loss resulting from commodity hedging transactions\n1,275 \n(2,773)\n(254)\n(101)\n(2)\n— \n(1,855)\nPurchase accounting impacts\n1 \n1 \n(4)\n— \n— \n— \n(2)\nNon-cash compensation expenses\n— \n— \n— \n— \n— \n23 \n23 \nTransition and merger expenses\n— \n1 \n1 \n— \n— \n23 \n25 \nDecommissioning-related activities (c)\n— \n8 \n(72)\n(1)\n1 \n— \n(64)\nERP system implementation expenses\n1 \n1 \n— \n— \n1 \n— \n3 \nOther, net\n4 \n(2)\n— \n3 \n1 \n(22)\n(16)\nAdjusted EBITDA\n$\n102 \n$\n762 \n$\n529 \n$\n70 \n$\n(11)\n$\n(25)\n$\n1,427 \n____________\n(a)\nIncludes $84 million of unrealized mark-to-market net losses on interest rate swaps.\n(b)\nIncludes nuclear fuel amortization of $28 million and $95 million, respectively, in the Texas and East segments.\n(c)\nRepresents net of all NDT (income) loss, ARO accretion expense for operating assets, and ARO remeasurement impacts for operating assets.\nGAAP Net income decreased $1.185 billion to $652 million for the three months ended September 30, 2025 compared to the three months ended September 30, 2024. The primary drivers for the decrease in GAAP Net income include:\nUnfavorable impacts:\n•\nA decrease of $1.671 billion in unrealized mark-to-market gains on commodity derivative positions. See further information on our derivative results in \nEnergy-Related Commodity Contracts and Mark-to-Market Activities\n below.\n•\nAn increase of $39 million in operating costs due primarily to increased plant maintenance and outage expenses.\n•\nAn increase of $33 million in selling, general and administrative expenses due primarily to stock-based incentive compensation expense and technology and consulting costs.\n•\nA decrease of $31 million in other income, net due primarily to a decrease in insurance income.\n•\nAn increase of $5 million in impairment of long-lived assets related to certain development projects in the three months ended September 30, 2025.\n63\nTable of Contents\nFavorable impacts:\n•\nAn increase of $191 million in realized revenue net fuel due primarily to nuclear PTC revenue of $145 million recognized in the three months ended September 30, 2025 and higher realized energy and capacity prices partially offset by lower energy production due to the Martin Lake Incident and higher retail supply costs outside of ERCOT. \n•\nA decrease in interest expense due primarily to a decrease in unrealized mark-to-market net losses on interest rate swaps.\n•\nA decrease in income tax expense due to lower pre-tax income.\nThe following table presents the operational performance of our retail and generation segments:\nThree Months Ended September 30,\nRetail\nTexas\nEast\nWest\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nRetail sales volumes (GWh):\nRetail electricity sales volumes:\nSales volumes in ERCOT\n23,121\n22,193\nSales volumes in Northeast/Midwest\n16,941\n17,864\nTotal retail electricity sales volumes\n40,062\n40,057\nProduction volumes (GWh):\nNatural gas facilities\n15,455\n15,152\n16,902\n17,135\n582\n996\nLignite and coal facilities\n6,223\n7,022\n5,080\n4,991\nNuclear facilities\n5,028\n5,217\n8,544\n8,677\nSolar facilities\n212\n233\n80\nCapacity factors:\nCCGT facilities\n73.7 \n%\n78.3 \n%\n69.5 \n%\n70.5 \n%\n25.8 \n%\n44.2 \n%\nLignite and coal facilities\n58.5 \n%\n70.7 \n%\n58.6 \n%\n57.5 \n%\nNuclear facilities\n94.9 \n%\n98.5 \n%\n95.6 \n%\n97.1 \n%\nWeather - percent of normal (a):\nCooling degree days\n95%\n100 \n%\n97 \n%\n102 \n%\n91 \n%\n97 \n%\n94 \n%\n98 \n%\nHeating degree days\n— \n%\n— \n%\n— \n%\n— \n%\n61 \n%\n64 \n%\n— \n%\n— \n%\n____________\n(a)\nReflects cooling degree or heating degree days based on Weather Services International (WSI) data. A degree day compares the average of the hourly outdoor temperatures during each day to a 65° Fahrenheit base temperature. Retail amounts represent weather data for the Dallas-Fort Worth area.\n64\nTable of Contents\nThree Months Ended September 30,\nThree Months Ended September 30,\n2025\n2024\n2025\n2024\nAverage Power Price ($MWh) (a):\nAverage Natural gas price ($MWh) (b):\nERCOT North Hub\n$\n32.61 \n$\n26.87 \nNYMEX Henry Hub\n$\n3.03 \n$\n2.08 \nERCOT West Hub\n$\n35.47 \n$\n29.22 \nHouston Ship Channel\n$\n2.69 \n$\n1.79 \nPJM AEP Dayton Hub\n$\n43.51 \n$\n32.22 \nPermian Basin\n$\n0.49 \n$\n(1.01)\nPJM Northern Illinois Hub\n$\n42.80 \n$\n28.84 \nDominion South\n$\n2.13 \n$\n1.41 \nPJM Western Hub\n$\n46.82 \n$\n37.10 \nTetco ELA\n$\n2.83 \n$\n1.95 \nMISO Indiana Hub\n$\n46.93 \n$\n32.33 \nChicago Citygate\n$\n2.77 \n$\n1.78 \nISONE Massachusetts Hub\n$\n50.19 \n$\n38.08 \nTetco M3\n$\n2.27 \n$\n1.50 \nNew York Zone A\n$\n48.75 \n$\n32.48 \nAlgonquin Citygates\n$\n2.96 \n$\n1.75 \nCAISO NP15\n$\n41.30 \n$\n41.79 \nPG&E Citygate\n$\n3.47 \n$\n2.79 \n___________\n(a)    Reflects the average around-the-clock settled prices for the periods presented and does not necessarily reflect prices we realized.\n(b)\nReflects the average around-the-clock settled prices for the periods presented and does not reflect costs incurred by us.\nAdjusted EBITDA for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 increased by $137 million. The primary drivers for the increase include:\n \nThree Months Ended September 30, 2025 \nCompared to 2024\nRetail\nTexas\nEast\nWest\n(in millions)\nFavorable change in realized revenue net of fuel in East driven by higher realized energy and capacity prices. Favorable change in Texas driven by nuclear PTC revenue and higher realized prices partially offset by lower energy production due to the Martin Lake Incident.\n$\n— \n$\n41 \n$\n238 \n$\n(9)\nUnfavorable change in retail margins driven by higher supply costs outside of ERCOT\n(72)\n— \n— \n— \nFavorable change in consumption due to weather impacts\n11 \nIncrease in plant operating costs due primarily to increased outage expenses\n— \n(1)\n(34)\n(4)\nChange in SG&A and other in Retail due primarily to higher retail revenues in ERCOT. Change in Texas and East SG&A and other due to higher technology and consulting costs.\n(4)\n(18)\n(14)\n6 \nChange in Adjusted EBITDA\n$\n(65)\n$\n22\n \n$\n190\n \n$\n(7)\nChange in depreciation and amortization driven primarily by an increase in capital additions in Texas and East\n8 \n(12)\n(2)\n1 \nChange in unrealized net gains (losses) on hedging activities (a)\n1,255 \n(2,534)\n(347)\n(44)\nImpairment of long-lived assets\n— \n— \n(5)\n— \nDecommissioning related activities\n— \n3 \n2\n(2)\nOther (including interest expenses)\n(12)\n(10)\n(10)\n2 \nChange in Net income (loss)\n$\n1,186\n \n$\n(2,531)\n$\n(172)\n$\n(50)\n___________\n(a)    See \nEnergy-Related Commodity Contracts and Mark-to-Market\n \nActivities \nbelow for analysis of hedging strategy.\n65\nTable of Contents\nVistra Consolidated Financial Results — Nine Months Ended September 30, 2025 Compared to the Nine Months Ended September 30, 2024\nThe following table presents Net income (loss), EBITDA and Adjusted EBITDA for the nine months ended September 30, 2025:\nNine Months Ended September 30, 2025\nRetail\nTexas\nEast\nWest\nAsset \nClosure\nEliminations / Corporate and Other\nVistra \nConsolidated\n(in millions)\nOperating revenues\n$\n10,839 \n$\n3,797 \n$\n4,610 \n$\n347 \n$\n26 \n$\n(6,465)\n$\n13,154 \nFuel, purchased power costs, and delivery fees\n(8,848)\n(1,509)\n(2,784)\n(119)\n— \n6,469 \n(6,791)\nOperating costs\n(131)\n(778)\n(1,020)\n(45)\n(113)\n6 \n(2,081)\nDepreciation and amortization\n(70)\n(477)\n(876)\n(45)\n2 \n(57)\n(1,523)\nSelling, general, and administrative expenses\n(769)\n(122)\n(175)\n(11)\n(52)\n(125)\n(1,254)\nImpairment of long-lived assets\n— \n(68)\n(5)\n— \n— \n— \n(73)\nOperating income (loss)\n1,021 \n843 \n(250)\n127 \n(137)\n(172)\n1,432 \nOther income, net\n1 \n82 \n199 \n1 \n3 \n5 \n291 \nInterest expense and related charges\n(53)\n41 \n36 \n4 \n(3)\n(933)\n(908)\nIncome (loss) before income taxes\n969 \n966 \n(15)\n132 \n(137)\n(1,100)\n815 \nIncome tax expense\n— \n— \n(1)\n— \n— \n(103)\n(104)\nNet income (loss)\n$\n969 \n$\n966 \n$\n(16)\n$\n132 \n$\n(137)\n$\n(1,203)\n$\n711 \nIncome tax expense\n— \n— \n1 \n— \n— \n103 \n104 \nInterest expense and related charges (a)\n53 \n(41)\n(36)\n(4)\n3 \n933 \n908 \nDepreciation and amortization (b)\n70 \n573 \n1,146 \n45 \n(2)\n57 \n1,889 \nEBITDA before Adjustments\n1,092 \n1,498 \n1,095 \n173 \n(136)\n(110)\n3,612 \nUnrealized net (gain) loss resulting from commodity hedging transactions\n(136)\n(109)\n621 \n(7)\n(2)\n— \n367 \nPurchase accounting impacts\n16 \n1 \n31 \n— \n— \n— \n48 \nNon-cash compensation expenses\n— \n— \n— \n— \n— \n82 \n82 \nTransition and merger expenses\n8 \n— \n4 \n— \n— \n50 \n62 \nImpairment of long-lived assets\n— \n68 \n5 \n— \n— \n— \n73 \nInsurance income (c)\n— \n(80)\n— \n— \n(21)\n— \n(101)\nDecommissioning-related activities (d)\n— \n14 \n(120)\n1 \n95 \n— \n(10)\nERP system implementation expenses\n3 \n3 \n4 \n— \n1 \n— \n11 \nOther, net (e)\n(6)\n21 \n11 \n7 \n5 \n(70)\n(32)\nAdjusted EBITDA\n$\n977 \n$\n1,416 \n$\n1,651 \n$\n174 \n$\n(58)\n$\n(48)\n$\n4,112 \n____________\n(a)\nIncludes $84 million of unrealized mark-to-market net losses on interest rate swaps.\n(b)\nIncludes nuclear fuel amortization of $96 million and $270 million, respectively, in the Texas and East segments.\n(c)\nIncludes involuntary conversion gain recognized from Martin Lake Incident property damage insurance in the Texas segment and revenues from Moss Landing Incident business interruption proceeds in the Asset Closure segment.\n(d)\nRepresents net of all NDT (income) loss of the PJM nuclear facilities and all ARO and environmental remediation expenses.\n(e)\nIncludes the final application of bill credits to large commercial and industrial customers that curtailed their usage during Winter Storm Uri in the Retail segment.\n66\nTable of Contents\nThe following table presents Net income (loss), EBITDA and Adjusted EBITDA for the nine months ended September 30, 2024:\nNine Months Ended September 30, 2024\nRetail\nTexas\nEast\nWest\nAsset \nClosure\nEliminations / Corporate and Other\nVistra \nConsolidated\n(in millions)\nOperating revenues\n$\n9,913 \n$\n4,924 \n$\n4,241 \n$\n701 \n$\n29 \n$\n(6,621)\n$\n13,187 \nFuel, purchased power costs, and delivery fees\n(8,724)\n(1,249)\n(2,000)\n(164)\n(5)\n6,622 \n(5,520)\nOperating costs\n(118)\n(753)\n(774)\n(39)\n(56)\n(2)\n(1,742)\nDepreciation and amortization\n(85)\n(423)\n(684)\n(43)\n(21)\n(50)\n(1,306)\nSelling, general, and administrative expenses\n(715)\n(116)\n(93)\n(14)\n(34)\n(165)\n(1,137)\nOperating income (loss)\n271 \n2,383 \n690 \n441 \n(87)\n(216)\n3,482 \nOther income (deductions), net\n(1)\n29 \n177 \n— \n14 \n63 \n282 \nInterest expense and related charges\n(38)\n33 \n4 \n1 \n(3)\n(740)\n(743)\nImpacts of Tax Receivable Agreement\n— \n— \n— \n— \n— \n(5)\n(5)\nIncome (loss) before income taxes\n232 \n2,445 \n871 \n442 \n(76)\n(898)\n3,016 \nIncome tax expense\n— \n— \n— \n— \n— \n(694)\n(694)\nNet income (loss)\n$\n232 \n$\n2,445 \n$\n871 \n$\n442 \n$\n(76)\n$\n(1,592)\n$\n2,322 \nIncome tax expense\n— \n— \n— \n— \n— \n694 \n694 \nInterest expense and related charges (a)\n38 \n(33)\n(4)\n(1)\n3 \n740 \n743 \nDepreciation and amortization (b)\n85 \n503 \n873 \n43 \n21 \n50 \n1,575 \nEBITDA before Adjustments\n355 \n2,915 \n1,740 \n484 \n(52)\n(108)\n5,334 \nUnrealized net (gain) loss resulting from commodity hedging transactions\n489 \n(1,513)\n(385)\n(308)\n(8)\n— \n(1,725)\nPurchase accounting impacts\n— \n1 \n(8)\n— \n— \n(14)\n(21)\nImpacts of Tax Receivable Agreement (c)\n— \n— \n— \n— \n— \n(5)\n(5)\nNon-cash compensation expenses\n— \n— \n— \n— \n— \n76 \n76 \nTransition and merger expenses\n2 \n1 \n7 \n— \n— \n75 \n85 \nDecommissioning-related activities (d)\n— \n19 \n(112)\n— \n1 \n— \n(92)\nERP system implementation expenses\n7 \n6 \n5 \n1 \n2 \n— \n21 \nOther, net\n10 \n4 \n(5)\n6 \n2 \n(85)\n(68)\nAdjusted EBITDA\n$\n863 \n$\n1,433 \n$\n1,242 \n$\n183 \n$\n(55)\n$\n(61)\n$\n3,605 \n____________\n(a)\nIncludes $26 million of unrealized mark-to-market net losses on interest rate swaps.\n(b)\nIncludes nuclear fuel amortization of $80 million and $189 million, respectively, in the Texas and East segments.\n(c)\nIncludes $10 million gain recognized on the repurchase of TRA Rights.\n(d)\nRepresents net of all NDT (income) loss, ARO accretion expense for operating assets, and ARO remeasurement impacts for operating assets.\nGAAP Net income decreased $1.611 billion to $711 million for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024. The primary drivers for the decrease in GAAP Net income include:\nUnfavorable impacts:\n•\nAn increase of $2.092 billion in unrealized mark-to-market losses on commodity derivative positions. See further information on our derivative results in \nEnergy-Related Commodity Contracts and Mark-to-Market Activities\n below.\n•\nAn increase of $77 million in operating costs due to the Moss Landing Incident, net of expected insurance recoveries.\n•\nAn increase of $73 million in impairment of long-lived assets related to certain development projects in the nine months ended September 30, 2025.\n•\nAn increase in interest expense due primarily to higher debt balances and an increase in unrealized mark-to-market net losses on interest rate swaps\n67\nTable of Contents\nFavorable impacts:\n•\nInclusion of nine months of Energy Harbor revenues net of expenses in the East and Retail segments for 2025 compared to seven months in 2024\n•\nAn increase in realized revenue net fuel due to higher realized energy and capacity prices in East, nuclear PTC revenue and higher retail margins driven by favorable power supply costs and customer count growth, partially offset by lower energy production due to the Martin Lake Incident.\n•\nAn increase in insurance income due primarily to $80 million of involuntary conversion gains on property damage insurance from the Martin Lake Incident and $22 million of business interruption revenue from the Moss Landing Incident recognized in the three months ended June 30, 2025 partially offset by $21 million of insurance income recognized in 2024.\n•\nAn increase of $27 million in NDT income due to realized and unrealized gains on equity securities.\n•\nA decrease in income tax expense due to lower pre-tax income and a lower effective tax rate.\nThe following table presents the operational performance of our retail and generation segments:\nNine Months Ended September 30,\nRetail\nTexas\nEast\nWest\n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\nRetail electricity sales volumes (GWh):\nSales volumes in ERCOT\n60,971\n57,234\nSales volumes in Northeast/Midwest\n45,681\n44,105\nTotal retail electricity sales volumes\n106,652\n101,339\nProduction volumes (GWh):\nNatural gas facilities\n35,800\n34,504\n43,742\n44,267\n1,629\n2,921\nLignite and coal facilities\n16,531\n17,682\n14,274\n12,126\nNuclear facilities\n14,747\n15,260\n24,240\n18,438\nSolar facilities\n587\n605\n191\nCapacity factors:\nCCGT facilities\n58.6 \n%\n60.6 \n%\n61.3 \n%\n60.7 \n%\n24.3 \n%\n43.5 \n%\nLignite and coal facilities\n52.4 \n%\n59.8 \n%\n55.5 \n%\n47.0 \n%\nNuclear facilities\n93.8 \n%\n96.7 \n%\n91.4 \n%\n88.7 \n%\nWeather - percent of normal (a):\nCooling degree days\n98 \n%\n107 \n%\n104 \n%\n108 \n%\n94 \n%\n104 \n%\n93 \n%\n91 \n%\nHeating degree days\n104 \n%\n86 \n%\n112 \n%\n89 \n%\n98 \n%\n85 \n%\n125 \n%\n121 \n%\n____________\n(a)\nReflects cooling degree or heating degree days based on Weather Services International (WSI) data. A degree day compares the average of the hourly outdoor temperatures during each day to a 65° Fahrenheit base temperature. Retail amounts represent weather data for the Dallas-Fort Worth area.\n68\nTable of Contents\nNine Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\n2025\n2024\nAverage Power Price ($MWh) (a):\nAverage Natural Gas Price ($MWh) (b):\nERCOT North Hub\n$\n31.85 \n$\n25.70 \nNYMEX Henry Hub\n$\n3.48 \n$\n2.19 \nERCOT West Hub\n$\n32.37 \n$\n27.51 \nHouston Ship Channel\n$\n2.96 \n$\n1.79 \nPJM AEP Dayton Hub\n$\n43.99 \n$\n30.15 \nPermian Basin\n$\n1.13 \n$\n(0.13)\nPJM Northern Illinois Hub\n$\n36.37 \n$\n25.74 \nDominion South\n$\n2.72 \n$\n1.57 \nPJM Western Hub\n$\n47.67 \n$\n33.53 \nTetco ELA\n$\n3.25 \n$\n2.02 \nMISO Indiana Hub\n$\n43.72 \n$\n31.82 \nChicago Citygate\n$\n3.21 \n$\n2.09 \nISONE Massachusetts Hub\n$\n64.15 \n$\n37.10 \nTetco M3\n$\n3.70 \n$\n1.98 \nNew York Zone A\n$\n50.96 \n$\n30.59 \nAlgonquin Citygates\n$\n5.85 \n$\n2.56 \nCAISO NP15\n$\n36.27 \n$\n38.52 \nPG&E Citygate\n$\n3.33 \n$\n2.97 \n___________\n(a)    Reflects the average around-the-clock settled prices for the periods presented and does not necessarily reflect prices we realized.\n(b)\nReflects the average around-the-clock settled prices for the periods presented and does not reflect costs incurred by us.\nAdjusted EBITDA for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 increased by $507 million. The primary drivers for the increase include:\nNine Months Ended September 30, 2025 Compared to 2024\nRetail (a)\nTexas\nEast (a)\nWest\n(in millions)\nFavorable change in realized revenue net of fuel driven primarily by inclusion of a full nine months of Energy Harbor results and higher realized energy and capacity prices in East. Favorable change in Texas driven by nuclear PTC revenue and higher realized prices partially offset by lower energy production due to the Martin Lake Incident.\n$\n— \n$\n34 \n$\n669 \n$\n(8)\nHigher retail margins driven by favorable power supply costs, customer count growth, and inclusion of a full nine months of Energy Harbor retail contracts\n138 \n— \n— \n— \nFavorable change in consumption primarily due to weather\n23 \n— \n— \n— \nIncrease in plant operating costs due primarily to inclusion of a full nine months of Energy Harbor results in East\n— \n(20)\n(224)\n(6)\nChange in SG&A and other primarily due to inclusion of a full nine months of Energy Harbor results in Retail and East\n(47)\n(31)\n(36)\n5 \nChange in Adjusted EBITDA\n$\n114\n \n$\n(17)\n$\n409\n \n$\n(9)\nChange in depreciation and amortization driven primarily due to the inclusion of a full nine months of Energy Harbor results in East\n15 \n(70)\n(273)\n(2)\nChange in unrealized net gains (losses) on hedging activities (b)\n625 \n(1,404)\n(1,006)\n(301)\nImpairment of long-lived assets\n— \n(68)\n(5)\n— \nIncrease in other income due to involuntary conversion gain on Martin Lake Incident\n— \n80 \n$\n— \n— \nDecommissioning related activities\n— \n5 \n8\n(1)\nOther (including interest expenses)\n(17)\n(5)\n(20)\n3 \nChange in Net income (loss)\n$\n737\n \n$\n(1,479)\n$\n(887)\n$\n(310)\n___________\n(a)    Includes amounts associated with operations acquired in the Energy Harbor Merger beginning March 1, 2024.\n(b\n)    \nSee \nEnergy-Related Commodity Contracts and Mark-to-Market\n \nActivities \nbelow for analysis of hedging strategy.\n69\nTable of Contents\nAsset Closure Segment — Three and Nine Months Ended September 30, 2025 Compared to Three and Nine Months Ended September 30, 2024\nThree Months Ended September 30,\nFavorable (Unfavorable) \nChange\nNine Months Ended September 30,\nFavorable (Unfavorable) \nChange\n2025\n2024\n2025\n2024\n(in millions)\nOperating revenues\n$\n2 \n$\n11 \n$\n(9)\n$\n26 \n$\n29 \n$\n(3)\nFuel, purchased power costs, and delivery fees\n— \n(2)\n2 \n$\n— \n$\n(5)\n$\n5 \nOperating costs\n$\n(12)\n$\n(19)\n$\n7 \n(113)\n(56)\n(57)\nDepreciation and amortization\n— \n(7)\n7 \n2 \n(21)\n23 \nSelling, general, and administrative expenses\n(16)\n(9)\n(7)\n(52)\n(34)\n(18)\nOperating loss\n(26)\n(26)\n— \n(137)\n(87)\n(50)\nOther income (deductions), net\n1 \n7 \n(6)\n3 \n14 \n(11)\nInterest expense and related charges\n(1)\n(1)\n— \n(3)\n(3)\n— \nLoss before income taxes\n(26)\n(20)\n(6)\n(137)\n(76)\n(61)\nNet loss\n$\n(26)\n$\n(20)\n$\n(6)\n$\n(137)\n$\n(76)\n$\n(61)\nAdjusted EBITDA\n$\n(17)\n$\n(11)\n$\n(6)\n$\n(58)\n$\n(55)\n$\n(3)\nGAAP results for the nine months ended months ended September 2025 are unfavorable compared to the nine months ended months ended September 2024 primarily due to costs associated with the Moss Landing Incident net of insurance receivables. Adjusted EBITDA for the nine months ended months ended September 2025 is unfavorable compared to the nine months ended months ended September 2024 primarily due to a decrease in revenue due to the Moss Landing Incident. See Note 1 to the Financial Statements for additional information.\nEnergy-Related Commodity Contracts and Mark-to-Market Activities\nAs we entered the 2024 and 2025 calendar years, we had substantially all of our expected generation volumes hedged. This strategic hedging allowed us to lock in margins that were higher than what we would have realized if we had not hedged. These margins also exceeded those from hedging activities for the nine months ended September 30, 2024, contributing to the increase in realized revenue net of fuel in our generation segments, along with the addition of Energy Harbor.\nThe changes in unrealized gains and losses on hedging activities are driven by forward power sales. When power prices increase or decrease compared to what our generation segments have sold forward, the generation segments recognize unrealized losses or gains, respectively. Conversely, the retail segment, which procures power from the generation segments to meet future load obligations, experiences an inverse effect on unrealized mark-to-market valuations compared to the generation segments.\nDuring the three and nine months ended September 30, 2025 and 2024, forward power price curves decreased relative to our hedged positions resulting in unrealized gains in the Texas and West segments. \nDuring the three and nine months ended September 30, 2025, forward power price curves in the East segment increased relative to our hedged positions resulting in unrealized losses compared to a decrease in power price curves resulting in unrealized gains in the three and nine months ended September 30, 2024.\nThese unrealized gains and losses in the Texas, East and West generation segments across these comparative periods were partially offset by unrealized gains and losses in the Retail segment across the same periods.\n70\nTable of Contents\nThe table below summarizes the changes in commodity contract assets and liabilities for the nine months ended September 30, 2025 and 2024.\nNine Months Ended September 30,\n2025\n2024\n(in millions)\nCommodity contract net liability as of January 1\n$\n(1,459)\n$\n(2,740)\nMark-to-market adjustments:\nSettlements/termination of positions (a)\n881 \n1,350 \nChanges in fair value of positions in the portfolio (b)\n(1,248)\n375 \nNet loss associated with mark-to-market accounting\n(367)\n1,725 \nAcquired commodity contracts (c)\n— \n(50)\nOther activity (d)\n82 \n111 \nCommodity contract net liability as of September 30\n$\n(1,744)\n$\n(954)\n____________\n(a)\nRepresents reversals of previously recognized unrealized gains and losses upon settlement/termination (offsets realized gains/(losses) recognized in the settlement period). Excludes changes in fair value in the month the position settled as well as amounts related to positions entered into, and settled, in the same month.\n(b)\nRepresents unrealized net gains/(losses) recognized, reflecting the effect of changes in fair value. Excludes changes in fair value in the month the position settled as well as amounts related to positions entered into, and settled, in the same month.\n(c)\nIncludes fair value of commodity contracts acquired in the Energy Harbor Merger (see Note 2 to the Financial Statements for additional information).\n(d)\nPrimarily represents changes in fair value of positions due to receipt or payment of cash not reflected in unrealized gains or losses. Amounts are generally related to premiums related to options purchased or sold as well as certain margin deposits classified as settlement for certain transactions executed on the CME.\nThe following maturity table presents the net commodity contract liability arising from recognition of fair values as of September 30, 2025, scheduled by the source of fair value and contractual settlement dates of the underlying positions.\nMaturity dates of unrealized commodity contract net liability as of September 30, 2025\nSource of Fair Value\nLess than\n1 year\n1-3 years\n4-5 years\nExcess of\n5 years\nTotal\n(in millions)\nPrices actively quoted\n$\n(367)\n$\n(168)\n$\n9 \n$\n(1)\n$\n(527)\nPrices provided by other external sources\n(208)\n(61)\n(1)\n \n(270)\nPrices based on models\n(245)\n(567)\n(135)\n \n(947)\nTotal\n$\n(820)\n$\n(796)\n$\n(127)\n$\n(1)\n$\n(1,744)\nWe have engaged in natural gas hedging activities to mitigate the risk of higher or lower wholesale electricity prices that have corresponded to increases or declines in natural gas prices. When natural gas prices are elevated or depressed, we continue to seek opportunities to manage our wholesale power price exposure through hedging activities, including forward wholesale and retail electricity sales.\nEstimated hedging levels for generation volumes in our Texas, East, and West segments as of September 30, 2025 were as follows:\nBalance of 2025\n2026\nNuclear/Renewable/Coal Generation:\nTexas\n100 \n%\n100 \n%\nEast\n98 \n%\n97 \n%\nNatural Gas Generation:\nTexas\n100 \n%\n88 \n%\nEast\n98 \n%\n100 \n%\nWest\n100 \n%\n69 \n%\n71\nTable of Contents\nFinancial Condition\nCash Flows\nOperating Cash Flows\nCash provided by operating activities totaled $2.638 billion and $3.210 billion for the nine months ended September 30, 2025 and 2024, respectively. The unfavorable $572 million change was primarily driven by a $1.216 billion decrease in net cash flows related to margin deposits as $361 million in net margin deposits related to commodity contracts supporting our hedging strategy were posted for the nine months ended September 30, 2025 as compared to $855 million in net margin deposits returned for the nine months ended September 30, 2024. This unfavorable change was partially offset by higher realized revenue net of fuel cost driven primarily by inclusion of nine months of Energy Harbor revenues net of expenses for 2025 compared to seven months in 2024 and higher realized energy and capacity prices in the East segment.\nInvesting Cash Flows\nCash used in investing activities includes:\nNine Months Ended September 30,\nIncrease (Decrease)\n2025\n2024\n(in millions)\nCapital expenditures, including LTSA prepayments\n$\n(836)\n$\n(602)\n$\n(234)\nNuclear fuel purchases\n(380)\n(445)\n65 \nGrowth and development expenditures\n(700)\n(601)\n(99)\nTotal capital expenditures\n(1,916)\n(1,648)\n(268)\nEnergy Harbor acquisition (net of cash acquired)\n— \n(3,065)\n3,065 \nNet purchases of environmental allowances\n(454)\n(364)\n(90)\nProceeds from sale of property, plant and equipment, including nuclear fuel\n21 \n137 \n(116)\nInsurance proceeds for recovery of damaged property, plant and equipment\n198 \n3 \n195 \nOther investing activity\n(11)\n(22)\n11 \nCash used in investing activities\n$\n(2,162)\n$\n(4,959)\n$\n2,797 \nThe $2.797 billion change was primarily driven by $3.1 billion utilized to fund the Energy Harbor Merger in 2024 and $198 million of property damage insurance proceeds received from the Martin Lake Incident and Moss Landing Incident in 2025. These impacts were partially offset by higher capital expenditures associated with the Martin Lake Incident and development projects and higher net purchases of environmental allowances in 2025 primarily driven by the addition of Energy Harbor.\n72\nTable of Contents\nFinancing Cash Flows\nCash used in financing activities includes:\nNine Months Ended September 30,\nIncrease (Decrease)\n2025\n2024\n(in millions)\nStock repurchases\n$\n(776)\n$\n(1,021)\n$\n245 \nIssuances of debt\n424 \n2,200 \n(1,776)\nRepayments/repurchases of debt\n(764)\n(2,269)\n1,505 \nNet borrowings (repayments) under the accounts receivable financing facilities\n475 \n750 \n(275)\nDividends paid to common stockholders\n(229)\n(230)\n1 \nDividends paid to preferred stockholders\n(117)\n(98)\n(19)\nDividends paid to noncontrolling interest holders\n— \n(15)\n15 \nTax withholding on stock based compensation\n(51)\n(11)\n(40)\nPrincipal payment on forward repurchase obligation\n(41)\n— \n(41)\nTRA Repurchase and tender offer — return of capital\n— \n(122)\n122 \nOther financing activity\n19 \n(34)\n53 \nCash used in financing activities\n$\n(1,060)\n$\n(850)\n$\n(210)\nThe $210 million change was primarily driven by higher net borrowings in the nine months ended September 30, 2024 reflecting amounts borrowed to partially fund the Energy Harbor Merger, partially offset by lower stock repurchases in the nine months ended September 30, 2025.\nAvailable Liquidity\nThe following table summarizes changes in available liquidity for the nine months ended September 30, 2025:\nSeptember 30, 2025\nDecember 31, 2024\nChange\n(in millions)\nCash and cash equivalents (a)\n$\n602 \n$\n1,188 \n$\n(586)\nVistra Operations Credit Facilities — Revolving Credit Facility (b)\n2,459 \n2,162 \n297 \nVistra Operations — Commodity-Linked Facility (c)\n644 \n771 \n(127)\nTotal available liquidity (d)(e)\n$\n3,705 \n$\n4,121 \n$\n(416)\n____________\n(a)\nSee the condensed consolidated statements of cash flows in the Financial Statements and \nCash Flows\n above for details of the decrease in cash and cash equivalents for the nine months ended September 30, 2025.\n(b)\nThe increase in availability for the nine months ended September 30, 2025 was driven by a $297 million decrease in letters of credit outstanding under the facility.\n(c)\nAs of September 30, 2025 and December 31, 2024, the borrowing bases were less than the facility limit of $1.75 billion. As of September 30, 2025, available capacity reflects the borrowing base of $644 million and no cash borrowings. As of December 31, 2024, available capacity reflects the borrowing base of $771 million and no cash borrowings.\n(d)\nExcludes amounts available to be borrowed under the Receivables Facility and the Repurchase Facility, respectively. See Note 9 to the Financial Statements for additional information.\n(e)\nExcludes any additional letters of credit that may be issued under the Secured LOC Facilities or the Alternative LOC Facilities. See Note 9 to the Financial Statements for additional information.\nWe believe that we will have access to sufficient liquidity to fund our anticipated cash requirements through at least the next 12 months, including the upcoming payments associated with the acquisition of Nuveen's noncontrolling interest in Vistra Vision. Our operational cash flows tend to be seasonal and weighted toward the second half of the year.\n73\nTable of Contents\nLiquidity Effects of Commodity Hedging and Trading Activities\nWe have entered into commodity hedging and trading transactions that require us to post collateral if the forward price of the underlying commodity moves such that the hedging or trading instrument we hold has declined in value. We use cash, letters of credit, Eligible Assets (see Note 8 to the Financial Statements for additional information) and other forms of credit support to satisfy such collateral posting obligations. See Note 9 to the Financial Statements for additional information.\nExchange cleared transactions typically require initial margin (\ni.e.\n, the upfront cash and/or letter of credit posted to take into account the size and maturity of the positions and credit quality) in addition to variation margin (\ni.e.\n, the daily cash margin posted to take into account changes in the value of the underlying commodity). The amount of initial margin required is generally defined by exchange rules. Clearing agents, however, typically have the right to request additional initial margin based on various factors, including market depth, volatility and credit quality, which may be in the form of cash, letters of credit, a guaranty or other forms as negotiated with the clearing agent. Cash collateral received from counterparties is either used for working capital and other business purposes, including reducing borrowings under credit facilities, or is required to be deposited in a separate account and restricted from being used for working capital and other corporate purposes. With respect to over-the-counter transactions, counterparties generally have the right to substitute letters of credit for such cash collateral. In such event, the cash collateral previously posted would be returned to such counterparties, which would reduce liquidity in the event the cash was not restricted.\nAs of September 30, 2025, we received or posted cash, letters of credit, and Eligible Assets for commodity hedging and trading activities as follows:\n•\n$1.171 billion in cash and Eligible Assets has been posted with counterparties as compared to $841 million posted as of December 31, 2024;\n•\n$3 million in cash has been received from counterparties as compared to $49 million received as of December 31, 2024;\n•\n$2.400 billion in letters of credit has been posted with counterparties as compared to $2.560 billion posted as of December 31, 2024; and\n•\n$132 million in letters of credit has been received from counterparties as compared to $131 million received as of December 31, 2024\nSee \nCollateral Support Obligations\n below for information related to collateral posted in accordance with the PUCT and ISO/RTO rules.\nIncome Tax Payments\nIn the next 12 months, we expect to make approximately $18 million in federal income tax payments, and $94 million in state income tax payments, offset by $13 million in federal income tax refunds and $14 million in state tax refunds. This forecast includes our initial estimate of the impacts of the OBBBA and the Acquisition on cash taxes based on analysis to date.\nFor the nine months ended September 30, 2025, there were $11 million in federal income tax payments, $70 million in state income tax payments, and no state income tax refunds.\nFinancial Covenants\nThe Vistra Operations Credit Agreement and the Vistra Operations Commodity-Linked Credit Agreement each includes a covenant, solely with respect to the Revolving Credit Facility and the Commodity-Linked Facility and solely during a compliance period (which, in general, is applicable when the aggregate revolving borrowings and revolving letters of credit outstanding (excluding all undrawn revolving letters of credit and cash collateralized backstopped revolving letters of credit) exceed 35% of the revolving commitments), that requires the consolidated first-lien net leverage ratio not to exceed 4.25 to 1.00 (or, during a collateral suspension period, the consolidated total net leverage ratio not to exceed 5.50 to 1.00). In addition, each of the Secured LOC Facilities includes a covenant that requires the consolidated first-lien net leverage ratio not to exceed 4.25 to 1.00 (or, for certain facilities that include a collateral suspension mechanism, during a collateral suspension period, the consolidated total net leverage ratio not to exceed 5.50 to 1.00). As of September 30, 2025, we were in compliance with the Secured LOC Facilities financial covenants. Although the period ended September 30, 2025 was not a compliance period for the Vistra Operations Credit Agreement and the Vistra Operations Commodity-Linked Credit Agreement, we would have been in compliance with their respective financial covenants if they were required to be tested at such time. See Note 9 to the Financial Statements for additional information.\n74\nTable of Contents\nCollateral Support Obligations\nThe RCT has rules in place to assure that parties can meet their mining reclamation obligations. In September 2016, the RCT agreed to a collateral bond of up to $975 million to support Luminant's reclamation obligations. The collateral bond is effectively a first lien on all of Vistra Operations' assets (which ranks pari passu with the Vistra Operations Credit Facilities) that contractually enables the RCT to be paid (up to $975 million) before the other first-lien lenders in the event of a liquidation of our assets. Collateral support relates to land mined or being mined and not yet reclaimed as well as land for which permits have been obtained but mining activities have not yet begun and land already reclaimed but not released from regulatory obligations by the RCT, and includes cost contingency amounts.\nThe PUCT has rules in place to assure adequate creditworthiness of each REP, including the ability to return customer deposits, if necessary. Under these rules, as of September 30, 2025, Vistra has posted letters of credit in the amount of $86 million with the PUCT, which is subject to adjustments.\nThe ISOs/RTOs we operate in have rules in place to assure adequate creditworthiness of parties that participate in the markets operated by those ISOs/RTOs. Under these rules, Vistra has posted collateral support totaling $814 million in the form of letters of credit, $81 million in the form of a surety bond and $3 million of cash as of September 30, 2025 (which is subject to daily adjustments based on settlement activity with the ISOs/RTOs).\nMaterial Cross Default/Acceleration Provisions\nCertain of our contractual arrangements contain provisions that could result in an event of default if there were a failure under financing arrangements to meet payment terms or to observe covenants that could result in an acceleration of payments due. Such provisions are referred to as \"cross default\" or \"cross acceleration\" provisions.\nA default by Vistra Operations or any of its restricted subsidiaries in respect of certain specified indebtedness in an aggregate amount in excess of the greatest of $1.0 billion, 17.5% of Consolidated EBITDA, and 2.5% of Consolidated Total Assets may result in a cross default under the Vistra Operations Credit Facilities and the Commodity-Linked Facility. Such a default would allow the lenders under each such facility to accelerate the maturity of outstanding balances under such facilities, which totaled approximately $2.456 billion and zero, respectively, as of September 30, 2025.\nEach of Vistra Operations' (or its subsidiaries') commodity hedging agreements and interest rate swap agreements that are secured with a lien on its assets on a pari passu basis with the Vistra Operations Credit Facilities lenders contains a cross-default provision. An event of a default by Vistra Operations or any of its subsidiaries relating to indebtedness equal to or above a threshold defined in the applicable agreement that results in the acceleration of such debt, would give such counterparty under these hedging agreements the right to terminate its hedge or interest rate swap agreement with Vistra Operations (or its applicable subsidiary) and require all outstanding obligations under such agreement to be settled.\nUnder the Vistra Operations Senior Unsecured Indentures, the Vistra Operations Senior Secured Indenture and the Indenture governing the 7.233% Senior Secured Notes (see Note 8 to Vistra's 2024 Form 10-K), a default under any document evidencing indebtedness for borrowed money by Vistra Operations or any Guarantor Subsidiary for failure to pay principal when due at final maturity or that results in the acceleration of such indebtedness in an aggregate amount of $300 million or more may result in a cross default under the Vistra Operations Senior Unsecured Notes, the Senior Secured Notes, the 7.233% Senior Secured Notes, and other current or future documents evidencing any indebtedness for borrowed money by the applicable borrower or issuer, as the case may be, and the applicable Guarantor Subsidiaries party thereto.\nAdditionally, we enter into energy-related physical and financial contracts, the master forms of which contain provisions whereby an event of default or acceleration of settlement would occur if we were to default under an obligation in respect of borrowings in excess of thresholds, which may vary by contract.\n75\nTable of Contents\nThe Receivables Facility contains a cross-default provision. The cross-default provision applies, among other instances, if TXU Energy, Dynegy Energy Services, Dynegy Energy Services Mid-Atlantic, LLC, Ambit Texas, Value Based Brands, Energy Harbor LLC, TriEagle Energy, each indirect subsidiaries of Vistra and originators under the Receivables Facility (Originators), and Vistra or any of their respective subsidiaries fails to make a payment of principal or interest on any indebtedness that is outstanding in a principal amount of at least $300 million, in the case of Vistra Operations, and in a principal amount of at least $50 million, in the case of TXU Energy or any of the other Originators, after the expiration of any applicable grace period, or if other events occur or circumstances exist under such indebtedness which give rise to a right of the debtholder to accelerate such indebtedness, or if such indebtedness becomes due before its stated maturity. If this cross-default provision is triggered, a termination event under the Receivables Facility would occur and the Receivables Facility may be terminated.\nThe Repurchase Facility contains a cross-default provision. The cross-default provision applies, among other instances, if an event of default (or similar event) occurs under the Receivables Facility or the Vistra Operations Credit Facilities. If this cross-default provision is triggered, a termination event under the Repurchase Facility would occur and the Repurchase Facility may be terminated.\nUnder the Secured LOC Facilities, a default by Vistra Operations or any of its restricted subsidiaries in respect of certain specified indebtedness in an aggregate amount in excess of a threshold amount defined in each individual agreement, which threshold amounts range from $300 million to $1 billion, may result in a cross default under the Secured LOC Facilities. In addition, a default under any document evidencing indebtedness for borrowed money by Vistra Operations or any Guarantor Subsidiary for failure to pay principal when due at final maturity or that results in the acceleration of such indebtedness in an aggregate amount in excess of a threshold amount defined in each individual agreement, which threshold amounts range from $300 million to $1 billion, may result in a termination of the Secured LOC Facilities.\nUnder the Alternative LOC Facilities, a default by Vistra Operations or any of its restricted subsidiaries in respect of certain specified indebtedness in an aggregate amount in excess of the greatest of $1.0 billion, 17.5% of Consolidated EBITDA, and 2.5% of Consolidated Total Assets may result in a cross default under the Alternative LOC Facilities. In addition, a default under any document evidencing indebtedness for borrowed money by Vistra Operations or any Guarantor Subsidiary for failure to pay principal when due at final maturity or that results in the acceleration of such indebtedness in an aggregate amount exceeding the threshold above, may result in a termination of the Alternative LOC Facilities.\nUnder the Vistra Operations Senior Unsecured Indenture and the Vistra Operations Senior Secured Indenture governing the 7.750% Senior Unsecured Notes, the 6.875% Senior Unsecured Notes, the 6.950% Senior Secured Notes, the 6.000% Senior Secured Notes, the 5.050% Senior Secured Notes, and the 5.700% Senior Secured Notes, a default under any document evidencing indebtedness for borrowed money by Vistra Operations or any Guarantor Subsidiary for failure to pay principal when due at final maturity or that results in the acceleration of such indebtedness in an aggregate amount that exceeds the greater of 2.75% of total assets and $1.0 billion may result in a cross default under the respective notes and other current or future documents evidencing any indebtedness for borrowed money by the applicable borrower or issuer, as the case may be, and the applicable Guarantor Subsidiaries party thereto.\nA default by Vistra Zero Operating or any of its restricted subsidiaries in respect of certain specified indebtedness in an aggregate amount in excess of the greatest of $100 million, 75% of Consolidated EBITDA, and 6% of Consolidated Total Assets may result in a cross default under the Vistra Zero Credit Agreement. Such a default would allow the lenders under such facility to accelerate the maturity of outstanding balances under such facility, which totaled approximately $697 million as of September 30, 2025.\nA default by BCOP or any of its subsidiary guarantors in respect of certain provisions defined in the applicable agreement may result in a cross default under the BCOP Credit Agreement. Such a default would allow the lenders under such facility to accelerate the maturity of outstanding balances under such facility. In addition, the interest rate swap agreements that are secured with a lien on BCOP and its subsidiary guarantors' assets on a pari passu basis with the BCOP Credit Agreement contain cross-acceleration provisions, where an event of a default by BCOP or any of its subsidiary guarantors that results in the acceleration of such debt would give such counterparty under these hedging agreements the right to terminate its hedge or interest rate swap agreement with BCOP and require all outstanding obligations under such agreement to be settled.\nUnder the Nuveen UPA, a default under any document evidencing indebtedness for borrowed money by Vistra Operations or any Guarantor Subsidiary that results in the acceleration of such indebtedness in an aggregate amount that exceeds the greater of 1.5% of total assets and $600 million may result in a cross default under the UPA. Such a default would result in the payment obligations under the Nuveen UPA of Vistra Vision Holdings and/or any guarantor thereunder becoming immediately due and payable.\n76\nTable of Contents\nGuarantees\nSee Note 13 to the Financial Statements for additional information.\nCommitments and Contingencies\nSee Note 13 to the Financial Statements for additional information.\nChanges in Accounting Standards\nSee Note 1 to the Financial Statements for additional information."
}