{
  "source_file": "vtr-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.    MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nUnless otherwise indicated or except where the context otherwise requires, the terms “we,” “us,” “our,” “Company” and other similar terms in Item 2 of this Quarterly Report on Form 10-Q refer to Ventas, Inc. and its consolidated subsidiaries.\nCautionary Statements\nForward-Looking Statements \nThis Quarterly Report on Form 10-Q includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements include, among others, statements of expectations, beliefs, future plans and strategies, anticipated results from operations and developments and other matters that are not historical facts. Forward-looking statements include, among other things, statements regarding our and our officers’ intent, belief or expectation as identified by the use of phrases or words such as “assume,” “may,” “will,” “project,” “expect,” “believe,” “intend,” “anticipate,” “seek,” “target,” “forecast,” “plan,” “line-of-sight,” “outlook,” “potential,” “opportunity,” “estimate,” “could,” “would,” “should” and other comparable and derivative terms or the negatives thereof.\nForward-looking statements are based on management’s beliefs as well as on a number of assumptions concerning future events. You should not put undue reliance on these forward-looking statements, which are not a guarantee of performance and are subject to a number of uncertainties and other factors that could cause actual events or results to differ materially from those expressed or implied by the forward-looking statements. We do not undertake a duty to update these forward-looking statements, which speak only as of the date on which they are made. We urge you to carefully review the disclosures we make concerning risks and uncertainties that may affect our business and future financial performance, including those made below and in our filings with the Securities and Exchange Commission, such as in the sections titled “Cautionary Statements — Summary Risk Factors,” “Risk Factors” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in our Annual Report on Form 10-K for the year ended December 31, 2024, this Quarterly Report on Form 10-Q and our Current Reports on Form 8-K as we file them with the Securities and Exchange Commission.\nCertain factors that could affect our future results and our ability to achieve our stated goals include, but are not limited to: (a) our exposure and the exposure of our managers, tenants and borrowers to complex and evolving governmental policy, laws and regulations, including relating to healthcare, data privacy, cybersecurity, international trade and environmental matters, the impact of such policies, laws and regulations on our and our managers’, tenants’ and borrowers’ business and the challenges and expense associated with complying with such policies, laws and regulations; (b) the impact of market, macroeconomic, general economic conditions and fiscal policy on us, our managers, tenants and borrowers and in areas in which our properties are geographically concentrated, including changes in or elevated inflation, interest rates and exchange rates, labor market dynamics and rises in unemployment, tightening of lending standards and reduced availability of credit or capital,  events that affect consumer confidence, our occupancy rates and resident fee revenues, and the actual and perceived state of the real estate markets and public and private capital markets; (c) the potential for significant general and commercial claims, legal actions, investigations, regulatory proceedings and enforcement actions that could subject us or our managers, tenants or borrowers to increased operating costs, uninsured liabilities, including fines and other penalties, reputational harm or significant operational limitations, including the loss or suspension of or moratoriums on accreditations, licenses or certificates of need, suspension of or nonpayment for new admissions, denial of reimbursement, suspension, decertification or exclusion from federal, state or foreign healthcare programs or the closure of facilities or communities; (d) our reliance on third-party managers and tenants to operate or exert substantial control over properties they manage for, or rent from, us, which limits our control and influence over such properties, their operations and their performance; (e) our reliance and the reliance of our managers, tenants and borrowers on the financial, credit and capital markets and the risk that those markets may be disrupted or become constrained; (f) our ability, and the ability of our managers, tenants and borrowers, to navigate the trends impacting our or their businesses and the industries in which we or they operate, including their ability to respond to the impact of the U.S. political environment on government funding and reimbursement programs, and the financial condition or business prospect of our managers, tenants and borrowers; (g) our ability to achieve the anticipated benefits and synergies from, and \n32\nTable of Contents\neffectively integrate, our completed or anticipated acquisitions and investments; (h) the risk of bankruptcy, inability to obtain benefits from governmental programs, insolvency or financial deterioration of our managers, tenants borrowers and other obligors which may, among other things, have an adverse impact on the ability of such parties to make payments or meet their other obligations to us, which could have an adverse impact on our results of operations and financial condition; (i) the risk that the borrowers under our loans or other investments default or that, to the extent we are able to foreclose or otherwise acquire the collateral securing our loans or other investments, we will be required to incur additional expense or indebtedness in connection therewith, that the assets will underperform expectations or that we may not be able to subsequently dispose of all or part of such assets on favorable terms; (j) our current and future amount of outstanding indebtedness, and our ability to access capital and to incur additional debt which is subject to our compliance with covenants in instruments governing our and our subsidiaries’ existing indebtedness; (k) risks related to the recognition of reserves, allowances, credit losses or impairment charges which are inherently uncertain and may increase or decrease in the future and may not represent or reflect the ultimate value of, or loss that we ultimately realize with respect to, the relevant assets, which could have an adverse impact on our results of operations and financial condition; (l) the risk that our management agreements or leases are not renewed or are renewed on less favorable terms, that our managers or tenants default under those agreements or that we are unable to replace managers or tenants on a timely basis or on favorable terms, if at all; (m) our ability to identify and consummate future investments in, or dispositions of, healthcare assets and effectively manage our portfolio opportunities and our investments in co-investment vehicles, joint ventures and minority interests, including our ability to dispose of such assets on favorable terms as a result of rights of first offer or rights of first refusal in favor of third parties; (n) risks related to development, redevelopment and construction projects, including costs associated with inflation, rising or elevated interest rates, labor conditions and supply chain pressures, and risks related to increased construction and development in markets in which our properties are located, including adverse effect on our future occupancy rates; (o) our ability to attract and retain talented employees; (p) the limitations and significant requirements imposed upon our business as a result of our status as a REIT and the adverse consequences (including the possible loss of our status as a REIT) that would result if we are not able to comply with such requirements; (q) the ownership limits contained in our certificate of incorporation with respect to our capital stock in order to preserve our qualification as a REIT, which may delay, defer or prevent a change of control of our company; (r) increases in our borrowing costs as a result of becoming more leveraged, including in connection with acquisitions or other investment activity and rising or elevated interest rates; (s) our exposure to various operational risks, liabilities and claims from our operating assets; (t) our dependency on a limited number of managers and tenants for a significant portion of our revenues and operating income; (u) our exposure to particular risks due to our specific asset classes and operating markets, such as adverse changes affecting our specific asset classes and the healthcare real estate sector, the competitiveness or financial viability of hospitals on or near the campuses where our outpatient medical buildings are located, our relationships with universities, the level of expense and uncertainty of our research tenants, and the limitation of our uses of some properties we own that are subject to ground lease, air rights or other restrictive agreements; (v) our ability to maintain a positive reputation for quality and service with our key stakeholders; (w) the availability, adequacy and pricing of insurance coverage provided by our policies and policies maintained by our managers, tenants, borrowers or other counterparties; (x) the risk of exposure to unknown liabilities from our investments in properties or businesses; (y) the risks or uncertainties relating to the use of, or inability to take advantage of the benefits of artificial intelligence by us or our managers, tenants or borrowers; (z) the occurrence of cybersecurity threats and incidents that could disrupt our or our managers’, tenants’ or borrower’s operations, result in the loss of confidential or personal information or damage our business relationships and reputation; (aa) the failure to maintain effective internal controls, which could harm our business, results of operations and financial condition; (bb) the impact of merger, acquisition and investment activity in the healthcare industry or otherwise affecting our managers, tenants or borrowers; (cc) disruptions to the management and operations of our business and the uncertainties caused by activist investors; (dd) the risk of catastrophic or extreme weather and other natural events and the physical effects of climate change; (ee) the risk of potential dilution resulting from future sales or issuances of our equity securities; and (ff) the other factors set forth in our periodic filings with the Securities and Exchange Commission.\nNote Regarding Third-Party Information\nThis Quarterly Report includes information that has been derived from SEC filings that have been provided to us by our tenants and managers or been derived from SEC filings or other publicly available information of our tenants and managers. We believe that such information is accurate and that the sources from which it has been obtained are reliable. However, we cannot guarantee the accuracy of such information and have not independently verified the assumptions on which such information is based.\n33\nTable of Contents\nCompany Overview\nVentas, Inc. is a real estate investment trust (“REIT”) focused on delivering strong, sustainable shareholder returns by enabling exceptional environments that benefit a large and growing aging population. We hold a portfolio that includes senior housing communities, outpatient medical buildings, research centers, hospitals and healthcare facilities located in North America and the United Kingdom. As of September 30, 2025, we owned or had investments in 1,406 properties consisting of \n1,371\n properties in our reportable business segments (“Segment Properties”) and 35 properties held by unconsolidated real estate entities in our non-segment operations. Our Company is headquartered in Chicago, Illinois with additional corporate offices in Louisville, Kentucky and New York, New York. \nWe elected to be taxed as a REIT under Sections 856 through 860 of the Internal Revenue Code of 1986, as amended (the “Code”), commencing with our taxable year ended December 31, 1999.  Provided we qualify for taxation as a REIT, we generally are not required to pay U.S. federal corporate income taxes on our REIT taxable income that is currently distributed to our stockholders.  In order to maintain our qualification as a REIT, we must satisfy a number of technical requirements, which impact how we invest in, operate and manage our assets. \nWe operate through three reportable business segments: senior housing operating portfolio, which we refer to as “SHOP,” outpatient medical and research portfolio, which we refer to as “OM&R,” and triple-net leased properties, which we refer to as “NNN.” We also hold assets outside of our reportable business segments, which we refer to as non-segment assets, and which consist primarily of corporate assets, including cash and cash equivalents, restricted cash, loans receivable and investments and accounts receivable as well as investments in unconsolidated entities. Our investments in unconsolidated entities include investments made through our third-party institutional private capital management platform, Ventas Investment Management (“VIM”). Through VIM, we partner with third-party institutional investors to invest in real estate through various joint ventures and other co-investment vehicles where we are the sponsor or general partner, including our open-ended investment vehicle, the Ventas Life Science & Healthcare Real Estate Fund (the “Ventas Fund”). Our investments in unconsolidated entities also includes investments in operating entities, such as Ardent Health Partners, LLC (together with its subsidiaries, “Ardent”) and Atria Senior Living, Inc. (together with its subsidiaries, “Atria”). \nOur chief operating decision maker evaluates performance of the combined properties in each operating segment and determines how to allocate resources to these segments based on net operating income (“NOI”) for each segment. See our Consolidated Financial Statements and the related notes, including “Note 16 – Segment Information,” included in Item 1 of this Quarterly Report on Form 10-Q. \nThe following table summarizes information for our portfolio for the nine months ended September 30, 2025 (dollars in thousands):\nSegment\nTotal NOI \n(1)\nPercentage of Total NOI\nSegment Properties\nSenior housing operating portfolio (SHOP)\n$\n853,212 \n48.1 \n%\n714 \nOutpatient medical and research portfolio (OM&R)\n440,273 \n24.8 \n411 \nTriple-net leased properties (NNN)\n458,360 \n25.9 \n246 \nNon-segment \n(2)\n20,465 \n1.2 \nn/a\n$\n1,772,310 \n100.0 \n%\n1,371 \n______________________________\n(1)    \n“NOI” is defined as total revenues, less interest and other income, property-level operating expenses and third-party capital management expenses. See “Non-GAAP Financial Measures” included elsewhere in this Quarterly Report on Form 10-Q for additional disclosure and a reconciliation of Net income attributable to common stockholders, as computed in accordance with U.S. generally accepted accounting principles (“GAAP”), to NOI.\n(2)    \nNOI for non-segment includes management fees and promote revenues, net of expenses related to our third-party institutional private capital management platform, income from loans and investments and corporate-level expenses not directly attributable to any of our three reportable business segments. \n34\nTable of Contents\nn/a—\nnot\n applicable\nBusiness Strategy\nFor more than 25 years, Ventas has pursued what we believe is a successful, enduring strategy focused on delivering outsized value to stockholders and other key stakeholders by enabling exceptional environments that benefit the aging population. Working with industry-leading care providers, partners, developers and research and medical institutions, our collaborative and experienced team is focused on achieving consistent, superior total returns through: (1) delivering profitable organic growth in senior housing, (2) capturing value-creating external growth focused on senior housing, (3) driving strong execution and cash flow generation throughout our portfolio of high-quality assets unified in serving the large and growing aging population and (4) maintaining financial strength, flexibility and liquidity. \nOur objective is to generate reliable and growing cash flows from our portfolio, which enables us to pay regular cash dividends to stockholders and creates opportunities to increase stockholder value.\nMarket Trends\nOur operations have historically been and are expected to continue to be impacted by economic and market conditions. We expect senior housing to benefit from strong supply/demand fundamentals, including robust projected demand growth combined with low projected supply growth.  \nThe performance and growth of our business will also depend on the broader macroeconomic environment, including consumer sentiment, interest rates, inflation and GDP growth.  \nSee “Risk Factors” in Part I, Item 1A of our 2024 Annual Report for additional discussion of risks affecting our business.\n2025 Highlights\nInvestments and Dispositions\n•\nDuring the nine months ended September 30, 2025, we acquired 41 senior housing communities reported in our SHOP segment for an aggregate purchase price of $2.0 billion.\n•\nDuring the nine months ended September 30, 2025, we sold one senior housing community in our SHOP segment, four properties in our OM&R segment and 10 properties in our NNN segment for aggregate consideration of $168.8 million and recognized $14.4 million gain on real estate disposition.\n•\nIn June 2025, an existing tenant exercised a legally binding and non-cancellable option to purchase 12 OM&R properties in June 2026. This transaction is accounted for as a lease modification resulting in a sales-type lease receivable of $38.5 million and a $20.8 million gain on real estate disposition. Interest income from the sales-type lease receivable will be recognized over the remaining lease term.\n•\nIn October 2025, we acquired six senior housing communities reported in our SHOP segment for an aggregate purchase price of $161.4 million.\nLiquidity and Capital\n•\nAs of September 30, 2025, we had $4.1 billion in liquidity, including approximately $3.5 billion of availability under our unsecured revolving credit facility, $188.6 million of cash and cash equivalents on hand and $417.9 million of estimated proceeds available under unsettled equity forward sales agreements, calculated using the forward price, net of fees, partially offset by $18.3 million in amounts outstanding under our uncommitted line for standby letters of credit.\n•\nIn April 2025, we amended our unsecured revolving credit facility to, among other things, increase our borrowing capacity from $2.75 billion to $3.5 billion.\n35\nTable of Contents\n•\nIn August 2025, we increased the amount that Ventas Realty may issue from time to time under its commercial paper program from a maximum aggregate amount outstanding at any time of $1.0 billion to $2.0 billion. Other than the increase in the program’s maximum capacity, the other terms of the commercial paper program remained unchanged.\nSenior Notes\n•\nIn January and February 2025, we repaid $450.0 million and $600.0 million aggregate principal amount of 2.65% Senior Notes due 2025 and 3.50% Senior Notes due 2025, respectively, at maturity.\n•\nIn June 2025, Ventas Realty issued $500.0 million aggregate principal amount of 5.10% Senior Notes due 2032 in a registered public offering. The proceeds were primarily used for general corporate purposes, which included repayment of other indebtedness and expenses related to the offering.\nMortgages\n•\nDuring the nine months ended September 30, 2025, we repaid in full mortgage loans in the aggregate principal amount of $499.0 million.\nDerivatives and Hedging\n•\nFor the nine months ended September 30, 2025, we entered into an aggregate $250.0 million notional amount of 10-year treasury locks to hedge interest rate risk on future debt issuances. The aggregate $250.0 million notional amount of treasury locks have a blended rate of 4.2%.\nEquity\n•\nIn June 2025, we amended the ATM Sales Agreement such that the aggregate gross sales price of common stock available for issuance under our at-the-market equity offering program (the “ATM Program”) immediately following the amendment was $2.25 billion.\n•\nAs of September 30, 2025, the remaining amount available under the ATM Program for future sales of common stock was $1.3 billion.\n•\nYear to date through October 30, 2025, the Company entered into equity forward sales agreements under the ATM Program for 35.2 million shares of common stock with gross proceeds of $2.4 billion, of which 7.3 million shares or $481.1 million of gross proceeds remained unsettled as of October 30, 2025.\n•\nIn May 2025, our stockholders approved the increase of authorized common stock from 600 million shares to 1.2 billion shares.\nOther Items\n•\nIn December 2024, we entered into agreements with Brookdale with respect to 121 senior housing properties in our NNN segment whose lease term was scheduled to expire under our Master Lease with Brookdale on December 31, 2025. Under these agreements, among other things: (i) the term of the Brookdale Master Lease for 65 senior housing properties was extended to December 31, 2035 and (ii) the term of the Brookdale Master Lease for 56 senior housing properties was set to expire on December 31, 2025 (the “Brookdale Conversion and Sale Communities”). We plan to sell or convert to our SHOP segment all of the Brookdale Conversion and Sale Communities. In connection therewith, (x) 13 of the Brookdale Conversion and Sale Communities were converted to our SHOP segment during the quarter ended September 30, 2025, and (y) 14 of the Brookdale Conversion and Sale Communities were converted to our SHOP segment on October 1, 2025.\n36\nTable of Contents\n•\nDuring the nine months ended September 30, 2025, the Ventas Fund, an equity method investee, acquired three senior housing communities and two outpatient medical buildings for an aggregate purchase price of $279.5 million.\n•\nDuring the nine months ended September 30, 2025, the Pension Fund Joint Venture, an equity method investee, sold five senior housing communities for aggregate consideration of $302.5 million.\n•\nDuring the nine months ended September 30, 2025, we transitioned 11 senior housing communities located in the United Kingdom within our NNN segment to our SHOP segment. Our SHOP operations in the UK are subject to a variety of UK laws and regulations, including laws and regulations related to quality of care, licensure, government reimbursement, fraud and abuse and data privacy.\nCritical Accounting Policies and Estimates\nOur Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q have been prepared in accordance with GAAP for interim financial information set forth in the Accounting Standards Codification (“ASC”), as published by the Financial Accounting Standards Board (“FASB”), and with the SEC instructions to Form 10-Q and Article 10 of Regulation S-X. GAAP requires us to make estimates and assumptions regarding future events that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. We base these estimates on our experience and assumptions we believe to be reasonable under the circumstances.  However, if our judgment or interpretation of the facts and circumstances relating to various transactions or other matters had been different, we may have applied a different accounting treatment, resulting in a different presentation of our financial statements. We periodically reevaluate our estimates and assumptions and, in the event they prove to be different from actual results, we make adjustments in subsequent periods to reflect more current estimates and assumptions about matters that are inherently uncertain.  \nOur 2024 Annual Report contains additional information regarding the critical accounting policies that affect our more significant estimates and judgments used in the preparation of our Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q. There have been no material changes to these policies in 2025. \nRecent Accounting Standards\nIn December 2023, the FASB issued Accounting Standards Update 2023-09, \nImprovements to Income Tax Disclosures\n (“ASU 2023-09”), which requires public entities on an annual basis to (i) disclose specific categories in the rate reconciliation and (ii) provide additional information for reconciling items that meet a quantitative threshold (if the effect of those reconciling items is equal to or greater than 5 percent of the amount computed by multiplying pretax income or loss by the applicable statutory income tax rate). ASU 2023-09 is effective for fiscal years beginning after December 15, 2024. We have elected not to early adopt. We are finalizing our assessment of the impact of ASU 2023-09 and expect to include additional required disclosures in our 2025 annual report on Form 10-K.\nIn March 2024, the SEC adopted the final rule under SEC Release No. 33-11275, \nThe Enhancement and Standardization of Climate Related Disclosures for Investors\n, which requires registrants to disclose climate-related information in registration statements and annual reports. The new rule would be effective for annual reporting periods beginning in fiscal year 2025. In April 2024, the SEC exercised its discretion to stay this rule and, subsequently, in March 2025, the SEC voted to end its defense of the rule against certain legal challenges. We are monitoring the ongoing judicial review of these legal challenges to determine the impact, if any, of the rule on our Consolidated Financial Statements.\n37\nTable of Contents\nOn November 4, 2024, the FASB issued ASU 2024-03, \nDisaggregation of Income Statement Expenses \n(“DISE”), which requires disaggregated disclosure of income statement expenses for public business entities (“PBEs”). ASU 2024-03 requires PBEs to include footnote disclosure that disaggregates, in a tabular presentation, each relevant expense caption on the face of the income statement that includes certain natural expenses relevant to the Company, such as (i) employee compensation, (ii) depreciation and (iii) intangible asset amortization. The tabular disclosure must also include certain other expenses, when applicable. The ASU does not change the expense captions an entity presents on the face of the income statement; rather, it requires disaggregation of certain expense captions into specified categories in disclosures within the footnotes to the financial statements. ASU 2024-03 is effective for annual reporting periods beginning after December 15, 2026 and interim reporting periods beginning after December 15, 2027. The requirements will be applied prospectively with the option for retrospective application. We are evaluating the impact of adopting ASU 2024-03 on our Consolidated Financial Statements.\n    \nResults of Operations\nAs of September 30, 2025, we operated through three reportable business segments: SHOP, OM&R and NNN. In our SHOP segment, we own and invest in senior housing communities and engage operators to operate those communities. In our OM&R segment, we primarily acquire, own, develop, lease and manage outpatient medical buildings and research centers. In our NNN segment, we invest in and own senior housing communities, skilled nursing facilities (“SNFs”), long-term acute care facilities (“LTACs”), freestanding inpatient rehabilitation facilities (“IRFs”) and other healthcare facilities and lease these properties to tenants under triple-net or absolute-net leases that obligate the tenants to pay all property-related expenses, including maintenance, utilities, repairs, taxes, insurance and capital expenditures. Information provided for “non-segment” includes management fees and promote revenues, net of expenses related to our third-party institutional private capital management platform, income from loans and investments and corporate-level expenses not directly attributable to any of our three reportable business segments. Non-segment assets consist primarily of corporate assets, including cash and cash equivalents, restricted cash, loans receivable and investments and accounts receivable.  \nOur CODM is the Chief Executive Officer of the Company. Our CODM evaluates performance of the combined properties in each operating segment and determines how to allocate resources to these segments, based on NOI for each segment. For further information regarding our reportable business segments and a discussion of our definition of NOI, see “Note 16 – Segment Information” of the Notes to Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q. See “Non-GAAP Financial Measures” included elsewhere in this Quarterly Report on Form 10-Q for additional disclosure and reconciliations of Net income attributable to common stockholders, as computed in accordance with GAAP, to NOI.\n38\nTable of Contents\nThree Months Ended September 30, 2025 and 2024 \nThe table below shows our results of operations for the three months ended September 30, 2025 and 2024 and the effect of changes in those results from period to period on our Net income attributable to common stockholders (dollars in thousands):\n \nFor the Three Months Ended September 30,\nIncrease (Decrease) to Net Income\n \n2025\n2024\n$\n%\nNOI:\n \n \n \n \nSHOP\n$\n302,296 \n$\n213,982 \n$\n88,314 \n41.3 \n%\nOM&R\n147,745 \n144,096 \n3,649 \n2.5 \nNNN\n157,038 \n150,970 \n6,068 \n4.0 \nNon-segment\n7,818 \n4,102 \n3,716 \n90.6 \nTotal NOI\n614,897 \n513,150 \n101,747 \n19.8 \nInterest and other income\n4,184 \n8,204 \n(4,020)\n(49.0)\nInterest expense\n(158,124)\n(150,437)\n(7,687)\n(5.1)\nDepreciation and amortization\n(357,173)\n(304,268)\n(52,905)\n(17.4)\nGeneral, administrative and professional fees\n(40,387)\n(35,092)\n(5,295)\n(15.1)\nLoss on extinguishment of debt, net\n(119)\n— \n(119)\nnm\nTransaction, transition and restructuring costs\n(5,472)\n(8,580)\n3,108 \n36.2 \nRecovery of allowance on loans receivable and investments, net\n— \n56 \n(56)\nnm\nOther expense\n(13,370)\n(3,935)\n(9,435)\nnm\nIncome before unconsolidated entities, real estate dispositions, income taxes and noncontrolling interests\n44,436 \n19,098 \n25,338 \n132.7 \nIncome from unconsolidated entities\n16,644 \n4,629 \n12,015 \nnm\nGain on real estate dispositions\n1,283 \n271 \n1,012 \nnm\nIncome tax benefit (expense)\n6,345 \n(3,002)\n9,347 \nnm\nNet income\n68,708 \n20,996 \n47,712 \nnm\nNet income attributable to noncontrolling interests\n2,661 \n1,753 \n908 \n51.8 \nNet income attributable to common stockholders\n$\n66,047 \n$\n19,243 \n$\n46,804 \nnm\n______________________________\nnm - not meaningful\nNOI—SHOP Segment\nThe following table summarizes results of operations in our SHOP segment for the three months ended September 30, 2025 (dollars in thousands):\n \nFor the Three Months Ended September 30,\n Increase (Decrease) to NOI\n \n2025\n2024\n$\n%\nNOI—SHOP:\n \n \n \n \nResident fees and services\n$\n1,088,546 \n$\n845,532 \n$\n243,014 \n28.7 \n%\nLess: Property-level operating expenses\n(786,250)\n(631,550)\n(154,700)\n(24.5)\nNOI\n$\n302,296 \n$\n213,982 \n$\n88,314 \n41.3 \n39\nTable of Contents\nSegment Properties at September 30,\nAverage Unit Occupancy for the Three Months Ended September 30,\nAverage Monthly Revenue Per Occupied Room for the Three Months Ended September 30,\n \n2025\n2024\n2025\n2024\n2025\n2024\nTotal communities\n714 \n591 \n87.9 \n%\n85.3 \n%\n$\n5,307 \n$\n4,937 \nResident fees and services include all amounts earned from residents at the senior housing communities in our SHOP segment, such as rental fees related to resident leases, extended healthcare fees and other ancillary service income. Property-level operating expenses related to our SHOP segment include labor, food, utilities, real estate taxes, insurance, repairs and maintenance, marketing, management fees, supplies and other costs of operating the properties. For senior housing communities in our SHOP segment, occupancy generally reflects average operator-reported unit occupancy for the reporting period. Average monthly revenue per occupied room reflects average resident fees and services per operator-reported occupied unit for the reporting period. \nThe increase in our SHOP segment NOI for the three months ended September 30, 2025 compared to the same period in 2024 was primarily driven by revenue growth due to increase in average occupancy, revenue per occupied room and more properties as a result of acquisitions, partially offset by higher property-level operating expenses due to more assets, higher occupancy and inflationary increases.\nThe following table compares results of operations for our 520 Same-Store SHOP communities (dollars in thousands). See “Non-GAAP Financial Measures\n—\nNOI” included elsewhere in this Quarterly Report on Form 10-Q for additional disclosure regarding Same-Store NOI for each of our reportable business segments.\n \nFor the Three Months Ended September 30,\nIncrease (Decrease) to NOI\n \n2025\n2024\n$\n%\nSame-Store NOI—SHOP:\n \n \n \n \nResident fees and services\n$\n822,631 \n$\n762,198 \n$\n60,433 \n7.9 \n%\nLess: Property-level operating expenses\n(590,238)\n(561,714)\n(28,524)\n(5.1)\nNOI\n$\n232,393 \n$\n200,484 \n$\n31,909 \n15.9 \n \nSegment Properties at September 30,\nAverage Unit Occupancy for the Three Months Ended September 30,\nAverage Monthly Revenue Per Occupied Room for the Three Months Ended September 30,\n \n2025\n2024\n2025\n2024\n2025\n2024\nSame-Store communities\n520 \n520 \n89.0 \n%\n86.3 \n%\n$\n5,221 \n$\n4,986 \nThe increase in our Same-Store SHOP segment NOI for the three months ended September 30, 2025 compared to the same period in 2024 was primarily driven by higher average occupancy and revenue per occupied room, partially offset by higher property-level operating expenses due to higher occupancy and inflationary increases.\n40\nTable of Contents\nNOI—OM&R Segment\nThe following table summarizes results of operations in our OM&R segment for the three months ended September 30, 2025 (dollars in thousands). For properties in our OM&R segment, occupancy generally reflects occupied square footage divided by net rentable square footage as of the end of the reporting period. \n \nFor the Three Months Ended September 30,\nIncrease (Decrease) to NOI\n \n2025\n2024\n$\n%\nNOI—OM&R:\n \n \n \n \nRental income\n$\n226,200 \n$\n220,957 \n$\n5,243 \n2.4 \n%\nThird-party capital management revenues\n681 \n618 \n63 \n10.2 \nTotal revenues\n226,881 \n221,575 \n5,306 \n2.4 \nLess:\nProperty-level operating expenses\n(79,136)\n(77,479)\n(1,657)\n(2.1)\nNOI\n$\n147,745 \n$\n144,096 \n$\n3,649 \n2.5 \nSegment Properties at September 30,\n Occupancy at September 30,\nAnnualized Average Rent Per Occupied Square Foot for the Three Months Ended September 30,\n \n2025\n2024\n2025\n2024\n2025\n2024\nTotal OM&R\n411 \n426 \n88.4 \n%\n87.7 \n%\n$\n39 \n$\n38 \nThe $3.6 million\n \nincrease in our OM&R segment NOI for the three months ended September 30, 2025 compared to the same period in 2024 was primarily due to new leasing activity, high tenant retention and additional NOI from a development project placed into service, partially offset by higher property-level operating expenses and dispositions.\nThe following table compares results of operations for our 402 Same-Store OM&R properties (dollars in thousands):\n \nFor the Three Months Ended September 30,\nIncrease (Decrease) to NOI\n \n2025\n2024\n$\n%\nSame-Store NOI—OM&R:\n \n \n \n \nRental income\n$\n214,056 \n$\n209,280 \n$\n4,776 \n2.3 \n%\nLess: Property-level operating expenses\n(73,119)\n(71,483)\n(1,636)\n(2.3)\nNOI\n$\n140,937 \n$\n137,797 \n$\n3,140 \n2.3 \nSegment Properties at September 30,\nOccupancy at September 30,\nAnnualized Average Rent Per Occupied Square Foot for the Three Months Ended September 30,\n \n2025\n2024\n2025\n2024\n2025\n2024\nSame-Store OM&R\n402 \n402 \n90.4 \n%\n89.7 \n%\n$\n38 \n$\n38 \nThe $3.1 million\n \nincrease in our Same-Store OM&R segment NOI for the three months ended September 30, 2025 compared to the same period in 2024 is primarily due to higher occupancy driven by new leasing activity and high tenant retention, partially offset by higher property-level operating expenses.\n41\nTable of Contents\nNOI—NNN Segment\nThe following table summarizes results of operations in our 246 NNN segment properties for the three months ended September 30, 2025 (dollars in thousands):\nFor the Three Months Ended September 30,\nIncrease to NOI\n \n2025\n2024\n$\n%\nNOI—NNN:\n \n \n \n \nRental income\n$\n160,050 \n$\n155,349 \n$\n4,701 \n3.0 \n%\nLess: Property-level operating expenses\n(3,012)\n(4,379)\n1,367 \n31.2 \nNOI\n$\n157,038 \n$\n150,970 \n$\n6,068 \n4.0 \nIn our NNN segment, our revenues generally consist of fixed rental amounts (subject to contractual escalations) received from our tenants in accordance with the applicable lease terms. We report revenues and property-level operating expenses within our NNN segment for real estate tax and insurance expenses that are paid from escrows collected from our tenants.\nThe $6.1 million\n \nincrease in our NNN segment NOI for the three months ended September 30, 2025 compared to the same period in 2024 was primarily driven by a $14.6 million increase in rental income primarily due to the net non-cash revenue impact of changed revenue recognition from cash to straight-line related to a senior housing triple-net tenant and a $3.7 million increase in rental income from acquisitions in the third quarter of 2024, partially offset by a $8.2 million decrease in rental income from dispositions and a $5.8 million decrease in rental income from senior housing communities that converted to our SHOP segment.\nOccupancy rates may affect the profitability of our tenants’ operations. For senior housing communities and post-acute properties in our NNN segment, occupancy generally reflects average operator-reported unit and bed occupancy, respectively, for the reporting period. Because triple-net occupancy reporting is delivered to us following the reporting period, occupancy is reported in arrears. The following table sets forth average continuing occupancy rates for the trailing 12 months ended June 30, 2025\n and \n2024 related to the triple-net leased properties we owned and that were included in our NNN segment at September 30, 2025 and 2024, respectively. The table excludes (i) properties classified as held for sale, (ii) non-stabilized properties, (iii) certain properties for which we do not receive occupancy information and (iv) properties acquired or properties that transitioned operators for which we do not have a full quarter of occupancy results.\nNumber of Properties at September 30, 2025\nAverage Occupancy for the 12 Months Ended June 30, 2025\nNumber of Properties at September 30, 2024\nAverage Occupancy for the 12 Months Ended June 30, 2024\nSenior housing communities\n143\n79.1%\n199\n77.7%\nSNFs\n17\n85.6\n18\n84.5\nIRFs and LTACs\n34\n55.5\n37\n52.9\nThe following table compares results of operations for our 195 Same-Store NNN properties (dollars in thousands):\n \nFor the Three Months Ended September 30,\nIncrease to NOI\n \n2025\n2024\n$\n%\nSame-Store NOI—NNN:\n \n \n \n \nRental income\n$\n131,599 \n$\n115,125 \n$\n16,474 \n14.3 \n%\nLess: Property-level operating expenses\n(2,915)\n(3,242)\n327 \n10.1 \nNOI\n$\n128,684 \n$\n111,883 \n$\n16,801 \n15.0 \n42\nTable of Contents\nThe increase in our Same-Store NNN segment rental income for the three months ended September 30, 2025 compared to the same period in 2024 was attributable primarily to a $14.6 million increase in rental income primarily as a result of the reversal of straight-line rent reserve.\nNOI—Non-Segment\nNon-segment NOI includes management fees and promote revenues, net of expenses, related to our third-party institutional private capital management platform, income from loans and investments and corporate-level expenses not directly attributable to any of our three reportable business segments. The $3.7 million increase in non-segment NOI for the three months ended September 30, 2025 compared to the same period in 2024 was primarily due to a $2.6 million increase in interest income from a secured loan receivable made in September 2024 and a $1.3 million increase in interest income from a sales-type lease receivable made in June 2025.\nCorporate Results\nInterest and other income\nThe $4.0 million decrease in Interest and other income for the three months ended September 30, 2025 compared to the same period in 2024 was primarily due to a decrease in overall cash and cash equivalents invested in short-term money market funds.\nInterest expense\nThe $7.7 million increase in Interest expense, net of capitalized interest, for the three months ended September 30, 2025 compared to the same period in 2024 was driven primarily by higher rates, partially offset by a reduction in overall debt balance. Our weighted average effective interest rate was 4.59% and 4.44% for the three months ended September 30, 2025 and 2024, respectively. Our weighted average debt outstanding was $13.3 billion and $13.4 billion for the three months ended September 30, 2025 and 2024, respectively.  \nDepreciation and amortization\nThe $52.9 million increase in Depreciation and amortization expense for the three months ended September 30, 2025 compared to the same period in 2024 was primarily due to a $51.0 million increase from a net increase in depreciable real estate assets and a $10.0 million increase in impairments, partially offset by a $8.9 million decrease in amortization related to intangible assets that were fully amortized.\n    \nGeneral, administrative and professional fees\nThe $5.3 million increase in General, administrative and professional fees for the three months ended September 30, 2025 compared to the same period in 2024 was primarily due to our expanded employee base consistent with enterprise growth and inflationary increases.\nLoss on extinguishment of debt, net\nLoss on extinguishment of debt, net for the three months ended September 30, 2025 compared to the same period in 2024 was insignificant.\nTransaction, transition and restructuring costs\nThe $3.1 million decrease in Transaction, transition and restructuring costs for the three months ended September 30, 2025 compared to the same period in 2024 was primarily due to decreased business model conversion costs and higher costs incurred in connection with lease amendments in 2024.\nRecovery of allowance on loans receivable and investments, net\nRecovery of allowance on loans receivable and investments, net for the three months ended September 30, 2025 compared to the same period in 2024 was insignificant.\n43\nTable of Contents\nOther expense\nThe $9.4 million increase in Other expense for the three months ended September 30, 2025 compared to the same period in 2024 was primarily due to mark to market adjustments to our derivative instruments in 2025.\nIncome from unconsolidated entities\nThe $12.0 million increase in Income from unconsolidated entities for the three months ended September 30, 2025 compared to the same period in 2024 was primarily due to an increase from gain on real estate dispositions by the Pension Fund Joint Venture in 2025, partially offset by a gain recognized in 2024 following Ardent’s initial public offering and the resulting decrease in our equity stake in Ardent.\nGain on real estate dispositions\nFor the three months ended September 30, 2025, we sold four properties for a $1.3 million gain. For the three months ended September 30, 2024, we sold four properties for a gain of $0.3 million.\nIncome tax benefit (expense)\nThe $6.3 million income tax benefit for the three months ended September 30, 2025 is primarily due to the reversal of valuation allowances recorded against the net deferred tax assets of certain of our TRS entities, partially offset by increases in the valuation allowance for certain TRS entities during the periods. The $3.0 million income tax expense for the three months ended September 30, 2024 was primarily due to the enactment of Bill C-59 in Canada, which limits the amount of interest expense we can deduct with respect to our Canadian entities. Bill C-59 became effective in June 2024 and was retrospectively applied to the period beginning October 1, 2023. The cumulative tax effect of such interest limitation was recognized in the three months ended June 30, 2024. The impact of the interest limitation was partially offset by the reversal of valuation allowances recorded against the net deferred tax assets of certain of our TRS entities and losses in certain of our TRS entities.\n44\nTable of Contents\nNine Months Ended September 30, 2025 and 2024 \nThe table below shows our results of operations for the nine months ended September 30, 2025 and 2024 and the effect of changes in those results from period to period on our Net income attributable to common stockholders (dollars in thousands): \nFor the Nine Months Ended September 30,\nIncrease (Decrease) to Net Income\n \n2025\n2024\n$\n%\nNOI:\n \n \n \n \nSHOP\n$\n853,212 \n$\n631,706 \n$\n221,506 \n35.1 \n%\nOM&R\n440,273 \n435,938 \n4,335 \n1.0 \nNNN\n458,360 \n453,028 \n5,332 \n1.2 \nNon-segment\n20,465 \n10,716 \n9,749 \n91.0 \nTotal NOI\n1,772,310 \n1,531,388 \n240,922 \n15.7 \nInterest and other income\n13,133 \n19,809 \n(6,676)\n(33.7)\nInterest expense\n(457,778)\n(449,629)\n(8,149)\n(1.8)\nDepreciation and amortization\n(1,026,417)\n(944,371)\n(82,046)\n(8.7)\nGeneral, administrative and professional fees\n(136,392)\n(121,556)\n(14,836)\n(12.2)\nLoss on extinguishment of debt, net\n(119)\n(672)\n553 \n82.3 \nTransaction, transition and restructuring costs\n(16,081)\n(16,143)\n62 \n0.4 \nRecovery of allowance on loans receivable and investments, net\n— \n166 \n(166)\nnm\nShareholder relations matters\n— \n(15,751)\n15,751 \nnm\nOther expense\n(20,621)\n(10,729)\n(9,892)\n(92.2)\nIncome (loss) before unconsolidated entities, real estate dispositions, income taxes and noncontrolling interests\n128,035 \n(7,488)\n135,523 \nnm\nIncome (loss) from unconsolidated entities\n12,195 \n(5,406)\n17,601 \nnm\nGain on real estate dispositions\n35,268 \n50,282 \n(15,014)\n(29.9)\nIncome tax benefit (expense)\n13,028 \n(7,764)\n20,792 \nnm\nNet income\n188,526 \n29,624 \n158,902 \nnm\nNet income attributable to noncontrolling interests\n7,347 \n5,306 \n(2,041)\n(38.5)\nNet income attributable to common stockholders\n$\n181,179 \n$\n24,318 \n$\n156,861 \nnm\n______________________________\nnm - not meaningful\nNOI—SHOP Segment\nThe following table summarizes results of operations in our SHOP segment for the nine months ended September 30, 2025 (dollars in thousands):\nFor the Nine Months Ended September 30,\nIncrease (Decrease) to NOI\n2025\n2024\n$\n%\nNOI—SHOP:\nResident fees and services\n$\n3,090,164\n \n$\n2,476,436\n \n$\n613,728 \n24.8 \n%\nLess: Property-level operating expenses\n(2,236,952)\n(1,844,730)\n(392,222)\n(21.3)\nNOI\n$\n853,212 \n$\n631,706 \n$\n221,506 \n35.1 \n45\nTable of Contents\nSegment Properties at September 30,\nAverage Unit Occupancy for the Nine Months Ended September 30,\n Average Monthly Revenue Per Occupied Room for the Nine Months Ended September 30,\n2025\n2024\n2025\n2024\n2025\n2024\nTotal communities\n714 \n591 \n86.8 \n%\n83.9 \n%\n$\n5,228 \n$\n4,921 \nThe increase in our SHOP segment NOI for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily driven by revenue growth due to increase in average occupancy, revenue per occupied room and more properties as a result of net acquisitions, partially offset by higher property-level operating expenses due to more assets, higher occupancy and inflationary increases.\nThe following table compares results of operations for our 495 Same-Store SHOP communities (dollars in thousands). See “Non-GAAP Financial Measures\n—\nNOI” included elsewhere in this Quarterly Report on Form 10-Q for additional disclosure regarding Same-Store NOI for each of our reportable business segments.\nFor the Nine Months Ended September 30,\nIncrease (Decrease) to NOI\n2025\n2024\n$\n%\nSame-Store NOI—SHOP:\nResident fees and services\n$\n2,343,370 \n$\n2,166,549 \n$\n176,821 \n8.2 \n%\nLess: Property-level operating expenses\n(1,681,130)\n(1,592,489)\n(88,641)\n(5.6)\nNOI\n$\n662,240 \n$\n574,060 \n$\n88,180 \n15.4 \nSegment Properties at September 30,\nAverage Unit Occupancy for the Nine Months Ended September 30,\n Average Monthly Revenue Per Occupied Room for the Nine Months Ended September 30,\n2025\n2024\n2025\n2024\n2025\n2024\nSame-Store communities\n495 \n495 \n88.2 \n%\n85.5 \n%\n$\n5,226 \n$\n4,986 \nThe increase in our Same-Store SHOP segment NOI for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily driven by higher average occupancy and revenue per occupied room, partially offset by higher property-level operating expenses due to higher occupancy and inflationary increases.\nNOI—OM&R Segment\nThe following table summarizes results of operations in our OM&R segment for the nine months ended September 30, 2025 (dollars in thousands). For properties in our OM&R segment, occupancy generally reflects occupied square footage divided by net rentable square footage as of the end of the reporting period.\nFor the Nine Months Ended September 30,\nIncrease (Decrease) to NOI\n2025\n2024\n$\n%\nNOI—OM&R:\nRental income\n$\n668,333 \n$\n658,687 \n$\n9,646 \n1.5 \n%\nThird-party capital management revenues\n2,034 \n1,954 \n80 \n4.1 \nTotal revenues\n670,367 \n660,641 \n9,726 \n1.5 \nLess:\nProperty-level operating expenses\n(230,094)\n(224,703)\n(5,391)\n(2.4)\nNOI\n$\n440,273 \n$\n435,938 \n$\n4,335 \n1.0 \n46\nTable of Contents\nSegment Properties at September 30,\nOccupancy at September 30,\nAnnualized Average Rent Per Occupied Square Foot for the Nine Months Ended September 30,\n2025\n2024\n2025\n2024\n2025\n2024\nTotal OM&R\n411 \n426 \n88.4 \n%\n87.7 \n%\n$\n38 \n$\n38 \n    \nThe $4.3 million\n \nincrease in our OM&R segment NOI for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily due to new leasing activity, high tenant retention and additional NOI from a development project placed into service, partially offset by higher property-level operating expenses and dispositions.\nThe following table compares results of operations for our 400 Same-Store OM&R properties (dollars in thousands): \nFor the Nine Months Ended September 30,\nIncrease (Decrease) to NOI\n2025\n2024\n$\n%\nSame-Store NOI—OM&R:\nRental income\n$\n625,149 \n$\n612,287 \n$\n12,862 \n2.1 \n%\nLess: Property-level operating expenses\n(209,900)\n(203,823)\n(6,077)\n(3.0)\nNOI\n$\n415,249 \n$\n408,464 \n$\n6,785 \n1.7 \nSegment Properties at September 30,\nOccupancy at September 30,\nAnnualized Average Rent Per Occupied Square Foot for the Nine Months Ended September 30,\n2025\n2024\n2025\n2024\n2025\n2024\nSame-Store OM&R\n400 \n400 \n90.4 \n%\n89.8 \n%\n$\n38 \n$\n37 \n    \nThe $6.8 million\n \nincrease in our Same-Store OM&R segment NOI for the nine months ended September 30, 2025 compared to the same period in 2024 is primarily due to higher occupancy driven by new leasing activity and high tenant retention, partially offset by higher property-level operating expenses.\nNOI— NNN Segment\nThe following table summarizes results of operations in our 246 NNN segment properties for the nine months ended September 30, 2025 (dollars in thousands):\nFor the Nine Months Ended September 30,\nIncrease to NOI\n2025\n2024\n$\n%\nNOI—NNN:\nRental income\n$\n468,865 \n$\n464,651 \n$\n4,214 \n0.9 \n%\nLess: Property-level operating expenses\n(10,505)\n(11,623)\n1,118 \n9.6 \nNOI\n$\n458,360 \n$\n453,028 \n$\n5,332 \n1.2 \nThe $5.3 million\n \nincrease in our NNN segment NOI for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily driven by a $14.6 million increase in rental income primarily due to the net non-cash revenue impact of changed revenue recognition from cash to straight-line related to a senior housing triple-net tenant, a $13.0 million increase in rental income from acquisitions in the third quarter of 2024, a $6.5 million net increase in rental income from lease renewals, contractual rent escalators and timing of rent collection, partially offset by a $16.1 million decrease in rental income from senior housing communities that converted to our SHOP segment and a $14.2 million decrease in rental income from dispositions.\n47\nTable of Contents\nThe following table compares results of operations for our 194 Same-Store NNN properties (dollars in thousands):\nFor the Nine Months Ended September 30,\nIncrease (Decrease) to NOI\n2025\n2024\n$\n%\nSame-Store NOI—NNN:\nRental income\n$\n364,784 \n$\n342,805 \n$\n21,979 \n6.4 \n%\nLess: Property-level operating expenses\n(8,881)\n(8,666)\n(215)\n(2.5)\nNOI\n$\n355,903 \n$\n334,139 \n$\n21,764 \n6.5 \nThe increase in our Same-Store NNN segment rental income for the nine months ended September 30, 2025 compared to the same period in 2024 was attributable primarily to a $14.6 million increase in rental income primarily as a result of the reversal of straight-line rent reserve and a $6.5 million net increase in rental income from lease renewals, contractual rent escalators and timing of rent collection.\nNOI—Non-Segment\nThe $9.7 million increase in non-segment NOI for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily due to a $8.6 million increase in interest income from a secured loan receivable made in September 2024 and a $1.5 million increase in interest income from a sales-type lease receivable made in June 2025.\nCorporate Results\nInterest and other income\nThe $6.7 million decrease in Interest and other income for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily due to a decrease in overall cash and cash equivalents invested in short-term money market funds.\nInterest expense\nThe $8.1 million increase in Interest expense, net of capitalized interest for the nine months ended September 30, 2025 compared to the same period in 2024 was driven primarily by higher rates, partially offset by a reduction in overall debt balance. Our weighted average effective interest rate was 4.54% and 4.40% for the nine months ended September 30, 2025 and 2024, respectively. Our weighted average debt outstanding was $13.2 billion and $13.4 billion for the nine months ended September 30, 2025 and 2024, respectively.  \nDepreciation and amortization\nThe $82.0 million increase in Depreciation and amortization expense for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily due to a $128.0 million increase from a net increase in depreciable real estate assets and a $16.1 million increase in impairments, partially offset by a $64.7 million decrease in amortization related to intangible assets that were fully amortized.\nGeneral, administrative and professional fees\nThe $14.8 million increase in General, administrative and professional fees for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily due to our expanded employee base consistent with enterprise growth and inflationary increases.\nLoss on extinguishment of debt, net\nLoss on extinguishment of debt, net for the nine months ended September 30, 2025 was insignificant.\n48\nTable of Contents\nTransaction, transition and restructuring costs\nTransaction, transition and restructuring costs for the nine months ended September 30, 2025 compared to the same period in 2024 was relatively consistent.\nRecovery of allowance on loans receivable and investments, net \nRecovery of allowance on loans receivable and investments, net for the nine months ended September 30, 2025 compared to the same period in 2024 was insignificant.\nShareholder relations matters\nShareholder relations matters of $15.8 million for the nine months ended September 30, 2024 was related to proxy advisory costs related to our response to a proxy campaign associated with the Company’s 2024 annual meeting of stockholders and such costs did not reoccur in 2025.\nOther expense\nThe $9.9 million increase in Other expense for the nine months ended September 30, 2025 compared to the same period in 2024 was primarily due to mark to market adjustments to our derivative instruments in 2025.\nIncome (loss) from unconsolidated entities\nThe $17.6 million change in Income (loss) from unconsolidated entities for the nine months ended September 30, 2025 compared to the same period in 2024 is primarily due increase from gain on real estate dispositions by the Pension Fund Joint Venture in 2025, partially offset by a gain recognized in 2024 following Ardent’s initial public offering and the resulting decrease in our equity stake in Ardent.\nGain on real estate dispositions\nFor the nine months ended September 30, 2025, we sold 15 properties for a gain of $14.4 million and entered into a sales-type lease which resulted in a gain of $20.8 million. For the nine months ended September 30, 2024, we sold 52 properties for a gain of $50.3 million.\nIncome tax benefit (expense)\nThe $13.0 million of income tax benefit for the nine months ended September 30, 2025 is primarily due to the reversal of valuation allowances recorded against the net deferred tax assets of certain of our TRS entities, partially offset by increases in the valuation allowance for certain TRS entities during the periods. The $7.8 million of income tax expense for the nine months ended September 30, 2024 was primarily due to the enactment of Bill C-59 in Canada, which limits the amount of interest expense we can deduct with respect to our Canadian entities. Bill C-59 became effective in June 2024 and was retrospectively applied to the period beginning October 1, 2023. The cumulative tax effect of such interest limitation was recognized in the three months ended June 30, 2024. The impact of the interest limitation was partially offset by the reversal of valuation allowances recorded against the net deferred tax assets of certain of our TRS entities and losses in certain of our TRS entities.\nNon-GAAP Financial Measures\nWe consider certain non-GAAP financial measures to be useful supplemental measures of our operating performance.  A non-GAAP financial measure is a measure of historical or future financial performance, financial position or cash flows that excludes or includes amounts that are not so excluded from or included in the most directly comparable measure calculated and presented in accordance with GAAP. Described below are the non-GAAP financial measures used by management to evaluate our operating performance and that we consider most useful to investors, together with reconciliations of these measures to the most directly comparable GAAP measures.\n49\nTable of Contents\nThe non-GAAP financial measures we present in this Quarterly Report on Form 10-Q may not be comparable to those presented by other companies, which may define similarly titled measures differently than we do. You should not consider these measures as alternatives for, or superior to, financial measures calculated in accordance with GAAP. In order to facilitate a clear understanding of our consolidated historical operating results, you should examine these measures in conjunction with the most directly comparable GAAP measures as presented in our Consolidated Financial Statements and other financial data included elsewhere in this Quarterly Report on Form 10-Q.\nNareit Funds From Operations and Normalized Funds From Operations Attributable to Common Stockholders\nHistorical cost accounting for real estate assets implicitly assumes that the value of real estate assets diminishes predictably over time. However, since real estate values historically have risen or fallen with market conditions, many industry investors deem presentations of operating results for real estate companies that use historical cost accounting to be insufficient by themselves. For that reason, we consider Nareit Funds From Operations attributable to common stockholders (“FFO”) and Normalized FFO attributable to common stockholders (“Normalized FFO”) to be appropriate supplemental measures of operating performance of an equity REIT. We believe that the presentation of FFO, combined with the presentation of required GAAP financial measures, has improved the understanding of operating results of REITs among the investing public and has helped make comparisons of REIT operating results more meaningful. Management generally considers FFO to be a useful measure for understanding and comparing our operating results because, by excluding gains and losses related to sales of previously depreciated operating real estate assets, impairment losses on depreciable real estate and real estate asset depreciation and amortization (which can differ across owners of similar assets in similar condition based on historical cost accounting and useful life estimates), FFO can help investors compare the operating performance of a company’s real estate across reporting periods and to the operating performance of other companies. We believe that Normalized FFO is useful because it allows investors, analysts and our management to compare our operating performance across periods on a consistent basis. In some cases, we provide information about identified non-cash components of FFO and Normalized FFO because it allows investors, analysts and our management to assess the impact of those items on our financial results. \nWe use the National Association of Real Estate Investment Trusts (“Nareit”) definition of FFO. Nareit defines FFO as net income attributable to common stockholders (computed in accordance with GAAP) excluding gains (or losses) from sales of real estate property, including gain (or loss) on re-measurement of equity method investments and impairment write-downs of depreciable real estate, plus real estate depreciation and amortization, and after adjustments for unconsolidated entities and noncontrolling interests. Adjustments for unconsolidated entities and noncontrolling interests will be calculated to reflect FFO on the same basis. We define Normalized FFO as Nareit FFO excluding the following income and expense items, without duplication: (a) gains and losses on derivatives, net and changes in the fair value of financial instruments; (b) the non-cash impact of income tax benefits or expenses; (c) gains and losses on extinguishment of debt, net including the write-off of unamortized deferred financing fees or additional costs, expenses, discounts, make-whole payments, penalties or premiums incurred as a result of early retirement or payment of our debt; (d) transaction, transition and restructuring costs; (e) amortization of other intangibles; (f) the non-cash impact of changes to our executive equity compensation plan; (g) net expenses or recoveries related to significant disruptive events; (h) the impact of expenses related to asset impairment and valuation allowances; (i) the financial impact of contingent consideration; (j) gains and losses on non-real estate dispositions and other normalizing items related to noncontrolling interests and unconsolidated entities; and (k) other items set forth in the Normalized FFO reconciliation included herein.\n50\nTable of Contents\nThe following table summarizes our FFO and Normalized FFO for the three and nine months ended September 30, 2025 and 2024 (dollars in thousands):\n \nFor the Three Months Ended September 30,\nFor the Nine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nNet income attributable to common stockholders\n$\n66,047 \n$\n19,243 \n$\n181,179 \n$\n24,318 \nAdjustments:\n \nDepreciation and amortization on real estate assets\n355,453 \n303,599 \n1,021,865 \n942,399 \nDepreciation on real estate assets related to noncontrolling interests\n(4,252)\n(3,942)\n(12,396)\n(11,536)\nDepreciation on real estate assets related to unconsolidated entities\n20,812 \n12,890 \n55,523 \n36,707 \nGain on real estate dispositions\n(1,283)\n(271)\n(35,268)\n(50,282)\nGain on real estate dispositions related to noncontrolling interests\n— \n— \n— \n9 \nGain on real estate dispositions related to unconsolidated entities\n(28,003)\n(34)\n(28,027)\n(34)\nNareit FFO attributable to common stockholders\n408,774 \n331,485 \n1,182,876 \n941,581 \nAdjustments:\n \n \nLoss (gain) on derivatives, net\n8,478 \n1,489 \n(980)\n(6,463)\nNon-cash impact of income tax (benefit) expense\n(8,970)\n1,157 \n(22,002)\n2,535 \nLoss on extinguishment of debt, net\n119 \n— \n119 \n672 \nTransaction, transition and restructuring costs\n5,472 \n8,580 \n16,081 \n16,143 \nAmortization of other intangibles \n115 \n96 \n358 \n289 \nNon-cash impact of changes to executive equity compensation plan\n(2,787)\n(2,599)\n5,643 \n2,596 \nSignificant disruptive events, net \n1,161 \n2,104 \n6,185 \n5,627 \nRecovery of allowance on loans receivable and investments, net\n— \n(56)\n— \n(166)\nNormalizing items related to noncontrolling interests and unconsolidated entities, net\n8,111 \n(7,737)\n9,060 \n(1,010)\nOther normalizing items, net\n (1)\n(14,298)\n— \n(14,299)\n18,411 \nNormalized FFO attributable to common stockholders\n$\n406,175 \n$\n334,519 \n$\n1,183,041 \n$\n980,215 \n______________________________\n(1)\n    For the three and nine months ended September 30, 2025, primarily due to the net non-cash revenue impact of changed revenue recognition from cash to straight-line related to a senior housing triple-net tenant. For the nine months ended September 30, 2024, primarily related to shareholder relations matters and certain legal matters.\n51\nTable of Contents\nNOI\nWe consider NOI an important supplemental measure because it allows investors, analysts and our management to assess our unlevered property-level operating results and to compare our operating results between periods on a consistent basis. We define NOI as total revenues, less interest and other income, property-level operating expenses and third-party capital management expenses. In order to facilitate a clear understanding of our historical consolidated operating results, NOI should be examined in conjunction with Net income attributable to common stockholders as presented in our Consolidated Financial Statements and other financial data included elsewhere in this Quarterly Report on Form 10-Q.\nThe following table sets forth a reconciliation of Net income attributable to common stockholders to NOI (dollars in thousands):\n \nFor the Three Months Ended September 30,\nFor the Nine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nNet income attributable to common stockholders\n$\n66,047 \n$\n19,243 \n$\n181,179 \n$\n24,318 \nAdjustments:\nInterest and other income\n(4,184)\n(8,204)\n(13,133)\n(19,809)\nInterest expense\n158,124 \n150,437 \n457,778 \n449,629 \nDepreciation and amortization\n357,173 \n304,268 \n1,026,417 \n944,371 \nGeneral, administrative and professional fees\n40,387 \n35,092 \n136,392 \n121,556 \nLoss on extinguishment of debt, net\n119 \n— \n119 \n672 \nTransaction, transition and restructuring costs\n5,472 \n8,580 \n16,081 \n16,143 \nRecovery of allowance on loans receivable and investments, net\n— \n(56)\n— \n(166)\nShareholder relations matters\n— \n— \n— \n15,751 \nOther expense\n13,370 \n3,935 \n20,621 \n10,729 \nNet income attributable to noncontrolling interests\n2,661 \n1,753 \n7,347 \n5,306 \n(Income) loss from unconsolidated entities\n(16,644)\n(4,629)\n(12,195)\n5,406 \nGain on real estate dispositions\n(1,283)\n(271)\n(35,268)\n(50,282)\nIncome tax (benefit) expense\n(6,345)\n3,002 \n(13,028)\n7,764 \nNOI\n$\n614,897 \n$\n513,150 \n$\n1,772,310 \n$\n1,531,388 \nSee “Results of Operations” for discussions regarding both NOI and Same-Store NOI. We define Same-Store as properties owned, consolidated and operational for the full period in both comparison periods and that are not otherwise excluded; provided, however, that we may include selected properties that otherwise meet the Same-Store criteria if they are included in substantially all of, but not a full, period for one or both of the comparison periods, and in our judgment such inclusion provides a more meaningful presentation of our segment performance. \nNewly acquired development properties and recently developed or redeveloped properties in our SHOP reportable business segment will be included in Same-Store once they are stabilized for the full period in both periods presented. These properties are considered stabilized upon the earlier of (a) the achievement of 80% sustained occupancy or (b) 24 months from the date of acquisition or substantial completion of work. Recently developed or redeveloped properties in our OM&R and NNN reportable business segments will be included in Same-Store once substantial completion of work has occurred for the full period in both periods presented. Our SHOP and NNN that have undergone operator or business model transitions will be included in Same-Store once operating under consistent operating structures for the full period in both periods presented.  \nProperties are excluded from Same-Store if they are: (i) sold, classified as held for sale or properties whose operations were classified as discontinued operations in accordance with GAAP; (ii) impacted by significant disruptive events such as flood or fire; (iii) for SHOP, those properties that are currently undergoing a significant disruptive redevelopment; (iv) for OM&R and NNN reportable business segments, those properties for which management has an intention to institute, or has instituted, a redevelopment plan because the properties may require major property-level expenditures to maximize value, increase NOI, or maintain a market-competitive position and/or achieve property stabilization, most commonly as the result of an expected \n52\nTable of Contents\nor actual material change in occupancy or NOI; or (v) for SHOP and NNN reportable business segments, those properties that are scheduled to undergo operator or business model transitions, or have transitioned operators or business models after the start of the prior comparison period.        \nTo eliminate the impact of exchange rate movements, certain of our performance-based disclosures, including Same-Store NOI for SHOP and NNN, assume constant exchange rates across comparable periods, using the following methodology: the current period’s results are shown in actual reported USD, while prior comparison period’s results are adjusted and converted to USD based on the average monthly exchange rate for the current period.\nConcentration Risk\nWe use concentration ratios to identify, understand and evaluate the potential impact of economic downturns and other adverse events that may affect our asset types, geographic locations, business models, and managers, tenants and borrowers. We evaluate concentration risk in terms of investment mix and operations mix. Investment mix measures the percentage of our investments that is concentrated in a specific asset type or that is operated or managed by a particular manager, tenant or borrower. Operations mix measures the percentage of our operating results that is attributed to a particular manager, tenant or borrower, geographic location or business model. See “Note 3 – Concentration of Credit Risk” included elsewhere in this Quarterly Report on Form 10-Q for additional disclosure on the concentration of our credit risk.\nThe following tables reflect our concentration risk as of the dates and for the periods presented:\nAs of September 30, 2025\nAs of December 31, 2024\nInvestment mix by asset type \n(1)\n:\n \n \nSenior housing communities\n68.9 \n%\n67.3 \n%\nOutpatient medical buildings\n18.3 \n19.7 \nResearch centers\n5.5 \n5.3 \nOther healthcare facilities\n4.3 \n4.5 \nInpatient rehabilitation facilities (“IRFs”) and long-term acute care facilities (“LTACs”)\n1.8 \n2.0 \nSkilled nursing facilities (“SNFs”)\n0.7 \n1.2 \nSecured loans receivable and investments, net\n0.5 \n— \nTotal\n100.0 \n%\n100.0 \n%\nInvestment mix by manager and tenant \n(1)\n:\n \n \nAtria\n19.9 \n%\n21.0 \n%\nLillibridge\n9.5 \n9.8 \nSunrise\n9.4 \n9.9 \nLe Groupe Maurice\n6.2 \n6.4 \nBrookdale\n5.5 \n6.6 \nWexford\n5.3 \n5.1 \nArdent\n4.5 \n4.9 \nKindred\n1.2 \n1.3 \nAll other\n38.5 \n35.0 \nTotal\n100.0 \n%\n100.0 \n%\n______________________________\n(1)\nRatios are based on the gross book value of consolidated real estate investments (excluding properties classified as held for sale, development properties not yet operational and land parcels and including secured loan receivable and investments, net) as of each reporting date.\n53\nTable of Contents\n \nFor the Three Months Ended September 30,\nFor the Nine Months Ended September 30,\n \n2025\n2024\n2025\n2024\nOperations mix by manager and tenant and business model:\n \n \nTotal Revenues: \n \n \nSHOP\n73.1 \n%\n68.4 \n%\n72.4 \n%\n68.1 \n%\nBrookdale \n(1)\n2.8 \n3.1 \n2.9 \n3.1 \nArdent\n2.6 \n3.0 \n2.7 \n3.1 \nKindred\n2.3 \n2.8 \n2.5 \n2.8 \nAll others\n19.2 \n22.7 \n19.5 \n22.9 \nTotal\n100.0 \n%\n100.0 \n%\n100.0 \n%\n100.0 \n%\nNet operating income (“NOI”):\nSHOP\n49.2 \n%\n41.7 \n%\n48.1 \n%\n41.3 \n%\nBrookdale \n(1)\n6.8 \n7.3 \n6.8 \n7.3 \nArdent\n6.3 \n7.3 \n6.5 \n7.3 \nKindred\n5.5 \n6.8 \n5.9 \n6.7 \nAll others\n32.2 \n36.9 \n32.7 \n37.4 \nTotal\n100.0 \n%\n100.0 \n%\n100.0 \n%\n100.0 \n%\nOperations mix by geographic location:\n \nTotal Revenues: \nCalifornia\n12.1 \n%\n13.5 \n%\n12.5 \n%\n13.5 \n%\nTexas\n8.4 \n6.5 \n7.9 \n6.5 \nNew York\n7.5 \n7.0 \n7.1 \n7.1 \nQuebec, Canada\n5.3 \n5.9 \n5.3 \n5.9 \nIllinois\n4.1 \n4.9 \n4.3 \n4.8 \nAll others\n62.6 \n62.2 \n62.9 \n62.2 \nTotal\n100.0 \n%\n100.0 \n%\n100.0 \n%\n100.0 \n%\n______________________________\n(1)\nFor all periods presented, includes 121 senior housing properties in our NNN segment leased to Brookdale, including 56 properties for which the lease expires on December 31, 2025 (the “Brookdale Conversion and Sale Communities”). We plan to sell or convert to our SHOP segment all of the Brookdale Conversion and Sale Communities. In connection therewith, (i) 13 of the Brookdale Conversion and Sale Communities were converted to our SHOP segment during the quarter ended September 30, 2025, with the revenues and NOI for those properties included in the above table through the date of conversion, and (ii) 14 of the Brookdale Conversion and Sale Communities were converted to our SHOP segment on October 1, 2025.\nSee “Non-GAAP Financial Measures” included elsewhere in this Quarterly Report on Form 10-Q for additional disclosure and reconciliations of Net income attributable to common stockholders, as computed in accordance with GAAP, to NOI.\nTriple-Net Lease Performance and Expirations\nAny failure, inability or unwillingness by our tenants to satisfy their obligations under our triple-net leases could have an adverse effect on us. Also, if our tenants are not able or willing to renew our triple-net leases upon expiration, we may be unable to reposition the applicable properties on a timely basis or on the same or better economic terms, if at all. Although our lease expirations are staggered, the non-renewal of some or all of our triple-net leases that expire in any given year could have an adverse effect on us. During the nine months ended September 30, 2025, we had no triple-net lease renewals or expirations without renewal that, in the aggregate, had a material impact on our financial condition or results of operations for that period.\n54\nTable of Contents\nTenant Lease Expirations\nThe following table summarizes our lease expirations in our OM&R and NNN segments, excluding real estate assets classified as held for sale, over the next 10 years and thereafter, assuming that none of the tenants exercise any of their renewal or purchase options, as of September 30, 2025 (dollars and square feet in thousands):\nExpiration Period\n4Q 2025\n2026\n2027\n2028\n2029\n2030\n2031\n2032\n2033\n2034\nThereafter\nOM&R:\nSquare Feet\n773\n2,229\n2,999\n2,471\n2,629\n2,275\n1,589\n1,349\n1,254\n2,497\n2,151\nOM&R Annualized Base Rent \n(1)\n$22,088\n$57,909\n$88,786\n$72,247\n$74,413\n$64,962\n$37,516\n$41,117\n$38,520\n$69,066\n$62,885\n% of Total OM&R Annualized Base Rent\n4 \n%\n9 \n%\n14 \n%\n11 \n%\n12 \n%\n10 \n%\n6 \n%\n7 \n%\n6 \n%\n11 \n%\n10 \n%\nNNN:\nSegment Properties \n18\n31\n6\n16\n18\n27\n2\n7\n8\n5\n81\nNNN Annualized Base Rent \n(1)(2)\n$38,903\n$40,556\n$10,582\n$43,634\n$12,014\n$87,201\n$1,991\n$9,001\n$7,154\n$16,481\n$212,464\n% of Total NNN Annualized Base Rent\n8 \n%\n8 \n%\n2 \n%\n9 \n%\n3 \n%\n18 \n%\n— \n%\n2 \n%\n1 \n%\n3 \n%\n44 \n%\nTotal OM&R and NNN Annualized Base Rent\n$60,992\n$98,465\n$99,368\n$115,881\n$86,427\n$152,163\n$39,507\n$50,118\n$45,674\n$85,547\n$275,349\n% of Total OM&R and NNN Annualized Base Rent\n5 \n%\n9 \n%\n9 \n%\n10 \n%\n8 \n%\n14 \n%\n4 \n%\n5 \n%\n4 \n%\n8 \n%\n25 \n%\n______________________________\n(1)\nAnnualized Base Rent (“ABR”) represents the annualized contractual cash base rent for properties leased as of quarter end. ABR does not include future rent escalators, percentage rent, which is a rental charge typically based on certain tenants' gross revenue, common area maintenance charges or non-cash items such as straight-line rental income, the amortization of above / below market lease intangibles or other items.\n(2)\nThe expiration of ABR in the fourth quarter of 2025 includes rent associated with 18 senior housing properties leased to Brookdale, all of which are intended to be converted to our SHOP segment by December 31, 2025.  For clarity, in the third quarter 2025, the lease for 27 senior housing properties leased to Brookdale terminated, all of which were converted to our SHOP segment.  The expiration of ABR in 2030 includes rent associated with 20 LTACs currently leased to Kindred.  The expiration of ABR in 2034 includes rent associated with 5 LTACs currently leased to Kindred.  The expiration of ABR Thereafter includes rent associated with 65 properties currently leased to Brookdale.\nLiquidity and Capital Resources\n    \nOur principal sources of liquidity are cash flows from operations, proceeds from the issuance of debt and equity securities, borrowings under our unsecured revolving credit facility and commercial paper program, and proceeds from asset sales.\n55\nTable of Contents\nFor the next 12 months, our principal liquidity needs are to: (i) fund operating expenses; (ii) meet our debt service requirements; (iii) repay maturing mortgage and other debt; (iv) fund acquisitions, investments and commitments and any development and redevelopment activities; (v) fund capital expenditures; and (vi) make distributions to our stockholders and unitholders, as required for us to continue to qualify as a REIT. Depending upon the availability of external capital, we believe our liquidity is sufficient to fund these uses of cash. We expect that these liquidity needs generally will be satisfied by a combination of the following: cash flows from operations, cash on hand, unsettled equity forward sales agreements, debt assumptions and financings (including secured financings), issuances of debt and equity securities, dispositions of assets (including, in whole or in part, through joint venture arrangements) and borrowings under our revolving credit facility and commercial paper program. However, an inability to access liquidity through multiple capital sources concurrently could have a material adverse effect on us. \nOur material contractual obligations arising in the normal course of business primarily consist of long-term debt and related interest payments, and operating obligations which include ground lease obligations. During the nine months ended September 30, 2025, our material contractual obligations decreased primarily due to the net repayment of senior notes and mortgage loans. See “Note 10 – Senior Notes Payable and Other Debt” and “Note 12 – Commitments and Contingencies” of the Notes to Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q for further information regarding our long-term debt obligations and operating obligations, respectively.\nWe may, from time to time, seek to retire or purchase our outstanding indebtedness for cash or in exchange for equity securities in open market purchases, privately negotiated transactions or otherwise. Such repurchases or exchanges, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions, prospects for capital and other factors. The amounts involved may be material.\nCredit Facilities, Commercial Paper, Unsecured Term Loans and Letters of Credit\nAs of September 30, 2025, our $3.5 billion unsecured revolving credit facility had no borrowings outstanding and $0.8 million restricted to support outstanding letters of credit. We use our unsecured revolving credit facility to support our commercial paper program and for general corporate purposes.\nOur wholly-owned subsidiary, Ventas Realty, Limited Partnership (“Ventas Realty”), may issue from time to time unsecured commercial paper notes up to a maximum aggregate amount outstanding at any time of $2.0 billion. The notes are sold under customary terms in the U.S. commercial paper note market and are ranked pari passu with Ventas Realty’s other unsecured senior indebtedness. The notes are fully and unconditionally guaranteed by Ventas. As of September 30, 2025 and December 31, 2024, we had no borrowings outstanding under our commercial paper program.\nVentas Realty has a $500.0 million unsecured term loan priced at 0.10% plus SOFR (“Adjusted SOFR”) plus 0.85%, which is subject to adjustment based on Ventas Realty’s debt ratings. This term loan is fully and unconditionally guaranteed by Ventas and subject to certain customary covenants and other terms and conditions. It matures in June 2027 and includes an accordion feature that permits Ventas Realty to increase the aggregate borrowings thereunder to up to $1.25 billion, subject to the satisfaction of certain conditions, including the receipt of additional commitments for such increase.\nVentas Realty has a $200.0 million unsecured term loan priced at Adjusted SOFR plus 0.85%, which is subject to adjustment based on Ventas Realty’s debt ratings. This term loan is fully and unconditionally guaranteed by Ventas and subject to certain customary covenants and other terms and conditions. It matures in February 2027 and includes an accordion feature that permits Ventas Realty to increase the aggregate borrowings thereunder to up to $500.0 million, subject to the satisfaction of certain conditions, including the receipt of additional commitments for such increase.\nAs of September 30, 2025, we had a $100.0 million uncommitted line for standby letters of credit, which had an outstanding balance of $18.3 million. The agreement governing the line contains certain customary covenants and other terms and conditions. Under its terms, we are required to pay a fixed rate commission on each outstanding letter of credit.\n56\nTable of Contents\nExchangeable Senior Notes\nIn June 2023, Ventas Realty issued $862.5 million aggregate principal amount of its 3.75% Exchangeable Senior Notes due 2026 (the “Exchangeable Notes”) in a private placement. The Exchangeable Notes are senior, unsecured obligations of Ventas Realty and are fully and unconditionally guaranteed on an unsecured and unsubordinated basis by Ventas. The Exchangeable Notes bear interest at a rate of 3.75% per year, payable semi-annually in arrears on June 1 and December 1 of each year, beginning on December 1, 2023. The Exchangeable Notes mature on June 1, 2026, unless earlier exchanged, redeemed or repurchased. \nAs of September 30, 2025, we had $862.5 million, aggregate principal amount of the Exchangeable Notes outstanding with an effective interest rate of 4.62% inclusive of the impact of the amortization of issuance costs. During the three and nine months ended September 30, 2025, we recognized $8.1 million and $24.3 million, respectively, of contractual interest expense and amortization of issuance costs of $1.8 million and $5.3 million, respectively, related to the Exchangeable Notes. Unamortized issuance costs of $4.9 million as of September 30, 2025 were recorded as an offset to Senior notes payable and other debt on our Consolidated Balance Sheets.\nThe Exchangeable Notes are currently exchangeable at an exchange rate of 18.2708 shares of our common stock per $1,000 principal amount of Exchangeable Notes (equivalent to an exchange price of approximately $54.73 per share of common stock). The exchange rate is subject to adjustment, including in the event of the payment of a quarterly dividend in excess of $0.45 per share, but will not be adjusted for any accrued and unpaid interest. Upon exchange of the Exchangeable Notes, Ventas Realty will pay cash up to the aggregate principal amount of the Exchangeable Notes to be exchanged and pay or deliver (or cause to be delivered), as the case may be, cash, shares of common stock or a combination of cash and shares of common stock, at Ventas Realty’s election, in respect of the remainder, if any, of its exchange obligation in excess of the aggregate principal amount of the Exchangeable Notes being exchanged. Prior to the close of business on the business day immediately preceding March 1, 2026, the Exchangeable Notes are exchangeable at the option of the noteholders only upon the satisfaction of specified conditions and during certain periods described in the indenture governing the Exchangeable Notes. On or after March 1, 2026, until the close of business on the business day immediately preceding the maturity date, the Exchangeable Notes are exchangeable at the option of the noteholders at any time regardless of these conditions or periods.\nSenior Notes\nIn January and February 2025, we repaid $450.0 million and $600.0 million aggregate principal amount of 2.65% Senior Notes due 2025 and 3.50% Senior Notes due 2025, respectively, at maturity.\nIn June 2025, Ventas Realty issued $500.0 million aggregate principal amount of 5.10% Senior Notes due 2032 in a registered public offering. The proceeds were primarily used for general corporate purposes, which included repayment of other indebtedness and expenses related to the offering.\nMortgages\nDuring the nine months ended September 30, 2025, we repaid in full mortgage loans in the aggregate principal amount of $499.0 million.\nDerivatives and Hedging\nIn the normal course of our business, interest rate fluctuations affect future cash flows under our variable rate debt obligations, loans receivable and marketable debt securities, and foreign currency exchange rate fluctuations affect our operating results. We follow established risk management policies and procedures, including the use of derivative instruments, to mitigate the impact of these risks.\nWe do not use derivative instruments for trading or speculative purposes, and we have a policy of entering into contracts only with major financial institutions based upon their credit ratings and other factors. When considered together with the underlying exposure that the derivative is designed to hedge, we do not expect that the use of derivatives in this manner would have any material adverse effect on our future financial condition or results of operations.\n57\nTable of Contents\nWe enter into interest rate swaps in order to maintain a capital structure containing targeted amounts of fixed and variable-rate debt and manage interest rate risk. Interest rate swaps designated as cash flow hedges involve the receipt of variable amounts from a counterparty in exchange for our fixed-rate payments. These interest rate swap agreements are used to hedge the variable cash flows associated with variable-rate debt.\nPeriodically, we enter into interest rate derivatives, such as treasury locks, to partially hedge the risk of changes in interest payments attributable to increases in the benchmark interest rate during the period leading up to the probable issuance of fixed-rate debt. We designate our interest rate locks as cash flow hedges. Gains and losses when we settle our interest rate locks are amortized over the life of the related debt and recorded in Interest expense in our Consolidated Statements of Income.\nAs of September 30, 2025, our variable rate debt obligations of $1.2 billion reflect, in part, the effect of $140.9 million notional amount of interest rate swaps with maturities in March 2027, that effectively convert fixed rate debt to variable rate debt. These interest rate swaps were not designated for hedge accounting.\nAs of September 30, 2025, our fixed rate debt obligations of $11.4 billion reflect, in part, the effect of $125.8 million and C$599.4 million ($430.6 million) notional amount of interest rate swaps with maturities ranging from June 2027 to April 2031, in each case, that effectively convert variable rate debt to fixed rate debt. These interest rate swaps were designated as cash flow hedges.\n2025 Activity\nFor the nine months ended September 30, 2025, we entered into an aggregate $250.0 million notional amount of 10-year treasury locks to hedge interest rate risk on future debt issuances. The aggregate $250.0 million notional amount of treasury locks have a blended rate of 4.2%.\nDuring the three and nine months ended September 30, 2025, approximately $0.5 million and $2.4 million, respectively, of realized gain primarily relating to our interest rate swaps was reclassified into Interest expense in our Consolidated Statements of Income. Approximately $1.2 million of unrealized losses, which are included in Accumulated other comprehensive income as of September 30, 2025, are expected to be reclassified into earnings within the next 12 months.\nCapital Stock\nWe have established an at-the-market offering program that provides for the sale, from time to time, of shares of our common stock, including through forward sales agreements, as described in more detail below (the \"ATM Program\").  In September 2024, we entered into an ATM Sales Agreement providing for the sale, from time to time, of up to $2.0 billion aggregate gross sales price of shares of our common stock under the ATM Program. In June 2025, we amended the ATM Sales Agreement such that the aggregate gross sales price of common stock available for issuance under the ATM Program immediately following the amendment was $2.25 billion. As of September 30, 2025, the remaining amount available under the ATM Program for future sales of common stock was $1.3 billion.\nDuring the three months ended September 30, 2025, we entered into equity forward sales agreements under the ATM Program for 11.6 million shares of our common stock for gross proceeds of $788.2 million, representing an average price of $67.89 per share. During the three months ended September 30, 2025, we settled 14.9 million shares of common stock under outstanding equity forward sales agreements entered into under the ATM Program for net cash proceeds of $1.0 billion.\nDuring the nine months ended September 30, 2025, we entered into equity forward sales agreements under the ATM Program for 34.4 million shares of our common stock for gross proceeds of $2.3 billion, representing an average price of $66.89 per share. During the nine months ended September 30, 2025, we settled 31.3 million shares of common stock under outstanding equity forward sales agreements for net cash proceeds of $2.1 billion. \nAs of September 30, 2025, we maintained unsettled equity forward sales agreements for 6.5 million shares of common stock, or approximately $424.4 million in gross proceeds, with varying maturities through April 2027.\n58\nTable of Contents\nIn October 2025, we entered into additional equity forward sales agreements under the ATM Program for 0.8 million shares of common stock, or approximately $56.7 million in gross proceeds, which mature in May 2027.\nFrom time to time, including under our ATM Program, we may enter into equity forward sales agreements. An equity forward sales agreement enables us to secure a share price on the sale of shares of our common stock at or shortly after the time the forward sales agreement becomes effective, while postponing the receipt of proceeds from the sale of shares until a future date. Equity forward sales agreements generally have a maturity of one to two years. At any time during the term of an equity forward sales agreement, we may settle that equity forward sales agreement by delivery of physical shares of our common stock to the forward purchaser or, at our election, subject to certain exceptions, we may settle in cash or by net share settlement. The forward sales price we expect to receive upon settlement of outstanding equity forward sales agreements will be the initial forward price, net of commissions, established on or shortly after the effective date of the relevant equity forward sales agreement, subject to adjustments for accrued interest, the forward purchasers’ stock borrowing costs in excess of a certain threshold specified in the equity forward sales agreement and certain fixed price reductions for expected dividends on our common stock during the term of the equity forward sales agreement. Our unsettled equity forward sales agreements are accounted for as equity instruments. Refer to “Note 15 – Earnings Per Share.”\nCommon Stock\nIn May 2025, our stockholders approved the increase of authorized common stock from 600 million shares to 1.2 billion shares.\nDividends\nDuring the nine months ended September 30, 2025, we declared a dividend of $0.48 per share of our common stock in each of the first, second and third quarters. In order to continue to qualify as a REIT, we must make annual distributions to our stockholders of at least 90% of our REIT taxable income (excluding net capital gain). In addition, we will be subject to income tax at the regular corporate rate to the extent we distribute less than 100% of our REIT taxable income, including any net capital gains. We intend to pay dividends greater than 100% of our taxable income, after the use of any net operating loss carryforwards, for 2025.\nWe expect that our cash flows will exceed our REIT taxable income due to depreciation and other non-cash deductions in computing REIT taxable income and that we will be able to satisfy the 90% distribution requirement. However, from time to time, we may not have sufficient cash on hand or other liquid assets to meet this requirement or we may decide to retain cash or distribute such greater amount as may be necessary to avoid income and excise taxation. If we do not have sufficient cash on hand or other liquid assets to enable us to satisfy the 90% distribution requirement, or if we desire to retain cash, we may borrow funds, issue additional equity securities, pay taxable stock dividends, if possible, distribute other property or securities or engage in a transaction intended to enable us to meet the REIT distribution requirements or any combination of the foregoing.\nCapital Expenditures\nFrom time to time, we engage in development and redevelopment activities within our reportable business segments and through our investments in unconsolidated entities. For example, we are party to certain agreements that commit us to develop properties funded through capital that we and, in certain circumstances, our joint venture partners provide.  In addition, from time to time, we engage in redevelopment projects with respect to our existing senior housing communities, outpatient medical buildings and research centers to maximize the value, increase NOI, maintain a market-competitive position, achieve property stabilization or change the primary use of the property.\nThe terms of our triple-net leases generally obligate our tenants to pay all capital expenditures necessary to maintain and improve our triple-net leased properties. However, from time to time, we may fund the capital expenditures for our triple-net leased properties through loans or advances to the tenants, which may increase the amount of rent payable with respect to the properties in certain cases. We may also fund capital expenditures for which we may become responsible upon expiration of our triple-net leases or in the event that our tenants are unable or unwilling to meet their obligations under those leases. \n59\nTable of Contents\nWe expect that these liquidity needs generally will be satisfied by a combination of the following: cash flows from operations, cash on hand, debt assumptions and financings (including secured financings), issuances of debt and equity securities, dispositions of assets (in whole or in part through joint venture arrangements) and borrowings under our revolving credit facilities and commercial paper program.\nTo the extent that unanticipated capital expenditure needs arise or significant borrowings are required, our liquidity may be affected adversely. Our ability to borrow additional funds may be restricted in certain circumstances by the terms of the instruments governing our outstanding indebtedness.\nCash Flows\n    \n    \nThe following table sets forth our sources and uses of cash flows for the nine months ended September 30, 2025 and 2024 (dollars in thousands):\n \nFor the Nine Months Ended September 30,\nChange\n \n2025\n2024\n$\n%\nCash, cash equivalents and restricted cash at beginning of period\n$\n957,233 \n$\n563,462 \n$\n393,771 \n69.9 \n%\nNet cash provided by operating activities\n1,175,063 \n955,984 \n219,079 \n22.9 \nNet cash used in investing activities\n(2,265,696)\n(840,875)\n(1,424,821)\n(169.4)\nNet cash provided by financing activities\n373,901 \n489,019 \n(115,118)\n(23.5)\nEffect of foreign currency translation\n2,050 \n(1,893)\n3,943 \n208.3 \nCash, cash equivalents and restricted cash at end of period\n$\n242,551 \n$\n1,165,697 \n$\n(923,146)\n(79.2)\nCash Flows from Operating Activities\n    \nCash flows from operating activities increased $219.1 million during the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to growth in our SHOP business.\nCash Flows from Investing Activities\n    \nNet cash used in investing activities increased $1.4 billion during the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to a $1.5 billion increase from higher real estate investments in our SHOP business.\nCash Flows from Financing Activities\n    \nNet cash provided by financing activities decreased $115.1 million during the nine months ended September 30, 2025 compared to the same period in 2024 primarily due to a $1.3 billion net decrease in debt and a $83.0 million increase in cash distribution to common stockholders, partially offset by a $1.2 billion increase in issuances of common stock.\nOff-Balance Sheet Arrangements\nWe own interests in certain unconsolidated entities as described in “Note 7 – Investments in Unconsolidated Entities.” Except in limited circumstances, our risk of loss is limited to our investment in the entities and any outstanding loans receivable. Further, we use financial derivative instruments to hedge interest rate and foreign currency exchange rate exposure. Finally, as of September 30, 2025, we had $19.1 million outstanding letters of credit obligations. \n60\nTable of Contents\nCommitments and Contingencies\nGuarantor and Issuer Information - Registered Senior Notes\nVentas, Inc. has fully and unconditionally guaranteed the obligation to pay principal and interest with respect to the outstanding senior notes issued by our 100% owned subsidiary, Ventas Realty, that were issued in transactions registered under the Securities Act of 1933. No other Ventas entities are issuers or guarantors of debt securities registered under the Securities Act. \nUnder certain circumstances, contractual and legal restrictions, including those contained in the instruments governing our subsidiaries’ outstanding mortgage indebtedness, may restrict our ability to obtain cash from our subsidiaries for the purpose of meeting our debt service obligations, including Ventas Realty’s payment obligations and our payment guarantees with respect to Ventas Realty’s registered senior notes. \nVentas Realty is a direct, wholly owned subsidiary of Ventas, Inc. Excluding investments in subsidiaries, the assets, liabilities and results of operations of Ventas Realty and Ventas, Inc., on a combined basis, are not material to the consolidated financial position or consolidated results of operations of Ventas. Therefore, in accordance with Rule 13-01 of Regulation S-X, we have elected to exclude summarized financial information for the issuer and guarantor of our registered senior notes. \n61\nTable of Contents"
}