{
  "source_file": "vtr-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    Business \nBUSINESS\nOverview\nVentas, Inc., an S&P 500 company, is a real estate investment trust (“REIT”) focused on delivering strong, sustainable shareholder returns by enabling exceptional environments that benefit a large and growing aging population. We hold a portfolio that includes senior housing communities, outpatient medical buildings, research centers, hospitals and healthcare facilities located in North America and the United Kingdom.  As of December 31, 2024, we owned or had investments in 1,387 properties consisting of 1,356 properties in our reportable business segments (“Segment Properties”) and 31 properties held by unconsolidated real estate entities in our non-segment operations. Our Company is headquartered in Chicago, Illinois with additional corporate offices in Louisville, Kentucky and New York, New York.\nWe elected to be taxed as a REIT under Sections 856 through 860 of the Internal Revenue Code (the “Code”), commencing with our taxable year ended December 31, 1999. Provided we qualify for taxation as a REIT, we generally are not required to pay U.S. federal corporate income taxes on our REIT taxable income that is currently distributed to our stockholders.  In order to maintain our qualification as a REIT, we must satisfy a number of technical requirements, which impact how we invest in, operate and manage our assets. See “Risk Factors—Our REIT Status Risks” included in Part I, Item 1A of this Annual Report on Form 10-K (the “Annual Report”).\nWe operate through three reportable business segments: senior housing operating portfolio, which we refer to as “SHOP,” outpatient medical and research portfolio, which we refer to as “OM&R,” and triple-net leased properties, which we refer to as “NNN.” We also hold assets outside of our reportable business segments, which we refer to as non-segment assets and which consist primarily of corporate assets, including cash and cash equivalents, restricted cash, loans receivable and investments and accounts receivable as well as investments in unconsolidated entities. Our investments in unconsolidated entities include investments made through our third-party institutional private capital management platform, Ventas Investment Management (“VIM”). Through VIM, we partner with third-party institutional investors to invest in real estate through various joint ventures and other co-investment vehicles where we are the sponsor or general partner, including our open-ended investment vehicle, the Ventas Life Science & Healthcare Real Estate Fund (the “Ventas Fund”). See our Consolidated Financial Statements and the related notes, including “Note 7 – Investments in Unconsolidated Entities” included in Part II, Item 8 of this Annual Report.\nOur chief operating decision maker evaluates performance of the combined properties in each operating segment and determines how to allocate resources to these segments, based on net operating income (“NOI”) for each segment. See our Consolidated Financial Statements and the related notes, including “Note 2 – Accounting Policies” and “Note 18 – Segment Information” included in Part II, Item 8 of this Annual Report. \nThe following table summarizes information for our portfolio for the year ended December 31, 2024 (dollars in thousands):\nSegment\nNOI \n(1)\nPercentage of Total NOI\nSegment Properties\nSenior housing operating portfolio (SHOP)\n$\n866,383 \n41.9 \n%\n629 \nOutpatient medical and research portfolio (OM&R)\n579,271 \n28.0 \n%\n426 \nTriple-net leased properties (NNN)\n606,225 \n29.3 \n%\n301 \nNon-segment \n(2)\n17,204 \n0.8 \n%\nn/a\n$\n2,069,083 \n100 \n%\n1,356 \n______________________________\n(1)    \n“NOI” is defined as total revenues, less interest and other income, property-level operating expenses and third-party capital management expenses. See “Non-GAAP Financial Measures” included elsewhere in this Annual Report for additional disclosure and a reconciliation of net income attributable to common stockholders, as computed in accordance with U.S. generally accepted accounting principles (“GAAP”), to NOI.\n(2)    \nNOI for non-segment includes management fees and promote revenues, net of expenses related to our third-party institutional private capital management platform, income from loans and investments and corporate-level expenses not directly attributable to any of our three reportable business segments.\n1\nBusiness Strategy\nFor more than 25 years, Ventas has pursued what we believe is a successful, enduring strategy focused on delivering outsized value to stockholders and other key stakeholders by enabling exceptional environments that benefit the aging population. Working with industry-leading care providers, partners, developers and research and medical institutions, our collaborative and experienced team is focused on achieving consistent, superior total returns through: (1) delivering profitable organic growth in senior housing, (2) capturing value-creating external growth focused on senior housing, (3) driving strong execution and cash flow generation throughout our portfolio of high-quality assets unified in serving the large and growing aging population and (4) maintaining financial strength, flexibility and liquidity. \nOur objective is to generate reliable and growing cash flows from our portfolio, which enables us to pay regular cash dividends to stockholders and creates opportunities to increase stockholder value.\nOur Businesses \nSenior Housing Operating Portfolio (SHOP)\nIn our SHOP segment, we own and invest in senior housing communities.  We participate directly in the financial performance of the communities’ operations and are generally responsible for all operational costs, expenses and other liabilities.  We typically engage third-party managers to operate the communities on our behalf but generally hold applicable healthcare licenses and enroll in applicable government healthcare programs on behalf of the communities in our SHOP segment.  \nThe senior housing communities in our SHOP segment include independent living communities, assisted living communities, memory care communities and continuing care retirement communities.  Independent living communities are typically age-restricted multifamily rental properties with central dining facilities that provide residents with access to meals and other services such as housekeeping, linen service, transportation and social and recreational activities. Assisted living communities typically offer similar services as independent living communities, plus supportive care that is provided by trained employees to residents who require assistance with activities of daily living, such as bathing, dressing and medication management.  Memory care communities provide care for individuals with Alzheimer’s disease and other forms of dementia or memory loss. Continuing care retirement communities are typically age-restricted properties that offer a continuum of care, and may include a combination of independent living, assisted living, memory care and skilled nursing units. Our assisted living, memory care and continuing care retirement communities are generally subject to state licensure requirements for the delivery of some or all of their services, while our independent living communities generally are not. Charges for room, board and services at these communities are generally paid from private sources, with limited reliance on government reimbursement programs such as Medicaid. \nBecause we have elected to be taxed as a REIT, we are subject to restrictions impacting how we invest in, operate or manage our properties, including the senior housing communities in our SHOP segment. Some of those restrictions depend on whether a senior housing community is treated as a “qualified healthcare property” under the REIT rules. We treat most of the senior housing communities in our SHOP segment as “qualified healthcare properties.” Senior housing communities in our SHOP segment that are “qualified healthcare properties” generally must be managed and operated by a third-party manager, including for purposes of procuring supplies, hiring and training employees, entering into third-party contracts for the benefit of the property and providing resident care and services. Senior housing communities that are not “qualified healthcare properties” may be managed by us directly through a taxable REIT subsidiary or by a third-party manager.  See “—Government Regulation—Tax Regulation included in Part I, Item 1 of this Annual Report.”\nWhere we engage a third-party manager, either by choice or as required by REIT tax rules, we generally rely on the third-party managers’ personnel, expertise, technical resources and information systems, risk management processes, proprietary information, good faith and judgment to manage the senior housing communities’ operations efficiently and effectively.  We also rely on the third-party managers to set appropriate resident fees, to provide accurate property-level financial results in a timely manner and otherwise manage risk and operate the senior housing communities in compliance with the terms of our management agreements and all applicable laws and regulations.  We are generally responsible for all operational costs, expenses and other risks and liabilities.  While our managers typically indemnify us for liabilities arising out of certain of their actions such as gross negligence, fraud or willful misconduct, we may not be able to enforce these rights, or we may determine it is not prudent to do so if we believe that enforcement of our rights would be more detrimental to our business than seeking alternative approaches  See “Risk Factors—Risks Related to Our Business Operations and Strategy—Our third-party managers and tenants operate or exert substantial control over the properties that they manage for or rent from us, \n2\nwhich limits our control and influence over operations and results” and “Risk Factors—Risks Related to Our Business Operations and Strategy—Our operating assets may expose us to various operational risks, liabilities and claims that could adversely affect our ability to generate revenues or increase our costs and could adversely affect our business, financial condition and results of operations”\n \nincluded in Part I, Item 1A of this Annual Report.\nOur management agreements typically have fixed terms and are subject to renewal under certain conditions. These agreements may include provisions for termination under specific circumstances, with or without the payment of a fee. The managers generally receive annual management fees which are calculated based on various performance measures, which may include revenue, NOI and other objective financial metrics. Additionally, incentive fees may be awarded if specified performance targets are met.\n \nAs of December 31, 2024, 28 third-party managers operated all of the 629 properties in our SHOP segment on our behalf.  The following table provides information regarding our significant SHOP manager concentration as of and for the year ended December 31, 2024:\nPercentage of Total NOI\nSegment Properties\nPercentage of Segment Properties\nAtria Senior Living, Inc.\n18.6 \n%\n199 \n14.7 \n%\nSunrise Senior Living, LLC\n6.2 \n98 \n7.2 \nLe Groupe Maurice\n6.0 \n37 \n2.7 \nThe properties in our SHOP segment managed by Atria Senior Living, Inc. (together with its subsidiaries, “Atria”), Sunrise Senior Living, LLC (together with its subsidiaries, “Sunrise”) and Le Group Maurice (together with its subsidiaries, “Le Groupe Maurice”) accounted for a significant portion of our SHOP  segment revenues and NOI for the year ended December 31, 2024. See “Management’s Discussion and Analysis of Financial Condition and Results of Operations—Concentration risk” included in Part II, Item 7 of this Annual Report and “Risk Factors—Risks Related to Our Business Operations and Strategy—A significant portion of our revenues and operating income is dependent on a limited number of managers and tenants, including Atria, Sunrise, Le Groupe Maurice, Brookdale, Ardent and Kindred” included in Part I, Item 1A of this Annual Report.\nWe hold a 34% ownership interest in Atria, which entitles us to customary minority rights and protections, as well as the right to appoint two members to the Atria Board of Directors. See Note 7 – Investments in Unconsolidated Entities of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report for a further discussion of our ownership interest.\nOutpatient Medical and Research Portfolio (OM&R)\nIn our OM&R segment, we primarily acquire, own, develop, lease and manage outpatient medical buildings and research centers. \nOur outpatient medical buildings, which are predominantly located on or contiguous to a health system campus, are generally multi-tenant properties leased to health systems and several unrelated medical practices, although in many cases they may be associated with a large single specialty or multi-specialty group, including neighboring health systems.  Tenants typically require customized space devoted to patient examination and treatment, diagnostic imaging, outpatient surgery and other outpatient services.  Outpatient medical buildings typically require enhanced plumbing, electrical and mechanical systems to accommodate the needs of healthcare providers such as sinks in every room, brighter lights and specialized medical equipment. \nOur research centers generally contain laboratory and office space that is leased primarily to universities, academic medical centers, technology, biotechnology, medical device and pharmaceutical companies and other organizations involved in the research industry.  While these properties may have certain characteristics similar to commercial office buildings, they generally contain more advanced electrical, mechanical, heating, ventilating and air conditioning systems.  The facilities generally have specialty equipment including emergency generators, fume hoods, lab bench tops and related amenities.  In many instances, research center tenants make significant investments to improve their leased space, in addition to landlord improvements, to accommodate biology, chemistry or medical device research initiatives.  Our research centers are often located on or contiguous to university and academic medical campuses. \nWe lease these properties to tenants under varying lease types that obligate the tenants to pay rent, and may require the tenant to pay their proportionate share of some or all property-related expenses, including utilities, real estate taxes, insurance, \n3\nrepairs and maintenance, cleaning, roads and grounds expense and other  expenses.  The leases are typically for a fixed term, and may be subject to renewal under certain conditions. \nAlthough we do not participate directly in the financial performance of our tenants’ operations, we are exposed to the credit risk of our tenants in our OM&R segment. See “Risk Factors—Risks Related to Our Business Operations and Strategy—If our managers’, tenants’ or borrowers’ financial condition or business prospects deteriorate, our business, financial condition and results of operations could be adversely affected” included in Part I, Item 1A of this Annual Report.\nThrough our Lillibridge subsidiary and our 50% ownership interest in PMB Real Estate Services LLC (“PMBRES”), a property management platform, we provide outpatient medical building and research center management, leasing, marketing, facility development and advisory services to highly rated hospitals and health systems and universities, academic medical centers, biotech and other similar companies throughout the United States.  \nTriple-Net Leased Properties (NNN)\nIn our NNN segment, we invest in and own senior housing communities, skilled nursing facilities (“SNFs”), long-term acute care facilities (“LTACs”), freestanding inpatient rehabilitation facilities (“IRFs”) and other healthcare facilities.  \nThe senior housing communities in our NNN segment may include independent living communities, assisted living communities, memory care communities and continuing care retirement communities, which property types are described in more detail above in “—Senior Housing Operating Portfolio (SHOP).”   \nSNFs provide rehabilitative, restorative, skilled nursing and medical treatment for patients and residents who do not require the high technology, care-intensive, high-cost setting of an acute care or rehabilitation hospital. Treatment programs include physical, occupational, speech, respiratory and other therapies, including sub-acute clinical protocols such as wound care and intravenous drug treatment.  \nLTACs typically serve medically complex, chronically ill patients who require a high 1evel of monitoring and specialized care, but whose conditions do not necessitate the continued services of an intensive care unit and have a Medicare average length of stay of greater than 25 days.  The tenants of these LTACs have the capability to treat patients who suffer from multiple systemic failures or conditions such as neurological disorders, head injuries, brain stem and spinal cord trauma, cerebral vascular accidents, chemical brain injuries, central nervous system disorders, developmental anomalies and cardiopulmonary disorders. Chronic patients often depend on technology for continued life support, such as mechanical ventilators, total parenteral nutrition, respiration or cardiac monitors and dialysis machines, and, due to their severe medical conditions, generally are not clinically appropriate for admission to a skilled nursing facility or rehabilitation hospital.  \nIRFs are devoted to the rehabilitation of patients with various neurological, musculoskeletal, orthopedic and other medical conditions following stabilization of their acute medical issues. Other healthcare facilities provide medical and surgical services, including inpatient care, intensive care, cardiac care, diagnostic services and emergency services. These other healthcare facilities may also provide outpatient services such as outpatient surgery, laboratory, radiology, respiratory therapy, cardiology and physical therapy.  \nCharges for services provided at SNFs, LTACs, IRFs and other healthcare facilities are generally paid from a combination of government reimbursement, commercial insurance and other private sources.\nWe lease these properties to tenants under triple-net or absolute-net leases that obligate the tenants to pay all property-related expenses, including maintenance, utilities, repairs, taxes, insurance and capital expenditures. The leases in our NNN segment typically contain annual or periodic rent escalators that may be contingent upon the satisfaction of specified facility revenue parameters or based on increases in the Consumer Price Index (“CPI”), with caps, floors or collars. These agreements may include provisions for termination under specific circumstances, including in the event of a monetary or non-monetary default by the tenant or in the event of a failure of the tenant to meet certain financial or operational covenants. The agreements typically include broad indemnities in our favor from the tenant for liabilities arising out of the tenant’s operations.  Although we do not participate directly in the financial performance of the tenants’ operations, we are exposed to the credit risk of our tenants in our NNN segment. See “Risk Factors—Risks Related to Our Business Operations and Strategy—If our managers’, tenants’ or borrowers’ financial condition or business prospects deteriorate, our business, financial condition and results of operations could be adversely affected” included in Part I, Item 1A of this Annual Report.\n4\nThe following table provides information regarding our significant triple-net leased tenant concentration as of and for the year ended December 31, 2024:\nPercentage of Total NOI\nSegment Properties\nPercentage of Segment Properties\nBrookdale Senior Living, Inc. \n(1)\n7.2 \n%\n121 \n8.9 \n%\nKindred Healthcare, LLC\n6.7 \n34 \n2.5 \nArdent Health Partners, LLC \n(2)\n6.6 \n11 \n0.8 \n______________________________\n(1)\nExcludes nine properties managed by Brookdale Senior Living, Inc. pursuant to long-term management agreements and included in the SHOP segment.\n(2)\nWe also lease 19 outpatient medical buildings to Ardent, which are included in the OM&R segment.\nThe properties we lease to Brookdale Senior Living, Inc. (together with its subsidiaries, “Brookdale”), Ardent Health Partners, LLC (together with its subsidiaries, “Ardent”) and Kindred Healthcare, LLC (together with its subsidiaries, “Kindred”) accounted for a significant portion of our NNN segment revenues and NOI for the year ended December 31, 2024. See “Risk Factors—Risks Related to Our Business Operations and Strategy—A significant portion of our revenues and operating income is dependent on a limited number of managers and tenants, including Atria, Sunrise, Le Groupe Maurice, Brookdale, Ardent and Kindred” included in Part I, Item 1A of this Annual Report, “Management’s Discussion and Analysis of Financial Condition and Results of Operations— “Concentration Risk,” included in Part II, Item 7 of this Annual Report and “Note 3 – Concentration of Credit Risk” included in Part II, Item 8 of this Annual Report.\nAs of December 31, 2024, we held warrants for 11.1 million shares of Brookdale common stock, which are exercisable at any time prior to December 31, 2025 and have an exercise price of $3.00 per share (the “Brookdale Warrants”). In addition, we hold warrants exercisable at any time prior to September 13, 2034 for 9.9% of the common equity of a parent company of Kindred exercisable at the pre-transaction value of such common equity (the “Scion Warrants”). See “Note 9 – Other Assets” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report.\nAs of December 31, 2024, we held an approximately 6.7% ownership interest in Ardent. See “Note 7 – Investments in Unconsolidated Entities” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report for a further discussion of our ownership interest.\nNon-Segment Assets\nNon-segment assets consist primarily of corporate assets, including cash and cash equivalents, restricted cash, loans receivable and investments and accounts receivable. Our loans receivable and investments generally provide us with interest income and fees and are often secured by mortgage liens or leasehold mortgages on the underlying properties and corporate or personal guarantees by affiliates of the borrowing entity. In some cases, the loans are secured by a pledge of ownership interests in the entity or entities that own the related properties or may take the form of mezzanine loans, which are subordinated to senior secured loans held by other investors that encumber the same real estate. Non-segment assets also include other assets, such as our Brookdale and Kindred Warrants. See “Note 6 – Loans Receivable and Investments” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report.  Although we do not participate directly in the financial performance of the operations of our borrowers’ properties, we are directly exposed to the credit risk of our borrowers and therefore indirectly to the operational risks of our borrowers. See “Risk Factors—Risks Related to Our Business Operations and Strategy—If our managers’, tenants’ or borrowers’ financial condition or business prospects deteriorate, our business, financial condition and results of operations could be adversely affected” included in Part I, Item 1A of this Annual Report.\nNon-segment assets also include our investments in unconsolidated entities, including investments in unconsolidated real estate entities through our third-party institutional private capital management platform, VIM, and investments in unconsolidated operating entities, such as Ardent and Atria. Through VIM, we partner with third-party institutional investors to invest in real estate through various joint ventures and other co-investment vehicles. In these arrangements, we are typically the general partner and earn fees as a result of that service.  The assets in our VIM business are primarily comprised of three platforms: the Ventas Fund, a state pension fund joint venture and a sovereign wealth fund joint venture. The Ventas Fund is a perpetual life vehicle focused on investments in core and core plus life science, outpatient medical and senior housing real estate in North America. Our state pension fund joint venture is principally focused on investment in ground up development and value added redevelopment of senior housing. Our sovereign wealth fund joint venture is focused on university-based research and innovation development projects. In the Ventas Fund and certain other ventures, we have the ability to earn \n5\nrevenues through incentive fees periodically during the life of a venture. See “Note 7 – Investments in Unconsolidated Entities” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report. \nDevelopment and Redevelopment Activities\nFrom time to time, we engage in development and redevelopment activities within our reportable business segments and through our investments in unconsolidated entities. For example, we are party to certain agreements that commit us to develop properties funded through capital that we and, in certain circumstances, our joint venture partners provide. As of December 31, 2024, we had three active and committed projects pursuant to these agreements, including two projects that are unconsolidated. In addition, from time to time, we engage in redevelopment projects with respect to our existing senior housing communities, outpatient medical buildings and research centers to maximize the value, increase NOI, maintain a market-competitive position, achieve property stabilization or change the primary use of the property.\nGeographic Diversification of Properties\nOur portfolio of assets is broadly diversified by geographic location throughout the United States, Canada and the United Kingdom, with properties in only one state (California) accounting for more than 10% of our total revenues for the year ended December 31, 2024. See “Management’s Discussion and Analysis of Financial Condition and Results of Operations—”Concentration Risk.” included in Part II, Item 7 of this Annual Report.  \nCompetition\nWe generally compete for investments in real estate with publicly traded, private and non-listed healthcare REITs, real estate partnerships, healthcare providers, healthcare lenders and other investors, including developers, banks, insurance companies, pension funds, government-sponsored entities and private equity firms, some of whom may have greater financial resources and lower costs of capital than we do. Increased competition challenges our ability to identify and successfully capitalize on opportunities that meet our objectives, which is affected by, among other factors, the availability of suitable acquisition or investment targets, our ability to negotiate acceptable transaction terms and our access to and cost of capital. See “Risk Factors—Risks Related to Our Business Operations and Strategy—Our ongoing strategy depends, in part, upon identifying and consummating future acquisitions and investments and effectively managing our expansion opportunities” included in Part I, Item 1A of this Annual Report and “Note 10 – Senior Notes Payable and Other Debt” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report.\nOur managers, tenants and borrowers typically compete on a local and regional basis with other organizations that provide comparable services. They typically compete to attract and retain residents and patients to our properties based on scope and quality of care, reputation and financial condition, price, location and physical appearance of the properties, services offered, qualified personnel, physician referrals and family preferences. With respect to outpatient medical buildings and research centers, we and our third-party managers compete to attract and retain tenants based on many of the same factors, in addition to quality of the affiliated health system or university, physician preferences and proximity to hospital or university campuses or research centers and quality of lab space. The ability of our managers, tenants and borrowers to compete successfully could be affected by private, federal and state reimbursement programs and other laws and regulations. See “Risk Factors—Our Legal, Compliance and Regulatory Risks—We and our managers, tenants and borrowers may be adversely affected by regulation and enforcement” included in Part I, Item 1A of this Annual Report.\nHuman Capital Management\nAt Ventas, our experienced team drives our success and creates value. As of December 31, 2024, we had 498 employees, none of which are subject to a collective bargaining agreement.\nWe provide a unique environment that offers opportunities for our team to use their professional skills, develop their talents and learn from each other as they build successful careers. We are committed to upholding human dignity and equal opportunity under the principles outlined in the United Nations’ Universal Declaration of Human Rights. Our Global Code of Ethics and Business Conduct, Vendor Code of Conduct and Human Rights Policy embed the responsibility to respect human rights in business functions across our operations as well as our supply chain.\nThe Compensation Committee and Nominating, Governance and Corporate Responsibility (“NGCR”) Committee of our Board of Directors provide oversight on certain human capital matters, goals and framework. We report on human capital matters regularly to our Compensation Committee and periodically to our Board of Directors. The most significant human capital measures and objectives that we focus on include the topics described below.\n6\nTalent Acquisition, Development and Retention\nWe strive to foster a culture that attracts and retains individuals who share a passion for integrity, flawless execution, collaborative problem-solving and, above all, excellence. A key component of our ability to attract and retain the top talent in our industry is our investment in our people and their continuous development by providing expansive professional opportunities, best-in-class leadership development and a broad array of workshops and training. \nEmployee engagement and employee satisfaction contribute to our ability to attract and retain top talent. Each year, we conduct an employee engagement survey through an independent third party, which measures our progress on key employee issues and identifies opportunities for evolving our programs.\nCompensation and Benefits\nVentas prides itself in offering an industry-leading compensation and benefits package.  Our benefits programs include a robust offering of medical, dental, vision, life, accidental death and dismemberment, disability plans and wellness programs, all of which require very low employee contributions or are offered at no cost to employees. We also provide other ancillary benefits at competitive group rates that allow employees to customize benefits to best meet their needs.  The Ventas retirement plans consist of a 401(k) profit sharing plan with both pretax and Roth offerings and competitive employer matching contributions.\nHealth & Safety\nVentas is committed to the health and safety of its employees. Helping to make our workplaces secure and hazard-free is a responsibility shared with each Ventas employee. Our commitment to health and safety is maintained by effective administration, training and education, and we expect our operating and development partners to comply with applicable company and legal requirements.\nOrganizational Resilience\nOur talented employee base is the foundation of our organizational resilience. As part of our employee value proposition, in addition to competitive compensation and benefits offerings, we invest in growth, development opportunities and comprehensive performance management for our employees that empower them to realize their full potential, expand their capabilities and fill critical roles within the organization. Our employee base is comprised of a mix of longer tenured employees, who contribute deep institutional experience and knowledge, and shorter tenured employees, who contribute new perspectives and ways of doing things. As of December 31, 2024, more than 40% of our employees have been promoted or transferred internally for new opportunities, reflecting our deep commitment to creating an environment where people can build their careers. \nThe Nominating, Governance & Corporate Responsibility Committee leads, and the Board oversees and reviews at least annually, a robust short- and long-term succession planning process for our senior management team, including our CEO. In general, our management succession planning is designed to anticipate both “planned” successions, such as those arising from anticipated retirements, and unplanned succession events, including emergencies and a range of other potential contingencies. \nThe CEO and Vice President, Human Resources support the annual succession plan review conducted by the Nominating, Governance & Corporate Responsibility Committee by providing information about each executive role and succession scenarios, including an overview of each potential successor’s experience and potential, readiness assessment and planned leadership development opportunities. The independent members of the Board also regularly interact with executives across several leadership levels of Ventas through management presentations at the Board meetings and other informal events to form their own independent assessment of senior leaders. \nBoth the Nominating, Governance and Corporate Responsibility Committee and the Board also regularly review strength and gaps in the executive and senior management team and their organizations with the Company’s long-term strategy and goal of optimizing performance in mind.  When appropriate, action plans are identified and executed to drive performance, enhance organizational resilience and support succession planning, including for the CEO.  We engage third party experts where appropriate to bring additional insights to, and facilitate, succession planning, conduct assessments and provide coaching and development to executives and others in cases where the Company and the employee will benefit.\n7\nCorporate Sustainability\nVentas has a robust, data-driven strategy designed to support the sustainable growth of our business and build long-term value for shareholders and other key stakeholders. Three priorities guide our efforts:\n•\nOur Impact: Enabling Sustainable Environments and Strong Communities\n•\nOur Employees: Empowering Exceptional People\n•\nOur Standards: Leading in Governance and Transparency\nVentas has set measurable goals related to each of our key sustainability topics and progress towards these goals is reported annually in our Corporate Sustainability Report.\nThese matters are overseen by our NGCR Committee. Our EVP, General Counsel and Ethics & Compliance Officer and VP, Corporate ESG & Sustainability report on these matters regularly to the NGCR Committee and periodically to our Board of Directors.\n    \nInsurance\nWe maintain or require in our lease, management and other agreements that our managers, tenants or other counterparties maintain comprehensive insurance coverage on our properties and their operations with terms, conditions, limits and deductibles that we believe are customary for similarly situated companies in each industry and we frequently review our insurance programs and requirements. The insurance that we maintain or require may take the form of commercial insurance, captive insurance or self-insurance.\nWe maintain the property insurance for a vast majority of our properties in our OM&R and SHOP segments. We also maintain liability insurance for certain outpatient medical properties, as well as the general and professional liability insurance for certain senior housing communities and related operations in our SHOP segment. However, some senior housing managers maintain the general and professional liability insurance for our senior housing communities and related operations that they manage in accordance with the terms of our management agreements. \nThrough our OM&R segment, we provide engineering, construction and architectural services in connection with new development projects, and we maintain and cause tenants, contractors, design professionals and other parties involved with such services to maintain property and liability insurance with respect to those activities.\nIn May 2020, the Company formed a wholly-owned captive insurance company, which provides insurance coverage for losses below the deductible and within the self-insured retention of the commercial property, general and professional liability insurance that we maintain for certain of our outpatient medical and senior housing locations.\nAdditional Information\nWe maintain a website at www.ventasreit.com and an Investor Relations website at ir.ventasreit.com. We use our Investor Relations website as a means of disclosing material information. Accordingly, investors should monitor our Investor Relations website in addition to following our press releases, SEC filings and public conference calls and webcasts. The information on our website and our Investor Relations website is not incorporated by reference in this Annual Report, and our web addresses are included as an inactive textual reference only.\nWe make available, free of charge, through our Investor Relations website, our Annual Report, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to those reports filed or furnished pursuant to Section 13 or 15(d) of the Exchange Act as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. In addition, our Guidelines on Governance, our Global Code of Ethics and Business Conduct (including waivers from and amendments to that document) and the charters for each of our Audit and Compliance, Nominating and Corporate Governance and Compensation Committees are available on our website, and we will mail copies of the foregoing documents to stockholders, free of charge, upon request to our Corporate Secretary at Ventas, Inc., 300 North LaSalle Street, Suite 1600, Chicago, Illinois 60654.\n8\nGOVERNMENT REGULATION\nUnited States Healthcare Regulation, Licensing and Enforcement\nOverview\nWe, along with our managers, tenants and borrowers  in the United States, are subject to or impacted by extensive and complex federal, state and local healthcare laws and regulations, including laws and regulations relating to quality of care, licensure and certificates of need (“CON”), conduct of operations, government reimbursement, such as Medicare and Medicaid, fraud and abuse, qualifications of personnel, appropriateness and classification of care, adequacy of plant and equipment and data privacy and cybersecurity. In our SHOP segment, these laws and regulations typically apply directly to us and our senior housing communities, where we generally hold the applicable healthcare licenses. In some instances, we enroll in government reimbursement programs, such as Medicaid. In our other segments, our tenants and borrowers are typically subject to these laws and regulations. Imposition of sanctions associated with these laws and regulations could adversely affect the tenant’s or borrower’s ability to satisfy its obligations to us. See “Risk Factors—Risks Related to Our Business Operations and Strategy—Our operating assets may expose us to various operational risks, liabilities and claims that could adversely affect our ability to generate revenues or increase our costs and could adversely affect our business, financial condition and results of operations” and “Risk Factors—Risks Related to Our Business Operations and Strategy—If our managers’, tenants’ or borrowers’ financial condition or business prospects deteriorate, our business, financial condition and results of operations could be adversely affected” included in Part I, Item 1A of this Annual Report.\nHealthcare laws and regulations are wide-ranging, and noncompliance may result in the imposition of civil, criminal, and administrative penalties, including: the loss or suspension of accreditation, licenses or CONs; suspension of or non-payment for new admissions; denial of reimbursement; fines; suspension, decertification, or exclusion from federal and state healthcare programs; or facility closure. Changes in laws or regulations, reimbursement policies, enforcement activity and regulatory non-compliance by us or our managers, tenants or borrowers could have a significant effect on our and their operations and financial condition, which in turn may adversely impact us, as detailed below and set forth under “Risk Factors—Our Legal, Compliance and Regulatory Risks” in Part I, Item 1A of this Annual Report.\nLicensure, Certification and CONs\nSenior housing communities, other than independent living communities, are subject to state and local laws that may require licenses, certifications and permits, and may vary greatly from one jurisdiction to another. Our senior housing communities that receive Medicaid payments are also subject to extensive federal laws and regulation. Our tenants or borrowers who operate other facilities, such as SNFs, LTACs, IRFs, health systems and medical practices, are typically subject to extensive federal and state regulation and must hold various licenses, certifications, and permits. Licensure and certification may be conditioned on requirements related to, among other things, the quality of medical care provided, compliance with staffing levels and reporting requirements, qualifications of the operator’s administrative personnel and clinical staff, adequacy of the physical plant and equipment and continuing compliance with applicable laws and regulations.  Sanctions for failure to comply with licensure and certification laws and regulations include loss of licensure or certification and ability to participate in or receive payments from the Medicare and Medicaid programs, suspension of or non-payment for new admissions, fines, and potential criminal penalties. \nMany of our licensed facilities, tenants and borrowers are subject to state CON laws, which require governmental approval prior to the development or expansion of licensed facilities and services. The approval process in states with CON laws generally requires a facility to demonstrate the need for additional or expanded licensed facilities or services.  CONs, where applicable, are also sometimes necessary for changes in ownership or control of licensed facilities, addition of beds, investment in major capital equipment, introduction of new services or termination of services previously approved through the CON process. CON laws and regulations may restrict our or our tenants’ ability to expand and grow in certain circumstances, which could have an adverse effect on our or their revenues.\nFraud and Abuse Enforcement\nParticipants in the U.S. healthcare industry are subject to complex federal and state civil and criminal laws and regulations governing healthcare provider referrals, relationships and arrangements. These laws include: (i) federal and state false claims acts, which generally prohibit providers from filing false claims or making false statements to receive payment from Medicare, Medicaid or other federal or state healthcare programs; (ii) federal and state anti-kickback and fee-splitting statutes, including the federal Anti-Kickback Statute, which prohibits the payment or receipt of remuneration to induce referrals or generate business involving healthcare items or services payable by Medicare or Medicaid; (iii) federal and state physician \n9\nself-referral laws, which generally prohibit referrals of certain services by physicians to entities with which the physician or an immediate family member has a financial relationship; and (iv) the federal Civil Monetary Penalties Law, which requires a lower burden of proof than other fraud and abuse laws and prohibits, among other things, the knowing presentation of a false or fraudulent claim for certain healthcare services.\nViolating these healthcare fraud and abuse laws and regulations may result in criminal and civil penalties, such as punitive sanctions, damage assessments, monetary penalties, imprisonment, denial of Medicare and Medicaid payments, and exclusion from the Medicare and Medicaid programs. These laws and regulations are enforced by a variety of federal, state and local governmental agencies, and many can also be enforced by private litigants through federal and state false claims acts and other laws that allow private individuals to bring whistleblower suits known as \nqui tam\n actions.\nReimbursement\nSources of revenue for us and some of our tenants and borrowers include, among others, governmental healthcare programs, such as the federal Medicare programs and state Medicaid programs, and non-governmental third-party payors, such as insurance carriers and health maintenance organizations. Medicare is a federal health insurance program for persons aged 65 and over, some disabled persons and persons with end-stage renal disease. Medicaid is a medical assistance program for eligible needy persons that is funded jointly by federal and state governments and administered by the states. Medicaid eligibility requirements and benefits vary by state. The Medicare and Medicaid programs are highly regulated and subject to frequent and substantial changes resulting from legislation, regulations and administrative and judicial interpretations of existing law. \nFederal and state governments may from time to time reduce Medicare and Medicaid spending through methods such as reductions in reimbursement rates and increased enrollment in managed care programs. Private payors, such as insurance companies, are typically for-profit companies and are continuously seeking opportunities to control healthcare costs. In some cases, private payors rely on government reimbursement systems to determine reimbursement rates, such that reductions in Medicare and Medicaid payment rates may negatively impact payments from private payors. These changes may result in reduced or slower growth in reimbursement for certain services provided by some of our tenants and borrowers.  Additionally, the U.S. Congress and certain state legislatures have introduced and passed a large number of proposals and legislation designed to make major changes in the healthcare system, including changes that directly or indirectly affect reimbursement. Several of these laws, including the Patient Protection and Affordable Care Act, as amended by the Health Care and Education Reconciliation Act of 2010 (the “Affordable Care Act”), have promoted shifting from traditional fee-for-service reimbursement models to alternative payment models that tie reimbursement to quality and cost of care, such as accountable care organizations and bundled payments. It is difficult to predict the nature and success of future financial or delivery system reforms, but changes to reimbursement rates and related policies could adversely impact our and our tenants’ results of operations.\nCARES Act and Similar Governmental Funding Programs\nIn response to the COVID-19 pandemic, in 2020, Congress enacted a series of economic stimulus and relief measures through the Coronavirus Aid, Relief and Economic Security Act (the “CARES Act”), the Paycheck Protection Program and Health Care Enhancement Act and the Consolidated Appropriations Act, 2021.  Other domestic, foreign, local, regional or national governments also implemented similar grant programs. We, and our managers, tenants and borrowers, applied for and received grants under these types of government programs.\nThe HHS Office of Inspector General, the Pandemic Response Accountability Committee and other governments each may have the right to conduct audits of our, or our managers’, tenants’ or borrowers’, use of funds from such programs and may have the right to recoup some or all of the payments if it determines those payments were not made or the funds not used in compliance with its rules, regulations and interpretive guidance.\nData Privacy and Cybersecurity\nWe and our managers, tenants and borrowers are subject to federal and state laws and regulations related to data privacy and cybersecurity.  In most cases, we depend on our managers, tenants and borrowers to fulfill any compliance obligations with respect to these data privacy and cybersecurity laws and regulations.\nFor example, data privacy and cybersecurity regulations issued pursuant to the Health Insurance Portability and Accountability Act of 1996, as amended (“HIPAA”), restrict the use and disclosure of individually identifiable health information (“protected health information” or “PHI”), provide for individual rights and require safeguards for PHI and notification of breaches of unsecure PHI. Entities subject to HIPAA include most healthcare providers, including some of our managers, tenants and borrowers. These covered entities are required to implement administrative, physical and technical \n10\npractices to protect the security of PHI that is electronically maintained or transmitted.  Business associates of covered entities who create, receive, maintain or transmit PHI are also subject to certain HIPAA provisions. Violations of HIPAA may result in substantial civil and/or criminal fines and penalties.  The Federal Trade Commission uses its consumer protection authority to initiate enforcement actions in response to data breaches. and regulate unfair or deceptive acts or practices, including with respect to data privacy and cybersecurity.  Moreover, the U.S. Congress has recently considered, and is currently considering, various proposals for more comprehensive data privacy and cybersecurity legislation to which we or our managers, tenants and borrowers may be subject if passed. \nData privacy and cybersecurity are also areas of increasing state legislative focus, and states are increasingly proposing or enacting legislation that relates to data privacy and cybersecurity. For example, the California Consumer Privacy Act, as amended by the California Privacy Rights Act (collectively, the “CCPA”), gives California residents certain rights with respect to their personal information.  Other states where we or our managers, tenants or borrowers do business, or may in the future do business, have enacted, or are considering enacting, comprehensive data privacy and cybersecurity laws that share similarities with the CCPA, for example the Texas Data Privacy and Security Act, effective as of July 1, 2024. In addition, laws in all 50 U.S. states and most U.S. territories generally require businesses to provide notice under certain circumstances to consumers whose personal information has been disclosed as a result of a data breach, and we or our managers, tenants or borrowers may be required to report events related to data privacy or cybersecurity issues, events where customer information may be compromised, unauthorized access to our or their systems or networks and other security breaches, to affected individuals or the relevant regulatory authorities. These state statutes, and other similar federal and state laws and regulations that may be enacted in the future, may require us or our managers, tenants or borrowers to modify our or their data processing practices and policies, incur substantial compliance-related costs and expenses and otherwise suffer adverse impacts on our or their business.\nInternational Healthcare Regulation\nWe own senior housing communities in Canada and the United Kingdom. Senior living residences in Canada are provincially regulated. Within each province, there are different categories for senior living residences that are generally based on the level of care sought or required by a resident (e.g., assisted or retirement living, senior living residences, residential care, long-term care). In some of these categories and depending on the province, residences may be government funded, or the individual residents may be eligible for a government subsidy, while other residences are exclusively private-pay. The governing legislation and regulations vary by province, but generally impose licensing requirements and requirements related to quality control, public health, infection control and other care-related operating standards.  These laws empower regulators in each province to take a variety of steps to ensure compliance, conduct inspections, issue reports and generally regulate the industry.  Our communities in Canada are also subject to data privacy and cybersecurity legislation, including, in certain provinces, data privacy and cybersecurity laws specifically related to personal health information. Although the obligations of senior living residences in the various provinces differ, they all include the obligation to protect personal information. The powers of data privacy and cybersecurity regulators and penalties for violations of data privacy and cybersecurity laws vary according to the applicable law or are left to the courts. Our senior living residences in Canada are also subject to a variety of other laws and regulations, including minimum wage standards and other employment laws.  \nIn the United Kingdom, our senior housing communities are principally regulated as “care home services” under the Health and Social Care Act 2008. This legislation subjects service providers to standards of care and requires, among other things, that all persons carrying out such activities, and the managers of such persons, be registered. Providers of care home services are also subject (as data controllers) to the U.K.’s Data Protection Act 2018, as supplemented by the European Union’s General Data Protection Regulation as implemented into U.K. law (collectively, “UK GDPR”), which governs the processing of personal data (including in relation to employees, clients and recipients of care home services). The UK GDPR imposes a significant number of obligations on data controllers with the potential for fines of up to 4% of annual worldwide turnover or £17.5 million, whichever is greater. Our business operations in the United Kingdom are also subject to a range of other regulations, such as the U.K. Bribery Act 2010. \nRegulation Impacting Life Sciences Research\nSome of our tenants, including university-affiliated organizations and private sector companies, conduct life sciences, medical device or related research. These tenants may be dependent on the public markets, private investors, the federal government agencies, such as the National Institutes of Health (“NIH”), or other sources of funding to support their activities. Creating a new pharmaceutical product or medical device requires substantial investments of time and capital, in part because of the extensive regulation of the healthcare industry; it also entails considerable risk of failure in demonstrating that the product is safe and effective and in gaining regulatory approval and market acceptance. Therefore, these tenants may face high levels of regulation, expense and uncertainty. See “Risk Factors—Risks Related to Our Business Operations and Strategy—Our research tenants face unique levels of expense and uncertainty” included in Part I, Item 1A of this Annual Report.\n11\nOur tenants with marketable products may be adversely affected by healthcare reform and government reimbursement policies, including changes under the current presidential administration or by private healthcare payors. See “Risk Factors—Risks Related to Our Business Operations and Strategy—Changes in the U.S. political and regulatory environment could affect availability of government funding that we or our managers, tenants or borrowers rely on, which could negatively impact our business” included in Part I, Item 1A of this Annual Report\nTax Regulation\nWe elected to be taxed as a REIT under Sections 856 through 860 of the Code, commencing with our taxable year ended December 31, 1999. Provided we qualify for taxation as a REIT, we generally will not be required to pay U.S. federal corporate income taxes on our REIT taxable income that is currently distributed to our stockholders. This treatment substantially eliminates the “double taxation” that ordinarily results from investment in a C corporation. We are required to pay income tax in certain circumstances, including on taxable income earned by our taxable REIT subsidiaries.  \nIn addition, we are subject to state and local tax in the U.S. and certain states do not conform completely to the federal income tax rules. We also are subject to non-U.S. tax on our operations in Canada and in the U.K., as our U.S. REIT status does not by itself afford us special tax status in those countries. We attempt to structure our investments outside of the U.S. in the most efficient manner possible, but do expect to incur some tax expense on our non-U.S. operations, which could increase due to tax rate increases, interest expense limitations or other changes in law. In particular, recently finalized legislation related to interest expense deductibility in Canada may have a significant impact on our income tax expense and cash taxes.  See “Risk Factors—Our REIT Status Risks—Legislative or other actions affecting REITs or taxes could have a negative effect on our stockholders or us” included in Part I, Item 1A of this Annual Report.\nThe Code defines a REIT as a corporation, trust or association: \n(1)   that is managed by one or more trustees or directors; \n(2)   that issues transferable shares or transferable certificates to evidence its beneficial ownership; \n(3)   that would be taxable as a domestic corporation, but for Sections 856 through 860 of the Code;\n(4)   that is not a financial institution or an insurance company within the meaning of certain provisions of the Code;\n(5)   that is beneficially owned by 100 or more persons; \n(6)   not more than 50% in value of the outstanding stock of which is owned, actually or constructively, by five or fewer individuals, including certain specified entities, during the last half of each taxable year; and\n(7)   that meets other tests, regarding the nature of its income and assets and the amount of its distributions. \nWe believe that we have been organized and have operated in a manner that has allowed us, and will continue to allow us, to satisfy conditions (1) through (7) inclusive, during the relevant time periods, and we intend to continue to be organized and operate in this manner. However, qualification and taxation as a REIT depend upon our ability to meet the various qualification tests imposed under the Code, including through actual operating results, asset composition, distribution levels and diversity of stock ownership. Accordingly, no assurance can be given that we will be organized or will be able to operate in a manner so as to qualify or remain qualified as a REIT.  \nIf we lose our status as a REIT (currently or with respect to any tax years for which the statute of limitations has not expired), we will face serious tax consequences that will substantially reduce the funds available to satisfy our obligations, to implement our business strategy and to make distributions to our stockholders for each of the years involved because:\n•\nWe would not be allowed a deduction for distributions to stockholders in computing our taxable income and would be subject to regular U.S. federal corporate income tax;\n•\nWe could be subject to increased state and local taxes; and\n•\nUnless we are entitled to relief under statutory provisions, we could not elect to be subject to tax as a REIT for four taxable years following the year during which we were disqualified.\n12\nIn addition, in such event we would no longer be required to pay dividends to maintain REIT status, which could adversely affect the value of our common stock. See “Risk Factors—Our REIT Status Risks.”\nOur senior housing communities, including certain of our independent living communities, that are considered “qualified healthcare properties” that are not leased to a third party operator generally must be owned and operated in a structure where we engage a third-party manager to manage and operate the senior housing communities.  For these senior housing communities we are required to rely on a third-party manager to manage and operate the property, including for purposes of procuring supplies, hiring and training all employees, entering into all third-party contracts for the benefit of the property, including resident/patient agreements, complying with laws and regulations, including but not limited to healthcare laws, and providing resident care and services, in exchange for a management fee.  We treat most of the senior housing communities in our SHOP segment as qualified healthcare properties that must be operated by third-party managers.  \nEnvironmental Regulation\nA wide variety of federal, local and foreign environmental and occupational health and safety laws and regulations affect our assets. These complex federal, local and foreign statutes, and their enforcement, involve a myriad of regulations, many of which impose strict liability on offenders. Some of these federal, local and foreign laws and regulations may directly impact us. Under various federal, local and foreign environmental laws, ordinances and regulations, an owner of real property or a secured lender, such as us, may be liable for the costs of removal or remediation of hazardous or toxic substances at, under or disposed of in connection with such property, as well as other potential costs relating to hazardous or toxic substances (including government fines and damages for injuries to persons and adjacent property).\nWith respect to our properties that are operated by third parties, we may be held primarily or jointly and severally liable for costs relating to the investigation and cleanup of any property from which there is or has been an actual or threatened release of a regulated material and any other affected properties, regardless of whether we knew of or caused the release. Such costs typically are not limited by law or regulation and could exceed the property’s value. In addition, we may be liable for certain other costs, such as governmental fines and injuries to persons, property or natural resources, as a result of any such actual or threatened release. See “Risk Factors—Risks Related to Our Business Operations and Strategy—Our operating assets may expose us to various operational risks, liabilities and claims that could adversely affect our ability to generate revenues or increase our costs and could adversely affect our business, financial condition and results of operations” included in Part I, Item 1A of this Annual Report.\nUnder the terms of our leases and loans, we generally have a right to indemnification by the tenants of our properties or borrowers for any contamination caused by them.\nIn some instances, we have agreed to indemnify our managers and tenants against any environmental claims (including penalties and cleanup costs) resulting from any condition arising in, on or under, or relating to, the applicable properties at any time before the applicable lease or management commencement date. With respect to SHOP, we have agreed to indemnify our managers against any environmental claims (including penalties and cleanup costs) resulting from any condition on those properties.",
  "item7": "ITEM 7.    \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion provides information that management believes is relevant to an understanding and assessment of the consolidated financial condition and results of operations of Ventas, Inc. You should read this discussion in conjunction with our Consolidated Financial Statements and the notes thereto included in Part II, Item 8 of this Annual Report and our Risk Factors included in Part I, Item 1A of this Annual Report.\nBusiness Summary and Overview of 2024 \nVentas, Inc., (together with its consolidated subsidiaries, unless otherwise indicated or except where the context otherwise requires, “we,” “us,” “our,” “Company” and other similar terms) is a real estate investment trust (“REIT”) focused on delivering strong, sustainable shareholder returns by enabling exceptional environments that benefit a large and growing aging population. We hold a portfolio that includes senior housing communities, outpatient medical buildings, research centers, hospitals and healthcare facilities located in North America and the United Kingdom.  As of December 31, 2024, we owned or had investments in 1,387 properties consisting of 1,356 properties in our reportable business segments (“Segment Properties”) and 31 properties held by unconsolidated real estate entities in our non-segment operations. Our Company is headquartered in Chicago, Illinois with additional corporate offices in Louisville, Kentucky and New York, New York.\nWe elected to be taxed as a REIT under Sections 856 through 860 of the Internal Revenue Code (the “Code”), commencing with our taxable year ended December 31, 1999. Provided we qualify for taxation as a REIT, we generally are not required to pay U.S. federal corporate income taxes on our REIT taxable income that is currently distributed to our stockholders.  In order to maintain our qualification as a REIT, we must satisfy a number of technical requirements, which impact how we invest in, operate and manage our assets.  See “Risk Factors—Our REIT Status Risks” included in Part I, Item 1A of this Annual Report on Form 10-K (the “Annual Report”).\nWe operate through three reportable business segments: senior housing operating portfolio, which we refer to as “SHOP,” outpatient medical and research portfolio, which we refer to as “OM&R,” and triple-net leased properties, which we refer to as “NNN.” We also hold assets outside of our reportable business segments, which we refer to as non-segment assets and which consist primarily of corporate assets, including cash and cash equivalents, restricted cash, loans receivable and investments and accounts receivable as well as investments in unconsolidated entities. Our investments in unconsolidated entities include investments made through our third-party institutional private capital management platform, Ventas Investment Management (“VIM”). Through VIM, we partner with third-party institutional investors to invest in real estate through various joint ventures and other co-investment vehicles where we are the sponsor or general partner, including our open-ended investment vehicle, the Ventas Life Science & Healthcare Real Estate Fund (the “Ventas Fund”). See our Consolidated Financial Statements and the related notes, including “Note 7 – Investments in Unconsolidated Entities” included in Part II, Item 8 of this Annual Report.\nOur chief operating decision maker evaluates performance of the combined properties in each operating segment and determines how to allocate resources to these segments, based on net operating income (“NOI”) for each segment. See our Consolidated Financial Statements and the related notes, including “Note 2 – Accounting Policies” and “Note 18 – Segment Information” included in Part II, Item 8 of this Annual Report.\nThe following table summarizes information for our portfolio for the year ended December 31, 2024 (dollars in thousands):\nSegment\nNOI \n(1)\nPercentage of Total NOI\nSegment Properties\nSenior housing operating portfolio (SHOP)\n$\n866,383 \n41.9 \n%\n629 \nOutpatient medical and research portfolio (OM&R)\n579,271 \n28.0 \n%\n426 \nTriple-net leased properties (NNN)\n606,225 \n29.3 \n%\n301 \nNon-segment \n(2)\n17,204 \n0.8 \n%\nn/a\n$\n2,069,083 \n100 \n%\n1,356 \n______________________________\n(1)    \n“NOI” is defined as total revenues, less interest and other income, property-level operating expenses and third-party capital management expenses. See “Non-GAAP Financial Measures” included elsewhere in this Annual Report for additional disclosure and a reconciliation of net income attributable to common stockholders, as computed in accordance with U.S. generally accepted accounting principles (“GAAP”), to NOI.\n42\n(2)    \nNOI for non-segment includes management fees and promote revenues, net of expenses related to our third-party institutional private capital management platform, income from loans and investments and corporate-level expenses not directly attributable to any of our three reportable business segments.\nFor more than 25 years, Ventas has pursued what we believe is a successful, enduring strategy focused on delivering outsized value to stockholders and other key stakeholders by enabling exceptional environments that benefit the aging population. Working with industry-leading care providers, partners, developers and research and medical institutions, our collaborative and experienced team is focused on achieving consistent, superior total returns through: (1) delivering profitable organic growth in senior housing, (2) capturing value-creating external growth focused on senior housing, (3) driving strong execution and cash flow generation throughout our portfolio of high-quality assets unified in serving the large and growing aging population and (4) maintaining financial strength, flexibility and liquidity. \nOur objective is to generate reliable and growing cash flows from our portfolio, which enables us to pay regular cash dividends to stockholders and creates opportunities to increase stockholder value.\n2025 Market Trends\nWe expect senior housing to benefit from strong supply/demand fundamentals, including robust projected demand growth combined with low projected supply growth.  Senior housing is expected to benefit from a large and growing aging demographic in the United States, with the 80+ population anticipated to grow by more than 28% through 2030.  United States senior housing construction starts are at their lowest point since 2010.\nOur operations have been and are expected to continue to be impacted by economic and market conditions.  For instance, in senior housing, our managers and tenants have experienced expense pressures, due in part to increased inflation and low unemployment. While there have been signs that expense pressures are moderating, there can be no assurance that this will continue to be the case.  \n \nContinual improvement in the performance and growth of our business will also depend on the broader macroeconomic environment, including interest rates, inflation and GDP growth.  \nSee “Risk Factors” in Part I, Item 1A of this Annual Report for additional discussion of risks affecting our business.\nSelect 2024 and Early 2025 Highlights\nInvestments and Dispositions\n•\nDuring the year ended December 31, 2024, we made $2.0 billion of investments including 50 senior housing communities reported within our SHOP segment, five long-term acute care facilities (“LTACs”) reported within our NNN segment for an aggregate purchase price of $1.9 billion and new secured debt financing of $109.0 million to the owner of a senior housing property, secured by the asset and with additional credit support. The loan provides us with a right of first offer to purchase the asset on certain terms and conditions. The loan has a 3-year term and bears interest at a variable rate based on one-month SOFR, subject to a floor of 4.50%, plus a spread of 5.75%, increasing to 6.00% commencing October 1, 2025.\n•\nDuring the year ended December 31, 2024, we sold 19 senior housing communities in our SHOP segment, 12 outpatient medical buildings (one of which was vacant) in our OM&R segment and 24 properties in our NNN segment for aggregate consideration of $315.1 million and recognized $57.0 million in Gain on real estate dispositions in our Consolidated Statements of Income.\n•\nIn January 2025, we acquired two senior housing communities reported within our SHOP segment for an aggregate purchase price of $70.0 million.\nLiquidity and Capital \n•\nAs of December 31, 2024, we had $3.8 billion in liquidity, including availability under our revolving credit facility, cash and cash equivalents on hand and unsettled equity forward sales agreements, with no borrowings outstanding under our commercial paper program.\n43\nSenior Notes\n•\nIn February 2024, our wholly-owned subsidiary, Ventas Canada Finance Limited (“Ventas Canada”), issued and sold C$650.0 million ($478.3 million) aggregate principal amount of 5.10% Senior Notes, Series J due 2029 in a private placement. \n•\nIn April and May 2024, we repaid $800.0 million senior notes consisting of $400.0 million aggregate principal amount of 3.50% Senior Notes due 2024 and $400.0 million aggregate principal amount of 3.75% Senior Notes due 2024. \n•\nIn April 2024, we repaid C$73.0 million ($53.4 million) aggregate principal amount of 2.80% Senior Notes, Series E due 2024.\n•\nIn May 2024, our wholly-owned subsidiary, Ventas Realty, Limited Partnership (“Ventas Realty”), issued and sold $500.0 million aggregate principal amount of 5.625% Senior Notes due 2034 in a registered public offering.\n•\nIn September 2024, Ventas Realty issued and sold $550.0 million aggregate principal amount of 5.00% Senior Notes due 2035 in a registered public offering.\n•\nIn September 2024, we repaid C$163.3 million ($120.8 million) aggregate principal amount of 4.125% Senior Notes due 2024.\n•\nIn January and February 2025, we repaid $450.0 million and $600.0 million aggregate principal amount of 2.65% Senior Notes due 2025 and aggregate principal amount of 3.50% Senior Notes due 2025, respectively.\nEquity\n•\nDuring the year ended December 31, 2024, we issued 37.3 million shares of our common stock for gross proceeds of $2.2 billion, representing an average price of $58.38 per share, of which 3.4 million shares or approximately $201.1 million in gross proceeds remained unsettled with maturity in March 2026.\n•\nIn January 2025, we entered into additional unsettled equity forward sales agreements for 0.8 million shares or approximately $49.8 million in gross proceeds with maturity in March 2026.\n•\nAs of December 31, 2024, we had $1.5 billion remaining under our current “at-the-market” equity offering program for future sales of common stock.\nPortfolio\n•\nDuring the year ended December 31, 2024, we converted 11 senior housing communities from the NNN segment to the SHOP segment. We also transitioned 17 senior housing communities within the SHOP segment to new managers.\n•\nIn September 2024, we entered into agreements with Kindred Healthcare, LLC and certain of its affiliates (“Kindred”) and its parent companies (“ScionHealth”) with respect to 23 LTACs whose lease term was scheduled to expire under our Master Lease with Kindred on April 30, 2025 (the “Kindred Group 2 LTACs”).  Under these agreements, among other things: (i) the term of the Kindred Master Lease for 20 of the Kindred Group 2 LTACs was extended to April 30, 2030, (ii) we acquired five LTACs from Kindred, which were added to the Kindred Master Lease with a term expiring on September 30, 2034, and (iii) we received warrants for 9.9% of the common equity of ScionHealth exercisable at its pre-transaction value.  The current term for three Kindred Group 2 LTACs will expire on April 30, 2025.  \n•\nIn December 2024, we entered into agreements with Brookdale Senior Living, Inc. and certain of its affiliates (“Brookdale”) with respect to 121 senior housing properties whose lease term was scheduled to expire under our Master Lease with Brookdale on December 31, 2025.  Under these agreements, among other things: (i) the term of the Brookdale Master Lease for 65 senior housing properties was extended to December 31, 2035, and (ii) commencing September 1, 2025, we will have the right to convert 45 senior housing properties to our SHOP segment with one or more managers of our choosing.  The current term for the remaining 11 properties will expire on December 31, 2025.  \n44\nOther Items\n•\nIn July 2024, Ardent Health Partners, Inc., the parent company of the tenants under, and guarantor of, the Ardent Master Lease, consummated an initial public offering (the “Ardent IPO”). Following the Ardent IPO, our equity stake in Ardent decreased from 7.5% to approximately 6.7%, which resulted in a gain of $8.7 million for the year ended December 31, 2024, which is included in Income from unconsolidated entities in our Consolidated Statements of Income.\nCritical Accounting Policies and Estimates\nOur Consolidated Financial Statements included in Part II, Item 8 of this Annual Report have been prepared in accordance with GAAP set forth in the Accounting Standards Codification (“ASC”), as published by the Financial Accounting Standards Board (“FASB”). GAAP requires us to make estimates and assumptions regarding future events that affect the reported amounts of assets and liabilities, the disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting periods. We base these estimates on our experience and assumptions we believe to be reasonable under the circumstances.  However, if our judgment or interpretation of the facts and circumstances relating to various transactions or other matters had been different, we may have applied a different accounting treatment, resulting in a different presentation of our financial statements. We periodically reevaluate our estimates and assumptions and, in the event they prove to be different from actual results, we make adjustments in subsequent periods to reflect more current estimates and assumptions about matters that are inherently uncertain. \nWe believe that the critical accounting policies described below, among others, affect our more significant estimates and judgments used in the preparation of our financial statements. For more information regarding our critical accounting policies, see “Note 2 – Accounting Policies” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report.\nPrinciples of Consolidation\nThe Consolidated Financial Statements included in Part II, Item 8 of this Annual Report include our accounts and the accounts of our wholly-owned subsidiaries and the joint venture entities over which we exercise control. All intercompany transactions and balances have been eliminated in consolidation, and our net earnings are reduced by the portion of net earnings attributable to noncontrolling interests.\nGAAP requires us to identify entities for which control is achieved through means other than voting rights and to determine which business enterprise is the primary beneficiary of variable interest entities (“VIEs”). A VIE is broadly defined as an entity with one or more of the following characteristics: (a) the total equity investment at risk is insufficient to finance the entity’s activities without additional subordinated financial support; (b) as a group, the holders of the equity investment at risk lack (i) the ability to make decisions about the entity’s activities through voting or similar rights, (ii) the obligation to absorb the expected losses of the entity, or (iii) the right to receive the expected residual returns of the entity; and (c) the equity investors have voting rights that are not proportional to their economic interests, and substantially all of the entity’s activities either involve, or are conducted on behalf of, an investor that has disproportionately few voting rights. We consolidate our investment in a VIE when we determine that we are its primary beneficiary. We may change our original assessment of a VIE upon subsequent events such as the modification of contractual arrangements that affects the characteristics or adequacy of the entity’s equity investments at risk and the disposition of all or a portion of an interest held by the primary beneficiary.\nWe identify the primary beneficiary of a VIE as the enterprise that has both: (i) the power to direct the activities of the VIE that most significantly impact the entity’s economic performance; and (ii) the obligation to absorb losses or the right to receive benefits of the VIE that could be significant to the entity. We perform this analysis on an ongoing basis.    \nAccounting for Real Estate Acquisitions\n    \nWhen we acquire real estate, we first make reasonable judgments about whether the transaction involves an asset or a business.  Our real estate acquisitions are generally accounted for as asset acquisitions as substantially all of the fair value of the gross assets acquired is concentrated in a single identifiable asset or group of similar identifiable assets. We record the cost of the assets acquired as tangible and intangible assets and liabilities based upon their relative fair values as of the acquisition date.  \nOur asset acquisitions may include one or more groups of real estate properties within which there are different types of tangible and intangible assets, typically consisting of land, buildings, site improvements, furniture, fixtures and equipment and lease intangibles.  When we acquire multiple real estate properties in a single transaction, we first assess the individual fair \n45\nvalue of the real estate properties and then determine the individual fair value of the various types of tangible and intangible assets therein. The individual fair value of the real estate properties is estimated by applying a valuation methodology such as the direct capitalization method of the income approach, which includes estimate for a capitalization rate, annual gross income, vacancy, and expenses based on a number of factors including historical operating results, known and anticipated trends as well as market and economic conditions.\nWe estimate the fair value of buildings acquired on an as-if-vacant basis or replacement cost basis and depreciate the building value over the estimated remaining life of the building, generally not to exceed 35 years. We determine the fair value of other fixed assets, such as site improvements and furniture, fixtures and equipment, based upon the replacement cost and depreciate such value over the assets’ estimated remaining useful lives as determined at the applicable acquisition date. We determine the value of land either by considering the sales prices of similar properties in recent transactions or based on internal analyses of recently acquired and existing comparable properties within our portfolio. We generally determine the value of construction in progress based upon the replacement cost. However, for certain acquired properties that are part of a ground-up development, we determine fair value by using the same valuation approach as for all other properties and deducting the estimated cost to complete the development. During the remaining construction period, we capitalize project costs until the development has reached substantial completion. Construction in progress, including capitalized interest, is not depreciated until the development has reached substantial completion. \nIntangibles primarily include the value of in-place leases and acquired lease contracts. We include all lease-related intangible assets and liabilities within acquired lease intangibles and accounts payable and other liabilities, respectively, on our Consolidated Balance Sheets.  \nThe fair value of acquired lease-related intangibles, if any, reflects: (i) the estimated value of any above or below market leases, determined by discounting the difference between the estimated market rent and in-place lease rent; and (ii) the estimated value of in-place leases related to the cost to obtain tenants, including leasing commissions, and an estimated value of the absorption period to reflect the value of the rent and recovery costs foregone during a reasonable lease-up period as if the acquired space was vacant. We amortize any acquired lease-related intangibles to revenue or amortization expense over the remaining life of the associated lease plus any assumed bargain renewal periods. If a lease is terminated prior to its stated expiration or not renewed upon expiration, we recognize all unamortized amounts of lease-related intangibles associated with that lease in operations over the shortened lease term. \nWe estimate the fair value of purchase option intangible assets and liabilities, if any, by discounting the difference between the applicable property’s acquisition date fair value and an estimate of its future option price. We do not amortize the resulting intangible asset or liability over the term of the lease, but rather adjust the recognized value of the asset or liability upon sale.    \nIn connection with an acquisition, we may assume rights and obligations under certain lease agreements pursuant to which we become the lessee of a given property. We generally assume the lease classification previously determined by the prior lessee absent a modification in the assumed lease agreement. We assess assumed operating leases, including ground leases, to determine whether the lease terms are favorable or unfavorable to us given current market conditions on the acquisition date. To the extent the lease terms are favorable or unfavorable to us relative to market conditions on the acquisition date, we recognize an intangible asset or liability at fair value and amortize that asset or liability to interest or rental expense in our Consolidated Statements of Income over the applicable lease term. Where we are the lessee, we record the acquisition date values of leases, including any above or below market value, within operating lease assets and operating lease liabilities on our Consolidated Balance Sheets.    \nWe estimate the fair value of noncontrolling interests assumed consistent with the manner in which we value all of the underlying assets and liabilities. \nWe calculate the fair value of long-term assumed debt by discounting the remaining contractual cash flows on each instrument at the current market rate for those borrowings, which we approximate based on the rate at which we would expect to incur a replacement instrument on the date of acquisition, and recognize any fair value adjustments related to long-term debt as effective yield adjustments over the remaining term of the instrument. \nImpairment of Long-Lived and Intangible Assets\nWe periodically evaluate our long-lived assets, primarily consisting of investments in real estate, for impairment indicators.  If indicators of impairment are present, we evaluate the carrying value of the related real estate investments in relation to the future undiscounted cash flows of the underlying operations. In performing this evaluation, we consider market \n46\nconditions and our current intentions with respect to holding or disposing of the asset. We adjust the net book value of real estate properties and other long-lived assets to fair value if the sum of the expected future undiscounted cash flows, including sales proceeds, is less than book value. We recognize an impairment loss at the time we make any such determination.     \nEstimates of fair value used in our evaluation of investments in real estate are based upon an income approach, if necessary, or other acceptable valuation techniques that are based, in turn, upon all available evidence including level three inputs, such as net operating income, revenue and expense growth rates, estimates of future cash flows, capitalization rates, discount rates, general economic conditions and trends, or other available market data such as replacement cost or comparable sales. Our ability to accurately predict future operating results and cash flows and to estimate and determine fair values impacts the timing and recognition of impairments. While we believe our assumptions are reasonable, changes in these assumptions may have a material impact on our financial results. \nAccounting for Foreclosed Properties\nThe Company may receive properties pursuant to a foreclosure, deed in lieu of foreclosure or other legal action in full or partial settlement of loans receivable by taking legal title or physical possession of the properties. We refer to such actions as a “foreclosure” and to such properties as “foreclosed properties.” We account for foreclosed properties received in settlement of loans receivable in accordance with ASC 310, \nReceivables\n. Foreclosed real estate received in full or partial satisfaction of a loan and any debt assumed upon foreclosure is recorded at fair value at the time of foreclosure. If the amortized cost basis in the loan exceeds the fair value of the collateral received, the difference is recorded as an allowance on loans receivable and investments in the Consolidated Statements of Income. Conversely, if the fair value of the collateral received is higher than the amortized cost basis in the loan, the difference, less the fair value of any debt assumed, less the principal amount of the loan receivable (after the reversal of previously recorded allowances), and net of working capital assumed and transaction costs, is recorded as a gain on foreclosure of real estate in the Consolidated Statements of Income.\nRecent Accounting Standards\nIn December 2023, the FASB issued Accounting Standards Update 2023-09, Improvements to Income Tax Disclosures (“ASU 2023-09”), which requires public entities on an annual basis to (1) disclose specific categories in the rate reconciliation and (2) provide additional information for reconciling items that meet a quantitative threshold (if the effect of those reconciling items is equal to or greater than 5 percent of the amount computed by multiplying pretax income or loss by the applicable statutory income tax rate). ASU 2023-09 is effective for fiscal years beginning after December 15, 2024. We are evaluating the impact of adopting ASU 2023-09 on our Consolidated Financial Statements.\nIn March 2024, the SEC adopted the final rule under SEC Release No. 33-11275, The Enhancement and Standardization of Climate Related Disclosures for Investors, which requires registrants to disclose climate-related information in registration statements and annual reports. The new rules would be effective for annual reporting periods beginning in fiscal year 2025. However, in April 2024, the SEC exercised its discretion to stay these rules pending the completion of judicial review of certain consolidated petitions with the United States Court of Appeals for the Eighth Circuit in connection with these rules. We are evaluating the impact of this rule on our Consolidated Financial Statements.\nOn November 4, 2024, the FASB issued ASU 2024-03, \nDisaggregation of Income Statement Expenses\n (DISE), which requires disaggregated disclosure of income statement expenses for public business entities (PBEs). ASU 2024-03 requires a footnote disclosure about specific expenses by requiring PBEs to disaggregate, in a tabular presentation, each relevant expense caption on the face of the income statement that includes certain natural expenses relevant to the Company, such as (1) employee compensation, (2) depreciation and (3) intangible asset amortization. The tabular disclosure would also include certain other expenses, when applicable. The ASU does not change the expense captions an entity presents on the face of the income statement; rather, it requires disaggregation of certain expense captions into specified categories in disclosures within the footnotes to the financial statements. ASU 2024-03 is effective for annual reporting periods beginning after December 15, 2026 and interim reporting periods beginning after December 15, 2027. The requirements will be applied prospectively with the option for retrospective application. We are evaluating the impact of adopting ASU 2024-03 on our Consolidated Financial Statements.\n47\nResults of Operations \nAs of December 31, 2024, we operated through three reportable business segments: SHOP, OM&R and NNN. In our SHOP segment, we own and invest in senior housing communities throughout the United States and Canada and engage operators to operate those communities. In our OM&R segment, we primarily acquire, own, develop, lease and manage outpatient medical buildings and research centers throughout the United States. In our NNN segment, we invest in and own senior housing communities, skilled nursing facilities (“SNFs”), long-term acute care facilities (“LTACs”), freestanding inpatient rehabilitation facilities (“IRFs”) and other healthcare facilities, throughout the United States and the United Kingdom and lease these properties to tenants under triple-net or absolute-net leases that obligate the tenants to pay all property-related expenses, including maintenance, utilities, repairs, taxes, insurance and capital expenditures. Information provided for “non-segment” includes management fees and promote revenues, net of expenses related to our third-party institutional private capital management platform, income from loans and investments and corporate-level expenses not directly attributable to any of our three reportable business segments. Non-segment assets consist primarily of corporate assets, including cash and cash equivalents, restricted cash, loans receivable and investments and accounts receivable. Non-segment assets also include our investments in unconsolidated entities, including investments in unconsolidated real estate entities through our third-party institutional private capital management platform, VIM, and investments in unconsolidated operating entities, such as Ardent and Atria. Through VIM, we partner with third-party institutional investors to invest in real estate through various joint ventures and other co-investment vehicles.  Non-segment assets also include other assets, such as our Brookdale and Kindred Warrants.\nOur chief operating decision maker (“CODM”) is the Chief Executive Officer of the Company. Our CODM evaluates performance of the combined properties in each reportable business segment and determines how to allocate resources to those segments based on NOI for each segment. For further information regarding our reportable business segments and a discussion of our definition of NOI, see “Note 18 – Segment Information” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report. \n48\nYears Ended December 31, 2024 and 2023 \nThe table below shows our results of operations for the years ended December 31, 2024 and 2023 and the effect of changes in those results from period to period on our net income attributable to common stockholders (dollars in thousands):\n \nFor the Years Ended\nDecember 31,\nIncrease (Decrease) to \nNet Income\n \n2024\n2023\n$\n%\nNOI:\n \n \n \n \nSHOP\n$\n866,383 \n$\n711,407 \n$\n154,976 \n21.8 \n%\nOM&R\n579,271 \n576,932 \n2,339 \n0.4 \nNNN\n606,225 \n604,651 \n1,574 \n0.3 \nNon-segment\n17,204 \n32,177 \n(14,973)\n(46.5)\nTotal NOI\n2,069,083 \n1,925,167 \n143,916 \n7.5 \nInterest and other income\n28,114 \n11,414 \n16,700 \n146.3 \nInterest expense\n(602,835)\n(574,112)\n(28,723)\n(5.0)\nDepreciation and amortization\n(1,253,143)\n(1,392,461)\n139,318 \n10.0 \nGeneral, administrative and professional fees\n(162,990)\n(148,876)\n(14,114)\n(9.5)\n(Loss) gain on extinguishment of debt, net\n(687)\n6,104 \n(6,791)\n(111.3)\nTransaction, transition and restructuring costs\n(20,369)\n(15,215)\n(5,154)\n(33.9)\nReversal of allowance on loans receivable and investments, net\n166 \n20,270 \n(20,104)\n(99.2)\nGain on foreclosure of real estate\n— \n29,127 \n(29,127)\n100.0 \nShareholder relations matters\n(15,751)\n— \n(15,751)\n(100.0)\nOther (expense) income\n(49,584)\n23,001 \n(72,585)\nnm\nLoss before unconsolidated entities, real estate dispositions, income taxes and noncontrolling interests\n(7,996)\n(115,581)\n107,585 \n93.1 \nIncome from unconsolidated entities\n1,563 \n13,626 \n(12,063)\n(88.5)\nGain on real estate dispositions\n57,009 \n62,119 \n(5,110)\n(8.2)\nIncome tax benefit\n37,775 \n9,539 \n28,236 \nnm\nNet income (loss)\n88,351 \n(30,297)\n118,648 \nnm\nNet income attributable to noncontrolling interests\n7,198 \n10,676 \n(3,478)\n(32.6)\nNet income (loss) attributable to common stockholders\n$\n81,153 \n$\n(40,973)\n$\n122,126 \nnm\n______________________________\nnm - not meaningful\nNOI—SHOP Segment\nThe following table summarizes results of operations in our SHOP segment as of December 31, 2024 (dollars in thousands):\nFor the Years Ended\nDecember 31,\nIncrease (Decrease) to NOI\n2024\n2023\n$\n%\nNOI—SHOP:\nResident fees and services\n$\n3,372,796 \n$\n2,959,219 \n$\n413,577 \n14.0 \n%\nLess: Property-level operating expenses\n(2,506,413)\n(2,247,812)\n(258,601)\n(11.5)\nNOI\n$\n866,383 \n$\n711,407 \n$\n154,976 \n21.8 \n%\n49\nSegment\nProperties at\nDecember 31,\nAverage Unit \nOccupancy\nfor the Years Ended\nDecember 31,\nAverage Monthly Revenue Per Occupied Room for \nthe Years Ended\nDecember 31,\n2024\n2023\n2024\n2023\n2024\n2023\nTotal communities\n629 \n587 \n84.5 \n%\n81.4 \n%\n$\n4,923 \n$\n4,684 \nResident fees and services include all amounts earned from residents at our senior housing communities, such as rental fees related to resident leases, extended healthcare fees and other ancillary service income. Property-level operating expenses related to our SHOP segment include labor, food, utilities, real estate taxes, insurance, repairs and maintenance, marketing, management fees, supplies and other costs of operating the properties. For senior housing communities in our SHOP segment, occupancy generally reflects average operator-reported unit occupancy for the reporting period. Average monthly revenue per occupied room reflects average resident fees and services per operator-reported occupied unit for the reporting period.\nThe increase in our SHOP segment NOI in 2024 over the prior year was driven by positive trends in revenue driven by gains in occupancy and revenue per occupied room, the addition of communities acquired in our SHOP segment and conversions of senior housing communities from our NNN segment to our SHOP segment. The revenue increase is partially offset by higher operating expenses in 2024, driven by an increase in the number of communities in our SHOP segment and an increase in occupancy.\nThe following table compares results of operations for our 472 same-store SHOP communities (dollars in thousands). See “Non-GAAP Financial Measures\n—\nNOI” included elsewhere in this Annual Report for additional disclosure regarding same-store NOI for each of our reportable business segments.\nFor the Years Ended\nDecember 31,\nIncrease (Decrease) to NOI\n2024\n2023\n$\n%\nSame-Store NOI—SHOP:\nResident fees and services\n$\n2,764,175 \n$\n2,554,227 \n$\n209,948 \n8.2 \n%\nLess: Property-level operating expenses\n(2,012,969)\n(1,905,495)\n(107,474)\n(5.6)\nNOI\n$\n751,206 \n$\n648,732 \n$\n102,474 \n15.8 \n%\nSegment\nProperties at\nDecember 31,\nAverage Unit \nOccupancy\nfor the Years Ended\nDecember 31,\nAverage Monthly Revenue Per Occupied Room for \nthe Years Ended\nDecember 31,\n2024\n2023\n2024\n2023\n2024\n2023\nSame-store communities\n472 \n472 \n86.4 \n%\n83.4 \n%\n$\n4,917 \n$\n4,709 \nThe increase in our same-store SHOP segment NOI in 2024 was primarily driven by positive trends in occupancy and revenue per occupied room in 2024, partially offset by higher operating expenses driven by an increase in occupancy.\n50\nNOI—OM&R Segment\nThe following table summarizes results of operations in our OM&R segment as of December 31, 2024 (dollars in thousands). For properties in our OM&R segment, occupancy generally reflects occupied square footage divided by net rentable square footage as of the end of the reporting period.\nFor the Years Ended\nDecember 31,\nIncrease (Decrease) to NOI\n2024\n2023\n$\n%\nNOI—OM&R:\nRental income\n$\n874,886 \n$\n867,193 \n$\n7,693 \n0.9 \n%\nThird-party capital management revenues\n2,705 \n2,515 \n190 \n7.6 \nTotal revenues\n877,591 \n869,708 \n7,883 \n0.9 \nLess:\nProperty-level operating expenses\n(298,320)\n(292,776)\n(5,544)\n(1.9)\nNOI\n$\n579,271 \n$\n576,932 \n$\n2,339 \n0.4 \n%\nSegment\nProperties at\nDecember 31,\nOccupancy at\nDecember 31,\nAnnualized Average Rent Per Occupied Square Foot for the Years Ended December 31,\n2024\n2023\n2024\n2023\n2024\n2023\nTotal OM&R\n426 \n437 \n88.3 \n%\n87.7 \n%\n$\n37 \n$\n37 \nThe increase in our OM&R segment NOI in 2024 over the prior year was primarily due to properties acquired in May 2023, favorable leasing activity, improved parking revenues and a development project placed in service, partially offset by dispositions.\nThe following table compares results of operations for our 337 same-store OM&R (dollars in thousands):\nFor the Years Ended\nDecember 31,\nIncrease (Decrease) to NOI\n2024\n2023\n$\n%\nSame-Store NOI—OM&R:\nRental income\n$\n747,910 \n$\n729,864 \n$\n18,046 \n2.5 \n%\nLess: Property-level operating expenses\n(240,497)\n(231,803)\n(8,694)\n(3.8)\nNOI\n$\n507,413 \n$\n498,061 \n$\n9,352 \n1.9 \n%\nSegment\nProperties at\nDecember 31,\nOccupancy at\nDecember 31,\nAnnualized Average Rent Per Occupied Square Foot for the Years Ended December 31,\n2024\n2023\n2024\n2023\n2024\n2023\nSame-store OM&R\n337 \n337 \n91.1 \n%\n91.1 \n%\n$\n38 \n$\n37 \nThe increase in our same-store OM&R segment NOI in 2024 over the prior year is primarily due to favorable leasing activity. high tenant retention at higher rates and improved parking revenues.\n51\nNOI—NNN Segment\nThe following table summarizes results of operations in our 301 NNN segment as of December 31, 2024 (dollars in thousands):\n \nFor the Years Ended\nDecember 31,\n Increase (Decrease) to NOI\n \n2024\n2023\n$\n%\nNOI—NNN:\n \n \n \n \nRental income\n$\n622,054 \n$\n619,208 \n$\n2,846 \n0.5 \n%\nLess: Property-level operating expenses\n(15,829)\n(14,557)\n(1,272)\n(8.7)\nNOI\n$\n606,225 \n$\n604,651 \n$\n1,574 \n0.3 \n%\nIn our NNN segment, our revenues generally consist of fixed rental amounts (subject to contractual escalations) received from our tenants in accordance with the applicable lease terms. We report revenues and property-level operating expenses within our NNN segment for real estate tax and insurance expenses that are paid from escrows collected from our tenants.  \nThe increase in our NNN segment NOI in 2024 over the prior year was primarily driven by a $18 million increase from acquisitions, a $10 million net increase in contractual rent escalators, partially offset by a $16 million decrease in rental income from communities that converted to our SHOP segment, a $6 million decrease from dispositions and a $4 million decrease due to additional rental income received in 2023.\nOccupancy rates may affect the profitability of our tenants’ operations. For senior housing communities and post-acute properties in our NNN segment, occupancy generally reflects average operator-reported unit and bed occupancy, respectively, for the reporting period. Because triple-net financials are delivered to us following the reporting period, occupancy is reported in arrears. The following table sets forth average continuing occupancy rates related to the triple-net leased properties we owned at December 31, 2024 and measured over the trailing 12 months ended September 30, 2024 (which is the most recent information available to us from our tenants) and average continuing occupancy rates related to the triple-net leased properties we owned at December 31, 2023 and measured over the 12 months ended September 30, 2023. The Segment Properties in the table below excludes non-stabilized properties, certain properties for which we do not receive occupancy information and properties acquired or properties that transitioned operators for which we do not have a full four quarters of occupancy results.\nNumber of Properties Owned at December 31, 2024\nAverage Occupancy for the Trailing 12 Months Ended September 30, 2024\nNumber of Properties Owned at December 31, 2023\nAverage Occupancy for the Trailing 12 Months Ended September 30, 2023\nSenior housing communities\n190 \n78.7 \n%\n223 \n77.4 \n%\nSNFs\n18 \n84.7 \n16 \n83.6 \nIRFs and LTACs\n34 \n54.8 \n36 \n54.3 \nThe following table compares results of operations for our 265 same-store NNN segment (dollars in thousands):\n \nFor the Years Ended\nDecember 31,\nIncrease (Decrease) to NOI\n \n2024\n2023\n$\n%\nSame-Store NOI—NNN:\n \n \n \n \nRental income\n$\n573,845 \n$\n567,011 \n$\n6,834 \n1.2 \n%\nLess: Property-level operating expenses\n(14,604)\n(12,749)\n(1,855)\n(14.6)\nNOI\n$\n559,241 \n$\n554,262 \n$\n4,979 \n0.9 \n%\nThe increase in our same-store NNN segment rental income in 2024 over the prior year was attributable primarily to a $10 million net increase in contractual rent escalators, partially offset by $4 million of additional rental income received in 2023.\n52\nNOI — Non-Segment\nNon-segment NOI includes management fees and promote revenues, net of expenses, related to our third-party institutional private capital management platform, income from loans and investments and corporate-level expenses not directly attributable to any of our three reportable business segments. The $15.0 million decrease in non-segment NOI in 2024 over the prior year was primarily due to a $17.9 million decrease in interest income due to the conversion of the outstanding principal amount of a loan to equity in May 2023, partially offset by interest income from a new secured debt financing provided in September 2024. See “Note 6 – Loans Receivable and Investments” and “Note 7 – Investments in Unconsolidated Entities” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report.\nCompany Results\nInterest and other income\nThe $16.7 million increase in interest and other income in 2024 over the prior year was primarily due to interest income earned on a higher invested cash balance as a result of pre-funding debt issuance activities ahead of certain debt maturities.\nInterest expense\nThe $28.7 million increase in interest expense, net of higher capitalized interest of $3.3 million, in 2024 over the prior year was primarily attributable to an increase of $23.9 million due to a higher effective interest rate and $18.9 million due to higher average debt balances. Our weighted average effective interest rate was 4.41% for 2024, compared to 4.23% for 2023. Our weighted average debt outstanding was $13.5 billion for 2024, compared to $13.1 billion for 2023. The higher weighted average debt balance for 2024 compared to 2023 was primarily attributable to pre-funding debt issuance activities ahead of certain debt maturities. Capitalized interest for 2024 and 2023 was $15.6 million and $12.3 million, respectively.\nDepreciation and amortization\nThe $139.3 million decrease in depreciation and amortization expense in 2024 over the prior year was primarily due to a $189.1 million decrease in impairments recognized in 2024 compared to 2023 related to properties that were sold or classified as held for sale.\nGeneral, administrative and professional fees\nThe \n$14.1 million\n \nincrease\n in general\n, administrative and professional fees in 2024 over the prior year was primarily due to our expanded employee base consistent with enterprise growth and inflationary increases.\n(Loss) gain on extinguishment of debt, net\nThe $6.8 million decrease in gain on extinguishment of debt, net in 2024 over the prior year was primarily related to $8.3 million of gain recognized as a result of cash tender offers in 2023.\nTransaction, transition and restructuring costs\nThe $5.2 million increase in transaction, transition and restructuring costs in 2024 over the prior year was primarily due to costs incurred in connection with the amendment of the Kindred Master Lease.\nReversal of allowance on loans receivable and investments, net\nIn May 2023, we reversed a $20.0 million allowance previously recorded. This item did not recur in 2024.\nGain on foreclosure of real estate\nThe gain of $29.1 million for the year ended December 31, 2023 was recorded in connection with our equitization of a mezzanine loan in May 2023. This item did not recur in 2024.\n53\nShareholder relations matters\nShareholder relations matters of $15.8 million for the year ended December 31, 2024 relates to proxy advisory costs related to our response to a proxy campaign associated with the Company’s 2024 annual meeting. There were no such costs incurred for the year ended December 31, 2023.\nOther (expense) income\nThe $72.6 million change from $23.0 million other income in 2023 to $49.6 million other expense in 2024 was primarily due to a $46.7 million change in the fair value of stock warrants, a $14.1 million decrease in insurance reimbursements received in 2024, a $6.6 million increase in insurance expense and a $3.2 million increase in damages caused by significant disruptive events. For the year ended December 31, 2024 and 2023, we recognized unrealized loss of $11.0 million and unrealized gain of $35.7 million, respectively, relating to the change in fair value of stock warrants.\nIncome from unconsolidated entities\nThe $12.1 million decrease in income from unconsolidated entities for 2024 over the prior year was primarily due to a $33.5 million gain recognized upon the sale of approximately 24% of our 9.8% ownership interest in Ardent in May 2023, partially offset by $11.0 million increase in income from Ardent in 2024 and a $8.7 million gain recognized following the Ardent IPO in July 2024 and the resulting decrease in our equity stake from 7.5% to approximately 6.7%.\nGain on real estate dispositions\nThe $5.1 million decrease in gain on real estate dispositions was due to a gain of $62.1 million recognized in 2023 compared to a gain of $57.0 million in 2024. \nIncome tax benefit\nThe 2024 income tax benefit is primarily due to losses in certain of our TRS entities and a $28.6 million change in valuation allowance due to purchase accounting activity. The 2023 income tax benefit is primarily due to losses in certain of our TRS entities and a $3.2 million benefit from internal restructurings of U.S. TRS entities. \n     \nYears Ended December 31, 2023 and 2022 \nOur Annual Report for the year ended December 31, 2023, filed with the SEC on February 15, 2024, contains information regarding our results of operations for the years ended December 31, 2023 and 2022 and the effect of changes in those results from period to period on our net income attributable to common stockholders.\nNon-GAAP Financial Measures\nWe consider certain non-GAAP financial measures to be useful supplemental measures of our operating performance.  A non-GAAP financial measure is a measure of historical or future financial performance, financial position or cash flows that excludes or includes amounts that are not so excluded from or included in the most directly comparable measure calculated and presented in accordance with GAAP. Described below are the non-GAAP financial measures used by management to evaluate our operating performance and that we consider most useful to investors, together with reconciliations of these measures to the most directly comparable GAAP measures.\nThe non-GAAP financial measures we present in this Annual Report may not be comparable to those presented by other real estate companies due to the fact that not all real estate companies use the same definitions. You should not consider these measures as alternatives for, or superior to, financial measures calculated in accordance with GAAP. In order to facilitate a clear understanding of our consolidated historical operating results, you should examine these measures in conjunction with the most directly comparable GAAP measures as presented in our Consolidated Financial Statements and other financial data included elsewhere in this Annual Report.\n54\nNareit Funds From Operations and Normalized Funds From Operations Attributable to Common Stockholders\nHistorical cost accounting for real estate assets implicitly assumes that the value of real estate assets diminishes predictably over time. However, since real estate values historically have risen or fallen with market conditions, many industry investors deem presentations of operating results for real estate companies that use historical cost accounting to be insufficient by themselves. For that reason, we consider Nareit Funds From Operations attributable to common stockholders (“FFO”) and Normalized FFO attributable to common stockholders (“Normalized FFO”) to be appropriate supplemental measures of operating performance of an equity REIT. We believe that the presentation of FFO, combined with the presentation of required GAAP financial measures, has improved the understanding of operating results of REITs among the investing public and has helped make comparisons of REIT operating results more meaningful. Management generally considers FFO to be a useful measure for understanding and comparing our operating results because, by excluding gains and losses related to sales of previously depreciated operating real estate assets, impairment losses on depreciable real estate and real estate asset depreciation and amortization (which can differ across owners of similar assets in similar condition based on historical cost accounting and useful life estimates), FFO can help investors compare the operating performance of a company’s real estate across reporting periods and to the operating performance of other companies. We believe that Normalized FFO is useful because it allows investors, analysts and our management to compare our operating performance to the operating performance of other real estate companies across periods on a consistent basis without having to account for differences caused by non-recurring items and other non-operational events such as transactions and litigation. In some cases, we provide information about identified non-cash components of FFO and Normalized FFO because it allows investors, analysts and our management to assess the impact of those items on our financial results. \nWe use the National Association of Real Estate Investment Trusts (“Nareit”) definition of FFO. Nareit defines FFO as net income attributable to common stockholders (computed in accordance with GAAP) excluding gains (or losses) from sales of real estate property, including gain (or loss) on re-measurement of equity method investments and impairment write-downs of depreciable real estate, plus real estate depreciation and amortization, and after adjustments for unconsolidated entities and noncontrolling interests. Adjustments for unconsolidated entities and noncontrolling interests will be calculated to reflect FFO on the same basis. We define Normalized FFO as Nareit FFO excluding the following income and expense items, without duplication: (a) gains and losses on derivatives, net and changes in the fair value of financial instruments; (b) the non-cash impact of income tax benefits or expenses; (c) gains and losses on extinguishment of debt, net including the write-off of unamortized deferred financing fees or additional costs, expenses, discounts, make-whole payments, penalties or premiums incurred as a result of early retirement or payment of our debt; (d) transaction, transition and restructuring costs; (e) amortization of other intangibles; (f) the non-cash impact of changes to our executive equity compensation plan; (g) net expenses or recoveries related to significant disruptive events; (h) the impact of expenses related to asset impairment and valuation allowances; (i) non-cash charges related to leases; (j) the financial impact of contingent consideration; (k) gains and losses on non-real estate dispositions and other normalizing items related to noncontrolling interests and unconsolidated entities; and (l) other items set forth in the Normalized FFO reconciliation included herein.\n55\nThe following table summarizes our FFO and Normalized FFO for the three years ended December 31, 2024, 2023, and 2022 (dollars in thousands): \n \nFor the Years Ended December 31,\n \n2024\n2023\n2022\nNet income (loss) attributable to common stockholders\n$\n81,153 \n$\n(40,973)\n$\n(47,447)\nAdjustments:\n \nDepreciation and amortization on real estate assets\n1,250,453 \n1,390,025 \n1,194,751 \nDepreciation on real estate assets related to noncontrolling interests\n(15,113)\n(16,657)\n(17,451)\nDepreciation on real estate assets related to unconsolidated entities\n49,170 \n44,953 \n30,940 \nGain on real estate dispositions\n(57,009)\n(62,119)\n(7,780)\nGain on real estate dispositions related to noncontrolling interests\n9 \n6,685 \n32 \nGain on real estate dispositions and other related to unconsolidated entities\n(3,216)\n(180)\n(14,546)\nNareit FFO attributable to common stockholders\n1,305,447 \n1,321,734 \n1,138,499 \nAdjustments:\n \n \n \nLoss (gain) on derivatives, net\n11,942 \n(32,076)\n23,615 \nNon-cash impact of income tax benefit\n(43,486)\n(15,269)\n(21,349)\nLoss (gain) on extinguishment of debt, net\n687 \n(6,104)\n581 \nTransaction, transition and restructuring costs\n20,369 \n15,215 \n30,884 \nAmortization of other intangibles\n400 \n385 \n385 \nNon-cash impact of changes to executive equity compensation plan\n180 \n161 \n(312)\nSignificant disruptive events, net\n8,230 \n(5,339)\n12,451 \n(Reversal of) allowance on loans receivable and investments, net\n(166)\n(20,270)\n19,757 \nNormalizing items related to noncontrolling interests and unconsolidated entities, net\n(2,012)\n(25,683)\n(18,233)\nOther normalizing items, net \n(1)\n$\n25,856 \n$\n(20,870)\n$\n20,693 \nNormalized FFO attributable to common stockholders\n$\n1,327,447 \n$\n1,211,884 \n$\n1,206,971 \n______________________________\n(1)\n    For the year ended December 31, 2024, primarily related to shareholder relations matters and certain legal matters. For the year ended December 31, 2023, primarily related to gain on foreclosure of real estate, payment obligation arising in connection with sale of real estate and certain legal matters. For the year ended December 31, 2022, primarily related to shareholder relations matters.\n56\nNOI\nWe also consider NOI an important supplemental measure because it allows investors, analysts and our management to assess our unlevered property-level operating results and to compare our operating results with those of other real estate companies and between periods on a consistent basis. We define NOI as total revenues, less interest and other income, property-level operating expenses and third-party capital management expenses.\nThe following table sets forth a reconciliation of net income attributable to common stockholders to NOI (dollars in thousands):\n \nFor the Years Ended December 31,\n \n2024\n2023\n2022\nNet income (loss) attributable to common stockholders\n$\n81,153 \n$\n(40,973)\n$\n(47,447)\nAdjustments:\n \n \n \nInterest and other income\n(28,114)\n(11,414)\n(3,635)\nInterest expense\n602,835 \n574,112 \n467,557 \nDepreciation and amortization\n1,253,143 \n1,392,461 \n1,197,798 \nGeneral, administrative and professional fees\n162,990 \n148,876 \n144,874 \nLoss (gain) on extinguishment of debt, net\n687 \n(6,104)\n581 \nTransaction, transition and restructuring costs\n20,369 \n15,215 \n30,884 \n(Reversal of) allowance on loans receivable and investments, net\n(166)\n(20,270)\n19,757 \nGain on foreclosure of real estate\n— \n(29,127)\n— \nShareholder relations matters\n15,751 \n— \n20,693 \nOther expense (income) \n49,584 \n(23,001)\n58,268 \nNet income attributable to noncontrolling interests\n7,198 \n10,676 \n6,516 \nIncome from unconsolidated entities\n(1,563)\n(13,626)\n(28,500)\nIncome tax benefit\n(37,775)\n(9,539)\n(16,926)\nGain on real estate dispositions\n(57,009)\n(62,119)\n(7,780)\nNOI \n$\n2,069,083 \n$\n1,925,167 \n$\n1,842,640 \n    \nSee “Results of Operations” for discussions regarding both NOI and same-store NOI. We define same-store as properties owned, consolidated and operational for the full period in both comparison periods and that are not otherwise excluded; provided, however, that we may include selected properties that otherwise meet the same-store criteria if they are included in substantially all of, but not a full, period for one or both of the comparison periods, and in our judgment such inclusion provides a more meaningful presentation of our segment performance.  \nNewly acquired development properties and recently developed or redeveloped properties in our SHOP reportable business segment will be included in same-store once they are stabilized for the full period in both periods presented. These properties are considered stabilized upon the earlier of (a) the achievement of 80% sustained occupancy or (b) 24 months from the date of acquisition or substantial completion of work. Recently developed or redeveloped properties in our OM&R and NNN reportable business segments will be included in same-store once substantial completion of work has occurred for the full period in both periods presented. Our SHOP and NNN that have undergone operator or business model transitions will be included in same-store once operating under consistent operating structures for the full period in both periods presented.  \nProperties are excluded from same-store if they are: (i) sold, classified as held for sale or properties whose operations were classified as discontinued operations in accordance with GAAP; (ii) impacted by significant disruptive events such as flood or fire; (iii) for SHOP, those properties that are currently undergoing a significant disruptive redevelopment; (iv) for OM&R and NNN reportable business segments, those properties for which management has an intention to institute, or has instituted, a redevelopment plan because the properties may require major property-level expenditures to maximize value, increase NOI, or maintain a market-competitive position and/or achieve property stabilization, most commonly as the result of an expected or actual material change in occupancy or NOI; or (v) for SHOP and NNN reportable business segments, those properties that are scheduled to undergo operator or business model transitions, or have transitioned operators or business models after the start of the prior comparison period.        \n57\nTo eliminate the impact of exchange rate movements, certain of our performance-based disclosures, including same-store NOI for SHOP and NNN, assume constant exchange rates across comparable periods, using the following methodology: the current period’s results are shown in actual reported USD, while prior comparison period’s results are adjusted and converted to USD based on the average monthly exchange rate for the current period.\nAsset/Liability Management\nAsset/liability management, a key element of enterprise risk management, is designed to support the achievement of our business strategy, while ensuring that we maintain appropriate and tolerable levels of market risk (primarily interest rate risk and foreign currency exchange risk) and credit risk. Effective management of these risks is a contributing factor to the absolute levels and variability of our FFO and net worth. The following discussion addresses our integrated management of assets and liabilities, including the use of derivative financial instruments.\nMarket Risk\nWe are primarily exposed to market risk related to changes in interest rates with respect to borrowings under our unsecured revolving credit facility, our unsecured term loans and our commercial paper program, certain of our mortgage loans that are variable rate obligations, mortgage loans receivable that bear interest at variable rates and available for sale securities. These market risks result primarily from changes in benchmark interest rates. To manage these risks, we continuously monitor our level of variable rate debt with respect to total debt and other factors, including our assessment of current and future economic conditions. See “Risk Factors—We are exposed to increases in interest rates, which could reduce our profitability and adversely impact our ability to refinance existing debt, sell assets or engage in acquisition, investment, development and redevelopment activity, and our decision to hedge against interest rate risk might not be effective” included in Part I, Item 1A of this Annual Report.\n58\nThe table below sets forth certain information with respect to our debt, excluding premiums and discounts (dollars in thousands):\nAs of December 31,\n2024\n2023\n2022\nBalance:\nFixed rate:\nSenior notes/Exchangeable senior notes\n$\n9,744,519\n$\n9,302,840\n$\n8,627,540\nUnsecured term loans\n400,000\n400,000\n200,000\nMortgage loans and other\n2,684,014\n2,755,988\n2,035,896\nSubtotal fixed rate\n12,828,533\n12,458,828\n10,863,436\nVariable rate:\nUnsecured revolving credit facility\n6,397\n14,006\n25,230\nUnsecured term loans\n300,000\n677,501\n669,031\nCommercial paper notes\n—\n—\n403,000\nMortgage loans and other\n483,872\n418,263\n400,547\nSubtotal variable rate\n790,269\n1,109,770\n1,497,808\nTotal\n$\n13,618,802\n$\n13,568,598\n$\n12,361,244\nPercentage of total debt:\nFixed rate:\nSenior notes/Exchangeable senior notes\n71.6 \n%\n68.6 \n%\n69.8 \n%\nUnsecured term loans\n2.9 \n2.9 \n1.6 \nMortgage loans and other\n19.7 \n20.3 \n16.5 \nVariable rate:\nUnsecured revolving credit facility\n— \n0.1 \n0.2 \nUnsecured term loans\n2.2 \n5.0 \n5.4 \nCommercial paper notes\n— \n— \n3.3 \nMortgage loans and other\n3.6 \n3.1 \n3.2 \nTotal\n100.0 \n%\n100.0 \n%\n100.0 \n%\nWeighted average interest rate at end of period:\nFixed rate:\nSenior notes/Exchangeable senior notes\n4.1 \n%\n3.8 \n%\n3.7 \n%\nUnsecured term loans\n4.7 \n4.7 \n3.6 \nMortgage loans and other\n4.3 \n4.2 \n3.7 \nVariable rate:\nUnsecured revolving credit facility\n5.3 \n6.1 \n4.5 \nUnsecured term loans\n5.3 \n6.3 \n5.5 \nCommercial paper notes\n— \n— \n4.7 \nMortgage loans and other\n5.1 \n6.1 \n5.1 \nTotal\n4.2 \n4.1 \n3.9 \nThe variable rate debt as of December 31, 2024 in the table above reflects, in part, the effect of $141.3 million notional amount of interest rate swaps with maturities in March 2027, that effectively convert fixed rate debt to variable rate debt. In addition, the fixed rate debt as of December 31, 2024 in the table above reflects, in part, the effect of $526.5 million and C$635.9 million notional amount of interest rate swaps with maturities ranging from February 2025 to April 2031, in each case, that effectively convert variable rate debt to fixed rate debt. See “Note 10 – Senior Notes Payable and Other Debt” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report.\nThe decrease in our outstanding variable rate debt as of December 31, 2024 compared to December 31, 2023 is primarily attributable to the repayment of a C$500.0 million ($369.4 million) unsecured term loan.\n59\nThe increase in our outstanding fixed rate debt from December 31, 2024 compared to December 31, 2023 was primarily attributable to net issuances of senior notes.\nAssuming a 100 basis point increase in the weighted average interest rate related to our consolidated variable rate debt and assuming no change in our consolidated variable rate debt outstanding as of December 31, 2024 of $0.8 billion, interest expense on an annualized basis would increase by approximately $7.9 million, or less than $0.02 per diluted common share. \nAs of December 31, 2024 and 2023, our joint venture partners’ aggregate share of total consolidated debt was $310.9 million and $297.5 million, respectively, with respect to certain properties we owned through consolidated joint ventures. \nTotal consolidated debt does not include our portion of unconsolidated debt related to investments in unconsolidated real estate entities, which was $676.8 million and $575.3 million as of December 31, 2024 and 2023, respectively.  \nThe fair value of our fixed rate debt is based on current market interest rates at which we could obtain similar borrowings. Increases in market interest rates typically result in a decrease in the fair value of fixed rate debt while decreases in market interest rates typically result in an increase in the fair value of fixed rate date. While changes in market interest rates affect the fair value of our fixed rate debt, these changes do not affect the interest expense associated with our fixed rate debt.  Therefore, interest rate risk does not have a significant impact on our fixed rate debt obligations until their maturity or earlier prepayment and refinancing. If interest rates have risen at the time we seek to refinance our fixed rate debt, whether at maturity or otherwise, our future earnings and cash flows could be adversely affected by additional borrowing costs. Conversely, lower interest rates at the time of refinancing may reduce our overall borrowing costs.\nTo highlight the sensitivity of our fixed rate debt to changes in interest rates, the following summary shows the effects of a hypothetical instantaneous change of 100 basis points in interest rates (dollars in thousands):\nAs of December 31,\n2024\n2023\nGross book value\n$\n12,828,533 \n$\n12,458,828 \nFair value\n12,620,797 \n11,994,321 \nFair value reflecting change in interest rates:\n-100 basis points\n13,078,684 \n12,457,648 \n+100 basis points\n12,158,222 \n11,568,461 \nAs of December 31, 2024 and 2023, the fair value of our secured and non-mortgage loans receivable, based on our estimates of currently prevailing rates for comparable loans, was $173.9 million and $53.1 million, respectively. See “Note 6 – Loans Receivable and Investments” and “Note 11 – Fair Values of Financial Instruments” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report.\nAs a result of our Canadian and United Kingdom operations, we are subject to fluctuations in certain foreign currency exchange rates that may, from time to time, affect our financial condition and operating performance. Based solely on our results for the year ended December 31, 2024 (including the impact of existing hedging arrangements), if the value of the U.S. dollar relative to the British pound and Canadian dollar were to increase or decrease by one standard deviation compared to the average exchange rate during the year, our Net Income and Normalized FFO for the year ended December 31, 2024 would decrease or increase by less than $0.01 per diluted common share. We will continue to mitigate these risks through a layered approach to hedging and continual assessment of our foreign operational capital structure. Nevertheless, we cannot assure you that any such fluctuations will not have an effect on our earnings.\nConcentration Risk\nWe use concentration ratios to identify, understand and evaluate the potential impact of economic downturns and other adverse events that may affect our asset types, geographic locations, business models, and managers, tenants and borrowers. We evaluate concentration risk in terms of investment mix and operations mix. Investment mix measures the percentage of our investments that is concentrated in a specific asset type or that is operated or managed by a particular manager, tenant or borrower. Operations mix measures the percentage of our operating results that is attributed to a particular manager, tenant, or borrower, geographic location or business model. \n60\nThe following tables reflect our concentration risk as of the dates and for the periods presented:\n \nAs of December 31,\n \n2024\n2023\nInvestment mix by asset type \n(1)\n:\n \n \nSenior housing communities\n67.3 \n%\n65.8 \n%\nOutpatient medical buildings\n19.7 \n20.4 \nResearch centers\n5.3 \n5.7 \nOther healthcare facilities\n4.5 \n4.8 \nInpatient rehabilitation facilities (“IRFs”) and long-term acute care facilities (“LTACs”)\n2.0 \n1.5 \nSkilled nursing facilities (“SNFs”)\n1.2 \n1.7 \nSecured loans receivable and investments, net\n— \n0.1 \nTotal\n100.0 \n%\n100.0 \n%\nInvestment mix by manager and tenant \n(1)\n:\n \n \nAtria \n21.0 \n%\n23.5 \n%\nSunrise\n9.9 \n9.0 \nLillibridge\n9.8 \n10.2 \nBrookdale\n6.6 \n7.7 \nLe Groupe Maurice\n6.4 \n7.0 \nWexford\n5.1 \n5.4 \nArdent\n4.9 \n5.1 \nKindred\n1.3 \n0.8 \nAll other\n35.0 \n31.3 \nTotal\n100.0 \n%\n100.0 \n%\n______________________________\n(1)\nRatios are based on the gross book value of consolidated real estate investments (excluding properties classified as held for sale, development properties not yet operational and land parcels) as of each reporting date.\n61\n \nFor the Years Ended December 31,\n \n2024\n2023\n2022\nOperations mix by manager and tenant and business model:\n \n \nRevenues \n(1)\n:\n \n \n \nSHOP\n68.5 \n%\n65.8 \n%\n64.3 \n%\nBrookdale \n(2)\n3.1 \n3.3 \n3.6 \nArdent \n(3)\n2.8 \n3.0 \n3.2 \nKindred\n2.8 \n2.9 \n3.2 \nAll others\n22.8 \n25.0 \n25.7 \nTotal\n100.0 \n%\n100.0 \n%\n100.0 \n%\nNet operating income (“NOI”):\n \nSHOP\n41.9 \n%\n37.0 \n%\n35.1 \n%\nBrookdale \n(2)\n7.2 \n7.7 \n8.1 \nKindred\n6.7 \n6.9 \n7.3 \nArdent \n(3)\n6.6 \n6.9 \n7.1 \nAll others\n37.6 \n41.5 \n42.4 \nTotal\n100.0 \n%\n100.0 \n%\n100.0 \n%\nOperations mix by geographic location \n(1)\n:\n \nCalifornia\n13.4 \n%\n13.6 \n%\n14.3 \n%\nNew York\n7.0 \n7.4 \n7.5 \nTexas\n6.6 \n6.5 \n6.6 \nQuebec, Canada\n5.9 \n6.0 \n6.2 \nIllinois\n4.9 \n4.4 \n4.3 \nAll others\n62.2 \n62.1 \n61.1 \nTotal\n100.0 \n%\n100.0 \n%\n100.0 \n%\n______________________________\n(1)\nRepresents percentage of total revenues which include third-party capital management revenues, income from loans and investments and interest and other income.  \n(2)\nResults exclude nine senior housing communities which are included in our SHOP segment.\n(3)\nResults exclude 19 outpatient medical buildings included in “All others.”\nSee “Non-GAAP Financial Measures” included elsewhere in this Annual Report for additional disclosure and reconciliations of net income attributable to common stockholders, as computed in accordance with GAAP, to NOI.\nWe derive a significant portion of our revenues by leasing assets under long-term triple-net leases in which the rental rate is generally fixed with escalators, subject to certain limitations. Some of our triple-net lease escalators are contingent upon the satisfaction of specified facility revenue parameters or based on increases in the Consumer Price Index (“CPI”), with caps, floors or collars. We also earn revenues directly from individual residents in our senior housing communities that are managed by operators, such as Atria, Sunrise and Le Groupe Maurice, and tenants in our outpatient medical buildings.\nThe concentration of our NNN segment revenues and operating income that are attributed to Brookdale, Ardent and Kindred creates credit risk. If any of Brookdale, Ardent or Kindred becomes unable or unwilling to satisfy its obligations to us or to renew its leases with us upon expiration of the terms thereof, our financial condition and results of operations could decline, and our ability to service our indebtedness and to make distributions to our stockholders could be impaired. See “Risk Factors—Risks Related to Our Business Operations and Strategy—A significant portion of our revenues and operating income is dependent on a limited number of managers and tenants, including Atria, Sunrise, Le Groupe Maurice, Brookdale, Ardent and Kindred” included in Part I, Item 1A of this Annual Report and “Note 3 – Concentration of Credit Risk” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report.\nWe regularly monitor and assess any changes in the relative credit risk associated with our significant tenant relationships. The ratios and metrics we use to evaluate the relative credit risk associated with those relationships depend on facts and circumstances specific to that relationship and may vary over time. Such ratios and metrics may include, without \n62\nlimitation, the credit history of, and the legal, regulatory or economic conditions affecting, any tenant, guarantor, obligor, or affiliated company associated with the tenant. Among other things, we may review and analyze information regarding the real estate, senior housing and healthcare industries generally, financial statements and other public or private information regarding any tenant, guarantor, obligor, or affiliated company.  From time to time we may also participate in discussions and in-person meetings with representatives of the significant tenant. Using this information, we calculate and review multiple financial ratios (which may, but do not necessarily, include, leverage, fixed charge coverage, rent coverage and other property level key performance indicators), including certain adjustments based on information provided by the tenant or required by the relevant reporting requirements and the expected future performance of the assets, tenants and guarantors.\nBecause Atria, Sunrise and Le Groupe Maurice manage our properties in exchange for the receipt of a management fee from us, we are not directly exposed to the credit risk of our managers in the same manner or to the same extent as our triple-net tenants. However, we rely on our managers’ personnel, expertise, technical resources and information systems, proprietary information, good faith and judgment to manage the senior housing communities’ operations efficiently and effectively. We also rely on Atria,  Sunrise and Le Groupe Maurice to set appropriate resident fees, to provide accurate property-level financials results in a timely manner and otherwise operate our senior housing communities in compliance with the terms of our management agreements and all applicable laws and regulations. Although we have various rights as the property owner under our management agreements, including various rights to terminate and exercise remedies under the agreements as provided therein, Atria’s. Sunrise’s or Le Groupe Maurice’s failure, inability or unwillingness to satisfy its respective obligations under those agreements, to efficiently and effectively manage our properties or to provide timely and accurate accounting information with respect thereto could have a Material Adverse Effect on us. See “Risk Factors—Risks Related to Our Business Operations and Strategy” included in Part I, Item 1A of this Annual Report.      \nTriple-Net Lease Performance and Expirations\nAny failure, inability or unwillingness by our tenants to satisfy their obligations under our triple-net leases could have a material adverse effect on us. Also, if our tenants are not able or willing to renew our triple-net leases upon expiration, we may be unable to reposition the applicable properties on a timely basis or on the same or better economic terms, if at all.  Although our lease expirations are staggered, the non-renewal of some or all of our triple-net leases that expire in any given year could have a material adverse effect on us. During the year ended December 31, 2024, we had no triple-net lease expirations that, in the aggregate, had a material impact on our financial condition or results of operations for that period. See “Risk Factors—Risks Related to Our Business Operations and Strategy—If we need to replace any of our managers or tenants, we may be unable to do so on as favorable terms, if at all, and we could be subject to delays, limitations and expenses, which could adversely affect our business, financial condition and results of operations” included in Part I, Item IA of this Annual Report.\n63\nTenant Lease Expirations\nThe following table summarizes our lease expirations in our OM&R and NNN segments over the next 10 years and thereafter, assuming that none of the tenants exercise any of their renewal or purchase options, as of December 31, 2024 (dollars in thousands):\nExpiration Year\n2025\n2026\n2027\n2028\n2029\n2030\n2031\n2032\n2033\n2034\nThereafter\nOM&R:\nSegment Properties \n426\n426\n426\n426\n426\n426\n426\n426\n426\n426\n426\nAnnualized Base Rent \n(1)\n72,314\n65,137\n85,516\n67,695\n70,060\n49,547\n32,347\n41,433\n33,067\n58,566\n42,790\n% of Segment Base Rent\n12 \n%\n11 \n%\n14 \n%\n11 \n%\n11 \n%\n8 \n%\n5 \n%\n7 \n%\n5 \n%\n9 \n%\n7 \n%\nNNN:\nSegment Properties \n174\n112\n98\n104\n101\n101\n96\n102\n99\n95\n160\nAnnualized Base Rent \n(1)(2)\n95,558\n41,513\n10,512\n45,669\n28,834\n113,130\n1,982\n5,803\n3,932\n16,040\n205,743\n% of Segment Base Rent\n17 \n%\n7 \n%\n2 \n%\n8 \n%\n5 \n%\n20 \n%\n— \n%\n1 \n%\n1 \n%\n3 \n%\n36 \n%\nTotal Annualized Base Rent\n167,872\n106,650\n96,027\n113,364\n98,894\n162,677\n34,329\n47,236\n36,999\n74,605\n248,533\n% of Total OM&R and NNN Base Rent\n14 \n%\n9 \n%\n8 \n%\n10 \n%\n8 \n%\n14 \n%\n3 \n%\n4 \n%\n3 \n%\n6 \n%\n21 \n%\n______________________________\n(1)\nAnnualized Base Rent (“ABR”) represents the annualized impact of the current period’s cash base rent at 100% share for consolidated entities. ABR does not include straight-line rental income, rent escalators, common area maintenance charges, the amortization of above / below market lease intangibles or other non-cash items. \n(2)\nThe expiration of ABR in 2025 includes rent associated with (a) 56 senior housing properties currently leased to Brookdale, 45 of which are intended to be converted to our SHOP segment on or after September 1, 2025 and (b) 3 LTACs currently leased to Kindred through April 2025.  The expiration of ABR in 2030 includes rent associated with 20 LTACs currently leased to Kindred.  The expiration of ABR in 2034 includes rent associated with 5 LTACs currently leased to Kindred.  The expiration of ABR Thereafter includes rent associated with 65 properties currently leased to Brookdale.  See “Risk Factors—Risks Related to Our Business Operations and Strategy—If we need to replace any of our managers or tenants, we may be unable to do so on as favorable terms, if at all, and we could be subject to delays, limitations and expenses, which could adversely affect our business, financial condition and results of operations” included in Part I, Item 1A of this Annual Report.\nLiquidity and Capital Resources\nOur principal sources of liquidity are cash flows from operations, proceeds from the issuance of debt and equity securities, borrowings under our unsecured revolving credit facility and commercial paper program, and proceeds from asset sales. \nFor the next 12 months, our principal liquidity needs are to: (i) fund operating expenses; (ii) meet our debt service requirements; (iii) repay maturing mortgage and other debt; (iv) fund acquisitions, investments and commitments and any development and redevelopment activities; (v) fund capital expenditures; and (vi) make distributions to our stockholders and unitholders, as required for us to continue to qualify as a REIT. \nDepending upon the availability of external capital, we believe our liquidity is sufficient to fund these uses of cash. \nWe expect that these liquidity needs generally will be satisfied by a combination of the following: cash flows from operations, cash on hand, debt assumptions and financings (including secured financings), issuances of debt and equity securities, dispositions of assets (including in whole or in part, through joint venture arrangements) and borrowings under our revolving credit facilities and commercial paper program. However, an inability to access liquidity through multiple capital sources concurrently could have a material adverse effect on us. \nOur material contractual obligations arising in the normal course of business primarily consist of long-term debt and related interest payments, and operating obligations which include ground lease obligations. During the year ended December 31, 2024, our material contractual obligations increased primarily due to net issuances of senior notes to pre-fund upcoming debt maturities. See “Note 10 – Senior Notes Payable and Other Debt” and “Note 14 – Commitments and Contingencies” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report for further information regarding our long-term debt obligations and operating obligations, respectively. \n64\nWe may, from time to time, seek to retire or purchase our outstanding indebtedness for cash or in exchange for equity securities in open market purchases, privately negotiated transactions or otherwise. Such repurchases or exchanges, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions, prospects for capital and other factors. The amounts involved may be material.\nLoans Receivable and Investments\nIn September 2024, we provided new secured debt financing of $109.0 million to the owner of a senior housing property, secured by the asset and with additional credit support. The loan provides us with a right of first offer to purchase the asset on certain terms and conditions. The loan has a 3-year term and bears interest at a variable rate based on one-month SOFR, subject to a floor of 4.50%, plus a spread of 5.75%, increasing to 6.00% commencing October 1, 2025.\nCredit Facilities, Commercial Paper, Unsecured Term Loans and Letters of Credit\nAs of December 31, 2024, we had $2.74 billion of undrawn capacity under our unsecured revolving credit facility with $6.4 million outstanding and an additional $0.8 million restricted to support outstanding letters of credit. We use our unsecured revolving credit facility to support our commercial paper program and for general corporate purposes. \nOur wholly-owned subsidiary, Ventas Realty, Limited Partnership (“Ventas Realty”), may issue from time to time unsecured commercial paper notes up to a maximum aggregate amount outstanding at any time of $1.0 billion. The notes are sold under customary terms in the U.S. commercial paper note market and are ranked pari passu with all of Ventas Realty’s other unsecured senior indebtedness. The notes are fully and unconditionally guaranteed by Ventas, Inc. As of December 31, 2024, we had no borrowings outstanding under our commercial paper program. \nVentas Realty has a $500.0 million unsecured term loan priced at Adjusted SOFR plus 0.85%, which is subject to adjustment based on Ventas Realty’s debt ratings. This term loan is fully and unconditionally guaranteed by Ventas, Inc. It matures in June 2027 and includes an accordion feature that permits Ventas Realty to increase the aggregate borrowings thereunder to up to $1.25 billion, subject to the satisfaction of certain conditions, including the receipt of additional commitments for such increase.\nVentas Realty has a $200.0 million unsecured term loan priced at Adjusted SOFR plus 0.85%, which is subject to adjustment based on Ventas Realty’s debt ratings. This term loan is fully and unconditionally guaranteed by Ventas, Inc. It matures in February 2027 and includes an accordion feature that permits Ventas Realty to increase the aggregate borrowings thereunder to up to $500.0 million, subject to the satisfaction of certain conditions, including the receipt of additional commitments for such increase.\nDuring the year ended December 31, 2024, we repaid a C$500.0 million ($369.4 million) unsecured term loan facility priced at Canadian Dollar Offered Rate (“CDOR”) plus 0.90% that would otherwise have matured in January 2025.\nAs of December 31, 2024, our $100.0 million uncommitted line for standby letters of credit had an outstanding balance of $15.4 million. The agreement governing the line contains certain customary covenants and, under its terms, we are required to pay a commission on each outstanding letter of credit at a fixed rate.\nExchangeable Senior Notes\nIn June 2023, Ventas Realty issued $862.5 million aggregate principal amount of its 3.75% Exchangeable Senior Notes due 2026 (the “Exchangeable Notes”) in a private placement. The Exchangeable Notes are senior, unsecured obligations of Ventas Realty and are fully and unconditionally guaranteed on an unsecured and unsubordinated basis by Ventas, Inc. The Exchangeable Notes bear interest at a rate of 3.75% per year, payable semi-annually in arrears on June 1 and December 1 of each year, beginning on December 1, 2023. The Exchangeable Notes mature on June 1, 2026, unless earlier exchanged, redeemed or repurchased. As of both December 31, 2024 and 2023, we had $862.5 million aggregate principal amount of the Exchangeable Notes outstanding with an effective interest rate of 4.62% inclusive of the impact of the amortization of issuance costs. For the years ended December 31, 2024 and 2023, we recognized $32.3 million and $17.8 million of contractual interest expense, respectively, and amortization of issuance costs of $6.8 million and $3.6 million, respectively, related to the Exchangeable Notes. Unamortized issuance costs of $10.3 million and $17.1 million as of December 31, 2024 and 2023 were recorded as an offset to Senior notes payable and other debt on our Consolidated Balance Sheets.\nThe Exchangeable Notes are exchangeable at an initial exchange rate of 18.2460 shares of our common stock per $1,000 principal amount of Exchangeable Notes (equivalent to an initial exchange price of approximately $54.81 per share of \n65\ncommon stock). The initial exchange rate is subject to adjustment, including in the event of the payment of a quarterly dividend in excess of $0.45 per share, but will not be adjusted for any accrued and unpaid interest. Upon exchange of the Exchangeable Notes, Ventas Realty will pay cash up to the aggregate principal amount of the Exchangeable Notes to be exchanged and pay or deliver (or cause to be delivered), as the case may be, cash, shares of common stock or a combination of cash and shares of common stock, at Ventas Realty’s election, in respect of the remainder, if any, of its exchange obligation in excess of the aggregate principal amount of the Exchangeable Notes being exchanged. Prior to the close of business on the business day immediately preceding March 1, 2026, the Exchangeable Notes will be exchangeable at the option of the noteholders only upon the satisfaction of specified conditions and during certain periods described in the indenture governing the Exchangeable Notes. On or after March 1, 2026, until the close of business on the business day immediately preceding the maturity date, the Exchangeable Notes will be exchangeable at the option of the noteholders at any time regardless of these conditions or periods.\nSenior Notes\nAs of December 31, 2024, we had outstanding $8.3 billion aggregate principal amount of senior notes issued by Ventas Realty, approximately $73.8 million aggregate principal amount of senior notes issued by Nationwide Health Properties, Inc. (“NHP”) and assumed by our subsidiary, Nationwide Health Properties, LLC (“NHP LLC”), as successor to NHP, in connection with our acquisition of NHP, and C$2.0 billion aggregate principal amount of senior notes issued by our subsidiary, Ventas Canada Finance Limited (“Ventas Canada”). All of the senior notes issued by Ventas Realty and Ventas Canada are unconditionally guaranteed by Ventas, Inc.\nWe may, from time to time, seek to retire or purchase our outstanding senior notes for cash or in exchange for equity securities in open market purchases, privately negotiated transactions or otherwise. Such repurchases or exchanges, if any, will depend on prevailing market conditions, our liquidity requirements, contractual restrictions, prospects for capital and other factors. The amounts involved may be material.\nThe indentures governing our outstanding senior notes require us to comply with various financial and other restrictive covenants. We were in compliance with all of these covenants at December 31, 2024.\nIn February 2024, Ventas Canada issued and sold C$650.0 million ($478.3 million) aggregate principal amount of 5.10% Senior Notes, Series J due 2029 in a private placement. The proceeds were primarily used to repay our C$500.0 million ($369.4 million) unsecured term loan facility due 2025.\nIn April and May 2024, we repaid $800.0 million senior notes consisting of $400.0 million aggregate principal amount of 3.50% Senior Notes due 2024 and $400.0 million aggregate principal amount of 3.75% Senior Notes due 2024 at maturity primarily with cash on hand and borrowings through our commercial paper program. \nIn April 2024, we repaid C$73.0 million ($53.4 million) aggregate principal amount of 2.80% Senior Notes, Series E due 2024 at maturity with cash on hand.\nIn May 2024, Ventas Realty issued and sold $500.0 million aggregate principal amount of 5.625% Senior Notes due 2034 in a registered public offering. The proceeds were primarily used to repay balances outstanding under our commercial paper program.\nIn September 2024, Ventas Realty issued and sold $550.0 million aggregate principal amount of 5.00% Senior Notes due 2035 in a registered public offering. We used the proceeds for general corporate purposes, including funding of acquisitions and the repayment of other indebtedness.\nIn September 2024, we repaid C$163.3 million ($120.8 million) aggregate principal amount of 4.125% Senior Notes due 2024 at maturity with cash on hand.\nIn January and February 2025, we repaid $450.0 million and $600.0 million aggregate principal amount of 2.65% Senior Notes due 2025 and aggregate principal amount of 3.50% Senior Notes due 2025, respectively, at maturity using cash on hand and borrowings through our commercial paper program.\nMortgages\nAt December 31, 2024, our consolidated aggregate principal amount of mortgage debt outstanding was $3.2 billion, of which our share was $2.9 billion.\n66\nUnder certain circumstances, contractual and legal restrictions, including those contained in the instruments governing our subsidiaries’ outstanding mortgage indebtedness, may restrict our ability to obtain cash from our subsidiaries for the purpose of meeting our debt service obligations, including our payment guarantees with respect to Ventas Realty’s and Ventas Canada’s senior notes. \nIn February 2024, we entered into a C$52.8 million ($39.1 million) fixed rate mortgage loan, which accrues interest at 4.644%, matures in 2029 and is secured by one senior housing community in Canada.\nIn April 2024, we entered into an aggregate C$103.0 million ($75.5 million) fixed rate mortgage loans, which accrue interest at a blended rate of 4.90%, mature in 2029 and are secured by two senior housing communities in Canada.\nIn May 2024, we entered into a $52.3 million fixed rate mortgage loan, which accrues interest at 6.02%, matures in 2034 and is secured by one outpatient medical building in California.\nDerivatives and Hedging\nIn the normal course of our business, interest rate fluctuations affect future cash flows under our variable rate debt obligations, loans receivable and marketable debt securities, and foreign currency exchange rate fluctuations affect our operating results. We follow established risk management policies and procedures, including the use of derivative instruments, to mitigate the impact of these risks.\nWe do not use derivative instruments for trading or speculative purposes, and we have a policy of entering into contracts only with major financial institutions based upon their credit ratings and other factors. When considered together with the underlying exposure that the derivative is designed to hedge, we do not expect that the use of derivatives in this manner would have any material adverse effect on our future financial condition or results of operations.\nWe enter into interest rate swaps in order to maintain a capital structure containing targeted amounts of fixed and variable-rate debt and manage interest rate risk. Interest rate swaps designated as cash flow hedges involve the receipt of variable amounts from a counterparty in exchange for our fixed-rate payments. These interest rate swap agreements are used to hedge the variable cash flows associated with variable-rate debt.\nPeriodically, we enter into and designate interest rate locks to partially hedge the risk of changes in interest payments attributable to increases in the benchmark interest rate during the period leading up to the probable issuance of fixed-rate debt. We designate our interest rate locks as cash flow hedges. Gains and losses when we settle our interest rate locks are amortized over the life of the related debt and recorded in Interest expense in our Consolidated Statements of Income.\nAs of December 31, 2024, our variable rate debt obligations of $0.8 billion reflect, in part, the effect of $141.3 million notional amount of interest rate swaps with maturities in March 2027, that effectively convert fixed rate debt to variable rate debt. \nAs of December 31, 2024, our fixed rate debt obligations of $12.8 billion reflect, in part, the effect of $526.5 million and C$635.9 million notional amount of interest rate swaps with maturities ranging from February 2025 to April 2031, in each case, that effectively convert variable rate debt to fixed rate debt. \n2024 Activity\nFrom June through September 2024, we entered into an aggregate $350.0 million treasury locks to hedge interest rate risk on future debt issuances. In September 2024, we terminated the treasury locks in conjunction with the issuance of the $550.0 million aggregate principal amount of 5.00% Senior Notes due 2035.\nCapital Stock\nIn February 2024, we entered into an amendment to our November 2021 ATM Sales Agreement, providing for an “at-the-market” equity offering program, pursuant to which we could sell, from time to time, up to $1.0 billion aggregate gross sales price of shares of our common stock (as amended, the “February 2024 ATM Program”). In September 2024, we terminated the February 2024 ATM Program and entered into an ATM Sales Agreement providing for the sale, from time to time, of up to $2.0 billion aggregate gross sales price of shares of our common stock (the “September 2024 ATM Program” and, together with the February 2024 ATM Program, the “ATM Programs”). The ATM Programs have allowed us to enter into forward sales agreements, as discussed below. By utilizing a forward sales agreement, we can secure a share price on the sale of \n67\nshares of our common stock at or shortly after the time the forward sales agreement becomes effective, while postponing the receipt of proceeds from the sale of shares until a future date.  As of December 31, 2024, the remaining amount available under our September 2024 ATM Program for future sales of common stock was $1.5 billion.\nDuring the year ended December 31, 2024, we issued 37.3 million shares of our common stock for gross proceeds of $2.2 billion, representing an average price of $58.38 per share, of which 3.4 million shares or approximately $201.1 million in gross proceeds remained unsettled with maturity in March 2026. During the year ended December 31, 2023, we issued 2.3 million shares of our common stock for gross proceeds of $110.4 million, representing an average price of $47.89 per share. There were no issuances of common stock for the year ended December 31, 2022. \nEquity Forward Sales Agreements\nEquity forward sales agreements generally have a maturity of one to two years. At any time during the term of an equity forward sales agreement, we may settle that equity forward sales agreement by delivery of physical shares of our common stock to the forward purchaser or, at our election, subject to certain exceptions, we may settle in cash or by net share settlement. The forward sales price we expect to receive upon settlement of outstanding equity forward sales agreements will be the initial forward price, net of commissions, established on or shortly after the effective date of the relevant equity forward sales agreement, subject to adjustments for accrued interest, the forward purchasers’ stock borrowing costs in excess of a certain threshold specified in the equity forward sales agreement, and certain fixed price reductions for expected dividends on our common stock during the term of the equity forward sales agreement. Our unsettled equity forward sales agreements are accounted for as equity instruments.\nIn January 2025, we entered into additional unsettled equity forward sales agreements for 0.8 million shares or approximately $49.8 million in gross proceeds with maturity in March 2026.\nDividends\nDuring 2024, we declared four dividends totaling $1.80 per share of our common stock, including a fourth quarter dividend of $0.45 per share. In order to continue to qualify as a REIT, we must make annual distributions to our stockholders of at least 90% of our REIT taxable income (excluding net capital gain). In addition, we will be subject to income tax at the regular corporate rate to the extent we distribute less than 100% of our REIT taxable income, including any net capital gains.  We intend to pay dividends greater than 100% of our taxable income, after the use of any net operating loss carryforwards, for 2025. \nWe expect that our cash flows will exceed our REIT taxable income due to depreciation and other non-cash deductions in computing REIT taxable income and that we will be able to satisfy the 90% distribution requirement. However, from time to time, we may not have sufficient cash on hand or other liquid assets to meet this requirement or we may decide to retain cash or distribute such greater amount as may be necessary to avoid income and excise taxation. If we do not have sufficient cash on hand or other liquid assets to enable us to satisfy the 90% distribution requirement, or if we desire to retain cash, we may borrow funds, issue additional equity securities, pay taxable stock dividends, if possible, distribute other property or securities or engage in a transaction intended to enable us to meet the REIT distribution requirements or any combination of the foregoing.\nCapital Expenditures\nFrom time to time, we engage in development and redevelopment activities within our reportable business segments and through our investments in unconsolidated entities. For example, we are party to certain agreements that commit us to develop properties funded through capital that we and, in certain circumstances, our joint venture partners provide. As of December 31, 2024, we had three active and committed projects pursuant to these agreements, including two projects that are unconsolidated. In addition, from time to time, we engage in redevelopment projects with respect to our existing senior housing communities, outpatient medical buildings and research centers to maximize the value, increase NOI, maintain a market-competitive position, achieve property stabilization or change the primary use of the property.\nThe terms of our triple-net leases generally obligate our tenants to pay all capital expenditures necessary to maintain and improve our triple-net leased properties. However, from time to time, we may fund the capital expenditures for our triple-net leased properties through loans or advances to the tenants, which may increase the amount of rent payable with respect to the properties in certain cases. We may also fund capital expenditures for which we may become responsible upon expiration of our triple-net leases or in the event that our tenants are unable or unwilling to meet their obligations under those leases. \n68\nWe expect that these liquidity needs generally will be satisfied by a combination of the following: cash flows from operations, cash on hand, debt assumptions and financings (including secured financings), issuances of debt and equity securities, dispositions of assets (in whole or in part through joint venture arrangements) and borrowings under our revolving credit facilities and commercial paper program.\nTo the extent that unanticipated capital expenditure needs arise or significant borrowings are required, our liquidity may be affected adversely. Our ability to borrow additional funds may be restricted in certain circumstances by the terms of the instruments governing our outstanding indebtedness.\nCash Flows\nThe following table sets forth our sources and uses of cash flows for the years ended December 31, 2024 and 2023 (dollars in thousands):\n \nFor the Years Ended\nDecember 31,\nChange\n \n2024\n2023\n$\n%\nCash, cash equivalents and restricted cash at beginning of year\n$\n563,462 \n$\n170,745 \n$\n392,717 \nnm\nNet cash provided by operating activities\n1,329,625 \n1,119,873 \n209,752 \n18.7 \nNet cash used in investing activities\n(2,377,089)\n(184,664)\n(2,192,425)\nnm\nNet cash provided by (used in) financing activities\n1,445,220 \n(543,749)\n1,988,969 \nnm\nEffect of foreign currency translation\n(3,985)\n1,257 \n(5,242)\nnm\nCash, cash equivalents and restricted cash at end of year\n$\n957,233 \n$\n563,462 \n$\n393,771 \n69.9 \n______________________________\nnm - not meaningful\nCash Flows from Operating Activities\nCash flows from operating activities increased $209.8 million during 2024 compared to the same period in 2023 primarily due to growth in our businesses and improvements to our working capital.\nCash Flows from Investing Activities\nCash flows used in investing activities increased $2.2 billion during 2024 compared to the same period in 2023 primarily due to a $1.9 billion increase in acquisition and a $122.6 million increase in investment in loans receivable in 2024.\nCash Flows from Financing Activities\nNet cash provided by financing activities increased $2.0 billion during 2024 compared to the same period in 2023 primarily due to a $1.9 billion increase in issuances of common stock.\nOff-Balance Sheet Arrangements\nWe own interests in certain unconsolidated entities as described in “Note 7 – Investments in Unconsolidated Entities.” Except in limited circumstances, our risk of loss is limited to our investment in the entities and any outstanding loans receivable. Further, we use financial derivative instruments to hedge interest rate and foreign currency exchange rate exposure. Finally, as of December 31, 2024, we had $16.3 million outstanding letters of credit obligations. \nCommitments and Contingencies\nThe information contained in “Note 14 – Commitments and Contingencies” of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this Annual Report is incorporated by reference into this Item 7.\n69\nGuarantor and Issuer Information - Registered Senior Notes\nVentas, Inc. has fully and unconditionally guaranteed the obligation to pay principal and interest with respect to the outstanding senior notes issued by our 100% owned subsidiary, Ventas Realty, that were issued in transactions registered under the Securities Act of 1933. No other Ventas entities are issuers or guarantors of debt securities registered under the Securities Act. \nUnder certain circumstances, contractual and legal restrictions, including those contained in the instruments governing our subsidiaries’ outstanding mortgage indebtedness, may restrict our ability to obtain cash from our subsidiaries for the purpose of meeting our debt service obligations, including Ventas Realty’s payment obligations and our payment guarantees with respect to Ventas Realty’s registered senior notes. \nVentas Realty is a direct, wholly owned subsidiary of Ventas, Inc. Excluding investments in subsidiaries, the assets, liabilities and results of operations of Ventas Realty and Ventas, Inc., on a combined basis, are not material to the consolidated financial position or consolidated results of operations of Ventas. Therefore, in accordance with Rule 13-01 of Regulation S-X, we have elected to exclude summarized financial information for the issuer and guarantor of our registered senior notes. \nPlease see “—Liquidity and Capital Resources” for a description of our outstanding senior notes and other debt obligations, including the registered senior notes described above.",
  "item2": null
}