{
  "item1": "December 31, 2024, 28 third-party managers operated all 629 properties SHOP segment behalf. following table provides information regarding significant SHOP manager concentration year ended December 31, 2024: Percentage Total NOI Percentage Segment Properties Atria Senior Living, Inc. Sunrise Senior Living, LLC properties SHOP segment managed Atria Senior Living, Inc. (together its subsidiaries, “Atria”), Sunrise Senior Living, LLC (together its subsidiaries, “Sunrise”) Le Group Maurice (together its subsidiaries, “Le Groupe Maurice”) accounted significant portion SHOP segment revenues NOI year ended December 31, 2024.",
  "item7": "SHOP OM&R NNN Interest other income Depreciation amortization General, administrative professional fees (Loss) gain extinguishment debt, net Transaction, transition restructuring costs Reversal allowance loans receivable investments, net Gain foreclosure real estate Shareholder relations matters Other (expense) income Loss before unconsolidated entities, real estate dispositions, income taxes noncontrolling interests Income unconsolidated entities Gain real estate dispositions Net income attributable noncontrolling interests Net income (loss) attributable common stockholders ______________________________ following table summarizes results operations SHOP segment December 31, 2024 (dollars thousands): Increase (Decrease) NOI NOI—SHOP: Resident fees services Less: Property-level operating expenses NOI Average Monthly Revenue Per Occupied Room Resident fees services include all amounts earned residents senior housing communities, such rental fees related resident leases, extended healthcare fees other ancillary service income. Property-level operating expenses related SHOP segment include labor, food, utilities, real estate taxes, insurance, repairs maintenance, marketing, management fees, supplies other costs operating properties. senior housing communities SHOP segment, occupancy generally reflects average operator-reported unit occupancy reporting period. Average monthly revenue per occupied room reflects average resident fees services per operator-reported occupied unit reporting period.",
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS Cautionary Statements Forward-Looking Statements Certain factors could affect future results ability achieve stated goals include, but not limited to: (a) exposure exposure managers, tenants borrowers complex evolving governmental policy, laws regulations, including relating healthcare, data privacy, cybersecurity, international trade environmental matters, impact such policies, laws regulations managers’, tenants’ borrowers’ business challenges expense associated complying such policies, laws regulations; (b) impact market, macroeconomic, general economic conditions fiscal policy us, managers, tenants borrowers areas which properties geographically concentrated, including changes elevated inflation, interest rates exchange rates, labor market dynamics rises unemployment, tightening lending standards reduced availability credit capital, events affect consumer confidence, occupancy rates resident fee revenues, actual perceived state real estate markets public private capital markets; (c) potential significant general commercial claims, legal actions, investigations, regulatory proceedings enforcement actions could subject us managers, tenants borrowers increased operating costs, uninsured liabilities, including fines other penalties, reputational harm significant operational limitations, including loss suspension moratoriums accreditations, licenses certificates need, suspension nonpayment new admissions, denial reimbursement, suspension, decertification exclusion federal, state foreign healthcare programs closure facilities communities; (d) reliance third-party managers tenants operate exert substantial control over properties they manage for, rent from, us, which limits control influence over such properties, operations performance; (e) reliance reliance managers, tenants borrowers financial, credit capital markets risk those markets may disrupted become constrained; (f) ability, ability managers, tenants borrowers, navigate trends impacting businesses industries which they operate, including ability respond impact U.S. political environment government funding reimbursement programs, financial condition business prospect managers, tenants borrowers; (g) ability achieve anticipated benefits synergies from, Note Regarding Third-Party Information Quarterly Report includes information been derived SEC filings been provided us tenants managers been derived SEC filings other publicly available information tenants managers. believe such information accurate sources which been obtained reliable."
}