{
  "source_file": "vtrs-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.       \nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis addresses material changes in the financial condition and results of operations of Viatris Inc. and subsidiaries for the periods presented. Unless context requires otherwise, the “Company,” “Viatris,” “our” or “we” refer to Viatris Inc. and its subsidiaries. \nThis discussion and analysis should be read in conjunction with the Consolidated Financial Statements, the related Notes to Consolidated Financial Statements and Management’s Discussion and Analysis of Financial Condition and Results of Operations included in Viatris’ 2024 Form 10-K, the unaudited interim financial statements and related Notes included in Part I — Item 1 of this Form 10-Q and our other SEC filings and public disclosures. The interim results of operations and comprehensive (loss) earnings for the three and nine months ended September 30, 2025, and cash flows for the nine months ended September 30, 2025 are not necessarily indicative of the results to be expected for the full fiscal year or any other future period. \nThis Form 10-Q contains “forward-looking statements”. These statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements may include, without limitation, statements about \nthe goals or outlooks with respect to the Company’s strategic initiatives and priorities, including but not limited to divestitures, acquisitions, strategic alliances, collaborations, or other potential transactions;\n the benefits and synergies of such divestitures, acquisitions, strategic alliances, collaborations, or other transactions, or restructuring programs; future opportunities for the Company and its products; and any other statements regarding the Company’s future operations, financial or operating results, capital allocation, dividend policy and payments, share repurchases, debt ratio and covenants, anticipated business levels, future earnings, planned activities, anticipated growth, market opportunities, strategies, competitions, commitments, confidence in future results, efforts to create, enhance or otherwise unlock value, and other expectations and targets for future periods. Forward-looking statements may often be identified by the use of words such as “will”, “may”, “could”, “should”, “would”, “project”, “believe”, “anticipate”, “expect”, “plan”, “estimate”, “forecast”, “potential”, “pipeline”, “intend”, “continue”, “target”, “seek” and variations of these words or comparable words. Because forward-looking statements inherently involve risks and uncertainties, actual future results may differ materially from those expressed or implied by such forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to:\n•\nthe possibility that the Company may not realize the intended benefits of, or achieve the intended goals or outlooks with respect to, its strategic initiatives and priorities (including divestitures, acquisitions, strategic alliances, collaborations, or other potential transactions) or accelerate its growth by building on the strength of its base business with an expanding portfolio of innovative, best-in-class, patent-protected assets; \n•\nthe possibility that the Company may be unable to achieve intended or expected benefits, goals, outlooks, synergies, growth opportunities and operating efficiencies in connection with divestitures, acquisitions, strategic alliances, collaborations, or other transactions, or restructuring programs, within the expected timeframes or at all;\n•\nthe ongoing risks and uncertainties associated with our recent divestitures; \n•\ngoodwill or impairment charges or other losses;\n•\nthe Company’s failure to achieve expected or targeted future financial and operating performance and results; \n•\nthe potential impact of natural or man-made disasters, public health outbreaks, epidemics, pandemics or social disruption in regions where we or our partners or suppliers operate; \n•\nactions and decisions of healthcare and pharmaceutical regulators;\n•\nchanges in relevant laws, regulations and policies and/or the application or implementation thereof, including but not limited to tax, healthcare and pharmaceutical laws, regulations and policies globally;\n•\nthe ability to attract, motivate and retain key personnel;\n•\nthe Company’s liquidity, capital resources and ability to obtain financing; \n•\nany regulatory, legal or other impediments to the Company’s ability to bring new products to market, including but not limited to “at-risk launches”; \n•\nproducts in development that receive regulatory approval may not achieve expected levels of market acceptance, efficacy or safety;\n•\nlonger review, response and approval times as a result of evolving regulatory priorities and reductions in personnel at health agencies;\n•\nsuccess of clinical trials and the Company’s or its partners’ ability to execute on new product opportunities and develop, manufacture and commercialize products; \n•\nany changes in or difficulties with the Company’s manufacturing facilities, including with respect to inspections, remediation and restructuring activities, supply chain or inventory or the ability to meet anticipated demand; \n•\nthe scope, timing and outcome of any ongoing legal proceedings, including government inquiries or investigations, and the impact of any such proceedings on the Company; \n•\nany significant breach of data security or data privacy or disruptions to our IT systems;\n•\nrisks associated with having significant operations globally; \n53\nTable of Contents\n•\nthe ability to protect intellectual property and preserve intellectual property rights;\n•\nchanges in third-party relationships; \n•\nthe effect of any changes in the Company’s or its partners’ customer and supplier relationships and customer purchasing patterns, including customer loss and business disruption being greater than expected following an adverse regulatory action, acquisition or divestiture; \n•\nthe impacts of competition, including decreases in sales or revenues as a result of the loss of market exclusivity for certain products; \n•\nchanges in the economic and financial conditions of the Company or its partners; \n•\nuncertainties regarding future demand, pricing and reimbursement for the Company’s products;\n•\nuncertainties and matters beyond the control of management, including but not limited to general political and economic conditions, potential for adverse impacts from future tariffs and trade restrictions, inflation rates and global exchange rates; and\n•\ninherent uncertainties involved in the estimates and judgments used in the preparation of financial statements, and the providing of estimates of financial measures, in accordance with U.S. GAAP and related standards or on an adjusted basis.\nFor more detailed information on the risks and uncertainties associated with Viatris, see the risks described in Part I, Item 1A in the 2024 Form 10-K, Part II, Item 1A of this Form 10-Q, and our other filings with the SEC. You can access Viatris’ filings with the SEC through the SEC website at www.sec.gov or through our website, and Viatris strongly encourages you to do so. Viatris routinely posts information that may be important to investors on our website at investor.viatris.com, and we use this website address as a means of disclosing material information to the public in a broad, non-exclusionary manner for purposes of the SEC’s Regulation Fair Disclosure (Reg FD). The contents of our website are not incorporated by reference in this Form 10-Q and shall not be deemed “filed” under the Securities Exchange Act of 1934, as amended. Viatris undertakes no obligation to update any statements herein for revisions or changes after the filing date of this Form 10-Q other than as required by law.\nCompany Overview\nViatris is a global healthcare company whose breadth and scale we believe make it uniquely positioned to address healthcare needs globally. With a mission to empower people worldwide to live healthier at every stage of life, Viatris supplies high-quality medicines to approximately 1 billion patients around the world each year. The Company has a global footprint, an extensive portfolio of medicines that is well-diversified across therapeutic areas, a one-of-a-kind global supply chain designed to reach more people when and where they need them, and the scientific expertise to address some of the world's most enduring health challenges.\nViatris’ executive management team is focused on ensuring that the Company is optimally structured and efficiently resourced to deliver sustainable value to patients, shareholders, customers and other key stakeholders. The Company operates in more than 165 countries and territories with more than 30,000 employees. The Company has 26 manufacturing and packaging sites worldwide, more than 1,400 approved molecules, and industry leading commercial, R&D, regulatory, manufacturing, legal and medical expertise. Viatris’ portfolio consists of generics (including complex products), globally recognized iconic brands, and an expanding portfolio of innovative medicines. Viatris is headquartered in the U.S., with global centers in Pittsburgh, Pennsylvania, Shanghai, China and Hyderabad, India.\nViatris has four reportable segments: Developed Markets, Greater China, JANZ, and Emerging Markets. The Company reports segment information on the basis of markets and geography, which reflects its focus on bringing its large and diversified portfolio of branded and generic products, including complex products, to people in markets everywhere. Our Developed Markets segment comprises our operations primarily in North America and Europe. Our Greater China segment includes our operations in mainland China, Taiwan and Hong Kong. Our JANZ segment consists of our operations in Japan, Australia and New Zealand. Our Emerging Markets segment encompasses our presence in more than 125 countries with developing markets and emerging economies including in Asia, Africa, Eastern Europe, Latin America and the Middle East as well as the Company’s ARV franchise. \nCertain Market and Industry Factors\nThe global pharmaceutical industry is a highly competitive and highly regulated industry. As a result, we face a number of industry-specific factors and challenges, which can significantly impact our results. The following discussion highlights some of these key factors and market conditions.\n54\nTable of Contents\nThe process of obtaining regulatory approval to manufacture and market new branded and generic pharmaceutical products is rigorous, time consuming, costly, and inherently unpredictable. Complex generic products are often more difficult, costly and time-consuming to receive regulatory approval and bring to market compared with commodity generic pharmaceutical products. Any delay in regulatory approval could impact the commercial or financial success of a product. Regulatory approval, if and when obtained, may be limited in scope. Even if regulatory approvals for new products are obtained, the success of those products is dependent upon market acceptance.\nGeneric products, particularly in the U.S., generally contribute most significantly to revenues and gross margins at the time of their launch, and even more so in periods of market exclusivity, or in periods of limited generic competition. As such, the timing of new product introductions can have a significant impact on the Company’s financial results. The entrance into the market of additional competition generally has a negative impact on the volume and pricing of the affected products. Additionally, pricing is often affected by factors outside of the Company’s control. Conversely, generic products generally experience less volatility over a longer period of time in Europe as compared to the U.S., primarily due to the role of government oversight of healthcare systems in the region. In addition, U.S. governmental agencies provide funding for certain products in our Emerging Markets region. We expect that any reduction in that funding will have a negative impact on our financial condition, results of operations or cash flows.\nFor branded products, the majority of the product’s commercial value is usually realized during the period in which the product has market exclusivity. In the U.S. and some other countries, when market exclusivity expires and generic versions of a product are approved and marketed, there can often be very substantial and rapid declines in the branded product’s sales. For example, generic entry for Amitiza® 24 μg may occur in Japan in June 2026 depending on the outcome of regulatory reviews of generic applications and patent litigation.\nCertain markets in which we do business outside of the U.S. have undergone government-imposed price reductions, and further government-imposed price reductions are expected in the future. Such measures, along with the tender systems discussed below, are likely to have a negative impact on sales and gross profit in these markets. However, government initiatives in certain markets that appear to favor generic products could help to mitigate this unfavorable effect by increasing rates of generic substitution and penetration.\nAdditionally, a number of markets in which we operate outside of the U.S. have implemented, or may implement, tender systems for generic pharmaceuticals in an effort to lower prices. Generally speaking, tender systems can have an unfavorable impact on sales and profitability. Under such tender systems, manufacturers submit bids that establish prices for generic pharmaceutical products. Upon winning the tender, the winning company will receive priority placement for a period of time. The tender system often results in companies underbidding one another by proposing low pricing in order to win the tender. Sales continue to be negatively affected by the impact of tender systems in certain countries.\nIn addition to the impact of competition, government pricing actions and other measures designed to reduce healthcare costs, our results of operations, cash flows and financial condition could also be affected by other risks of doing business internationally, including the impact of inflation, elections, geopolitical events, including the ongoing conflicts in the Middle East and between Russia and Ukraine and related trade controls, sanctions, supply chain disruptions and staffing challenges and other economic considerations, longer review, response and approval times as a result of evolving regulatory priorities and reductions in personnel at health agencies, the potential for adverse impacts from future tariffs and trade restrictions, foreign currency exchange fluctuations, public health epidemics, changes in intellectual property legal protections and other regulatory changes.\n55\nTable of Contents\nRecent Developments\nAcquisition of Aculys Pharma\nOn October 15, 2025, the Company acquired Aculys Pharma, a clinical stage biopharmaceutical company focused on commercializing innovative treatments for neurological conditions. Viatris received rights to develop and commercialize pitolisant and Spydia®, two assets in the CNS therapy area, further expanding Viatris' portfolio of innovative products in Japan. As part of the transaction, Viatris has acquired exclusive development and commercialization rights in Japan for pitolisant, a selective/inverse agonist of the histamine H3 receptor. The transaction also includes exclusive rights in Japan and certain other markets in the Asia-Pacific region for Spydia® Nasal Spray, which was approved in Japan in June 2025 for the treatment of status epilepticus. Under the terms of the acquisition agreement, the Company made a $35.0 million upfront payment to Aculys Pharma shareholders as consideration for the acquisition, with additional consideration contingent upon the achievement of specified regulatory and commercial milestones, and royalties on net sales. The transaction is expected to be accounted for as an asset acquisition, with the upfront payment expensed as \nAcquired IPR&D\n.\nGoodwill Impairment\nThe Company reviews goodwill for impairment annually on April 1st or more frequently if events or changes in circumstances indicate that the carrying value of goodwill may not be recoverable. During the first quarter of 2025, the Company experienced a sharp and sustained decline in its share price and significantly increased uncertainty and volatility in the geopolitical and economic environments in which the Company operates. As a result of these factors, the Company determined that a triggering event had occurred for each of its reporting units and performed an interim goodwill impairment test as of March 31, 2025.  \nThe Company also performed the annual goodwill impairment test as of April 1, 2025. There were no significant changes from the interim goodwill test performed at March 31, 2025 and the results were consistent with the interim goodwill impairment test. Also, no triggering events have been identified since the April 1, 2025 impairment test date.\nFor the March 31, 2025 interim goodwill impairment test, when compared to the prior year annual goodwill impairment test completed on April 1, 2024, the significantly increased uncertainty and volatility in the geopolitical and economic environments in which the Company operates increased the Company’s business risks, including, but not limited to, the potential for continued or additional drug pricing reduction pressures, general uncertainty related to timing of responses and approvals from the FDA resulting from evolving regulatory priorities and associated changes to the operations of the agency, and the potential for adverse impacts from future tariffs and trade restrictions. The negative impact of any or all of these factors could be material. The significant increase in business risks and uncertainty led to an increase in discount rate assumptions impacting all reporting units as compared to the April 1, 2024 annual goodwill impairment test. In the first quarter of 2025, the Company recorded a non-cash goodwill impairment charge of $2.9 billion as a result of the interim goodwill impairment test performed as of March 31, 2025.\nIndore Manufacturing Facility\nFollowing an inspection by the FDA at our oral finished dose manufacturing facility in Indore, India in 2024, the FDA has issued a warning letter, and an import alert related to this facility. The import alert affects 11 actively distributed products that will no longer be accepted into the U.S. until the warning letter is lifted. It makes exceptions, subject to certain conditions, for four products based on shortage concerns. Following discussions with the FDA, the Company does not expect additional product exceptions to be granted by the FDA.\nFollowing the substance of FDA’s original inspection observations, the Company immediately implemented a comprehensive remediation plan at the site. During 2025, we have made substantial progress on our initial remediation activities at the facility, including but not limited to related personnel actions. Additionally, we have engaged independent third-party subject matter experts to support the remediation plan. \nWe have been in regular communication with FDA during this process and will continue to work to ensure that the FDA is satisfied with the steps we have taken to resolve all the points raised. Our responses to the warning letter and import alert were submitted within the required time periods. The facility will be subject to a reinspection by the FDA. The timing of the reinspection will be determined by the FDA; however, we anticipate that the facility will be ready for reinspection in 2026.\n56\nTable of Contents\nWhile product continues to be shipped from the Indore facility to markets outside the U.S., as expected, we have also experienced a negative impact in other markets during 2025, including the ARV business in Emerging Markets and select generic products in Europe. \nThe estimated negative impact to third quarter 2025 total revenues versus the third quarter of 2024 was approximately $100 million and the estimated negative impact to total revenues for the nine months ended September 30, 2025 versus the nine months ended September 30, 2024 was approximately $400 million. We do not expect the negative impact to fourth quarter 2025 total revenues  and earnings from operations versus the fourth quarter of 2024 to be material.\nWe take very seriously our continued and comprehensive oversight of our entire manufacturing network. Patient safety remains our primary and unwavering focus. We will work closely with our customers to mitigate any possible supply disruptions and meet the needs of the patients we serve.\nAcquisition of Idorsia Products\nOn March 15, 2024, the Company acquired exclusive global development and commercialization rights to two Phase 3 assets from Idorsia, as well as the potential to add additional innovative assets in the future. Under the terms of the original agreements, the development programs and certain personnel for selatogrel and cenerimod were transferred to Viatris from Idorsia in exchange for an upfront payment to Idorsia of $350 million, potential contingent milestone payments (including $300 million payable upon the achievement of certain development and regulatory milestones, and $2.1 billion payable upon the achievement of certain tiered sales milestones), as well as potential contingent tiered sales royalties. Viatris has worldwide commercialization rights for both selatogrel and cenerimod (which excluded, for cenerimod only, Japan, South Korea and certain countries in the Asia-Pacific region). A joint development committee was formed to oversee the development of the ongoing Phase 3 programs through regulatory approval. The agreements also provided Viatris a right of first refusal and a right of first negotiation for certain other assets in Idorsia’s pipeline. Viatris and Idorsia are both contractually obligated to contribute to the development costs for both programs, which are expected to be incurred through 2026. \nOn February 25, 2025, in order to preserve the ongoing continuity of the development programs for selatogrel and cenerimod considering certain capital structuring steps announced by Idorsia to secure its ongoing operations, Viatris and Idorsia entered into a letter agreement to amend certain terms of the original agreements described above. Under the terms of the letter agreement, Viatris received additional territory rights in Japan, South Korea and certain other countries in the Asia-Pacific region for cenerimod, a $250 million reduction in contingent milestone payments, including $200 million of development milestones, and additional personnel to expedite transitioning the development programs to Viatris in exchange for Viatris assuming $100 million of Idorsia’s obligation to contribute to development costs. In addition, the joint development committee has been replaced with a transition committee to oversee the transition of both development programs to Viatris.\nThere are risks and uncertainties associated with the timely and successful completion of these programs, including but not limited to the high cost and uncertainty of conducting clinical trials (particularly with respect to new and/or complex or innovative drugs), obtaining approval by relevant regulatory bodies and our partner’s financial condition. Refer to Note 4 \nAcquisitions and Other Transactions\n included in Part I, Item 1 of this Form 10-Q for more information.\nShare Repurchase Program\nOn February 28, 2022, the Company announced that its Board of Directors had authorized a share repurchase program for the repurchase of up to $1.0 billion of the Company’s shares of common stock. The Company subsequently announced that on February 26, 2024, its Board of Directors authorized a $1.0 billion increase to the Company’s previously announced $1.0 billion share repurchase program. As a result, the Company’s share repurchase program now authorizes the repurchase of up to $2.0 billion of the Company’s shares of common stock. Such repurchases may be made from time-to-time at the Company’s discretion and effected by any means, including but not limited to, open market repurchases, pursuant to plans in accordance with Rules 10b5-1 or 10b-18 under the Exchange Act, privately negotiated transactions (including accelerated stock repurchase programs) or any combination of such methods as the Company deems appropriate. The program does not have an expiration date. The share repurchase program does not obligate the Company to acquire any particular amount of common stock.\n57\nTable of Contents\nDuring the three months ended September 30, 2025, the Company repurchased approximately 6.8 million shares of common stock at a cost of approximately $67.9 million. During the nine months ended September 30, 2025 and 2024, the Company repurchased approximately 45.6 million shares of common stock at a cost of approximately $418.3 million, and approximately 19.2 million shares of common stock at a cost of approximately $250 million, respectively, under the program. As of September 30, 2025, the Company had repurchased a total of approximately 86.1 million shares of common stock at a cost of approximately $918.3 million under the program. \nAdditionally, subsequent to September 30, 2025, the Company repurchased approximately 8.1 million shares of common stock at a cost of approximately $82.1 million, bringing the total shares of common stock repurchased under the program to approximately 94.2 million at a cost of approximately $1.00 billion, in each case through and including November 5, 2025.  \nFinancial Summary\nThe table below is a summary of the Company’s financial results for the three and nine months ended September 30, 2025 compared to the prior year period:\nThree Months Ended\nSeptember 30,\n(In millions, except per share amounts)\n2025\n2024\nChange\nTotal revenues\n$\n3,759.9 \n$\n3,751.2 \n$\n8.7 \nGross profit\n1,371.5 \n1,459.2 \n(87.7)\nEarnings from operations\n178.8 \n225.9 \n(47.1)\nNet (loss) earnings\n(128.2)\n94.8 \n(223.0)\nDiluted (loss) earnings per share \n$\n(0.11)\n$\n0.08 \n$\n(0.19)\nNine Months Ended\nSeptember 30,\n(In millions, except per share amounts)\n2025\n2024\nChange\nTotal revenues\n$\n10,596.3 \n$\n11,211.2 \n$\n(614.9)\nGross profit\n3,865.6 \n4,408.6 \n(543.0)\n(Loss) earnings from operations\n(2,470.4)\n189.9 \n(2,660.3)\nNet loss\n(3,174.8)\n(117.7)\n(3,057.1)\nDiluted loss per share\n$\n(2.70)\n$\n(0.10)\n$\n(2.60)\nA detailed discussion of the Company’s financial results can be found below in the section titled “Results of Operations.” As part of this discussion, we also report sales performance using the non-GAAP financial measures of “constant currency” net sales and total revenues. These measures provide information on the change in net sales and total revenues assuming that foreign currency exchange rates had not changed between the prior and current period. The comparisons presented at constant currency rates reflect comparative local currency sales at the prior year’s foreign exchange rates. We routinely evaluate our net sales and total revenues performance at constant currency so that sales results can be viewed without the impact of foreign currency exchange rates, thereby facilitating a period-to-period comparison of our operational activities, and believe that this presentation also provides useful information to investors for the same reason.\nMore information about non-GAAP measures used by the Company as part of this discussion, including adjusted cost of sales, adjusted gross margins, adjusted EBITDA, adjusted net earnings, and adjusted EPS (all of which are defined below) can be found in “Item 2. \nManagement’s Discussion and Analysis of Financial Condition\n \nand\n \nResults of Operations - Use of Non-GAAP Financial Measures.\n”\n58\nTable of Contents\nResults of Operations\nThree Months Ended September 30, 2025 Compared to Three Months Ended September 30, 2024\nThree Months Ended\nSeptember 30,\n(In millions, except %s)\n2025\n2024\n% Change\n2025 Currency Impact \n(1)\n2025 Constant Currency Revenues\nConstant Currency % Change \n(2)\nNet sales\nDeveloped Markets \n(3)\n$\n2,255.6 \n$\n2,298.7 \n(2)\n%\n$\n(76.0)\n$\n2,179.6 \n(5)\n%\nGreater China\n615.2 \n561.8 \n10 \n%\n(2.3)\n612.9 \n9 \n%\nJANZ\n306.3 \n344.3 \n(11)\n%\n4.3 \n310.6 \n(10)\n%\nEmerging Markets\n570.4 \n533.2 \n7 \n%\n(2.4)\n568.0 \n7 \n%\nTotal net sales\n$\n3,747.5 \n$\n3,738.0 \n— \n%\n$\n(76.4)\n$\n3,671.1 \n(2)\n%\nOther revenues \n(4)\n12.4 \n13.2 \nNM\n(0.3)\n12.1 \nNM\nConsolidated total revenues \n(3)(5)\n$\n3,759.9 \n$\n3,751.2 \n— \n%\n$\n(76.7)\n$\n3,683.2 \n(2)\n%\n____________\n(1)\nCurrency impact is shown as unfavorable (favorable).\n(2)\nThe constant currency percentage change is derived by translating net sales or revenues for the current period at prior year comparative period exchange rates, and in doing so shows the percentage change from 2025 constant currency net sales or revenues to the corresponding amount in the prior year.\n(3)\nReductions were driven primarily by the Indore Impact.\n(4)\nFor the three months ended September 30, 2025, other revenues in Developed Markets, JANZ, and Emerging Markets were approximately $10.0 million, $1.0 million, and $1.4 million, respectively.\n(5)\nAmounts exclude intersegment revenue which eliminates on a consolidated basis.\nTotal Revenues\nFor the three months ended September 30, 2025, Viatris reported total revenues of $3.76 billion, compared to $3.75 billion for the comparable prior year period, representing an increase of $8.7 million, or essentially flat. Total revenues include both net sales and other revenues from third parties. Net sales for the current quarter were $3.75 billion, compared to $3.74 billion for the comparable prior year period, representing an increase of $9.5 million, or essentially flat. Other revenues for the current quarter were $12.4 million, compared to $13.2 million for the comparable prior year period.\nNet sales decreased by approximately $18.6 million, or less than 1%, due to the inclusion of net sales in the prior year period related to divestitures that closed during 2024. The favorable impact of foreign currency translation was approximately $76.4 million, or 2%, primarily reflecting changes in the U.S. Dollar as compared to the currencies of subsidiaries in the EU. On a constant currency basis, net sales from the remaining business decreased by approximately $48.3 million, or 1%, for the three months ended September 30, 2025 compared to the prior year period. The decrease was the result of net base business erosion of approximately $147.8 million, of which approximately $100 million related to the Indore Impact. This decrease was partially offset by new product sales, primarily in Developed Markets, of approximately $99.5 million. New product sales include new products launched in 2025 and the carryover impact of new products, including business development, launched within the last twelve months. \nFrom time to time, a limited number of our products may represent a significant portion of our net sales, gross profit and net earnings. Generally, this is due to the timing of new product introductions, seasonality, and the amount, if any, of additional competition in the market. Our top ten products in terms of net sales, in the aggregate, represented approximately 38% and 36% for the three months ended September 30, 2025 and 2024, respectively. \nNet sales are derived from our four reporting segments: Developed Markets, Greater China, JANZ, and Emerging Markets. \n59\nTable of Contents\nDeveloped Markets Segment\nNet sales from Developed Markets decreased by $43.1 million, or 2%, for the three months ended September 30, 2025 when compared to the prior year period. Net sales decreased by approximately $11.1 million, or less than 1%, due to the inclusion of net sales in the prior year period related to divestitures that closed during 2024. The favorable impact of foreign currency translation was approximately $76.0 million, or 3%. Constant currency net sales from the remaining business decreased by approximately $108.0 million, or 5%, when compared to the prior year period, driven primarily by lower net sales of certain existing products, including lenalidomide and everolimus in the U.S., as a result of the Indore Impact of approximately $100 million, partially offset by new product sales. Net sales within North America totaled approximately $868.4 million and net sales within Europe totaled approximately $1.39 billion. \nGreater China Segment\nNet sales from Greater China increased by $53.4 million, or 10%, for the three months ended September 30, 2025 when compared to the prior year period. The favorable impact of foreign currency translation was approximately $2.3 million, or less than 1%. Constant currency net sales increased by approximately $51.1 million, or 9%, when compared to the prior year period, primarily driven by strong growth across multiple channels, including e-commerce, retail, and private hospitals, as well as benefits of timing of customer purchasing patterns. Divestitures did not have a significant impact on the net sales in either period and the Indore Impact for the three months ended September 30, 2025 was not significant.\nJANZ Segment\nNet sales from JANZ decreased by $38.0 million, or 11%, for the three months ended September 30, 2025 when compared to the prior year period. Net sales decreased by approximately $3.2 million, or 1%, due to the inclusion of net sales in the prior year period related to divestitures that closed during 2024. The unfavorable impact of foreign currency translation was approximately $4.3 million, or 1%. Constant currency net sales from the remaining business decreased by approximately $30.5 million, or 9%, when compared to the prior year period, driven primarily by lower net sales of existing products in Japan and Australia due to government price reductions and additional competition. The Indore Impact for the three months ended September 30, 2025 was not significant. \nEmerging Markets Segment\nNet sales from Emerging Markets increased by $37.2 million or 7% for the three months ended September 30, 2025 when compared to the prior year period. Net sales decreased by approximately $4.3 million, or 1%, due to the inclusion of net sales in the prior year period related to divestitures that closed during 2024. The favorable impact of foreign currency translation was approximately $2.4 million, or less than 1%. Constant currency net sales from the remaining business increased by $39.1 million, or 7%, when compared to the prior year period, primarily driven by higher volumes and pricing of existing products in certain Middle Eastern and Asian countries. The Indore Impact for the three months ended September 30, 2025 was not significant.\nCost of Sales and Gross Profit\nCost of sales increased from $2.29 billion for the three months ended September 30, 2024 to $2.39 billion for the three months ended September 30, 2025. The increase in cost of sales was largely driven by product mix as a result of the Indore Impact\n. \nGross profit for the three months ended September 30, 2025 was $1.37 billion and gross margins were 36%. For the three months ended September 30, 2024, gross profit was $1.46 billion and gross margins were 39%. The changes in gross profit and gross margins are primarily related to the Indore Impact. Adjusted gross margins were approximately 56% for the three months ended September 30, 2025, compared to approximately 58% for the three months ended September 30, 2024. \n60\nTable of Contents\nA reconciliation between cost of sales, as reported under U.S. GAAP, and adjusted cost of sales and adjusted gross margin for the three months ended September 30, 2025 compared to the three months ended September 30, 2024 is as follows:\nThree Months Ended\nSeptember 30,\n(In millions, except %s)\n2025\n2024\nU.S. GAAP cost of sales\n$\n2,388.4 \n$\n2,292.0 \nDeduct:\nPurchase accounting amortization and other related items\n(605.8)\n(586.2)\nAcquisition and divestiture-related costs\n(23.6)\n(18.8)\nRestructuring costs\n(13.4)\n(82.7)\nShare-based compensation expense\n(0.7)\n(0.8)\nOther special items, including restructuring related costs\n(89.4)\n(45.2)\nAdjusted cost of sales\n$\n1,655.5 \n$\n1,558.3 \nAdjusted gross profit \n(a)\n$\n2,104.4 \n$\n2,192.9 \nAdjusted gross margin \n(a)\n56 \n%\n58 \n%\n____________\n(a)\nAdjusted gross profit is calculated as total revenues less adjusted cost of sales. Adjusted gross margin is calculated as adjusted gross profit divided by total revenues.\nOperating Expenses\nResearch and Development Expense\nR&D expense for the three months ended September 30, 2025 was $250.4 million, compared to $198.4 million for the comparable prior year period, an increase of $52.0 million. This increase was primarily the result of higher expenses for the selatogrel and cenerimod development programs. \nSelling, General and Administrative Expense\nSG&A expense for the current quarter was $886.6 million, compared to $1.00 billion for the comparable prior year period, a decrease of $116.8 million. The decrease was primarily due to lower acquisition and divestiture-related costs of approximately $67.3 million and lower restructuring costs of approximately $18.1 million.\n \nLitigation Settlements and Other Contingencies, Net\nThe following table includes the losses recognized in litigation settlements and other contingencies, net during the three months ended September 30, 2025 and 2024, respectively:\nThree Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\nContingent consideration adjustment\n$\n21.1 \n$\n26.8 \nLitigation settlements, net\n34.6 \n4.7 \nTotal litigation settlements and other contingencies, net\n$\n55.7 \n$\n31.5 \nRefer to Note 4 \nAcquisitions and Other Transactions\n and Note 11 \nFinancial Instruments and Risk Management\n included in Part I, Item 1 of this Form 10-Q for more information with respect to the contingent consideration adjustment.\nAlso refer to Note 17 \nLitigation\n included in Part I, Item 1 of this Form 10-Q for more information on litigation settlements, net.\n61\nTable of Contents\nInterest Expense\nInterest expense for the three months ended September 30, 2025 totaled $119.6 million, compared to $145.6 million for the three months ended September 30, 2024, a decrease of $26.0 million. The decrease was primarily due to the impact of 2024 debt repayments.\nOther Expense (Income), Net\n \nOther expense (income), net includes gains and losses from divestitures of businesses, changes in the fair value of equity securities, extinguishment of debt, foreign exchange, expense (income) related to post-employment benefit plans, TSA income, and interest and dividend income. Other expense, net for the three months ended September 30, 2025 totaled $67.1 million, compared to $10.2 million for the three months ended September 30, 2024. \nThe increase in other expense, net was primarily driven by a loss of $100.0 million recorded in the current year period as a result of changes in the fair value of the CCPS in Biocon Biologics, compared to a gain in the prior year period of $39.4 million, lower interest income of $25.9 million, and lower TSA income of $21.0 million. This was partially offset by a decrease in loss on divestitures of $108.9 million compared to the prior year period. Refer to Note 11 \nFinancial Instruments and Risk Management\n included in Part I, Item 1 of this Form 10-Q for more information with respect to the change in the fair value of the CCPS in Biocon Biologics.\nIncome Tax Provision (Benefit)\nFor the three months ended September 30, 2025, the Company recognized an income tax provision of $120.3 million, compared to an income tax benefit of $4.3 million for the comparable prior year period, a change of $124.6 million. The provision in the current year period is primarily driven by reduced tax benefits related to certain remediation costs as well as certain discrete tax items. The current quarter and prior quarter provisions were impacted by the levels of income and the changing mix at which it is earned in jurisdictions with differing tax rates.\nNine Months Ended\n September 30, 2025 Compared to \nNine Months Ended\n September 30, 2024\nNine Months Ended\nSeptember 30,\n(In millions, except %s)\n2025\n2024\n% Change\n2025 Currency Impact \n(1)\n2025 Constant Currency Revenues\nConstant Currency % Change \n(2)\nNet sales\nDeveloped Markets \n(3)\n$\n6,266.6 \n$\n6,783.3 \n(8)\n%\n$\n(103.6)\n$\n6,163.0 \n(9)\n%\nGreater China\n1,759.6 \n1,644.7 \n7 \n%\n9.4 \n1,769.0 \n8 \n%\nJANZ\n888.1 \n1,011.7 \n(12)\n%\n11.8 \n899.9 \n(11)\n%\nEmerging Markets \n(3)\n1,645.4 \n1,737.7 \n(5)\n%\n29.6 \n1,675.0 \n(4)\n%\nTotal net sales\n$\n10,559.7 \n$\n11,177.4 \n(6)\n%\n$\n(52.8)\n$\n10,506.9 \n(6)\n%\nOther revenues \n(4)\n36.6 \n33.8 \nNM\n(0.5)\n36.1 \nNM\nConsolidated total revenues \n(3)(5)\n$\n10,596.3 \n$\n11,211.2 \n(5)\n%\n$\n(53.3)\n$\n10,543.0 \n(6)\n%\n____________\n(1)\nCurrency impact is shown as unfavorable (favorable).\n(2)\nThe constant currency percentage change is derived by translating net sales or revenues for the current period at prior year comparative period exchange rates, and in doing so shows the percentage change from 2025 constant currency net sales or revenues to the corresponding amount in the prior year.\n(3)\nReductions were driven primarily by the inclusion of net sales in the prior year period related to divestitures that closed during 2024 and the Indore Impact.\n62\nTable of Contents\n(4)\nFor the nine months ended September 30, 2025, other revenues in Developed Markets, JANZ, and Emerging Markets were approximately $27.2 million, $3.0 million, and $6.4 million, respectively.\n(5)\nAmounts exclude intersegment revenue which eliminates on a consolidated basis.\nTotal Revenues \nFor the nine months ended September 30, 2025, Viatris reported total revenues of $10.60 billion, compared to $11.21 billion for the comparable prior year period, representing a decrease of $614.9 million, or 5%. Total revenues include both net sales and other revenues from third parties. Net sales for the nine months ended September 30, 2025 were $10.56 billion, compared to $11.18 billion for the comparable prior year period, representing a decrease of $617.7 million, or 6%. Other revenues for the nine months ended September 30, 2025 were $36.6 million, compared to $33.8 million for the comparable prior year period.\nNet sales decreased by approximately $468.3 million, or 4%, due to the inclusion of net sales in the prior year period related to divestitures that closed during 2024. The favorable impact of foreign currency translation was approximately $52.8 million, or less than 1%, primarily reflecting changes in the U.S. Dollar as compared to the currencies of subsidiaries in the EU. On a constant currency basis, net sales from the remaining business decreased by approximately $202.2 million, or 2%, for the nine months ended September 30, 2025 compared to the prior year period. The decrease was the result of net base business erosion of approximately $448.1 million, of which approximately $400 million related to the Indore Impact. This decrease was partially offset by new product sales, primarily in Developed Markets, of approximately $245.9 million. New product sales include new products launched in 2025 and the carryover impact of new products, including business development, launched within the last twelve months. \nFrom time to time, a limited number of our products may represent a significant portion of our net sales, gross profit and net earnings. Generally, this is due to the timing of new product introductions, seasonality, and the amount, if any, of additional competition in the market. Our top ten products in terms of net sales, in the aggregate, represented approximately 37% and 33% for the nine months ended September 30, 2025 and 2024, respectively. \nNet sales are derived from our four reporting segments: Developed Markets, Greater China, JANZ, and Emerging Markets.\nDeveloped Markets Segment\nNet sales from Developed Markets decreased by $516.7 million, or 8%, for the nine months ended September 30, 2025 when compared to the prior year period. Net sales decreased by approximately $365.6 million, or 5%, due to the inclusion of net sales in the prior year period related to divestitures that closed during 2024. The favorable impact of foreign currency translation was approximately $103.6 million, or 2%. Constant currency net sales from the remaining business decreased by approximately $254.7 million, or 4%, when compared to the prior year period, driven primarily by lower net sales of certain existing products, including lenalidomide and everolimus in the U.S., as a result of the Indore Impact of approximately $295 million, partially offset by new product sales. Net sales within North America totaled approximately $2.54 billion and net sales within Europe totaled approximately $3.73 billion. \nGreater China Segment\nNet sales from Greater China increased by $114.9 million, or 7%, for the nine months ended September 30, 2025 when compared to the prior year period. The unfavorable impact of foreign currency translation was approximately $9.4 million, or 1%. Constant currency net sales increased by approximately $124.8 million, or 8%, when compared to the prior year period, primarily driven by strong growth across multiple channels, including e-commerce, retail, and private hospitals, as well as benefits of timing of customer purchasing patterns. Divestitures did not have a significant impact on the net sales in either period and the Indore Impact for the nine months ended September 30, 2025 was not significant.\nJANZ Segment\nNet sales from JANZ decreased by $123.6 million, or 12%, for the nine months ended September 30, 2025 when compared to the prior year period. Net sales decreased by approximately $24.0 million, or 2%, due to the inclusion of net sales in the prior year period related to divestitures that closed during 2024. This decrease was also partially driven by the unfavorable impact of foreign currency translation of approximately $11.8 million, or 1%. Constant currency net sales from the \n63\nTable of Contents\nremaining business decreased by approximately $87.8 million, or 9%, when compared to the prior year period, driven primarily by lower net sales of existing products in Japan and Australia due to government price reductions and additional competition, and by the Indore Impact of approximately $8 million. \nEmerging Markets Segment\nNet sales from Emerging Markets decreased by $92.3 million, or 5%, for the nine months ended September 30, 2025 when compared to the prior year period. Net sales decreased by approximately $78.2 million, or 5%, due to the inclusion of net sales in the prior year period related to divestitures that closed during 2024. The decrease in net sales was also partially driven by the unfavorable impact of foreign currency translation of approximately $29.6 million, or 2%. Constant currency net sales from the remaining business increased by $15.5 million, or 1%, when compared to the prior year period, primarily driven by new product sales in certain Latin American countries and higher volumes and pricing of existing products in certain Middle Eastern and Asian countries. These increases were partially offset by lower volumes in our ARV business, mainly as a result of the Indore Impact of approximately $95 million.\nCost of Sales and Gross Profit\nCost of sales decreased from $6.80 billion for the nine months ended September 30, 2024 to $6.73 billion for the nine months ended September 30, 2025. The decrease in cost of sales was largely driven by the impact of the decrease in net sales, primarily as a result of the divestitures that closed during 2024 and the Indore Impact\n. \nGross profit for the nine months ended September 30, 2025 was $3.87 billion and gross margins were 36%. For the nine months ended September 30, 2024, gross profit was $4.41 billion and gross margins were 39%. The changes in gross profit and gross margins are primarily related to the impact of the divestitures and the Indore Impact. Adjusted gross margins were approximately 56% for the nine months ended September 30, 2025, compared to approximately 58% for the nine months ended September 30, 2024. \nA reconciliation between cost of sales, as reported under U.S. GAAP, and adjusted cost of sales and adjusted gross margin for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024 is as follows:\nNine Months Ended\nSeptember 30,\n(In millions, except %s)\n2025\n2024\nU.S. GAAP cost of sales\n$\n6,730.7 \n$\n6,802.6 \nDeduct:\nPurchase accounting amortization and other related items\n(1,787.1)\n(1,907.6)\nAcquisition and divestiture-related costs\n(62.2)\n(42.1)\nRestructuring costs\n(44.5)\n(98.3)\nShare-based compensation expense\n(2.9)\n(2.5)\nOther special items, including restructuring related costs\n(190.1)\n(92.5)\nAdjusted cost of sales\n$\n4,643.9 \n$\n4,659.6 \nAdjusted gross profit \n(a)\n$\n5,952.4 \n$\n6,551.6 \nAdjusted gross margin \n(a)\n56 \n%\n58 \n%\n____________\n(a)\nAdjusted gross profit is calculated as total revenues less adjusted cost of sales. Adjusted gross margin is calculated as adjusted gross profit divided by total revenues.\n64\nTable of Contents\nOperating Expenses\nResearch and Development Expense\nR&D expense for the nine months ended September 30, 2025 was $691.2 million, compared to $602.2 million for the comparable prior year period, an increase of $89.0 million. This increase was primarily the result of higher expenses for the selatogrel and cenerimod development programs.\nAcquired IPR&D\nAcquired IPR&D expense for the nine months ended September 30, 2025 was $10.0 million, compared to $(1.7) million for the comparable prior year period, an increase of $11.7 million. The current period expense is related to an upfront licensing payment for rights to cenerimod in Japan, South Korea and certain countries in the Asia-Pacific region.\nSelling, General and Administrative Expense\nSG&A expense for the nine months ended September 30, 2025 was $2.76 billion, compared to $3.06 billion for the comparable prior year period, a decrease of $294.5 million. The decrease was primarily due to the impact of the divestitures, and lower acquisition and divestiture-related costs of approximately $176.2 million. These decreases were partially offset by higher restructuring costs of approximately $44.1 million.\nImpairment of Goodwill\nThe Company performed an interim goodwill impairment test as of March 31, 2025, and in conjunction with the interim goodwill impairment test, the Company recorded a goodwill impairment charge of $2.94 billion in the first quarter of 2025. Refer to Note 10 \nGoodwill and Intangible Assets\n in Part I, Item 1 of this Form 10-Q for more information. During the prior year period, the Company recorded a goodwill impairment charge of $321.0 million related to its JANZ reporting unit in conjunction with its annual goodwill impairment test performed as of April 1, 2024.\nLitigation Settlements and Other Contingencies, Net\nThe following table includes the (gains)/losses recognized in litigation settlements and other contingencies, net during the nine months ended September 30, 2025 and 2024, respectively:\nNine Months Ended\nSeptember 30,\n(In millions)\n2025\n2024\nContingent consideration adjustment\n$\n(150.3)\n$\n28.4 \nLitigation settlements, net\n84.9 \n210.9 \nTotal litigation settlements and other contingencies, net\n$\n(65.4)\n$\n239.3 \nRefer to Note 4 \nAcquisitions and Other Transactions\n and Note 11 \nFinancial Instruments and Risk Management\n included in Part I, Item 1 of this Form 10-Q for more information with respect to the contingent consideration adjustment.\nAlso refer to Note 17 \nLitigation\n included in Part I, Item 1 of this Form 10-Q for more information on litigation settlements, net.\nInterest Expense\nInterest expense for the nine months ended September 30, 2025 totaled $351.7 million, compared to $429.8 million for the nine months ended September 30, 2024, a decrease of $78.1 million. The decrease was primarily due to the impact of 2024 debt repayments.\n65\nTable of Contents\nOther Expense (Income), Net\nOther expense (income), net includes gains and losses from divestitures of businesses, changes in the fair value of equity securities, extinguishment of debt, foreign exchange, expense (income) related to post-employment benefit plans, TSA income, and interest and dividend income. Other expense (income), net for the nine months ended September 30, 2025 totaled $499.9 million of expense, compared to $143.2 million of income for the nine months ended September 30, 2024, a decrease of $643.1 million.\nThe decrease was primarily driven by a loss of $499.8 million recorded in the current year period as a result of changes in the fair value of the CCPS in Biocon Biologics, compared to a net gain in the prior year period of $334.5 million related to our non-marketable equity investments, including the CCPS in Biocon Biologics, and lower interest income of $48.7 million. This was partially offset by a decrease in loss on divestitures of $216.6 million compared to the prior year period. Refer to Note 11 \nFinancial Instruments and Risk Management\n included in Part I, Item 1 of this Form 10-Q for more information with respect to the change in the fair value of the CCPS in Biocon Biologics.\nIncome Tax (Benefit) Provision\nFor the nine months ended September 30, 2025, the Company recognized an income tax benefit of $147.2 million, compared to an income tax provision of $21.0 million for the comparable prior year period, a change of $168.2 million. The benefit in the current year period is primarily driven by the loss before income taxes, partially offset by the negative impact of the goodwill impairment charge, for which minimal tax benefit was realized, and a $17.7 million accrual related to the resolution of the previously disclosed Swedish tax matter. The current year and prior year provisions were also impacted by the levels of income and the changing mix at which it is earned in jurisdictions with differing tax rates. \nUse of Non-GAAP Financial Measures\nWhenever the Company uses non-GAAP financial measures, we provide a reconciliation of the non-GAAP financial measures to their most directly comparable U.S. GAAP financial measure. Investors and other readers are encouraged to review the related U.S. GAAP financial measures and the reconciliation of non-GAAP measures to their most directly comparable U.S. GAAP measure and should consider non-GAAP measures only as a supplement to, not as a substitute for or as a superior measure to, measures of financial performance prepared in accordance with U.S. GAAP. Additionally, since these are not measures determined in accordance with U.S. GAAP, non-GAAP financial measures have no standardized meaning across companies, or as prescribed by U.S. GAAP and, therefore, may not be comparable to the calculation of similar measures or measures with the same title used by other companies.\nManagement uses these measures internally for forecasting, budgeting, measuring its operating performance, and incentive-based awards. Primarily due to acquisitions, divestitures and other significant events which may impact comparability of our periodic operating results, we believe that an evaluation of our ongoing operations (and comparisons of our current operations with historical and future operations) would be difficult if the disclosure of our financial results was limited to financial measures prepared only in accordance with U.S. GAAP. We believe that non-GAAP financial measures are useful supplemental information for our investors and when considered together with our U.S. GAAP financial measures and the reconciliation to the most directly comparable U.S. GAAP financial measure, provide a more complete understanding of the factors and trends affecting our operations. The financial performance of the Company is measured by senior management, in part, using adjusted metrics as described below, along with other performance metrics. The Company’s use of such non-GAAP measures is governed by an adjusted reporting policy maintained by the Company and such non-GAAP measures are reviewed in detail with the Audit Committee of the Board of Directors.\nAdjusted Cost of Sales and Adjusted Gross Margin\nWe use the non-GAAP financial measure “adjusted cost of sales” and the corresponding non-GAAP financial measure “adjusted gross margin.” The principal items excluded from adjusted cost of sales include restructuring, acquisition and divestiture-related costs, and other special items, purchase accounting amortization and other related items, and share-based compensation expense, which are described in greater detail below.\n66\nTable of Contents\nAdjusted Net Earnings and Adjusted EPS\nAdjusted net earnings and adjusted net earnings per diluted share (“adjusted EPS”) are non-GAAP financial measures and provide an alternative view of performance used by management. Management believes that, primarily due to acquisitions, divestitures and other significant events, an evaluation of the Company’s ongoing operations (and comparisons of its current operations with historical and future operations) would be difficult if the disclosure of its financial results were limited to financial measures prepared only in accordance with U.S. GAAP. Management believes that adjusted net earnings and adjusted EPS are important internal financial metrics related to the ongoing operating performance of the Company, and are therefore useful to investors and that their understanding of our performance is enhanced by these measures. Actual internal and forecasted operating results and annual budgets used by management include adjusted net earnings and adjusted EPS.\nEBITDA and Adjusted EBITDA \nEBITDA and adjusted EBITDA are non-GAAP financial measures that the Company believes are appropriate to provide additional information to investors to demonstrate the Company’s ability to comply with financial debt covenants and assess the Company’s ability to incur additional indebtedness. The Company also believes that adjusted EBITDA better focuses management on the Company’s underlying operational results and true business performance and is used, in part, for management’s incentive compensation. We calculate EBITDA as U.S. GAAP net earnings (loss) adjusted for income tax provision (benefit), interest expense and depreciation and amortization. EBITDA is further adjusted for share-based compensation expense, litigation settlements and other contingencies, net, gain (loss) on divestitures of businesses, impairment of long-lived assets and goodwill, restructuring, acquisition and divestiture-related and other special items to determine adjusted EBITDA. These adjustments are generally permitted under our credit agreement in calculating adjusted EBITDA for determining compliance with our debt covenants.\nThe significant items excluded from adjusted cost of sales, adjusted EBITDA, adjusted net earnings, and adjusted EPS include:\nPurchase Accounting Amortization and Other Related Items\nThe ongoing impact of certain amounts recorded in connection with acquisitions of both businesses and assets is excluded from adjusted cost of sales, adjusted EBITDA, adjusted net earnings, and adjusted EPS. These amounts include the amortization of intangible assets, inventory step-up, property, plant and equipment step-up, intangible asset impairment charges, including for IPR&D, and impairment of goodwill. For the acquisition of businesses accounted for under the provisions of \nASC 805, Business Combinations\n, these purchase accounting impacts are excluded regardless of the financing method used for the acquisitions, including the use of cash, long-term debt, the issuance of common stock, contingent consideration or any combination thereof.\nFair Value Adjustments, Including Contingent Consideration\nThe impact of changes to the fair value of assets and liabilities, including contingent and deferred consideration and non-marketable equity investments, and the related accretion income or expense are excluded from adjusted EBITDA, adjusted net earnings, and adjusted EPS because they are not indicative of the Company’s ongoing operations due to the variability of the amounts and the lack of predictability as to the occurrence and/or timing and management believes their exclusion is helpful to understanding the underlying, ongoing operational performance of the business.\nShare-based Compensation Expense\nShare-based compensation expense is excluded from adjusted cost of sales, adjusted EBITDA, adjusted net earnings, and adjusted EPS. Our share-based compensation programs have become increasingly weighted toward performance-based compensation, which leads to variability and to a lack of predictability as to the occurrence and/or timing of amounts incurred. As such, management believes the exclusion of such amounts on an ongoing basis is helpful to understanding the underlying operational performance of the business. \n67\nTable of Contents\nRestructuring, Acquisition and Divestiture-Related Costs and Other Special Items\nCosts related to restructuring, acquisition and divestiture-related activities and other actions are excluded from adjusted cost of sales, adjusted EBITDA, adjusted net earnings, and adjusted EPS, as applicable. These amounts include items such as: \n•\nCosts related to formal restructuring programs and actions, including costs associated with facilities to be closed or divested, employee separation costs, impairment charges, accelerated depreciation, incremental manufacturing variances, equipment relocation costs, decommissioning and other restructuring related costs; \n•\nCertain acquisition and divestiture costs, including costs relating to integration and planning, advisory and legal fees, certain financing related costs, certain reimbursements related to the Company’s obligation to reimburse Pfizer for certain financing and transaction related costs under the Business Combination Agreement and Separation and Distribution Agreement, certain other TSA related set-up and exit costs, and other business transformation and/or optimization initiatives, which are not part of a formal restructuring program, including employee separation and post-employment costs;\n•\nOther costs, incurred from time to time, related to certain special events or activities that lead to gains or losses, including, but not limited to, incremental manufacturing variances, certain remediation activities, asset write-downs, including other-than-temporary impairments of investments in equity or debt instruments, or liability adjustments;\n•\nCertain costs to further develop and optimize our global enterprise resource planning systems, operations and supply chain; \n•\nGains or losses from divestitures, including impairments of held for sale assets; and\n•\nThe impact of changes related to uncertain tax positions are excluded from adjusted net earnings and adjusted EPS. In addition, tax adjustments to adjusted earnings are recorded to present items on an after-tax basis consistent with the presentation of adjusted net earnings and adjusted EPS.\nThe Company has undertaken restructurings and other optimization initiatives of differing types, scope and amount during the covered periods and, therefore, these charges should not be considered non-recurring; however, management excludes these amounts from adjusted cost of sales, adjusted EBITDA, adjusted net earnings, and adjusted EPS because it believes it is helpful to understanding the underlying, ongoing operational performance of the business.\nLitigation Settlements, Net\nCharges and gains related to legal matters, such as those discussed in Note 17 \nLitigation\n included in Part I, Item 1 of this Form 10-Q are generally excluded from adjusted EBITDA, adjusted net earnings, and adjusted EPS. Normal, ongoing defense costs of the Company made in the normal course of our business are not excluded.\n68\nTable of Contents\nReconciliation of U.S. GAAP Net (Loss) Earnings to Adjusted Net Earnings and U.S. GAAP (Loss) Earnings Per Share to Adjusted EPS\nA reconciliation between net (loss) earnings and diluted (loss) earnings per share as reported under U.S. GAAP, and adjusted net earnings and adjusted EPS for the periods shown follows:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions, except per share amounts)\n2025\n2024\n2025\n2024\nU.S. GAAP net (loss) earnings and U.S. GAAP diluted (loss) earnings per share\n$\n(128.2)\n$\n(0.11)\n$\n94.8 \n$\n0.08 \n$\n(3,174.8)\n$\n(2.70)\n$\n(117.7)\n$\n(0.10)\nPurchase accounting amortization (primarily included in cost of sales) \n605.8 \n586.0 \n1,787.1 \n1,907.6 \nImpairment of goodwill \n(a)\n— \n— \n2,936.8 \n321.0 \nLitigation settlements and other contingencies, net\n55.7 \n31.5 \n(65.4)\n239.3 \nInterest expense (primarily amortization of premiums and discounts on long term debt)\n(9.9)\n0.4 \n(28.6)\n(14.0)\n(Gain) loss on divestitures of businesses (included in other expense (income), net) \n(b)\n(1.6)\n107.4 \n79.1 \n295.8 \nAcquisition and divestiture-related costs (primarily included in SG&A) \n(c)\n40.0 \n98.2 \n134.4 \n290.8 \nRestructuring costs \n(d)\n17.2 \n105.4 \n136.7 \n146.1 \nShare-based compensation expense\n36.0 \n32.4 \n128.3 \n113.8 \nOther special items included in:\nCost of sales \n(e)\n89.4 \n45.2 \n190.1 \n92.5 \nResearch and development expense\n5.6 \n— \n7.7 \n2.8 \nSelling, general and administrative expense\n18.0 \n15.5 \n65.7 \n43.1 \nOther expense (income), net \n(f)\n102.4 \n(43.9)\n508.4 \n(322.1)\nTax effect of the above items and other income tax related items\n (g)\n(46.1)\n(175.3)\n(594.9)\n(462.2)\nAdjusted net earnings and adjusted EPS\n$\n784.3 \n$\n0.67 \n$\n897.6 \n$\n0.75 \n$\n2,110.6 \n$\n1.78 \n$\n2,536.8 \n$\n2.11 \nWeighted average diluted shares outstanding\n1,172.2 \n1,200.4 \n1,184.0 \n1,202.5 \n    \nSignificant items include the following:\n(a)\nFor the nine months ended September 30, 2025, includes a goodwill impairment charge of $2.94 billion as a result of the interim goodwill impairment test performed as of March 31, 2025.\n(b)\nFor the nine months ended September 30, 2025, consists of pre-tax charges related to the divestitures primarily due to an increase in estimated transaction related costs, including the assumption of additional contractual obligations, as well as the impact of working capital and other transaction-related adjustments.\n(c)\nAcquisition and divestiture-related costs consist primarily of transaction costs including legal and consulting fees and integration activities.\n(d)\nFor the three and nine months ended September 30, 2025, includes approximately $13.4 million and $44.5 million, respectively, in cost of sales, and approximately $3.7 million and $90.0 million, respectively, in SG&A. For the nine months ended September 30, 2025, includes approximately $2.2 million in R&D.\n(e)\nFor the three and nine months ended September 30, 2025, includes incremental manufacturing variances at plants slated for sale or closure or undergoing remediation activities of approximately $44.7 million and $113.1 million, respectively.\n(f)\nFor the three and nine months ended September 30, 2025, includes a loss of approximately $100.0 million and $499.8 million, respectively, as a result of remeasuring the CCPS in Biocon Biologics to fair value.\n(g)\nAdjusted for changes for uncertain tax positions. \n69\nTable of Contents\nReconciliation of U.S. GAAP Net (Loss) Earnings to EBITDA and Adjusted EBITDA\nBelow is a reconciliation of U.S. GAAP net (loss) earnings to EBITDA and adjusted EBITDA for the three and nine months ended September 30, 2025 compared to the prior year period:\nThree Months Ended September 30,\nNine Months Ended September 30,\n(In millions)\n2025\n2024\n2025\n2024\nU.S. GAAP net (loss) earnings\n$\n(128.2)\n$\n94.8 \n$\n(3,174.8)\n$\n(117.7)\nAdd / (deduct) adjustments:\nIncome tax provision (benefit)\n120.3 \n(4.3)\n(147.2)\n21.0 \nInterest expense \n(a)\n119.6 \n145.6 \n351.7 \n429.8 \nDepreciation and amortization \n(b)\n688.5 \n669.7 \n2,031.5 \n2,147.0 \nEBITDA\n$\n800.2 \n$\n905.8 \n$\n(938.8)\n$\n2,480.1 \nAdd / (deduct) adjustments:\nShare-based compensation expense\n36.0 \n32.4 \n128.3 \n113.8 \nLitigation settlements and other contingencies, net\n55.7 \n31.5 \n(65.4)\n239.3 \n(Gain) loss on divestitures of businesses\n(1.6)\n107.4 \n79.1 \n295.8 \nImpairment of goodwill\n— \n— \n2,936.8 \n321.0 \nRestructuring, acquisition and divestiture-related and other special items \n(c)\n264.3 \n207.5 \n1,016.9 \n235.9 \nAdjusted EBITDA\n$\n1,154.6 \n$\n1,284.6 \n$\n3,156.9 \n$\n3,685.9 \n____________\n(a)    \nIncludes amortization of premiums and discounts on long-term debt.\n(b)    \nIncludes purchase accounting related amortization.\n(c)    \nSee items detailed in the Reconciliation of U.S. GAAP Net (Loss) Earnings to Adjusted Net Earnings.\nLiquidity and Capital Resources\nOur primary source of liquidity is net cash provided by operating activities, which was $1.50 billion for the nine months ended September 30, 2025. We believe that net cash provided by operating activities and available liquidity will continue to allow us to meet our needs for working capital, capital expenditures, interest and principal payments on debt obligations, dividend payments, and share repurchases. Nevertheless, our ability to satisfy our working capital requirements and debt service obligations, and fund planned capital expenditures, share repurchases, or dividend payments, will substantially depend upon our future operating performance (which will be affected by prevailing economic conditions), and financial, business and other factors, some of which are beyond our control.\nOperating Activities\nNet cash provided by operating activities decreased by $320.1 million to $1.50 billion for the nine months ended September 30, 2025, as compared to net cash provided by operating activities of $1.82 billion for the nine months ended September 30, 2024. Net cash provided by operating activities is derived from net (loss) earnings adjusted for non-cash operating items, including fair value adjustments related to the Biocon Biologics CCPS investment, gains and losses attributed to investing and financing activities and changes in operating assets and liabilities resulting from timing differences between the receipts and payments of cash, including changes in cash primarily reflecting the timing of cash collections from customers, payments to vendors and employees and tax payments in the ordinary course of business.\nThe decrease in net cash provided by operating activities was principally due to lower operating earnings, including as a result of divestitures that closed in 2024, the Indore Impact, and the timing of cash payments and collections. \n70\nTable of Contents\nInvesting Activities\nNet cash used in investing activities was $216.5 million for the nine months ended September 30, 2025, as compared to net cash from investing activities of $1.97 billion for the nine months ended September 30, 2024, a decrease of $2.19 billion.\nIn 2025, significant items in investing activities included the following:\n•\ncapital expenditures, primarily for equipment and facilities, totaling approximately $182.3 million. While there can be no assurance that current expectations will be realized, capital expenditures for the 2025 calendar year are expected to be approximately $300 million to $350 million.\nIn 2024, significant items in investing activities included the following:\n•\nproceeds from the sale of assets and businesses of $2.51 billion primarily related to the divestitures of the OTC Business, the API business in India and the women’s healthcare business;\n•\ncash paid for acquisitions, net of cash acquired, of $350.0 million; and\n•\ncapital expenditures, primarily for equipment and facilities, totaling approximately $185.6 million.\nFinancing Activities\nNet cash used in financing activities was $1.06 billion for the nine months ended September 30, 2025, as compared to $2.91 billion for the nine months ended September 30, 2024, a decrease of $1.85 billion.\nIn 2025, significant items in financing activities included the following:\n•\nshare repurchases of $415.4 million; \n•\ncash dividends paid of $423.0 million; and\n•\nnet cash of $176.3 million paid on behalf of other partners, which is included in Other items, net.\nIn 2024, significant items in financing activities included the following:\n•\nrepayment of Senior Notes of approximately $1.54 billion;\n•\nrepayment of the 1.023% Euro Senior Notes at maturity of approximately $801.7 million;\n•\nshare repurchases of $250.0 million; \n•\ncash dividends paid of $431.5 million; and\n•\nreceipt of $100.0 million in deferred consideration from the Biocon Biologics Transaction, and net cash of $97.2 million collected on behalf of other partners, including Biocon Biologics, which is included in Other items, net.\nCapital Resources\nOur cash and cash equivalents totaled $975.3 million at September 30, 2025. The majority of our cash is invested in U.S. government money market funds and in bank deposits. In order to support our global operations, we maintain significant cash and cash equivalents within the banking system with the majority of this at Global Systemically Important Banks. We monitor the third-party depository institutions that hold our cash and cash equivalents on a regular basis. Our primary emphasis is on the safety of the principal. Where possible, we diversify our cash and cash equivalents among counterparties to minimize exposure to any one counterparty. The Company anticipates having sufficient liquidity, including existing borrowing capacity under the 2024 Revolving Facility, Commercial Paper Program, and Receivables Facility combined with cash to be generated from operations, to fund foreseeable cash needs without requiring the repatriation of non-U.S. cash. Should we determine the need to repatriate or convert cash held in countries that have significant restrictions or controls in place, including in China, we may be unable to repatriate or convert such cash, or be unable to do so without incurring substantial costs.\nThe Company has access to $3.5 billion under the 2024 Revolving Facility which matures in September 2029. Up to $1.65 billion of the 2024 Revolving Facility may be used to support borrowings under our Commercial Paper Program. As of September 30, 2025, the Company did not have any borrowings outstanding under the Commercial Paper Program or the 2024 Revolving Facility. \n71\nTable of Contents\nThe Company has a Receivables Facility for up to an aggregate amount of $600 million which expires in April 2028. As of September 30, 2025, the Company did not have any borrowings outstanding under the Receivables Facility. \nUnder the terms of the Receivables Facility, certain of our accounts receivable secure the amounts borrowed and cannot be used to pay our other debts or liabilities. The amount that we may borrow at a given point in time is determined based on the amount of qualifying accounts receivable that are present at such point in time. Borrowings outstanding under the Receivables Facility bear interest at the applicable base rates plus applicable margins and are included as a component of short-term borrowings, while the accounts receivable securing these obligations remain as a component of accounts receivable, net, in our condensed consolidated balance sheets. In addition, the agreement governing the Receivables Facility contains various customary affirmative and negative covenants, and customary default and termination provisions.\nWe have entered into accounts receivable factoring agreements with financial institutions to sell certain of our non-U.S. accounts receivable. These transactions are accounted for as sales and result in a reduction in accounts receivable because the agreements transfer effective control over and risk related to the receivables to the buyers. Our factoring agreements do not allow for recourse in the event of uncollectibility, and we do not retain any interest in the underlying accounts receivable once sold. We derecognized $126.8 million and $68.5 million of accounts receivable as of September 30, 2025 and December 31, 2024, respectively, under these factoring arrangements. Additionally, we have a similar arrangement for certain European countries. As of September 30, 2025 and December 31, 2024, we assigned and derecognized approximately $51.6 million and $29.9 million, respectively, of \nTrade Receivables, Net\n, which were included in \nOther Receivables\n.\nWe are continuously evaluating the potential acquisition of products, as well as companies, as a strategic part of our future growth. Consequently, we may utilize current cash reserves or incur additional indebtedness to finance any such acquisitions, which could impact future liquidity. Also, on an ongoing basis, we review our operations, including the evaluation of potential divestitures of products and businesses, as part of our future strategy. Any divestitures could impact future liquidity. In addition, we plan to continue to explore various other ways to unlock the value of the Company’s unique global platform in order to create shareholder value.\nFor information regarding our dividends paid and declared and share repurchase program, refer to Note 9 \n(Loss) Earnings per Share \nincluded\n \nin Part I, Item 1 of this Form 10-Q.\nLong-term Debt Maturity\nFor information regarding our debt agreements and mandatory minimum repayments remaining on the outstanding notional amount of long-term debt at September 30, 2025, refer to Note 12 \nDebt\n included in Part I, Item 1 of this Form 10-Q.\nThe YEN Term Loan Facility and the 2024 Revolving Facility contain customary affirmative covenants for facilities of this type, including among others, covenants pertaining to the delivery of financial statements, notices of default and certain material events, maintenance of corporate existence and rights, property, and insurance and compliance with laws, as well as customary negative covenants for facilities of this type, including a financial covenant, which set the Maximum Leverage Ratio as of the end of any quarter at 3.75 to 1.00, except in circumstances as defined in the related credit agreement, and other limitations on the incurrence of subsidiary indebtedness, liens, mergers and certain other fundamental changes, investments and loans, acquisitions, transactions with affiliates, payments of dividends and other restricted payments and changes in our lines of business.\nThe Company is in compliance with its covenants at September 30, 2025 and expects to remain in compliance for the next twelve months. \nWe and our subsidiaries and affiliates may from time to time, in our sole discretion, purchase, repay, redeem or retire any of our outstanding debt securities (including any publicly-issued debt securities) in privately negotiated or open market transactions, by tender offer or otherwise, or extend or refinance any of our outstanding indebtedness. \nSupplemental Guarantor Financial Information\nViatris Inc. is the issuer of the Registered Upjohn Notes, which are fully and unconditionally guaranteed on a senior unsecured basis by Mylan Inc., Mylan II B.V. and Utah Acquisition Sub Inc. \n72\nTable of Contents\nFollowing the Combination, Utah Acquisition Sub Inc. is the issuer of the Utah U.S. Dollar Notes, which are fully and unconditionally guaranteed on a senior unsecured basis by Mylan Inc., Viatris Inc. and Mylan II B.V.\nMylan Inc. is the issuer of the Mylan Inc. U.S. Dollar Notes, which are fully and unconditionally guaranteed on a senior unsecured basis by Mylan II B.V., Viatris Inc. and Utah Acquisition Sub Inc.\nThe respective obligations of Viatris Inc., Mylan Inc., Utah Acquisition Sub Inc., and Mylan II B.V. as guarantors of the applicable series of Senior U.S. Dollar Notes are senior unsecured obligations of the applicable guarantor and rank \npari passu\n in right of payment with all of such guarantor’s existing and future senior unsecured obligations that are not expressly subordinated to such guarantor’s guarantee of the applicable series of Senior U.S. Dollar Notes, rank senior in right of payment to any future obligations of such guarantor that are expressly subordinated to such guarantor’s guarantee of the applicable series of Senior U.S. Dollar Notes, and are effectively subordinated to such guarantor’s existing and future secured obligations to the extent of the value of the collateral securing such obligations. Such obligations are structurally subordinated to all of the existing and future liabilities, including trade payables, of the existing and future subsidiaries of such guarantor that do not guarantee the applicable series of Senior U.S. Dollar Notes.\nThe guarantees by Mylan Inc., Mylan II B.V. and Utah Acquisition Sub Inc. under the applicable series of Senior U.S. Dollar Notes will terminate under certain customary circumstances, each as described in the applicable indenture, including: (1) a sale or disposition of the applicable guarantor in a transaction that complies with the applicable indenture such that such guarantor ceases to be a subsidiary of the issuer of the applicable series of Senior U.S. Dollar Notes; (2) legal defeasance or covenant defeasance or if the issuer’s obligations under the applicable indenture are discharged; (3) with respect to the Utah U.S. Dollar Notes, the earlier to occur of (i) with respect to the guarantee provided by Mylan Inc., (x) the release of Utah Acquisition Sub Inc.’s guarantee under all applicable Mylan Inc. Debt (as defined in the applicable indenture) and (y) Mylan Inc. no longer having any obligations in respect of any Mylan Inc. Debt and (ii) with respect to the guarantee provided by Mylan II B.V., (x) the release of Mylan II B.V.’s guarantee under all applicable Triggering Indebtedness (as defined in the applicable indenture) and (y) the issuer and/or borrower of the applicable Triggering Indebtedness no longer having any obligations with respect to such Triggering Indebtedness; (4) with respect to the guarantees provided by Utah Acquisition Sub Inc. and Mylan II B.V. of the Mylan Inc. U.S. Dollar Notes, subject to certain exceptions set forth in the applicable indenture, such guarantor ceasing to be a guarantor or obligor in respect of any Triggering Indebtedness; and (5) with respect to the Registered Upjohn Notes, (a) upon the applicable guarantor no longer being an issuer or guarantor in respect of (i) Mylan Notes (as defined in the indenture governing the Registered Upjohn Notes) that have an aggregate principal amount in excess of $500.0 million or (ii) any Triggering Indebtedness; in each case, other than in respect of indebtedness or guarantees, as applicable, that are being concurrently released; or (b) upon receipt of the consent of holders of a majority of the aggregate principal amount of the outstanding notes of such series in accordance with the indenture governing the Registered Upjohn Notes.\nThe guarantee obligations of Viatris Inc., Mylan Inc., Utah Acquisition Sub Inc., and Mylan II B.V. under the Senior U.S. Dollar Notes are subject to certain limitations and terms similar to those applicable to other guarantees of similar instruments, including that (i) the guarantees are subject to fraudulent transfer and conveyance laws and (ii) each guarantee is limited to an amount not to exceed the maximum amount that can be guaranteed by the applicable guarantor without rendering the guarantee, as it relates to such guarantor, voidable under applicable fraudulent transfer and conveyance laws or similar laws affecting the rights of creditors generally. \nThe following table presents unaudited summarized financial information of Viatris Inc., Mylan Inc., Utah Acquisition Sub Inc., and Mylan II B.V. on a combined basis as of and for the nine months ended September 30, 2025 and as of and for the year ended December 31, 2024. All intercompany balances have been eliminated in consolidation. This unaudited combined summarized financial information is presented utilizing the equity method of accounting.\n73\nTable of Contents\nCombined Summarized Balance Sheet Information of Viatris Inc., Mylan Inc., Utah Acquisition Sub Inc. and Mylan II B.V. \n(In millions)\nSeptember 30, 2025\nDecember 31, 2024\nASSETS\nCurrent assets\n$\n578.8 \n$\n786.7 \nNon-current assets\n58,889.9 \n61,424.7 \nLIABILITIES AND EQUITY\nCurrent liabilities\n33,401.8 \n30,796.9 \nNon-current liabilities\n10,849.3 \n12,779.0 \nCombined Summarized Income Statement Information of Viatris Inc., Mylan Inc., Utah Acquisition Sub Inc. and Mylan II B.V. \n(In millions)\nNine Months Ended September 30, 2025\nYear Ended December 31, 2024\nRevenues\n$\n— \n$\n— \nGross profit\n— \n— \nLoss from operations\n(740.0)\n(1,206.6)\nNet loss\n(3,174.8)\n(634.2)\nOther Commitments \nThe Company is involved in various disputes, governmental and/or regulatory inquiries, investigations and proceedings, tax proceedings and litigation matters, both in the U.S. and abroad, that arise from time to time, some of which could result in losses, including damages, fines and/or civil penalties, and/or criminal charges against the Company. These matters are often complex and have outcomes that are difficult to predict. We have approximately $481.9 million accrued for legal contingencies at September 30, 2025.\nWhile the Company believes that it has meritorious defenses with respect to the claims asserted against it and the assumed legal matters referenced above, and intends to vigorously defend its position, the process of resolving these matters is inherently uncertain and may develop over a long period of time, and so it is not possible to predict the ultimate resolution of any such matter. It is possible that an unfavorable resolution of any of the ongoing matters could have a material effect on the Company’s business, financial condition, results of operations, cash flows, ability to pay dividends or repurchase shares, and/or stock price.\nIn connection with the divestitures, Viatris and the respective buyers entered into transition services and/or manufacturing and supply agreements pursuant to which the Company is providing services to the respective purchasers, substantially the same as we previously provided to the related businesses, generally for a period of up to 12 months for transition services and for periods between one to 10 years for manufacturing and supply agreements, depending on the geographic market and the products subject to such agreement, subject to potential extensions in certain circumstances. In addition, in connection with the OTC Transaction and the divestiture of our women’s healthcare business, we entered into distribution agreements for certain markets for a limited period of time. In connection with the API business divestiture, we entered into a manufacturing and supply agreement pursuant to which we are purchasing a significant amount of API from the purchaser in that transaction. Some of these agreements include various ongoing financial obligations.\nApplication of Critical Accounting Policies\nThe Company reviews goodwill for impairment annually on April 1st or more frequently if events or changes in circumstances indicate that the carrying value of goodwill may not be recoverable. During the first quarter of 2025, the Company experienced a sharp and sustained decline in its share price and significantly increased uncertainty and volatility in the geopolitical and economic environments in which the Company operates. As a result of these factors, the Company determined that a triggering event had occurred for each of its reporting units and performed an interim goodwill impairment test as of March 31, 2025.  \n74\nTable of Contents\nThe Company also performed the annual goodwill impairment test as of April 1, 2025. There were no significant changes from the interim goodwill test performed at March 31, 2025 and the results were consistent with the interim goodwill impairment test. Also, no triggering events have been identified since the April 1, 2025 impairment test date. \nThe Company performed both its interim and annual goodwill impairment tests on a quantitative basis for its five reporting units, North America, Europe, Emerging Markets, JANZ, and Greater China. In estimating each reporting unit’s fair value, the Company performed an extensive valuation analysis, utilizing a discounted cash flow approach. The determination of the fair value of the reporting units requires the Company to make significant estimates and assumptions that affect the reporting unit’s expected future cash flows. These estimates and assumptions, utilizing Level 3 inputs, primarily include, but are not limited to, the discount rate, terminal growth rates, operating income before depreciation and amortization, capital expenditures forecasts and control premiums. \nFor the March 31, 2025 interim goodwill impairment test, when compared to the prior year annual goodwill impairment test completed on April 1, 2024, the significantly increased uncertainty and volatility in the geopolitical and economic environments in which the Company operates increased the Company’s business risks, including, but not limited to, the potential for continued or additional drug pricing reduction pressures, general uncertainty related to timing of responses and approvals from the FDA resulting from evolving regulatory priorities and associated changes to the operations of the agency, and the potential for adverse impacts from future tariffs and trade restrictions. The negative impact of any or all of these factors could be material. The significant increase in business risks and uncertainty led to an increase in discount rate assumptions impacting all reporting units as compared to the April 1, 2024 annual goodwill impairment test.\nAs of March 31, 2025 (prior to the impairment charges noted below), the allocation of the Company’s total goodwill was as follows: North America $3.09 billion, Europe $3.92 billion, Emerging Markets $1.17 billion, JANZ $0.30 billion and Greater China $0.92 billion.\nIn conjunction with its March 31, 2025 interim goodwill impairment test, the Company recorded the following impairment charges in the first quarter of 2025:\n(In millions)\nNorth America\nEurope\nJANZ\nEmerging Markets\nTotal\nImpairment charge\n$\n707.0 \n$\n1,554.0 \n$\n300.8 \n$\n375.0 \n$\n2,936.8 \nFor the North America reporting unit at March 31, 2025 and April 1, 2025, the Company forecasted cash flows for the next 10 years. During the forecast period, the revenue compound annual growth rate was approximately 3.1%. A terminal year value was calculated with a negative 3.0% revenue growth rate applied. The discount rate utilized was 12.5% and the estimated tax rate was 24.8%. \nFor the Europe reporting unit at March 31, 2025 and April 1, 2025, the Company forecasted cash flows for the next 10 years. During the forecast period, the revenue compound annual growth rate was approximately 3.3%. A terminal year value was calculated with a 2.0% revenue growth rate applied. The discount rate utilized was 12.0% and the estimated tax rate was 15.8%. \nFor the Emerging Markets reporting unit at March 31, 2025 and April 1, 2025, the Company forecasted cash flows for the next 10 years. During the forecast period, the revenue compound annual growth rate was approximately 3.5%. A terminal year value was calculated with a 2.0% revenue growth rate applied. The discount rate utilized was 14.5% and the estimated tax rate was 16.7%. \nFor the JANZ reporting unit at March 31, 2025 and April 1, 2025, the Company forecasted cash flows for the next 10 years. During the forecast period, the revenue compound annual growth rate was approximately negative 0.9%. A terminal year value was calculated with a 1.0% revenue growth rate applied. The discount rate utilized was 8.5% and the estimated tax rate was 30.2%. After the goodwill impairment charge recorded during the first quarter of 2025, there is no remaining goodwill allocated to the JANZ reporting unit.\nFollowing the goodwill impairment charges recorded in these reporting units, since the carrying value of the reporting units is equal to their estimated fair value as of March 31, 2025 and April 1, 2025, if market conditions or the projected results were to negatively change, it may be necessary to record further impairment charges to one or more of these reporting units in future periods. Any such future charges could be material.\n75\nTable of Contents\nFor the Greater China reporting unit, the estimated fair value exceeded its carrying value by approximately $322.0 million or 5.8% for both the March 31, 2025 and April 1, 2025 goodwill impairment tests. As it relates to the discounted cash flow approach for the Greater China reporting unit at March 31, 2025 and April 1, 2025, the Company forecasted cash flows for the next 10 years. During the forecast period, the revenue compound annual growth rate was approximately 1.6%. A terminal year value was calculated with a negative 1.5% revenue growth rate applied. The discount rate utilized was 15.0% and the estimated tax rate was 24.7%. If all other assumptions are held constant, a reduction in the terminal value growth rate by 3.5% or an increase in discount rate by 1.0% would result in an impairment charge for the Greater China reporting unit.\nDue to the inherent uncertainty involved in making these estimates, actual results could differ from those estimates. In addition, changes in underlying assumptions, especially as they relate to the key assumptions detailed, could have a significant impact on the fair value of the reporting units."
}