{
  "source_file": "vtrs-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.\nBusiness\nAbout Viatris\nViatris is a global healthcare company whose breadth and scale we believe make it uniquely positioned to address healthcare needs globally. With a mission to empower people worldwide to live healthier at every stage of life, Viatris supplies high-quality medicines to approximately 1 billion patients around the world each year. The Company has a global footprint, an extensive portfolio of medicines that is well-diversified across therapeutic areas, a one-of-a-kind global supply chain designed to reach more people when and where they need them, and the scientific expertise to address some of the world's most enduring health challenges. \nViatris’ executive management team is focused on ensuring that the Company is optimally structured and efficiently resourced to deliver sustainable value to patients, shareholders, customers and other key stakeholders. The Company operates in more than 165 countries and territories with approximately 32,000 employees. The Company has 26 manufacturing and packaging sites worldwide, more than 1,400 approved molecules, and industry leading commercial, R&D, regulatory, manufacturing, legal and medical expertise. Viatris’ portfolio consists of generics (including complex products), globally recognized iconic brands, and an expanding portfolio of innovative medicines. Viatris is headquartered in the U.S., with global centers in Pittsburgh, Pennsylvania, Shanghai, China and Hyderabad, India.\nViatris has executed various strategic initiatives, transactions and business arrangements over the last few years to return its base business to growth, deliver on its pipeline, reduce debt, maintain an investment grade credit rating and return capital to shareholders. The Company has also completed certain transactions to simplify and streamline its business, accelerate paydown of debt and unlock value, including the Biocon Biologics Transaction and the recently completed divestitures discussed below.\nOn November 29, 2022, Viatris completed a transaction to contribute its biosimilars portfolio to Biocon Biologics to create a vertically integrated global biosimilars leader. A portion of the consideration received from Biocon at closing included approximately $1 billion of CCPS representing a stake of approximately 12.9% (on a fully diluted basis) in Biocon Biologics.\nIn October 2023, the Company announced it had received an offer for the divestiture of its OTC Business and had entered into definitive agreements to divest its women’s healthcare business primarily related to oral and injectable contraceptives, its API business in India, its rights to two women’s healthcare products in certain countries, and commercialization rights in the Upjohn Distributor Markets. The Company has substantially completed all of these divestitures:\n•\nIn March 2024, the Company completed the divestiture of its women's healthcare business, primarily related to its oral and injectable contraceptives, to Insud Pharma, S.L., a leading Spanish multinational pharmaceutical company. The transaction included two manufacturing facilities in India: one in Ahmedabad and one in Sarigam.  \n•\nIn June 2024, the Company completed the divestiture of its API business in India to Matrix Pharma Private Limited, a privately held pharmaceutical company based in India. The transaction included three manufacturing sites and an R&D lab in Hyderabad, three manufacturing sites in Vizag and third-party API sales. Viatris retained some selective R&D capabilities in API. \n•\nIn July 2024, the Company completed the divestiture of its OTC Business to Cooper Consumer Health, a leading European OTC drug manufacturer and distributor. The transaction included two manufacturing sites located in Merignac, France, and Confienza, Italy, and an R&D site in Monza, Italy. The Company retained the rights for Viagra®, Dymista® (which, in certain limited markets, are sold as OTC products) and select OTC products in certain markets. \n•\nViatris divested its rights to women’s healthcare products Duphaston® and Femoston® in certain countries to Theramex HQ UK Limited, a leading global specialty pharmaceutical company dedicated to women's health. The transaction (other than in the U.K., which was sold to Insud Pharma, S.L. in August 2024) closed in December 2023. \n•\nThe divestitures of the commercialization rights in the majority of the Upjohn Distributor Markets closed during 2023 and 2024.\n6\nTable of Contents\n \nBusiness Strategy\nThe Company has laid out three strategic pillars to accelerate growth and shareholder return:\n•\nDiversified & Growing Base Business:\n We believe the Company’s continued success in its base business comes from its large and diversified portfolio of generics and off-patent brands that extends across markets and therapeutic areas. Here the Company has a clear legacy of deep product knowledge and extensive commercialization and development expertise. We believe it is important that Viatris maintains a strong focus on growing its base business over the long-term.\n•\nFinancial Strength & Significant Cash Flow: \nWe believe the Company’s strong balance sheet and sector-leading cash flow generation differentiate it from sector peers. The Company expects to continue to deliver on its long-term financial strategy to return capital to shareholders through dividends and share repurchases, while making investments in its business and maintaining its commitment to its investment grade debt rating. \n•\nExpanding Innovative Portfolio: \nThis represents the Company’s continuous efforts to identify, vet and secure innovative, best-in-class, patent-protected assets in areas of unmet medical need in which it can be successful. By expanding our innovative portfolio, we believe the Company has the potential to drive accelerated and durable revenue growth over the long-term.\nAs part of expanding our innovative portfolio, on March 15, 2024, the Company acquired exclusive global development and commercialization rights to two Phase 3 assets from Idorsia, as well as the potential to add additional innovative assets in the future.\nThe collaboration includes selatogrel, a potential life-saving self-administered medicine for patients with a history of acute myocardial infarction (AMI), or heart attack, and builds on Viatris' existing global cardiovascular franchise and specialty infrastructure, as well as its knowledge, leadership, and distribution capabilities for self-administered medication for acute life-threatening conditions.\nThe collaboration also includes cenerimod, a novel immunology asset that has the potential to be a first-in-class oral therapy for the treatment of systemic lupus erythematosus (SLE), the most common form of lupus. Through lifecycle management, this asset also has the potential for broad application across multiple autoimmune diseases in a specialist-driven category with attractive market dynamics for oral therapies and could be a cornerstone asset in Viatris' immunology portfolio.\nUnder the terms of the original agreements, the development programs and certain personnel for selatogrel and cenerimod were transferred to Viatris from Idorsia in exchange for an upfront payment to Idorsia of $350 million, potential contingent milestone payments (including $300 million payable upon the achievement of certain development and regulatory milestones, and $2.1 billion payable upon the achievement of certain tiered sales milestones), as well as potential contingent tiered sales royalties. Viatris and Idorsia are both contractually obligated to contribute to the development costs for both programs. Viatris has worldwide commercialization rights for both selatogrel and cenerimod (excluding, for cenerimod only, Japan, South Korea and certain countries in the Asia-Pacific region). A joint development committee was formed to oversee the development of the ongoing Phase 3 programs through regulatory approval. The agreements also provide Viatris a right of first refusal and a right of first negotiation for certain other assets in Idorsia’s pipeline. \nOn February 25, 2025, in order to preserve the ongoing continuity of the development programs for selatogrel and cenerimod considering certain capital structuring steps announced by Idorsia to secure its ongoing operations, Viatris and Idorsia entered into a letter agreement to amend certain terms of the original agreements described above. Under the terms of the letter agreement, Viatris will receive additional territory rights in Japan, South Korea and certain other countries in the Asia-Pacific region for cenerimod, a $250 million reduction in contingent milestone payments, including $200 million of development milestones, and additional personnel to expedite transitioning the development programs to Viatris in exchange for Viatris assuming $100 million of Idorsia’s obligation to contribute to development costs. In addition, the letter agreement provides for the replacement of the joint development committee with a transition committee to oversee the transition of both development programs to Viatris. For additional information, see Part I, Item 1A Risk Factors – \n“We may not realize the intended benefits of, or achieve the intended goals or outlooks with respect to, our strategic initiatives and priorities, including divestitures, acquisitions or other potential transactions.”\n, \n“If we are unable to successfully introduce new products in a timely manner, our future revenue and profitability may be adversely affected.”\n and \n“We expend a significant amount of resources on R&D efforts that may not lead to successful product introductions.”\n7\nTable of Contents\n \nUnless otherwise indicated, industry data included in this Item 1 are sourced from IQVIA Holdings Inc. and are for the twelve months ended November 2024 and Viatris product and other company data included in this Item 1 are from internal sources and are as of November 30, 2024. \nOrganization\nUpjohn was incorporated in Delaware on February 14, 2019 as a wholly-owned subsidiary of Pfizer to operate the Upjohn Business. Effective as of November 16, 2020, Upjohn, Mylan and Pfizer consummated the combination of Mylan with the Upjohn Business through a Reverse Morris Trust transaction, Viatris became the parent entity of the combined Upjohn Business and Mylan business, and Upjohn changed its name to “Viatris Inc.” As a result of the Combination, Mylan ceased to exist as a separate legal entity after merging with and into Mylan II B.V., an indirect wholly owned subsidiary of Viatris.\nThe Upjohn Business was a global, primarily off-patent branded and generic established medicines business, which included 20 primarily off-patent oral solid dose legacy brands, such as Lyrica®, Lipitor®, Celebrex® and Viagra®. \nMylan was founded in 1961 as a privately-owned company and grew over time into one of the largest manufacturers of generic medicines in the U.S. Mylan became a publicly traded company in 1973. Mylan’s strategy then led to many acquisitions which played a significant role in the evolution of that company, including Matrix Laboratories Limited (2007); Merck KGaA’s generic and specialty pharmaceutical business (2007); the EPD Business (2015) and Meda AB (publ.) (2016). These acquisitions assisted in creating robust research, manufacturing, supply chain and commercial platforms on a global scale; substantially expanding its portfolio of medicines; diversifying by geography, product type and channel; maintaining its commitment to quality; and cultivating its global workforce.\nBusiness Model and Operations\nAt Viatris, we have a relentless focus on delivering access at scale. Our strength is in our diversity. Our business and operating model is deliberately designed and implemented to deliver on our strategy to provide and sustain access to medicine at scale. We seek to create value for and together with our key stakeholders – the people who trust our medicines every day, the health systems who rely on us, the people who make up Viatris, our partners and the investors who believe in our ability to execute on our ambitious mission.  \nWe are convinced that patients and health systems around the world are best served by a healthcare company applying a well-rounded and long-term approach, maintaining viability while working to manage inherent risks and opportunities and continuously striving to advance sustainable operations and responsible practices in a focused way. We see healthcare not as it is, but as it should be. We act courageously and believe we are uniquely positioned to be a source of stability in a world of evolving healthcare needs. Our mission is to empower people worldwide to live healthier at every stage of life. We do so via\n Access\n, \nLeadership\n and \nPartnership\n.\nACCESS\n \nViatris provides high-quality, trusted medicines, regardless of geography or circumstance.\n As noted above access is fundamental to our mission. It is not an initiative; it is our business model, and it is personal. It begins with our ability to sustainably deliver quality medicines to people, regardless of geography or circumstance. We believe we are a company uniquely positioned to bridge the traditional divide between generics and brands, combining the best of both to more holistically address healthcare needs globally. We are committed to improving access to high-quality medicines and working to ensure a reliable supply so patients can get the treatments they need, when and where they need them. Our global portfolio, supported by our science, medical and manufacturing expertise, delivers global iconic and key brands, and generics, including complex products. \nWe see access as fundamental to empowering people worldwide to live healthier at every stage of life—a powerful concept in challenging times. \n8\nTable of Contents\n \nWith what we believe is an extensive portfolio of medicines to meet nearly every health need, a one-of-a-kind global supply chain designed to reach more people with health solutions when and where they need them, and the scientific expertise to address some of the world’s most enduring health challenges, access takes on deeper meaning at Viatris. \nFrom our unique vantage point, we touch all of life’s moments, from birth to the end of life, acute conditions to chronic diseases. We see across multiple therapeutic areas to the person at the center of their own unique health journey. We are focused on meeting individual needs, whether with a generic medicine, an improved version of an existing medicine, or a truly novel therapeutic solution. \nUltimately, we know we are stronger together. Both as a company and as a global community. Our pursuit of access is relentless. Because health matters everywhere.\nAs a company, Viatris:\n•\nCovers a broad range of therapeutic areas\n. We produce medicines for patients across a broad range of major therapeutic areas. From cardiovascular health to oncology, Viatris offers quality treatment options across more than 10 major therapeutic areas covering a wide variety of noncommunicable and infectious diseases. We also offer support services such as diagnostic clinics, educational seminars and digital tools to help patients better manage their health. We continue to seek opportunities in various therapeutic areas that move the Company forward and leverage the strength of our internal capabilities and global platform.\n•\nHelps ease the burden of noncommunicable diseases.\n According to the WHO, NCDs, such as ischemic heart disease, stroke, diabetes, certain cancers and chronic obstructive pulmonary disease, are among the leading causes of death globally. NCDs affect people of every age, gender and socioeconomic status in every corner of the world, and pose a heavy burden on individuals, families and communities. To overcome this global public health threat, patients worldwide need a partner they can trust – one that not only believes everyone deserves good health, but also has the portfolio, experience and expertise to make this belief a reality.\n•\nHelps hearts stay healthier. \nAccording to the WHO, coronary heart disease is the number one cause of death globally. With our acquisition of selatogrel and licensing agreement for sotagliflozin, we are continuing to build on our strong presence in cardiovascular disease. Viatris collaborates with many organizations to help prevent, diagnose, and treat cardiovascular illnesses. Our deep experience in emerging and developed markets affords a tried-and-true method of achieving high impact across the patient experience, from awareness to adherence. In close collaboration with governments, healthcare providers, technology partners and patients, we at Viatris work to nurture healthcare systems that can adapt and respond to patients’ ever-changing needs. We continue to collaborate with medical associations, patient advocacy groups and academia to develop innovative, integrated solutions and programs to help strengthen both the delivery and quality of healthcare.\n•\nFights infectious disease\n. We are also a global leader in treating infectious diseases such as HIV/AIDS, hepatitis, and tuberculosis, and offer an extensive portfolio across these disease states. While many important strides have been made to treat these illnesses, there is still more to be done in countries where lack of access to therapeutics, preventative treatment and diagnostics often result in patients not receiving proper care, and those where HIV transmission continues decades into the epidemic. From manufacturing a pediatric-friendly antiretroviral used to treat HIV-positive infants to providing HIV self-tests in some low- and middle-income countries, we are innovating to help patients.\nAn Increasingly Innovative and Differentiated Pipeline\nOur confidence in the future delivery of our pipeline is rooted in our strong historic development programs and list of firsts, including the first FDA approvals of the generic version of Allergan's Restasis® and the generic version of Symbicort®, Breyna™. In addition, we are working on many other programs, including the potential to be first to market for our generics of Abilify Maintena®, Injectafer®, Invega Trinza®, Ozempic®, Venofer® and Wegovy™. We are also working with our partners in developing patent-protected, innovative assets such as selatogrel and cenerimod, and on novel and complex products such as our BOTOX® (onabotulinumtoxinA) biosimilar. \n9\nTable of Contents\n \nWhile we continue to diligently pursue important generics opportunities, we have increasingly focused on limited-competition complex and novel products targeting gaps in care, all with a first-to-market emphasis and serving our mission of patient access. Complex product categories are critical to patient health and are growing at a rapid pace. Our goal is to enhance our proven scientific capabilities and current global platform, including our Global Healthcare Gateway®, which allows partners to access our infrastructure and many established strengths to reach patients they may not have the resources to reach on their own, to create a durable and higher-margin portfolio of products. And that means further expanding beyond our current scope into more innovative products, including innovative, best-in-class, patent-protected assets that address areas of significant unmet medical need.  \nLEADERSHIP\n \nViatris is advancing sustainable operations and innovative solutions to improve patient health and support more resilient healthcare systems. \nViatris is committed to providing steady leadership in a world that is constantly evolving. We take that commitment seriously and know that advancing sustainable operations and innovative solutions to improve patient health requires strong global leadership. We know what it takes to reach more patients with more products, and believe that Viatris is uniquely positioned to make a difference through our:\n•\nPowerful global operating platform\n, which combines what we believe to be best-in-class manufacturing and supply chain capabilities. We have designed our global operations and supply chain to be a reliable and flexible partner for access across the world, constantly adapting to an ever-evolving landscape. Viatris operates approximately 26 manufacturing and packaging sites worldwide that produce oral solid doses, injectables, and products with complex dosage forms on five different continents. Together with a global, flexible and diverse supply chain, our platform strives to mitigate risks of disruption and ensure supply reliability. Our responsive global network has helped us maintain a reliable supply of much needed medicines through times of significant volatility. We are committed to advancing responsible and sustainable operations and work diligently to minimize our environmental footprint across the Viatris network while safeguarding access to medicine. \n•\nRobust global technical resources\n, including thousands of scientists, regulatory experts, clinical, medical and product safety professionals working around the world on innovative therapies and solutions for patients everywhere.\n•\nStrong global commercial team\n, including sales team members and marketing professionals whose goal is to ensure that our products reach customers around the globe.\n•\nDiverse and differentiated global portfolio\n includes products in more than 10 major therapeutic areas, including both infectious diseases and NCDs, and medicines that help treat the top 10 leading causes of death globally, as determined by the WHO. We are a leading supplier of medicines to the HIV/AIDS community around the world, with a legacy of providing access to high-quality and affordable ARVs in more than 100 countries. \nWe believe that Viatris’ global leadership in all of these areas uniquely positions us to efficiently and effectively serve patients regardless of geography or circumstance. Together, with our commitment to provide access to a sustainable, affordable, and diverse portfolio of high-quality medicines and our goal to be a Partner of Choice® for companies big and small, Viatris works to improve access and meet evolving healthcare needs around the world.\n10\nTable of Contents\n \nPARTNERSHIP\n \nLeveraging our collective expertise to connect people to products and services. \nPartnerships and collaborations are critical, as are policies and strong healthcare systems that allow for healthy competitive environments. We have a strong history of playing a leading role by partnering with other pharmaceutical companies, nonprofit organizations, government agencies, policymakers, trade associations and alliances, industry researchers and patient advocacy groups to promote sustainable access to treatment, build more resilient healthcare systems and drive these issues within our industry on global, regional and local levels. Many of our collaborations focus on access to medicine; public awareness and disease screening; and healthcare professional education and support. \nGlobal Healthcare Gateway® Built to Fuel Growth and Partnerships\nThe Company’s Global Healthcare Gateway® offers partners ready access to more markets and patients worldwide through the Company’s unique global infrastructure and expertise, connecting more people with even more products and services they may not have the resources to reach on their own. The Company is actively engaging with potential business partners to help them accelerate possibilities of using their own healthcare assets to reach more markets and patients by leveraging Viatris’ unique global platform – its R&D, supply chain, manufacturing, regulatory, commercial and legal expertise. With the global platforms and infrastructure supporting its innovative Global Healthcare Gateway®, the Company is enhancing its capital allocation approach to business development, and its organic and inorganic R&D investments through a focused governance structure to ensure the highest level of strategic decision-making. \nA recent example of how the Company is utilizing its Global Healthcare Gateway® is the October 2024 exclusive licensing agreement with Lexicon for sotagliflozin in all markets outside of the U.S. and Europe. This licensing agreement leverages Viatris’ expertise in cardiovascular diseases and is another example of how the Company is continuing to expand its innovative portfolio by identifying, vetting and securing highly innovative, patent-protected assets that address significant unmet medical needs. \nLicensing and Other Partner Agreements\nViatris periodically enters into commercial licensing and other partner agreements with other pharmaceutical companies for the development, manufacture, marketing and/or sale of pharmaceutical products. Doing so helps the Company share risks and costs, leverage strengths and scale up commercialization, but usually requires the Company to also share future profits. The result often is that medicines become available sooner and to a significantly larger group of patients.\nThe Company’s significant licensing and other partner agreements are focused on the development, manufacturing, supply and commercialization of multiple, high-value generic compounds, respiratory products, and other complex or innovative products. Refer to Note 18 \nLicensing and Other Partner Agreements\n included in Part II, Item 8 of this Form 10-K for more information. As the Company continues to expand its portfolio\n \nof more innovative, best-in-class, patent-protected assets, the Company may enter into more financial commitments in connection with agreements with its collaboration partners that provide for certain services, as well as cross manufacturing, development and licensing arrangements. For additional information, see Part I, Item 1A Risk Factors – \n“We may not realize the intended benefits of, or achieve the intended goals or outlooks with respect to, our strategic initiatives and priorities, including divestitures, acquisitions or other potential transactions.”\nOperations\nViatris has developed an end-to-end experience across the total product life cycle, which includes global regulatory licensing, launch, growth and post-approval lifecycle management. Our research, development and medical platform seeks to maximize the impact of our existing portfolio by examining whether there is an opportunity for new indications, label extensions, formulations, and market registrations for our products. We also use our platform to determine whether there is an opportunity to integrate new products into our portfolio.\n11\nTable of Contents\n \nThe manufacturing of API and finished dosage forms is currently performed by a combination of internal and external manufacturing operations. After completing the divestiture of our API business in India, we continue to maintain some selective R&D capabilities in API and believe we have access to adequate API supplies through a manufacturing and supply agreement with the API business buyer and our arrangements with other manufacturers. For additional information, see Part I, Item 1A Risk Factors - “\nWe have a limited number of manufacturing facilities and certain third-party suppliers produce a substantial portion of our API and products, some of which require a highly exacting and complex manufacturing process.\n” of this Form 10-K.\nThe Company’s significant manufacturing, warehousing and distribution activities are located primarily in the U.S., Puerto Rico, Singapore, India, Australia, China, and certain EU countries, including Ireland. In addition, we maintain administrative facilities around the world. While many of these key facilities are owned, Viatris also leases certain facilities from third parties.\nThe Company believes all its facilities are in good operating condition, the machinery and equipment are well-maintained, the facilities are suitable for their intended purposes, and they have capacities adequate for the current operations.\nFacilities and records related to our products are subject to periodic inspection by the FDA, the EMA and other regulatory authorities in jurisdictions where the Company’s products are marketed. In addition, authorities often conduct pre-approval plant inspections to determine whether the Company’s systems and processes comply with current GMP and other regulations, and clinical-trial reviews to evaluate regulatory compliance and data integrity. Our suppliers, contract manufacturers, clinical trial partners and other business partners are subject to similar regulations and periodic inspections. The Company remains committed to maintaining the highest quality manufacturing standards at its facilities around the world and to continuous assessment and improvement in a time of evolving industry dynamics and regulatory expectations.\nFollowing an inspection by the FDA at our oral finished dose manufacturing facility in Indore, India in 2024, the FDA has issued a warning letter, and an import alert related to this facility. The import alert affects 11 actively distributed products that will no longer be accepted into the U.S. until the warning letter is lifted. It makes exceptions, subject to certain conditions, for four products based on shortage concerns. Following recently concluded discussions with the FDA, the Company does not expect additional product exceptions to be granted by the FDA.\nFollowing the substance of FDA’s original inspection observations, the Company immediately implemented a comprehensive remediation plan at the site. The necessary corrective and preventive actions are well underway, including but not limited to related personnel actions. Additionally, we have engaged independent third-party subject matter experts to support the remediation plan.\nWe have been in regular communication with FDA during this process and will continue to work to ensure that the FDA is satisfied with the steps we have taken to resolve all the points raised. Our responses to the warning letter and import alert were submitted within the required time periods.\nWhile product continues to be shipped from the Indore facility to markets outside the U.S., some impact in other markets, including the ARV business in Emerging Markets and select generic products in Europe, is anticipated. The Company currently estimates the negative impact to 2025 total revenues to be approximately $500 million and to 2025 earnings from operations to be approximately $385 million.\nWe take very seriously our continued and comprehensive oversight of our entire manufacturing network. Patient safety remains our primary and unwavering focus. We will work closely with our customers to mitigate any possible supply disruptions and meet the needs of the patients we serve.\nFor additional information, see Part I, Item 1A Risk Factors - “\nThe pharmaceutical industry is heavily regulated, and we face significant costs and uncertainties associated with our efforts to comply with applicable laws and regulations.\n” of this Form 10-K.\nCustomers and Marketing\nOur customers include retail and pharmacy establishments, wholesalers and distributors, payers, insurers and governments, and institutions, such as hospitals, among others. See “Channel Types” below for more information about our customers.\n12\nTable of Contents\n \nThe table below displays the percentage of consolidated net sales to our largest customers during the years ended December 31, 2024, 2023 and 2022:\nPercentage of Consolidated Net Sales\n2024\n2023\n2022\nMcKesson Corporation\n*\n10 \n%\n11 \n%\nCencora, Inc. (formerly AmerisourceBergen Corporation)\n12 \n%\n10 \n%\n10 \n%\nCardinal Health, Inc.\n*\n5 \n%\n5 \n%\n*\n     Net sales represented less than 10% of consolidated net sales during the period.\nWe serve our customers through a team of highly-skilled sales and marketing professionals, all of whom are focused on establishing Viatris as our customers’ partner of choice. To best meet customers’ needs, the Company manages its business on a geographic basis.\nIn addition to being dynamic, the pharmaceutical industry is complex. How it functions, how it is regulated and how it provides patients access varies by location. Similarly, competition is affected by many factors. Examples of factors include innovation and development, timely approval of prescription drugs by health authorities, manufacturing capabilities, product quality, marketing effectiveness, portfolio size, customer service, consumer acceptance, product price, political stability and the availability of funding for healthcare.\nCertain parts of our business also are affected by seasonality, e.g., due to the timing and severity of peak cough, cold and flu incidence, which can cause variability in sales trends for some of our products. While seasonality may affect quarterly comparisons within a fiscal year, it generally is not material to our annual consolidated results.\nFor these and other reasons, the Company’s sales and marketing efforts vary accordingly by product, market and channel type, each of which is described below. \nSee the \nApplication of Critical Accounting Policies\n section in Part II, Item 7 of this Form 10-K for more information related to customer arrangements.\nProducts\nFrom cardiovascular health to oncology, Viatris offers quality treatment options across more than 10 major therapeutic areas covering a wide variety of noncommunicable and infectious diseases. We also offer support services such as diagnostic clinics, educational seminars and digital tools to help patients better manage their health. We offer a broad and diverse range of treatment options across all our therapeutic areas, with many categories containing several products in a range of dosage forms, formulations and delivery systems that allow physicians to tailor care for optimal treatment.\nAs the Company looks to the future, Viatris’ goal is to leverage its proven scientific capabilities to create a durable and higher-margin portfolio of products. Viatris intends to continue building its pipeline and focusing on products with greater complexity while also investing in the lifecycle management of certain key products in our current portfolio. The Company is also expanding further beyond its current scope into more innovative products, including innovative, best-in-class, patent-protected assets that address areas of significant unmet medical need. The Company is further enhancing its commercial and scientific capabilities as needed for this future portfolio and intends to increase its R&D investment as well as inorganically grow via business development through its Global Healthcare Gateway®.\nViatris currently markets prescription branded and generic drugs, including complex drugs.\nBranded drugs\n are typically prescription\n \npharmaceuticals that are sufficiently novel as to be protected by patents or other forms of exclusivity. As such, these drugs, which bear trade names, may be produced and sold only by those owning the rights, subject to certain challenges that other companies may make. Developing new medicines can take years and significant investment. Only a few promising therapies ever enter clinical trials. Fewer still are approved for sale by health authorities, at which point marketing to healthcare providers and consumers begins. Because patents and exclusivities last many years, they serve as an incentive to developers. During the periods protected, developers often recoup their investments and earn a profit. In many high-income countries, the brand business often is characterized by higher margins on lower volumes - especially as compared with generic manufacturers. Viatris has numerous branded drugs, including iconic brands, as well as several global key brands to help patients manage their health. Brand drugs include branded generics which are off-patent products that are \n13\nTable of Contents\n \nsold under an approved proprietary name for marketing purposes. Brand products often become branded generics once patent protections or other forms of exclusivity expire. Branded generic products are common in many countries outside the U.S., including emerging markets. Brand and branded generic products are more sensitive to promotion than are unbranded generic products. They therefore represent the primary focus of most of our sales representatives and product-level marketing activity. Our remaining OTC products, which are sold directly to consumers without a prescription and without reimbursement, are generally sold under a brand name. \nGeneric drugs\n are therapeutically equivalent versions of brand drugs. Generics generally become available once the patents and other exclusivities on their branded counterparts expire. The generics business is generally characterized by lower margins on higher volumes of a relatively large number of products. Our generic medicines work in the same way and provide the same clinical benefits as their as their brand-name counterparts and may cost less, providing patients and the healthcare system important savings and options which we believe are essential to making healthcare accessible. The manufacturing of generic medicines is held to the same standards of GMP by health authorities as the manufacturing of branded medicines. National health authorities inspect our facilities around the world to ensure that generic manufacturing, packaging and testing sites pass the same quality standards as those of brand drugs. Generic products typically are sold under their INNs. INNs facilitate the identification of pharmaceutical substances or API. Each INN is unique and globally recognized. A nonproprietary name also is known as a generic name. \nComplex drugs\n are medicines that could have a complex active ingredient, complex formulation, complex route of delivery or complex drug device combinations. Viatris offers a number of these important medicines to patients, including Breyna™ Inhalation Aerosol, the first FDA-approved generic version of Symbicort®, Wixela Inhub®, the first generic of ADVAIR DISKUS® and glatiramer acetate injection, a generic version of Copaxone®. Our current complex products are considered generics and are included within our generics revenue category.\nWhile Viatris will continue to diligently pursue important generics opportunities, the Company will increasingly focus on limited-competition complex and novel products targeting gaps in care, all with a first-to-market emphasis and serving our mission of patient access. The Company believes innovative and complex products categories are critical to patient health and are growing at a rapid pace.\nWe also often incur substantial litigation expense as a result of defending or challenging brand patents or exclusivities, which is described further in Note 19 \nLitigation \nincluded in Part II, Item 8 of this Form 10-K.\nMarket Types\nViatris focuses its sales and marketing efforts on the people who make key decisions around pharmaceutical prescribing, dispensing or buying. Decision makers vary by country or region, reflecting law and custom, giving rise to different types of pharmaceutical markets. Many countries feature a mix of or hybrids of various market types, though the Company may focus on just one type in a particular country.\nIn \nprescription\n markets, physicians decide which medicines patients will take. Pharmacies then dispense the products as directed. Drug companies employ sales forces to educate doctors about the clinical benefits of their products. Representatives call on individual doctors or group practices; the process is known as detailing. Examples of countries served by Viatris that are mainly prescription markets are the U.S. brand business, China, Turkey, Poland and Mexico.\nIn \nsubstitution\n markets, pharmacists generally are authorized (and in some cases required) by law to dispense an unbranded or branded generic, if available, in place of a brand-name medicine, or vice versa. Drug companies may use sales forces in these markets too, with representatives calling on and educating pharmacy personnel about their organization and products. Examples of countries served by Viatris that are mainly substitution markets are France, Italy, Spain, Portugal, Japan and Australia.\nIn \ntender\n markets, payers, such as governments or insurance companies, negotiate the lowest price for a drug (or group of drugs) on behalf of their constituents or members. In exchange, the chosen supplier’s product is placed on the payer’s formulary, or list of covered prescriptions. Often, a supplier’s drug is the only one available in an entire class of drugs. Large sales forces are not needed to reach these decision-makers. Examples of generic markets served by Viatris that are mainly tender markets are New Zealand, Sweden, South Africa, as well as Germany.\nIn \ndistribution\n markets, retailers and wholesalers make drug-purchasing decisions. Large sales forces are not needed to reach the decision-makers representing these organizations. Note, however, that pharmacists operating in distribution markets \n14\nTable of Contents\n \nalso may be authorized to make substitution decisions when dispensing medicines. Examples of countries served by Viatris that are mainly distribution markets are the U.S. generics business, the U.K. and Norway.\nThe allocation of our sales and marketing resources reflects the characteristics of these different market types. \nFor our remaining OTC products, consumers are the decision-makers. OTC products are commonly sold via retail channels, such as pharmacies, drugstores and supermarkets. This makes their sale and marketing comparable to other retail businesses, with broad advertising and trade-channel promotion. Consumers often are loyal to well-known OTC brands. For this reason, suppliers of OTC products, Viatris included, must invest the time and resources needed to build strong OTC brand names. \nChannel Types\nViatris’ products make their way to patients through a variety of intermediaries, or channels. \nPharmaceutical\n \nwholesalers/distributors\n purchase prescription medicines and other medical products directly from manufacturers for storage in warehouses and distribution centers. The distributors then fill orders placed by healthcare providers and other authorized buyers.\nPharmaceutical\n \nretailers\n purchase products directly from manufacturers or wholesalers/distributors. They then sell them to consumers in relatively small quantities for personal use.\nInstitutional pharmacies\n address the unique needs of hospitals, nursing homes and other such venues. Among the services provided are specialized packaging, including for injectables and unit-dose products, for controlled administration.\nMail-order and e-commerce pharmacies\n receive prescriptions by mail, fax, phone or the internet at a central location; process them in large, mostly automated centers; and mail the drugs to the consumer.\nSpecialty pharmacies\n focus on managing the handling and service requirements associated with high-cost and more-complex drug therapies, such as those used to treat patients with rare or serious diseases.\nBusiness Segments\nViatris has four reportable segments: Developed Markets, Greater China, JANZ, and Emerging Markets. The Company reports segment information on the basis of markets and geography, which reflects its focus on bringing its large and diversified portfolio of branded and generic products, including complex products, to people in markets everywhere. \nDeveloped Markets \nThe Developed Markets segment comprises our operations primarily in North America and Europe. The Company’s business in North America is driven mainly by operations in the U.S., where the Company is one of the largest providers of prescription medicines. The U.S. pharmaceutical industry is very competitive, and the primary means of competition are innovation and development, timely FDA approval, manufacturing and supply chain capabilities, product quality, marketing, portfolio size, customer service, reputation and price. Viatris relies on a flexible and cost-effective supply chain to meet the rapidly changing needs of its customers around a reliable, high-quality supply of pharmaceutical products. Europe, where many governments provide healthcare at a low direct cost to consumers and regulate pharmaceutical prices or patient reimbursement levels, continues to be a highly competitive market, especially in terms of pricing, quality standards, service levels and product portfolio. Viatris’ leadership position in a number of countries provides the Company a platform to fulfill the needs of patients, physicians, pharmacies, customers and payors.\nSignificant products sold by the Developed Markets segment include Lyrica®, Lipitor®, Creon®, Influvac®, Wixela Inhub®, EpiPen® Auto-Injector, Fraxiparine®, and Yupelri®.\nNew product launches are an important growth driver. Important recent launches include Breyna™ and lisdexamfetamine in the U.S., and Rivaroxaban in certain European markets.\nWhile Viatris’ U.S. customer base is extensive, it comprises a small number of very large firms as the pharmaceutical industry has undergone tremendous change and consolidation. Viatris believes it is well positioned to serve such customers in the Developed Markets due to the scale it has built in terms of R&D, supply chain, and portfolio breadth.\n15\nTable of Contents\n \nGreater China\nThe Greater China segment includes our operations in mainland China, Taiwan, and Hong Kong. The Viatris Greater China portfolio predominantly consists of branded LOE products.  \nIn China, the recent healthcare reform measures are aimed at controlling the overall healthcare costs, while providing better and broader care to the population. Healthcare spending is expected to increase in-line with GDP growth. The VBP policy for LOE molecules is now in its sixth year and includes approximately 400 molecules. All major Viatris brands are included in the VBP molecule lists. The Company has re-balanced its business to expand its focus on the retail pharmacy and e-commerce channels while maintaining its presence in the hospital channel. Healthcare consumerism, increased spending power, and demand for premium medical products have generated strong growth in these new channels and partially absorbed the reductions seen in the hospital channel due to VBP. Additional pricing and volume pressure for pharmaceutical products sold in the hospital channel is expected to continue during 2025 and could negatively impact the Company’s results of operations. For additional information, see Part I, Item 1A Risk Factors - “\nWe have and may continue to experience pressure on the pricing of and reimbursements for certain of our products due to pricing controls, social or government pressure to lower the cost of drugs, and consolidation across the supply chain.\n” of this Form 10-K.\nSignificant products within the Greater China segment include Lipitor®, Norvasc®, and Viagra®.\nJANZ\nThe JANZ\n \nsegment consists of our operations in Japan, Australia and New Zealand. In Japan, the National Health Insurance regulates the pricing of pharmaceutical products to healthcare providers. The Company sells products in Japan primarily through a network of wholesalers who then sell the products to doctors, hospitals and pharmacies. In Australia, the healthcare system is a mix of public and private healthcare sectors, with Medicare, Australia’s public healthcare system, covering most of the country’s medical costs. The Department of Health oversees healthcare governance, law, and policy while the various state and territory governments administer the system. Most prescription pharmaceutical products are subsidized under the pharmaceutical benefits scheme by the federal government. Pricing of reimbursed pharmaceutical products is regulated by the government and funded via the Medicare levy and through company and patient contributions. The Company sells products primarily through the wholesale system, while promoting its products to both physicians and pharmacists.\nSignificant products within the JANZ segment include AMITIZA®, Effexor®, Lipacreon®, Lyrica®, and EpiPen® Auto-Injector.\nEmerging Markets\nThe Emerging Markets segment encompasses our presence in more than 125 countries with developing markets and emerging economies including in Asia, Africa, Eastern Europe, Latin America and the Middle East as well as the Company’s ARV franchise. With healthcare at various stages of development across these markets, we believe we are positioned to not only leverage our large geographical footprint to maximize the similarities between these markets, but also tailor solutions to meet local need. There is demand in this segment for better healthcare to serve a growing population and economic expansion. Many countries in this segment are brand-conscious with generic penetration rates lower than developed markets. \nAmong Viatris products sold in the segment are Lipitor®, Lyrica®, Norvasc®, Celebrex®, and ARVs.\nRefer to Note 15 \nSegment Information\n included in Part II, Item 8 of this Form 10-K for more information about the Company’s segments.\nGovernment Regulation\nRegulation by governmental authorities is a significant factor in the R&D, production, marketing, sales and distribution of pharmaceuticals. Viatris’ products are subject to robust developmental studies which include analytical determinations of strength, quality, purity as well as rigorous safety and efficacy determinations using preclinical, pharmacokinetic studies and clinical evaluations to gather data to support regulatory review and approval. This body of work results in extensive data and scientific information that is incorporated into a given product’s regulatory dossier. Manufacturing is conducted under exacting conditions governed by extensive regulation including strict in-process and finished pharmaceutical products specifications and controls. Post-approval activities, such as advertising and promotion, pharmacovigilance, post-marketing regulatory commitments, and pharmacopeial monographs, are also subject to extensive regulation and controls.\n16\nTable of Contents\n \nThe lengthy process of developing products and obtaining required approvals and the continuing need for post-approval compliance with applicable statutes and regulations require the expenditure of substantial resources. Regulatory approval, if and when obtained, may be limited in scope. Further, approved drugs, as well as their manufacturers, are subject to ongoing post-marketing review and inspection, which can lead to the discovery of previously unknown attributes of the products or the manufacturing or quality control procedures used in their production, which may impact the marketing of the products or result in restrictions on their manufacture, sale or use or in their withdrawal from the market. \nAny failure or delay by Viatris, its suppliers of manufactured drug product, collaborators or licensees, in obtaining and maintaining regulatory approvals could adversely affect the marketing of our products and our ability to receive product revenue, license revenue or profit-sharing payments.\nOther Regulatory Requirements\nViatris’ business is subject to a wide range of various other federal, state, national, regional, provincial, non-governmental, and local agency rules and regulations. They focus on fraud and corruption, pricing and reimbursement, data privacy, and the environment, among many other considerations. For more information about certain of these regulations and the associated risks the Company faces, see Part I, Item 1A Risk Factors of this Form 10-K.\nResearch and Development\nViatris’ R&D organization, which includes developers and regulatory and clinical experts, works collaboratively across the Company’s different R&D centers around the world, which include technology-focused development sites and global R&D centers. \nViatris’ research, development and clinical platform, which includes regulatory activities, seeks to deliver new product opportunities across all of the Company’s categories and markets and to evaluate opportunities to expand the scope of our existing product portfolio with a focus on development activities. The Company’s product pipeline includes a variety of dosage forms, including oral solid dosage forms, transdermals, injectables, inhalation, and other delivery systems. While committed to generics and specialty products, over the last several years, a greater portion of the Company’s investments has been focused on complex or difficult-to-formulate products, such as modified release or complex injectables such as glucagon, rather than on commodity products, such as conventional oral solid dosage forms. For example, the Company is working on a number of programs including the potential to be first-to-market for our generics of Abilify Maintena®, Injectafer®, Invega Trinza®, Ozempic®, Venofer® and Wegovy™. The Company is also working with its partners on novel and/or complex products such as our biosimilar to BOTOX® (onabotulinumtoxinA). \nAs previously mentioned, one of the Company’s strategic pillars is our focus on expanding our innovative portfolio to identify, vet and secure best-in-class, patented-protected assets that address areas of significant unmet medical need. Viatris invests a significant amount of capital and resources in R&D, and this amount is likely to increase as we focus on more complex and innovative products to drive accelerated and durable growth, and build a more durable higher margin portfolio with exclusivity opportunities. In addition to increasing its R&D and IPR&D investment, the Company also expects to inorganically grow via business development through strategic alliances with partners, including through our Global Healthcare Gateway® and agreements with collaboration partners. For additional information, see Part I, Item 1A Risk Factors - \n“We expend a significant amount of resources on R&D efforts that may not lead to successful product introductions.”\n of this Form 10-K.\nIntellectual Property\nViatris considers the protection of its intellectual property rights to be extremely valuable, and the Company acts to protect them from infringement by third parties.\nViatris has an extensive trademark portfolio totaling more than 28,700 trademarks filed globally and routinely apply to register key brand names, generic names, branded generic names, and trade names in numerous countries around the world. The Company’s registered trademarks are renewable indefinitely, and are maintained in accordance with the laws of the countries in which they are registered.\nThe Company also has an extensive patent portfolio and actively files for patent protection in various countries to protect its brand-name, generic, branded generic, and remaining OTC products, including processes for making and using them. The Company has more than 2,400 patents filed globally. For additional information, see Part I, Item 1A Risk Factors - “\nWe \n17\nTable of Contents\n \nrely on the effectiveness of our patents, trademarks, confidentiality agreements and other measures to protect our intellectual property rights.\n” of this Form 10-K.\nFurther, Viatris has well-established safeguards in place to protect our proprietary know-how and trade secrets, both of which the Company considers extremely valuable to its intellectual property portfolio. \nThe Company looks for intellectual property licensing opportunities to or from third parties, related not only to our existing products, but as a means for expanding our product portfolio.\nViatris relies on the aforementioned types of intellectual property, as well as our copyrights, trade dress, regulatory exclusivities and contractual protections, to establish a broad scope of intellectual property rights for our product portfolio. \nSustainability\nTo learn about Viatris’ sustainability work, the Company encourages you to read Viatris’ 2023 Sustainability Report: Building Sustainable Access at Scale\n1\n, published in May 2024. The report highlights Viatris’ actions and initiatives across multiple areas of focus in support of the Company’s efforts to continue to be a model for sustainable access to medicine and to make an impact in the communities it serves. It also reports on how the Company progressed in 2023 on its companywide sustainability goals in the areas of: access and global health; workplace culture; and environment (climate, water, and waste). This includes the Company’s scope 1 & 2, as well as its scope 3 emission reduction targets validated and approved by the Science Based Targets initiative (SBTi).\nViatris’ recent accolades include inclusion on TIME’s inaugural list of World’s Most Sustainable Companies, USA Today’s list of America’s Climate Leaders, Forbes’ World’s Best Employers, and TIME’s World’s Top Companies for Women.\nThe following highlights Viatris’ systematic efforts and progress across key areas:\nAccess and Global Health\nAccess is fundamental to Viatris’ mission. It begins with the Company’s ability to sustainably deliver quality medicines to people, regardless of geography or circumstance. \nThe Company is focused on striving to meet individual needs, whether with a generic medicine, a trusted brand, an improved version of an existing medicine, or a truly novel therapeutic solution.\nViatris goes beyond developing, manufacturing, and distributing quality medicines. With the needs of people at the center, Viatris often works to help find solutions that support resilient healthcare systems. The Company has designed its global operations and supply chain to be a reliable and flexible partner for access across the world, constantly adapting to an ever-evolving landscape.\nViatris pursues holistic approaches to prevention, diagnosis, treatment, and disease management. The Company works to build public health awareness, to support and implement research, to deliver access to health education, and to advocate for public policies that advance sustainable access at scale, globally.\nViatris is keenly aware that no one can meet this high aspiration alone. Partnerships and collaborations are critical, as are policies and strong healthcare systems that allow for healthy competitive environments. The need is universal, and Viatris works with an array of both public and private organizations, globally, regionally, and locally, to support sustainable access to quality medicines at consistent quality standards.\nEnvironmental Stewardship\nWe are committed to minimizing our impact on the environment while working to safeguard a reliable supply of medicine. Our commitment entails systematic and continuous work, and a global integrated approach to managing our impact on and from climate change, energy efficiency and renewable energy, water and waste reduction, and air emissions.  \n1\n  Please note that our website, Sustainability Report and their respective contents are not incorporated by reference into this Form 10-K.\n18\nTable of Contents\n \nAs part of having our scope 1 & 2, and scope 3 emission reduction targets validated and approved by SBTi, SBTi classified Viatris’ scope 1 & 2 targets as being aligned with the 1.5°C trajectory. Further, we have updated our initial climate scenario analysis, a key recommendation of the Task Force on Climate-Related Financial Disclosures, to reflect recent divestiture activity. The analysis is global in scope and helps us to continue to understand the risk and uncertainties in different hypothetical scenarios and confirm areas of focus. Key actions and strategies for making progress toward our SBTi climate targets include increasing renewable energy usage, implementing energy-efficiency projects, preventing refrigerant leaks and transitioning to greener refrigerants, using alternative fuels and technologies, and leveraging infrastructure upgrades and utility replacement projects. While it is very hard to predict accurately the future costs associated with compliance with environmental laws, this is not expected to require significant capital expenditures and has not had, and is not expected to have, a material adverse effect on our operations or competitive position.\nViatris remains engaged in promoting environmentally responsible supply chains, including through the Company’s compliance with the AMR Industry Alliance’s Common Antibiotic Manufacturing Standard in its operations and its commitment to the standard’s implementation across Viatris’ external supply chain. Viatris’ manufacturing for all dosages of the antibiotic Ciprofloxacin at the Company’s facility in Aurangabad, India, became the first at Viatris to receive British Standards Institute (BSI) Certification under the Antibiotic Manufacturing Standard. Furthermore, Viatris is leveraging its membership in the Pharmaceutical Supply Chains Initiative in external supplier sustainability engagement.\nCommunity Engagement\nViatris seeks to foster healthy communities around the world by supporting education, health and disease awareness efforts that, in particular, promote empowering patients and creating access to care. The Company works via in-kind and monetary donations, volunteering time and talents and engaging with partners to find solutions. The Company’s work addresses common global themes and leverages Viatris colleagues’ collective capabilities, while addressing unique local needs. \nViatris has continued its humanitarian support for emergency response to assist victims of armed conflicts, disasters and extreme weather. Together with long-term partners including but not limited to, Direct Relief, Save the Children, SBP, World Central Kitchen, and the American Red Cross, the Company has supported medical relief shipments, access to food and long-term rebuilding efforts. Furthermore, Viatris colleagues across the globe have done beach cleanups, community fundraisers, and participated in volunteer opportunities to raise money and awareness for patients living with diseases as a part of a larger global initiative called Building Healthier Communities.\nBusiness partnerships, collaboration within and across sectors, memberships, and philanthropic collaborations help us serve patients, healthcare systems and communities worldwide.\nHuman Capital\nOur people\nOur approximately 32,000 colleagues are passionate about our mission, and together we are building a performance-driven, highly engaging and inclusive culture where diverse perspectives drive access, innovation and our ability to make an impact in the world.\nIn 2024, the Company received several recognitions, such as inclusion on Forbes’ World’s Top Companies for Women list, Forbes’ World’s Best Employers list, TIME’s World’s Most Sustainable Companies list, USA Today’s America’s Climate Leaders list, National Association for Business Resources’ Nation’s Best & Brightest in Wellness list and Newsweek’s America’s Greenest Companies list. \nIn previous years, Viatris has also been included on Forbes’ World’s Best Employers list, USA Today’s America’s Climate Leaders list, 3BL 100 Best Corporate Citizens list, TIME’s World’s Best Companies list, Fast Company’s Most Innovative Companies list, Fortune’s Change the World list, and Newsweek’s America’s Most Responsible Companies list. Viatris has also received several local accolades in 2024 and previous years, such as Great Place to Work® and Top Employers certifications in multiple countries, among many others.\nOur colleagues are dedicated to our mission and we continue to build our culture with a focus on colleague experience and engagement; learning and development; career progression; workplace culture; talent attraction and our deep commitment to the health, safety and wellbeing of our colleagues, their families and the communities we serve.\n19\nTable of Contents\n \nWe remain committed to building upon our foundations, harmonizing our processes and programs and initiating many firsts for Viatris. Our commitment to wellbeing has grown with the launch of our Elevate program focused on the health, purpose and growth of our colleagues. This program is fully supported by an active and engaged employee-led group of ambassadors through the Viatris Elevate Champions network. We are living the Viatris mission internally by providing 100% of all colleagues globally access to Elevate tools and resources including many local programs to further support health and wellbeing, with a focus on mental health through employee assistance programs and our new partnership with Unmind. \nWe have expanded our professional development opportunities, including a focus on executive and management development, and we have continued to build core programming to support colleagues at all stages of life and career. Viatris has successfully introduced new and differentiated core capabilities to enhance our performance and growth aligned with the Company’s strategy moving forward. We believe we have a deep talent bench of core generics and expanding innovative capabilities to help drive our future forward. Through regular annual objective setting and talent assessment practices, the Company believes it provides tools and resources that enable high performance.\nAt Viatris, diverse perspectives drive innovation and our ability to make an impact in the world. The workplace culture  we foster can be one of our greatest strengths in achieving breakthroughs that help empower people to live healthier at every stage of life.\nOur Employee Resource Groups have expanded to include EmpoWer advocating for an ecosystem that empowers women to reach their full potential; VIVID supporting LGBTQ+ employees and allies; RISE supporting our colleagues of African descent; and Care, advocating for caregivers. The insights from our employee listening strategy guide our efforts as we continually strive to create a work environment where people can learn, grow, feel appreciated and make an impact in the world.\nHealth and Safety \nProtecting the health and safety of our colleagues is essential at Viatris. We have a global Environmental, Health and Safety Management System, technical requirements, processes and systems that establish the foundation of our health and safety program. This focus, along with our deep commitment to wellbeing, applies to all locations and guides us in cultivating a culture of health and safety throughout our global workforce. \nExchange Act Reports\nViatris maintains a website at Viatris.com where you can find certain reports and associated amendments that the Company files with the SEC in accordance with the Exchange Act. These filings will include our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and any amendments to those reports.\nWe make this information available on our website free of charge, as soon as reasonably practicable after we electronically file such material with, or furnish it to, the SEC. The contents of our website are not incorporated by reference in this Annual Report on Form 10-K and shall not be deemed “filed” under the Exchange Act. \nThe SEC also maintains a website (www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC.\n20\nTable of Contents",
  "item7": "ITEM 7.\nManagement’s Discussion and Analysis of Financial Condition And Results of Operations \nThe following discussion and analysis addresses material changes in the financial condition and results of operations of Viatris Inc. and subsidiaries for the periods presented. Unless context requires otherwise, the “Company,” “Viatris,” “our” or “we” refer to Viatris Inc. and its subsidiaries. \nThis discussion and analysis should be read in conjunction with the consolidated financial statements and the related notes to consolidated financial statements included in Part II, Item 8 in this Form 10-K, and our other SEC filings and public disclosures. \nThis Form 10-K contains “forward-looking statements”. These statements are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. Such forward-looking statements may include, without limitation, \nstatements about the goals or outlooks with respect to the Company’s strategic initiatives and priorities, including but not limited to divestitures, acquisitions, strategic alliances, collaborations, or other potential transactions;\n the benefits and synergies of such divestitures, acquisitions, \nstrategic alliances, collaborations, \nor other transactions, or restructuring programs; future opportunities for the Company and its products; and any other statements regarding the Company’s future operations, financial or operating results, capital allocation, dividend policy and payments, share repurchases, debt ratio and covenants, anticipated business levels, future earnings, planned activities, anticipated growth, market opportunities, strategies, competitions, commitments, confidence in future results, efforts to create, enhance or otherwise unlock value, and other expectations and targets for future periods. Forward-looking statements may often be identified by the use of words such as “will”, “may”, “could”, “should”, “would”, “project”, “believe”, “anticipate”, “expect”, “plan”, “estimate”, “forecast”, “potential”, “pipeline”, “intend”, “continue”, “target”, “seek” and variations of these words or comparable words. Because forward-looking statements inherently involve risks and uncertainties, actual future results may differ materially from those expressed or implied by such forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to:\n•\nthe possibility that the Company may not realize the intended benefits of, or achieve the intended goals or outlooks with respect to, its strategic initiatives and priorities (including divestitures, acquisitions, \nstrategic alliances, collaborations, \nor other potential transactions) or accelerate its growth by building on the strength of its base business with an expanding portfolio of innovative, best-in-class, patent-protected assets; \n•\nthe possibility that the Company may be unable to achieve intended or expected benefits, goals, outlooks, synergies, growth opportunities and operating efficiencies in connection with divestitures, acquisitions, \nstrategic alliances, collaborations, \nor other transactions, or restructuring programs, within the expected timeframes or at all;\n•\nthe ongoing risks and uncertainties associated with our recent divestitures; \n•\ngoodwill or impairment charges or other losses;\n•\nthe Company’s failure to achieve expected or targeted future financial and operating performance and results;\n•\nthe potential impact of natural or man-made disasters, public health outbreaks, epidemics, pandemics, or social disruption in regions where we or our partners or suppliers operate; \n•\nactions and decisions of healthcare and pharmaceutical regulators;\n•\nchanges in relevant laws, regulations and policies and/or the application or implementation thereof, including but not limited to tax, healthcare and pharmaceutical laws, regulations and policies globally;\n•\nthe ability to attract, motivate and retain key personnel;\n•\nthe Company’s liquidity, capital resources and ability to obtain financing; \n•\nany regulatory, legal or other impediments to the Company’s ability to bring new products to market, including but not limited to “at-risk launches”; \n•\nsuccess of clinical trials and the Company’s or its partners’ ability to execute on new product opportunities and develop, manufacture and commercialize products; \n•\nany changes in or difficulties with the Company’s manufacturing facilities, including with respect to inspections, remediation and restructuring activities, supply chain or inventory or the ability to meet anticipated demand; \n•\nthe scope, timing and outcome of any ongoing legal proceedings, including government inquiries or investigations, and the impact of any such proceedings on the Company; \n•\nany significant breach of data security or data privacy or disruptions to our IT systems;\n•\nrisks associated with having significant operations globally; \n•\nthe ability to protect intellectual property and preserve intellectual property rights;\n•\nchanges in third-party relationships; \n•\nthe effect of any changes in the Company’s or its partners’ customer and supplier relationships and customer purchasing patterns, including customer loss and business disruption being greater than expected following an adverse regulatory action, acquisition or divestiture; \n•\nthe impacts of competition, including decreases in sales or revenues as a result of the loss of market exclusivity for certain products; \n•\nchanges in the economic and financial conditions of the Company or its partners; \n•\nuncertainties regarding future demand, pricing and reimbursement for the Company’s products;\n54\nTable of Contents\n \n•\nuncertainties and matters beyond the control of management, including but not limited to general political and economic conditions, tariffs and trade policies, inflation rates and global exchange rates; and\n•\ninherent uncertainties involved in the estimates and judgments used in the preparation of financial statements, and the providing of estimates of financial measures, in accordance with U.S. GAAP and related standards or on an adjusted basis.\nFor more detailed information on the risks and uncertainties associated with Viatris, see the risks described in Part I, Item 1A in this Form 10-K, and our other filings with the SEC. You can access Viatris’ filings with the SEC through the SEC website at www.sec.gov or through our website, and Viatris strongly encourages you to do so. Viatris routinely posts information that may be important to investors on our website at investor.viatris.com, and we use this website address as a means of disclosing material information to the public in a broad, non-exclusionary manner for purposes of the SEC’s Regulation Fair Disclosure (Reg FD). The contents of our website are not incorporated by reference in this Form 10-K and shall not be deemed “filed” under the Securities Exchange Act of 1934, as amended. Viatris undertakes no obligation to update any statements herein for revisions or changes after the filing date of this Form 10-K other than as required by law.\nCompany Overview\nViatris is a global healthcare company whose breadth and scale we believe make it uniquely positioned to address healthcare needs globally. With a mission to empower people worldwide to live healthier at every stage of life, Viatris supplies high-quality medicines to approximately 1 billion patients around the world each year. The Company has a global footprint, an extensive portfolio of medicines that is well-diversified across therapeutic areas, a one-of-a-kind global supply chain designed to reach more people when and where they need them, and the scientific expertise to address some of the world's most enduring health challenges.\nViatris’ executive management team is focused on ensuring that the Company is optimally structured and efficiently resourced to deliver sustainable value to patients, shareholders, customers and other key stakeholders. The Company operates in more than 165 countries and territories with approximately 32,000 employees. The Company has 26 manufacturing and packaging sites worldwide, more than 1,400 approved molecules, and industry leading commercial, R&D, regulatory, manufacturing, legal and medical expertise. Viatris’ portfolio consists of generics (including complex products), globally recognized iconic brands, and an expanding portfolio of innovative medicines. Viatris is headquartered in the U.S., with global centers in Pittsburgh, Pennsylvania, Shanghai, China and Hyderabad, India.\nViatris has four reportable segments: Developed Markets, Greater China, JANZ, and Emerging Markets. The Company reports segment information on the basis of markets and geography, which reflects its focus on bringing its large and diversified portfolio of branded and generic products, including complex products, to people in markets everywhere. Our Developed Markets segment comprises our operations primarily in North America and Europe. Our Greater China segment includes our operations in mainland China, Taiwan and Hong Kong. Our JANZ segment consists of our operations in Japan, Australia and New Zealand. Our Emerging Markets segment encompasses our presence in more than 125 countries with developing markets and emerging economies including in Asia, Africa, Eastern Europe, Latin America and the Middle East as well as the Company’s ARV franchise. \nCertain Market and Industry Factors\nThe global pharmaceutical industry is a highly competitive and highly regulated industry. As a result, we face a number of industry-specific factors and challenges, which can significantly impact our results. The following discussion highlights some of these key factors and market conditions.\nThe process of obtaining regulatory approval to manufacture and market new branded and generic pharmaceutical products is rigorous, time consuming, costly, and inherently unpredictable. Complex products are more difficult, costly and time-consuming to receive regulatory approval for and bring to market. Any delay in regulatory approval could impact the commercial or financial success of a product. Regulatory approval, if and when obtained, may be limited in scope. Even if regulatory approvals for new products are obtained, the success of those products is dependent upon market acceptance.\nGeneric products, particularly in the U.S., generally contribute most significantly to revenues and gross margins at the time of their launch, and even more so in periods of market exclusivity, or in periods of limited generic competition. As such, the timing of new product introductions can have a significant impact on the Company’s financial results. The entrance into the market of additional competition generally has a negative impact on the volume and pricing of the affected products. Additionally, pricing is often affected by factors outside of the Company’s control. Conversely, generic products generally experience less volatility over a longer period of time in Europe as compared to the U.S., primarily due to the role of \n55\nTable of Contents\n \ngovernment oversight of healthcare systems in the region. In addition, U.S. governmental agencies provide funding for certain products in our Emerging Markets region. We expect that any reduction in that funding will have a negative impact on our financial condition, results of operations or cash flows.\nFor branded products, the majority of the product’s commercial value is usually realized during the period in which the product has market exclusivity. In the U.S. and some other countries, when market exclusivity expires and generic versions of a product are approved and marketed, there can often be very substantial and rapid declines in the branded product’s sales. For example, generic entry may occur for Amitiza® 24 μg in Japan in December 2025 upon expiration of patent exclusivity.\nCertain markets in which we do business outside of the U.S. have undergone government-imposed price reductions, and further government-imposed price reductions are expected in the future. Such measures, along with the tender systems discussed below, are likely to have a negative impact on sales and gross profit in these markets. However, government initiatives in certain markets that appear to favor generic products could help to mitigate this unfavorable effect by increasing rates of generic substitution and penetration. \nAdditionally, a number of markets in which we operate outside of the U.S. have implemented, or may implement, tender systems for generic pharmaceuticals in an effort to lower prices. Generally speaking, tender systems can have an unfavorable impact on sales and profitability. Under such tender systems, manufacturers submit bids that establish prices for generic pharmaceutical products. Upon winning the tender, the winning company will receive priority placement for a period of time. The tender system often results in companies underbidding one another by proposing low pricing in order to win the tender. Sales continue to be negatively affected by the impact of tender systems in certain countries.\nIn addition to the impact of competition, government pricing actions and other measures designed to reduce healthcare costs, our results of operations, cash flows and financial condition could also be affected by other risks of doing business internationally, including the impact of inflation, elections, geopolitical events, including the ongoing conflicts in the Middle East and between Russia and Ukraine and related trade controls, sanctions, supply chain and staffing challenges and other economic considerations, supply chain disruptions, foreign currency exchange fluctuations, public health epidemics, changes in intellectual property legal protections and other regulatory changes.\nRecent Developments\nLexicon Licensing Agreement\nIn October 2024, the Company entered into an exclusive licensing agreement with Lexicon for sotagliflozin in all markets outside of the U.S. and Europe in exchange for an upfront payment of $25.0 million, and additional potential contingent payments, including regulatory milestones, sales milestones and tiered royalties ranging from low-double-digit to upper-teens on annual net sales. Viatris will be responsible for all regulatory and commercialization activities for sotagliflozin in the licensed territories. Lexicon will be responsible for providing clinical and commercial supply of sotagliflozin to Viatris. The Company accounted for the transaction as an asset acquisition, with the upfront payment expensed as \nAcquired IPR&D\n in the fourth quarter of 2024.\nIndore Manufacturing Facility\nFollowing an inspection by the FDA at our oral finished dose manufacturing facility in Indore, India in 2024, the FDA has issued a warning letter, and an import alert related to this facility. The import alert affects 11 actively distributed products that will no longer be accepted into the U.S. until the warning letter is lifted. It makes exceptions, subject to certain conditions, for four products based on shortage concerns. Following recently concluded discussions with the FDA, the Company does not expect additional product exceptions to be granted by the FDA.\nFollowing the substance of FDA’s original inspection observations, the Company immediately implemented a comprehensive remediation plan at the site. The necessary corrective and preventive actions are well underway, including but not limited to related personnel actions. Additionally, we have engaged independent third-party subject matter experts to support the remediation plan.\nWe have been in regular communication with FDA during this process and will continue to work to ensure that the FDA is satisfied with the steps we have taken to resolve all the points raised. Our responses to the warning letter and import alert were submitted within the required time periods.\n56\nTable of Contents\n \nWhile product continues to be shipped from the Indore facility to markets outside the U.S., some impact in other markets, including the ARV business in Emerging Markets and select generic products in Europe, is anticipated. The Company currently estimates the negative impact to 2025 total revenues to be approximately $500 million and to 2025 earnings from operations to be approximately $385 million.\nWe take very seriously our continued and comprehensive oversight of our entire manufacturing network. Patient safety remains our primary and unwavering focus. We will work closely with our customers to mitigate any possible supply disruptions and meet the needs of the patients we serve.\nAcquisition of Idorsia Products\nOn March 15, 2024, the Company acquired exclusive global development and commercialization rights to two Phase 3 assets from Idorsia, as well as the potential to add additional innovative assets in the future. Under the terms of the original agreements, the development programs and certain personnel for selatogrel and cenerimod were transferred to Viatris from Idorsia in exchange for an upfront payment to Idorsia of $350 million, potential contingent milestone payments (including $300 million payable upon the achievement of certain development and regulatory milestones, and $2.1 billion payable upon the achievement of certain tiered sales milestones), as well as potential contingent tiered sales royalties. Viatris has worldwide commercialization rights for both selatogrel and cenerimod (excluding, for cenerimod only, Japan, South Korea and certain countries in the Asia-Pacific region). A joint development committee was formed to oversee the development of the ongoing Phase 3 programs through regulatory approval. The agreements also provide Viatris a right of first refusal and a right of first negotiation for certain other assets in Idorsia’s pipeline. Viatris and Idorsia are both contractually obligated to contribute to the development costs for both programs, which are expected to be incurred through 2026. There are risks and uncertainties associated with the timely and successful completion of these programs, including but not limited to the high cost and uncertainty of conducting clinical trials (particularly with respect to new and/or complex or innovative drugs), obtaining approval by relevant regulatory bodies and our partner’s financial condition. Refer to Note 4 \nAcquisitions and Other Transactions\n included in Part II, Item 8 of this Form 10-K for more information.\nOn February 25, 2025, in order to preserve the ongoing continuity of the development programs for selatogrel and cenerimod considering certain capital structuring steps announced by Idorsia to secure its ongoing operations, Viatris and Idorsia entered into a letter agreement to amend certain terms of the original agreements described above. Under the terms of the letter agreement, Viatris will receive additional territory rights in Japan, South Korea and certain other countries in the Asia-Pacific region for cenerimod, a $250 million reduction in contingent milestone payments, including $200 million of development milestones, and additional personnel to expedite transitioning the development programs to Viatris in exchange for Viatris assuming $100 million of Idorsia’s obligation to contribute to development costs. In addition, the letter agreement provides for the replacement of the joint development committee with a transition committee to oversee the transition of both development programs to Viatris.\nDivestitures\nIn October 2023, the Company announced it had received an offer for the divestiture of its OTC Business and had entered into definitive agreements to divest its women’s healthcare business, its API business in India, its rights to two women’s healthcare products in certain countries, and commercialization rights in the Upjohn Distributor Markets. The divestiture of the women’s healthcare business was primarily related to our oral and injectable contraceptives and did not include all of our women’s healthcare related products. The transaction to divest the Company’s rights to two women’s healthcare products in certain countries closed in December 2023 (other than in the U.K.), and the divestiture of the women’s healthcare business closed in March 2024. In the third quarter of 2024, the Company closed the divestiture of the product rights in the U.K. The divestitures of the commercialization rights in the majority of the Upjohn Distributor Markets closed during 2023 and 2024, the divestiture of our API business in India closed in June 2024, and the OTC Transaction closed in July 2024. Refer to Note 5 \nDivestitures\n included in Part II, Item 8 of this Form 10-K for more information.\n57\nTable of Contents\n \nFinancial Summary\nThe table below is a summary of the Company’s financial results for the year ended December 31, 2024 compared to the prior year period:\nYear Ended December 31,\n(In millions, except per share amounts)\n2024\n2023\nChange\nTotal revenues\n$\n14,739.3 \n$\n15,426.9 \n$\n(687.6)\nGross profit\n5,623.6 \n6,438.6 \n(815.0)\nEarnings from operations\n10.1 \n766.2 \n(756.1)\nNet (loss) earnings\n(634.2)\n54.7 \n(688.9)\nDiluted (loss) earnings per share\n$\n(0.53)\n$\n0.05 \n$\n(0.58)\nA detailed discussion of the Company’s financial results can be found below in the section titled “Results of Operations.” As part of this discussion, we also report sales performance using the non-GAAP financial measures of “constant currency” net sales and total revenues. These measures provide information on the change in net sales and total revenues assuming that foreign currency exchange rates had not changed between the prior and current period. The comparisons presented at constant currency rates reflect comparative local currency sales at the prior year’s foreign exchange rates. We routinely evaluate our net sales and total revenues performance at constant currency so that sales results can be viewed without the impact of foreign currency exchange rates, thereby facilitating a period-to-period comparison of our operational activities, and believe that this presentation also provides useful information to investors for the same reason.\nMore information about non-GAAP measures used by the Company as part of this discussion, including adjusted cost of sales, adjusted gross margins, adjusted EBITDA, adjusted net earnings, and adjusted EPS (all of which are defined below) can be found in Part II, Item 7 under \nResults of Operations\n and \nResults of Operations — Use of Non-GAAP Financial Measures\n.\nResults of Operations\n2024 Compared to 2023\nYear Ended December 31,\n(In millions, except %s)\n2024\n2023\n% Change\n2024 Currency Impact \n(1)\n2024 Constant Currency Revenues\nConstant Currency % Change \n(2)\nNet sales\nDeveloped Markets \n(3)\n$\n8,929.4 \n$\n9,251.9 \n(3)\n%\n$\n(5.3)\n$\n8,924.1 \n(4)\n%\nGreater China\n2,166.5 \n2,160.4 \n— \n%\n47.2 \n2,213.7 \n2 \n%\nJANZ\n1,346.2 \n1,424.5 \n(5)\n%\n81.4 \n1,427.6 \n— \n%\nEmerging Markets \n(3)\n2,250.7 \n2,551.6 \n(12)\n%\n116.2 \n2,366.9 \n(7)\n%\nTotal net sales\n14,692.8 \n15,388.4 \n(5)\n%\n239.5 \n14,932.3 \n(3)\n%\nOther revenues \n(4)\n46.5 \n38.5 \nNM\n0.1 \n46.6 \nNM\nConsolidated total revenues \n(3)(5)\n$\n14,739.3 \n$\n15,426.9 \n(4)\n%\n$\n239.6 \n$\n14,978.9 \n(3)\n%\n____________\n(1)\nCurrency impact is shown as unfavorable (favorable).\n(2)\nThe constant currency percentage change is derived by translating net sales or revenues for the current period at prior year comparative period exchange rates, and in doing so shows the percentage change from 2024 constant currency net sales or revenues to the corresponding amount in the prior year.\n(3)\nReductions were driven primarily by the inclusion of net sales in the prior year period related to divestitures that have closed during 2023 and 2024.\n(4)\nFor the year ended December 31, 2024, other revenues in Developed Markets, Greater China, JANZ, and Emerging Markets were approximately $32.0 million, $1.3 million, $3.5 million, and $9.7 million, respectively.\n(5)\nAmounts exclude intersegment revenue which eliminates on a consolidated basis.\n58\nTable of Contents\n \nTotal Revenues\nFor the year ended December 31, 2024, the Company reported total revenues of $14.74 billion, compared to $15.43 billion for the comparable prior year period, representing a decrease of $687.6 million, or 4%. Total revenues include both net sales and other revenues from third parties. Net sales for the year ended December 31, 2024 were $14.69 billion, compared to $15.39 billion for the comparable prior year period, representing a decrease of $695.6 million, or 5%. Other revenues for the year ended December 31, 2024 were $46.5 million, compared to $38.5 million for the comparable prior year period.\nNet sales decreased by approximately $732.2 million, or 5%, due to the inclusion of net sales in the prior year period related to divestitures that have closed during 2023 and 2024. The decrease in net sales was also partially driven by the unfavorable impact of foreign currency translation of approximately $239.5 million, or 2%, primarily reflecting changes in the U.S. Dollar as compared to the currencies of subsidiaries in Japan, China, and countries in Emerging Markets. On a constant currency basis, net sales from the remaining business increased by approximately $276.1 million, or 2%, for the year ended December 31, 2024 compared to the prior year period, driven by new product sales, primarily in Developed Markets, of approximately $582.4 million. New product sales include new products launched in 2024 and the carryover impact of new products, including business development, launched within the last twelve months. The increase was partially offset by base business erosion of approximately $306.3 million. \nFrom time to time, a limited number of our products may represent a significant portion of our net sales, gross profit and net earnings. Generally, this is due to the timing of new product introductions, seasonality, and the amount, if any, of additional competition in the market. Our top ten products in terms of net sales, in the aggregate, represented approximately 33% for each of the years ended December 31, 2024 and 2023.  \nNet sales are derived from our four reporting segments: Developed Markets, Greater China, JANZ and Emerging Markets.\nDeveloped Markets Segment\nNet sales from Developed Markets decreased by $322.5 million, or 3%, for the year ended December 31, 2024 when compared to the prior year. Net sales decreased by approximately $421.1 million, or 5%, due to the inclusion of net sales in the prior year period related to divestitures that have closed during 2023 and 2024. The favorable impact of foreign currency translation was approximately $5.3 million, or less than 1%. Constant currency net sales from the remaining business increased by approximately $93.3 million, or 1%, driven primarily by new product sales throughout Developed Markets, including Breyna™ and lisdexamfetamine in the U.S. This increase was partially offset by anticipated lower net sales of certain existing products within the U.S., including EpiPen® Auto-Injector and Perforomist®, as a result of lower pricing and volumes due to additional competition and increased utilization within government channels. Net sales within North America totaled approximately $3.78 billion and net sales within Europe totaled approximately $5.15 billion. \nGreater China Segment\nNet sales from Greater China were essentially flat for the year ended December 31, 2024 when compared to the prior year. The unfavorable impact of foreign currency translation was approximately $47.2 million, or 2%. Constant currency net sales increased by approximately $53.4 million, or 2%, when compared to the prior year, driven primarily by increased volumes of existing products. Divestitures did not have a significant impact on the net sales during the years ended December 31, 2024 and 2023.\nJANZ Segment\nNet sales from JANZ decreased by $78.3 million, or 5%, for the year ended December 31, 2024 when compared to the prior year. This decrease was the result of the unfavorable impact of foreign currency translation of approximately $81.4 million, or 6%. Net sales also decreased by approximately $16.4 million, or 1%, due to the inclusion of net sales in the prior year period related to divestitures that have closed during 2023 and 2024. Constant currency net sales from the remaining business increased by approximately $19.5 million, or 1%, when compared to the prior year, driven primarily by new product sales in Australia. This increase was partially offset by lower net sales of existing products mainly driven by lower pricing in Japan as a result of government price reductions and additional competition.\n59\nTable of Contents\n \nEmerging Markets Segment\nNet sales from Emerging Markets decreased by $300.9 million or 12% for the year ended December 31, 2024 when compared to the prior year. Net sales decreased by approximately $294.6 million, or 12%, due to the inclusion of net sales in the prior year period related to divestitures that have closed during 2023 and 2024. The decrease in net sales was also partially driven by the unfavorable impact of foreign currency translation of approximately $116.2 million, or 5%. Constant currency net sales from the remaining business increased by approximately $109.9 million, or 4%, when compared to the prior year, primarily driven by new products and higher net sales of existing products in certain Latin American, Middle Eastern and Asian countries. \nCost of Sales and Gross Profit\nCost of sales increased from $8.99 billion for the year ended December 31, 2023 to $9.12 billion for the year ended December 31, 2024. The increase in cost of sales was largely driven by IPR&D intangible asset impairment charges of $177.1 million. Refer to Note 8 \nGoodwill and Intangible Assets\n included in Part II, Item 8 of this Form 10-K for more information. This increase was partially offset by the impact of the decrease in net sales, including as a result of the divestitures that have closed in 2023 and 2024.  \nGross profit for the year ended December 31, 2024 was $5.62 billion and gross margins were 38%. For the year ended December 31, 2023, gross profit was $6.44 billion and gross margins were 42%. The changes in gross profit and gross margins are primarily related to the impact of the divestitures and the IPR&D intangible asset impairment charges. Adjusted gross margins were approximately 58% for the year ended December 31, 2024, essentially flat when compared to the year ended December 31, 2023.\nA reconciliation between cost of sales, as reported under U.S. GAAP, and adjusted cost of sales and adjusted gross margin for the year ended December 31, 2024 compared to the year ended December 31, 2023 is as follows:\nYear Ended December 31,\n(In millions, except %s)\n2024\n2023\nU.S. GAAP cost of sales\n$\n9,115.7 \n$\n8,988.3 \nDeduct:\nPurchase accounting amortization and other related items\n(2,581.1)\n(2,421.6)\nAcquisition and divestiture-related costs\n(71.5)\n(40.7)\nRestructuring-related costs\n(115.7)\n(101.8)\nShare-based compensation expense\n(3.7)\n(2.9)\nOther special items\n(143.0)\n(119.2)\nAdjusted cost of sales\n$\n6,200.7 \n$\n6,302.1 \nAdjusted gross profit \n(a)\n$\n8,538.6 \n$\n9,124.8 \nAdjusted gross margin \n(a)\n58 \n%\n59 \n%\n____________\n(a)\nAdjusted gross profit is calculated as total revenues less adjusted cost of sales. Adjusted gross margin is calculated as adjusted gross profit divided by total revenues.\nOperating Expenses\nResearch and Development Expense\nR&D expense for the year ended December 31, 2024 was $808.7 million, essentially flat compared to R&D expense of $805.2 million for the prior year. An increase in spend on the selatogrel and cenerimod programs was partially offset by lower spending on base business programs. We expect R&D expense to increase in excess of $100 million in 2025 as compared to 2024 primarily as a result of increased expenses for the selatogrel and cenerimod development programs.\n60\nTable of Contents\n \nAcquired IPR&D\nAcquired IPR&D expense for the year ended December 31, 2024 was $28.3 million, compared to $105.5 million for the prior year, a decrease of $77.2 million. The decrease was primarily due to upfront licensing payments to Mapi of $75.0 million related to additional products under development recorded during the prior year. This was partially offset by an upfront licensing payment of $25.0 million to Lexicon related to sotagliflozin recorded during the fourth quarter of 2024.\nSelling, General and Administrative Expense\nSG&A expense for the year ended December 31, 2024 was $4.43 billion, compared to $4.65 billion for the prior year, a decrease of $224.5 million. The decrease was primarily due to lower goodwill impairment charges of approximately $259.1 million (refer to Note 8 \nGoodwill and Intangible Assets\n included in Part II, Item 8 of this Form 10-K for more information on the goodwill impairment charges recorded in 2023 and 2024), and the impact of the divestitures. Partially offsetting these decreases was a gain recorded in 2023 of approximately $156.2 million on the transaction to divest the Company’s rights to two women’s healthcare products in certain countries.\nLitigation Settlements and Other Contingencies, Net\nThe following table includes the losses recognized in litigation settlements and other contingencies, net during the years ended December 31, 2024 and 2023, respectively:\nYear Ended December 31,\n(In millions)\n2024\n2023\nContingent consideration adjustment\n$\n54.8 \n$\n80.4 \nLitigation settlements, net\n296.1 \n31.2 \nTotal litigation settlements and other contingencies, net\n$\n350.9 \n$\n111.6 \nThe contingent consideration adjustment for the year ended December 31, 2024 was primarily due to fair value adjustments related to the Respiratory Delivery Platform and the Idorsia contingent consideration liabilities. Refer to Note 9 \nFinancial Instruments and Risk Management\n included in Part II, Item 8 of this Form 10-K for more information.\nAlso refer to Note 19 \nLitigation\n included in Part II, Item 8 of this Form 10-K for more information.\nInterest Expense\nInterest expense for the year ended December 31, 2024 totaled $550.0 million, compared to $573.1 million for the year ended December 31, 2023, a decrease of $23.1 million. The decrease was primarily due to the impact of debt repayments, partially offset by the non-cash accretion of the contingent consideration liability related to the Idorsia Transaction.\nOther Expense (Income), Net\nOther expense (income), net includes gains and losses from divestitures of businesses, changes in the fair value of equity securities, extinguishment of debt, foreign exchange, expense (income) related to post-employment benefit plans, TSA income, and interest and dividend income. Other expense (income), net for the year ended December 31, 2024 totaled $83.3 million of expense, compared to $(9.8) million of income for the year ended December 31, 2023, a decrease of $93.1 million. \nThe decrease in other income, net was driven by: (1) higher net loss on divestitures of approximately $156.4 million, (2) charges of $184.6 million related to the impairment of our equity investment in Mapi and advances for GA Depot inventory (refer to Note 18 \nLicensing and Other Partner Agreements\n included in Part II, Item 8 of this Form 10-K for more information), (3) net gains recorded in the prior year of approximately $43.4 million as a result of remeasuring our equity interests in Mapi and Famy Life Sciences and the CCPS in Biocon Biologics to fair value, and (4) lower TSA income of approximately $98.1 million as the prior year included TSA income related to the reimbursement for transition services provided to Biocon Biologics. Biocon Biologics had substantially exited all transition services with Viatris as of December 31, 2023. The costs related to the transition services are included in SG&A and R&D. \nThis was partially offset by: (1) current year gains of $373.5 million as a result of remeasuring the CCPS in Biocon Biologics to fair value, (2) higher interest income of approximately $32.1 million, and (3) gain on debt extinguishments of $16.5 million. \n61\nTable of Contents\n \nIncome Tax Provision\nFor the year ended December 31, 2024, the Company recognized an income tax provision of $11.0 million, compared to an income tax provision of $148.2 million for the prior year, a change in the provision of $137.2 million. The income tax provision for the year ended December 31, 2024 includes a tax benefit related to certain gains on the sale of subsidiaries in connection with the divestiture of the OTC Business which were partially exempt from tax. This benefit was partially offset by the goodwill impairment charge recorded in the second quarter of 2024, for which no tax benefit was realized. The income tax provision for the year ended December 31, 2023 was negatively impacted by the goodwill impairment related to the divestiture of the OTC Business, partially offset by the deferred tax impact of the Company’s internal tax restructuring. The current year and prior year provisions were also impacted by the levels of income and the changing mix at which it is earned in jurisdictions with differing tax rates.\n2023 Compared to 2022\nDiscussions of 2022 items and year-to-year comparisons between 2023 and 2022 are not included in this Form 10-K, and can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of the Company’s Annual Report on Form 10-K for the year ended December 31, 2023.\nUse of Non-GAAP Financial Measures\nWhenever the Company uses non-GAAP financial measures, we provide a reconciliation of the non-GAAP financial measures to their most directly comparable U.S. GAAP financial measure. Investors and other readers are encouraged to review the related U.S. GAAP financial measures and the reconciliation of non-GAAP measures to their most directly comparable U.S. GAAP measure and should consider non-GAAP measures only as a supplement to, not as a substitute for or as a superior measure to, measures of financial performance prepared in accordance with U.S. GAAP. Additionally, since these are not measures determined in accordance with U.S. GAAP, non-GAAP financial measures have no standardized meaning across companies, or as prescribed by U.S. GAAP and, therefore, may not be comparable to the calculation of similar measures or measures with the same title used by other companies.\nManagement uses these measures internally for forecasting, budgeting, measuring its operating performance, and incentive-based awards. Primarily due to acquisitions, divestitures and other significant events which may impact comparability of our periodic operating results, we believe that an evaluation of our ongoing operations (and comparisons of our current operations with historical and future operations) would be difficult if the disclosure of our financial results was limited to financial measures prepared only in accordance with U.S. GAAP. We believe that non-GAAP financial measures are useful supplemental information for our investors and when considered together with our U.S. GAAP financial measures and the reconciliation to the most directly comparable U.S. GAAP financial measure, provide a more complete understanding of the factors and trends affecting our operations. The financial performance of the Company is measured by senior management, in part, using adjusted metrics as described below, along with other performance metrics. The Company’s use of such non-GAAP measures is governed by an adjusted reporting policy maintained by the Company and such non-GAAP measures are reviewed in detail with the Audit Committee of the Board of Directors.\nAdjusted Cost of Sales and Adjusted Gross Margin\nWe use the non-GAAP financial measure “adjusted cost of sales” and the corresponding non-GAAP financial measure “adjusted gross margin.” The principal items excluded from adjusted cost of sales include restructuring, acquisition and divestiture-related costs, and other special items, purchase accounting amortization and other related items, and share-based compensation expense, which are described in greater detail below.\nAdjusted Net Earnings and Adjusted EPS\nAdjusted net earnings and adjusted net earnings per diluted share (“adjusted EPS”) are non-GAAP financial measures and provide an alternative view of performance used by management. Management believes that, primarily due to acquisitions, divestitures and other significant events, an evaluation of the Company’s ongoing operations (and comparisons of its current operations with historical and future operations) would be difficult if the disclosure of its financial results were limited to financial measures prepared only in accordance with U.S. GAAP. Management believes that adjusted net earnings and adjusted EPS are important internal financial metrics related to the ongoing operating performance of the Company, and are therefore useful to investors and that their understanding of our performance is enhanced by these measures. Actual internal and forecasted operating results and annual budgets used by management include adjusted net earnings and adjusted EPS.\n62\nTable of Contents\n \nEBITDA and Adjusted EBITDA \nEBITDA and adjusted EBITDA are non-GAAP financial measures that the Company believes are appropriate to provide additional information to investors to demonstrate the Company’s ability to comply with financial debt covenants and assess the Company’s ability to incur additional indebtedness. The Company also believes that adjusted EBITDA better focuses management on the Company’s underlying operational results and true business performance and is used, in part, for management’s incentive compensation. We calculate EBITDA as U.S. GAAP net earnings (loss) adjusted for income tax provision (benefit), interest expense and depreciation and amortization. EBITDA is further adjusted for share-based compensation expense, litigation settlements and other contingencies, net, gain (loss) on divestitures of businesses, impairment of long-lived assets and goodwill, restructuring, acquisition and divestiture-related and other special items to determine adjusted EBITDA. These adjustments are generally permitted under our credit agreement in calculating adjusted EBITDA for determining compliance with our debt covenants.\nThe significant items excluded from adjusted cost of sales, adjusted EBITDA, adjusted net earnings, and adjusted EPS include:\nPurchase Accounting Amortization and Other Related Items\nThe ongoing impact of certain amounts recorded in connection with acquisitions of both businesses and assets is excluded from adjusted cost of sales, adjusted EBITDA, adjusted net earnings, and adjusted EPS. These amounts include the amortization of intangible assets, inventory step-up, property, plant and equipment step-up, intangible asset impairment charges, including for IPR&D, and impairment of goodwill. For the acquisition of businesses accounted for under the provisions of ASC 805, \nBusiness Combinations\n, these purchase accounting impacts are excluded regardless of the financing method used for the acquisitions, including the use of cash, long-term debt, the issuance of common stock, contingent consideration or any combination thereof.\nFair Value Adjustments, Including Contingent Consideration\nThe impact of changes to the fair value of assets and liabilities, including contingent and deferred consideration and non-marketable equity investments, and the related accretion income or expense are excluded from adjusted EBITDA, adjusted net earnings, and adjusted EPS because they are not indicative of the Company’s ongoing operations due to the variability of the amounts and the lack of predictability as to the occurrence and/or timing and management believes their exclusion is helpful to understanding the underlying, ongoing operational performance of the business.\nShare-based Compensation Expense\nShare-based compensation expense is excluded from adjusted cost of sales, adjusted EBITDA, adjusted net earnings, and adjusted EPS. Our share-based compensation programs have become increasingly weighted toward performance-based compensation, which leads to variability and to a lack of predictability as to the occurrence and/or timing of amounts incurred. As such, management believes the exclusion of such amounts on an ongoing basis is helpful to understanding the underlying operational performance of the business. \nRestructuring, Acquisition and Divestiture-Related Costs and Other Special Items\nCosts related to restructuring, acquisition and divestiture-related activities and other actions are excluded from adjusted cost of sales, adjusted EBITDA, adjusted net earnings, and adjusted EPS, as applicable. These amounts include items such as: \n•\nCosts related to formal restructuring programs and actions, including costs associated with facilities to be closed or divested, employee separation costs, impairment charges, accelerated depreciation, incremental manufacturing variances, equipment relocation costs, decommissioning and other restructuring related costs; \n•\nCertain acquisition and divestiture costs, including costs relating to integration and planning, advisory and legal fees, certain financing related costs, certain reimbursements related to the Company’s obligation to reimburse Pfizer for certain financing and transaction related costs under the Business Combination Agreement and Separation and Distribution Agreement, certain other TSA related set-up and exit costs, and other business transformation and/or optimization initiatives, which are not part of a formal restructuring program, including employee separation and post-employment costs;\n•\nOther costs, incurred from time to time, related to certain special events or activities that lead to gains or losses, including, but not limited to, incremental manufacturing variances, asset write-downs, including other-than-temporary impairments of investments in equity or debt instruments, or liability adjustments;\n63\nTable of Contents\n \n•\nCertain costs to further develop and optimize our global enterprise resource planning systems, operations and supply chain; \n•\nGains or losses from divestitures, including impairments of held for sale assets; and\n•\nThe impact of changes related to uncertain tax positions are excluded from adjusted net earnings and adjusted EPS. In addition, tax adjustments to adjusted earnings are recorded to present items on an after-tax basis consistent with the presentation of adjusted net earnings and adjusted EPS.\nThe Company has undertaken restructurings and other optimization initiatives of differing types, scope and amount during the covered periods and, therefore, these charges should not be considered non-recurring; however, management excludes these amounts from adjusted cost of sales, adjusted EBITDA, adjusted net earnings, and adjusted EPS because it believes it is helpful to understanding the underlying, ongoing operational performance of the business.\nLitigation Settlements, Net\nCharges and gains related to legal matters, such as those discussed in Note 19 \nLitigation\n included in Part II, Item 8 of this Form 10-K are generally excluded from adjusted EBITDA, adjusted net earnings, and adjusted EPS. Normal, ongoing defense costs of the Company made in the normal course of our business are not excluded.\nReconciliation of U.S. GAAP Net (Loss) Earnings to Adjusted Net Earnings and U.S. GAAP (Loss) Earnings Per Share to Adjusted EPS \nA reconciliation between net (loss) earnings and diluted earnings (loss) per share as reported under U.S. GAAP, and adjusted net earnings and adjusted EPS for the periods shown follows:\nYear Ended December 31,\n(In millions, except per share amounts)\n2024\n2023\n2022\nU.S. GAAP net (loss) earnings and U.S. GAAP diluted (loss) earnings per share\n$\n(634.2)\n$\n(0.53)\n$\n54.7 \n$\n0.05 \n$\n2,078.6 \n$\n1.71 \nPurchase accounting amortization (primarily included in cost of sales) \n(a)\n2,581.1 \n2,421.5 \n2,721.3 \nImpairment of goodwill (included in SG&A) \n(b)\n321.0 \n580.1 \n117.0 \nLitigation settlements and other contingencies, net\n350.9 \n111.6 \n4.4 \nInterest expense (primarily amortization of premiums and discounts on long term debt)\n(23.0)\n(42.4)\n(48.7)\nAcquisition and divestiture-related costs (primarily included in SG&A) \n(c)\n361.0 \n377.9 \n475.7 \nLoss (gain) on divestitures of businesses (included in other expense (income), net) \n(d)\n399.4 \n239.9 \n(1,754.1)\nRestructuring-related costs \n(e)\n211.1 \n125.2 \n86.9 \nShare-based compensation expense\n146.1 \n180.7 \n116.5 \nOther special items included in:\nCost of sales \n(f)\n143.0 \n119.2 \n255.2 \nResearch and development expense \n2.8 \n2.8 \n1.0 \nSelling, general and administrative expense\n90.5 \n(83.5)\n68.8 \nOther expense (income), net \n(g)\n(160.2)\n(24.4)\n(3.8)\nTax effect of the above items and other income tax related items\n (h)\n(597.1)\n(525.6)\n(41.7)\nAdjusted net earnings and adjusted EPS\n$\n3,192.4 \n$\n2.65 \n$\n3,537.7 \n$\n2.93 \n$\n4,077.1 \n$\n3.35 \nWeighted average diluted shares outstanding\n1,202.7 \n1,206.9 \n1,217.4 \nSignificant items for the year ended December 31, 2024 include the following:\n(a)    \nIncludes IPR&D intangible asset impairment charges of $177.1 million as the Company concluded that certain of its IPR&D assets were fully impaired due to unfavorable clinical results and/or changes in market conditions which led to the termination of the development programs.\n(b)    \nIncludes a goodwill impairment charge of $321.0 million related to the JANZ reporting unit.\n64\nTable of Contents\n \n(c)     \nAcquisition and divestiture-related costs consist primarily of transaction costs including legal and consulting fees and integration activities.\n(d)    \nConsists primarily of pre-tax charges / (gains) related to the divestitures of the OTC, biosimilars, API, and women’s healthcare businesses of approximately $369.0 million, $60.0 million, $47.8 million, and $(77.8) million, respectively.\n(e)    \nIncludes approximately $115.7 million in cost of sales, approximately $3.0 million in R&D, and approximately $92.3 million in SG&A. \n(f)    \nIncludes incremental manufacturing variances at plants slated for sale or closure of approximately $109.4 million.\n(g)\n    \nIncludes: (1) a gain of approximately $373.5 million as a result of remeasuring the CCPS in Biocon Biologics to fair value; (2) a gain on the extinguishment of debt of $16.5 million; and (3) charges of $184.6 million related to the impairment of our equity investment in Mapi and advances for GA Depot inventory (refer to Note 18 \nLicensing and Other Partner Agreements\n included in Part II, Item 8 of this Form 10-K for more information).\n(h)\n    \nAdjusted for changes for uncertain tax positions. \nReconciliation of U.S. GAAP Net (Loss) Earnings to EBITDA and Adjusted EBITDA\nBelow is a reconciliation of U.S. GAAP net (loss) earnings to EBITDA and adjusted EBITDA for the year ended December 31, 2024 compared to the prior year periods:\nYear Ended December 31, \n(In millions)\n2024\n2023\n2022\nU.S. GAAP net (loss) earnings\n$\n(634.2)\n$\n54.7 \n$\n2,078.6 \nAdd adjustments:\nIncome tax provision\n11.0 \n148.2 \n734.6 \nInterest expense \n(a)\n550.0 \n573.1 \n592.4 \nDepreciation and amortization \n(b)\n2,893.2 \n2,740.5 \n3,027.6 \nEBITDA\n$\n2,820.0 \n$\n3,516.5 \n$\n6,433.2 \nAdd / (deduct) adjustments:\nShare-based compensation expense\n146.1 \n180.7 \n116.4 \nLitigation settlements and other contingencies, net\n350.9 \n111.6 \n4.4 \nLoss (gain) on divestitures of businesses\n399.4 \n239.9 \n(1,754.1)\nImpairment of goodwill\n321.0 \n580.1 \n117.0 \nRestructuring, acquisition and divestiture-related and other special items \n(c)\n632.0 \n495.3 \n859.9 \nAdjusted EBITDA\n$\n4,669.4 \n$\n5,124.1 \n$\n5,776.8 \n____________\n(a)    \nIncludes amortization of premiums and discounts on long-term debt.\n(b)    \nIncludes purchase accounting related amortization.\n(c)    \nSee items detailed in the Reconciliation of U.S. GAAP Net (Loss) Earnings to Adjusted Net Earnings. \nLiquidity and Capital Resources\nOur primary source of liquidity is net cash provided by operating activities, which was $2.30 billion for the year ended December 31, 2024. We believe that net cash provided by operating activities and available liquidity will continue to allow us to meet our needs for working capital, capital expenditures, interest and principal payments on debt obligations, dividend payments, and share repurchases. Nevertheless, our ability to satisfy our working capital requirements and debt service obligations, and fund planned capital expenditures, share repurchases, or dividend payments, will substantially depend upon our future operating performance (which will be affected by prevailing economic conditions), and financial, business and other factors, some of which are beyond our control.\nBeginning in 2024, upfront and milestone payments related to externally developed IPR&D projects acquired directly in a transaction other than a business combination, which were previously included in cash flows from operating activities in the consolidated statements of cash flows, are now classified as cash flows from investing activities. Certain reclassifications were made to conform the prior period consolidated financial statements to the current period presentation. The adjustments resulted in an increase to net cash provided by operating activities and an increase to net cash used in investing activities of $100.4 million for the year ended December 31, 2023. \n65\nTable of Contents\n \nOperating Activities\nNet cash provided by operating activities decreased by $597.1 million to $2.30 billion for the year ended December 31, 2024, as compared to net cash provided by operating activities of $2.90 billion for the year ended December 31, 2023. Net cash provided by operating activities is derived from net (loss) earnings adjusted for non-cash operating items, gains and losses attributed to investing and financing activities and changes in operating assets and liabilities resulting from timing differences between the receipts and payments of cash, including changes in cash primarily reflecting the timing of cash collections from customers, payments to vendors and employees and tax payments in the ordinary course of business.\nThe decrease in net cash provided by operating activities was principally due to lower operating earnings, including as a result of divestitures in 2023 and 2024, higher transaction costs associated with divestitures, and the timing of cash payments and collections.\nInvesting Activities\nNet cash from investing activities was $1.80 billion for the year ended December 31, 2024, as compared to net cash used in investing activities of $864.5 million for the year ended December 31, 2023, an increase of $2.67 billion. \nIn 2024, significant items in investing activities included the following: \n•\nproceeds from the sale of assets and businesses of $2.51 billion, primarily related to the divestitures of the OTC Business, the API business in India and the women’s healthcare business;\n•\ncash paid for acquisitions, net of cash acquired, of $350.0 million related to the Idorsia Transaction; and\n•\ncapital expenditures, primarily for equipment and facilities, totaling approximately $326.0 million. While there can be no assurance that current expectations will be realized, capital expenditures for the 2025 calendar year are expected to be approximately $300 million to $400 million.\nIn 2023, significant items in investing activities included the following:\n•\ncash paid for acquisitions, net of cash acquired, of $667.7 million;\n•\npayments for product rights and other, net totaling approximately $97.5 million, related to various products; \n•\ncapital expenditures, primarily for equipment and facilities, totaling approximately $377.0 million; and\n•\nproceeds from the sale of assets and businesses of $364.1 million, primarily related to divestitures of the Company’s rights to two women’s healthcare products in certain countries and commercialization rights in certain Upjohn Distributor Markets.\nFinancing Activities\nNet cash used in financing activities was $4.33 billion for the year ended December 31, 2024, as compared to net cash used in financing activities of $2.30 billion for the year ended December 31, 2023, an increase of $2.03 billion. \nIn 2024, significant items in financing activities included the following: \n•\nrepayment of Senior Notes through tender offers for and satisfaction and discharge of approximately $1.86 billion of Senior Notes;\n•\nrepayment of Senior Notes at maturity of approximately $1.86 billion, consisting of the 1.023% Euro Senior Notes and the 2.250% Euro Senior Notes;\n•\nshare repurchases of $250.0 million;\n•\ncash dividends paid of $574.8 million; and\n•\nreceipt of $245.0 million in deferred consideration from the Biocon Biologics Transaction, and net cash of $52.7 million collected on behalf of various partners, including Biocon Biologics, which are included in Other items, net.\nIn 2023, significant items in financing activities included the following:\n66\nTable of Contents\n \n•\nrepayments of Senior Notes at maturity of approximately $1.25 billion, consisting of the 3.125% Senior Notes and the 4.200% Senior Notes;\n•\nshare repurchases of $250.0 million;\n•\ncash dividends paid of $575.6 million; and\n•\npayment of $220.0 million to Biocon Biologics related to the closing working capital target, partially offset by net cash of $47.6 million collected on behalf of various partners, including Biocon Biologics, which are included in Other items, net.\nRefer to the consolidated statements of cash flows in Part II, Item 8 of this Form 10-K for additional details on other significant sources and uses of cash during the years ended December 31, 2024 and 2023.\nCapital Resources \nOur cash and cash equivalents totaled $734.8 million at December 31, 2024. The majority of our cash is invested in U.S. government money market funds and in bank deposits. In order to support our global operations, we maintain significant cash and cash equivalents within the banking system with the majority of this at Global Systemically Important Banks. We monitor the third-party depository institutions that hold our cash and cash equivalents on a regular basis. Our primary emphasis is on the safety of the principal. Where possible, we diversify our cash and cash equivalents among counterparties to minimize exposure to any one counterparty. The Company anticipates having sufficient liquidity, including existing borrowing capacity under the 2024 Revolving Facility, Commercial Paper Program, and Receivables Facility combined with cash to be generated from operations, to fund foreseeable cash needs without requiring the repatriation of non-U.S. cash. Should we determine the need to repatriate or convert cash held in countries that have significant restrictions or controls in place, including in China, we may be unable to repatriate or convert such cash, or be unable to do so without incurring substantial costs.\nThe Company has access to $3.5 billion under the 2024 Revolving Facility which matures in September 2029. Up to $1.65 billion of the 2024 Revolving Facility may be used to support borrowings under our Commercial Paper Program. As of December 31, 2024, the Company did not have any borrowings outstanding under the Commercial Paper Program or the 2024 Revolving Facility. \nThe Company has a $400 million Receivables Facility which expires in April 2025. As of December 31, 2024, the Company did not have any borrowings outstanding under the Receivables Facility.\nUnder the terms of the Receivables Facility, certain of our accounts receivable secure the amounts borrowed and cannot be used to pay our other debts or liabilities. The amount that we may borrow at a given point in time is determined based on the amount of qualifying accounts receivable that are present at such point in time. Borrowings outstanding under the Receivables Facility bear interest at the applicable base rate plus 0.775% and are included as a component of short-term borrowings, while the accounts receivable securing these obligations remain as a component of accounts receivable, net, in our consolidated balance sheets. In addition, the agreement governing the Receivables Facility contains various customary affirmative and negative covenants, and customary default and termination provisions.\nWe have entered into accounts receivable factoring agreements with financial institutions to sell certain of our non-U.S. accounts receivable. These transactions are accounted for as sales and result in a reduction in accounts receivable because the agreements transfer effective control over and risk related to the receivables to the buyers. Our factoring agreements do not allow for recourse in the event of uncollectibility, and we do not retain any interest in the underlying accounts receivable once sold. We derecognized $68.5 million and $30.8 million of accounts receivable as of December 31, 2024 and 2023, respectively, under these factoring arrangements. Additionally, in 2023, we entered into a similar arrangement for certain European countries. As of December 31, 2024 and 2023, we assigned and derecognized approximately $29.9 million and $415.7 million, respectively, of \nTrade Receivables, Net\n, which were included in \nOther Receivables\n.\nThe Company has certain voluntary supply chain finance programs with financial intermediaries which provide participating suppliers the option to be paid by the intermediary earlier than the original invoice due date. The Company’s responsibility is limited to making payments on the terms originally negotiated with the suppliers, regardless of whether the intermediary pays the supplier in advance of the original due date. The range of payment terms the Company negotiates with suppliers are consistent, regardless of whether a supplier participates in a supply chain finance program. The total amounts due to financial intermediaries to settle supplier invoices under supply chain finance programs as of December 31, 2024 and 2023 were $41.9 million and $65.1 million, respectively. These amounts are included within \nAccounts payable\n in the consolidated balance sheets.\n67\nTable of Contents\n \nWe are continuously evaluating the potential acquisition of products, as well as companies, as a strategic part of our future growth. Consequently, we may utilize current cash reserves or incur additional indebtedness to finance any such acquisitions, which could impact future liquidity. \nAlso, on an ongoing basis, we review our operations, including the evaluation of potential divestitures of products and businesses, as part of our future strategy. Any divestitures could impact future liquidity. In addition, we plan to continue to explore various other ways to unlock the value of the Company’s unique global platform in order to create shareholder value.\nFor information regarding our dividends paid and declared and share repurchase program, refer to Note 2 \nSummary of Significant Accounting Policies\n included in Part II, Item 8 of this Form 10-K.\nLong-term Debt Maturity\nFor information regarding our debt agreements and mandatory minimum repayments remaining on the outstanding notional amount of long-term debt at December 31, 2024, refer to Note 10 \nDebt\n included in Part II, Item 8 of this Form 10-K.\nThe YEN Term Loan Facility and the 2024 Revolving Facility contain customary affirmative covenants for facilities of this type, including among others, covenants pertaining to the delivery of financial statements, notices of default and certain material events, maintenance of corporate existence and rights, property, and insurance and compliance with laws, as well as customary negative covenants for facilities of this type, including a financial covenant, which set the Maximum Leverage Ratio as of the end of any quarter at 3.75 to 1.00, except in circumstances as defined in the related credit agreement, and other limitations on the incurrence of subsidiary indebtedness, liens, mergers and certain other fundamental changes, investments and loans, acquisitions, transactions with affiliates, payments of dividends and other restricted payments and changes in our lines of business.\nThe Company is in compliance with its covenants at December 31, 2024 and expects to remain in compliance for the next twelve months.\nWe and our subsidiaries and affiliates may from time to time, in our sole discretion, purchase, repay, redeem or retire any of our outstanding debt securities (including any publicly-issued debt securities) in privately negotiated or open market transactions, by tender offer or otherwise, or extend or refinance any of our outstanding indebtedness. Refer to Note 10 \nDebt\n included in Part II, Item 8 of this Form 10-K for more information.\nSupplemental Guarantor Financial Information\nViatris Inc. is the issuer of the Registered Upjohn Notes, which are fully and unconditionally guaranteed on a senior unsecured basis by Mylan Inc., Mylan II B.V. and Utah Acquisition Sub Inc. \nFollowing the Combination, Utah Acquisition Sub Inc. is the issuer of the Utah U.S. Dollar Notes, which are fully and unconditionally guaranteed on a senior unsecured basis by Mylan Inc., Viatris Inc. and Mylan II B.V.\nMylan Inc. is the issuer of the Mylan Inc. U.S. Dollar Notes, which are fully and unconditionally guaranteed on a senior unsecured basis by Mylan II B.V., Viatris Inc. and Utah Acquisition Sub Inc.\nThe respective obligations of Viatris Inc., Mylan Inc., Utah Acquisition Sub Inc., and Mylan II B.V. as guarantors of the applicable series of Senior U.S. Dollar Notes are senior unsecured obligations of the applicable guarantor and rank \npari passu\n in right of payment with all of such guarantor’s existing and future senior unsecured obligations that are not expressly subordinated to such guarantor’s guarantee of the applicable series of Senior U.S. Dollar Notes, rank senior in right of payment to any future obligations of such guarantor that are expressly subordinated to such guarantor’s guarantee of the applicable series of Senior U.S. Dollar Notes, and are effectively subordinated to such guarantor’s existing and future secured obligations to the extent of the value of the collateral securing such obligations. Such obligations are structurally subordinated to all of the existing and future liabilities, including trade payables, of the existing and future subsidiaries of such guarantor that do not guarantee the applicable series of Senior U.S. Dollar Notes.\nThe guarantees by Mylan Inc., Mylan II B.V. and Utah Acquisition Sub Inc. under the applicable series of Senior U.S. Dollar Notes will terminate under certain customary circumstances, each as described in the applicable indenture, including: (1) a sale or disposition of the applicable guarantor in a transaction that complies with the applicable indenture such that such guarantor ceases to be a subsidiary of the issuer of the applicable series of Senior U.S. Dollar Notes; (2) legal defeasance or covenant defeasance or if the issuer’s obligations under the applicable indenture are discharged; (3) with respect to the Utah U.S. Dollar Notes, the earlier to occur of (i) with respect to the guarantee provided by Mylan Inc., (x) the release of Utah \n68\nTable of Contents\n \nAcquisition Sub Inc.’s guarantee under all applicable Mylan Inc. Debt (as defined in the applicable indenture) and (y) Mylan Inc. no longer having any obligations in respect of any Mylan Inc. Debt and (ii) with respect to the guarantee provided by Mylan II B.V., (x) the release of Mylan II B.V.’s guarantee under all applicable Triggering Indebtedness (as defined in the applicable indenture) and (y) the issuer and/or borrower of the applicable Triggering Indebtedness no longer having any obligations with respect to such Triggering Indebtedness; (4) with respect to the guarantees provided by Utah Acquisition Sub Inc. and Mylan II B.V. of the Mylan Inc. U.S. Dollar Notes, subject to certain exceptions set forth in the applicable indenture, such guarantor ceasing to be a guarantor or obligor in respect of any Triggering Indebtedness; and (5) with respect to the Registered Upjohn Notes, (a) upon the applicable guarantor no longer being an issuer or guarantor in respect of (i) Mylan Notes (as defined in the indenture governing the Registered Upjohn Notes) that have an aggregate principal amount in excess of $500.0 million or (ii) any Triggering Indebtedness; in each case, other than in respect of indebtedness or guarantees, as applicable, that are being concurrently released; or (b) upon receipt of the consent of holders of a majority of the aggregate principal amount of the outstanding notes of such series in accordance with the indenture governing the Registered Upjohn Notes.\nThe guarantee obligations of Viatris Inc., Mylan Inc., Utah Acquisition Sub Inc., and Mylan II B.V. under the Senior U.S. Dollar Notes are subject to certain limitations and terms similar to those applicable to other guarantees of similar instruments, including that (i) the guarantees are subject to fraudulent transfer and conveyance laws and (ii) each guarantee is limited to an amount not to exceed the maximum amount that can be guaranteed by the applicable guarantor without rendering the guarantee, as it relates to such guarantor, voidable under applicable fraudulent transfer and conveyance laws or similar laws affecting the rights of creditors generally. \nThe following table presents unaudited summarized financial information of Viatris Inc., Mylan Inc., Utah Acquisition Sub Inc., and Mylan II B.V. on a combined basis as of and for the years ended December 31, 2024 and 2023. All intercompany balances have been eliminated in consolidation. This unaudited combined summarized financial information is presented utilizing the equity method of accounting.\nCombined Summarized Balance Sheet Information of Viatris Inc., Mylan Inc., Utah Acquisition Sub Inc. and Mylan II B.V. \n(In millions)\nDecember 31, 2024\nDecember 31, 2023\nASSETS\nCurrent assets\n$\n786.7 \n$\n1,013.1 \nNon-current assets\n61,424.7 \n63,212.6 \nLIABILITIES AND EQUITY\nCurrent liabilities\n30,796.9 \n29,824.8 \nNon-current liabilities\n12,779.0 \n13,933.6 \nCombined Summarized Income Statement Information of Viatris Inc., Mylan Inc., Utah Acquisition Sub Inc. and Mylan II B.V. \n(In millions)\nYear Ended December 31, 2024\nYear Ended December 31, 2023\nRevenues\n$\n— \n$\n— \nGross profit\n— \n— \nLoss from operations\n(1,206.6)\n(1,243.8)\nNet (loss) earnings\n(634.2)\n54.7 \nOther Commitments\nThe Company is involved in various disputes, governmental and/or regulatory inquiries, investigations and proceedings, tax proceedings and litigation matters, both in the U.S. and abroad, that arise from time to time, some of which could result in losses, including damages, fines and/or civil penalties, and/or criminal charges against the Company. These matters are often complex and have outcomes that are difficult to predict. We have approximately $384 million accrued for legal contingencies at December 31, 2024.\nWhile the Company believes that it has meritorious defenses with respect to the claims asserted against it and the assumed legal matters referenced above, and intends to vigorously defend its position, the process of resolving these matters is \n69\nTable of Contents\n \ninherently uncertain and may develop over a long period of time, and so it is not possible to predict the ultimate resolution of any such matter. It is possible that an unfavorable resolution of any of the ongoing matters could have a material effect on the Company’s business, financial condition, results of operations, cash flows, ability to pay dividends or repurchase shares, and/or stock price.\nIn connection with the divestitures, Viatris and the respective buyers entered into transition services and/or manufacturing and supply agreements pursuant to which the Company is providing services to the respective purchasers, substantially the same as we previously provided to the related businesses, generally for a period of up to 12 months for transition services and for periods between one to 10 years for manufacturing and supply agreements, depending on the geographic market and the products subject to such agreement, subject to potential extensions in certain circumstances. In addition, in connection with the OTC Transaction and the divestiture of our women’s healthcare business, we entered into distribution agreements for certain markets for a limited period of time. In connection with the API business divestiture, we entered into a manufacturing and supply agreement pursuant to which we are purchasing a significant amount of API from the purchaser in that transaction.\nAt December 31, 2024, our material cash requirements from known contractual and other obligations primarily relate to repayment of outstanding borrowings and interest, open purchase orders, post-employment benefit plans, unrecognized tax benefits, capital expenditures, dividends and leases. For additional information, refer to Notes 2, 7, 10, 12, 14, and 16 included in Part II, Item 8 of this Form 10-K. We anticipate our cash requirements related to ordinary course purchases of goods and services will be consistent with our past levels. \nIn the normal course of business, Viatris periodically enters into acquisition, divestiture, collaboration, employment, legal settlement and other agreements which incorporate indemnification provisions. The maximum amount to which Viatris may be exposed under such agreements cannot be reasonably estimated due to the conditional nature of the Company’s obligations and the unique facts and circumstances involved in each particular agreement. Historically, we have not paid material amounts under these indemnification provisions. Further, for certain agreements, the Company maintains insurance coverage, which management believes will effectively mitigate the Company’s obligations under these indemnification provisions. No amounts have been recorded in the consolidated financial statements with respect to the Company’s obligations under such agreements.\nWe have entered into employment and other agreements with certain executives and other employees that provide for compensation and certain other benefits. These agreements provide for severance payments under certain circumstances. \nLicensing and Other Partner Agreements\nUnder our licensing and other partner agreements, our potential maximum development milestones not accrued for at December 31, 2024 totaled approximately $419.4 million. We estimate that the amounts that may be paid during the next twelve months to be approximately $33 million. These agreements may also include potential sales-based milestones and call for us to pay a percentage of amounts earned from the sale of the product as a royalty or a profit share. Refer to Note 18 \nLicensing and Other Partner Agreements \nincluded in Part II, Item 8 of this Form 10-K for additional information.\nApplication of Critical Accounting Policies\nOur significant accounting policies are described in Note 2 \nSummary of Significant Accounting Policies \nincluded in Part II, Item 8 of this Form 10-K and are in accordance with U.S. GAAP.\nIncluded within these policies are certain policies which contain critical accounting estimates and, therefore, have been deemed to be “critical accounting policies.” Critical accounting estimates are those which require management to make assumptions about matters that were uncertain at the time the estimate was made and for which the use of different estimates, which reasonably could have been used, or changes in the accounting estimates that are reasonably likely to occur from period to period could have a material impact on our financial condition or results of operations. We have identified the following to be our critical accounting policies: the determination of net revenue provisions; accounting for acquisitions, including intangible assets, goodwill and contingent consideration; income taxes; and the impact of existing legal matters.\nRevenue Recognition\nWe recognize revenues in accordance with ASC 606, \nRevenue from Contracts with Customers\n. Under ASC 606, the Company recognizes net revenue for product sales when control of the promised goods or services is transferred to our customers in an amount that reflects the consideration we expect to be entitled to in exchange for those goods or services. \n70\nTable of Contents\n \nRevenues are recorded net of provisions for variable consideration, including discounts, rebates, governmental rebate programs, price adjustments, returns, chargebacks, promotional programs and other sales allowances. Accruals for these provisions are presented in the consolidated financial statements as reductions in determining net sales and as a contra asset in accounts receivable, net (if settled via credit) and other current liabilities (if paid in cash). Amounts recorded for revenue deductions can result from a complex series of judgements about future events and uncertainties and can rely heavily on estimates and assumptions. As such, they have been identified as critical accounting estimates. The following section briefly describes the nature of our provisions for variable consideration and how such provisions are estimated:\n•\nChargebacks\n: the Company has agreements with certain indirect customers, such as independent pharmacies, retail pharmacy chains, managed care organizations, hospitals, nursing homes, governmental agencies and pharmacy benefit managers, which establish contract prices for certain products. The indirect customers then independently select a wholesaler from which to purchase the products at these contracted prices. Alternatively, certain wholesalers may enter into agreements with indirect customers that establish contract pricing for certain products, which the wholesalers provide. Under either arrangement, Viatris will provide credit to the wholesaler for any difference between the contracted price with the indirect party and the wholesaler’s invoice price. Such credits are called chargebacks. The provision for chargebacks is based on expected sell-through levels by our wholesaler customers to indirect customers, as well as estimated wholesaler inventory levels. We continually monitor our provision for chargebacks and evaluate our reserve and estimates as additional information becomes available. A change of 5% would have an effect on our reserve balance of approximately $24.7 million.\n•\nRebates, promotional programs and other sales allowances\n: this category includes rebate and other programs to assist in product sales. These programs generally provide that the customer receives credit directly related to the amount of purchases or credits upon the attainment of pre-established volumes. Also included in this category are prompt pay discounts, administrative fees and price adjustments to reflect decreases in the selling prices of products. A change of 5% would have an effect on our reserve balance of approximately $63.3 million.\n•\nReturns\n: consistent with industry practice, Viatris maintains a return policy that allows customers to return a product, which varies country by country in accordance with local practices, generally within a specified period prior (six months) and subsequent (twelve months) to the expiration date. The Company’s estimate of the provision for returns is generally based upon historical experience with actual returns. Generally, returned products are destroyed and customers are refunded the sales price in the form of a credit. A change of 5% would have an effect on our reserve balance of approximately $20.0 million.\n•\nGovernmental rebate programs\n: government reimbursement programs in the U.S. include Medicare, Medicaid, and State Pharmacy Assistance Programs established according to statute, regulations and policy. Manufacturers of pharmaceutical products that are covered by the Medicaid program are required to pay rebates to each state based on a statutory formula set forth in the Social Security Act. Medicare beneficiaries are eligible to obtain discounted prescription drug coverage from private sector providers. In addition, certain states have also implemented supplemental rebate programs that obligate manufacturers to pay rebates in excess of those required under federal law. Our estimate of these rebates is based on the historical trends of rebates paid as well as on changes in wholesaler inventory levels and increases or decreases in the level of sales. We estimate discounts on branded prescription drug sales to Medicare Part D participants in the Medicare “coverage gap” based on historical experience of prescriptions and utilization expected to result in the discount of the “coverage gap”.\nOutside the U.S., the majority of our pharmaceutical sales are contractually or legislatively governed. In certain European countries, certain rebates are calculated on the governments total pharmaceutical spending or on specific product sale thresholds. We utilize historical data and obtain third party information to determine the adequacy of these accruals. Also, this provision includes price reductions that are mandated by law outside of the U.S. \nA change of 5% would have an effect on our reserve balance of approximately $18.7 million.\n71\nTable of Contents\n \nThe following is a rollforward of the categories of variable consideration during 2024:\n(In millions)\nBalance at December 31, 2023\nCurrent Provision Related to Sales Made in the Current Period \nChecks/ Credits Issued to Third Parties \nEffects of Foreign Exchange\nBalance at December 31, 2024\nChargebacks\n$\n530.3 \n$\n5,008.7 \n$\n(5,043.6)\n$\n(1.5)\n$\n493.9 \nRebates, promotional programs and other sales allowances\n1,102.9 \n4,193.1 \n(3,986.8)\n(42.3)\n1,266.9 \nReturns\n425.4 \n292.5 \n(312.5)\n(4.5)\n400.9 \nGovernmental rebate programs\n421.3 \n718.1 \n(751.6)\n(13.1)\n374.7 \nTotal\n$\n2,479.9 \n$\n10,212.4 \n$\n(10,094.5)\n$\n(61.4)\n$\n2,536.4 \nAccruals for these provisions are presented in the consolidated financial statements as reductions in determining net revenues and as a contra asset in accounts receivable, net (if settled via credit) and other current liabilities (if paid in cash). Accounts receivable are presented net of allowances relating to these provisions, which were comprised of the following at December 31, 2024 and 2023, respectively:\n(In millions)\nDecember 31,\n2024\nDecember 31,\n2023\nAccounts receivable, net\n$\n1,547.0 \n$\n1,483.6 \nOther current liabilities\n989.4 \n996.3 \nTotal\n$\n2,536.4 \n$\n2,479.9 \nWe have not made and do not anticipate making any significant changes to the methodologies that we use to measure provisions for variable consideration; however, the balances within these reserves can fluctuate significantly through the consistent application of our methodologies. Historically, we have not recorded in any current period any material amounts related to adjustments made to prior period reserves. \nAcquisitions, including Intangible Assets, Goodwill and Contingent Consideration\nThe Company accounts for acquired businesses using the acquisition method of accounting in accordance with the provisions of ASC 805\n, Business Combinations\n, which requires that the assets acquired and liabilities assumed be recorded at the date of acquisition at their respective estimated fair values. The cost to acquire businesses is allocated to the underlying net assets of the acquired business based on estimates of their respective fair values. Amounts allocated to acquired IPR&D are capitalized at the date of acquisition and, at that time, such IPR&D assets have indefinite lives. As products in development are approved for sale, amounts are allocated to product rights and licenses and will be amortized over their estimated useful lives. Finite-lived intangible assets are amortized over the expected life of the asset. Any excess of the purchase price over the estimated fair values of the net assets acquired is recorded as goodwill. Refer to Note 4 \nAcquisitions and Other Transactions \nand Note\n \n8 \nGoodwill and Intangible Assets \nincluded in Part II, Item 8 of this Form 10-K\n for additional information.\nPurchases of developed products and licenses that are accounted for as asset acquisitions, including milestone payments related to development compounds due upon receipt of regulatory approvals, are capitalized as intangible assets and amortized over an estimated useful life. IPR&D assets acquired as part of an asset acquisition are expensed immediately if they have no alternative future uses.\nThe judgments made in determining the estimated fair value assigned to each class of assets acquired and liabilities assumed, as well as asset lives, can materially impact our results of operations. Fair values and useful lives are determined based on, among other factors, the expected future period of benefit of the asset, the various characteristics of the asset and projected cash flows. Because this process involves management making estimates with respect to future sales volumes, pricing, new product launches, government reform actions, anticipated cost environment and overall market conditions, and because these estimates form the basis for the determination of whether or not an impairment charge should be recorded, these estimates are considered to be critical accounting estimates.\n72\nTable of Contents\n \nThe Company records contingent consideration liabilities resulting from business acquisitions or divestitures at its estimated fair value on the acquisition or divestiture date. Each reporting period thereafter, the Company revalues these obligations and records increases or decreases in their fair value as adjustments to litigation settlements and other contingencies, net within the consolidated statements of operations. Changes in the fair value of the contingent consideration obligations can result from adjustments to the discount rates, payment periods and adjustments in the probability of achieving future development steps, regulatory approvals, market launches, operating results, sales targets and profitability. These fair value measurements represent Level 3 measurements as they are based on significant inputs not observable in the market.\nSignificant judgment is employed in determining the assumptions utilized as of the acquisition or divestiture date and for each subsequent measurement period. Accordingly, changes in the assumptions described above could have a material impact on the Company’s consolidated financial condition and results of operations.\nThe Company reviews goodwill for impairment at least annually or more frequently if events or changes in circumstances indicate that the carrying value of goodwill may not be recoverable based on management’s assessment of the fair value of the Company’s reporting units as compared to their related carrying value. Under the authoritative guidance issued by the FASB, we have the option to first assess the qualitative factors to determine whether it is more likely than not that the fair value of the reporting unit is less than its carrying amount as a basis for determining whether it is necessary to perform a quantitative goodwill impairment test. If we choose to use qualitative factors and determine that it is more likely than not that the fair value of a reporting unit is less than its carrying amount, then the goodwill impairment test would be required. The goodwill impairment test requires the Company to estimate the fair value of the reporting unit and to compare the fair value of the reporting unit with its carrying amount. If the carrying amount is less than its fair value, then no impairment is recognized. If the carrying amount recorded exceeds the fair value calculated, an impairment charge is recorded for the difference. The judgments made in determining the projected cash flows used to estimate the fair value can materially impact the Company’s financial condition and results of operations.\nThe Company performed its annual goodwill impairment test on a quantitative basis for its five reporting units, North America, Europe, Emerging Markets, JANZ, and Greater China. In estimating each reporting unit’s fair value, the Company performed an extensive valuation analysis, utilizing a discounted cash flow approach. The determination of the fair value of the reporting units requires the Company to make significant estimates and assumptions that affect the reporting unit’s expected future cash flows. These estimates and assumptions, utilizing Level 3 inputs, primarily include, but are not limited to, the discount rate, terminal growth rates, operating income before depreciation and amortization, capital expenditures forecasts and control premiums. \nThe Company reviews goodwill for impairment annually on April 1st or more frequently if events or changes in circumstances indicate that the carrying value of goodwill may not be recoverable. The Company performed the annual goodwill impairment test as of April 1, 2024.\nWhen compared to the prior year’s annual goodwill impairment test completed on April 1, 2023, due to certain macroeconomic conditions, the Company has experienced fluctuations in foreign exchange rates in certain international markets, combined with an increase in market interest rates. These conditions impacted all reporting units, with the most significant impact in JANZ and Emerging Markets. The impact in the other reporting units was offset by changes in other discount rate assumptions.\nAs of April 1, 2024, the allocation of the Company’s total goodwill was as follows: North America $3.12 billion, Europe $3.86 billion, Emerging Markets $1.17 billion, JANZ $0.62 billion and Greater China $0.93 billion.\nIn conjunction with its annual goodwill impairment test, the Company recorded a goodwill impairment charge of $321.0 million during the second quarter of 2024 related to its JANZ reporting unit, which was recorded within \nSG&A\n in the consolidated statement of operations. The impairment charge was primarily the result of a 1.0% increase in the discount rate and a 0.5% reduction in the terminal growth rate assumption for the reporting unit.\nFor the JANZ reporting unit at April 1, 2024, the Company forecasted cash flows for the next 10 years. During the forecast period, the revenue compound annual growth rate was approximately negative 0.3%. A terminal year value was calculated with a 1.0% revenue growth rate applied. The discount rate utilized was 8.0% and the estimated tax rate was 30.3%. \nFollowing the goodwill impairment charge recorded in the JANZ reporting unit, the carrying value of the reporting unit was equal to its estimated fair value as of April 1, 2024. If market conditions or the projected results were to change materially, it may be necessary to record further impairment charges to the JANZ reporting unit in future periods.\n73\nTable of Contents\n \nAs of April 1, 2024, the Company determined that the fair values of the North America, Greater China, and Emerging Markets reporting units were substantially in excess of the respective unit’s carrying value. \nFor the Europe reporting unit, the estimated fair value exceeded its carrying value by approximately $882 million or 7.9% for the annual goodwill impairment test. As it relates to the discounted cash flow approach for the Europe reporting unit at April 1, 2024, the Company forecasted cash flows for the next 10 years. During the forecast period, the revenue compound annual growth rate was approximately 2.5%. A terminal year value was calculated with a 2.0% revenue growth rate applied. The discount rate utilized was 10.0% and the estimated tax rate was 15.7%. If all other assumptions are held constant, a reduction in the terminal value growth rate by 1.5% or an increase in discount rate by 1.0% would result in an impairment charge for the Europe reporting unit.\nDue to the inherent uncertainty involved in making these estimates, actual results could differ from those estimates. In addition, changes in underlying assumptions, especially as they relate to the key assumptions detailed, could have a significant impact on the fair value of the reporting units.\nThe carrying values of long-lived assets, which include property, plant and equipment and intangible assets with finite lives, are evaluated periodically in relation to the expected future undiscounted cash flows of the underlying assets and monitored for other potential triggering events. We assess the recoverability of certain long-lived assets, principally finite-lived intangible assets, contained within the reporting units whenever certain impairment indicators are present. Any impairment of these assets must be considered prior to our impairment review of goodwill. The assessment for impairment is based on our ability to recover the carrying value of the long-lived assets or asset grouping by analyzing the expected future undiscounted pre-tax cash flows specific to the asset or asset grouping. If the carrying amount is greater than the undiscounted cash flows, the Company recognizes an impairment loss for the excess of the carrying amount over the estimated fair value based on discounted cash flows.\nSignificant management judgment is involved in estimating the recoverability of these assets and is dependent upon the accuracy of the assumptions used in making these estimates, as well as how the estimates compare to the eventual future operating performance of the specific asset or asset grouping. The fair value of finite-lived intangible assets was calculated as the present value of the estimated future net cash flows using a market rate of return. At December 31, 2024 and 2023, the Company’s finite-lived intangible assets totaled $16.26 billion and $18.86 billion, respectively. Changes to any of the Company’s assumptions related to the estimated fair value based on the discounted cash flows, including discount rates or the competitive environment related to the assets, could lead to future material impairment charges. Any future long-lived assets impairment charges could have a material impact on the Company’s consolidated financial condition and results of operations.\nThe Company’s indefinite-lived intangible assets, principally IPR&D acquired as part of business combinations, are tested at least annually for impairment or upon the occurrence of a triggering event. The impairment test for IPR&D consists of a comparison of the asset’s fair value with its carrying value. Impairment is determined to exist when the fair value of IPR&D assets, which is based upon updated forecasts and commercial development plans, is less than the carrying value of the assets being tested. For the years ended December 31, 2024 and 2022, the Company recorded $177.1 million and $0.6 million, respectively, of impairment charges, which were recorded as a component of amortization expense. There were no IPR&D impairment charges in 2023. At December 31, 2024 and 2023, the Company’s IPR&D assets totaled $814.2 million and $319.4 million, respectively. \nThe fair value of both IPR&D and finite-lived intangible assets was determined based upon detailed valuations employing the income approach which utilized Level 3 inputs, as defined in Note 9 \nFinancial Instruments and Risk Management \nincluded in Part II, Item 8 of this Form 10-K. Changes to any of the Company’s assumptions including changes to or abandonment of development programs, regulatory timelines, discount rates or the competitive environment related to the assets could lead to future material impairment charges. \nIncome Taxes\nWe compute our income taxes based on the statutory tax rates and tax reliefs available to Viatris in the various jurisdictions in which we generate income. Significant judgment is required in determining our income taxes and in evaluating our tax positions. We establish reserves in accordance with Viatris’ policy regarding accounting for uncertainty in income taxes. Our policy provides that the tax effects from an uncertain tax position be recognized in Viatris’ financial statements, only if the position is more likely than not of being sustained upon audit, based on the technical merits of the position. We adjust these reserves in light of changing facts and circumstances, such as the settlement of a tax audit. Our provision for income taxes includes the impact of reserve provisions and changes to reserves. Favorable resolution would be recognized as a reduction to our provision for income taxes in the period of resolution or expiration of the underlying statutes of limitation. Based on this \n74\nTable of Contents\n \nevaluation, as of December 31, 2024, our reserve for unrecognized tax benefits totaled $255.7 million, of which $182.2 million was recorded in connection with the Combination and is subject to Pfizer’s indemnification obligations to Viatris under the Tax Matters Agreement.\nManagement assesses the available positive and negative evidence to estimate if sufficient future taxable income will be generated to utilize the existing deferred tax assets. A significant piece of objective negative evidence evaluated was the cumulative loss incurred in certain taxing jurisdictions over the three-year period ended December 31, 2024. Such objective evidence limits the ability to consider other subjective evidence such as our projections for future growth.\nBased on this evaluation and other factors, as of December 31, 2024, a valuation allowance of $1.23 billion has been recorded in order to measure only the portion of the deferred tax asset that more likely than not will be realized. The amount of the deferred tax asset considered realizable, however, could be adjusted if estimates of future taxable income during the carryforward period are reduced or if objective negative evidence in the form of cumulative losses is no longer present and additional weight may be given to subjective evidence such as projections for growth. When assessing the realizability of deferred tax assets, management considers all available evidence, including historical information, long-term forecasts of future taxable income and possible tax planning strategies. Amounts recorded for valuation allowances can result from a complex series of estimates, assumptions and judgments about future events. Due to the inherent uncertainty involved in making these estimates, assumptions and judgments, actual results could differ materially. Any future increases to the Company’s valuation allowances could materially impact the Company’s consolidated financial condition and results of operations. At December 31, 2024 and 2023, the Company’s net deferred tax assets totaled $753.0 million and $692.9 million, respectively. \nA variance of 5% between estimated reserves and valuation allowances and actual resolution and realization of these tax items would have an effect on our reserve balance and valuation allowance of approximately $74.5 million.\nLegal Matters\nViatris is involved in various legal proceedings, some of which involve claims for substantial amounts. An estimate is made to accrue for a loss contingency relating to any of these legal proceedings if it is probable that a liability was incurred as of the date of the financial statements and the amount of loss can be reasonably estimated. Because of the subjective nature inherent in assessing the outcome of litigation and because of the potential that an adverse outcome in a legal proceeding could have a material adverse effect on our business, financial condition, results of operations, cash flows, ability to pay dividends or repurchase shares, and/or stock price, such estimates are considered to be critical accounting estimates.\nA variance of 5% between estimated and recorded litigation reserves and actual resolution of certain legal matters would have an effect on our litigation reserve balance of approximately $19.2 million. Refer to Note 19 \nLitigation \nincluded in Part II, Item 8 of this Form 10-K\n for further discussion of litigation matters.\nImpact of Currency Fluctuations and Inflation\nBecause our results are reported in U.S. Dollars, changes in the rate of exchange between the U.S. Dollar and the local currencies in the markets in which we operate, mainly the Euro, Indian Rupee, Chinese Renminbi, Japanese Yen, Australian Dollar, Canadian Dollar, Pound Sterling and South Korean Won affect our results as previously noted. In recent years, the global economy has been impacted by high levels of inflation and rising energy costs, which has resulted in significant economic volatility. As a result, central banks have tightened their monetary policies and increased interest rates. While inflationary and other macroeconomic pressures may ease and interest rates may decline, we do not expect to see a corresponding reduction in these higher costs. These macroeconomic pressures combined with the volatility in foreign exchange rates, including the strengthening of the U.S. dollar versus certain of the other currencies in which we operate, have impacted and may continue to negatively impact our results of operations. We proactively look to manage such macroeconomic pressures by implementing strategies to mitigate and partially offset the impact of these factors. \nRecent Accounting Pronouncements\nRefer to Note 2 \nSummary of Significant Accounting Policies \nincluded in Part II, Item 8 of this Form 10-K for recently adopted accounting pronouncements and recently issued accounting pronouncements not yet adopted.\n75\nTable of Contents",
  "item2": null
}