{
  "source_file": "vz-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.    Business\nGeneral\nVerizon Communications Inc. (the Company) is a holding company that, acting through its subsidiaries (together with the Company, collectively, Verizon), is one of the world’s leading providers of communications, technology, information and streaming products and services to consumers, businesses and government entities. With a presence around the world, we offer data, video and voice services and solutions on our networks and platforms that are designed to meet customers’ demand for mobility, reliable network connectivity and security.\nWe have two reportable segments that we operate and manage as strategic business units - Verizon Consumer Group (Consumer) and Verizon Business Group (Business).\nVerizon Consumer Group\nOur Consumer segment provides consumer-focused wireless and wireline communications services and products. Our wireless services are provided across one of the most extensive wireless networks in the United States (U.S.) under the Verizon family of brands and through wholesale and other arrangements. We also provide fixed wireless access (FWA) broadband through our fifth-generation (5G) or fourth-generation (4G) Long-Term Evolution (LTE) networks as an alternative to traditional landline internet access. Our wireline services are provided in nine states in the Mid-Atlantic and Northeastern U.S., as well as Washington D.C., over our 100% fiber-optic network through our Verizon Fios product portfolio and over a traditional copper-based network to customers who are not served by Fios. \nIn 2024, the Consumer segment’s revenues were $102.9 billion, representing approximately 76% of Verizon’s consolidated revenues. As of December 31, 2024, Consumer had approximately 115 million wireless retail connections (including FWA), of which 83% are postpaid connections. In addition, at December 31, 2024, Consumer had approximately 10 million total broadband connections (which includes Fios internet, FWA and Digital Subscriber Line (DSL) connections), and approximately 3 million Fios video connections.\nVerizon Business Group\nOur Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and advanced communication services, corporate networking solutions, security and managed network services, local and long distance voice services and network access to deliver various Internet of Things (IoT) services and products. We provide these products and services to businesses, public sector customers and wireless and wireline carriers across the U.S. and a subset of these products and services to customers around the world. \nIn 2024, the Business segment's revenues were $29.5 billion, representing approximately 22% of Verizon’s consolidated revenues. As of December 31, 2024, Business had approximately 31 million wireless retail postpaid connections (including FWA) and approximately 2 million total broadband connections (which includes Fios internet, FWA and DSL connections).\nAdditional discussion of our reportable segments is included in Item 7 under the headings \"Management’s Discussion and Analysis of Financial Condition and Results of Operations — Overview\" and \"— Segment Results of Operations\" and in Note 13 to the consolidated financial statements included in this Annual Report.\nService and Product Offerings\nWireless Services and Equipment\nWe provide a wide variety of wireless services to Consumer and Business customers on different service plan options. \nOur Consumer Group offers customizable, personalized phone plans for retail customers, allowing them to design the plan that fits their needs, including access to their preferred content and services (which we call “perks”). We also offer plans for customers who want access to Verizon’s network at a lower price point, as well as discounts and special rate plans for qualifying customers. \nCustomers can obtain our wireless services on a postpaid or prepaid basis. Retail (non-wholesale) postpaid accounts primarily represent retail customers that are directly served and managed by Verizon and use Verizon branded services. A single account may include monthly wireless services for a variety of connected devices. Our postpaid service is generally billed one month in advance for a monthly access charge in return for access to and usage of network services. Our prepaid service is offered only to Consumer customers and enables individuals to obtain wireless services without credit verification by paying for all services in advance. As of December 31, 2024, we had 95 million postpaid connections and 20 million prepaid connections, representing approximately 83% and 17% of our Consumer wireless retail connections, respectively.\n4\nTable of Contents\n \nOur Business customers can choose from a variety of plans with different features to meet their specific needs.\nWe also provide FWA broadband through our 5G or 4G LTE wireless networks to our Consumer and Business customers. FWA enables fixed broadband access using radio frequencies instead of cables and can be used to connect homes and businesses to the internet. As of December 31, 2024, we had nearly 4.6 million FWA broadband connections.\nConsumer and Business offer several categories of wireless equipment to customers, including a variety of smartphones and other handsets, wireless-enabled internet devices, such as tablets, and other wireless-enabled connected devices, such as smart watches. Oftentimes, we offer promotional trade in offers to incentivize new customers or existing customer upgrades. Consumer wireless customers can acquire wireless equipment from us using device payment plans, which permit the customer to pay for the device in installments over time. Customers that activate service on devices purchased under the device payment program generally pay lower service fees as compared to those under our fixed-term service plans, and their device payment plan charge is included on their wireless monthly bill. While we no longer offer Consumer customers fixed-term subsidized service plans for devices, we continue to offer subsidized plans to our Business customers. We also continue to service existing plans for customers who have not yet purchased and activated devices under the Verizon device payment program.\nVerizon Consumer Group\nIn addition to wireless services and equipment for retail customers, the Consumer segment sells residential fixed connectivity solutions, including internet, video and voice services, and wireless network access to resellers on a wholesale basis. Consumer also provides non-connectivity services including device protection, content offerings, cloud storage, and other products.\nResidential fixed services \n– We provide residential fixed connectivity solutions to customers over our 100% fiber-optic network through our Verizon Fios product portfolio and over a traditional copper-based network to customers who are not served by Fios. We also provide FWA broadband through both 5G and 4G LTE home internet offerings, which are available in most states across the U.S.\nWe offer residential fixed services tailored to the needs of our customers with a variety of perk options and the flexibility to change them. Depending on customer needs at a particular time, our services may include features related to, among other things: internet access at different speed tiers using fiber-optic, copper or wireless technology; video services that may feature a variety of content and streaming options, video on demand products, cloud-based services and digital video recording capabilities; over-the-top (OTT) video services; voice services; and other home solutions. \nNetwork access services \n– We sell network access to mobile virtual network operators (MVNOs) on a wholesale basis, who in turn resell wireless service under their own brand(s) to consumers. \nVerizon Business Group \nIn addition to the wireless services and equipment discussed above, our Business segment provides a variety of wireless and wireline services and products, which are organized by the primary customer groups for these offerings: Enterprise and Public Sector, Business Markets and Other, and Wholesale.\nEnterprise and Public Sector\nEnterprise and Public Sector offers wireless products and services as well as wireline connectivity such as broadband and managed services to our large business and public sector customers. Large businesses are identified based on their size and volume of business with Verizon. Public sector customers include U.S. federal, state and local governments and educational institutions. Our offerings to this customer group include plans with features and pricing designed to address their specific needs. In 2024, Enterprise and Public Sector revenues were $14.2 billion, representing approximately 48% of Business’s total revenues.\nEnterprise and Public Sector offers a broad portfolio of connectivity, security and professional services designed to enable our customers to optimize their business operations, mitigate business risks and capitalize on data. These services include the following:\n•\nNetwork services \n– We offer a portfolio of network connectivity products to help our customers connect with their employees, partners, vendors and customers. These products include internet access services, private networking services, private cloud connectivity services and virtual and software defined networking services. \n•\nAdvanced communications services \n– We offer a suite of services to our customers to help them communicate with their employees, partners, vendors, constituents and customers. These products include Internet Protocol (IP)-based voice and video services, unified communications and collaboration tools and customer contact center solutions.\n•\nCore services \n– We provide a portfolio of domestic and global voice and data solutions utilizing traditional telecommunications technology, including voice calling, messaging services, conferencing, contact center solutions and private line and data access networks. Core services also include the provision of customer premises equipment, and installation, maintenance and site services. \n5\nTable of Contents\n•\nSecurity services \n– We offer a suite of management and data security services that help our customers protect, detect and respond to security threats to their networks, data, applications and infrastructure.\n•\nIoT services \n– We provide the network access required to deliver various IoT products and services. We work with companies that purchase network access from us to connect their devices, bundled together with their own solutions, which they sell to end users.\nBusiness Markets and Other\nBusiness Markets and Other offers wireless services (including FWA broadband), wireless equipment, advanced communication services, tailored voice and networking products, Fios services, advanced voice solutions and security services to businesses that ordinarily do not meet the requirements to be categorized as Enterprise and Public Sector, as described above. Business Markets and Other also includes solutions that support mobile resource management. In 2024, Business Markets and Other revenues were $13.1 billion, representing approximately 44% of Business’s total revenues.\nBusiness Markets and Other also provides fixed connectivity solutions comparable to the residential fixed services provided by Consumer, as well as business services and connectivity similar to the products and services offered to Global Enterprise customers, in each case with features and pricing designed to address the needs of small and medium businesses.\nWholesale\nWholesale offers wireline communications services including data, voice, local dial tone and broadband services primarily to local, long distance, and wireless carriers that use our facilities to provide services to their customers. In 2024, Wholesale revenues were $2.2 billion, representing approximately 8% of Business’s total revenues. A portion of Wholesale revenues are generated by a few large telecommunications companies, most of which compete directly with us. Wholesale's services include:\n•\nData services \n– We offer a portfolio of data services to enhance our Wholesale customers’ networks and provide connections to their end users and subscribers.\n•\nVoice services \n– We provide switched access services that allow carriers to complete their end-user calls that originate or terminate within our territory. In addition, we provide originating and terminating voice services throughout the U.S. and globally utilizing our time-division multiplexing and Voice over Internet Protocol (VoIP) networks.\n•\nLocal services \n– We offer an array of local dial tone and broadband services to competitive local exchange carriers, some of which are offered to comply with telecommunications regulations. In addition, we offer services such as colocation, resale and unbundled network elements in compliance with applicable regulations.\nDistribution\nWe use a combination of direct, indirect and alternative distribution channels to market and distribute our products and services to Consumer and Business customers. \nOur direct channel, including our company-operated stores, is a core component of our distribution strategy. Our sales and service centers and business direct sales teams also represent significant distribution channels for our services. In addition, we have a robust digital channel and omni-channel as a part of the customer experience in order to offer choice and convenience.\nOur indirect channel includes agents that sell our wireless and wireline products and services at retail locations throughout the U.S., as well as through the internet. The majority of these sales are made under exclusive selling arrangements with us. We also have relationships with high-profile national retailers that sell our wireless and wireline products and services, as well as convenience store chains that sell our wireless prepaid products and services. \nIn addition to our direct channel, our Business segment has additional distribution channels that include business solution fulfillment provided by resellers, non-stocked device fulfillment performed by distributors and integrated mobility services provided by system integrators and resellers.\nGlobal Networks and Technology\nOur Networks \nWe design, build and operate networks to provide connectivity and related services meeting the needs of our diverse customers: consumers, businesses, government organizations and educational institutions. \n•\nTechnologies\n – Our networks leverage advanced technologies, including 5G wireless, fiber-based transport, cloud infrastructures, private networks and IP routing solutions. \n6\nTable of Contents\n•\nScale and geography\n – We operate a national network covering over 146 million wireless retail connections as of December 31, 2024. In addition to our significant U.S. infrastructure, we have a presence globally and relationships with many operators and partners allowing us to service multinational network needs.\n•\nServices and capabilities\n – We provide connectivity, access to the internet, voice calling, text messaging and both linear and streaming video capabilities. Beyond these basic services, our network solutions include advanced services and capabilities such as E911, first responder solutions and private networking solutions.\n•\nReliability\n – We strive to design and deploy reliable networks. We test our networks for reliability and use various methods and procedures to maintain network availability, capability and capacity. To mitigate the impact of power disruptions on our operations, we have battery backup at every switch and every macro cell. We also utilize backup generators at a majority of our macro cells and at every switch location. In addition, we have a fleet of portable backup generators that can be deployed if needed.\nNetwork Evolution \nWe consider the reliability, speed, capacity, coverage and security of our wireless network to be key factors in our continued success. We are evolving and transforming our networks to ensure our customers receive access to the best network possible. Areas of evolution and transformation include:  \n•\n5G Wireless\n – Verizon has driven the conversion from 4G to 5G through a sequence of network changes involving the radio access network, the core network infrastructure and change to the devices connecting to the network. Over the past several years, we have been leading the development of 5G wireless technology industry standards and the ecosystems for fixed and mobile 5G wireless services. 5G technology enables higher throughput and lower latency than 4G LTE technology and allows our networks to handle more traffic as the number of internet-connected devices and customer usage needs grow. Our evolution to 5G with its new architecture allows us to simplify operations by eliminating legacy network elements.  \n•\nCoverage and densification\n – We continue to improve 5G wireless service coverage by leveraging our breadth of wireless spectrum, including millimeter wave and C-Band spectrum, which we are continuing to deploy across the continental U.S. We are densifying our networks by utilizing macro and small cell technology, in-building solutions and distributed antenna systems. Network densification enables us to increase coverage, improve quality of service and add capacity to accommodate an increasing number of users. It also supports our growing FWA business and growing bandwidth needs for uses such as streaming and video content creation.  \n•\nVirtualization\n – We are leveraging the benefits of cloud computing and storage as we evolve our network infrastructure. Our private cloud infrastructure allows us to use shared compute, storage and networking resources rather than building unique physical instances for our network infrastructure.  \n•\nFiber transport and IP networking\n – We own and operate one of the largest global fiber-optic networks in the world, providing connectivity to Business customers in more than 180 countries. Our global IP network includes long-haul, metro and submarine assets that enable and support international operations. In response to growing bandwidth demand, we have upgraded and increased our long-haul core fiber-based transport capacity as well as our IP network capacity and efficiency. We continue to build local fiber networks by adding fiber connectivity to premises, venues, cell tower locations and data centers.  \n•\nEnergy efficiency \n– We strive to improve the energy efficiency of our networks, facilities and fleet. We are balancing increased energy needs from ongoing expansion and densification of our networks with initiatives to effectively manage energy consumption, including using more energy-efficient equipment, discontinuing or migrating legacy services and pursuing opportunities to use renewable energy sources. \nFios \nResidential broadband service has seen significant growth in bandwidth demand over the past several years, and we believe that demand will continue to grow. We expect that the continued emergence of new video services, new data applications and the proliferation of IP devices in the home will continue to drive new network requirements for increased data speeds and throughput. We believe that the Passive Optical Network (PON) technology underpinning Fios positions us well to meet these demands in a cost-effective and efficient manner. We also continue to evolve the in-home broadband router element to bring new capability and improved performance, such as improved Wi-Fi, to our retail customers. \nWhile deployed initially as a consumer broadband network, our Fios infrastructure is also experiencing more widespread application in the Business segment, especially as businesses increasingly migrate to ethernet-based access services.\nIn September 2024, we entered into an agreement to acquire Frontier Communications Parent, Inc. (Frontier), a U.S. provider of broadband internet and other communication services. Upon closing, this transaction is expected to enhance our fiber broadband footprint and provide opportunities for future Fios growth.\n7\nTable of Contents\nSpectrum\nThe spectrum licenses we hold can be used for mobile and fixed wireless voice, video and data communications services. We are licensed by the Federal Communications Commission (FCC) to provide these wireless services on the following low and mid-band spectrum in areas that collectively cover nearly all of the population of the U.S.: (i) the 700 MHz Upper C block, (ii) Cellular spectrum (850 MHz), (iii) Personal Communication Services (PCS) spectrum (1900 MHz), (iv) AWS 1 and AWS 3 bands (1700 MHz uplink and 2100 MHz downlink), and (v) the 3.7 GHz band (C-Band). We also hold spectrum licenses in the 28, Upper 37 and 39 GHz bands, known as millimeter wave spectrum, and utilize both Priority Access Licenses (PALs) and General Authorized Access (GAA) in the 3.5 GHz band (Citizens Broadband Radio Service).\nWe anticipate that demand for spectrum will continue to increase over time, driven by growth in customer connections and the increased usage of wireless broadband services that use more bandwidth and require faster rates of speed, as well as the wider deployment of 5G mobile and fixed services. We expect to meet the demand for 5G and 4G spectrum needs with our existing spectrum assets. If demand continues to increase or if new spectrum is required for a future generation of technology, we can meet that demand by acquiring licenses or leasing spectrum from other licensees, or by acquiring new spectrum licenses from the FCC, if and when future FCC spectrum auctions occur. \nFrom time to time we have exchanged spectrum licenses with other wireless service providers through secondary market swap transactions. We expect to continue to pursue similar opportunities to trade spectrum licenses in order to meet capacity and expansion needs in the future. We also gain access to spectrum through cross-lease transactions. In certain cases, we have entered into intra-market spectrum swaps designed to increase the amount of contiguous spectrum within frequency bands in a specific market. Contiguous spectrum improves network performance and efficiency. These swaps, as well as any spectrum purchases, require us to obtain governmental approvals.\nInformation regarding spectrum license transactions, including our pending acquisition of select spectrum licenses of United States Cellular Corporation and certain of its subsidiaries, is presented in Note 3 to the consolidated financial statements included in this Annual Report.\nCompetition and Related Trends\nThe telecommunications industry is highly competitive. The rapid development of new technologies, services and products has eliminated many of the distinctions among wireless, cable, internet and traditional telephone services and brought new competitors to our markets. We expect competition to remain intense as traditional and non-traditional participants seek increased market share. \nCompetitive factors within the telecommunications industry include, among others, network reliability, speed, capacity and coverage; pricing and promotional strategies; the quality of customer service; marketing, sales and distribution capabilities; development of new and enhanced products and services; the ability to anticipate and respond to various factors and trends affecting our industry; the availability of capital resources; and regulatory changes. \nCompetition remains intense as a result of various factors, including aggressive pricing, increased levels of promotions and service plan discounts, and offerings that include additional bundled premium content or other perks, in some cases specifically targeting Verizon customers. Competition may increase as smaller, stand-alone wireless service providers merge or transfer licenses to larger, better capitalized wireless service providers and as MVNOs resell wireless communication services. In addition, aggressive network deployment as well as increasing government incentives related to it may enhance the ability of certain of our competitors to compete with us.\nWith respect to our wireless connectivity products and services, we compete against other national wireless service providers, including AT&T Inc. and T-Mobile US, Inc., as well as various regional wireless service providers. We also compete for retail activations with resellers that buy bulk wholesale service from wireless service providers, including Verizon, and resell it to their customers. Resellers include cable companies, such as Comcast Corporation and Charter Communications, Inc., and others. Several major cable operators also offer bundles with wireless services through strategic relationships. \nWe also face competition from other communications and technology companies seeking to increase their brand recognition and capture market share with respect to the provision of wireless products and services, in addition to non-traditional offerings in mobile data. For example, Microsoft Corporation, Alphabet Inc., Apple Inc., Meta Platforms, Inc. and others are offering alternative means for messaging and making wireless voice calls that, in certain cases, can be used in lieu of the wireless providers' voice service, as well as alternative means of accessing video content. In addition, we are seeing increasing competition in the provisioning of internet access by low Earth orbit satellite companies as well in the area of fixed wireless offerings that provide an alternative to traditional landline internet service providers.\nWith respect to Fios and our other broadband services, we compete against cable companies, wireless service providers, domestic and foreign telecommunications providers, satellite television companies, low Earth orbit satellite companies, internet service providers, OTT providers and other companies that offer network services and managed enterprise solutions. We also \n8\nTable of Contents\nface increasing competition from other internet portal providers. We expect the market will continue to shift from traditional linear video to OTT offerings. We also expect customer migration from traditional voice services to wireless services to continue.\nCompanies with a global presence are increasingly competing with us in our Business segment. A relatively small number of telecommunications and integrated service providers with global operations serve customers in the global enterprise market and, to a lesser extent, the global wholesale market. We compete with these providers for large contracts to provide integrated solutions to global enterprises and government customers. Many of these companies have strong market presence, brand recognition and existing customer relationships, all of which contribute to intense competition.\nIn the Enterprise and Public Sector markets, competition levels remain high, primarily as a result of increased industry focus on technology convergence. We compete in this area with system integrators, carriers, and hardware and software providers. In addition, some of the largest information technology services companies are making strategic acquisitions, divesting non-strategic assets and forging new alliances to improve their cost structure. Many new alliances and acquisitions have focused on developing fields, such as cloud computing, software defined networking, communication applications and other computing tasks via networks, rather than by the use of in-house machines. \nIn the Business Markets and Other category, customer purchasing behaviors and preferences continue to evolve. Solution speed and simplicity are becoming key differentiators for customers who are seeking full life-cycle offers that simplify the process of starting, running and growing their businesses. Mobile network operators and other carriers are aggressively targeting this customer group with a variety of bundles and discounts as it is among the largest and fastest growing categories in the Business segment.\nOur Wholesale business competes with traditional carriers for metro/mid/long-haul fiber, voice and IP services. In addition, mobile video and data needs are driving a greater need for wireless backhaul. Network providers, cable companies and specialty firms are competitors for this business opportunity.\nRegulatory Trends\nRegulatory Landscape\nVerizon operates in a regulated and highly competitive market, as described above. Some of our competitors are subject to fewer regulatory constraints than Verizon. For many services offered by Verizon, the FCC is our primary regulator. The FCC has jurisdiction over interstate telecommunications services and other matters under the Communications Act of 1934, as amended (Communications Act). Other Verizon services are subject to various state and local regulations.\nFederal, State and Local Regulation\nWireless Services\nThe FCC regulates several aspects of our wireless operations. Generally, the FCC has jurisdiction over the construction, operation, acquisition and transfer of wireless communications systems. All wireless services require use of radio frequency spectrum, the assignment and distribution of which is subject to FCC oversight. If demand continues to increase or if new spectrum is required for a future generation of technology, we can meet our needs for licensed spectrum by purchasing licenses or leasing spectrum from others, or by participating in a competitive bidding process to acquire new spectrum from the FCC. Those processes are subject to certain reviews, approvals and potential conditions.\nToday, Verizon holds FCC spectrum licenses that allow it to provide a wide range of mobile and fixed communications services, including both voice and data services. FCC spectrum licenses typically have a term of 10 years, at which time they are subject to renewal. While the FCC has routinely renewed all of Verizon’s wireless licenses, challenges could be raised in the future. If a wireless license was revoked or not renewed, Verizon would not be permitted to provide services on the spectrum covered by that license. Some of our licenses require us to comply with so-called \"open access\" FCC regulations, which generally require licensees of particular spectrum to allow customers to use devices and applications of their choice, subject to certain technical limitations. The FCC has also imposed certain specific mandates on wireless carriers, including construction and geographic coverage requirements, technical operating standards, provision of enhanced 911 services, roaming obligations and requirements for wireless tower and antenna facilities.\nThe Communications Act generally preempts regulation by state and local governments of the entry of, or the rates charged by, wireless carriers. It does not prohibit states from regulating the other \"terms and conditions\" of wireless service. For example, some states impose reporting and consumer protection requirements. Several states also have laws or regulations that address safety issues (for example, use of wireless handsets while driving), universal service funding, and taxation matters. Some states are also considering new network reliability or service quality requirements that may affect how and where we provide services if not preempted by federal law. In addition, wireless tower and antenna facilities are often subject to state and local zoning and land use regulation, and securing approvals for new or modified facilities is often a lengthy and expensive process.\n9\nTable of Contents\nBroadband\nVerizon offers many different broadband services. In early January 2025, based on litigation filed by the broadband industry, a federal appeals court overturned the FCC's April 2024 final decision to regulate broadband services via utility-style common carriage regulation under Title II of the Communications Act.  Absent further action in the courts, this decision will remain in effect and limit the risk of burdensome FCC broadband regulation. In addition to federal activity, several states have adopted or are considering adopting laws or executive orders that would impose net neutrality and other requirements on some of our broadband services, including a law in New York that requires discounted broadband pricing for low income customers. Some states may also impose pricing or other rules related to broadband built with the assistance of federal or state funding. The FCC also adopted broad rules related to \"digital discrimination\" that could further increase regulatory oversight of broadband services; industry groups have appealed those rules in court. Our broadband commitment can be found on our website at https://www.verizon.com/about/our-company/verizon-broadband-commitment.\nWireline Voice\nVerizon offers many different wireline voice services, including traditional telephone service and other services that rely on technologies such as VoIP. For regulatory purposes, legacy telephone services are generally considered to be \"common carrier\" services. Common carrier services are subject to heightened regulatory oversight with respect to rates, terms and conditions and other aspects of the services. The FCC has not decided the regulatory classification of VoIP but has said VoIP service providers must comply with certain rules, such as 911 capabilities and law enforcement assistance requirements.\nState public utility commissions regulate Verizon’s telephone operations with respect to certain telecommunications intrastate matters. Verizon operates as an \"incumbent local exchange carrier\" in nine states and the District of Columbia. These incumbent operations are subject to various levels of pricing flexibility and other state oversight and requirements. Verizon also has other wireline operations that are more lightly regulated. Some states, including California, impose reporting requirements and are considering new network reliability or service quality requirements for wireline voice services, including for VoIP.\nVideo\nVerizon offers a multichannel video service that is regulated like traditional cable service. The FCC has a body of rules that apply to cable operators, and these rules also generally apply to Verizon. In areas where Verizon offers its facilities-based multichannel video services, Verizon has been required to obtain a cable franchise from local government entities, or in some cases a state-wide franchise, and comply with certain one-time and ongoing obligations as a result.\nPrivacy, Data Protection, and Artificial Intelligence\nWe are subject to local, state, federal, and international laws and regulations relating to privacy and data protection that impact all parts of our business, including wireline, wireless, broadband and the development and roll out of new products. At the federal level, our business is governed by the FCC or the Federal Trade Commission (FTC), depending on the product or service. The California Consumer Privacy Act, Europe's General Data Protection Regulation and a number of other privacy laws more recently adopted by other states and countries include significant penalties for non-compliance. Generally, attention to privacy and data security requirements is increasing at all levels of government globally, and privacy-related legislation has been introduced or is under consideration in many locations. These regulations could have a significant impact on our businesses. Policymakers at the local, state, federal and international levels are also considering imposing laws and regulations on the use of artificial intelligence (AI). This is a nascent area of regulatory focus; therefore, it is unclear how such regulation could impact our business.\nPublic Safety and Cybersecurity\nThe FCC plays a role in addressing public safety concerns by regulating emergency communications services and mandating widespread availability of both media (broadcast/cable) and wireless emergency alerting services. In addition, federal and state agencies have mandated and may impose additional regulations to ensure continuity of service during disasters. For example, the FCC adopted rules requiring wireless providers to support roaming on each other’s networks during disasters, and the California Public Utilities Commission has imposed regulations relating to back-up power for communications facilities. In response to prior cyberattacks and increasing risks from cybersecurity threats, the FCC and other regulators are attempting to increase regulation of the cybersecurity practices of providers. The FCC is also addressing the use by American companies of equipment produced by certain companies deemed to cause potential national security risks. Verizon does not currently use equipment in its networks from vendors under such restrictions. \nIntercarrier Compensation and Network Access\nThe FCC regulates some of the rates that carriers pay each other for the exchange of voice traffic (particularly traditional wireline traffic) over different networks and other aspects of interconnection for some voice services. The FCC also regulates some of the rates and terms and conditions for certain wireline \"business data services\" and other services and network facilities. Verizon is both a seller and a buyer of these services, and both makes and receives interconnection payments.\n10\nTable of Contents\nHuman Capital Resources\nWith approximately 99,600 employees on a full-time equivalent basis as of December 31, 2024, 88% of whom are based in the U.S., we know that our people are one of our most valuable investments. In order to realize our core business strategy, we have developed human capital programs and practices that support, develop and care for our employees throughout their careers with Verizon. Our strategy to build a workforce with talent, skills and motivation to give the company a competitive edge now and into the future rests on three pillars:\n•\nAttract and maintain a diverse workforce with the necessary skills and talent to execute on our business priorities. \n•\nDevelop our employees' potential by offering educational opportunities that keep pace with changes occurring across our industry.\n•\nInspire individuals to build a career at Verizon by providing meaningful work and opportunities for career advancement in a collaborative and inclusive environment.\nVerizon strives to be an employer of choice by offering our employees competitive compensation and benefits packages. We seek to recruit and retain employees with diverse backgrounds, experiences and perspectives to best meet the needs of the diverse customers and communities we serve. We provide extensive on-the-job training opportunities, tuition reimbursement programs and career development support to enable our employees to maximize their potential and thrive professionally. As of December 31, 2024, Verizon's global workforce was approximately 68.6% male, 31.1% female and 0.3% unknown or undeclared, and the race/ethnicity of our U.S. workforce was 52.5% White, 18.4% Black, 14.0% Hispanic, 8.8% Asian, 0.4% American Indian / Alaskan Native, 0.3% Native Hawaiian / Pacific Islander, 2.6% two or more races, and 3.0% unknown or undeclared. Women represented 36.2% of U.S. senior leadership (vice president level and above). People of color represented 34.0% of U.S. senior leadership.\nVerizon respects our employees' rights to freedom of association and collective bargaining in compliance with applicable laws, including the right to join or not join labor unions. We have a long history of working with the Communications Workers of America and the International Brotherhood of Electrical Workers — the two unions that in total represent approximately 25% of our employees as of December 31, 2024. The current collective bargaining agreements covering our union-represented employees who serve customers in our Mid-Atlantic and Northeast service areas extend through August 1, 2026. Other collective bargaining agreements covering smaller groups of employees extend through various dates between 2025 and 2028. In addition, where applicable outside of the U.S., we engage with employee representative bodies such as works council. Verizon meets with U.S. national and local union leaders, as well as works council leaders outside the U.S., to talk about key business topics, including safety, customer service, plans to improve operational processes, our business performance and the impacts that changing technology and competition are having on our customers, employees and business strategy. \nFor a discussion of Verizon's Board oversight of risks related to our human capital resources, see the section entitled \"Governance — Our governance framework — Oversight of business risks\" in our definitive Proxy Statement to be filed with the Securities and Exchange Commission and delivered to shareholders in connection with our 2025 Annual Meeting of Shareholders.\nPatents, Trademarks and Licenses\nWe own or have licenses to various patents, copyrights, trademarks, domain names and other intellectual property rights necessary to conduct our business. We actively pursue the filing and registration of patents, copyrights, trademarks and domain names to protect our intellectual property rights within the United States and abroad. We also actively grant licenses, in exchange for appropriate fees or other consideration and subject to appropriate safeguards and restrictions, to other companies that enable them to utilize certain of our intellectual property rights and proprietary technology as part of their products and services. Such licenses enable the licensees to take advantage of Verizon's brands and the results of Verizon’s research and development efforts. While these licenses result in valuable consideration for Verizon, we do not believe that the loss of such consideration, or the expiration of any of our intellectual property rights, would have a material effect on our results of operations.\nWe periodically receive offers from third parties to purchase or obtain licenses for patents and other intellectual property rights in exchange for royalties or other payments. We also periodically receive notices alleging that our products or services infringe on third-party patents or other intellectual property rights. These claims, whether against us directly or against third-party suppliers of products or services that we sell to our customers, if successful, could require us to pay damages or royalties, rebrand, or cease offering the relevant products or services.\nInformation About Our Executive Officers\nSee Part III, Item 10. \"Directors, Executive Officers and Corporate Governance\" of this Annual Report on Form 10-K for information about our executive officers.\n11\nTable of Contents\nInformation on Our Internet Website\nWe make available, free of charge on our website, our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and all amendments to those reports, at https://www.verizon.com/about/investors as soon as reasonably practicable after such reports are electronically filed with or furnished to the Securities and Exchange Commission (SEC). These reports and other information are also available on the SEC's website at https://www.sec.gov. We periodically provide other information for investors on our website, including news and announcements regarding our financial performance, information on environmental, social and corporate governance matters, and details related to our annual meeting of shareholders. We encourage investors, the media, our customers, business partners and other stakeholders to review the information we post on this channel. Website references in this report are provided as a convenience and do not constitute, and should not be viewed as, incorporation by reference of the information contained on, or available through, the websites. Therefore, such information should not be considered part of this report.\nCautionary Statement Concerning Forward-Looking Statements\nIn this report we have made forward-looking statements. These statements are based on our estimates and assumptions and are subject to risks and uncertainties. Forward-looking statements include the information concerning our possible or assumed future results of operations. Forward-looking statements also include those preceded or followed by the words \"anticipates,\" \"assumes,\" \"believes,\" \"estimates,\" \"expects,\" \"forecasts,\" \"hopes,\" \"intends,\" \"plans,\" \"targets\" or similar expressions. For those statements, we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. \nThe following important factors, along with those discussed elsewhere in this report and in other filings with the SEC, could affect future results and could cause those results to differ materially from those expressed in the forward-looking statements: \n•\nthe effects of competition in the markets in which we operate, including the inability to successfully respond to competitive factors such as prices, promotional incentives and evolving consumer preferences; \n•\nfailure to take advantage of, or respond to competitors' use of, developments in technology, including artificial intelligence, and address changes in consumer demand;\n•\nperformance issues or delays in the deployment of our 5G network resulting in significant costs or a reduction in the anticipated benefits of the enhancement to our networks; \n•\nthe inability to implement our business strategy; \n•\nadverse conditions in the U.S. and international economies, including inflation and changing interest rates in the markets in which we operate; \n•\ncyberattacks impacting our networks or systems and any resulting financial or reputational impact; \n•\ndamage to our infrastructure or disruption of our operations from natural disasters, extreme weather conditions, acts of war, terrorist attacks or other hostile acts and any resulting financial or reputational impact; \n•\ndisruption of our key suppliers’ or vendors' provisioning of products or services, including as a result of geopolitical factors or the potential impacts of global climate change;\n•\nmaterial adverse changes in labor matters and any resulting financial or operational impact; \n•\ndamage to our reputation or brands;\n•\nthe impact of public health crises on our business, operations, employees and customers; \n•\nchanges in the regulatory environment in which we operate, including any increase in restrictions on our ability to operate our networks or businesses; \n•\nallegations regarding the release of hazardous materials or pollutants into the environment from our, or our predecessors', network assets and any related government investigations, regulatory developments, litigation, penalties and other liability, remediation and compliance costs, operational impacts or reputational damage;\n•\nour high level of indebtedness; \n12\nTable of Contents\n•\nsignificant litigation and any resulting material expenses incurred in defending against lawsuits or paying awards or settlements;\n•\nan adverse change in the ratings afforded our debt securities by nationally accredited ratings organizations or adverse conditions in the credit markets affecting the cost, including interest rates, and/or availability of further financing; \n•\nsignificant increases in benefit plan costs or lower investment returns on plan assets; \n•\nchanges in tax laws or regulations, or in their interpretation, or challenges to our tax positions, resulting in additional tax expense or liabilities;\n•\nchanges in accounting assumptions that regulatory agencies, including the SEC, may require or that result from changes in the accounting rules or their application, which could result in an impact on earnings; and\n•\nrisks associated with mergers, acquisitions, divestitures and other strategic transactions, including our ability to consummate the proposed acquisition of Frontier and obtain cost savings, synergies and other anticipated benefits within the expected time period or at all.",
  "item7": "Item 7.    Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nVerizon Communications Inc. is a holding company that, acting through its subsidiaries, is one of the world’s leading providers of communications, technology, information and streaming products and services to consumers, businesses and government entities. With a presence around the world, we offer data, video and voice services and solutions on our networks and platforms that are designed to meet customers’ demand for mobility, reliable network connectivity and security. \nTo compete effectively in today’s dynamic marketplace, we are focused on the capabilities of our high-performing networks to drive growth based on delivering what customers want and need in the digital world. We are consistently deploying new network architecture and technologies to secure our leadership in both 5G and 4G wireless networks. Our network quality is the hallmark of our brand and the foundation for the connectivity, platforms and solutions upon which we build our competitive advantage. In 2024, we focused on enhancing and driving the monetization of our networks, platforms and solutions, retaining and growing our high-quality customer base and further improving our financial and operating performance. \nOur strategy requires significant capital investments primarily to acquire wireless spectrum, put the spectrum into service, provide additional capacity for growth in our networks, invest in the fiber that supports our businesses, evolve and maintain our networks and develop and maintain significant advanced information technology systems and data system capabilities. We believe that our C-Band spectrum, together with our industry leading millimeter wave spectrum holdings and our 4G LTE network and fiber infrastructure, will drive innovative products and services and fuel our growth.\nHighlights of Our 2024 Financial Results\n(dollars in millions)\nBusiness Overview \nWe have two reportable segments that we operate and manage as strategic business units - Consumer and Business. \n23\nTable of \nContents\nRevenue by Segment \n———\nNote: Excludes eliminations.\nVerizon Consumer Group\nOur Consumer segment provides consumer-focused wireless and wireline communications services and products. Our wireless services are provided across one of the most extensive wireless networks in the U.S. under the Verizon family of brands and through wholesale and other arrangements. We also provide FWA broadband through our 5G or 4G LTE networks as an alternative to traditional landline internet access. Our wireline services are provided in nine states in the Mid-Atlantic and Northeastern U.S., as well as Washington D.C., over our 100% fiber-optic network through our Verizon Fios product portfolio and over a traditional copper-based network to customers who are not served by Fios. \nCustomers can obtain our wireless services on a postpaid or prepaid basis. Our postpaid service is generally billed one month in advance for a monthly access charge in return for access to and usage of network services. Our prepaid service is offered only to Consumer customers and enables individuals to obtain wireless services without credit verification by paying for all services in advance. The Consumer segment also offers several categories of wireless equipment to customers, including a variety of smartphones and other handsets, wireless-enabled internet devices, such as tablets, and other wireless-enabled connected devices, such as smart watches. \nIn addition to wireless services and equipment for retail customers, the Consumer segment sells residential fixed connectivity solutions, including internet, video and voice services, and wireless network access to resellers on a wholesale basis. \nThe Consumer segment's operating revenues for the year ended December 31, 2024 totaled $102.9 billion, an increase of $1.3 billion, or 1.3%, compared to the year ended December 31, 2023. See \"Segment Results of Operations\" for additional information regarding our Consumer segment’s operating performance and selected operating statistics.\nVerizon Business Group\nOur Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and advanced communication services, corporate networking solutions, security and managed network services, local and long distance voice services and network access to deliver various IoT services and products. We provide these products and services to businesses, public sector customers and wireless and wireline carriers across the U.S. and a subset of these products and services to customers around the world. \nThe Business segment's operating revenues for the year ended December 31, 2024 totaled $29.5 billion, a decrease of $591 million, or 2.0%, compared to the year ended December 31, 2023. See \"Segment Results of Operations\" for additional information regarding our Business segment's operating performance and selected operating statistics.\nCorporate and Other\nCorporate and other primarily includes device insurance programs, investments in unconsolidated businesses and development stage businesses that support our strategic initiatives, as well as unallocated corporate expenses, certain pension and other employee benefit related costs and interest and financing expenses. Corporate and other also includes the historical results of divested businesses and other adjustments and gains and losses that are not allocated or used in assessing segment performance due to their nature. Although such transactions are excluded from the business segment results, they are included in reported consolidated earnings. Gains and losses from these transactions that are not individually significant are included in segment results and therefore are included in the chief operating decision maker's assessment of segment performance. See \"Consolidated Results of Operations\" for additional information regarding Corporate and other results.\n24\nTable of \nContents\nCapital Expenditures and Investments\nWe continue to invest in our wireless networks, high-speed fiber and other advanced technologies to position ourselves at the center of growth trends for the future. During the year ended December 31, 2024, these investments included $17.1 billion for capital expenditures\n.\n See \"Cash Flows Used in Investing Activities\" and \"Liquidity and Capital Resources\" for additional information.\nGlobal Networks and Technology\nWe consider the reliability, speed, capacity, coverage and security of our wireless network to be key factors in our continued success. We are evolving and transforming our networks to ensure our customers receive access to the best network possible. Over the past several years, we have been leading the development of 5G wireless technology industry standards and the ecosystems for fixed and mobile 5G wireless services. Our evolution to 5G with its new architecture allows us to simplify operations by eliminating legacy network elements.\n \nWhile we continue to improve our 5G wireless service coverage, we are also adding capacity and density to our networks. Network densification enables us to increase coverage, improve quality of service and add capacity to accommodate an increasing number of users. \nIn addition to enhancing our wireless service, our wireless mobility investments provide the foundation for our growing FWA broadband business. We are also continuing to expand our fiber-based networks, as customers increasingly value the ability to obtain wireless and wireline broadband services from the same provider. In September 2024, we entered into an agreement to acquire Frontier as part of our fiber expansion strategy, and we expect to increase the capital expenditures we devote to our fiber networks in 2025.\nConsolidated Results of Operations\nIn this section, we discuss our overall results of operations and highlight special items that are not included in our segment results. In \"Segment Results of Operations,\" we review the performance of our two reportable segments in more detail. A detailed discussion of our 2022 results and year-over-year comparisons between 2023 and 2022 that are not included in this Form 10-K can be found in the \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" in our Annual Report on Form 10-K for the year ended December 31, 2023.\nConsolidated Operating Revenues\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nIncrease/(Decrease)\nConsumer\n$\n102,904\n \n$\n101,626 \n$\n1,278 \n1.3 \n%\nBusiness\n29,531\n \n30,122 \n(591)\n(2.0)\nCorporate and other\n2,609\n \n2,479 \n130 \n5.2 \nEliminations\n(256)\n(253)\n(3)\n1.2 \nConsolidated Operating Revenues\n$\n134,788\n \n$\n133,974 \n$\n814 \n0.6 \nConsolidated operating revenues increased during 2024 compared to 2023 \nprimarily due to revenue increases in our Consumer segment, partially offset by revenue decreases in our Business segment.\nRevenues for our segments are discussed separately below under the heading \"Segment Results of Operations.\"\nConsolidated Operating Expenses\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nIncrease/(Decrease)\nCost of services\n$\n27,997\n \n$\n28,100 \n$\n(103)\n(0.4)\n%\nCost of wireless equipment\n26,100\n \n26,787 \n(687)\n(2.6)\nSelling, general and administrative expense\n34,113\n \n32,745 \n1,368 \n4.2 \nDepreciation and amortization expense\n17,892\n \n17,624 \n268 \n1.5 \nVerizon Business Group goodwill impairment\n—\n \n5,841 \n(5,841)\nnm\nConsolidated Operating Expenses\n$\n106,102\n \n$\n111,097 \n$\n(4,995)\n(4.5)\nnm - not meaningful\nOperating expenses for our segments are discussed separately below under the heading \"Segment Results of Operations.\"\n25\nTable of \nContents\nCost of Services\nCost of services includes the following costs directly attributable to a service: salaries and wages, benefits, materials and supplies, content costs, contracted services, network access and transport costs, customer provisioning costs, computer systems support and costs to support our outsourcing contracts and technical facilities. Aggregate customer service costs, which include billing and service provisioning, are allocated between Cost of services and Selling, general and administrative expense. \nCost of services decreased during 2024 compared to 2023 primarily as a result of:\n•\na decrease of $259 million in access costs primarily as a result of \ndecreases in prepaid subscribers, changes in usage and net circuit access prices; \n•\na decrease of $147 million in personnel costs primarily related to the impact of workforce changes;\n•\nan increase of $167 million \nrelated to an asset and business rationalization charge taken in 2024 compared to an asset rationalization charge taken in 2023; and\n•\nan increase of $152 million in digital content costs primarily associated with an increase in subscriptions through MyPlan offerings, partially offset by a decrease in traditional linear content costs due to a decline in Fios video subscribers.\nCost of Wireless Equipment\nCost of wireless equipment decreased during 2024 compared to 2023 primarily as a result of:\n•\na decrease of $2.1 billion driven by a lower volume of wireless devices sold primarily related to a decrease of 10% in upgrades; and\n•\nan increase of $1.4 billion due to a shift to higher priced equipment in the mix of wireless devices sold.\nSelling, General and Administrative Expense\nSelling, general and administrative expense includes salaries and wages and benefits not directly attributable to a service or product, the provision for credit losses, taxes other than income taxes, advertising and sales commission costs, call center and information technology costs, regulatory fees, professional service fees and rent and utilities for administrative space. Also included is a portion of the aggregate customer care costs as discussed above in \"Cost of Services.\"\nSelling, general and administrative expense increased during 2024 compared to 2023 primarily as a result of: \n•\nan increase of $1.2 billion due to severance charges in 2024 primarily related to \nour voluntary separation program \ncompared to 2023;\n•\nan increase of $240 million in personnel costs related to an increase in costs associated with the transition to third-party contracted resources along with the impacts of a prior year compensation plan assumption change that did not reoccur and\n increased sales commission expense;\n•\nan increase of $124 million in the provision for credit losses resulting from an increase in postpaid phone gross additions and additional bad debt reserves;\n•\nan increase of $124 million in advertising costs related to Value Brand marketing campaigns and the refresh of the Verizon brand in 2024 compared to 2023;\n•\na decrease of $273 million \nrelated to an asset and business rationalization charge taken in 2024 compared to an asset rationalization charge taken in 2023; and\n•\na decrease of $161 million related to business transformation costs in 2023 that did not reoccur.\nSee \"Special Items\" for additional information on the severance charges, the asset and business rationalization charges and the business transformation costs. \nDepreciation and Amortization Expense\nDepreciation and amortization expense increased during 2024 compared to 2023, primarily due to the change in the mix of net depreciable and amortizable assets, including the amortization period of certain acquisition-related intangible assets, and the continued deployment of C-Band network assets.\nVerizon Business Group Goodwill Impairment\nDuring 2023, we recorded a pre-tax charge of $5.8 billion as a result of the annual goodwill impairment test performed in the fourth quarter. See \"Critical Accounting Estimates\" for additional information.\n26\nTable of \nContents\nOther Consolidated Results\nOther Income (Expense), Net\nAdditional information relating to Other income (expense), net is as follows:\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nIncrease/(Decrease)\nInterest income\n$\n336\n \n$\n354 \n$\n(18)\n(5.1)\n%\nOther components of net periodic benefit income (cost)\n300\n \n(938)\n1,238 \nnm\nNet debt extinguishment gains \n385\n \n308 \n77 \n25.0 \nOther, net\n(26)\n(37)\n11 \n(29.7)\nOther Income (Expense), Net\n$\n995\n \n$\n(313)\n$\n1,308 \nnm\nnm - not meaningful\nOther income (expense), net reflects certain items not directly related to our core operations, including interest income, debt extinguishment gains and losses, components of net periodic pension and postretirement benefit income and cost and certain foreign exchange gains and losses.\nOther income (expense), net increased during 2024 compared to 2023 primarily due to a net pension and postretirement benefits remeasurement gain of $657 million recorded during 2024, compared with a loss of $992 million recorded during 2023. The increase was partially offset by a decrease\n of $396 million due to lower plan assets on which to earn expected returns in our pension and postretirement plans compared to 2023. \nSee Note 11 to the consolidated financial statements for more information on the other components of net periodic benefit income (cost).\nInterest Expense\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nIncrease/(Decrease)\nTotal interest costs on debt balances\n$\n7,612\n \n$\n7,342 \n$\n270 \n3.7 \n%\nLess capitalized interest costs\n963\n \n1,818 \n(855)\n(47.0)\nInterest Expense\n$\n6,649\n \n$\n5,524 \n$\n1,125 \n20.4 \nAverage debt outstanding\n(1)(3)\n$\n150,361\n \n$\n151,062 \nEffective interest rate\n(2)(3)\n5.1\n \n%\n4.9 \n%\n(1)\nThe average debt outstanding is a financial measure and is calculated by applying a simple average of prior thirteen-month end balances of total short-term and long-term debt, net of discounts, premiums and unamortized debt issuance costs.\n(2)\nThe effective interest rate is the rate of actual interest incurred on debt. It is calculated by dividing the total interest costs on debt balances by the average debt outstanding. \n(3)\nWe believe that this measure is useful to management, investors and other users of our financial information in evaluating our debt financing cost and trends in our debt leverage management.\nTotal interest expense increased during 2024 compared to 2023 primarily as a result of a decrease in capitalized interest due to additional C-Band spectrum licenses being placed into service and an increase in interest costs due to a higher average interest rate partially offset by lower average debt balances.\nProvision for Income Taxes\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nIncrease\nProvision for income taxes\n$\n5,030\n \n$\n4,892 \n$\n138 \n2.8 \n%\nEffective income tax rate\n21.9\n \n%\n28.8 \n%\nThe effective income tax rate is calculated by dividing the provision for income taxes by income before the provision for income taxes. The decrease in the effective income tax rate was primarily due to the Verizon Business Group goodwill impairment charge of $5.8 billion in 2023 that substantially decreased income before income taxes and was not deductible. The increase in the provision for income taxes was primarily due to the increase in 2024 in income before income taxes.\nA reconciliation of the statutory federal income tax rate to the effective income tax rate for each period is included in Note 12 to the consolidated financial statements.\n27\nTable of \nContents\nConsolidated Net Income, Consolidated EBITDA and Consolidated Adjusted EBITDA\nConsolidated earnings before interest, taxes, depreciation and amortization expense (Consolidated EBITDA) and Consolidated Adjusted EBITDA, which are presented below, are non-GAAP financial measures that we believe are useful to management, investors and other users of our financial information in evaluating operating profitability on a more variable cost basis as they exclude the depreciation and amortization expense related primarily to capital expenditures and acquisitions that occurred in prior years, as well as in evaluating operating performance in relation to Verizon’s competitors. Consolidated EBITDA is calculated by adding back interest, taxes, depreciation and amortization expense to net income.\nConsolidated Adjusted EBITDA is calculated by excluding from Consolidated EBITDA the effect of the following non-operational items: equity in earnings and losses of unconsolidated businesses and other income and expense, net, as well as the effect of certain special items. We believe that this measure is useful to management, investors and other users of our financial information in evaluating the effectiveness of our operations and underlying business trends. We believe that Consolidated Adjusted EBITDA is widely used by investors to compare a company’s operating performance to its competitors by minimizing impacts caused by differences in capital structure, taxes, and depreciation and amortization policies. Further, the exclusion of non-operational items and special items enables comparability to prior period performance and trend analysis. See \"Special Items\" for additional information.\nIt is management’s intent to provide non-GAAP financial information to enhance the understanding of Verizon’s GAAP financial information, and it should be considered by the reader in addition to, but not instead of, the financial statements prepared in accordance with GAAP. Each non-GAAP financial measure is presented along with the corresponding GAAP measure so as not to imply that more emphasis should be placed on the non-GAAP measure. We believe that providing these non-GAAP measures in addition to the GAAP measures allows management, investors and other users of our financial information to more fully and accurately assess both consolidated and segment performance. The non-GAAP financial information presented may be determined or calculated differently by other companies and may not be directly comparable to that of other companies.\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nConsolidated Net Income\n$\n17,949\n \n$\n12,095 \nAdd:\nProvision for income taxes\n5,030\n \n4,892 \nInterest expense\n6,649\n \n5,524 \nDepreciation and amortization expense\n(1)\n17,892\n \n17,624 \nConsolidated EBITDA\n$\n47,520\n \n$\n40,135 \nAdd (Less):\nOther (income) expense, net\n(2)\n$\n(995)\n$\n313 \nEquity in losses of unconsolidated businesses\n53\n \n53 \nSeverance charges\n1,733\n \n533 \nAsset and business rationalization\n374\n \n480 \nLegacy legal matter\n106\n \n— \nVerizon Business Group goodwill impairment\n—\n \n5,841 \nLegal settlement\n—\n \n100 \nBusiness transformation costs\n—\n \n176 \nNon-strategic business shutdown\n—\n \n158 \nConsolidated Adjusted EBITDA\n$\n48,791\n \n$\n47,789 \n(1) \nIncludes Amortization of acquisition-related intangible assets, which were $817 million and $865 million during the years ended December 31, 2024 and 2023, respectively. The results for the year ended December 31, 2023 also include a portion of the charges associated with the Non-strategic business shutdown. See \"Special Items\" for additional information.\n(2)\n Includes Pension and benefits mark-to-market credits of $532 million during the year ended December 31, 2024 and charges of $992 million during the year ended December 31, 2023. See \"Special Items\" for additional information.\nThe changes in Consolidated Net Income, Consolidated EBITDA and Consolidated Adjusted EBITDA in the table above during 2024 compared to 2023 were primarily a result of the factors described above in connection with consolidated operating revenues and consolidated operating expenses.\nSegment Results of Operations\nWe have two reportable segments that we operate and manage as strategic business units - Consumer and Business. We measure and evaluate our segments based on segment operating income. The use of segment operating income is consistent with the chief operating decision maker’s assessment of segment performance.\n28\nTable of \nContents\nTo aid in the understanding of segment performance as it relates to segment operating income, management uses the following operating statistics to evaluate the overall effectiveness of our segments. We believe these operating statistics are useful to investors and other users of our financial information because they provide additional insight into drivers of our segments’ operating results, key trends and performance relative to our peers. These operating statistics may be determined or calculated differently by other companies and may not be directly comparable to those statistics of other companies.\nWireless retail connections \nare retail customer device postpaid and prepaid connections as of the end of the period. Retail connections under an account may include those from smartphones and basic phones (collectively, phones), postpaid and prepaid FWA, as well as tablets and other internet devices, wearables and retail IoT devices. Wireless retail connections are calculated by adding total retail postpaid and prepaid new connections in the period to prior period retail connections, and subtracting total retail postpaid and prepaid disconnects in the period. \nWireless retail postpaid connections\n are retail postpaid customer device connections as of the end of the period. Retail postpaid connections under an account may include those from phones, postpaid FWA, as well as tablets and other internet devices, wearables and retail IoT devices. Wireless retail postpaid connections are calculated by adding retail postpaid new connections in the period to prior period retail postpaid connections, and subtracting retail postpaid disconnects in the period. \nWireless retail prepaid connections\n are retail prepaid customer device connections as of the end of the period. Retail prepaid connections may include those from phones, prepaid FWA, as well as tablets and other internet devices, and wearables. Wireless retail prepaid connections are calculated by adding retail prepaid new connections in the period to prior period retail prepaid connections, and subtracting retail prepaid disconnects in the period.\nFios internet connections\n are the total number of connections to the internet using Fios internet services as of the end of the period. Fios internet connections are calculated by adding Fios internet new connections in the period to prior period Fios internet connections, and subtracting Fios internet disconnects in the period.\nFios video connections \nare the total number of connections to traditional linear video programming using Fios video services as of the end of the period. Fios video connections are calculated by adding Fios video net additions in the period to prior period Fios video connections. Fios video net additions are calculated by subtracting the Fios video disconnects from the Fios video new connections.\nTotal broadband connections\n are the total number of connections to the internet using Fios internet services, Digital Subscriber Line (DSL), and postpaid, prepaid and IoT FWA as of the end of the period. Total broadband connections are calculated by adding total broadband connections, net additions in the period to prior period total broadband connections. \nFWA broadband connections\n are the total number of postpaid and prepaid connections to the internet through our 5G or 4G LTE wireless networks as of the end of the period. FWA broadband connections are calculated by adding FWA broadband connections, net additions in the period to prior period FWA broadband connections.\nWireline broadband\n \nconnections\n are the total number of connections to the internet using DSL and Fios internet services as of the end of the period. Wireline broadband connections are calculated by adding wireline broadband connections, net additions in the period to prior period wireline broadband connections.\nWireless retail connections, net addition\ns are the\n \ntotal number of additional retail customer device postpaid and prepaid connections, less the number of device disconnects in the period. Wireless retail connections, net additions in each period presented are calculated by subtracting the total retail postpaid and prepaid disconnects, net of certain adjustments, from the total retail postpaid and prepaid new connections in the period. \nWireless retail postpaid connections, net additions \nare the total number of additional retail customer device postpaid connections, less the number of device disconnects in the period. Wireless retail postpaid connections, net additions in each period presented are calculated by subtracting the retail postpaid disconnects, net of certain adjustments, from the retail postpaid new connections in the period. \nWireless retail prepaid connections, net additions\n are the total number of additional retail customer device prepaid connections, less the number of device disconnects in the period. Wireless retail prepaid connections, net additions in each period presented are calculated by subtracting the retail prepaid disconnects, net of certain adjustments, from the retail prepaid new connections in the period.\nWireless retail postpaid phone connections, net additions \nare the total number of additional retail customer postpaid phone connections, less the number of phone disconnects in the period. Wireless retail postpaid phone connections, net additions in each period presented are calculated by subtracting the retail postpaid phone disconnects, net of certain adjustments, from the retail postpaid phone new connections in the period. \nTotal broadband connections, net additions\n are the total number of additional total broadband connections, less the number of total broadband disconnects in the period. Total broadband connections, net additions in each period presented are calculated by subtracting the total broadband disconnects, net of certain adjustments, from the total broadband new connections in the period. \n29\nTable of \nContents\nFWA broadband connections, net additions\n are the total number of additional FWA broadband connections, less the number of FWA broadband disconnects in the period. FWA broadband connections, net additions in each period presented are calculated by subtracting the FWA broadband disconnects, net of certain adjustments, from the FWA broadband new connections in the period.\nWireline broadband connections, net additions\n are the total number of additional wireline broadband connections, less the number of wireline broadband disconnects in the period. Wireline broadband connections, net additions in each period presented are calculated by subtracting the wireline broadband disconnects, net of certain adjustments, from the wireline broadband new connections in the period.\nWireless churn\n is the rate at which service to retail, retail postpaid, or retail postpaid phone connections is terminated on average in the period. The churn rate in each period presented is calculated by dividing retail disconnects, retail postpaid disconnects, or retail postpaid phone disconnects by the average retail connections, average retail postpaid connections, or average retail postpaid phone connections, respectively, in the period. \nWireless retail postpaid ARPA\n is the calculated average retail postpaid service revenue per account (ARPA) from retail postpaid accounts in the period. Wireless retail postpaid service revenue does not include recurring device payment plan billings related to the Verizon device payment program, plan billings related to device warranty and insurance or regulatory fees. Wireless retail postpaid ARPA in each period presented is calculated by dividing retail postpaid service revenue by the average retail postpaid accounts in the period. \nWireless retail postpaid accounts\n are wireless retail\n \ncustomers that are directly served and managed under the Verizon brand and use its services as of the end of the period. Accounts include unlimited plans, shared data plans and corporate accounts, as well as legacy single connection plans and multi-connection family plans. A single account may include monthly wireless services for a variety of connected devices. Wireless retail postpaid accounts are calculated by adding retail postpaid new accounts to the prior period retail postpaid accounts. \nWireless retail postpaid connections per account \nis the calculated average number of retail postpaid connections per retail postpaid account as of the end of the period. Wireless retail postpaid connections per account\n \nis calculated by dividing the total number of retail postpaid connections by the number of retail postpaid accounts as of the end of the period.\nSegment operating income margin\n reflects the profitability of the segment as a percentage of revenue. Segment operating income margin is calculated by dividing total segment operating income by total segment operating revenues. \nSegment earnings before interest, taxes, depreciation and amortization (Segment EBITDA)\n, which is presented below, is a non-GAAP measure and does not purport to be an alternative to operating income (loss) as a measure of operating performance. We believe this measure is useful to management, investors and other users of our financial information in evaluating operating profitability on a more variable cost basis as it excludes the depreciation and amortization expense related primarily to capital expenditures and acquisitions that occurred in prior years, as well as in evaluating operating performance in relation to our competitors. Segment EBITDA is calculated by adding back depreciation and amortization expense to segment operating income (loss). Segment EBITDA margin is calculated by dividing Segment EBITDA by total segment operating revenues. See Note 13 to the consolidated financial statements for additional information.\nVerizon Consumer Group\nOur Consumer segment provides consumer-focused wireless and wireline communications services and products. Our wireless services are provided across one of the most extensive wireless networks in the U.S. under the Verizon family of brands and through wholesale and other arrangements. We also provide FWA broadband through our 5G or 4G LTE networks as an alternative to traditional landline internet access. Our wireline services are provided in nine states in the Mid-Atlantic and Northeastern U.S., as well as Washington D.C., over our 100% fiber-optic network through our Verizon Fios product portfolio and over a traditional copper-based network to customers who are not served by Fios. \n30\nTable of \nContents\nOperating Revenues and Selected Operating Statistics \n(dollars in millions, except ARPA)\nYears Ended December 31,\n2024\n2023\nIncrease/(Decrease)\nService\n$\n76,880\n \n$\n74,874 \n$\n2,006 \n2.7 \n%\nWireless equipment\n19,598\n \n20,645 \n(1,047)\n(5.1)\nOther\n6,426\n \n6,107 \n319 \n5.2 \nTotal Operating Revenues\n$\n102,904\n \n$\n101,626 \n$\n1,278 \n1.3 \nRevenue Statistics:\nWireless service revenue\n$\n65,374\n \n$\n63,358 \n$\n2,016 \n3.2 \nFios revenue\n$\n11,647\n \n$\n11,614 \n$\n33 \n0.3 \nConnections (‘000):\n(1)\nWireless retail postpaid\n95,118\n \n93,850 \n1,268 \n1.4 \nWireless retail prepaid\n20,138\n \n21,122 \n(984)\n(4.7)\nTotal wireless retail\n115,256\n \n114,972 \n284 \n0.2 \nFios internet\n7,135\n \n6,976 \n159 \n2.3 \nFios video \n2,684\n \n2,951 \n(267)\n(9.0)\nFWA broadband\n2,714\n \n1,866 \n848 \n45.4 \nWireline broadband\n7,300\n \n7,190 \n110 \n1.5 \nTotal broadband\n10,014\n \n9,056 \n958 \n10.6 \nNet Additions in Period (‘000):\nWireless retail postpaid\n1,345\n \n2,044 \n(699)\n(34.2)\nWireless retail prepaid\n(975)\n(1,151)\n176 \n15.3 \nTotal wireless retail\n370\n \n893 \n(523)\n(58.6)\nWireless retail postpaid phones\n341\n \n(132)\n473 \nnm\nFWA broadband\n846\n \n989 \n(143)\n(14.5)\nWireline broadband\n110\n \n174 \n(64)\n(36.8)\nTotal broadband\n956\n \n1,163 \n(207)\n(17.8)\nChurn Rate:\nWireless retail\n1.62\n \n%\n1.67 \n%\nWireless retail postpaid\n1.06\n \n%\n1.03 \n%\nWireless retail postpaid phones\n0.84\n \n%\n0.83 \n%\nAccount Statistics:\nWireless retail postpaid ARPA\n$\n138.25\n \n$\n132.36 \n$\n5.89 \n4.4 \nWireless retail postpaid accounts (‘000)\n(1)\n32,794\n \n32,990 \n(196)\n(0.6)\nWireless retail postpaid connections per account\n(1)\n2.90\n \n2.84 \n0.06 \n2.1 \n(1) \nAs of end of period\nWhere applicable, the operating results reflect certain adjustments, including those related to the 3G network shutdowns, migration activity among different types of devices and plans, customer profile changes, and adjustments in connection with mergers, acquisitions and divestitures.\nnm - not meaningful\nConsumer's total operating revenues increased during 2024 compared to 2023 as a result of increases in Service and Other revenues, partially offset by a decrease in Wireless equipment revenue. \nService Revenue \nService revenue increased during 2024 compared to 2023 primarily driven by an increase in Wireless service revenue.\n31\nTable of \nContents\nWireless service revenue increased during 2024 compared to 2023 primarily as a result of:\n•\nan increase of $1.5 billion in access revenues related to our postpaid plans primarily due to pricing actions, an increase in subscriptions through MyPlan offerings and a 45% increase in our FWA subscriber base. These increases were partially offset by the amortization of wireless equipment sales promotions;\n•\nan increase of $638 million related to growth in non-retail service revenue;\n•\nan increase of $318 million in TravelPass revenue due to increased customer international travel; and\n•\na decrease of $625 million in prepaid revenue primarily due to a decrease in the prepaid subscriber base partially driven by the termination of the Affordable Connectivity Program in the second quarter of 2024.\nWireless Equipment Revenue\nWireless equipment revenue decreased during 2024 compared to 2023 primarily as a result of:\n•\na decrease of $1.5 billion driven by a lower volume of wireless devices sold primarily related to a decrease of 10% in upgrades; and\n•\nan increase of $474 million due to a shift to higher priced equipment in the mix of wireless devices sold, partially offset by the impact of related promotions.\nOther Revenue\nOther revenue includes fees that partially recover the direct and indirect costs of complying with regulatory and industry obligations and programs, revenues associated with certain products included in our device protection offerings, leasing and interest recognized when equipment is sold to the customer by an authorized agent under a device payment plan agreement.\nOther revenue increased during 2024 compared to 2023 primarily due to: \n•\nan increase of $193 million driven by regulatory surcharges primarily related to a higher net \nFederal Universal Service Fund\n rate, along with an increase in other regulatory surcharges; and\n•\nan increase of $116 million related to device protection offerings primarily due to changes in the products offered and pricing actions.\nOperating Expenses\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nIncrease/(Decrease)\nCost of services\n$\n18,072\n \n$\n17,580 \n$\n492 \n2.8 \n%\nCost of wireless equipment\n21,259\n \n21,827 \n(568)\n(2.6)\nSelling, general and administrative expense\n20,537\n \n20,131 \n406 \n2.0 \nDepreciation and amortization expense\n13,552\n \n13,077 \n475 \n3.6 \nTotal Operating Expenses\n$\n73,420\n \n$\n72,615 \n$\n805 \n1.1 \nCost of Services\nCost of services increased during 2024 compared to 2023 primarily as a result of:\n•\nan increase of $270 million in rent and lease expense primarily driven by new leases and lease modifications related to the continued deployment of the C-Band spectrum and Consumer's proportionate usage of shared leased assets;\n•\nan increase of $195 million in personnel costs mainly driven by certain other post-employment benefit credits in 2023 that did not reoccur in 2024;\n•\nan increase of $154 million in digital content costs primarily associated with an increase in subscriptions through MyPlan offerings, partially offset by a decrease in traditional linear content costs due to a decline in Fios video subscribers; and\n•\na decrease of $169 million in access costs primarily as a result of decreases in prepaid subscribers, changes in usage and net circuit access prices.\nCost of Wireless Equipment\nCost of wireless equipment decreased during 2024 compared to 2023 primarily as a result of:\n•\na decrease of $1.7 billion driven by a lower volume of wireless devices sold primarily related to a decrease of 10% in upgrades; and\n•\nan increase of $1.2 billion due to a shift to higher priced equipment in the mix of wireless devices sold.\nSelling, General and Administrative Expense\nSelling, general and administrative expense increased during 2024 compared to 2023 primarily due to:\n•\nan increase of $176 million in the provision for credit losses resulting from an increase in postpaid phone gross additions and additional bad debt reserves; and\n•\nan increase of $105 million in advertising costs related to Value Brand marketing campaigns in 2024 compared to 2023.\n32\nTable of \nContents\nDepreciation and Amortization Expense\nDepreciation and amortization expense increased during 2024 compared to 2023 driven by the change in the mix of total Verizon depreciable and amortizable assets and Consumer's usage of those assets.\nSegment Operating Income and EBITDA\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nIncrease\nSegment Operating Income\n$\n29,484\n \n$\n29,011 \n$\n473 \n1.6 \n%\nAdd Depreciation and amortization expense\n13,552\n \n13,077 \n475 \n3.6 \nSegment EBITDA\n$\n43,036\n \n$\n42,088 \n$\n948 \n2.3 \nSegment operating income margin\n28.7\n \n%\n28.5 \n%\nSegment EBITDA margin\n41.8\n \n%\n41.4 \n%\nThe changes in the table above during the periods presented were primarily a result of the factors described above in connection with Consumer operating revenues and operating expenses. \nVerizon Business Group\nOur Business segment provides wireless and wireline communications services and products, including FWA broadband, data, video and advanced communication services, corporate networking solutions, security and managed network services, local and long distance voice services and network access to deliver various IoT services and products. We provide these products and services to businesses, public sector customers and wireless and wireline carriers across the U.S. and a subset of these products and services to customers around the world. The Business segment is organized in three customer groups: Enterprise and Public Sector, Business Markets and Other, and Wholesale.\n33\nTable of \nContents\nOperating Revenues and Selected Operating Statistics  \n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nIncrease/(Decrease)\nEnterprise and Public Sector\n$\n14,218\n \n$\n15,076 \n$\n(858)\n(5.7)\n%\nBusiness Markets and Other\n13,099\n \n12,715 \n384 \n3.0 \nWholesale\n2,214\n \n2,331 \n(117)\n(5.0)\nTotal Operating Revenues\n(1)\n$\n29,531\n \n$\n30,122 \n$\n(591)\n(2.0)\nRevenue Statistics:\nWireless service revenue\n$\n13,753\n \n$\n13,372 \n$\n381 \n2.8 \nFios revenue\n$\n1,252\n \n$\n1,235 \n$\n17 \n1.4 \nConnections (‘000):\n(2)\nWireless retail postpaid\n30,819\n \n29,779 \n1,040 \n3.5 \nFios internet\n401\n \n385 \n16 \n4.2 \nFios video\n54\n \n61 \n(7)\n(11.5)\nFWA broadband\n1,854\n \n1,201 \n653 \n54.4 \nWireline broadband\n459\n \n460 \n(1)\n(0.2)\nTotal broadband\n2,313\n \n1,661 \n652 \n39.3 \nNet Additions in Period ('000):\nWireless retail postpaid\n1,010\n \n1,242 \n(232)\n(18.7)\nWireless retail postpaid phones\n546\n \n562 \n(16)\n(2.8)\nFWA broadband\n622\n \n547 \n75 \n13.7 \nWireline broadband\n(1)\n(8)\n7 \n87.5 \nTotal broadband\n621\n \n539 \n82 \n15.2 \nChurn Rate:\nWireless retail postpaid\n1.47\n \n%\n1.48 \n%\nWireless retail postpaid phones\n1.11\n \n%\n1.13 \n%\n(1)\nService and other revenues included in our Business segment were approximately $25.9 billion and $26.4 billion for the years ended December 31, 2024 and 2023, respectively. Wireless equipment revenues included in our Business segment were approximately $3.6 billion and $3.7 billion for the years ended December 31, 2024 and 2023, respectively.\n(2)\n As of end of period\nWhere applicable, the operating results reflect certain adjustments, including those related to the 3G network shutdowns, migration activity among different types of devices and plans, customer profile changes, and adjustments in connection with mergers, acquisitions and divestitures.\nBusiness's total operating revenues decreased during 2024 compared to 2023 as a result of decreases in Enterprise and Public Sector and Wholesale revenues, partially offset by an increase in Business Markets and Other revenue.\nEnterprise and Public Sector\nEnterprise and Public Sector offers wireless products and services as well as wireline connectivity such as broadband and managed services to our large business and public sector customers. Large businesses are identified based on their size and volume of business with Verizon. Public sector customers include U.S. federal, state and local governments and educational institutions. Our offerings to this customer group include plans with features and pricing designed to address their specific needs. \nEnterprise and Public Sector revenues decreased during 2024 compared to 2023 primarily due to a decrease of $702 million in wireline revenue primarily driven by declines in networking, traditional data and voice communication services along with related professional services. These declines were due to secular market pressure and technology shifts, coupled with lower customer premise equipment sales volumes.\nBusiness Markets and Other\nBusiness Markets and Other offers wireless services (including FWA broadband), wireless equipment, advanced communication services, tailored voice and networking products, Fios services, advanced voice solutions and security services to businesses \n34\nTable of \nContents\nthat ordinarily do not meet the requirements to be categorized as Enterprise and Public Sector, as described above. Business Markets and Other also includes solutions that support mobile resource management.\nBusiness Markets and Other revenue increased during 2024 compared to 2023 primarily as a result of: \n•\nan increase of $486 million in Wireless service revenue primarily due to pricing actions and an increase in our FWA subscriber base; and\n•\na decrease of $89 million in connection with the shutdown of our BlueJeans business offering in 2023 and a decline in traditional voice communication revenues.\nWholesale\nWholesale offers wireline communications services including data, voice, local dial tone and broadband services primarily to local, long distance, and wireless carriers that use our facilities to provide services to their customers.\nWholesale revenues decreased during 2024 compared to 2023 primarily due to a decrease of $117 million related to declines in traditional voice communication and network connectivity as a result of technology substitution, as well as a decrease in core data.\nOperating Expenses\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nIncrease/(Decrease)\nCost of services\n$\n9,742\n \n$\n10,180 \n$\n(438)\n(4.3)\n%\nCost of wireless equipment\n4,841\n \n4,959 \n(118)\n(2.4)\nSelling, general and administrative expense\n8,583\n \n8,429 \n154 \n1.8 \nDepreciation and amortization expense\n4,307\n \n4,488 \n(181)\n(4.0)\nTotal Operating Expenses\n$\n27,473\n \n$\n28,056 \n$\n(583)\n(2.1)\nCost of Services\nCost of services decreased during 2024 compared to 2023 primarily due to: \n•\na decrease of $99 million in rent and lease expense primarily driven by a change in Business's proportionate usage of shared leased assets;\n•\na decrease of $87 million in access costs primarily related to changes in usage and net circuit access prices; \n•\na decrease of $82 million in customer premise equipment costs due to lower volumes sold; and\n•\na decrease of $63 million in personnel costs related to the impact of workforce changes, partially offset by certain other post-employment benefit credits in 2023 that did not reoccur in 2024.\nCost of Wireless Equipment\nCost of wireless equipment decreased during 2024 compared to 2023 primarily as a result of: \n•\na decrease of $385 million driven by a lower volume of wireless devices sold; and\n•\nan increase of $267 million due to a shift to higher priced equipment in the mix of wireless devices sold.\nSelling, General and Administrative Expense\nSelling, general and administrative expense increased during 2024 compared to 2023 primarily as a result of:\n•\nan increase of $221 million in personnel costs primarily related to an increase in costs associated with the transition to third-party contracted resources along with the impacts of a prior year compensation plan assumption change that did not reoccur; and\n•\na decrease of $63 million in \nthe provision for credit losses resulting from a reduction in bad debt reserves.\nDepreciation and Amortization Expense\nDepreciation and amortization expense decreased during 2024 compared to 2023 driven by the change in the mix of total Verizon depreciable and amortizable assets and Business's usage of those assets.\n35\nTable of \nContents\nSegment Operating Income and EBITDA\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nDecrease\nSegment Operating Income\n$\n2,058\n \n$\n2,066 \n$\n(8)\n(0.4)\n%\nAdd Depreciation and amortization expense\n4,307\n \n4,488 \n(181)\n(4.0)\nSegment EBITDA\n$\n6,365\n \n$\n6,554 \n$\n(189)\n(2.9)\nSegment operating income margin\n7.0\n \n%\n6.9 \n%\nSegment EBITDA margin\n21.6\n \n%\n21.8 \n%\nThe changes in the table above during the periods presented were primarily a result of the factors described above in connection with Business operating revenues and operating expenses. \nSpecial Items\nSpecial items included in Income Before Provision For Income Taxes were as follows:\n \n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nAmortization of acquisition-related intangible assets\n(1)\nDepreciation and amortization expense\n$\n817\n \n$\n865 \nSeverance, pension and benefits charges (credits)\nSelling, general and administrative expense\n1,733\n \n533 \nOther (income) expense, net\n(532)\n992 \nAsset and business rationalization\nCost of services\n189\n \n22 \nSelling, general and administrative expense\n185\n \n458 \nLegacy legal matter\nSelling, general and administrative expense\n106\n \n— \nVerizon Business Group goodwill impairment\nVerizon Business Group goodwill impairment\n—\n \n5,841 \nLegal settlement\nSelling, general and administrative expense\n—\n \n100 \nBusiness transformation costs\nCost of services\n—\n \n15 \nSelling, general and administrative expense\n—\n \n161 \nNon-strategic business shutdown\nDepreciation and amortization expense\n—\n \n21 \nCost of services\n—\n \n45 \nSelling, general and administrative expense\n—\n \n113 \nTotal\n$\n2,498\n \n$\n9,166 \n(1) \nAmounts are included in segment results of operations.\nConsolidated Adjusted EBITDA, a non-GAAP measure discussed in the section titled \"Consolidated Net Income, Consolidated EBITDA and Consolidated Adjusted EBITDA\" as part of Consolidated Results of Operations, excludes all of the amounts included above. \nThe income and expenses related to special items included in our consolidated results of operations were as follows:\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nWithin Total Operating Expenses\n$\n3,030\n \n$\n8,174 \nWithin Other (income) expense, net\n(532)\n992 \nTotal\n$\n2,498\n \n$\n9,166 \nAmortization of Acquisition-Related Intangible Assets\nDuring 2024 and 2023, we recorded pre-tax amortization expense of $817 million and $865 million, respectively, related to acquired intangible assets.\n36\nTable of \nContents\nSeverance, Pension and Benefits Charges (Credits)\nDuring 2024, we recorded pre-tax severance charges of $1.7 billion, related to separations under our voluntary separation program for select U.S.-based management employees as well as other headcount reduction initiatives. The severance charges were recorded in Selling, general and administrative expense in our consolidated statement of income.\nDuring 2024, in accordance with our accounting policy to recognize actuarial gains and losses in the period in which they occur, we recorded a net pre-tax pension and benefits credit of $532 million in our pension and postretirement benefit plans. The net gain was recorded in Other income (expense), net in our consolidated statement of income and was primarily driven by:\n•\na credit of $1.3 billion ($635 million for pension plans and $656 million for postretirement benefit plans) due to an increase in our discount rate assumption used to determine the current year liabilities of our plans from a weighted-average of 5.0% for both our pension and post retirement plans at December 31, 2023 to a weighted-average of 5.8% for our pension plans and 5.6% for our postretirement benefit plans at December 31, 2024; \n•\na charge of $711 million due to the difference between our estimated and actual return on assets; and\n•\na net charge of $48 million primarily due to other actuarial assumption adjustments.\nDuring 2023, we recorded net pre-tax severance charges of $533 million, primarily related to involuntary separations under our existing plans, in Selling, general and administrative expense in our consolidated statement of income.\nDuring 2023, in accordance with our accounting policy to recognize actuarial gains and losses in the period in which they occur, we recorded net pre-tax pension and benefits charges of $992 million in our pension and postretirement benefit plans. The charges were recorded in Other income (expense), net in our consolidated statement of income and were primarily driven by:\n•\na charge of $534 million due to an increase in our healthcare cost trend rate assumption used to determine the current year liabilities of our postretirement benefit plans from a weighted-average of 6.6% at December 31, 2022 to a weighted-average of 7.3% at December 31, 2023;\n•\na charge of $503 million ($288 million for pension plans and $215 million for postretirement benefit plans) due to a decrease in our discount rate assumption used to determine the current year liabilities of our plans from a weighted-average of 5.2% at December 31, 2022 to a weighted-average of 5.0% at December 31, 2023; and\n•\na net credit of $45 million primarily due to other actuarial assumption adjustments, which includes the difference between our estimated and our actual return on plan assets.\nDue to the presentation of the other components of net periodic benefit cost, we recognize a portion of the pension and benefits charges (credits) in Other income (expense), net in our consolidated statements of income.\nSee Note 11 to the consolidated financial statements for additional information related to severance, pension and benefits charges (credits).\nAsset and Business Rationalization\nDuring 2024, we recorded a pre-tax asset and business rationalization charge of $374 million predominately related to the decision to cease use of certain real estate assets and exit non-strategic portions of certain businesses as part of our continued transformation initiatives. \nDuring 2023, we recorded pre-tax asset rationalization charges of $480 million. Asset rationalization charges of $155 million recorded during the second quarter of 2023 related to certain real estate and non-strategic assets that we made a decision to cease use of as part of our transformation initiatives. Asset rationalization charges of $325 million recorded during the fourth quarter of 2023 primarily related to Business network assets that we made a decision to cease use of as part of our continued transformation initiatives.\nLegacy Legal Matter\nDuring 2024, we recorded a pre-tax charge of $106 million associated with a litigation matter related to a legacy contract for the production of telephone directories in Costa Rica by a subsidiary of the Company.\nVerizon Business Group Goodwill Impairment\nDuring 2023, we recorded a pre-tax charge of $5.8 billion as a result of the annual goodwill impairment test performed in the fourth quarter. See \"Critical Accounting Estimates\" for additional information. \nLegal Settlement\nDuring 2023, we recorded a pre-tax charge of $100 million related to the settlement of a litigation matter regarding certain administrative fees.\nBusiness Transformation Costs\nDuring 2023, we recorded pre-tax charges of $176 million primarily related to costs incurred in connection with strategic partnership initiatives in our managed network support services for certain Business customers.\n37\nTable of \nContents\nNon-Strategic Business Shutdown\nDuring 2023, we recorded pre-tax charges of $179 million related to the shutdown of our BlueJeans business offering.\nOperating Environment and Trends\nThe telecommunications industry is highly competitive, and we expect competition to remain intense as traditional and non-traditional participants seek increased market share. We believe that our high-quality networks and customer base in addition to our attractive offerings and value proposition differentiate us from our competitors and give us the ability to plan and manage through changing market conditions. We remain focused on executing on the fundamentals of the business: enhancing our networks, offering innovative services and products, growing and maintaining a high-quality customer base, and delivering strong financial and operating results. We also continue to focus on cost efficiencies in order to have flexibility to adjust to changes in the competitive and economic environments and increase shareholder value.\nThe U.S. wireless market has achieved a high penetration of smartphones, which reduces the opportunity for new phone connection growth for the industry. We expect the wireless industry's customer growth rate to moderate over time in comparison to historical growth rates, furthering competition for customers. Future revenue growth in the industry is expected to be driven by expanding existing customer relationships, increasing the number of ways customers can connect with wireless networks and services and increasing the penetration of FWA and connected devices including wearables, tablets and IoT devices. Although certain advanced use cases for 5G technologies and related ecosystems are in the early phases of adoption, we believe that they will provide an opportunity for growth in the coming years.\nWe expect future service revenue growth opportunities to arise from increased access revenue as customer demand for mobile and FWA 5G connectivity continues to expand and customers shift to higher access plans. Additionally, we expect service revenue to benefit from targeted pricing actions and increased connections per account. Future service revenue growth opportunities will be dependent on expanding the penetration of our services, increasing the number of ways that our customers can connect with our networks and services and the development of new 5G use cases and ecosystems.\nPricing plays an increasingly important role in the wireless competitive landscape. As the demand for wireless services continues to grow, wireless service providers are offering a range of service plans and bundled services at competitive prices. In addition, aggressive device promotions have become more common in recent years in an effort to encourage customers to switch carriers, as well as retain existing customers. We compete in this area by offering our customers services and devices, with a variety of content options and other perks, that we believe provide significant value for the price. We and other wireless service providers, as well as equipment manufacturers, offer device payment options, which provide customers with the ability to pay for their device over a period of time, and some providers offer device leasing arrangements. \nFor further details on competitive environment and trends, refer to \"Business — Competition and Related Trends\" in Part I, Item 1 and \"Risk Factors — Economic and Strategic Risks — We face significant competition that may negatively affect our operating results\" in Part I, Item 1A of this Annual Report on Form 10-K.\nConnection Trends\nIn our Consumer segment, we are focused on attracting new customers and maintaining our high-quality retail postpaid customer base by capitalizing on demand for reliable high-speed connectivity and customizable, personalized offerings and solutions. We believe the combination of our wireless network quality and service and product offerings represents an attractive value proposition and provides a compelling customer experience, supporting increased penetration of data services. While our Consumer segment experienced diminished wireless connection growth in recent years, we expect that future connection growth opportunities will be driven by the comparative value we provide to our customers, as well as our FWA broadband service. In our prepaid business, while we expect to continue to operate in a highly competitive environment, we are making improvements to achieve long-term growth.\nWe expect to continue to grow our Fios internet connections as we seek to expand availability of Fios, increase our penetration rates within our Fios service areas, and experience continued strong demand for higher speed internet connections. Our pending acquisition of Frontier is expected to enhance our fiber broadband footprint and provide opportunities for future growth. At the same time, we expect continued growth of FWA connections to complement strong Fios results as demand for broadband services continues to grow. \nIn Fios video, the business continues to face ongoing pressure as observed throughout the linear television market. We have experienced continuing access line and DSL losses as customers have switched to alternative technologies such as wireless, VoIP, and cable for voice and data services, and we expect this trend to continue.\nIn our Business segment, we offer wireless products and services to business and public sector customers across the U.S. We continue to grow our connections while operating in a highly competitive environment. We expect that this connection growth, combined with our industry-leading network assets, will provide additional opportunities to sell solutions, such as those around security, private networking and other network connectivity services, advanced communications and professional services. \n38\nTable of \nContents\nIn addition, in both our Consumer and our Business segments, we expect to support connection growth in part by adding capacity and further expanding our wireless coverage, and by continuing the build-out and densification of our 5G network.\nService Revenue Trends\nIn our Consumer segment, we expect continued growth in our wireless service revenue, driven by targeted pricing actions, migrations to higher priced plans, increased offering of perks, and increases in FWA connections and revenue, offset in part by higher promotion amortization impacts in 2025. Our efforts to maintain and grow our customer base and make improvements to our prepaid business, if successful, are also expected to benefit our wireless service revenue. We expect Fios revenue to benefit from growth in our Fios customer base and an ongoing demand for higher speed internet connections, which offsets the impact of the shift from bundled wireline services to standalone internet service.\nIn our Business segment, we expect wireless service revenue to expand, driven by growth from an increase in wireless volumes and strong FWA revenue. We expect that Fios, through increased penetration, will also contribute to revenue growth and that legacy traditional wireline services will continue to face secular pressures.\nOther Trends\nWe are focused on achieving profitable growth as we continue to deliver strong revenues and undertake initiatives to reduce costs and improve efficiencies, including through AI-driven technologies. \nWe expect that our ability to generate cash flows will benefit from our expected service revenue growth, despite the moderate expected increase in our 2025 capital program compared to 2024. See \"Liquidity and Capital Resources\" for additional information on our capital program.\nIn the course of business, we make promotional equipment offers to attract and retain customers. In 2024, the growth of our wireless service revenue was unfavorably impacted by the amortization of wireless equipment sales and promotions. We expect these pressures to continue and increase in 2025. In addition, in 2023 and 2024, we had fewer phone upgrades compared to prior years. To the extent upgrade volumes increase in 2025, the expenses associated with those device sales are expected to contribute to higher costs.\nLiquidity and Capital Resources\nWe use the net cash generated from our operations to invest in new businesses and spectrum, fund expansion and modernization of our networks, pay dividends, service and repay external financing and, when appropriate, buy back shares of our outstanding common stock. Our sources of funds, primarily from operations and, to the extent necessary, from external financing arrangements, are sufficient to meet ongoing operating and investing requirements over the next 12 months and beyond. \nOur cash and cash equivalents balance is $4.2 billion as of December 31, 2024. Our cash and cash equivalents are held both domestically and internationally, and are invested to maintain principal and provide liquidity. See \"Quantitative and Qualitative Disclosures About Market Risk\" for additional information regarding our foreign currency risk management strategies.\nWe expect that our capital spending requirements will continue to be financed primarily through internally generated funds. Debt or equity financing may be needed to fund additional investments or development activities, including, for example, to complete our acquisition of Frontier, or to maintain an appropriate capital structure to ensure our financial flexibility. Our external financing arrangements include credit facilities and other bank lines of credit, an active commercial paper program, vendor financing arrangements, issuances of registered debt or equity securities, U.S. retail medium-term notes and other securities that are privately-placed or offered overseas. In addition, we monetize certain receivables through asset-backed debt transactions.\nCapital Expenditures\nOur 2025 capital program includes capital to fund advanced networks and services, including expanding and adding capacity and density to our core networks, the ongoing deployment of C-Band spectrum, and advancing our network architecture. It will also support our broadband expansion plans including the launch of our fixed wireless access solution for multi-dwelling units. We anticipate cash requirements for our 2025 capital program to be between $17.5 billion and $18.5 billion. \nContractual Obligations and Commitments\nWe have various contractual obligations and commitments. The following represent our anticipated material cash requirements from known contractual and other obligations as of December 31, 2024:\n•\nLong-term debt, including current maturities, commitments of $142.2 billion, of which $21.7 billion (including $3.3 billion of unsecured debt) are expected to be due within the next twelve months. Related interest payments are $66.3 billion, of which $5.8 billion, are expected to be due within the next twelve months. Items included in long-term debt with variable coupon rates exclude unamortized debt issuance costs, and are described in Note 7 to the consolidated financial statements.\n39\nTable of \nContents\n•\nOperating lease obligations of $29.1 billion and Finance lease obligations of $2.5 billion, of which $5.0 billion and $954 million, respectively, are expected to be due within the next twelve months. In addition, Verizon has an obligation of $3.7 billion representing future minimum payments under the leaseback and sublease arrangements for our cell towers, of which $447 million is expected to be due within the next twelve months. See Note 6 to the consolidated financial statements for additional information.\n•\nUnconditional purchase obligations, with terms in excess of one year, amount to $16.7 billion, of which $6.2 billion is expected to be due within the next twelve months. Items included in unconditional purchase obligations are primarily commitments to purchase content, network equipment, software and services, marketing services and other items which will be used or sold in the ordinary course of business. These amounts do not represent our entire anticipated purchases in the future, but represent only those items that are the subject of contractual obligations. We also purchase products and services as needed with no firm commitment. See Note 16 to the consolidated financial statements for additional information.\n•\nOther long-term liabilities, including current maturities, of $3.9 billion, of which approximately $726 million is expected to be due within the next twelve months. Other long-term liabilities represent estimated postretirement benefit and qualified pension plan contributions. Qualified pension plan contributions include estimated minimum funding contributions. We expect that there will be no required pension funding through the end of 2025, subject to changes in market conditions. Postretirement benefit payments include future postretirement benefit payments. These estimated amounts: (1) are subject to change based on changes to assumptions and future plan performance, which could impact the timing and/or amounts of these payments; and (2) exclude expectations beyond 5 years due to uncertainty of the timing and amounts. \n•\nWe are not able to make a reasonable estimate of when the unrecognized tax benefits balance of $2.6 billion and related interest and penalties will be settled with the respective taxing authorities until the related tax audits are further developed or resolved. \nConsolidated Financial Condition\n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nCash Flows Provided By (Used In)\nOperating activities\n$\n36,912\n \n$\n37,475 \nInvesting activities\n(18,674)\n(23,432)\nFinancing activities\n(17,100)\n(14,657)\nIncrease (decrease) in cash, cash equivalents and restricted cash\n$\n1,138\n \n$\n(614)\nCash Flows Provided By Operating Activities\nOur primary source of funds continues to be cash generated from operations. Net cash provided by operating activities decreased $563 million during 2024 compared to 2023 primarily due to changes in working capital, partially offset by an increase in earnings and an increase in Other, net cash flow from operating activities. \nChanges in current assets and liabilities, net of effects from acquisition/disposition of businesses\nThe change in working capital was primarily driven by higher cash income taxes paid in the current period as well as higher interest expense and severance payments primarily related to separations under our voluntary separation program.\nOther, Net\nOther, net cash flow from operating activities during 2024 includes $2.0 billion of proceeds related to the transaction with Vertical Bridge REIT, LLC (Vertical Bridge). These proceeds were partially offset by discretionary contributions made in March 2024 in the aggregate amount of $365 million to our qualified pension plans. We expect that there will be no required pension funding through the end of 2025, subject to changes in market conditions.\nCash Flows Used In Investing Activities\nCapital Expenditures\nCapital expenditures continue to relate primarily to the use of capital resources to enhance the operating efficiency and productivity of our networks, maintain our existing infrastructure, facilitate the introduction of new products and services and enhance responsiveness to competitive challenges.\nCapital expenditures, including capitalized software, were $17.1 billion and $18.8 billion for 2024 and 2023, respectively. Capital expenditures decreased approximately $1.7 billion during 2024, compared to 2023, primarily due to the completion of our accelerated $10 billion C-Band deployment program in 2023.\nAcquisitions of Wireless Licenses\nDuring 2024 and 2023, we made payments of $269 million and $4.3 billion, respectively, for obligations related to clearing costs and accelerated clearing incentives associated with Auction 107\n.\n40\nTable of \nContents\nDuring 2024 and 2023, we recorded capitalized interest related to wireless licenses of $616 million and $1.4 billion, respectively.\nCollateral Receipts (Payments) Related to Derivative Contracts, Net\nDuring 2024, we made collateral payments of $712 million related to derivative contracts, net of receipts. During 2023, we received return of collateral posted of $880 million related to derivative contracts, net of payments. See Note 9 to the consolidated financial statements for additional information.\nCash Flows Used In Financing Activities \nWe seek to maintain a mix of fixed and variable rate debt to lower borrowing costs within reasonable risk parameters and to protect against earnings and cash flow volatility resulting from changes in market conditions. During 2024 and 2023, net cash used in financing activities was $17.1 billion and $14.7 billion, respectively.\n2024\nDuring 2024, our net cash used in financing activities of $17.1 billion was primarily driven by $20.3 billion used for repayments and repurchases of long-term borrowings (secured and unsecured) as well as finance lease obligations, $11.2 billion used for dividend payments, and $1.1 billion used for other financing activities. These cash flows used in financing activities were partially offset by $15.6 billion provided by proceeds from long-term borrowings, which included $12.4 billion of proceeds from our asset-backed debt transactions.\nProceeds from and Repayments and Repurchases of Long-Term Borrowings\nAt December 31, 2024, our total debt decreased to $144.0 billion compared to $150.7 billion at December 31, 2023. Our effective interest rate was 5.1% and 4.9% during the years ended December 31, 2024 and 2023, respectively. We have entered into interest rate swaps to achieve a targeted mix of fixed and variable rate debt, managing our exposure to changes in interest rates. See \"Quantitative and Qualitative Disclosures About Market Risk\" and Note 7 to the consolidated financial statements for additional information.\nAt December 31, 2024, approximately $30.5 billion, or 20.6%, of the aggregate principal amount of our total debt portfolio consisted of foreign denominated debt, primarily Euro and British Pound Sterling. We have entered into cross currency swaps on our foreign denominated debt in order to fix our future interest and principal payments in U.S. dollars and mitigate the impact of foreign currency transaction gains or losses. See \"Quantitative and Qualitative Disclosures About Market Risk\" for additional information.\nVerizon may acquire debt securities issued by Verizon and its affiliates through open market purchases, redemptions, privately negotiated transactions, tender offers, exchange offers, or otherwise, upon such terms and at such prices as Verizon may from time to time determine, for cash or other consideration.\nOther, Net\nOther, net cash flow from financing activities during 2024 includes $830 million in proceeds related to financing obligations for the cell towers transaction with Vertical Bridge. These proceeds were partially offset by $431 million in payments related to vendor financing arrangements, $425 million in equity distribution payments made for controlled entities, $313 million in payments made under the sublease arrangement for our cell towers, $280 million in cash consideration payments to acquire additional interest in certain controlled entities and $243 million in payments for settlement of cross currency swaps. See Note 6 to the consolidated financial statements for additional information on the Vertical Bridge transaction. See Note 14 to the consolidated financial statements for additional information on noncontrolling interests. \nDividends\nThe Board of Directors of the Company assesses the level of our dividend payments on a periodic basis taking into account such factors as long-term growth opportunities, internal cash requirements and the expectations of our shareholders. During the third quarter of 2024, our Board of Directors increased our quarterly dividend payment by 1.9% to $0.6775 from $0.6650 per share in the preceding quarter. This is the eighteenth consecutive year that Company’s Board of Directors has approved a quarterly dividend increase.\nAs in prior periods, dividend payments were a significant use of capital resources. During 2024, we paid $11.2 billion in dividends.\n2023\nDuring 2023, our net cash used in financing activities of $14.7 billion was primarily driven by $11.0 billion used for dividend payments, $10.6 billion used for repayments and repurchases of long-term borrowings (secured and unsecured) as well as finance lease obligations and $1.5 billion used for other financing activities. These cash flows used in financing activities were \n41\nTable of \nContents\npartially offset by $8.6 billion provided by proceeds from long-term borrowings, which included $6.6 billion of proceeds from our asset-backed debt transactions.\nProceeds from and Repayments and Repurchases of Long-Term Borrowings\nAt December 31, 2023, our total debt was $150.7 billion. During the year ended December 31, 2023, our effective interest rate was 4.9%. We have entered into interest rate swaps to achieve a targeted mix of fixed and variable rate debt, managing our exposure to changes in interest rates. See \"Quantitative and Qualitative Disclosures About Market Risk\" and Note 7 to the consolidated financial statements for additional information.\nAt December 31, 2023, approximately $33.7 billion, or 21.7%, of the aggregate principal amount of our total debt portfolio consisted of foreign denominated debt, primarily Euro and British Pound Sterling. We have entered into cross currency swaps on our foreign denominated debt in order to fix our future interest and principal payments in U.S. dollars and mitigate the impact of foreign currency transaction gains or losses. See \"Quantitative and Qualitative Disclosures About Market Risk\" for additional information.\nOther, Net\nOther, net cash flow from financing activities during 2023 includes $302 million in payments made under the sublease arrangement for our cell towers, $257 million in payments for contingent consideration related to the acquisition of TracFone Wireless, Inc. (TracFone) and $252 million in payments related to vendor financing arrangements. See Note 3 to the consolidated financial statements for additional information on the TracFone contingent considerations.  \nDividends\nDuring the third quarter of 2023, our Board of Directors increased our quarterly dividend payment by 1.9% to $0.6650 per share. \nDuring 2023, we paid $11.0 billion in dividends.\nAsset-Backed Debt\nCash collections on the receivables and on the underlying receivables related to the participation interest collateralizing our asset-backed debt securities are required at certain specified times to be placed into segregated accounts. Deposits to the segregated accounts are considered restricted cash and are included in Prepaid expenses and other and Other assets in our consolidated balance sheets.  \nProceeds from our asset-backed debt transactions are reflected in Cash flows from financing activities in our consolidated statements of cash flows. The asset-backed debt issued is included in Debt maturing within one year and Long-term debt in our consolidated balance sheets. \nSee Note 7 to the consolidated financial statements for additional information. \n \nLong-Term Credit Facilities\nAt December 31, 2024\n(dollars in millions)\nMaturities\nFacility  Capacity\nUnused  Capacity\nPrincipal Amount  Outstanding \nVerizon revolving credit facility\n(1)\n2028\n$\n12,000\n \n$\n11,963\n \n$\n—\n \nVarious export credit facilities\n(2)\n2025 - 2031\n10,000\n \n—\n \n5,441\n \nTotal\n$\n22,000\n \n$\n11,963\n \n$\n5,441\n \n(1)\n \nThe revolving credit facility does not require us to comply with financial covenants or maintain specified credit ratings, and it permits us to borrow even if our business has incurred a material adverse change. The revolving credit facility provides for the issuance of letters of credit.\n As of December 31, 2024, there have been no drawings against the revolving credit facility since its inception.\n(2)\n During 2024, there were no drawings from these \nfacilities. During\n 2023, we drew down $1.0 billion from these facilities. Borrowings under certain of these facilities are amortized semi-annually in equal installments up to the applicable maturity dates. Maturities reflect maturity dates of principal amounts outstanding. Any amounts borrowed under these facilities and subsequently repaid cannot be reborrowed.\nIn March 2024, we amended our $9.5 billion revolving credit facility to increase the capacity to $12.0 billion and extended its maturity to 2028.\n42\nTable of \nContents\nCommon Stock\nCommon stock has been used from time to time to satisfy some of the funding requirements of employee and shareholder plans. During the years ended December 31, 2024 and 2023, we issued 5.4 million and 4.4 million shares of common stock from treasury stock, which had aggregate values of $238 million and $192 million, respectively. \nIn February 2020, the Board of Directors of the Company authorized a share buyback program to repurchase up to 100 million shares of our common stock. The program will terminate when the aggregate number of shares purchased reaches 100 million, or a new share repurchase plan superseding the current plan is authorized, whichever is sooner. The program permits Verizon to repurchase shares over time, with the amount and timing of repurchases depending on market conditions and corporate needs. There were no repurchases of common stock during 2024 and 2023 under our authorized share buyback program.\nCredit Ratings\nVerizon’s credit ratings did not change in 2024 or 2023.\nSecurities ratings assigned by rating organizations are expressions of opinion and are not recommendations to buy, sell or hold securities. A securities rating is subject to revision or withdrawal at any time by the assigning rating organization. Each rating should be evaluated independently of any other rating.\nCovenants\nOur credit agreements contain covenants that are typical for large, investment grade companies. These covenants include requirements to pay interest and principal in a timely fashion, pay taxes, maintain insurance with responsible and reputable insurance companies, preserve our corporate existence, keep appropriate books and records of financial transactions, maintain our properties, provide financial and other reports to our lenders, limit pledging and disposition of assets and mergers and consolidations, and other similar covenants.\nWe and our consolidated subsidiaries are in compliance with all of our restrictive covenants in our debt agreements.\nChange In Cash, Cash Equivalents and Restricted Cash\nOur Cash and cash equivalents at December 31, 2024 totaled $4.2 billion, a $2.1 billion increase compared to December 31, 2023, primarily as a result of the factors discussed above. \nRestricted cash at December 31, 2024 totaled $441 million, a $991 million decrease compared to restricted cash at December 31, 2023, primarily related to cash collections on certain receivables and on the underlying receivables related to the participation interest that are required at certain specified times to be placed into segregated accounts. The decrease of $991 million in restricted cash was primarily due to a change in the timing on when cash collections on certain receivables collateralizing our asset-backed debt securities are required to be placed into segregated accounts.\nFree Cash Flow\nFree cash flow is a non-GAAP financial measure that reflects an additional way of viewing our liquidity that, we believe, when viewed with our GAAP results, provides management, investors and other users of our financial information with a more complete understanding of factors and trends affecting our cash flows. Free cash flow is calculated by subtracting capital expenditures (including capitalized software) from net cash provided by operating activities. We believe it is a more conservative measure of cash flow since capital expenditures are necessary for ongoing operations. Free cash flow has limitations due to the fact that it does not represent the residual cash flow available for discretionary expenditures. For example, free cash flow does not incorporate payments made on finance lease obligations or cash payments for business acquisitions or wireless licenses. Therefore, we believe it is important to view free cash flow as a complement to our entire consolidated statements of cash flows.\nThe following table reconciles net cash provided by operating activities to free cash flow: \n \n(dollars in millions)\nYears Ended December 31,\n2024\n2023\nNet cash provided by operating activities\n$\n36,912\n \n$\n37,475 \nLess Capital expenditures (including capitalized software)\n17,090\n \n18,767 \nFree cash flow\n$\n19,822\n \n$\n18,708 \nThe increase in free cash flow during 2024 is a reflection of the decrease in capital expenditures, partially offset by the decrease in operating cash flows, both of which are discussed above.\n43\nTable of \nContents\nEmployee Benefit Plans Funded Status and Contributions\nEmployer Contributions\nWe operate numerous qualified and nonqualified pension plans and other postretirement benefit plans. These plans primarily relate to our domestic business units. During 2024, we made discretionary contributions in the aggregate amount of $365 million to our qualified pension plans. During 2023, we made a discretionary contribution of $200 million to one of our qualified pension plans. During 2024 and 2023, we made contributions of $56 million and $52 million to our nonqualified pension plans, respectively. \nOur overall investment strategy is to achieve a mix of assets that allows us to meet projected benefit payments while taking into consideration risk and return. In an effort to reduce the risk of our portfolio strategy and better align assets with liabilities, we have adopted a liability driven pension strategy that seeks to better match the interest rate sensitivity of the liability hedging assets with the interest rate sensitivity of the liability. We expect that the strategy will reduce the likelihood that assets will decline at a time when liabilities increase (referred to as liability hedging), with the goal to reduce the risk of underfunding to the plan and its participants and beneficiaries. Over time, as the asset allocation shifts to more liability hedging assets, this strategy will generally result in lower expected asset returns. For 2025, we expect no required qualified pension plan contributions and insignificant nonqualified pension plan contributions.\nContributions to our other postretirement benefit plans generally relate to payments for benefits on an as-incurred basis since these other postretirement benefit plans do not have funding requirements similar to the pension plans. We contributed $935 million and $936 million to our other postretirement benefit plans in 2024 and 2023, respectively. Contributions to our other postretirement benefit plans are estimated to be approximately $726 million in 2025.\nLeasing Arrangements\nSee Note 6 to the consolidated financial statements for additional information related to leasing arrangements.\nGuarantees\nWe guarantee the debentures of our operating telephone company subsidiaries. See Note 7 to the consolidated financial statements for additional information.\nIn connection with the execution of agreements for the sale of businesses and investments, Verizon ordinarily provides representations and warranties to the purchasers pertaining to a variety of nonfinancial matters, such as ownership of the securities being sold, as well as financial losses. See Note 16 to the consolidated financial statements for additional information.\nAs of December 31, 2024, letters of credit totaling approximately $816 million, which were executed in the normal course of business and support several financing arrangements and payment obligations to third parties, were outstanding. See Note 16 to the consolidated financial statements for additional information.\nOther Future Obligations\nAs of December 31, 2024, Verizon had 28 renewable energy purchase agreements with third parties for a total of approximately 3.7 gigawatts of anticipated renewable energy capacity across multiple states. See Note 16 to the consolidated financial statements for additional information.\nCritical Accounting Estimates\nCritical Accounting Estimates\nA summary of the critical accounting estimates used in preparing our financial statements are as follows:\nWireless Licenses and Goodwill\nWireless licenses and goodwill are a significant component of our consolidated assets. Both our wireless licenses and goodwill are treated as indefinite-lived intangible assets and, therefore are not amortized, but rather are tested for impairment annually in the fourth fiscal quarter, unless there are events requiring an earlier assessment or changes in circumstances during an interim period suggesting impairment indicators are present. We believe our estimates and assumptions are reasonable and represent appropriate marketplace considerations as of the valuation date. Although we use consistent methodologies in developing the assumptions and estimates underlying the fair value calculations used in our impairment tests, these estimates and assumptions are uncertain by nature, may change over time and can vary from actual results. It is possible that in the future there may be changes in our estimates and assumptions, including the timing and amount of future cash flows, margins, growth rates, market participant assumptions, comparable benchmark companies and related multiples and discount rates, which could result in different fair value estimates. Significant and adverse changes to any one or more of the above-noted estimates and assumptions could result in an impairment to our wireless licenses and goodwill impairment for one or more of our reporting units.\n44\nTable of \nContents\nWireless Licenses\nThe carrying value of our wireless licenses was approximately $156.6 billion as of December 31, 2024. We aggregate our wireless licenses into one single unit of accounting, as we utilize our wireless licenses on an integrated basis as part of our nationwide wireless network. Our wireless licenses provide us with the exclusive right to utilize certain radio frequency spectrum to provide wireless communication services. There are currently no legal, regulatory, contractual, competitive, economic or other factors that limit the useful life of our wireless licenses.\nWe test our wireless licenses for potential impairment annually or more frequently if impairment indicators are present. We have the option to first perform a qualitative assessment to determine whether it is necessary to perform a quantitative impairment test. However, we may elect to bypass the qualitative assessment in any period and proceed directly to performing the quantitative impairment test. It is our policy to perform quantitative impairment assessment at least every three years.\nOur quantitative impairment assessment consisted of comparing the estimated fair value of our aggregate wireless licenses to the aggregated carrying amount as of the test date. Under our quantitative assessment, we estimated the fair value of our wireless licenses using the Greenfield approach. The Greenfield approach is an income based valuation approach that values the wireless licenses by calculating the cash flow generating potential of a hypothetical start-up company that goes into business with no assets except the wireless licenses to be valued. A discounted cash flow analysis is used to estimate what a marketplace participant would be willing to pay to purchase the aggregated wireless licenses as of the valuation date. As a result, we were required to make significant estimates about future cash flows and profitability specifically associated with our wireless licenses, an appropriate discount rate based on the risk associated with those estimated cash flows and assumed terminal value and growth rates. We considered current and expected future economic conditions, current and expected availability of wireless network technology and infrastructure and related equipment and the costs thereof as well as other relevant factors in estimating future cash flows and profitability. The discount rate represented our estimate of the weighted-average cost of capital (WACC), or expected return, that a marketplace participant would have required as of the valuation date and includes a risk premium associated with the current and expected economic conditions as of the valuation date. We developed the discount rate based on our consideration of the cost of debt and equity of a group of guideline companies as of the valuation date. The terminal value growth rate represented our estimate of the marketplace's long-term growth rate.  \nDuring the fourth quarter of 2023, we performed a qualitative impairment assessment as our annual impairment test to determine whether it is more likely than not that the fair value of our wireless licenses was less than the carrying amount. As part of our qualitative assessment we considered several factors including the enterprise value of our combined wireless business, macroeconomic conditions (including changes in interest rates and discount rates), industry and market considerations (including industry revenue and EBITDA margin results, projections and recent merger and acquisition activity), the recent and projected financial performance of our combined wireless business as a whole, as well as other factors including the result of our last quantitative assessment performed in 2021. Our annual impairment test in 2023 indicated that it is more likely than not that the fair value of our wireless licenses remained above their carrying value and, therefore, did not result in an impairment.\nDuring the fourth quarter of 2024, we performed a quantitative impairment assessment in accordance with our policy. The quantitative impairment assessment we performed during the fourth quarter of 2024 indicated that the fair value of our wireless licenses is substantially in excess of their carrying value and, therefore, did not result in an impairment. In the event of a 10% decline in the fair value of our wireless licenses, the fair value would have still exceeded their carrying value. We do not believe reasonable changes in significant estimates would change the outcome to this quantitative assessment. For instance, if either the terminal value growth rate declined by 50 basis points (bps) or if the WACC increased by 50 bps, the fair value of wireless licenses would still exceed their carrying value. \nGoodwill \nAt both December 31, 2024 and 2023, the balance of our goodwill was approximately $22.8 billion, of which $21.2 billion was in our Consumer reporting unit and $1.7 billion was in our Business reporting unit. \nTo determine if goodwill is potentially impaired, we have the option to perform a qualitative assessment to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying value. If we elect not to conduct the qualitative assessment or if indications of a potential impairment exist, the determination of whether an impairment has occurred requires the fair value of each reporting unit to be assessed. It is our policy to perform quantitative impairment assessments at least every three years. \nUnder the qualitative assessment, we consider several factors, including the enterprise value of the reporting unit from the last quantitative test and the excess of fair value over carrying value from this test, macroeconomic conditions (including changes in interest rates and discount rates), industry and market considerations (including industry revenue and EBITDA margin results, projections and recent merger and acquisition activity), the recent and projected financial performance of the reporting unit, as well as other factors. \nUnder the quantitative assessment, the fair value of the reporting unit is calculated using an average of the market approach and a discounted cash flow method, as a form of the income approach. The market approach includes the use of comparative multiples to complement discounted cash flow results. The discounted cash flow method is based on the present value of two \n45\nTable of \nContents\ncomponents-projected cash flows and a terminal value. The terminal value represents the expected normalized future cash flows of the reporting unit beyond the cash flows from the discrete projection period. The fair value of the reporting unit using the income approach is calculated based on the sum of the present value of the cash flows from the discrete period and the present value of the terminal value. The discount rate represents our estimate of the WACC, or expected return, that a marketplace participant would have required as of the valuation date. The application of our goodwill impairment test requires key assumptions underlying our valuation model. The discounted cash flow analysis factors in assumptions on discount rates and terminal growth rates to reflect risk profiles of key strategic revenue and cost initiatives, as well as revenue and EBITDA growth relative to history and market trends and expectations. The market multiples approach reflects significant judgment involved in the selection of comparable public company multiples and benchmarks. The selection of companies and multiples is influenced by differences in growth and profitability, and volatility in market prices of peer companies. These valuation inputs are inherently judgmental, and an adverse change in one or a combination of these inputs could result in a goodwill impairment.\nDuring the fourth quarter of 2023, we performed a qualitative impairment assessment for our Consumer reporting unit. Our qualitative assessment indicated that it was more likely than not that the fair value of our Consumer reporting unit exceeded its carrying value and, therefore, did not result in an impairment. \nDuring the fourth quarter of 2024, we performed a quantitative impairment assessment for our Consumer reporting unit in accordance with our policy. We applied a combination of a market approach and a discounted cash flow method reflecting current assumptions and inputs, including our revised projections, discount rate and expected growth rates. Our assessment indicated that the fair value of our Consumer reporting unit substantially exceeded its carrying value and, therefore, did not result in an impairment. In the event of a 10% decline in the fair value of our Consumer reporting unit, the fair value of the Consumer reporting unit would have still exceeded its book value. We do not believe reasonable changes in significant assumptions would change the outcome to this quantitative assessment. For instance, if either the terminal value growth rate declined by 50 bps or if the discount rate increased by 50 bps, the fair value of our Consumer reporting unit would still exceed its carrying value.  \nDuring the fourth quarter of 2023, we performed a quantitative impairment assessment for our Business reporting unit given the low excess of fair value over carrying value identified in our 2022 annual impairment assessment and increased competitive and market pressures experienced throughout 2023. These pressures resulted in lower projected cash flows primarily driven by secular declines in wireline services and products across our Business customer groups. In connection with Verizon’s annual budget process in the fourth quarter of 2023, leadership completed a comprehensive five-year strategic planning review of our Business reporting unit resulting in declines in financial projections driven by market dynamics as compared to the prior year five-year strategic planning cycle. The revised projections were used as a key input into the Business reporting unit’s annual goodwill impairment test performed in the fourth quarter of 2023. In addition, changes in the macroeconomic environment, including interest rate and inflationary pressures also impacted the fair value of the reporting unit. We applied a combination of a market approach and a discounted cash flow method reflecting current assumptions and inputs, including our revised projections, discount rate and expected growth rates, which resulted in the determination that the fair value of our Business reporting unit was less than its carrying amount. As a result, in the fourth quarter of 2023, we recorded a noncash goodwill impairment charge of approximately $5.8 billion ($5.8 billion after-tax) in our consolidated statement of income. The goodwill balance of the Business reporting unit was approximately $7.5 billion prior to the occurrence of this impairment charge.\nDuring the fourth quarter of 2024, we performed a quantitative impairment assessment for our Business reporting unit given the impairment of the Business reporting unit's goodwill in the prior year. In addition, the Business reporting unit has continued to experience competitive and market pressures throughout 2024, that may persist over the near term. We applied a combination of a market approach and a discounted cash flow method reflecting current assumptions and inputs, including our revised projections, discount rate and expected growth rates, which indicated that the fair value of our Business reporting unit exceeded its carrying value and, therefore, did not result in an impairment. At the goodwill impairment measurement date of October 31, 2024, our Business reporting unit had a fair value that exceeded its carrying amount by approximately 8% and remains susceptible to future impairment risk. We do not anticipate reasonable changes in significant assumptions to change the outcome of the quantitative impairment assessment. For instance, if either the terminal value growth rate declined by 50 bps, or if the discount rate increased by 50 bps, or if the EBITDA margin decreased by 100 basis points, the fair value of our Business reporting unit would still exceed its carrying value. However, management believes there is a continued risk that our Business reporting unit may be required to recognize an impairment charge in the future. As of December 31, 2024, $1.7 billion \nof \ngoodwill was allocated to our Business reporting unit. See Note 4 to the consolidated financial statements for additional information.   \nA projected sustained decline in the reporting unit's revenues and earnings could have a significant negative impact on its fair value and could result in future impairment charges. Such a decline could be driven by, among other things: (1) decreases in sales volumes or long-term growth rate as a result of competitive pressures or other factors; or (2) the reporting unit's inability to achieve or delays in achieving its goals or strategic initiatives. Adverse changes to macroeconomic factors, such as increases in long-term interest rates, would also negatively impact the fair value of the reporting unit.\nPension and Other Postretirement Benefit Plans \nWe maintain benefit plans for most of our employees, including, for certain employees, pension and other postretirement benefit plans. Benefit plan assumptions, including the discount rate used, the long-term rate of return on plan assets, the determination of the substantive plan and health care trend rates are periodically updated and impact the amount of benefit plan income, \n46\nTable of \nContents\nexpense, assets and obligations. Changes to one or more of these assumptions could significantly impact our accounting for pension and other postretirement benefits. \nIn determining pension and other postretirement obligations, the weighted-average discount rate was selected to approximate the composite interest rates available on a selection of high-quality bonds available in the market at December 31, 2024. The bonds selected had maturities that coincided with the time periods during which benefit payments are expected to occur, were non-callable (or callable with certain selection criteria met) and available in sufficient quantities to ensure marketability (at least $300 million par outstanding). Bond yields are subject to uncertainty for a number of reasons including corporate performance, credit rating downgrades and upgrades, government fiscal policy decisions, and general market volatility. The expected long-term rates of return on plan assets used in determining Verizon’s pension and other postretirement obligations are based on expectations for future investment returns for the plans’ asset allocation. The rates are subject to uncertainty for a number of reasons including corporate performance, credit ratings, monetary policy, inflation, exchange rates, investor behavior and general market volatility.\nA sensitivity analysis of the impact of changes in the discount rate and the long-term rate of return on plan assets on the benefit obligations and expense (income) recorded, as well as an increase or a decrease in the actual versus expected return on plan assets as of December 31, 2024 and for the year then ended pertaining to Verizon’s pension and postretirement benefit plans, is provided in the table below. The amounts in the table below related to discount rate changes are gross impacts on benefit obligations and expense, and do not reflect changes in asset values as a result of interest rate changes, for which our pension plan is highly hedged.\n(dollars in millions)\nPercentage point\nchange\nIncrease/(Decrease) at December 31, 2024\nPension plans discount rate\n+0.50\n$\n(410)\n-0.50\n451 \nRate of return on pension plan assets\n+1.00\n(78)\n-1.00\n78 \nPostretirement plans discount rate\n+0.50\n(450)\n-0.50\n486 \nRate of return on postretirement plan assets\n+1.00\n(4)\n-1.00\n4 \nIn addition to our liability hedging assets, we also employ an interest rate hedging strategy to further minimize the impact of discount rate changes on the funded ratio of the pension plan. While the target hedge ratio varies depending on the funded status of the plan and the level of interest rates, the target hedge ratio was 60% at December 31, 2024, limiting volatility. \nThe annual measurement date for both our pension and other postretirement benefits is December 31. We use the full yield curve approach to estimate the interest cost component of net periodic benefit cost for pension and other postretirement benefits. The full yield curve approach refines our estimate of interest cost by applying the individual spot rates from a yield curve composed of the rates of return on several hundred high-quality fixed income corporate bonds available at the measurement date. These individual spot rates align with the timing of each future cash outflow for benefit payments and therefore provide a more precise estimate of interest cost.\nSee Note 11 to the consolidated financial statements for additional information.\nIncome Taxes \nOur current and deferred income taxes and associated valuation allowances are impacted by events and transactions arising in the normal course of business as well as in connection with the adoption of new accounting standards, changes in tax laws and rates, acquisitions and dispositions of businesses and non-recurring items. As a global commercial enterprise, our income tax rate and the classification of income taxes can be affected by many factors, including estimates of the timing and realization of deferred income tax assets and the timing and amount of income tax payments. We account for tax benefits taken or expected to be taken in our tax returns in accordance with the accounting standard relating to the uncertainty in income taxes, which requires the use of a two-step approach for recognizing and measuring tax benefits taken or expected to be taken in a tax return. We review and adjust our liability for unrecognized tax benefits based on our best judgment given the facts, circumstances and information available at each reporting date. To the extent that the final outcome of these tax positions is different than the amounts recorded, such differences may impact income tax expense and actual tax payments. We recognize any interest and penalties accrued related to unrecognized tax benefits in income tax expense. Actual tax payments may materially differ from estimated liabilities as a result of changes in tax laws as well as unanticipated transactions impacting related income tax balances. See Note 12 to the consolidated financial statements for additional information.\nProperty, Plant and Equipment \nOur Property, plant and equipment balance represents a significant component of our consolidated assets. We record property, plant and equipment at cost. We depreciate property, plant and equipment on a straight-line basis over the estimated useful life of the assets. The estimated useful life is subject to change due to a variety of factors such as change in asset capacity or \n47\nTable of \nContents\nperformance, technical obsolescence, market expectations and competitive impacts. In connection with our ongoing review of the estimated useful lives of property, plant and equipment during 2024, we determined that the estimated useful life of our property, plant and equipment would remain unchanged. We expect that a one year increase in estimated useful lives of our property, plant and equipment would result in a decrease to our 2024 depreciation expense of $2.4 billion and that a one year decrease would result in an increase of approximately $3.6 billion in our 2024 depreciation expense.\nAccounts Receivable \nAccounts receivable are recorded at amortized cost less an allowance for credit losses that are not expected to be recovered. The gross amount of accounts receivable and corresponding allowance for credit losses are presented separately in the consolidated balance sheets. We maintain allowances for credit losses resulting from the expected failure or inability of our customers to make required payments. We recognize the allowance for credit losses at inception and reassess quarterly based on management’s expectation of the asset’s collectability. The allowance is based on multiple factors including historical experience with bad debts, the credit quality of the customer base, the aging of such receivables and current macroeconomic conditions, as well as management’s expectations of conditions in the future, as applicable. \nThe impact of these factors on the allowance involves significant level of estimation and is subject to uncertainty.\n Our allowance for credit losses is based on management’s assessment of the collectability of assets pooled together with similar risk characteristics.\nWe record an allowance to reduce the receivables to the amount that is expected to be collectible. For device payment plan agreement receivables, we record bad debt expense based on a default and loss calculation using our proprietary loss model. The expected loss rate is determined based on customer credit scores and other qualitative factors as noted above. The loss rate is assigned individually on a customer by customer basis and the custom credit scores are then aggregated by vintage and used in our proprietary loss model to calculate the weighted-average loss rate used for determining the allowance balance. The weighted-average expected loss r\nate increased 0.75% \nat December 31, 2024 as compared to the rate at December 31, 2023. We expect that an increase or decrease of 0.25% in the weighted-average loss rate would result in a chan\nge of $160 million in \nbad debt expense.\nWe monitor the collectability of our wireless service receivables as one overall pool. Wireline service receivables are disaggregated and pooled by the following types of customers and related contracts: consumer, small and medium business, enterprise, public sector and wholesale. For wireless service receivables and wireline consumer and small and medium business receivables, the allowance is calculated based on a 12 month rolling average write-off balance multiplied by the average life-cycle of an account from billing to write-off. The risk of loss is assessed over the contractual life of the receivables and is adjusted based on the historical loss amounts for current and future conditions based on management’s qualitative considerations. For enterprise, public sector and wholesale wireline receivables, the allowance for credit losses is based on historical write-off experience and individual customer credit risk, if applicable. We consider multiple factors in determining the allowance as discussed above.\nIf there is a deterioration of our customers’ financial condition or if future actual default rates on receivables in general differ from those currently anticipated, we may have to adjust our allowance for credit losses, which would affect earnings in the period the adjustments are made. See Note 8 to the consolidated financial statements for additional information.\nAcquisitions and Divestitures\nSpectrum License Transactions\nFrom time to time we enter into agreements to buy, sell or exchange spectrum licenses. We believe these spectrum license transactions have allowed us to continue to enhance the reliability of our wireless network while also resulting in a more efficient use of spectrum.\nIn February 2021, the Federal Communications Commission (FCC) concluded Auction 107 for C-Band wireless spectrum. In accordance with the rules applicable to the auction, Verizon is required to make payments for our allocable share of clearing costs incurred by, and incentive payments due to, the incumbent license holders associated with the auction, which are estimated to be $7.5 billion. During 2024, 2023 and 2022, we made payments of $269 million, $4.3 billion and $1.6 billion, respectively, for obligations related to clearing costs and accelerated clearing incentives. The carrying value of the wireless spectrum won in Auction 107 consists of all payments required to participate and purchase licenses in the auction, including Verizon’s allocable share of clearing costs incurred by, and incentive payments due to, the incumbent license holders associated with the auction that we are obligated to pay in order to acquire the licenses, as well as capitalized interest to the extent qualifying activities have occurred.\nIn March 2022, Verizon signed agreements with satellite operators in which operators agreed to clear C-Band spectrum in certain markets and frequencies ahead of the previously expected timeframe. During 2022, Verizon incurred costs associated with these agreements of approximately $340 million, of which $310 million was paid as of December 31, 2022 and the remainder was paid in 2023. This early clearance accelerated Verizon's access to more spectrum in a number of key markets to support its 5G network initiatives.\n48\nTable of \nContents\nOn October 17, 2024, Verizon entered into a license purchase agreement to acquire select spectrum licenses of United States Cellular Corporation and certain of its subsidiaries (UScellular) for total consideration of $1.0 billion, subject to certain potential adjustments. The closing of this transaction is subject to the receipt of regulatory approvals and other closing conditions, including the consummation of UScellular's proposed sale of its wireless operations and select spectrum assets to T-Mobile US, Inc., and the termination of certain post-closing arrangements with respect to that sale.\nSee Note 3 to the consolidated financial statements for additional information regarding our spectrum license transactions.\nTracFone Wireless, Inc.\nOn November 23, 2021 (the Acquisition Date), we completed the acquisition of TracFone. Verizon acquired all of TracFone's outstanding stock in exchange for approximately $3.5 billion in cash, net of cash acquired and working capital and other adjustments, 57,596,544 shares of common stock of the Company valued at approximately $3.0 billion, and up to an additional $650 million in future cash contingent consideration related to the achievement of certain performance measures and other commercial arrangements. The fair value of the common stock was determined on the basis of its closing market price on the Acquisition Date. The estimated fair value of the contingent consideration as of the Acquisition Date was approximately $560 million and represented a Level 3 measurement. The contingent consideration payable was based on the achievement of certain revenue and operational targets, measured over a two year earn out period. Contingent consideration payments were completed in January of 2024.\nDuring 2024 and 2023, Verizon made payments of $52 million and $257 million, respectively, related to the contingent consideration, which are reflected in Cash flows from financing activities in our consolidated statements of cash flows. See Note 3 and Note 9 to the consolidated financial statements for additional information. \nFrontier Communications Parent, Inc.\nOn September 4, 2024, Verizon entered into an Agreement and Plan of Merger (the Merger Agreement) to acquire Frontier, a U.S. provider of broadband internet and other communication services. The transaction is structured as a merger of the Company's subsidiary with and into Frontier, as a result of which Frontier will become a wholly owned subsidiary of the Company and shares of Frontier common stock outstanding immediately prior to the effective time of merger (subject to certain limited exceptions) will be cancelled and converted into the right to receive a per share merger consideration of $38.50, in cash. In November 2024, Frontier shareholders approved the transaction. Consummation of the transaction is subject to the receipt of certain regulatory approvals and other customary closing conditions. Under certain circumstances, if the Merger Agreement is terminated, Frontier may be required to pay Verizon a termination fee of $320 million. Under certain other specified circumstances, Verizon may be required to pay Frontier a termination fee of $590 million.",
  "item2": null
}