{
  "source_file": "wab-20241231.htm",
  "form_type": "10-K",
  "item1": "Item  1.\nBUSINESS\nGeneral\nWestinghouse Air Brake Technologies Corporation, doing business as Wabtec Corporation, is a Delaware corporation with headquarters at 30 Isabella Street in Pittsburgh, Pennsylvania. Our telephone number is 412-825-1000, and our website is located at \nwww.wabteccorp.com\n. Except as the context otherwise requires, all references to “we”, “our”, “us”, the “Company” and “Wabtec” refer to Westinghouse Air Brake Technologies Corporation and its consolidated subsidiaries. George Westinghouse founded the original Westinghouse Air Brake Co. in 1869 when he invented the air brake. Westinghouse Air Brake Company (“WABCO”) was formed in 1990 when it acquired certain assets and operations from American Standard, Inc., now known as Trane (“Trane”). The Company went public on the New York Stock Exchange in 1995. \nThroughout the years, the Company has made a number of strategic acquisitions leading the Company to where it is today. These have primarily included:\n•\nthe 1999 merger with MotivePower Industries, Inc. whereby the Company adopted its current name of Westinghouse Air Brake Technologies Corporation, or Wabtec; \n•\nthe 2017 acquisition of Faiveley Transport, S.A. (“Faiveley Transport”), a leading provider of value-added, integrated systems and services, primarily for the global transit rail market. Based in France, the Faiveley Transport business has roots to 1919 and made Wabtec a leader in manufacturing pantographs, automatic door mechanisms, air conditioning systems, railway braking systems and couplers; and,\n•\nthe 2019 acquisition of GE Transportation, a business unit of General Electric Company. This brought a global technology leader and supplier of locomotives, equipment, services and digital solutions to the rail, mining, marine, stationary power and drilling industries into Wabtec.\nAs a result of those strategic acquisitions, as well as other smaller acquisitions and organic growth, Wabtec is a global provider of value-added, technology-based locomotives, equipment, systems and services for the freight rail and passenger transit industries, and the mining, marine, and industrial markets. Wabtec has approximately 29,500 employees, excluding contingent workers, and operations in over 50 countries. Our highly engineered products, which are intended to enhance safety, improve productivity and reduce maintenance costs for customers, can be found on most locomotives, freight cars, passenger transit cars and buses around the world.\nIndustry Overview\nThe Company primarily serves the global freight rail and passenger transit industries. As such, our operating results are largely dependent on the level of activity, financial condition and capital spending plans of freight railroads and passenger transit agencies around the world, and transportation equipment manufacturers who serve those markets. Many factors influence these industries, including general economic conditions; traffic volumes, as measured by freight carloads and passenger ridership; government spending on public transportation; and investment in new technologies. In general, trends such as urbanization and growth in developing markets, sustainability and environmental awareness, investment in technology solutions, an aging equipment fleet, and growth in global trade are expected to drive continued investment in freight rail and passenger transit.\nThe Association of the European Rail Industry, UNIFE, advocates for and represents European train builders and rail suppliers. UNIFE publishes a biennial market study that provides an overview of the market in its current form and a forecast of its future development in different regions and market segments. The 2024 biennial edition of the study concluded that the global rail market grew 2.7% in the 2021 to 2023 period as the industry started recovering from the negative impacts of the COVID-19 pandemic and forecasts the industry to continue with a compound annual growth rate of 3% through 2027. \nAs growth continues, Wabtec expects to have additional opportunities to provide products and services in these markets. New technologies offered by Wabtec can provide solutions to improve safety, cost and reliability of rail, as well as support the modernization of the global rail fleets. Consistent with the UNIFE study, increased investment in infrastructure improvements, digitalization and automation is expected, all of which would improve efficiency in the global rail industry. \nBusiness Segments and Products\nWe provide our products and services through two principal business segments, the Freight Segment and the Transit Segment, both of which have different market characteristics and business drivers. The Freight Segment primarily manufactures new and modernized locomotives; provides aftermarket parts and services to existing locomotives; provides components to new and existing freight cars; builds new commuter locomotives; supplies rail control and infrastructure products including electronics, positive train control equipment, signal design and engineering services; provides a comprehensive suite of \n3\nsoftware-enabled solutions designed to improve customer safety, efficiency and productivity in the transportation and mining industries; overhauls locomotives; and provides heat exchangers and cooling systems for rail and other industrial markets. Customers include large, publicly traded railroads, leasing companies, manufacturers of original equipment such as locomotives and freight cars, utilities, and companies in the mining, marine, and industrial markets. We are a global manufacturer of diesel-electric locomotives for freight railroads producing essential products and solutions that help railroads reduce operating costs, decrease fuel use, minimize downtime and comply with emissions standards. As a result of the large base of nearly 24,000 locomotives, Wabtec's Services product line of modernizing, rebuilding and overhauling, remanufacturing, maintaining, and exchanging locomotives and components in the aftermarkets provides a significant, recurring revenue stream. In 2024, the Freight Segment accounted for approximately 72% of Wabtec’s total net sales, with approximately 59% of its net sales in the U.S. and approximately 61% of the Freight Segment’s net sales were in the aftermarket.\nThe Transit Segment primarily manufactures and services components for new and existing passenger transit vehicles, typically regional trains, high speed trains, subway cars, light-rail vehicles and buses; and supplies rail control and infrastructure products including electronics, signal design and engineering services. Customers include public transit authorities and municipalities, leasing companies, manufacturers of passenger transit vehicles and buses, and companies in the electrical generation, distribution, and charging industries. In 2024, the Transit Segment accounted for approximately 28% of our total net sales, with approximately 18% of its net sales in the U.S. The Transit Segment maintains a large installed base of original equipment globally which allows for a significant recurring revenue stream in the aftermarket. Approximately 55% of the Transit Segment’s net sales are in the aftermarket. \nThe following is a summary of our primary products and services in both aftermarket and original equipment across both of our business segments:\nEquipment:\n•\nDiesel-electric and liquid natural gas powered locomotives for freight and transit \n•\nEngines, electric motors and premium propulsion systems used in locomotives, mining, marine, stationary power and drilling applications\n•\nMarine and mining products\nDigital Intelligence Products:\n•\nPositive Train Control (\"PTC\") equipment and electronically controlled pneumatic braking products\n•\nRailway electronics, including event recorders, monitoring equipment and end of train devices\n•\nSignal design and engineering services\n•\nTrain performance such as distributed locomotive power, train 'cruise control', and train remote control\n•\nTransport intelligence such as Industrial/mobile Internet of Things (IoT) hardware & software, edge-to-cloud, on and off-board analytics & rules, and asset performance management\n•\nTransport logistics such as rail and shipper transportation management and port visibility and optimization \n•\nNetwork optimization such as rail network scheduling, dispatch and optimization, intermodal, terminal management and optimization, and rail yard management and optimization\nComponents:\n•\nFreight car trucks and braking equipment and related components for freight applications\n•\nAir compressors, dryers and HVAC systems\n•\nHeat transfer components and systems for diesel and gas engine cooling, generator and transformer coolers and high temperature applications\n•\nCustom engineered burners and combustion systems\n•\nRailgear, signaling and switch products\n•\nTurbochargers for industrial and aftermarket vehicle applications\nServices:\n•\nFreight locomotive overhauls, modernizations and refurbishment\n•\nMaster service agreements for locomotive and car maintenance\n•\nTransit locomotive and car overhaul\n•\nUnit exchange of locomotive components\n•\nLong term parts arrangements\n•\nMaintenance of way equipment and services\nTransit Products:\n•\nRailway and freight braking equipment and related components, including high-speed passenger transit vehicles\n•\nFriction products, including brake shoes, discs and pads\n4\n•\nHeating, ventilation and air conditioning equipment\n•\nAccess doors and platform screen doors\n•\nPantographs \n•\nAuxiliary power converter and battery charging\n•\nPassenger information systems and closed-circuit television\n•\nSignaling and railway electric relays\n•\nDoors, window assemblies, accessibility lifts, ramps and electric charging solutions for buses\nWabtec is utilizing a flexible and growing portfolio of freight rail and passenger transit products and innovative technologies to support customers’ sustainability goals and targets. From pioneering advancements to current signaling systems and network efficiency solutions, we are striving to increase the rail capacity to move more freight by train. Wabtec is working to reduce existing locomotive fleet emissions through fuel-efficiency solutions and testing renewable diesel and biofuels. We are also conducting collaborative research and development efforts with the National Laboratories to support the use of hydrogen to lower emissions across the rail industry. In 2024, Canadian National Railway Company, Norfolk Southern and Union Pacific Railroad each recognized Wabtec’s leadership in sustainability, energy efficiency, innovation, and environmental stewardship with partnership awards. This was Wabtec’s second year in a row receiving the Thoroughbred Sustainability Partner Award from Norfolk Southern. Wabtec also is implementing energy-reducing technologies for the passenger transit sector. In 2022, Wabtec received sustainability awards from both the German Ministry of Transportation and Deutsche Bahn and for our Green Air heating, ventilation, and air conditioning (HVAC) solution.\nIn recent years, we have also introduced a number of significant new products, including PTC equipment that encompasses onboard digital data and global positioning communication protocols. We are making additional investments in this technology which we believe will provide customers with opportunities to improve safety and efficiency, in part through data analytics solutions. During 2023, Wabtec also expanded the Digital Intelligence portfolio with entry into the railcar telematics market. \nFor additional information on our business segments, see Note 19 of “Notes to Consolidated Financial Statements” included in Part II, Item 8 of this report.\nCompetitive Strengths\nThrough both organic growth and strategic acquisitions, Wabtec has developed the following competitive strengths:\n•\nIconic legacy and strong reputation with a history of over 150 years of innovation\n.\n Wabtec has been transforming the rail landscape through various innovations and technologies for over 150 years. We have a long history of advancing technologies to meet customer needs and have been recognized for the development and production of locomotives, equipment, including PTC equipment, and systems for the freight rail and passenger transit industries. We are also a service provider for freight rail and passenger transit vehicles. \n•\nBreadth of product offering with a stable mix of original equipment market (OEM) and aftermarket business\n. Our comprehensive product portfolio and service offerings span the freight rail and passenger transit industries, as well as the bus, mining, marine, and industrial markets, which help Wabtec balance the cyclical nature of the global rail business. We provide our products in both the original equipment market and the aftermarket. Our substantial installed base of products with end-users, such as the railroads and the passenger transit authorities, is a significant competitive advantage for providing products and services to the aftermarket because these customers often look to purchase safety- and performance-related replacement parts and technology upgrades from the original equipment components supplier. Wabtec has an installed base of nearly 24,000 locomotives, as well as a diverse offering of Transit locomotives and cars both internationally and domestically. Our significant installed base enables opportunities in the aftermarket parts and services business.\n•\nLeading design and engineering capabilities.\n We believe a hallmark of our relationship with our customers has been our leading design and engineering practice, which has assisted in the improvement and modernization of global railway equipment. Wabtec's engineers and technical capabilities support continued focus on innovative product development and efforts to achieve scalable technologies. We believe both our customers and government authorities value our technological capabilities and commitment to innovation, as we seek not only to enhance the efficiency and profitability of our customers, but also to improve the overall safety of the railways through continuous improvement of product performance. To that end, we have assembled a wide range of patented products, which we believe provides us with a competitive advantage that enhances our customers' safety, productivity, reliability and capacity. \n•\nDriving fuel efficiency for the rail industry. \nWe have taken significant steps to drive fuel efficiency in global transport and make our world safer, smarter and greener. Wabtec is advancing our sustainability priorities both through our own commitments to our people, communities, and planet, as well as by innovating next generation technologies that reduce \n5\nemissions, energy consumption and waste, and increase fuel efficiency for our customers through advancements in our equipment and digital solutions. \n•\nDriving the digital transformation of the rail industry.\n Our early investment in data analytics and software has allowed us to become a strategic partner for customers looking to derive new value from existing assets, digitally transform their operations and enhance their network optimization. Through these initiatives, our digital solutions have helped to transform many distribution channels in the transportation industry including mine to ports, from shipper to receiver, from port to intermodal terminals to main line locomotives and railcars and across train yards and operation centers. The breadth of our Digital Intelligence solutions gives customers confidence in our ability to address their current and future needs with the latest digital technologies.\n•\nStrategic partnerships with longstanding customers and other key stakeholders.\n We listen to our key stakeholders and focus on areas where Wabtec can enable the most meaningful impact for our customers, communities, and the world. Transformational change requires collaboration, so we are committed to accelerating progress by partnering with customers, government leaders, corporations, universities, and other key stakeholders. For example, we have partnered with a customer, as well as an artificial intelligence and robotics institution to create technologies that will further decarbonize freight rail transport, improve freight safety, and generate greater rail network utilization. By working together with these partners and others, we are developing advanced solutions for the industry to realize the zero-emission rail network of the future.  \n•\nExperience with industry regulatory requirements. \nThe freight rail and passenger transit industries are governed by various government agencies and regulators in each country and region. These groups mandate rigorous manufacturer certification and a new product testing and approval processes that we believe are difficult for new entrants to meet cost-effectively and efficiently without the scale and extensive experience we possess.\n•\nStreamlined cost structure and operational excellence provide operating leverage and support Wabtec’s growth.\n We focus on driving continuous operational improvement across the organization by sharing best practices, instilling a culture of learning, problem solving and constant improvement, and driving standard operating practices. Wabtec is also focused on earnings growth through expanding high-margin recurring revenue streams. Additionally, Wabtec is a provider of technology-enabled locomotives and equipment, freight car components, systems, and services for the freight rail and passenger transit industries. The size of Wabtec's operations enables the Company to achieve economies of scale, in addition to using best-cost locations for executing on operational decisions. Completed strategic acquisitions and integrations have also led to operating synergies across Wabtec. \nBusiness Strategy\nWe strive to generate sufficient cash to invest in our growth strategies while maintaining world-class product value, technology and customer responsiveness. We continuously strive to improve quality, delivery and productivity, and to reduce costs utilizing global sourcing and supply chain management. These practices enable us to streamline processes, improve product reliability and customer satisfaction, reduce product cycle times and respond more rapidly to market developments. We also rely on functional experts within the Company across various disciplines to train, coach and share best practices throughout the Company, while benchmarking against best-in-class competitors and peers. Over time, we intend to continue to increase operating margins, improve cash flow and strengthen our ability to invest in the following growth strategies:\n•\nAccelerate innovation of scalable technologies\n.\n We continue to emphasize innovation and development funding to create new products and capabilities to increase customer productivity, efficiency, capacity, utilization and safety, such as the hydrogen powered locomotive, vehicle monitoring and data analytics. We plan to invest in bringing new technologies to market for our customers. A significant portion of our investment is expected to be focused on three customer-centric areas of innovation: advanced supply chain visibility, automation and digitization and zero-emissions operations. These investments will position our customers for success and make these technologies the standard going forward. We have a multi-year initiative to build on our existing expertise and technologies in the Digital Intelligence space. In addition, we invest in developing enhancements and new features to existing products, such as brake discs and heat exchangers. We are focusing on technological advances, especially in the areas of electronics and alternative fuels, including hydrogen technologies, braking products and other on-board equipment, as a means to deliver new product growth. We seek to provide customers with incremental technological advances that offer immediate benefits with cost-effective investments.\n•\nGrow and refresh expansive installed base. \nWe are a transportation and component manufacturer with a significant installed base with expansive product and service capabilities. We have nearly 24,000 locomotives in service, the majority of which are equipped with Digital Intelligence technologies, like Positive Train Control. We intend to increase sales through direct sales of existing products to current and new customers, by developing specific new products for application in new geographic markets, by making strategic acquisitions and through joint ventures with railway suppliers which have a strong presence in their local markets. We believe that international markets represent a \n6\nsignificant opportunity for future growth. In Transit, we are focused on mature markets such as Europe and emerging markets such as India. In Freight, we are targeting markets that operate significant fleets of locomotives and freight cars, including Australia, Brazil, Egypt, India, South Africa, Kazakhstan, and other select areas within Europe, Asia and South America. In addition, we have opportunities to increase the sale of certain products that we currently manufacture for the rail industry into other industrial markets, such as mining, off-highway and energy. \n•\nDrive fuel efficiencies through emerging technologies.\n Today, rail represents the cleanest, most energy efficient and safest mode of moving freight and people on land.\n \nAs global demands for growth increase, current trends suggest that freight and passenger rail activity will more than double by 2050, leading to an increased demand for sustainable transportation of people and goods. These converging forces highlight the critical interplay between market dynamics, the need for increased fuel efficiency and Wabtec’s business strategy. Wabtec is helping customers transition to a more utilized, efficient, and low-carbon rail network. Alternative clean energy technologies are critical in the fight against climate change and reducing greenhouse gas emissions. We are helping our customers reduce their overall cost of operations through the development of low-emitting locomotives like our Tier 4 locomotives, Trip Optimizer, Green Air and Green Friction products, and the use of alternative fuels such as biodiesel, renewable diesel, and hydrogen.\n•\nExpand high-margin recurring revenue streams.\n Our expansive installed base allows us to generate strong recurring revenues with replacement parts and components, digital solutions, overhauls and modernizations. Aftermarket sales are typically done at higher margins and are less cyclical than OEM sales because a certain level of aftermarket maintenance and service work must be performed, even during an industry slowdown. Sales of aftermarket parts and services represent approximately 60% of total net sales. As a long-time supplier of original equipment, we have an extensive installed base of equipment in operation and growing this installed base further will expand our recurring aftermarket sales. Wabtec provides aftermarket parts and services for its components, and we seek to expand this business with customers who currently perform the work in-house. In this way, we expect to benefit as transit authorities and railroads outsource certain maintenance and overhaul functions.\n•\nDrive continuous operational improvement\n.\n We are focused on continuous improvement to drive cost competitiveness, effectively deploy capital and accelerate Lean. Lean is a set of principles that emphasize customer focus, elimination of waste, high quality growth and relentless prioritization of work to improve safety, quality, delivery and cost. Lean is being embedded in our culture and is fundamental to how we execute our strategy. We are using Lean principles to help examine processes and continuously improve them by solving problems at their root cause. Our Lean transformation model focuses on driving process improvements and management systems to maximize the flow of value produced for the customer, remove waste, empower employees and optimize the enterprise. These principles are also rigorously applied to sustainability and safety.\nRecent Acquisitions\nSee Note 3 of “Notes to Consolidated Financial Statements” included in Part II, Item 8 of this report for additional information about our recent acquisitions.\nBacklog\nBacklog represents the future sales we expect to recognize on firm orders received from customers and approximates the Company’s remaining performance obligations at the end of each period. The Company’s total backlog was approximately $22.3 billion at December 31, 2024. The Company’s contracts are subject to standard industry cancellation provisions, including cancellations on short notice or upon completion of designated stages. Generally, if a customer were to cancel a contract, we would have an enforceable right to payment for work completed up to the date of cancellation which would include a reasonable profit margin. Substantial scope-of-work adjustments are common. For these and other reasons, completion of the Company’s backlog may be delayed or canceled. The railroad industry, in general, has historically been subject to fluctuations due to overall economic conditions and the level of use of alternative modes of transportation.\n7\nThe roll forward of the Company's backlog of firm customer orders and the expected year of completion are as follows:\n In millions \nFreight Segment\nTransit Segment\nConsolidated\n Balance at December 31, 2023\n$\n17,785 \n$\n4,214 \n$\n21,999 \n Less: 2024 Net sales \n(7,468)\n(2,919)\n(10,387)\n New orders \n7,348 \n3,147 \n10,495 \n Adjustments / foreign exchange, net \n321 \n(156)\n165 \n Balance at December 31, 2024\n$\n17,986 \n$\n4,286 \n$\n22,272 \n Expected Delivery \n2025\n$\n5,577 \n$\n2,104 \n$\n7,681 \nThereafter\n$\n12,409 \n$\n2,182 \n$\n14,591 \nGlobal economic conditions have not resulted in any material cancellations recently, but they have impacted the timing of some orders in backlog as, in certain cases, the delivery of goods and services were pushed out from their original timelines and could result in future modifications or cancellations.\nEngineering and Development\nTo execute our strategy to develop new products, we invest in a variety of engineering and development activities. For the years ended December 31, 2024, 2023 and 2022, we invested $206 million, $218 million and $209 million, respectively, in engineering for product development and improvement activities. Significant incremental engineering expense can be incurred with the execution of original equipment customer contracts. Across the Company we have established multiple Centers of Competence, which have specialized, technical expertise in various disciplines and product areas.\nOur engineering and development program includes investments in data analytics, train control and other new technologies, such as liquid natural gas and hydrogen-powered locomotives, with an emphasis on developing products that enhance safety, productivity and efficiency for our customers. For example, we have developed advanced cooling systems that enable lower emissions from diesel engines used in rail and other industrial markets. We periodically conduct specific research projects in conjunction with universities, customers and other industry suppliers.\nWe use our product development system to develop and monitor new product programs. The system requires the product development team to follow consistent steps throughout the development process, from concept to launch, to ensure the product will meet customer expectations and internal profitability targets.\nIntellectual Property\nWe have more than 6,500 active patents worldwide and file for approximately 300 new patents each year. We actively review our patent procurement processes and make adjustments as appropriate to the business environment. We also rely on a combination of trade secrets and other intellectual property laws, nondisclosure agreements and other protective measures to establish and protect our proprietary rights in our intellectual property. We actively monitor competitor patent issuance during our product development to reduce litigation risks, and we follow their product development practices to monitor possible patent infringement by them, and to evaluate their strategies and plans.\nTrademarks we utilize can be licensed from other companies, acquired as part of mergers or acquisitions, or have been developed through the normal course of business. We have entered into a variety of license agreements as licensor and licensee. We do not believe that any single license agreement is of material importance to our business or any of our business segments as a whole. \nCustomers\nWe provide products and services for more than 500 customers worldwide. Our customers include passenger transit authorities and railroads throughout North America, Europe, Asia Pacific, Africa and South America; manufacturers of transportation equipment, such as locomotives, freight cars, passenger transit vehicles and buses and companies that own, lease, and maintain such equipment, as well as customers in the mining, marine, and industrial markets.\nTop customers can change from year to year. For the fiscal year ended December 31, 2024, our top five customers accounted for approximately 30% of net sales. No one customer represents 10% or more of consolidated net sales. We believe that we have strong relationships with all of our key customers.\n8\nCompetition\nWe operate in a highly competitive marketplace. Price competition is strong because we have a relatively small number of customers and they are very cost-conscious. In addition to price, competition is based on product performance and technological leadership, quality, reliability of delivery, and customer service and support.\nOur principal competitors vary across product lines and geographies. Within North America, New York Air Brake Company, a subsidiary of the German air brake producer Knorr-Bremse AG (“Knorr”) and Amsted Rail Company, Inc., a subsidiary of Amsted Industries Corporation, are our principal overall OEM competitors. Our primary competition for locomotives is Progress Rail, owned by a subsidiary of Caterpillar. Our primary competition for freight and passenger transit service and repair is mostly from the railroads’ and passenger transit authorities’ in-house operations and Knorr. We believe our key strengths, strategic partnerships and operational excellence, coupled with an experienced management team, enable us to compete effectively in this marketplace. Outside of North America, Knorr is our main competitor, although not in every product line or geography. In addition, our competitors often include smaller, local suppliers in most international markets. Depending on the product line and geography, we can also compete with our customers, such as CRRC Corporation Limited, a China-based manufacturer of rolling stock.\nEnvironmental, Social and Governance\nSustainability\nWabtec is committed to creating sustainable value through innovative rail technologies and responsible business practices. Our mission to unlock our customers' potential by delivering innovative and lasting transportation solutions underpins our sustainability strategy. Our strategy helps us capitalize on market opportunities and reduce safety and environmental risks, while creating value for our customers, employees and other stakeholders. Wabtec utilizes three Strategic Sustainability Principles to execute our sustainability strategy: \n•\nInnovating with Purpose.\n We are committed to developing responsible and sustainable products that minimize the impact on the planet.\n•\nDriving Responsible Operations.\n We are committed to providing safe work environments and products that enable productive and efficient use of resources.\n•\nEmpowering People and Communities. \nWe are committed to driving an inclusive culture grounded in integrity, committed to the development of and investment in the communities where our teams live and work.\nAs we refine our sustainability strategy, we believe it is important to listen to our key internal and external stakeholders to identify and develop Environmental, Social and Governance (\"ESG\") topics of focus that align to our overall sustainability strategy and action plans. These topics are reviewed periodically to ensure our focus is in-line with the current market conditions and trends. Additionally, we utilize our Green Finance Framework to support the development of technologies that enable sustainable value creation. \nWabtec is committed to transparency on ESG topics, including the opportunities and challenges we encounter as we work to enhance performance and conduct business in a responsible manner. We publish periodic sustainability and sustainability-related reports, where we present ESG information, including policies, goals, activities, and qualitative and quantitative data on our progress. \nCompensation and Benefits\nWe remain committed to a strong pay-for performance philosophy that aligns individual performance, behaviors and business results with individual rewards. To deliver on that commitment, we utilize market data to benchmark to the external market and consider factors such as an employee’s role and experience, the location of the job and performance when determining compensation. \nWe provide our employees resources to help them be mentally, physically and financially well. We offer a wide range of benefits including healthcare and wellness (physical and mental) benefits, retirement benefits, paid time off, an employee assistance program, and seven employee resource groups to build diverse and inclusive communities at Wabtec. \nHuman Capital\nIn 2023, after years of growth and integration, we took the next step on our journey to become One Wabtec by aligning the behaviors of our legacy companies and evolving our shared culture. We launched our new cultural blueprint through our Vision, Mission, and Values after hearing from over 2,200 diverse stakeholders around the globe, including our customers, team members, managers, senior leaders, and Board of Directors. Our vision: Revolutionize the way the world moves for future generations. Our mission: unlock our customers’ potential by delivering innovative and lasting transportation solutions. At \n9\nWabtec, our purpose stems from four values that shape our core identity: People First, Expand the Possible, Embrace Diversity, and One Wabtec. These values are woven throughout our global operations, and they motivate us to build lasting connections. \nWabtec is committed to ensuring our workplace respects and seeks the unique talents, experiences and viewpoints of all our employees. We strive to create an environment where employees can be themselves. Our Board of Directors also plays a critical role in creating an organization that prioritizes, supports and invests in these ideals. \nOur headquarters are in Pittsburgh, Pennsylvania and we have offices, facilities, and operations in over 50 countries around the globe. As of December 31, 2024, we have a global workforce of approximately 29,500 employees, excluding contingent workers. \nUnionized Population\nA portion of our workers are represented by labor unions. The United Electrical, Radio and Machine Workers of America (UE), Locals 506 and 618 collective bargaining agreement, covering approximately 1,400 locomotive manufacturing workers in Erie, Pennsylvania, expired on June 9, 2023. Negotiations with the UE officially began on April 27, 2023 and an agreement between the Company and the UE was not reached before the contract expired. On June 22, 2023, the UE voted against ratification of the Company's proposed agreement and authorized a strike. The Company and the UE subsequently reached an agreement that was ratified by the UE on August 31, 2023, ending the labor strike. The Company continuously monitors its labor activity.\nTraining and Development\nWe continually invest in our employees’ career growth and provide employees with a wide range of development opportunities, including face-to-face, virtual, social and self-directed learning, mentoring and coaching programs. We have invested in training courses through Wabtec’s Learning Management System (\"LMS\"). Wabtec has partnered with a third-party vendor to provide an online learning platform available to all of our employees, both hourly and salary. \nOur Leadership, Expertise, Advancement and Development (\"LEAD\") program is the primary path for university graduates into Wabtec. LEAD is a two-year program that offers an immersive learning experience in the fields of engineering, operations, finance and IT along with extensive leadership training designed to build the next generation of leaders. On average, there are 100 participants in the LEAD program that rotate between business units or departments every six months to work on strategic projects and assignments, gain exposure to senior leadership and build their global professional network. We are focused on strengthening this program to support our global talent pipeline.\nEnvironmental, Health and Safety \nPutting people first is how we do business at Wabtec. Our Environmental, Health and Safety (\"EHS\") program has a longstanding commitment to continuously improve and foster a culture that proactively reduces risks and hazards in our operations, protects the environment, ensures regulatory compliance, and encourages learning and development. To ensure operational accountability for EHS across all levels of Wabtec, we use standard metrics (both lagging and leading indicators) and structured management reviews to track and measure EHS performance across all our operational sites. Monthly EHS operating reviews with the Executive Vice President for Global Operations are used to review operational risks at the enterprise-level, develop strategic initiatives, and communicate key performance indicators to senior management. Each site is responsible for developing a risk reduction plan to drive site or project-level actions related to risk reduction, compliance assurance, employee engagement, and continuous EHS improvement. Through these efforts, our Operations and EHS teams are partnering to eliminate and reduce hazards and risks within Wabtec’s operations, which is fundamental to improved EHS performance. In 2024, we had zero fatalities and our total recordable injury rate decreased by over 5% compared with 2023. We remain steadfast in our commitment to protecting our people and driving toward EHS excellence.\nRegulation\nIn the course of our operations, we are subject to various regulations and standards of governments and other agencies in the U.S. and around the world. These entities typically govern equipment, safety and interoperability standards for freight rail rolling stock and passenger transit, oversee a wide variety of rules and regulations governing safety and design of equipment, and evaluate certification and qualification requirements for suppliers. New products generally must undergo testing and approval processes that are rigorous and lengthy. As a result of these regulations and requirements, we must usually obtain and maintain certifications in a variety of jurisdictions and countries. The governing bodies include the Federal Railroad Administration (\"FRA\") and the Association of American Railroads (\"AAR\") in the U.S., and the International Union of Railways (“UIC”) and the European Railway Agencies in Europe. Also, in Europe, the European Committees for Standardization continually draft new European standards which cover, for example, the Reliability, Availability, Maintainability and Safety of railways systems. To guarantee interoperability in Europe, the European Union for Railway Agencies is responsible for defining and implementing Technical Standards of Interoperability, which covers areas such as \n10\ninfrastructure, energy, rolling stock, telematic applications, traffic operation and management subsystems, noise pollution and waste generation, protection against fire and smoke, and system safety.\nMost countries and regions in which Wabtec does business have similar rule-making bodies. For example, in China any product or system sold on the Chinese market must have been certified in accordance with national standards. In the local Indian market, most products are covered by regulations patterned after AAR and UIC standards.\nEffects of Seasonality\nOur business has limited seasonality. Third and fourth quarter results may be affected by the timing of services performed under our locomotive maintenance contracts and vacation and scheduled plant shutdowns at several of our major customers. Fourth quarter results may be affected by the timing of spare parts and service orders placed by transit agencies worldwide. Quarterly results can also be affected by the timing of projects in backlog and by project delays.\nEnvironmental Matters\nThe Company's operations and products are subject to a variety of environmental laws and regulations governing air emissions, discharges into water, the use, handling, storage, and disposal of hazardous substances and waste materials, as well as the remediation of contamination associated with releases of hazardous substances. The Company believes its operations and products currently comply in all material respects with all of the various environmental laws and regulations applicable to our business; however, there can be no assurance that environmental requirements will not change in the future or that we will not incur significant costs to comply with such requirements.\nAvailable Information\nWe maintain a website at www.wabteccorp.com. Available free of charge on this site are: our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and amendments to such reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as well as the annual report to stockholders, our Green Bond Report (https://ir.wabteccorp.com/investor-relations/green-finance-framework), our sustainability and sustainability-related reports (www.wabteccorp.com/sustainability/report-archive), and other information. The Internet site and the information contained therein or connected thereto are not incorporated by reference into this Form 10-K. The following are also available free of charge on this site and are available in print to any shareholder who requests them: Our Corporate Governance Guidelines, the charters of our Audit, Compensation and Talent Management and Governance and Sustainability Committees, our Code of Conduct, which is applicable to all employees, our Code of Ethics for Senior Officers, which is applicable to our executive officers, our Policies on Related Party Transactions and Conflict Minerals.\n11\nINFORMATION ABOUT OUR EXECUTIVE OFFICERS\nThe following table provides information on our executive officers as of February 12, 2025.  \nOfficers\nAge\nPosition\nRafael Santana\n53\nPresident and Chief Executive Officer\nDavid L. DeNinno\n69\nExecutive Vice President, General Counsel and Secretary\nJohn A. Olin\n64\nExecutive Vice President and Chief Financial Officer\nNicole Theophilus\n54\nExecutive Vice President and Chief Administrative Officer\nEric Gebhardt\n56\nExecutive Vice President and Chief Technology Officer\nGina Trombley\n54\nExecutive Vice President, Sales & Marketing & Chief Commercial Officer - Americas\nGreg Sbrocco\n56\nExecutive Vice President, Global Operations\nMichael E. Fetsko\n60\nPresident, Freight and Industrial Components\nAlicia Hammersmith\n54\nPresident, Freight Services\nRogerio Mendonca\n52\nPresident, Freight Equipment\nNalin Jain\n55\nPresident, Digital Intelligence\nPascal Schweitzer\n48\nPresident, Transit\nLillian Leroux\n53\nChief Strategy and Sustainability Officer\nJohn A. Mastalerz\n58\nSenior Vice President of Finance and Chief Accounting Officer\nKyra Yates\n46\nVice President, Investor Relations\nRafael Santana \nwas named President and Chief Executive Officer of the Company effective July 1, 2019. Previously, he served as Executive Vice President from February 2019 to July 2019. Mr. Santana was President and Chief Executive Officer of GE Transportation since November 2017. Mr. Santana has held several global leadership positions since joining GE in 2000, including roles in the Transportation, Power and Oil and Gas businesses. Prior to being named President and Chief Executive Officer of GE Transportation, Mr. Santana was President and Chief Executive Officer of GE in Latin America. He also served as President and Chief Executive Officer of GE Oil and Gas Turbomachinery Solutions and had roles as Chief Executive Officer for GE Gas Engines and Chief Executive Officer for GE Energy in Latin America. \nDavid L. DeNinno \nwas named Executive Vice President, General Counsel and Secretary of the Company effective December 2016. Previously, Mr. DeNinno served as Senior Vice President, General Counsel and Secretary since February 2012. Previously, Mr. DeNinno served as a partner at K&L Gates LLP since May 2011 and prior to that with Reed Smith LLP.\nJohn A. Olin\n was named Executive Vice President and Chief Financial Officer effective October 1, 2021. Prior to joining Wabtec, Mr. Olin served as the Senior Vice President and Chief Financial Officer of Harley-Davidson, where he was instrumental in driving strategic change amidst significant market disruption, including reshaping the company. Prior to Harley-Davidson, Mr. Olin served as Controller of Kraft Foods' Cheese Division, and had 12 years of financial leadership at Kraft, Oscar Mayer Foods, and Miller Brewing Company. Mr. Olin also held positions with financial services and specialized consulting firms including Ernst and Whinney (now Ernst and Young).\nNicole Theophilus \nwas named Executive Vice President & Chief Administrative Officer in July 2024. Ms. Theophilus was originally named Wabtec's Executive Vice President & Chief Human Resource Officer in October 2020. Before joining Wabtec, Ms. Theophilus served as Chief Human Resource Officer of West Corporation from March 2016 through February 2018. She also served as Executive Vice President and Chief Human Resource Officer, Vice President of Human Resources and Vice President and Chief Employment Counsel of ConAgra Corporation, where she was employed from 2006 through 2015. Prior to 2006, Ms. Theophilus was a partner with the law firm Husch Blackwell.\nEric Gebhardt \nwas named Executive Vice President and Chief Technology Officer in October 2020. Prior to joining Wabtec, Mr. Gebhardt served as Managing Director of KCK-US, a Delaware corporation, from May 2019 through September 2020. He also served in a variety of roles with General Electric including Chief Technology Officer of GE Power from August 2017 through January 2019, Chief Product Management Officer for GE Energy Connections from February 2017 through August 2017, Chief Platforms and Operations Officer for Current from January 2016 through January 2017, and Chief Technology Officer for GE Oil & Gas from October 2012 through December 2015.\nGina Trombley \nwas named Executive Vice President, Sales & Marketing & Chief Commercial Officer - Americas, effective September 8, 2020. Prior to joining Wabtec, Ms. Trombley served in various executive roles at Bombardier Transportation from 2017 to August 2020, most recently as Vice President of Services and previously as Vice President Sales for Bombardier Transport - Americas. Ms. Trombley also held progressive commercial and marketing leadership roles at Parsons and GE Transportation.\n12\nGreg Sbrocco \nwas named Executive Vice President, Global Operations in February 2019. Prior to this, Mr. Sbrocco was Global Supply Chain Leader for GE Transportation since September 2014. Mr. Sbrocco had been with GE since 1992 when he joined as an Environmental Engineer for the GE Energy business. During his tenure with GE, Mr. Sbrocco held several leadership roles in GE Energy, GE Oil and Gas, and GE Transportation.\nMichael E. Fetsko \nwas named President, Freight and Industrial Components effective January 2017. Previously, Mr. Fetsko served as Vice President and Group Executive from January 2014.  He joined Wabtec in July of 2011 as Vice President, Freight Pneumatics. Prior to joining Wabtec, Mr. Fetsko served in various executive management roles with Bombardier Transportation. Prior to Bombardier, Mr. Fetsko served in various management roles with two different environmental engineering firms. \nAlicia Hammersmith\n was named President, Freight Services in April 2023. Previously, Ms. Hammersmith served as Group Vice President, Transit Operations from 2020-2023 and as General Manager Latin America & Texas from 2019-2020.  Prior to joining Wabtec, Ms. Hammersmith served in various management roles with GE.\nRogerio Mendonca \nwas named President, Freight Equipment in February 2021. Previously Mr. Mendonca served as Vice President for Baker Hughes from July 2017. Prior to that he served as President of GE Transportation in Latin America from April 2016 through July 2017 and in several roles leading up to that including Commercial Director and Service Operations General Manager.\nNalin Jain \nwas named President, Digital Intelligence business effective December 2020. Mr. Jain had served as President, Global Equipment since May 2019 and previously as President & CEO, International Markets since August 2017 for GE Transportation. Prior to that, Mr. Jain had multiple leadership roles of increasing responsibility with GE Aviation and GE Transportation, since September 2005. Mr. Jain served as Director Global Partnerships with Bombardier Inc since July 2002 and prior to that he worked for Saint Gobain. \nPascal Schweitzer \nwas named President, Transit in April 2023. Previously, Mr. Schweitzer served as President, Freight Services from February 2019 to April 2023 and Vice President—Services of GE Transportation from April 2017 to February 2019. He also served as General Manager – Europe – Power Services for GE Power from November 2015 through April 2017 and prior to that several positions with Alstom Power.\nLilian Leroux \nwas named Chief Strategy and Sustainability officer in April 2023. Previously he served as President, Transit from March 2019 to April 2023 and Group President—Brakes & Safety from January 2017 to October 2019. Prior to that, Mr. Leroux held various executive management roles with Faiveley Transport, starting in January 2001.\n \nJohn A. Mastalerz \nwas named Senior Vice President of Finance and Chief Accounting Officer in February 2020.  Previously, Mr. Mastalerz served as Senior Vice President, Corporate Controller and Principal Accounting Officer from July 2017 to February 2020 and as Vice President and Corporate Controller from January 2014 to July 2017. Prior to joining Wabtec, Mr. Mastalerz served in various executive management roles with the H.J. Heinz Company from January 2001 to December 2013, most recently as Corporate Controller and Principal Accounting Officer.  Prior to 2001, Mr. Mastalerz was a Senior Manager with PricewaterhouseCoopers LLP.\nKyra Yates \nwas named Vice President of Investor Relations in March 2024. Previously, Ms. Yates served as the Vice President and Chief Financial Officer of Wabtec's Global Operations from March 2022 to March 2024, where she managed the financial performance of the Company's manufacturing, sourcing, and logistics operations. She also served as the Chief Financial Officer of Wabtec's Americas Services from March 2021 to March 2022. Ms. Yates had been with GE Transportation since 2008, and prior to that she held several positions with other GE businesses beginning in 2000.",
  "item7": "Item 7.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nWabtec is a global provider of value-added, technology-based locomotives, equipment, systems and services for the freight rail and passenger transit industries, as well as the mining, marine, and industrial markets. Our highly engineered products, which are intended to enhance safety, improve productivity and reduce maintenance costs for customers, can be found on most locomotives, freight cars, passenger transit cars, and buses around the world. Our core products and services are essential in the safe and efficient operation of freight rail and passenger transit vehicles. Wabtec is a global company with operations in over 50 countries, and our products can be found in more than 100 countries throughout the world. In 2024, approximately 53% of the Company’s Net sales came from customers outside the U.S.\nWabtec’s long-term financial goals are to increase revenues through a focused growth strategy, including product innovation and new technologies, global and market expansion, aftermarket products and services, and strategic acquisitions, increase margins through strict attention to cost controls, drive improved efficiencies across the business, drive strong cash flow conversion, and maintain a strong credit profile while minimizing our overall cost of capital. In addition, Management evaluates the Company’s current operational performance through measures such as safety, quality and on-time delivery.\nThe Company primarily serves the worldwide freight and transit rail industries. Our operating results are largely dependent on the level of activity, financial condition and capital spending plans of railroads and passenger transit agencies around the world, and transportation equipment manufacturers who serve those markets. Many factors influence these industries, including general economic conditions; traffic volumes, as measured by freight carloads and passenger ridership; number of locomotives and railcars in operation; government spending on public transportation; and investment in new technologies. In general, trends such as urbanization and growth in developing markets, sustainability and environmental awareness, investment in technology solutions, an aging equipment fleet, and growth in global trade are expected to drive continued investment in freight rail and passenger transit.\nThe Company monitors a variety of factors and statistics to gauge market activity. Freight rail markets around the world are driven primarily by overall economic conditions and activity, while Transit markets are driven primarily by government funding and passenger ridership. Changes in these market drivers can cause fluctuations in demand for Wabtec's products and services.\nBusiness Update\nDuring 2024, Wabtec continued to execute on our value creation framework by signing several key agreements including: a multi-year Tier 4 locomotive order in North America for over $600 million, a multi-year locomotive order in Kazakhstan for over $400 million, international orders for new locomotives for $401 million across six customers, and multi-year orders for new locomotives in Africa for approximately $525 million. Additionally, Wabtec won a long-term parts agreement with a Class I railroad for over $300 million, signed its first multi-year service contract with a customer in Brazil worth over $240 million, won signaling contracts with Transit customers in North America, and secured a long-term parts agreement with a customer in Asia. Operationally, Wabtec began commercial operations for its Green Friction braking solution in Paris and launched the next generation of railcar movers with its Shuttlewagon Commander NXT. Additionally, as a result of Wabtec's strong revenue and profitable growth over the past few years, rating agencies have made the following changes to our credit ratings: both Fitch Ratings and S&P Global Ratings upgraded Wabtec's credit rating from BBB- to BBB with a Stable outlook, and Moody's updated Wabtec's outlook to positive from stable.\nDuring the first quarter of 2022, Wabtec announced Integration 2.0, a multi-year strategic initiative to target incremental run rate synergies now estimated to be approximately $100 million by the end of 2026. The scope of the review included consolidating our operating footprint, reducing headcount, streamlining the end-to-end manufacturing process, restructuring the North America distribution channels, expanding operations in low-cost countries and simplifying the business through systems enablement. During the twelve months ended December 31, 2024 and 2023, the Company incurred one-time restructuring charges for programs included in the initiative of approximately $28 million and $49 million, respectively, primarily for employee-related costs and asset write downs associated with site consolidations in Europe. The Company now expects to incur approximately $170 million of one-time restructuring charges related to Integration 2.0, of which approximately $146 million has been incurred through December 31, 2024. Approved programs resulted in approximately 15 facility closures and impacted approximately 1,000 employees.\nIn addition to Integration 2.0, Wabtec is focused on exiting various low margin product offerings through Portfolio Optimization to improve profitability while reducing manufacturing complexity. Wabtec now expects to incur approximately $70 million in net exit charges related to Portfolio Optimization, which will be predominately non-cash asset write downs. For the years ended December 31, 2024 and 2023, Wabtec recorded charges of approximately $28 million primarily for asset write \n26\ndowns related to Portfolio Optimization. Total one-time restructuring charges related to Portfolio Optimization to date are approximately $56 million.\nIn February 2025, Wabtec announced Integration 3.0, a three-year strategic initiative to target incremental run rate synergies estimated to be between $100 million to $125 million by 2028. The scope of the review includes consolidating our footprint via value chain improvement and facility rationalization, reducing headcount, expanding operating capacity in low-cost countries, and streamlining administrative and commercial activities. Management will also consider additional capital investments to further simplify and streamline the business. The Company anticipates that it will incur charges of approximately $125 million to $155 million related to this initiative, of which approximately $80 million to $100 million are expected to be one-time restructuring charges. Concurrently, Wabtec announced an additional Portfolio Optimization initiative for 2025 targeting approximately $100 million of low margin revenues. The 2025 Portfolio Optimization actions are expected to result in approximately $40 million of net exit charges, primarily for non-cash asset write downs. Estimates for these programs could change based on the specific programs approved or changes to the scope of the review.\nFuture macroeconomic volatility, supply chain disruptions and labor availability could cause component and raw material shortages resulting in an adverse effect on the timing of the Company’s revenue and cash flows. Additionally, broad-based inflation, metals, energy and other commodity costs, transportation and logistics costs, labor costs, and foreign currency exchange rate fluctuations all continue to impact our results. The Company utilizes various mitigating actions intended to lessen the impact of macroeconomic volatility. These actions include implementing price escalations and surcharges, driving operational efficiencies through various cost mitigation efforts and discretionary spend management, strategically sourcing materials, reviewing and modifying distribution logistics, and accelerating integration synergies through our restructuring programs.  \nA portion of our workers are represented by labor unions. The United Electrical, Radio and Machine Workers of America (UE), Locals 506 and 618 collective bargaining agreement, covering approximately 1,400 locomotive manufacturing workers in Erie, Pennsylvania, expired on June 9, 2023. Negotiations with UE officially began on April 27, 2023 and an agreement between the Company and the UE was not reached before the contract expired. On June 22, 2023, the UE voted against ratification of the Company's proposed agreement and authorized a strike. The Company and the UE subsequently reached an agreement that was ratified by the UE on August 31, 2023, ending the labor strike. The Company continuously monitors its labor activity. \nDuring the first quarter of 2024, Company Management determined that certain parts of the business would be better aligned with Management oversight in different product lines. These changes were immaterial to the individual product lines and segments affected, and historical amounts have been reclassified to conform to the current period presentation.\nCyber Incident \nAs previously announced, on June 26, 2022, we detected a cyber security incident which impacted the Company’s network. The Company promptly activated incident response protocols, which included shutting down certain systems, and commenced an investigation of the incident. The Company also notified law enforcement and engaged legal counsel and other third-party incident response and cybersecurity professionals.\nBased on the Company's assessment, the incident did not have a significant financial impact and the Company does not believe the incident will have a material impact on its business, operations or financial results. The Company maintains cyber insurance, subject to certain deductibles and policy limitations typical for its size and industry. \nACQUISITIONS\nDuring 2024, the Company made four strategic acquisitions for a combined purchase price of approximately $168 million, net of cash acquired. Two of the acquisitions are reported in the Transit Segment, one is reported in the Digital Intelligence product line of the Freight Segment and one is reported in the Components product line of the Freight Segment. Each of the acquisitions in 2024 are individually and collectively immaterial. \nDuring the fourth quarter of 2023, the Company purchased the remaining ownership shares of LKZ, a locomotive manufacturing and assembly company located in Kazakhstan for $111 million, at which time it became a wholly owned subsidiary of the Company. Prior to this purchase, Wabtec owned 50% of LKZ as a joint venture partner and accounted for its interest as an equity method investment. During the second quarter of 2023, the Company acquired L&M Radiator, Inc., a leading manufacturer of heavy-duty equipment radiators and heat exchangers for the mining sector, for a purchase price of approximately $245 million. \nDuring 2022, the Company made three strategic acquisitions in the Freight Segment for a combined purchase price of $89 million, net of cash acquired. Two of the acquisitions are reported in the Digital Intelligence product line and one is reported in the Services product line. Each of the acquisitions in 2022 are individually and collectively immaterial. For \n27\nadditional information related to these acquisitions refer to Note 3 of \"Notes to Consolidated Financial Statements\" included in Part II, Item 8 of this report. \nOn January 14, 2025, Wabtec announced a definitive agreement to acquire Evident’s Inspection Technologies division (Inspection Technologies), formerly part of the Scientific Solutions Division of Olympus Corporation, a global leader in Non-Destructive Testing, Remote Visual Inspection and Analytical Instruments solutions for mission critical assets, for $1.78 billion. Inspection Technologies’ leading industry presence and innovative product portfolio is expected to significantly expand Wabtec's capabilities, adding advanced automated inspection capabilities, driving technology in a space where data acquisition, analytics and automation are critical. Upon acquisition, Inspection Technologies will be reported within the Digital Intelligence product line of the Freight Segment. The Company anticipates financing the acquisition with a combination of cash on hand, utilization of the Revolving Credit Facility and an additional term loan. The transaction is subject to customary closing conditions and regulatory approvals, with the Company expecting to finalize the acquisition of Inspection Technologies by the end of the first half of 2025.\n28\nRESULTS OF OPERATIONS\nConsolidated Results\n2024 COMPARED TO 2023 \nThe following table shows our Consolidated Statements of Operations for the years indicated.\n \nFor the year ended December 31,\nIn millions\n2024\n2023\nNet sales:\nSales of goods\n$\n8,434 \n$\n7,647 \nSales of services\n1,953 \n2,030 \nTotal Net sales\n10,387 \n9,677 \nCost of sales:\nCost of goods\n(5,918)\n(5,581)\nCost of services\n(1,103)\n(1,152)\nTotal Cost of sales\n(7,021)\n(6,733)\nGross profit\n3,366 \n2,944 \nOperating expenses:\nSelling, general and administrative expenses\n(1,248)\n(1,139)\nEngineering expenses\n(206)\n(218)\nAmortization expense\n(303)\n(321)\nTotal Operating expenses\n(1,757)\n(1,678)\nIncome from operations\n1,609 \n1,266 \nOther income and expenses:\nInterest expense, net\n(201)\n(218)\nOther income, net\n2 \n44 \nIncome before income taxes \n1,410 \n1,092 \nIncome tax expense\n(343)\n(267)\nNet income\n1,067 \n825 \nLess: Net income attributable to noncontrolling interest\n(11)\n(10)\nNet income attributable to Wabtec shareholders\n$\n1,056 \n$\n815 \nThe following table shows the major components of the change in Net sales in 2024 from 2023:\nIn millions\nFreight Segment\nTransit Segment\nTotal\n2023 Net sales\n$\n6,923 \n$\n2,754 \n$\n9,677 \nAcquisitions\n78 \n3 \n81 \nForeign Exchange\n(32)\n(1)\n(33)\nOrganic\n499 \n163 \n662 \n2024 Net sales\n$\n7,468 \n$\n2,919 \n$\n10,387 \nThe following discussion compares our results for the year ended December 31, 2024 to the year ended December 31, 2023. The discussion comparing our results for the year ended December 31, 2023 to the year ended December 31, 2022 is included within Management's Discussion and Analysis of Financial Condition and Results of Operation in our Annual Report on Form 10-K for the year ended December 31, 2023, filed with the SEC on February 14, 2024.\nNet sales\n \nNet sales for the year ended December 31, 2024 increased by $710 million, or 7.3%, to $10.39 billion compared to the same period in 2023. Organic sales increased $662 million which was attributable to both the Freight and Transit Segments.  Freight Equipment sales increased from higher North American and international locomotive sales and increased mining sales. Freight Services sales increased from higher deliveries of locomotive modernizations and engine overhauls and higher parts sales. Transit sales increased primarily as a result of higher demand for Aftermarket and Original Equipment Manufacturing products and services driven by increased investments in sustainable infrastructure, fleet expansion and renewals and increased \n29\npassenger ridership levels. Sales from acquisitions contributed $81 million, primarily in the Freight Segment, and unfavorable changes in foreign exchange decreased Net sales by $33 million.\nCost of sales\nCost of sales for the year ended December 31, 2024 increased by $288 million, or 4.3%, to $7.02 billion compared to the same period in 2023. The increase is primarily due to the increase in Net sales. Cost of sales as a percentage of Net sales was 67.6% and 69.6% for the years ended December 31, 2024 and 2023, respectively. The improvement in gross margin is attributable to contract escalation clauses, favorable mix between the Freight and Transit segments, improved productivity, Integration 2.0 savings, and favorable fixed cost absorption. Cost of sales for the years ended December 31, 2024 and 2023 included $37 million and $38 million, respectively, of restructuring costs, primarily for headcount actions and footprint rationalization related to Integration 2.0 and Portfolio Optimization.\nOperating expenses \nTotal operating expenses increased $79 million, or 4.7%, for the year ended December 31, 2024 compared to the same period in 2023, primarily due to the increase in Net sales. Operating expenses as a percentage of Net sales was 16.9% and 17.3% for the years ended December 31, 2024 and 2023, respectively. Selling, general and administrative expenses (\"SG&A\") increased $109 million for the year ended December 31, 2024 compared to the same period in 2023. The increase is primarily from costs incurred to support the higher sales volume, higher employee compensation and benefit costs and higher professional fees related to acquisitions, partially offset by the impacts of Integration 2.0. Restructuring costs included in SG&A were $18 million for the years ended December 31, 2024 and 2023, primarily for headcount actions and footprint rationalization programs related to Integration 2.0 in both years and Portfolio Optimization in 2024. Engineering expenses decreased $12 million primarily due to the timing of investments in new technology, and Amortization expense decreased $18 million, primarily related to changes in accelerated amortization for business dispositions associated with Portfolio Optimization and lower amortization for the GE Transportation trade name.  \nInterest expense, net\n \nInterest expense, net, decreased $17 million to $201 million for the year ended December 31, 2024 over the same period in 2023 primarily due to lower weighted average debt balances throughout the current year, partially offset by higher effective interest rates.\nOther income, net\nOther income, net, decreased $42 million to $2 million for the year ended December 31, 2024 compared to the same period in 2023, primarily due to lower equity income during 2024 and a gain on equity interest in the prior year. As a result of the change in ownership interest and obtaining control of LKZ in late 2023, Wabtec's previously held equity interest balance in LKZ was remeasured to fair value, resulting in a gain of approximately $35 million recorded to Other income, net in the prior year.\nIncome taxes \nThe effective income tax rate was 24.3% and 24.5% for the years ended December 31, 2024 and 2023, respectively. The year over year decrease was primarily due to changes in valuation allowances and audit closures, partially offset by a change in the jurisdictional mix of earnings and the non-recurrence of the non-taxable gain generated on the acquisition of LKZ in 2023. See Note 11 of \"Notes to Consolidated Financial Statements\" included in Part II, Item 8 of this report for additional information. \n30\nFreight Segment\nThe following table shows our Consolidated Statements of Operations for our Freight Segment for the periods indicated: \nFor the year ended December 31,\nIn millions\n2024\n2023\nChange\n% Change\nNet sales:\nSales of goods\n$\n5,524 \n$\n4,906 \n$\n618 \n12.6 \n%\nSales of services\n1,944 \n2,017 \n(73)\n(3.6)\n%\nTotal Net sales\n7,468 \n6,923 \n545 \n7.9 \n%\nCost of sales:\nCost of goods\n(3,848)\n(3,600)\n248 \n6.9 \n%\nCost of services\n(1,097)\n(1,142)\n(45)\n(3.9)\n%\nTotal Cost of sales\n(4,945)\n(4,742)\n203 \n4.3 \n%\nCost of sales (% of Net sales)\n66.2 \n%\n68.5 \n%\n(2.3)\nGross profit\n2,523 \n2,181 \n342 \n15.7 \n%\nOperating expenses\n(1,101)\n(1,116)\n(15)\n(1.3)\n%\nIncome from operations ($)\n$\n1,422 \n$\n1,065 \n$\n357 \n33.5 \n%\nIncome from operations (% of Net sales)\n19.0 \n%\n15.4 \n%\n3.6\nThe following table shows the major components of the change in Net sales for the Freight Segment in 2024 from 2023:\nIn millions\n2023 Net sales\n$\n6,923 \nAcquisitions\n78 \nForeign Exchange\n(32)\nChanges in Net sales by Product Line:\nServices\n132 \nEquipment\n328 \nComponents\n23 \nDigital Intelligence\n16 \n2024 Net sales\n$\n7,468 \nNet sales\nFreight Segment organic sales increased by $499 million driven primarily by Equipment sales from higher North American and international locomotive sales and increased mining sales, and Services sales from higher deliveries of locomotive modernizations and engine overhauls and higher parts sales. Additionally, Freight Segment sales also benefited from our strategic acquisitions, primarily from L&M Radiator Inc. acquired in the second quarter of 2023, by $78 million. \nCost of sales\nFreight Segment Cost of sales increased\n \n$203 million from higher sales volume, and Cost of sales as a percentage of Net sales decreased 2.3 percentage points. The improvement in gross margin is attributable to contract escalation clauses, favorable mix within the Freight Segment product lines, improved productivity and Integration 2.0 savings. Cost of sales for the year ended December 31, 2023 was also impacted by manufacturing inefficiencies related to labor negotiations at our Erie facility and costs related to next generation product development in Digital Intelligence. Cost of sales for the years ended December 31, 2024 and 2023 included\n \n$18 million and $13 million, respectively, of restructuring costs, primarily related to Integration 2.0 and Portfolio Optimization. \nOperating expenses\nFreight Segment Operating expenses as a percentage of Net sales were 14.7% and 16.1% for the years ended December 31, 2024 and 2023, respectively. Freight Segment Operating expenses decreased by $15 million primarily driven by lower amortization expense of $26 million due to changes in accelerated amortization for business dispositions associated with Portfolio Optimization and lower amortization for the GE Transportation trade name, and lower Engineering expenses of $16 million due to the timing of investments in new technology. This was partially offset by higher SG&A expenses of \n31\n$27 million resulting from higher costs to support increased sales volume, higher employee compensation and benefit costs and incremental expense from acquisitions. Freight SG&A expenses for the years ended December 31, 2024 and 2023 included $3 million and $5 million, respectively, of restructuring costs related to Integration 2.0 in 2023 and Portfolio Optimization in 2024. \n32\nTransit Segment\nThe following table shows our Consolidated Statements of Operations for our Transit Segment for the periods indicated: \nFor the year ended December 31,\nIn millions\n2024\n2023\nChange\n% Change\nNet sales\n$\n2,919 \n$\n2,754 \n$\n165 \n6.0 \n%\nCost of sales\n(2,076)\n(1,991)\n85 \n4.3 \n%\nCost of sales (% of Net sales)\n71.1 \n%\n72.3 \n%\n(1.2)\nGross profit\n843 \n763 \n80 \n10.5 \n%\nOperating expenses\n(505)\n(468)\n37 \n7.9 \n%\nIncome from operations ($)\n$\n338 \n$\n295 \n$\n43 \n14.6 \n%\nIncome from operations (% of Net sales)\n11.6 \n%\n10.7 \n%\n0.9\nThe following table shows the major components of the change in Net sales for the Transit Segment in 2024 from 2023:\nIn millions\n2023 Net sales\n$\n2,754 \nAcquisitions\n3 \nForeign Exchange\n(1)\nChanges in Net sales by Product Line:\nOriginal Equipment Manufacturing\n42 \nAftermarket\n121 \n2024 Net sales\n$\n2,919 \nNet sales\nTransit Segment organic sales increased $163 million driven by strong Aftermarket and Original Equipment Manufacturing sales. Increased passenger ridership levels resulted in increased demand for services and products. Additionally, increased investments in railway infrastructure, fleet expansion and renewals and sustainable transport initiatives also contributed to organic growth. \nCost of sales\nTransit Segment Cost of sales increased by $85 million primarily from higher sales volume, and Cost of sales as a percentage of Net sales decreased by 1.2 percentage points. The increase in gross margin is primarily attributable to favorable mix within the Transit Segment and the benefits from structured cost actions taken through prior years' restructuring and integration projects, primarily Integration 2.0. Transit Cost of sales for the years ended December 31, 2024 and 2023 included $19 million and $25 million of restructuring costs, respectively, primarily for footprint rationalization and headcount actions in Europe related to Integration 2.0. \nOperating expenses\nOperating expenses as a percentage of Net sales for the Transit Segment were 17.3% and 17.0% for the years ended December 31, 2024 and 2023, respectively. Transit Segment Operating expenses increased by $37 million primarily driven by higher SG&A expenses of $25 million to support higher sales volume and higher employee compensation and benefit costs, higher Engineering expenses of $4 million due to increased investments in new technology, and higher Amortization expense of $8 million primarily due to accelerated amortization for business dispositions associated with Portfolio Optimization. This was partially offset by benefits from structured cost actions taken through prior years' restructuring and integration projects, primarily Integration 2.0. Transit SG&A expenses for the years ended December 31, 2024 and 2023 included $13 million of restructuring costs primarily for footprint rationalization and headcount actions in Europe related to Integration 2.0. \n33\nLiquidity and Capital Resources\nLiquidity is provided by operating cash flows, borrowings under the 2022 Credit Agreement and the 2024 Credit Agreement, each with a consortium of commercial banks, and proceeds from the Company's Senior Notes. Additionally, the Company utilizes the revolving receivables program and supply chain financing program described below, as well as other short-term financing agreements with certain banks, for added flexibility as part of our liquidity management strategy. The following is a summary of selected cash flow information and other relevant data:\nFor the year ended\nDecember 31,\nIn millions\n2024\n2023\nCash provided by (used for):\n \n \nOperating activities\n$\n1,834 \n$\n1,201 \nInvesting activities\n$\n(343)\n$\n(492)\nFinancing activities\n$\n(1,371)\n$\n(633)\n \nOperating activities\n \nIn 2024, cash provided by operating activities was $1,834 million compared to $1,201 million in 2023. Significant changes to the sources and (uses) of cash for the twelve month periods include the following:\n•\n$242 million from increased Net income;\n•\n$161 million from favorable changes in Accounts receivables driven by $121 million of higher collections on receivables and $40 million of lower remittance for the Revolving Receivables Program;\n•\n$128 million from changes in Accounts payable due to timing of payments; \n•\n$(59) million from changes in Inventory to support higher sales; \n•\n$38 million from changes in employee related benefit payments; and,\n•\napproximately $150 million from changes in income tax accounts, including a tax refund in the current year.\nInvesting activities \nIn 2024 and 2023, cash used for investing activities was $(343) million and $(492) million, respectively. During 2024, Wabtec made four strategic acquisitions for net cash of $(168) million. During 2024, Wabtec also used $(207) million for additions to property, plant and equipment for investments in our facilities and manufacturing processes, received $19 million of net proceeds from dispositions of businesses, and received $13 million of proceeds from disposals of property, plant, and equipment. During 2023, Wabtec acquired L&M Radiator, Inc., a leading manufacturer of heavy-duty equipment radiators and heat exchangers, for net cash of approximately $(229) million and the remaining ownership shares of LKZ for net cash of approximately $(81) million. During 2023, Wabtec also used $(186) million for additions to property, plant and equipment.\nFinancing activities \nIn 2024, cash used for financing activities was $(1,371) million, which included $(64) million from net changes in debt, $(1,097) million of stock repurchases, $(140) million of dividend payments, $(42) million of contingent consideration payments related to the GE Transportation acquisition, $(25) million of payments for income tax withholding on share-based compensation, and $(6) million of distributions to noncontrolling interest. In 2023, cash used for financing activities was $(633) million which included $42 million from net changes in debt, $(409) million of stock repurchases, $(123) million of dividend payments, $(112) million of contingent consideration payments related to the GE Transportation acquisition, $(17) million of distributions to noncontrolling interest, and $(16) million of payments for income tax withholding on share-based compensation . \nDuring the first quarter of 2024, the Company entered into the 2024 Credit Agreement for a term loan of $225 million. Also during the first quarter of 2024, the Company issued $500 million of Senior Notes due in 2034 (the \"2034 Notes\"). Proceeds from the 2034 Notes, combined with the proceeds from the term loan under the 2024 Credit Agreement and cash on hand, were utilized to repay the outstanding amount of 2024 Notes at maturity.\nDuring the third quarter of 2023, the Company borrowed the full $250 million of availability under the Delayed Draw Term Loan and subsequently utilized the proceeds to redeem the outstanding 2023 Notes. Beginning September 15, 2023, the effective interest rates for the 2024 Notes and the 2028 Notes were each reduced by 0.25% due to a favorable change in Wabtec's corporate credit rating and the rating of the aforementioned notes.\nThe Company borrows and repays against the Revolving Credit Facility for added flexibility in liquidity to manage cash during the operating cycle. The proceeds from borrowing and the repayments are shown within the \"Proceeds from debt, net of issuance costs\" and \"Payments of debt\" lines, respectively, presented in the Consolidated Statements of Cash Flows. Additional \n34\ninformation with respect to credit facilities and long-term debt is included in Note 9 of \"Notes to Consolidated Financial Statements” included in Part II, Item 8 of this report. \nAs of December 31, 2024, the Company held approximately $715 million of cash, cash equivalents, and restricted cash, of which approximately $417 million was held within the United States and approximately $298 million was held outside of the United States, primarily in India, Europe, China and Brazil. While repatriation of some cash held outside the United States may be restricted by local laws, most of the Company’s foreign cash could be repatriated to the United States net of any tax impacts. As of December 31, 2024, approximately $9 million of the Company's $715 million cash balance was classified as restricted cash. \nWe or our affiliates may, from time to time, seek to retire or purchase outstanding debt through negotiated or open-market cash purchases, exchanges, or otherwise, and such transactions, if any, will be upon such terms and at such prices as we may determine, and will depend on prevailing market conditions, our liquidity requirements, contractual restrictions and other factors.\nRevolving Receivables Program \nThe Company utilizes a revolving receivables facility to sell up to $350 million of certain receivables through our bankruptcy-remote subsidiary to a financial institution on a recurring basis in exchange for cash equal to the gross receivables sold. As customers pay their balances, we transfer additional receivables into the program, which could result in our gross receivables sold being higher or lower than customer collections remitted to the financial institution for any applicable period. Net cash remitted from the revolving receivables program was $(20) million and $(60) million for the years ended December 31, 2024 and 2023, respectively. During the fourth quarter of 2024, the revolving receivables program agreement was amended to allow us to request loans from the financial institution secured by the receivables held in the program, up to the $350 million limit. As a result, effective January 1, 2025 proceeds and repayments of loans under the program will be classified as Financing activities on our statement of cash flows and outstanding balances will be classified as debt on our balance sheet. Additional information with respect to the Revolving Receivables Program is included in Note 2 of \"Notes to Consolidated Financial Statements\" included in Part II, Item 8 of this report.\nSupply Chain Financing Program\nThe Company has entered into supply chain financing arrangements with third-party financial institutions to provide our vendors with enhanced payment options while providing the Company with added working capital flexibility. The Company does not provide any guarantees under these arrangements, does not have an economic interest in our supplier's voluntary participation, does not receive an economic benefit from the financial institutions, and no assets are pledged under the arrangements. The arrangements do not change the payable terms negotiated by the Company and our vendors and does not result in a change in the classification of amounts due as accounts payable in the Consolidated Balance Sheets. Additional information with respect to the Supply Chain Financing Program is included in Note 2 of \"Notes to Consolidated Financial Statements\" included in Part II, Item 8 of this report.\nIntra-Quarter Uncommitted Money Market Line Credit Agreement\nDuring the third quarter of 2024, the Company entered into an uncommitted bilateral money market line credit agreement which provides an aggregate borrowing capacity of $150 million, for general business purposes and working capital needs within a quarter.\nGuarantor Summarized Financial Information\nThe obligations under the US Notes issued by Westinghouse Air Brake Technologies Corporation (the \"Parent Company\") have been fully and unconditionally guaranteed by certain of the Parent Company's U.S. subsidiaries (\"Guarantor Subsidiaries\"). Each guarantor is 100% owned by the Parent Company, with the exception of GE Transportation, a Wabtec Company, which has 15,000 shares outstanding of Class A Non-Voting Preferred Stock held by General Electric Company. The Euro Notes are issued by Wabtec Transportation Netherlands B.V. (\"Wabtec Netherlands\") and are fully and unconditionally guaranteed by the Parent Company.\nThe following tables present summarized financial information of the Parent Company and the guarantor subsidiaries on a combined basis. The combined summarized financial information eliminates intercompany balances and transactions among the Parent Company and guarantor subsidiaries and equity in earnings and investments in any guarantor subsidiaries or non-guarantor subsidiaries. The summarized financial information is provided in accordance with the reporting requirements of Rule 13-01 under SEC Regulation S-X for the issuer and guarantor subsidiaries.\n35\nSummarized Statement of Income\nUnaudited\nParent Company and Guarantor Subsidiaries\nIn millions\nYear Ended December 31, 2024\nNet sales\n$\n5,948 \nGross profit\n$\n2,399 \nNet income attributable to Wabtec shareholders\n$\n788 \nSummarized Balance Sheet\nUnaudited\nParent Company and Guarantor Subsidiaries\nIn millions\nDecember 31, 2024\nDecember 31, 2023\nCurrent assets\n$\n1,604 \n$\n1,513 \nNoncurrent assets\n$\n2,049 \n$\n2,196 \nCurrent liabilities\n$\n2,242 \n$\n2,443 \nLong-term debt\n$\n2,962 \n$\n2,739 \nOther non-current liabilities\n$\n697 \n$\n662 \nThe following is a description of the transactions between the combined Parent Company and guarantor subsidiaries with non-guarantor subsidiaries.\nUnaudited\nParent Company and Guarantor Subsidiaries\nIn millions\nYear Ended December 31, 2024\nNet sales to non-guarantor subsidiaries\n$\n875 \nPurchases from non-guarantor subsidiaries\n$\n1,170 \nUnaudited\nParent Company and Guarantor Subsidiaries\nIn millions\nDecember 31, 2024\nAmount due to non-guarantor subsidiaries\n$\n13,697 \nSummarized Financial Information—Euro Notes\nThe obligations under Wabtec Netherlands’ Euro Notes are fully and unconditionally guaranteed by the Parent Company. Wabtec Netherlands is a wholly-owned, indirect subsidiary of the Parent Company. Wabtec Netherlands is a holding company and does not have any independent operations. Its assets consist of its investments in subsidiaries, which are separate and distinct legal entities that are not guarantors of the Euro Notes and have no obligations to pay amounts due under Wabtec Netherlands’ obligations.  \nThe following tables present summarized financial information of Wabtec Netherlands, as the Issuer of the Euro Notes, and the Parent Company, as the parent Guarantor, on a combined basis. The combined summarized financial information eliminates all intercompany balances and transactions among Wabtec Netherlands and the Parent Company as well as all equity in earnings from and investments in any subsidiary of the Parent Company, other than Wabtec Netherlands, which we refer to below as the Non-Guarantor Subsidiaries. The summarized financial information is provided in accordance with the reporting requirements of Rule 13-01 under SEC Regulation S-X for the issuer and Parent Company guarantor.\nSummarized Statement of Income\nUnaudited\nIssuer and Guarantor\nIn millions\nYear Ended December 31, 2024\nNet sales\n$\n577 \nGross profit\n$\n90 \nNet loss attributable to Wabtec shareholders\n$\n(209)\n36\nSummarized Balance Sheet\nUnaudited\nIssuer and Guarantor\nIn millions\nDecember 31, 2024\nDecember 31, 2023\nCurrent assets\n$\n546 \n$\n493 \nNoncurrent assets\n$\n646 \n$\n651 \nCurrent liabilities\n$\n1,014 \n$\n1,272 \nLong-term debt\n$\n3,479 \n$\n3,287 \nOther non-current liabilities\n$\n49 \n$\n84 \nThe following is a description of the transactions between the combined Wabtec Netherlands, as the Issuer of the Euro Notes, and the Parent Company, as the parent Guarantor, with the subsidiaries of Westinghouse Air Brake Technologies Corp., other than Wabtec Netherlands, none of which are guarantors of the Euro Notes.\nUnaudited\nIssuer and Guarantor\nIn millions\nYear Ended December 31, 2024\nNet sales to non-guarantor subsidiaries\n$\n46 \nPurchases from non-guarantor subsidiaries\n141 \nUnaudited\nIssuer and Guarantor\nIn millions\nDecember 31, 2024\nAmount due to non-guarantor subsidiaries\n$\n8,449 \nContractual Obligations and Off-Balance Sheet Arrangements\nThe Company is obligated to make future payments under various contracts such as purchase, debt and lease agreements and has certain contingent commitments. The Company has grouped these contractual obligations and off-balance sheet arrangements into operating activities, financing activities, and investing activities in the same manner as they are classified in the Statement of Consolidated Cash Flows to provide a better understanding of the nature of the obligations and arrangements and to provide a basis for comparison to historical information. The table below provides a summary of contractual obligations and off-balance sheet arrangements as of December 31, 2024:\nIn millions\nTotal\n2025\n2026-27\n2028-29\n2030+\nOperating activities:\n \n \n \n \n \nPurchase obligations\n (1)\n$\n119 \n$\n117 \n$\n2 \n$\n— \n$\n— \nOperating leases \n(2)\n345 \n63 \n101 \n67 \n114 \nPension and postretirement benefit payments\n (3)\n214 \n20 \n41 \n44 \n109 \nInterest payments\n (4)\n684 \n156 \n268 \n134 \n126 \nFinancing activities:\n \n \n \n \n \nLong-term debt\n3,995 \n500 \n1,520 \n1,475 \n500 \nDividends to shareholders\n (5)\n171 \n171 \n— \n— \n— \nTotal\n$\n5,528 \n$\n1,027 \n$\n1,932 \n$\n1,720 \n$\n849 \n \n(1)\nPurchase obligations represent non-cancelable contractual obligations at December 31, 2024.\n(2)\nOperating leases represent multi-year obligations for rental of facilities and equipment. \n(3)\nPension and postretirement benefit payments includes expected payments to participants out of plan assets and corporate assets. The benefit payments are based on actuarial estimates using current assumptions for discount rates, expected return on long-term assets and rate of compensation increases. The Company does not expect material contributions to pension plan investments in 2025. \n37\n(4)\nInterest payments on the Senior Notes and the amounts borrowed under the 2024 and 2022 Credit Agreements as of December 31, 2024 are based on interest rates in effect as of December 31, 2024 and are calculated on debt with maturities that extend to 2034. \n(5)\nShareholder dividends are subject to approval by the Company’s Board of Directors, currently at an annual rate of approximately $171 million beginning in 2025.\nThe above table does not reflect uncertain tax positions of $19 million, the timing of which are uncertain. Refer to Note 11 of the “Notes to Consolidated Financial Statements” included in Part II, Item 8 of this report for additional information on uncertain tax positions. Additionally, the Company arranges for certain types of bank guarantees and letters of credit, such as performance bonds, bid bonds and financial guarantees, that are issued by certain banks and insurance companies to support customer contracts. At December 31, 2024, the total value of these bank guarantees and letters of credit were $931 million and expire on various dates through 2034. Amounts include interest payments based on contractual terms and the Company’s current interest rate.\nForward Looking Statements\nWe believe that all statements other than statements of historical facts included in this report, including certain statements under “Business” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” may constitute forward-looking statements. We have based these forward-looking statements on our current expectations and projections about future events. Although we believe that our assumptions made in connection with the forward-looking statements are reasonable, we cannot assure that our assumptions and expectations are correct.\nThese forward-looking statements are subject to various risks, uncertainties and assumptions about us, including, among other things:\nEconomic and industry conditions\n•\nchanges in general economic and/or industry specific conditions, including the impacts of tax and tariff programs, inflation, supply chain disruptions, foreign currency exchange, and industry consolidation;\n•\nprolonged unfavorable economic and industry conditions in the markets served by us, including North America, South America, Europe, Australia, Asia and Africa;\n•\ndecline in demand for freight cars, locomotives, passenger transit cars, buses and related products and services;\n•\nreliance on major original equipment manufacturer customers;\n•\noriginal equipment manufacturers’ program delays;\n•\ndecreased demand for services in the freight and passenger rail industry;\n•\ndecreased demand for our products and services;\n•\norders either being delayed, canceled, not returning to historical levels, or being reduced, and/or economic conditions affecting the ability of our customers to pay timely for goods and services delivered;\n•\nconsolidations in the rail industry;\n•\ncontinued outsourcing by our customers; \n•\nindustry demand for faster and more efficient braking equipment;\n•\nfluctuations in interest rates and foreign currency exchange rates; \n•\navailability of credit or difficulty in obtaining debt or equity financing; \n•\nchanges in market consensus as to what attributes are required for projects to be considered \"green\" or \"sustainable\" or negative perceptions regarding determinations in such regard with respect to our Green Finance Framework or ESG strategy; or\n•\nchanges in the ESG topics that have the highest relative priority for Wabtec's external stakeholders;\nOperating factors\n•\nsupply disruptions;\n•\ntechnical difficulties;\n•\nchanges in operating conditions and costs;\n•\nincreases in raw material costs;\n•\nchallenges associated with the successful introduction of new products;\n•\nproduct safety, quality and reliability;\n•\nperformance under material long-term contracts;\n•\nlabor availability constraints and labor relations challenges;\n•\nthe outcome of our existing or any future legal proceedings, including litigation involving our principal customers and any litigation with respect to environmental matters, asbestos-related matters, pension liabilities, warranties, product liabilities, competition and anti-trust matters or intellectual property claims;\n•\nour ability to successfully complete and integrate acquisitions; \n•\nrisks associated with the development and use of new technology; or\n38\n•\ncybersecurity and data protection risks;\nCompetitive factors\n•\nthe actions of competitors; or\n•\nadverse outcomes of negotiations with partners, suppliers, customers or others;\nPolitical/governmental factors\n•\npolitical instability in relevant areas of the world, including the impacts of war, conflicts, global military action, and acts of terrorism;\n•\nfuture regulation/deregulation of our customers and/or the rail industry;\n•\ndecreases in levels of governmental funding on transit projects, including for some of our customers;\n•\npolitical developments and laws and regulations, including those related to Positive Train Control; \n•\nconsequences of federal and state income tax legislation; \n•\nsanctions imposed on countries and persons; or\n•\nthe outcome of negotiations with governments;\nNatural hazards / health crises\n•\nimpacts of climate change, including evolving climate change policy;\n•\ndisruptive natural hazards, including earthquakes, fires, floods, tornadoes, hurricanes or weather conditions;\n•\nepidemics, pandemics, or similar public health crises;\n•\ndeterioration of general economic conditions as a result of natural hazards or health crises;\n•\nshutdown of one or more of our operating facilities as a result of natural hazards and health crises; or\n•\nsupply chain and sourcing disruptions as a result of natural hazards and health crises;\nStatements in this Form 10-K apply only as of the date on which such statements are made, and except as required by law, we undertake no obligation to update any statement to reflect events or circumstances after the date on which the statement is made or to reflect the occurrence of unanticipated events.\nCritical Accounting Estimates\nThe preparation of the financial statements in accordance with generally accepted accounting principles requires management to make judgments, estimates and assumptions regarding uncertainties that affect the reported amounts of assets and liabilities, disclosure of contingent assets and liabilities and the reported amounts of revenues and expenses. Critical areas of uncertainty that require judgments, estimates and assumptions include the accounting for allowance for doubtful accounts, inventories, business combinations, goodwill and indefinite-lived intangible assets, warranty reserves, income taxes, and revenue recognition. Management uses historical experience and all available information to make these judgments and estimates, and actual results may differ from those estimates and assumptions that are used to prepare the Company’s financial statements at any given time. Despite these inherent limitations, management believes that Management’s Discussion and Analysis of Financial Condition and Results of Operations (MD&A) and the financial statements and related footnotes provide a meaningful and fair perspective of the Company. \nA summary of the Company’s significant accounting policies is included in Note 2 in the “Notes to Consolidated Financial Statements” included in Part II, Item 8 of this report. Management believes that the application of these policies on a consistent basis enables the Company to provide the users of the financial statements with useful and reliable information about the Company’s operating results and financial condition.\nAccounts Receivable and Allowance for Doubtful Accounts:\nDescription \nThe Company provides an allowance for doubtful accounts to cover anticipated losses on uncollectible accounts receivable.\nJudgments and Uncertainties\n  \nThe allowance for doubtful accounts receivable reflects our best estimate of expected losses inherent in our receivable portfolio determined on the basis of historical experience, relevant credit forecast information, changes to customer's solvency and other currently available evidence.\nEffect if Actual Results Differ From Assumptions\n  \nIf our estimates regarding the collectability of troubled accounts, and/or our actual losses within our receivable portfolio exceed our estimated losses, we may be exposed to the expense of increasing our allowance for doubtful accounts and loss of cash flows.\nInventories:\nDescription \nInventories are stated at the lower of cost or net realizable value and are reviewed to ensure that an adequate provision is recognized for excess, slow moving and obsolete inventories, and net realizable value reserves.\nJudgments and Uncertainties \nCost is determined primarily using the first-in, first-out (FIFO) method. Inventory costs include material, labor and overhead. The Company compares inventory components to prior year sales history, current backlog and \n39\nanticipated future requirements. To the extent that inventory parts exceed estimated usage and demand, a reserve is recognized to reduce the carrying value of inventory. Also, specific reserves are established for known inventory obsolescence, a decline in market value, or loss of a customer with specific inventory.\nEffect if Actual Results Differ From Assumptions \nIf the market value or demand for our products were to decrease due to changing market conditions, the Company could be at risk of incurring write-downs to adjust inventory value to a net realizable value lower than stated cost. If our estimates regarding sales and backlog requirements are inaccurate, we may be exposed to the expense of increasing our reserves for slow moving and obsolete inventory.\nBusiness Combinations:\nDescription \nThe Company accounts for business acquisitions in accordance with Accounting Standard Codification (\"ASC\") 805, \nBusiness Combinations,\n which requires the purchase price of the acquired business to be allocated to tangible and intangible assets acquired and liabilities assumed based on the respective fair values. The amount of purchase price which is in excess of the fair values of assets acquired and liabilities assumed is recognized as goodwill. \nJudgments and Uncertainties \nDiscounted cash flow models are used to estimate the fair values of acquired intangible assets such as contract backlog, customer relationships, intellectual property, and trade names. The significant assumptions used to estimate the value of the intangible assets include revenue growth rates, projected profit margins, discount rates, royalty rates, customer attrition rates, revenue obsolescence rates and market participant profit margins. These significant assumptions are forward-looking and could be affected by future economic and market conditions.\nEffect if Actual Results Differ From Assumptions \nDifferent assumptions may result in materially different values for assets acquired and liabilities assumed, which may impact the Company's financial position and future results of operations, including potential future impairment charges.\nGoodwill and Indefinite-Lived Intangible Assets:\nDescription\n Goodwill represents the excess of cost over the fair value of the net assets acquired in a business combination. Indefinite-lived intangible assets primarily represent certain trade names acquired in a business combination that were determined to have indefinite useful lives. Goodwill and indefinite-lived intangibles are required to be tested for impairment at least annually. The Company performs its annual impairment tests during the fourth quarter and more frequently when indicators of impairment are present. The Company reviews goodwill for impairment at the reporting unit level. The Company has identified three reporting units for purposes of testing goodwill for impairment. Two reporting units exist within the Freight segment and the Transit segment is also a reporting unit. The evaluation of impairment involves comparing the current fair value of the business to the recorded value including goodwill.\nJudgments and Uncertainties \nA number of significant assumptions and estimates are involved in the application of the impairment test, including the identification of macroeconomic conditions, industry and market considerations, cost factors, and overall financial performance. We also consider Wabtec-specific events and share price trends and making the assessment on whether each relevant factor will impact the impairment test positively or negatively and the magnitude of any such amount.\nEffect if Actual Results Differ From Assumptions \nManagement considers historical experience and all available information at the time the fair values of its reporting units are estimated. However, actual amounts realized may differ from those used to evaluate the impairment of goodwill and indefinite lived intangible assets. If actual results are not consistent with our assumptions and judgments used in estimating future cash flows and asset fair values, we may be exposed to impairment losses that could be material to our results of operations.\nWarranty Reserves:\nDescription \nThe Company provides warranty reserves to cover expected costs from repairing or replacing products with durability, quality or workmanship issues occurring during established warranty periods.\nJudgments and Uncertainties \nIn general, reserves are provided for as a percentage of sales, based on historical experience. In addition, specific reserves are established for known warranty issues and their estimable losses.\nEffect if Actual Results Differ From Assumptions \nIf actual results are not consistent with the assumptions and judgments used to calculate our warranty liability, the Company may be exposed to the expense of increasing our reserves for warranty expense.\nIncome Taxes:\nDescription \nWabtec records an estimated liability for income and other taxes based on what it determines will likely be paid in various tax jurisdictions in which it operates in accordance with ASC 740-10 \nAccounting for Income Taxes and Accounting for Uncertainty in Income Taxes\n.\nJudgments and Uncertainties \nThe estimate of our tax obligations are uncertain because management must use judgment to estimate the exposures associated with our various filing positions, as well as realization of our deferred tax assets. ASC 740-10 \n40\nestablishes a recognition and measurement threshold to determine the amount of tax benefit that should be recognized related to uncertain tax positions.\nEffect if Actual Results Differ From Assumptions \nManagement uses its best judgment in the determination of these amounts. However, the liabilities ultimately realized and paid are dependent on various matters including the resolution of the tax audits in the various affected tax jurisdictions and may differ from the amounts recorded. An adjustment to the estimated liability would be recorded through income in the period in which new information changes the expected outcome of an uncertain tax position. A deferred tax valuation allowance is provided when it is more likely than not that some portion or all of the deferred tax assets will not be realized.\nRevenue Recognition:\nDescription \nRevenue is recognized in accordance with ASC 606 \nRevenue from Contracts with Customers\n. The Company recognizes a portion of its revenues on long-term customer agreements involving the design and production of highly engineered products that require revenue to be recognized over time because these products have no alternative use without significant economic loss and the agreements contain an enforceable right to payment including a reasonable profit margin from the customer in the event of contract termination. Generally, the Company uses an input method for determining the amount of revenue, cost and gross margin to recognize over time for these customer agreements. The input method used for these agreements recognizes revenue based on our efforts to satisfy the performance obligation and includes costs of material and labor, both of which give an accurate representation of the progress made toward complete satisfaction of a particular performance obligation. The Company may also use the output method which recognizes revenue based on direct measurements of the value transferred to the customer.\nJudgments and Uncertainties \nAccounting for long-term customer agreements involves a judgmental process of estimating the total sales and costs for each contract, which results in the development of estimated profit margin percentages. Contract estimates related to long-term projects are based on various assumptions to project the outcome of future events that could span several years. These assumptions include cost of materials, labor availability and productivity, complexity of the work to be performed, and the performance of suppliers, customers and subcontractors that may be associated with the contract. Factors that influence these estimates include inflationary trends, foreign exchange rates, technical and schedule risk, internal and subcontractor performance trends, business volume assumptions, asset utilization, and anticipated labor agreements. Generally, pricing is defined in our contracts but may include an estimate of variable consideration when required by the terms of the individual customer contract. Types of variable consideration that the Company typically has include volume discounts, prompt payment discounts, price escalation clauses, liquidating damages, and performance bonuses. \nEffect if Actual Results Differ From Assumptions \nShould market conditions and customer demands dictate changes to our standard shipping terms, the Company may be impacted by longer than typical revenue recognition cycles. The development of expected contract costs and contract profit margin percentages involves procedures and personnel in all areas that provide financial or production information on the status of contracts. Due to the significance of judgments in the estimation process, it is likely that materially different revenue and cost amounts could be recorded if we used different assumptions or if the underlying circumstances were to change. Changes in underlying assumptions/estimates, inflation or deflation, foreign currency exchange rates, supplier performance, or other circumstances may adversely or positively affect financial performance in future periods. Some of our contracts are expected to be completed in a loss position. Provisions are made currently for estimated losses on uncompleted contracts and are updated as necessary.",
  "item2": null
}