{
  "source_file": "wbd-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. Business.\nFor convenience, the terms “Warner Bros. Discovery”, “WBD”, the “Company,” “we,” “us” or “our” are used in this Annual Report on Form 10-K to refer to both Warner Bros. Discovery, Inc. and collectively to Warner Bros. Discovery, Inc. and one or more of its consolidated subsidiaries, unless the context otherwise requires.\nIndustry Trends\nThe WGA and SAG-AFTRA went on strike in May and July 2023, respectively, following the expiration of their respective collective bargaining agreements with the Alliance of Motion Picture and Television Producers (“AMPTP”). The WGA strike ended on September 27, 2023, and a new collective bargaining agreement was ratified on October 9, 2023. The SAG-AFTRA strike ended on November 9, 2023, and a new collective bargaining agreement was ratified on December 5, 2023.\nThe strikes had a material impact on the operations and results of the Company in 2023, including a pause on certain theatrical and television productions. Effects included a positive impact on cash flow from operations attributed to delayed production spend, and a negative impact on the results of operations attributed to timing and performance of the 2023 film slate, as well as the Company’s ability to produce, license, and deliver content. The Company experienced content completion and delivery delays in the first quarter of 2024 due to the pause in television and theatrical productions in 2023, but did not experience any material impacts for the remainder of 2024.\nOther headwinds in the industry, such as continued pressures on linear distribution and continued softness in the U.S. linear advertising market, have had, and are expected to continue to have, a material impact on the operations and results of the Company, including a negative impact on the results of operations attributed to declines in linear advertising revenue. In addition, declines in linear subscribers are expected to continue. The increase of digital advertising available in the marketplace has also resulted in, and is expected to continue to result in, increased competition for advertising expenditures for both traditional linear networks and ad-supported tiers in streaming services.\nWe continue to closely monitor the ongoing impact of industry trends to our business; however, the full effects on our operations and results will depend on future developments, which are highly uncertain and cannot be predicted.\nDescription of Business \nWarner Bros. Discovery is a leading global media and entertainment company that creates and distributes a differentiated and comprehensive portfolio of content and products across television, film, streaming, interactive gaming, publishing, themed experiences, and consumer products through brands including: Discovery Channel, Max, CNN, DC Studios, TNT Sports, HBO, Food Network, TLC, TBS, Warner Bros. Motion Picture Group, Warner Bros. Television Group, Warner Bros. Games, Adult Swim, Turner Classic Movies, and others.\nWe are home to one of the largest collections of owned content in the world with assets and intellectual property across sports, news, lifestyle, and entertainment in most languages and regions of the globe. We create some of the best-in-class content using our renowned library, beloved franchises, and acclaimed creative expertise to serve our audiences and consumers. Our asset mix strongly positions us to execute our key strategies: grow our direct-to-consumer (“DTC”) business globally, enhance our Studios segment, and manage our linear networks for the best possible success in order to create long-term value for our shareholders.\n5\nWe generate revenue from fees charged to distributors that carry our network brands and programming, including cable, direct-to-home (“DTH”) satellite, telecommunication and digital service providers, as well as through DTC subscription services (distribution revenue); the sale of advertising on our networks and digital platforms (advertising revenue); the release of feature films for initial exhibition in theaters, the licensing of feature films and television programs to various television, subscription video on demand (“SVOD”) and other digital markets, distribution of feature films and television programs in the physical and digital home entertainment markets, sales of console games and mobile in-game content, sublicensing of sports rights, and licensing of intellectual property such as characters and brands (content revenue); and other sources such as studio tours and production services (other revenue). \nCorporate Reorganization\nOn December 12, 2024, the Company announced that its board of directors had authorized the Company to implement a new corporate structure designed to enhance the Company’s strategic flexibility and create potential opportunities to unlock shareholder value. Under the new corporate structure, the Company will serve as the parent company for two distinct operating divisions: Global Linear Networks and Streaming & Studios. To facilitate the implementation of this new structure and the movement of entities and assets to align with the new operating divisions, on January 1, 2025, the Company completed certain transactions, including (1) a merger of Discovery Holding Company with and into a newly formed subsidiary of WarnerMedia Holdings, Inc. (the “DHC Merger”) and (2) a merger of a second newly formed subsidiary of WarnerMedia Holdings, Inc. with and into Scripps Networks Interactive, Inc. (the “Scripps Merger”). As a result of the DHC Merger, Discovery Communications, LLC became an indirect subsidiary of WarnerMedia Holdings, Inc. As a result of the Scripps Merger, Scripps Networks Interactive, Inc. became a direct subsidiary of WarnerMedia Holdings, Inc.\nSegments\nAs of December 31, 2024, we classified our operations in three reportable segments: \n•\nStudios\n - Our Studios segment primarily consists of the production and release of feature films for initial exhibition in theaters, production and initial licensing of television programs to our networks/DTC services as well as third parties, distribution of our films and television programs to various third party and internal television and streaming services, distribution through the home entertainment market (physical and digital), related consumer products and themed experience licensing, and interactive gaming.\n•\nNetworks\n - Our Networks segment primarily consists of our domestic and international television networks.\n•\nDTC \n- Our DTC segment primarily consists of our premium pay-TV and streaming services.\nOur segment presentation aligns with our management structure and the financial information management uses to make decisions about operating matters, such as the allocation of resources and business performance assessments. Financial information for our segments and the geographical areas in which we do business is set forth in Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations” and Note 23 to the consolidated financial statements included in Item 8, “Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.\nStudios\nWBD’s Studios business includes the Warner Bros. Motion Picture Group (“WBMPG”), DC Studios, Warner Bros. Television Group (“WBTVG”), Consumer Products, Themed Entertainment and Brand Licensing, DC Comics Publishing, Content Licensing, Home Entertainment, Studio Operations, and Interactive Gaming.\nWBMPG is comprised of \nWarner Bros. Pictures, New Line Cinema, and Warner Bros. Pictures Animation\n. WBMPG partners with captivating storytellers to create filmed entertainment for a global audience.\nDC Studios,\n tasked with developing properties licensed from DC Comics for film, television, animation, and games, continues the tradition of high-quality storytelling within the DC Universe, while building a sustainable growth business out of the iconic characters.\nWBTVG consists of \nWarner Bros. Television,\n the Company’s flagship television production unit for live-action scripted programming, as well as \nWarner Bros. Unscripted Television\n, which produces unscripted and alternative programming through its four production units – \nWarner Horizon Unscripted Television, Telepictures\n, \nWarner Bros. International Television Production,\n and \nShed Media\n. WBTVG also includes \nWarner Bros. Animation, Cartoon Network Studios,\n and \nHanna-Barbera Studios Europe\n.\n6\nAmong the Studios segment’s content highlights for 2024 were \nDune: Part Two, Beetlejuice, Beetlejuice \nand\n Godzilla x Kong: The New Empire \non the film side, with Warner Bros. Discovery becoming the first studio to cross the $1 billion mark at the worldwide box office that year. Award-winning TV titles for 2024 include \nAbbott Elementary\n, \nShrinking, \nand \nThe Voice. \nAs of December 31, 2024, the new series \nThe Penguin\n remains one of the most-watched debut seasons globally of any current HBO or Max show, behind only \nHouse of the Dragon\n and \nThe Last of Us\n.\nBeyond its production operations, the Studios segment includes various businesses that facilitate consumer interaction with the intellectual property it creates.\nGlobal Consumer Products, Themed Entertainment and Brand Licensing, \nand world-renowned comic and publishing powerhouse \nDC Comics, \nall drive opportunities for consumers to engage with WBD’s leading entertainment brands and franchises.\nGlobal distribution of most of WBD’s content is handled by \nContent Sales\n, which provides content for viewers across streaming, cable, satellite and broadcast networks, local television stations, and airlines. \nWarner Bros. Home Entertainment\n oversees the global distribution of content through physical goods (Blu-ray Disc™ and DVD) and digital media in the form of electronic sell-through and video-on-demand via cable, satellite, online, and mobile channels.\nThe Studios segment also includes \nWarner Bros. Games\n, a worldwide publisher, developer, licensor, and distributor of content for the interactive space across all platforms, including console, handheld, mobile, and PC-based gaming for both internal and third-party game titles. \nIn September 2024, WBD announced a new global structure for the Company’s worldwide studio tours, retail destinations, touring exhibitions, and all location-based experiences. \nWBD Global Experiences\n brings together the previous Global Themed Entertainment licensing group and the Studio Tours & Retail owned and operated group into a single worldwide division to develop and execute on global strategies that offer partners a mix of both group models, putting WBD in a position to drive growth and become a worldwide leader in the creation, development, licensing, and operation of location-based entertainment inspired by \nHarry Potter\n, DC, Looney Tunes, \nScooby-Doo\n, \nGame of Thrones\n, \nFriends\n, Discovery and more.\nFor the year ended December 31, 2024, content and other revenues were 92%\n \nand 8%, respectively, of total revenues for this segment.\nNetworks\nWBD’s linear network operations include general entertainment, lifestyle, and news networks in the U.S., as well as a host of international media networks and global sports networks.\nGeneral and lifestyle entertainment networks in the U.S. include \nTNT\n, \nTBS\n, \nTurner Classic Movies\n, \nOWN\n,\n HGTV\n, \nFood Network\n, \nTLC\n, \nDiscovery Channel \nand \nAdult Swim\n,\n \namong\n \nmany others.\nIn 2024, \nCNN\n, our global news brand, launched \nCNN International\n in Europe on Max, giving audiences the ability to access a combination of on-air CNN content and exclusive programming on WBD’s streaming service in Spain, Nordics, Belgium, Netherlands, and Central and Eastern Europe.\nTNT Sports\n is a global leader in the delivery of premium sports content. The TNT Sports U.S. portfolio includes expansive, multi-platform partnerships with the National Basketball Association (“NBA”), Major League Baseball, the National Collegiate Athletic Association (“NCAA”) Division I Men’s Basketball Championship, National Hockey League, United States Soccer Federation, Unrivaled, National Association for Stock Car Auto Racing, Roland-Garros, NCAA Big 12 Football and Men’s Basketball, and NCAA Big East Men’s and Women’s Basketball. Additionally, TNT Sports co-manages NCAA.com and NCAA March Madness Live, along with NBA Digital including NBA TV, the NBA App and NBA.com. Bleacher Report and House of Highlights, digital destinations for young adult sports fans, are owned and operated by TNT Sports. In March 2024, TNT Sports also premiered a primetime sports programming block on truTV consisting of live sports, original sports shows, and ancillary sports content.\nTNT Sports in the United Kingdom and Ireland includes live coverage of Australian Open and Roland-Garros tennis; Grand Tour cycling; the Union Cycliste Internationale Mountain Bike World Series; World Championship and World Cup winter sports events; British and World Superbikes; snooker; Olympic Games 2026-2032; Premier League; Union of European Football Associations club football; Premiership men’s and women’s rugby; MotoGP; international cricket; Ultimate Fighting Championship and boxing, which are all available on TNT Sports and its streaming home, discovery+. \nTNT Sports’ owned-and-operated platforms include \nBleacher Report, \nEurosport.com, \nHouse of Highlights\n, Golf Digest, and a full suite of digital and social brands. \nFor the year ended December 31, 2024, distribution, advertising, content, and other revenues were 53%, 36%, 9%, and 2%, respectively, of total revenues for this segment.\n7\nDTC\nWBD’s DTC business includes our streaming services, such as \nMax\n and \ndiscovery+\n, and premium pay-TV services, such as \nHBO.\n Our streaming services are available on most mobile and connected TV devices. As of December 31, 2024, we had 116.9 million DTC subscribers\n1\n. Our strong subscriber growth this year has driven increased revenue and profitability for the DTC segment. In 2025 and 2026, we anticipate additional launches of our streaming services in major markets.\nHBO\n is one of the most respected and innovative entertainment brands in the world, serving iconic, award-winning programming through the HBO linear channels and our DTC streaming service, Max. In 2024, HBO’s crime drama \nThe Penguin\n earned positive reviews and grew its premiere-night audience by 54% from debut to finale. \nThe Penguin\n also earned Colin Farrell a Golden Globe Award in the category for Best Performance by a Male Actor in a Limited Series, Anthology Series, or a Motion Picture Made for Television. Another standout was \nTrue Detective: Night Country\n, which became the series’ most watched season, receiving 19 Emmy nominations and one win for Jodie Foster’s performance. New HBO series highlights include \nDune: Prophecy\n and \nLike Water for Chocolate\n, both of which have already been renewed for a second season. Other hit HBO series that returned to critical acclaim in 2024 included \nHouse of the Dragon \nand \nHacks\n, a Golden Globe winner for Best Television Series - Musical or Comedy.\nMax \nis a streaming destination for a variety of programming including HBO Originals, Warner Bros. films, Max Originals, the DC universe, the Wizarding World of Harry Potter, CNN, and programming across food, home, reality, lifestyle, and documentaries from leading brands like HGTV, Food Network, Discovery Channel, and more. Our strategy to grow our DTC business globally delivered success in 2024 with the launch of Max in 73 new markets across Latin America, the Caribbean, Europe, and Asia and the addition of 19.3 million global subscribers to our DTC products. \nIn 2025, our content pipeline for HBO and Max includes the highly anticipated returns of \nThe White Lotus\n, \nThe Last of Us\n, \nHacks\n, \n...And Just Like That\n, \nPeacemaker\n, and \nThe Gilded Age,\n as well as the series premieres of \nIt: Welcome to Derry\n and \nThe Eastern Gate\n.\ndiscovery+\n is WBD’s non-fiction, real-life subscription-based streaming service. discovery+ features a wide range of series across popular passion verticals, including lifestyle and relationships; home and food; true crime; paranormal; adventure and natural history; science, tech, and the environment; and a slate of high-quality documentaries. discovery+ highlights for 2024 included the premiere of \nQuiet on Set\n and the return of the \nCurious Case of Natalia Grace\n.\nMax and discovery+ currently feature both ad-free and ad-lite versions in most markets.\nFor the year ended December 31, 2024, distribution, advertising, and content revenues were 87%, 8%, and 4%, respectively, of total revenues for this segment.\n1\n \n \nDirect-to-Consumer subscriber \n- We define a “Core DTC Subscription” as: \n(i) a retail subscription to discovery+, HBO, HBO Max, Max, or a Premium Sports Product (defined below) for which we have recognized subscription revenue, whether directly or through a third party, from a direct-to-consumer platform; (ii) a wholesale subscription to discovery+, HBO, HBO Max, Max, or a Premium Sports Product for which we have recognized subscription revenue from a fixed-fee arrangement with a third party and where the individual user has activated their subscription; (iii) a wholesale subscription to discovery+, HBO, HBO Max, Max, or a Premium Sports Product for which we have recognized subscription revenue on a per subscriber basis; (iv) a retail or wholesale subscription to an independently-branded, regional product sold on a stand-alone basis that includes discovery+, HBO, HBO Max, Max, and/or a Premium Sports Product, for which we have recognized subscription revenue (as per (i)-(iii) above); and (v) users on free trials who convert to a subscription for which we have recognized subscription revenue within the first seven days of the calendar month immediately following the month in which their free trial expires.\nThe Company defines a “Premium Sports Product” as a strategically prioritized, sports-focused product sold on a stand-alone basis and made available directly to consumers. The current “independently-branded, regional products” referred to in (iv) above consist of TVN/Player and BluTV. Subscribers to multiple WBD DTC products (listed above) are counted as a paid subscriber for each individual WBD DTC product subscription. We may refer to the aggregate number of DTC Subscriptions as “subscribers”.\nThe reported number of “subscribers” included herein and the definition of “DTC Subscription” as used herein excludes: (i) individuals who subscribe to DTC products, other than discovery+, HBO, HBO Max, Max, a Premium Sports Product, and independently-branded, regional products (currently consisting of TVN/Player and BluTV) that may be offered by us or by certain joint venture partners or affiliated parties from time to time; (ii) a limited number of international discovery+ subscribers that are part of non-strategic partnerships or short-term arrangements as may be identified by the Company from time to time; (iii) domestic and international Cinemax subscribers, and international basic HBO subscribers; and (iv) users on free trials except for those users on free trial that convert to a DTC Subscription within the first seven days of the next month as noted above.\nDomestic subscriber\n - We define a Domestic subscriber as a subscription based either in the United States of America or Canada.\nInternational subscribe\nr - We define an International subscriber as a subscription based outside of the United States of America or Canada.\n8\nCOMPETITION\nProviding content across various distribution platforms is a highly competitive business worldwide. We experience competition for the development and acquisition of content, distribution and sale of our content, sale of commercial time on our networks and viewership. There is competition from other production studios, other television networks, and online-based content providers for the acquisition of content and creative talent such as writers, producers and directors. In addition, the composition of our competitors has evolved with the entrance of new market participants, including companies in adjacent sectors with significant financial, marketing, and other resources, greater efficiencies of scale, fewer regulatory burdens and more competitive pricing. Our ability to produce and acquire popular content is an important competitive factor for the distribution of our content, attracting viewers and the sale of advertising. Our success in securing popular content and creative talent depends on various factors such as the number of competitors providing content that targets the same genre and audience, the distribution of our content, viewership, and the production, marketing and advertising support we provide.\nOur networks compete with other television networks, including broadcast, cable and local, and with other studios and production companies for the distribution of our content and fees charged to cable television operators, DTH satellite service providers, and other distributors that carry our content. Our ability to secure distribution agreements is necessary to ensure the retention of our audiences. Our contractual agreements with distributors are renewed or renegotiated from time to time in the ordinary course of business. Growth in the number of networks distributed, consolidation and other market conditions in the cable and satellite distribution industry, and increased popularity of other platforms may adversely affect our ability to obtain and maintain contractual terms for the distribution of our content that are as favorable as those currently in place. The ability to secure distribution agreements is dependent upon the production, acquisition and packaging of content, viewership, the marketing and advertising support and incentives provided to distributors, the product offering across a series of networks within a region, and the prices charged for carriage.\nOur networks and streaming services, which include Max, HBO Max, and discovery+, compete for the sale of advertising with other television networks, including broadcast, cable, local networks, other content distribution outlets and new market participants for their target audiences and the sale of advertising. Our success in selling advertising is a function of the size and demographics of our audiences, quantitative and qualitative characteristics of the audience of each network, the perceived quality of the network and of the particular content, the brand appeal of the network and ratings as determined by third-party research companies, prices charged for advertising and overall advertiser demand in the marketplace.\nOur networks, studios and streaming services also compete for their target audiences with all forms of content and other media provided to viewers, including broadcast, cable and local networks, streaming services, pay-per-view and video-on-demand (“VOD”) services, online activities and other forms of news, information and media entertainment.\nINTELLECTUAL PROPERTY\nWe are \none of the world’s leading creators, owners and distributors of intellectual property. \nOur intellectual property assets include copyrights in films, television programs, software, comic books and mobile apps; trademarks in names, logos and characters; patents or patent applications for inventions related to products and services; websites; and licenses of intellectual property rights of various kinds from third parties.\n \nWe have made and will continue to make investments in developing technology platforms to support our digital products and streaming services, including Max and discovery+, and consider these platforms to be intellectual property assets as well.\nWe are a global media and entertainment company and the protection of our content and brands is of primary importance. To protect our intellectual property assets, we rely upon a combination of copyright, trademark, patent, unfair competition, and internet/domain name statutes and laws, and contract provisions. However, there can be no assurance of the degree to which these measures will be successful. Moreover, effective intellectual property protection may be either unavailable or limited in certain foreign territories, and new legislative or regulatory initiatives could impact our operations.\nWe seek to limit unauthorized use of our intellectual property through a combination of approaches. However, the steps taken to prevent the infringement of our intellectual property by unauthorized third parties may not be effective.\n \nPiracy, which encompasses the theft of our signals, and the unauthorized use of our intellectual property in the digital environment, continues to present a threat to revenues from products and services based on our intellectual property.\n \nPiracy also includes the unauthorized use of our intellectual property on physical goods. We have a team dedicated to disrupting and curbing piracy and other forms of intellectual property infringement and use external vendors to detect and remove infringements, whether digital in nature or on physical goods. We also engage with intermediaries that facilitate piracy, leverage our membership in a range of industry groups, and initiate enforcement actions, including litigation, to address piracy issues.\n \nIn general, policing unauthorized use of our products and services and related intellectual property is difficult and costly. Further, new technologies such as generative AI and their impact on our intellectual property rights remain uncertain, and development of the law in this area could impact our ability to protect against infringing uses or result in infringement claims against us.\n9\nThird parties may challenge the validity or scope of our intellectual property from time to time, and the success of any such challenges could result in the limitation or loss of intellectual property rights. Irrespective of their validity, such claims may also result in substantial costs and diversion of resources which could have an adverse effect on our operations.\nREGULATORY MATTERS\nOur businesses are subject to and affected by regulations of U.S. federal, state and local government authorities, and our international operations are subject to laws and regulations of the countries and international bodies, such as the E.U., in which we operate. Content networks, such as those owned by us, are regulated in certain limited respects by the Federal Communications Commission (“FCC”), including some regulations that only apply to content networks affiliated with a cable television operator. Other FCC regulations, although imposed on cable television operators and direct broadcast satellite (“DBS”) operators and other distributors, affect content networks indirectly. The rules, regulations, policies and procedures affecting our businesses are constantly subject to change. These descriptions are summary in nature and describe only the most significant regulations we face; they do not purport to describe all present and proposed laws and regulations affecting our businesses.\nProgram Access\nThe Communications Act (the “Act”) and the FCC’s program access rules prevent a content vendor in which a cable operator has an “attributable” ownership interest from discriminating against unaffiliated multichannel video programming distributors (“MVPDs”), such as cable and DBS operators, in the rates, terms and conditions for the sale or delivery of the vendor’s content networks, on the basis of the non-affiliation. These rules permit the unaffiliated MVPD to initiate a complaint to the FCC against the content vendor and content networks if it believes this rule has been violated.\nProgram Carriage\nThe Act and the FCC’s program carriage rules prohibit MVPDs from favoring their affiliated content networks over unaffiliated, similarly situated content networks in the rates, terms and conditions of their carriage agreements in a manner that unreasonably restrains the ability of the unaffiliated content network to compete fairly. These rules permit the unaffiliated content network to initiate a complaint to the FCC against the MVPD if it believes these rules have been violated, but court decisions interpreting the regulations have made it difficult for us to challenge a distributor’s decision to decline to carry one of our content networks or discriminate against one of our content networks.\n“Must-Carry”/Retransmission Consent\nThe Act imposes “must-carry” regulations on cable systems, requiring them to carry, as part of their cable service, the signals of most local broadcast television stations in their market if they elect mandatory carriage. DBS systems are also subject to their own must-carry rules. The FCC’s implementation of “must-carry” obligations requires cable operators and DBS providers to give broadcasters preferential access to channel space and favorable channel positions. This reduces the amount of channel space that is available for carriage of our content networks by cable and DBS operators on television. The Act also gives certain broadcasters the choice of opting out of must-carry and invoking the right to retransmission consent, which refers to a broadcaster’s right to require MVPDs, such as cable and satellite operators, to obtain the broadcaster’s consent before distributing the broadcaster’s signal to the MVPDs’ subscribers, often at a substantial cost that reduces the content funds available for programmers not affiliated with broadcasters, such as us.\nAccessibility, Children’s Advertising Restrictions, Emergency Alerts and CALM Act\nCertain of our content networks and some of our IP-delivered video content must provide closed-captioning and audio description of some of their programming and comply with other regulations designed to make our content more accessible to persons with disabilities. The U.S. Congress, the FCC, and the U.S. Department of Justice periodically consider proposals to implement additional accessibility requirements, and are considering a number of such proposals now, some of which would increase our obligations substantially.\n \nOur television programming intended primarily for children 12 years of age and under must comply with certain limits on the amount and type of permissible advertising, and certain regulations extend to our digital products when they are referenced by web address in our television programming. We may not include actual or simulated emergency alert tones or signals in our content. Commercials embedded in our networks’ television content stream also must adhere to certain standards for ensuring that those commercials are not transmitted at louder volumes than our program material.\nObscenity Restrictions\nMVPDs are prohibited from transmitting obscene content, and our distribution agreements generally require us to refrain from including such content on our networks.\n10\nRegulation of Digital Products and Services\nWe operate a variety of free, advertising-based and subscription-based digital products and streaming services providing news, information and entertainment to consumers in the U.S. and international markets via web, mobile and connected TV platforms. In some cases, those products and services are provided directly to consumers, and in other cases, they can be used and/or purchased through a third-party distributor, such as Xfinity or Hulu.\n \nOur digital products and services are subject to federal and state laws in the U.S. relating to the privacy and security of personal information collected from our users, including laws pertaining to the acquisition of personal information from children. Some examples of these laws include the federal Children’s Online Privacy Protection Act (COPPA), the federal Controlling the Assault of Non-Solicited Pornography and Marketing Act (CAN SPAM), the Video Privacy Protection Act (VPPA), and the California Consumer Privacy Act (CCPA). Additional U.S. state and federal laws addressing data security and data breach notification obligations also may apply to the Company in some instances. These laws and their public and private enforcement are continually evolving. More than a dozen comprehensive U.S. state privacy laws have taken effect in the last few years, and a number of others have been introduced and may pass in the future. Additional U.S. federal and state laws and regulations apply or may be adopted with respect to our digital products and services, covering such issues as data privacy and security, the online safety of children and teens, dissemination or moderation of user-generated content, advertising, competition, pricing, content, copyrights and trademarks, access by persons with disabilities, distribution, taxation and characteristics and quality of products and services. The scope of regulation may differ depending on how these products and services are used and/or purchased.\n \nIn addition, the FCC from time to time considers whether some or all digital services should be considered MVPDs and regulated as such, or otherwise subjected to rules that apply to traditional communications providers. Such determination would increase our regulatory burdens substantially.\nIntellectual Property Laws and Regulations\nOur \nintellectual property assets are discussed under “Business – Intellectual Property” above. Our \ncontent, whether distributed over broadcast, cable, DBS, wireless, or internet-based services, or through other means, is protected under intellectual property law, including copyright, trademark, patent, \nunfair competition, and internet/domain name statutes and laws and license agreements\n. Changes to these laws and regulations could either strengthen or weaken our ability to license and protect our content and combat its theft or misuse.\nForeign Laws and Regulations\nThe foreign jurisdictions in which our products and services are offered have, in varying degrees, laws and regulations governing our businesses, including relating to the production, monetization and distribution of content.\n \nBy way of example, our digital offerings available to consumers in international jurisdictions are subject to laws and regulations relating to, without limitation, consumer protection, data privacy and security, advertising, competition, intellectual property, and content limitations.\nSimilar to the U.S., new laws and regulations in international jurisdictions may be adopted with respect to our intellectual property, products and services.\n \nIn particular, we face increased efforts in international jurisdictions to regulate streaming services, which may constrain our offerings. Further, international laws and regulations around intellectual property could limit our ability to license and protect our content, as well as impose additional burdens on our business.\nHUMAN CAPITAL \nAs of December 31, 2024, we had approximately\n \n35,000 employees, including full-time and part-time employees of our wholly-owned subsidiaries and consolidated ventures, with 50% located in the U.S. and 50% located outside of the U.S.\nWe are a talent-driven business, aiming to attract, develop, and motivate top talent throughout our company. To support these objectives, our people and culture programs are designed to provide competitive, locally-relevant benefits, performance-based pay, and nonfinancial support and incentives. We also strive to enhance our culture through efforts aimed at making our workplace engaging and inclusive, and to develop our talent to prepare them for critical roles and leadership positions for the future. We also provide opportunities for our employees to make an impact in their communities through social good initiatives around the world.\nSome examples of our people and culture programs and initiatives are described below. \nCompensation \nOur compensation philosophy is to pay for performance, encourage excellence and reward employees who innovate and deliver high-quality results.\n \nOur compensation programs are designed to implement our compensation philosophy by:\n•\npaying competitively, across salary grades and geographies; \n•\napplying compensation policies in an internally consistent manner; and\n•\nincentivizing our employees to deliver on our short- and long-term objectives.\n11\nBenefits\nWe provide an array of benefits and programs that support our employees in their personal and professional lives. Highlights include:\n•\nlocal medical, dental, and vision plans in many countries around the world to support our employees with access to health care, supplementing any state-provided health care; \n•\non-site wellness centers in our New York, Los Angeles, Atlanta, and Chiswick (London) offices, fully-equipped fitness centers in our New York, Los Angeles and Atlanta offices, and access to virtual fitness classes and wellbeing programs;\n•\nfamily support programs, including on-site childcare in certain offices, childcare locator services, back-up childcare, maternity/paternity leave, adoption assistance and elder care;\n•\ntools and resources to support the mental wellbeing of our employees and their families, including mental health counselors in our on-site wellness centers and a confidential, dedicated line for employees to contact and speak with a counselor in the event they need mental health support; \n•\nproducts and services to support employees’ financial wellbeing, including life, accident, and disability insurance plans, discount benefits, financial planning tools, a 401(k) savings plan in the U.S. and retirement/pension plans in over 20 countries, with competitive contributions from the Company for employees at all levels; and\n•\noffering an employee stock purchase plan, which allows certain employees globally (where legislation permits) an opportunity to buy WBD Series A common stock (“WBD common stock”) at a discounted price through convenient after-tax payroll deductions with no commission charges.\nLearning and Development\nOur Global Learning & Development (“L&D”) team provides learning opportunities for employees around the world. The L&D team uses a variety of delivery methods suitable to the content and audience, including live in-person sessions, virtual workshops, webinars, and asynchronous online learning through our global learning management platform. The L&D team also provides tuition reimbursement for eligible courses.\nAVAILABLE INFORMATION\nAll of our filings with the U.S. Securities and Exchange Commission (the “SEC”), including reports on Form 10-K, Form 10-Q, and Form 8-K, and all amendments to such filings are available free of charge at the investor relations section of our website, ir.wbd.com, as soon as reasonably practicable after such material is filed with, or furnished to, the SEC. Our annual report, corporate governance guidelines, code of business ethics, audit committee charter, compensation committee charter, and nominating and corporate governance committee charter are also available on our website. In addition, we will provide a printed copy of any of these documents, free of charge, upon written request to: Investor Relations, Warner Bros. Discovery, Inc., 230 Park Avenue South, New York, NY 10003. Additionally, the SEC maintains a website at www.sec.gov that contains quarterly, annual and current reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC, including the Company.\nWe also routinely post on our website news releases, announcements and other statements about our business and results of operations, some of which may contain information that may be deemed to be material to investors. Therefore, we encourage investors to monitor our website and review the information we post there. The information contained on our website is not part of this Annual Report on Form 10-K and is not incorporated by reference herein.\n12",
  "item7": "ITEM 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nManagement’s discussion and analysis of financial condition and results of operations is a supplement to and should be read in conjunction with the accompanying consolidated financial statements and related notes. This section provides additional information regarding our businesses, current developments, results of operations, cash flows, financial condition, contractual commitments, critical accounting policies, and estimates that require significant judgment and thus have the most significant potential impact on our consolidated financial statements. This discussion and analysis is intended to better allow investors to view the company from management’s perspective.\nThis section provides an analysis of our financial results for the fiscal year ended December 31, 2024 compared to the fiscal year ended December 31, 2023. A discussion of our results of operations and liquidity for the fiscal year ended December 31, 2023 compared to the fiscal year ended December 31, 2022 can be found under Item 7 in our Annual Report on Form 10-K for the fiscal year ended December 31, 2023, filed on February 23, 2024, which is available free of charge on the SEC’s website at www.sec.gov and our Investor Relations website at ir.wbd.com. The information contained on our website is not part of this Annual Report on Form 10-K and is not incorporated by reference herein.\nBUSINESS OVERVIEW\nOn April 8, 2022, Discovery, a global media company that provides content across multiple distribution platforms, including linear, free-to-air, and broadcast television, authenticated GO applications, digital distribution arrangements, content licensing arrangements, and DTC subscription products, completed its Merger with the WarnerMedia Business of AT&T and changed its name from “Discovery, Inc.” to “Warner Bros. Discovery, Inc.” On April 11, 2022, our shares started trading on Nasdaq under the trading symbol WBD. (See Note 3 and Note 4 to the accompanying consolidated financial statements.)\nWarner Bros. Discovery is a leading global media and entertainment company that creates and distributes a differentiated and comprehensive portfolio of content and products across television, film, streaming, interactive gaming, publishing, themed experiences, and consumer products through brands including: Discovery Channel, Max, CNN, DC Studios, TNT Sports, HBO, Food Network, TLC, TBS, Warner Bros. Motion Picture Group, Warner Bros. Television Group, Warner Bros. Games, Adult Swim, Turner Classic Movies, and others. For a discussion of our global portfolio see our business overview set forth in Item 1, “Business” in this Annual Report on Form 10-K.\nIn connection with the Merger, we have announced and taken actions to implement projects to achieve cost synergies for the Company. We finalized the framework supporting our ongoing restructuring and transformation initiatives during the year ended December 31, 2022, which included, among other things, strategic content programming assessments, organization restructuring, facility consolidation activities, and other contract termination costs. At that time, we expected to incur approximately $4.1 - $5.3 billion in pre-tax restructuring charges, of which we have incurred $4.7 billion as of December 31, 2024. Of the total expected pre-tax restructuring charges, we expected total cash expenditures to be $1.0 - $1.5 billion. While our restructuring efforts are ongoing, the Merger-related restructuring program was substantially completed at the end of 2024. During 2023, we initiated a strategic realignment plan associated with our Warner Bros. Pictures Animation group and during 2024, we initiated two additional restructuring initiatives; an organizational and personnel restructuring plan and a restructuring initiative associated with our Warner Bros. Games group.\nAs of December 31, 2024, we classified our operations in three reportable segments: \n•\nStudios\n - Our Studios segment primarily consists of the production and release of feature films for initial exhibition in theaters, production and initial licensing of television programs to our networks/DTC services as well as third parties, distribution of our films and television programs to various third party and internal television and streaming services, distribution through the home entertainment market (physical and digital), related consumer products and themed experience licensing, and interactive gaming.\n33\n•\nNetworks\n - Our Networks segment primarily consists of our domestic and international television networks.\n•\nDTC \n- Our DTC segment primarily consists of our premium pay-TV and streaming services. \nOur segment presentation was aligned with our management structure and the financial information management uses to make decisions about operating matters, such as the allocation of resources and business performance assessments.\nFor further discussion of financial information for our segments and the geographical areas in which we do business, our content development activities, and revenues, see our business overview set forth in Item 1, “Business” and Note 23 to the consolidated financial statements included in Item 8, “Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.\nRESULTS OF OPERATIONS\nForeign Exchange Impacting Comparability\nThe impact of exchange rates on our business is an important factor in understanding period-to-period comparisons of our results. For example, our international revenues are favorably impacted as the U.S. dollar weakens relative to other foreign currencies, and unfavorably impacted as the U.S. dollar strengthens relative to other foreign currencies. We believe the presentation of results on a constant currency basis (“ex-FX”), in addition to results reported in accordance with U.S. GAAP provides useful information about our operating performance because the presentation ex-FX excludes the effects of foreign currency volatility and highlights our core operating results. The presentation of results on a constant currency basis should be considered in addition to, but not a substitute for, measures of financial performance reported in accordance with U.S. GAAP.\nThe ex-FX change represents the percentage change on a period-over-period basis adjusted for foreign currency impacts. The ex-FX change is calculated as the difference between the current year amounts translated at a baseline rate, which is a spot rate for each of our currencies determined early in the fiscal year as part of our forecasting process (the “2024 Baseline Rate”), and the prior year amounts translated at the same 2024 Baseline Rate. In addition, consistent with the assumption of a constant currency environment, our ex-FX results exclude the impact of our foreign currency hedging activities, as well as realized and unrealized foreign currency transaction gains and losses. Results on a constant currency basis, as we present them, may not be comparable to similarly titled measures used by other companies.\n34\nConsolidated Results of Operations – 2024 vs. 2023\nOur consolidated results of operations for 2024 and 2023 were as follows (in millions). \nYear Ended December 31,\n2024\n2023\n% Change\n% Change (ex-FX)\nRevenues:\nDistribution\n$\n19,701 \n$\n20,237 \n(3)\n%\n(1)\n%\nAdvertising\n8,090 \n8,700 \n(7)\n%\n(7)\n%\nContent\n10,297 \n11,203 \n(8)\n%\n(8)\n%\nOther\n1,233 \n1,181 \n4 \n%\n4 \n%\nTotal revenues\n39,321 \n41,321 \n(5)\n%\n(4)\n%\nCosts of revenues, excluding depreciation and amortization\n22,970 \n24,526 \n(6)\n%\n(6)\n%\nSelling, general and administrative\n9,296 \n9,696 \n(4)\n%\n(3)\n%\nDepreciation and amortization\n7,037 \n7,985 \n(12)\n%\n(12)\n%\nRestructuring and other charges\n447 \n585 \n(24)\n%\n(23)\n%\nImpairments and loss on dispositions\n9,603 \n77 \nNM\nNM\nTotal costs and expenses\n49,353 \n42,869 \n15 \n%\n16 \n%\nOperating loss\n(10,032)\n(1,548)\nNM\nNM\nInterest expense, net\n(2,017)\n(2,221)\nGain on extinguishment of debt\n632 \n17 \nLoss from equity investees, net\n(121)\n(82)\nOther income (expense), net\n150 \n(29)\nLoss before income taxes\n(11,388)\n(3,863)\nIncome tax (expense) benefit\n(94)\n784 \nNet loss\n(11,482)\n(3,079)\nNet loss (income) attributable to noncontrolling interests\n129 \n(38)\nNet loss (income) attributable to redeemable noncontrolling interests\n42 \n(9)\nNet loss available to Warner Bros. Discovery, Inc.\n$\n(11,311)\n$\n(3,126)\nNM - Not meaningful\nUnless otherwise indicated, the discussion of percent changes below is on an ex-FX basis. The ex-FX percent changes of line items below operating loss in the table above are not included as the activity is principally in U.S. dollars.\nRevenues\nDistribution revenues are generated from fees charged to network distributors, which include cable, DTH satellite, telecommunications and digital service providers, and DTC subscribers. The largest component of distribution revenue is comprised of linear distribution rights to our networks from cable, DTH satellite, and telecommunication service providers. We have contracts with distributors representing most cable and satellite service providers around the world, including the largest operators in the U.S. and major international distributors. Distribution revenues are largely dependent on the rates negotiated in the agreements, the number of subscribers that receive our networks, the number of platforms covered in the distribution agreement, and the market demand for the content that we provide. From time to time, renewals of multi-year carriage agreements include significant year one market adjustments to reset subscriber rates. In some cases, we have provided distributors launch incentives, in the form of cash payments or free periods, to carry our networks. \nDistribution revenue decreased 1% in 2024, primarily attributable to an 8% decline in Networks domestic linear subscribers and our exit from our regional sports business (“AT&T SportsNets”) in the U.S., which had an unfavorable impact of $225 million for the year, partially offset by a 5% increase in domestic contractual affiliate rates, a 20% increase in DTC subscribers, and an increase in pricing following the launch of Max in Europe in 2024.\n35\nAdvertising revenues are principally generated from the sale of commercial time on linear (television networks and authenticated TVE applications) and digital platforms (DTC subscription services and websites), and sold primarily on a national basis in the U.S. and on a pan-regional or local-language feed basis outside the U.S. Advertising contracts generally have a term of one year or less. Advertising revenue is dependent upon a number of factors, including the number of subscribers to our channels, viewership demographics, the popularity of our content, our ability to sell commercial time over a group of channels, the stage of development of television markets, and the popularity of free-to-air television. Revenue from advertising is subject to seasonality, market-based variations, the mix in sales of commercial time between the upfront and scatter markets, and general economic conditions. Advertising revenue is typically highest in the second and fourth quarters. In some cases, advertising sales are subject to ratings guarantees that require us to provide additional advertising time if the guaranteed audience levels are not achieved. We also generate revenue from the sale of advertising through our digital platforms on a stand-alone basis and as part of advertising packages with our television networks.\nAdvertising revenue decreased 7% in 2024, primarily attributable to audience declines in domestic linear networks of 18%, partially offset by an increase in domestic Max ad-lite subscribers.\nContent revenues are generated from the release of feature films for initial exhibition in theaters, production of programs licensed for initial television/SVOD exhibition, the additional licensing of feature films and television programs to various television, SVOD and other digital markets, distribution of feature films and television programs in the physical and digital home entertainment market, sales of console games and mobile in-game content, sublicensing of sports rights, and licensing of intellectual property such as characters and brands.\nContent revenue decreased 8% in 2024, primarily attributable to a 53% decrease in games revenue due to the strong performance of the 2023 slate, including \nHogwarts Legacy\n, compared to the 2024 slate, and a 4% decrease in theatrical product revenue due to the strong prior year performance of \nBarbie\n, which was released in 2023, partially offset by the sublicensing of Olympic sports rights in Europe in the current year, which had a favorable impact of $576 million in 2024.\nOther revenue primarily consists of studio production services and tours. \nOther revenue increased 4% in 2024, primarily attributable to the opening of Warner Bros. Studio Tour Tokyo in June 2023, partially offset by the timing of services provided to the unconsolidated TNT Sports UK joint venture.\nCosts of Revenues\nOur principal component of costs of revenues is content expense. Content expense includes television/digital series, specials, films, games, and sporting events. Amortization related to both historical cost basis and any fair value adjustments to content arising from business combinations is included in costs of revenues. The costs of producing a content asset and bringing that asset to market consist of production costs, participation costs, and exploitation costs.\nCosts of revenues decreased 6% in 2024, primarily attributable to lower content expense related to the amortization of purchase accounting fair value step-up for content, lower content expense commensurate with lower content revenue at DTC, and our exit from the AT&T SportsNet business, partially offset by the broadcast of the Olympics in Europe in the current year. The exit from the AT&T SportsNet business had a favorable impact to costs of revenues of $277 million for the year. The broadcast of the Olympics in Europe in the current year had an unfavorable impact to costs of revenues of $664 million.\nSelling, General and Administrative\nSelling, general and administrative expenses consist principally of employee costs, marketing costs, research costs, occupancy, and back office support fees.\nSelling, general and administrative expenses decreased 3% in 2024, primarily attributable to lower marketing costs due to lower theatrical and games marketing expenses and the prior year launch of Max in the U.S., partially offset by the continuation of Max launches internationally.\nDepreciation and Amortization\nDepreciation and amortization expense includes depreciation of fixed assets and amortization of finite-lived intangible assets.\nDepreciation and amortization decreased 12% in 2024, primarily attributable to intangible assets acquired during the Merger that are being amortized on an accelerated basis, partially offset by the shortening of the useful lives of certain intangible assets. (See Note 5 to the accompanying consolidated financial statements.)\nRestructuring and Other Charges\nRestructuring and other charges decreased 23% in 2024. Restructuring and other charges primarily includes contract terminations, facility consolidation activities, organizational restructuring, and other charges. (See Note 6 to the accompanying consolidated financial statements.)\n36\nImpairments and Loss on Dispositions\nImpairments and loss on dispositions was a\n \n$9,603 million\n \nand\n \n$77 million loss in 2024 and 2023, respectively. The loss in 2024 was primarily attributable to a $9.1 billion pre-tax, non-cash goodwill impairment charge related to the Networks reporting unit during the second quarter of 2024 (see Note 5 to the accompanying consolidated financial statements) and $411 million right-of-use asset (“ROU asset”) impairment charges primarily related to the Hudson Yards, New York office lease. (See Note 12 to the accompanying consolidated financial statements.) The loss in 2023 was primarily attributable to lease ROU asset impairments and costs associated with our exit from AT&T SportsNets.\nInterest Expense, net\nActual interest expense, net decreased $204 million in 2024, primarily attributable to lower debt during the period. (See Note 11 and Note 13 to the accompanying consolidated financial statements.)\nGain on extinguishment of debt\nDuring 2024, we repaid in full at maturity $40 million of aggregate principal amount outstanding of our floating rate notes due March 2024 and we repurchased or repaid $5,923 million of aggregate principal amount outstanding of our senior notes. (See Note 11 to the accompanying consolidated financial statements.)\nLoss from Equity Investees, net\nActual losses from our equity method investees were $121 million and $82 million in 2024 and 2023, respectively. The losses are attributable to our share of earnings and losses from our equity investees. (See Note 10 to the accompanying consolidated financial statements.)\nOther Income (Expense), net\nOther income (expense), net was $150 million and $(29) million in 2024 and 2023, respectively. The increase\n \nwas primarily attributable to our gain on sale of equity method investments and an increase to the Merger related tax indemnification receivable accrual, partially offset by foreign currency losses. (See Note 18 to the accompanying consolidated financial statements.)\nIncome Tax Expense (Benefit)\nIncome tax expense (benefit) was $94 million and $(784) million, and the Company’s effective tax rate was (1)% and 20% for 2024 and 2023, respectively. In 2024, the Company recorded a non-cash goodwill impairment charge of $9.1 billion, the majority of which was not deductible for tax purposes. (See Note 5 to the accompanying consolidated financial statements.) For the year ended December 31, 2024, the increase in income tax expense compared to the same period in 2023 was primarily attributable to a decrease in pre-tax book loss (excluding the non-cash goodwill impairment charge), an increase in state and local income taxes (including a state deferred tax adjustment recorded in the year ended December 31, 2024 and a one-time favorable release of an unrecognized state tax benefit in 2023 that did not recur in 2024), and a one-time favorable release of an unrecognized U.S. tax benefit in 2023 that did not recur in 2024.\n \n(See Note 16 to the accompanying consolidated financial statements.)\nIncome tax expense for 2024 reflects an effective income tax rate that differs from the federal statutory tax rate primarily attributable to the non-deductible goodwill impairment charge and the effect of foreign operations.\nThe Organisation for Economic Co-operation and Development’s (“OECD”) Pillar Two Global Anti-Base Erosion (“GloBE”) model rules, issued under the OECD Inclusive Framework on Base Erosion and Profit Shifting, introduce a global minimum tax of 15% applicable to multinational enterprise groups with consolidated financial statement revenue in excess of €750 million. Numerous foreign jurisdictions have already enacted tax legislation based on the GloBE rules, with some effective as early as January 1, 2024. As of December 31, 2024, we recognized a nominal income tax expense for Pillar Two GloBE minimum tax. The Company is continuously monitoring the evolving application of this legislation and assessing its potential impact on our future tax liability.\n37\nSegment Results of Operations – 2024 vs. 2023\nThe Company evaluates the operating performance of its operating segments based on financial measures such as revenues and Adjusted EBITDA. Adjusted EBITDA is defined as operating income excluding: \n•\nemployee share-based compensation;\n•\ndepreciation and amortization;\n•\nrestructuring and facility consolidation;\n•\ncertain impairment charges;\n•\ngains and losses on business and asset dispositions;\n•\nthird-party transaction and integration costs;\n•\namortization of purchase accounting fair value step-up for content;\n•\namortization of capitalized interest for content; and\n•\nother items impacting comparability. \nManagement believes that Adjusted EBITDA is an appropriate measure for evaluating the operating performance of the Company’s operating segments because it is the primary measure used by the Company’s chief operating decision maker to assess the operating results and performance of the segments, perform analytical comparisons, identify strategies to improve performance, and allocate resources to each segment. (See Note 23 to the accompanying consolidated financial statements.) \nThe table below presents our Adjusted EBITDA by segment (in millions).\n \nYear Ended December 31,\n \n2024\n2023\n% Change\nStudios\n$\n1,652 \n$\n2,183 \n(24)\n%\nNetworks\n8,149 \n9,063 \n(10)\n%\nDTC\n677 \n103 \nNM\nCorporate\n(1,260)\n(1,242)\n(1)\n%\nInter-segment eliminations \n(186)\n93 \nNM\n38\n Studios Segment \nThe following table presents, for our Studios segment, revenues by type, certain operating expenses, Adjusted EBITDA and a reconciliation of Adjusted EBITDA to operating income (in millions).\n \nYear Ended December 31,\n \n2024\n2023\n% Change\n% Change (ex-FX)\nRevenues:\nDistribution\n$\n8 \n$\n17 \n(53)\n%\n(53)\n%\nAdvertising\n5 \n15 \n(67)\n%\n(67)\n%\nContent\n10,717 \n11,358 \n(6)\n%\n(5)\n%\nOther\n877 \n802 \n9 \n%\n9 \n%\nTotal revenues\n11,607 \n12,192 \n(5)\n%\n(5)\n%\nCosts of revenues, excluding depreciation and amortization\n7,530 \n7,296 \n3 \n%\n3 \n%\nSelling, general and administrative\n2,425 \n2,713 \n(11)\n%\n(11)\n%\nAdjusted EBITDA\n1,652 \n2,183 \n(24)\n%\n(23)\n%\nDepreciation and amortization\n702 \n667 \nEmployee share-based compensation\n(1)\n— \nRestructuring and other charges\n263 \n225 \nTransaction and integration costs \n2 \n7 \nFacility consolidation costs\n1 \n— \nImpairment and amortization of fair value step-up for content\n96 \n995 \nAmortization of capitalized interest for content\n46 \n46 \nInter-segment eliminations\n— \n31 \nImpairments and loss on dispositions\n14 \n1 \nOperating income\n$\n529 \n$\n211 \nUnless otherwise indicated, the discussion of percent changes below is on an ex-FX basis. The Studios discussion below also includes intra-segment revenue and expense between product lines, which represented less than 3% of total revenues and operating expenses for this segment for the year ended December 31, 2024. Intra-segment revenue and expense are eliminated at the Studios segment level.\nFluctuations in results for our Studios segment may occur due to various factors, including (but not limited to) the timing and number of new film releases each quarter, the timing of marketing expenses recognized relative to (i.e., prior to) a film’s release, and the mix of content distributed each period.\nRevenues\nContent revenue decreased\n \n5% in 2024, primarily attributable to a 53% decrease in games revenue, and a 4% decrease in theatrical product revenue, partially offset by a 9% increase in television product revenue.\n•\nThe decrease in games revenue was primarily attributable to the strong performance of the 2023 slate, including \nHogwarts Legacy\n, compared to the 2024 slate.\n•\nThe decrease in theatrical product revenue was attributable to lower film rental revenue and intra-segment licensing revenue, partially offset by higher home entertainment revenue. Film rental revenue decreased due to the strong prior year performance of \nBarbie\n, which was released in 2023, partially offset by higher carryover releases from 2023 compared to 2022. Home entertainment revenue increased due to the performance of \nDune: Part Two,\n \nGodzilla x Kong: The New Empire, Wonka, Aquaman 2, \nand\n Beetlejuice Beetlejuice\n and higher catalog sales.\n•\nThe increase in television product revenue was attributable to higher intercompany content sales and higher initial telecast revenue due to the impact of the WGA and SAG-AFTRA strikes in the prior year, partially offset by lower third-party content sales.\nOther revenue increased\n \n9% in 2024, primarily attributable to the opening of Warner Bros. Studio Tour Tokyo in June 2023.\nCosts of Revenues\nCosts of revenues increased\n \n3% in 2024, primarily attributable to a 4% increase in theatrical product content expense due to product mix and higher development costs, and a 1% increase in games content expense due to impairments of $384 million, partially offset by lower intra-segment licensing costs. Television product content expense was flat in 2024, as higher content expense commensurate with higher revenues was offset by favorable product mix and lower development costs.\n39\nSelling, General and Administrative\nSelling, general and administrative expenses decreased 11% in 2024, primarily attributable to lower theatrical marketing expenses due to fewer new releases and lower games marketing expenses.\nAdjusted EBITDA\nAdjusted EBITDA decreased 23% in 2024.\nNetworks Segment \nThe table below presents, for our Networks segment, revenues by type, certain operating expenses, Adjusted EBITDA and a reconciliation of Adjusted EBITDA to operating (loss) income (in millions).\n \nYear Ended December 31,\n \n2024\n2023\n% Change\n% Change (ex-FX)\nRevenues:\nDistribution\n$\n10,680 \n$\n11,521 \n(7)\n%\n(6)\n%\nAdvertising\n7,306 \n8,342 \n(12)\n%\n(12)\n%\nContent\n1,848 \n1,005 \n84 \n%\n83 \n%\nOther\n341 \n376 \n(9)\n%\n(10)\n%\nTotal revenues\n20,175 \n21,244 \n(5)\n%\n(4)\n%\nCosts of revenues, excluding depreciation and amortization\n9,238 \n9,342 \n(1)\n%\n— \n%\nSelling, general and administrative\n2,788 \n2,839 \n(2)\n%\n(1)\n%\nAdjusted EBITDA\n8,149 \n9,063 \n(10)\n%\n(10)\n%\nDepreciation and amortization\n4,172 \n4,961 \nRestructuring and other charges\n85 \n201 \nTransaction and integration costs\n2 \n3 \nImpairment and amortization of fair value step-up for content\n495 \n473 \nInter-segment eliminations\n— \n90 \nImpairments and loss on dispositions\n9,154 \n13 \nOperating (loss) income\n$\n(5,759)\n$\n3,322 \nUnless otherwise indicated, the discussion of percent changes below is on an ex-FX basis.\nRevenues\nDistribution revenue decreased 6% in 2024, primarily attributable to an 8% decline in domestic linear subscribers for the year, partially offset by a 5% increase in domestic contractual affiliate rates. In addition, the exit from the AT&T SportsNet business had an unfavorable impact of $225 million for the year. Declines in linear subscribers are expected to continue.\nAdvertising revenue decreased 12% in 2024, primarily attributable to audience declines in domestic networks of 18%\n \nfor the year, and continued softness in the U.S. linear advertising market.\nContent revenue increased by 83% in 2024, primarily attributable to\n \nthe sublicensing of Olympic sports rights in Europe in the current year, which had a favorable impact of $576 million, and timing of third-party licensing deals.\nOther revenue decreased\n \n10% in 2024, primarily attributable to the timing of services provided to the unconsolidated TNT Sports UK joint venture.\nCosts of Revenues\nCosts of revenues was flat in 2024. Sports-related content expense increased in 2024 primarily due to the broadcast of the Olympics in Europe in the current year and the acquisition of new sports rights, partially offset by our exit from the AT&T SportsNet business and the allocation of U.S. sports costs to DTC. The increase in sports-related content expense was further offset by lower entertainment content expense in 2024. Our exit from the AT&T SportsNet business had a favorable impact to costs of revenues of $277 million and the broadcast of the Olympics in Europe had an unfavorable impact to costs of revenues of $664 million in the current year.\nSelling, General and Administrative\nSelling, general and administrative expenses decreased 1% in 2024.\n40\nAdjusted EBITDA\nAdjusted EBITDA decreased 10% in 2024.\n DTC Segment \nThe following table presents, for our DTC segment, revenues by type, certain operating expenses, Adjusted EBITDA and a reconciliation of Adjusted EBITDA to operating loss (in millions).\n \nYear Ended December 31,\n \n2024\n2023\n% Change\n% Change (ex-FX)\nRevenues:\nDistribution\n$\n9,022 \n$\n8,703 \n4 \n%\n5 \n%\nAdvertising\n855 \n548 \n56 \n%\n57 \n%\nContent\n428 \n886 \n(52)\n%\n(51)\n%\nOther\n8 \n17 \n(53)\n%\n(50)\n%\nTotal revenues\n10,313 \n10,154 \n2 \n%\n2 \n%\nCosts of revenues, excluding depreciation and amortization\n7,459 \n7,623 \n(2)\n%\n(2)\n%\nSelling, general and administrative\n2,177 \n2,428 \n(10)\n%\n(9)\n%\nAdjusted EBITDA\n677 \n103 \nNM\nNM\nDepreciation and amortization\n1,831 \n2,063 \nRestructuring and other charges\n3 \n66 \nTransaction and integration costs \n(1)\n4 \nImpairment and amortization of fair value step-up for content\n282 \n460 \nInter-segment eliminations\n— \n72 \nImpairments and loss on dispositions\n47 \n3 \nOperating loss\n$\n(1,485)\n$\n(2,565)\nUnless otherwise indicated, the discussion of percent changes below is on an ex-FX basis.\nRevenues\nSubscriber information (as defined under Item 1. “Business”) consisted of the following (in millions).\nDecember 31, 2024\nDecember 31, 2023\n% Change\nTotal Domestic subscribers\n57.1 \n52.0 \n10 \n%\nTotal International subscribers\n59.8 \n45.6 \n31 \n%\nTotal DTC subscribers\n116.9 \n97.7 \n20 \n%\nDistribution revenue increased\n \n5% in 2024, primarily attributable to a\n \n20%\n \nincrease in subscribers and an increase in pricing following the launch of Max in Europe and Latin America in 2024, partially offset by continued domestic linear wholesale subscriber declines.\nAdvertising revenue increased 57% in 2024, primarily attributable to an increase in domestic ad-lite subscribers.\n41\nGlobal ARPU consisted of the following.\nYear Ended December 31,\n2024\n2023\n% Change (ex-FX)\nDomestic ARPU\n$\n11.89 \n$\n11.20 \n6 \n%\nInternational ARPU\n$\n3.85 \n$\n3.85 \n4 \n%\nGlobal ARPU\n1\n$\n7.76 \n$\n7.78 \n1 \n%\nGlobal ARPU increased 1% in 2024, primarily attributable to subscriber growth of the ad-lite tier domestically, higher pricing, and a continuing subscriber mix shift from linear wholesale, partially offset by growth in lower ARPU international markets.\nContent revenue decreased\n \n51%\n \nin 2024, primarily attributable to fewer third-party licensing deals.\nCosts of Revenues\nCost of revenues decreased\n \n2% in 2024, primarily attributable to lower content expense commensurate with lower content revenue, partially offset by the allocation of U.S. sports from the Networks segment.\nSelling, General, and Administrative Expenses\nSelling, general and administrative expenses decreased\n \n9% in 2024, primarily attributable to lower marketing costs due to the launch of Max in 2023 in the U.S., partially offset by higher overhead expenses and the continuation of Max launches internationally.\nAdjusted EBITDA\nAdjusted EBITDA increased\n \n$574 million\n \nin 2024. The broadcast of the Olympics in Europe negatively impacted Adjusted EBITDA by $33 million.\nCorporate\nThe following table presents our Adjusted EBITDA and a reconciliation of Adjusted EBITDA to operating loss (in millions):\n \nYear Ended December 31,\n \n \n2024\n2023\n% Change\n% Change (ex-FX)\nAdjusted EBITDA\n$\n(1,260)\n$\n(1,242)\n(1)\n%\n(3)\n%\nEmployee share-based compensation\n547 \n488 \nDepreciation and amortization\n332 \n294 \nRestructuring and other charges\n96 \n95 \nTransaction and integration costs\n239 \n148 \nImpairments and loss on dispositions\n388 \n60 \nFacility consolidation costs\n3 \n32 \nImpairment and amortization of fair value step-up for content\n2 \n(6)\nInter-segment eliminations\n— \n(193)\nOperating loss\n$\n(2,867)\n$\n(2,160)\nCorporate operations primarily consist of executive management and administrative support services, which are recorded in selling, general and administrative expense, as well as substantially all of our share-based compensation and third-party transaction and integration costs. \nAdjusted EBITDA\n \ndecreased 3% in 2024, primarily attributable to higher securitization expenses and overhead expenses, partially offset by lower facility costs due to office consolidations and closures and lower personnel costs.\n1\nARPU:\n The Company defines DTC Average Revenue Per User (“ARPU”) as total subscription revenue plus net advertising revenue for the period divided by the daily average number of paying subscribers for the period. Where daily values are not available, the sum of beginning of period and end of period divided by two is used.\nExcluded from the ARPU calculation are: (i) Revenue and subscribers for DTC products, other than discovery+, HBO, HBO Max, Max, a Premium Sports Product, and independently-branded, regional products (currently consisting of TVN/Player and BluTV), that may be offered by us or by certain joint venture partners or affiliated parties from time to time; (ii) A limited amount of international discovery+ revenue and subscribers that are part of non-strategic partnerships or short-term arrangements as may be identified by the Company from time to time; (iii) Cinemax, Max/HBO hotel and bulk institution (i.e., subscribers billed on a bulk basis), and international basic HBO revenue and subscribers; and (iv) Users on free trials who convert to a subscription for which we have recognized subscription revenue within the first seven days of the calendar month immediately following the month in which their free trial expires.\n42\nInter-segment Eliminations\nThe following table presents our inter-segment eliminations by revenue and expense, Adjusted EBITDA and a reconciliation of Adjusted EBITDA to operating loss (in millions): \n \nYear Ended December 31,\n \n2024\n2023\nInter-segment revenue eliminations\n$\n(2,782)\n$\n(2,269)\nInter-segment expense eliminations\n(2,596)\n(2,362)\nAdjusted EBITDA\n(186)\n93 \nRestructuring and other charges\n— \n(2)\nImpairment and amortization of fair value step-up for content\n264 \n451 \nOperating loss\n$\n(450)\n$\n(356)\nInter-segment revenue and expense eliminations primarily represent inter-segment content transactions and marketing and promotion activity between reportable segments. In our current segment structure, in certain instances, production and distribution activities are in different segments. Inter-segment content transactions are generally presented at market value (i.e., the segment producing and/or licensing the content reports revenue and profit from inter-segment transactions in a manner similar to the reporting of third-party transactions, and the required eliminations are reported on the separate “Eliminations” line when presenting our summary of segment results). Generally, timing of revenue recognition is similar to the reporting of third-party transactions. The segment distributing the content, e.g., via our DTC or linear services, capitalizes the cost of inter-segment content transactions, including “mark-ups” and amortizes the costs over the shorter of the license term, if applicable, or the expected period of use. The content amortization expense related to the inter-segment profit is also eliminated on the separate “Eliminations” line when presenting our summary of segment results.\nLIQUIDITY AND CAPITAL RESOURCES\nLiquidity\nSources of Cash\nHistorically, we have generated a significant amount of cash from operations. During 2024, we funded our working capital needs primarily through cash flows from operations. As of December 31, 2024, we had $5.3 billion of cash and cash equivalents on hand. We are a well-known seasoned issuer and have the ability to conduct registered offerings of securities, including debt securities, common stock and preferred stock, on short notice, subject to market conditions. Access to sufficient capital from the public market is not assured. We have a $6.0 billion revolving credit facility and commercial paper program described below. We also participate in a revolving receivables program and an accounts receivable factoring program described below.\n•\nDebt\nSenior Notes\nDuring the year ended December 31, 2024, we issued €650 million of 4.302% fixed rate senior notes due January 2030 and €850 million of 4.693% fixed rate senior notes due May 2033. After December 2029 and February 2033, respectively, the senior notes are redeemable at par plus accrued and unpaid interest. \nRevolving Credit Facility and Commercial Paper\nWe have a multicurrency revolving credit agreement (the “Credit Agreement”) and have the capacity to borrow up to $6.0 billion under the Credit Agreement (the “Credit Facility”). We may also request additional commitments up to $1.0 billion from the lenders upon the satisfaction of certain conditions. The Credit Agreement contains customary representations and warranties as well as affirmative and negative covenants. As of December 31, 2024, we were in compliance with all covenants and there were no events of default under the Credit Agreement. \nAdditionally, our commercial paper program is supported by the Credit Facility. Under the commercial paper program, we may issue up to $1.0 billion. Borrowing capacity under the Credit Facility is effectively reduced by any outstanding borrowings under the commercial paper program.\nDuring the year ended December 31, 2024, we borrowed and repaid $14,203 million under our Credit Facility and commercial paper program. As of December 31, 2024 and 2023, we had no outstanding borrowings under the Credit Facility or the commercial paper program. \n43\nTerm Loans\nIn January 2025, we entered into a new $1,500 million 364-day senior unsecured term loan credit facility. The proceeds were used to the fund the redemption of $1,500 million aggregate principal amount of our 6.412% senior notes due 2026.\n•\nRevolving Receivables Program\nWe have a revolving agreement to transfer up to $5,200 million of certain receivables through our bankruptcy-remote subsidiary, Warner Bros. Discovery Receivables Funding, LLC, to various financial institutions on a recurring basis in exchange for cash equal to the gross receivables transferred. We service the sold receivables for the financial institution for a fee and pay fees to the financial institution in connection with this revolving agreement. As customers pay their balances, our available capacity under this revolving agreement increases and typically we transfer additional receivables into the program. In some cases, we may have collections that have not yet been remitted to the bank, resulting in a liability. The outstanding portfolio of receivables derecognized from our consolidated balance sheets was $4,637 million as of December 31, 2024.\n•\nAccounts Receivable Factoring\nWe have a factoring agreement to sell certain of our non-U.S. trade accounts receivable on a limited recourse basis to a third-party financial institution. For the year ended December 31, 2024, total trade accounts receivable sold under our factoring arrangement was $313 million.\n•\nInvestments\nIn May 2024, we sold our 50% interest in All3Media, an equity method investment, for proceeds of $324 million.\nIn October 2024, we sold our minority interests in Formula E, which were recorded as an equity method investment and an investment without readily determinable fair value, to Liberty Global, a related party, for total proceeds of $217 million.\n•\nDerivatives\nWe received investing proceeds of $136 million during the year ended December 31, 2024 from the unwind and settlement of derivative instruments. (See Note 13 to the accompanying consolidated financial statements.)\nUses of Cash\nOur primary uses of cash include the creation and acquisition of new content, business acquisitions, income taxes, personnel costs, costs to develop and market our enhanced streaming service Max, principal and interest payments on our outstanding senior notes, funding for various equity method and other investments, and repurchases of our capital stock.\n•\nContent Acquisition\nWe plan to continue to invest significantly in the creation and acquisition of new content, as well as certain sports rights. Additional information regarding contractual commitments to acquire content is set forth in “Material Cash Requirements from Known Contractual and Other Obligations” in Item 7, “Management’s Discussion and Analysis of Financial Condition and Results of Operations.”\n•\nDebt\nFloating Rate Notes\nDuring the year ended December 31, 2024, we repaid $40 million of aggregate principal amount of our floating rate notes due March 2024. \nSenior Notes\nDuring the year ended December 31, 2024, we repurchased or repaid $5,923 million of aggregate principal amount outstanding of our senior notes. In addition, we have $2,748 million of senior notes coming due in 2025.\nIn February 2025, we redeemed in full $1,500 million aggregate principal amount of our 6.412% senior notes due 2026. The redemption was funded with the proceeds of borrowings pursuant to the new $1,500 million 364-day senior unsecured term loan credit facility entered into in January 2025.\nWe may from time to time seek to prepay, retire or purchase our other outstanding indebtedness through prepayments, redemptions, open market purchases, privately negotiated transactions, tender offers or otherwise. Any such repurchases or exchanges will be dependent upon several factors, including our liquidity requirements, contractual restrictions, general market conditions, as well as applicable regulatory, legal and accounting factors. Whether or not we repurchase or exchange any debt and the size and timing of any such repurchases or exchanges will be determined at our discretion.\n44\n•\nCapital Expenditures\nWe effected capital expenditures of $948 million in 2024, including amounts capitalized to support Max. In addition, we expect to continue to\n \nincur significant costs to develop and market Max.\n•\nInvestments and Business Combinations\nOur uses of cash have included investments in equity method investments and equity investments without readily determinable fair value. (See Note 10 to the accompanying consolidated financial statements.) We also provide funding to our investees from time to time. We contributed $109 million and $112 million in 2024 and 2023, respectively, for investments in and advances to our investees.\n•\nRedeemable Noncontrolling Interest and Noncontrolling Interest\nWe had redeemable equity balances of $109 million at December 31, 2024, which may require the use of cash in the event holders of noncontrolling interests put their interests to us. Distributions to noncontrolling interests and redeemable noncontrolling interests totaled $193 million and $301 million in 2024 and 2023, respectively.\n•\nCommon Stock Repurchases\nHistorically, we have funded our stock repurchases through a combination of cash on hand, cash generated by operations and the issuance of debt. In February 2020, our board of directors authorized additional stock repurchases of up to $2 billion upon completion of our existing $1 billion authorization announced in May 2019. Under the new stock repurchase authorization, management is authorized to purchase shares from time to time through open market purchases at prevailing prices or privately negotiated purchases subject to market conditions and other factors. (See Note 3 to the accompanying consolidated financial statements.) There were no common stock repurchases during 2024 or 2023.\n•\nIncome Taxes and Interest\nWe expect to continue to make payments for income taxes and interest on our outstanding senior notes.\n \nDuring 2024 and 2023, we made cash payments of $1,113 million and $1,440 million for income taxes and $1,996 million and $2,237 million for interest on our outstanding debt, respectively.\nCash Flows\nThe following table presents changes in cash and cash equivalents (in millions).\nYear Ended December 31,\n2024\n2023\nCash, cash equivalents, and restricted cash, beginning of period\n$\n4,319 \n$\n3,930 \nCash provided by operating activities\n5,375 \n7,477 \nCash used in investing activities\n(349)\n(1,259)\nCash used in financing activities\n(3,749)\n(5,837)\nEffect of exchange rate changes on cash, cash equivalents, and restricted cash\n(180)\n8 \nNet change in cash, cash equivalents, and restricted cash\n1,097 \n389 \nCash, cash equivalents, and restricted cash, end of period\n$\n5,416 \n$\n4,319 \nOperating Activities\nCash provided by operating activities was $5,375 million and $7,477 million in 2024 and 2023, respectively. The decrease in cash provided by operating activities was primarily attributable to a decrease in net income excluding non-cash items. Cash flow for the year ended December 31, 2023 was also positively impacted by the WGA and SAG-AFTRA strikes.\nInvesting Activities\nCash used in investing activities was $349 million and $1,259 million in 2024 and 2023, respectively. The decrease in cash used in investing activities was primarily attributable to higher proceeds from the sale of investments and fewer purchases of property and equipment during the year ended December 31, 2024.\nFinancing Activities\nCash used in financing activities was $3,749 million and $5,837 million in 2024 and 2023, respectively. The decrease in cash used in financing activities was primarily attributable to lower net debt activity and lower distributions to noncontrolling interests and redeemable noncontrolling interests during the year ended December 31, 2024.\n45\nCapital Resources\nAs of December 31, 2024, capital resources were comprised of the following (in millions).\n \nDecember 31, 2024\n \nTotal\nCapacity\nOutstanding\nIndebtedness\nUnused\nCapacity\nCash and cash equivalents\n$\n5,312 \n$\n— \n$\n5,312 \nRevolving credit facility and commercial paper program\n6,000 \n— \n6,000 \nSenior notes \n(a)\n39,527 \n39,527 \n— \nTotal\n$\n50,839 \n$\n39,527 \n$\n11,312 \n(a) \nInterest on senior notes is paid annually, semi-annually, or quarterly. Our senior notes outstanding as of December 31, 2024 had interest rates that ranged from 1.90% to 8.30% and will mature between 2025 and 2062.\nWe expect that our cash balance, cash generated from operations, and availability under the Credit Agreement will be sufficient to fund our cash needs for both the short-term and the long-term. Our borrowing costs and access to capital markets can be affected by short and long-term debt ratings assigned by independent rating agencies which are based, in part, on our performance as measured by credit metrics such as interest coverage and leverage ratios. Credit rating agencies may continue to review and adjust our ratings or outlook. For example, in 2024, S&P and Moody’s revised our ratings outlook from stable to negative in part due to declines in our linear business, including as a result of the weak operating environment for linear networks, and our leverage ratio.\nThe 2017 Tax Cuts and Jobs Act features a participation exemption regime with current taxation of certain foreign income and imposed a mandatory repatriation toll tax on unremitted foreign earnings. Notwithstanding the U.S. taxation of these amounts, we intend to continue to reinvest some of these funds outside of the U.S. Our current plans do not demonstrate a need to repatriate them to the U.S. However, if these funds were to be needed in the U.S., we would be required to accrue and pay non-U.S. taxes to repatriate them. The determination of the amount of unrecognized deferred income tax liability with respect to these undistributed foreign earnings is not practicable.\nMATERIAL CASH REQUIREMENTS FROM KNOWN CONTRACTUAL AND OTHER OBLIGATIONS\nAs of December 31, 2024, our significant contractual and other obligations were as follows (in millions).\nTotal\nShort-term\nLong-term\nLong-term debt:\nPrincipal payments\n$\n39,527 \n$\n2,749 \n$\n36,778 \nInterest payments\n27,336 \n1,792 \n25,544 \nPurchase obligations:\nContent\n21,530 \n5,956 \n15,574 \nOther\n2,911 \n1,119 \n1,792 \nFinance lease obligations\n535 \n130 \n405 \nOperating lease obligations\n3,902 \n432 \n3,470 \nPension and other employee obligations\n1,422 \n494 \n928 \nTotal\n$\n97,163 \n$\n12,672 \n$\n84,491 \nLong-term Debt\nPrincipal payments on long-term debt reflect the repayment of our outstanding senior notes, at face value, assuming repayment will occur upon maturity. Interest payments on our outstanding senior notes are projected based on their contractual interest rates and maturity dates.\nAdditionally, we have a multicurrency revolving Credit Agreement and have the capacity to borrow up to $6.0 billion under the Credit Facility. We may also request additional commitments up to $1.0 billion from the lenders upon the satisfaction of certain conditions. Additionally, our commercial paper program is supported by the Credit Facility. Under the commercial paper program, we may issue up to $1.0 billion. Borrowing capacity under the Credit Facility is effectively reduced by any outstanding borrowings under the commercial paper program. As of December 31, 2024, we had no outstanding borrowings under the Credit Facility or the commercial paper program. (See Note 11 to the accompanying consolidated financial statements.)\n46\nPurchase Obligations\nContent purchase obligations include commitments associated with third-party producers and sports associations for content that airs on our television networks and DTC services. Production and licensing contracts generally require the purchase of a specified number of episodes and payments during production or over the term of a license, and include both programs that have been delivered and are available for airing and programs that have not yet been produced or sporting events that have not yet taken place. If the content is ultimately never produced, our commitments expire without obligation. We expect to enter into additional production contracts and content licenses to meet our future content needs.\nOther purchase obligations include agreements with certain vendors and suppliers for the purchase of goods and services whereby the underlying agreements are enforceable, legally binding and specify all significant terms. Significant purchase obligations include transmission services, television rating services, marketing commitments and research, equipment purchases, and information technology and other services. Some of these contracts do not require the purchase of fixed or minimum quantities and generally may be terminated with a 30-day to 60-day advance notice without penalty, and are not included in the table above past the 30-day to 60-day advance notice period. Other purchase obligations also include future funding commitments to equity method investees. Although the Company had funding commitments to equity method investees as of December 31, 2024, the Company may also provide uncommitted additional funding to its equity method investments in the future. (See Note 10 to the accompanying consolidated financial statements.)\nContent and other purchase obligations presented above exclude liabilities recognized on our consolidated balance sheets.\nFinance Lease Obligations\nWe acquire satellite transponders and other equipment through multi-year finance lease arrangements. Principal payments on finance lease obligations reflect amounts due under our finance lease agreements. Interest payments on our outstanding finance lease obligations are based on the stated or implied rate in our finance lease agreements. (See Note 12 to the accompanying consolidated financial statements.)\nOperating Lease Obligations\nWe obtain office space and equipment under multi-year lease arrangements. Most operating leases are not cancelable prior to their expiration. Payments for operating leases represent the amounts due under the agreements assuming the agreements are not canceled prior to their expiration. (See Note 12 to the accompanying consolidated financial statements.)\nPension and Other Employee Obligations\nThe Company participates in and/or sponsors a qualified defined benefit pension plan that covers certain U.S. based employees and several U.S. and non-U.S. nonqualified defined benefit pension plans that are noncontributory (“Pension Plans”). The Company’s Pension Plans consist of both funded and unfunded plans. (See Note 17 to the accompanying consolidated financial statements.)\nContractual commitments include payments to meet minimum funding requirements of our Pension Plans in 2025 and estimated benefit payments. Benefit payments have been estimated over a ten-year period. While benefit payments under the Pension Plans are expected to continue beyond 2034, we believe it is not practicable to estimate payments beyond this period.\nOther employee obligations are primarily related to employment agreements with creative talent for certain broadcast networks.\nWe are unable to reasonably predict the ultimate amount of any payments due to cash-settled share-based compensation awards. As of December 31, 2024, the current portion of the liability for cash-settled share-based compensation awards was $27 million.\nUnrecognized Tax Benefits\nAlthough we can reasonably estimate the total amount of unrecognized tax benefits related to certain of the Company’s uncertain tax positions that may decrease over the next twelve months, we are unable to reasonably predict the ultimate amount and timing of cash settlement with the respective taxing authorities.\n47\nSix Flags Guarantee\nIn connection with the WarnerMedia Business’ former investment in the Six Flags (as defined below) theme parks located in Georgia and Texas (collectively, the “Parks”), in 1997, certain subsidiaries of the Company agreed to guarantee (the “Six Flags Guarantee”) certain obligations of the partnerships that hold the Parks (the “Partnerships”) for the benefit of the limited partners in such Partnerships, including annual payments made to the Parks or to the limited partners and additional obligations at the end of the respective terms for the Partnerships in 2027 and 2028 (the “Guaranteed Obligations”). Six Flags Entertainment Corporation (formerly known as Six Flags, Inc. and Premier Parks Inc.) (“Six Flags”), which has the controlling interest in the Parks, has agreed, pursuant to a subordinated indemnity agreement (the “Subordinated Indemnity Agreement”), to guarantee the performance of the Guaranteed Obligations when due and to indemnify the Company, among others, if the Six Flags Guarantee is called upon. If Six Flags defaults on its indemnification obligations, the Company has the right to acquire control of the managing partner of the Parks. Six Flags’ obligations to the Company are further secured by its interest in all limited partnership units held by Six Flags.\nIn December 2024, Six Flags provided notice of its exercise of the option related to the theme parks located in Georgia that requires the redemption of all the limited partnership units that Six Flags does not then own in the Georgia Partnership in January 2027. Pursuant to the exercise of the option, all of such outstanding limited partnership interests will be redeemed, and Six Flags will also acquire certain related entity general partnership and managing member interests.\nBased on the Company’s evaluation of the current facts and circumstances surrounding the Guaranteed Obligations and the Subordinated Indemnity Agreement, it is unable to predict the loss, if any, that may be incurred under the Guaranteed Obligations, and no liability for the arrangements has been recognized as of December 31, 2024. Because of the specific circumstances surrounding the arrangements and the fact that no active or observable market exists for this type of financial guarantee, the Company is unable to determine a current fair value for the Guaranteed Obligations and related Subordinated Indemnity Agreement. The aggregate gross undiscounted estimated future cash flow requirements covered by the Six Flags Guarantee over the remaining term (through 2028) are $589 million. To date, no payments have been made by the Company pursuant to the Six Flags Guarantee.\nOther Contingent Commitments\nOther contingent commitments primarily include contingent payments for post-production term advance obligations on a certain co-financing arrangement, as well as operating lease commitment guarantees, letters of credit, bank guarantees, and surety bonds, which generally support performance and payments for a wide range of global contingent and firm obligations, including insurance, litigation appeals, real estate leases, and other operational needs. Our other contingent commitments at December 31, 2024 were immaterial.\nPut Rights\nWe have granted put rights to certain consolidated subsidiaries, but we are unable to reasonably predict the ultimate amount or timing of any payment. We recorded the carrying value of the noncontrolling interest in the equity associated with the put rights as a component of redeemable noncontrolling interest in the amount of $109 million. (See Note 19 to the accompanying consolidated financial statements.)\nNoncontrolling Interest\nThe Food Network and Cooking Channel are operated and organized under the terms of the TV Food Network Partnership (the “Partnership”). We hold interests in the Partnership, along with another noncontrolling owner. The Partnership agreement specifies a dissolution date of December 31, 2025. If the term of the Partnership is not extended prior to that date, the Partnership agreement permits us, as holder of 80% of the applicable votes, to reconstitute the Partnership and continue its business. If for some reason the Partnership is not continued, it will be required to limit its activities to winding up, settling debts, liquidating assets and distributing proceeds to the partners in proportion to their partnership interests.\nSummarized Guarantor Financial Information\nBasis of Presentation\nAs of December 31, 2024, the Company has outstanding senior notes issued by Discovery Communications, LLC (“DCL”), which are guaranteed by the Company, Scripps Networks Interactive, Inc. (“Scripps Networks”), and WarnerMedia Holdings, Inc. (“WMH”); senior notes issued by WMH, which are guaranteed by the Company, Scripps Networks, and DCL; senior notes issued by the legacy WarnerMedia Business (not guaranteed); and senior notes issued by Scripps Networks (not guaranteed). (See Note 11 to the accompanying consolidated financial statements.) DCL, Scripps Networks, and WMH are wholly owned by the Company.\n48\nThe tables below present the summarized financial information as combined for Warner Bros. Discovery, Inc. (the “Parent”), Scripps Networks, DCL, and WMH (collectively, the “Obligors”). All guarantees of DCL and WMH’s senior notes (the “Note Guarantees”) are full and unconditional, joint and several and unsecured, and cover all payment obligations arising under the senior notes.\nNote Guarantees issued by Scripps Networks, DCL or WMH, or any subsidiary of the Parent that in the future issues a Note Guarantee (each, a “Subsidiary Guarantor”) may be released and discharged (i) concurrently with any direct or indirect sale or disposition of such Subsidiary Guarantor or any interest therein, (ii) at any time that such Subsidiary Guarantor is released from all of its obligations under its guarantee of payment, (iii) upon the merger or consolidation of any Subsidiary Guarantor with and into DCL, WMH or the Parent or another Subsidiary Guarantor, as applicable, or upon the liquidation of such Subsidiary Guarantor and (iv) other customary events constituting a discharge of the Obligors’ obligations.\nSummarized Financial Information\nThe Company has included the accompanying summarized combined financial information of the Obligors after the elimination of intercompany transactions and balances among the Obligors and the elimination of equity in earnings from and investments in any subsidiary of the Parent that is a non-guarantor (in millions).\nDecember 31, 2024\nCurrent assets\n$\n2,194 \nNon-guarantor intercompany trade receivables, net\n404 \nNoncurrent assets\n4,077 \nCurrent liabilities\n3,948 \nNoncurrent liabilities\n37,118 \nYear Ended December 31, 2024\nRevenues\n$\n1,916 \nOperating loss\n(245)\nNet loss\n(1,080)\nNet loss available to Warner Bros. Discovery, Inc.\n(1,037)\nAdditional information regarding the changes in our outstanding indebtedness and the significant terms and provisions of our revolving credit facility and outstanding indebtedness is discussed in Note 11 to the accompanying consolidated financial statements included in Item 8, “Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.\nRELATED PARTY TRANSACTIONS\nIn the ordinary course of business, we enter into transactions with related parties, primarily the Liberty Entities and our equity method investees. Information regarding transactions and amounts with related parties is discussed in Note 21 to the accompanying consolidated financial statements included in Item 8, “Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.\nNEW ACCOUNTING AND REPORTING PRONOUNCEMENTS\nWe adopted certain accounting and reporting standards during 2024. Information regarding our adoption of new accounting and reporting standards is discussed in Note 2 to the accompanying consolidated financial statements included in Item 8, “Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.\nCRITICAL ACCOUNTING ESTIMATES\nOur consolidated financial statements are prepared in accordance with U.S. GAAP, which requires management to make estimates, judgments and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosure of contingent assets and liabilities. \n49\nOn an ongoing basis, we evaluate our estimates and assumptions, including those related to unrecognized tax benefits, goodwill and intangible assets, content rights, consolidation and revenue recognition. We base our estimates on historical experience, current developments and on various other assumptions that we believe to be reasonable under these circumstances, the results of which form the basis for making judgments about carrying values of assets and liabilities that cannot readily be determined from other sources. There can be no assurance that actual results will not differ from those estimates. \nManagement considers an accounting estimate to be critical if it required assumptions to be made that were uncertain at the time the estimate was made and changes in the estimate or different estimates could have a material effect on our results of operations. \nThe development and selection of these critical accounting estimates have been determined by management and the related disclosures have been reviewed with the Audit Committee of the board of directors of the Company. We believe the following accounting estimates are critical to our business operations and the understanding of our results of operations and involve the more significant judgments and estimates used in the preparation of our consolidated financial statements.\nUncertain Tax Positions\nWe are subject to income taxes in numerous U.S. and foreign jurisdictions. From time to time, we engage in transactions or take filing positions in which the tax consequences may be uncertain and may recognize tax liabilities based on estimates of whether additional taxes and interest will be due. We establish a reserve for unrecognized tax benefits unless we determine that such positions are more likely than not to be sustained upon examination based on their technical merits, including the resolution of any appeals or litigation processes. We include interest and where appropriate, potential penalties, as a component of income tax expense on the consolidated statements of operations. This assessment relies on estimates and assumptions and may involve a series of complex judgments about future events including the status and results of income tax audits with the relevant tax authorities. Significant judgment is exercised in evaluating all relevant information, the technical merits of the tax positions, and the accurate measurement of unrecognized tax benefits when determining the amount of reserve and whether positions taken on our tax returns are more likely than not to be sustained. This also involves the use of significant estimates and assumptions with respect to the potential outcome of positions taken on tax returns that may be reviewed by tax authorities. \nGoodwill and Intangible Assets\nGoodwill is allocated to our reporting units, which are our operating segments or one level below our operating segments (the component level). Reporting units are determined by the discrete financial information available for the component and whether it is regularly reviewed by segment management. Components are aggregated into a single reporting unit if they share similar economic characteristics. Our reporting units are Studios, Networks, and DTC.\nWe evaluate our goodwill for impairment annually as of October 1 or earlier upon the occurrence of substantive unfavorable changes in economic conditions, industry trends, costs, cash flows, or ongoing declines in market capitalization. If we believe that as a result of our qualitative assessment it is not more likely than not that the fair value of a reporting unit is greater than its carrying amount, a quantitative impairment test is required. The quantitative impairment test requires significant judgment in determining the fair value of the reporting units. We determine the fair value of our reporting units by using a combination of the income approach, which incorporates the use of the discounted cash flow (“DCF”) method and the market multiple approach, which incorporates the use of EBITDA and revenue multiples based on market data. For the DCF method, we use projections specific to the reporting unit, as well as those based on general economic conditions, which require the use of significant estimates and assumptions. Determining fair value specific to each reporting unit requires us to exercise judgment when selecting the appropriate discount rates, control premiums, terminal growth rates, relevant comparable company earnings multiples and the amount and timing of expected future cash flows, including revenue growth rates and profit margins. The cash flows employed in the DCF analysis for each reporting unit are based on the reporting unit’s budget, long range plan, and recent operating performance. Discount rate assumptions are based on an assessment of the risk inherent in the future cash flows of the respective reporting unit and market conditions.\n2024 Impairment Analysis\nDuring the second quarter 2024, we performed goodwill and intangible assets impairment monitoring procedures for all of our reporting units and concluded the delta between market capitalization and book value, continued softness in the U.S. linear advertising market, and uncertainty related to affiliate and sports rights renewals, including the NBA, represented a triggering event for the Networks reporting unit.\n50\nAs a result, we elected to perform a quantitative impairment assessment for all of our reporting units in the second quarter of 2024. For the Networks reporting unit, fair value was determined using a DCF method. The key judgments and assumptions used in the DCF method to determine the fair value of the Networks reporting unit were as follows:\n•    The expected future cash flows in terms of their amount and timing. These cash flows, utilized in the DCF analysis, are derived from the reporting unit’s budget and its strategic long-term plan, which reflect expectations based upon operating performance and assumptions consistent with those of a market participant with regards to affiliate revenue, sports rights, and continued softness in the U.S. linear advertising market.\n•    Long-term growth rate of negative 3%.\n•    A discount rate of 10.5%. This is reflective of the risks inherent in the future cash flows of the reporting unit and market conditions.\n Given the inherent uncertainty in determining the assumptions underlying a DCF analysis, actual results may differ from those used in the valuations.\nThe carrying value of the Networks reporting unit exceeded its fair value and we recorded a pre-tax, non-cash goodwill impairment charge of $9.1 billion during the second quarter of 2024 in impairments and loss on dispositions in the consolidated statements of operations. The goodwill impairment charge does not have an impact on the calculation of our financial covenants under our debt arrangements.\nAs of October 1, 2024, we performed a quantitative goodwill impairment assessment for all of our reporting units. The estimated fair value of each reporting unit exceeded its carrying value and, therefore, no impairment was recorded. The DTC reporting unit had headroom of 20%. The Studios reporting unit, which had headroom of 16%, and the Networks reporting unit, which had headroom of 12%, both had fair values in excess of carrying value of less than 20%. The fair values of the reporting units were determined using a combination of DCF and market valuation methodologies. A 0.5% increase in the discount rate and a 1% decrease in the long-term growth rate would not result in an impairment loss across the reporting units.\nWe continue to monitor our reporting units for triggers that could impact the recoverability of goodwill. Long-term trends and risks we are monitoring in our ongoing assessment include, but are not limited to, the following:\n•\nthe delta between market capitalization and book value;\n•\nuncertainty related to affiliate rights renewals associated with our Networks and DTC reporting units;\n•\ndeclining levels of global GDP growth and continued softness in the U.S. linear advertising market associated with our Networks reporting unit;\n•\ncontent licensing trends and volatility related to the performance of theatrical film and game slates in our Studios reporting unit; and\n•\nrisks in executing the projected growth strategies of our DTC reporting unit.\nContent Rights\nWe capitalize the costs to produce or acquire feature films and television programs, and we amortize costs and test for impairment based on whether the content is predominantly monetized individually, or as a group.\nFor films and television programs predominantly monetized individually, the amount of capitalized film and television production costs (net of incentives) amortized and the amount of participations and residuals to be recognized as expense in a particular period are determined using the individual film forecast method. Under this method, the amortization of capitalized costs and the accrual of participations and residuals are based on the proportion of the film’s or television program’s revenues recognized for such period to the film’s or television program’s estimated remaining ultimate revenues (i.e., the total revenue to be received throughout a film’s or television program’s remaining life cycle).\nFor theatrical films, which are monetized on an individual basis, the process of estimating ultimate revenues requires us to make a series of judgments related to future revenue-generating activities associated with a particular film. Prior to the theatrical release of a film, our estimates are based on factors such as the historical performance of similar films, the star power of the lead actors, the rating and genre of the film, pre-release market research (including test market screenings), international distribution plans and the expected number of theaters in which the film will be released. Subsequent to release, ultimate revenues are updated to reflect initial performance, which is often predictive of future performance.\nFor television programs that are monetized on an individual basis, ultimate revenues are estimated based on factors including the performance of similar programs in each applicable market, firm commitments in hand from customers that license the program in the future, and the popularity of the program in its initial markets.\n51\nFor a film or television program that is predominantly monetized on its own but also monetized with other films and/or programs (such as on our DTC or linear services), we make a reasonable estimate of the value attributable to the film or program’s exploitation while monetized with other films/programs, based on relative market rates, and expense such costs as the film or television program is exhibited.\nUltimates for content monetized on an individual basis are reviewed and updated (as applicable) on a quarterly basis; any adjustments are applied prospectively as of the beginning of the fiscal year of the change.\nFor programs monetized as a group, including licensed programming, amortization expense for network programs is generally based on projected usage, generally resulting in an accelerated or straight-line amortization pattern. Adjustments for projected usage are applied prospectively in the period of the change. Streaming and premium pay-TV content amortization is based on estimated viewing patterns, as there are generally limited to no direct revenues to associate to the individual content assets for premium pay-TV. As such, viewership is most representative of the use of the title.\nJudgment is required to determine the useful lives and amortization patterns of our content assets that are predominantly monetized as a group. Critical assumptions include: (i) the grouping of content with similar characteristics, (ii) the application of a quantitative revenue forecast model or historical viewership model based on the adequacy of historical data, and (iii) determining the appropriate historical periods to utilize and the relative weighting of those historical periods in the forecast model. We then consider the appropriate application of the quantitative assessment given forecasted content use, expected content investment and market trends. Content use and future revenues may differ from estimates based on changes in expectations related to market acceptance, network affiliate fee rates, advertising demand, the number of cable and satellite television subscribers receiving our networks, the number of subscribers to our streaming services, and program usage. Accordingly, we review our estimates and planned usage at least quarterly and revise our assumptions if necessary.\nConsolidation\nWe have ownership and other interests in and contractual arrangements with various entities, including corporations, partnerships, and limited liability companies. For each such entity, we evaluate our ownership, other interests and contractual arrangements to determine whether we should consolidate the entity or account for its interest as an investment at inception and upon reconsideration events. As part of its evaluation, we initially determine whether the entity is a variable interest entity (“VIE”). Management evaluates key considerations through a qualitative and quantitative analysis in determining whether an entity is a VIE including whether (i) the entity has sufficient equity to finance its activities without additional financial support from other parties, (ii) the ability or inability to make significant decisions about the entity’s operations, and (iii) the proportionality of voting rights of investors relative to their obligations to absorb the expected losses (or receive the expected returns) of the entity. If the entity is a VIE and if we have a variable interest in the entity, we use judgment in determining if we are the primary beneficiary and are thus required to consolidate the entity. In making this determination, we evaluate whether we or another party involved with the VIE (1) has the power to direct the activities of the VIE that most significantly impact the VIE’s economic performance and (2) has the obligation to absorb losses of or receive benefits from the VIE that could be significant to the VIE.\nIf it is concluded that an entity is not a VIE, we consider our proportional voting interests in the entity and consolidate majority-owned subsidiaries in which a controlling financial interest is maintained. A controlling financial interest is determined by majority ownership and the absence of substantive third-party participation rights. Key factors we consider in determining the presence of substantive third-party participation rights include, but are not limited to, control of the board of directors, budget approval or veto rights, or operational rights that significantly impact the economic performance of the business such as programming, creative development, marketing, and selection of key personnel. Ownership interests in unconsolidated entities for which we have significant influence are accounted for as equity method.\nWe evaluated reconsideration events during the year ended December 31, 2024 and concluded there were no changes to our consolidation assessments.\nRevenue Recognition\nAs described in Note 2, revenue is recognized upon transfer of control of promised services or goods to customers in an amount that reflects the consideration that we expect to receive in exchange for those services or goods. Significant estimates and judgments are applied in determining the timing of revenue recognition for certain types of transactions, such as bundled arrangements for advertising sales and content licensing arrangements.\n52\nA substantial portion of the advertising contracts in the U.S. and certain international markets guarantee the advertiser a minimum audience level that either the program in which their advertisements are aired or the advertisement will reach. These advertising campaigns are considered to represent a single, distinct performance obligation. For such contracts, judgment is required in measuring progress across our single performance obligation. Various factors such as pricing specific to the channel, daypart and targeted demographic, as well as audience guarantees, are considered in determining how to appropriately measure progress across the campaigns. Revenues are ultimately recognized based on the guaranteed audience level delivered multiplied by the average price per impression.\nOur content licensing arrangements often include fixed license fees from the licensing of feature films and television programs in the off-network cable, premium pay, syndication, streaming, and international television and streaming markets. For arrangements that include multiple titles and/or staggered availabilities across geographical regions, the availability of each title and/or each region is considered a separate performance obligation, and the fixed fee is allocated to each title/region based on comparable market rates and recognized as revenue when the title is available for use by the licensee.\nSee Item 1A, “Risk Factors” for details on significant risks that could impact our ability to successfully grow our cash flows. For an in-depth discussion of each of our significant accounting policies, including our critical accounting policies and further information regarding estimates and assumptions involved in their application, see Note 2 to the accompanying consolidated financial statements included in Item 8, “Financial Statements and Supplementary Data” in this Annual Report on Form 10-K.",
  "item2": null
}