{
  "source_file": "wday-20250131.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nOverview\nWorkday is the AI platform that helps organizations manage their most important assets – their people and money. Workday provides more than 11,000 organizations with cloud solutions powered by artificial intelligence (“AI”) to help solve some of today’s most complex business challenges, including supporting and empowering their workforce, managing their finances and spend in an ever-changing environment, and planning for the unexpected. \nWe strive to make the world of work and business better, and hope to empower customers to do the same through an innovative suite of solutions with more than 70 million users under contract around the world and across industries – from emerging and medium-sized businesses to more than 60% of the Fortune\n \n500. Central to our purpose is a set of core values – with our employees as number one – along with customer service, innovation, integrity, profitability, and fun. We believe that happy employees lead to happy customers, and we are committed to helping our customers adapt and thrive in this increasingly dynamic business environment. \nAs organizations face changing conditions, we believe the need for an intuitive, scalable, and secure platform that provides unified management of finances, people, suppliers, and planning is more important than ever. In fiscal 2025, we announced Workday Illuminate, the next generation of Workday AI, designed to help our customers accelerate manual tasks, assist their employees, and transform their business processes. Workday Illuminate is built into our platform, allowing us to rapidly deliver and sustain models that can solve countless business problems. As a result, Workday Illuminate helps deliver better employee experiences, increase productivity, improve operational efficiencies, and provide insights for faster, data-driven decision-making. To support our customers and help them continuously adapt how they manage their business and operations, Workday delivers weekly product updates in addition to major feature releases twice a year. Through this model, Workday customers are able to deliver and adopt innovations quickly and adapt at a time that fits their business needs. We sell our solutions worldwide primarily through direct sales by our field sales teams. We also offer professional services, as do our Workday Services Partners, to help customers deploy our solutions and continually adopt new capabilities.\n1\nTable of \nContents\nIn fiscal 2025, we announced several Workday Illuminate-powered capabilities that are expected to be generally available to customers in fiscal 2026, including a set of new role-based AI agents for recruiting, talent mobility, succession, and optimization, and a new Workday Assistant to help simplify common human resources (“HR”) and finance processes. Workday Wellness, another new Workday Illuminate-powered solution, will help provide companies with a real-time view into which benefits and wellness offerings their employees want and use and give AI-driven recommendations on how to improve their benefits programs. In February 2025, we announced additional role-based AI agents for contracts, payroll, financial auditing, and policy. We also announced the Workday Agent System of Record, which is designed to help our customers embrace agentic AI by providing a centralized system for managing, tracking, integrating, and optimizing AI agents that are built by Workday, the customer, or third parties. The Workday Agent System of Record and new role-based AI agents are currently in development and are expected to become available later in fiscal 2026.\nOur Capabilities\nWorkday’s suite of enterprise cloud applications addresses the evolving needs of the C-suite across various industries and is designed to be open, extensible, and configurable, allowing integration with other applications and the ability for users and our partners to build custom applications. Workday offers Financial Management, Spend Management, Human Capital Management (“HCM”), Planning, and Analytics applications. \nFinancial Management: Solutions for the Office of the Chief Financial Officer (“CFO”)\nWorkday helps organizations accelerate their journeys towards becoming truly digital finance organizations by giving them the tools they need to manage the strategic direction of their organizations while also supporting growth, profitability, and compliance and regulatory requirements. Workday’s suite of financial management applications, built on the Workday platform with Workday Illuminate at the core, helps enable CFOs to maintain accounting information; manage core financial processes such as payables and receivables; identify real-time financial, operational, and management insights; perform financial consolidation; reduce time-to-close; promote internal control and auditability; and achieve consistency across global finance operations. Our AI-powered capabilities for finance are designed to transform certain accounting, finance, and procurement processes by anticipating and streamlining common actions and workflows to help increase productivity.\nSpend Management: Solutions for the Office of the CFO\n Workday helps enable procurement professionals to support their businesses throughout the source-to-contract process, including a user experience designed for ease of use and collaboration. Workday offers a set of spend management solutions that help organizations streamline supplier selection and contract management, build and execute sourcing events, such as requests for proposals, and manage indirect spend. Additionally, Workday offers an expense management solution that provides users with flexible ways to submit and approve expenses, while providing leaders the ability to set controls and analyze spend. \nHuman Capital Management: Solutions for the Office of the Chief Human Resources Officer (“CHRO”)\nWorkday delivers HR solutions to help organizations build a skilled workforce, drive productivity, and create an engaging workplace. Workday’s suite of HCM applications allows organizations to manage the entire employee lifecycle – from recruitment to retirement – enabling HR teams to hire, onboard, pay, develop and reskill, and provide meaningful employee experiences that are personalized and helpful, based on listening to the diverse needs of today’s workforce. For example, we are helping organizations manage their total workforce in one seamless experience on Workday through our solutions, including Workday Adaptive Planning, Workday Illuminate-powered recruiting agent, Workday VNDLY, and Workday HCM. \nPlanning: Solutions for the Offices of the CFO and CHRO\nIn today’s dynamic environment, businesses need to continuously plan and model various scenarios to quickly respond to change. Workday provides an active planning process that can model across finance, workforce, sales, and operational data, helping organizations make more informed decisions and respond quickly to changing situations. Workday Illuminate assists in creating forecasts that incorporate historical and third-party data, such as economic data and labor statistics. When combined with Workday’s Financial Management and HCM solutions, organizations are able to leverage real-time transactional data to dynamically adjust and recalibrate their plans.\n2\nTable of \nContents\nAnalytics and Reporting and Workday Platform: Solutions for the Offices of the Chief Information Officer (“CIO”), CFO, and CHRO\nWorkday helps leaders make sense of the vast amount of data they collect enterprise-wide. For example, information technology (“IT”) leaders are navigating the complexities of supporting employees in new environments, which requires them to deploy an adaptable, secure architecture to help ensure global continuity and productivity while remaining agile. Workday provides applications for analytics and reporting, including augmented analytics to surface insights to the line of business in simple-to-understand stories. The Workday Platform combines both the innovation built by Workday and on Workday by our customers and partners, providing organizations with the flexibility to integrate third-party applications and services directly into Workday. By managing their people and money together on the Workday platform, our customers can gain new possibilities for increased agility, transformation, and performance. \nIndustries: Solutions for the Offices of the CIO, CFO, and CHRO\nWorkday offers businesses flexible solutions to help them adapt to their industry-specific needs and respond to change. Workday’s applications serve industries such as financial services, healthcare, higher education, state and local government, and professional services. For example, Workday provides supply chain and inventory solutions to healthcare organizations, allowing them to purchase, stock, track, and replenish their inventory to help support patient care. In addition, higher education institutions can deploy Workday’s solution to manage the end-to-end student and faculty lifecycle. Workday also enables its partner ecosystem to build industry-specific solutions. With Workday Extend, customers and their developers can build custom applications that can accommodate their unique industry business needs, complete with the same experience, security model, and reliability of the native applications offered by Workday. \nProduct Development\nAt Workday, innovation is a core value, which encourages out-of-the-box thinking and creativity, enabling us to create applications designed to change the way people work. We invest significant resources into product development and are committed to rapidly building and/or acquiring new applications and solutions. Our product development organization is responsible for product design, development, testing, and certification. We focus our efforts on developing new applications and core technologies, as well as further enhancing the usability, functionality, reliability, security, performance, and flexibility of existing applications. To grow our suite of Workday applications, we primarily invest in research and development, but we also selectively acquire companies that are consistent with our design principles, existing product set, corporate strategy, and company culture. For example, in fiscal 2025, we acquired HiredScore, Inc. (“HiredScore”), a leading provider of AI-powered talent orchestration solutions, and Evisort Inc. (“Evisort”), a provider of an AI-native document intelligence platform. We also manage a portfolio of strategic investments through Workday Ventures, our strategic investment arm. We invest primarily in enterprise cloud technology companies that we believe are digitally transforming their industries, developing innovative AI-powered technology, improving customer experiences, helping us expand our solution ecosystem or supporting other corporate initiatives. We plan to continue making these types of strategic investments as opportunities arise that we find attractive. \nSales and Marketing\nWe sell our subscription contracts and related services globally, primarily through our direct sales organization, which consists of field sales and field sales support personnel. The Workday Field Sales team is aligned by geography, industry, and/or customer size. We also segment our sales teams into two distinct groups: those focused on landing new customer relationships, and those focused on expanding our relationship within our existing customers. We generate customer leads, accelerate sales opportunities, and build brand awareness through our marketing programs and strategic relationships. Our marketing programs largely target senior business leaders, including CFOs, CHROs, and CIOs. We also generate customer leads and transact through our partner ecosystem, including through resellers. \nOur sales strategy is focused on both adding new customers and on growing our relationships with our existing customers to expand the adoption of our suite of solutions over time. As our customers realize the benefits of our entire suite of service offerings, we aim to upgrade the customers’ experience with new products and features, and gain additional subscriptions by targeting new functional areas and business units. Additionally, by extending our go-to-market capabilities globally, we aim to grow our business by selling to new customers in new regions.\n3\nTable of \nContents\nPartner Ecosystem\nAs a core part of our strategy, we have developed and continue to grow a global ecosystem of partners that build and sell new applications on the Workday platform, source new business with Workday, and deliver quality services and customer outcomes with Workday. These relationships include innovation partners, sales partners, and services partners. Together, Workday and our partners help our customers to better manage their people and their money. The Workday Marketplace allows customers to find Built on Workday applications, Industry Accelerators, packaged solutions, and other integrations and solutions that are purpose-built to complement the Workday platform in targeted countries and industries. Strategic partnerships with public cloud providers, including Amazon Web Services, Inc. (“AWS”) and Google Cloud, allow our customers to reduce their committed spend on cloud. Our global partnerships with payroll providers, including Automatic Data Processing, Inc. (“ADP”) and Strada, enable integrated and streamlined payroll solutions across the world. Our Industry Accelerator program, including 12 new Industry Accelerators announced during fiscal 2025, combines Workday partners, solutions, and services to help speed cloud transformation efforts tailored to solve our customers’ industry-specific challenges.\nCustomers\nWe sell to emerging, medium-sized, and large global organizations that span numerous industry categories, including professional and business services, financial services, healthcare, education, government, technology, media, retail, and hospitality.\nWe have built a company culture centered around customer success and satisfaction. As part of their subscription, customers are provided support services and tools to enhance their experience with Workday applications. This includes 24/7 support; training; a Customer Success Management group to assist customers in production; and Workday Community, an online portal where customers can collaborate and share knowledge and best practices. In addition, we offer Workday Success Plans, a comprehensive, add-on subscription service that delivers continuous value for our customers through strategic advice, product expertise, adoption resources, on-demand education, and technical guidance. We also offer extensive customer training opportunities and a professional services ecosystem of experienced Workday consultants and system integrators to help customers achieve a timely adoption of Workday and enable them to enhance the value of our applications over the life of their subscription.\nSeasonality\nWe have experienced seasonality in terms of when we enter into customer agreements for our services. Historically, we have signed a significantly higher percentage of agreements with new customers, as well as renewal agreements with existing customers, in the fourth quarter of each fiscal year due to customer buying patterns. Although these seasonal factors are common in the technology industry, historical patterns should not be considered a reliable indicator of our future sales activity or performance.\nCompetition\nThe overall market for enterprise application software is rapidly evolving, highly competitive, and subject to changing technology, shifting customer needs, and frequent introductions of new products. We currently compete with large, well-established, enterprise software vendors, such as Oracle Corporation (“\nOracle\n”) and SAP SE (“SAP”). We also face competition from other enterprise software vendors, from regional competitors that only operate in certain geographic markets, from vendors of specific applications that address only one or a portion of our applications, and from vendors that specialize in specific industries in which we provide services, some of which offer cloud-based solutions. These vendors include, without limitation, Anaplan, Inc.; ADP; Coupa Software Inc.; Dayforce, Inc.; Infor, Inc.; Microsoft Corporation; and UKG Inc.\nIn addition, other cloud or AI platform companies that provide services in different target markets or industries may develop applications or acquire companies that operate in our target markets or industries, and some potential customers may elect to develop their own internal applications. However, the domain and industry expertise that is required for a successful solution in the areas of financial management, HCM, and analytics may inhibit new entrants, who may also be unable to invest the necessary capital to accurately address global requirements and regulations. We expect continued consolidation in our industry that could lead to significantly increased competition.\nWe believe the principal competitive factors in our markets include:\n•\nlevel of customer satisfaction and quality of customer references;\n•\nspeed to deploy and ease of use;\n•\nbreadth and depth of application functionality;\n•\ntotal cost of ownership and flexibility of payment terms;\n•\nbrand awareness and reputation;\n•\nadaptive technology platform;\n4\nTable of \nContents\n•\ncapability for configuration, integration, security, scalability, and reliability of applications;\n•\noperational excellence to ensure system availability, scalability, and performance;\n•\nability to innovate and rapidly respond to customer needs, such as the integration of AI into product offerings;\n•\ndomain and industry expertise in applicable laws and regulations;\n•\nsize of customer base and level of user adoption;\n•\ncustomer confidence in financial stability and future viability;\n•\nexisting relationships with key senior business leaders; and\n•\nability to integrate with legacy enterprise infrastructure and third-party applications.\nWe believe that we compete favorably based on these factors. Our ability to remain competitive will largely depend on our ongoing performance in product development and customer support.\nFor more information regarding the competitive risks we face, see “Risk Factors” included in Part I, Item 1A of this report.\nHuman Capital \nWorkday was founded with the idea of putting people at the center of enterprise software, which is why employees are our number one core value. As of January 31, 2025, our global workforce consisted of over 20,400 employees in 34 countries, of which approximately 63% were located in the U.S. and 37% were located internationally. These numbers do not reflect the impacts of our restructuring plan announced in February 2025 (“Fiscal 2026 Restructuring Plan”), which is currently expected to result in the reduction of approximately 8% of our workforce. Maintaining strong employee relations is a priority and we consider our relations with our employees to be positive.\nOur Chief People Officer is responsible for developing and executing Workday’s human capital strategy, including programs focused on total rewards; workforce planning and our skills-based hiring approach; employee skills, development, engagement, and wellbeing; and our inclusive, high-performance culture. Our Chief People Officer and our CEO regularly update our Board of Directors and the Compensation Committee on human capital matters and seek their input on subjects such as succession planning, executive compensation, and our company-wide people programs.\nTotal Rewards\nOur compensation philosophy is designed to establish and maintain a fair and flexible compensation program that attracts and rewards talented individuals who possess the skills necessary to support our near-term objectives, create long-term value for our stockholders, grow our business, and assist in the achievement of our strategic goals. We believe that providing employees with competitive pay, ownership in the company, and a wide range of benefits is fundamental to employees feeling valued, motivated, and recognized for their contributions. Equity ownership is a key element of our compensation program, allowing employees to share in Workday’s successes and aligning the interests of our employees with our stockholders. Additionally, our total rewards package includes a cash bonus program, an employee stock purchase plan, healthcare and retirement benefits, paid time off, family leave, and other wellness programs. We also offer specialized benefits such as a holistic global mental and emotional health program, onsite and virtual healthcare resources, a financial wellness program, and support for fertility options and new parents, as well as reimbursement of adoption costs. \nOur Commitment to Pay Parity\nWe believe that all employees deserve to be paid fairly and equitably and be afforded an equal chance to succeed. We have a market-based pay structure that compares our roles to those of our peers in each region. This process helps ensure we pay according to the market value of the jobs we offer. We also have processes in place to make pay decisions based on internally consistent and fair criteria. Each year, we conduct a company-wide pay equity analysis to help ensure pay equity among employees in similar roles. If we identify differences in pay, we research those differences and, where appropriate, make adjustments to employees’ pay.\n5\nTable of \nContents\nVIBE: Value Inclusion, Belonging, and Equity for All\nWe strive to be a workplace where all employees are valued for their unique perspectives and where we collectively contribute to Workday’s success and innovation. Value Inclusion, Belonging, and Equity for all (“VIBE”) is our vision for cultivating an environment where all employees can thrive. Whether through creating resources and initiatives that enable and strengthen our culture, building inclusive products and technology, or hiring and developing great talent, we are building a vibrant workplace that fuels innovation and collaboration. Our 13 Employee Belonging Councils (“EBCs”) play an integral role in fostering a culture of VIBE. Our EBCs, including Families @ Workday, Black @ Workday, Military and Veterans at Workday, and Workday for People with Disabilities, among others, cultivate a culture of VIBE by providing spaces open to all employees to foster ideation, advance inclusion, and drive innovation. As of January 31, 2025, over a quarter of our employees were members of one or more EBC.\nWe acknowledge that skills, education, and lived and learned experiences are gained in a variety of ways that are often not recognized in the traditional recruiting process, which is why we take a holistic approach to talent acquisition that prioritizes a skills-based approach. By standardizing practices to attract and evaluate talent fairly, minimize barriers and biases, and promote a skills-first hiring approach, we aim to deliver a meaningful and positive experience for all. \nLearning and Development\nOur employees tell us they are most engaged when they are continuously being exposed to new things, empowered to build new skills, and able to make an impact. Our employees have instant access to training via several industry-leading learning platforms, which provide our global workforce with convenient, timely access to content from subject matter experts. We offer a number of educational resources, development opportunities, and a support community to guide employees throughout their Workday careers. For example, we developed Career Hub which helps our employees share skills and interests and receive relevant connections, curated learning content, and recommended jobs to help them on their career journeys. Using Workday Illuminate, Career Hub provides workers with suggestions to grow their skills and capabilities and encourages them to build a plan as they explore opportunities for continued career development.\nAdditionally, to foster a strong culture of compliance and ethics, we conduct annual compliance and ethics training of our Code of Conduct for all employees. In fiscal 2025, we had a 100% completion rate for our annual Code of Conduct training.\nCommunication and Engagement\nOur culture and how we treat people are paramount at Workday, and we believe that being transparent and facilitating information sharing are key to our success. Workday leverages multiple communication channels to engage and inform employees, including company meetings, functional town halls, internal websites, and social collaboration tools. We also encourage regular 1:1 sessions and quarterly check-ins between managers and employees to provide individual performance feedback, and the use of our peer recognition platform. We believe that understanding what our employees want and supporting them effectively is critical to retaining our highest performing employees and attracting top talent. We use Workday Peakon Employee Voice, powered by Workday Illuminate, to collect and analyze feedback in real time from our employees, garner insights and recommendations, and turn that feedback into dialog and action. Since we introduced Workday Peakon Employee Voice in fiscal 2022, employees have provided over 600,000 confidential comments on the platform through weekly surveys and 91% of our employees have taken part in at least one survey, which reflects strong engagement by our employees. We receive data points from these surveys that help us identify actions to take to improve our company and our culture. \nBuoyed by the opportunities offered by our own technology, our talent philosophy puts employees at the center of their own career and performance journey by providing them the tools and framework to further their careers. We have done this by establishing a clear philosophy and set of expectations. Every employee receives enablement on our performance and growth philosophy, what’s expected of them, and how to leverage these practices to ensure their own personal success and career growth at Workday. Our talent and performance dashboard provides a snapshot view of performance-related tasks, with a visual summary of goals, feedback, and growth opportunities. Employees can take action to update their contributions, capabilities, career, and connections using the quick links provided in the dashboard. \nHealth, Safety, and Wellbeing\nAt Workday, we take a holistic approach to our employees’ health and wellbeing and have created programs that focus on four core dimensions: Physical; Mental and Emotional; Financial; and Social and Flex. These programs go beyond traditional medical benefits and wellness offerings and allow employees to focus on their personal wellness goals as well as their mental health.\n6\nTable of \nContents\nOur hybrid work model provides flexibility for our employees to work from home, while still bringing people together to foster collaboration and innovation. We offer new remote-based employees a stipend to enable them to have a comfortable work-from-home environment. To help keep health and mental wellness top of mind, we offer a series of programs and communications focused on mental health. These included tools and resources related to sleep, healthy eating, and mindfulness, as well as our Employee Assistance Program to, among other things, facilitate timely access to culturally responsive mental health support for employees and their family members.\n Our Global Workplace Safety team supports the traditional corporate areas of employee health and safety and physical security for Workday on a global scale. From the workplace to work-related travel, we strive to keep our employees safe with programs including safety awareness training, emergency response protocols, and our ergonomics and life safety team programs.\nGiving and Doing\nWorkday’s Giving & Doing program embodies our belief in making a positive impact beyond our organizational walls, empowering employees to engage in charitable efforts, community service, and volunteerism. On top of our strategic, company-led social impact and employee volunteerism efforts, we also believe that giving back is even more rewarding when people get to make an impact through their favorite causes. We encourage and support employee giving and volunteering through programs such as our charitable donation matching gift program, our volunteer grant program, our paid time off benefit for employees to volunteer and give back to their communities, and our team volunteer experience, where employee teams of five or more can volunteer with a charity partner of their choice and receive grants of up to $5,000.\nIntellectual Property\nWe rely on a combination of trade secrets, patents, copyrights, and trademarks, as well as contractual protections, to establish and protect our intellectual property rights. We require our employees, contractors, consultants, suppliers, partners, and other third parties to enter into confidentiality and proprietary rights agreements, and we control access to software, documentation, and other proprietary information. Although we rely on intellectual property rights, including trade secrets, patents, copyrights, and trademarks, as well as contractual protections and controls to establish and protect our proprietary rights, we believe that factors such as the technological and creative skills of our personnel; creation of new products, features, and functionality; and frequent enhancements to our applications are more essential to establishing and maintaining our technology leadership position.\nGovernmental Regulation\nAs a public company with global operations, we are subject to various federal, state, local, and foreign laws and regulations. These laws and regulations, which may differ among jurisdictions, include, among others, those related to financial and other disclosures, accounting standards, privacy and data protection, cybersecurity, intellectual property, AI ethics and machine learning, corporate governance, tax, government contracting, trade, antitrust, employment, immigration and travel, import/export, and anti-corruption. The costs to comply with these governmental regulations are not material to the understanding of our business. For a further discussion of the risks associated with government regulations that may materially impact us, see “Risk Factors” included in Part I, Item 1A of this report.\nAvailable Information\nOur website is located at www.workday.com and our investor relations website is located at www.investor.workday.com. Our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and other filings with the Securities and Exchange Commission (“SEC”), and all amendments to these filings, can be obtained free of charge from our website at www.workday.com/sec-filings as soon as reasonably practicable after we electronically file them with or furnish them to the SEC. The SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at www.sec.gov. Workday also uses its websites, including its investor relations website and blogs.workday.com as a means of disclosing information about Workday, including information that could be deemed material by investors. Information contained on or accessible through any website referenced herein is not part of, or incorporated by reference in, this Form 10-K, and the inclusion of such website addresses is as inactive textual references only. \nWorkday, the Workday logo, Workday Illuminate, VIBE, Peakon, Evisort, HiredScore, VNDLY, and Adaptive Planning are trademarks of Workday, Inc., which may be registered in the United States and elsewhere. Other trademarks, service marks, or trade names appearing in this report are the property of their respective owners.\n7\nTable of \nContents",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion of our financial condition and results of operations should be read in conjunction with the consolidated financial statements and notes thereto included included in Part II, Item 8 of this report. The following discussion contains forward-looking statements that reflect our plans, estimates, and beliefs. Our actual results could differ materially from those discussed in the forward-looking statements. Factors that could cause or contribute to these differences include those discussed below and elsewhere in this report, particularly in “Risk Factors” included in Part I, Item 1A of this report.\nThe following discussion of our financial condition and results of operations covers fiscal 2025 and 2024 items and year-over-year comparisons between fiscal 2025 and 2024. Discussions of fiscal 2023 items and year-over-year comparisons between fiscal 2024 and 2023 that are not included in this Form 10-K can be found in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of our Annual Report on Form 10-K for the fiscal year ended January 31, 2024, that was filed with the SEC on March 8, 2024.\nOverview\nWorkday is the AI platform that helps organizations manage their most important assets – their people and money. We deliver cloud-based applications for financial management, HCM, planning, spend management, and analytics. Our diverse customer base includes emerging, medium-sized, and large global organizations within numerous industry categories, including professional and business services, financial services, healthcare, education, government, technology, media, retail, and hospitality. With Workday, our customers have an AI-powered platform that can help them deliver better employee experiences, increase productivity, improve operational efficiencies, and provide insights for faster, data-driven decision-making.\nWe have achieved significant growth since our inception in 2005, when we pioneered HCM in the cloud. As a result of our innovation and commitment to customer success, today we are a Fortune 500 company with more than 11,000 customers around the world. As we continue to grow, we are focused on driving sustainable, long-term subscription revenue growth by adding new customers and expanding our relationships with existing customers through increased adoption of our suite of solutions. Central to this effort is investing in strategic growth areas including leveraging the power of our platform to drive increased adoption of our full suite of applications, expanding internationally, developing innovative AI solutions, growing our partner ecosystem, deepening our industry verticals, and exploring strategic acquisitions to complement our organic innovation. Our investments across these targeted growth areas may require additional costs, but we remain committed to optimizing resource allocation and realizing a return on our investments. Over time, we believe these investments will support revenue growth and a more scalable business.\nWe are focused on expanding our operating margin by driving scale and building efficiencies across the business through investments in people, processes, and systems. In February 2025, we announced the Fiscal 2026 Restructuring Plan, which is intended to prioritize our investments and continue advancing our ongoing focus on durable growth. The plan is currently expected to result in the reduction of approximately 8% of our workforce. In connection with this plan, we expect to exit certain owned office space. As a result of our focus on expanding operating margin, we expect our product development, sales and marketing, and general and administrative expenses as a percentage of total revenues will decrease over the longer term as we grow our revenues and invest in a disciplined manner to support our long-term growth objectives.\nImpact of Current Economic Conditions\nRecent macroeconomic events including increased tariffs, elevated inflation, and fluctuating interest rates and foreign currency exchange rates, as well as geopolitical instability, continue to impact the global economy and create uncertainty, volatility, and disruption of financial markets. Despite this, we are confident in the long-term overall health of our business, the strength of our product offerings, and our ability to continue to execute on our strategy and help our customers on their human capital and finance digital transformation journeys. Demand for our products remains strong, we continue to achieve solid new subscription bookings, and our near-term revenues are relatively predictable as a result of our subscription-based business model.\n34\nTable of \nContents\nWe have experienced, and may continue to experience, a moderation of revenue growth rates due to deal scrutiny and the lengthening of certain sales cycles, particularly within net new opportunities, and reduced growth in headcount level commitments upon renewals of existing customers. Further, we have provided, and may continue to provide, certain customers with more flexible payment terms. If the economic uncertainty continues, we may also experience additional negative impacts on customer renewals, customer collections, sales and marketing efforts, customer deployments, product development, or other financial metrics. Any of these factors could harm our business, financial condition, and operating results. For further discussion of the potential impacts of recent macroeconomic events on our business, financial condition, and operating results, see “Risk Factors” included in Part I, Item 1A of this report.\nFinancial Results Overview\nThe following table provides an overview of our key metrics (in millions, except percentages, basis points, and headcount data):\n \nAs of and for the Years Ended January 31,\n \n2025\n2024\nChange\nTotal revenues\n$\n8,446 \n$\n7,259 \n16 \n%\nSubscription services revenues\n$\n7,718 \n$\n6,603 \n17 \n%\nGAAP operating income\n$\n415 \n$\n183 \n127 \n%\nNon-GAAP operating income \n(1)\n$\n2,186 \n$\n1,741 \n26 \n%\nGAAP operating margin\n4.9 \n%\n2.5 \n%\n239 bps\nNon-GAAP operating margin \n(1)\n25.9 \n%\n24.0 \n%\n190 bps\nOperating cash flows\n$\n2,461 \n$\n2,149 \n15 \n%\nFree cash flows \n(1)\n$\n2,192 \n$\n1,917 \n14 \n%\nTotal subscription revenue backlog\n$\n25,056 \n$\n20,924 \n20 \n%\n12-month subscription revenue backlog\n$\n7,631 \n$\n6,623 \n15 \n%\nCash, cash equivalents, and marketable securities\n$\n8,017 \n$\n7,813 \n3 \n%\nHeadcount\n20,482 \n18,824 \n9 \n%\n(1)\nSee “Non-GAAP Financial Measures” below for further information.\nComponents of Results of Operations\nRevenues\nWe derive our revenues from subscription services and professional services. Subscription services revenues primarily consist of fees that give our customers access to our cloud applications, which include related customer support. Professional services revenues include fees for deployment services, optimization services, and training.\nSubscription services revenues accounted for approximately 91% of our total revenues for the fiscal year ended January 31, 2025, and represented 97% of our total unearned revenue as of January 31, 2025. Subscription services revenues are driven primarily by the number of customers, the number of workers at each customer, the specific applications subscribed to by each customer, and the price of our applications.\nThe mix of applications to which each customer subscribes can affect our financial performance due to price differentials in our applications. Pricing for our applications varies based on many factors, including the complexity and maturity of the application and its acceptance in the marketplace. New products or services offerings by competitors in the future could also impact the mix and pricing of our offerings.\n35\nTable of \nContents\nSubscription services revenues are recognized over time as services are delivered, beginning on the date our service is made available to the customer. Our subscription contracts typically have a term of three years or longer and are generally noncancelable. We generally invoice our customers annually in advance for subscription services. We may provide certain customers flexible payment terms and the timing of revenue recognition may differ from the timing of invoicing to our customers.\nOur professional services consulting engagements are billed on a time and materials or fixed price basis. We generally invoice our customers in arrears for our professional services. For contracts billed on a time and materials basis, revenues are recognized over time as the professional services are performed. For contracts billed on a fixed price basis, revenues are recognized over time based on the proportion of the professional services performed. In some cases, we supplement our consulting teams by subcontracting resources from our service partners and deploying them on customer engagements. As the Workday-related consulting practices of our partner firms continue to develop, we expect these partners to increasingly contract directly with our subscription customers for services engagements.\nSubscription Revenue Backlog\nOur subscription revenue backlog, which is also referred to as remaining performance obligations for subscription contracts, represents contracted subscription services revenues that have not yet been recognized and includes billed and unbilled amounts. Subscription revenue backlog may fluctuate from period-to-period due to a number of factors, including the timing of renewals and overall renewal rates, new business growth, average contract duration, business combinations, and seasonality.\nCosts and Expenses\nCosts of subscription services revenues\n. Costs of subscription services revenues consist primarily of expenses associated with hosting our applications and providing customer support, including employee-related expenses, expenses related to data center capacity and computing infrastructure operated by third parties, and depreciation of our data center equipment.\nCosts of professional services revenues\n. Costs of professional services revenues consist primarily of employee-related expenses associated with these services, subcontractor expenses, and travel expenses.\nProduct development expenses\n. Product development expenses consist primarily of employee-related expenses associated with our efforts to add new features and applications, increase functionality, and enhance the ease of use of our cloud applications, as well as expenses related to data center capacity.\nSales and marketing expenses\n. Sales and marketing expenses consist primarily of employee-related expenses, sales commissions, marketing programs, and travel expenses. Marketing programs consist of advertising, events, corporate communications, brand awareness, brand ambassador campaigns, and product marketing activities. Sales commissions are considered incremental costs of obtaining a contract with a customer. Sales commissions for new revenue contracts are capitalized and amortized on a straight-line basis over a period of benefit that we have determined to be five years.\nGeneral and administrative expenses\n. General and administrative expenses consist of employee-related expenses for finance and accounting, legal, human resources, information systems personnel, professional fees, and other corporate expenses.\nRestructuring expenses.\n Restructuring expenses are associated with a formal restructuring program and consist of charges related to employee transition, severance payments, employee benefits, and share-based compensation, as well as exit charges associated with the closure of facilities.\nResults of Operations\nRevenues\nOur total revenues were as follows (in millions):\n \nYear Ended January 31,\n \n2025\n2024\n2023\nSubscription services\n$\n7,718 \n$\n6,603 \n$\n5,567 \nProfessional services\n728 \n656 \n649 \nTotal revenues\n$\n8,446 \n$\n7,259 \n$\n6,216 \n36\nTable of \nContents\nTotal revenues were $8.4 billion for fiscal 2025, compared to $7.3 billion for fiscal 2024, an increase of $1.2 billion, or 16%. Subscription services revenues were $7.7 billion for fiscal 2025, compared to $6.6 billion for fiscal 2024, an increase of $1.1 billion, or 17%. Approximately 60% of the increase in subscription services revenues was attributable to expansion of our customers that existed as of the beginning of the prior fiscal year, and the remaining 40% was attributable to customers added after the beginning of the prior fiscal year. Professional services revenues were $728 million for fiscal 2025, compared to $656 million for fiscal 2024, an increase of $72 million, or 11%. The increase in professional services revenues was driven by higher demand for our deployment and integration services.\nGross Revenue Retention Rate\nOur growth in subscription services revenues attributable to existing customers is further reflected by our gross revenue retention rate of approximately 98% as of January 31, 2025. Our gross revenue retention rate measures the percentage of recurring revenue retained from existing customers and is calculated by taking total annual recurring revenue (“ARR”) of our customers as of the corresponding prior period-end and comparing that to ARR from that same set of customers as of the current period-end. The metric takes into account recurring revenues lost to product or customer churn but does not account for additional revenue earned from add-ons or net expansions, which include volume and price adjustments. Our high gross revenue retention rate demonstrates our ability to maintain our existing customer base and drive strong overall customer satisfaction.\nOur gross revenue retention rate is based on ARR, which represents the annualized value of active subscription contracts as of the end of each period. Each subscription contract is annualized by dividing the total contract value by the number of days in the contract term and then multiplying by 365. We exclude certain subscription contracts from the calculation, including contracts with terms less than one year that are distinct from our core product offering, such as contracts for tenants which are used for implementation and testing. To the extent that we are negotiating a renewal with a customer after the expiration of the subscription, ARR is only adjusted if the customer churns. We calculate ARR on a constant currency basis using exchange rates set at the beginning of each fiscal year. ARR is a non-GAAP financial measure and should be viewed independently of, and not as a substitute for or combined with, revenue and unearned revenue.\nSubscription Revenue Backlog\nAs of January 31, 2025, our total subscription revenue backlog was $25.1 billion, with $7.6 billion expected to be recognized in revenues over the next 12 months. As of January 31, 2024, our total subscription revenue backlog was $20.9 billion, with $6.6 billion expected to be recognized in revenues over the next 12 months. The increase in subscription revenue backlog was primarily driven by expansion within our existing customer base, sales to new customers, and timing of renewals for existing customers.\nCosts and Expenses\nOur costs and expenses were as follows (in millions):\n \nYear Ended January 31,\n \n2025\n2024\n2023\nCosts of subscription services\n$\n1,266 \n$\n1,031 \n$\n1,007 \nCosts of professional services\n803 \n740 \n703 \nProduct development\n2,626 \n2,464 \n2,247 \nSales and marketing\n2,432 \n2,139 \n1,842 \nGeneral and administrative\n820 \n702 \n599 \nRestructuring\n84 \n0 \n40 \nTotal costs and expenses\n$\n8,031 \n$\n7,076 \n$\n6,438 \n37\nTable of \nContents\nTotal costs and expenses were $8.0 billion for fiscal 2025, compared to $7.1 billion for fiscal 2024, an increase of $955 million, or 13%. The increase in operating expenses included increases of $555 million in employee-related expenses, including share-based compensation, primarily due to higher average headcount, $84 million in restructuring expenses primarily related to the Fiscal 2026 Restructuring Plan, $57 million in facilities and IT-related expenses, $56 million in data center capacity expenses, $46 million in subcontractor expenses, $44 million in professional services expenses, $38 million in depreciation, $37 million in amortization of deferred sales commissions due to increased sales, and $31 million related to marketing programs.\nCosts of Subscription Services\nCosts of subscription services were $1.3 billion for fiscal 2025, compared to $1.0 billion for fiscal 2024, an increase of $235 million, or 23%. The increase in costs of subscription services included increases of $132 million in employee-related expenses, including share-based compensation, primarily due to higher average headcount, $44 million in data center capacity expenses, and $39 million in depreciation.\nWe expect costs of subscription services will continue to increase in absolute dollars as we improve and expand our technical operations infrastructure, including computing infrastructure operated by third parties.\nCosts of Professional Services\nCosts of professional services were $803 million for fiscal 2025, compared to $740 million for fiscal 2024, an increase of $63 million, or 9%. The increase in costs of professional services included increases of $46 million in subcontractor expenses and $12 million in employee-related expenses.\nWe expect costs of professional services as a percentage of total revenues to continue to decline as we rely on our service partners to deploy our applications and as our subscription services revenues continue to grow as we expand both our customer base and our footprint within our existing customers.\nProduct Development\nProduct development expenses were $2.6 billion for fiscal 2025, compared to $2.5 billion for fiscal 2024, an increase of $160 million, or 7%. The increase in product development expenses included an increase of $158 million in employee-related expenses, including share-based compensation, primarily due to higher average headcount.\nWe expect product development expenses will continue to increase in absolute dollars as we improve and extend our applications and develop new technologies, including costs incurred for hardware maintenance, data center capacity, facility costs, and IT-related expenses.\nSales and Marketing\nSales and marketing expenses were $2.4 billion for fiscal 2025, compared to $2.1 billion for fiscal 2024, an increase of $294 million, or 14%. The increase in sales and marketing expenses included increases of $180 million in employee-related expenses, including share-based compensation, primarily due to higher average headcount, $37 million in amortization of deferred sales commissions due to increased sales, $30 million related to marketing programs, and $25 million in facilities and IT-related expenses.\nWe expect sales and marketing expenses to increase in absolute dollars as we continue to invest in our domestic and international selling and marketing activities to expand awareness of our brand and product offerings to attract new and existing customers.\nGeneral and Administrative\nGeneral and administrative expenses were $820 million for fiscal 2025, compared to $702 million for fiscal 2024, an increase of $118 million, or 17%. The increase in general and administrative expenses included increases of $73 million in employee-related expenses, including share-based compensation, primarily due to higher average headcount, and $36 million in professional services expenses.\n We expect general and administrative expenses will continue to increase in absolute dollars as we continue to grow our business and invest in our people, processes, and systems to support our global operations.\n38\nTable of \nContents\nRestructuring\nRestructuring expenses were $84 million for fiscal 2025, with no comparable expense in the prior year. We recorded expenses of $65 million for employee transition, severance payments, employee benefits, and share-based compensation under the Fiscal 2026 Restructuring Plan and exit charges of $19 million associated with office space reductions under a separate restructuring plan.\nWe estimate that we will incur approximately $230 million to $250 million in total charges in connection with the Fiscal 2026 Restructuring Plan, which consists of approximately $200 million to $210 million related to employee transition, severance payments, employee benefits, and share-based compensation, with the balance related to an impairment of office space. The activities associated with this plan are expected to be substantially complete by the second quarter of fiscal 2026, subject to local law and consultation requirements. \nShare-based compensation\nCosts and expenses include share-based compensation expense as follows (in millions):\n \nYear Ended January 31, \n \n2025\n2024\n2023\nCosts of subscription services\n$\n145 \n$\n120 \n$\n105 \nCosts of professional services\n114 \n116 \n111 \nProduct development\n670 \n653 \n616 \nSales and marketing\n310 \n282 \n248 \nGeneral and administrative\n272 \n245 \n210 \nRestructuring\n8 \n0 \n5 \nTotal share-based compensation expense\n$\n1,519 \n$\n1,416 \n$\n1,295 \nPercentage of total revenues\n18.0 \n%\n19.5 \n%\n20.8 \n%\nShare-based compensation expense increased by $103 million during fiscal 2025, primarily due to additional grants to new and existing employees.\nEquity compensation is an important element of our compensation philosophy. While we expect share-based compensation expense to grow in absolute dollars as we expand our global workforce, we expect it to continue to decline as a percentage of total revenues.\nOperating Income (Loss) and Operating Margin\nGAAP operating income was $415 million, or 4.9% of revenues, in fiscal 2025, compared to $183 million, or 2.5% of revenues in fiscal 2024. The improvement was primarily due to our revenue growth outpacing headcount growth and moderation of operating expenses, including share-based compensation, partially offset by restructuring expenses recognized in the current fiscal year.\nNon-GAAP operating income was $2.2 billion, or 25.9% of revenues, in fiscal 2025, compared to $1.7 billion, or 24.0% of revenues in fiscal 2024. The increase was primarily due to our revenue growth outpacing headcount growth and moderation of operating expenses.\n39\nTable of \nContents\nReconciliations of our GAAP to non-GAAP operating income (loss) and operating margin were as follows (in millions, except percentages). See “Non-GAAP Financial Measures” below for further information.\n \nYear Ended January 31, \n \n2025\n2024\n2023\nOperating income (loss)\n$\n415 \n$\n183 \n$\n(222)\nShare-based compensation expense\n (1)\n1,511 \n1,416 \n1,290 \nEmployer payroll tax-related items on employee stock transactions\n76 \n66 \n50 \nAmortization of acquisition-related intangible assets\n79 \n75 \n86 \nAcquisition-related costs\n21 \n1 \n3 \nRestructuring costs\n84 \n0 \n40 \nNon-GAAP operating income\n$\n2,186 \n$\n1,741 \n$\n1,247 \nOperating margin\n4.9 \n%\n2.5 \n%\n(3.6)\n%\nShare-based compensation expense \n (1)\n17.9 \n%\n19.5 \n%\n20.8 \n%\nEmployer payroll tax-related items on employee stock transactions\n0.9 \n%\n0.9 \n%\n0.8 \n%\nAmortization of acquisition-related intangible assets\n0.9 \n%\n1.1 \n%\n1.5 \n%\nAcquisition-related costs\n0.2 \n%\n0.0 \n%\n0.0 \n%\nRestructuring costs\n1.1 \n%\n0.0 \n%\n0.6 \n%\nNon-GAAP operating margin\n25.9 \n%\n24.0 \n%\n20.1 \n%\n(1)\nThe Share-based compensation expense lines in the GAAP to non-GAAP reconciliation tables above exclude share-based compensation expense of $8 million in fiscal 2025 related to restructuring initiatives. This expense is included in the Restructuring costs lines.\nOther Income (Expense), Net\nOther income (expense), net was as follows (in millions):\nYear Ended January 31, \n2025\n2024\n2023\nTotal other income (expense), net\n$\n223 \n$\n173 \n$\n(38)\nOther income, net increased by $50 million for fiscal 2025, primarily due to increases in interest income earned from higher investment balances and increased average interest rates.\nProvision For (Benefit From) Income Taxes\nThe provision for (benefit from) income taxes was as follows (in millions):\nYear Ended January 31, \n2025\n2024\n2023\nProvision for (benefit from) income taxes\n$\n112 \n$\n(1,025)\n$\n107 \nThe income tax provision for fiscal 2025 was primarily attributable to an increase in our U.S. pretax income and income tax expenses in profitable foreign jurisdictions.\nThe income tax benefit for fiscal 2024 was primarily attributable to the $1.1 billion release of our valuation allowance related to all U.S. federal and state deferred tax assets, excluding certain state tax credits.\nThe Organization for Economic Cooperation and Development (“OECD”) released Pillar Two model rules defining a 15% global minimum tax for large multinational corporations. The OECD continues to release additional guidance and countries are implementing legislation, with widespread adoption of the Pillar Two Framework expected in the near future. Pillar Two rules are at varying stages of adoption across the jurisdictions where we operate. The specific rules and timeline to implement these rules vary by jurisdiction. The adoption of Pillar Two rules may affect our effective tax rate and current tax obligations and liabilities. While we do not currently anticipate Pillar Two rules to have a material impact on our consolidated financial results, we are monitoring developments from the OECD, governmental bodies, such as the EU, and intergovernmental economic organizations, to evaluate the impact of changing global tax laws.\n40\nTable of \nContents\nFor further information, see \nNote 17, Income Taxes\n, of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this report.\nLiquidity and Capital Resources\nAs of January 31, 2025, our principal sources of liquidity were cash, cash equivalents, and marketable securities totaling $8.0 billion, which were primarily held for working capital and general corporate purposes. Our cash equivalents and marketable securities are primarily composed of, in order from largest to smallest, corporate bonds, U.S. treasury securities, money market funds, U.S. agency obligations, commercial paper, and asset-backed securities. We have financed our operations primarily through customer payments, issuance of debt, and sales of our common stock.\nWe believe our existing cash, cash equivalents, marketable securities, cash provided by operating activities, unbilled amounts related to the remaining term of contracted noncancelable subscription agreements, which are not reflected on the Consolidated Balance Sheets, and, if necessary, our borrowing capacity under our 2022 Credit Agreement that provides for $1.0 billion of unsecured financing, are sufficient to meet our working capital, capital expenditure, share repurchase, and debt repayment needs over the next 12 months and beyond.\nOur long-term future capital requirements depend on many factors, including the effects of macroeconomic trends, customer growth rates, subscription renewal activity, headcount growth, the timing and extent of development efforts, the expansion of sales and marketing activities, the introduction of new and enhanced services offerings, infrastructure development, and our investment and acquisition activities. As part of our strategy, we may choose to seek additional debt or equity financing.\nOur cash flows were as follows (in millions):\n \nYear Ended January 31,\n \n2025\n2024\n2023\nNet cash provided by (used in):\nOperating activities\n$\n2,461 \n$\n2,149 \n$\n1,657 \nInvesting activities\n(1,781)\n(1,751)\n(2,506)\nFinancing activities\n(1,150)\n(268)\n1,204 \nEffect of exchange rate changes\n0 \n(1)\n(1)\nNet increase (decrease) in cash, cash equivalents, and restricted cash\n$\n(470)\n$\n129 \n$\n354 \nOperating Activities\nCash provided by operating activities was $2.5 billion and $2.1 billion for fiscal 2025 and 2024, respectively. In fiscal 2025, the improvement in cash flow provided by operating activities was primarily the result of higher cash collections of $868 million due to increased sales and additional interest income received of $112 million from marketable debt securities, offset by increased employee-related payments of $465 million primarily due to higher average headcount and increased supplier payments of $171 million to support our continued growth.\nInvesting Activities\nCash used in investing activities for fiscal 2025 was $1.8 billion, which primarily resulted from a net cash outflow of $667 million related to marketable debt securities activities, cash consideration, net of cash acquired, of $522 million and $303 million for the acquisitions of HiredScore and Evisort, respectively, and capital expenditures of $269 million for data center and office space projects.\nCash used in investing activities for fiscal 2024 was $1.8 billion, which primarily resulted from a net cash outflow of $1.6 billion from the timing of purchases and maturities of marketable securities and capital expenditures of $232 million for data center and office space projects, offset by proceeds of $144 million from sales of marketable securities.\nWe expect capital expenditures will be approximately $250 million in fiscal 2026. This primarily includes investments in our office facilities to support our continued growth.\n41\nTable of \nContents\nFinancing Activities\nCash used in financing activities for fiscal 2025 was $1.2 billion, which was due to repurchases of common stock of $700 million under our share repurchase programs and taxes paid of $636 million related to net share settlement of equity awards, offset by proceeds of $186 million from the issuance of common stock from employee equity plans.\nCash used in financing activities for fiscal 2024 was $268 million, which was due to repurchases of common stock of $423 million under our share repurchase programs, offset by proceeds of $155 million from the issuance of common stock from employee equity plans.\nFree Cash Flows\nIn evaluating our performance internally, we focus on long-term, sustainable growth in free cash flows. We define free cash flows, a non-GAAP financial measure, as net cash provided by operating activities minus capital expenditures. See “Non-GAAP Financial Measures” below for further information.\nFree cash flows were $2.2 billion for fiscal 2025, compared to $1.9 billion for the prior year period. The improvement was primarily the result of higher cash collections of $868 million due to increased sales and additional interest income received of $112 million from marketable debt securities, offset by increased employee-related payments of $465 million primarily due to higher average headcount, increased supplier payments of $171 million to support our continued growth, and increased capital expenditures of $37 million.\nReconciliation of our GAAP net cash provided by operating activities to non-GAAP free cash flows is as follows (in millions):\n \nYear Ended January 31,\n \n2025\n2024\n2023\nNet cash provided by operating activities\n$\n2,461 \n$\n2,149 \n$\n1,657 \nLess: Capital expenditures\n(269)\n(232)\n(364)\nFree cash flows\n$\n2,192 \n$\n1,917 \n$\n1,293 \nShare Repurchase Programs\nIn August 2024, our Board of Directors authorized the August 2024 Share Repurchase Program, under which we may repurchase up to $1.0 billion of our outstanding shares of our Class A common stock. Prior to the August 2024 Share Repurchase Program, our Board of Directors authorized a $500 million share repurchase program in February 2024, which we completed in the third quarter of fiscal 2025, and a $500 million share repurchase program in November 2022, which we completed in the first quarter of fiscal 2025. For further information, see \nNote 14, Stockholders’ Equity\n, of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this report.\nContractual Obligations\nOur contractual obligations primarily consist of borrowings under our Senior Notes, agreements for third-party hosted infrastructure platforms for business operations, leases for office space and co-location facilities for data center capacity, and other purchase obligations entered into in the ordinary course of business. The table below includes our material contractual obligations, excluding imputed interest, as of January 31, 2025 (in millions). For further information, see the associated Notes to Consolidated Financial Statements included in Part II, Item 8 of this report referenced in the table below.\nPayments Due by Period \nTotal\nShort-term\nLong-term\nReference\nSenior Notes\n (1)\n$\n3,568 \n$\n110 \n$\n3,458 \nNote 11\nThird-party hosted infrastructure platform obligations\n1,593 \n306 \n1,287 \nNote 13\nOperating leases\n433 \n115 \n318 \nNote 12\nOther purchase obligations\n550 \n161 \n389 \nNote 13\nTotal\n$\n6,144 \n$\n692 \n$\n5,452 \n(1)\nConsists of principal and interest payments on the Senior Notes.\n42\nTable of \nContents\nNon-GAAP Financial Measures\nRegulation S-K Item 10(e), “Use of non-GAAP financial measures in Commission filings,” defines and prescribes the conditions for use of non-GAAP financial information. Our measures of non-GAAP operating income, non-GAAP operating margin, and free cash flows meet the definition of non-GAAP financial measures.\nChange in Non-GAAP Financial Measures\nEffective beginning fiscal 2025, we exclude certain acquisition-related costs and restructuring costs from our non-GAAP results as they may vary from period-to-period independent of the operating performance of our business. Prior period amounts have been recast to conform to this presentation.\nNon-GAAP Operating Income and Non-GAAP Operating Margin\nWe use the non-GAAP financial measures of non-GAAP operating income and non-GAAP operating margin to understand and compare operating results across accounting periods, for internal budgeting and forecasting purposes, for short- and long-term operating plans, and to evaluate our financial performance. We believe that these non-GAAP financial measures reflect our ongoing business in a manner that allows for meaningful period-to-period comparisons and analysis of trends in our business.\nOur non-GAAP operating income and non-GAAP operating margin exclude the components listed below. For the reasons set forth below, we believe that excluding these components provides useful information to investors and others in understanding and evaluating our operating results and prospects in the same manner as management, in comparing financial results across accounting periods and to those of peer companies, and to better understand the long-term performance of our core business.\n•\nShare-based compensation expense. \nShare-based compensation primarily consists of non-cash expenses for employee RSUs and our  employee stock purchase plan (“ESPP”). Although share-based compensation is an important aspect of the compensation of our employees and executives, this expense is determined using a number of factors, including our stock price, volatility, and forfeiture rates, that are beyond our control and generally unrelated to operational decisions and performance in any particular period. Further, share-based compensation expense is not reflective of the value ultimately received by the grant recipients.\n•\nEmployer payroll tax-related items on employee stock transactions\n. We exclude the employer payroll tax-related items on employee stock transactions in order to show the full effect that excluding share-based compensation expense has on our operating results. Similar to share-based compensation expense, this tax expense is dependent on our stock price and other factors that are beyond our control and do not correlate to the operation of our business.\n•\nAmortization of acquisition-related intangible assets\n. For business combinations, we generally allocate a portion of the purchase price to intangible assets. The amount of the allocation is based on estimates and assumptions made by management and is subject to amortization. The amount of purchase price allocated to intangible assets and the term of the related amortization can vary significantly and are unique to each acquisition and thus we do not believe it is reflective of our ongoing operations. Although we exclude the amortization of acquisition-related intangible assets from these non-GAAP financial measures, we believe that it is important for investors to understand that such intangible assets were recorded as part of purchase accounting and contribute to revenue generation.\n•\nAcquisition-related costs.\n Acquisition-related costs include direct transaction costs, such as due diligence and advisory fees, and certain compensation and integration-related expenses. We exclude the effects of acquisition-related costs as we believe these transaction-specific expenses are inconsistent in amount and frequency and do not correlate to the operation of our business.\n•\nRestructuring costs. \nRestructuring costs are associated with a formal restructuring plan and are primarily related to employee severance, the closure of facilities, and cancellation of certain contracts. We exclude these expenses because they are not reflective of ongoing business and operating results.\nFree Cash Flows\nWe define free cash flows as net cash provided by operating activities minus capital expenditures. We use free cash flows as a measure of financial progress in our business, as it balances operating results, cash management, and capital efficiency. We believe information regarding free cash flows provides investors and others with an enhanced view of cash flow generation from the ongoing operations of our business.\n43\nTable of \nContents\nLimitations on the Use of Non-GAAP Financial Measures\nA limitation of our non-GAAP financial measures of non-GAAP operating income, non-GAAP operating margin, and free cash flows is that they do not have uniform definitions. Our definitions will likely differ from the definitions used by other companies, including peer companies, and therefore comparability may be limited. Further, these non-GAAP financial measures have certain limitations as they do not reflect all items of expense or cash that affect our operations and are reflected in the corresponding GAAP financial measures. In the case of share-based compensation, if we did not pay out a portion of compensation in the form of share-based compensation, the cash salary expense included in operating expenses would be higher, which would affect our cash position.\nWe compensate for these limitations by reconciling the non-GAAP financial measures to the most comparable GAAP financial measures. These non-GAAP financial measures should be considered in addition to, not as a substitute for or in isolation from, measures prepared in accordance with GAAP. We encourage investors and others to review our financial information in its entirety, not to rely on any single financial measure, and to view our non-GAAP financial measures in conjunction with the most comparable GAAP financial measures.\nSee “Results of Operations—Operating Income (Loss) and Operating Margin” for reconciliations from the most directly comparable GAAP financial measures of GAAP operating income (loss) and GAAP operating margin, to the non-GAAP financial measures of non-GAAP operating income and non-GAAP operating margin, for fiscal 2025, 2024, and 2023.\nSee “Liquidity and Capital Resources—Free Cash Flows” for a reconciliation from the most comparable GAAP financial measure, net cash provided by operating activities, to the non-GAAP financial measure, free cash flows, for fiscal 2025, 2024, and 2023.\nCritical Accounting Policies and Estimates\nOur consolidated financial statements are prepared in accordance with GAAP. The preparation of these consolidated financial statements requires us to make estimates, judgments, and assumptions that affect the reported amounts of assets, liabilities, revenues, costs and expenses, and related disclosures. On an ongoing basis, we evaluate our estimates, judgments, and assumptions. Our actual results may differ from these estimates under different assumptions or conditions.\nWe believe that of our significant accounting policies, which are described in \nNote 2, Accounting Standards and Significant Accounting Policies\n, of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this report, the following accounting policies and specific estimates involve a greater degree of judgment and complexity. Accordingly, these are the policies and estimates we believe are the most critical to aid in fully understanding and evaluating our consolidated financial condition and operating results.\nRevenue Recognition\nWe derive our revenues from subscription services and professional services. Revenues are recognized when control of these services is transferred to our customers, in an amount that reflects the consideration we expect to be entitled to receive in exchange for services rendered.\nWe determine revenue recognition through the following steps:\n•\nIdentification of the contract, or contracts, with a customer;\n•\nIdentification of the performance obligations in the contract;\n•\nDetermination of the transaction price;\n•\nAllocation of the transaction price to the performance obligations in the contract; and\n•\nRecognition of revenues when, or as, we satisfy a performance obligation.\nWe believe the area we apply the most critical judgment when determining revenue recognition relates to the identification of distinct performance obligations. \nIdentification of Performance Obligations\nA performance obligation is a promise in a contract with a customer to transfer products or services that are distinct. Our contracts with customers may include multiple promises to transfer services to a customer. Determining whether products and services are distinct performance obligations that should be accounted for separately or combined as a single performance obligation may require significant judgment that requires us to assess the nature of the promise and the value delivered to the customer. \n44\nTable of \nContents\nOur primary performance obligations consist of subscription services and professional services. We satisfy these performance obligations over time as we transfer the promised services to our customers. Subscription services are made up of a daily requirement to deliver the service to the customer. Each day the delivery of the service provides value to the customer and each day represents a measure toward completion of the service. As such, subscription services meet the criteria to be a series of distinct services. In determining whether professional services are distinct, we consider the following factors for each professional services agreement: availability of the services from other vendors, the nature of the professional services, the timing of when the professional services contract was signed in comparison to the subscription start date, and the contractual dependence of the service on the customer’s satisfaction with the professional services work. To date, we have concluded that professional services included in contracts with multiple performance obligations are generally distinct as the professional services are not interrelated with subscription services nor do they result in significant customization of the subscription service. As such, we view professional services as a performance obligation to the customer. \nAt contract inception, we evaluate whether two or more contracts should be combined and accounted for as a single contract and whether the combined or single contract includes more than one performance obligation. We combine contracts entered into at or near the same time with the same customer if we determine that the contracts are negotiated as a package with a single commercial objective; the amount of consideration to be paid in one contract depends on the price or performance of the other contract; or the services promised in the contracts are a single performance obligation. For contracts that contain multiple performance obligations, we assess each promise separately and allocate the transaction price on a relative standalone selling price (“SSP”) basis. We apply significant judgment in identifying and evaluating any terms and conditions in contracts which may impact revenue recognition.\nDeferred Commissions\nSales commissions earned by our sales force are considered incremental and recoverable costs of obtaining a contract with a customer. Sales commissions for new revenue contracts are capitalized and then amortized on a straight-line basis over a period of benefit that we have determined to be five years. We determined the period of benefit by exercising judgment, taking into consideration our customer contracts, our technology, and other factors. \nPeriodically, we review whether events or changes in circumstances have occurred that could impact the period of benefit. Any future changes in circumstances around the terms of our initial and renewal contracts, customer attrition, underlying technology life, and certain other factors may materially change the period of benefit and therefore the amortization amounts recognized on the Consolidated Statements of Operations. There was no change to the period of benefit during the periods presented.\nIncome Taxes\nWe record a provision for, or benefit from, income taxes for the anticipated tax consequences of the reported results of operations using the asset and liability method. Under this method, we recognize deferred tax assets and liabilities for the expected future tax consequences of temporary differences between the financial reporting and tax basis of assets and liabilities, as well as for operating loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using the tax rates that are expected to apply to taxable income for the years in which those tax assets and liabilities are expected to be realized or settled. A valuation allowance is established when necessary to reduce deferred tax assets to the net amount that is more likely than not to be realized. Significant judgment is required in determining any valuation allowance recorded against deferred tax assets. In assessing the need for a valuation allowance, we consider all available evidence, both positive and negative, including past operating results, estimates of future taxable income, and the feasibility of tax planning strategies. In the event that we change our determination as to the amount of deferred tax assets that can be realized, we will adjust our valuation allowance with a corresponding impact to the provision for (benefit from) income taxes in the period in which such determination is made.\nWe recognize the tax benefit of an uncertain tax position only if it is more likely than not that the position is sustainable upon examination by the taxing authority, based on the technical merits. The tax benefit recognized is measured as the largest amount of benefit which is greater than 50% likely to be realized upon settlement with the taxing authority. Significant judgment is required to evaluate uncertain tax positions. Our evaluations are based upon a number of factors, including changes in facts or circumstances, changes in tax law or guidance, correspondence with tax authorities during the course of audits, and effective settlement of audit issues. Changes in the recognition or measurement of uncertain tax positions could result in material increases or decreases in our provision for (benefit from) income taxes in the period in which we make the change. \n45\nTable of \nContents\nBusiness Combinations, Goodwill, and Acquisition-Related Intangible Assets\nWe allocate the purchase consideration of acquired companies to tangible and intangible assets acquired and liabilities assumed based on their estimated fair values at the acquisition date, with the excess recorded to goodwill. The purchase price allocation process requires us to make significant estimates and assumptions related to the fair value of identifiable intangible assets. Critical estimates used in valuing certain intangible assets include, but are not limited to, future expected cash flows from acquired customer contracts, expected life cycle and innovation timelines for acquired technologies, forecasted customer attrition rates and revenue growth, the fair value of pre-existing relationships, royalty rates for comparable market technologies, and discount rates. The amounts and estimated useful lives assigned to acquisition-related intangible assets impact the amount and timing of future amortization expense.\nRecent Accounting Pronouncements\nSee \nNote 2, Accounting Standards and Significant Accounting Policies\n, of the Notes to Consolidated Financial Statements included in Part II, Item 8 of this report for a full description of recent accounting pronouncements.\n46\nTable of \nContents",
  "item2": null
}