{
  "source_file": "wdc-20251003.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.    \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis contains forward-looking statements within the meaning of the federal securities laws and should be read in conjunction with the disclosures we make concerning risks and other factors that may affect our business and operating results. You should read this information in conjunction with the unaudited Condensed Consolidated Financial Statements and the notes thereto included in this Quarterly Report on Form 10-Q, and the audited Consolidated Financial Statements and notes thereto included in Part II, Item 8 of our 2025 Annual Report on Form 10-K. See also “Forward-Looking Statements” immediately prior to Part I, Item 1 in this Quarterly Report on\n \nForm 10‑Q.\nUnless otherwise indicated, references herein to specific years and quarters are to our fiscal years and fiscal quarters. As used herein, the terms “we,” “us,” “our,” and the “Company” refer to Western Digital Corporation and its subsidiaries.\nOur Company\nWe are a leading developer, manufacturer, and provider of data storage devices and solutions based on hard disk drive (“HDD”) technology. We leverage our capability in the HDD industry primarily for the cloud and hyperscale data center markets. HDDs are critical components in the worldwide data infrastructure market, powering the digital economy. HDDs provide reliable, cost-effective, high-capacity storage needs for a wide range of applications, ranging from cloud data centers, enterprise storage systems, edge computing, video surveillance to client and consumer.\nOur broad portfolio of technology and products addresses our customers’ storage needs through multiple end markets: “Cloud,” “Client” and “Consumer”. Cloud is comprised primarily of products for public or private cloud environments and enterprise customers. Through the Client end market, we provide our original equipment manufacturer (“OEM”) and channel customers a broad array of high-performance HDD solutions across desktop and notebooks. The Consumer end market provides a broad range of retail and other end-user products, which capitalize on the strength of our product brand recognition and vast points of presence around the world.\nOur fiscal year ends on the Friday nearest to June 30 and typically consists of 52 weeks. Approximately every five to six years, we report a 53-week fiscal year to align the fiscal year with the foregoing policy. Fiscal year 2026, which will end on July 3, 2026, will be comprised of 53 weeks, with the first quarter consisting of 14 weeks and the remaining quarters consisting of 13 weeks each. Fiscal year 2025, which ended on June 27, 2025, was comprised of 52 weeks, with all quarters presented consisting of 13 weeks.\nKey Developments\nSeparation of Business Units\nOn February 21, 2025 (the “Separation Date”), we completed the separation of our HDD and Flash business units (the “Separation”) to create two independent public companies, with Western Digital continuing our existing HDD business and Sandisk Corporation (“Sandisk”), formerly a wholly-owned subsidiary of the Company, holding the Flash business. We believe the Separation has better positioned us as a pure-play HDD company that can execute innovative technology and product development, capitalize on unique growth opportunities, extend our leadership position, operate more efficiently, and pursue capital allocation strategies to maximize long-term shareholder value. As part of the Separation, we initially retained 28.8 million shares of Sandisk common stock, of which 21.3 million shares were used in the three months ended June 27, 2025 in a tax-free exchange to reduce approximately $800 million principal amount of our term loan A-3. We expect to monetize our remaining stake in Sandisk within one year from the Separation Date.\nInformation provided herein is presented on a continuing operations basis to reflect the impact of the Separation. See Part I, Item 1, Note 4, \nDiscontinued Operations\n, of the Notes to Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q for additional information regarding the Separation.\n36\nTable of Contents\nMacroeconomic Conditions and Outlook\nThe increasing long-term demand for data storage in the cloud is benefiting our HDD business. The adoption of artificial intelligence (“AI”) and data-driven workloads is driving growth in data storage as well. This creates an accelerated demand for high-capacity drives, resulting in greater manufacturing complexity and longer production lead times. In response, customers are partnering with us earlier to support their future growth requirements and are extending the duration of their commercial arrangements.\nThe United States has been making changes to its trade policy, including increasing tariffs on imports, in some cases significantly. Several of these tariff actions have been followed by announcements of limited exemptions, temporary pauses or other changes. These actions have caused substantial uncertainty and have also resulted in retaliatory measures. Our business and results of operations have not been materially impacted through the first quarter of 2026 as a result of the recent tariff actions, but we are actively monitoring developments and exploring opportunities to mitigate potential future tariff and retaliatory actions. For additional information, please see Part I, Item 1A, \nRisk Factors\n, included in our 2025 Annual Report on Form 10-K.\n37\nTable of Contents\nResults of Operations\nFirst Quarter Overview\nThe following table sets forth, for the periods presented, selected summary information from our Condensed Consolidated Statements of Operations by dollars and percentage of net revenue\n(1)\n:\nThree Months Ended\nOctober 3,\n2025\nSeptember 27,\n2024\n$ Change\n% Change\n$ in millions\nRevenue, net\n$\n2,818 \n100.0 \n%\n$\n2,212 \n100.0 \n%\n$\n606 \n27 \n%\nCost of revenue\n1,591 \n56.5 \n1,406 \n63.6 \n185 \n13 \nGross profit\n1,227 \n43.5 \n806 \n36.4 \n421 \n52 \nOperating expenses:\nResearch and development\n294 \n10.4 \n262 \n11.8 \n32 \n12 \nSelling, general and administrative\n138 \n4.9 \n204 \n9.2 \n(66)\n(32)\nLitigation matter\n— \n— \n3 \n0.1 \n(3)\n(100)\nBusiness realignment charges\n3 \n0.1 \n3 \n0.1 \n— \n— \nTotal operating expenses\n435 \n15.4 \n472 \n21.3 \n(37)\n(8)\nOperating income\n792 \n28.1 \n334 \n15.1 \n458 \n137 \nInterest and other income (expense):\nInterest income\n17 \n0.6 \n7 \n0.3 \n10 \n143 \nInterest expense\n(59)\n(2.1)\n(99)\n(4.5)\n40 \n(40)\nGain on retained interest in Sandisk\n611 \n21.7 \n— \n— \n611 \nn/a\nOther income (expense), net\n(24)\n(0.9)\n1 \n— \n(25)\n(2,500)\nTotal interest and other income (expense), net\n545 \n19.3 \n(91)\n(4.1)\n636 \n(699)\nIncome before taxes\n1,337 \n47.4 \n243 \n11.0 \n1,094 \n450 \nIncome tax expense\n155 \n5.5 \n90 \n4.1 \n65 \n72 \nNet income from continuing operations\n$\n1,182 \n41.9 \n%\n$\n153 \n6.9 \n%\n$\n1,029 \n673 \n%\n(1)    \nPercentages may not total due to rounding.\nThe following table sets forth for the periods presented, summary information regarding our disaggregated revenue:\nThree Months Ended\nOctober 3,\n2025\nSeptember 27,\n2024\n(in millions)\nRevenue by end market\nCloud\n$\n2,510 \n$\n1,909 \nClient \n146 \n139 \nConsumer\n162 \n164 \nTotal revenue\n$\n2,818 \n$\n2,212 \nRevenue by geography\nAsia\n$\n1,175 \n$\n686 \nAmericas\n1,100 \n1,247 \nEurope, Middle East and Africa\n543 \n279 \nTotal revenue\n$\n2,818 \n$\n2,212 \n(1)    \nNet revenue is attributed to geographic regions based on the ship-to location of the customer.\n38\nTable of Contents\nNet Revenue\nComparison of Three Months Ended October 3, 2025 to Three Months Ended September 27, 2024\nNet revenue increased by 27% for the three months ended October 3, 2025 from the comparable period in the prior year, primarily driven by a 3% increase in units sold and a 19% increase in average selling price per unit, primarily as a result of a shift in product mix to higher capacity drives. In addition, approximately 4 percentage points of growth was due to an increase in data storage systems revenues.\nCloud revenue increased by 31% for the three months ended October 3, 2025 from the comparable period in the prior year, primarily driven by a 5% increase in units sold and a 19% increase in average selling price per unit. The increase in units sold was driven by higher shipments of our high-capacity enterprise products. The increase in average selling price per unit was primarily due to a shift in product mix to higher capacity drives. In addition, approximately 6 percentage points of growth was due to an increase in data storage systems revenues.\nClient revenue increased by 5% for the three months ended October 3, 2025 from the comparable period in the prior year, primarily driven by an 11% increase in average selling price per unit, partially offset by a 6% decrease in units sold. The increase in average selling price per unit and decrease in units were both due to a shift in product mix to higher capacity drives.\nConsumer revenue for the three months ended October 3, 2025 was relatively flat compared to the comparable period in the prior year with both volume and pricing being relatively consistent.\nNet revenue by geography for the three months ended October 3, 2025 compared to the prior year period reflects higher revenue in the Asia and Europe, Middle East and Africa regions as customers expand data center capacity in these regions.\nOur top 10 customers accounted for 77% of our net revenue for the three months ended October 3, 2025, compared to 65% of our net revenue for the three months ended September 27, 2024. For the three months ended October 3, 2025, three customers accounted for 18%, 16% and 14%, respectively, of our net revenue, and for the three months ended September 27, 2024, one customer accounted for 18% of our net revenue.\nGross Profit and Gross Margin\nGross profit increased by $421 million for the three months ended October 3, 2025 from the comparable period in the prior year, primarily due to higher product shipments and improved pricing. Gross margin increased by 7 percentage points year over year, primarily due to higher volumes, product cost reductions and improved pricing.\n \nOperating Expenses\nResearch and development (“R&D”) expense increased by $32 million for the three months ended October 3, 2025 from the comparable period in the prior year. The increase was driven by higher variable compensation and continued investment for innovation, technology and product development.\nSelling, general and administrative (“SG&A”) expense decreased by $66 million for the three months ended October 3, 2025 from the comparable period in the prior year. The decrease primarily reflects $37 million lower compensation and benefits, which was driven by certain general corporate overhead roles in the prior year that have since transferred to Sandisk and were not backfilled after the Separation. The decrease also reflects $30 million lower service fees resulting from reduced marketing activities and legal costs.\nFor information regarding litigation matters, see Part I, Item 1, Note 14, \nLegal Proceedings,\n of the Notes to Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q.\nFor information regarding Business realignment charges, see Part I, Item 1, Note 10, \nBusiness Realignment Charges,\n of the Notes to Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q.\n39\nTable of Contents\nInterest and Other Income (Expense)\nTotal interest and other income (expense), changed by $636 million for the three months ended October 3, 2025 from the comparable period in the prior year. The change primarily reflects an unrealized gain of $611 million on our retained interest in Sandisk based on the mark-to-market value as of October 3, 2025, and lower interest expense of $40 million, which reflects the reduction in our debt.\nIncome Taxes\nPreviously, the Tax Cuts and Jobs Act of 2017 (“TCJA”) eliminated the ability to deduct R&D expenditures in the year incurred, requiring capitalization and amortization under Internal Revenue Code Section 174. On July 4, 2025, the One Big Beautiful Bill Act of 2025 (“OBBBA”) was signed into law, which includes broad tax reform provisions that extend and modify key elements of the TCJA. Notably, the new legislation now allows an option for the immediate expensing of domestic R&D expenditures, beginning with 2026. The legislation also includes favorable modifications to international tax provisions, including changes to the Global Intangible Low-Taxed Income regime and enhancements to the Foreign-Derived Deduction Eligible Income (FDDEI) deduction that will become effective for us in 2027.\nOn August 16, 2022, the Inflation Reduction Act of 2022, was signed into law, which contained, among other things, a corporate alternative minimum tax (“CAMT”) of 15% on corporations with three-year average annual adjusted financial statement income (“AFSI”) exceeding $1.0 billion. Although CAMT became effective for us beginning with 2024, we were not subject to the CAMT of 15% for 2024 and 2025. We do not expect to be subject to CAMT in 2026 as our annual average AFSI did not exceed $1.0 billion for the preceding three-year period.\nOn December 20, 2021, the Organization for Economic Co-operation and Development G20 (“OECD/G20”) Inclusive Framework on Base Erosion and Profit Shifting released Model Global Anti-Base Erosion rules under Pillar Two. Several non-U.S. jurisdictions have either enacted legislation or announced their intention to enact future legislation to adopt certain or all components of Pillar Two, also known as Global Minimum Tax (“GMT”). For 2026, we are subject to GMT in Thailand and the Philippines.\nThe following table presents our Income tax expense and the effective tax rate:\n \nThree Months Ended\n \nOctober 3,\n2025\nSeptember 27,\n2024\n$ in millions\nIncome before taxes\n$\n1,337\n$\n243\nIncome tax expense\n155\n90\nEffective tax rate\n12%\n37%\nThe primary drivers of the difference between the effective tax rate for the three months ended October 3, 2025 and the U.S. Federal statutory rate of 21% are the relative mix of earnings and losses by jurisdiction, the deduction for FDDEI, tax credits and the gain on the retained Sandisk interest being tax-free due to the Separation of the Flash business. These resulted in decreases to our effective tax rate below the U.S. Federal statutory rate for the three months ended October 3, 2025. Our income tax provision for the three months ended October 3, 2025 includes GMT taxes for Thailand and the Philippines, countries for which we maintain tax holidays.\nThe primary drivers of the difference between the effective tax rate for the three months ended September 27, 2024 and the U.S. Federal statutory rate of 21% were the relative mix of earnings and losses by jurisdiction, tax credits, and tax holidays in Thailand and the Philippines. In addition, the effective tax rate for the three months ended September 27, 2024 includes the discrete effect of a net decrease of $30 million to the liability for unrecognized tax benefits, which includes interest and offsetting tax benefits, as a result of adjustments to align with IRS calculations. \n40\nTable of Contents\nLiquidity and Capital Resources\nThe following table summarizes our statements of cash flows. Cash flows for the prior year period are presented on a consolidated basis and activity related to discontinued operations has not been segregated. See Part I, Item 1, Note 4, \nDiscontinued Operations\n, of the Notes to Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q for additional cash flow information related to our discontinued operations. \nThree Months Ended\n \nOctober 3,\n2025\nSeptember 27,\n2024\n(in millions)\nNet cash provided by (used in):\nOperating activities\n$\n672 \n$\n34 \nInvesting activities\n(57)\n(45)\nFinancing activities\n(678)\n(102)\nEffect of exchange rate changes on cash\n(3)\n10 \nCash and cash equivalents reclassified to assets held for sale\n— \n(71)\nNet decrease in cash and cash equivalents\n$\n(66)\n$\n(174)\nIn August 2024, we filed a shelf registration statement (the “Shelf Registration Statement”) with the Securities and Exchange Commission that expires in August 2027. The Shelf Registration Statement allows us to offer and sell shares of common stock, preferred stock, warrants, and debt securities. We may use the Shelf Registration Statement or other capital sources, including other offerings of equity or debt securities or the credit markets, to satisfy future financing needs, including planned or unanticipated capital expenditures, investments, debt repayments or other expenses. Any such additional financing will be subject to market conditions and may not be available on terms acceptable to us or at all.\nWe currently expect our capital expenditures for 2026 to be approximately 4% to 6% of our net revenue.\nWe believe our cash and cash equivalents and our available 2027 Revolving Credit Facility (as defined below) will be sufficient to meet our working capital, debt, dividend and capital expenditure needs for at least the next twelve months and for the foreseeable future thereafter. We believe we can also access the various debt and equity capital markets to further supplement our liquidity position if necessary. Our ability to sustain our working capital position is subject to a number of risks that we discuss in Part II, Item 1A, \nRisk Factors\n, in this Quarterly Report on Form 10-Q and in Part I, Item 1A, \nRisk Factors\n, in our 2025 Annual Report on Form 10-K.\nA total of $1.23 billion and $0.98 billion of our cash and cash equivalents was held by our foreign subsidiaries as of October 3, 2025 and June 27, 2025, respectively. There are no material tax consequences that were not previously accrued for on the repatriation of this cash.\nOur cash equivalents are primarily invested in money market funds that invest in U.S. Treasury securities and U.S. Government agency securities. In addition, from time to time, we also invest directly in certificates of deposit, asset-backed securities and corporate and municipal notes and bonds.\n41\nTable of Contents\nOperating Activities\nNet cash provided by operating activities primarily consists of net income, adjusted for non-cash charges, plus or minus changes in operating assets and liabilities. Net cash used for changes in operating assets and liabilities was $99 million for the three months ended October 3, 2025, compared to $753 million for the three months ended September 27, 2024. The year over year decrease largely reflects a $423 million improvement in timing and collection of accounts receivable, a $132 million improvement from accrued expenses resulting from a significant reduction in our derivative hedging activities since the Separation of the Flash business, and a $501 million improvement in other assets and liabilities driven by the timing of recognition and realization of income taxes receivable. These were partially offset by a $426 million increase in cash used driven by the timing of recognition and payment of income taxes.\nInvesting Activities\nNet cash used in investing activities for the three months ended October 3, 2025 primarily consisted of $73 million in capital expenditures, net of proceeds from disposals of assets. Net cash used in investing activities for the three months ended September 27, 2024 primarily consisted of $95 million in capital expenditures, net of proceeds from disposals of assets, partially offset by $47 million in net proceeds from activity related to Flash Ventures.\nFinancing Activities\nNet cash used in financing activities for the three months ended October 3, 2025 primarily consisted of $553 million for share repurchases, $39 million for dividends on our common stock and Preferred Shares, $55 million for taxes paid on vested stock awards under employee stock plans and $31 million for scheduled repayments on our term loan. Net cash used in financing activities for the three months ended September 27, 2024 primarily consisted of $64 million for taxes paid on vested stock awards under employee stock plans and $38 million for scheduled repayments on our term loan. During the three months ended September 27, 2024, we also drew and repaid $150 million under our 2027 Revolving Credit Facility.\nOff-Balance Sheet Arrangements\nOther than certain indemnification provisions (see “Short- and Long-term Liquidity – \nPurchase Obligations and Other Commitments\n” below), we do not have any other material off-balance sheet financing arrangements or liabilities, guarantee contracts, retained or contingent interests in transferred assets, or any other obligation arising out of a material variable interest in an unconsolidated entity. We do not have any majority-owned subsidiaries that are not included in the Condensed Consolidated Financial Statements. Additionally, we do not have an interest in, or relationships with, any variable interest entities.\n42\nTable of Contents\nShort- and Long-term Liquidity\nMaterial Cash Requirements\nThe following is a summary of our known material cash requirements as of October 3, 2025. In addition, see the discussions further below related to liability for unrecognized tax benefits, litigation matters, cash dividend program, dividend rights with respect to the Preferred Shares, global minimum tax, foreign exchange contracts and indemnifications.\nTotal\n1 Year (Remaining Nine Months of 2026)\n2-3 Years (2027-2028)\n4-5 Years (2029-2030)\nMore than 5 Years (Beyond 2030)\n(in millions)\nLong-term debt, including current portion\n(1)\n$\n4,717 \n$\n2,194 \n$\n1,523 \n$\n500 \n$\n500 \nInterest on debt\n448 \n146 \n202 \n69 \n31 \nOperating leases\n154 \n25 \n53 \n30 \n46 \nPurchase obligations and other commitments\n62 \n35 \n27 \n— \n— \nTotal\n$\n5,381 \n$\n2,400 \n$\n1,805 \n$\n599 \n$\n577 \n(1)\nPrincipal portion of debt, excluding issuance costs.\nLiability for Unrecognized Tax Benefits\nAs of October 3, 2025, the liability for unrecognized tax benefits (excluding accrued interest and penalties) was $598 million. Accrued interest and penalties related to unrecognized tax benefits are recognized in liabilities for uncertain tax positions and are recorded in the provision for income taxes. Accrued interest and penalties included in our liability related to unrecognized tax benefits as of October 3, 2025 was $93 million. Of these amounts, approximately $130 million could result in potential cash payments to be made within the next twelve months.\n Litigation Matters\nFor additional information on our litigation matters, see Part I, Item 1, Note 14,\n Legal Proceedings\n, of the Notes to Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q.\nCash Dividend Program\nOn April 29, 2025, our Board of Directors authorized the adoption of a cash dividend program. Under the cash dividend program, holders of our common stock will receive dividends when and as declared by our Board of Directors. During the three months ended October 3, 2025, we paid cash dividends of $0.10 per share of our outstanding common stock, totaling $34 million, plus $1 million paid to holders of our Preferred Shares in accordance with their participation rights.\nSubsequent to quarter-end, on October 29, 2025, our Board of Directors declared a cash dividend of $0.125 per share of our common stock, which will be paid on December 18, 2025 to our shareholders of record as of the close of business on December 4, 2025.\nWe may modify, suspend, or cancel our cash dividend program in any manner and at any time. The amount of future dividends under our cash dividend program, and the declaration and payment thereof, will be based upon all relevant factors, including our financial position, results of operations, cash flows, capital requirements and restrictions under our Loan Agreement and other financing agreements, and shall be in compliance with applicable law.\nDividend Rights\nAs of October 3, 2025, 235,000 shares of our Preferred Shares remained outstanding. These shares are entitled to cumulative preferred dividends and will also participate in any dividends declared for common shareholders on an as-converted equivalent basis. See Part II, Item 8, Note 12, \nShareholders’ Equity and Convertible Preferred Stock,\n of the Notes to Consolidated Financial Statements in our 2025 Annual Report on Form 10-K and Part I, Item 1, Note 12, \nShareholders’ Equity and Convertible Preferred Stock\n, of the Notes to Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q for more information regarding the dividend provisions.\n43\nTable of Contents\nDebt\nAs described in Part I, Item 1, Note 7, \nDebt\n, of the Notes to Condensed Consolidated Financial Statements included in this Quarterly Report on Form 10-Q, the Company issued $1.60 billion aggregate principal amount of convertible senior notes in November 2023, which bear interest at an annual rate of 3.00% and mature on November 15, 2028 (the “2028 Convertible Notes”). The 2028 Convertible Notes are convertible at the option of any holder beginning August 15, 2028 at a conversion price of approximately $37.77 per share of common stock (as adjusted in accordance with the indenture as a result of the Separation and the payment of dividends on the Company’s common stock). Prior to August 15, 2028, if the trading price of our common stock remains above 130% of the conversion price for at least 20 trading days (whether or not consecutive) during the 30 consecutive trading-day period prior to the end of a calendar quarter, holders of the 2028 Convertible Notes would have the right to convert the 2028 Convertible Notes during the next succeeding calendar quarter. The 2028 Convertible Notes are also convertible prior to August 15, 2028 upon the occurrence of certain corporate events. Upon any conversion of the 2028 Convertible Notes, we will pay cash for the aggregate principal amount of the notes to be converted and pay or deliver, as the case may be, cash, shares of our common stock or a combination thereof, at our election, in respect of the remainder, if any, of our conversion obligation in excess of the aggregate principal amount of the notes being converted. On or after November 15, 2026, we may redeem for cash, at par plus accrued interest, all or any portion of the 2028 Convertible Notes, at our option, if the last reported sale price of our common stock has been at least 130% of the conversion price then in effect for at least 10 trading days during any 20 consecutive trading day period immediately preceding the date of our redemption notice.\nThe sale price conditional conversion feature of the 2028 Convertible Notes was triggered during the calendar quarter ended September 30, 2025 and, accordingly, the holders of the 2028 Convertible Notes have the right to convert the notes during the succeeding calendar quarter ending December 31, 2025. As a result, the 2028 Convertible Notes have been classified as Current portion of long-term debt in the Condensed Consolidated Financial Statements as of October 3, 2025. The Company will continue to evaluate the conversion feature quarterly to determine if the 2028 Convertible Notes become convertible in future periods.\nIn addition to our outstanding debt, as of October 3, 2025, we had $1.25 billion available for borrowing under our revolving credit facility maturing in January 2027 (the “2027 Revolving Credit Facility”), subject to customary conditions under the Loan Agreement. The agreements governing our credit facilities each include limits on secured indebtedness and certain types of unsecured subsidiary indebtedness and require us and certain of our subsidiaries to provide guarantees and collateral to the extent the conditions providing for such guarantees and collateral are met. The Loan Agreement requires us to comply with a financial leverage ratio covenant. As of October 3, 2025, we were in compliance with the financial covenant. Additional information regarding our indebtedness, including information about availability under our 2027 Revolving Credit Facility and the principal repayment terms, interest rates, covenants, collateral and other key terms of our outstanding indebtedness, is included in Part II, Item 8, Note 8, \nDebt\n, of the Notes to Consolidated Financial Statements included in our 2025 Annual Report on Form 10-K and Note 7, \nDebt\n, of the Notes to Condensed Consolidated Financial Statements included in Part I, Item 1 of this Quarterly Report on Form 10-Q.\nWe may issue additional debt securities in the future that may be guaranteed by our 100% owned domestic subsidiary, Western Digital Technologies, Inc. (“Guarantor” and, together with Western Digital Corporation, the “Obligor Group”). Such guarantees may be full and unconditional, joint and several, on a secured or unsecured, subordinated or unsubordinated basis, and may be subject to certain customary guarantor release conditions. We conduct operations almost entirely through our subsidiaries. Accordingly, the Obligor Group’s cash flow and ability to service any guaranteed registered debt securities will depend on the earnings of our subsidiaries and the distribution of those earnings to the Obligor Group, including the earnings of the non-guarantor subsidiaries, whether by dividends, loans or otherwise. Holders of such guaranteed registered debt securities would have a direct claim only against the Obligor Group.\nThe following tables include summarized financial information for the Obligor Group. The financial information for the Obligor Group is presented on combined basis, excluding intercompany balances and transactions between the Company and the Guarantor, excluding net intercompany balances between the Obligor Group and non-guarantor subsidiaries, and excluding investments in and equity in the earnings of non-guarantor subsidiaries. The Obligor Group’s amounts due from, amounts due to, and transactions with non-guarantor subsidiaries have been presented in separate line items in the tables below.\n44\nTable of Contents\nThe assets and liabilities of the Obligor Group include the following:\nOctober 3,\n2025\nJune 27,\n2025\n(in millions)\nCurrent assets\n$\n3,115 \n$\n2,992 \nNon-current assets\n4,502 \n4,553 \nNet intercompany payables to non-guarantor subsidiaries\n(1,679)\n(1,543)\nCurrent liabilities\n3,317 \n3,800 \nNon-current liabilities\n2,848 \n2,873 \nThe operating results of the Obligor Group include the following:\nThree Months Ended\nYear Ended\nOctober 3,\n2025\nJune 27,\n2025\n(in millions)\nNet sales\n$\n1,158 \n$\n5,249 \nGross profit\n459 \n1,941 \nOperating income\n107 \n279 \nNet income (loss)\n550 \n(320)\nResults for the Obligor Group include the following transactions with non-guarantor subsidiaries:\nThree Months Ended\nYear Ended\nOctober 3,\n2025\nJune 27,\n2025\n(in millions)\nIntercompany revenue\n$\n1,715 \n$\n1,378 \nNet intercompany interest (income) expense\n— \n(4)\nIntercompany dividend income\n33 \n2,215 \nPurchase Obligations and Other Commitments\nIn the normal course of business, we enter into purchase orders with suppliers for the purchase of components used to manufacture our products. These purchase orders generally cover forecasted component supplies needed for production during the next quarter, are recorded as a liability upon receipt of the components, and generally may be changed or canceled at any time prior to shipment of the components. We also enter into long-term agreements with suppliers that contain fixed future commitments, which are contingent on certain conditions, such as performance, quality and technology of the vendor’s components. These arrangements are included under “Purchase obligations and other commitments” in the table above.\nGlobal Minimum Tax\nAs of October 3, 2025, we have accrued GMT taxes of $21 million that are not expected to be paid until the second quarter of 2028.\nForeign Exchange Contracts\nWe purchase foreign exchange contracts to hedge the impact of foreign currency fluctuations on certain underlying assets, liabilities and commitments for Operating expenses and product costs denominated in foreign currencies. See Part I, Item 3, \nQuantitative and Qualitative Disclosures About Market Risk\n, included in this Quarterly Report on Form 10-Q for additional information.\nIndemnifications\n45\nTable of Contents\nIn the ordinary course of business, we may provide indemnifications of varying scope and terms to customers, vendors, lessors, business partners and other parties with respect to certain matters, including, but not limited to, losses arising out of our breach of agreements, products or services to be provided by us, environmental compliance or from intellectual property infringement claims made by third parties. In addition, we have entered into indemnification agreements with our directors and certain of our officers that require us, among other things, to indemnify them against certain liabilities that may arise by reason of their status or service as directors or officers. We maintain director and officer insurance, which may cover certain liabilities arising from our obligation to indemnify our directors and officers in certain circumstances.\nIt is not possible to determine the maximum potential amount under these indemnification agreements due to the limited history of prior indemnification claims and the unique facts and circumstances involved in each particular agreement. Such indemnification agreements may not be subject to maximum loss clauses. Historically, we have not incurred material costs as a result of obligations under these agreements.\nRecent Accounting Pronouncements\nFor a description of recently issued and adopted accounting pronouncements, including the respective dates of adoption and expected effects on our results of operations and financial condition, see Part I, Item 1, Note 2, \nRecent Accounting Pronouncements\n, of the Notes to Condensed Consolidated Financial Statements included in this Quarterly Report on Form    10-Q.\nCritical Accounting Policies and Estimates\nWe have prepared the accompanying unaudited Condensed Consolidated Financial Statements in accordance with accounting principles generally accepted in the United States (U.S. GAAP). The preparation of the financial statements requires the use of judgments and estimates that affect the reported amounts of revenues, expenses, assets, liabilities and shareholders’ equity. We have adopted accounting policies and practices that are generally accepted in the industry in which we operate. If these estimates differ significantly from actual results, the impact to the Condensed Consolidated Financial Statements may be material.\nThere have been no material changes in our critical accounting policies and estimates from those disclosed in our 2025 Annual Report on Form 10‑K. Please refer to Part II, Item 7 of our 2025 Annual Report on Form 10‑K for a discussion of our critical accounting policies and estimates.\n46\nTable of Contents"
}