{
  "item1": "sell products cloud service providers, computer manufacturers OEMs, resellers, distributors retailers throughout world. maintain sales offices selected parts world including major geographies Americas, Asia Pacific, Europe Middle East. international sales, which include sales foreign subsidiaries U.S. companies but do not include sales U.S.",
  "item7": "Net cash provided (used in): Operating activities Investing activities Financing activities Effect exchange rate changes cash Net increase (decrease) cash cash equivalents previously reached final agreement IRS received notices deficiency respect years 2008 through 2012, February 2024, also reached final agreement resolving notices proposed adjustments respect years 2013 through 2015. During year ended June 27, 2025, made payments $130 million interest respect years 2008 through 2012 $32 million tax interest respect years 2013 through 2015, resulting no remaining liability June 27, 2025 related all years 2008 through 2015. connection settlements years 2008 through 2015, expect realize reductions mandatory deemed repatriation tax obligations tax savings interest deductions future years aggregating $166 million. amount, $65 million interest savings interest paid respect years 2008 through 2015 classified deferred tax asset due interest expense limitation rules.",
  "item2": "Net cash provided (used in): Operating activities Investing activities Financing activities Effect exchange rate changes cash Cash cash equivalents reclassified assets held sale Net decrease cash cash equivalents currently expect capital expenditures 2026 approximately 4% 6% net revenue. believe cash cash equivalents available 2027 Revolving Credit Facility (as defined below) will sufficient meet working capital, debt, dividend capital expenditure needs least next twelve months foreseeable future thereafter. believe can also access various debt equity capital markets further supplement liquidity position if necessary. ability sustain working capital position subject number risks discuss Part II, Item 1A, total $1.23 billion $0.98 billion cash cash equivalents held foreign subsidiaries October 3, 2025 June 27, 2025, respectively."
}