{
  "source_file": "wdc-20250627.htm",
  "form_type": "10-K",
  "item1": "Item 1.\n    Business \nGeneral\nWestern Digital was founded \nin \n1970 and is a Standard & Poor’s 500 (“S&P 500”) company headquartered in San Jose, California. We are a leading developer, manufacturer, and provider of data storage devices and solutions based on hard disk drive (“HDD”) technology. HDDs are critical components in the worldwide data infrastructure market, powering the digital economy. HDDs provide reliable, cost-effective, high-capacity storage needs for a wide range of applications, ranging from cloud data centers, enterprise storage systems, edge computing, and video surveillance to client and consumer devices.\nOn February 21, 2025 (the “Separation Date”), we completed the separation of our HDD and Flash business units (the “Separation”) to create two independent public companies, with Western Digital focusing on our existing HDD business and Sandisk Corporation (“Sandisk”), formerly a wholly-owned subsidiary of the Company, holding the Flash business. We believe the Separation better positions each business unit to execute innovative technology and product development, capitalize on unique growth opportunities, extend respective leadership positions, operate more efficiently with distinct capital structures, and pursue capital allocation strategies that maximize long-term shareholder value.\nAs global data creation continues to accelerate, particularly in the age of AI, and as the need to store and retain data also grows, we believe HDDs will continue to remain the preferred technology for storing large volumes of data as the most economical solution to the large cloud data centers for their mass storage needs. We believe Western Digital is well positioned as a leading supplier in the industry given the depth of our industry knowledge and the breadth of our product portfolio.\nWe are a customer-focused organization that has developed deep relationships with industry leaders to deliver innovative solutions to help users capture, store and transform data across a boundless range of applications. With much of the world’s data stored on Western Digital products, our innovation powers the global technology ecosystem — anchored in the cloud, and extending from consumer devices to the edge — enabling the data-driven future, including AI and emerging applications.\nOur broad portfolio of technology and products addresses our customers’ storage needs through multiple end markets: “Cloud,” “Client” and “Consumer” and is comprised of the Western Digital® and WD® brands.\nCloud\n. Cloud represents a large and growing end market comprised primarily of products for public or private cloud environments and enterprise customers. We enable cloud, Internet and social media infrastructure players to build more powerful, cost-effective and efficient data centers. We provide the Cloud end market with an array of high-capacity enterprise HDDs and platforms. Our capacity enterprise HDDs address growing storage demands with high reliability, easy scalability, and lower time to value for our customers — all while delivering a low total cost of ownership for cloud data center and smart video system markets. These drives are primarily for use in data storage systems, in tiered storage models and where data must be stored reliably for years. We also provide higher value data storage platforms to the market.\nClient\n. Through the Client end market, we provide our original equipment manufacturer (“OEM”) and channel customers a broad array of high-performance HDD solutions across desktop and notebooks. Our products are designed for use in devices requiring high performance, reliability and capacity with various attributes such as low cost per gigabyte, quiet acoustics, and low power consumption.\nConsumer\n. We have also built strong consumer brand recognition with tools to manage vast libraries of personal content and to push the limits of what is possible for storage. We serve the Consumer end market with a portfolio of HDD external storage products and our vast presence around the world through our retail and channel routes to market.\nIndustry \n \nWe operate in the data storage industry. The ability to access, store and share data from anywhere on any device is increasingly important to our customers and end users. From the intelligent edge to the cloud, data storage is a fundamental component underpinning the global technology architecture. Our strengths in innovation, areal density and cost leadership provide a foundation upon which we are solidifying our position as an essential building block of the digital economy. We believe there is tremendous market opportunity created by the rapid global adoption of technology built with cloud infrastructure, connected intelligent devices, and high-performance networks.\n4\nTable of Contents\nThe increase in computing complexity and advancements in AI, along with growth in cloud computing applications, connected mobile devices and Internet-connected products and edge devices is driving rapid growth in the volume of digital content to be stored and used. While this growth has led to the creation of several form factors for data storage and an increasing use of a tiered architecture approach, HDDs occupy a unique place in the market by providing an economical means to create, store and utilize an increasing amount of data in the age of AI.\n \nWe believe HDDs provide a sustainable total cost of ownership (TCO) advantage to our cloud customers to meet their storage needs.\nResearch and Technology \n \nThe strong growth in the amount, value and use of data continues to create a global need for larger, faster and more capable storage solutions. We have extensive customer, partner and channel relationships across our end markets and geographies and a rich heritage of innovation and operational excellence. We have a wide range of intellectual property (“IP”) assets,\n including patent portfolios containing approximately \n4,500 active \npatents\n, covering groundbreaking data storage technologies, magnetic recording and other technology building blocks. We have broad research and development (“R&D”) capabilities and devote substantial resources to the development of new products and the improvement of existing products. We focus our engineering efforts on optimizing our product design and manufacturing processes to bring our products to market in a cost-effective and timely manner. We continue to transform ourselves to address the growth in data by providing what we believe to be the broadest range of storage technologies in the industry with a comprehensive product portfolio and global reach. For a discussion of associated risks, see Part I, Item 1A, \nRisk Factors\n, of this Annual Report on Form 10-K.\nHDD products provide non-volatile data storage by recording magnetic information on rotating disks. We develop and manufacture substantially all of the recording heads and magnetic media used in our HDD products. We have led the industry in innovation to drive increased areal density and high-performance attributes. Our improvements in HDD capacity, which lower product costs over time, have been enabled largely through advancements in magnetic recording head and media technologies. Our multi-year product roadmap for high-capacity HDDs, which include ePMR, OptiNAND, UltraSMR and triple stage actuators to deliver a cutting-edge portfolio of drives, in commercial volumes, at a wide variety of capacity points, puts Western Digital in a strong position to capitalize on the opportunities presented by the large and growing storage markets. We invest considerable resources in R&D, manufacturing infrastructure and capital equipment for recording head and media technology, as well as other aspects of the magnetic recording system such as HDD mechanics, controller and firmware technology, in order to secure our competitive position and cost structure. Our products generally leverage a common platform for various products within product families, and in some cases across product families, resulting in the commonality of components which reduces our exposure to changes in demand, facilitates inventory management and allows us to achieve lower costs through purchasing economies. This platform strategy also enables our customers to leverage their qualification efforts onto successive product models.\nCompetition \n \n \nWe believe we are well-positioned in our competitive industry with our leading product portfolio, differentiated innovation engine, global manufacturing footprint, and leadership in driving areal density and cost efficiency. Nevertheless, we face strong competition from several manufacturers of storage products and storage systems and solutions, whether directly or indirectly. Our competitors include HDD competitors such as Seagate Technology Holdings plc, and Toshiba Electronic Devices & Storage Corporation along with NAND flash suppliers that provide and enable alternative storage technologies, as well as storage systems and solutions providers.\n5\nTable of Contents\nBusiness Strategy \n \n \nOur vision is to unleash the power and value of data. Our mission is to be the market leader in data storage by delivering storage solutions for now and the future. By understanding our customers’ needs, together we can help them unlock the value and power of data that we are starting to see come to the fore, especially in this age of AI.\nOur overall strategy focuses on leadership, innovation and execution, with a goal of furthering Western Digital as an industry-leading and broad-based developer, manufacturer and provider of storage devices and solutions that support the infrastructure that has enabled a proliferation of data. Our strategy reflects the following foundational elements: (1) Enhanced customer focus for driving greater customer advocacy and deeper customer engagement, (2) Product and technology leadership for realizing the best total cost of ownership through disciplined product management, (3) Rigorous financial discipline by having a clear capital allocation strategy, ambitious financial targets and prudent capital investment, (4) Operational excellence for driving best-in-class cost to achieve industry-leading margin profiles with strong execution, (5) Innovation and growth for creating new products and applications and identifying new market opportunities, and (6) High performance teams with the skill sets to meet go-forward business needs.\nPatents, Licenses and Proprietary Information \n \n \nWe rely on a combination of patents, trademarks, copyright and trade secret laws, confidentiality procedures and licensing arrangements to protect our IP rights.\nWe have approximately 4,500 active patents worldwide and have many patent applications in process. We continually seek additional United States (“U.S.”) and international patents on our technology. We believe that, although our active patents and patent applications have considerable value, the successful manufacturing and marketing of our products also depends upon the technical and managerial competence of our staff. Accordingly, the patents held and applied for cannot alone ensure our future success.\nIn addition to patent protection of certain IP rights, we consider elements of our product designs and processes to be proprietary and confidential. We believe that our non-patented IP, particularly some of our process technology, is an important factor in our success. We rely upon non-disclosure agreements, contractual provisions and a system of internal safeguards to protect our proprietary information. Despite these safeguards, there is a risk that competitors may obtain and use such information. The laws of foreign jurisdictions in which we conduct business may provide less protection for confidential information than the laws of the U.S.\nWe rely on certain technology that we license from other parties to manufacture and sell our products. We believe that we have adequate cross-licenses and other agreements in place in addition to our own IP portfolio to compete successfully in the storage industry. For a discussion of associated risks, see Part I, Item 1A, \nRisk Factors\n, of this Annual Report on Form 10‑K.\nManufacturing and Suppliers \n \n \nWe believe that we have significant know-how, unique product manufacturing processes, test and tooling, execution skills, human resources and training to continue to be successful and to adjust our manufacturing operations as necessary. We strive to maintain manufacturing flexibility, high manufacturing yields, reliable products and high-quality components. The critical elements of our production are high volume and utilization, low-cost assembly and testing, strict adherence to quality metrics and maintaining close relationships with our strategic component suppliers to access best-in-class technology and manufacturing capacity. We continually monitor our manufacturing capabilities to respond to the changing requirements of our customers and maintain our competitiveness and position as a data technology leader.\nHDD manufacturing is a complex process involving the production and assembly of precision components with narrow tolerances and rigorous testing. The manufacturing processes involve a number of steps that are dependent on each other and occur in “clean room” environments that demand skill in process engineering and efficient space utilization to control the operating costs of these manufacturing environments. We continually evaluate our manufacturing processes in an effort to increase productivity, sustain and improve quality and decrease manufacturing costs. We continually evaluate which steps in the manufacturing process would benefit from automation and how automated manufacturing processes can improve productivity and reduce manufacturing costs. We also leverage contract manufacturers when strategically advantageous. \nHDD consists primarily of recording heads, magnetic media, controllers and firmware and a printed circuit board assembly. We design and manufacture substantially all of the recording heads and magnetic media required for our products. As a result, \n6\nTable of Contents\nwe are more dependent upon our own development and execution efforts for these components and less reliant on recording head and magnetic media technologies developed by other manufacturers. We depend on an external supply base for all remaining components and materials for use in our design, manufacturing and testing. We believe the use of our in-house manufacturing, assembly and test facilities offers the controls necessary to provide the demanding capabilities, performance and reliability our customers require.\nOur vertically integrated, in-house assembly and test operations are concentrated in Prachinburi and Bang Pa-In, Thailand; Penang, Johor Bahru, and Kuching, Malaysia; Laguna, Philippines; Shenzhen, China; and San Jose and Fremont, CA, USA.\nWe generally retain multiple suppliers for our component requirements, but for business or technology reasons, we source some of our components from a limited number of sole or single source providers. For a discussion of such risks, see Part I, Item 1A, \nRisk Factors\n, of this Annual Report on Form 10-K.\nSales and Distribution \n \n \nWe sell our products to cloud service providers, computer manufacturers and OEMs, resellers, distributors and retailers throughout the world. We maintain sales offices in selected parts of the world including the major geographies of the Americas, Asia Pacific, Europe and the Middle East. Our international sales, which include sales to foreign subsidiaries of U.S. companies but do not include sales to U.S. subsidiaries of foreign companies, represented \n55%,\n 58% and 57% of our net revenue for 2025, 2024 and 2023, respectively. Our sales are subject to certain risks, including exposure to tariffs and various trade regulations. For a discussion of such risks, see Part I, Item 1A, \nRisk Factors\n, of this Annual Report on Form 10-K.\nWe perform our marketing and advertising functions both internally and through outside firms utilizing both consumer media and trade publications targeting various reseller and end-user markets. We also maintain customer relationships through direct communication and by providing information and support through our website. In accordance with standard storage industry practice, we provide distributors and retailers with limited price protection and programs under which we reimburse certain marketing expenditures. We also provide distributors, resellers and OEMs with other sales incentive programs. \nFor 2025, three customers accounted for 17%, 12%, and 10%, respectively, of our net revenue. For 2024 and 2023, no single customer accounted for 10% or more of our net revenue.\nCyclicality and Seasonality\nOur business is subject to variability of sales because it is largely dependent on the buying patterns of our large Cloud customers, driven by their needs for deploying our technology in their data center buildouts, as well as on their ability to procure other products that go into such buildouts. Our business is also impacted by cyclicality in the industry, as well as macroeconomic factors. For a discussion of associated risks, see Part I, Item 1A, \nRisk Factors\n, of this Annual Report on Form 10-K.\nService and Warranty\n \nWe generally warrant our newly manufactured products against defects in materials and workmanship from one to five years from the date of sale depending on the type of product, with a small number of products having a warranty ranging up to ten years or more. Our warranty obligation is generally limited to repair or replacement. We have engaged third parties in various countries in multiple regions to provide various levels of testing, processing or recertification of returned products for our customers. For additional information regarding our service and warranty policy, see Part II, Item 8, Note 1, \nOrganization and Basis of Presentation,\n and Note 5, \nSupplemental Financial Statement Data, \nof the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nOur People\nOur people strategy supports our vision of unleashing the power and value of data and our mission to be the market leader in data storage, delivering solutions for now and the future. At the end of 2025, we employed approximately 40,000 people worldwide. Our diverse team spans 24 countries with approximately 88% of our employees in Asia Pacific, approximately 11% in the Americas and less than 1% in Europe, the Middle East and Africa.\nTalent Growth and Engagement\n7\nTable of Contents\nWe invest in developing our people to lead us into the future. To help our employees reach their full potential, we aim to cultivate an environment that encourages learning, development and career growth. Our performance framework includes setting goals to establish clear expectations and receiving feedback and coaching to achieve them. Our on-demand learning management system offers learning activities to help employees map their career journey, access learning online and track progress against development goals. We also provide upskilling and reskilling opportunities to our factory employees through on-the-job training, technical classes, workshops and partnerships with universities and colleges.\nWe make it a priority to recruit exceptional talent across the organization. We continue to foster the next generation of talent through our intern and new college graduate recruitment programs, and we converted about 40% of our eligible global intern population to employees in 2025. We have a U.S. Department of Labor approved apprenticeship program, serving as a career pathway for veterans and other underserved populations, which helps us build a workforce that mirrors the communities that we serve.\nWe believe employee engagement is key to performance and retention and that by listening to our employees we can better understand how we enable them to do their best work. We use a combination of our employee survey and listening sessions at all levels to understand what we are doing well and identify opportunities to strengthen employee engagement in support of our business strategy.\nWe strive to cultivate an inclusive environment where every individual feels valued, respected, and appreciated, thereby enabling them to contribute effectively to the organization and excel in their roles. Our initiatives celebrate the diversity of our workforce and ensure that all voices are heard. Our Employee Resource Groups are employee-led and foster connections based on a shared identity or background and are open to all employees who want to join.\nWe continued our commitment to conducting business in an ethical way around the world. In 2025, we were named one of the World’s Most Ethical Companies by Ethisphere for the seventh consecutive year. Our employees also regularly participate in philanthropy to support the communities in which they work and live. In 2025, more than half of our employees around the world gave their time to participate in company-sponsored volunteer events.\nCompensation and Benefits\nWe believe that recognition is crucial for retaining and motivating our employees, and we are committed to rewarding performance with competitive compensation consisting of base salary and short-term and long-term incentives. We also offer a global recognition program to celebrate the contributions of employees who bring to life our core values: Customers, Results, Connection, Excellence, and Innovation.\nWe invest in the physical, mental and financial well-being of our people through a dynamic and differentiated Total Rewards program that aligns to our culture and values. We provide competitive benefits (which vary by country or region), including health coverage, life and disability insurance, retirement plans, paid time off, employee assistance program and employee stock purchase plan.\nWe benchmark our compensation and benefits programs annually using market data from reputable third-party consultants. We also conduct internal focus groups and employee surveys to inform programs and identify opportunities. To ensure that our pay practices are fair, we conduct regular pay equity assessments to promote equal pay for equal work, as well as regularly engaging in a living wage analysis.\nHealth and Safety\nWe are committed to creating a safe work environment everywhere we operate. We provide extensive health and safety resources and training to all employees, especially those working in our manufacturing facilities, where we use an integrated management system to manage health and safety standards.\nGovernment Regulation \nOur worldwide business activities are subject to various laws, rules and regulations of the United States as well as of foreign governments. Compliance with existing or future governmental regulations, including, but not limited to, those pertaining to global trade, the environment, consumer and data protection, employee health and safety, and taxes, could have a material impact on our capital expenditures, earnings, competitive position and overall business. See Part I, Item 1A, \nRisk Factors\n for a discussion of these potential impacts.\n8\nTable of Contents\nCorporate Responsibility and Sustainability \nAt Western Digital, sustainability is about innovating with technology to positively impact our future. We believe that sustainability can create value for everyone in our value chain and serves as a competitive differentiator, while minimizing our environmental footprint, influencing our ecosystem, empowering and connecting our stakeholders and embedding sustainability in our decision-making processes. Our sustainability strategy is reflected through sustainability-focused initiatives as well as day-to-day activities, including our adoption of sustainability-focused policies and procedures, fostering an inclusive workplace, our constant drive toward more efficient use of materials and energy, our careful and active management of our supply chain, our community-focused volunteerism programs and philanthropic initiatives and our impactful, globally-integrated ethics and compliance program.\n•\nWe work to minimize our impact on the environment by reducing emissions, water withdrawal and waste to landfills, and by evaluating and enhancing our climate resiliency.\n•\nWe strive to innovate in ways that reduce the energy used by our products, the energy used to manufacture them and the amount of new materials required to manufacture them.\n•\nWe actively collaborate with customers, suppliers, industry associations, governments, academics, standards organizations and industry partners to generate value, reduce emissions across the ecosystem, and increase circularity to reduce raw materials extraction.\n•\nWe seek to foster a workplace of inclusion by hiring and developing team members with different experiences and creating opportunities for connections across the company through our Employee Resource Groups.\n•\nWe are guided by our global pillars centered on hunger relief, environmental quality and STEM (science, technology, engineering and math) education and activate employees locally to have an impact on their community.\n•\nWe seek to protect the human rights and civil liberties of our employees through policies, procedures and programs that avoid risks of compulsory and child labor, both within our company and throughout our supply chain.\n•\nWe educate our employees annually on relevant ethics and compliance topics, publish accessible guidance on ethical issues and related company resources in our Global Code of Conduct and encourage reporting of ethical concerns through any of several global and local reporting channels.\n•\nWe set new environmental goals post-Separation to expand our focus to include carbon-free energy alternatives, add an upstream direct emissions reduction goal and goals for increasing recycled content in products and packaging for our enterprise HDD portfolio.\nAvailable Information \nWe maintain an Internet website at \nwww.westerndigital.com\n. The information on our website is not incorporated in this Annual Report on Form 10-K. Our Annual Report on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K and amendments to reports filed or furnished pursuant to Sections 13(a) and 15(d) of the Securities Exchange Act of 1934, as amended, are available on our website at \nwww.westerndigital.com\n, free of charge, as soon as reasonably practicable after the electronic filing of these reports with, or furnishing of these reports to, the Securities and Exchange Commission (“SEC”). The SEC maintains a website at \nwww.sec.gov\n that contains reports, proxy and information statements and other information regarding issuers that file electronically with the SEC, including us.\n9\nTable of Contents",
  "item7": "Item 7.\n     \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion and analysis contains forward-looking statements within the meaning of the federal securities laws and should be read in conjunction with the disclosures we make concerning risks and other factors that may affect our business and operating results. You should read this information in conjunction with the Consolidated Financial Statements and the notes thereto included in Part II, Item 8, \nFinancial Statements and Supplementary Data\n, of this Annual Report on Form 10-K. See also “Forward-Looking Statements” immediately prior to Part I, Item 1, \nBusiness\n, of this Annual Report on Form 10-K.\nOur Company\nWe are a leading developer, manufacturer, and provider of data storage devices and solutions based on hard disk drive (“HDD”) technology. We leverage our capability in the HDD industry primarily for the cloud and hyperscale data center markets. HDDs are critical components in the worldwide data infrastructure market, powering the digital economy. HDDs provide reliable, cost-effective, high-capacity storage needs for a wide range of applications, ranging from cloud data centers, enterprise storage systems, edge computing, video surveillance to client and consumer.\nOur broad portfolio of technology and products addresses our customers’ storage needs through multiple end markets: “Cloud,” “Client” and “Consumer”. Cloud is comprised primarily of products for public or private cloud environments and enterprise customers. Through the Client end market, we provide our original equipment manufacturer (“OEM”) and channel customers a broad array of high-performance HDD solutions across desktop and notebooks. The Consumer end market provides a broad range of retail and other end-user products, which capitalize on the strength of our product brand recognition and vast points of presence around the world.\nOur fiscal year ends on the Friday nearest to June 30 and typically consists of 52 weeks. Approximately every five to six years, we report a 53-week fiscal year to align the fiscal year with the foregoing policy. Fiscal year 2026, ending on July 3, 2026 will be comprised of 53 weeks, with the first quarter consisting of 14 weeks. Fiscal years 2025, 2024, and 2023, which ended on June 27, 2025, June 28, 2024, and June 30, 2023, respectively, each comprised 52 weeks, with all quarters presented consisting of 13 weeks.\nKey Developments\nSeparation of Business Units\nOn February 21, 2025 (the “Separation Date”), we completed the separation of our HDD and Flash business units (the “Separation”) to create two independent public companies, with Western Digital focusing on our existing HDD business and Sandisk Corporation (“Sandisk”), formerly a wholly-owned subsidiary of the Company, holding the Flash business. We believe the Separation better positions each business unit to execute innovative technology and product development, capitalize on unique growth opportunities, extend respective leadership positions, operate more efficiently with distinct capital structures, and pursue capital allocation strategies that maximize long-term shareholder value. The Separation was effected through a pro rata distribution of 80.1% of the outstanding shares of Sandisk common stock to holders of the Company’s common stock as of February 12, 2025, the record date for the distribution. The Company did not issue fractional shares of Sandisk common stock in connection with the distribution. Sandisk is now an independent public company, and Sandisk common stock commenced trading “regular way” under the symbol “SNDK” on the Nasdaq Stock Market LLC (“Nasdaq”) on February 24, 2025, which was the next trading day following the distribution date. The Company continues to trade on Nasdaq under the symbol “WDC” following the Separation. Following the Separation, the Company no longer consolidates Sandisk within the Company’s financial results. As part of the Separation, the Company retained 28.8 million shares of Sandisk common stock, or a 19.9% stake. During the quarter ended June 27, 2025, the Company disposed of 21.3 million shares of Sandisk common stock, along with $4 million in cash, in a tax-free exchange for $800 million principal amount of the Company’s term loan A-3. The Company expects to monetize its remaining stake in Sandisk within one year from the Separation Date.\nInformation provided herein is presented on a continuing operations basis to reflect the impact of the Separation. See Part II, Item 8, Note 3, \nDiscontinued Operations\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K for additional information regarding the Separation.\n30\nTable of Contents\nMacroeconomic Conditions\nThe United States has recently announced changes to its trade policy, including increasing tariffs on imports, in some cases significantly. Several of these recent tariff actions have been followed by announcements of limited exemptions and temporary pauses. These actions have caused substantial uncertainty and have also resulted in retaliatory measures on U.S. goods. Our business and results of operations were not materially impacted in fiscal 2025 as a result of the recent tariff actions. We are actively monitoring developments and plan to leverage tariff exemptions where possible and will take other actions as appropriate to offset any resulting increase in the cost of importing our products or the costs for materials or components in our products, including optimizing our supply chain, sourcing from alternative suppliers, or passing the costs to our customers through tariff surcharges, or increased prices. There can be no assurance that we will be able to successfully offset or mitigate any resulting increase in our costs. In addition, the impact of the tariff actions on our customers, retaliatory measures by other countries in response to U.S. trade policy and any resulting decline in consumer confidence, significant inflation and diminished expectations for the economy could reduce demand for our products and adversely affect our business, financial condition and results of operations. For additional information, please see Part I, Item 1A, \nRisk Factors\n, included in this Annual Report on Form 10-K.\nOperational Update\nIn fiscal 2025, we saw an improvement in the supply and demand dynamic relative to the prior year, and we anticipate that digital transformation, including the AI data-cycle, will drive improved market conditions in the long term. However, macroeconomic factors such as tariffs, inflation, changes in interest rates, and recession concerns can affect demand for our products. As an example, in fiscal 2024, we and our industry experienced a supply-demand imbalance, which led to reduced shipments, negatively impacted pricing, and resulted in business realignment charges and charges for unabsorbed manufacturing overhead costs due to the underutilization of facilities as we temporarily scaled back production and took other actions to align our operations to the market at the time.\nWe will continue to actively monitor developments impacting our business and may take future responsive actions that we determine to be in the best interest of our business and stakeholders.\nCapital Allocation Actions\nWe have taken significant actions to deleverage our business and to initiate programs to return capital to our investors.\nIn February 2025, in connection with the Separation, we amended the loan agreement governing our revolving credit facility maturing in January 2027 (the “2027 Revolving Credit Facility”) and Term Loan Facility (as defined below), dated as of January 7, 2022 (as amended, the “Loan Agreement”) to, among other changes, permit the Separation, provide for the issuance of a new $2.51 billion Term Loan A-3 maturing in January 2027 (the “Term Loan A-3”) in a noncash exchange to replace our previously existing Term Loan A-2 (the “Term Loan A-2” and, together with the Term Loan A-3, the “Term Loan Facility”); facilitate a subsequent exchange of a portion of the Term Loan A-3 for shares of Sandisk retained by us at the Separation; and reduce the aggregate commitments under the 2027 Revolving Credit Facility from $2.25 billion to $1.25 billion.\nIn April 2025, we redeemed, at our election, $1.80 billion aggregate principal amount of our 4.75% senior unsecured notes due 2026 (the “2026 Notes”) at par plus accrued interest.\nIn June 2025, we settled $800 million principal amount of our Term Loan A-3 through an exchange of 21.3 million shares of Sandisk common stock held by us and $4 million in cash paid by us.\nThese actions, along with scheduled principal payments made on our term loans, reduced the principal amount of our debt by $2.78 billion during fiscal 2025.\nOn April 29, 2025, our Board of Directors authorized the adoption of a quarterly cash dividend program. Under the cash dividend program, holders of our common stock will receive dividends when and as declared by our Board of Directors. During the year ended June 27, 2025, we paid cash dividends of $0.10 per share of our outstanding common stock, totaling $36 million, including payment to holders of our Series A Preferred Stock in accordance with their participation rights.\nSubsequent to year-end, on July 29, 2025, our Board of Directors declared a cash dividend of $0.10 per share of our common stock, which will be paid on September 18, 2025 to our shareholders of record as of the close of business on September 4, 2025.\n31\nTable of Contents\nOn May 9, 2025, our Board of Directors authorized a share repurchase program for the repurchase of up to $2.0 billion of our common stock. For the year ended June 27, 2025, we repurchased 2.8 million shares for a total cost of $149 million. The remaining amount available to be repurchased under our share repurchase program as of June 27, 2025 was $1.85 billion. Repurchases under the share repurchase program may be made in the open market or in privately negotiated transactions and may be made under a Rule 10b5-1 plan. We expect share repurchases to be funded principally by operating cash flows.\n Information regarding our indebtedness, including the principal repayment terms, interest rates, covenants and other key terms of our outstanding indebtedness, and additional information on the terms of our convertible preferred shares is included in Part II, Item 8, Note 8, \nDebt\n,\n \nand\n \nNote 12, \nShareholders’ Equity and Convertible Preferred Stock\n,\n \nof the Notes to Consolidated Financial Statements in this Annual Report on Form 10-K.\nTax Resolution\nAs previously disclosed, we had reached a final agreement with the U.S. Internal Revenue Service (the “IRS”) and received notices of deficiency with respect to years 2008 through 2012, and in February 2024, we also reached a final agreement for resolving the notices of proposed adjustments with respect to years 2013 through 2015. During the year ended June 27, 2025, we made payments aggregating to $162 million for tax and interest with respect to years 2008 through 2015 and have no remaining liability as of June 27, 2025 related to all years from 2008 through 2015. Additional information regarding these settlements and related tax matters is provided in Part II, Item 8, Note 13, \nIncome Taxes\n, of the Notes to\n \nConsolidated Financial Statements included in this Annual Report on Form 10-K.\n32\nTable of Contents\nResults of Operations\nSummary Comparison of 2025, 2024 and 2023\nThe following table sets forth, for the periods presented, selected summary information from our Consolidated Statements of Operations by dollars and percentage of net revenue\n(1)\n:\n2025\n2024\n2023\n(in millions, except percentages)\nRevenue, net\n$\n9,520 \n100.0 \n%\n$\n6,317 \n100.0 \n%\n$\n6,255 \n100.0 \n%\nCost of revenue\n5,828 \n61.2 \n4,544 \n71.9 \n4,864 \n77.8 \nGross profit\n3,692 \n38.8 \n1,773 \n28.1 \n1,391 \n22.2 \nOperating expenses:\nResearch and development\n994 \n10.4 \n950 \n15.0 \n986 \n15.8 \nSelling, general and administrative\n568 \n6.0 \n726 \n11.5 \n807 \n12.9 \nLitigation matter\n(198)\n(2.1)\n291 \n4.6 \n— \n— \nBusiness realignment charges\n(6)\n(0.1)\n209 \n3.3 \n146 \n2.3 \nTotal operating expenses\n1,358 \n14.3 \n2,176 \n34.4 \n1,939 \n31.0 \nOperating income (loss)\n2,334 \n24.5 \n(403)\n(6.4)\n(548)\n(8.8)\nInterest and other income:\nInterest income\n45 \n0.5 \n33 \n0.5 \n19 \n0.3 \nInterest expense\n(357)\n(3.8)\n(414)\n(6.6)\n(310)\n(5.0)\nLoss on retained interest in Sandisk\n(772)\n(8.1)\n— \n— \n— \n— \nLoss on extinguishment of debt\n(100)\n(1.1)\n— \n— \n— \n— \nOther income (expense), net\n(20)\n(0.2)\n45 \n0.7 \n(10)\n(0.2)\nTotal interest and other income, net\n(1,204)\n(12.6)\n(336)\n(5.3)\n(301)\n(4.8)\nIncome (loss) before taxes\n1,130 \n11.9 \n(739)\n(11.7)\n(849)\n(13.6)\nIncome tax expense (benefit)\n(513)\n(5.4)\n26 \n0.4 \n53 \n0.8 \nNet income (loss) from continuing operations\n$\n1,643 \n17.3 \n%\n$\n(765)\n(12.1)\n%\n$\n(902)\n(14.4)\n%\n(1)\nPercentages may not total due to rounding.\nThe following table sets forth, for the periods presented, summary information regarding our disaggregated revenue:\n2025\n2024\n2023\n(in millions)\nRevenue by end market \nCloud\n$\n8,341 \n$\n5,052 \n$\n4,753 \nClient\n556 \n577 \n691 \nConsumer\n623 \n688 \n811 \nTotal revenue\n$\n9,520 \n$\n6,317 \n$\n6,255 \nRevenue by geography\nAmericas\n$\n4,592 \n$\n2,858 \n$\n2,924 \nAsia\n3,392 \n2,392 \n2,156 \nEurope, Middle East and Africa\n1,536 \n1,067 \n1,175 \nTotal revenue\n$\n9,520 \n$\n6,317 \n$\n6,255 \nExabytes shipped\n696 \n443 \n412 \n33\nTable of Contents\nNet Revenue\nNet revenue increased by 51% in 2025 compared to 2024, primarily driven by a 29% increase in average selling price per unit as a result of a shift in product mix to higher capacity drives. The increase was also driven by a 15% increase in units sold as a result of higher shipments of our high-capacity enterprise products stemming from data center expansions.\nCloud revenue increased by 65% in 2025 compared to 2024, primarily driven by a 36% increase in units sold and a 20% increase in average selling price per unit. The increase in units sold was driven by higher shipments of our high-capacity enterprise products. The increase in average selling price per unit was primarily due to a shift in product mix to higher capacity drives.\nClient revenue decreased by 4% in 2025 compared to 2024, primarily driven by a 16% decrease in units sold, reflecting lower demand in the market, partially offset by a 14% increase in average selling price per unit as a result of a shift in product mix to higher capacity drives.\nConsumer revenue decreased by 9% in 2025 compared to 2024, primarily driven by a 14% decrease in units sold, reflecting lower demand in the market, partially offset by a 5% increase in average selling price per unit as a result of a shift in product mix to higher capacity drives.\nNet revenue increased by 1% in 2024 compared to 2023, primarily driven by a 25% increase in average selling price per unit as a result of a shift in product mix to higher capacity drives, partially offset by a 13% decrease in units sold reflecting lower demand in the market. The increase was offset by approximately 7 percentage points due to a decline in data storage systems revenues resulting from weakness in the market.\nCloud revenue increased by 6% in 2024 compared to 2023, primarily driven by a 1% increase in units sold and a 16% increase in average selling price per unit. The changes in units sold and average selling price per unit were primarily due to customers moving to higher capacity drives. The increase was offset by approximately 9 percentage points due to a decline in data storage systems revenues resulting from weakness in the market.\nClient revenue decreased by 17% in 2024 compared to 2023, primarily driven by a 30% decrease in units sold, reflecting lower demand in the market, partially offset by a 19% increase in average selling price per unit as a result of a shift in product mix to higher capacity drives.\nConsumer revenue decreased by 15% in 2024 compared to 2023, primarily driven by a 25% decrease in units sold, reflecting lower demand in the market, partially offset by a 13% increase in average selling price per unit as a result of a shift in product mix to higher capacity drives.\nFor 2025, 2024 and 2023, our top 10 customers accounted for 68%, 55% and 56%, respectively, of our net revenue. For 2025, three customers accounted for 17%, 12%, and 10%, respectively, of our net revenue. For 2024 and 2023, no single customer accounted for 10% or more of our net revenue.\nConsistent with standard industry practice, we have sales incentive and marketing programs that provide customers with price protection and other incentives or reimbursements that are recorded as a reduction to gross revenue. For 2025, 2024 and 2023, these programs represented 10%, 11% and 18%, respectively, of gross revenue. The amounts attributed to our sales incentive and marketing programs generally vary according to several factors, including industry conditions, list pricing strategies, seasonal demand, competitor actions, channel mix and overall availability of products. Changes in future customer demand and market conditions may require us to adjust our incentive programs as a percentage of gross revenue.\nGross Profit and Gross Margin\nGross profit increased by $1.92 billion in 2025 compared to 2024. The increase was largely due to higher revenues, cost reductions due to efficiencies achieved through improved manufacturing operations, cost-saving actions, and a more favorable product mix. The increase also reflected charges for unabsorbed manufacturing overhead of approximately $155 million in 2024 which were not incurred in 2025. Gross margin increased 10.7 percentage points in 2025 compared to 2024, with approximately 2.5 percentage points of the increase due to the impact of unabsorbed manufacturing overhead costs in the prior year and the remainder driven by the factors as noted above.\n34\nTable of Contents\nGross profit increased by $382 million in 2024 compared to 2023. The increase was largely due to cost efficiencies achieved through improved manufacturing operations, cost-saving actions, and a more favorable product mix. The increase also reflected a reduction in charges for unabsorbed manufacturing overhead costs as a result of the reduced utilization of our manufacturing capacity to approximately $155 million in 2024, from approximately $200 million of such costs in 2023. Gross margin increased 5.9 percentage points in 2024 compared to 2023, with approximately 1 percentage point of the increase due to the reduction in unabsorbed manufacturing overhead costs from the prior year and the remainder driven by the factors as noted above.\nOperating Expenses\nResearch and development (“R&D”) expense increased by $44 million or 5% in 2025 compared to 2024. This increase was primarily driven by a $46 million increase in costs for compensation and benefits, which was attributed to an increase in headcount in support of our technology and product roadmap. This increase was partially offset by a decrease in depreciation and amortization.\nR&D expense decreased by $36 million or 4% in 2024 compared to 2023. This decrease was driven by relatively equal decreases in depreciation and amortization and in outside services as we scaled back expenditures in response to market conditions.\nSelling, general and administrative (“SG&A”) expense decreased by $158 million or 22% in 2025 compared to 2024. This decrease was primarily driven by a $122 million decrease in costs for compensation and benefits, which was attributed to certain shared overhead roles in the prior year that have since transferred to Sandisk and were not backfilled after the Separation. The decrease also reflects a $38 million decrease in strategic review costs incurred in the prior year but not incurred in the current year. \nSG&A expense decreased by $81 million or 10% in 2024 compared to 2023. This decrease was primarily driven by a $37 million decrease in costs for compensation and benefits, attributed to a decrease in headcount, a $19 million decrease in outside services and various smaller savings as we scaled back expenditures in response to market conditions.\nFor information regarding litigation matters, see Part II Item 8, Note 17, \nLegal Proceedings\n,\n \nof the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nFor information regarding Business realignment charges, see Part II Item 8, Note 15, \nBusiness Realignment Charges\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nInterest and Other Expense\nTotal interest and other expense, net \nincreased by $868 million or 258% \nin 2025 compared to 2024, \nprimarily reflecting a $772 million mark-to-market loss on our retained interest in Sandisk and a $100 million loss on the extinguishment of debt in connection with the debt-for-equity exchange. The increase was partially offset by lower interest expense driven by lower debt balances.\nTotal interest and other expense, net \nincreased by $35 million or 12% \nin 2024 compared to 2023. The increase \nprimarily reflects higher interest rates and higher outstanding debt balances in the period.\n35\nTable of Contents\nIncome Tax Expense (Benefit)\nPreviously, the Tax Cuts and Jobs Act of 2017 (“TCJA”) eliminated the ability to deduct R&D expenditures in the year incurred, requiring capitalization and amortization under Internal Revenue Code Section 174. On July 4, 2025, the One Big Beautiful Bill Act of 2025 (“OBBBA”) was signed into law, which includes broad tax reform provisions that extend and modify key elements of the TCJA. Notably, the new legislation now allows an option for the immediate expensing of domestic R&D expenditures, beginning with our fiscal year 2026. The legislation also includes favorable modifications to international tax provisions, including changes to the Global Intangible Low-Taxed Income regime and enhancements to the Foreign-Derived Intangible Income deduction. Because the OBBBA provisions are not effective for us until fiscal year 2026 and the enactment date occurred after the balance sheet date, the tax effects of the OBBBA are not included in the Company’s operating results for the fiscal year ended June 27, 2025.\nOn August 16, 2022, the Inflation Reduction Act of 2022 was signed into law, which contained, among other things, a corporate alternative minimum tax (“CAMT”) of 15% on corporations with three-year average annual adjusted financial statement income (“AFSI”) exceeding $1.00 billion. The CAMT became effective for us beginning with fiscal year 2024. We were not subject to CAMT in fiscal year 2024 and do not expect to be subject to CAMT for fiscal year 2025 as our average annual AFSI did not exceed $1.0 billion for the preceding three-year period.\nOn December 20, 2021, the Organization for Economic Co-operation and Development G20 Inclusive Framework on Base Erosion and Profit Shifting released Model Global Anti-Base Erosion rules under Pillar Two. Several non-U.S. jurisdictions have either enacted legislation or announced their intention to enact future legislation to adopt certain or all components of Pillar Two, also known as Global Minimum Tax (“GMT”), some of which are effective for us in fiscal year 2025. For fiscal year 2025, we currently expect to be able to meet certain transitional safe harbors and do not expect any material GMT taxes. As most of the jurisdictions in which we operate have adopted this legislation for our fiscal year 2026, we expect there will be increases in our future tax obligations in these jurisdictions.\nThe following table sets forth Income tax information from our Consolidated Statements of Operations by dollar and effective tax rate:\n \n2025\n2024\n2023\n(in millions, except percentages)\nIncome (loss) before taxes\n$\n1,130 \n$\n(739)\n$\n(849)\nIncome tax expense (benefit)\n(513)\n26 \n53 \nEffective tax rate\n(45)\n%\n(4)\n%\n(6)\n%\nThe primary drivers of the difference between the effective tax rate for fiscal year 2025 and the U.S. Federal statutory rate of 21% are the relative mix of earnings and losses by jurisdiction, the deduction for foreign derived intangible income, credits, and tax holidays in the Philippines and Thailand that will expire at various dates during 2026 through 2033. These resulted in decreases to our effective tax rate below the U.S. Federal statutory rate for fiscal year 2025. In anticipation of us operating as a standalone HDD business in a GMT environment, we executed an inter-entity asset transfer in conjunction with the Separation. This resulted in the recognition of one-time deferred tax benefits to continuing operations of $690 million. Our income before tax is reduced by a loss in our retained interest in Sandisk. This loss is not deductible for tax purposes and provides no income tax benefit to us.\nThe primary drivers of the difference between the effective tax rate for fiscal year 2024 and the U.S. Federal statutory rate of 21% are the relative mix of earnings and losses by jurisdiction, the deduction for foreign derived intangible income, credits, and tax holidays in the Philippines and Thailand. On November 1, 2023, our tax holiday in Malaysia expired. We have applied for an extension and continue to be engaged in active discussions with the Malaysian Investment Development Authority. Because the exact terms of an extension are not currently known, we are applying the Malaysia corporate statutory tax rate on our Malaysian income for the full fiscal year. If an extension is granted, we will make an adjustment to our effective tax rate in that period.\nThe primary drivers of the difference between the effective tax rate for fiscal year 2023 and the U.S. Federal statutory rate of 21% are the relative mix of earnings and losses by jurisdiction, the deduction for foreign derived intangible income, credits, and tax holidays in Malaysia, the Philippines and Thailand.\n36\nTable of Contents\nWhile we do not expect to be subject to the CAMT in fiscal year 2026, the potential benefits from the OBBBA changes could be partially offset in future periods by CAMT, which is designed to ensure that large corporations pay a minimum level of tax by applying a 15% tax on financial statement income rather than taxable income. This may result in a higher effective tax rate and impact the realizability of our deferred tax assets in future periods. We continue to assess how these new rules and future regulatory guidance may affect our tax rate, financial reporting, and long-term tax strategy.\nFor additional information regarding Income tax expense, see Part II, Item 8, Note 13, \nIncome Taxes\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\n37\nTable of Contents\nLiquidity and Capital Resources\nThe following table summarizes our statements of cash flows, which are presented on a consolidated basis. Cash flows related to discontinued operations have not been segregated. See Part II, Item 8, Note 3, \nDiscontinued Operations\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K for additional cash flow information related to our discontinued operations. \n \n2025\n2024\n2023\n(in millions)\nNet cash provided by (used in):\nOperating activities\n$\n1,691 \n$\n(294)\n$\n(408)\nInvesting activities\n150 \n(27)\n(762)\nFinancing activities\n(1,612)\n187 \n875 \nEffect of exchange rate changes on cash\n6 \n(10)\n(9)\nNet increase (decrease) in cash and cash equivalents\n$\n235 \n$\n(144)\n$\n(304)\nWe had previously reached a final agreement with the IRS and received notices of deficiency with respect to years 2008 through 2012, and in February 2024, we also reached a final agreement for resolving the notices of proposed adjustments with respect to years 2013 through 2015. During the year ended June 27, 2025, we made payments of $130 million for interest with respect to years 2008 through 2012 and $32 million for tax and interest with respect to years 2013 through 2015, resulting in no remaining liability as of June 27, 2025 related to all years from 2008 through 2015.\nIn connection with settlements for the years 2008 through 2015, we expect to realize reductions to our mandatory deemed repatriation tax obligations and tax savings from interest deductions in future years aggregating to $166 million. Of this amount, $65 million of interest savings from the interest paid with respect to years 2008 through 2015 is classified as a deferred tax asset due to interest expense limitation rules. See Part II, Item 8, Note 13, \nIncome Taxes\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K for further details.\nIn August 2024, we filed a shelf registration statement (the “Shelf Registration Statement”) with the Securities and Exchange Commission that expires in August 2027. The Shelf Registration Statement allows us to offer and sell shares of common stock, preferred stock, warrants, and debt securities. We may use the Shelf Registration Statement or other capital sources, including other offerings of equity or debt securities or the credit markets, to satisfy future financing needs, including planned or unanticipated capital expenditures, investments, debt repayments or other expenses. Any such additional financing will be subject to market conditions and may not be available on terms acceptable to us or at all.\nAs a result of the Separation, we no longer have any capital expenditure requirements for the Flash business or its joint ventures with Kioxia Corporation. We expect our capital expenditures for fiscal year 2026 to be between 4% to 6% of our net revenue.\nWe believe our cash and cash equivalents and our available 2027 Revolving Credit Facility will be sufficient to meet our working capital, debt, dividend and capital expenditure needs for at least the next twelve months and for the foreseeable future thereafter. We believe we can also access the various debt and equity capital markets to further supplement our liquidity position if necessary. Our ability to sustain our working capital position is subject to a number of risks that we discuss in Part I, Item 1A, \nRisk Factors\n, in this Annual Report on Form 10-K.\nA total of $0.98 billion and \n$1.43 billion\n of our cash and cash equivalents were held outside of the U.S. as of June 27, 2025 and June 28, 2024, respectively. There are no material tax consequences that were not previously accrued for on the repatriation of this cash. \nOur cash equivalents are primarily invested in money market funds that invest in U.S. Treasury securities and U.S. Government agency securities. In addition, from time to time, we also invest directly in certificates of deposit, asset-backed securities and corporate and municipal notes and bonds.\n38\nTable of Contents\nOperating Activities\nNet cash provided by or used in operating activities primarily consists of net income or loss, adjusted for non-cash charges, plus or minus changes in operating assets and liabilities. Net cash used for changes in operating assets and liabilities was \n$1.03 billion\n for 2025, as compared to $307 million of net cash used for such changes for 2024, which largely reflects an increase in net operating assets and liabilities resulting from the increase in the volume of our business as well as the timing and amount of tax payments. Changes in our operating assets and liabilities are largely affected by our working capital requirements, which are dependent on our volume of business and the effective management of our cash conversion cycle as well as timing of payments for taxes. Our cash conversion cycle measures how quickly we can convert our products into cash through sales. At the end of the respective fourth quarters, the cash conversion cycles were as follows (in days):\n2025\n2024\n2023\nDays sales outstanding\n52 \n56 \n56 \nDays in inventory\n76 \n97 \n107 \nDays payables outstanding\n(75)\n(73)\n(66)\nCash conversion cycle\n53 \n80 \n97 \nChanges in days sales outstanding (“DSO”) are generally due to the timing of shipments to and collections from customers. Changes in days in inventory (“DIO”) are generally related to the timing of inventory builds and shipments to customers. Changes in days payables outstanding (“DPO”) are generally related to production volume and the timing of purchases during the period. From time to time, we make payment term modifications with vendors through negotiations with them or by granting to, or receiving from, our vendors payment term accommodations. We make modifications primarily to manage our vendor relationships and to manage our cash flows, including our cash balances.\nIn 2025, DSO decreased by 4 days over the prior year, reflecting timing of shipments and customer collections. DIO decreased by 21 days over the prior year, primarily reflecting improvements in inventory management. DPO increased by 2 days over the prior year, primarily due to more favorable payment terms and routine variations in the timing of purchases and payments during the period.\nInvesting Activities\nNet cash provided by investing activities in 2025 primarily consisted of $401 million in net proceeds from our sale of a majority interest in one of our subsidiaries and $148 million in net notes receivable proceeds from Flash Ventures, partially offset by $412 million in capital expenditures. Net cash used in investing activities in 2024 primarily consisted of $487 million of capital expenditures, partially offset by $239 million in net notes receivable proceeds from Flash Ventures and $195 million in proceeds from the sale-leaseback of property, plant and equipment.\nFinancing Activities\nDuring 2025, net cash used in financing activities primarily consisted of $2.09 billion used for the partial repayment of the 2026 Notes, repayment of borrowings on the 2027 Revolving Credit Facility, and scheduled principal payments on our Term Loan A-2 and Term Loan A-3; $1.37 billion of cash transferred to Sandisk at the Separation; $149 million in share repurchases; $113 million for taxes paid on vested stock awards; $73 million in debt issuance costs; and $44 million in dividends on our common stock and our Series A Preferred Stock. These uses were partially offset by $2.00 billion of proceeds from drawing on the Sandisk credit facilities in connection with the Separation, $150 million from the 2027 Revolving Credit Facility, and $77 million from issuances of shares under our employee stock plans. During 2024, net cash provided by financing activities primarily consisted of $3.00 billion in proceeds from the issuance of the 2028 Convertible Notes, the drawdown of a delayed draw term loan and draws on the revolving credit facility. These sources were partially offset by $2.10 billion used for the repayment of draws on the revolving credit facility, repayments of a delayed draw term loan, scheduled payments on the Term Loan A-2, and settlement of our remaining 1.50% convertible senior notes due February 1, 2024 (the “2024 Convertible Notes”); $505 million used to repurchase a portion of the 2024 Convertible Notes; and $155 million for the purchase of capped calls to hedge the potential dilution impact of the conversion feature of the 2028 Convertible Notes.\nA discussion of our cash flows for 2023, including a comparison of such cash flows to 2024, is included in Part II, Item 7, \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations – Liquidity and Capital Resources\n, included in our Annual Report on Form 10-K for the year ended June 28, 2024 filed with the SEC on\n August 20, 2024.\n39\nTable of Contents\nOff-Balance Sheet Arrangements\nOther than certain indemnification provisions (see “Short- and Long-term Liquidity – \nPurchase Obligations and Other Commitments\n” below), we do not have any other material off-balance sheet financing arrangements or liabilities, guarantee contracts, retained or contingent interests in transferred assets, or any other obligation arising out of a material variable interest in an unconsolidated entity. We do not have any majority-owned subsidiaries that are not included in the Consolidated Financial Statements. Additionally, we do not have an interest in, or relationships with, any variable interest entities.\n40\nTable of Contents\nShort- and Long-term Liquidity\nMaterial Cash Requirements \nThe following is a summary of our known material cash requirements, including those for capital expenditures, as of June 27, 2025. In addition, see the discussions further below related to unrecognized tax benefits, litigation matters, cash dividend program, dividend rights with respect to the Series A Preferred Stock, foreign exchange contracts and indemnifications.\nTotal\n1 Year (2026)\n2-3 Years (2027-2028)\n4-5 Years (2029-2030)\nMore than 5 Years (Beyond 2030)\n(in millions)\nLong-term debt, including current portion\n(1)\n$\n4,749 \n$\n2,226 \n$\n1,523 \n$\n500 \n$\n500 \nInterest on debt\n507 \n203 \n204 \n69 \n31 \nOperating leases\n165 \n36 \n53 \n30 \n46 \nPurchase obligations and other commitments\n76 \n50 \n26 \n— \n— \nMandatory deemed repatriation tax\n331 \n331 \n— \n— \n— \nTotal\n$\n5,828 \n$\n2,846 \n$\n1,806 \n$\n599 \n$\n577 \n(1)\nPrincipal portion of debt, excluding issuance costs.\nUnrecognized Tax Benefits\nAs of June 27, 2025, the liability for unrecognized tax benefits (excluding accrued interest and penalties) was approximately $569 million. Accrued interest and penalties related to unrecognized tax benefits are recognized in liabilities for uncertain tax positions and are recorded in the provision for income taxes. Accrued interest and penalties related to unrecognized tax benefits as of June 27, 2025, were approximately $82 million. Of these amounts, approximately $498 million could result in potential cash payments, of which $332 million is reasonably expected to be paid within the next twelve months. This potential cash payment is expected to be netted with offsetting favorable tax receivables totaling $148 million, including a reduction to our mandatory deemed repatriation tax obligations related to the settlement for the years 2008 through 2015, for a potential net cash payment of $184 million.\nAs noted above, we had previously reached a final agreement with the IRS regarding notices of deficiency with respect to years 2008 through 2012 and in February 2024, we also reached a final agreement for resolving the notices of proposed adjustments with respect to years 2013 through 2015. During the year ended June 27, 2025, we made payments of $130 million for interest with respect to years 2008 through 2012 and $32 million for tax and interest with respect to years 2013 through 2015, resulting in no remaining liability as of June 27, 2025 related to all years from 2008 through 2015.\nIn connection with settlements for the years 2008 through 2015, we expect to realize reductions to our mandatory deemed repatriation tax obligations and tax savings from interest deductions in future years aggregating to approximately $166 million. Of this amount, $65 million of interest savings from the interest paid with respect to years 2008 through 2015 is classified as a deferred tax asset due to interest expense limitation rules. See Part II, Item 8, Note 13,\n Income Taxes\n of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\n Litigation Matters\nFor additional information on our litigation matters, see Part II, Item 8, Note 17, \nLegal Proceedings\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nCash Dividend Program\nOn April 29, 2025, our Board of Directors authorized the adoption of a quarterly cash dividend program. Under the cash dividend program, holders of our common stock will receive dividends when and as declared by our Board of Directors. During the year ended June 27, 2025, we paid cash dividends of $0.10 per share of our outstanding common stock, totaling $36 million, including payment to holders of our Series A Preferred Stock in accordance with their participation rights.\n41\nTable of Contents\nSubsequent to year-end, on July 29, 2025, our Board of Directors declared a cash dividend of $0.10 per share of our common stock, which will be paid on September 18, 2025 to our shareholders of record as of the close of business on September 4, 2025.\nWe may modify, suspend, or cancel our cash dividend program in any manner and at any time. The amount of future dividends under our cash dividend program, and the declaration and payment thereof, will be based upon all relevant factors, including our financial position, results of operations, cash flows, capital requirements and restrictions under our Loan Agreement and other financing agreements, and shall be in compliance with applicable law.\nDividend Rights\nAs of June 27, 2025, 235,000 shares of our Series A Preferred Stock remained outstanding. These shares are entitled to cumulative preferred dividends and will also participate in any dividends declared for common shareholders on an as-converted equivalent basis. See Part II, Item 8, Note 12, \nShareholders’ Equity and Convertible Preferred Stock\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K for more information regarding these dividend provisions.\nDebt\nAs described in “Key Developments – \nCapital Allocation Actions\n” above, we undertook several financing actions during 2025, including the amendment of our Credit Facility in connection with the Separation and the exchange of a portion of our retained interest in Sandisk shares to reduce a portion of our TLA-3 loan balance.\nThe Company issued $1.60 billion aggregate principal amount of convertible senior notes in November 2023, which bear interest at an annual rate of 3.00% and mature on November 15, 2028 (the “2028 Convertible Notes”). The 2028 Convertible Notes are convertible at the option of any holder beginning August 15, 2028 at a conversion price of approximately $37.82 per share of common stock (which conversion price has been adjusted from approximately $52.20 in accordance with the indenture as a result of the Separation). Prior to August 15, 2028, if the trading price of our common stock remains above 130% of the conversion price for at least 20 trading days (whether or not consecutive) during the 30 consecutive trading-day period prior to the end of a calendar quarter, holders of the 2028 Convertible Notes would have the right to convert the 2028 Convertible Notes during the next succeeding calendar quarter. The 2028 Convertible Notes are also convertible prior to August 15, 2028 upon the occurrence of certain corporate events. Upon any conversion of the 2028 Convertible Notes, we will pay cash for the aggregate principal amount of the notes to be converted and pay or deliver, as the case may be, cash, shares of our common stock or a combination thereof, at our election, in respect of the remainder, if any, of our conversion obligation in excess of the aggregate principal amount of the notes being converted.\nThe sale price conditional conversion feature of the 2028 Convertible Notes was triggered during the calendar quarter ended June 30, 2025 and, accordingly, the holders of the 2028 Convertible Notes have the right to convert the notes during the succeeding calendar quarter ending September 30, 2025. As a result, the 2028 Convertible Notes were classified as Short-term debt in the Consolidated Financial Statements as of June 27, 2025. The Company will continue to evaluate the conversion feature quarterly to determine if the 2028 Convertible Notes become convertible in future periods.\nIn addition to our outstanding debt, as of June 27, 2025, we had $1.25 billion available for borrowing under our revolving credit facility maturing in January 2027 (the “2027 Revolving Credit Facility”), subject to customary conditions under the Loan Agreement. The agreements governing our credit facilities each include limits on secured indebtedness and certain types of unsecured subsidiary indebtedness and require us and certain of our subsidiaries to provide guarantees and collateral to the extent the conditions providing for such guarantees and collateral are met. The loan agreement governing our 2027 Revolving Credit Facility and our Term Loan A-3 (as amended, the “Loan Agreement”) requires us to comply with a financial leverage ratio covenant. As of June 27, 2025, we were in compliance with the financial covenant. Additional information regarding our indebtedness, including information about availability under our 2027 Revolving Credit Facility and the principal repayment terms, interest rates, covenants, collateral and other key terms of our outstanding indebtedness, is included in Part II, Item 8, Note 8, \nDebt\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nIn connection with the Separation, we entered into an amendment with our existing lenders under the Loan Agreement governing our Term Loan Facility and the 2027 Revolving Credit Facility that, among other changes, (a) permitted the Separation, (b) provided for the automatic release, in connection with the Separation, of guarantees and liens on collateral provided by Sandisk and Sandisk Technologies, Inc. under the Loan Agreement, (c) provided for the issuance of a new $2.51 billion Term Loan A-3 maturing in January 2027 (the “Term Loan A-3”) in a non-cash exchange to replace our previously \n42\nTable of Contents\nexisting Term Loan A-2 (the “Term Loan A-2” and, together with the Term Loan A-3, the “Term Loan Facility”), (d) facilitated the debt for equity exchange with respect to the Term Loan A-3 in connection with the Sandisk retained interest, and (e) in connection with the Separation, reduced the aggregate commitments under the 2027 Revolving Credit Facility from $2.25 billion to $1.25 billion. In June 2025, we settled $800 million of the Term Loan A-3 principal amount, through a non-cash exchange of 21.3 million shares of Sandisk common stock held by us, and a $4 million cash payment.\nWe may issue additional debt securities in the future that may be guaranteed by our 100% owned domestic subsidiary, Western Digital Technologies, Inc. (“Guarantor” and, together with Western Digital Corporation, the “Obligor Group”). Such guarantees may be full and unconditional, joint and several, on a secured or unsecured, subordinated or unsubordinated basis, and may be subject to certain customary guarantor release conditions. We conduct operations almost entirely through our subsidiaries. Accordingly, the Obligor Group’s cash flow and ability to service any guaranteed registered debt securities will depend on the earnings of our subsidiaries and the distribution of those earnings to the Obligor Group, including the earnings of the non-guarantor subsidiaries, whether by dividends, loans or otherwise. Holders of such guaranteed registered debt securities would have a direct claim only against the Obligor Group.\nThe following tables include summarized financial information for the Obligor Group. The financial information for the Obligor Group is presented on combined basis, excluding intercompany balances and transactions between the Company and the Guarantor, excluding net intercompany balances between the Obligor Group and non-guarantor subsidiaries, and excluding investments in and equity in the earnings of non-guarantor subsidiaries. The Obligor Group’s amounts due from, amounts due to, and transactions with non-guarantor subsidiaries have been presented in separate line items in the tables below.\nThe assets and liabilities of the Obligor Group include the following:\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nCurrent assets\n$\n2,992 \n$\n2,149 \nNon-current assets\n4,553 \n2,208 \nNet intercompany receivables from (payables to) non-guarantor subsidiaries\n(1,543)\n2,473 \nCurrent liabilities\n3,800 \n3,758 \nNon-current liabilities\n2,873 \n6,626 \nThe operating results of the Obligor Group include the following:\nYear Ended\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nNet sales\n$\n5,249 \n$\n4,066 \nGross profit\n1,941 \n1,002 \nOperating income (loss)\n279 \n(927)\nNet income (loss)\n(320)\n(1,211)\nResults for the Obligor Group include the following transactions with non-guarantor subsidiaries:\nYear Ended\nJune 27,\n2025\nJune 28,\n2024\n(in millions)\nIntercompany revenue\n$\n1,378 \n$\n1,416 \nNet intercompany interest (income) expense\n(4)\n8 \nIntercompany dividend income\n2,215 \n567 \n43\nTable of Contents\nPurchase Obligations and Other Commitments\nIn the normal course of business, we enter into purchase orders with suppliers for the purchase of components used to manufacture our products. These purchase orders generally cover forecasted component supplies needed for production during the next quarter, are recorded as a liability upon receipt of the components, and generally may be changed or canceled at any time prior to shipment of the components. We also enter into long-term agreements with suppliers that contain fixed future commitments, which are contingent on certain conditions such as performance, quality and technology of the vendor’s components. These arrangements are included under “Purchase obligations and other commitments” in the table above.\nMandatory Deemed Repatriation Tax\nAs of June 27, 2025, our final estimated mandatory deemed repatriation tax obligation is $331 million and is expected to be paid within the next twelve months.\nMandatory Research and Development Expense Capitalization\nSince the beginning of 2023, we have been required to capitalize and amortize both domestic and foreign R&D expenditures rather than expensing them in the year incurred. The OBBBA, which was signed into law on July 4, 2025, includes broad tax reform provisions that extend and modify key elements of the TCJA. Notably, the new legislation now allows an option for the immediate expensing of domestic R&D expenditures, beginning with our fiscal year 2026, which is expected to result in lower cash tax payments in future periods than previously anticipated.\nForeign Exchange Contracts\nWe purchase foreign exchange contracts to hedge the impact of foreign currency fluctuations on certain underlying assets, liabilities and commitments for operating expenses and product costs denominated in foreign currencies. For a description of our current foreign exchange contract commitments, see Part II, Item 8, Note 7, \nDerivative Instruments and Hedging Activities\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nIndemnifications\nIn the ordinary course of business, we may provide indemnifications of varying scope and terms to customers, vendors, lessors, business partners and other parties with respect to certain matters, including, but not limited to, losses arising out of our breach of agreements, products or services to be provided by us, environmental compliance, or from intellectual property infringement claims made by third parties. In addition, we have entered into indemnification agreements with our directors and certain of our officers that will require us, among other things, to indemnify them against certain liabilities that may arise by reason of their status or service as directors or officers. We maintain director and officer insurance, which may cover certain liabilities arising from our obligation to indemnify our directors and officers in certain circumstances.\nIt is not possible to determine the maximum potential amount under these indemnification agreements due to the limited history of prior indemnification claims and the unique facts and circumstances involved in each particular agreement. Such indemnification agreements may not be subject to maximum loss clauses. Historically, we have not incurred material costs as a result of obligations under these agreements.\nRecent Accounting Pronouncements\nFor a description of recently issued and adopted accounting pronouncements, including the respective dates of adoption and expected effects on our results of operations and financial condition, see Part II, Item 8, Note 2, \nRecent Accounting Pronouncements\n, of the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nCritical Accounting Policies and Estimates\nWe have prepared the accompanying Consolidated Financial Statements in accordance with accounting principles generally accepted in the United States (“U.S. GAAP”). The preparation of the financial statements requires the use of judgments and estimates that affect the reported amounts of revenues, expenses, assets, liabilities and shareholders’ equity. We have adopted accounting policies and practices that are generally accepted in the industry in which we operate. If these estimates differ significantly from actual results, the impact to the Consolidated Financial Statements may be material.\n44\nTable of Contents\nRevenue\nWe provide distributors and retailers (collectively referred to as “resellers”) with limited price protection for inventories held by resellers at the time of published list price reductions. We also provide resellers and OEMs with other sales incentive programs. We record estimated variable consideration related to these items as a reduction to revenue at the time of revenue recognition. We use judgment in our assessment of variable consideration in contracts to be included in the transaction price. We use the expected value method to arrive at the amount of variable consideration. We constrain variable consideration until the likelihood of a significant revenue reversal is not probable and believe that the expected value method is the appropriate estimate of the amount of variable consideration based on the fact that we have a large number of contracts with similar characteristics.\nFor sales to OEMs, our methodology for estimating variable consideration is based on the amount of consideration expected to be earned based on the OEMs’ volume of purchases from us or other agreed-upon sales incentive programs. For sales to resellers, the methodology for estimating variable consideration is based on several factors including historical pricing information, current pricing trends and channel inventory levels. Estimating the impact of these factors requires significant judgement and the estimated amount of variable consideration can differ from the actual amount.\nInventories\nWe value inventories at the lower of cost or net realizable value (“NRV”) with cost determined on a first-in, first-out basis. We record inventory write-downs of our inventory to the lower of cost or net realizable value or for obsolete or excess inventory based on assumptions, which requires significant judgement. The determination of NRV involves estimating the ASPs less any selling expenses of inventory based on market conditions and customer demand. To estimate the ASPs and selling expenses of inventory, we review historical sales, future demand, economic conditions, contract prices and other information.\nWe periodically perform an analysis of potential excess and obsolete inventory based on assumptions, which includes changes in business and economic conditions, changes in technology and projected demand of our products. If in any period we anticipate a change in those assumptions to be less favorable than our previous estimates, additional inventory write-downs may be required and could materially and negatively impact our gross margin. If in any period, we can sell inventories that had been written down to a level below the realized selling price in previous periods, higher gross profit would be recognized in the current period.\nIncome Taxes\nWe account for income taxes under the asset and liability method, which provides that deferred tax assets and liabilities be recognized for temporary differences between the financial reporting bases and the tax bases of our assets and liabilities and expected benefits of utilizing net operating loss and tax credit carryforwards. We record a valuation allowance when it is more likely than not that the deferred tax assets will not be realized. Each quarter, we evaluate the need for a valuation allowance for our deferred tax assets and we adjust the valuation allowance so that we record net deferred tax assets only to the extent that we conclude it is more likely than not that these deferred tax assets will be realized. The assessment of valuation allowances against our deferred tax assets requires estimations and significant judgment. We continue to assess and adjust our valuation allowance based on operating results and market conditions. We account for interest and penalties related to income taxes as a component of the provision for income taxes.\nWe recognize liabilities for uncertain tax positions based on a two-step process. To the extent a tax position does not meet a more-likely-than-not level of certainty, no benefit is recognized in the Consolidated Financial Statements. If a position meets the more-likely-than-not level of certainty, it is recognized in the Consolidated Financial Statements at the largest amount that has a greater than 50% likelihood of being realized upon ultimate settlement. Interest and penalties related to unrecognized tax benefits are recognized on liabilities recorded for uncertain tax positions and are recorded in our provision for income taxes. The actual liability for unrealized tax benefits in any such contingency may be materially different from our estimates, which could result in the need to record additional liabilities for unrecognized tax benefits or potentially adjust previously recorded liabilities for unrealized tax benefits and materially affect our operating results.\nLitigation and Contingencies\n45\nTable of Contents\nWe disclose information regarding claims and contingencies where the likelihood of a material loss is probable or reasonably possible. If a loss contingency is probable and the amount of the loss can be reasonably estimated, we record an accrual for the loss. In such cases, there may be an exposure to potential loss in excess of the amount accrued. Where a loss is not probable but is reasonably possible or where a loss in excess of the amount accrued is reasonably possible, we disclose the matter and an estimate of the amount of the loss or range of possible losses for the claim if a reasonable estimate can be made, unless the amount of such reasonably possible losses is not material to our financial position, results of operations or cash flows. The ability to predict the ultimate outcome of such matters involves significant judgments about the merits of the claim, applicable law, potential outcomes, estimates and inherent uncertainties. We engage relevant subject matter experts to assist us with our assessment of available information to reach conclusions on the likelihood and amount, or range, of potential loss. The actual outcome of such matters could differ materially from our estimates.\n46\nTable of Contents",
  "item2": null
}