{
  "source_file": "wec-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nA. INTRODUCTION\nIn this report, when we refer to \"WEC Energy Group,\" \"the Company,\" \"us,\" \"we,\" \"our,\" or \"ours,\" we are referring to WEC Energy Group, Inc. and all of its subsidiaries. The term \"utility\" refers to the regulated activities of the electric and natural gas utility companies, while the term \"non-utility\" refers to the activities of the electric and natural gas companies that are not regulated, as well as We Power and Bluewater. The term \"nonregulated\" refers to activities at WECI, which holds interests in several renewable generating facilities, WEC Energy Group holding company, the Integrys holding company, the PELLC holding company, Wispark, Wisvest, WECC, WBS, and PDL. References to \"Notes\" are to the Notes to Consolidated Financial Statements included in this Annual Report on Form 10-K.\nFor more information about our business operations, see Note 22, Segment Information, and Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations. For information about our business strategy, see Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations – Corporate Developments.\nWEC Energy Group, Inc.\nWe were incorporated in the state of Wisconsin in 1981 and became a diversified holding company in 1986. We maintain our principal executive offices in Milwaukee, Wisconsin. On June 29, 2015, we acquired 100% of the outstanding common shares of Integrys and changed our name to WEC Energy Group, Inc. Our wholly owned subsidiaries provide or invest in regulated natural gas and electricity, and renewable energy, as well as nonregulated renewable energy. We have an approximately 60% equity interest in ATC (an electric transmission company operating in Illinois, Michigan, Minnesota, and Wisconsin). At December 31, 2024, we had six reportable segments, which are discussed below. For additional information about our reportable segments, see Note 22, Segment Information.\nAvailable Information\nOur annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports are made available on our website, www.wecenergygroup.com, free of charge, as soon as reasonably practicable after they are filed with or furnished to the SEC. The SEC maintains an Internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC at www.sec.gov.\nInvestors should note that WEC Energy Group announces material financial information in SEC filings, press releases, and public conference calls. In accordance with SEC guidelines, WEC Energy Group also uses the \"Investors\" tab on its website, www.wecenergygroup.com, to communicate with investors. It is possible that the financial and other information posted there could be deemed material information. The information on WEC Energy Group's website is not part of this document.\nB. UTILITY ENERGY OPERATIONS\nWisconsin Segment\nThe Wisconsin segment includes the electric and natural gas utility operations of WE, WPS, WG, and UMERC.\nElectric Utility Operations\nOur electric utility operations include the operations of WE, WPS, and UMERC.\n•\nWE generates and distributes electric energy to customers located in southeastern Wisconsin (including the metropolitan Milwaukee area), east central Wisconsin, and northern Wisconsin. \n•\nWPS generates and distributes electric energy to customers located in northeastern and central Wisconsin.\n2024 Form 10-K\n4\nWEC Energy Group, Inc.\nTable of Contents\n•\nUMERC generates and distributes electric energy to customers, including one iron ore mine owned by Tilden, located in the Upper Peninsula of Michigan. \nOperating Revenues\nFor information about our operating revenues disaggregated by customer class for the years ended December 31, 2024, 2023, and 2022, see Note 1(d), Operating Revenues, and Note 4, Operating Revenues.\nElectric Sales\nOur electric energy deliveries included supply and distribution sales to retail, wholesale, and resale customers, and distribution sales to those customers who switched to an alternative electric supplier in the Upper Peninsula of Michigan. In 2024, retail revenues accounted for 93.4% of total electric operating revenues, wholesale revenues accounted for 2.1% of total electric operating revenues, and resale revenues accounted for 3.6% of total electric operating revenues. See Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations – Results of Operations – Wisconsin Segment Contribution to Net Income Attributed to Common Shareholders for information on MWh sales by customer class.\nOur electric utilities are authorized to provide retail electric service in designated territories in the state of Wisconsin, as established by indeterminate permits and boundary agreements with other utilities, and in certain territories in the state of Michigan pursuant to franchises granted by municipalities. \nWe provide wholesale electric service to various customers, including electric cooperatives, municipal joint action agencies, other investor-owned utilities, municipal utilities, and energy marketers.\nThe majority of our sales for resale are sold into an energy market operated by MISO at market rates based on the availability of our generation and market demand. Retail fuel costs are reduced by the amount that revenue exceeds the cost of sales derived from these opportunity sales.\nOur electric utilities buy and sell electric power by participating in the MISO Energy Markets. The cost of our individual generation offered into the MISO Energy Markets compared to our competitors affects how often our generating units are dispatched and whether we buy or sell power. For more information on the MISO Energy Markets, see E. Regulation.\nSteam Sales\nWE has a steam utility that generates, distributes, and sells steam supplied by the VAPP to customers in metropolitan Milwaukee, Wisconsin. Steam is used by customers for processing, space heating, domestic hot water, and humidification. Annual sales of steam fluctuate from year to year based on system growth and variations in weather conditions. \nElectric Sales Forecast\nOur service territory experienced relatively flat weather-normalized retail electric sales in 2024, compared with 2023. We currently forecast retail electric sales volumes, excluding the Tilden mine located in the Upper Peninsula of Michigan, to increase 0.7% for 2025, assuming normal weather.\nCustomers\nYear Ended December 31\n(in thousands)\n2024\n2023\n2022\nElectric customers – end of year \nResidential\n1,499.4\n \n1,487.9 \n1,471.4 \nSmall commercial and industrial\n180.8\n \n179.0 \n176.9 \nLarge commercial and industrial\n0.8\n \n0.8 \n0.9 \nWholesale and other\n1.7\n \n1.6 \n1.6 \nTotal electric customers – end of year \n1,682.7\n \n1,669.3 \n1,650.8 \nSteam customers – end of year\n0.4\n \n0.4 \n0.4 \n2024 Form 10-K\n5\nWEC Energy Group, Inc.\nTable of Contents\nElectric Commercial and Industrial Retail Customers\nWe provide electric utility service to a diversified base of customers in industries such as metals and other manufacturing, paper, governmental, food manufacturing, and health services.\nElectric Generation and Supply Mix\nOur electric supply strategy is to provide our customers with energy from a diverse generation portfolio that is expected to balance a stable, reliable, and affordable supply of electricity with environmental stewardship. Through our participation in the MISO Energy Markets, we supply a significant amount of electricity to our customers from generation that we own. We supplement our internally generated power supply with long-term PPAs, including the Point Beach PPA discussed under the heading \"Power Purchase Commitments,\" and through spot purchases in the MISO Energy Markets. We also sell excess power supply into the MISO Energy Markets when it is economical, which reduces net fuel costs by offsetting costs of purchased power. All options, including owned generation resources and purchased power opportunities, are continually evaluated on a real time basis to select and dispatch the lowest-cost resources available to meet system load requirements.\nThe table below indicates our sources of electric energy supply as a percentage of sales for the three years ended December 31, as well as estimates for 2025:\nEstimate \n(1)\nActual\n2025\n2024\n2023\n2022\nCompany-owned generation:\nCoal\n25.7 \n%\n29.4\n \n%\n29.0 \n%\n29.4 \n%\nNatural gas:\nCombined cycle\n25.4 \n%\n27.2\n \n%\n28.7 \n%\n27.2 \n%\nSteam turbine\n0.5 \n%\n1.0\n \n%\n0.9 \n%\n1.0 \n%\nNatural gas/oil peaking units\n6.3 \n%\n7.2\n \n%\n5.5 \n%\n3.7 \n%\nRenewables \n(2)\n8.5 \n%\n6.5\n \n%\n5.5 \n%\n5.8 \n%\nTotal company-owned generation\n66.4 \n%\n71.3\n \n%\n69.6 \n%\n67.1 \n%\nPower purchase contracts:\nNuclear\n20.4 \n%\n20.3\n \n%\n20.1 \n%\n19.8 \n%\nNatural gas\n— \n%\n—\n \n%\n— \n%\n2.2 \n%\nRenewables \n(2)\n1.7 \n%\n1.9\n \n%\n2.0 \n%\n1.9 \n%\nOther\n0.1 \n%\n—\n \n%\n0.1 \n%\n0.2 \n%\nTotal power purchase contracts\n22.2 \n%\n22.2\n \n%\n22.2 \n%\n24.1 \n%\nPurchased power from MISO\n11.4 \n%\n6.5\n \n%\n8.2 \n%\n8.8 \n%\nTotal purchased power\n33.6 \n%\n28.7\n \n%\n30.4 \n%\n32.9 \n%\nTotal electric utility supply\n100.0 \n%\n100.0\n \n%\n100.0 \n%\n100.0 \n%\n(1)    \nThe values included in the estimate assume a natural gas price based on the December 2024 NYMEX.\n(2)    \nIncludes hydroelectric, biomass, solar, and wind generation.\nElectric Generation Facilities\nOur generation portfolio is a mix of energy resources having different operating characteristics and fuel sources designed to balance providing energy that is stable, reliable, and affordable with environmental stewardship. We own 8,158 MWs of generation capacity, including wholly owned and jointly owned facilities. We Power's generating units are also included in the generation capacity. Our facilities include natural gas-fired plants, coal-fired plants, and renewable generation. Certain of our natural gas-fired generation units have the ability to burn oil if natural gas is not available due to delivery constraints. For more information about our facilities, see Item 2. Properties.\nEnvironmental Goals\nWe have announced goals to achieve reductions in carbon emissions from our electric generation fleet by 60% by the end of 2025 and by 80% by the end of 2030, both from a 2005 baseline. As of the end of 2024, our electric generation fleet has achieved a 56% reduction in carbon emissions from the 2005 baseline. We expect to achieve these goals by continuing to make operating \n2024 Form 10-K\n6\nWEC Energy Group, Inc.\nTable of Contents\nrefinements, retiring less efficient generating units, and executing our capital plan. Over the longer term, the target for our generation fleet is to be net carbon neutral by 2050. \nAs part of our path toward these goals, we have started implementing co-firing with natural gas at the ERGS coal-fired units and plan to co-fire with natural gas at Weston Unit 4. By the end of 2030, we expect to use coal as a backup fuel only and to be in a position to eliminate coal as an energy source by the end of 2032.\nCreating a Sustainable Future\nOur capital plan includes the retirement of older, fossil-fueled generation, to be replaced with zero-carbon-emitting renewables and reliable, efficient natural gas-fired generation. The retirements are intended to address compliance with the EPA Clean Air rules as well as contribute to meeting our goals to reduce CO\n2\n emissions from our electric generation. When taken together, the retirements and new investments in renewables and reliable, efficient natural gas generation discussed in more detail below should better balance our supply with our demand, while helping to address compliance and maintaining reliable, affordable energy for our customers. \nWe have already retired nearly 2,500 MWs of fossil-fueled generation since the beginning of 2018, which includes the retirement of OCPP Units 5 and 6 in May 2024, the 2019 retirement of the PIPP, and the 2018 retirements of the Pleasant Prairie power plant, the Pulliam power plant, and the jointly-owned Edgewater Unit 4 generating unit. See Note 6, Regulatory Assets and Liabilities, for more information related to these power plant retirements. We expect to retire approximately 1,200 MWs of additional coal-fired generation by the end of 2031, which includes the planned retirements of OCPP Units 7 and 8, the jointly-owned Columbia Units 1 and 2 while investigating conversion of at least one unit to natural gas, and Weston Unit 3. See Note 7, Property, Plant, and Equipment, for more information.\nSee Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations – Corporate Developments for more information on our capital plan.\nAlso see Item 1A. Risk Factors - Risks Related to Legislation and Regulation - Our operations, capital expenditures, and financial results may be affected by the impact of greenhouse gas legislation, regulation, and emission reduction goals.\nRenewable Generation\nOur electric utilities meet a portion of their electric generation supply with various renewable energy resources, including wind, solar, hydroelectric, and biomass. This helps our electric utilities work towards our goals of reducing carbon emissions while also maintaining compliance with renewable energy legislation. These renewable energy resources also help us maintain diversity in our generation portfolio, which effectively serves as a price hedge against future fuel costs, and will help mitigate the risk of potential unknown costs associated with any future carbon restrictions for electric generators. \nWind\nIn September 2024, WE and WPS, along with an unaffiliated utility, filed a request with the PSCW to acquire and construct Badger Hollow Wind and to acquire Whitetail, two utility-scale wind-powered electric generating facilities. If approved, Badger Hollow Wind will be located in Iowa and Grant counties, Wisconsin, and Whitetail will be located in Grant County, Wisconsin. Once fully constructed, WE and WPS will collectively own 100 MWs of wind generation of Badger Hollow Wind and 60 MWs of wind generation of Whitetail. If approved, the construction of both of these projects is expected to be completed in 2027.\nSolar and Battery Storage\nIn December 2024, the construction of the solar portion of Paris located in Kenosha County, Wisconsin was completed, and the facility became commercially operational. Paris is owned by WE, WPS, and an unaffiliated utility, with WE and WPS collectively owning 180 MWs of solar generation. WE and WPS will collectively own 99 MWs of battery storage of this project, with construction expected to be completed in 2025. \n2024 Form 10-K\n7\nWEC Energy Group, Inc.\nTable of Contents\nAs part of our commitment to invest in additional zero-carbon generation within our Wisconsin segment, we have filed requests to acquire and construct 868 MWs of additional renewable generation and 244 MWs of battery storage, including the following:\n•\nIn October 2024, WE and WPS, along with an unaffiliated utility, filed a request with the PSCW to acquire and construct Good Oak and Gristmill, two utility-scale solar-powered electric generating facilities. If approved, both Good Oak and Gristmill will be located in Columbia County, Wisconsin. Once fully constructed, WE and WPS will collectively own 88 MWs of solar generation of Good Oak and 60 MWs of solar generation of Gristmill. If approved, the construction for both projects is expected to be completed in 2028.\n•\nIn September 2024, WE and WPS, along with an unaffiliated utility, filed a request with the PSCW to acquire Dawn Harvest, a utility-scale solar-powered electric generating facility with a battery energy storage system. If approved, the project will be located in Rock County, Wisconsin and once fully constructed, WE and WPS will collectively own 135 MWs of solar generation and WE will own 50 MWs of battery storage of this project. If approved, the construction is expected to be completed in 2028.\n•\nIn September 2024, WE and WPS, along with an unaffiliated utility, filed a request with the PSCW to acquire Saratoga, a utility-scale solar-powered electric generating facility with a battery energy storage system, and Ursa, a utility-scale solar-powered electric generating facility. If approved, Saratoga will be located in Wood County, Wisconsin and Ursa will be located in Columbia County, Wisconsin. Once fully constructed, WE and WPS will collectively own 135 MWs of solar generation and 45 MWs of battery storage of Saratoga and 180 MWs of solar generation of Ursa. If approved, the Ursa construction is expected to be completed in 2027, and the Saratoga construction is expected to be completed in 2028.\n•\nIn February 2024, WE and WPS, along with an unaffiliated utility, filed a request with the PSCW to acquire and construct High Noon, a utility-scale solar-powered electric generating facility \nwith a battery energy storage system\n. If approved, the project will be located in Columbia County, Wisconsin and once fully constructed, WE and WPS will collectively own 2\n70 MWs of solar generation and 149 MWs of battery storage of this project\n. If approved, the construction of the solar and battery storage is expected to be completed in 2027. \nWe have also received approvals from the PSCW to invest in 595 MWs of renewable generation and 217 MWs of battery storage currently under construction, including the following:\n•\nIn April 2024, UMERC received MPSC approval to acquire and construct Renegade, a utility-scale solar-powered electric generating facility. The project will be located in Delta and Marquette counties, Michigan and once fully constructed, UMERC will own 100 MWs of solar generation. The construction is expected to be \ncompleted by the end of 2026.\n•\nIn April 2023, \nWE and WPS, along with an unaffiliated utility, received PSCW approval to acquire Koshkonong, a utility-scale solar-powered electric generating facility with a battery energy storage system. The project will be located in Dane County, Wisconsin and once fully constructed, WE and WPS will collectively own 270 MWs of solar generation and 149 MWs of battery storage of this project. The construction of the solar portion and battery storage is \nexpected to be completed in 2026 and 2027, respectively.\n•\nIn December 2022, WE and WPS, along with an unaffiliated utility, received PSCW approval to acquire and construct Darien, a utility-scale solar-powered electric generating facility with a battery energy storage system. The project will be located in Rock and Walworth counties, Wisconsin and once fully constructed, WE and WPS will collectively own 225 MWs of solar generation and 68 MWs of battery storage of this project. The\n construction of the solar portion and battery storage is expected to be completed in 2025 and 2026, respectively\n.\nNatural Gas-Fired Generation\nIn May 2024, WE completed the acquisition of an\n add\nitional 100 MWs o\nf \nWest Riverside's nameplate capacity, in the second of two option exercises. West Riverside is a commercially operational dual fueled combined cycle generation facility in Beloit, Wisconsin and is operated by an unaffiliated utility. \n2024 Form 10-K\n8\nWEC Energy Group, Inc.\nTable of Contents\nIn April 2024, WE filed requests with the PSCW for the following projects:\n•\nAdding seven natural gas-fired RICE units near the Paris Generating Station. The new RICE units would be fueled with natural gas and capable of producing approximately 128 MWs.\n•\nBuilding five natural gas-fired combustion turbines capable of producing approximately 1,100 MWs, which would be located at the existing OCPP site.\nElectric System Reliability\nThe PSCW requires us to maintain a planning reserve margin above our projected annual peak demand forecast to help ensure reliability of electric service to our customers. These planning reserve requirements are consistent with the MISO calculated planning reserve margin. In 2008, the PSCW established a 14.5% reserve margin requirement for long-term planning (planning years two through ten). For short-term planning (planning year one), the PSCW requires Wisconsin utilities to follow the planning reserve margin established by MISO. MISO implemented seasonal requirements effective June 1, 2023. The installed capacity reserve margins for the planning year June 1, 2024 through May 31, 2025 are as follows: 17.7% summer (June – August); 25.2% fall (September – November); 49.4% winter (December – February); and 40.8% spring (March – May). MISO's short-term reserve margin requirements experience year-to-year and season-to-season fluctuations, primarily due to changes in the generation resource mix and average forced outage rate of generation within the MISO footprint.\nMichigan legislation requires all electric providers to annually demonstrate to the MPSC that they have adequate resources to serve the anticipated needs of their customers for a minimum of four consecutive planning years beginning in the upcoming planning year June 1, 2025, through May 31, 2026. The MPSC has established future planning reserve margin requirements based on the same study conducted by MISO that determines the short-term reserve margin requirements.\nIn both our Wisconsin and Michigan jurisdictions, we believe that we have adequate capacity through company-owned generation units and power purchase contracts to meet the MISO calculated planning reserve margin during the current planning year. We also fully anticipate that we will have adequate capacity to meet the planning reserve margin requirements for the upcoming planning year in both jurisdictions.\n \nFuel and Purchased Power Costs\nOur retail electric rates in Wisconsin are established by the PSCW and include base amounts for fuel and purchased power costs. The electric fuel rules set by the PSCW generally allow us to defer, for subsequent rate recovery or refund, under- or over-collections of actual fuel and purchased power costs beyond a 2% price variance from the costs included in the rates charged to customers. Prudently incurred fuel and purchased power costs are recovered dollar-for-dollar from our Michigan retail electric customers. For more information about the fuel rules, see E. Regulation.\nOur average fuel and purchased power costs per MWh by fuel type, including delivery costs, were as follows for the years ended December 31:\n2024\n2023\n2022\nCoal\n$\n25.38\n \n$\n25.80 \n$\n25.37 \nNatural gas combined cycle\n20.52\n \n30.41 \n42.11 \nNatural gas/oil peaking units\n42.41\n \n56.41 \n90.22 \nBiomass\n81.33\n \n87.73 \n78.42 \nPurchased power\n57.39\n \n53.90 \n58.78 \nWE and WPS purchase coal under long-term contracts, which helps with price stability. Coal and associated transportation services are exposed to volatility in pricing due to changing domestic and world-wide demand for coal and diesel fuel. To mitigate against this volatility risk, WE and WPS have PSCW approval for a hedging program. This program allows them to hedge, over a 60-month period, up to 75% of their potential risks related to rail transportation fuel surcharge exposure. The results of this hedging program, when used, are reflected in the average costs of fuel and purchased power.\nWe purchase natural gas for our plants on the spot market from natural gas marketers, utilities, and producers, and we arrange for transportation of the natural gas to our plants. We have firm and interruptible transportation, as well as balancing and storage \n2024 Form 10-K\n9\nWEC Energy Group, Inc.\nTable of Contents\nagreements, intended to support our plants' variable usage. WE and WPS also have PSCW approval for a hedging program to mitigate against volatility related to natural gas price risk. This program allows them to hedge, over a 60-month period, up to 75% of their estimated natural gas use for electric generation. The results of this hedging program are reflected in the average costs of natural gas.\nCoal Supply\nWe diversify the coal supply for our electric generating facilities and jointly-owned plants by purchasing coal from several mines in Wyoming and Pennsylvania, as well as from various other states. For 2025, 100% of our total projected coal requirements of 4.3 million tons are contracted under fixed-price contracts. See Note 24, Commitments and Contingencies, for more information on amounts of coal purchases and coal deliveries under contract.\nThe annual tonnage amounts contracted for the next three years are as follows.\n(in thousands)\nAnnual Tonnage\n2025\n4,446 \n(1)\n2026\n1,400 \n2027\n— \n(1)    \nCoal contracts exceed the total projected requirement due to prior year delivery constraints and forecasted lower operating hours.\nCoal Deliveries\nAll of our coal requirements are expected to be shipped by unit trains that we own or lease under existing transportation agreements. The unit trains transport the coal for electric generating facilities from mines in Wyoming and Pennsylvania. Additional small volume agreements may also be used to supplement the normal coal supply for our facilities. For additional information concerning risks related to coal supply chain disruptions, see the risk factor below.\n•",
  "item7": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nCORPORATE DEVELOPMENTS\nIntroduction\nWe are a diversified holding company with natural gas and electric utility operations (serving customers in Wisconsin, Illinois, Michigan, and Minnesota), an approximately 60% equity ownership interest in ATC (a for-profit electric transmission company regulated by FERC and certain state regulatory commissions), and non-utility energy infrastructure operations through We Power (which owns generation assets in Wisconsin that it leases to WE), Bluewater (which owns underground natural gas storage facilities in Michigan), and WECI, which holds ownership interests in several renewable generating facilities.\nCorporate Strategy\nOur goal is to continue to build and sustain long-term value for our shareholders and customers by focusing on the fundamentals of our business: environmental stewardship; reliability; operating efficiency; financial discipline; exceptional customer care; and safety. Our capital plan provides a roadmap for us to achieve this goal. It is an aggressive plan to cut emissions, maintain superior reliability, deliver significant savings for customers, and grow our investment in the future of energy.\nThroughout our strategic planning process, we take into account important developments, risks and opportunities, including new technologies, customer preferences and affordability, energy resiliency efforts, and sustainability. \nCreating a Sustainable Future\nOur capital plan includes the retirement of older, fossil-fueled generation, to be replaced with zero-carbon-emitting renewables and reliable, efficient natural gas-fired generation. The retirements are intended to address compliance with the EPA Clean Air rules as well as contribute to meeting our goals to reduce CO\n2\n emissions from our electric generation. When taken together, the retirements and new investments in renewables and reliable, efficient natural gas generation should better balance our supply with our demand, while helping to address compliance and maintaining reliable, affordable energy for our customers. \nWe have announced goals to achieve reductions in carbon emissions from our electric generation fleet by 60% by the end of 2025 and by 80% by the end of 2030, both from a 2005 baseline. We expect to achieve these goals by continuing to make operating refinements, retiring less efficient generating units, and executing our capital plan. Over the longer term, the target for our generation fleet is to be net carbon neutral by 2050.\nAs part of our path toward these goals, we have started implementing co-firing with natural gas at the ERGS coal-fired units and plan to co-fire with natural gas at Weston Unit 4. By the end of 2030, we expect to use coal as a backup fuel only and to be in a position to eliminate coal as an energy source by the end of 2032.\nWe have already retired nearly 2,500 MWs of fossil-fueled generation since the beginning of 2018, which includes the retirement of OCPP Units 5 and 6 in May 2024, the 2019 retirement of the PIPP, and the 2018 retirements of the Pleasant Prairie power plant, the Pulliam power plant, and the jointly-owned Edgewater Unit 4 generating unit. We expect to retire approximately 1,200 MWs of additional coal-fired generation by the end of 2031, which includes the planned retirements of OCPP Units 7 and 8, the jointly-owned Columbia Units 1 and 2, and Weston Unit 3. For more information on the retirement of OCPP Units 5 and 6, see Note 6, Regulatory Assets and Liabilities. See Note 7, Property, Plant, and Equipment, for more information related to planned power plant retirements.\nIn addition to retiring these older, fossil-fueled plants, we expect to invest approximately $9.1 billion from 2025-2029 in regulated renewable energy in Wisconsin. Our plan is to replace a portion of the retired capacity by building and owning zero-carbon-emitting renewable generation facilities that are anticipated to include the following new investments:\n•\n2,900 MWs of utility-scale solar;\n•\n900 MWs of wind; and\n•\n565 MWs of battery storage.\n2024 Form 10-K\n49\nWEC Energy Group, Inc.\nTable of Contents\nWe also plan on investing in a combination of clean, natural gas-fired generation, including:\n•\n1,100 MWs of combustion turbines to be constructed at our OCPP site (we plan on constructing a new natural gas lateral pipeline to support this generation); with\n•\nAn additional 675 MWs of combustion turbines planned; and\n•\n128 MWs of RICE natural gas-fueled generation to be constructed in Kenosha County; with \n•\nAn additional 114 MWs of RICE natural gas-fueled generation planned.\nIn May 2024, WE completed the acquisition of an additional 100 MWs of West Riverside's nameplate capacity, a commercially operational dual fueled combined cycle generation facility in Beloit, Wisconsin operated by an unaffiliated utility. See Note 2, Acquisitions, for more information.\nFor more details on the projects discussed above, see Liquidity and Capital Resources – Cash Requirements – Significant Capital Projects.\nIn December 2018, WE received approval from the PSCW for two renewable energy pilot programs. The Solar Now pilot is expected to add a total of 35 MWs of solar generation to WE's portfolio, allowing non-profit and governmental entities, as well as commercial and industrial customers, to site utility owned solar arrays on their property. Under this program, WE has energized 29 Solar Now projects and currently has another one under construction, together totaling more than 30 MWs. The second program, the DRER pilot, is designed to allow large commercial and industrial customers to access renewable resources that WE would operate. The DRER pilot is intended to help these larger customers meet their sustainability and renewable energy goals, and could add up to 35 MWs of renewables to WE's portfolio. In July 2023, the PSCW approved the Renewable Pathway Pilot, the third renewable energy program. This program allows WE and WPS commercial and industrial customers to subscribe to a portion of a utility-scale, Wisconsin-based renewable energy generating facility for up to 125 MWs at WE and 40 MWs at WPS. Under this program, WE has signed up seven customers for a total of 59 MWs of generation capacity.\nIn August 2021, the PSCW approved pilot programs for WE and WPS to install and maintain EV charging equipment for customers at their homes or businesses. We proposed modifications to these pilot programs, which were approved by the PSCW and implemented on January 1, 2025. The programs provide direct benefits to customers by removing cost barriers associated with installing EV equipment. In October 2021, subject to the receipt of any necessary regulatory approvals, we pledged to expand the EV charging network within the service territories of our electric utilities. In doing so, we joined a coalition of utility companies in a unified effort to make EV charging convenient and widely available throughout the Midwest. The coalition we joined is planning to help build and grow EV charging corridors, enabling the general public to safely and efficiently charge their vehicles.\nWe also continue to focus on methane emission reductions by improving our natural gas distribution system. We set a target across our natural gas distribution operations to achieve net-zero methane emissions by the end of 2030. We plan to achieve our net-zero goal through an effort that includes continuous operational improvements and equipment upgrades, as well as the use of RNG throughout our natural gas utility systems. In 2022, we received approval from the PSCW for our RNG pilots and in 2023, we began transporting the output of local dairy farms onto our natural gas distribution systems in Wisconsin. The RNG supplied will directly replace higher-emission methane from natural gas that would have entered our pipes. We currently have contracts in place for 2.1 Bcf of RNG. In addition, subject to regulatory approval and market conditions, we expect to procure RTCs.\nIn December 2023, we started a pilot program with Electric Power Research Institute and CMBlu Energy, a Germany-based designer and manufacturer of an organic solid flow battery, to test this new form of long-duration energy storage on the U.S. electric grid at our VAPP. The program will test battery system performance, including the ability to store and discharge energy for up to twice as long as the typical lithium-ion batteries in use today. We expect the pilot activities to continue into 2025.\nReliability\nWe have made significant reliability-related investments in recent years, and in accordance with our capital plan, expect to continue strengthening and modernizing our generation fleet, as well as our electric and natural gas distribution networks to further improve reliability.\n2024 Form 10-K\n50\nWEC Energy Group, Inc.\nTable of Contents\nBelow are a few examples of reliability projects that are proposed, currently underway, or recently completed.\n•\nWE and WG have completed the construction of their respective LNG facilities. Each facility provides approximately one Bcf of natural gas supply to meet anticipated peak demand, without requiring the construction of additional interstate pipeline capacity. The WE LNG facility was commercially operational in November 2023 and the WG LNG facility was commercially operational in February 2024.\n•\nIn April 2024, WE filed a request with the PSCW to construct an LNG facility with a storage capacity of two Bcf, which would be located on the OCPP site. In addition, the construction of additional LNG facilities in Wisconsin has been proposed as part of the 2025-2029 capital plan and would provide another approximately four Bcf of natural gas supply. The LNG facilities are expected to reduce the likelihood of constraints on our natural gas distribution system during the highest demand days of winter.\n•\nThrough the SMP, PGL had been working to replace old iron pipes and facilities in Chicago’s natural gas delivery system with modern polyethylene pipes to reinforce the long-term safety and reliability of the system. In November 2023, the ICC ordered PGL to pause spending on the SMP until the ICC completed a proceeding to determine the optimal method for replacing aging natural gas infrastructure and a prudent investment level. The ICC granted PGL a limited-scope rehearing related to authorized spending for the completion of SMP projects that started in 2023 and the authorized spending for emergency repairs needed to ensure the safety and reliability of PGL's delivery system. On May 30, 2024, the ICC issued a written order on the rehearing, approving $28.5 million of additional spending for emergency work, which represents a $1.6 million increase to PGL's annual revenue requirement. \nOn February 20, 2025, the ICC issued an order setting expectations for PGL's prospective operations under its SMP. For more         information, see Note 26, Regulatory Environment, and Factors Affecting Results, Liquidity, and Capital Resources - Regulatory, Legislative, and Legal Matters - Future Illinois Proceedings.\n•\nOur utilities continue to upgrade their electric and natural gas distribution systems to enhance reliability and storm hardening.\nWe expect to spend approximately $4.5 billion from 2025 to 2029 on reliability related projects with continued investment over the next decade. For more details, see Liquidity and Capital Resources – Cash Requirements – Significant Capital Projects.\nOperating Efficiency\nWe continually look for ways to optimize the operating efficiency of our company and will continue to do so under our capital plan. For example, we are making progress on our AMI program, replacing aging meter-reading equipment on both our network and customer property. An integrated system of smart meters, communication networks, and data management programs enables two-way communication between our utilities and our customers. This program reduces the manual effort for disconnects and reconnects and enhances outage management capabilities.\nWe continue to focus on integrating the resources of all our businesses and finding the best and most efficient processes.\nFinancial Discipline\nA strong adherence to financial discipline is essential to meeting our earnings projections and maintaining a strong balance sheet, stable cash flows, a growing dividend, and quality credit ratings.\nWe follow an asset management strategy that focuses on investing in and acquiring assets consistent with our strategic plans, as well as disposing of assets, including property, plants, equipment, and entire business units, that are no longer strategic to operations, are not performing as intended, or have an unacceptable risk profile. \nOur planned investment focus from 2025 to 2029 is in our regulated utilities and our investment in ATC. We expect total capital expenditures for our regulated utility businesses to be approximately $24.4 billion from 2025 to 2029. In addition, we currently forecast that our share of ATC's projected capital expenditures over the next five years will be approximately $3.2 billion. In February 2025, we invested approximately $405.9 million in our non-utility energy infrastructure business with the acquisition of Hardin III. Specific projects included in the $28.0 billion capital plan are discussed in more detail below under Liquidity and Capital Resources – Cash Requirements – Significant Capital Projects. Also, see Note 2, Acquisitions, for additional information on the acquisition of Hardin III and other recent and pending transactions. See Note 3, Disposition, for more information on the disposal of real estate.\n2024 Form 10-K\n51\nWEC Energy Group, Inc.\nTable of Contents\nExceptional Customer Care\nOur approach is driven by an intense focus on delivering exceptional customer care every day. We strive to provide the best value for our customers by demonstrating personal responsibility for results, leveraging our capabilities and expertise, and using creative solutions to meet or exceed our customers’ expectations.\nA multiyear effort is driving a standardized, seamless approach to digital customer service across our companies. We have moved all utilities to a common platform for all customer-facing self-service options. Using common systems and processes reduces costs, provides greater flexibility and enhances the consistent delivery of exceptional service to customers.\nSafety\nSafety is one of our core values and a critical component of our culture. We are committed to keeping our employees and the public safe through a comprehensive corporate safety program that focuses on employee engagement and elimination of at-risk behaviors.\nUnder our \"Target Zero\" mission, we have an ultimate goal of zero incidents, accidents, and injuries. Management and union leadership work together to reinforce the Target Zero culture. We set annual goals for safety results as well as measurable leading indicators, in order to raise awareness of at-risk behaviors and situations and guide injury-prevention activities. All employees are encouraged to report unsafe conditions or incidents that could have led to an injury. Injuries and tasks with high levels of risk are assessed, and findings and best practices are shared across our companies.\nOur corporate safety program provides a forum for addressing employee concerns, training employees and contractors on current safety standards, and recognizing those who demonstrate a safety focus.\nRESULTS OF OPERATIONS\nThe following discussion and analysis of our Results of Operations includes comparisons of our results for the year ended December 31, 2024 with the year ended December 31, 2023, and for the year ended December 31, 2023 with the year ended December 31, 2022.\nConsolidated Earnings\nThe following table compares our consolidated results, including favorable or better, \"B,\" and unfavorable or worse, \"W,\" variances:\nYear Ended December 31\nB (W)\nB (W)\n(in millions, except per share data)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nWisconsin\n$\n863.1\n \n$\n851.3 \n$\n758.4 \n$\n11.8 \n$\n92.9 \nIllinois\n252.1\n \n140.0 \n226.9 \n112.1 \n(86.9)\nOther states \n54.5\n \n48.1 \n39.7 \n6.4 \n8.4 \nElectric transmission\n141.0\n \n119.1 \n129.5 \n21.9 \n(10.4)\nNon-utility energy infrastructure\n380.8\n \n336.0 \n324.4 \n44.8 \n11.6 \nCorporate and other \n(164.3)\n(162.8)\n(70.8)\n(1.5)\n(92.0)\nNet income attributed to common shareholders\n$\n1,527.2\n \n$\n1,331.7 \n$\n1,408.1 \n$\n195.5 \n$\n(76.4)\nDiluted earnings per share\n \n$\n4.83\n \n$\n4.22 \n$\n4.45 \n$\n0.61 \n$\n(0.23)\n2024 Compared with 2023\nEarnings increased $195.5 million during 2024, compared with 2023. The significant factors impacting the $195.5 million increase in earnings were:\n•\nA $112.1 million increase in net income attributed to common shareholders at the Illinois segment, primarily due to a $178.9 million impairment recorded in 2023 associated with the ICC's disallowance of certain incurred capital costs in its November 2023 rate orders for PGL and NSG. An increase in margins related to the impacts of the November 2023 rate orders, \n2024 Form 10-K\n52\nWEC Energy Group, Inc.\nTable of Contents\neffective December 1, 2023 for PGL, and February 1, 2024 for NSG, also contributed to the higher net income. SMP costs that were previously being recovered under PGL's QIP rider are now included in PGL's base rates. Partially offsetting these increases were higher property and revenue taxes, depreciation and amortization, and natural gas distribution and maintenance costs, along with a $25.3 million pre-tax charge to income related to the ICC's disallowance of certain capital costs in PGL's 2016 rider QIP reconciliation. See Note 26, Regulatory Environment, for more information on the PGL and NSG rate orders and the ICC's disallowance.\n•\nA $44.8 million increase in net income attributed to common shareholders at the non-utility energy infrastructure segment, driven by higher operating income at WECI and an increase in PTCs from our non-utility renewable generating facilities in 2024.\n•\nA $21.9 million increase in net income attributed to common shareholders at the electric transmission segment, driven by higher equity earnings from ATC primarily due to the positive impact of a FERC order issued in October 2024 addressing complaints related to ATC's ROE. For information on this FERC order, see Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – American Transmission Company Allowed Return on Equity Complaints. Continued capital investment by ATC also contributed to the year-over-year increase in equity earnings.\n•\nAn $11.8 million increase in net income attributed to common shareholders at the Wisconsin segment, driven by an increase in margins due to the impact of the Wisconsin limited rate case re-openers approved by the PSCW, effective January 1, 2024, and a positive impact from collections of fuel and purchased power costs. These increases were partially offset by higher operating expenses, primarily driven by higher depreciation and amortization. See Note 26, Regulatory Environment, for more information on the limited rate case re-openers. \n2023 Compared with 2022\nEarnings decreased $76.4 million during 2023, compared with 2022. The significant factors impacting the $76.4 million decrease in earnings were:\n•\nA $92.0 million increase in the net loss attributed to common shareholders at the corporate and other segment, driven by higher interest expense on both long-term and short-term debt. This negative impact was partially offset by net gains from the investments held in the Integrys rabbi trust during 2023, compared with net losses during the same period in 2022. The gains and losses from the investments held in the rabbi trust partially offset the changes in benefit costs related to deferred compensation, which are primarily included in other operation and maintenance expense in our utility segments. See Note 17, Fair Value Measurements, for more information on our investments held in the Integrys rabbi trust. \n•\nAn $86.9 million decrease in net income attributed to common shareholders at the Illinois segment, driven by higher operating expenses, primarily due to a $178.9 million pre-tax impairment associated with the ICC's disallowance of certain incurred capital costs in its November 2023 rate orders for PGL and NSG, and the year-over-year impact of a gain recorded in 2022 on the sale of certain real estate by PGL. Partially offsetting these increases in operating expenses were lower natural gas distribution and maintenance costs and a decrease in expenses related to charitable contributions. Higher margins, due to a positive impact from PGL's rate order, effective December 1, 2023, and continued capital investment in the SMP project in 2023 under PGL's former QIP rider, also partially offset the net increase in operating expenses. \n•\nA $10.4 million decrease in net income attributed to common shareholders at the electric transmission segment, driven by the positive impact in 2022 related to the D.C. Circuit Court of Appeals opinion issued in August 2022 addressing complaints related to ATC's ROE. For information on this D.C. Circuit Court of Appeals opinion, see Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – American Transmission Company Allowed Return on Equity Complaints in our 2023 Annual Report on Form 10-K.\nThese decreases in earnings were partially offset by:\n•\nA $92.9 million increase in net income attributed to common shareholders at the Wisconsin segment, driven by an increase in margins related to the impact of the Wisconsin rate orders approved by the PSCW, effective January 1, 2023, and a positive year-over-year impact from collections of fuel and purchased power costs. These positive impacts were partially offset by a decrease in margins due to lower sales volumes, and higher operating expenses, including increases in expenses related to transmission, depreciation and amortization, and regulatory amortizations.\n2024 Form 10-K\n53\nWEC Energy Group, Inc.\nTable of Contents\n•\nAn $11.6 million increase in net income attributed to common shareholders at the non-utility energy infrastructure segment, primarily due to an increase in PTCs driven by the acquisition of additional renewable generation facilities in the second half of 2022 and the first quarter of 2023, partially offset by higher interest expense.\n•\nAn $8.4 million increase in net income attributed to common shareholders at the other states segment, driven by higher margins due to an interim rate increase at MERC, effective January 1, 2023. See Note 26, Regulatory Environment, for more information. This positive impact was partially offset by a decrease in margins due to lower sales volumes and increases in depreciation and amortization and interest expense.\nNon-GAAP Financial Measures\nThe discussions below address the contribution of each of our utility segments to net income attributed to common shareholders. The discussions include financial information prepared in accordance with GAAP, as well as utility margin, which is not a measure of financial performance under GAAP. Utility margin (operating revenues less fuel and purchased power costs and cost of natural gas sold) is a non-GAAP financial measure because it excludes certain operation and maintenance expenses applicable to revenues, as well as depreciation and amortization and property and revenue taxes. \nWe believe that utility margin provides a useful basis for evaluating utility operations since the majority of prudently incurred fuel and purchased power costs, as well as prudently incurred natural gas costs, are passed through to customers in current rates. As a result, management uses utility margin internally when assessing the operating performance of our utility segments as these measures exclude the majority of revenue fluctuations caused by changes in these expenses. Similarly, the presentation of utility margin herein is intended to provide supplemental information for investors regarding our operating performance. \nOur utility margin may not be comparable to similar measures presented by other companies. Furthermore, this measure is not intended to replace gross margin as determined in accordance with GAAP as an indicator of operating performance. Each of our three utility segment discussions below include a table that provides the calculation of both gross margin as determined in accordance with GAAP and utility margin, as well as a reconciliation between the two measures.\nWisconsin Segment Contribution to Net Income Attributed to Common Shareholders\nThe Wisconsin segment's contribution to net income attributed to common shareholders for the year ended December 31, 2024 was $863.1 million, representing an $11.8 million, or 1.4%, increase over the prior year. The higher earnings were driven by an increase in margins due to the impact of the Wisconsin limited rate case re-openers approved by the PSCW, effective January 1, 2024, and a positive impact from collections of fuel and purchased power costs. These increases were partially offset by higher operating expenses, primarily driven by higher depreciation and amortization. See Note 26, Regulatory Environment, for more information on the limited rate case re-openers. \n2024 Form 10-K\n54\nWEC Energy Group, Inc.\nTable of Contents\nThe Wisconsin segment's contribution to net income attributed to common shareholders for the year ended December 31, 2023 was $851.3 million, representing a $92.9 million, or 12.2%, increase over the prior year. The higher earnings were driven by an increase in margins related to the impact of the Wisconsin rate orders approved by the PSCW, effective January 1, 2023, and a positive year-over-year impact from collections of fuel and purchased power costs. These positive impacts were partially offset by a decrease in margins due to lower sales volumes, and higher operating expenses, including increases in expenses related to transmission, depreciation and amortization, and regulatory amortizations.\nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nOperating revenues\n$\n6,330.5\n \n$\n6,625.9 \n$\n6,960.5 \n$\n(295.4)\n$\n(334.6)\nOperating expenses\nCost of sales \n(1)\n2,117.6\n \n2,510.6 \n3,208.8 \n393.0 \n698.2 \nOther operation and maintenance\n1,547.9\n \n1,531.3 \n1,351.3 \n(16.6)\n(180.0)\nDepreciation and amortization\n919.9\n \n851.5 \n754.7 \n(68.4)\n(96.8)\nProperty and revenue taxes\n169.6\n \n179.2 \n182.6 \n9.6 \n3.4 \nOperating income\n1,575.5\n \n1,553.3 \n1,463.1 \n22.2 \n90.2 \nOther income, net\n146.6\n \n137.6 \n99.9 \n9.0 \n37.7 \nInterest expense\n637.3\n \n601.0 \n555.9 \n(36.3)\n(45.1)\nIncome before income taxes\n1,084.8\n \n1,089.9 \n1,007.1 \n(5.1)\n82.8 \nIncome tax expense\n220.5\n \n237.4 \n247.5 \n16.9 \n10.1 \nPreferred stock dividends of subsidiary\n1.2\n \n1.2 \n1.2 \n— \n— \nNet income attributed to common shareholders\n$\n863.1\n \n$\n851.3 \n$\n758.4 \n$\n11.8 \n$\n92.9 \n(1)    \nCost of sales includes fuel and purchased power and cost of natural gas sold.\nThe following table shows a breakdown of other operation and maintenance:\nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nOperation and maintenance not included in line items below\n$\n659.6\n \n$\n635.1 \n$\n655.8 \n$\n(24.5)\n$\n20.7 \nTransmission \n(1)\n543.3\n \n540.4 \n430.9 \n(2.9)\n(109.5)\nRegulatory amortizations and other pass through expenses \n(2)\n215.9\n \n208.2 \n145.5 \n(7.7)\n(62.7)\nWe Power \n(3)\n131.4\n \n141.4 \n108.1 \n10.0 \n(33.3)\nEarnings sharing mechanisms \n(4)\n(4.3)\n5.6 \n(13.5)\n9.9 \n(19.1)\nOther\n2.0\n \n0.6 \n24.5 \n(1.4)\n23.9 \nTotal other operation and maintenance\n$\n1,547.9\n \n$\n1,531.3 \n$\n1,351.3 \n$\n(16.6)\n$\n(180.0)\n(1)    \nRepresents transmission expense that our electric utilities are authorized to collect in rates. The PSCW has approved escrow accounting for ATC and MISO network transmission expenses for WE and WPS. As a result, WE and WPS defer as a regulatory asset or liability, the difference between actual transmission costs and those included in rates until recovery or refund is authorized in a future rate proceeding. During 2024, 2023, and 2022, $565.3 million, $520.4 million, and $516.7 million, respectively, of costs were billed to our electric utilities by transmission providers. \nDuring 2022, WE and WPS amortized $81.0 million of the regulatory liabilities associated with their transmission escrows to offset certain 2022 revenue deficiencies, as approved by the PSCW in order to forego filing for 2022 base rate increases. This amortization drove the lower transmission expense during 2022. \n(2)    \nRegulatory amortizations and other pass through expenses are substantially offset in margins and therefore do not have a significant impact on net income. Effective January 1, 2023, the PSCW approved escrow accounting for pension and OPEB costs, as well as certain costs associated with our jointly-owned Columbia plant. As a result, our Wisconsin utilities defer as a regulatory asset or liability, the difference between these actual costs and those included in rates until recovery or refund is authorized in a future rate proceeding.\n2024 Form 10-K\n55\nWEC Energy Group, Inc.\nTable of Contents\n(3)    \nRepresents costs associated with the We Power generation units, including operating and maintenance costs recognized by WE. During 2024, 2023, and 2022, $115.8 million, $124.5 million, and $121.7 million, respectively, of costs were billed to or incurred by WE related to the We Power generation units, with the difference in costs billed or incurred and expenses recognized, either deferred or deducted from the regulatory asset. \n(4)    \nRepresents operation and maintenance associated with the earnings mechanisms we have in place. In 2024, earnings sharing was reduced by the impact of the deferral of amounts collected in rates related to Badger Hollow II prior to its in-service date, which was delayed, as approved by the PSCW in the Wisconsin limited rate case reopener effective January 1, 2024. Additionally, in 2022, earnings sharing was reduced by amortization related to certain regulatory liability balances associated with WPS's 2020 earnings sharing mechanism to offset certain 2022 revenue deficiencies, as approved by the PSCW in order to forego filing for 2022 base rate increases. See Note 26, Regulatory Environment, for more information.\nThe following tables provide information on delivered sales volumes by customer class and weather statistics:\nYear Ended December 31\nB (W)\nB (W)\nElectric Sales Volumes \n(MWh - in thousands)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nCustomer class\nResidential\n11,025.3\n \n10,966.8 \n11,372.6 \n58.5 \n(405.8)\nSmall commercial and industrial \n(1)\n12,815.8\n \n12,729.9 \n12,867.1 \n85.9 \n(137.2)\nLarge commercial and industrial \n(1)\n11,966.7\n \n11,992.8 \n12,181.6 \n(26.1)\n(188.8)\nOther\n125.1\n \n128.6 \n139.0 \n(3.5)\n(10.4)\nTotal retail \n(1)\n35,932.9\n \n35,818.1 \n36,560.3 \n114.8 \n(742.2)\nWholesale\n1,648.2\n \n1,821.8 \n2,444.7 \n(173.6)\n(622.9)\nResale\n5,863.1\n \n6,015.5 \n3,962.8 \n(152.4)\n2,052.7 \nTotal sales in MWh \n(1)\n43,444.2\n \n43,655.4 \n42,967.8 \n(211.2)\n687.6 \n(1)    \nIncludes distribution sales for customers who have purchased power from an alternative electric supplier in Michigan.\nYear Ended December 31\nB (W)\nB (W)\nNatural Gas Sales Volumes \n(Therms - in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nCustomer class\nResidential\n968.5\n \n1,014.8 \n1,189.6 \n(46.3)\n(174.8)\nCommercial and industrial\n625.2\n \n660.1 \n746.6 \n(34.9)\n(86.5)\nTotal retail\n1,593.7\n \n1,674.9 \n1,936.2 \n(81.2)\n(261.3)\nTransportation\n1,316.5\n \n1,321.6 \n1,438.1 \n(5.1)\n(116.5)\nTotal sales in therms\n2,910.2\n \n2,996.5 \n3,374.3 \n(86.3)\n(377.8)\nYear Ended December 31\nB (W)\nB (W)\nWeather \n(Degree Days)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nWE and WG \n(1)\nHeating (6,461 Normal)\n5,190\n \n5,409 \n6,369 \n(4.0)\n%\n(15.1)\n%\nCooling (790 Normal)\n831\n \n876 \n944 \n(5.1)\n%\n(7.2)\n%\nWPS \n(2)\nHeating (7,329 Normal)\n6,015\n \n6,544 \n7,387 \n(8.1)\n%\n(11.4)\n%\nCooling (554 Normal)\n608\n \n596 \n718 \n2.0 \n%\n(17.0)\n%\nUMERC \n(3)\nHeating (8,369 Normal)\n7,190\n \n7,539 \n8,643 \n(4.6)\n%\n(12.8)\n%\nCooling (345 Normal)\n317\n \n315 \n358 \n0.6 \n%\n(12.0)\n%\n(1)    \nNormal degree days are based on a 20-year moving average of monthly temperatures from Mitchell International Airport in Milwaukee, Wisconsin.\n(2)    \nNormal degree days are based on a 20-year moving average of monthly temperatures from the Green Bay, Wisconsin weather station.\n2024 Form 10-K\n56\nWEC Energy Group, Inc.\nTable of Contents\n(3)    \nNormal degree days are based on a 20-year moving average of monthly temperatures from the Iron Mountain, Michigan weather station. \nGross Margin GAAP and Utility Margin Non-GAAP\nThe following table summarizes our Wisconsin segment gross margin (GAAP) and reconciles gross margin (GAAP) to utility margin (non-GAAP). See \"Non-GAAP Financial Measures\" above for additional information regarding gross margin (GAAP) and utility margin (non-GAAP).\nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nElectric revenues\n$\n4,921.6\n \n$\n5,010.8 \n$\n4,971.8 \n$\n(89.2)\n$\n39.0 \nNatural gas revenues\n1,408.9\n \n1,615.1 \n1,988.7 \n(206.2)\n(373.6)\nOperating revenues\n6,330.5\n \n6,625.9 \n6,960.5 \n(295.4)\n(334.6)\nOperating expenses\nFuel and purchased power\n(1,455.7)\n(1,615.9)\n(1,881.4)\n160.2 \n265.5 \nCost of natural gas sold\n(661.9)\n(894.7)\n(1,327.4)\n232.8 \n432.7 \nOther operation and maintenance \n(1)\n(1,095.1)\n(1,133.8)\n(978.2)\n38.7 \n(155.6)\nDepreciation and amortization\n(919.9)\n(851.5)\n(754.7)\n(68.4)\n(96.8)\nProperty and revenue taxes\n(169.6)\n(179.2)\n(182.6)\n9.6 \n3.4 \nGross margin (GAAP)\n2,028.3\n \n1,950.8 \n1,836.2 \n77.5 \n114.6 \nOther operation and maintenance \n(1)\n1,095.1\n \n1,133.8 \n978.2 \n(38.7)\n155.6 \nDepreciation and amortization\n919.9\n \n851.5 \n754.7 \n68.4 \n96.8 \nProperty and revenue taxes\n169.6\n \n179.2 \n182.6 \n(9.6)\n(3.4)\nUtility margin (non-GAAP)\n$\n4,212.9\n \n$\n4,115.3 \n$\n3,751.7 \n$\n97.6 \n$\n363.6 \n(1)    \nOperating and maintenance expenses deemed to be directly attributable to our revenue-producing activities include plant operating and maintenance expenses related to our generating units; costs associated with the We Power generating units; and transmission, distribution and customer service expenses. These expenses are included in the above table to calculate gross margin as defined under GAAP. \n2024 Compared with 2023\nGross margin (GAAP) at the Wisconsin segment increased $77.5 million during 2024, compared to 2023 and utility margin (non-GAAP) increased $97.6 million during 2024, compared to 2023. Both measures were driven by:\n•\nA $48.7 million increase in margins related to the impact of the Wisconsin limited rate case re-openers approved by the PSCW, effective January 1, 2024. \n•\nA $38.5 million year-over-year positive impact from collections of fuel and purchased power costs. Under the Wisconsin fuel rules, the margins of our electric utilities are impacted by under- or over-collections of certain fuel and purchased power costs that are within a 2% price variance from the costs included in rates, and the remaining variance above or below the 2% is generally deferred for future recovery or refund to customers.\n•\nA $9.1 million increase in revenues primarily related to third-party use of our assets. \nThese increases in margins were partially offset by a $3.6 million decrease in margins related to lower retail sales volumes, driven by the impact of warmer winter weather during 2024, compared with 2023. As measured by heating degree days, 2024 was 4.0% and 8.1% warmer than 2023 in the Milwaukee area and Green Bay area, respectively.\nAdditionally, the smaller increase in gross margin (GAAP) as compared with the increase in utility margin (non-GAAP), was driven by the following items that are further described in Other Operating Expenses below:\n•\nA $68.4 million increase in depreciation and amortization; and\n2024 Form 10-K\n57\nWEC Energy Group, Inc.\nTable of Contents\n•\nA $10.5 million increase in electric and natural gas distribution expenses.\nThese increases were partially offset by:\n•\nA $34.9 million decrease in other operation and maintenance related to our power plants;\n•\nA $10.0 million decrease in other operation and maintenance expense related to the We Power leases;\n•\nA $10.0 million decrease in expense related to the settlement of certain items in our rate orders; and\n•\nA $9.6 million decrease in property and revenue taxes.\nOther Operating Expenses (includes other operation and maintenance, depreciation and amortization, and property and revenue taxes)\nOther operating expenses at the Wisconsin segment increased $75.4 million during 2024, compared with 2023. The significant factors impacting the increase in other operating expenses were:\n•\nA $68.4 million increase in depreciation and amortization expense, driven by assets being placed into service as we continue to execute on our capital plan.\n•\nA $24.9 million increase in benefit costs, primarily driven by higher stock-based compensation expense.\n•\nA $22.1 million decrease in pre-tax gains on the sales of land, primarily related to the land sale at the site of our former Pleasant Prairie power plant in 2023. See Note 3, Dispositions, for more information.\n•\nA $10.9 million increase in expenses associated with legal matters.\n•\nA $10.5 million increase in electric and natural gas distribution expenses, primarily driven by storm restoration and higher costs to maintain the distribution systems.\n•\nA $7.7 million increase in regulatory amortizations and other pass through expenses, as discussed in the notes under the other operation and maintenance table above.\nThese increases in other operating expenses were partially offset by:\n•\nA $34.9 million decrease in other operating and maintenance related to our power plants, driven by the resolution of certain items as a result of the December 2024 Wisconsin rate orders approved by the PSCW, as well as lower severance expense during 2024.\n•\nA $10.0 million decrease in other operation and maintenance expense related to the We Power leases, as discussed in the notes under the other operation and maintenance table above.\n•\nA $10.0 million decrease in expense, driven by the resolution of certain items as a result of the December 2024 Wisconsin rate order approved by the PSCW, as well as the October 2024 UMERC rate order approved by the MPSC.\n•\nA $9.9 million decrease in expense related to the earnings sharing mechanisms in place at our Wisconsin utilities, as discussed in the notes under the other operation and maintenance table above. See Note 26, Regulatory Environment, for more information.\n•\nA $9.6 million decrease in property and revenue taxes driven by a favorable adjustment related to a sales tax audit at WE.\nOther Income, Net\nOther income, net at the Wisconsin segment increased $9.0 million during 2024, compared with 2023, driven by higher interest income primarily due to interest earned on amounts due from ATC for the construction of transmission infrastructure upgrades needed for new generation projects. We are required to initially fund these expenditures, and ATC reimburses us when the new \n2024 Form 10-K\n58\nWEC Energy Group, Inc.\nTable of Contents\ngeneration is placed in service. See Note 21, Investment in Transmission Affiliates, for more information. Higher interest income on cash balances also contributed to the increase.\nInterest Expense\nInterest expense at the Wisconsin segment increased $36.3 million during 2024, compared with 2023. The increase was primarily due to the impact of WE issuing long-term debt in 2024. See Note 14, Long-Term Debt, for more information. Also contributing to the increase were higher average short-term debt balances and higher average short-term debt interest rates. \nIncome Tax Expense\nIncome tax expense at the Wisconsin segment decreased $16.9 million during 2024, compared with 2023. The decrease was primarily due to a $10.2 million increase in PTCs and lower pre-tax income. See Note 16, Income Taxes, for more information.\n2023 Compared with 2022\nGross margin (GAAP) at the Wisconsin segment increased $114.6 million during 2023, compared to 2022 and utility margin (non-GAAP) increased $363.6 million during 2023, compared to 2022. Both measures were driven by:\n•\nA $447.1 million increase in margins related to the impact of the Wisconsin rate orders approved by the PSCW, effective January 1, 2023. \n•\nA $61.6 million year-over-year positive impact from collections of fuel and purchased power costs. Under the Wisconsin fuel rules, the margins of our electric utilities are impacted by under- or over-collections of certain fuel and purchased power costs that are within a 2% price variance from the costs included in rates, and the remaining variance beyond the 2% price variance is generally deferred for future recovery or refund to customers. In 2022, WPS was unable to defer a portion of its under-collected fuel and purchased power costs due to earning an ROE in excess of the PSCW authorized amount.\n•\nA $15.7 million increase in margins during 2023, related to the expiration of a capacity purchase contract in connection with the acquisition of the Whitewater facility, effective January 1, 2023.\nThese increases in margins were partially offset by:\n•\nA $125.3 million decrease in margins related to lower retail sales volumes, driven by the impact of unfavorable weather during 2023, compared with 2022. As measured by cooling degree days, 2023 was 7.2% and 17.0% cooler than 2022 in the Milwaukee area and Green Bay area, respectively. As measured by heating degree days, 2023 was 15.1% and 11.4% warmer than 2022 in the Milwaukee area and Green Bay area, respectively.\n•\nA $25.1 million decrease in other revenues, primarily related to a FERC order in January 2023 that eliminated reactive power compensation MISO was required to pay to generators, including our electric utilities, as well as lower revenues from third-party use of our assets. The decrease in reactive power revenues is substantially offset by a decrease in transmission expense related to a deferral of these revenues as a component of our transmission escrow, as approved by the PSCW in June 2023 and discussed below.\n•\nLower margins of $8.0 million driven by the expiration of a wholesale contract in May 2022.\nAdditionally, the smaller increase in gross margin (GAAP) as compared to the increase in utility margin (non-GAAP), was driven by the following items that are further described in Other Operating Expenses below:\n•\nA $109.5 million increase in transmission expense;\n•\nA $96.8 million increase in depreciation and amortization;\n•\nA $33.3 million increase in other operation and maintenance expense related to the We Power leases; and\n2024 Form 10-K\n59\nWEC Energy Group, Inc.\nTable of Contents\n•\nA $29.4 million increase in other operation and maintenance related to our power plants; partially offset by\n•\nA $15.6 million decrease in electric and natural gas distribution expenses.\nOther Operating Expenses (includes other operation and maintenance, depreciation and amortization, and property and revenue taxes)\nOther operating expenses at the Wisconsin segment increased $273.4 million during 2023, compared with 2022. The significant factors impacting the increase in other operating expenses were:\n•\nA $109.5 million increase in transmission expense as approved in the PSCW's 2023 rate orders, effective January 1, 2023. See the notes under the other operation and maintenance table above for more information. This amount is net of a deferral of $11.9 million approved by the PSCW in June 2023, retroactive to December 1, 2022, in response to a FERC order eliminating reactive power compensation to our utilities, as discussed above.\n•\nA $96.8 million increase in depreciation and amortization, driven by assets being placed into service as we continue to execute on our capital plan.\n•\nA $62.7 million increase in regulatory amortizations and other pass through expenses, as discussed in the notes under the other operation and maintenance table above.\n•\nA $33.3 million increase in other operation and maintenance expense related to the We Power leases, as discussed in the notes under the other operation and maintenance table above.\n•\nA $29.4 million increase in other operating and maintenance related to our power plants, driven by increases to certain plant-related regulatory assets in 2022 as a result of the December 2022 Wisconsin rate orders as well as operating costs associated with Whitewater, which we purchased in January 2023. These increases were partially offset by lower severance expense during 2023. \n•\nA $19.1 million increase in expense related to the earnings sharing mechanisms in place at our Wisconsin utilities, as discussed in the notes under the other operation and maintenance table above. \nThese increases in other operating expenses were partially offset by:\n•\nA $23.9 million decrease in expense primarily related to lower commitments made in 2023 to fund our charitable foundations.\n•\nA $19.1 million increase in pre-tax gains on the sale of land, primarily at the site of our former Pleasant Prairie power plant during 2023.\n•\nA $15.6 million decrease in electric and natural gas distribution expenses, driven by lower costs to maintain the distribution system and for storm restoration during 2023, compared with 2022.\n•\nA $7.0 million decrease in expenses associated with the settlement of legal claims.\nOther Income, Net\nOther income, net at the Wisconsin segment increased $37.7 million during 2023, compared with 2022, driven by higher AFUDC-Equity due to continued capital investment. See Note 27, Other Income, Net, for more information.\nInterest Expense\nInterest expense at the Wisconsin segment increased $45.1 million during 2023, compared with 2022. The increase was primarily due to the impact of WE and WPS issuing long-term debt during the third and fourth quarters of 2022, respectively, and higher average short-term debt balances and increased short-term debt interest rates. Also contributing to the increase was the 2022 deferral of $8.2 million of interest expense related to capital investments made by WG since its 2020 rate case, as approved by the PSCW in an order that allowed our Wisconsin utilities to offset certain 2022 revenue deficiencies in order to forego filing for 2022 base rate increases. This deferred interest expense was amortized over a two-year period. During 2023, WG amortized $4.1 million \n2024 Form 10-K\n60\nWEC Energy Group, Inc.\nTable of Contents\nof interest expense. See Note 26, Regulatory Environment, for more information. These increases were partially offset by higher AFUDC-Debt due to continued capital investment and lower interest expense on finance lease liabilities, primarily related to the We Power leases, as finance lease liabilities decrease each year as payments are made.\nIncome Tax Expense\nIncome tax expense at the Wisconsin segment decreased $10.1 million during 2023, compared with 2022. The decrease was primarily due to a $23.1 million increase in PTCs and a $6.3 million increase in income tax benefits associated with AFUDC-Equity, both driven by continued capital investment. These decreases in income tax expense were partially offset by higher pre-tax income. \nIllinois Segment Contribution to Net Income Attributed to Common Shareholders\nThe Illinois segment's contribution to net income attributed to common shareholders for the year ended December 31, 2024 was $252.1 million, representing a $112.1 million, or 80.1%, increase from the prior year. The increase was primarily due to a $178.9 million impairment recorded in 2023 associated with the ICC's disallowance of certain incurred capital costs in its November 2023 rate orders for PGL and NSG. An increase in margins related to the impacts of the November 2023 rate orders, effective December 1, 2023 for PGL, and February 1, 2024 for NSG, also contributed to the higher net income. SMP costs that were previously being recovered under PGL's QIP rider are now included in PGL's base rates. Partially offsetting these increases were higher property and revenue taxes, depreciation and amortization, and natural gas distribution and maintenance costs, along with a $25.3 million pre-tax charge to income related to the ICC's disallowance of certain capital costs in PGL's 2016 rider QIP reconciliation. See Note 26, Regulatory Environment, for more information on the PGL and NSG rate orders and the ICC's disallowance.\nThe Illinois segment's contribution to net income attributed to common shareholders for the year ended December 31, 2023 was $140.0 million, representing an $86.9 million, or 38.3%, decrease from the prior year. The decrease was driven by higher operating expenses, primarily due to a $178.9 million pre-tax impairment associated with the ICC's disallowance of certain incurred capital costs in its November 2023 rate orders for PGL and NSG, and the year-over-year impact of a gain recorded in 2022 on the sale of certain real estate by PGL. Partially offsetting these increases in operating expenses were lower natural gas distribution and maintenance costs and a decrease in expenses related to charitable contributions. Higher margins, due to a positive impact from PGL's rate order, effective December 1, 2023, and continued capital investment in the SMP project in 2023 under PGL's former QIP rider, also partially offset the net increase in operating expenses. \nSince the majority of PGL and NSG customers use natural gas for heating, net income attributed to common shareholders at the Illinois segment is sensitive to weather and is generally higher during the winter months.\nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nOperating revenues\n$\n1,602.4\n \n$\n1,557.8 \n$\n1,890.9 \n$\n44.6 \n$\n(333.1)\nOperating expenses\nCost of natural gas sold\n376.7\n \n443.0 \n792.5 \n66.3 \n349.5 \nOther operation and maintenance\n461.5\n \n397.9 \n459.2 \n(63.6)\n61.3 \nImpairment related to ICC disallowances\n12.1\n \n178.9 \n— \n166.8 \n(178.9)\nDepreciation and amortization\n255.4\n \n237.3 \n230.9 \n(18.1)\n(6.4)\nProperty and revenue taxes\n59.9\n \n29.9 \n38.6 \n(30.0)\n8.7 \nOperating income\n436.8\n \n270.8 \n369.7 \n166.0 \n(98.9)\nOther income, net\n7.6\n \n6.7 \n14.1 \n0.9 \n(7.4)\nInterest expense\n94.7\n \n88.9 \n73.8 \n(5.8)\n(15.1)\nIncome before income taxes\n349.7\n \n188.6 \n310.0 \n161.1 \n(121.4)\nIncome tax expense\n97.6\n \n48.6 \n83.1 \n(49.0)\n34.5 \nNet income attributed to common shareholders\n$\n252.1\n \n$\n140.0 \n$\n226.9 \n$\n112.1 \n$\n(86.9)\n2024 Form 10-K\n61\nWEC Energy Group, Inc.\nTable of Contents\nThe following table shows a breakdown of other operation and maintenance: \nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nOperation and maintenance not included in the line items below\n$\n318.5\n \n$\n303.4 \n$\n319.4 \n$\n(15.1)\n$\n16.0 \nRiders \n(1)\n139.7\n \n94.3 \n127.2 \n(45.4)\n32.9 \nRegulatory amortizations \n(1)\n2.3\n \n0.2 \n(2.4)\n(2.1)\n(2.6)\nOther\n1.0\n \n— \n15.0 \n(1.0)\n15.0 \nTotal other operation and maintenance\n$\n461.5\n \n$\n397.9 \n$\n459.2 \n$\n(63.6)\n$\n61.3 \n(1)    \nThese riders and regulatory amortizations are substantially offset in margins and therefore do not have a significant impact on net income.\nThe following tables provide information on delivered sales volumes by customer class and weather statistics:\nYear Ended December 31\nB (W)\nB (W)\nNatural Gas Sales Volumes \n(Therms - in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nCustomer Class\nResidential\n745.4\n \n778.1 \n907.0 \n(32.7)\n(128.9)\nCommercial and industrial\n287.7\n \n305.2 \n353.7 \n(17.5)\n(48.5)\nTotal retail\n1,033.1\n \n1,083.3 \n1,260.7 \n(50.2)\n(177.4)\nTransportation\n707.8\n \n740.4 \n839.5 \n(32.6)\n(99.1)\nTotal sales in therms\n1,740.9\n \n1,823.7 \n2,100.2 \n(82.8)\n(276.5)\nYear Ended December 31\nB (W)\nB (W)\nWeather \n(Degree Days)\n \n(1)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nHeating (5,944 Normal)\n4,848\n \n5,097 \n6,140 \n(4.9)\n%\n(17.0)\n%\n(1)    \nNormal heating degree days are based on a 12-year moving average of monthly temperatures from Chicago's O'Hare Airport.\n2024 Form 10-K\n62\nWEC Energy Group, Inc.\nTable of Contents\nGross Margin GAAP and Utility Margin Non-GAAP\nThe following table summarizes our Illinois segment gross margin (GAAP) and reconciles gross margin (GAAP) to utility margin (non-GAAP). See \"Non-GAAP Financial Measures\" above for additional information regarding gross margin (GAAP) and utility margin (non-GAAP).\nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nOperating revenues\n$\n1,602.4\n \n$\n1,557.8 \n$\n1,890.9 \n$\n44.6 \n$\n(333.1)\nOperating expenses\nCost of natural gas sold\n(376.7)\n(443.0)\n(792.5)\n66.3 \n349.5 \nOther operation and maintenance \n(1)\n(227.2)\n(206.2)\n(255.8)\n(21.0)\n49.6 \nDepreciation and amortization\n(255.4)\n(237.3)\n(230.9)\n(18.1)\n(6.4)\nProperty and revenue taxes\n(59.9)\n(29.9)\n(38.6)\n(30.0)\n8.7 \nGross margin (GAAP)\n683.2\n \n641.4 \n573.1 \n41.8 \n68.3 \nOther operation and maintenance \n(1)\n227.2\n \n206.2 \n255.8 \n21.0 \n(49.6)\nDepreciation and amortization\n255.4\n \n237.3 \n230.9 \n18.1 \n6.4 \nProperty and revenue taxes\n59.9\n \n29.9 \n38.6 \n30.0 \n(8.7)\nUtility margin (non-GAAP)\n$\n1,225.7\n \n$\n1,114.8 \n$\n1,098.4 \n$\n110.9 \n$\n16.4 \n(1)    \nOperating and maintenance expenses deemed to be directly attributable to our revenue-producing activities include distribution and customer service expenses. These expenses are included in the above table to calculate gross margin as defined under GAAP. \n2024 Compared with 2023\nGross margin (GAAP) at the Illinois segment increased $41.8 million during 2024, compared with 2023, and utility margin (non-GAAP) increased $110.9 million during 2024, compared with 2023. Both measures were driven by:\n•\nAn $84.0 million increase in margins related to the impacts of the PGL and NSG rate orders issued by the ICC, effective December 1, 2023 and February 1, 2024, respectively. PGL’s rate order includes the recovery of costs related to PGL’s SMP in base rates. Previously, these costs were being recovered under its QIP rider. See Note 26, Regulatory Environment, for more information on the rate orders.\n•\nA $45.4 million increase in revenues associated with certain riders that are offset in other operation and maintenance and therefore do not have a significant impact on net income. \nThese increases in gross margin (GAAP) and utility margin (non-GAAP) were partially offset by a $12.9 million decrease in revenues driven by an ICC order received in August 2024 related to PGL's 2016 Rider QIP reconciliation prudency review, which requires refunds to ratepayers for amounts previously collected related to the disallowance of certain capital costs. See Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – Regulatory Recovery and Note 26, Regulatory Environment, for more information on the ICC disallowance.\nAdditionally, the smaller increase in gross margin (GAAP) as compared with the increase in utility margin (non-GAAP), was driven by the following items that are further described in Other Operating Expenses below:\n•\nA $30.0 million increase in property and revenue taxes; \n•\nAn $18.1 million increase in depreciation and amortization;\n•\nA $14.6 million increase in natural gas distribution and maintenance costs; and\n•\nA $7.3 million increase in customer service expense.\n2024 Form 10-K\n63\nWEC Energy Group, Inc.\nTable of Contents\nOther Operating Expenses (includes other operation and maintenance, impairment related to ICC disallowances, depreciation and amortization, and property and revenue taxes)\nOther operating expenses at the Illinois segment decreased $100.5 million, net of the $45.4 million impact of the riders referenced in the table above, during 2024, compared with 2023. The significant factors impacting the decrease in other operating expenses were:\n•\nA $178.9 million impairment associated with the ICC orders received in November 2023 related to PGL's and NSG's rate reviews, which included the disallowance of previously incurred capital costs at PGL and NSG, in the amount of $177.2 million and $1.7 million, respectively. See Note 26, Regulatory Environment, for more information on the ICC disallowances.\n•\nAn $11.1 million decrease in expense driven by an ICC order received in May 2023 related to an annual prudency review of PGL's and NSG's UEA riders, which required refunds to ratepayers starting in September 2023. See Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – Regulatory Recovery and Note 26, Regulatory Environment, for more information.\nThese decreases in operating expenses were partially offset by:\n•\nA $30.0 million increase in property and revenue taxes, driven by an increase in the invested capital tax. This increase was related to an increase in regulatory amortizations as approved in the PGL and NSG rate orders issued by the ICC, effective December 1, 2023 and February 1, 2024, respectively.\n•\nAn $18.1 million increase in depreciation and amortization, driven by assets being placed into service as we continue to execute on our capital plan.\n•\nA $14.6 million increase in natural gas distribution and maintenance costs, primarily related to maintaining the natural gas infrastructure during 2024, compared with 2023.\n•\nA $12.1 million impairment driven by an ICC order received in August 2024 related to the 2016 annual prudency review of PGL's 2016 Rider QIP, which included a disallowance of certain capital costs. See Note 26, Regulatory Environment, for more information on the ICC disallowances.\n•\nA $7.3 million increase in customer service expense due to higher call center expense and metering costs.\nInterest Expense\nInterest expense at the Illinois segment increased $5.8 million during 2024, compared with 2023, driven by the impact of PGL and NSG issuing long-term debt in November 2023.\nIncome Tax Expense\nIncome tax expense at the Illinois segment increased $49.0 million during 2024, compared with 2023, driven by an increase in pre-tax income.\n2023 Compared with 2022\nGross margin (GAAP) at the Illinois segment increased $68.3 million during 2023, compared with 2022, and utility margin (non-GAAP) increased $16.4 million during 2023, compared with 2022. Both measures were driven by:\n•\nA $29.5 million increase in margins related to the impact of the PGL rate order issued by the ICC, effective December 1, 2023. \n•\nA $23.9 million increase in revenues at PGL due to continued capital investment in the SMP project under the QIP rider. PGL recovered the costs related to the SMP through a surcharge on customer bills pursuant to the QIP rider, which was in effect for most of 2023.\nThese increases in margins were partially offset by a $32.9 million decrease in margins associated with certain riders that are offset in other operation and maintenance and therefore do not have a significant impact on net income. \n2024 Form 10-K\n64\nWEC Energy Group, Inc.\nTable of Contents\nFor information on the QIP rider and PGL's recovery of SMP costs after 2023, as well as the pause in spending on the SMP, see Note 26, Regulatory Environment.\nAdditionally, the larger increase in gross margin (GAAP) as compared to the increase in utility margin (non-GAAP), was driven by the following items:\n•\nA $43.8 million decrease in natural gas distribution and maintenance costs;\n•\nAn $8.7 million decrease in property and revenue taxes; and\n•\nA $3.7 million decrease in customer service expense, partially offset by \n•\nA $6.4 million increase in depreciation and amortization.\nOther Operating Expenses (includes other operation and maintenance, impairment related to ICC disallowances, depreciation and amortization, and property and revenue taxes)\nOther operating expenses at the Illinois segment increased $148.2 million, net of the $32.9 million impact of the riders referenced in the table above, during 2023, compared with 2022. The significant factors impacting the increase in other operating expenses were:\n•\nA $178.9 million impairment associated with the ICC orders received in November 2023 related to PGL's and NSG's rate reviews, which included the disallowance of previously incurred capital costs at PGL and NSG, in the amount of $177.2 million and $1.7 million, respectively. \n•\nA $54.5 million pre-tax gain on the sale of certain real estate in Chicago during 2022. See Note 3, Dispositions, for more information.\n•\nAn $11.1 million increase in expense driven by an ICC order received in May 2023 related to an annual prudency review of PGL's and NSG's UEA riders, which required refunds to ratepayers starting in September 2023. \nThese increases in operating expenses were partially offset by:\n•\nA $43.8 million decrease in natural gas distribution and maintenance costs, primarily related to maintaining the natural gas infrastructure during 2023, compared with 2022.\n•\nA $25.0 million decrease in expenses related to contributions to charitable projects supporting our customers and the communities within our service territories during 2023, compared with 2022.\n•\nA $9.4 million decrease in expenses associated with the settlement of legal claims during 2022.\n•\nAn $8.7 million decrease in property and revenue taxes, primarily driven by lower property and use taxes.\n•\nA $3.7 million decrease in customer service expense due to lower call center expense and metering costs.\n•\nA $3.0 million decrease in benefit costs, primarily due to lower stock-based compensation expense related to plan performance during 2023.\nOther Income, Net\nOther income, net at the Illinois segment decreased $7.4 million during 2023, compared with 2022, driven by lower net credits from the non-service components of our net periodic pension and OPEB costs. See Note 20, Employee Benefits, for more information on our benefit costs.\n2024 Form 10-K\n65\nWEC Energy Group, Inc.\nTable of Contents\nInterest Expense\nInterest expense at the Illinois segment increased $15.1 million during 2023, compared with 2022, driven by higher long-term debt balances related to incremental borrowings in both 2023 and 2022, primarily related to additional capital investment. Also contributing to the increase was higher short-term debt interest rates.\nIncome Tax Expense\nIncome tax expense at the Illinois segment decreased $34.5 million during 2023, compared with 2022, driven by a decrease in pre-tax income.\nOther States Segment Contribution to Net Income Attributed to Common Shareholders\nThe other states segment's contribution to net income attributed to common shareholders for the year ended December 31, 2024 was $54.5 million, representing a $6.4 million, or 13.3%, increase over the prior year. The increase was driven by higher margins due to MGU's rate increase approved by the MPSC that was effective January 1, 2024 and MERC's final rate increase approved by the MPUC in November 2023. See Note 26, Regulatory Environment, for more information.\nThe other states segment's contribution to net income attributed to common shareholders for the year ended December 31, 2023 was $48.1 million, representing an $8.4 million, or 21.2%, increase over the prior year. The increase was driven by higher margins due to an interim rate increase at MERC, effective January 1, 2023. This positive impact was partially offset by a decrease in margins due to lower sales volumes and increases in depreciation and amortization and interest expense.\nSince the majority of MERC and MGU customers use natural gas for heating, net income attributed to common shareholders is sensitive to weather and is generally higher during the winter months.\nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nOperating revenues\n$\n449.8\n \n$\n519.1 \n$\n618.5 \n$\n(69.3)\n$\n(99.4)\nOperating expenses\nCost of natural gas sold\n198.6\n \n277.2 \n391.6 \n78.6 \n114.4 \nOther operation and maintenance\n93.9\n \n94.5 \n98.5 \n0.6 \n4.0 \nDepreciation and amortization\n47.0\n \n43.3 \n40.9 \n(3.7)\n(2.4)\nProperty and revenue taxes\n21.0\n \n24.4 \n23.3 \n3.4 \n(1.1)\nOperating income\n89.3\n \n79.7 \n64.2 \n9.6 \n15.5 \nOther income, net\n0.3\n \n0.6 \n2.5 \n(0.3)\n(1.9)\nInterest expense\n16.4\n \n15.9 \n13.9 \n(0.5)\n(2.0)\nIncome before income taxes\n73.2\n \n64.4 \n52.8 \n8.8 \n11.6 \nIncome tax expense\n18.7\n \n16.3 \n13.1 \n(2.4)\n(3.2)\nNet income attributed to common shareholders\n$\n54.5\n \n$\n48.1 \n$\n39.7 \n$\n6.4 \n$\n8.4 \nThe following table shows a breakdown of other operation and maintenance: \nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nOperation and maintenance not included in line item below\n$\n76.8\n \n$\n72.6 \n$\n77.8 \n$\n(4.2)\n$\n5.2 \nRegulatory amortizations and other pass through expenses \n(1)\n17.1\n \n21.9 \n20.7 \n4.8 \n(1.2)\nTotal other operation and maintenance\n$\n93.9\n \n$\n94.5 \n$\n98.5 \n$\n0.6 \n$\n4.0 \n(1)    \nRegulatory amortizations and other pass through expenses are substantially offset in margins and therefore do not have a significant impact on net income.\n2024 Form 10-K\n66\nWEC Energy Group, Inc.\nTable of Contents\nThe following tables provide information on delivered sales volumes by customer class and weather statistics:\nYear Ended December 31\nB (W)\nB (W)\nNatural Gas Sales Volumes (\nTherms - in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nCustomer Class\nResidential\n285.2\n \n293.8 \n353.1 \n(8.6)\n(59.3)\nCommercial and industrial\n179.9\n \n196.5 \n227.6 \n(16.6)\n(31.1)\nTotal retail\n465.1\n \n490.3 \n580.7 \n(25.2)\n(90.4)\nTransportation\n828.5\n \n799.6 \n794.8 \n28.9 \n4.8 \nTotal sales in therms\n1,293.6\n \n1,289.9 \n1,375.5 \n3.7 \n(85.6)\nYear Ended December 31\nB (W)\nB (W)\nWeather\n (Degree Days)\n \n(1)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nMERC\nHeating (7,993 Normal)\n6,792\n \n7,324 \n8,585 \n(7.3)\n%\n(14.7)\n%\nMGU\nHeating (6,208 Normal)\n5,083\n \n5,456 \n6,277 \n(6.8)\n%\n(13.1)\n%\n(1)    \nNormal heating degree days for MERC and MGU are based on a 20-year moving average and 15-year moving average, respectively, of monthly temperatures from various weather stations throughout their respective territories.\nGross Margin GAAP and Utility Margin Non-GAAP\nThe following table summarizes our other states segment gross margin (GAAP) and reconciles gross margin (GAAP) to utility margin (non-GAAP). See \"Non-GAAP Financial Measures\" above for additional information regarding gross margin (GAAP) and utility margin (non-GAAP).\nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nOperating revenues\n$\n449.8\n \n$\n519.1 \n$\n618.5 \n$\n(69.3)\n$\n(99.4)\nOperating expenses\nCost of natural gas sold\n(198.6)\n(277.2)\n(391.6)\n78.6 \n114.4 \nOther operation and maintenance \n(1)\n(55.4)\n(54.2)\n(55.9)\n(1.2)\n1.7 \nDepreciation and amortization\n(47.0)\n(43.3)\n(40.9)\n(3.7)\n(2.4)\nProperty and revenue taxes\n(21.0)\n(24.4)\n(23.3)\n3.4 \n(1.1)\nGross margin (GAAP)\n127.8\n \n120.0 \n106.8 \n7.8 \n13.2 \nOther operation and maintenance \n(1)\n55.4\n \n54.2 \n55.9 \n1.2 \n(1.7)\nDepreciation and amortization\n47.0\n \n43.3 \n40.9 \n3.7 \n2.4 \nProperty and revenue taxes\n21.0\n \n24.4 \n23.3 \n(3.4)\n1.1 \nUtility margin (non-GAAP)\n$\n251.2\n \n$\n241.9 \n$\n226.9 \n$\n9.3 \n$\n15.0 \n(1)    \nOperating and maintenance expenses deemed to be directly attributable to our revenue-producing activities include distribution and customer service expenses. These expenses are included in the above table to calculate gross margin as defined under GAAP.\n2024 Form 10-K\n67\nWEC Energy Group, Inc.\nTable of Contents\n2024 Compared with 2023\nGross margin (GAAP) increased $7.8 million during 2024, compared to 2023, and utility margin (non-GAAP) increased $9.3 million during 2024, compared to 2023. Both measures were driven by:\n•\nA $9.6 million increase related to MGU's rate increase approved by the MPSC that was effective January 1, 2024.\n•\nA $2.0 million increase related to MERC's final rate increase approved by the MPUC in November 2023.\n•\nA $1.6 million increase related to higher sales volumes, driven by higher transportation sales.\nThese increases were partially offset by:\n•\nA $2.3 million decrease related to MGU's energy optimization program, which provides rebates, incentives, and energy efficiency education to customers.\n•\nA $1.4 million decrease related to MERC CIP revenue, which was offset in operation and maintenance expense. Rebates and programs are available to residential and commercial customers of MERC through the CIP, which is funded by rate payers using the Conservation Cost Recovery Charge and the Conservation Cost Recovery Adjustment funds that are collected on their monthly billing statements.\nAdditionally, the lower increase in gross margin (GAAP) as compared to the increase in utility margin (non-GAAP), was driven by the following items that are further described in Other Operating Expenses below:\n•\nA $3.7 million increase in depreciation and amortization; and\n•\nA $1.2 million increase in natural gas operations and customer service expense; partially offset by\n•\nA $3.4 million decrease in property and revenue taxes.\nOther Operating Expenses (includes other operation and maintenance, depreciation and amortization, and property and revenue taxes)\nOther operating expenses at the other states segment decreased $0.3 million during 2024, compared with 2023. The significant factors impacting the decrease in operating expenses were:\n•\nA $4.2 million decrease in bad debt expense, driven by improvements in MERC's and MGU's loss rates and lower past due account receivable balances due to warmer than normal weather conditions during most of 2024 and low average natural gas prices.\n•\nA $3.4 million decrease in property and revenue taxes, driven by the resolution of a use tax audit at MGU.\n•\nA $1.4 million decrease in operation and maintenance expense related to MERC's CIP program, which has an offsetting decrease in margins.\nThese decreases in other operating expenses were partially offset by:\n•\nA $3.7 million increase in depreciation and amortization related to continued capital investment. \n•\nA $2.8 million increase in benefit costs, driven by higher costs related to stock-based compensation and deferred compensation.\n•\nA $1.2 million increase in natural gas operations and customer service expense, driven by the timing of various operation and maintenance projects approved in MERC's and MGU's most recent rate orders.\n2024 Form 10-K\n68\nWEC Energy Group, Inc.\nTable of Contents\nInterest Expense\nInterest expense at the other states segment increased $0.5 million during 2024, compared with 2023, due to higher average short-term debt balances and higher average short-term debt interest rates. Also contributing to the increase was the impact of MGU issuing long-term debt in October 2024.\nIncome Tax Expense\nIncome tax expense at the other states segment increased $2.4 million during 2024, compared with 2023, driven by an increase in pre-tax income.\n2023 Compared with 2022\nGross margin (GAAP) increased $13.2 million during 2023, compared to 2022, and utility margin (non-GAAP) increased $15.0 million during 2023, compared to 2022. Both measures were driven by a $19.5 million positive impact related to an interim rate increase at MERC that was effective January 1, 2023. See Note 26, Regulatory Environment, for more information. This increase was partially offset by a $6.1 million decrease related to lower sales volumes, primarily driven by warmer weather. As measured by heating degree days, 2023 was 14.7% and 13.1% warmer than 2022 at MERC and MGU, respectively.\nAdditionally, the smaller increase in gross margin (GAAP) as compared to the increase in utility margin (non-GAAP), was driven by the following items that are further described in \"Other Operating Expenses\" below:\n•\nA $2.4 million increase in depreciation and amortization; partially offset by\n•\nA $1.8 million decrease in natural gas operations and customer service expense.\nOther Operating Expenses (includes other operation and maintenance, depreciation and amortization, and property and revenue taxes)\nOther operating expenses at the other states segment decreased $0.5 million during 2023, compared with 2022. The significant factors impacting the decrease in operating expenses were:\n•\nA $1.8 million decrease in natural gas operations and customer service expense, driven by fewer operation and maintenance projects at MGU during 2023. \n•\nA $1.6 million decrease in benefit costs, primarily due to lower stock-based compensation expense related to plan performance. \nThese decreases in other operating expenses were partially offset by a $2.4 million increase in depreciation and amortization related to continued capital investment. \nOther Income, Net\nOther income, net at the other states segment decreased $1.9 million during 2023, compared with 2022, driven by lower net credits from the non-service components of our net periodic pension and OPEB costs. See Note 20, Employee Benefits, for more information on our benefit costs.\nInterest Expense\nInterest expense at the other states segment increased $2.0 million during 2023, compared with 2022, primarily due to higher short-term debt interest rates.\nIncome Tax Expense\nIncome tax expense at the other states segment increased $3.2 million during 2023, compared with 2022, primarily driven by an increase in pre-tax income.\n2024 Form 10-K\n69\nWEC Energy Group, Inc.\nTable of Contents\nElectric Transmission Segment Contribution to Net Income Attributed to Common Shareholders\nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nEquity in earnings of transmission affiliates\n$\n207.5\n \n$\n177.5 \n$\n194.7 \n$\n30.0 \n$\n(17.2)\nInterest expense\n19.4\n \n19.4 \n19.4 \n— \n— \nIncome before income taxes\n188.1\n \n158.1 \n175.3 \n30.0 \n(17.2)\nIncome tax expense\n47.1\n \n39.0 \n45.8 \n(8.1)\n6.8 \nNet income attributed to common shareholders\n$\n141.0\n \n$\n119.1 \n$\n129.5 \n$\n21.9 \n$\n(10.4)\n2024 Compared with 2023\nEquity in Earnings of Transmission Affiliates\nEquity in earnings of transmission affiliates increased $30.0 million during 2024, compared with 2023. This increase was primarily driven by a $20.1 million increase in equity earnings due to the impact of a FERC order issued in October 2024 addressing complaints related to ATC's ROE. For information on this FERC order, see Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – American Transmission Company Allowed Return on Equity Complaints. Continued capital investment by ATC also contributed to the year-over-year increase in equity earnings.\nIncome Tax Expense\nIncome tax expense at the electric transmission segment increased $8.1 million during 2024, compared with 2023, driven by an increase in pre-tax income.\n2023 Compared with 2022\nEquity in Earnings of Transmission Affiliates\nEquity in earnings of transmission affiliates decreased $17.2 million during 2023, compared with 2022. This decrease was primarily driven by the $20.5 million positive impact recorded in 2022 related to the D.C. Circuit Court of Appeals opinion issued in August 2022 addressing complaints related to ATC's ROE. For information on this D.C. Circuit Court of Appeals opinion, see Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – American Transmission Company Allowed Return on Equity Complaints in our 2023 Annual Report on Form 10-K. Partially offsetting this negative year-over-year impact was continued capital investment by ATC.\nIncome Tax Expense\nIncome tax expense at the electric transmission segment decreased $6.8 million during 2023, compared with 2022, driven by a decrease in pre-tax income.\n2024 Form 10-K\n70\nWEC Energy Group, Inc.\nTable of Contents\nNon-Utility Energy Infrastructure Segment Contribution to Net Income Attributed to Common Shareholders\nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nOperating income\n$\n393.0\n \n$\n360.7 \n$\n372.8 \n$\n32.3 \n$\n(12.1)\nOther income, net\n1.0\n \n— \n— \n1.0 \n— \nInterest expense\n99.7\n \n94.3 \n68.9 \n(5.4)\n(25.4)\nIncome before income taxes\n294.3\n \n266.4 \n303.9 \n27.9 \n(37.5)\nIncome tax benefit\n(82.4)\n(68.4)\n(20.9)\n14.0 \n47.5 \nNet (income) loss attributed to noncontrolling interests\n4.1\n \n1.2 \n(0.4)\n2.9 \n1.6 \nNet income attributed to common shareholders\n$\n380.8\n \n$\n336.0 \n$\n324.4 \n$\n44.8 \n$\n11.6 \n2024 Compared with 2023\nOperating Income\nOperating income at the non-utility energy infrastructure segment increased $32.3 million during 2024, compared with 2023, driven by these items at WECI:\n•\nA $48.4 million positive impact in 2024 related to the receipt of performance payments.\n•\nA $3.9 million increase in PPA revenue resulting from increased generation driven by higher wind speeds and lower energy curtailments.\nThese increases in operating income were partially offset by:\n•\nA $12.3 million negative impact due to transmission congestion that reduced energy market prices.\n•\nA $7.1 million increase in operation and maintenance expenses due primarily to equipment failures at several of our renewable generation facilities.\n•\nThe recognition of $6.4 million in revenue related to Blooming Grove in 2023 for a capacity payment received from PJM Interconnection that was associated with a December 2022 cold weather event. The capacity payment was subject to a FERC complaint, so we recognized this as revenue in 2023 when FERC issued an order denying that complaint.\n•\nA $3.1 million decrease due to lower amounts recognized for REC sales in 2024 at Blooming Grove driven by lower contracted REC prices overall, as well as timing of REC contract execution.\nIn addition to the above items at WECI, there was an $11.7 million positive impact from We Power due to continued capital investment.\nInterest Expense\nInterest expense at the non-utility energy infrastructure segment increased $5.4 million during 2024, compared with 2023, driven by an $8.6 million increase in interest expense due to WECI’s issuance of a $430.0 million long-term intercompany note payable to WEC Energy Group in April 2023. The $430.0 million intercompany note payable was redeemed in December 2024, and WECI recorded a $3.5 million loss on early redemption. This intercompany interest expense (including the loss on early redemption) is offset by higher intercompany interest income at the corporate and other segment and is eliminated in consolidation. Also driving an increase in interest expense was the impact of WECI Energy Holding III's issuance of long-term debt in December 2024. Partially offsetting these increases was lower interest expense due to lower principal balances on previously issued long-term debt, as a result of the semi-annual principal payments on long-term debt.\n2024 Form 10-K\n71\nWEC Energy Group, Inc.\nTable of Contents\nIncome Tax Benefit\nThe income tax benefit at the non-utility energy infrastructure segment increased $14.0 million during 2024, compared with 2023. The increase was primarily due to an increase in PTCs that was related to the acquisition of additional renewable generation facilities, the IRS approved PTC rate increase, and higher production volumes, partially offset by higher pre-tax earnings.\n2023 Compared with 2022\nOperating Income\nOperating income at the non-utility energy infrastructure segment decreased $12.1 million during 2023, compared with 2022, driven by these items at WECI: \n•\nThe recognition of $15.2 million in revenue related to our Upstream wind park in 2022 that was associated with market settlements received from SPP in February 2021. These settlements were subject to a FERC complaint, so we were not able to recognize them as revenue until the FERC issued an order denying that complaint in 2022.\n•\nA $13.4 million positive revenue impact in 2022 from a sharing arrangement with one of our Blooming Grove customers resulting from strong energy prices.\nThese decreases in operating income were partially offset by:\n•\nThe recognition of $6.4 million in revenue related to our Blooming Grove wind park in 2023 for a capacity payment received from PJM Interconnection that was associated with a December 2022 cold weather event. The capacity payment was subject to a FERC complaint, so we recognized this as revenue in 2023 when FERC issued an order denying that complaint.\n•\nA $4.4 million positive impact from Sapphire Sky, a wind facility acquired in February 2023.\nIn addition to the above items at WECI, there was a $5.4 million positive impact from We Power due to continued capital investment.\nInterest Expense\nInterest expense at the non-utility energy infrastructure segment increased $25.4 million during 2023, compared with 2022, driven by a $16.1 million increase in interest expense due to WECI’s issuance of a $430.0 million long-term intercompany note payable to WEC Energy Group in April 2023. This intercompany interest expense is offset by higher intercompany interest income at the corporate and other segment and is eliminated in consolidation. Also driving the increase was the impact of WECI Wind Holding II's issuance of long-term debt in December 2022.\nIncome Tax Benefit\nThe income tax benefit at the non-utility energy infrastructure segment increased $47.5 million during 2023, compared with 2022. The increase was primarily due to a $37.5 million increase in PTCs in 2023, driven by the acquisition of additional renewable generation facilities in the second half of 2022 and in the first quarter of 2023. Also contributing to the favorable income tax variance were lower pre-tax earnings during 2023, compared with 2022.\n2024 Form 10-K\n72\nWEC Energy Group, Inc.\nTable of Contents\nCorporate and Other Segment Contribution to Net Income Attributed to Common Shareholders\nYear Ended December 31\nB (W)\nB (W)\n(in millions)\n2024\n2023\n2022\n2024 vs 2023\n2023 vs 2022\nOperating loss\n$\n(11.3)\n$\n(26.8)\n$\n(11.7)\n$\n15.5 \n$\n(15.1)\nOther income, net\n54.4\n \n53.3 \n14.6 \n1.1 \n38.7 \nInterest expense\n310.0\n \n258.1 \n119.4 \n(51.9)\n(138.7)\nGain on debt extinguishment\n(23.1)\n(0.5)\n— \n22.6 \n0.5 \nLoss before income taxes\n(243.8)\n(231.1)\n(116.5)\n(12.7)\n(114.6)\nIncome tax benefit\n(79.5)\n(68.3)\n(45.7)\n11.2 \n22.6 \nNet loss attributed to common shareholders\n$\n(164.3)\n$\n(162.8)\n$\n(70.8)\n$\n(1.5)\n$\n(92.0)\n2024 Compared with 2023\nOperating Loss\nThe operating loss at the corporate and other segment decreased $15.5 million during 2024, compared with 2023. The lower operating loss was driven by a $16.8 million positive impact from WBS's allocation of its net credits from the non-service components of its net periodic pension and OPEB costs. These net credits are initially recorded in other income, net, but are allocated to our operating segments as an overhead cost, which is recorded through operating expenses. As a result, this positive impact is fully offset in the other income, net line item discussed below.\nOther Income, Net\nOther income, net at the corporate and other segment increased $1.1 million during 2024, compared with 2023. The significant factors impacting the increase in other income, net were:\n•\nA $14.3 million increase in interest income, driven by an $8.6 million increase in intercompany interest income from WECI, primarily related to its issuance of a $430.0 million long-term intercompany note to WEC Energy Group in April 2023. The $430.0 million intercompany note was redeemed in December 2024, and WEC Energy Group recorded a $3.5 million gain on the redemption. This intercompany interest income is offset by higher intercompany interest expense at our non-utility energy infrastructure segment. Higher interest income on cash balances of $3.5 million also contributed to the increase in other income.\n•\nA $5.8 million increase due to net earnings of $2.3 million from our equity method investments in technology and energy-focused investment funds during 2024, compared with net losses of $3.5 million during 2023. \nThese increases in other income, net were partially offset by:\n•\nA $16.8 million decrease driven by lower net credits from the non-service components of WBS's net periodic pension and OPEB costs. As discussed above, this negative impact was offset by lower operating expenses as these credits are allocated to our operating segments as an overhead cost.\n•\nA $2.0 million decrease due to lower net gains from the investments held in the Integrys rabbi trust. The gains from the investments held in the rabbi trust partially offset the changes in benefit costs related to deferred compensation, which are primarily included in other operation and maintenance expense in our utility segments. See Note 17, Fair Value Measurements, for more information on our investments held in the Integrys rabbi trust.\nInterest Expense\nInterest expense at the corporate and other segment increased $51.9 million during 2024, compared with 2023, primarily due to the impact of long-term debt issuances in April and September 2023, as well as May and December 2024. This increase was partially offset by long-term debt maturities and redemptions. See Note 14, Long-Term Debt, for more information.\n2024 Form 10-K\n73\nWEC Energy Group, Inc.\nTable of Contents\nGain on Debt Extinguishments\nThe gain on debt extinguishments increased $22.6 million during 2024, compared with 2023, driven by the early settlement of a portion of both our 5.60% Senior Notes due September 12, 2026 and our 1.80% Senior Notes due October 15, 2030. We also recorded gains on redemptions and repurchases of our 2007 Junior Notes during 2024.\nIncome Tax Benefit\nThe income tax benefit at the corporate and other segment increased $11.2 million during 2024, compared with 2023, driven by the resolution of a tax audit and higher pre-tax loss. \n2023 Compared with 2022\nOperating Loss\nThe operating loss at the corporate and other segment increased $15.1 million during 2023, compared with 2022, driven by the year-over-year impact from the 2022 resolution of a previously recorded liability as certain outstanding matters reached a favorable outcome. Lower operating income at Wispark also contributed to the higher operating loss, driven by the 2022 positive impact from a payment on a note receivable that was previously written off due to uncertainty regarding its collectability and lower gains related to the sale of land and other assets.\nOther Income, Net\nOther income, net at the corporate and other segment increased $38.7 million during 2023, compared with 2022. The significant factors impacting the increase in other income, net were:\n•\nA $13.7 million net gain from the investments held in the Integrys rabbi trust during 2023, compared with a $12.6 million net loss during 2022.\n•\nAn $18.3 million increase in intercompany interest income, driven by WECI's issuance of a $430.0 million long-term intercompany note to WEC Energy Group in April 2023 and higher interest rates on short-term borrowings to subsidiaries in our operating segments. This intercompany interest income is offset by higher intercompany interest expense in our operating segments and is eliminated in consolidation.\nThese increases in other income, net were partially offset by a $3.5 million net loss from our equity method investments in technology and energy-focused investment funds during 2023, compared with $6.5 million of net earnings during 2022.\nInterest Expense\nInterest expense at the corporate and other segment increased $138.7 million during 2023, compared with 2022, primarily due to the impact of long-term debt issuances in September 2022, January 2023, and April 2023. Also driving the increase in interest expense was higher average short-term debt balances and increased short-term debt interest rates.\nIncome Tax Benefit\nThe income tax benefit at the corporate and other segment increased $22.6 million during 2023, compared with 2022, driven by a higher pre-tax loss. This increase in the income tax benefit was partially offset by a $5.9 million decrease in excess tax benefits recognized related to stock option exercises. \nLIQUIDITY AND CAPITAL RESOURCES\nOverview\nWe expect to maintain adequate liquidity to meet our cash requirements for operation of our businesses and implementation of our corporate strategy through internal generation of cash from operations and access to the capital markets.\n2024 Form 10-K\n74\nWEC Energy Group, Inc.\nTable of Contents\nThe following discussion and analysis of our Liquidity and Capital Resources includes comparisons of our cash flows for the year ended December 31, 2024 with the year ended December 31, 2023. For a similar discussion that compares our cash flows for the year ended December 31, 2023 with the year ended December 31, 2022, see Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations – Liquidity and Capital Resources in Part II of our 2023 Annual Report on Form 10-K, which was filed with the SEC on February 22, 2024.\nCash Flows\nThe following table summarizes our cash flows during the years ended December 31:\n(in millions)\n2024\n2023\nChange in 2024 Over 2023\nCash provided by (used in):\nOperating activities\n$\n3,211.8\n \n$\n3,018.4 \n$\n193.4 \nInvesting activities\n(3,802.5)\n(3,558.2)\n(244.3)\nFinancing activities\n467.7\n \n522.8 \n(55.1)\nOperating Activities\nNet cash provided by operating activities increased $193.4 million during 2024, compared with 2023, driven by: \n•\nA $215.5 million increase in cash driven by lower amounts of collateral paid to counterparties during 2024, compared with 2023, as well as lower realized losses on derivative instruments recognized during 2024, compared with 2023.\n•\nA $205.3 million increase in cash received for income taxes driven by proceeds received during 2024, compared with 2023, related to 2023 and 2024 PTCs that were sold to third parties.\n•\nAn $83.1 million increase in cash from lower payments for operating and maintenance expenses. During 2024, our payments were lower associated with previous commitments to charitable projects and operation and maintenance related to our We Power and Wisconsin generation units, as well as due to the timing of payments for accounts payable. \n•\nA $21.9 million increase in cash related to lower payments for taxes other than income taxes during 2024, compared with 2023.\n•\nAn $8.9 million increase in cash from lower payments for environmental remediation related to work completed on former manufactured gas plant sites during 2024, compared with 2023.\nThese increases in net cash provided by operating activities were partially offset by:\n•\nA $224.8 million decrease in cash from lower overall collections from customers during 2024, compared with 2023. This decrease was driven by the lower per-unit cost of natural gas and lower sales volumes from warmer winter weather during 2024, compared with 2023.\n•\nA $132.3 million decrease in cash from higher payments for interest, driven by long-term debt issuances at higher interest rates during 2023 and 2024, higher average short-term debt balances, and higher average short-term debt interest rates during 2024, compared with 2023.\nInvesting Activities\nNet cash used in investing activities increased $244.3 million during 2024, compared with 2023, driven by:\n•\nThe acquisition of a 90% ownership interest in Delilah I in December 2024 for \n$462.5 million, net of cash acquired of $0.6 million.\n•\nThe acquisition of a 90% ownership interest in Maple Flats in November 2024 for $431.2 million, net of cash acquired of $0.5 million.\n2024 Form 10-K\n75\nWEC Energy Group, Inc.\nTable of Contents\n•\nA $288.2 million increase in cash paid for capital expenditures during 2024, compared with 2023, which is discussed in more detail below. \n•\nA $31.1 million decrease in proceeds received from the sale of assets during 2024, compared with 2023, driven by the sale of land at the site of our former Pleasant Prairie power plant in 2023. See Note 3, Dispositions, for more information.\nThese increases in net cash used in investing activities were partially offset by: \n•\nThe acquisition of a 90% ownership interest in Sapphire Sky in February 2023 for $442.6 million, net of cash acquired of $0.3 million.\n•\nThe acquisition of an 80% ownership interest in Samson I in February 2023 for $257.3 million, net of cash acquired of $5.2 million.\n•\nThe acquisition of a 90% ownership interest in Red Barn in April 2023 for $143.8 million.\n•\nThe acquisition of Whitewater in January 2023 for $76.0 million.\n•\nAn $18.2 million decrease in capital contributions paid to transmission affiliates during 2024, compared with 2023. See Note 21, Investment in Transmission Affiliates, for more information. \nFor more information on our acquisitions, see Note 2, Acquisitions.\nCapital Expenditures\nCapital expenditures by segment for the years ended December 31 were as follows:\nReportable Segment \n(in millions)\n2024\n2023\nChange in 2024 Over 2023\nWisconsin \n$\n2,247.1\n \n$\n1,819.3 \n$\n427.8 \nIllinois\n343.0\n \n489.8 \n(146.8)\nOther states\n118.3\n \n103.5 \n14.8 \nNon-utility energy infrastructure\n52.1\n \n54.5 \n(2.4)\nCorporate and other\n20.6\n \n25.8 \n(5.2)\nTotal capital expenditures\n$\n2,781.1\n \n$\n2,492.9 \n$\n288.2 \nThe increase in cash paid for capital expenditures at the Wisconsin segment during 2024, compared with 2023, was driven by higher payments for WE's electric distribution system, increased capital expenditures for renewable energy projects at WE, WPS, and UMERC, increased capital expenditures for combustion turbines at OCPP, as well as increased capital expenditures for a project to consolidate our electric utility operations technology. These increases in capital expenditures were partially offset by decreased payments for construction of WE's and WG's LNG facilities, which were completed in November 2023 and February 2024, respectively, as well as decreased payments for natural gas-fired generation that was constructed at WPS's existing Weston power plant site, which was completed in July 2023. \nThe decrease in cash paid for expenditures at the Illinois segment during 2024, compared with 2023, was driven by lower payments related to PGL's natural gas distribution system, including SMP. For more information on the factors contributing to this decrease, see Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – Illinois Proceedings.\nThe increase in cash paid for capital expenditures at the Other States segment during 2024, compared with 2023, was driven by increased payments for MGU's natural gas distribution system.\nSee Liquidity and Capital Resources – Cash Requirements – Significant Capital Projects below for more information.\n2024 Form 10-K\n76\nWEC Energy Group, Inc.\nTable of Contents\nFinancing Activities\nNet cash provided by financing activities decreased $55.1 million during 2024, compared with 2023, driven by:\n•\nA $1,276.5 million decrease in cash due to $902.8 million of net repayments of commercial paper during 2024, compared with $373.7 million of net borrowings of commercial paper during 2023. \n•\nA $1,132.6 million decrease in cash due to higher retirements of long-term debt during 2024, compared with 2023.\n•\nA $72.0 million decrease in cash due to higher dividends paid on our common stock during 2024, compared with 2023. In January 2024, our Board of Directors increased our quarterly dividend by $0.055 per share (7.1%) effective with the March 2024 dividend payment.\n•\nA $31.7 million decrease in cash due to higher payments for debt extinguishment and issuance costs during 2024, compared with 2023. \n•\nThe purchase of an additional 10% ownership interest in Samson I in January 2024 for $28.1 million.\nThese decreases in net cash provided by financing activities were partially offset by:\n•\nA $2,290.9 million increase in cash due to higher issuances of long-term debt during 2024, compared with 2023.\n•\nA $163.4 million increase in cash due to the issuance of common stock during 2024. We did not issue any common stock during 2023. See Note 11, Common Equity, for more information.\n•\nA $17.4 million increase in cash proceeds related to an increase in stock options exercised during 2024, compared with 2023.\n•\nA $13.4 million increase in cash due to a decrease in common stock purchased during 2024, compared with 2023, to satisfy requirements of our stock-based compensation plans. See Note 11, Common Equity, for more information.\nSignificant Financing Activities\nFor more information on our financing activities, see Note 13, Short-Term Debt and Lines of Credit, and Note 14, Long-Term Debt. \nCash Requirements\nWe require funds to support and grow our businesses. Our significant cash requirements primarily consist of capital and investment expenditures, payments to retire and pay interest on long-term debt, the payment of common stock dividends to our shareholders, and the funding of our ongoing operations. Our significant cash requirements are discussed in further detail below.\n2024 Form 10-K\n77\nWEC Energy Group, Inc.\nTable of Contents\nSignificant Capital Projects\nWe have several capital projects and acquisitions that will require significant capital expenditures over the next three years and beyond. All projected capital requirements are subject to periodic review and may vary significantly from estimates, depending on a number of factors. These factors include environmental requirements, regulatory restraints and requirements, changes in tax laws and regulations, acquisition and development opportunities, market volatility, economic trends, supply chain disruptions, inflation, and interest rates. Our estimated capital expenditures and acquisitions for the next three years are reflected below. These amounts include anticipated expenditures for environmental compliance and certain remediation issues. For a discussion of certain environmental matters affecting us, see Note 24, Commitments and Contingencies.\n(in millions)\n2025\n2026\n2027\nWisconsin\n$\n4,202.4 \n$\n4,410.7 \n$\n4,873.2 \nIllinois\n373.7 \n404.8 \n369.7 \nOther states\n106.5 \n121.4 \n123.4 \nNon-utility energy infrastructure\n437.6 \n23.1 \n33.8 \nCorporate and other\n17.9 \n10.2 \n2.4 \nTotal\n$\n5,138.1 \n$\n4,970.2 \n$\n5,402.5 \nOur utilities continue to upgrade their electric and natural gas distribution systems to enhance reliability. These upgrades include addressing our aging infrastructure, system hardening, and the AMI program. AMI is an integrated system of smart meters, communication networks, and data management systems that enable two-way communication between utilities and customers.\nWe are committed to investing in solar, wind, battery storage, and natural gas-fired generation. Below are examples of projects that are proposed or currently underway.\n•\nWE and WPS, along with an unaffiliated utility, received PSCW approval to acquire and construct Paris, a utility-scale solar-powered electric generating facility with a battery energy storage system located in Kenosha County, Wisconsin. In December 2024, the construction of the solar portion of Paris was completed, with WE and WPS collectively owning 180 MWs of solar generation. WE and WPS will collectively own 99 MWs of battery storage of this project, with construction expected to be completed in 2025. \nWE's and WPS's combined share of the cost of this project is estimated to be approximately $542 million.\n•\nWE and WPS, along with an unaffiliated utility, received PSCW approval to acquire and construct Darien, a utility-scale solar-powered electric generating facility with a battery energy storage system. The project will be located in Rock and Walworth counties, Wisconsin and once fully constructed, WE and WPS will collectively own 225 MWs of solar generation and 68 MWs of battery storage of this project. WE's and WPS's combined share of the cost of this project\n is estimated to be approximately $567 million, with\n construction of the solar portion and battery storage expected to be completed in 2025 and 2026, respectively.\n•\nWE and WPS, along with an unaffiliated utility, received PSCW approval to acquire Koshkonong, a utility-scale solar-powered electric generating facility with a battery energy storage system. The project will be located in Dane County, Wisconsin and once fully constructed, WE and WPS will collectively own 270 MWs of solar generation and 149 MWs of battery storage of this project. WE's and WPS's combined share of the cost of this project is estimated to be approximately \n$930 million,\n with construction of the solar portion and battery storage expected to be completed\n in 2026 and 2027, respectively.\n•\nWE and WPS plan to enhance fuel flexibility at the coal-fired ERGS units and Weston Unit 4. \n•\nIn February 2024, WE and WPS, along with an unaffiliated utility, filed a request with the PSCW to acquire and construct High Noon, a utility-scale solar-powered electric generating facility with a battery energy storage system. If approved, the project will be located in Columbia County, Wisconsin and once fully constructed, WE and WPS will collectively own 270 MWs of solar generation and 149 MWs of battery storage of this project. If approved, WE and WPS's combined share of the cost of the project is estimated to be approximately $883 million, with construction of the solar portion and battery storage expected to be completed in 2027.\n•\nUMERC received MPSC approval to acquire and construct Renegade, a utility-scale solar-powered electric generating facility. The project will be located in Delta and Marquette counties, Michigan and once fully constructed, UMERC will own 100 MWs of solar generation. The cost of this project is estimated to be approximately $226 million, with construction expected to be completed by the end of 2026.\n2024 Form 10-K\n78\nWEC Energy Group, Inc.\nTable of Contents\n•\nIn April 2024, WE filed a request with the PSCW to build five natural gas-fired combustion turbines capable of producing approximately 1,100 MWs, which would be located at the existing OCPP site. If approved, the cost of this project is estimated to be approximately $1.2 billion.\n•\nIn April 2024, WE filed a request with the PSCW to add seven natural gas-fired RICE units near the Paris Generating Station. The new RICE units would be fueled with natural gas and capable of producing approximately 128 MWs. If approved, the cost of this project is estimated to be approximately $280 million.\n•\nIn April 2024, WE filed a request with the PSCW to construct the Rochester Lateral, which would supply additional natural gas service to the OCPP site. The natural gas lateral would be built in Kenosha, Racine, and Milwaukee counties. If approved, the cost of this project is estimated to be approximately $200 million.\n•\nIn April 2024, WE filed a request with the PSCW to construct an LNG facility which would be located on the OCPP site. If approved, the facility would have a storage capacity of two Bcf and the cost of this project is estimated to be approximately $456 million.\n•\nIn September 2024, WE and WPS, along with an unaffiliated utility, filed a request with the PSCW to acquire Dawn Harvest, a utility-scale solar-powered electric generating facility with a battery energy storage system. If approved, the project will be located in Rock County, Wisconsin and once fully constructed, WE and WPS will collectively own 135 MWs of solar generation and WE will own 50 MWs of battery storage of this project. If approved, WE and WPS's combined share of the cost of this project is estimated to be approximately $409 million, with construction expected to be completed in 2028.\n•\nIn September 2024, WE and WPS, along with an unaffiliated utility, filed a request with the PSCW to acquire Saratoga, a utility-scale solar-powered electric generating facility with a battery energy storage system, and Ursa, a utility-scale solar-powered electric generating facility. If approved, Saratoga will be located in Wood County, Wisconsin and Ursa will be located in Columbia County, Wisconsin. Once fully constructed, WE and WPS will collectively own 135 MWs of solar generation and 45 MWs of battery storage of Saratoga and 180 MWs of solar generation of Ursa. If approved, WE and WPS's combined share of the cost of Ursa is estimated to be approximately $406 million, with construction expected to be completed in 2027. If approved, WE and WPS's combined share of the cost of Saratoga is estimated to be approximately $406 million, with construction expected to be completed in 2028.\n•\nIn September 2024, WE and WPS, along with an unaffiliated utility, filed a request with the PSCW to acquire and construct Badger Hollow Wind and to acquire Whitetail, two utility-scale wind-powered electric generating facilities. If approved, Badger Hollow Wind will be located in Iowa and Grant counties, Wisconsin, and Whitetail will be located in Grant County, Wisconsin. Once fully constructed, WE and WPS will collectively own 100 MWs of wind generation of Badger Hollow Wind and 60 MWs of wind generation of Whitetail. If approved, WE and WPS's combined share of the cost of Badger Hollow Wind is estimated to be $320 million, with construction expected to be completed in 2027. If approved, WE and WPS's combined share of the cost of Whitetail is estimated to be approximately $200 million, with construction expected to be completed in 2027.\n•\nIn October 2024, WE and WPS, along with an unaffiliated utility, filed a request with the PSCW to acquire and construct Good Oak and Gristmill, two utility-scale solar electric generating facilities. If approved, both Good Oak and Gristmill will be located in Columbia County, Wisconsin. Once fully constructed, WE and WPS will collectively own 88 MWs of solar generation of Good Oak and 60 MWs of solar generation of Gristmill. If approved, WE and WPS's combined share of the cost of Good Oak is estimated to be $194 million and the cost of Gristmill is estimated to be approximately $130 million, with construction for both projects expected to be completed in 2028.\nThe construction of additional LNG facilities in Wisconsin has been proposed as part of our capital plan and\n would provide another approximately four Bcf of natural gas supply at an estimated cost of $940 million. The facilities are expected to reduce the likelihood of constraint\ns on our \nnatural gas distribution system during the highest demand days of winter.\nAs part of our capital plan, we plan to build additional natural gas-fired combustion turbines capable of producing approximately 675 MWs at an estimated cost of $960 million. In addition, we plan to add natural gas-fired RICE units that would be capable of producing approximately 114 MWs at an estimated cost of $250 million.\nIn connection with several investigations it conducted, the DOC set duties on solar panels and cells imported from four southeast Asian countries. See Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – United States Department of Commerce Complaints and Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, \n2024 Form 10-K\n79\nWEC Energy Group, Inc.\nTable of Contents\nand Legal Matters – Uyghur Forced Labor Prevention Act for information on the potential impacts to our solar projects as a result of the duties set by the DOC and related USITC and DOC investigations, and CBP actions related to solar panels, respectively. The expected in-service dates and costs identified above already reflect some of these impacts.\nIn November 2023, the ICC ordered PGL to pause spending on its SMP until the ICC had a proceeding to determine the optimal method for replacing aging natural gas infrastructure and a prudent investment level. In accordance with the written order, the ICC initiated the proceeding in January 2024. On February 20, 2025, the ICC issued an order setting expectations for PGL's prospective operations under its SMP. For information on regulatory proceedings related to the SMP, see Note 26, Regulatory Environment, and Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – Illinois Proceedings.\nThe non-utility energy infrastructure line item in the table above includ\nes WECI's investment in Hardin III, which closed in February 2025. See Note 2, Acquisitions, for more information on this project.\nWe expect to provide total capital contributions to ATC (not included in the above table) of approximately $445 million from 2025 through 2027. We do not expect to make any contributions to ATC Holdco during that period. WEC's portion of the investment in MISO Tranche 1 is estimated to be approximately $580 million between 2025 and 2029, a portion of which will be funded by ATC's cash from operations. Tranche 1 is part of MISO's Long Range Transmission Planning initiative to upgrade the grid so that it can reliably accommodate for the shift in generation to lower-carbon resources. \nLong-Term Debt\nA significant amount of cash is required to retire and pay interest on our long-term debt obligations. See Note 14, Long-Term Debt, for more information on our outstanding long-term debt, including a schedule of our long-term debt maturities over the next five years. The following table summarizes our required interest payments on long-term debt as of December 31, 2024:\nInterest Payments Due by Period\n(in millions)\nTotal\nLess Than 1 Year\n1-3 Years\n3-5 Years\nMore Than 5 Years\nInterest payments due on long-term debt\n$\n8,357.6 \n$\n805.2 \n$\n1,330.7 \n$\n1,014.9 \n$\n5,206.8 \nCommon Stock Dividends\nOn January 16, 2025, our Board of Directors increased our quarterly dividend to $0.8925 per share effective with the first quarter of 2025 dividend payment, an increase of 6.9%. This equates to an annual dividend of $3.57 per share. In addition, the Board of Directors affirmed our dividend policy that continues to target a dividend payout ratio of 65-70% of earnings.\nWe have been paying consecutive quarterly dividends dating back to 1942 and expect to continue paying quarterly cash dividends in the future. Any payment of future dividends is subject to approval by our Board of Directors and is dependent upon future earnings, capital requirements, and financial and other business conditions. In addition, our ability as a holding company to pay common stock dividends primarily depends on the availability of funds received from our subsidiaries. Various financing arrangements and regulatory requirements impose certain restrictions on the ability of our subsidiaries to transfer funds to us in the form of cash dividends, loans, or advances. We do not believe that these restrictions will materially affect our operations or limit any dividend payments in the foreseeable future. See Note 11, Common Equity, for more information related to these restrictions and our other common stock matters.\nOther Significant Cash Requirements\nOur utility and non-utility operations have purchase obligations under various contracts for the procurement of fuel, power, and gas supply, as well as the related storage and transportation. These costs are a significant component of funding our ongoing operations. See Note 24, Commitments and Contingencies, for more information, including our minimum future commitments related to these purchase obligations. \n2024 Form 10-K\n80\nWEC Energy Group, Inc.\nTable of Contents\nIn addition to our energy-related purchase obligations, we have commitments for other costs incurred in the normal course of business, including costs related to information technology services, meter reading services, maintenance and other service agreements for certain generating facilities, and various engineering agreements. Our estimated future cash requirements related to these purchase obligations, excluding energy-related obligations, are reflected below.\nPayments Due by Period\n(in millions)\nTotal\nLess Than 1 Year\n1-3 Years\n3-5 Years\nMore Than 5 Years\nPurchase orders\n$\n561.3 \n$\n276.4 \n$\n197.6 \n$\n54.7 \n$\n32.6 \nWe have various finance and operating lease obligations. Our finance lease obligations primarily relate to land leases for our renewable generation projects. Our operating lease obligations are for office space and land. See Note 15, Leases, for more information, including an analysis of our minimum lease payments due in future years.\nWe make contributions to our pension and OPEB plans based upon various factors affecting us, including our liquidity position and tax law changes. See Note 20, Employee Benefits, for our expected contributions in 2025 and our expected pension and OPEB payments for the next 10 years. We expect the majority of these future pension and OPEB payments to be paid from our outside trusts. See Sources of Cash–Investments in Outside Trusts below for more information.\nIn addition to the above, our balance sheet at December 31, 2024 included various other liabilities that, due to the nature of the liabilities, the amount and timing of future payments cannot be determined with certainty. These liabilities include AROs, liabilities for the remediation of manufactured gas plant sites, and liabilities related to the accounting treatment for uncertainty in income taxes. For additional information on these liabilities, see Note 9, Asset Retirement Obligations, Note 16, Income Taxes, and Note 24, Commitments and Contingencies, respectively.\nOff-Balance Sheet Arrangements\nWe are a party to various financial instruments with off-balance sheet risk as a part of our normal course of business, including financial guarantees and letters of credit that support construction projects, commodity contracts, and other payment obligations. We believe that these agreements do not have, and are not reasonably likely to have, a current or future material effect on our financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures, or capital resources. See Note 13, Short-Term Debt and Lines of Credit, Note 19, Guarantees, and Note 23, Variable Interest Entities, for more information.\nSources of Cash\nLiquidity\nWe anticipate meeting our short-term and long-term cash requirements to operate our businesses and implement our corporate strategy through internal generation of cash from operations and access to the capital markets, and common equity. Accessing the capital markets allows us to obtain external short-term borrowings, including commercial paper and term loans, and issue intermediate or long-term debt securities, as well as other types of securities. In 2024, we started issuing common equity through a combination of our employee benefit plans and stock purchase and dividend reinvestment plan, as well as through an at-the-market program. Cash generated from operations is primarily driven by sales of electricity and natural gas to our utility customers, reduced by costs of operations. Our access to the capital markets is critical to our overall strategic plan and allows us to supplement cash flows from operations with external borrowings to manage seasonal variations, working capital needs, commodity price fluctuations, unplanned expenses, and unanticipated events. Subject to market conditions and other factors, we may repurchase our debt securities through open market purchases, privately negotiated transactions and/or other types of transactions. \nIn January and February 2024, pursuant to a tender offer, we purchased $122.1 million aggregate principal amount of the $500.0 million outstanding of our 2007 Junior Notes for $115.2 million with proceeds from issuing commercial paper. We recorded a $6.4 million gain related to the early settlement. Additionally, in May 2024, we repurchased $19.0 million aggregate principal amount of the $377.9 million outstanding of our 2007 Junior Notes for $18.7 million, plus accrued interest, with proceeds received from issuing commercial paper. We recorded a $0.2 million gain related to the early settlement. In December 2024, we redeemed the remaining $358.9 million outstanding principal at par, plus accrued interest, of our 2007 Junior Notes with the proceeds we received from the issuance of our 2024A Junior Notes and 2024B Junior Notes. \n2024 Form 10-K\n81\nWEC Energy Group, Inc.\nTable of Contents\nIn December 2024, pursuant to a tender offer, we repurchased $250.0 million aggregate principal amount of the $600.0 million outstanding of our 5.60% Senior Notes due September 12, 2026 and repurchased $150.0 million aggregate principal amount of the $450.0 million outstanding of our 1.80% Senior Notes due October 15, 2030, for $380.9 million, plus accrued interest, with proceeds received from issuing commercial paper. As a result of the repurchase, we recorded a $16.5 million gain on debt extinguishment. \nWEC Energy Group, WE, WPS, WG, and PGL maintain bank back-up credit facilities, which provide liquidity support for each company's obligations with respect to commercial paper and for general corporate purposes. We review our bank back-up credit facility needs on an ongoing basis and expect to be able to maintain adequate credit facilities to support our operations.\nThe amount, type, and timing of any financings in 2025, as well as in subsequent years, will be contingent on investment opportunities and our cash requirements and will depend upon prevailing market conditions, regulatory approvals for certain subsidiaries, and other factors. Our regulated utilities plan to maintain capital structures consistent with those approved by their respective regulators. For more information on our utilities approved capital structures, see Item 1. Business – E. Regulation.\nThe issuance of securities by our utility companies is subject to the approval of the applicable state commissions or FERC. Additionally, with respect to the public offering of securities, we, WE, and WPS file registration statements with the SEC under the Securities Act of 1933, as amended (1933 Act). The amounts of securities authorized by the appropriate regulatory authorities, as well as the securities registered under the 1933 Act, are closely monitored and appropriate filings are made to ensure flexibility in the capital markets.\nAt December 31, 2024, our current liabilities exceeded our current assets by $1,930.2 million. We do not expect this to have an impact on our liquidity as we currently believe that our cash and cash equivalents, our available capacity under existing revolving credit facilities, cash generated from ongoing operations, and access to the capital markets are adequate to meet our short-term and long-term cash requirements.\nSee Note 11, Common Equity, Note 13, Short-Term Debt and Lines of Credit, and Note 14, Long-Term Debt, for more information about our common stock activity, commercial paper, credit facilities, and debt securities. \nInvestments in Outside Trusts\nWe maintain investments in outside trusts to fund the obligation to provide pension and certain OPEB benefits to current and future retirees. As of December 31, 2024, these trusts had investments of approximately $3.5 billion, consisting of fixed income and equity securities, that are subject to the volatility of the stock market and interest rates. The performance of existing plan assets, long-term discount rates, changes in assumptions, and other factors could affect our future contributions to the plans, our financial position if our accumulated benefit obligation exceeds the fair value of the plan assets, and future results of operations related to changes in pension and OPEB expense and the assumed rate of return. For additional information, see Note 20, Employee Benefits.\nCapitalization Structure\nThe following table shows our capitalization structure as of December 31, 2024 and 2023, as well as an adjusted capitalization structure that we believe is consistent with how a majority of the rating agencies currently view our Junior Notes:\n2024\n2023\n(in millions)\nActual\nAdjusted \n(1)\nActual\nAdjusted\n (2)\nCommon shareholders' equity\n$\n12,395.0\n \n$\n12,770.0\n \n$\n11,724.2 \n$\n11,974.2 \nPreferred stock of subsidiary\n30.4\n \n30.4\n \n30.4 \n30.4 \nLong-term debt (including current portion)\n18,907.1\n \n18,532.1\n \n16,631.1 \n16,381.1 \nShort-term debt\n1,116.6\n \n1,116.6\n \n2,020.9 \n2,020.9 \nTotal capitalization\n$\n32,449.1\n \n$\n32,449.1\n \n$\n30,406.6 \n$\n30,406.6 \nTotal debt\n$\n20,023.7\n \n$\n19,648.7\n \n$\n18,652.0 \n$\n18,402.0 \nRatio of debt to total capitalization\n61.7\n \n%\n60.6\n \n%\n61.3 \n%\n60.5 \n%\n(1)    \nIncluded in long-term debt on our Consolidated Balance Sheets as of December 31, 2024, was $750.0 million principal amount of WEC Energy Group's 2024 Junior Notes (2024A Junior Notes and 2024B Junior Notes, collectively) due 2055. The adjusted presentation at December 31, \n2024 Form 10-K\n82\nWEC Energy Group, Inc.\nTable of Contents\n2024 attributes $375.0 million of the Junior Notes to common equity and $375.0 million to long-term debt, similar to how the majority of rating agencies treat them. \n(2)    \nIncluded in long-term debt on our Consolidated Balance Sheets as of December 31, 2023, was $500.0 million principal amount of the 2007 Junior Notes. The adjusted presentation at December 31, 2023 attributes $250.0 million of the 2007 Junior Notes to common equity and $250.0 million to long-term debt, similar to how the majority of rating agencies treat them. \nThe adjusted presentation of our consolidated capitalization structure is included as a complement to our capitalization structure presented in accordance with GAAP. Management evaluates and manages our capitalization structure, including our total debt to total capitalization ratio, using the GAAP calculation as adjusted to reflect the treatment of the 2024 Junior Notes and 2007 Junior Notes by the majority of rating agencies. Therefore, we believe the non-GAAP adjusted presentation reflecting this treatment is useful and relevant to investors in understanding how management and the rating agencies evaluate our capitalization structure.\nDebt Covenants\nCertain of our short-term and long-term debt agreements contain financial covenants that we must satisfy, including debt to capitalization ratios and debt service coverage ratios. At December 31, 2024, we were in compliance with all such covenants related to outstanding short-term and long-term debt. We expect to be in compliance with all such debt covenants for the foreseeable future. See Note 11, Common Equity, Note 13, Short-Term Debt and Lines of Credit, and Note 14, Long-Term Debt, for more information.\nCredit Rating Risk\nCash collateral postings and prepayments made with external parties, including postings related to exchange-traded contracts, and cash collateral posted by external parties were immaterial as of December 31, 2024. From time to time, we may enter into commodity contracts that could require collateral or a termination payment in the event of a credit rating change to below BBB- at S&P Global Ratings, a division of S&P Global Inc., and/or Baa3 at Moody’s Investors Service, Inc. If WE had a sub-investment grade credit rating at December 31, 2024, it could have been required to post $103 million of additional collateral or other assurances pursuant to the terms of a PPA. We also have other commodity contracts that, in the event of a credit rating downgrade, could result in a reduction of our unsecured credit granted by counterparties.\nIn addition, access to capital markets at a reasonable cost is determined in large part by credit quality. Any credit ratings downgrade could impact our ability to access capital markets.\nIn June 2024, Moody's changed the rating outlook for PGL to negative from stable as a result of the November 2023 rate order and the May 2024 limited re-hearing. The change in rating outlook has not had, and we do not believe that it will have, a material impact on our ability to access capital markets. Moody's affirmed PGL's ratings including its Aa3 senior secured rating and its P-1 short term rating for commercial paper. See Note 26, Regulatory Environment, for more information on the outcome of the rate order.\nSubject to other factors affecting the credit markets as a whole, we believe our current ratings should provide a significant degree of flexibility in obtaining funds on competitive terms. However, these security ratings reflect the views of the rating agency only. An explanation of the significance of these ratings may be obtained from the rating agency. Such ratings are not a recommendation to buy, sell, or hold securities. Any rating can be revised upward or downward or withdrawn at any time by a rating agency.\nFACTORS AFFECTING RESULTS, LIQUIDITY, AND CAPITAL RESOURCES\nCompetitive Markets\nElectric Utility Industry\nThe FERC supports large RTOs, which directly impacts the structure of the wholesale electric market. Due to the FERC's support of RTOs, MISO uses the MISO Energy Markets to carry out its operations, including the use of LMPs to value electric transmission congestion and losses. Increased competition in the retail and wholesale markets, which may result from restructuring efforts, could have a significant and adverse financial impact on us.\n2024 Form 10-K\n83\nWEC Energy Group, Inc.\nTable of \nContents\nWisconsin\nElectric utility revenues in Wisconsin are regulated by the PSCW. The PSCW continues to maintain the position that the question of whether to implement electric retail competition in Wisconsin should ultimately be decided by the Wisconsin legislature. No such legislation has been introduced in Wisconsin to date, and it is uncertain when, if at all, retail choice might be implemented in Wisconsin. \nMichigan\nMichigan has adopted a limited retail choice program. Under Michigan law, our retail customers may choose an alternative electric supplier to provide power supply service. As a result, some of our small retail customers have switched to an alternative electric supplier. At December 31, 2024, Michigan law limited customer choice to 10% of an electric utility's Michigan retail load. Our iron ore mine customer, Tilden, is exempt from this 10% cap based on current law, but Tilden is required under a long-term agreement to purchase electric power from UMERC through March 2039. In addition, certain load increases by facilities already using an alternative electric supplier can still be serviced by their alternative electric supplier, when various conditions exist, even if the cap has already been met. When a customer switches to an alternative electric supplier, we continue to provide distribution and customer service functions for the customer.\nNatural Gas Utility Industry\nWe offer natural gas transportation services to our customers that elect to purchase natural gas directly from a third-party supplier. Since these transportation customers continue to use our distribution systems to transport natural gas to their facilities, we earn distribution revenues from them. As such, the loss of revenue associated with the cost of natural gas that our transportation customers purchase from third-party suppliers has little impact on our net income, as it is substantially offset by an equal reduction to natural gas costs. \nWisconsin\nOur Wisconsin utilities offer both natural gas transportation service and interruptible natural gas sales to enable customers to better manage their energy costs. Customers continue to switch between firm system supply, interruptible system supply, and transportation service each year as the economics and service options change. \nDue to the PSCW's previous proceedings on natural gas industry regulation in a competitive environment, the PSCW currently provides all Wisconsin customer classes with competitive markets the option to choose a third-party natural gas supplier. All of our Wisconsin non-residential customer classes have competitive market choices and, therefore, can purchase natural gas directly from either a third-party supplier or their local natural gas utility. Since third-party suppliers can be used in Wisconsin, the PSCW has also adopted standards for transactions between a utility and its natural gas marketing affiliates. \nWe are currently unable to predict the impact, if any, of potential future industry restructuring on our results of operations or financial position.\nIllinois\nAbsent extraordinary circumstances, potential competitors are not allowed to construct competing natural gas distribution systems in the service territories for PGL and NSG. A charter from the State of Illinois gives PGL the right to provide natural gas distribution service in the City of Chicago as a public utility. Further, the \"first in the field\" and public interest standards limit the ability of potential competitors to operate in an existing utility service territory. In addition, we believe it would be impractical to construct competing duplicate distribution facilities due to the high cost of installation.\nSince 2002, PGL and NSG have, under ICC-approved tariffs, provided their customers with the option to choose a third-party natural gas supplier. There are no state laws requiring PGL and NSG to make this choice option available to customers, but since this option is currently provided to our Illinois customers under tariff, ICC approval would be needed to withdraw those tariffs.\nAn interstate pipeline may seek to provide transportation service directly to our Illinois end users, which would bypass our natural gas transportation service. However, PGL and NSG have anti-bypass tariffs approved by the ICC, which allow them to negotiate rates \n2024 Form 10-K\n84\nWEC Energy Group, Inc.\nTable of \nContents\nwith customers that are potential bypass candidates to help ensure that such customers continue to use utility transportation service.\nMinnesota\nNatural gas utilities in the state of Minnesota do not have exclusive franchise service territories and, as a matter of law and policy, natural gas utilities may compete for new customers. However, natural gas utilities have customarily avoided competing for existing customers of other utilities, as there would be duplicative utility facilities and/or increased costs to customers. If this approach were to change, it could lead to a greater level of competition amongst utilities to obtain customers and potentially adversely impact our results of operations.\nMERC offers both natural gas transportation service and interruptible natural gas sales to enable customers to better manage their energy costs. Customers continue to switch between firm system supply, interruptible system supply, and transportation service each year as the economics and service options change. MERC has provided its commercial and industrial customers with the option to choose a third-party natural gas supplier since 2006. We are not required by the MPUC or state law to make this choice option available to customers, but since this option is currently provided to our Minnesota commercial and industrial customers, we would need MPUC approval to eliminate it.\nMichigan\nThe option to choose a third-party natural gas supplier has been provided to UMERC’s natural gas customers (formerly WPS’s Michigan natural gas customers) since the late 1990s and MGU's customers since 2005. We are not required by the MPSC or state law to make this choice option available to customers, but since this option is currently provided to our Michigan customers, we would need MPSC approval to eliminate it.\nRegulatory, Legislative, and Legal Matters\nRegulatory Recovery\nOur utilities account for their regulated operations in accordance with accounting guidance under the Regulated Operations Topic of the FASB ASC. Our rates are determined by various regulatory commissions. See Item 1. Business – E. Regulation for more information on these commissions.\nRegulated entities are allowed to defer certain costs that would otherwise be charged to expense if the regulated entity believes the recovery of those costs is probable. We record regulatory assets pursuant to generic and/or specific orders issued by our regulators. Recovery of the deferred costs in future rates is subject to the review and approval by those regulators. We assume the risks and benefits of ultimate recovery of these items in future rates. If the recovery of the deferred costs, including those referenced below, is not approved by our regulators, the costs would be charged to income in the current period. Regulators can impose liabilities on a prospective basis for amounts previously collected from customers and for amounts that are expected to be refunded to customers. We record these items as regulatory liabilities. See Note 6, Regulatory Assets and Liabilities, for more information on our regulatory assets and liabilities. See Note 26, Regulatory Environment, for more information regarding recent and pending rate proceedings, orders, and investigations involving our utilities.\nUncollectible Expense Adjustment Rider\nThe rates of PGL and NSG include a UEA rider for cost recovery or refund of uncollectible expense based on the difference between actual uncollectible write-offs and the amounts recovered in rates. The UEA rider is subject to an annual reconciliation whereby costs are reviewed for accuracy and prudency by the ICC. In May 2023, the ICC issued a written order on PGL's and NSG's 2018 UEA rider reconciliation. The order required a $15.4 million and $0.7 million refund to ratepayers at PGL and NSG, respectively. These amounts were refunded over a period of nine months, which began on September 1, 2023. In July 2023, PGL and NSG petitioned the Illinois Appellate Court for review of the ICC order. On November 7, 2024, the Illinois Appellate Court issued an opinion affirming the ICC order and the related disallowance. PGL and NSG petitioned the Illinois Supreme Court on December 12, 2024 seeking review and reversal of the May 2023 order. \nAs of December 31, 2024, there can be no assurance that all costs incurred under the UEA rider during the open reconciliation years, which include 2019 through 2024, will be deemed recoverable by the ICC. The combined annual costs of PGL and NSG included in \n2024 Form 10-K\n85\nWEC Energy Group, Inc.\nTable of \nContents\nthe rider, which reflect uncollectible write-offs in excess of what is recovered in base rates, have ranged from $10 million to $40 million during these open reconciliation years. Disallowances by the ICC, if any, could be material and have a material adverse impact on our results of operations.\nQualifying Infrastructure Plant Rider\nIn January 2014, the ICC approved PGL's use of the QIP rider as a recovery mechanism for costs incurred related to investments in QIP. This rider, which was in effect until December 1, 2023, continues to be subject to an annual reconciliation whereby costs are reviewed for accuracy and prudency. In August 2024, the ICC issued a final order on PGL's 2016 annual reconciliation, which included a disallowance of $14.8 million of certain capital costs. PGL recorded a pre-tax charge to income of $25.3 million during the third quarter of 2024 related to the disallowance and the previously recognized return on and of these investments. The charge was recorded on the income statement as a $12.9 million reduction in revenues for the amounts previously collected from customers, a $12.1 million increase to operating expenses for the impairment of PGL's property, plant, and equipment, and a $0.3 million increase to interest expense related to the amounts due to customers. On October 25, 2024, PGL filed a petition with the Illinois Appellate Court for review of the ICC's August order. \nIn March 2024, PGL filed its 2023 reconciliation with the ICC, which, along with the reconciliations from 2017 through 2022, is still pending. The aggregate capital costs included in the rider during the open reconciliation years, which include 2017 through 2023, along with any previously recognized return on these investments, totaled approximately $2.8 billion as of December 31, 2024. There can be no assurance that all of these costs and the previously recognized returns will be deemed recoverable by the ICC. Further disallowances by the ICC, if any, could be material and have a material adverse impact on our results of operations.\nIllinois Proceedings\nIn the PGL rate order issued by the ICC in November 2023, the ICC ordered PGL to pause spending on its SMP until the ICC completed a proceeding to determine the optimal method for replacing aging natural gas infrastructure and a prudent investment level. In accordance with the written order, the ICC initiated the proceeding in January 2024. On February 20, 2025, the ICC issued an order setting expectations for PGL's prospective operations under its SMP. The ICC directed us to focus on replacing all cast and ductile iron pipe that has a diameter under 36 inches by January 1, 2035. The ICC also indicated that failure to comply with this directive could subject us to civil penalties under Illinois statute. We are evaluating the impact of this order on our operations and capital plan.\nIn March 2024, the ICC initiated a statewide \"Future of Gas\" proceeding. The goal of this proceeding is to explore the issues involved with decarbonization of the gas distribution system in Illinois and recommend any future ICC action or legislative changes needed. It includes the formal exploration and consideration of the role of natural gas in the future, including in the context of the state’s environmental and energy policy goals. The proceeding includes a broad range of stakeholders, including Illinois utilities and other interested parties. The “Future of Gas” proceeding is expected to be completed in 2026. At this time, we cannot predict the ultimate outcome of this proceeding or the resulting impact to our natural gas operations in Illinois. Future natural gas investment opportunities in Illinois could be negatively impacted depending upon the outcome.\n See Note 26, Regulatory Environment, for more information regarding the November 2023 ICC rate order.\nChicago Decarbonization Efforts\nThe CABO was introduced at a meeting of the Chicago city council held in January 2024. If approved, this ordinance would set an indoor emissions standard that would require zero-to-low-emission energy systems in newly built commercial and residential buildings and major building additions in the city of Chicago. The proposed emission standards would effectively prohibit the use of natural gas in new buildings and homes and require electric heat and appliances. The CABO would not impact existing homes and businesses. In addition, certain buildings and equipment, such as hospitals, commercial kitchens, and back-up generators, would be exempt from the new emission limits.\nIn response to the CABO, a resolution was also introduced that would require the formation of a working group comprised of various subject matter experts to analyze the costs of converting buildings from natural gas to electricity, the costs for additional electric generation capacity needed for future building conversions, and the impact of shifting natural gas system costs from new construction to existing buildings if electrification measures are adopted. If the resolution is passed, this analysis would need to be completed prior to the adoption of any decarbonization initiatives, such as the CABO.\n2024 Form 10-K\n86\nWEC Energy Group, Inc.\nTable of \nContents\nIf approved by the city council, the CABO is expected to become effective one year after the approval date. PGL's future natural gas operations could be materially adversely impacted if the CABO is passed.\nPetitions Before PSCW Regarding Third-Party Financed Distributed Energy Resources\nIn May 2022, a petition was filed with the PSCW requesting a declaratory ruling that the owner of a third-party financed DER is not a \"public utility\" as defined under Wisconsin law and, therefore, is not subject to the PSCW’s jurisdiction under any statute or rule regulating public utilities. The party that filed the petition provides financing to its customers for installation of DERs (including solar panels and energy storage) on the customer’s property. A DER is connected to the host customer’s utility meter and is used for the customer’s energy needs. It may also be connected to the grid for distribution.\nIn December 2022, the PSCW granted the petitioner’s request for a declaratory ruling in part, finding that the owner of the third-party financed DER at issue in the petitioner’s brief is not a public utility under Wisconsin law, but declining to issue the petitioner’s request for a broader declaratory ruling that the petitioner would not be regulated as a \"public utility\". \nUpon appeal, in April 2024, the Dane County Circuit Court reversed the PSCW’s decision, finding that the PSCW erroneously interpreted the definition of \"public utility,\" and the evidence did not support its determination that the lease at issue in the petition did not involve the sale of electricity to the \"public\" under Wisconsin law. The case was remanded to the PSCW for further review. Although the PSCW issued an order in June 2024 to reopen the docket to consider modifications, the project lease originally at issue was no longer going forward, and so in October 2024 the PSCW issued an order declining to issue any declaratory ruling. \nMeanwhile, in June 2024, the party that filed the May 2022 PSCW petition appealed the Dane County Circuit Court’s April 2024 decision to the Wisconsin Court of Appeals. That appeal was in briefing when the PSCW issued its October 2024 order, which left the Court of Appeals with no agency decision to review. Based on this and the fact that the underlying project was no longer going forward, a motion to dismiss the appeal was granted by the Court of Appeals in February 2025. At this time we do not expect any material impact on our business operations.\nUyghur Forced Labor Prevention Act\nThe CBP issued a WRO in June 2021, applicable to certain silica-based products originating from the Xinjiang Uyghur Autonomous Region of China (Xinjiang), such as polysilicon, included in the manufacturing of solar panels. In June 2022, the WRO was superseded by the implementation of the UFLPA. The UFLPA establishes a rebuttable presumption that any imports wholly or partially manufactured in Xinjiang are prohibited from entering the United States. While our suppliers have been able to provide the CBP sufficient documentation to meet WRO and UFLPA compliance requirements, and we expect the same will be true for subsequent projects, we cannot currently predict what, if any, long-term impact the UFLPA will have on the overall supply of solar panels into the United States and whether we will experience any further impacts to the timing and cost of solar projects included in our long-term capital plan. \nIn January 2025, the Department of Homeland Security announced the addition of several more Chinese businesses to the UFLPA, including five solar supply chain providers. We are working to avoid doing business with these companies and remain in compliance with the UFLPA.\nUnited States Department of Commerce Complaints\nThe solar panel industry continues to experience uncertainty resulting from AD and CVD investigations involving four southeast Asian countries including Malaysia, Vietnam, Thailand, and Cambodia. \nIn August 2023, the DOC issued a final decision regarding an AD/CVD petition filed by a California-based company alleging that Chinese manufacturers were shifting products to the four southeast Asian countries to avoid tariffs required on products imported from China and requesting that the DOC conduct a country-wide inquiry into each country. In its final decision, the DOC determined that circumvention was occurring in each of the four Southeast Asian countries noted above. Duties began to be applied to certain imports of solar cells from Malaysia, Vietnam, Thailand and Cambodia after expiration of the 24-month tariff moratorium on June 6, 2024. In addition, in response to its findings, the DOC promulgated new regulations that imposed enhanced duties in certain circumstances, including when the USITC determines there is a reasonable indication the domestic solar industry is materially or potentially injured because of imported products that violate certain fair trade laws.\n2024 Form 10-K\n87\nWEC Energy Group, Inc.\nTable of \nContents\nIn April 2024, a coalition of several U.S. producers of solar panels filed a petition with the DOC requesting new tariffs on imports from the same four Southeast Asian countries. The group alleged that some Chinese companies had moved their solar operations to avoid penalties implemented after the expiration of the moratorium. In May 2024, in response to the petition, the DOC initiated a new AD/CVD investigation of solar panels from the four southeast Asian countries. \nIn April 2024, the USITC began a preliminary investigation and, in June 2024, issued a preliminary determination that there is a reasonable indication imports of solar panels from the four Southeast Asian countries have caused injury to the U.S. solar industry. Based on the USITC’s preliminary decision, the DOC began an investigation and, in October and November 2024, announced preliminary affirmative determinations in its CVD and AD investigations, respectively, and set preliminary duties on imports from the four southeast Asian countries. The DOC and USITC are expected to make final determinations in the second quarter of 2025, which could result in enhanced duties, including retroactive duties in certain circumstances.\n \nThe Biden Administration invoked the Defense Production Act to accelerate the production of solar panels in the U.S.; however, final determinations by the DOC and/or USITC may have an adverse impact on the solar industry overall. Additionally, there is uncertainty with respect to how WROs applied to panels under previous complaints would be affected.\nAs a result of these investigations, the solar industry overall has experienced higher costs of materials as well as delays. Some of these impacts have already been reflected in the estimated cost and in-service dates for certain of our solar projects. We are continuing to assess the potential impact from the preliminary determinations on our business and results of operations.\nInfrastructure Investment and Jobs Act and Inflation Reduction Act\nIn November 2021, former President Biden signed into law the Infrastructure Investment and Jobs Act, which provides for approximately $1.2 trillion of federal spending over a five year period, including approximately $85 billion for investments in power, utilities, and renewables infrastructure across the United States. We believe that funding from this Act would support the work we are doing to reduce GHG emissions, increase EV charging, and strengthen and protect the energy grid. Funding in the Act could also help to expand emerging technologies, like hydrogen and carbon management, as we continue the transition to a clean energy future to the benefit of our customers, the communities we serve, and our company.\nIn August 2022, former President Biden signed into law the IRA, which provides for $258 billion in energy-related provisions over a 10-year period. The provisions of the IRA are intended to, among other things, lower gasoline and electricity prices, incentivize domestic clean energy investment, manufacturing, and production, and promote reductions in carbon emissions. We believe that we and our customers can benefit from the IRA’s provisions that extend tax benefits for renewable technologies, increase or restore higher rates for PTCs, add an option to claim PTCs for solar projects, expand qualified ITC facilities to include standalone energy storage, and its provision to allow companies to transfer tax credits generated from renewable projects. \nUnder the IRA transferability option, we entered into an agreement in 2024 to sell substantially all of our 2024 PTCs to a third party. Additionally, in October 2024, we entered into an agreement to sell the majority of our 2025 PTCs to a third party. See Note 1(q), Income Taxes, for more information about the impact of these sales during 2024. The IRA also implements a 15% corporate alternative minimum tax and a 1% excise tax on stock repurchases. Although significant regulatory guidance is expected on the tax provisions in the IRA, we currently believe the provisions on alternative minimum tax and stock repurchases will not have a material impact on us. Overall, we believe the IRA will help reduce our cost of investing in projects that will support our commitment to reduce emissions and provide customers affordable, reliable, and clean energy over the longer term.\nIn January 2025, pursuant to an executive order issued by the new presidential administration, disbursement of funds under these two Acts was paused until agency heads can determine whether grants, loans contracts, and other disbursements are consistent with the new administration's energy policy. Agency heads must consult with the Office of Management and Budget and the National Economic Council prior to any funding being disbursed. The new policy encourages use of domestic energy sources including oil, natural gas, coal, hydropower, biofuels, critical minerals, and nuclear, promotes consumer choice of goods and appliances, aims to boost American workers and businesses, eliminates the EV mandate, and limits regulations that apply to the energy industry. The executive order did not impact the IRA's provisions for tax credits and the transferability option.\n2024 Form 10-K\n88\nWEC Energy Group, Inc.\nTable of \nContents\nReturn on Equity Incentive for Membership in a Transmission Organization\nThe FERC currently allows transmission utilities, including ATC, to increase their ROE by 50 basis points as an incentive for membership in a transmission organization, such as MISO. This incentive was established to stimulate infrastructure development and to support the evolving electric grid. However, a Notice of Proposed Rulemaking was issued by the FERC on April 15, 2021, proposing to limit the 50 basis point increase in ROE to only be available to transmission utilities initially joining a transmission organization for the first three years of membership. If this proposal becomes a final rule, ATC would be required to submit, within 30 days of the final rule's effective date, a compliance filing eliminating the 50 basis point incentive from its tariff. As a result, we estimate that this proposal, if adopted, would reduce our future after-tax equity earnings from ATC by approximately $7 million annually on a prospective basis. The transmission costs WE, WPS, and UMERC are required to pay ATC after the effective date would also be reduced by this proposal.\nAmerican Transmission Company Allowed Return on Equity Complaints\nThe ROE allowed by the FERC helps determine how much transmission owners, such as ATC, earn on their transmission assets as well as how much consumers pay for those assets. When two complaints were filed arguing the base ROE for MISO transmission owners, including ATC, was too high, the FERC started analyzing the base ROE for these transmission owners. The first of these complaints is discussed below. For information on the second complaint, see Factors Affecting Results, Liquidity, and Capital Resources – Regulatory, Legislative, and Legal Matters – American Transmission Company Allowed Return on Equity Complaints in our 2023 Annual Report on Form 10-K \nThe base ROEs listed in the ROE complaint section below do not include the 50 basis point ROE incentive currently provided for membership in a transmission organization. See the Return on Equity Incentive for Membership in a Transmission Organization section above for more information on this incentive.\nReturn on Equity Complaint\nIn November 2013, a group of MISO industrial customers filed a complaint with the FERC asking that the FERC order a reduction to the base ROE used by MISO transmission owners, including ATC, from 12.2% to 9.15%. Due to this complaint, the FERC and the D.C. Circuit Court of Appeals issued the following orders and opinion. The refunds resulting from these orders and opinion are also described below.\n•\nSeptember 2016 FERC Order – On September 28, 2016, the FERC issued an order reducing the base ROE for MISO transmission owners to 10.32% for the period covered by this complaint, November 12, 2013 through February 11, 2015 and September 28, 2016 going forward.\n•\nNovember 2019 FERC Order – On November 21, 2019, the FERC issued another order after directing MISO transmission owners and other stakeholders to provide briefs and comments on a proposed change to the methodology for calculating base ROE. In this order, the FERC expanded its base ROE methodology to include the capital-asset pricing model in addition to the discounted cash flow model to better reflect how investors make their investment decisions. The FERC also rejected the use of the risk premium model as part of its base ROE methodology in this order. The FERC's modified methodology further reduced the base ROE for all MISO transmission owners, including ATC, to 9.88% for the period covered by the complaint. In response to this FERC decision, requests for the FERC to rehear the November 2019 Order in its entirety were filed by various parties.\n•\nMay 2020 FERC Order – On May 21, 2020, the FERC issued an order that granted in part and denied in part the requests to rehear the November 2019 Order. In this May 2020 Order, the FERC made additional revisions to its base ROE methodology, including reinstating the use of the risk premium model. The additional revisions made by the FERC increased the base ROE for all MISO transmission owners, including ATC, from the 9.88% authorized in the November 2019 Order to 10.02% for the period covered by the complaint. Various parties then filed requests to rehear certain parts of the May 2020 Order with the FERC.\n•\nNovember 2020 FERC Order – In response to the rehearing requests filed concerning certain parts of the May 2020 Order, the FERC issued an order in November 2020 that confirmed the ROE previously authorized in its May 2020 Order.\n•\nRefunds for FERC Orders Issued Prior to October 2024 – Due to the base ROE changes resulting from the FERC orders issued prior to October 2024, ATC was required to provide refunds, with interest, for the 15-month refund period from November 12, 2013 through February 11, 2015 and for the period from September 28, 2016 through November 19, 2020. In January 2022, ATC \n2024 Form 10-K\n89\nWEC Energy Group, Inc.\nTable of \nContents\ncompleted providing WE, WPS, and UMERC with the net refunds related to the transmission costs they paid during these periods. The refunds were applied to WE's and WPS's PSCW-approved escrow accounting for transmission expense.\n•\nAugust 2022 D.C. Circuit Court of Appeals Opinion – Since several petitions for review were filed with the D.C. Circuit Court of Appeals concerning this ROE complaint, the D.C. Circuit Court of Appeals issued an opinion on August 9, 2022, addressing these petitions. In its August 2022 Opinion, the D.C. Circuit Court of Appeals ruled the FERC failed to adequately explain why it reinstated the use of the risk premium model as part of its ROE methodology in its May 2020 Order after previously rejecting the model in its November 2019 Order. Due to this ruling, the D.C. Circuit Court of Appeals vacated the FERC’s previous orders and remanded the issue of determining an appropriate base ROE for MISO transmission owners back to the FERC for additional proceedings. As a result, ATC recorded a reserve for potential refunds based on a 9.88% base ROE. \n•\nOctober 2024 FERC Order – In response to the August 2022 D.C. Circuit Court of Appeals Opinion, the FERC issued an order on October 17, 2024. The FERC’s October 2024 Order removed the risk premium model from the base ROE methodology and required MISO transmission owners, including ATC, to adopt a 9.98% base ROE for the period covered by the complaint.\n•\nRefunds for FERC Order Issued in October 2024 – Prior to the October 2024 FERC order, the base ROE for MISO transmission owners was 10.02% based on the November 2020 FERC order. Since the October 2024 FERC order changed the base ROE to 9.98%, ATC will be providing additional refunds, with interest, for the 15-month refund period from November 12, 2013 through February 11, 2015 and for the period from September 28, 2016 through October 17, 2024. Therefore, ATC is expected to provide WE, WPS, and UMERC with refunds related to the transmission costs they paid during these two refund periods. The refunds will be applied to WE’s and WPS’s PSCW-approved escrow accounting for transmission expense. \nDue to the change between the 9.88% base ROE originally reflected in ATC's reserve and the 9.98% base ROE authorized in the October 2024 FERC Order, ATC reduced its refund liability, which increased our pre-tax equity earnings by $20.1 million during the fourth quarter of 2024. \nEnvironmental Matters\nSee Note 24, Commitments and Contingencies, for a discussion of certain environmental matters affecting us, including rules and regulations relating to air quality, water quality, and land quality. \nMarket Risks and Other Significant Risks\nWe are exposed to market and other significant risks as a result of the nature of our businesses and the environments in which those businesses operate. These include, but are not limited to, the risks described below. In addition, there is continuing uncertainty over the impact that the ongoing regional and international conflicts, including those in Ukraine, Israel and in other parts of the Middle East, will have on the global economy, supply chains, and fuel prices.\nCommodity Costs\nIn the normal course of providing energy, we are subject to market fluctuations in the costs of coal, natural gas, purchased power, and fuel oil used in the delivery of coal. We manage our fuel and natural gas supply costs through a portfolio of short and long-term procurement contracts with various suppliers for the purchase of coal, natural gas, and fuel oil. In addition, we manage the risk of price volatility through natural gas and electric hedging programs.\nEmbedded within our utilities' rates are amounts to recover fuel, natural gas, and purchased power costs. Our utilities have recovery mechanisms in place that generally allow them to recover or refund all or a portion of the changes in prudently incurred fuel, natural gas, and purchased power costs from rate case-approved amounts. See Item 1. Business – E. Regulation for more information on these mechanisms.\nHigher commodity costs can increase our working capital requirements, result in higher gross receipts taxes, and lead to increased energy efficiency investments by our customers to reduce utility usage and/or fuel substitution. Higher commodity costs combined with slower economic conditions also expose us to greater risks of accounts receivable write-offs as more customers are unable to pay their bills. See Note 5, Credit Losses, for more information on riders and other mechanisms that allow for cost recovery or refund of uncollectible expense.\n2024 Form 10-K\n90\nWEC Energy Group, Inc.\nTable of \nContents\nWeather\nOur utilities' rates are based upon estimated normal temperatures. Our electric utility margins are unfavorably sensitive to below normal temperatures during the summer cooling season and, to some extent, to above normal temperatures during the winter heating season. Our natural gas utility margins are unfavorably sensitive to above normal temperatures during the winter heating season. PGL, NSG, and MERC have decoupling mechanisms in place that help reduce the impacts of weather. Decoupling mechanisms differ by state and allow utilities to recover or refund certain differences between actual and authorized margins. A summary of actual weather information in our utilities' service territories during 2024, 2023, and 2022, as measured by degree days, can be found in Results of Operations. \nOur utility operations (primarily our electric utility operations) and the operations of WECI, can be negatively impacted from storms. High wind conditions, lightning, hail, and flooding from these storms can result in downed wires and poles, as well as damage to wind and solar generation facilities and other operating equipment. This can result in us incurring significant restoration costs at our utilities and at WECI, including lost revenue to customers. Our utilities' rates include a fixed amount for expected storm restoration costs. To the extent actual storm restoration costs are above what is included in these rates, earnings at our utility operations are negatively impacted and it becomes more difficult to achieve our authorized ROEs. Similarly, restoration costs and lost revenue from storms negatively impacts operations and earnings at our non-utility WECI renewable generation facilities.\nInterest Rates\nWe are exposed to interest rate risk resulting from our short-term and long-term borrowings and projected near-term debt financing needs. We manage exposure to interest rate risk by limiting the amount of our variable rate obligations and continually monitoring the effects of market changes on interest rates. When it is advantageous to do so, we enter into long-term fixed rate debt. We may also enter into derivative financial instruments, such as swaps, to mitigate interest rate exposure.\nBased on the variable rate debt outstanding at December 31, 2024 and 2023, a hypothetical increase in market interest rates of one percentage point would have increased annual interest expense by $11.2 million and $25.2 million in 2024 and 2023, respectively. This sensitivity analysis was performed assuming a constant level of variable rate debt during the period and an immediate increase in interest rates, with no other changes for the remainder of the period.\nMarketable Securities Return\nWe use various trusts to fund our pension and OPEB obligations. These trusts invest in debt and equity securities. Changes in the market prices of these assets can affect future pension and OPEB expenses. Additionally, future contributions can also be affected by the investment returns on trust fund assets. The financial risks associated with investment returns are mitigated at our Wisconsin utilities through the requirement that WE, WPS, and WG implement escrow accounting treatment for pension and OPEB costs in 2023 through 2026, as required by the December 2022 and December 2024 rate orders issued by the PSCW. As a result, our Wisconsin utilities defer as a regulatory asset or liability, the difference between actual pension and OPEB costs and those included in rates until recovery or refund is authorized in a future rate proceeding. We also believe that the financial risks associated with investment returns would be partially mitigated at our other utilities through future rate actions by regulators. \nThe fair value of our trust fund assets and expected long-term returns were approximately: \n(in millions)\nAs of December 31, 2024\nExpected Return on Assets in 2025\nPension trust funds\n$\n2,624.3\n \n6.61 \n%\nOPEB trust funds\n$\n850.0\n \n6.50 \n%\nFiduciary oversight of the pension and OPEB trust fund investments is the responsibility of an Investment Trust Policy Committee. The Committee works with external actuaries and investment consultants on an ongoing basis to establish and monitor investment strategies and target asset allocations. Forecasted cash flows for plan liabilities are regularly updated based on annual valuation results. Target asset allocations are determined utilizing projected benefit payment cash flows and risk analyses of appropriate investments. The targeted asset allocations are intended to reduce risk, provide long-term financial stability for the plans, and maintain funded levels which meet long-term plan obligations while preserving sufficient liquidity for near-term benefit payments. Investment strategies utilize a wide diversification of asset types and qualified external investment managers.\n2024 Form 10-K\n91\nWEC Energy Group, Inc.\nTable of \nContents\nWe consult with our investment advisors on an annual basis to help us forecast expected long-term returns on plan assets by reviewing actual historical returns and calculating expected total trust returns using the weighted-average of long-term market returns for each of the major target asset categories utilized in the funds.\nEconomic Conditions\nWe have electric and natural gas utility operations that serve customers in Wisconsin, Illinois, Minnesota, and Michigan. As such, we are exposed to market risks in the regional Midwest economy. In addition, any economic downturn or disruption of national or international markets could adversely affect the financial condition of our customers and demand for their products, which could affect their demand for our products.\nInflation and Supply Chain Disruptions\nWe continue to monitor the impact of inflation and supply chain disruptions. We monitor the costs of medical plans, fuel, transmission access, construction costs, regulatory and environmental compliance costs, and other costs in order to minimize inflationary effects in future years, to the extent possible, through pricing strategies, productivity improvements, and cost reductions. We monitor the global supply chain, and related disruptions, in order to ensure we are able to procure the materials and other resources necessary to both maintain our energy services in a safe and reliable manner and to grow our infrastructure in accordance with our capital plan. For additional information concerning risks related to inflation and supply chain disruptions, see the four risk factors below.\n•\nItem 1A. Risk Factors – Risks Related to the Operation of Our Business – Public health crises, including epidemics and pandemics, could adversely affect our business functions, financial condition, liquidity, and results of operations.\n•\nItem 1A. Risk Factors – Risks Related to the Operation of Our Business – Our operations and corporate strategy may be adversely affected by supply chain disruptions and inflation.\n•\nItem 1A. Risk Factors – Risks Related to the Operation of Our Business – We are actively involved with multiple significant capital projects, which are subject to a number of risks and uncertainties that could adversely affect project costs and completion of construction projects.\n•\nItem 1A. Risk Factors – Risks Related to Economic and Market Volatility – The fluctuation in demand for certain commodities and their respective prices could negatively impact our operations.\nFor additional information concerning other risk factors, including market risks, see the Cautionary Statement Regarding Forward-Looking Information at the beginning of this report and Item 1A. Risk Factors.\nCritical Accounting Policies and Estimates\nThe preparation of financial statements in compliance with GAAP requires the application of accounting policies, as well as the use of estimates, assumptions, and judgments that could have a material impact on our financial statements and related disclosures. Judgments regarding future events may include the likelihood of success of particular projects, legal and regulatory challenges, and anticipated recovery of costs. Actual results may differ significantly from estimated amounts based on varying assumptions.\nOur significant accounting policies are described in Note 1, Summary of Significant Accounting Policies. The following is a list of accounting policies and estimates that require management's most difficult, subjective, or complex judgments and may change in subsequent periods. \nRegulatory Accounting\nOur utility operations follow the guidance under the Regulated Operations Topic of the FASB ASC (Topic 980). Our financial statements reflect the effects of the ratemaking principles followed by the various jurisdictions regulating us. Certain items that would otherwise be immediately recognized as revenues and expenses are deferred as regulatory assets and regulatory liabilities for future recovery or refund to customers, as authorized by our regulators.\n2024 Form 10-K\n92\nWEC Energy Group, Inc.\nTable of \nContents\nFuture recovery of regulatory assets, including the timeliness of recovery and our ability to earn a reasonable return, is not assured and is generally subject to review by regulators in rate proceedings for matters such as prudence and reasonableness. Once approved, the regulatory assets and liabilities are amortized into earnings over the rate recovery or refund period. If recovery or refund of costs is not approved or is no longer considered probable, these regulatory assets or liabilities are recognized in current period earnings. Management regularly assesses whether these regulatory assets and liabilities are probable of future recovery or refund by considering factors such as changes in the regulatory environment, earnings from our electric and natural gas utility operations, rate orders issued by our regulators, historical decisions by our regulators regarding regulatory assets and liabilities, and the status of any pending or potential deregulation legislation.\nThe application of the Regulated Operations Topic of the FASB ASC would be discontinued if all or a separable portion of our utility operations no longer met the criteria for application. Our regulatory assets and liabilities would be written off to income as an unusual or infrequently occurring item in the period in which discontinuation occurred. See Note 6, Regulatory Assets and Liabilities, for more information on our regulatory assets and liabilities.\nGoodwill\nWe completed our annual goodwill impairment tests for all of our reporting units that carried a goodwill balance as of July 1, 2024. No impairments were recorded as a result of these tests. For all of our reporting units, the fair values calculated in step one of the test were greater than their carrying values. The fair values for the reporting units were calculated using a combination of the income approach and the market approach.\nFor the income approach, we used internal forecasts to project cash flows. Any forecast contains a degree of uncertainty, and changes in these cash flows could significantly increase or decrease the calculated fair value of a reporting unit. For our reporting units that are regulated, a fair recovery of and return on costs prudently incurred to serve customers is assumed. An unfavorable outcome in a rate case could cause the fair values of our reporting units to decrease.\nKey assumptions used in the income approach include ROEs, the long-term growth rates used to determine terminal values at the end of the discrete forecast period, and the discount rates. The discount rate is applied to estimated future cash flows and is one of the most significant assumptions used to determine fair value under the income approach. As interest rates rise, the calculated fair values will decrease. The discount rate is based on the weighted-average cost of capital for each reporting unit, taking into account both the after-tax cost of debt and cost of equity. The terminal year ROE for each utility is driven by its current allowed ROE. The terminal growth rate is based primarily on a combination of historical and forecasted statistics for real gross domestic product and personal income for each utility service area. \nFor the market approach, we used a higher weighting for the guideline public company method than the guideline merged and acquired company method due to a low number of mergers and acquisitions in recent years. The guideline public company method uses financial metrics from similar publicly traded companies to determine fair value. The guideline merged and acquired company method calculates fair value by analyzing the actual prices paid for recent mergers and acquisitions in the industry. We applied multiples derived from these two methods to the appropriate operating metrics for our reporting units to determine fair value.\nThe underlying assumptions and estimates used in the impairment tests were made as of a point in time. Subsequent changes in these assumptions and estimates could change the results of the tests.\nFor all of our reporting units that carried a goodwill balance at July 1, 2024, the fair value exceeded its carrying value by over 50%. Based on these results, our reporting units are not at risk of failing step one of the goodwill impairment test.\nSee Note 10, Goodwill and Intangibles, for more information.\nLong-Lived Assets\nIn accordance with ASC 980-360, Regulated Operations – Property, Plant, and Equipment, we periodically assess the recoverability of certain long-lived assets when events or changes in circumstances indicate that the carrying amount of those long-lived assets may not be recoverable. Examples of events or changes in circumstances include, but are not limited to, a significant decrease in the market price, a significant change in use, a regulatory decision related to recovery of assets from customers, adverse legal factors or a change in business climate, operating or cash flow losses, or an expectation that the asset might be sold or abandoned. See Note 1(k), Asset Impairment, for our policy on accounting for abandonments and recently completed plant subject to disallowance.\n2024 Form 10-K\n93\nWEC Energy Group, Inc.\nTable of \nContents\nPerforming an impairment evaluation involves a significant degree of estimation and judgment by management in areas such as identifying circumstances that indicate an impairment may exist, identifying and grouping affected assets, and developing the undiscounted future cash flows. An impairment loss is measured as the excess of the carrying amount of the asset in comparison to the fair value of the asset. The fair value of the asset is assessed using various methods, including recent comparable third-party sales for our nonregulated operations, internally developed discounted cash flow analysis, expected recovery of regulated assets, and analysis from outside advisors. \nSee Note 7, Property, Plant, and Equipment, for more information on our generating units probable of being retired. See Note 6, Regulatory Assets and Liabilities, and Note 26, Regulatory Environment, for more information on our retired generating units, including various approvals we received from the FERC and the PSCW.\nPension and Other Postretirement Employee Benefits \nThe costs of providing non-contributory defined pension benefits and OPEB, described in Note 20, Employee Benefits, are dependent upon numerous factors resulting from actual plan experience and assumptions of future experience.\nPension and OPEB costs are impacted by actual employee demographics (including age, compensation levels, and employment periods), the level of contributions made to the plans, and earnings on plan assets. Pension and OPEB costs may also be significantly affected by changes in key actuarial assumptions, including anticipated rates of return on plan assets, mortality and discount rates, and expected health care cost trends. Changes made to the plan provisions may also impact current and future pension and OPEB costs.\nPension and OPEB plan assets are primarily made up of equity and fixed income investments. Fluctuations in actual equity and fixed income market returns, as well as changes in general interest rates, may result in increased or decreased benefit costs in future periods. Changes in benefit costs are mitigated at our Wisconsin utilities through the requirement that WE, WPS, and WG implement escrow accounting treatment for pension and OPEB costs in 2023 and 2024, as required by the December 2022 rate orders issued by the PSCW. See Note 26, Regulatory Environment, for more information on 2023 and 2024 rates at our Wisconsin utilities. We believe that changes to benefit costs at our other utilities would be recovered or refunded through the ratemaking process. \nThe following table shows how a given change in certain actuarial assumptions would impact the projected benefit obligation and the reported net periodic pension cost (including amounts capitalized to our balance sheets). Each factor below reflects an evaluation of the change based on a change in that assumption only.\nActuarial Assumption\n(in millions, except percentages)\nPercentage-Point Change in Assumption\nImpact on Projected Benefit Obligation\nImpact on 2024\nPension Cost\nDiscount rate\n(0.5)\n$\n100.7 \n$\n5.1 \nDiscount rate\n0.5\n(93.5)\n(5.2)\nRate of return on plan assets\n(0.5)\nN/A\n13.7 \nRate of return on plan assets\n0.5\nN/A\n(13.7)\nThe following table shows how a given change in certain actuarial assumptions would impact the accumulated OPEB obligation and the reported net periodic OPEB cost (including amounts capitalized to our balance sheets). Each factor below reflects an evaluation of the change based on a change in that assumption only.\nActuarial Assumption\n(in millions, except percentages)\nPercentage-Point Change in Assumption\nImpact on Postretirement\nBenefit Obligation\nImpact on 2024 Postretirement\nBenefit Cost\nDiscount rate\n(0.5)\n$\n22.8 \n$\n1.9 \nDiscount rate\n0.5\n(21.3)\n(2.4)\nHealth care cost trend rate\n(0.5)\n(13.6)\n(3.2)\nHealth care cost trend rate\n0.5\n15.3 \n2.9 \nRate of return on plan assets\n(0.5)\nN/A\n4.1 \nRate of return on plan assets\n0.5\nN/A\n(4.1)\n2024 Form 10-K\n94\nWEC Energy Group, Inc.\nTable of \nContents\nThe discount rates are selected based on hypothetical bond portfolios consisting of noncallable, high-quality corporate bonds across the full maturity spectrum. From the hypothetical bond portfolios, a single rate is determined that equates the market value of the bonds purchased to the discounted value of the plans' expected future benefit payments.\nWe establish our expected return on assets based on consideration of historical and projected asset class returns, as well as the target allocations of the benefit trust portfolios. The assumed long-term rate of return on pension plan assets was 6.61%, 6.62%, and 6.88%, in 2024, 2023 and 2022, respectively. The actual rate of return on pension plan assets, net of fees, was 4.75%, 9.23%, and (14.03)%, in 2024, 2023, and 2022, respectively.\nIn selecting assumed health care cost trend rates, past performance and forecasts of health care costs are considered. For more information on health care cost trend rates and a table showing future payments that we expect to make for our pension and OPEB, see Note 20, Employee Benefits.\nUnbilled Revenues\nWe record utility operating revenues when energy is delivered to our customers. However, the determination of energy sales to individual customers is based upon the reading of their meters, which occurs on a systematic basis throughout the month. At the end of each month, amounts of energy delivered to customers since the date of their last meter reading are estimated and corresponding unbilled revenues are calculated. \nUnbilled revenues are estimated each month based upon actual generation and throughput volumes, recorded sales, estimated customer usage by class, weather factors, estimated line losses, and applicable customer rates. Energy demand for the unbilled period or changes in rate mix due to fluctuations in usage patterns of customer classes could impact the accuracy of the unbilled revenue estimate. Total unbilled utility revenues were $567.2 million and $473.9 million as of December 31, 2024 and 2023, respectively. The changes in unbilled revenues are primarily due to changes in the cost of natural gas, weather, and customer rates.\nIncome Tax Expense\nSignificant management judgment is required in determining our provision for income taxes, deferred income tax assets and liabilities, the liability for unrecognized tax benefits, and any valuation allowance recorded against deferred income tax assets. The assumptions involved are supported by historical data, reasonable projections, and interpretations of applicable tax laws and regulations across multiple taxing jurisdictions. Significant changes in these assumptions could have a material impact on our financial condition and results of operations. See Note 1(q), Income Taxes, and Note 16, Income Taxes, for a discussion of accounting for income taxes.\nWe are required to estimate income taxes for each of our applicable tax jurisdictions as part of the process of preparing consolidated financial statements. This process involves estimating current income tax liabilities together with assessing temporary differences resulting from differing treatment of items, such as depreciation, for income tax and accounting purposes. These differences result in deferred income tax assets and liabilities, which are included within our balance sheets. We also assess the likelihood that our deferred income tax assets will be recovered through future taxable income. To the extent we believe that realization is not likely, we establish a valuation allowance, which is offset by an adjustment to income tax expense in our income statements.\nUncertainty associated with the application of tax statutes and regulations, the outcomes of tax audits and appeals, changes in income tax law, enacted tax rates or amounts subject to income tax, and changes in the regulatory treatment of any tax reform benefits requires that judgments and estimates be made in the accrual process and in the calculation of effective tax rates. Only income tax benefits that meet the \"more likely than not\" recognition threshold may be recognized or continue to be recognized. Unrecognized tax benefits are re-evaluated quarterly and changes are recorded based on new information, including the issuance of relevant guidance by the courts or tax authorities and developments occurring in the examinations of our tax returns.\nWe expect our 2025 annual effective tax rate to be between 6.5% and 7.5%. Our effective tax rate calculations are revised every quarter based on the best available year-end tax assumptions, adjusted in the following year after returns are filed. Tax accrual estimates are trued-up to the actual amounts claimed on the tax returns and further adjusted after examinations by taxing authorities, as needed.\n2024 Form 10-K\n95\nWEC Energy Group, Inc.\nTable of \nContents",
  "item2": null
}