{
  "item1": "Included within Corporate Other businesses’ closed sites (i) six third-party power generating facilities converting landfill gas fuel electricity generators; (ii) two third-party projects delivering landfill gas pipeline industrial customers direct substitute fossil fuels industrial processes (iii) two third-party RNG facilities processing landfill gas sold natural gas suppliers return royalty. Additionally, Corporate Other benefits 15% royalty WM Renewable Energy segment based net operating revenue generated through sale RNG, RINs, electricity capacity, RECs related environmental attributes 15 landfill beneficial use renewable energy projects owned WM Renewable Energy closed sites, which eliminated consolidation. continue invest businesses technologies designed offer services solutions ancillary supplementary current operations. While most these investments form minority equity stakes, they can also include joint ventures, joint development agreements majority equity stakes.",
  "item7": "Key elements 2024 financial results include: Revenues $22,063 million 2024 compared $20,426 million 2023, increase $1,637 million, 8.0%. increase primarily attributable (i) higher yield Collection Disposal businesses; (ii) acquisitions, net divestitures; (iii) increases commodity prices Recycling Sales WM Renewable Energy segments (iv) increased volumes. These increases partially offset decrease revenue energy surcharge program result decline price fuel, particularly diesel; Operating expenses $13,383 million 2024, 60.7% revenues, compared $12,606 million, 61.7% revenues, 2023. percentage revenue, operating expenses improved significantly compared prior year revenue growth price, efficiency gains, improved employee retention momentum truck deliveries offset impacts inflationary increases wages other expenses.",
  "item2": "impact WM Renewable Energy segment first nine months 2025, may experience more significant impacts fluctuations prices renewable identification numbers (“RINs”) natural gas future. n economic conditions, including inflation, interest rates, employment trends supply chain reliability, can create risk uncertainty financial outlook. take proactive steps recover mitigate inflationary cost pressures through overall pricing efforts managing costs through efficiency, labor productivity investments technology automate certain aspects business. remain committed putting people first ensure they well positioned execute daily operations diligently safely."
}