{
  "source_file": "wm-20241231x10k.htm",
  "form_type": "10-K",
  "item1": "Item 1. \nBusiness.\nGeneral\nWaste Management, Inc. is a holding company and all operations are conducted by its subsidiaries. When the terms “the Company,” “we,” “us” or “our” are used in this document, those terms refer to Waste Management, Inc., together with its consolidated subsidiaries and consolidated variable interest entities. When we use the term “WMI,” we are referring only to Waste Management, Inc., the parent holding company.\nWMI was incorporated in Oklahoma in 1987 under the name “USA Waste Services, Inc.” and was reincorporated as a Delaware company in 1995. In a 1998 merger, the Illinois-based waste services company formerly known as Waste Management, Inc. became a wholly-owned subsidiary of WMI and changed its name to Waste Management Holdings, Inc. (“WM Holdings”). At the same time, our parent holding company changed its name from USA Waste Services to Waste Management, Inc. Like WMI, WM Holdings is a holding company and all operations are conducted by subsidiaries.\nOur principal executive offices are located at 800 Capitol Street, Suite 3000, Houston, Texas 77002. Our telephone number is (713) 512-6200. Our website address is www.wm.com. Our annual reports on Form 10-K, quarterly reports on Form 10-Q and current reports on Form 8-K are all available, free of charge, on our website as soon as practicable after we file the reports with the SEC. Our stock is traded on the New York Stock Exchange under the symbol “WM.”\nWe are North America’s leading provider of comprehensive environmental solutions, providing services throughout the United States (“U.S.”) and Canada. We partner with our customers and the communities we serve to manage and reduce waste at each stage from collection to disposal, while recovering valuable resources and creating clean, renewable energy. Our solid waste business is operated and managed locally by our subsidiaries that focus on distinct geographic areas and provide collection, transfer, disposal, recycling and resource recovery services. Through our subsidiaries, including our Waste Management Renewable Energy (“WM Renewable Energy”) segment, we are also a leading developer, operator and owner of landfill gas-to-energy facilities in the U.S. and Canada that produce renewable electricity and renewable natural gas, which is a significant source of fuel that we allocate to our natural gas fleet. During 2024, our largest customer represented less than 5% of annual revenues. \nOn November 4, 2024, we completed our acquisition of all outstanding shares of Stericycle, Inc. (“Stericycle”), \nthe operations of which are presented in this report as our new WM Healthcare Solutions segment.\n \nThe acquisition expands our offerings in the U.S. and Canada and adds operations in parts of Western Europe. These businesses provide Regulated Waste and Compliance Services (“RWCS”) and Secure Information Destruction (“SID”) services that protect people and brands, promote health and well-being and safeguard the environment. Stericycle operates out of approximately 361 leased and owned facilities worldwide with 69 autoclaves or alternative medical waste treatment facilities, 18 medical waste incinerator facilities, 107 SID processing facilities, and 167 transfer stations. Included within our WM Healthcare Solutions segment are 35 locations that are classified as held for sale as of December 31, 2024. \nThe acquisition is discussed further in Note 17 to the Consolidated Financial Statements.\nWe own or operate 262 landfill sites, which is the largest network of landfills throughout the U.S. and Canada. In order to make disposal more practical for larger urban markets, where the distance to landfills is typically farther, we manage 339 transfer stations, excluding those acquired from Stericycle, that consolidate, compact and transport waste efficiently and economically. We also use waste to create energy, recovering the gas produced naturally as waste decomposes in landfills and using the gas in generators to make electricity. We are a leading recycler in the U.S. and Canada, handling materials that include cardboard, paper, glass, plastic and metal. We provide cost-efficient, environmentally sound recycling programs for municipalities, businesses and households across the U.S. and Canada as well as other services that supplement our solid waste business.\nOur fundamental strategy has not changed; we remain dedicated to providing long-term value to our stockholders by successfully executing our core strategy of focused differentiation and continuous improvement. We have enabled a people-first, technology-led focus to drive our mission to maximize resource value, while minimizing environmental \n6\n\n\nTable of Contents\nimpact, and sustainability and environmental stewardship is embedded in all that we do. Our strategy leverages and sustains the strongest asset network in the industry to drive best-in-class customer experience and growth. Our strategic planning processes appropriately consider that the future of our business and the industry can be influenced by changes in economic conditions, the competitive landscape, the regulatory environment, asset and resource availability and technology. We believe that focused differentiation, which is driven by capitalizing on our unique and extensive network of assets, will deliver profitable growth and position us to leverage competitive advantages. Simultaneously, we believe that investing in automation to improve processes and drive operational efficiency combined with a focus on the cost to serve our customers will yield an attractive profit margin and enhanced service quality. We are furthering our strategy of focused differentiation and continuous improvement beyond our traditional waste operations through our sustainability growth strategy that includes significant planned investments in our WM Renewable Energy and Recycling Processing and Sales segments, while increasing automation and reducing labor dependency. In addition, with our acquisition of Stericycle, we have advanced our growth strategy and built upon our sustainability initiatives. The acquisition provides a complementary business platform in medical waste, a sector with attractive near- and long-term growth dynamics, and in secure information destruction services to further our leading suite of comprehensive waste and environmental solutions. Furthermore, we are also evaluating and pursuing emerging diversion technologies that may generate additional value.\nOur Company’s goals are targeted at putting our people first, positioning them to serve and care for our customers, the environment, the communities in which we work and our stockholders. Our brand promise is ALWAYS WORKING FOR A SUSTAINABLE TOMORROW\n®\n. We live this promise through our service offerings and sustainable solutions, our investments in innovation, our people and our commitment to the future. Through our longtime focus on finding sustainable solutions, we continue to evolve beyond being a traditional environmental waste services company. Increasingly, our industry-leading focus on environmental sustainability aligns with demand from our customers who want more of their waste materials recovered. Waste streams are becoming more complex, and our aim is to address current needs, while anticipating the expanding and evolving needs of our customers. We believe we are uniquely equipped to meet the challenges of the changing waste industry and our customers’ waste management needs, both today and tomorrow as we work together to envision and create a more sustainable future. \nWe believe that execution of our strategy will deliver shareholder value and leadership in a dynamic industry and in any economic environment. In addition, we intend to continue to return value to our stockholders through dividend payments and expect to resume share repurchases once the Company’s leverage returns to targeted levels, which is currently projected to be about 18 months after the November 2024 acquisition of Stericycle. In December 2024, we announced that our Board of Directors expects to increase the quarterly dividend from $0.75 to $0.825 per share for dividends declared in 2025, which is a 10% increase from the quarterly dividends we declared in 2024. This is an indication of our ability to generate strong and consistent cash flows and marks the 22nd consecutive year of dividend increases. All quarterly dividends will be declared at the discretion of our Board of Directors and depend on various factors, including our net earnings, financial condition, cash required for future business plans, growth and acquisitions and other factors the Board of Directors may deem relevant.\nOperations\nGeneral\nOur senior management evaluates, oversees and manages the financial performance of our business through five reportable segments, referred to as (i) Collection and Disposal - East Tier (“East Tier”); (ii) Collection and Disposal - West Tier (“West Tier”); (iii) Recycling Processing and Sales, (iv) WM Renewable Energy and (v) WM Healthcare Solutions. Our East and West Tiers along with certain ancillary services (“Other Ancillary”) that are not managed through our Tier segments, but that support our collection and disposal operations, form our “Collection and Disposal” businesses.\nOur East Tier primarily consists of geographic areas located in the Eastern U.S., the Great Lakes region and substantially all of Canada. Our West Tier primarily includes geographic areas located in the Western U.S., including the upper Midwest region and British Columbia, Canada. \nWe also provide additional services not managed through our five reportable segments, which are presented as Corporate and Other. For further discussion refer to Note 19 of our Consolidated Financial Statements. \n7\n\n\nTable of Contents\nCollection and Disposal\nServices provided through our Collection and Disposal businesses are described below:\nCollection. \nOur commitment to customers begins with a vast waste collection network. Collection involves picking up and transporting waste and recyclable materials from where it was generated to a transfer station, recycling facility or disposal site. We generally provide collection services under one of two types of arrangements:\n●\nFor commercial and industrial collection services, typically we have three-year service agreements. The fees under the agreements are influenced by factors such as collection frequency, type of collection equipment we furnish, type and volume or weight of the waste collected, distance to the disposal facility, labor costs, cost of disposal and general market factors. As part of the service, we provide steel containers to most customers to store their solid waste between pick-up dates. Containers vary in size and type according to the needs of our customers and the restrictions of their communities. Many are designed to be lifted mechanically and either emptied into a truck’s compaction hopper or directly into a disposal site. By using these containers, we can service most of our commercial and industrial customers with trucks operated by only one employee.\n●\nFor most residential collection services, we have a contract with, or a franchise granted by, a municipality, homeowners’ association or some other regional authority that gives us the exclusive right to service all or a portion of the homes in an area. These contracts or franchises are typically for periods of three to ten years and typically mirror maximum terms as allowed by statutes by state. We also provide services under individual monthly subscriptions directly to households. The fees for residential collection are either paid by the municipality or authority from their tax revenues or service charges, or are paid directly by the residents receiving the service. The Company is generally phasing out traditional manual systems and moving to further automate residential collection services. Benefits of automation include enhanced worker safety, improved service delivery to the customer and an overall reduction in the cost to provide services.\nLandfill. \nLandfills are the main depositories for solid waste in North America. As of December 31, 2024, we owned or operated 257 solid waste landfills and five secure hazardous waste landfills, which represents the largest network of landfills throughout the U.S. and Canada. As of December 31, 2024, we owned or controlled the management of 239 sites with remedial activities that are in closure or have received a certification of closure from the applicable regulatory agency. Solid waste landfills are constructed and operated on land with engineering safeguards that limit the possibility of water and air pollution and are operated under procedures prescribed by regulation. A landfill must meet federal, state or provincial and local regulations during its design, construction, operation and closure. The operation and closure activities of a solid waste landfill include excavation, construction of liners, continuous spreading and compacting of waste, covering of waste with earth or other acceptable material and constructing final capping of the landfill. These operations are carefully planned to maintain environmentally safe conditions and to maximize the use of the airspace.\nAll solid waste management companies must have access to a disposal facility, such as a solid waste landfill. The significant capital requirements of developing and operating a landfill serve as a barrier to landfill ownership and, thus, third-party haulers often dispose of waste at our landfills. It is usually preferable for our collection operations to use disposal facilities that we own or operate, a practice we refer to as internalization, rather than using third-party disposal facilities. Internalization generally allows us to realize higher consolidated margins and stronger operating cash flows. The fees charged at disposal facilities, which are referred to as tipping fees, are based on several factors, including our cost to construct, maintain and close the landfill, the distance to an alternative disposal facility, the type and weight or volume of solid waste deposited and competition.\nUnder environmental laws, the federal government (or states with delegated authority) must issue permits for all hazardous waste landfills. All of our hazardous waste landfills have obtained the required permits, although some can accept only certain types of hazardous waste. These landfills must also comply with specialized operating standards. Only hazardous waste in a stable, solid form, which meets regulatory requirements, can be deposited in our secure disposal cells. In some cases, hazardous waste can be treated before disposal. Generally, these treatments involve the separation or removal of solid materials from liquids and chemical treatments that transform waste into inert materials that are no longer hazardous. Our hazardous waste landfills are sited, constructed and operated in a manner designed to provide long-term \n8\n\n\nTable of Contents\ncontainment of waste. We also operate a hazardous waste facility at which we isolate treated hazardous waste in liquid form by injection into deep wells that have been drilled in certain acceptable geologic formations far below the base of fresh water to a point that is safely separated by other substantial geological confining layers.\nIncluded within our Collection and Disposal businesses are landfills having (i) 20 third-party power generating facilities converting our landfill gas to fuel electricity generators; (ii) 16 third-party renewable natural gas (“RNG”) facilities processing landfill gas to be sold to natural gas suppliers and (iii) six third-party projects delivering our landfill gas by pipeline to industrial customers as a direct substitute for fossil fuels in industrial processes. In return for providing our landfill gas, we receive royalties from each facility, including the benefit of a 15% royalty from our WM Renewable Energy segment based on net operating revenue generated through the sale of RNG, renewable identification numbers (“RINs”), electricity and capacity, Renewable Energy Credits (“RECs”) and related environmental attributes from the 84 landfill beneficial use renewable energy projects owned by WM Renewable Energy on our active landfills, which is eliminated in consolidation.\nTransfer. \nAs of December 31, 2024, we owned or operated 339 transfer stations in the U.S. and Canada. We deposit waste at these stations, as do other waste haulers. The solid waste is then consolidated and compacted to reduce the volume and increase the density of the waste and transported by transfer trucks or by rail to disposal sites.\nAccess to transfer stations is critical to haulers who collect waste in areas not in close proximity to disposal facilities. Fees charged to third parties at transfer stations are usually based on the type and volume or weight of the waste deposited at the transfer station, the distance to the disposal site, market rates for disposal costs and other general market factors.\nThe utilization of our transfer stations by our own collection operations improves internalization by allowing us to retain fees that we would otherwise pay to third parties for the disposal of the waste we collect. It enables us to manage costs associated with waste disposal because (i) transfer trucks, railcars or rail containers have larger capacities than collection trucks, allowing us to deliver more waste to the disposal facility in each trip; (ii) waste is accumulated and compacted at transfer stations that are strategically located to increase the efficiency of our network of operations and (iii) we can retain the volume by managing the transfer of the waste to one of our own disposal sites.\nThe transfer stations that we operate but do not own generally are operated through lease agreements under which we lease property from third parties. There are some instances where transfer stations are operated under contract, generally for municipalities. In most cases, we own the permits and will be responsible for any regulatory requirements relating to the operation and closure of the transfer station.\nOther\n. Other businesses providing collection and disposal services include the following:\nStrategic Business Solutions (“WMSBS”)\n — Although many waste management services such as collection and disposal are local services, our WMSBS business works with customers whose locations span the U.S. and Canada. Our strategic accounts program provides these customers with streamlined service, enhanced reporting, measurement tools aimed at meeting sustainability objectives and centralized billing and management of accounts.\nSustainability and Environmental Solutions (“SES”)\n — Our SES business collaborates with our geographic areas and national accounts sales team to offer our customers end-to-end solutions that help businesses achieve their sustainability, recycling and waste diversion goals while meeting industry-specific compliance requirements and rising environmental demands. These solutions include (i) Sustainability Services, where our employees provide full-service waste management solutions and advisory services, working full-time onsite at our customers’ facilities or through remote-managed programs (this service is managed through our SES business but reflected principally in our collection line of business); (ii) remediation and construction services; (iii) management and marketing of fly ash, which is residue generated from the combustion of coal to generate electricity; and (iv) industrial waste services, which uses thermal and mechanical separation technologies to minimize waste volumes and recover commodities at the point of generation. The breadth of these service offerings, combined with our large and expanding network of technology-enabled infrastructure in recycling, organics and renewable energy give us the ability to help customers reduce the amount of waste they generate, identify recycling opportunities and determine efficient and environmentally friendly means for waste collection and disposal. Through these services, we aim to help customers increase circularity and accelerate their decarbonization goals.\n9\n\n\nTable of Contents\nRecycling Processing and Sales\nRecycling involves the separation of reusable materials from the waste stream for processing and resale or other disposition. We are North America’s leading recycler of post-consumer materials. We not only collect materials from households and businesses across the U.S. and Canada, we also process and sell them to manufacturers to be recycled and sold generally within the North American market. Demand for recycled materials is generally growing. Several states have recently passed minimum-recycled-content mandates, and many companies are responding to requirements for recycled content from their own customers and to meet sustainability targets. We are helping expand the availability of recycled materials by investing in infrastructure, increasing access to recycling services and educating customers through our Recycle Right\n®\n program.\nOur recycling operations provide communities and businesses with an alternative to traditional landfill disposal and support our strategic goals to extract more value from the materials we manage. We were the first major solid waste company to focus on residential single-stream recycling, which allows customers to mix clean bottles, cans, paper and cardboard in one bin. Residential single-stream programs have greatly increased recycling volumes. Single-stream recycling is possible through the use of various mechanized screens and optical sorting technologies. In addition to advancing our single stream recycling programs for commercial applications, we continue to invest in recycling technologies and businesses designed to offer services and solutions to support and grow our current operations. We are investing in enhanced recycling facility technology at new and existing facilities to benefit labor productivity, support increased recycling capacity and allow for dynamic adjustments to respond to evolving end-market demands. In 2023 and 2024, we opened eight and three new recycling facilities, respectively, within the U.S. and Canada equipped with advanced recycling technology. We continue to invest in recycling facility automation and new markets across the U.S. and Canada. Our Recycling Processing and Sales segment includes the following:\nMaterials processing —\n Through our collection operations and third-party customer base, we collect recyclable materials from residential, commercial and industrial customers and direct these materials to one of our recycling facilities for processing. As of December 31, 2024, we operated 105 recycling facilities, of which 45 are single stream, where cardboard, paper, glass, metals, plastics, construction and demolition materials and other recycling commodities are recovered for resale or redirected for other purposes.\nRecycling commodities —\n We market and resell recycling commodities globally. We manage the marketing of recycling commodities that are processed in our facilities by continuously analyzing market prices, logistics, market demands and product quality through our dedicated recycling service centers and account managers.\nRecycling brokerage services\n — We also provide recycling brokerage services, which involve managing the marketing of recyclable materials for third parties. Our experience in managing recycling commodities for our own operations gives us the expertise needed to effectively manage volumes for third parties. Utilizing the resources and capabilities of our recycling service centers and account managers, we can assist customers in marketing and selling their recycling commodities with minimal capital requirements.\nOrganics processing and sales\n — We collect recyclable food and yard waste from commercial, residential, and industrial customers, and process these materials through a network of mulching, composting, CORe®, and anaerobic digestion facilities. As of December 31, 2024, we operated 49 organics recycling facilities and also partner with third-party processors. Our network of facilities utilizes, markets and sells products including mulch, compost, soil amendments, and renewable energy.\nThe recyclable materials processed in our recycling facilities are received from various sources, including third parties and our own operations. In recent years, we have been focused on reducing dependency on market prices for recycled commodities by recovering our processing costs first. In our materials processing business, we have been transitioning our customer base over time from the traditional rebate model, where we paid suppliers for the inbound material, to a fee-for-service model that ensures the cost of processing the recyclable materials is covered along with an acceptable margin. With our current fee-for-service model, the pricing for these recyclable materials can either be a charge or “tip fee” when commodity pricing does not cover our cost to process the recyclable materials or a “rebate” when commodity pricing is higher than our processing costs and we are able to share this benefit with the customers generating recyclable \n10\n\n\nTable of Contents\nmaterials. In some cases, our pricing is based on fixed contractual rates or on defined minimum per-ton rates. Generally, this pricing also considers the price we receive for sales of processed goods, market conditions and transportation costs. As a result, changes in commodity prices for recycled materials also significantly affect the pricing to our suppliers. Depending on the key terms of the arrangement, these “rebates” are recorded as either operating expenses or a reduction in operating revenues within our Consolidated Statements of Operations. If the key terms result in a charge to the customer, the associated “tip fees” would be recorded as operating revenues within our Consolidated Statements of Operations.\nWM Renewable Energy\nWe develop, operate and promote projects for the beneficial use of landfill gas through our WM Renewable Energy segment. Landfill gas is produced naturally as waste decomposes in a landfill. The methane component of the landfill gas is a readily available, renewable energy source that can be gathered and used beneficially as an alternative to fossil fuel. The U.S. Environmental Protection Agency (“EPA”) endorses landfill gas as a renewable energy resource, in the same category as wind, solar and geothermal resources. As of December 31, 2024, we had 102 landfill gas beneficial use projects producing commercial quantities of methane gas at owned or operated landfills. For 65 of these projects, the processed gas is used to fuel electricity generators. The electricity is then sold to public utilities, municipal utilities or power cooperatives. For 23 of these projects, the gas is used at the landfill or delivered by pipeline to industrial customers as a direct substitute for fossil fuels in industrial processes. For 11 of these projects, the landfill gas is processed to pipeline quality RNG and then sold to natural gas suppliers. Additionally, three of these projects are on third-party landfills. The revenues from these facilities are primarily generated through the sale of RNG, RINs, electricity and capacity, heat and/or steam, RECs and related environmental attributes. WM Renewable Energy is charged a 15% royalty on net operating revenue from these facilities residing on our active and closed landfills from our Collection and Disposal and Corporate and Other businesses, which is eliminated in consolidation. Additionally, WM Renewable Energy operates and maintains seven third-party landfill beneficial gas use projects in return for service revenue. Our Collection and Disposal and Corporate and Other businesses benefit from these projects as well as 52 additional third-party landfill beneficial gas use projects in the form of royalties.\nWM Renewable Energy converts landfill gas into several sources of renewable energy, which include RNG, electricity and capacity, heat and/or steam. WM Renewable Energy also generates RINs under the Renewable Fuel Standard (“RFS”) program, other credits under a variety of state programs associated with the use of RNG in our compressed natural gas fleet, and RECs associated with the production of electricity. The RINs, RECs and other credits are sold to counterparties who are obligated under the regulatory programs and have a responsibility to procure RINs, RECs and other credits proportionate to their fossil fuel production and imports. RINs and RECs prices generally respond to regulations enacted by the EPA or other regulatory bodies, as well as fluctuations in supply and demand. \nWM Healthcare Solutions\nOur WM Healthcare Solutions segment, through our subsidiary Stericycle, is primarily a business-to-business company providing RWCS and SID services that protect people and brands, promote health and well-being and safeguard the environment. WM Healthcare Solutions serves customers in the U.S., Canada and Western Europe with solutions to safely manage materials that could otherwise spread disease, contaminate the environment, or compromise one’s identity. Services provided through our WM Healthcare Solutions segment includes the following:\nRegulated Waste and Compliance Services\nWM Healthcare Solutions includes compliance programs and collection, processing, and disposal of regulated and specialized waste, including medical, pharmaceutical and hazardous waste. RWCS are provided to customers in the U.S., Canada, Ireland and the United Kingdom (“U.K.”).\nRegulated waste can be defined as any material subject to government-imposed guidelines for handling the material for transportation or disposal. Examples include medical waste, pathological waste, sharps and pharmaceutical waste.\nCollection and Transportation \n—\n \nThe collection process for regulated waste streams begins at the customer location with waste segregation. To assure regulatory compliance, we educate our customers and will not accept material from \n11\n\n\nTable of Contents\ncustomers unless it complies with our waste acceptance protocols and is properly stored or packaged in containers that we have either supplied or approved and is appropriately labeled.\nOur team members then collect containers at the customer location via our fleet of vehicles. The majority of collected waste is then transported directly to one of our processing facilities or to one of our WM Healthcare Solutions transfer stations where waste is aggregated until it is transported to a processing facility.\nProcessing and Disposal of Regulated Waste\n — Upon arrival at a processing facility, containers or boxes of regulated waste undergo a quality control process to verify that they do not contain any unacceptable substances. Any container or box that is discovered to contain unacceptable waste goes through a corrective action process which could include redirecting the waste, returning the waste to the customer and/or notifying the appropriate regulatory authorities. From there, regulated waste is processed using one of several treatments or processing technologies, predominantly at one of our facilities:\n●\nAutoclaving\n — Autoclaving is the primary method of regulated waste treatment. This process relies on steam at high temperature and pressure to kill pathogens and render materials non-infectious.\n●\nAlternative Technologies \n— We use several different non-incineration alternatives to autoclaves, predominantly outside of the U.S. The processes used by these technologies are similar to autoclaving, as the regulated waste is heated to a specified temperature for a required time to kill the pathogens and render materials non-infectious. Depending on local requirements, the waste may be shredded before or after treatment to render it unrecognizable.\n●\nIncineration \n— While we strive to use alternative, non-incineration methods for treating medical waste, incineration remains a regulatory requirement and/or a best practice in certain geographies or for certain types of medical waste that need to be chemically destroyed. Incineration burns regulated waste at elevated temperatures and reduces it to ash. Incineration reduces the volume of waste, and it is the recommended treatment and disposal option for some types of regulated waste such as anatomical waste, residues from chemotherapy procedures and non-hazardous pharmaceutical waste. Air emissions from incinerators can contain certain byproducts that are subject to federal, state and in some cases, local regulation. In some circumstances, the ash byproduct of incineration may be regulated.\nUpon completion of the treatment process, the resulting waste or incinerator ash is transported for disposal in a landfill owned by unaffiliated third parties or by the Company. Additionally, in several of our incineration facilities, primarily in the U.K., we use different types of waste-to-energy solutions as part of our processes.\nSecure Information Destruction\nWM Healthcare Solutions also provides for the collection of personal and confidential information for secure destruction and recycling of sorted office paper. SID services are provided to customers in the U.S., Belgium, Canada, France, Germany, Ireland, Luxembourg, the Netherlands and the U.K.\nWe leverage a combination of off-site and on-site document destruction methods for one-time and recurring paper shredding. Our service offerings leverage cross-cut shredding technology to enhance the security level of destruction and can provide secure chain-of-custody and proof of service. Shredded paper is then sold as sorted office paper. \nCorporate and Other\nWe also provide additional services that are not managed through our operating segments, which are presented in this report as Corporate and Other as they do not meet the criteria to be aggregated with other operating segments and do not meet the quantitative criteria to be separately reported. This includes the activities of our corporate office, including costs associated with our long-term incentive program, expanded service offerings and solutions (such as our investments in businesses and technologies that are designed to offer services and solutions ancillary or supplementary to our current operations) as well as our closed sites.\n12\n\n\nTable of Contents\nIncluded within our Corporate and Other businesses’ closed sites are (i) six third-party power generating facilities converting our landfill gas to fuel electricity generators; (ii) two third-party projects delivering our landfill gas by pipeline to industrial customers as a direct substitute for fossil fuels in industrial processes and (iii) two third-party RNG facilities processing landfill gas to be sold to natural gas suppliers in return for a royalty. Additionally, Corporate and Other benefits from a 15% royalty from our WM Renewable Energy segment based on net operating revenue generated through the sale of RNG, RINs, electricity and capacity, RECs and related environmental attributes from the 15 landfill beneficial use renewable energy projects owned by WM Renewable Energy on our closed sites, which is eliminated in consolidation.\nWe continue to invest in businesses and technologies that are designed to offer services and solutions ancillary or supplementary to our current operations. While most of these investments are in the form of minority equity stakes, they can also include joint ventures, joint development agreements or majority equity stakes. The solutions and services include (i) waste collection, processing and recycling; (ii) the development, operation and marketing of waste processing facilities and technologies; (iii) operation of RNG plants and (iv) the development and operation of organic recycling technologies. Furthermore, we continually scout, evaluate and run proof-of-concepts of innovative technologies within our core operations to improve safety, operational efficiencies and customer solutions.\nCompetition\nWe encounter intense competition from governmental, quasi-governmental and private sources in all aspects of our operations. We principally compete with large national waste management companies, counties and municipalities that maintain their own waste collection and disposal operations and regional and local companies of varying sizes and financial resources. The industry also includes companies that specialize in certain discrete areas of waste management, operators of alternative disposal facilities, companies that seek to use parts of the waste stream as feedstock for renewable energy and other by-products and waste brokers that rely upon haulers in local markets to address customer needs. \nOperating costs, disposal costs and collection fees vary widely throughout the geographic areas in which we operate. The prices that we charge are determined locally, and typically vary by volume and weight, type of waste collected, treatment requirements, risk of handling or disposal, frequency of collections, distance to final disposal sites, the availability of airspace within the geographic region, labor costs and amount and type of equipment furnished to the customer. We face intense competition based on pricing and quality of service. We also compete for business based on breadth of service offerings. As companies, individuals and communities look for ways to be more sustainable, we are promoting our comprehensive services that go beyond our core business of collecting and disposing of waste in order to meet their needs.\nSeasonal Trends\nOur financial and operating results may fluctuate for many reasons, including period-to-period changes in the relative contribution of revenue by each line of business, changes in commodity prices and general economic conditions. Our operating revenues and volumes typically experience seasonal increases in the summer months that are reflected in second and third quarter revenues and results of operations.\nService or operational disruptions caused by severe storms, extended periods of inclement weather or climate events can significantly affect the operating results of the geographic areas affected. Extreme weather events may also lead to supply chain disruption and delayed project development, or disruption of our customers’ businesses, reducing the amount of waste generated by their operations. \nConversely, certain destructive weather and climate conditions, such as wildfires in the Western U.S. and hurricanes that most often impact our operations in the Southern and Eastern U.S. during the second half of the year, can increase our revenues in the geographic areas affected as a result of the waste volumes generated by these events. While weather-related and other event-driven special projects can boost revenues through additional work for a limited time, due to significant start-up costs and other factors, such revenue can generate earnings at comparatively lower margins.\n13\n\n\nTable of Contents\nHuman Capital Resources\nEmployees\nAs of December 31, 2024, we had approximately 61,700 full-time employees across the U.S., Canada, Western Europe, and India. Approximately 54,300 employees were located within the U.S. and 7,400 employees were located outside of the U.S. Approximately 8,400 employees were employed in administrative and sales positions with the remainder in operations. Approximately 9,900 of our employees are covered by collective bargaining agreements. Additional information about our workforce can be found in our 2024 Sustainability Report at sustainability.wm.com, which was issued prior to our acquisition of Stericycle and does not incorporate any aspects of the acquired operations. Our 2024 Sustainability Report does not constitute a part of, and is not incorporated by reference into, this report or any other report we file with (or furnish to) the SEC, whether made before or after the date of this Annual Report on Form 10-K.\nPeople First Commitment\nOur People First commitment means knowing that the daily contributions of our team members are what enable us to play a vital role in the communities we serve. Our success depends upon effective leadership, the contributions of each employee and our ability to give them the tools they need to safely execute their roles as well as to develop and excel in their careers. As our industry and workforce evolve, we are focused on our imperatives of keeping our employees safe, being an inclusive employer at all levels of our Company, managing employee turnover, increasing retention, succession planning and development, and supporting employee experience, ongoing cultural integration and knowledge transfer. We regularly focus on these objectives when managing our business. \n​\nWe strive to be a workplace of choice through competitive pay, comprehensive benefits for long-term financial and personal health and opportunities for growth across our ranks. \"We Are WM\" is our Employer Value Proposition, grounded in our People First commitment and shared through a framework that enables us to demonstrate that we are (i) investing in our teams by providing comprehensive benefits; (ii) committed to the growth of our team by providing state-of-the-art trainings and our education benefit, Your Tomorrow, as further discussed under \nCompensation and Benefits\n; (iii) performing essential and meaningful work and (iv) working for a sustainable tomorrow by leaving the world a better place than we found it. Being an employer of choice is critical to our efforts to attract and retain a high-quality workforce, while motivating us to sharpen our focus on our values that help us empower and develop good employees. By promoting from within and offering training and experiential opportunities, we help employees maximize their effectiveness and grow in their careers. \nSafety as a Core Value\nAt the Company, safety is a core value, with no compromise. A large number of our employee population work as drivers, heavy equipment operators and sorters, which are essential jobs that carry inherent risks. For nearly 20 years, we have engaged employees on safety to continually improve our culture and performance.\n \nAs part of those efforts, in 2023 we developed and implemented a new safety vision for WM, which seeks to ensure that our employees make health and safety the foundation of their work, guiding each step they take. Our safety commitment is to value every voice, protect our communities, and work to enable everyone to get home safe, every day. Employees learn safety best practices through new-hire training, onboarding programs and ongoing training. To build upon lessons learned in training, we conduct structured observations of frontline employees that cover all aspects of our collection and post-collection operations, including driving, loading, unloading, lifting and lowering and arriving prepared for work.\n \nIn 2023, the Company announced a safety goal focused on reduction of our Total Recordable Incident Rate (“TRIR”) by 3% annually, targeting TRIR of 2.0 annually by 2030. TRIR measures the number of injuries occurring per 100 employees per year (number of injuries per 200,000 hours). Our TRIR as of December 31, 2024 was 3.23. While our overall results in 2024 did not demonstrate targeted progress toward the 2030 goal, we were able to determine that the number of incidents is meaningfully improving for our core operations, though these improvements have been offset by the impacts of acquisition activity as well as a significant reduction in work hours from an improvement in driver retention and operational efficiency. We often find that the discipline and culture of the Company benefit acquired businesses. Accordingly, while there can be short-term impacts from acquisitions on measures such as TRIR, we are confident that the time and resources dedicated to \n14\n\n\nTable of Contents\npursuing our safety commitment have us on track for continued progress in the years ahead. The Company reduced  overall (5.8%), OSHA recordable (2.2%), and Lost Time (2.4%) injuries in 2024 and remains focused on the prevention of serious injuries.\nCultivating Belonging\nWe embrace and cultivate respect, trust, open communications and diversity of thought and people. We are committed to fostering an environment where all team members feel welcomed, valued and seen. Our commitment to a culture of belonging is reflected in the diverse backgrounds of our Board of Directors and senior leadership team and in our overall workforce in the U.S., which is comprised of individuals of all ethnicities and genders. Additional information about our workforce can be found in our 2024 Sustainability Report at sustainability.wm.com. We are proud of what we have been able to achieve so far, and we will continue to strive to further embed a culture of belonging within the Company. To enable us to achieve a workplace where all feel welcomed and valued, we are committed to evaluating our policies, practices and procedures, recruitment and partnerships to ensure that our efforts are fair, sustainable and tied to our business strategy. \nLearning and Development\nWe offer expansive learning and development solutions to meet the development needs of our people and support opportunities for growth and improvement. Our talent management strategy is designed to reach employees at all levels. Given the wide variety of employee roles and skill sets in our Company, our training and development programs are varied but generally fall into the following categories: (i) compliance, including Code of Conduct and cybersecurity training; (ii) safety; (iii) environmental excellence; (iv) professional development and leadership and (v) job-specific.\nCompensation and Benefits\nThe objective of our compensation and benefit programs is to attract, engage, reward and incentivize valuable employees who will drive the successful execution of our strategy. \nWe pay the full cost to provide employees with short-term disability benefits, long-term disability benefits, basic life insurance for the employee and their dependents, and employee and family assistance benefits. The costs for medical and dental coverage are shared with employees, with the Company paying for a majority of the premium expense. The Company offers other important benefits such as paid vacation and holidays, mental health services, legal services, flexible spending accounts, dependent care assistance, adoption assistance, employee discounts and student loan refinancing services. We also recognize the value of learning beyond the workplace. Our education benefit, Your Tomorrow, pays benefits-eligible employees’ and dependents’ tuition for a broad range of four-year college degree programs, as well as programs such as high-school equivalency and, for employees, other certificate programs and graduate degrees. We also provide plans to help employees save for their future for example, through our 401(k) retirement savings plan. Refer to Note 9 to the Consolidated Financial Statements for additional information on our employee benefit plans. \nFinancial Assurance and Insurance Obligations\nFinancial Assurance\nMunicipal and governmental waste service contracts generally require contracting parties to demonstrate financial responsibility for their obligations under the contract. Financial assurance is also a requirement for (i) obtaining or retaining disposal site or transfer station operating permits; (ii) supporting certain variable-rate tax-exempt debt and (iii) estimated final capping, closure, post-closure and environmental remedial obligations at many of our landfills. We establish financial assurance using surety bonds, letters of credit, insurance policies, trust and escrow agreements and financial guarantees. The type of assurance used is based on several factors, most importantly: the jurisdiction, contractual requirements, market factors and availability of credit capacity.\nSurety bonds and insurance policies are supported by either (i) a diverse group of third-party surety and insurance companies; (ii) an entity in which we have a noncontrolling financial interest or (iii) a wholly-owned insurance captive, the sole business of which is to issue surety bonds and/or insurance policies on our behalf. Letters of credit generally are \n15\n\n\nTable of Contents\nsupported by our long-term U.S. and Canadian revolving credit facility (“$3.5 billion revolving credit facility”) and other credit lines established for that purpose.\nInsurance\nWe carry a broad range of insurance coverages, including health and welfare, general liability, automobile liability, workers’ compensation, real and personal property, directors’ and officers’ liability, pollution legal liability, cyber incident liability and other coverages we believe are customary to the industry. Our exposure to loss for insurance claims is generally limited to the per-incident deductible under the related insurance policy and any amounts that exceed our insured limits. We use a wholly-owned insurance captive to insure the deductibles for our general liability, automobile liability and workers’ compensation claims programs. We do not expect the impact of any known casualty, property, environmental or other contingency to have a material impact on our financial condition, results of operations or cash flows. Our estimated insurance liabilities as of December 31, 2024 are summarized in Note 10 to the Consolidated Financial Statements.\nRegulation\nOverview\nOur business is subject to extensive and evolving laws and regulations pertaining to environmental protection, health, safety, land use, zoning, transportation, ethical business conduct, data privacy and security, and other related and similar subjects. These laws and regulations are administered by the EPA, Environment and Climate Change Canada (“ECCC”), and various other agencies at the federal, state, provincial, regional and local level in the U.S., Canada and other international jurisdictions in which we operate. Many of these agencies regularly examine our operations to monitor compliance with applicable laws and regulations and have the power to enforce compliance, obtain injunctions or impose civil or criminal penalties in cases of violations. \nOur business primarily involves the collection, transport, handling, treatment, destruction, and other processing and management of solid waste, medical waste, controlled substances waste, hazardous waste, organics, and recyclables in an environmentally sound manner. A significant amount of our capital expenditures is related, either directly or indirectly, to compliance with applicable laws and regulations, including environmental protection measures. With the acquisition of Stericycle, we have increased our exposure to international jurisdictions, primarily Western Europe, and we are subject to additional laws and regulations in the U.S. and internationally concerning transportation, management and disposal or destruction of medical waste streams, including regulations that govern the definition, generation, segregation, handling, packaging, transportation, treatment, storage and disposal or destruction of medical waste and controlled substances waste, along with extensive recordkeeping and documentation requirements. Additionally, Stericycle’s secure information destruction services are subject to additional laws and regulations regarding proper handling and protection of personal and confidential information.\nThere are costs associated with siting, design, permitting, construction, operating, monitoring, site maintenance, corrective actions, financial assurance and closure and post-closure obligations at our facilities. In connection with the acquisition, development or expansion of a waste management or disposal facility, recycling facility, compost facility, transfer station, processing facility, or landfill gas-to-energy facility, or the transport, handling, treatment and disposal or destruction of various waste streams, we must often spend considerable time, effort and money to obtain and maintain required permits and approvals. There are no assurances that we will be able to obtain or maintain permits or other required governmental approvals. Once obtained, permits are subject to renewal, modification, suspension or revocation by the issuing authority. Permit issuance or renewal may also be subject to public participation or other governmental reviews and may be subject to challenges and delays. Compliance with current regulations and future requirements could require us to make significant capital and operating expenditures. However, most of these expenditures are made in the normal course of business and do not place us at a competitive disadvantage.\nThe regulatory environment in which we operate is influenced by changes in governmental administrations and leadership. The priorities set forth under the prior U.S. presidential administration, for example, were generally in favor of increasing regulation, while the new administration is generally anticipated to reverse course on many regulatory policies. \nThe new administration has called for substantial changes to areas of foreign trade policy and has generally appeared to \n16\n\n\nTable of Contents\nbe in favor of reducing regulation, including environmental regulation. \nWe do not know what impact the change in U.S. presidential administration will have on specific regulatory policies impacting our industry and our Company, especially given the number of rules currently in litigation, nor can we predict the timing of any such changes. Reduction of regulation may have a favorable impact on our operating costs, but the extensive environmental regulation applicable to our industry is also a barrier to rapid entry that benefits our Company. Moreover, the risk reduction provided by appropriate regulation is valuable to our customers and the communities we serve. Significant new restrictions and tariffs on foreign trade could have a negative impact on our recycling export business and our cross-border commerce, particularly with Canada, and could increase the cost of certain equipment and other materials used in our operations that we procure from outside the U.S., including our trucks and certain equipment used to implement our sustainability growth strategy. \nIt is likely that some policies adopted by the new administration will benefit us and others will negatively affect us.\nIn 2024, the U.S. Supreme Court issued a number of decisions that will affect the future of federal regulation, including \nLoper Bright Enterprises v. Raimondo\n. The \nLoper \ndecision overturned the \nChevron\n doctrine, which had held that a court must give deference to a regulatory agency’s reasonable interpretation of an ambiguous statute the agency implements. The full impact of that decision is not yet known, but at a minimum, our operations could face increased regulatory uncertainty in connection with legal challenges to agency actions and rulemakings impacting our industry.\nFederal Regulation\nCertain key U.S. federal statutes affecting our business are summarized below:\n●\nThe Resource Conservation and Recovery Act of 1976 (“RCRA”), as amended, regulates handling, transporting and disposing of hazardous and non-hazardous waste and delegates authority to states to develop programs to ensure the safe disposal of solid waste. Landfills are regulated under Subtitle D of RCRA, which sets forth minimum federal performance and design criteria for solid waste landfills, and Subtitle C of RCRA, which establishes a federal program to manage hazardous wastes from cradle to grave. These regulations are typically implemented by the states, although states can impose requirements that are more stringent than the federal standards. We incur costs in complying with these standards in the ordinary course of our operations.\n●\nThe Comprehensive Environmental Response, Compensation and Liability Act of 1980 (“CERCLA”), as amended, which is also known as Superfund, provides for federal authority to respond directly to releases or threatened releases of hazardous substances into the environment that have created actual or potential environmental hazards. CERCLA’s primary means for addressing such releases is to impose strict liability for cleanup of disposal sites upon current and former site owners and operators, generators of the hazardous substances at the site and transporters who selected the disposal site and transported substances thereto. Liability under CERCLA is not dependent on the intentional release of hazardous substances; it can be based upon the release or threatened release of hazardous substances, even resulting from lawful, unintentional and attentive action, as the term is defined by CERCLA and other applicable statutes and regulations. The EPA may issue orders requiring responsible parties to perform response actions at sites, or the EPA may seek recovery of funds expended or to be expended in the future at sites. Liability may include contribution for cleanup costs incurred by a defendant in a CERCLA civil action or by an entity that has previously resolved its liability to federal or state regulators in an administrative or judicially-approved settlement. Liability under CERCLA could also include obligations to a potentially responsible party (“PRP”) that voluntarily expends site clean-up costs. Further, liability for damage to publicly-owned natural resources may also be imposed. We are subject to potential liability under CERCLA as an owner or operator of facilities at which hazardous substances have been disposed and as a generator or transporter of hazardous substances disposed of at other locations.\n●\nThe Federal Water Pollution Control Act of 1972, as amended, known as the Clean Water Act, regulates the discharge of pollutants into streams, rivers, groundwater, or other surface waters from a variety of sources, including solid and hazardous waste disposal sites. If our operations discharge any pollutants into federally protected surface waters, the Clean Water Act requires us to apply for and obtain discharge permits, conduct sampling and monitoring, and, under certain circumstances, reduce the quantity of pollutants in those discharges. The EPA also requires landfills and other waste-handling facilities to obtain storm water discharge permits, and if a landfill or other facility discharges wastewater through a sewage system to a publicly-owned treatment works, the facility must comply with discharge limits imposed by the treatment works. Further, before the development or expansion of a landfill can alter or affect certain “wetlands,” a permit may have to be obtained providing for \n17\n\n\nTable of Contents\nmitigation or replacement wetlands. The Clean Water Act provides for civil, criminal and administrative penalties for violations of its provisions.\n●\nThe Clean Air Act of 1970, as amended, provides for federal, state and local regulation of the emission of air pollutants. Many of our operations, including many municipal solid waste (“MSW”) landfills and landfill gas-to-energy facilities, are subject to regulations implemented under the Clean Air Act, including new source performance standards, emission guidelines and national emission standards for hazardous air pollutants. These regulations impose performance standards to minimize air emissions from regulated MSW landfills, subject those landfills to certain operating permit requirements under Title V of the Clean Air Act and, in many instances, require installation of landfill gas collection and control systems to control emissions or to treat and utilize landfill gas on- or off-site. Our vehicle fleet also must adhere to regulations implemented under the Clean Air Act, which authorizes the EPA to mandate controls on air pollution from mobile sources. \n●\nThe Occupational Safety and Health Act of 1970, as amended, establishes certain employer responsibilities, including maintenance of a workplace free of recognized hazards likely to cause death or serious injury, compliance with standards promulgated by the Occupational Safety and Health Administration, and various reporting and record keeping obligations as well as disclosure and procedural requirements. Various standards for notices of hazards, personal protective equipment, safety in excavation and demolition work, exposure to bloodborne pathogens, and the handling of asbestos, may apply to our operations. \n●\nThe Department of Transportation and the Occupational Safety and Health Administration, along with other federal agencies, have jurisdiction over certain aspects of hazardous materials and hazardous waste, including safety, movement and disposal. Certain waste (including medical waste) is subject to roadside inspections that have a cumulative effect on our compliance history and require us to remain in good standing so as not to jeopardize certain permits. Various state and local agencies with jurisdiction over disposal of hazardous and medical waste may seek to regulate movement of such materials in areas not otherwise preempted by federal law. \n●\nOur service offerings for the collection, treatment, disposal and destruction of controlled substances waste and medical waste, from both the healthcare industry and individual consumers, are subject to numerous laws and regulations issued by various regulatory agencies, including the U.S. Drug Enforcement Administration (“DEA”). These regulations typically require our facilities to obtain licenses or registrations, and meet certain other requirements in order to collect, transport, treat and dispose of controlled substances. These regulations include significant requirements for security, recordkeeping and reporting. Registrations and licenses must be kept current, or periodically renewed, and facilities may be subject to inspection or enforcement.\n​\nOur operations are primarily in the U.S.; however, Canada and other countries in which we operate have various environmental, safety, health, transportation and materials handling laws and regulations that we must comply with in the ordinary course of our business. \n​\nState, Provincial, Regional and Local Regulations\nThere are also various state, provincial, regional and local regulations, in the U.S. and internationally, that affect our operations and may require a specific operating plan. Many jurisdictions in which we operate have their own laws and regulations governing solid waste disposal, including for hazardous wastes, medical wastes and controlled substances wastes; water and air pollution; and, in most cases, releases and cleanup of hazardous substances and liabilities for such matters. Many governmental organizations have also adopted regulations governing the design, operation, maintenance and closure of landfills, transfer stations, incineration facilities and processing facilities, and laws governing where recyclable materials can be sold. \nOur landfill operations are affected by the increasing preference for alternatives to landfill disposal. Many state and local governments mandate recycling and waste reduction at the source and prohibit the disposal of certain types of materials at landfills, such as recyclable materials (cardboard, bottles and cans), yard waste, food waste and electronics. The number of governments with recycling and diversion requirements and disposal bans continues to grow, while the logistics and economics of recycling or processing many of these items remain challenging. In addition, regulations \n18\n\n\nTable of Contents\nrequiring the diversion of organic wastes away from landfills could have the effect of decreasing the amount of landfill gas produced over time in our landfills, negatively impacting our WM Renewable Energy segment.\nVarious states have enacted, or are considering enacting, laws that restrict or discourage the disposal of solid waste generated outside the state. While laws that overtly discriminate against out-of-state waste have been found to be unconstitutional, some laws that are less overtly discriminatory have been upheld in court. From time to time, the U.S. Congress has considered legislation authorizing states to adopt regulations, restrictions, or taxes on the importation of out-of-state or out-of-jurisdiction waste. Additionally, several state and local governments have enacted “flow control” regulations, which attempt to require that all waste generated within the state or local jurisdiction be deposited at specific sites, which has been upheld by the U.S. Supreme Court for waste directed to facilities owned by the local government. The U.S. Congress’ adoption of legislation allowing restrictions on interstate transportation of out-of-state or out-of-jurisdiction waste or certain types of flow control, or courts’ interpretations of interstate waste and flow control legislation, could adversely affect our solid waste, hazardous waste, medical waste and controlled substances management services.\nMany governmental organizations have enacted “fitness” laws that allow the agencies that have jurisdiction over waste services contracts or permits to deny or revoke these contracts or permits based on the applicant’s or permit holder’s compliance history. Some governmental organizations also consider the compliance history of the parent, subsidiaries or affiliated companies, in addition to the applicant or permit holder. These laws authorize the agencies to make determinations of an applicant’s or permit holder’s fitness to be awarded a contract to operate, and to deny or revoke a contract or permit because of unfitness, unless there is a showing that the applicant or permit holder has been rehabilitated through the adoption of various operating policies and procedures put in place to assure future compliance with applicable laws and regulations. While fitness laws can present potential increased costs and barriers to entry into market areas, these laws have not, and are not expected to have a material adverse impact on our business as a whole.\nThe EPA does not regulate medical waste at the federal level, resulting in a lack of uniformity of applicable laws and regulations. States have adopted their own regulations related to the handling, treatment and storage of medical waste, with many states following requirements similar to the Medical Waste Tracking Act of 1988, a U.S. federal law concerning disposal of biological material that expired in 1991. Other states have placed medical waste regulations within solid waste regulations. Further, while the Canadian Council of Ministers of the Environment has promulgated the \nGuidelines for the Management of Biomedical Waste in Canada\n, these are not enforceable unless adopted by provincial legislation or municipal by-laws, and local by-laws may be more stringent than such guidelines.\n​\nRecent Developments and Focus Areas in Policy and Regulation\nClimate and Sustainability\nJurisdictions are increasingly taking action to reduce greenhouse gas (“GHG”) emissions through a broad range of climate policies. Landfills are one of the focal points for advancing climate-related goals, and we are actively working with policymakers to promote recognition of the significant reductions in GHG emissions that our industry already has achieved and the work being done to further measure and reduce emissions, the challenges associated with quantifying landfill emissions precisely, and the role of our sector in providing an essential, and highly regulated, public service.\nWe are closely monitoring the evolving capabilities of ground, aerial and satellite-based methane detection and monitoring systems and conducting our own research at several landfills to assess accuracy and reliability of various methane measurement technologies for applicability to our operations. We also continue to expand our work with various private and government entities employing such technologies at our sites, and we are actively engaged with the EPA, the ECCC, state agencies, nongovernmental organizations and environmental stakeholders on the implications of the changing landscape for the waste industry and potential future regulation. Continued dialogue, engagement and collaboration with these regulatory agencies will be important, as both the EPA and the ECCC are evaluating landfill emissions standards that may require the application of various emerging methane measurement technologies and plan to develop methods and standards for such measurement technologies. The EPA has indicated that methane emissions from landfills will remain a focus of its expanded National Enforcement and Compliance Initiatives through 2027 and has announced its intent to propose updated performance standards for new and existing landfills. While we cannot predict what regulations will result \n19\n\n\nTable of Contents\nfrom these initiatives, these developments could result in increased compliance costs and adversely affect our operations. Specifically, these various regulatory actions could result in changes to how we have historically reported GHG emissions and may result in increases in such emissions reported for our operations. For example, in August 2024, the EPA released revised emission factors for the reporting of methane emissions from landfills that would, amongst other matters, result in increased reported emissions from flares and other equipment and processes. Industry groups have filed legal challenges to the EPA’s updated emission factors. \nIn light of regulatory and business developments related to concerns about climate change, we have identified strategic business opportunities to provide our public and private sector customers with sustainability-related solutions intended to help reduce their carbon footprint. We assess customer demand for and opportunities to develop waste services with potential to avoid lifecycle emissions, such as waste reduction, increased recycling, composting and conversion of landfill gas and discarded materials into renewable energy. We use carbon lifecycle assessment tools in evaluating potential new services and in establishing the value proposition that makes us attractive as an environmental service provider. We are active in support of public policies that encourage development and use of lower carbon energy and waste services that can lower lifecycle carbon footprints. We understand the importance of broad stakeholder engagement in these endeavors and actively seek opportunities for public policy discussion on how materials management practices can be more sustainable. In addition, we work with stakeholders at the federal, state, and provincial level in support of legislation that encourages production and use of renewable, lower-carbon fuels and electricity. \nThe nature, scope, and complexity of matters that our Company must assess, quantify and disclose are expanding due to current, proposed, and recently enacted governmental reporting requirements pertaining to sustainability and climate-related risks and other topics. Such topics include water usage, waste production, labor, human capital, environmental justice, cybersecurity, privacy and risk oversight. For example, in September 2024, the California Governor signed into law amendments to the 2023 California Climate Corporate Data Accountability Act and the Climate-Related Financial Risk Act, which among other things, requires the disclosure of Scope 1, 2, and 3 GHG emissions and other climate-related risks consistent with the framework established by the Task Force on Climate-Related Financial Disclosures. We will be required to begin making disclosures of our Scope 1 and 2 GHG emissions in compliance with certain of these requirements in 2026, and Scope 3 GHG emissions disclosures will be required beginning in 2027. Additional U.S. states are in various stages of considering adoption of similar GHG-related disclosure requirements. In March 2024, the SEC also adopted final rules that would require registrants to include certain climate-related disclosures in their registration statements and periodic reports including, but not limited to, information about our governance and management of climate-related risks and metrics pertaining to emissions data and climate-related targets and goals. The SEC voluntarily stayed implementation of these rules indefinitely, pending judicial review of ongoing legal challenges. Furthermore, beginning as early as 2026, we may be subject to certain reporting requirements in the European Union under the Corporate Sustainability Reporting Directive (“CSRD”), which requires in-scope companies to disclose extensive sustainability information, including risks and opportunities arising from environmental and social matters, and the impact of their business on people and the environment. These and other similar laws and regulations could result in increased compliance costs and affect the results of our operations and financial position. Such similar laws and regulations could also increase our litigation risks or may increase risks related to our reputation or goodwill, as we cannot predict how disclosures under these laws may be perceived or interpreted by our customers and stakeholders. Methodology and timelines for mandatory reporting requirements may be inconsistent with requirements enacted by other governmental entities, including with respect to measuring emissions and requiring a determination of “materiality” that may differ from traditional disclosure requirements under U.S. federal securities laws. Such inconsistency could further increase costs and divert management time and attention. \nOur industry faces challenges to implement these rapidly developing disclosure requirements, as well as the risk of enforcement actions by governmental and regulatory agencies for noncompliance. Significant expenditures and commitment of time by management, employees and consultants is involved in developing, implementing and overseeing policies, practices, additional disclosures and internal controls related to environmental and sustainability risk and performance. Public statements with respect to sustainability matters are becoming increasingly subject to heightened scrutiny from public and governmental authorities related to the risk of potential “greenwashing,” \ni.e.\n, misleading information or false claims overstating potential sustainability benefits. We are aware that non-governmental organizations and other private actors have filed lawsuits against companies under various securities and consumer protection laws alleging that certain sustainability-related statements, goals or standards were misleading, false or otherwise deceptive. \n20\n\n\nTable of Contents\nConsistent with our Company’s long-standing commitment to sustainability and environmental stewardship, we have published our 2024 Sustainability Report, providing details on our sustainability-related performance and outlining progress towards our 2030 sustainability goals. The Sustainability Report conveys the strong linkage between the Company’s sustainability goals and our growth strategy, inclusive of the planned and ongoing expansion of the Company’s Recycling Processing and Sales and WM Renewable Energy segments. The information in this report can be found at sustainability.wm.com but it does not constitute a part of, and is not incorporated by reference into, this Annual Report on Form 10-K. The Company also participates in a number of voluntary reporting programs and frameworks that provide further transparency on our commitment to sustainability. \nPFAS\nFederal and state governments have increased their focus on efforts to safeguard communities from the potentially harmful effects associated with per- and polyfluoroalkyl substances (“PFAS”). PFAS are a large group of chemicals that have been used in industrial and consumer products since the 1940s, including in products as diverse as carpets, paints and stains, water-resistant clothing and fabrics, nonstick cookware, food packaging, and firefighting chemicals. Possible human health effects of exposure to certain PFAS compounds may include low infant birth weights, immune system impacts, or cancer. \nThere are a number of risks related to PFAS that could impact our business, and the EPA has prioritized PFAS-related issues in recent years. For example, in 2021, the EPA released its PFAS Strategic Roadmap, providing a high-level overview of activities that the agency intends to take to safeguard public health, protect the environment and hold polluters accountable. These actions include establishing drinking water standards, evaluating landfill discharges of PFAS in leachate, finalizing new risk assessments and test procedures and updating guidance on PFAS disposal and destruction options. In April 2024, the EPA finalized the designation of two PFAS compounds (perfluorooctanoic acid (PFOA) and perfluorooctanesulfonic acid (PFOS)) as hazardous substances under CERCLA. We are actively working with both Congress and the EPA to provide landfills and other essential public services with relief from CERCLA liability and instead hold accountable manufacturers and heavy users of these compounds. Without such relief, we may face increased exposure to remediation and litigation costs associated with properties that the EPA may designate as CERCLA sites due to the presence of PFAS. Additionally, in April 2024, the EPA announced the final National Primary Drinking Water Regulation for six PFAS compounds and established legally enforceable maximum contaminant levels, as well as non-enforceable maximum contaminant level goals for these PFAS compounds. We expect that there could be continued efforts to regulate or impose liability with respect to PFAS at the federal level. At the state level, an increasing number of jurisdictions have enacted new drinking water, surface water and/or groundwater limits for various PFAS compounds, which has led to a patchwork of PFAS standards across the U.S. Compliance with new and future state and federal PFAS standards is anticipated to result in additional expense to the Company, but such standards are also anticipated to present potential business opportunities in the area of PFAS management, treatment and disposal.\nRecycling; Foreign Import and Export Regulations and Material Restrictions\nRegulations affecting, and in some cases restricting, the international flow of certain recyclables have led to a reduction in export activity for such recyclables, as well as higher quality requirements, and higher processing costs. We do not ship plastics collected on our residential recycling routes and processed at our single stream recycling facilities to locations outside of North America; however, current and developing international regulations may limit our ability to export other commodities, including certain plastics. \nAdditionally, the new U.S. presidential administration has called for substantial changes to foreign trade policy. Significant new restrictions and tariffs on foreign trade could have a negative impact on our recycling export business and could increase the cost of certain equipment and other materials used in our operations that we procure from outside the U.S., including certain equipment used to implement our sustainability growth strategy.\nPrices and demand for recyclables fluctuate. We have discussed our sustainability growth strategy that includes planned and ongoing investments in our recycling business to increase automation and reduce labor dependency. Such investments are also targeted at addressing increases in regulatory- and customer-driven quality requirements for commodities. These investments increase our exposure to commodity price fluctuations. We mitigate some of the effects of price fluctuation through the contract terms pursuant to which we sell commodities, such as floor pricing. Additionally, \n21\n\n\nTable of Contents\nfuture regulation, tariffs, international trade policies or other initiatives, including extended producer responsibility regulations, minimum recycled content laws, container deposit laws, or regulations addressing climate change or GHG emissions, may impact supply and demand of material, or increase operating costs, which could impact the profitability of our recycling operations.\nWith a heightened awareness of the global problems caused by plastic waste in the environment, and actual or perceived risks for human health, many governments have passed ordinances banning certain types of plastics from sale or use. The most common materials banned include plastic bags and straws, polystyrene plastic and some types of single use packaging. These bans have resulted in increased pressure by manufacturers for our recycling facilities to accept a broader array of materials in curbside recycling and composting programs to alleviate public pressures to ban the sale of those materials. However, with no or limited viable end markets for many of these materials, we and other recyclers are working to educate and remind customers of the need for end market demand and economic viability to support the inclusion of certain materials in recycling programs. We are also making investments in end markets to support the collection and processing of some of these materials. With increased focus on responsible management of plastics, our procurement team has taken a proactive approach to help ensure environmental sustainability goals are prioritized in managing the products we buy. \nExtended Producer Responsibility\nRegulations establishing extended producer responsibility (“EPR”) are being considered or implemented in many places around the world, including in certain states in the U.S. and provinces in Canada. EPR regulations are designed to place either partial or total responsibility on producers of consumer-packaged goods and other products to fund the post-use life cycle of the products and packaging they create. Along with the funding responsibility, producers may be required to undertake additional responsibilities, such as taking over management of local recycling programs by taking back their products from end users or managing the collection operations and recycling processing and marketing infrastructure. During periods of economic difficulty, governmental entities have increased their interest in implementing EPR regulations to reduce municipal spending on recycling programs. There is no federal law establishing EPR in the U.S. or Canada; however, governments could take, and in some cases have taken, steps to implement EPR regulations for packaging, including traditional recyclables such as cardboard, bottles and cans. If wide-ranging EPR regulations were adopted, or other recycling-related regulations like container deposit laws were widely adopted, they could significantly impact the waste, recycling and other streams we manage, including with respect to quality and volume, and how we operate our business, including contract terms and pricing.\nTax Legislation\nThe Inflation Reduction Act of 2022 (“IRA”) contains several tax-related provisions, including with respect to (i) alternative fuel tax credits; (ii) tax incentives for investments in renewable energy production, carbon capture, and other climate actions and (iii) the overall measurement of corporate income taxes. Given the complexity and uncertainty around the applicability of the legislation to our specific facts and circumstances, we continue to analyze the IRA provisions to identify and quantify potential opportunities and applicable benefits included in the legislation. The provisions of the IRA related to alternative fuel tax credits secured approximately $60 million of annual pre-tax benefit (recorded as a reduction in our operating expense) from tax credits in 2023 and 2024. The alternative fuel credit expired at the end of 2024 and will not provide any future benefit to the Company absent further legislative action. With respect to the investment tax credit, we expect the cumulative benefit to be between $300 million and $400 million, a large portion of which is anticipated to be realized in 2024 through 2026. The expected benefit from the investment tax credit for 2025 and 2026 is dependent on a number of estimates and assumptions, including the timing of project completion. Finally, we expect that the production tax credit incentives for investments in renewable energy and carbon capture, as expanded by the IRA, will likely result in an incremental benefit to the Company, although at this time, the anticipated amount of such benefit has not been quantified due, in part, to the lack of regulatory guidance.\nInvestment in Natural Gas Vehicles and Infrastructure\nWe operate a large fleet of natural gas vehicles, and we plan to continue to invest in these assets for our collection fleet. Natural gas fueling infrastructure is not yet broadly available in the U.S. and Canada; as a result, we have constructed \n22\n\n\nTable of Contents\nand operate natural gas fueling stations, some of which also serve the public or pre-approved third parties. There is increasing pressure to reduce the use of fossil fuel in the heavy-duty truck industry, and some regulatory bodies are pursuing requirements for using alternative engine technology, such as electric powered vehicles, rather than natural gas or diesel vehicles. This is resulting in regulatory actions to advance the adoption of zero-emission vehicles and a shift away from tax incentives and grants for natural gas trucks and RNG infrastructure. For example, in April 2024, the EPA established new GHG emissions standards applicable to heavy-duty vehicles that rely on increased deployment of electric vehicles to meet declining emissions targets. California is also at various stages of regulation that would require heavy-duty vehicle fleets to phase-in zero-emissions vehicles. The extent to which states adopt standards similar to California’s into their own regulatory frameworks could accelerate the industry-wide adoption of electric powered vehicles. The full impact of these standards and regulations is uncertain, as several of the specific regulations are the subject of legal challenge, and could impact our long-term vehicle fleet strategies.\nCurrent options for heavy-duty electric powered vehicles lack sufficient range, recharging infrastructure and efficiency and proven experience for our operations, but we are proactively engaging in pilots of electric powered heavy-duty vehicles and anticipate that we could redirect future planned capital investments in our fleet toward these assets when the vehicles prove economically and operationally viable. We also are actively working with policymakers to help them understand the challenges involving the electrification of heavy-duty collection vehicles. If regulation requires widespread adoption of electric powered vehicles before the technology improves, we may suffer operational inefficiencies and incur higher operating costs. Regulation mandating an accelerated transition to electric powered vehicles would increase our cost to acquire vehicles needed to service our customers, and capital investment required to establish sufficient charging infrastructure could be significant. Additionally, the investments we have made in an industry-leading natural gas fleet and infrastructure could be impaired. Tax incentives and grants that advance the adoption of zero-emissions vehicles and lead to a shift away from natural gas trucks and RNG infrastructure would likely also negatively impact our investments in landfill gas-to-energy facilities.\nWM Renewable Energy\nIn recent years, we have discussed our sustainability growth strategy that includes significant planned and ongoing investments in our WM Renewable Energy segment. We have invested, and continue to invest, in facilities to capture methane produced from the Company’s landfills and process it into RNG and electricity. RNG produced from our landfills constitutes a significant source of fuel allocated to our natural gas collection vehicles. The primary drivers of renewable fuel development at our landfills are tax policies, such as the federal tax credits for RNG production and renewable electricity generation under the IRA, and federal and state incentive programs, such as the federal Renewable Fuel Standard (“RFS”) program, California Low Carbon Fuel Standard and similar state programs that promote the production and use of renewable transportation fuels. At the federal level, oil refiners and importers are required through the RFS program to blend specified volumes of various categories of renewable transportation fuels with gasoline or buy credits, referred to as Renewable Identification Numbers (“RINs”), from renewable fuel producers. Many of our facilities are EPA-registered producers of transportation fuel making compressed and liquefied RNG from landfill biogas, which qualifies as a cellulosic biofuel under the RFS program. The Company has invested, and continues to invest, in facilities that capture and process landfill gas into RNG so that we can participate in the RFS program, and the Company has grown and stated its intention to continue to grow its asset base to increase its RNG production.\nRINs prices generally respond to regulations enacted by the EPA, as well as fluctuations in supply and demand. The value of the RINs is set through a market established by the RFS program, which market has historically been very volatile. Prior to 2022, the EPA had promulgated rules on an annual basis establishing refiners’ obligations to purchase RNG and other cellulosic biofuels under the RFS program, which introduced a level of uncertainty into the renewable fuels and RINs market. However, in 2023, the EPA issued a rule establishing biofuel blending volumes under the RFS program for compliance years 2023 through 2025. The rule reflected the outsized role of biogas under the program, delivered on many reforms that benefit the solid waste sector, and recognized the continued growth of the market for RNG in vehicle applications. However, we cannot be certain that these changes, or the outcome of pending litigation challenging various aspects of the rule, will ultimately reduce volatility in the RINs market or that future rulemakings will be similarly favorable to our business. The new U.S. presidential administration could seek to reduce existing renewable fuel targets in a new rulemaking or otherwise set reduced targets for renewable fuels under the RFS program in future rulemakings. Moreover, consistent with its prior approach, the new administration may also increase the frequency with which it grants \n23\n\n\nTable of Contents\nsmall refinery exemptions from RFS program requirements. While we cannot predict what actions the new administration may take with respect to the RFS program, any changes to existing or future renewable fuel targets or more frequent approval of requests for small refinery exemptions could have a significant negative impact on demand for renewable fuels and the value of RINs. In an effort to mitigate against such risk and stabilize our RNG portfolio, we are pursuing long-term RNG sales transactions in the voluntary market. We continue to advocate for policies that could reduce the potential for volatility in the RINs market and ensure long-term stability for renewable transportation fuels, as changes in the RINs market or the structure of the RFS program can and has impacted the financial performance of our facilities. We are closely working with state policymakers and non-governmental stakeholders to understand the role of RNG as a renewable energy resource and in delivering GHG reductions.\nThe Company’s sustainability growth strategy also is informed by the increased adoption of state and Canadian clean fuel standard programs, utility policies, and voluntary market demand for RNG in transportation and industrial applications. Clean fuel standard programs, originally developed in California and subsequently adopted in Oregon, Washington, and New Mexico, establish annual carbon intensity benchmarks for transportation fuels that decrease over time. These programs operate similar to the RFS program in that certain regulated parties purchase credits from fuel producers, including RNG producers, to meet their carbon intensity obligations. Like RINs, clean fuel standard program credit values can fluctuate with policy and market dynamics. As such, we are advocating for existing programs to adopt measures to promote stability in credit pricing and for other states to adopt similar programs that incentivize the growth in RNG. We also are working closely with stakeholders to encourage the voluntary market for RNG demand, including utility RNG procurement programs, and sustainability protocols, as companies and other customers increasingly look to reduce their GHG emissions profiles. However, these state and voluntary programs may be altered, paused, or otherwise revoked by the applicable governmental authorities or as result of legal challenges. \nEnvironmental Justice\nGovernments are increasingly adopting requirements for environmental justice reviews as part of certain permitting decisions. These policies generally require permitting agencies to give heightened attention to the potential for projects to disproportionately impact low-income and minority communities. To that end, regulatory agencies have developed a number of screening tools, such as the EPA’s EJScreen, to aid and support relevant regulatory bodies in implementing various programs, such as permitting. Environmental justice considerations are also being increasingly adopted beyond permitting actions; for example, in rulemaking and enforcement priorities. In August 2023, the EPA announced that it would integrate environmental justice into each of its National Enforcement and Compliance Initiatives, and, in November 2023, the agency published a draft update to its Technical Guidance for Assessing Environmental Justice in Regulatory Analysis, which aims to provide agency analysts with the approaches and methods to use in evaluating environmental justice concerns in regulatory actions. Our Company supports policies seeking to advance high standards of environmental performance and the fair treatment of people of all races, cultures, and incomes, and we continue to proactively engage with local communities. We are actively monitoring recent regulatory developments in this area, particularly with respect to permitting, as additional conditions imposed on permitting decisions could increase the time and cost involved to pursue and maintain necessary authorizations.\nPrivacy and Information Security Regulation\nVarious U.S. and international laws and regulations related to data privacy, the protection of confidential information and secure information destruction services apply to our business. Applicable laws require businesses to provide notice under certain circumstances to individuals whose personal information has been disclosed in a data breach. Regulatory enforcement action concerning privacy and security is generally increasing, including significant fines imposed by regulators. Secure handling and disposal of waste that may contain sensitive information may be subject to heightened privacy requirements, and in the event of a breach, could result in regulatory penalties or wider enforcement action, reputational harm, and financial liabilities. \n​\n24\n\n\nTable of Contents",
  "item7": "Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results\n \nof Operations.\nThis section includes a discussion of our results of operations for the three years ended December 31, 2024. This discussion may contain forward-looking statements. See “Cautionary Statement about Forward-Looking Statements” in Part I of this Annual Report on Form 10-K for more information. Forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from our historical experience and our present expectations or anticipated results. These risks and uncertainties include, but are not limited to, those described in Part I, “Item 1A. \nRisk Factors\n” and elsewhere in this report and may also be described from time to time in our future reports filed with the U.S. Securities and Exchange Commission (“SEC”). The following discussion should be read considering those disclosures and together with the Consolidated Financial Statements and the notes thereto.\nOverview \nWe are North America’s leading provider of comprehensive environmental solutions, primarily providing services throughout the United States (“U.S.”) and Canada. We partner with our customers and the communities we serve to manage and reduce waste at each stage from collection to disposal, while recovering valuable resources and creating clean, renewable energy. We own or operate the largest network of landfills throughout the U.S. and Canada. In order to make disposal more practical for larger urban markets, where the distance to landfills is typically farther, we manage transfer stations that consolidate, compact and transport waste efficiently and economically. Our solid waste business is operated and managed locally by our subsidiaries that focus on distinct geographic areas and provide collection, transfer, disposal, recycling and resource recovery services. Through our subsidiaries, including our Waste Management Renewable Energy (“WM Renewable Energy”) segment, we are also a leading developer, operator and owner of landfill gas-to-energy facilities in the U.S. and Canada that produce renewable electricity and renewable natural gas, which is a significant source of fuel that we allocate to our natural gas fleet. Additionally, we are a leading recycler in the U.S. and Canada, handling materials that include paper, cardboard, glass, plastic and metal.\nStericycle Acquisition\nOn November 4, 2024, we completed our acquisition of all outstanding shares of Stericycle for $62.00 per share in cash, pursuant to an Agreement and Plan of Merger dated June 3, 2024. Total enterprise value of the acquisition was $7.2 billion (net of cash acquired) when including the assumption of $0.5 billion of debt and the repayment of approximately $0.8 billion of net debt. The acquisition expands our offerings in the U.S., Canada and parts of Western Europe. The post-closing operating results of Stericycle have been included in our Consolidated Financial Statements, as a new reportable segment referred to as WM Healthcare Solutions.\n46\n\n\nTable of Contents\nFor the year ended December 31, 2024, we incurred approximately $160 million of acquisition and integration related costs, which are primarily classified as “Selling, general and administrative expenses.” Refer to Note 19 for more information on the performance of our WM Healthcare Solutions segment.\nOur senior management evaluates, oversees and manages the financial performance of our business through five reportable segments, referred to as (i) Collection and Disposal - East Tier (“East Tier”); (ii) Collection and Disposal - West Tier (“West Tier”); (iii) Recycling Processing and Sales; (iv) WM Renewable Energy and (v) WM Healthcare Solutions. Our East and West Tiers along with certain ancillary services (“Other Ancillary”) that are not managed through our Tier segments, but that support our collection and disposal operations, form our “Collection and Disposal” businesses. We also provide additional services not managed through our five reportable segments, which are presented as Corporate and Other.\nCollection and Disposal\nOur Collection and Disposal businesses provide integrated environmental services, including collection, transfer, disposal and resource recovery services. We evaluate our Collection and Disposal businesses primarily through two geographic segments, East Tier and West Tier. Our East Tier primarily consists of geographic areas located in the Eastern U.S., the Great Lakes region and substantially all of Canada. Our West Tier primarily includes geographic areas located in the Western U.S., including the upper Midwest region, and British Columbia, Canada. Additionally, we provide Other Ancillary services that are not managed through the Tier segments but that support our collection and disposal operations. Other Ancillary includes specialized services performed for customers that have differentiated needs. These specialized services are targeted at large industrial customers managed through our Sustainability and Environmental Solutions (“SES”) business or geographically dispersed customers managed through our Strategic Business Solutions (“WMSBS”) business. Also included within Other Ancillary are the results of non-operating entities that provide financial assurance and self-insurance support for our business, net of intercompany activity.\nOur Collection and Disposal businesses’ operating revenues are primarily generated from fees charged for our collection, transfer, disposal and resource recovery services. Revenues from our collection operations are influenced by factors such as collection frequency, type of collection equipment furnished, type and volume or weight of the waste collected, distance to the disposal facility or recycling facility and our disposal costs. Revenues from our landfill operations consist of tipping fees, which are generally based on the type and weight or volume of waste being disposed of at our disposal facilities. Fees charged at transfer stations are generally based on the weight or volume of waste deposited, considering our cost of loading, transporting and disposing of the solid waste at a disposal site.\nIncluded within our Collection and Disposal businesses are landfills having (i) 20 third-party power generating facilities converting our landfill gas to fuel electricity generators; (ii) 16 third-party renewable natural gas (“RNG”) facilities processing landfill gas to be sold to natural gas suppliers and (iii) six third-party projects delivering our landfill gas by pipeline to industrial customers as a direct substitute for fossil fuels in industrial processes. In return for providing our landfill gas, we receive royalties from each facility, including the benefit of a 15% royalty from our WM Renewable Energy segment based on net operating revenue generated through the sale of RNG, renewable identification numbers (“RINs”), electricity and capacity, Renewable Energy Credits (“RECs”) and related environmental attributes from the 84 landfill beneficial use renewable energy projects owned by WM Renewable Energy on our active landfills, which is eliminated in consolidation.\nRecycling Processing and Sales\nOur Recycling Processing and Sales segment includes the processing and sales of materials collected from residential, commercial and industrial customers. The materials are delivered to and processed at one of our many recycling facilities. Through our brokerage business, we also manage the marketing of recycling commodities that are processed in our facilities and by third parties by maintaining comprehensive service centers that continuously analyze market prices, logistics, market demands and product quality. \nRecycling Processing and Sales revenues generally consist of tipping fees and the sale of recycling commodities to and/or on behalf of third parties. Our Recycling Processing and Sales segment excludes the collection of recycled materials \n47\n\n\nTable of Contents\nfrom our residential, commercial, and industrial customers which is included within our Collection and Disposal businesses.\nWM Renewable Energy\nOur WM Renewable Energy segment develops, operates and promotes projects for the beneficial use of landfill gas. Landfill gas is produced naturally as waste decomposes in a landfill. The methane component of the landfill gas is a readily available, renewable energy source that can be gathered and used beneficially as an alternative to fossil fuel. WM Renewable Energy converts landfill gas into several sources of renewable energy to be sold which include RNG, electricity and capacity, heat and/or steam. WM Renewable Energy also generates and sells (i) RINs under the Renewable Fuel Standard (“RFS”) program; (ii) other credits under a variety of state programs associated with the use of RNG in our compressed natural gas fleet and (iii) RECs associated with the production of electricity. The RINs, RECs, and other credits are sold to counterparties who are obligated under the regulatory programs and have a responsibility to procure RINs, RECs, and other credits proportionate to their fossil fuel production and imports. RINs and RECs prices generally fluctuate in response to regulations enacted by the Environmental Protection Agency (“EPA”) or other regulatory bodies, as well as changes in supply and demand. \nAs of December 31, 2024, we had 102 landfill gas beneficial use projects producing commercial quantities of methane gas at owned or operated landfills. For 65 of these projects, the processed gas is used to fuel electricity generators. The electricity is then sold to public utilities, municipal utilities or power cooperatives. For 23 of these projects, the gas is used at the landfill or delivered by pipeline to industrial customers as a direct substitute for fossil fuels in industrial processes. For 11 of these projects, the landfill gas is processed to pipeline quality RNG and then sold to natural gas suppliers. Additionally, three of these projects are on third-party landfills. The revenues from these facilities are primarily generated through the sale of RNG, RINs, electricity and capacity, heat and/or steam, RECs and related environmental attributes. WM Renewable Energy is charged a 15% royalty on net operating revenue from these facilities residing on our active and closed landfills from our Collection and Disposal and Corporate and Other businesses, which is eliminated in consolidation. Additionally, WM Renewable Energy operates and maintains seven third-party landfill beneficial gas use projects in return for service revenue. Our Collection and Disposal and Corporate and Other businesses benefit from these projects as well as 52 additional third-party landfill beneficial gas use projects in the form of royalties.\nWM Healthcare Solutions \nOur WM Healthcare Solutions segment includes (i) Regulated Waste and Compliance Services (“RWCS”) which provide compliance programs and collection, processing, and disposal of regulated and specialized waste, including medical, pharmaceutical and hazardous waste and (ii) Secure Information Destruction (“SID”) services, which provide for the collection of personal and confidential information for secure destruction and recycling of sorted office paper. RWCS are provided to customers in the U.S., Canada, Ireland and the United Kingdom (“U.K.”). SID services are provided to customers in the U.S., Belgium, Canada, France, Germany, Ireland, Luxembourg, the Netherlands and the U.K. \nOur WM Healthcare Solutions customers are primarily in the following industries: enterprise healthcare (i.e., hospitals, health systems, and national and corporate healthcare), practices and care providers (i.e., physician offices, surgery centers, veterinary clinics, nursing and long-term care facilities, dental clinics, clinics and urgent care, dialysis centers, and home health organizations), and pharmacy labs and research centers. Our WM Healthcare Solutions businesses also provide services to airports and seaports, education institutions, funeral homes and crematories, government and military, banks and professional services, and other businesses. While the WM Healthcare Solutions businesses manage large volumes of waste and other materials, the average volume per customer site is relatively small. \nOur customers typically enter into a contract for the provision of services on a scheduled basis, including weekly, monthly or on an as-needed basis over the contract term. Under the contract terms, the WM Healthcare Solutions businesses receive fees based on a monthly, quarterly or annual rate and/or fees based on contractual rates depending upon measures including the volume, weight, and type of waste. Operating revenues are invoiced based on the terms of the underlying contract either on a regular basis, or as services are performed and are generally due within a short period of time after invoicing based upon normal terms and conditions for our business type and the geography of the services performed.\n48\n\n\nTable of Contents\nAs of December 31, 2024, our WM Healthcare Solutions businesses include a global fleet of approximately 6,100 routed trucks, tractors, collection vans and small duty vehicles. Our WM Healthcare Solutions segment operates out of approximately 361 leased and owned facilities worldwide with 69 autoclaves or other alternative medical waste treatment facilities, 18 medical waste incinerator facilities, 107 SID processing facilities and 167 transfer stations. Included within our WM Healthcare Solutions segment are 35 locations that are classified as held for sale as of December 31, 2024.\nCorporate and Other\nWe also provide additional services that are not managed through our operating segments, which are presented in this report as Corporate and Other. This includes the activities of our corporate office, including costs associated with our long-term incentive program, expanded service offerings and solutions (such as our investments in businesses and technologies that are designed to offer services and solutions ancillary or supplementary to our current operations) as well as our closed sites. Also included within our Corporate and Other businesses closed sites are (i) six third-party power generating facilities converting our landfill gas to fuel electricity generators; (ii) two third-party projects delivering our landfill gas by pipeline to industrial customers as a direct substitute for fossil fuels in industrial processes and (iii) two third-party RNG facilities processing landfill gas to be sold to natural gas suppliers in return for a royalty. Additionally, Corporate and Other benefits from a 15% royalty from our WM Renewable Energy segment based on net operating revenue generated through the sale of RNG, RINs, electricity and capacity, RECs and related environmental attributes from the 15 landfill beneficial use renewable energy projects owned by WM Renewable Energy on our closed sites, which is eliminated in consolidation.\nIncluded in the fees we charge for our services is our energy surcharge and other charges that are intended to pass through costs to customers.\nBusiness Environment\nThe waste industry is a comparatively mature and stable industry. However, customers increasingly expect more of their waste materials to be recovered and those waste streams are becoming more complex. In addition, many state and local governments mandate diversion, recycling and waste reduction at the source and prohibit the disposal of certain types of waste at landfills. We monitor these developments to adapt our service offerings. As companies, individuals and communities look for ways to be more sustainable, we promote our comprehensive services that go beyond our core business of collecting and disposing of waste in order to meet their needs. This includes expanding traditional recycling services, increasing organics collection and processing, providing medical waste services and expanding our renewable energy projects to meet the evolving needs of our diverse customer base. As North America’s leading provider of comprehensive environmental solutions, we are taking big, bold steps to catalyze positive change – change that will impact our Company as well as the communities we serve. Consistent with our Company’s long-standing commitment to sustainability and environmental stewardship, we have published our 2024 Sustainability Report, providing details on our sustainability-related performance and outlining progress towards our 2030 sustainability goals. The Sustainability Report conveys the strong linkage between the Company’s sustainability goals and our growth strategy, inclusive of the planned and ongoing expansion of the Company’s Recycling Processing and Sales and WM Renewable Energy segments. The information in this report can be found at sustainability.wm.com but it does not constitute a part of, and is not incorporated by reference into, this Annual Report on Form 10-K. For further discussion see Item 1. \nBusiness – Regulation – Recent Developments and Focus Areas in Policy and Regulation\n.\nWe encounter intense competition from governmental, quasi-governmental and private service providers based on pricing, and to a much lesser extent, the nature of service offerings, particularly in the residential line of business. Our industry is directly affected by changes in general economic factors, including increases and decreases in consumer spending, business expansions and construction activity. These factors generally correlate to volumes of waste generated and impact our revenue. Negative economic conditions and other macroeconomic trends can and have caused customers to reduce their service needs. Such negative economic conditions, in addition to competitor actions, can impact our strategy to negotiate, renew, or expand service contracts and grow our business. We also encounter competition for acquisitions and growth opportunities. General economic factors and the market for consumer goods, in addition to regulatory developments, can also significantly impact commodity prices for the recyclable materials we sell. Significant components of our operating expenses vary directly as we experience changes in revenue due to volume and inflation. Volume changes \n49\n\n\nTable of Contents\ncan fluctuate significantly by line of business and volume changes in higher margin businesses can impact key financial metrics. We must dynamically manage our cost structure in response to volume changes and cost inflation.\nWe believe the Company’s industry-leading asset network and strategic focus on investing in our people and our digital platform will give the Company the necessary tools to address the evolving challenges impacting the Company and our industry. In line with our commitment to continuous improvement and a differentiated customer experience, we remain focused on our automation and optimization investments to enhance our operational efficiency and change the way we interact with our customers. Advancements made through these initiatives are intended to seamlessly and digitally connect all enterprise functions required to service customers and provide the best experience. We have made significant progress in executing this technology enablement strategy to automate and optimize certain elements of our service delivery model. The key benefits are reduced labor dependency on certain high-turnover jobs, particularly in customer experience, recycling and residential collection, while further elevating our customer self-service through digitalization and implementation of technologies to enhance the safety, reliability and efficiency within our collection operations. Additionally, in 2022, we implemented a new general ledger accounting system, complementary finance enterprise resource planning system and a human capital management system, which will continue to drive operational and service excellence by empowering our people through a modern, simplified and connected employee experience.\nWe sometimes experience margin pressures and variability in earnings and margins from our commodity-driven businesses, specifically within our Recycling Processing and Sales and WM Renewable Energy segments. While recycling commodity prices have recovered in 2024 from the low levels experienced in 2023, commodity prices are still below levels seen at the beginning of 2022. The impacts of commodity price fluctuations are not currently material to our WM Renewable Energy segment; however, as we continue to make investments to grow that segment, we may experience more significant impacts from fluctuations in the prices of electricity, natural gas, RINs and RECs. We continue to take proactive steps to adjust our business models to protect against the down-side risk of changes in commodity prices. \nVariability in economic conditions, including inflation, interest rates, employment trends and supply chain reliability, can create risk and uncertainty in financial outlook. We take proactive steps to recover and mitigate inflationary cost pressures through our overall pricing efforts and by managing our costs through efficiency, labor productivity, and investments in technology to automate certain aspects of our business. We remain committed to putting our people first to ensure that they are well positioned to execute our daily operations diligently and safely. We remain focused on delivering outstanding customer service, managing our variable costs with changing volumes and investing in technology that will enhance our customers’ experience and provide operating efficiencies intended to reduce our cost to serve.\nCurrent Year Financial Results\nDuring 2024, we continued to focus on our priorities to advance our strategy—enhancing employee engagement, reducing our cost to serve through the use of technology and automation, and investing in growth through acquisitions and our Recycling Processing and Sales and WM Renewable Energy segments. We invested approximately $8 billion, with $7.5 billion funded in cash and $0.5 billion as the assumption of debt, on acquisitions in 2024, including having completed our acquisition of Stericycle in early November. We remain diligent in offering competitive and differentiated services that meet the needs of our customers, and we are focused on driving operating efficiencies and reducing discretionary spend. We continue to invest in our people through paying a competitive market wage, investing in our digital platform and providing training for our team members. We also continue to make investments in automation and optimization to enhance our operational efficiency and improve labor productivity for all lines of business. This strategic focus, combined with strong operational execution, resulted in increased revenue, income from operations and income from operations margin in 2024 when compared to the prior year. During 2024, the Company allocated $3,231 million of available cash to capital expenditures. We also allocated $1,472 million of available cash to our shareholders during 2024 through dividends and common stock repurchases.\n50\n\n\nTable of Contents\nKey elements of our 2024 financial results include:\n●\nRevenues of $22,063 million for 2024 compared with $20,426 million in 2023, an increase of $1,637 million, or 8.0%. The increase is primarily attributable to (i) higher yield in our Collection and Disposal businesses; (ii) acquisitions, net of divestitures; (iii) increases in commodity prices in our Recycling and Sales and WM Renewable Energy segments and (iv) increased volumes. These increases were partially offset by a decrease in revenue from our energy surcharge program as a result of a decline in the price of fuel, particularly diesel;\n●\nOperating expenses of $13,383 million in 2024, or 60.7% of revenues, compared with $12,606 million, or 61.7% of revenues, in 2023. As a percentage of revenue, operating expenses improved significantly compared to the prior year as revenue growth from price, efficiency gains, improved employee retention and momentum in truck deliveries offset the impacts of inflationary increases in wages and other expenses. The increase in total operating expenses from prior year related primarily to (i) acquisitions; (ii) inflationary pressure on wages and expenses; (iii) higher recycling customer rebates resulting from an approximate 50% increase in single-stream recycling commodity prices; (iv) volume growth within our WMSBS business which relies more extensively on subcontracted hauling and services than our Collection and Disposal businesses; (v) increases in landfill operating costs, particularly for higher leachate costs due to wet weather and (vi) higher risk management spend, due in part, to increases in certain large loss claims reserves. These increases were partially offset by lower diesel fuel prices and an increase in gains on the sale of non-strategic assets in 2024 as compared with the prior year;\n●\nSelling, general and administrative expenses of $2,264 million in 2024, or 10.3% of revenues, compared with $1,926 million, or 9.4% of revenues, in 2023. The $338 million increase was primarily due to (i) costs incurred in connection with the acquisition and integration of Stericycle of which a significant portion were transaction and integration costs that are not expected to recur; (ii) increased labor costs from higher annual and long-term incentive compensation costs and annual wage increases and (iii) increased professional fees to support strategic initiatives. Partially offsetting these increases was a decline in litigation costs;\n●\nIncome from operations of $4,063 million, or 18.4% of revenues, in 2024 compared with $3,575 million, or 17.5% of revenues, in 2023.\n \nThe increase in the current year earnings was primarily driven by (i) revenue growth and improved performance within our Collection and Disposal businesses; (ii) impairments incurred in 2023 and (iii) higher RIN quantities generated and sold at higher market values in the current year;\n●\nNet income attributable to Waste Management, Inc. was $2,746 million, or $6.81 per diluted share, compared with $2,304 million, or $5.66 per diluted share, in 2023. The $442 million increase is due to an increase in income from operations discussed above, as well as lower income tax expense driven by benefits generated from our low-income housing investments and federal tax credits realized from our RNG investments. These increases were partially offset by\n \nhigher interest expense;\n●\nNet cash provided by operating activities was $5,390 million in 2024, compared with $4,719 million in 2023. The $671 million increase in net cash provided by operating activities was primarily driven by\n \n(i) higher earnings in our Collection and Disposal businesses; (ii) favorable changes in working capital, net of effects of acquisitions and divestitures and (iii) lower annual incentive compensation payments. This increase was partially offset by higher cash interest payments and income tax payments; and\n●\nFree cash flow was $2,317 million in 2024, compared with $1,902 million in 2023. The $415 million increase in free cash flow was primarily due to the increases in operating cash described above and increase in proceeds from the divestiture of non-strategic assets and businesses. These increases were partially offset by an increase in capital spending, which was driven by our planned and ongoing investments in our Recycling Processing and Sales and WM Renewable Energy segments and higher capital asset purchases in the current year to support our Collection and Disposal businesses. Free cash flow is a non-GAAP measure of liquidity. Refer to Free Cash Flow below for our definition of free cash flow, additional information about our use of this measure, and a reconciliation to net cash provided by operating activities, which is the most comparable GAAP measure.\n51\n\n\nTable of Contents\nResults of Operations\nOperating Revenues\nThe mix of operating revenues for the years ended December 31 are as follows (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nNet\n​\nIntercompany\n​\nGross\n​\n    \nOperating\n​\nOperating\n​\nOperating\n​\n​\nRevenues\n    \nRevenues(a)(b)\n    \nRevenues(b)\nYear Ended December 31:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024\n \n​\n​\n​\n​\n​\n​\n​\n​\nCommercial\n \n$\n 5,371\n​\n$\n 798\n​\n$\n 6,169\nIndustrial\n​\n \n 3,089\n​\n​\n 794\n​\n \n 3,883\nResidential\n​\n​\n 3,466\n​\n​\n 89\n​\n​\n 3,555\nOther collection\n​\n \n 2,964\n​\n \n 230\n​\n \n 3,194\nTotal collection\n​\n \n 14,890\n​\n \n 1,911\n​\n \n 16,801\nLandfill \n​\n​\n 3,445\n​\n​\n 1,513\n​\n​\n 4,958\nTransfer\n​\n​\n 1,381\n​\n​\n 1,067\n​\n​\n 2,448\nTotal Collection and Disposal\n​\n \n 19,716\n​\n \n 4,491\n​\n \n 24,207\nRecycling Processing and Sales \n​\n \n 1,603\n​\n \n 287\n​\n \n 1,890\nWM Renewable Energy\n​\n \n 318\n​\n \n 3\n​\n \n 321\nWM Healthcare Solutions\n​\n​\n 403\n​\n​\n 10\n​\n​\n 413\nCorporate and Other\n​\n​\n 23\n​\n​\n 25\n​\n​\n 48\nTotal\n​\n$\n 22,063\n​\n$\n 4,816\n​\n$\n 26,879\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2023\n​\n​\n​\n​\n​\n​\n​\n​\n​\nCommercial\n \n$\n 5,109\n​\n$\n 692\n​\n$\n 5,801\nIndustrial\n​\n \n 3,083\n​\n​\n 753\n​\n \n 3,836\nResidential\n​\n​\n 3,378\n​\n​\n 96\n​\n​\n 3,474\nOther collection\n​\n \n 2,786\n​\n \n 220\n​\n \n 3,006\nTotal collection\n​\n \n 14,356\n​\n \n 1,761\n​\n \n 16,117\nLandfill \n​\n​\n 3,252\n​\n​\n 1,479\n​\n​\n 4,731\nTransfer\n​\n​\n 1,257\n​\n​\n 1,036\n​\n​\n 2,293\nTotal Collection and Disposal\n​\n \n 18,865\n​\n \n 4,276\n​\n \n 23,141\nRecycling Processing and Sales \n​\n \n 1,264\n​\n \n 312\n​\n \n 1,576\nWM Renewable Energy\n​\n \n 273\n​\n \n 3\n​\n \n 276\nCorporate and Other \n​\n​\n 24\n​\n​\n 22\n​\n​\n 46\nTotal\n​\n$\n 20,426\n​\n$\n 4,613\n​\n$\n 25,039\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2022\n​\n​\n​\n​\n​\n​\n​\n​\n​\nCommercial\n \n$\n 4,860\n​\n$\n 590\n​\n$\n 5,450\nIndustrial\n​\n \n 3,025\n​\n​\n 656\n​\n \n 3,681\nResidential\n​\n​\n 3,264\n​\n​\n 75\n​\n​\n 3,339\nOther collection\n​\n \n 2,466\n​\n \n 217\n​\n \n 2,683\nTotal collection\n​\n \n 13,615\n​\n \n 1,538\n​\n \n 15,153\nLandfill \n​\n​\n 3,062\n​\n​\n 1,454\n​\n​\n 4,516\nTransfer\n​\n​\n 1,166\n​\n​\n 977\n​\n​\n 2,143\nTotal Collection and Disposal \n​\n \n 17,843\n​\n \n 3,969\n​\n \n 21,812\nRecycling Processing and Sales \n​\n \n 1,516\n​\n \n 244\n​\n \n 1,760\nWM Renewable Energy\n​\n \n 312\n​\n \n 3\n​\n \n 315\nCorporate and Other \n​\n​\n 27\n​\n​\n 22\n​\n​\n 49\nTotal\n​\n$\n 19,698\n​\n$\n 4,238\n​\n$\n 23,936\n52\n\n\nTable of Contents\n(a)\nIntercompany operating revenues reflect each segment’s total intercompany sales, including intercompany sales within a segment and between segments. Transactions within and between segments are generally made on a basis intended to reflect the market value of the service.\n(b)\nIn the fourth quarter of 2024, the Company adjusted gross and intercompany operating revenues to reflect the 15% royalty paid by WM Renewable Energy to Collection and Disposal and Corporate and Other businesses for the purchase of landfill gas. There was no change to net operating revenues. Prior periods were recast to conform to current year presentation.\nThe following table provides details associated with the period-to-period change in revenues and average yield for the year ended December 31 (dollars in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024 vs. 2023\n \n​\n​\n2023 vs. 2022\n \n​\n​\n​\n​\n​\nAs a % of\n​\n \n​\n​\n​\n​\nAs a % of\n \n​\n​\n​\n​\nAs a % of\n \n​\n​\n​\n​\nAs a % of\n \n​\n​\n​\n​\n​\nRelated\n​\n​\n​\n​\n​\nTotal\n \n​\n​\n​\n​\nRelated\n \n​\n​\n​\n​\nTotal\n \n​\n    \nAmount\n    \nBusiness(a)\n    \n  \nAmount\n    \nCompany(b)\n​\n    \nAmount\n    \nBusiness(a)\n    \n  \nAmount\n    \nCompany(b)\n​\nCollection and disposal\n​\n$\n 811\n​\n4.5 \n%\n​\n​\n​\n​\n​\n​\n​\n$\n 911\n​\n5.4 \n%\n​\n​\n​\n​\n​\n​\nRecycling Processing and Sales and WM Renewable Energy (c)\n​\n \n 271\n​\n17.1 \n​\n​\n \n​\n​\n​\n​\n​\n \n (381)\n​\n(20.2)\n​\n​\n \n​\n​\n​\n​\nEnergy surcharge and mandated fees \n​\n \n (97)\n​\n(9.9)\n​\n​\n \n​\n​\n​\n​\n​\n \n (104)\n​\n(9.7)\n​\n​\n \n​\n​\n​\n​\nTotal average yield (d)\n​\n \n​\n​\n​\n​\n​\n$\n 985\n​\n4.8 \n%\n​\n \n​\n​\n​\n​\n​\n$\n 426\n​\n2.1 \n%\nVolume (e)\n​\n \n​\n​\n​\n​\n​\n \n 88\n​\n0.4 \n​\n​\n \n​\n​\n​\n​\n​\n \n 150\n​\n0.8 \n​\nInternal revenue growth\n​\n​\n​\n​\n​\n​\n​\n​\n 1,073\n​\n5.2 \n​\n​\n​\n​\n​\n​\n​\n​\n​\n 576\n​\n2.9 \n​\nAcquisitions\n​\n​\n​\n​\n​\n​\n​\n​\n 584\n​\n2.9 \n​\n​\n​\n​\n​\n​\n​\n​\n​\n 186\n​\n0.9 \n​\nDivestitures\n​\n​\n​\n​\n​\n​\n​\n​\n (8)\n​\n —\n​\n​\n​\n​\n​\n​\n​\n​\n​\n (5)\n​\n —\n​\nForeign currency translation \n​\n​\n​\n​\n​\n​\n​\n​\n (12)\n​\n(0.1)\n​\n​\n​\n​\n​\n​\n​\n​\n​\n (29)\n​\n(0.1)\n​\nTotal\n​\n​\n​\n​\n​\n​\n​\n$\n 1,637\n​\n8.0 \n%\n​\n​\n​\n​\n​\n​\n​\n$\n 728\n​\n3.7 \n%\n(a)\nCalculated by dividing the increase or decrease for the current year by the prior year’s related business revenue adjusted to exclude the impacts of divestitures for the current year.\n(b)\nCalculated by dividing the increase or decrease for the current year by the prior year’s total Company revenue adjusted to exclude the impacts of divestitures for the current year.\n(c)\nIncludes combined impact of commodity price variability in both our Recycling Processing and Sales and WM Renewable Energy segments, as well as changes in certain recycling fees charged by our collection and disposal operations.\n(d)\nThe amounts reported herein represent the changes in our revenue attributable to average yield for the total Company.\n(e)\nIncludes activities from our Corporate and Other businesses.\nThe following provides further details about our period-to-period change in revenues:\nAverage Yield\nCollection and Disposal Average Yield\n — This measure reflects the effect on our revenue from the pricing activities of our collection, transfer and landfill operations, exclusive of volume changes. Revenue growth from Collection and Disposal average yield includes not only base rate changes and environmental and service fee fluctuations, but also (i) certain average price changes related to the overall mix of services, which are due to the types of services provided; (ii) changes in average price from new and lost business and (iii) price decreases to retain customers.\n53\n\n\nTable of Contents\nThe details of our revenue growth from Collection and Disposal average yield for the year ended December 31 are as follows (dollars in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n2024 vs. 2023\n \n2023 vs. 2022\n​\n​\n​\n​\n​\n​\n​\nAs a % of\n \n​\n​\n​\nAs a % of\n​\n​\n​\n​\n​\n​\n​\nRelated\n \n​\n​\n​\nRelated\n​\n​\n    \n​\nAmount\n \n    \n   \nBusiness\n    \nAmount\n \n    \n   \nBusiness\n \nCommercial\n​\n​\n$\n 327\n​\n6.2 \n%\n  \n$\n 321\n​\n6.5 \n%\nIndustrial\n​\n​\n \n 176\n​\n5.0 \n​\n \n 240\n​\n7.2 \n​\nResidential\n​\n​\n \n 200\n​\n6.2 \n​\n \n 191\n​\n6.1 \n​\nTotal collection\n​\n​\n \n 703\n​\n5.6 \n​\n \n 752\n​\n6.3 \n​\nLandfill\n​\n​\n \n 54\n​\n1.8 \n​\n \n 76\n​\n2.7 \n​\nTransfer\n​\n​\n \n 54\n​\n4.5 \n​\n \n 83\n​\n7.5 \n​\nTotal Collection and Disposal\n​\n​\n$\n 811\n​\n4.5 \n%\n  \n$\n 911\n​\n5.4 \n%\n​\nOur overall pricing efforts are focused on keeping pace with the increasing costs and capital intensity of our business. We are continuing to see growth in our landfill business with our municipal solid waste experiencing average yield of 3.1% in 2024.\nRecycling Processing and Sales and WM Renewable Energy —\n Recycling Processing and Sales revenues attributable to yield increased $245 million in 2024 and decreased $308 million in 2023, respectively, as compared with the prior year periods. Average market prices for single-stream recycled commodities increased approximately 50% in 2024 and decreased 40% in 2023 as compared with the prior year period. During 2023, the revenue decline from lower commodity pricing that started in 2022 was partially offset by higher pricing in our recycling brokerage business as well as our continued focus on a fee-based pricing model. Additionally, revenue in our WM Renewable Energy segment increased $26 million in 2024 and decreased $73 million in 2023 as compared with the prior year periods, primarily driven by fluctuations in energy prices and the value and quantity of RINs. While there may be short-term fluctuations in our commodity-driven businesses as prices change, we believe that our business models and processes appropriately mitigate the downside risk of changes in commodity prices.\nEnergy Surcharge and Mandated Fees — \nThese fees decreased $97 million and $104 million in 2024 and 2023, respectively, as compared to the prior year periods. Beginning in the second quarter of 2023, our energy surcharge was revised to incorporate market prices for both diesel and CNG. The decrease in energy surcharge revenues is primarily due to a decline in market prices for diesel fuel of approximately 10% in 2024 and 15% in 2023 as compared to the prior year periods. The mandated fees are primarily related to fees and taxes assessed by various state, county and municipal government agencies at our landfills and transfer stations. These amounts have not significantly impacted the change in revenue for the periods presented. \nVolume\nOur revenues from volume (excluding volumes from acquisitions and divestitures) increased $88 million, or 0.4%, and $150 million, or 0.8%, in 2024 and 2023, respectively, as compared with the prior year periods. Although our 2024 volume growth has moderated when compared to 2023, special waste and municipal solid waste tons at our landfills continue to be a significant driver of our growth. Additionally, in 2024 we saw an increase in volumes in our WMSBS business due to our continued focus on a differentiated service model for national accounts customers and our recycling activity, renewable energy projects and commercial collection business contributed to our overall volume growth. These increases were partially offset by a decrease in industrial collection volumes and the intentional shedding of low-margin residential collection business. Furthermore, our construction and demolition landfill volumes for the year ended December 31, 2024, declined as compared to prior year due to clean-up efforts in our East Tier from Hurricane Ian in 2023.\n54\n\n\nTable of Contents\nAcquisitions and Divestitures\nAcquisitions and divestitures resulted in a net increase in revenues of $576 million, or 2.9%, and $181 million, or 0.9%, in 2024 and 2023, respectively, as compared to the prior year periods. The 2024 increase was primarily due to our acquisition of Stericycle in November 2024. The remaining increases were related to our ongoing investment in tuck-in acquisitions of solid waste businesses.\nOperating Expenses\nOur operating expenses are comprised of (i) labor and related benefits costs (excluding labor costs associated with maintenance and repairs discussed below), which include salaries and wages, bonuses, related payroll taxes, insurance and benefits costs and the costs associated with contract labor; (ii) transfer and disposal costs, which include tipping fees paid to third-party disposal facilities and transfer stations; (iii) maintenance and repairs costs relating to equipment, vehicles and facilities and related labor costs; (iv) subcontractor costs, which include the costs of independent haulers who transport waste collected by us to disposal facilities and are affected by variables such as volumes, distance and fuel prices; (v) costs of goods sold, which includes the cost to purchase recycling materials for our Recycling Processing and Sales segment, including certain rebates paid to suppliers; (vi) fuel costs, net of tax credits for alternative fuel, which represent the costs of fuel to operate our truck fleet and landfill operating equipment; (vii) disposal and franchise fees and taxes, which include landfill taxes, municipal franchise fees, host community fees, contingent landfill lease payments and royalties; (viii) landfill operating costs, which include interest accretion on landfill liabilities, interest accretion on and discount rate adjustments to environmental remediation liabilities, leachate and methane collection and treatment, landfill remediation costs and other landfill site costs; (ix) risk management costs, which include general liability, automobile liability and workers’ compensation claims programs costs and (x) other operating costs, which include gains and losses on sale of assets, telecommunications, equipment and facility lease expenses, property taxes, utilities and supplies. Variations in volumes year-over-year, as discussed above in \nOperating Revenues\n, in addition to cost inflation, affect the comparability of the components of our operating expenses.\nThe following table summarizes the major components of our operating expenses for the year ended December 31 (dollars in millions and as a percentage of revenues):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n​\n    \n2023\n​\n  \n2022\n​\nLabor and related benefits\n​\n$\n 3,845\n    \n17.4 \n%  \n​\n$\n 3,669\n    \n18.0 \n%\n​\n$\n 3,452\n    \n17.5 \n%\nTransfer and disposal costs\n​\n \n 1,331\n​\n6.0 \n​\n​\n \n 1,273\n​\n6.2 \n​\n​\n \n 1,215\n​\n6.2 \n​\nMaintenance and repairs\n​\n \n 2,079\n​\n9.4 \n​\n​\n \n 1,978\n​\n9.7 \n​\n​\n \n 1,835\n​\n9.3 \n​\nSubcontractor costs\n​\n \n 2,240\n​\n10.2 \n​\n​\n \n 2,185\n​\n10.7 \n​\n​\n \n 2,006\n​\n10.2 \n​\nCost of goods sold\n​\n \n 1,048\n​\n4.7 \n​\n​\n \n 769\n​\n3.8 \n​\n​\n \n 973\n​\n4.9 \n​\nFuel\n​\n \n 437\n​\n2.0 \n​\n​\n \n 501\n​\n2.4 \n​\n​\n \n 592\n​\n3.0 \n​\nDisposal and franchise fees and taxes\n​\n \n 744\n​\n3.4 \n​\n​\n \n 736\n​\n3.6 \n​\n​\n \n 720\n​\n3.7 \n​\nLandfill operating costs\n​\n \n 524\n​\n2.4 \n​\n​\n \n 453\n​\n2.2 \n​\n​\n \n 421\n​\n2.1 \n​\nRisk management\n​\n \n 351\n​\n1.6 \n​\n​\n \n 320\n​\n1.6 \n​\n​\n \n 348\n​\n1.8 \n​\nOther\n​\n \n 784\n​\n3.6 \n​\n​\n \n 722\n​\n3.5 \n​\n​\n \n 732\n​\n3.7 \n​\n​\n​\n$\n 13,383\n​\n 60.7\n%  \n​\n$\n 12,606\n​\n61.7 \n%  \n​\n$\n 12,294\n​\n62.4 \n%\n​\nAs a percentage of revenue, operating expenses improved significantly compared to the prior year as revenue growth from price, efficiency gains, improved employee retention and momentum in truck deliveries offset the impacts of inflationary increases in wages and other expenses. The increase in total operating expenses from prior year related primarily to (i) acquisitions; (ii) inflationary pressure on wages and expenses; (iii) higher recycling customer rebates resulting from an approximate 50% increase in single-stream recycling commodity prices; (iv) volume growth within our WMSBS business which relies more extensively on subcontracted hauling and services than our Collection and Disposal businesses; (v) increases in landfill operating costs due to wet weather and (vi) higher risk management spend, due in part, to increases in certain large loss claims reserves. These increases were partially offset by lower diesel fuel prices and an increase in gains on the sale of non-strategic assets in 2024 as compared with the prior year.\nOur operating expenses increased in 2023, as compared with 2022, primarily due to (i) inflationary cost pressures, \n55\n\n\nTable of Contents\nparticularly for maintenance and repairs and subcontractor costs and (ii) labor cost pressure from frontline employee market wage adjustments. These increases were offset, in part, by commodity-driven business impacts, particularly from lower recycling rebates reflected in costs of goods sold and lower fuel prices. Our focus on operating efficiency and efforts to control our costs, along with revenue growth, enabled us to improve operating costs as a percent of revenues in 2023 as compared with 2022.\nSignificant items affecting the comparison of operating expenses between reported periods include: \nLabor and Related Benefits\n — Our investments in technology that focus on driving route optimization, improving driver retention, and creating efficiencies have positively impacted our labor and related benefits costs. The increase in costs in 2024, as compared with 2023, was primarily driven by (i) increased headcount from our recent acquisitions and (ii) annual employee wage increases and higher annual incentive compensation. These increases were offset, in part, by the benefit of productivity and operational efficiency gains. The increase in labor and related benefits costs in 2023, as compared with 2022, was primarily driven by (i) employee market wage adjustments; (ii) increased headcount primarily from acquisitions and (iii) increases in health and welfare costs and in medical care activity. These increases were offset, in part, by lower annual incentive compensation. \nTransfer and Disposal Costs\n — The increase in transfer and disposal costs in 2024, as compared with 2023, was primarily due to (i) inflationary cost increases, which includes increased disposal fees at third-party sites and higher rates from our third-party haulers and (ii) incremental third-party transfer and disposal costs as a result of our recent acquisitions. These cost increases were offset, in part, by decreases in industrial and residential collection volumes.\n \nThe increase in transfer and disposal costs in 2023, as compared with 2022, was primarily due to inflationary cost increases, which includes increased disposal fees at third-party sites and higher rates from our third-party haulers, offset, in part, by a decrease in collection volumes.\nMaintenance and Repairs\n — The increase in maintenance and repairs costs in 2024, as compared with 2023, was primarily driven by (i) inflationary and acquisition related cost increases for parts, supplies and third-party services, and (ii) annual wage increases and higher technician headcount. These cost increases were offset, in part, by an improvement in new truck deliveries, which require less maintenance than older trucks, (ii) fleet rationalization efforts that removed older trucks and reduced our fleet count and (iii) improvements in operational efficiencies. The increase in maintenance and repairs costs in 2023, as compared with 2022, was primarily driven by (i) continued inflationary cost increases for parts, supplies and third-party services, although the impact of such inflationary cost increases moderated throughout the year and (ii) labor cost increases for our technicians, including additional headcount.\nSubcontractor Costs\n — The increase in subcontractor costs in 2024, as compared with 2023, was primarily due to (i) an increase in volumes in our WMSBS business, which relies more extensively on subcontracted hauling and services than our Collection and Disposal businesses (ii) continued inflationary cost increases related to labor costs from third-party haulers and (iii) our recent acquisitions. These increases were offset, in part, by the impact of lower fuel prices on third-party subcontracted hauling and services. The increase in subcontractor costs in 2023, as compared with 2022, was primarily due to (i) an increase in volumes in our WMSBS and SES businesses, which rely more extensively on subcontracted hauling and services than other parts of our Collection and Disposal businesses and (ii) continued inflationary cost increases, particularly labor and other costs from third-party haulers. \nCost of Goods Sold — \nThe increase in cost of goods sold in 2024, as compared with 2023, was primarily driven by an approximate 50% increase in single-stream recycling commodity prices. The decrease in cost of goods sold in 2023, as compared with 2022, was primarily driven by a 40% decrease in average single-stream recycling commodity prices.\nFuel — \nThe decrease in fuel costs was primarily due to a decrease of approximately 10% in average market prices for diesel fuel in 2024 and 15% in 2023. \nDisposal and Franchise Fees and Taxes — \nThe increase in disposal and franchise fees and taxes in 2024, as compared with 2023, was primarily driven by an increase in landfill volumes and an overall rate increase in fees and taxes paid to municipalities on our disposal volumes. The increase in disposal and franchise fees and taxes in 2023, as compared with 2022, was primarily driven by an overall rate increase in fees and taxes paid to municipalities on our disposal volumes. \n56\n\n\nTable of Contents\nLandfill Operating Costs — \nThe increase in landfill operating costs in 2024, as compared with 2023, was primarily due to (i) higher leachate collection and treatment and site maintenance costs which can largely be attributed to particularly wet weather in certain markets throughout 2024 and (ii) increased methane collection and treatment costs. Our landfill operating costs increased in 2023, as compared with 2022, primarily due to (i) higher expenses for interest accretion on landfill and environmental remediation liabilities and (ii) an increase in remediation expense due to changes in measurement of certain environmental remediation obligations.\n​\nRisk Management\n — The increase in risk management in 2024, as compared with 2023, was primarily due to (i) adjustments to our reserves for certain large loss claims; (ii) higher auto and workers compensation claims costs and (iii) increases in premiums for property coverage. These increases were offset, in part, by current year insurance recoveries for property claims associated with a fire and natural disasters. Risk management costs decreased in 2023, as compared with 2022, primarily due to lower levels of large loss claims.\n​\nOther \n— Other operating costs increased in 2024, as compared with 2023, primarily due to (i) our recent acquisitions (ii) higher supply chain rebates in 2023 and (iii) a prior year favorable litigation settlement, which reduced our expenses in that period. These increases were offset, in part, by gains on the sales of non-strategic assets in 2024. Other operating costs decreased in 2023, as compared with 2022, primarily due to (i) supply chain rebates in 2023 and (ii) a favorable litigation settlement, which were offset, in part, by (i) inflationary cost pressures, although the impact of such continued inflationary cost increases moderated throughout the year; (ii) higher utility costs at our facilities; (iii) an increase in business travel and (iv) higher equipment rental costs.\n \nSelling, General and Administrative Expenses \nOur selling, general and administrative expenses consist of (i) labor and related benefits costs, which include salaries, bonuses, related insurance and benefits, contract labor, payroll taxes and equity-based compensation; (ii) professional fees, which include fees for consulting, legal, audit and tax services; (iii) provision for bad debts, which includes allowances for uncollectible customer accounts and collection fees and (iv) other selling, general and administrative expenses, which include, among other costs, facility-related expenses, voice and data telecommunication, advertising, bank charges, computer costs, travel and entertainment, rentals, postage and printing. In addition, the financial impacts of litigation reserves generally are included in our “Other” selling, general and administrative expenses.\nThe following table summarizes the major components of our selling, general and administrative expenses for the year ended December 31 (dollars in millions and as a percentage of revenues):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n​\n    \n2023\n​\n    \n2022\n​\nLabor and related benefits\n​\n$\n 1,400\n    \n 6.4\n%\n​\n$\n 1,205\n    \n 5.9\n%\n​\n$\n 1,195\n    \n 6.1\n%\nProfessional fees\n​\n \n 358\n​\n 1.6\n​\n​\n \n 228\n​\n 1.1\n​\n​\n \n 268\n​\n 1.4\n​\nProvision for bad debts\n​\n \n 51\n​\n 0.2\n​\n​\n \n 56\n​\n 0.3\n​\n​\n \n 50\n​\n 0.2\n​\nOther\n​\n \n 455\n​\n 2.1\n​\n​\n \n 437\n​\n 2.1\n​\n​\n \n 425\n​\n 2.1\n​\n​\n​\n$\n 2,264\n​\n 10.3\n%\n​\n$\n 1,926\n​\n 9.4\n%\n​\n$\n 1,938\n​\n 9.8\n%\n​\nSelling, general and administrative expenses in 2024, as compared with 2023, have increased due to (i) severance and consulting costs incurred in connection with the acquisition and integration of Stericycle, of which a significant portion are transaction and integration costs that are not expected to recur; (ii) increased labor costs from higher annual and long-term incentive compensation and annual wage increases and (iii) increased professional fees to support strategic initiatives. Partially offsetting these increases was a decline in litigation costs.\n​\nSelling, general and administrative expenses in 2023, as compared with 2022, decreased primarily due to (i) reduced professional fees in connection with investments in our digital platform, as certain digital projects have moved from higher cost development activities to implementation activities, and (ii) lower annual incentive compensation costs. These decreases were partially offset by annual wage increases and increased litigation costs.\n \n​\n57\n\n\nTable of Contents\nSignificant items affecting the comparison of our selling, general and administrative expenses between reported periods include: \nLabor and Related Benefits\n — The increase in labor and related benefits costs in 2024, as compared with 2023, was primarily related to (i) costs incurred in connection with our acquisition of Stericycle, including severance costs and additional headcount; (ii) higher annual and long-term incentive compensation costs and (iii) annual employee wage increases.\n \nThe increase in labor and related benefits costs in 2023, as compared with 2022, was primarily related to (i) annual wage increases for our employees; (ii) market adjustments for deferred compensation plans related to investment performance and (iii) higher long-term incentive compensation costs, partially offset by lower annual incentive compensation costs and lower contract labor expenses.\nProfessional Fees\n — The increase in professional fees in 2024, as compared with 2023, was primarily attributable to legal, consulting and accounting costs incurred to support strategic initiatives, including our acquisition of Stericycle. The decrease in professional fees in 2023, as compared with 2022, was primarily attributable to reduced expenses in connection with investments in our digital platform.\nOther — \nThe increase in other expenses in 2024, as compared with 2023, was primarily related to (i) risk management costs incurred in connection with the acquisition and integration of Stericycle and (ii) increased spend across multiple cost categories including technology and travel. These cost increases were partially offset by a decline in litigation costs. The increase in other expenses in 2023, as compared with 2022, was primarily related to (i) increased litigation costs; (ii) increased bank charges and (iii) higher advertising spend, which were partially offset by lower travel expenses and lower telecommunication costs. \nDepreciation, Depletion and Amortization Expenses\nThe following table summarizes the components of our depreciation, depletion and amortization expenses for the year ended December 31 (dollars in millions and as a percentage of revenues):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n​\n    \n2023\n​\n    \n2022\n \nDepreciation of tangible property and equipment\n​\n$\n 1,292\n    \n 5.9\n%\n​\n$\n 1,197\n    \n 5.9\n%\n​\n$\n 1,155\n    \n 5.9\n%\nDepletion of landfill airspace\n​\n \n 795\n​\n 3.6\n​\n​\n \n 745\n​\n 3.6\n​\n​\n \n 754\n​\n 3.8\n​\nAmortization of intangible assets\n​\n \n 180\n​\n 0.8\n​\n​\n \n 129\n​\n 0.6\n​\n​\n \n 129\n​\n 0.6\n​\n​\n​\n$\n 2,267\n​\n10.3 \n%\n​\n$\n 2,071\n​\n10.1 \n%\n​\n$\n 2,038\n​\n10.3 \n%\n​\nThe increase in depreciation of tangible property and equipment in 2024, as compared with 2023, was driven by (i) increased investments in capital assets such as trucks and containers and (ii) the acquisition of Stericycle. The increase in depletion of landfill airspace in 2024, as compared to with 2023, was driven by changes in amortization rates from revisions in landfill estimates and volume increases, partially offset by the closure of a landfill in our East Tier. The increase in amortization of intangibles was driven by the amortization of acquired intangible assets. \nThe increase in depreciation of tangible property and equipment in 2023, as compared with 2022, was mainly influenced by strategic investments in our digital platform and investments in capital assets to service our customers, such as machinery and containers. The decrease in depletion of landfill airspace in 2023, as compared with 2022, was primarily driven by reductions in volume partially offset by the reopening of a previously closed site in our East Tier. \n58\n\n\nTable of Contents\n(Gain) Loss from Divestitures, Asset Impairments and Unusual Items, Net\nThe following table summarizes the major components of (gain) loss from divestitures, asset impairments and unusual items, net for the year ended December 31 (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n    \n2024\n    \n2023\n    \n2022\nGain from divestitures, net\n​\n$\n (26)\n​\n$\n —\n​\n$\n (5)\nAsset impairments\n​\n \n 90\n​\n \n 275\n​\n \n 50\nOther, net\n​\n \n 18\n​\n \n (32)\n​\n \n 17\n​\n​\n$\n 82\n​\n$\n 243\n​\n$\n 62\n​\nDuring the year ended December 31, 2024, we recognized $82 million of net charges primarily consisting of (i) a $54 million charge required to increase the estimated fair value of a liability associated with the expected disposition of an investment the Company holds in a waste diversion technology business; (ii) a $14 million loss associated with the divestiture of a minority investment in a medical waste company within Corporate and Other, in connection with our acquisition of Stericycle and (iii) a $13 million charge pertaining to reserves for loss contingencies in our Corporate and Other segment to adjust an indirect wholly-owned subsidiary’s estimated potential share of the liability for a proposed environmental remediation plan at a closed site, as discussed in Note 10 to the Consolidated Financial Statements for further information.\nDuring the year ended December 31, 2023, we recognized $243 million of net charges primarily consisting of (i) a $168 million goodwill impairment charge within our Recycling Processing and Sales segment related to a business engaged in accelerating film and plastic wrap recycling capabilities, with $22 million attributable to noncontrolling interests. This charge was partially offset by the recognition of $46 million of income related to the reversal of a liability for contingent consideration associated with our investment in such business; (ii) $107 million of impairment charges within Corporate and Other for certain investments in waste diversion technology businesses and (iii) a $17 million charge within Corporate and Other to adjust an indirect wholly owned subsidiary’s estimated potential share of the liability for a proposed environmental remediation plan at a closed site. Refer to Notes 5 and 10 to the Consolidated Financial Statements for further information. \nDuring the year ended December 31, 2022, we recognized $62 million of net charges consisting of (i) $50 million of asset impairment charges primarily related to management’s decision to close two landfills within our East Tier and (ii) a $17 million charge pertaining to reserves for loss contingencies within Corporate and Other to adjust an indirect wholly owned subsidiary’s estimated potential share of the liability for a proposed environmental remediation plan at a closed site, as discussed in Note 10 to the Consolidated Financial Statements. These losses were partially offset by a $5 million gain from the divestiture of a collection and disposal operation in our West Tier.\n \nSee Note 2 to the Consolidated Financial Statements for additional information related to the accounting policy and analysis involved in identifying and calculating impairments. See Note 19 to the Consolidated Financial Statements for additional information related to the impact of impairments on the results of operations of our reportable segments.\n59\n\n\nTable of Contents\nIncome from Operations\nThe following table summarizes income from operations for the year ended December 31 (dollars in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPeriod-to-\n \n​\n​\n​\nPeriod-to-\n​\n​\n​\n​\n​\n​\n​\n​\n​\nPeriod\n \n​\n​\n​\nPeriod\n​\n​\n​\n​\n​\n    \n2024\n    \nChange\n    \n2023\n    \nChange\n    \n2022\n​\nCollection and Disposal:\n \n​\n  \n \n​\n  \n    \n  \n​\n​\n  \n \n​\n  \n    \n  \n​\n​\n​\n  \nEast Tier \n​\n$\n 2,760\n​\n$\n 314\n \n12.8 \n%  \n$\n 2,446\n​\n$\n 268\n \n12.3 \n%  \n$\n 2,178\n​\nWest Tier\n​\n​\n 2,693\n​\n​\n 310\n​\n13.0 \n​\n​\n 2,383\n​\n​\n 201\n​\n9.2 \n​\n​\n 2,182\n​\nOther Ancillary\n​\n \n (9)\n​\n \n (1)\n \n*\n​\n \n (8)\n​\n \n (8)\n \n*\n​\n \n —\n​\nCollection and Disposal \n​\n \n 5,444\n​\n \n 623\n \n12.9 \n​\n \n 4,821\n​\n \n 461\n \n10.6 \n​\n \n 4,360\n​\nRecycling Processing and Sales \n​\n​\n 86\n​\n​\n 130\n​\n*\n​\n​\n (44)\n​\n​\n (172)\n​\n*\n​\n​\n 128\n​\nWM Renewable Energy\n​\n \n 99\n​\n \n 20\n \n25.3 \n​\n \n 79\n​\n \n (53)\n \n(40.2)\n​\n \n 132\n​\nWM Healthcare Solutions\n​\n​\n (69)\n​\n​\n (69)\n \n*\n​\n​\n —\n​\n​\n —\n​\n*\n​\n​\n —\n​\nCorporate and Other\n​\n​\n (1,497)\n​\n​\n (216)\n​\n16.9 \n​\n​\n (1,281)\n​\n​\n (26)\n​\n2.1 \n​\n​\n (1,255)\n​\nTotal\n​\n$\n 4,063\n​\n$\n 488\n \n13.7 \n%  \n$\n 3,575\n​\n$\n 210\n \n6.2 \n%  \n$\n 3,365\n​\nPercentage of revenues\n​\n​\n 18.4\n%\n​\n​\n \n​\n​\n​\n 17.5\n%\n​\n​\n​\n​\n​\n​\n 17.1\n%\n* Percentage change does not provide a meaningful comparison.\nCollection and Disposal —\n The most significant items affecting the results of operations of our Collection and Disposal businesses during the three years ended December 31, 2024 are summarized below:\n●\nIncome from operations in our Collection and Disposal businesses increased in 2024, as compared with 2023, \nprimarily due to (i) our focus on pricing our services to keep pace with inflationary cost pressures, alongside intentional efforts to improve efficiency and operating costs incurred to serve our customers; (ii) contributions from higher landfill volumes generated from special waste and municipal solid waste and (iii) gains on the sales of non-strategic assets. These increases were partially offset by (i) a decline in contributions from lower industrial volumes; (ii) an increase in landfill operating costs and (iii) increased depreciation expenses with relation to our fleet, machinery and equipment as well as higher depletion costs at our landfills\n.\n●\nIncome from operations in our Collection and Disposal businesses increased in 2023, as compared with 2022, primarily due to revenue growth in our collection and disposal operations driven by both yield and volume. This increase was partially offset by (i) inflationary cost pressures, particularly for maintenance and repairs and subcontractor costs and (ii) labor cost pressure from frontline employee market wage adjustments.\n \nRecycling Processing and Sales\n — Income from operations in our Recycling Processing and Sales segment increased in 2024, as compared with 2023, primarily due to (i) net charges of $122 million recognized in 2023 related to a goodwill impairment and reversal of contingent consideration, as discussed below and (ii) benefits from the automation of our recycling facilities as well as investments in new facilities and cost management. These improvements were partially offset by the impact of higher costs incurred from the temporary shutdown of facilities for technology upgrades.\n​\nIncome from operations in our Recycling Processing and Sales segment decreased in 2023, as compared with 2022, primarily due to (i) a $168 million goodwill impairment charge, with $22 million attributable to noncontrolling interests, which was partially offset by the recognition of $46 million of income related to the reversal of contingent consideration as discussed above in \n(Gain) Loss from Divestitures, Asset Impairments and Unusual Items, Net\n; (ii) a decline in recycling commodity prices; (iii) lower revenue resulting from the temporary shutdown of facilities for technology upgrades combined with increased costs associated with the transportation and third-party tip fees for processing recyclables and (iv) startup costs linked to the establishment of a new processing facility. \n​\nWM Renewable Energy\n — Income from operations in our WM Renewable Energy segment increased in 2024, as compared with 2023, primarily due to (i) higher RIN quantities generated and sold at higher market values in the current year and (ii) increased beneficial use of landfill gas sold to third parties due to the completion of additional projects. Income from operations in our WM Renewable Energy segment decreased in 2023, as compared with 2022, primarily due to (i) lower energy prices and the value of RINs and (ii) increased operating and selling, general and administrative costs \n60\n\n\nTable of Contents\nassociated with the construction of new projects to increase the beneficial use of landfill gas. These decreases were partially offset by an increase in volume of RFS credits, electricity and natural gas.\n​\nWM Healthcare Solutions \n— Our WM Healthcare Solutions segment generated a loss of $69 million in 2024, which was largely attributable to acquisition and integration related expenses. There is no 2023 or 2022 activity as Stericycle was acquired on November 4, 2024.  \nCorporate and Other\n — The costs incurred by our Corporate and Other segment increased in 2024, as compared with 2023, primarily due to (i) increased professional and transaction fees to support strategic initiatives, including our acquisition of Stericycle; (ii) higher annual and long-term incentive compensation costs and (iii) an increase in risk management costs due to an increase in our large loss reserves as well as higher auto and workers compensation claims. This increase was partially offset by the impact of non-cash impairment charges for certain investments incurred in 2023, as discussed below.\nIncome from operations in Corporate and Other decreased in 2023, as compared with 2022, primarily due to impairment charges of (i) $107 million for certain investments in waste diversion technology businesses and (ii) $17 million to adjust an indirect wholly-owned subsidiary’s estimated potential share of the liability for a proposed environmental remediation plan at a closed site. \nInterest Expense, Net\nOur interest expense, net was $598 million, $500 million and $378 million in 2024, 2023 and 2022, respectively. The increase in interest expense, net for 2024 is primarily related to an increase in our average debt balances to fund our acquisition of Stericycle. The increase in interest expense, net for 2023 is primarily related to an increase in our weighted average borrowing rate of approximately 80 basis points due to increased rates on floating-rate debt and higher fixed rates on refinancing as well as an increase in average debt balances to fund growth. Partially offsetting these increases were benefits from higher capitalized interest and increases in interest income as a result of higher cash and cash equivalent balances as well as higher investment rates. See Note 6 to the Consolidated Financial Statements for more information related to our debt balances.\nLoss on Early Extinguishment of Debt, Net \nIn October 2024, we drew $5.2 billion of borrowings under the Term Credit Agreement that were applied to funding our acquisition of Stericycle. In November 2024, we repaid all outstanding borrowings with net proceeds from our November 2024 issuance of $5.2 billion of senior notes and contemporaneously terminated the Term Credit Agreement, resulting in a \n$7 million loss on early extinguishment of debt.\nEquity in Net Income (Losses) of Unconsolidated Entities\nWe recognized equity method investment income of $4 million in 2024 and losses of $60 million and $67 million in 2023 and 2022, respectively. These financial statement impacts are largely related to our noncontrolling interests in entities established to invest in and manage low-income housing properties. In 2024, we adopted Accounting Standards Update (“ASU”) 2023-02, and, as a result, beginning in 2024, the amortization of these investments is recognized as a component of income tax expense. Refer to Notes 2 and 8 to the Consolidated Financial Statements for further discussion. We generate tax benefits, including tax credits, from the losses incurred from these investments. The losses are more than offset by the tax benefits generated by these investments as further discussed in Notes 8 and 18 to the Consolidated Financial Statements. \nIncome Tax Expense\nWe recorded income tax expense of $713 million, $745 million and $678 million in 2024, 2023 and 2022, respectively, resulting in effective income tax rates of 20.6%, 24.7% and 23.2% for the years ended December 31, 2024, 2023 and 2022, respectively. The comparability of our income tax expense for the reported periods has been primarily affected by the following:\n61\n\n\nTable of Contents\n●\nRenewable Natural Gas — \nThrough our subsidiaries, including our WM Renewable Energy segment, we have invested in building landfill gas-to-energy facilities in the U.S. and Canada that produce renewable electricity and RNG. We expect our new RNG facilities to qualify for federal tax credits and to realize those credits through 2027 under Sections 48 and 45Z of the Internal Revenue Code. We completed construction of five RNG facilities in 2024 and one RNG facility in 2023, resulting in a reduction to our income tax expense of $137 million and $8 million, respectively, for investment tax credits under Section 48 (additional information related to these tax credits is included below under the Tax Legislation section);\n●\nLow-Income Housing\n \n— As a result of adopting ASU 2023-02, we amortize our investments in these entities using the proportional amortization method. Under the proportional amortization method, the equity investment is amortized in proportion to the income tax credits and other income tax benefits received. The amortization expense and the income tax credits are required to be presented on a net basis in income tax expense on the Consolidated Statements of Operations. Prior to fiscal year 2024, we accounted for our investments in these entities using the equity method of accounting, recognizing our share of each entity’s results of operations and other reductions in the value of our investments in equity in net income (losses) of unconsolidated entities, within our Consolidated Statements of Operations. W\ne recognized additional income tax expense of $78 million in 2024, related to amortization under ASU 2023-02. We recognized net losses of $66 million and $65 million in 2023 and 2022, respectively, and a reduction in our income tax expense of $104 million, $108 million and $99 million in 2024, 2023, and 2022, respectively, primarily due to federal tax credits realized from these investments as well as the tax benefits from the pre-tax losses realized. \nSee Notes 2, 8, and 18 to the Consolidated Financial Statements for additional information related to these unconsolidated variable interest entities;\n●\nTax Implications of Impairments\n — During the years ended December 31, 2024 and 2023, we recognized additional income tax expense of $14 million and $50 million, respectively, due to non-cash impairment charges that were not deductible for tax purposes in the year of impairment. The non-cash impairment charge recognized during 2022 was deductible for tax purposes. See Note 11 to the Consolidated Financial Statements for more information related to our impairment charges; and\n●\nTax Legislation\n — The Inflation Reduction Act of 2022 (“IRA”) contains several tax-related provisions, including with respect to (i) alternative fuel tax credits; (ii) tax incentives for investments in renewable energy production, carbon capture, and other climate actions and (iii) the overall measurement of corporate income taxes. Given the complexity and uncertainty around the applicability of the legislation to our specific facts and circumstances, we continue to analyze the IRA provisions to identify and quantify potential opportunities and applicable benefits included in the legislation. The provisions of the IRA related to alternative fuel tax credits secure approximately $60 million of annual pre-tax benefit (recorded as a reduction in our operating expense) from tax credits in 2023 and 2024. The alternative fuel credit expired at the end of 2024 and will not provide any future benefit to the Company absent further legislative action. With respect to the investment tax credit, we expect the cumulative benefit to be between $300 million and $400 million, a large portion of which is anticipated to be realized in 2024 through 2026. The expected benefit from the investment tax credit for 2025 and 2026 is dependent on a number of estimates and assumptions, including the timing of project completion. Finally, we expect that the production tax credit incentives for investments in renewable energy and carbon capture, as expanded by the IRA, will likely result in an incremental benefit to the Company, although at this time, the anticipated amount of such benefit has not been quantified due, in part, to the lack of regulatory guidance. \nSee Note 8 to the Consolidated Financial Statements for more information related to income taxes.\n62\n\n\nTable of Contents\nLandfill and Environmental Remediation Discussion and Analysis\nWe owned or operated 257 solid waste landfills and five secure hazardous waste landfills as of December 31, 2024 and 258 solid waste landfills and five secure hazardous waste landfills as of December 31, 2023. For these landfills, the following table reflects changes in capacity, as measured in tons of waste, for the year ended December 31 and remaining airspace, measured in cubic yards of waste, as of December 31 (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024\n​\n2023\n​\n​\nRemaining\n​\n​\n​\n​\n​\nRemaining\n​\n​\n​\n​\n​\n​\nPermitted\n​\n Expansion\n​\nTotal\n​\nPermitted\n​\nExpansion\n​\nTotal\n​\n​\nCapacity\n​\nCapacity\n​\nCapacity\n​\nCapacity\n​\nCapacity\n​\nCapacity\nBalance as of beginning of year (in tons)\n​\n 5,211\n​\n 161\n​\n 5,372\n​\n 5,165\n​\n 190\n​\n 5,355\nAcquisitions, divestitures, newly permitted landfills and closures\n \n —\n \n 8\n \n 8\n \n —\n \n —\n \n —\nChanges in expansions pursued (a)\n \n —\n \n 58\n \n 58\n \n —\n \n 138\n \n 138\nExpansion permits granted (b)\n \n 64\n \n (64)\n \n —\n \n 168\n \n (168)\n \n —\nDepletable tons received\n \n (125)\n \n —\n \n (125)\n \n (123)\n \n —\n \n (123)\nChanges in engineering estimates and other (c) \n \n 24\n \n 2\n \n 26\n \n 1\n \n 1\n \n 2\nBalance as of end of year (in tons) (d)\n \n 5,174\n \n 165\n \n 5,339\n \n 5,211\n \n 161\n \n 5,372\nBalance as of end of year (in cubic yards) (d)\n \n 5,049\n \n 165\n \n 5,214\n \n 5,079\n \n 180\n \n 5,259\n(a)\nAmounts reflected here relate to the combined impacts of (i) new expansions pursued; (ii) increases or decreases in the airspace being pursued for ongoing expansion efforts; (iii) adjustments for differences between the airspace being pursued and airspace granted and (iv) decreases due to decisions to no longer pursue expansion permits, if any.\n(b)\nWe received expansion permits at 11 of our landfills during 2024 and 13 of our landfills during 2023, demonstrating our continued success in working with municipalities and regulatory agencies to expand the disposal airspace of our existing landfills.\n(c)\nChanges in engineering estimates can result in changes to the estimated available remaining airspace of a landfill or changes in the utilization of such landfill airspace, affecting the number of tons that can be placed in the future. Estimates of the amount of waste that can be placed in the future are reviewed annually by our engineers and are based on a number of factors, including standard engineering techniques and site-specific factors such as current and projected mix of waste type; initial and projected waste density; estimated number of years of life remaining; depth of underlying waste; anticipated access to moisture through precipitation or recirculation of landfill leachate and operating practices. We continually focus on improving the utilization of airspace through efforts that may include recirculating landfill leachate where allowed by permit; optimizing the placement of daily cover materials and increasing initial compaction through improved landfill equipment, operations and training.\n(d)\nSee Note 2 to the Consolidated Financial Statements for discussion of converting remaining cubic yards of airspace to tons of capacity.\nThe depletable tons received at our landfills for the year ended December 31 are shown below (tons in thousands):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n2024\n​\n2023\n​\n    \n# of\n    \nDepletable\n    \nTons per\n    \n# of\n    \nDepletable\n    \nTons per\n​\n    \nSites\n    \nTons\n    \nDay\n    \nSites\n    \nTons\n    \nDay\nSolid waste landfills (a)\n \n 257\n​\n 124,271\n \n 456\n \n 258\n \n 122,141\n \n 450\nHazardous waste landfills\n \n 5\n \n 626\n \n 2\n \n 5\n \n 658\n \n 2\n​\n \n 262\n \n 124,897\n \n 458\n \n 263\n \n 122,799\n \n 452\nSolid waste landfills closed, divested or lease or other contractual agreement expired during related year\n \n —\n \n 113\n \n  \n \n —\n \n —\n \n  \n​\n \n  \n \n 125,010\n​\n  \n \n  \n \n 122,799\n​\n  \n(a)\nAs of December 31, 2024 and 2023, we had 15 and 17 landfills, respectively, which were not accepting waste.\n63\n\n\nTable of Contents\nAs of December 31, 2024, we owned or managed 239 sites that are either in closure or post-closure, have received a certification post-closure, or are regulated under a remedial action plan.\nBased on remaining permitted airspace as of December 31, 2024 and projected annual disposal volume, the weighted average remaining landfill life for all of our owned or operated landfills is approximately 38 years. Many of our landfills have the potential for expanded airspace beyond what is currently permitted. We monitor the availability of permitted airspace at each of our landfills and evaluate whether to pursue an expansion at a given landfill based on estimated future disposal volume, disposal prices, construction and operating costs, remaining airspace and likelihood of obtaining an expansion permit. We are seeking expansion permits at 18 of our landfills that meet the expansion criteria outlined in the \nCritical Accounting Estimates and Assumptions — Landfills \nsection below. Although no assurances can be made that all future expansions will be permitted or permitted as designed, the weighted average remaining landfill life for all owned or operated landfills is approximately 39 years when considering remaining permitted airspace, expansion airspace and projected annual disposal volume.\nThe number of landfills owned or operated as of December 31, 2024, segregated by their estimated operating lives based on remaining permitted and expansion airspace and projected annual disposal volume, was as follows:\n​\n​\n​\n​\n​\n    \n # of Landfills\n​\n0 to 5 years\n \n 28\n​\n6 to 10 years\n \n 22\n​\n11 to 20 years\n \n 53\n​\n21 to 40 years\n \n 62\n​\n41+ years\n \n 97\n​\nTotal\n \n 262\n(a)\n(a)\nOf the 262 landfills, 221 are owned, 29 are operated under lease agreements and 12 are operated under other contractual agreements. For the landfills not owned, we are usually responsible for final capping, closure and post-closure obligations.\nLandfill Assets —\n We capitalize various costs that we incur to prepare a landfill to accept waste. These costs generally include expenditures for land (including the landfill footprint and required landfill buffer property), permitting, excavation, liner material and installation, landfill leachate collection systems, landfill gas collection systems, environmental monitoring equipment for groundwater and landfill gas, directly related engineering, capitalized interest, and on-site road construction and other capital infrastructure costs. The cost basis of our landfill assets also includes estimates of future costs associated with landfill final capping, closure and post-closure activities, which are discussed further below.\nThe changes to the cost basis of our landfill assets and accumulated landfill airspace depletion for the year ended December 31, 2024 are reflected in the table below (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n​\n​\n    \nAccumulated\n    \n​\nNet Book\n​\n​\nCost Basis of\n​\nLandfill Airspace\n​\n​\nValue of\n​\n    \nLandfill Assets\n    \nDepletion\n    \nLandfill Assets\nDecember 31, 2023\n​\n$\n 19,473\n​\n$\n (11,643)\n​\n$\n 7,830\nCapital additions\n​\n \n 832\n​\n \n —\n​\n \n 832\nAsset retirement obligations incurred and capitalized\n​\n \n 91\n​\n \n —\n​\n \n 91\nDepletion of landfill airspace\n​\n \n —\n​\n \n (795)\n​\n \n (795)\nForeign currency translation\n​\n \n (100)\n​\n \n 47\n​\n \n (53)\nAsset retirements and other adjustments\n​\n \n (23)\n​\n \n 132\n​\n \n 109\nDecember 31, 2024\n​\n$\n 20,273\n​\n$\n (12,259)\n​\n$\n 8,014\n​\nAs of December 31, 2024, we estimate that we will spend approximately $845 million in 2025, and approximately $1.8 billion in 2026 and 2027 combined, for the construction and development of our landfill assets. The specific timing \n64\n\n\nTable of Contents\nof landfill capital spending is dependent on future events and spending estimates are subject to change due to fluctuations in landfill waste volumes, changes in environmental requirements and other factors impacting landfill operations.\nLandfill and Environmental Remediation Liabilities —\n As we accept waste at our landfills, we incur significant asset retirement obligations, which include liabilities associated with landfill final capping, closure and post-closure activities. These liabilities are accounted for in accordance with authoritative guidance on accounting for asset retirement obligations and are discussed in Note 2 to the Consolidated Financial Statements. We also have liabilities for the remediation of properties that have incurred environmental damage, which generally was caused by operations or for damage caused by conditions that existed before we acquired operations or a site. We recognize environmental remediation liabilities when we determine that the liability is probable and the cost for the likely remedy can be reasonably estimated.\nThe changes to landfill and environmental remediation liabilities for the year ended December 31, 2024 are reflected in the table below (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\nEnvironmental\n​\n    \nLandfill\n    \nRemediation\nDecember 31, 2023\n​\n$\n 2,853\n​\n$\n 209\nObligations incurred and capitalized\n​\n \n 91\n  \n \n —\nObligations settled\n​\n \n (136)\n  \n \n (23)\nInterest accretion\n​\n \n 133\n  \n \n —\nRevisions in estimates and interest rate assumptions\n​\n \n 121\n  \n \n 36\nAcquisitions, divestitures and other adjustments \n​\n \n (5)\n  \n \n —\nDecember 31, 2024\n​\n$\n 3,057\n​\n$\n 222\n​\nLandfill Operating Costs —\n The following table summarizes our landfill operating costs for the year ended December 31 (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n    \n2024\n    \n2023\n    \n2022\nInterest accretion on landfill and environmental remediation liabilities\n​\n$\n 133\n​\n$\n 130\n​\n$\n 112\nLeachate and methane collection and treatment\n​\n \n 230\n​\n \n 196\n​\n \n 193\nLandfill remediation costs and discount rate adjustments to environmental remediation liabilities and recovery assets\n​\n \n 18\n​\n \n 7\n​\n \n (2)\nOther landfill site costs\n​\n \n 143\n​\n \n 120\n​\n \n 118\nTotal landfill operating costs\n​\n$\n 524\n​\n$\n 453\n​\n$\n 421\n​\nDepletion of Landfill Airspace\n — Depletion of landfill airspace, which is included as a component of depreciation, depletion and amortization expenses, includes the following:\n●\nthe depletion of landfill capital costs, including (i) costs that have been incurred and capitalized and (ii) estimated future costs for landfill development and construction required to develop our landfills to their remaining permitted and expansion airspace; and\n●\nthe depletion of asset retirement costs arising from landfill final capping, closure and post-closure obligations, including (i) costs that have been incurred and capitalized and (ii) projected asset retirement costs.\nDepletion expense is recorded on a units-of-consumption basis, applying cost as a rate per ton. The rate per ton is calculated by dividing each component of the depletable basis of a landfill (net of accumulated depletion) by the number of tons needed to fill the corresponding asset’s remaining permitted and expansion airspace. Landfill capital costs and closure and post-closure asset retirement costs are generally incurred to support the operation of the landfill over its entire operating life and are, therefore, depleted on a per-ton basis using a landfill’s total permitted and expansion airspace. Final capping asset retirement costs are related to a specific final capping event and are, therefore, depleted on a per-ton basis using each discrete final capping event’s estimated permitted and expansion airspace. Accordingly, each landfill has multiple per-ton depletion rates.\n65\n\n\nTable of Contents\nThe following table presents our landfill airspace depletion expense on a per-ton basis for the year ended December 31:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\n    \n2022\nDepletion of landfill airspace (in millions)\n​\n$\n 795\n​\n$\n 745\n​\n$\n 754\nTons received, net of redirected waste (in millions)\n​\n \n 125\n​\n \n 123\n​\n \n 125\nAverage landfill airspace depletion expense per ton\n​\n$\n 6.36\n​\n$\n 6.07\n​\n$\n 6.05\n​\nDifferent per-ton depletion rates are applied at each of our 262 landfills, and per-ton depletion rates vary significantly from one landfill to another due to (i) inconsistencies that often exist in construction costs and provincial, state and local regulatory requirements for landfill development and landfill final capping, closure and post-closure activities and (ii) differences in the cost basis of landfills that we develop versus those that we acquire. Accordingly, our landfill airspace depletion expense measured on a per-ton basis can fluctuate due to changes in the mix of volumes we receive across the Company each year. \nLiquidity and Capital Resources \nThe Company consistently generates annual cash flow from operations that meets and exceeds our working capital needs, allows for payment of our dividends, investment in the business through capital expenditures and tuck-in acquisitions, and funding of strategic sustainability growth investments. We continually monitor our actual and forecasted cash flows, our liquidity and our capital resources, enabling us to plan for our present needs and fund unbudgeted business requirements that may arise during the year. The Company believes that its investment grade credit ratings, diverse investor base, large value of unencumbered assets and modest leverage enable it to obtain adequate financing, and refinance upcoming maturities, as necessary to meet its ongoing capital, operating, strategic and other liquidity requirements. We also have the ability to manage liquidity during periods of significant financial market disruption through temporary modification of our capital expenditure and share repurchase plans. \nSummary of Contractual Obligations \nThe following table summarizes our significant contractual obligations as of December 31, 2024 (other than recorded obligations related to liabilities associated with environmental remediation costs and non-cancelable operating lease obligations, which are discussed further in Notes 3 and 7 to the Consolidated Financial Statements, respectively) and the anticipated effect of these obligations on our liquidity in future years (in millions): \n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n \n​\n  \n2025\n  \n2026\n  \n2027\n  \n2028\n  \n2029\n  \nThereafter\n  \nTotal\nRecorded Obligations:\n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \n \n​\n  \nFinal capping, closure and post-closure liabilities (a)\n​\n$\n 177\n​\n$\n 223\n​\n$\n 265\n​\n$\n 197\n​\n$\n 166\n​\n$\n 3,762\n​\n$\n 4,790\nDebt payments (b)\n​\n \n 2,613\n​\n \n 747\n​\n \n 2,022\n​\n \n 1,969\n​\n \n 2,048\n​\n \n 14,680\n​\n \n 24,079\nUnrecorded Obligations:\n​\n \n​\n​\n \n  \n​\n \n  \n​\n \n  \n​\n \n  \n​\n \n  \n​\n \n​\nInterest on debt (c)\n​\n \n 928\n​\n \n 888\n​\n \n 838\n​\n \n 736\n​\n \n 647\n​\n \n 5,168\n​\n \n 9,205\nEstimated unconditional purchase obligations (d)\n​\n \n 274\n​\n \n 270\n​\n \n 142\n​\n \n 96\n​\n \n 68\n​\n \n 556\n​\n \n 1,406\nAnticipated liquidity impact as of December 31, 2024\n​\n$\n 3,992\n​\n$\n 2,128\n​\n$\n 3,267\n​\n$\n 2,998\n​\n$\n 2,929\n​\n$\n 24,166\n​\n$\n 39,480\n(a)\nIncludes liabilities for final capping, closure and post-closure costs recorded in our Consolidated Balance Sheet as of December 31, 2024, without the impact of discounting and inflation. Our recorded liabilities for final capping, closure and post-closure costs will increase as we continue to place additional tons within the permitted airspace at our landfills.\n(b)\nThese amounts represent the scheduled principal payments based on their contractual maturities related to our long-term debt and financing leases, excluding interest. Refer to Note 6 to the Consolidated Financial Statements for additional information regarding our debt obligations.\n(c)\nInterest on our fixed-rate debt was calculated based on contractual rates and interest on our variable-rate debt was calculated based on interest rates as of December 31, 2024. As of December 31, 2024, we had $251 million of accrued interest related to our debt obligations.\n66\n\n\nTable of Contents\n(d)\nOur obligations represent purchase commitments from which we expect to realize an economic benefit in future periods. We have also made certain guarantees that we do not expect to materially affect our current or future financial position, results of operations or liquidity. See Note 10 to the Consolidated Financial Statements for discussion of the nature and terms of our unconditional purchase obligations and guarantees. \nSummary of Cash and Cash Equivalents, Restricted Funds and Debt Obligations\nThe following is a summary of our cash and cash equivalents, restricted funds and debt balances as of December 31 (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\nCash and cash equivalents\n​\n$\n 414\n​\n$\n 458\nRestricted funds:\n​\n \n  \n​\n \n​\nInsurance reserves\n​\n$\n 385\n​\n$\n 376\nFinal capping, closure, post-closure and environmental remediation funds\n​\n​\n 128\n​\n​\n 119\nOther\n​\n \n —\n​\n \n 17\nTotal restricted funds (a)\n​\n$\n 513\n​\n$\n 512\nDebt:\n​\n \n  \n​\n \n  \nCurrent portion\n​\n$\n 1,359\n​\n$\n 334\nLong-term portion\n​\n \n 22,541\n​\n \n 15,895\nTotal debt\n​\n$\n 23,900\n​\n$\n 16,229\n(a)\nAs of December 31, 2024 and 2023, $100 million and $90 million, respectively, of these account balances was included in other current assets in our Consolidated Balance Sheets.\nDebt \n— We use long-term borrowings in addition to the cash we generate from operations as part of our overall financial strategy to support and grow our business. We primarily use senior notes and tax-exempt bonds to borrow on a long-term basis, but we also use other instruments and facilities, when appropriate. The components of our borrowings as of December 31, 2024 are described in Note 6 to the Consolidated Financial Statements.\nAs of December 31, 2024, we had approximately $4.0 billion of debt maturing within the next 12 months, including (i) $1.4 billion of tax-exempt bonds with term interest rate periods that expire within the next 12 months, which is prior to their scheduled maturities; (ii) $1.2 billion of short-term borrowings under our commercial paper program (net of related discount on issuance); (iii) $422 million of 3.125% senior notes that mature in March 2025; (iv) $500 million of 0.750% senior notes that mature in November 2025 and (v) $438 million of other debt with scheduled maturities within the next 12 months, including $298 million of tax-exempt bonds. As of December 31, 2024, we have classified $2.6 billion of debt maturing in the next 12 months as long term because we have the intent and ability to refinance these borrowings on a long-term basis as supported by the forecasted available capacity under our $3.5 billion long-term U.S. and Canadian revolving credit facility (“$3.5 billion revolving credit facility”). The remaining $1.4 billion of debt maturing in the next 12 months is classified as current obligations.\n67\n\n\nTable of Contents\nSenior Notes \n— In July 2024, WMI issued $750 million of 4.950% senior notes due July 2027 and $750 million of 4.950% notes due July 2031, the net proceeds of which were $1.49 billion. The net proceeds were used primarily to reduce outstanding borrowings under our commercial paper program. We also repaid $156 million of WMI’s 3.500% senior notes upon maturity in May 2024. \n​\nIn August 2024, WMI entered into a delayed draw Term Credit Agreement in a principal amount of up to $7.2 billion (the “Term Credit Agreement”). In October 2024, we drew $5.2 billion of borrowings under the Term Credit Agreement that were applied to funding our acquisition of Stericycle. In November 2024, we repaid all outstanding borrowings and contemporaneously terminated the Term Credit Agreement, resulting in a $7 million loss on early extinguishment of debt. See Note 6 to the Consolidated Financial Statements for further discussion.\n​\nIn November 2024, we issued senior notes, the net proceeds of which were approximately $5.2 billion, consisting of (i) $1.0 billion of 4.500% senior notes due March 2028; (ii) $700 million of 4.650% senior notes due March 2030; (iii) $750 million of 4.800% senior notes due March 2032; (iv) $1.5 billion of 4.950% senior notes due March 2035; and (v) $1.25 billion of 5.350% senior notes due October 2054. We used the net proceeds to repay all outstanding borrowing under the Term Credit Agreement.\n​\nStericycle Exchange Offer and Consent Solicitation — \nOn November 8, 2024, we completed our private offer to eligible holders to exchange $500 million of outstanding 3.875% senior notes issued by Stericycle (the “Stericycle Notes”) for new notes issued by us (the “WM Notes”) and cash. The WM Notes have the same interest rate, interest payment dates, and maturity date as the exchanged Stericycle Notes but differ in certain respects from the Stericycle Notes, including with respect to the redemption provisions. Approximately $485 million in aggregate principal amount of the Stericycle Notes, or 97%, were tendered and accepted, and new WM Notes were issued. The portion of Stericycle Notes not exchanged, approximately $15 million, remains an outstanding obligation of Stericycle, our wholly-owned subsidiary. The debt exchange is accounted for as a modification of debt, as the financial terms of the WM Notes do not differ from the Stericycle Notes, and there is no substantial difference between the present value of cash flows under each respective set of notes. In connection with the exchange offer, we solicited and obtained sufficient consents to amend the Stericycle Notes and related indenture to eliminate substantially all the restrictive covenants, restrictive provisions and events of default, other than payment-related, guarantee-related and bankruptcy-related events of default, and such amendments took effect with respect to the remaining Stericycle Notes on November 8, 2024.\n​\nWe have credit lines in place to support our liquidity and financial assurance needs. The following table summarizes our outstanding letters of credit, categorized by type of facility as of December 31 (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\nRevolving credit facility (a)\n​\n$\n 224\n​\n$\n 180\nOther letter of credit lines (b)\n​\n \n 862\n​\n \n 834\n​\n​\n$\n 1,086\n​\n$\n 1,014\n(a)\nAs of December 31, 2024 and 2023, we had an unused and available credit capacity of $2.1 billion and $2.5 billion, respectively.\n(b)\nAs of December 31, 2024, these other letter of credit lines are uncommitted with terms extending through December 2028. \nGuarantor Financial Information\nWM Holdings has fully and unconditionally guaranteed all of WMI’s senior indebtedness. WMI has fully and unconditionally guaranteed all of WM Holdings’ senior indebtedness. None of WMI’s other subsidiaries have guaranteed any of WMI’s or WM Holdings’ debt. In lieu of providing separate financial statements for the subsidiary issuer and guarantor (WMI and WM Holdings), we have presented the accompanying supplemental summarized combined balance sheet and income statement information for WMI and WM Holdings on a combined basis after elimination of intercompany transactions between WMI and WM Holdings and amounts related to investments in any subsidiary that is a non-guarantor (in millions):\n​\n68\n\n\nTable of Contents\n​\n​\n​\n​\n​\n    \nDecember 31,\n2024\nBalance Sheet Information:\n​\n​\n​\nCurrent assets\n \n$\n 15\nNoncurrent assets\n​\n​\n 14\nCurrent liabilities\n​\n \n 1,367\nNoncurrent liabilities:\n​\n​\n​\nAdvances due to affiliates\n​\n​\n 15,328\nOther noncurrent liabilities\n​\n \n 20,140\n​\n​\n​\n​\n​\n​\n    \nYear Ended\n​\n​\nDecember 31, 2024\nIncome Statement Information:\n​\n​\n​\nRevenue\n \n$\n —\nOperating income\n​\n​\n (547)\nNet loss\n​\n​\n (405)\n​\n​\nSummary of Cash Flow Activity\nThe following is a summary of our cash flows for the year ended December 31 (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\n    \n2022\nNet cash provided by operating activities\n​\n$\n 5,390\n​\n$\n 4,719\n​\n$\n 4,536\nNet cash used in investing activities\n​\n$\n (10,601)\n​\n$\n (3,091)\n​\n$\n (3,063)\nNet cash provided by (used in) financing activities\n​\n$\n 5,155\n​\n$\n (1,524)\n​\n$\n (1,216)\n​\nNet Cash Provided by Operating Activities —\n \n \nOur operating cash flows increased in 2024, as compared with 2023, by $671 million primarily driven by (i) higher earnings in our Collection and Disposal businesses; (ii) favorable changes in working capital, net of effects of acquisitions and divestitures and (iii) lower annual incentive compensation payments. This increase was partially offset by higher cash interest and income tax payments.\nOur operating cash flows increased in 2023, as compared with 2022, by $183 million primarily driven by higher earnings attributable to our Collection and Disposal businesses and lower income tax payments as a result of a deposit of approximately $103 million that was made to the IRS in 2022 related to a disputed tax matter discussed within Note 8 to the Consolidated Financial Statements. These increases were partially offset by (i) unfavorable changes in working capital, net of effects of acquisitions and divestitures; (ii) higher interest payments and (iii) higher incentive compensation payments. \nNet Cash Used in Investing Activities —\n The most significant items affecting the comparison of our investing cash flows for the periods presented are summarized below:\n●\nAcquisitions — \nOur spending on acquisitions was $7,503 million, $173 million and $377 million in 2024, 2023 and 2022, respectively, of which $7,488 million, $170 million and $377 million, respectively, are considered cash used in investing activities. The remaining spend is cash used in financing activity related to the timing of contingent consideration paid. Excluding our acquisition of Stericycle in 2024, substantially all of the remaining acquisitions are related to our solid waste and recycling businesses. \n●\nCapital Expenditures —\n We used $3,231 million, $2,895 million and $2,587 million for capital expenditures in 2024, 2023 and 2022, respectively. The increase in capital spending in 2024 is primarily driven by (i) our planned and ongoing investments in our Recycling Processing and Sales and WM Renewable Energy segments; (ii) an increase in truck spending in the current year due to supply chain constraints on truck deliveries in the prior year and (iii) capital expenditures within our WM Healthcare Solutions segment to support the business. The increase in 2023 is primarily driven by our planned and ongoing investments in our Recycling Processing and Sales and WM Renewable Energy segments, as well as \ninflationary increases in many fixed asset categories required to support ongoing operations and investments in the Company’s landfills to reduce greenhouse gas emissions\n.\n69\n\n\nTable of Contents\nThe Company continues to maintain a disciplined focus on capital management to prioritize investments for expansion, the replacement of aging assets and assets that support our strategy of differentiation and continuous improvement through efficiency and innovation. The Company expects to invest $3.0 billion in growth investments across the recycling and renewable energy platforms from 2022 to 2026, which includes the $1.7 billion already invested in 2023 and 2024.\n●\nDivestitures —\n Proceeds from divestitures of businesses and other assets, net of cash divested, were $158 million, $78 million and $27 million in 2024, 2023 and 2022, primarily as the result of the sale of certain non-strategic assets.\n●\nOther, Net —\n Our spending within other, net was $40 million, $104 million and $126 million in 2024, 2023 and 2022, respectively. During 2024, 2023 and 2022, we used $4 million, $61 million and $23 million, respectively, of cash from restricted cash and cash equivalents to invest in available-for-sale securities.\n \nDuring 2024, 2023 and 2022, we used $33 million, $20 million and $28 million, respectively, to make initial cash payments associated with low-income housing investments. In 2022, we also used $67 million to fund secured convertible promissory notes associated with an acquisition.\nNet Cash Provided by (Used in) Financing Activities —\n The most significant items affecting the comparison of our financing cash flows for the periods presented are summarized below:\n●\nDebt Borrowings (Repayments) — \nThe following summarizes our cash borrowings and repayments of debt for the year ended December 31 (in millions):\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\n    \n2022\nBorrowings\n:\n \n​\n  \n​\n​\n  \n​\n​\n  \nCommercial paper program\n \n$\n 12,678\n​\n$\n 17,799\n​\n$\n 6,596\nTerm loan (a)\n​\n​\n 5,200\n​\n​\n —\n​\n​\n 1,000\nSenior notes\n​\n​\n 6,650\n​\n​\n 3,207\n​\n​\n 992\nTax-exempt bonds\n​\n​\n 50\n​\n​\n 300\n​\n​\n 100\n​\n \n$\n 24,578\n​\n$\n 21,306\n​\n$\n 8,688\nRepayments\n:\n \n \n  \n​\n \n  \n​\n \n  \nCommercial paper program\n \n$\n (12,319)\n​\n$\n (18,709)\n​\n$\n (6,664)\nTerm loan (a)\n​\n​\n (5,200)\n​\n​\n (1,000)\n​\n​\n —\nSenior notes\n​\n​\n (156)\n​\n​\n (500)\n​\n​\n (500)\nTax-exempt bonds\n \n \n (60)\n​\n \n (65)\n​\n \n (71)\nOther debt\n \n \n (135)\n​\n \n (120)\n​\n \n (93)\n​\n \n$\n (17,870)\n​\n$\n (20,394)\n​\n$\n (7,328)\nNet cash borrowings (repayments)\n​\n$\n 6,708\n​\n$\n 912\n​\n$\n 1,360\n​\n(a)\nIn October 2024, we drew $5.2 billion of borrowings under the Term Credit Agreement that were applied to funding our acquisition of Stericycle. In November 2024, we repaid all outstanding borrowings and contemporaneously terminated the Term Credit Agreement. \nRefer to Note 6 to the Consolidated Financial Statements for additional information related to our debt borrowings and repayments.\n●\nCommon Stock Repurchase Program — \nFor the periods presented, all share repurchases have been made in accordance with financial plans approved by our Board of Directors. We allocated $262 million, $1,302 million and $1,500 million of available cash to common stock repurchases during 2024, 2023, and 2022, respectively. In 2024, we announced our temporary suspension of share repurchase activity as a result of the acquisition of Stericycle. We expect to resume share repurchase once the Company’s leverage returns to targeted levels, which is currently projected to be about 18 months after the November 2024 acquisition of Stericycle. See Note 13 to the Consolidated Financial Statements for additional information about our share repurchase activity.\n70\n\n\nTable of Contents\n●\nCash Dividends — \nFor the periods presented, all dividends have been declared by our Board of Directors. Cash dividends declared and paid were $1,210 million in 2024, or $3.00 per common share, $1,136 million in 2023, or $2.80 per common share, and $1,077 million in 2022, or $2.60 per common share.\nIn December 2024, we announced that our Board of Directors expects to increase the quarterly dividend from $0.75 to $0.825 per share for dividends declared in 2025. However, all future dividend declarations are at the discretion of the Board of Directors and depend on various factors, including our net earnings, financial condition, cash required for future business plans, growth and acquisitions and other factors the Board of Directors may deem relevant.\n●\nExercise of Common Stock Options — \nThe exercise of common stock options generated financing cash inflows of $53 million, $44 million and $44 million from the exercise of 693,000, 597,000 and 675,000 of employee stock options during 2024, 2023 and 2022, respectively. \n●\nOther, Net —\n In 2022, we acquired a controlling interest in a business engaged in accelerating film and plastic wrap recycling capabilities, and in the fourth quarter of 2024, we acquired the remaining minority interests in this business for $41 million.\nFree Cash Flow\nWe are presenting free cash flow, which is a non-GAAP measure of liquidity, in our disclosures because we use this measure in the evaluation and management of our business. We define free cash flow as net cash provided by operating activities, less capital expenditures, plus proceeds from divestitures of businesses and other assets, net of cash divested. We believe it is indicative of our ability to pay our quarterly dividends, repurchase common stock, fund acquisitions and other investments and, in the absence of refinancings, to repay our debt obligations. Free cash flow is not intended to replace net cash provided by operating activities, which is the most comparable GAAP measure. We believe free cash flow gives investors useful insight into how we view our liquidity, but the use of free cash flow as a liquidity measure has material limitations because it excludes certain expenditures that are required or that we have committed to, such as declared dividend payments and debt service requirements.\nOur calculation of free cash flow and reconciliation to net cash provided by operating activities is shown in the table below for the year ended December 31 (in millions), and may not be calculated the same as similarly-titled measures presented by other companies:\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n​\n    \n2024\n    \n2023\n    \n2022\nNet cash provided by operating activities \n​\n$\n 5,390\n​\n$\n 4,719\n​\n$\n 4,536\nCapital expenditures to support the business\n​\n​\n (2,281)\n​\n​\n (2,131)\n​\n​\n (2,026)\nCapital expenditures - sustainability growth investments (a)\n​\n​\n (950)\n​\n​\n (764)\n​\n​\n (561)\nTotal capital expenditures\n​\n \n (3,231)\n​\n \n (2,895)\n​\n \n (2,587)\nProceeds from divestitures of businesses and other assets, net of cash divested\n​\n \n 158\n​\n \n 78\n​\n \n 27\nFree cash flow\n​\n$\n 2,317\n​\n$\n 1,902\n​\n$\n 1,976\n(a)\nThese growth investments are intended to further our sustainability leadership position by increasing recycling volumes and growing renewable natural gas generation and we expect they will deliver circular solutions for our customers and drive environmental value to the communities we serve. \nCritical Accounting Estimates and Assumptions \nIn preparing our financial statements, we make numerous estimates and assumptions that affect the accounting for and recognition and disclosure of assets, liabilities, equity, revenues and expenses. We must make these estimates and assumptions because certain information that we use is dependent on future events, cannot be calculated with precision from available data or simply cannot be calculated. In some cases, these estimates are difficult to determine, and we must exercise significant judgment. In preparing our financial statements, the most difficult, subjective and complex estimates and the assumptions that present the greatest amount of uncertainty relate to our accounting for landfills, environmental remediation liabilities, long-lived asset impairments, intangible asset impairments and the fair value of assets and liabilities \n71\n\n\nTable of Contents\nacquired in business combinations. Each of these items is discussed in additional detail below and in Note 2 to the Consolidated Financial Statements. Actual results could differ materially from the estimates and assumptions that we use in the preparation of our financial statements.\nLandfills \nAccounting for landfills requires that significant estimates and assumptions be made regarding (i) the cost to construct and develop each landfill asset; (ii) the estimated fair value of final capping, closure and post-closure asset retirement obligations, which must consider both the expected cost and timing of these activities and (iii) the determination of each landfill’s remaining permitted and expansion airspace.\nLandfill Costs —\n We estimate the total cost to develop each of our landfill sites to its remaining permitted and expansion airspace. This estimate includes such costs as landfill liner material and installation, excavation for airspace, landfill leachate collection systems, landfill gas collection systems, environmental monitoring equipment for groundwater and landfill gas, directly related engineering, capitalized interest, on-site road construction and other capital infrastructure costs. Additionally, landfill development includes all land purchases for the landfill footprint and landfill buffer property. The projection of these landfill costs is dependent, in part, on future events. The remaining depletable basis of each landfill includes costs to develop a site to its remaining permitted and expansion airspace and includes amounts previously expended and capitalized, net of accumulated airspace depletion, and projections of future purchase and development costs.\nFinal Capping Costs —\n We estimate the cost for each final capping event based on the area to be capped and the capping materials and activities required. The estimates also consider when these costs are anticipated to be paid and factor in inflation and discount rates. Our engineering personnel allocate landfill final capping costs to specific final capping events and the capping costs are depleted as waste is disposed of at the landfill. We review these costs annually, or more often if significant facts change. Changes in estimates, such as timing or cost of construction, for final capping events immediately impact the required liability and the corresponding asset. When the change in estimate relates to a fully consumed landfill, the adjustment to the asset must be depleted immediately through expense. When the change in estimate relates to a final capping event at a landfill with remaining airspace, the adjustment to the asset is recognized in income prospectively as a component of landfill airspace depletion.\nClosure and Post-Closure Costs —\n We base our estimates for closure and post-closure costs on our interpretations of permit and regulatory requirements for closure and post-closure monitoring and maintenance. The estimates for landfill closure and post-closure costs also consider when the costs are anticipated to be paid and factor in inflation and discount rates. The possibility of changing legal and regulatory requirements and the forward-looking nature of these types of costs make any estimation or assumption less certain. Changes in estimates for closure and post-closure events immediately impact the required liability and the corresponding asset. When the change in estimate relates to a fully consumed landfill, the adjustment to the asset must be depleted immediately through expense. When the change in estimate relates to a landfill with remaining airspace, the adjustment to the asset is recognized in income prospectively as a component of landfill airspace depletion.\nRemaining Permitted Airspace —\n Our engineers, in consultation with third-party engineering consultants and surveyors, are responsible for determining remaining permitted airspace at our landfills. The remaining permitted airspace is determined by an annual survey, which is used to compare the existing landfill topography to the expected final landfill topography.\nExpansion Airspace —\n We also include currently unpermitted expansion airspace in our estimate of remaining permitted and expansion airspace in certain circumstances. First, for unpermitted airspace to be initially included in our estimate of remaining permitted and expansion airspace, we must believe that obtaining the expansion permit is likely. Second, we must generally expect the initial expansion permit application to be submitted within one year and the final expansion permit to be received within five years, in addition to meeting the following criteria:\n●\nPersonnel are actively working on the expansion of an existing landfill, including efforts to obtain land use and local, state or provincial approvals;\n72\n\n\nTable of Contents\n●\nWe have a legal right to use or obtain land to be included in the expansion plan;\n●\nThere are no significant known technical, legal, community, business, or political restrictions or similar issues that could negatively affect the success of such expansion; and\n●\nFinancial analysis has been completed based on conceptual design, and the results demonstrate that the expansion meets Company criteria for investment.\nThese criteria are evaluated by our field-based engineers, accountants, managers and others to identify potential obstacles to obtaining the permits. Once the unpermitted airspace is included, our policy provides that airspace may continue to be included in remaining permitted and expansion airspace even if certain of these criteria are no longer met as long as we continue to believe we will ultimately obtain the permit, based on the facts and circumstances of a specific landfill. In these circumstances, continued inclusion must be approved through a landfill-specific review process that includes approval by our Chief Financial Officer on a quarterly basis. \nWhen we include the expansion airspace in our calculations of remaining permitted and expansion airspace, we also include the projected costs for development, as well as the projected asset retirement costs related to final capping, closure and post-closure of the expansion in the depletable basis of the landfill.\nOnce the remaining permitted and expansion airspace is determined in cubic yards, an airspace utilization factor (“AUF”) is established to calculate the remaining permitted and expansion capacity in tons. The AUF is established using the measured density obtained from previous annual surveys and is then adjusted to account for future settlement. The amount of settlement that is forecasted will consider several site-specific factors including current and projected mix of waste type, initial and projected waste density, estimated number of years of life remaining, depth of underlying waste, anticipated access to moisture through precipitation or recirculation of landfill leachate and operating practices. In addition, the initial selection of the AUF is subject to a subsequent multi-level review by our engineering group and the AUF used is reviewed on a periodic basis and revised as necessary. Our historical experience generally indicates that the impact of settlement at a landfill is greater later in the life of the landfill when the waste placed at the landfill approaches its highest point under the permit requirements.\nAfter determining the costs and remaining permitted and expansion capacity at each of our landfills, we determine the per ton rates that will be expensed as waste is received and deposited at the landfill by dividing the costs by the corresponding number of tons. We calculate per ton depletion rates for each landfill for assets associated with each final capping event, for assets related to closure and post-closure activities and for all other costs capitalized or to be capitalized in the future. These rates per ton are updated annually, or more often, as significant facts change.\nIt is possible that actual results, including the amount of costs incurred, the timing of final capping, closure and post-closure activities, our airspace utilization or the success of our expansion efforts could ultimately turn out to be significantly different from our estimates and assumptions. To the extent that such estimates, or related assumptions, prove to be significantly different than actual results, lower earnings may be experienced due to higher depletion rates or higher expenses; or higher earnings may result if the opposite occurs. Most significantly, if it is determined that expansion capacity should no longer be considered in calculating the recoverability of a landfill asset, we may be required to recognize an asset impairment or incur significantly higher depletion expense. If at any time management makes the decision to abandon the expansion effort, the capitalized costs related to the expansion effort are expensed immediately.\nEnvironmental Remediation Liabilities\nA significant portion of our operating costs and capital expenditures could be characterized as costs of environmental protection. The nature of our operations, particularly with respect to the construction, operation and maintenance of our landfills subjects us to an array of laws and regulations relating to the protection of the environment. Under current laws and regulations, we may have liabilities for environmental damage caused by our operations, or for damage caused by conditions that existed before we acquired a site. In addition to remediation activity required by state or local authorities, such liabilities include potentially responsible party (“PRP”) investigations. The costs associated with these liabilities can include settlements, certain legal and consultant fees, as well as incremental internal and external costs directly associated with site investigation and clean up. \n73\n\n\nTable of Contents\nWhere it is probable that a liability has been incurred, we estimate costs required to remediate sites based on site-specific facts and circumstances. We routinely review and evaluate sites that require remediation and determine our estimated cost for the likely remedy based on a number of estimates and assumptions. Next, we review the same type of information with respect to other named and unnamed PRPs. Estimates of the costs for the likely remedy are then either developed using our internal resources or by third-party environmental engineers or other service providers. Internally developed estimates are based on:\n●\nManagement’s judgment and experience in remediating our own and unrelated parties’ sites;\n●\nInformation available from regulatory agencies as to costs of remediation;\n●\nThe number, financial resources and relative degree of responsibility of other PRPs who may be liable for remediation of a specific site; and\n●\nThe typical allocation of costs among PRPs, unless the actual allocation has been determined.\nRefer to Note 10 to the Consolidated Financial Statements for additional information on our environmental liabilities.\nFair Value of Nonfinancial Assets and Liabilities\nSignificant estimates are made in determining the fair value of long-lived tangible and intangible assets (i.e., property and equipment, intangible assets and goodwill) during the impairment evaluation process. In addition, the majority of assets acquired and liabilities assumed in a business combination are required to be recognized at fair value under the relevant accounting guidance.\nFair value is computed using several factors, including projected future operating results, economic projections, anticipated future cash flows, comparable marketplace data and the cost of capital. There are inherent uncertainties related to these factors and to our judgment in applying them in our analysis. However, we believe our methodology for estimating the fair value of our reporting units is reasonable.\nProperty and Equipment, Including Landfills and Definite-Lived Intangible Assets —\n We monitor the carrying value of our long-lived assets for potential impairment on an ongoing basis and test the recoverability of such assets generally using significant unobservable (“Level 3”) inputs whenever events or changes in circumstances indicate that their carrying amounts may not be recoverable. These events or changes in circumstances, including management decisions pertaining to such assets, are referred to as impairment indicators. If an impairment indicator occurs, we perform a test of recoverability by comparing the carrying value of the asset or asset group to its undiscounted expected future cash flows. If cash flows cannot be separately and independently identified for a single asset, we will determine whether an impairment has occurred for the group of assets for which we can identify the projected cash flows. If the carrying values are in excess of undiscounted expected future cash flows, we measure any impairment by comparing the fair value of the asset or asset group to its carrying value and the difference is recorded in the period that the impairment indicator occurs. Fair value is generally determined by considering (i) internally developed discounted projected cash flow analysis of the asset or asset group; (ii) third-party valuations and/or (iii) information available regarding the current market for similar assets. Estimating future cash flows requires significant judgment and projections may vary from the cash flows eventually realized, which could impact our ability to accurately assess whether an asset has been impaired.\nThe assessment of impairment indicators and the recoverability of our capitalized costs associated with landfills and related expansion projects require significant judgment due to the unique nature of the waste industry, the highly regulated permitting process and the sensitive estimates involved. During the review of a landfill expansion application, a regulator may initially deny the expansion application although the expansion permit is ultimately granted. In addition, management may periodically divert waste from one landfill to another to conserve remaining permitted landfill airspace, or a landfill may be required to cease accepting waste, prior to receipt of the expansion permit. However, such events occur in the ordinary course of business in the waste industry and do not necessarily result in impairment of our landfill assets because, after consideration of all facts, such events may not affect our belief that we will ultimately obtain the expansion permit. As a result, our tests of recoverability, which generally make use of a probability-weighted cash flow estimation approach, may indicate that no impairment loss should be recorded.\n74\n\n\nTable of Contents\nIndefinite-Lived Intangible Assets, Including Goodwill —\n At least annually using a measurement date of October 1, and more frequently if warranted, we assess the indefinite-lived intangible assets including the goodwill of our reporting units for impairment using Level 3 inputs.\nWe first perform a qualitative assessment to determine if it was more likely than not that the fair value of a reporting unit is less than its carrying value. If the assessment indicates a possible impairment, we complete a quantitative review, comparing the estimated fair value of a reporting unit to its carrying amount, including goodwill. An impairment charge is recognized if the asset’s estimated fair value was less than its carrying amount. Fair value is typically estimated using an income approach using Level 3 inputs. However, when appropriate, we may also use a market approach. The income approach is based on the long-term projected future cash flows of the reporting units. We discount the estimated cash flows to present value using a weighted average cost of capital that considers factors such as market assumptions, the timing of the cash flows and the risks inherent in those cash flows. We believe that this approach is appropriate because it provides a fair value estimate based upon the reporting units’ expected long-term performance considering the economic and market conditions that generally affect our business. The market approach estimates fair value by measuring the aggregate market value of publicly-traded companies with similar characteristics to our business as a multiple of their reported earnings. We then apply that multiple to the reporting units’ earnings to estimate their fair values. We believe that this approach may also be appropriate in certain circumstances because it provides a fair value estimate using valuation inputs from entities with operations and economic characteristics comparable to our reporting units.\nAcquisitions\n — In accordance with the purchase method of accounting, the purchase price paid for an acquisition is allocated to the assets and liabilities acquired based upon their estimated fair values as of the acquisition date, with the excess of the purchase price over the net assets acquired recorded as goodwill. When we are in the process of valuing all of the assets and liabilities acquired in an acquisition, there can be subsequent adjustments to our estimates of fair value and resulting preliminary purchase price allocation. Generally, the valuation of our acquired asset and liabilities rely on complex estimates and assumptions.\nAcquisition-date fair value estimates are revised as necessary if, and when, additional information regarding these contingencies becomes available to further define and quantify assets acquired and liabilities assumed. Subsequent to finalization of purchase accounting, these revisions are accounted for as adjustments to income from operations. All acquisition-related transaction costs are expensed as incurred. See Note 17 to the Consolidated Financial Statements for additional information related to our acquisitions.\nSee Item 7. \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\n —\n (Gain) Loss from Divestitures, Asset Impairments and Unusual Items, Net\n. See Note 11 to the Consolidated Financial Statements for additional information related to Asset Impairments and Unusual Items.\nInflation\nVariability in economic conditions, including inflation, interest rates, employment trends, and supply chain reliability, can create risk and uncertainty in financial outlook. We take proactive steps to recover and mitigate inflationary cost pressures through our overall pricing efforts and by managing our costs through efficiency, labor productivity, and investments in technology to automate certain aspects of our business. These efforts may not be successful for various reasons including the pace of inflation, operating cost inefficiencies, market responses, and contractual limitations, such as the timing lag in our ability to recover increased costs under certain contracts that are tied to a price escalation index with a lookback provision.\nRefer to Item 1A. \nRisk Factors\n for further discussion.",
  "item2": null
}