{
  "source_file": "wmb-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nCombined Management’s Discussion and Analysis of Financial Condition and Results of Operations\nPage\nGeneral\n54\nCompany Outlook\n58\nResults of Operations\n62\nWilliams\n62\nTransco\n74\nNWP\n76\nManagement’s Discussion and Analysis of Financial Condition and Liquidity\n78\nGeneral\nWilliams is an energy company committed to being the leader in providing infrastructure that safely delivers natural gas products to reliably fuel the clean energy economy. Its operations are located in the United States.\nWilliams’ interstate natural gas pipeline strategy is to create value by maximizing the utilization of its pipeline capacity by providing high-quality, low-cost transportation of natural gas to large and growing markets. Williams’ gas pipeline businesses’ interstate transmission and storage activities are subject to regulation by the FERC. As such, Williams’ rates and charges for the transportation of natural gas in interstate commerce, and the extension, expansion, or abandonment of jurisdictional facilities and accounting, among other things, are subject to regulation. The rates are established primarily through the FERC’s ratemaking process, but Williams may also negotiate rates with its customers pursuant to the terms of its tariffs and FERC policy. Changes in commodity prices and volumes transported have limited near-term impact on these revenues because the majority of the cost of service is recovered through firm capacity reservation charges in transportation rates.\nThe ongoing strategy of Williams’ midstream operations is to safely and reliably operate large-scale midstream infrastructure where its assets can be fully utilized and drive low per-unit costs. Williams focuses on consistently attracting new business by providing highly reliable service to its customers. These services include natural gas gathering, processing, treating, compression and storage; NGL fractionation, transportation and storage; and crude oil production handling and transportation, as well as marketing services for NGL, crude oil, and natural gas.\nConsistent with the manner in which Williams’ CODM evaluates performance and allocates resources, Williams’ operations are conducted, managed, and presented within the following reportable segments: Transmission, Power & Gulf, Northeast G&P, West, and Gas & NGL Marketing Services. All remaining business activities, including upstream operations, certain new energy ventures, and corporate activities, are included in Other. Williams’ reportable segments are comprised of the following business activities:\n•\nTransmission, Power & Gulf is comprised of interstate natural gas pipelines and their related natural gas storage facilities including Transco, NWP, and MountainWest \nand a \n50 percent\n equity-method investment in Gulfstream;\n natural gas gathering and processing and crude oil production handling and transportation assets in the Gulf Coast region, includ\ning Discovery, \na former 60 percent equity-method investment in which Williams acquired the remaining ownership interest in August 2024 (see Note 3 – Acquisitions and Divestitures) and\n a 51 percent interest in Gulfstar One; and natural gas storage facilities and pipelines providing services in north Texas, and also in Louisiana and \nMississippi related to the January 2024 Gulf Coast Storage Acquisition (see Note 3 – Acquisitions and Divestitures). Transmission, Power & Gulf also includes power innovation projects under development that will deliver speed-to-market solutions in grid-constrained markets. This segment was formerly referred to as Transmission & Gulf of America.\n•\nNortheast G&P is comprised of midstream gathering, processing, and fractionation businesses in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern \n54\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nOhio, as well as a 65 percent interest in Northeast JV which operates in West Virginia, Ohio, and Pennsylvania, a 66 percent interest in Cardinal which operates in Ohio, a 50 percent equity-method investment in Blue Racer, and Appalachia Midstream Investments.\n•\nWest is comprised of gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of south Texas, the Haynesville Shale region of east Texas and northwest Louisiana, the Mid-Continent region which includes the Anadarko and Permian basins, and the DJ Basin of Colorado. This segment also includes NGL storage facilities, an undivided 50 percent interest in an NGL fractionator near Conway, Kansas, and a 50 percent equity-method investment in OPPL.\n•\nGas & NGL Marketing Services is comprised of NGL and natural gas marketing and trading operations, which include risk management and transactions related to the storage and transportation of natural gas and NGLs on strategically positioned assets.\nUnless indicated otherwise, the following discussion and analysis of results of operations and financial condition and liquidity relates to Williams’ current continuing operations and should be read in conjunction with the financial statements and combined notes thereto of this Form 10-Q and the Annual Report on Form 10-K for the year ended December 31, 2024, dated February 25, 2025.\nDividends\nIn September 2025, Williams paid a regular quarterly dividend of $0.50 per share.\nOverview of Nine Months Ended September 30, 2025\nNet income (loss) attributable to The Williams Companies, Inc.\n \nfor the nine months ended September 30, 2025, increased $145 million compared to the nine months ended September 30, 2024. Further discussion of the results is found in this report in the Results of Operations.\nRecent Developments\nTransco FERC Rate Case Filing\nOn August 30, 2024, Transco filed a general rate case with the FERC for an overall increase in rates and to comply with the terms of the settlement of its prior rate case. On September 30, 2024, the FERC issued an order accepting and suspending Transco’s general rate filing to be effective March 1, 2025, subject to refund and the outcome of hearing procedures established by the FERC. The order also accepted rate decreases for certain services to be effective as of October 1, 2024. During the third quarter of 2025, Transco reached an agreement in principle with its customers and the other participants to settle all aspects of the rate case and has accrued a related reserve. Transco filed with the FERC in October 2025 for approval of the settlement.\nData Center Power Innovation Projects\n \nWilliams continues to pursue projects to support the power demands created by new data center development, including agreements with an unnamed large, investment-grade company to provide onsite natural gas and power generation infrastructure. See Expansion Projects for further discussion.\nSale of South Mansfield Upstream Interests\nIn October 2025, Williams entered into an agreement to sell its interests in certain upstream ventures in the South Mansfield area of the Haynesville Shale region, included in Other, for consideration of approximately $398 million with additional contingent consideration to possibly be received through 2029. Upon closing, Williams expects to record a gain in the fourth quarter of 2025.\n55\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nLouisiana LNG and Driftwood Pipeline\nIn October 2025, Williams closed on various agreements with the same counterparty to acquire a 10 percent equity-method interest in Louisiana LNG LLC, which is developing a fully permitted LNG export facility, and an 80 percent interest in Driftwood Pipeline LLC, which is constructing a fully permitted greenfield pipeline connecting to multiple other pipelines, including Transco and Louisiana Energy Gateway, to supply the LNG facility. Williams will be the operator of the pipeline. The total initial purchase price was $378 million, and both investments will require additional capital to fund further construction. The Louisiana LNG LLC and Driftwood Pipeline LLC purchases were funded with available liquidity. Williams will also manage the gas supply for the LNG facility and purchase a portion of the LNG produced.\nSaber Asset Purchase\nIn June 2025, Williams acquired 100 percent of Saber Midstream, LLC (Saber). The acquisition, which was accounted for as an asset purchase, included cash consideration of $47 million and the retention of $113 million of Saber’s debt, which was separately repaid in full within the same month. Saber operates a gas gathering system in the Haynesville Shale region in the West segment.\nCogentrix Investment\nIn March 2025, Williams purchased a minority interest in Cogentrix Co-Investment Fund, LP (Cogentrix) for $153 million, which is accounted for as an equity-method investment within the Gas & NGL Marketing Services segment. Cogentrix owns interests in 11 natural gas power plants.\nRimrock Asset Purchase\nOn January 31, 2025, Williams purchased a group of natural gas gathering and processing assets from Rimrock Energy Partners, LLC (Rimrock) for approximately $325 million, to expand Williams’ gathering and processing footprint and create operational synergies in the DJ Basin in the West segment.\nExpansion Project Updates\nExpansion projects placed into service for the current year are described below. Ongoing major expansion projects are discussed later in Company Outlook.\nTransmission, Power & Gulf\nStanfield South\n \nThe project on NWP’s existing natural gas transmission system provides year-round transportation capacity from the Stanfield receipt point in Oregon to multiple delivery points in Idaho and a new delivery meter in Wyoming. NWP placed the project into service in November 2025, increasing NWP’s contracted capacity by 80 Mdth/d.\n56\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nCommonwealth Energy Connector\nIn November 2023, Transco received approval from the FERC for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity in Virginia. Transco placed the project into service in November 2025, increasing Transco’s capacity by 105 Mdth/d.\nAlabama Georgia Connector\nIn March 2024, Transco received approval from the FERC for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from Transco’s Station 85 pooling point in Alabama to customers in Georgia. Transco placed the project into service in October 2025, increasing Transco’s capacity by 64 Mdth/d.\nDeepwater Shenandoah Project\nIn June 2021, Williams reached an agreement with two third parties to provide offshore natural gas gathering and transportation services as well as onshore natural gas processing services. The project expands the existing Gulf of America offshore infrastructure connecting to a third-party offshore lateral pipeline from the Shenandoah platform to Discovery’s existing Keathley Canyon Connector pipeline, adds onshore processing facilities at Larose, Louisiana to handle the expected rich Shenandoah production, and the natural gas liquids are now fractionated and marketed at Discovery’s Paradis plant in Louisiana. This project was placed into service in July 2025.\nTexas to Louisiana Energy Pathway\nIn January 2024, Transco received approval from the FERC for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide firm transportation capacity from receipt points in south Texas to delivery points in Texas and Louisiana. Transco placed the project into service in April 2025. Under the project, Transco provides 364 Mdth/d of new firm transportation service through a combination of increasing capacity, converting interruptible capacity to firm, and utilizing existing capacity.\nSoutheast Energy Connector\nIn November 2023, Transco received approval from the FERC for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from receipt points in Mississippi and Alabama to a delivery point in Alabama. Transco placed the project into service in April 2025, increasing Transco’s capacity by 150 Mdth/d.\nDeepwater Whale Project\nIn August 2021, Williams reached an agreement with two third parties to provide offshore natural gas gathering and crude oil transportation services as well as onshore natural gas processing services. The project expands its existing Western Gulf of America offshore infrastructure via a 26-mile gas lateral pipeline from the Whale platform to the existing Perdido gas pipeline and adds a new 124-mile oil pipeline from the Whale platform to Williams’ existing junction platform. This project was placed into service in January 2025.\n57\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nWest\nHaynesville Gathering Expansion\nIn February 2023, Williams announced its agreement with a third party to facilitate natural gas production growth in the Haynesville Shale basin for the construction of a greenfield gathering system in support of a 26,000-acre dedication. In April 2025, the third party sold a majority of their ownership interest to another party, with both third parties agreeing to long-term capacity commitments on Williams’ Louisiana Energy Gateway expansion project. This project was placed into service in September 2025, providing natural gas gathering services to both parties.\nLouisiana Energy Gateway\nIn August 2024, Williams began construction activities on new natural gas gathering assets in the Haynesville Shale basin to increase delivery of natural gas to premium markets, including Transco, industrial markets, and growing LNG export demand along the Gulf Coast. This project was placed into service in July and August 2025, increasing natural gas gathering capacity by 1.8 Bcf/d.\nCompany Outlook\nWilliams’ strategy is to provide a large-scale, reliable, and clean energy infrastructure designed to maximize the opportunities created by the vast supply of natural gas and natural gas products that exists in the United States. Williams accomplishes this by connecting the growing demand for cleaner fuels and feedstocks with our major positions in the premier natural gas and natural gas products supply basins. Williams continues to maintain a strong commitment to safety, environmental stewardship including seeking opportunities for renewable energy ventures, operational excellence, and customer satisfaction. Williams believes that accomplishing these goals will position it to deliver safe, reliable, clean energy services to its customers and an attractive return to shareholders. Williams’ business plan for 2025 includes a continued focus on earnings and cash flow growth.\nIn 2025, Williams’ operating results are expected to benefit from the continued growth in the Transmission, Power & Gulf segment, primarily reflecting the impacts of numerous expansion projects at Transco and the Gulf of America. Additionally, growth in 2025 includes the impact of the Transco rate case and higher gathering and processing results associated with growth in the Northeast and the DJ Basin. Williams also expects increases in Haynesville Shale volumes, including partial year impact of the Louisiana Energy Gateway expansion project and higher expected results from its upstream operations, including the full year impact of the Crowheart Acquisition. Williams also expects to benefit from the recent equity investment in Cogentrix. These increases are partially offset by a modest increase in expenses, lower gas marketing results, and lower expected Eagle Ford results in our West segment related to minimum volume commitment reductions.\nWilliams seeks to maintain a strong financial position and liquidity, as well as manage a diversified portfolio of safe, clean, and reliable energy infrastructure assets that continue to serve key growth markets and supply basins in the United States. Williams’ growth capital and investment expenditures in 2025 are expected to range from $3.95 billion to $4.25 billion, excluding acquisitions. Growth capital spending in 2025 primarily includes the Power Innovation projects, projects supporting growth in the Haynesville Shale basin (including the Louisiana Energy Gateway expansion project), Transco expansions, all of which are fully contracted with firm transportation agreements, and projects supporting the Northeast G&P business. Williams is investing capital in the recently announced Louisiana LNG and Driftwood Pipeline projects, as well as the development of its Wamsutter upstream oil and gas properties. In addition to growth capital and investment expenditures, Williams also remains committed to projects that maintain its assets for safe and reliable operations, as well as projects that reduce emissions, and meet legal, regulatory, and/or contractual commitments.\n58\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nPotential risks and obstacles that could impact the execution of Williams’ plan include:\n•\nA global recession, which could result in downturns in financial markets and commodity prices, as well as impact demand for natural gas and related products;\n•\nOpposition to, and regulations affecting, our infrastructure projects, including the risk of delay or denial in permits and approvals needed for our projects;\n•\nCounterparty credit and performance risk;\n•\nUnexpected significant increases in capital expenditures or delays in capital project execution, including increases from inflation or delays caused by supply chain disruptions;\n•\nUnexpected changes in customer drilling and production activities, which could negatively impact gathering and processing volumes;\n•\nLower than anticipated demand for natural gas and natural gas products which could result in lower-than-expected volumes, energy commodity prices, and margins;\n•\nGeneral economic, financial markets, or industry downturns, including increased inflation, interest rates, or tariffs;\n•\nPhysical damages to facilities, including damage to offshore facilities by weather-related events;\n•\nOther risks set forth under Part I, Item 1A. Risk Factors in the Annual Report on Form 10-K for the year ended December 31, 2024, as filed with the SEC on February 25, 2025, as may be supplemented by disclosure in Part II, Item 1A. Risk Factors in subsequent Quarterly Reports on Form 10‑Q.\nExpansion Projects\nWilliams’ ongoing major expansion projects include the following:\nTransmission, Power & Gulf\nOverthrust Westbound Compression Expansion\nIn October 2024, MountainWest received approval from the FERC for the project, which involves an expansion of MountainWest’s existing natural gas transmission system to provide incremental firm transportation capacity from multiple receipt points in Wamsutter, Wyoming to a delivery point in Opal, Wyoming. MountainWest plans to place the project into service in the fourth quarter of 2025, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 325 Mdth/d.\nPine Prairie Phase IV Expansion\nIn August 2025, Williams filed a certificate application with the FERC for the project which, will involve an expansion of storage capacity and the injection and withdrawal capabilities of one of its existing storage facilities in the Gulf Coast region. Williams plans to place the project into service during the fourth quarter of 2028, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase working gas storage capacity by 10 Bcf.\nSoutheast Supply Enhancement\nIn October 2024, Transco filed a certificate application with the FERC for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from receipt points in Virginia to delivery points in Virginia, North Carolina, South Carolina, Georgia, and Alabama. Transco plans to place the project into service as early as the third quarter of 2027, assuming \n59\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\ntimely receipt of all necessary regulatory approvals.  The project is expected to increase capacity by 1,597 Mdth/d.\nPower Express\nTransco plans to file an application with the FERC as early as the second quarter 2027 for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity in Virginia. Transco plans to place the project into service as early as the third quarter of 2030, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 689 Mdth/d. \nGillis West\nTransco plans to file a prior notice application with the FERC in 2026 for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from receipt points in Louisiana to delivery points in Texas. Transco plans to place the project into service as early as the second quarter of 2026, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 115 Mdth/d.\nNortheast Supply Enhancement\nIn August 2025, the FERC issued an order granting Transco’s petition for reissuance of the certificate authorization for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from Transco’s Compressor Station 195 in Pennsylvania to the Rockaway Delivery Lateral transfer point in New York. In October 2025, Transco’s application for Clean Water Act and related permits for the Pennsylvania portion of the project was approved, and Transco is awaiting action on similar applications with the states of New York and New Jersey. In August 2025, Transco executed precedent agreements with customers subscribing to all of the capacity under the project. Transco plans to place the project into service as early as the fourth quarter of 2027, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 400 Mdth\n⁄\nd.\nDalton Lateral II\nTransco plans to file a certificate application for the project with the FERC in 2026. The project involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from Transco’s main line near existing Station 115 to an existing power plant in Georgia. Transco plans to place the project into service as early as the fourth quarter of 2029, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity up to 460 Mdth/d.\nRyckman Creek Loop\nNWP plans to file a prior notice application for the project with the FERC in 2025. The project involves an expansion of NWP’s existing natural gas transmission system to provide incremental firm transportation capacity from a receipt point in northeast Oregon to multiple delivery points in southwest Wyoming. NWP plans to place the project into service as early as the fourth quarter of 2026, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 50 Mdth/d.\nNaughton Coal-to-Gas Conversion\nThe project involves an expansion of NWP’s existing natural gas transmission system to provide year-round transportation capacity to a power plant in southwest Wyoming. NWP plans to place the project into service as early as the second quarter of 2026, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 98 Mdth/d. \n60\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nKelso-Beaver Reliability\n \nNWP filed a certificate application for the project with the FERC in February 2025. The Kelso-Beaver Reliability project on NWP’s existing natural gas transmission system will provide year-round transportation capacity to various receipt and delivery points in Oregon. NWP plans to place the project into service during the fourth quarter of 2028, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 183 Mdth/d. \nHuntingdon Connector\nNWP plans to file a prior notice application for the project with the FERC in 2026. The project involves an expansion of NWP’s existing natural gas transmission system that will provide year-round transportation capacity from the Sumas receipt point to various delivery points in Washington. NWP plans to place the project into service during the fourth quarter of 2026, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 78 Mdth/d.\nWild Trail\nIn May 2025, NWP filed a certificate application with the FERC for the project, which involves an expansion of NWP’s existing natural gas transmission system that will provide year-round transportation capacity from the White River Hub receipt point in western Colorado to various delivery points in southwest Wyoming and southern Colorado. This Wild Trail project is fully subscribed by an affiliate of NWP. NWP plans to place the project into service during the fourth quarter of 2027, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 83 Mdth/d.\nPower Innovation\nSocrates\nWilliams has received partial approval and is waiting for full approval from the Ohio Power Siting Board for this Power Innovation project, which involves the construction of the Socrates North and South power generation facilities in New Albany, Ohio. Williams has agreed to provide committed power generation and associated gas pipeline infrastructure for the project, which is expected to provide a combined 400 megawatts of committed onsite power generation capacity to the customer. The project is backed by a ten-year, primarily fixed-price power purchase agreement, with an option for the customer to extend. Williams plans to place the project into service in the second half of 2026, assuming timely receipt of permits.\nAdditional Projects\nWilliams has agreed to provide committed power generation and associated gas pipeline infrastructure for two additional Power Innovation projects. The projects are backed by ten-year, primarily fixed-price power purchase agreements, with an option for the customer to extend. Williams plans to place the projects into service the first half of 2027, assuming timely receipt of permits.\n61\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nResults of Operations\nWilliams’ Consolidated Overview\nThe following table and discussion is a summary of Williams’ consolidated results of operations for the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024, and should be read in conjunction with the results of operations by segment, as discussed in further detail following this consolidated overview discussion.\nThree Months Ended  \nSeptember 30,\nChange*\nNine Months Ended  \nSeptember 30,\nChange*\n \n2025\n2024\n$\n%\n2025\n2024\n$\n%\n \n(Dollars in millions)\n(Dollars in millions)\nRevenues:\nService revenues\n$\n2,121 \n$\n1,911 \n+210 \n+11 \n%\n$\n6,165 \n$\n5,653 \n+512 \n+9 \n%\nProduct sales and service revenues – commodity consideration\n746 \n737 \n+9 \n+1 \n%\n2,557 \n2,240 \n+317 \n+14 \n%\nNet gain (loss) from commodity derivatives\n56 \n5 \n+51 \nNM\n30 \n(133)\n+163 \nNM\nTotal revenues\n2,923 \n2,653 \n8,752 \n7,760 \nCosts and expenses:\nProduct costs and net processing commodity expenses\n485 \n524 \n+39 \n+7 \n%\n1,606 \n1,496 \n-110 \n-7 \n%\nOperating and maintenance expenses\n583 \n580 \n-3 \n-1 \n%\n1,697 \n1,613 \n-84 \n-5 \n%\nDepreciation, depletion, and amortization expenses\n564 \n566 \n+2 \n— \n%\n1,754 \n1,654 \n-100 \n-6 \n%\nSelling, general, and administrative expenses\n168 \n170 \n+2 \n+1 \n%\n530 \n520 \n-10 \n-2 \n%\nOther (income) expense – net\n14 \n(25)\n-39 \nNM\n17 \n(69)\n-86 \nNM\nTotal costs and expenses\n1,814 \n1,815 \n5,604 \n5,214 \nOperating income (loss)\n1,109 \n838 \n3,148 \n2,546 \nEquity earnings (losses)\n152 \n147 \n+5 \n+3 \n%\n449 \n431 \n+18 \n+4 \n%\nOther investing income (loss) – net\n19 \n290 \n-271 \n-93 \n%\n31 \n332 \n-301 \n-91 \n%\nInterest expense\n(372)\n(338)\n-34 \n-10 \n%\n(1,071)\n(1,026)\n-45 \n-4 \n%\nOther income (expense) – net\n21 \n31 \n-10 \n-32 \n%\n51 \n95 \n-44 \n-46 \n%\nIncome (loss) before income taxes\n929 \n968 \n2,608 \n2,378 \nLess: Provision (benefit) for income taxes\n246 \n227 \n-19 \n-8 \n%\n613 \n549 \n-64 \n-12 \n%\nNet income (loss)\n683 \n741 \n1,995 \n1,829 \nLess: Net income attributable to noncontrolling interests\n36 \n35 \n-1 \n-3 \n%\n111 \n90 \n-21 \n-23 \n%\nNet income (loss) attributable to The Williams Companies, Inc.\n$\n647 \n$\n706 \n-59 \n-8 \n%\n$\n1,884 \n$\n1,739 \n+145 \n+8 \n%\n_______\n*    + = Favorable change; - = Unfavorable change; NM = A percentage calculation is not meaningful due to a change in signs, a zero-value denominator, or a percentage change greater than 200.\nThree months ended September 30, 2025 vs. three months ended September 30, 2024\nService revenues\n increased primarily due to: \n•\nHigher revenues associated with expansion projects at the Transmission, Power & Gulf and the West segments;\n62\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\n•\nIncreased Transco transportation rates, as well as adjustments associated with the rate case at the Transmission, Power & Gulf segment;\n•\nHigher volumes from the August 2024 Discovery Acquisition at the Transmission, Power & Gulf segment (See Note 3 – Acquisitions and Divestitures) and the June 2025 Saber Asset Purchase and the January 2025 Rimrock Asset Purchase at the West segment; partially offset by\n•\nLower revenues in the Eagle Ford Shale region due to lower MVC revenue at the West segment.\nThe\n Product sales and service revenues – commodity consideration\n increase primarily consists of:\n•\nHigher product sales from upstream operations primarily related to higher volumes from the November 2024 Crowheart Acquisition at Other (See Note 3 – Acquisitions and Divestitures); partially offset by\n•\nLower marketing sales activities primarily related to lower NGLs marketing sales prices at the Gas & NGL Marketing Services segment. \nAs Williams is acting as agent for natural gas marketing customers, its natural gas marketing product sales are presented net of the related costs of those activities within the Gas & NGL Marketing Services segment.\nNet gain (loss) from commodity derivatives \nincludes realized and unrealized gains and losses from derivative instruments reflected within \nTotal revenues\n primarily in the Gas & NGL Marketing Services segment, as well as at Other  (see Note 9 – Commodity Derivatives).\nWilliams experiences significant earnings volatility from the fair value accounting required for the derivatives used to hedge a portion of the economic value of the underlying transportation and storage capacity portfolios as well as upstream-related production. However, the unrealized fair value measurement gains and losses are generally offset by valuation changes in the economic value of the underlying production or transportation and storage capacity contracts, which are not recognized until the underlying transaction occurs.\nThe \nProduct costs and net processing commodity expenses\n decrease primarily consists of:\n•\nLower marketing activities primarily related to lower NGLs marketing purchases at the Gas & NGL Marketing Services segment, including from the  Discovery Acquisition; \n•\nLower shrink natural gas purchases and commodity consideration costs associated with Williams’ equity NGL production activities primarily due to the Discovery Acquisition at the Transmission, Power & Gulf segment.\nOperating and maintenance expenses \nincreased primarily due to operating costs of the assets acquired at the Transmission, Power & Gulf and West segments, as well as at Other, substantially offset by lower employee-related costs, including the absence of the impact of a 2024 change in practice related to payroll timing.\nDepreciation, depletion, and amortization expenses\n decreased primarily related to adjustments associated with the rate case to Transco depreciation rates at the Transmission, Power & Gulf segment, partially offset by the assets acquired and expansion projects placed in-service at the Transmission, Power & Gulf and West segments, as well as at Other. \nOther (income) expense – net\n within \nOperating income (loss) \nincludes a write-off of certain DJ Basin region assets in the West segment (see Note 8 – Fair Value Measurements and Guarantees).\nThe unfavorable change in \nOther investing income (loss) – net\n includes a $149 million gain on the sale of our interests in Aux Sable in 2024 and a $127 million gain on remeasurement of our existing equity-method investment associated with the purchase of the remaining interest in Discovery in 2024.\n63\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nInterest expense\n was primarily impacted by Williams’ 2024 and 2025 debt issuances, partially offset by 2024 and 2025 debt retirements (see Note 7 – Debt and Banking Arrangements) and the absence of imputed interest on deferred consideration obligations related to previous acquisitions.\nProvision (benefit) for income taxes\n changed unfavorably primarily due to an increase in the estimate of the state deferred income tax rate. See Note 6 – Provision (Benefit) for Income Taxes for a discussion of the effective tax rate compared to the federal statutory rate for both periods.\nNine months ended September 30, 2025 vs. nine months ended September 30, 2024\nService revenues\n increased primarily due to: \n•\nHigher revenues associated with expansion projects at the Transmission, Power & Gulf and the West segments;\n•\nIncreased Transco transportation and storage rates and Gulf Coast Storage rates at the Transmission, Power & Gulf segment;\n•\nHigher volumes from the August 2024 Discovery Acquisition at the Transmission, Power & Gulf segment, January 2025 Rimrock Asset Purchase and the June 2025 Saber Asset Purchase at the West segment,\n \nand the Northeast JV at the Northeast G&P segment;\n•\nHigher revenues associated with reimbursable expenses primarily in the Northeast G&P segment, which is offset by similar changes in the charges reflected in \nOperating and maintenance expenses\n; partially offset by\n•\nLower revenues in the Eagle Ford Shale region due to lower MVC revenue at the West segment.\nThe\n Product sales and service revenues – commodity consideration\n increase primarily consists of:\n•\nHigher product sales from upstream operations primarily related to higher volumes, including the November 2024 Crowheart Acquisition, and natural gas prices at Other; \n•\nHigher equity NGL sales and commodity consideration revenues associated with equity NGL production activity primarily due to the Discovery Acquisition at the Transmission, Power & Gulf segment and higher prices at the West segment;\n•\nHigher marketing sales activities primarily related to higher net gas marketing sales activities at the Gas & NGL Marketing Services segment;\n•\nHigher cash-out activity primarily at the Transmission, Power & Gulf segment. \nNet gain (loss) from commodity derivatives \nincludes realized and unrealized gains and losses from derivative instruments reflected within \nTotal revenues\n primarily in the Gas & NGL Marketing Services segment, as well as at Other.\nThe \nProduct costs and net processing commodity expenses\n increase primarily consists of:\n•\nHigher shrink natural gas purchases and commodity consideration costs associated with Williams’ equity NGL production activities primarily due to the Discovery Acquisition at the Transmission, Power & Gulf segment;\n•\nHigher cash-out activity primarily at the Transmission, Power & Gulf segment. \nOperating and maintenance expenses \nincreased primarily due to operating costs of the assets acquired at the Transmission, Power & Gulf and West segments, as well as at Other, higher electricity and fuel primarily in the \n64\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nNortheast G&P segment (substantially offset by higher \nService revenues\n discussed above) and higher employee-related costs, partially offset by the absence of the impact of a 2024 change in practice related to payroll timing.\nDepreciation, depletion, and amortization expenses\n increased primarily related to assets acquired and expansion projects placed in-service at the Transmission, Power & Gulf and West segments, as well as at Other and an increase in Transco depreciation rates associated with the rate case at the Transmission, Power & Gulf segment, partially offset by lower ARO-related depreciation at the Transmission, Power & Gulf segment. \nSelling, general, and administrative expenses\n increased due to higher employee-related costs, partially offset by the absence of the impact of a 2024 change in a practice related to payroll timing and lower acquisition and transition costs primarily at the Transmission, Power & Gulf segment.\nOther (income) expense – net\n within \nOperating income (loss) \nincludes net unfavorable changes to charges and credits associated with amortization of regulatory assets and liabilities related to the Transco rate case and deferral of ARO-related depreciation at the Transmission, Power & Gulf segment and a write-off of certain DJ Basin region assets in the West segment.\nThe unfavorable change in \nOther investing income (loss) – net\n includes a $149 million gain on the sale of our interests in Aux Sable in 2024, a $127 million gain on remeasurement of our existing equity-method investment associated with the purchase of the remaining interest in Discovery in 2024, and lower interest income earned on lower cash and cash equivalent balances.\nInterest expense\n was primarily impacted by Williams’ 2024 and 2025 debt issuances, partially offset by 2024 and 2025 debt retirements and the absence of imputed interest on deferred consideration obligations related to previous acquisitions.\nThe unfavorable change in \nOther income (expense) – net \nbelow \nOperating income (loss)\n includes a decrease in equity AFUDC primarily as a result of the timing of capital projects at Williams’ regulated businesses.\nProvision (benefit) for income taxes\n changed unfavorably primarily due to higher pre-tax income and an increase in the estimate of the state deferred income tax rate. \nPeriod-Over-Period Operating Results – Williams’ Segments\nWilliams’ CODM evaluates segment operating performance based upon \nModified EBITDA\n. Note 11 – Segment Disclosures includes a reconciliation of this non-GAAP measure to \nIncome (loss) before income taxes\n. Management uses \nModified EBITDA\n because it is an accepted financial indicator used by investors to compare company performance. In addition, management believes that this measure provides investors an enhanced perspective of the operating performance of Williams’ assets. \nModified EBITDA\n should not be considered in isolation or as a substitute for a measure of performance prepared in accordance with GAAP.\n65\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nTransmission\n,\n Power & Gulf \nThree Months Ended  \nSeptember 30,\nNine Months Ended  \nSeptember 30,\n2025\n2024\n2025\n2024\n(Millions)\nService revenues\n$\n1,237 \n$\n1,072 \n$\n3,548 \n$\n3,144 \nProduct sales and service revenues – commodity consideration (1)\n154 \n98 \n428 \n213 \nNet realized gain (loss) from commodity derivatives (1)\n1 \n— \n— \n— \nSegment revenues\n1,392 \n1,170 \n3,976 \n3,357 \nProduct costs and net processing commodity expenses (1)\n(139)\n(87)\n(381)\n(188)\nOther segment costs and expenses\n(317)\n(313)\n(983)\n(857)\nProportional Modified EBITDA of equity-method investments\n37 \n41 \n110 \n136 \nTransmission, Power & Gulf Modified EBITDA\n$\n973 \n$\n811 \n$\n2,722 \n$\n2,448 \nCommodity margins\n$\n16 \n$\n11 \n$\n47 \n$\n25 \n_______________\n(1)\nIncluded as a component of \nCommodity margins\n.\nThree months ended September 30, 2025 vs. three months ended September 30, 2024\nTransmission, Power & Gulf Modified EBITDA\n increased primarily due to higher \nService revenues.\nService revenues\n increased primarily due to: \n•\nAn $88 million increase in Transco’s revenues primarily associated with transportation rate increases effective March 1, 2025, including adjustments associated with the rate case, and expansion projects placed in-service, notably Regional Energy Access in August 2024, Southside Reliability Enhancement in November 2024, Texas Louisiana Energy Pathway in April 2025, and Southeast Energy Connector in April 2025; \n•\nA $38 million increase in the Gulf Coast region primarily due to higher natural gas gathering and crude oil transportation volumes from the Whale expansion project that went in-service in January 2025, crude oil transportation and natural gas gathering volumes from a new well at Blind Faith in the Ballymore field and the absence of shut-ins for weather-related events at Gulfstar One in 2024;\n•\nA $21 million increase primarily in natural gas gathering revenues due to the Discovery Acquisition n August 2024 (see Note 3 – Acquisitions and Divestitures) and volumes from the Shenandoah expansion project that went in-service in July 2025;  \n•\nA $10 million increase in Gulf Coast Storage’s revenues primarily associated with higher storage rates.\nOther segment costs and expenses\n increased primarily due to:\n•\nNet unfavorable changes to charges and credits associated with regulatory assets and liabilities related to the rate case at Transco;\n•\nUnfavorable change in equity AFUDC primarily as a result of the timing of capital projects at Williams’ regulated businesses;\n•\nUnfavorable change in the deferral of ARO-related depreciation at Transco; partially offset by\n66\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\n•\nA net favorable change related to certain asset retirements in the Gulf Coast region in 2025;\n•\nLower operating expenses and administrative costs including employee-related costs, primarily due to the absence of the impact of a 2024 change in a practice related to payroll timing. \nNine months ended September 30, 2025 vs. nine months ended September 30, 2024\nTransmission, Power & Gulf Modified EBITDA\n increased primarily due to higher \nService revenues, \npartially offset by\n \nhigher \nOther segment costs and expenses.\nService revenues\n increased primarily due to: \n•\nA $208 million increase in Transco’s revenues primarily associated with expansion projects placed in service, notably Regional Energy Access in August 2024, Southside Reliability Enhancement in November 2024, Texas Louisiana Energy Pathway in April 2025, and Southeast Energy Connector in April 2025; and transportation and storage rate increases; \n•\nAn $82 million increase in the Gulf Coast region primarily due to higher natural gas gathering and crude oil transportation volumes from the Whale expansion project that went in-service in January 2025 and production handling, crude oil transportation and natural gas gathering volumes from new wells at Gulfstar One in the Pickerel field and at Blind Faith in the Ballymore field, partially offset by shut-ins for maintenance activities at Devil’s Tower impacting the Taggart and Kodiak fields;\n•\nA $67 million increase primarily in natural gas gathering revenues due to the Discovery Acquisition and volumes from the Shenandoah expansion project that went in-service in July 2025;\n•\nA $32 million increase in Gulf Coast Storage’s revenues primarily associated with higher storage rates.\nCommodity margins\n increased primarily due to the Discovery Acquisition.\nOther segment costs and expenses\n increased primarily due to:\n•\nNet unfavorable changes in charges and credits associated with regulatory assets and liabilities related to the rate case at Transco;\n•\nHigher operating expenses and administrative costs including increased operating costs resulting from the Discovery Acquisition, corporate allocations, and property taxes, as well as the absence of a gain associated with MountainWest cash-out sales in 2024 and higher employee-related costs, partially offset by the absence of a 2024 change in a practice related to payroll timing and acquisition and transition costs related to the Gulf Coast Storage Acquisition in January 2024 (see Note 3 – Acquisitions and Divestitures); \n•\nUnfavorable change in equity AFUDC primarily as a result of the timing of capital projects at Williams’ regulated businesses;\n•\nUnfavorable change in the deferral of ARO-related depreciation at Transco;\n•\nHigher project feasibility costs; partially offset by\n•\nA net favorable change related to certain asset retirements in the Gulf Coast region in 2025.\nProportional Modified EBITDA of equity-method investments\n decreased primarily due to lower proportional results as Discovery was consolidated following its August 2024 acquisition.\n67\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nNortheast G&P\nThree Months Ended  \nSeptember 30,\nNine Months Ended  \nSeptember 30,\n2025\n2024\n2025\n2024\n(Millions)\nService revenues\n$\n499 \n$\n475 \n$\n1,493 \n$\n1,419 \nProduct sales and service revenues – commodity consideration (1)\n31 \n27 \n133 \n75 \nSegment revenues\n530 \n502 \n1,626 \n1,494 \nProduct costs and net processing commodity expenses (1)\n(25)\n(19)\n(115)\n(56)\nOther segment costs and expenses\n(161)\n(156)\n(465)\n(436)\nProportional Modified EBITDA of equity-method investments\n161 \n149 \n474 \n459 \nNortheast G&P Modified EBITDA\n$\n505 \n$\n476 \n$\n1,520 \n$\n1,461 \nCommodity margins\n$\n6 \n$\n8 \n$\n18 \n$\n19 \n(1)\nIncluded as a component of \nCommodity margins\n.\nThree months ended September 30, 2025 vs. three months ended September 30, 2024\nNortheast G&P Modified EBITDA\n increased primarily due to higher \nService revenues\n and higher \nProportional Modified EBITDA of equity-method investments.\nService revenues\n increased primarily due to:\n•\nA $7 million increase in revenues associated with reimbursable expenses, which is offset by similar changes in the charges reflected in \nOther segment costs and expenses\n;\n•\nA $6 million increase in gathering revenues at Susquehanna Supply Hub primarily related to escalated rates;\n•\nA $5 million increase in gathering revenues in the Utica Shale region primarily related to higher volumes at Cardinal;\n•\nA $5 million increase in revenues at the Northeast JV primarily related to higher fractionation volumes, partially offset by lower processing volumes.\nOther segment costs and expenses\n increased primarily due to higher operating expenses, including higher electricity and fuel (substantially offset by higher \nService revenues \ndiscussed above). The increase was partially offset by lower employee-related costs, including the absence of the impact of a 2024 change in a practice related to payroll timing.\nProportional Modified EBITDA of equity-method investments\n increased at Appalachia Midstream Investments primarily driven by escalated gathering rates and higher gathering volumes.\nNine months ended September 30, 2025 vs. nine months ended September 30, 2024\nNortheast G&P Modified EBITDA\n increased primarily due to higher \nService revenues\n and higher \nProportional Modified EBITDA of equity-method investments\n, partially offset by higher \nOther segment costs and expenses.\n68\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nService revenues\n increased primarily due to:\n•\nA $34 million increase in revenues at the Northeast JV primarily related to higher gathering, processing, and fractionation volumes, and higher gathering and processing rates;\n•\nA $24 million increase in revenues associated with reimbursable expenses, which is offset by similar changes in the charges reflected in \nOther segment costs and expenses\n;\n•\nA $12 million increase in gathering revenues in the Utica Shale region primarily related to higher volumes at Cardinal;\n•\nNo change in gathering revenues at Susquehanna Supply Hub primarily related to escalated rates offset by lower volumes.\nOther segment costs and expenses\n increased primarily due to higher operating expenses, including higher electricity and fuel (substantially offset by higher \nService revenues \ndiscussed above). The increase was partially offset by lower employee-related costs, including the absence of the impact of a 2024 change in a practice related to payroll timing.\nProportional Modified EBITDA of equity-method investments\n increased at Blue Racer primarily due to higher volumes and annual rate escalations and at Laurel Mountain Midstream, LLC primarily due to higher commodity-based gathering rates. Additionally, Appalachia Midstream Investments increased primarily driven by escalated gathering rates and higher gathering volumes. The increase was partially offset by a decrease at Aux Sable Liquid Products LP due to the sale of Williams’ investment in the third quarter of 2024.\nWest\nThree Months Ended  \nSeptember 30,\nNine Months Ended  \nSeptember 30,\n2025\n2024\n2025\n2024\n(Millions)\nService revenues\n$\n470 \n$\n426 \n$\n1,354 \n$\n1,270 \nProduct sales and service revenues – commodity consideration (1)\n240 \n237 \n758 \n710 \nNet realized gain (loss) from commodity derivatives relating to service revenues\n2 \n— \n1 \n10 \nNet realized gain (loss) from commodity derivatives relating to product sales (1)\n— \n— \n— \n(5)\nNet realized gain (loss) from commodity derivatives\n2 \n— \n1 \n5 \nSegment revenues\n712 \n663 \n2,113 \n1,985 \nProduct costs and net processing commodity expenses (1)\n(211)\n(210)\n(666)\n(636)\nOther segment costs and expenses\n(195)\n(165)\n(516)\n(477)\nProportional Modified EBITDA of equity-method investments\n36 \n35 \n106 \n96 \nWest Modified EBITDA\n$\n342 \n$\n323 \n$\n1,037 \n$\n968 \nCommodity margins\n$\n29 \n$\n27 \n$\n92 \n$\n69 \n________________\n(1)    Included as a component of \nCommodity margins\n.\n69\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nThree months ended September 30, 2025 vs. three months ended September 30, 2024\nWest Modified EBITDA\n increased primarily due to higher \nService revenues, \npartially offset by higher \nOther segment costs and expenses\n.\nService revenues\n increased primarily due to:\n•\nA $21 million increase in the Haynesville Shale region primarily due to higher gathering volumes including those resulting from the Saber Asset Purchase;\n•\nA $19 million increase related to Louisiana Energy Gateway which was placed into service in third-quarter 2025;\n•\nA $17 million increase in the DJ Basin region primarily due to higher gathering volumes associated with the Rimrock Asset Purchase; partially offset by\n•\nA $22 million decrease in the Eagle Ford Shale region primarily due to lower MVC revenue.\nOther segment costs and expenses\n increased primarily due to the third-quarter 2025 $25 million write-off of certain compression assets in the DJ Basin region (see Note 8 – Fair Value Measurements and Guarantees). The increase was partially offset by lower employee-related costs, including the absence of the impact of a 2024 change in a practice related to payroll timing.\nNine months ended September 30, 2025 vs. nine months ended September 30, 2024\nWest Modified EBITDA\n increased primarily due to higher \nService revenues\n and \nCommodity margins, \npartially offset by higher \nOther segment costs and expenses.\nService revenues\n increased primarily due to:\n•\nA $48 million increase in the DJ Basin region primarily due to higher gathering volumes associated with the Rimrock Asset Purchase;\n•\nA $37 million increase in the Haynesville Shale region primarily due to higher gathering volumes including those resulting from the Saber Asset Purchase; \n•\nA $19 million increase related to Louisiana Energy Gateway which was placed into service in third-quarter 2025;\n•\nA $17 million increase in the Barnett Shale region primarily due to higher gathering rates driven by favorable commodity pricing; partially offset by\n•\nA $51 million decrease in the Eagle Ford Shale region primarily due to lower MVC revenue.\nCommodity margins\n increased $23 million primarily due to $14 million higher margins from equity NGLs associated with higher net realized NGL sales prices and an $11 million increase in marketing margins from increased sales activities associated primarily with higher prices.\nOther segment costs and expenses\n \nincreased primarily due to the third-quarter 2025 $25 million write-off of certain compression assets in the DJ Basin region and higher operating expenses associated with the Rimrock Asset Purchase. The increase was partially offset by lower employee-related costs, including the absence of the impact of a 2024 change in a practice related to payroll timing.\nProportional Modified EBITDA of equity-method investments\n increased primarily due to higher volumes at OPPL.\n70\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nGas & NGL Marketing Services\nThree Months Ended  \nSeptember 30,\nNine Months Ended  \nSeptember 30,\n2025\n2024\n2025\n2024\n(Millions)\nProduct sales (1)\n$\n415 \n$\n481 \n$\n1,557 \n$\n1,491 \nNet realized gain (loss) from commodity derivative instruments (1)\n(11)\n(8)\n(44)\n40 \nNet unrealized gain (loss) from commodity derivative instruments\n44 \n9 \n35 \n(188)\nNet gain (loss) from commodity derivatives\n33 \n1 \n(9)\n(148)\nSegment revenues\n448 \n482 \n1,548 \n1,343 \nProduct costs (1)\n(398)\n(450)\n(1,332)\n(1,269)\nNet unrealized gain (loss) from commodity derivative instruments within\n Net processing commodity expenses\n2 \n1 \n4 \n(3)\nOther segment costs and expenses\n(14)\n(22)\n(71)\n(85)\nProportional Modified EBITDA of equity-method investments\n16 \n— \n27 \n— \nGas & NGL Marketing Services Modified EBITDA\n$\n54 \n$\n11 \n$\n176 \n$\n(14)\nCommodity margins\n$\n6 \n$\n23 \n$\n181 \n$\n262 \n________________\n(1)    Included as a component of \nCommodity margins\n.\nThree months ended September 30, 2025 vs. three months ended September 30, 2024\nGas & NGL Marketing Services Modified EBITDA\n \nincreased primarily due to a favorable change in \nNet unrealized gain (loss) from commodity derivative instruments \nand higher \nProportional Modified EBITDA of equity-method investments\n, partially offset by lower \nCommodity margins\n. \nCommodity margins\n decreased $17 million primarily due to a $19 million decrease in natural gas marketing margins, including $36 million of lower natural gas transportation capacity marketing margins due to unfavorable net realized pricing spreads. The decrease in natural gas marketing margins was partially offset by $17 million of higher natural gas storage marketing margins primarily driven by favorable realized derivative gains.\nThe change in\n Net unrealized gain (loss) from commodity derivative instruments\n within \nSegment revenues\n and \nNet processing commodity expenses\n relates to derivative contracts that are not designated as hedges for accounting purposes. The change from 2024 is primarily due to a change in forward commodity prices relative to hedge positions in 2025 compared to 2024.\nProportional Modified EBITDA of equity-method investments\n increased due to the March 2025 investment in Cogentrix.\nNine months ended September 30, 2025 vs. nine months ended September 30, 2024\nGas & NGL Marketing Services Modified EBITDA\n increased primarily due to a favorable change in \nNet unrealized gain (loss) from commodity derivative instruments\n and higher \nProportional Modified EBITDA of equity-method investments\n, partially offset by lower \nCommodity margins\n. \nCommodity margins\n decreased $81 million primarily due to:\n•\nA $68 million decrease in natural gas marketing margins, including $87 million of lower natural gas transportation capacity marketing margins due to unfavorable net realized pricing spreads. The decrease in natural gas marketing margins was partially offset by $19 million of higher natural gas storage marketing \n71\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nmargins primarily driven by higher withdrawals in 2025 compared to 2024, partially offset by less favorable realized derivative gains;\n•\nA $13 million decrease in NGL marketing margins including an unfavorable change in net realized gains and losses on sale of inventory in 2025 compared to 2024 driven by an unfavorable change in NGL prices.\nNet unrealized gain (loss) from commodity derivative instruments\n within \nSegment revenues\n and \nNet processing commodity expenses\n changed from 2024 primarily due to a change in forward commodity prices relative to hedge positions in 2025 compared to 2024.\nOther segment costs and expenses\n de\ncreased primarily due to lower employee-related costs.\nProportional Modified EBITDA of equity-method investments\n increased due to the March 2025 investment in Cogentrix.\nOther\nThree Months Ended  \nSeptember 30,\nNine Months Ended  \nSeptember 30,\n \n2025\n2024\n2025\n2024\n \n(Millions)\nService revenues\n$\n4 \n$\n4 \n$\n12 \n$\n12 \nProduct sales (1)\n136 \n95 \n428 \n289 \nNet realized gain (loss) from derivative instruments (1)\n15 \n1 \n22 \n29 \nNet unrealized gain (loss) from derivative instruments\n5 \n3 \n16 \n(19)\nNet gain (loss) from commodity derivatives\n20 \n4 \n38 \n10 \nNet revenues from upstream operations, corporate, and other business activities. \n160 \n103 \n478 \n311 \nOther costs and expenses\n(67)\n(47)\n(192)\n(132)\nProportional Modified EBITDA of equity-method investments\n— \n2 \n— \n2 \nModified EBITDA from upstream operations, corporate, and other business activities\n$\n93 \n$\n58 \n$\n286 \n$\n181 \nNet realized product sales\n$\n151 \n$\n96 \n$\n450 \n$\n318 \n________________\n(1)    Included as a component of \nNet realized product sales\n.\nThree months ended September 30, 2025 vs. three months ended September 30, 2024\nModified EBITDA from upstream operations, corporate, and other business activities\n increased primarily due to: \n•\nA $55 million increase in \nNet realized product sales\n from our upstream operations primarily due to higher  natural gas production volumes associated with Williams’ Wamsutter region production, including the Crowheart Acquisition. Third-quarter 2025 also benefited from higher net realized commodity prices for natural gas compared to third-quarter 2024; partially offset by \n•\nA $20 million unfavorable change in other costs and expenses primarily related to upstream operations, including an increase from the Crowheart Acquisition in November 2024. \n72\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nNine months ended September 30, 2025 vs. nine months ended September 30, 2024\nModified EBITDA from upstream operations, corporate, and other business activities\n increased primarily due to:\n•\nA $132 million increase in \nNet realized product sales\n from upstream operations primarily due to higher production volumes and higher net realized commodity prices for natural gas, partially offset by lower net realized commodity prices for oil, associated with Williams’ Wamsutter region production, including the Crowheart Acquisition. The first nine months of 2025 also benefited from higher net realized commodity prices, partially offset by lower production volumes, associated with Williams’ South Mansfield production in the Haynesville Shale region;\n•\nA $35 million favorable change in \nNet unrealized gain (loss) from derivative instruments\n due to a change in forward commodity prices relative to hedge positions; partially offset by \n•\nA $60 million unfavorable change in other costs and expenses primarily related to upstream operations, including an increase from the Crowheart Acquisition in November 2024, and an unfavorable change associated with regulatory assets related to the effects of deferred taxes on equity funds used during construction. \n73\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nTransco - Results of Operations \nNine Months Ended September 30,\n2025\n$ Change\nfrom\n2024*\n% Change\nfrom\n2024*\n2024\n(Millions)\nRevenues:\nNatural gas transportation service revenues\n$\n2,134 \n+185 \n+9 \n%\n$\n1,949 \nNatural gas storage service revenues\n169 \n+21 \n+14 \n%\n148 \nNatural gas product sales\n81 \n+9 \n+13 \n%\n72 \nOther service revenues\n21 \n+2 \n+11 \n%\n19 \nTotal revenues\n2,405 \n2,188 \nCosts and expenses:\nNatural gas product costs\n81 \n-9 \n-13 \n%\n72 \nOperating and maintenance expenses\n372 \n+4 \n+1 \n%\n376 \nSelling, general, and administrative expenses\n166 \n-7 \n-4 \n%\n159 \nDepreciation and amortization expenses\n426 \n-16 \n-4 \n%\n410 \nTaxes, other than income taxes\n91 \n-6 \n-7 \n%\n85 \nOther (income) expense – net\n25 \n-63 \nNM\n(38)\nTotal costs and expenses\n1,161 \n1,064 \nOperating income (loss)\n1,244 \n+120 \n+11 \n%\n1,124 \nInterest expense\n(244)\n-1 \n— \n%\n(243)\nInterest income\n23 \n-24 \n-51 \n%\n47 \nAllowance for equity and borrowed funds used during construction (AFUDC)\n25 \n-48 \n-66 \n%\n73 \nOther income (expense) – net \n(3)\n+2 \n+40 \n%\n(5)\nNet income (loss)\n$\n1,045 \n+49 \n+5 \n%\n$\n996 \n_______\n*    + = Favorable change; - = Unfavorable change; NM = A percentage calculation is not meaningful due to a change in signs, a zero-value denominator, or a percentage change greater than 200.\nNine months ended September 30, 2025 vs. nine months ended September 30, 2024 \nVariances due to the changes in natural gas prices and transportation volumes have little impact on revenues because, under our rate design methodology, the majority of overall cost of service is recovered through firm capacity reservation charges in Transco’s transportation rates.\nTransco has cash out sales, which settle gas imbalances with shippers. In the course of providing transportation services to customers, Transco may receive different quantities of gas from shippers than the quantities delivered on behalf of those shippers. Additionally, Transco transports gas on various pipeline systems, which may deliver \n74\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\ndifferent quantities of gas on Transco’s behalf than the quantities of gas received from Transco. These transactions result in gas transportation and exchange imbalance receivables and payables. Transco’s tariff includes a method whereby the majority of transportation imbalances are settled on a monthly basis through cash out sales or purchases. The cash out sales have no impact on Transco’s operating income.\nRevenues increased primarily due to: \n•\nAn increase in\n Natural gas transportation service revenues \nprimarily\n \ndue to additional capacity from placing the following projects into service: \n◦\nThe Regional Energy Access Expansion in August 2024;\n◦\nThe Southside Reliability Enhancement in November 2024;\n◦\nThe Texas Louisiana Energy Pathway in April 2025; and\n◦\nThe Southeast Energy Connector in April 2025.\nThe increase in \nNatural gas transportation service revenues\n is also due to transportation rate increases effective March 1, 2025, partially offset by one less billing day in 2025, a decrease in short-term firm transportation, and lower electric power costs in 2025. Electric power costs are recovered from our customers through transportation rates and are offset in \nOperating and maintenance expenses \n resulting in no net impact on our results of operations;\n•\nAn increase in \nNatural gas storage service revenues \nprimarily due to an increase in rates. \n•\nAn increase in \nNatural gas product sales\n due to higher cash-out pricing, partially offset by lower volumes, which directly offsets in \nNatural gas product costs \nresulting in no net impact on our results of operations.\nNatural gas product costs\n changed unfavorably, directly offsetting\n Natural gas product sales \nand\n \nresulting in no net impact on our results of operations.\nOperating and maintenance expenses\n decreased primarily due to lower electric power costs. Electric power costs are recovered from customers through transportation rates and are offset in \nNatural gas transportation service revenues\n resulting in no net impact on results of operations. Additionally there were increases in \nOperating and maintenance expenses \nprimarily due to higher employee-related costs, partially offset by the absence of a 2024 change in payroll policy and a decrease in contractor services costs.\nSelling, general, and administrative expenses\n increased due to higher corporate allocations and employee-related costs, partially offset by the absence of a 2024 change in payroll policy.\nDepreciation and amortization expenses\n increased due to rate case adjustments as well as assets and expansion projects placed into service, partially offset by a decrease in ARO related depreciation (offset in \nOther income (expense) – net \n resulting in no net impact on Transco’s results of operations).\nOther (income) expense – net\n changed unfavorably primarily driven by changes in charges and credits associated with the rate case at Transco, an unfavorable change in ARO depreciation (offset in \nDepreciation and amortization expenses \nresulting in no net impact on Transco’s results of operations\n), \nand an unfavorable change in project feasibility costs.\nInterest income\n decreased due to a decrease in affiliated interest income on our advances to Williams due to a lower note receivable balance during 2025. \nAllowance for equity and borrowed funds used during construction (AFUDC) \ndecreased as a result of lower eligible capital expenditures.\n75\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nNWP - Results of Operations \nNine Months Ended September 30,\n2025\n$ Change\nfrom\n2024*\n% Change\nfrom\n2024*\n2024\n(Millions)\nRevenues:\nNatural gas transportation service revenues\n$\n320 \n$\n+10 \n+3 \n%\n$\n310 \nNatural gas storage service revenues\n11 \n— \n— \n%\n11 \nOther service revenues\n7 \n-1 \n-13 \n%\n8 \nTotal revenues\n338 \n329 \nCosts and expenses:\nOperating and maintenance expenses\n73 \n— \n— \n%\n73 \nSelling, general, and administrative expenses\n37 \n— \n— \n%\n37 \nDepreciation and amortization expenses\n88 \n-6 \n-7 \n%\n82 \nTaxes, other than income taxes\n11 \n— \n— \n%\n11 \nOther (income) expense - net\n(16)\n+2 \n+14 \n%\n(14)\nTotal costs and expenses\n193 \n189 \nOperating income (loss)\n145 \n+5 \n+4 \n%\n140 \nInterest expense\n(21)\n— \n— \n%\n(21)\nAllowance for equity and borrowed funds used during construction (AFUDC)\n7 \n-1 \n-13 \n%\n8 \nOther income (expense) – net\n4 \n-3 \n-43 \n%\n7 \nNet income (loss)\n$\n135 \n$\n+1 \n+1 \n%\n$\n134 \n_______\n*    + = Favorable change; - = Unfavorable change; NM = A percentage calculation is not meaningful due to a change in signs, a zero-value denominator, or a percentage change greater than 200.\nNine months ended September 30, 2025 vs. nine months ended September 30, 2024 \nVariances due to changes in natural gas prices and transportation volumes have little impact on revenues, because under our rate design methodology, the majority of overall cost of service is recovered through firm capacity reservation charges in our transportation rates.\nRevenues increased primarily due to: \n•\nAn increase in \nNatural gas transportation service revenues\n primarily due to  rate increases effective April 1, 2025 and an  increase in long-term firm transportation, partially offset by one less billing day in 2025 and a decrease in short-term firm transportation;\n•\nPartially offset by a decrease in \nOther service revenues\n from lower park and loan services.  \nDepreciation and amortization expenses \nincreased due to additional assets placed in service.   \n76\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nAllowance for equity and borrowed funds used during construction (AFUDC) \ndecreased as a result of lower eligible capital expenditures. \nOther income (expense) – net\n decreased primarily due to a decrease in affiliated interest income on our advances to Williams due to a lower note receivable balance during 2025.\n77\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nManagement’s Discussion and Analysis of Financial Condition and Liquidity\nOutlook\nWilliams’ growth capital and investment expenditures in 2025 are expected to range from $3.95 billion to $4.25 billion, excluding acquisitions. Growth capital spending in 2025 primarily includes the Power Innovation projects, projects supporting growth in the Haynesville Shale basin (including the Louisiana Energy Gateway expansion project), Transco expansions, all of which are fully contracted with firm transportation agreements, and projects supporting the Northeast G&P business. Williams is investing capital in the recently announced Louisiana LNG and Driftwood Pipeline projects, as well as the development of its Wamsutter upstream oil and gas properties. In addition to growth capital and investment expenditures, Williams also remains committed to projects that maintain its assets for safe and reliable operations, as well as projects that reduce emissions, and meet legal, regulatory, and/or contractual commitments. Williams retains the flexibility to adjust planned levels of growth capital and investment expenditures in response to changes in economic conditions or business opportunities including the repurchase of its common stock. \nDuring the first nine months of 2025, Williams issued $3 billion of long-term debt and retired $1.5 billion of long-term debt (see Note 7 – Debt and Banking Arrangements). \nIn June 2025, Williams acquired Saber for cash consideration of $47 million and the retention of $113 million of Saber’s debt, which was separately repaid in full within the same month. On January 3, 2025, Williams paid the remaining $100 million of the Gulf Coast Storage Acquisition purchase price obligation (see Note 3 – Acquisitions and Divestitures).\nAs of September 30, 2025, Williams, including consolidated subsidiaries, has approximately $2.2 billion of long-term debt due within one year. Williams’ potential sources of liquidity available to address these maturities include cash on hand, proceeds from refinancing, the credit facility, or the commercial paper program, as well as proceeds from asset monetizations.\nLiquidity\nWilliams expects to have sufficient liquidity to manage its businesses in 2025 based on forecasted levels of cash flow from operations and other sources of liquidity. Williams’ potential material internal and external sources and uses of liquidity are as follows:\nSources:\nCash and cash equivalents on hand\nCash generated from operations\nDistributions from equity-method investees\nUtilization of the credit facility and/or commercial paper program\nCash proceeds from issuance of debt and/or equity securities\nProceeds from asset monetizations\nUses:\nWorking capital requirements\nCapital and investment expenditures\nProduct costs\nGas & NGL Marketing Services payments for transportation and storage capacity and gas supply\nOther operating costs including human capital expenses\nQuarterly dividends to shareholders\nRepayments of borrowings under the credit facility and/or commercial paper program\nDebt service payments, including payments of long-term debt\nDistributions to noncontrolling interests\nShare repurchase program\n78\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nAs of September 30, 2025, Williams has approximately $25.6 billion of long-term debt due after one year. Potential sources of liquidity available to address these maturities include cash generated from operations, proceeds from refinancing, the credit facility, or the commercial paper program, as well as proceeds from asset monetizations.\nPotential risks associated with Williams’ planned levels of liquidity discussed above include those previously discussed in Company Outlook\n.\nAs of September 30, 2025, Williams had a working capital deficit of $3.106 billion, including cash and cash equivalents and long-term debt due within one year. Williams’ available liquidity is as follows:\nSeptember 30, 2025\n \n(Millions)\nCash and cash equivalents\n$\n70 \nCapacity available under Williams’ $3.75 billion credit facility, less amounts outstanding under Williams’ $3.5 billion commercial paper program (1)\n3,580 \n$\n3,650 \n__________\n(1)\nIn managing its available liquidity, Williams does not expect a maximum outstanding amount in excess of the capacity of its credit facility inclusive of any outstanding amounts under its commercial paper program. Williams had $170 million of \nCommercial paper\n outstanding at September 30, 2025. Through September 30, 2025, the highest amount outstanding under the commercial paper program and credit facility during 2025 was $475 million. Williams expects to be in compliance with the financial covenants associated with the credit facility for the September 30, 2025, reporting period. \nDividends\nWilliams increased the regular quarterly cash dividend to common stockholders from $0.475 per share paid in each quarter of 2024, to $0.50 per share paid in the first three quarters of 2025. \nDistributions from Equity-Method Investees\nThe organizational documents of entities in which Williams has an equity-method investment generally require periodic distributions of their available cash to their members. In each case, available cash is reduced, in part, by reserves appropriate for operating their respective businesses.\nCredit Ratings\nThe interest rates at which Williams is able to borrow money are impacted by its credit ratings, which are currently as follows: \nRating Agency\nOutlook\nSenior Unsecured\nDebt Rating\nS&P Global Ratings\nStable\nBBB+\nMoody’s Investors Service\nPositive\nBaa2\nFitch Ratings\nPositive\nBBB\nIn April 2025 Moody’s Investors Service changed its Outlook from Stable to Positive. In March 2025 S&P Global Ratings changed its Senior Unsecured Debt Rating to BBB+ with Stable Outlook. In January 2025, Fitch Ratings changed its Outlook from Stable to Positive.\nThese credit ratings are included for informational purposes and are not recommendations to buy, sell, or hold Williams securities, and each rating should be evaluated independently of any other rating. No assurance can be given that the credit rating agencies will continue to assign Williams investment-grade ratings even if it meets or exceeds their current criteria for investment-grade ratios. A downgrade of its credit ratings might increase Williams’ \n79\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nfuture cost of borrowing and, if ratings were to fall below investment-grade, could require it to provide additional collateral to third parties, negatively impacting Williams’ available liquidity.\nSources (Uses) of Cash\nThe following table summarizes the sources (uses) of cash and cash equivalents for each of the periods presented in the Williams Consolidated Statement of Cash Flows:\n \nCash Flow\nNine Months Ended September 30,\n \nCategory\n2025\n2024\n \n(Millions)\nSources of cash and cash equivalents:\nNet cash provided (used) by operating activities\nOperating\n$\n4,322 \n$\n3,756 \nProceeds from long-term debt (Note 7)\nFinancing\n2,994 \n3,594 \nProceeds from dispositions of equity-method investments (Note 3)\nInvesting\n— \n161 \nUses of cash and cash equivalents:\nCapital expenditures\nInvesting\n(2,938)\n(1,805)\nCommon dividends paid\nFinancing\n(1,832)\n(1,737)\nPayments of long-term debt\nFinancing\n(1,733)\n(2,286)\nProceeds from (payments of) commercial paper – net\nFinancing\n(284)\n(723)\nDividends and distributions paid to noncontrolling interests\nFinancing\n(197)\n(178)\nPurchases of and contributions to equity-method investments\nInvesting\n(192)\n(101)\nPurchases of businesses, net of cash acquired \n(\nNote 3\n)\nInvesting\n(1)\n(1,995)\nOther sources / (uses) – net\nFinancing and Investing\n(129)\n(74)\nIncrease (decrease) in cash and cash equivalents\n$\n10 \n$\n(1,388)\nOperating activities \nThe factors that determine Williams’ operating activities are largely the same as those that affect \nNet income (loss)\n, with the exception of noncash items such as \nDepreciation, depletion, and amortization\n, \nProvision (benefit) for deferred income taxes\n, \nEquity (earnings) losses\n, \nNet unrealized (gain) loss from commodity derivative instruments\n, \nGain on disposition of equity-method investments\n, \nGain on remeasurement of equity-method investments\n, \nInventory write-downs, \nand \nAmortization of stock-based awards.\nWilliams’\n Net cash provided (used) by operating activities\n for the nine months ended September 30, 2025, increased from the same period in 2024, primarily due to higher operating income (excluding non-cash items previously discussed), along with favorable changes in margin requirements and net operating working capital.\n80\nTable of Contents"
}