{
  "source_file": "wmb-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\n \nBusiness\nThis report includes information for multiple registrants, specifically The Williams Companies, Inc. (Williams), as well as Transcontinental Gas Pipe Line Company, LLC (Transco) and Northwest Pipeline LLC (NWP) both of which are wholly owned subsidiaries of Williams (collectively, the Registrants). References to subsidiaries by name, including equity-method investees, Transco, and NWP, refer exclusively to those businesses and operations.\nGeneral\nWilliams is an energy company committed to being the leader in providing infrastructure that safely delivers natural gas products to reliably fuel the clean energy economy. Williams has operations in 12 supply areas that provide natural gas gathering, processing, and transmission services; NGLs fractionation, transportation, and storage services; and marketing services to approximately 800 customers. Williams owns an interest in and operates over 33,000 miles of pipelines in 24 states, 34 natural gas processing facilities, 9 NGL fractionation facilities, approximately 25 million barrels of NGL storage capacity, and 417 Bcf of natural gas storage capacity, and delivers natural gas that is used every day for clean-power generation, heating, and industrial use. \nWilliams was founded in 1908, originally incorporated under the laws of the state of Nevada in 1949 and reincorporated under the laws of the state of Delaware in 1987. Its common stock trades on the New York Stock Exchange under the symbol “WMB.” Its operations are located in the United States. Williams’ headquarters are located in Tulsa, Oklahoma, with other major offices in Houston, Texas; Pittsburgh, Pennsylvania; and Salt Lake City, Utah.\nTransco owns and operates an approximately 9,700-mile natural gas pipeline system extending from Texas, Louisiana, Mississippi and the Gulf of America through Alabama, Georgia, South Carolina, North Carolina, Virginia, Maryland, Delaware, Pennsylvania and New Jersey to the New York City metropolitan area. The system serves customers in Texas and the 12 southeast and Atlantic seaboard states mentioned above, including major metropolitan areas in Georgia, Washington D.C., Maryland, North Carolina, New York, New Jersey, and Pennsylvania. Transco’s principal business is the interstate transportation of natural gas, which is regulated by the FERC.\nNWP owns and operates an approximately 3,900-mile natural gas pipeline system, extending from the San Juan basin in northwestern New Mexico and southwestern Colorado through Colorado, Utah, Wyoming, Idaho, Oregon, and Washington to a point on the Canadian border near Sumas, Washington. The system serves customers in Washington, Oregon, Idaho, Wyoming, Nevada, Utah, Colorado, New Mexico, California, and Arizona, either directly or indirectly through interconnections with other pipelines. NWP’s principal business is the interstate transportation of natural gas, which is regulated by FERC.\n4\nService Assets, Customers, and Contracts\nKey variables for Williams’ businesses will continue to be: \n•\nObstacles to Williams’ expansion efforts, including delays or denials of necessary permits and opposition to hydrocarbon-based energy development;\n•\nProducer drilling activities impacting natural gas supplies supporting Williams’ gathering and processing volumes;\n•\nRetaining and attracting customers by continuing to provide reliable services;\n•\nRevenue growth associated with additional infrastructure either completed or currently under construction;\n•\nPrices impacting Williams’ commodity-based activities; \n•\nDisciplined growth in Williams’ service areas. \n5\nInterstate Natural Gas Pipeline Assets\nWilliams’ interstate natural gas pipelines, which are presented in the Transmission & Gulf of America segment as described under the heading “Business Segments,” are subject to regulation by the FERC and as such, rates and charges for the transportation of natural gas in interstate commerce are subject to regulation. The rates are established primarily through the FERC’s ratemaking process, but rates may also be negotiated with customers pursuant to the terms of tariffs and FERC policy.\nWilliams’ interstate natural gas pipelines transport and store natural gas for a broad mix of customers, including local natural gas distribution companies, public utilities, municipalities, direct industrial users, electric power generators, and natural gas marketers and producers. Most of Williams’ interstate natural gas transmission businesses are fully contracted under long-term firm reservation contracts with high credit quality customers. These contracts have various expiration dates and account for the major portion of these regulated businesses. Additionally, Williams offers storage services and interruptible transportation services under shorter-term agreements. The top ten customers of the interstate natural gas pipelines in 2024 accounted for approximately 45 percent of Williams’ regulated interstate natural gas transportation and storage revenues.\nTransco’s three largest customers in 2024 accounted for approximately 20 percent of Transco’s total operating revenues. Transco’s firm transportation agreements are generally long-term agreements with various expiration dates and account for the major portion of its business.\nDuring 2024, NWP’s three largest customers were Puget Sound Energy, Inc., Cascade Natural Gas Corporation, and Northwest Natural Gas Company, which accounted for approximately 31 percent, 10 percent, and 11 percent, respectively, of NWP total operating revenues for the year ended December 31, 2024. No other customer accounted for more than 10 percent of NWP total operating revenues during that period.\n6\nNatural Gas Gathering and Processing Assets\nWilliams’ gathering, processing, and treating operations are presented within the Transmission & Gulf of America, Northeast G&P, and West reporting segments as described under the heading “Business Segments.”\nWilliams’ gathering systems receive natural gas from producers’ crude oil and natural gas wells and gather these volumes to gas processing, treating, or redelivery facilities. Typically, natural gas, in its raw form, is not acceptable for transportation in major interstate natural gas pipelines or for commercial use as a fuel. Williams’ treating facilities remove water vapor, carbon dioxide, and other contaminants, and collect condensate. Williams is generally paid a fee based on the volume of\n \nnatural gas gathered and/or treated, generally measured in the Btu heating value.\nIn addition, natural gas contains various amounts of NGLs, which generally have a higher value when separated from the natural gas stream. Williams’ processing plants extract the NGLs, which include ethane, primarily used in the petrochemical industry; propane, used for heating, fuel, and also in the petrochemical industry; and, normal butane, isobutane, and natural gasoline, primarily used by the refining industry.\nWilliams’ gas processing services generate revenues primarily from the following types of contracts:\n•\nFee-based: A cash fee is received based on the volume of natural gas processed, generally measured in the Btu heating value. A portion of Williams’ fee-based processing revenue includes a share of the margins on the NGLs produced. For the year ended December 31, 2024, approximately 95 percent of NGL production volumes were under fee-based contracts.\n•\nNoncash commodity-based: Gas is also processed under two types of commodity-based contracts, keep-whole and percent-of-liquids, where consideration for services is received in the form of NGLs. For a keep-whole arrangement Williams replaces the Btu content of the retained NGLs with natural gas purchases, also known as shrink replacement gas. For a percent-of-liquids arrangement, Williams delivers an agreed-upon percentage of the extracted NGLs and retains the remainder. Retained NGLs, referred to as  equity NGL production, are then sold. Per-unit NGL margins are calculated based on sales of these equity volumes at the processing plants. For the year ended December 31, 2024, approximately 5 percent of NGL production volumes were under noncash commodity-based contracts. \nGenerally, Williams’ gathering and processing agreements are long-term agreements, with terms ranging from month-to-month to the life of the producing lease. Certain contracts include cost-of-service mechanisms that are designed to support a return on invested capital and allow gathering rates to be adjusted, subject to specified caps in certain cases, to account for variability in volume, capital expenditures, commodity price fluctuations, compression, and other expenses. Williams also has certain gas gathering and processing agreements with MVC, whereby the customer is obligated to pay a contractually determined fee based on any shortfall between the actual gathered and processed volumes and the MVC for a stated period.\nDemand for gas gathering and processing services is dependent on producers’ drilling activities, which is impacted by the strength of the economy, commodity prices, and the resulting demand for natural gas by manufacturing and industrial companies and consumers. Williams’ gathering, processing, and treating businesses do not have direct exposure to crude oil prices. Williams’ on-shore natural gas gathering and processing businesses are substantially focused on gas-directed drilling basins rather than crude oil, with a broad diversity of basins and customers served. Declines in crude oil drilling would be expected to result in less associated natural gas production, which could drive more demand for natural gas produced from gas-directed basins served. \nDuring 2024, Williams’ facilities gathered and processed gas for approximately 248 customers. The top ten customers accounted for approximately 59 percent of gathering and processing fee revenues and NGL margins from noncash commodity-based agreements. Williams believes counterparty credit concerns in its gathering and processing businesses are significantly mitigated by the physical nature of Williams’ services, where gathering occurs at the wellhead and therefore is critical to a producer’s ability to move product to market.\n7\nGas and NGL Marketing\nWilliams’ natural gas and NGL marketing services are presented primarily within its Gas & NGL Marketing Services segment. Williams markets natural gas and NGL products to a wide range of users in the energy and petrochemical industries. In 2024, the three largest natural gas marketing customers accounted for approximately 10 percent of Williams’ gross natural gas marketing sales, and the three largest NGL marketing customers accounted for approximately 37 percent of Williams’ NGL marketing sales.\nWilliams’ gas marketing business markets natural gas and provides natural gas asset management and wholesale marketing, trading, storage, and transportation for a diverse set of natural gas and electric utilities, municipalities, power generators, and producers, including for Williams’ upstream properties. Additionally, Williams’ gas marketing business moves and optimizes natural gas to markets through transportation and storage agreements on Williams’ own strategically positioned assets. Williams’ gas and NGL marketing services provide customers with access to diverse sources of supply and to various natural gas demand markets, including the southeastern and Gulf Coast regions which are the fastest growing natural gas demand regions in the United States. \nWilliams purchases natural gas for storage when the current market price paid to buy and transport natural gas plus the cost to store and finance the natural gas is less than an estimated, forward market price that can be received in the future, resulting in positive net product sales. Commodity-based exchange-traded futures contracts and over-the-counter (OTC) contracts are used to sell natural gas at that future price to substantially protect the natural gas revenues that will ultimately be realized when the stored natural gas is sold. Additionally, Williams enters into transactions to secure transportation capacity between delivery points in order to serve Williams’ customers and various markets. Commodity-based exchange-traded futures contracts and OTC contracts are used to capture the price differential or spread between the locations served by the capacity in order to substantially protect the natural gas revenues that will ultimately be realized when the physical flow of natural gas between receipt and delivery points occurs. \nMonthly demand charges incurred for the contracted storage and transportation capacity and payments associated with asset management agreements are substantially indirectly reimbursed by customers. As Williams is acting as an agent, natural gas marketing revenues are presented net of the related costs of those activities. In addition, all of Williams’ natural gas marketing derivative activities qualify as held for trading purposes, which requires net presentation in Williams Consolidated Statement of Income.\nWilliams’ NGL marketing business transports and markets equity NGLs from the production at Williams’ processing plants, NGLs from the production at Williams’ upstream properties, and also NGLs on behalf of third-party NGL producers, including some of our fee-based processing customers, as well as the NGL volumes owned by certain of Williams’ equity-method investments. The NGL marketing business bears the risk of price changes in these NGL volumes while they are being transported to final sales delivery points. In order to meet sales contract obligations, Williams may purchase products in the spot market for resale.\nWilliams is exposed to commodity price risk. To manage this volatility, various contracts are used in the marketing and trading activities that generally meet the definition of derivatives. Williams enters into commodity-related derivatives to hedge exposures to natural gas and NGLs and retain exposure to price changes that can, in a volatile energy market, be material and can adversely affect results of operations.\nWilliams experiences significant earnings volatility from the fair value accounting required for the derivatives used to hedge a portion of the economic value of the underlying transportation and storage portfolio as well as upstream related production. However, the unrealized fair value measurement gains and losses are generally offset by valuation changes in the economic value of the underlying production or transportation and storage contracts, which is not recognized until the underlying transaction occurs.\nCrude Oil Transportation and Production Handling Asset\ns\nWilliams’ crude oil transportation operations, which are primarily presented in the Transmission & Gulf of America segment as described under the heading “Business Segments,” earn revenues primarily from a combination of fixed-monthly fees, contractual fixed or variable fees applied to production volumes, and contributions in aid of \n8\nconstruction (CIAC) arrangements. Generally, fixed-monthly fees associated with production handling and export revenues are recognized on a units-of-production basis utilizing either contractually determined maximum daily quantities or expected remaining production. CIAC arrangements are recognized on a units of production basis, utilizing expected remaining production. Williams’ crude oil transportation business is supported mostly by major oil producers with long-cycle perspectives.  \nStandalone, Market-Based Rate Natural Gas Storage Assets\nWilliams’ standalone, market-based rate natural gas storage assets are presented in the Transmission & Gulf of America segment as described under the heading “Business Segments” and include Williams’ North Texas Assets (NorTex) acquired in August 2022 and Williams’ Gulf Coast storage assets acquired in January 2024. These natural gas storage assets provide natural gas storage services in interstate commerce under the jurisdiction of the FERC pursuant to the Natural Gas Act or Section 311 of the Natural Gas Policy Act. Williams is authorized to charge and collect market-based rates for all of the services that these natural gas storage assets provide. \nWilliams stores natural gas for a broad mix of customers, including local natural gas distribution companies, public utilities, municipalities, direct industrial users, electric power generators, and natural gas marketers and producers. Most of these natural gas storage businesses are fully contracted under long-term firm reservation contracts with high credit quality customers. The contracts have various expiration dates and account for the major portion of the entities’ businesses. The three largest customers of this business in 2024 accounted for approximately 21 percent of its total operating revenues.\nBusiness Segments\nConsistent with the manner in which Williams’ chief operating decision maker evaluates performance and allocates resources, Williams’ operations are conducted, managed, and presented in Part I of this Annual Report within the following reportable segments: Transmission & Gulf of America, Northeast G&P, West, and Gas & NGL Marketing Services. All remaining business activities, including upstream operations, certain new energy ventures, and corporate activities, are included in Other. \nWilliams’ reportable segments are comprised of the following business activities:\n•\nTransmission & Gulf of America is comprised of the Transco, NWP, and MountainWest interstate natural gas pipelines, and their related natural gas storage facilities, as well as natural gas gathering and processing and crude oil production handling and transportation assets in the Gulf Coast region, including  Discovery, a former 60 percent equity-method investment in which Williams acquired the remaining ownership interest in August 2024, a 51 percent interest in Gulfstar One LLC (Gulfstar One), and a 50 percent equity-method investment in Gulfstream Natural Gas System, L.L.C. (Gulfstream). Transmission & Gulf of America also includes natural gas storage facilities and pipelines providing services in north Texas, Louisiana, and Mississippi.\n•\nNortheast G&P is comprised of midstream gathering, processing, and fractionation businesses in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio, as well as a 65 percent interest in Ohio Valley Midstream LLC (Northeast JV) which operates in West Virginia, Ohio, and Pennsylvania, a 66 percent interest in Cardinal Gas Services, L.L.C. (Cardinal) which operates in Ohio, a 69 percent equity-method investment in Laurel Mountain Midstream, LLC (Laurel Mountain), a 50 percent equity-method investment in Blue Racer Midstream LLC (Blue Racer), and Appalachia Midstream Investments.\n•\nWest is comprised of gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of south Texas, the Haynesville Shale region of east Texas and northwest Louisiana, the Mid-Continent region which includes the Anadarko and Permian basins, and the DJ Basin of Colorado which includes RMM, a former 50 percent equity-method investment in which Williams acquired the remaining ownership interest in November 2023. This segment also includes NGL storage facilities, an undivided 50 percent interest in \n9\nan NGL fractionator near Conway, Kansas, and a 50 percent equity-method investment in Overland Pass Pipeline Company LLC (OPPL). \n•\nGas & NGL Marketing Services is comprised of NGL and natural gas marketing and trading operations, which includes risk management and transactions related to the storage and transportation of natural gas and NGLs on strategically positioned assets.   \nDetailed discussion of each of our reportable segments follows. For a discussion of ongoing expansion projects, see Part II, Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nTransmission & Gulf of America\nInterstate Natural Gas Pipeline Assets\nTransco\nAt December 31, 2024, Transco’s system had a design capacity totaling approximately 19.8 MMdth/d. During 2024, Transco began full service on the Regional Energy Access expansion project which added approximately 0.4 MMdth/d of firm transportation capacity to its pipeline, partial early service on the Southside Reliability Enhancement expansion project which added approximately 0.4 MMdth/d of firm transportation capacity, and full service on Carolina Market Link expansion project which added approximately 0.1 MMdth/d of firm transportation capacity. In addition, a reduction of approximately 0.1 MMdth/d of firm transportation capacity is attributable to unsubscribed capacity as well as a reduction of approximately 0.1 MMdth/d of firm transportation capacity is attributable to termination of interim service related to the Regional Energy Access expansion project. Transco’s system includes 61 compressor stations, four underground storage fields, and one LNG storage facility. Compression facilities at sea level-rated capacity total approximately 2.6 million horsepower.\nTransco has natural gas storage capacity in four underground storage fields located on or near its pipeline system or market areas and operates two of these storage fields. Transco also has storage capacity in an LNG storage facility that it owns and operates. The total usable gas storage capacity available to Transco and its customers in such underground storage fields and LNG storage facility and through storage service contracts is approximately 188 Bcf of natural gas. At December 31, 2024, Transco’s customers had stored in its facilities approximately 137 Bcf of natural gas. Storage capacity permits Transco’s customers to inject gas into storage during the summer and off-peak periods for delivery during peak winter demand periods.\nNWP\nAt December 31, 2024, NWP’s system had a design capacity totaling approximately 3.8 MMdth/d. NWP’s system includes 42 transmission compressor stations having a combined sea level-rated capacity of approximately 476,000 horsepower.  \nNWP owns a one-third undivided interest in the Jackson Prairie underground storage facility in Washington. NWP also owns and operates an LNG storage facility in Washington. These storage facilities have an aggregate working natural gas storage capacity of approximately 10 Bcf. NWP also contracts for natural gas storage services for approximately 3 Bcf at the Clay basin underground storage reservoir with a Williams’ affiliate, MountainWest. These natural gas storage facilities, which are substantially utilized for third-party natural gas, enable NWP to balance daily receipts and deliveries and provide storage services to customers.\nMountainWest Acquisition\nOn February 14, 2023, Williams closed on the acquisition of 100 percent of MountainWest Pipelines Holding Company. MountainWest is an interstate natural gas transmission company that owns and operates an approximately 2,000-mile natural gas pipeline system which is regulated by the FERC. At December 31, 2024, MountainWest’s system has a design capacity totaling 8.0 MMdth/d. The system is comprised of MountainWest Pipeline, LLC; MountainWest Overthrust Pipeline, LLC; a 50 percent equity-method interest in White River Hub, LLC; and 64 Bcf of natural gas storage capacity, including the Clay basin underground storage reservoir in Utah. During 2024, MountainWest increased its natural gas storage capacity at the Clay basin underground storage reservoir by \n10\napproximately 8 Bcf. MountainWest is located in the Rocky Mountains near six producing areas, including the Greater Green River basin in Wyoming, the Uinta basin in Utah, and the Piceance basin in Colorado. \nGulfstream\nWilliams owns a 50 percent equity-method investment in Gulfstream, a 745-mile interstate natural gas pipeline system extending from the Mobile Bay area in Alabama to markets in Florida, which has a capacity to transport 1.4 Bcf/d. Operating responsibilities for Gulfstream are shared with the other 50 percent owner.\nStandalone, Market-Based Rate Natural Gas Storage Assets\nGulf Coast Storage Acquisition\nOn January 3, 2024, Williams closed on the Gulf Coast Storage Acquisition. At December 31, 2024, these assets include a strategic portfolio of approximately 230 miles of natural gas transmission pipelines and six underground storage facilities with a capacity of approximately 118 Bcf of natural gas storage across Louisiana and Mississippi and direct access to LNG export facilities and interstate pipelines.  These assets expand Williams’ natural gas storage footprint in the Gulf Coast region. \nNorth Texas Assets (NorTex)\nOn August 31, 2022, Williams purchased a group of assets in north Texas from NorTex Midstream Holdings, LLC. At December 31, 2024, NorTex includes approximately 94 miles of natural gas transmission pipelines and 37 Bcf of natural gas storage in the Dallas-Fort Worth market. In addition to providing gas supply to power generation in north Texas, these assets also provide storage services for Permian gas directed toward growing Gulf Coast LNG demand.\nNatural Gas Gathering and Processing Assets\nThe following tables summarize the significant owned and operated gathering and processing assets of this segment: \nOffshore Natural Gas Gathering Pipelines\nLocation\nPipeline Miles\nInlet Capacity (Bcf/d)\nOwnership Interest\nSupply Basins\nConsolidated: \nCanyon Chief, including Blind Faith and Gulfstar extensions\nDeepwater Gulf of America\n156\n0.5\n100%\nEastern Gulf of America\nNorphlet\nDeepwater Gulf of America\n58\n0.3\n100%\nEastern Gulf of America\nOther Eastern Gulf\nOffshore shelf and other\n46\n0.2\n100%\nEastern Gulf of America\nSeahawk\nDeepwater Gulf of America\n115\n0.4\n100%\nWestern Gulf of America\nPerdido Norte\nDeepwater Gulf of America\n105\n0.3\n100%\nWestern Gulf of America\nWhale\nDeepwater Gulf of America\n26\n0.2\n100%\nWestern Gulf of America\nOther Western Gulf\nOffshore shelf and other\n53\n0.2\n100%\nWestern Gulf of America\nDiscovery\nCentral Gulf of America\n594\n0.6\n100%\nCentral Gulf of America\n11\nNatural Gas Processing Facilities\nLocation\nInlet Capacity (Bcf/d)\nNGL Production Capacity (Mbbls/d)\nOwnership Interest\nSupply Basins\nConsolidated: \nMarkham\nMarkham, TX\n0.5\n45\n100%\nWestern Gulf of America\nMobile Bay\nCoden, AL\n0.7\n35\n100%\nEastern Gulf of America\nDiscovery\nLarose, LA\n0.6\n35\n100%\nCentral Gulf of America\nCrude Oil Transportation and Production Handling Assets \nIn addition to Williams’ natural gas assets, Williams owns and operates four deepwater crude oil pipelines and owns and operates production platforms serving the deepwater in the Gulf of America. Williams’ offshore floating production platforms provide centralized services to deepwater producers such as compression, separation, production handling, water removal, and pipeline landings. \nThe following tables summarize the significant operated crude oil transportation pipelines and production handling platforms of this segment:\n \nCrude Oil Pipelines\nPipeline Miles\nCapacity (Mbbls/d)\nOwnership Interest\nSupply Basins\nConsolidated:\nMountaineer, including Blind Faith and Gulfstar extensions\n155\n150\n100%\nEastern Gulf of America\nBANJO\n57\n90\n100%\nWestern Gulf of America\nAlpine\n96\n85\n100%\nWestern Gulf of America\nPerdido Norte\n74\n150\n100%\nWestern Gulf of America\nWhale\n124\n140\n100%\nWestern Gulf of America\nProduction Handling Platforms\nGas Inlet Capacity (MMcf/d)\nCrude/NGL Handling Capacity (Mbbls/d)\nOwnership Interest\nSupply Basins\nConsolidated:\nDevils Tower\n110\n60\n100%\nEastern Gulf of America\nGulfstar I FPS (1)\n172\n80\n51%\nEastern Gulf of America\nDiscovery\n75\n10\n100%\nCentral Gulf of America\n__________\n(1)\nStatistics reflect 100 percent of the assets from Williams’ 51 percent interest in Gulfstar One floating production system (FPS).\nDiscovery Acquisition\nOn August 1, 2024, Williams closed on the acquisition of the remaining 40 percent interest in Discovery, along with certain other assets. Discovery’s assets include a 600 MMcf/d cryogenic natural gas processing plant near Larose, Louisiana, a 35 Mbbls/d NGL fractionator plant near Paradis, Louisiana, and a 594-mile offshore natural gas gathering and transportation system in the Gulf of America. Discovery’s mainline has a gathering inlet capacity of 600 MMcf/d. Discovery’s assets also include a crude oil production handling platform with capacity of 10 Mbbls/d and gas handling and separation capacity of 75 MMcf/d.\nDeepwater Whale Expansion Project\nIn August 2021, Williams reached an agreement with two third-parties to provide offshore natural gas gathering and crude oil transportation services as well as onshore natural gas processing services. The project expanded its \n12\nexisting Western Gulf of America offshore infrastructure via a 26-mile gas lateral pipeline from the Whale platform to the existing Perdido gas pipeline and added a new 124-mile oil pipeline from the Whale platform to Williams’ existing junction platform. This project was placed into service in January 2025.\nTransmission & Gulf of America Operating Statistics\n2024\n2023\n2022\n(Annual Average Amounts)\nConsolidated:\n \nInterstate natural gas pipeline throughput (MMdth/d) (1) (2)\n20.2 \n20.4 \n16.9 \nGathering volumes (Bcf/d) \n0.55 \n0.26 \n0.29 \nPlant inlet natural gas volumes (Bcf/d) \n0.71 \n0.44 \n0.47 \nNGL production (Mbbls/d)\n47 \n27 \n28 \nNGL equity sales (Mbbls/d)\n10 \n6 \n6 \nCrude oil transportation (Mbbls/d)\n113 \n123 \n119 \nNon-consolidated: (3)\nInterstate natural gas pipeline throughput (MMdth/d) (1)\n1.2 \n1.2 \n1.3 \nGathering volumes (Bcf/d)\n— \n0.34 \n0.40 \nPlant inlet natural gas volumes (Bcf/d)\n— \n0.34 \n0.40 \nNGL production (Mbbls/d)\n— \n27 \n28 \nNGL equity sales (Mbbls/d)\n— \n7 \n8 \n_____________\n(1)\nTbtu converted to MMdth at one trillion British thermal units = one million dekatherms.\n(2)\nIncludes volumes for natural gas transmission assets acquired in the MountainWest Acquisition after the purchase on February 14, 2023, including 100 percent of the volumes associate with the operated equity-method investment White River Hub, LLC. Further, the amounts for the acquired assets are averaged over the period owned, not over the entire year.\n(3)\nIncludes 100 percent of the volumes associated with operated equity-method investments Gulfstream and Discovery, prior to the acquisition of the remaining 40 percent interest in Discovery on August 1, 2024. Volumes associated with the Discovery assets for 2024 are presented entirely in the Consolidated section.  \nNortheast G&P \nNatural Gas Gathering and Processing Assets\nThis segment includes Williams’ natural gas gathering, compression, processing, and NGL fractionation businesses in the Marcellus and Utica Shale regions in Pennsylvania, West Virginia, New York, and Ohio.\n13\nThe following tables summarize the significant operated assets of this segment:\n \nNatural Gas Gathering Assets\n \nLocation\nPipeline Miles\nInlet Capacity (Bcf/d)\nOwnership Interest\nSupply Basins\nConsolidated:\nOhio Valley Midstream (1)\nOhio, West Virginia, & Pennsylvania\n216\n0.8\n65%\nAppalachian\nUtica East Ohio Midstream (1) (2)\nOhio\n53\n0.6\n65%\nAppalachian\nSusquehanna Supply Hub\nPennsylvania & New York\n506\n4.6\n100%\nAppalachian\nCardinal (1)\nOhio\n429\n0.7\n66%\nAppalachian\nFlint\nOhio\n100\n0.5\n100%\nAppalachian\nNon-consolidated: (3)\nBradford Supply Hub\nPennsylvania\n754\n4.4\n66%\nAppalachian\nMarcellus South\nPennsylvania & West Virginia\n296\n1.3\n68%\nAppalachian\nLaurel Mountain\nPennsylvania\n1,147\n0.9\n69%\nAppalachian\nBlue Racer\nOhio & West Virginia\n617\n2.0\n50%\nAppalachian\n \nNatural Gas Processing Facilities\n \nLocation\nInlet Capacity (Bcf/d)\nNGL Production Capacity (Mbbls/d)\nOwnership Interest\nSupply Basins\nConsolidated: (1)\nFort Beeler\nMarshall Co., WV\n0.5\n62\n65%\nAppalachian\nOak Grove\nMarshall Co., WV\n0.6\n75\n65%\nAppalachian\nKensington\nColumbiana Co., OH\n0.6\n68\n65%\nAppalachian\nLeesville\nCarroll Co., OH\n0.2\n18\n65%\nAppalachian\nNon-consolidated: (3)\nBerne\nMonroe Co., OH\n0.4\n60\n50%\nAppalachian\nNatrium\nMarshall Co., WV\n0.8\n120\n50%\nAppalachian\n_____________\n(1)\nStatistics reflect 100 percent of the assets from Williams’ 65 percent ownership in its Northeast JV and 66 percent ownership of Cardinal gathering system.\n(2)\nUtica East Ohio Midstream inlet capacity consists of 1.3 Bcf/d of a high-pressure gathering pipeline that delivers Cardinal gathering volumes to Utica East Ohio Midstream processing facilities. The listed inlet capacity of 0.6 Bcf/d is incremental capacity to the Cardinal gathering capacity of 0.7 Bcf/d.\n(3)\nIncludes 100 percent of the statistics associated with operated equity-method investments.\nOther NGL Operations\nAs part of its Northeast G&P business, Williams owns and operates a 43 Mbbls/d NGL fractionation facility at Moundsville, West Virginia, nearby condensate stabilization facilities capable of handling approximately   17 Mbbls/d of field condensate, a de-ethanization facility at its Oak Grove processing plant, an ethane pipeline, and an NGL pipeline. The Oak Grove de-ethanizer is capable of handling up to approximately 80 Mbbls/d of mixed NGLs to extract up to approximately 40 Mbbls/d of ethane. Williams also owns and operates a 135 Mbbls/d NGL fractionation facility and approximately 970,000 barrels of NGL storage capacity in Harrison County, Ohio, as well as 44 Mbbls/d of condensate stabilization capacity, and other ancillary assets, including loading and terminal facilities in Harrison, Carroll, and Columbiana Counties, Ohio.\nNGLs are extracted from the natural gas stream in Williams’ Oak Grove and Fort Beeler cryogenic processing plants. Ethane produced at the Oak Grove de-ethanizer is transported to markets via its 50-mile ethane pipeline to Houston, Pennsylvania. The remaining mixed NGL stream from the de-ethanizer is then transported via Williams’ \n14\n50-mile NGL pipeline and fractionated at either its Moundsville or Harrison fractionation facility. The resulting products are then transported on truck, rail, or pipeline. Ohio Valley Midstream provides residue natural gas take away options for customers with interconnections to three interstate transmission pipelines.\nCertain Equity-Method Investments\nAppalachia Midstream Investments\nThrough the Appalachia Midstream Investments, Williams operates and owns an approximate average 66 percent interest in the Bradford Supply Hub gathering system and owns an approximate average 68 percent interest in the Marcellus South gathering system, together which consist of approximately 1,050 miles of gathering pipeline in the Marcellus Shale region with the capacity to gather 5,700 MMcf/d of natural gas. The majority of Williams’ volumes in the region are gathered from northern Pennsylvania, southwestern Pennsylvania, and the northwestern panhandle of West Virginia in core areas of the Marcellus Shale. Williams operates the assets primarily under long-term, 100 percent fixed-fee gathering agreements that include significant acreage dedications. Additionally, some Marcellus South agreements have MVCs.\nLaurel Mountain\nWilliams operates and owns a 69 percent interest in a joint venture, Laurel Mountain, which includes a 1,147-mile gathering system in western Pennsylvania with the capacity to gather 0.9 Bcf/d of natural gas. Laurel Mountain has a long-term, dedicated, volumetric-based fee agreement, with exposure to natural gas prices, to gather the anchor customer’s production in the western Pennsylvania area of the Marcellus Shale. Additionally, certain Laurel Mountain agreements have MVCs.\nBlue Racer\nWilliams operates and owns a 50 percent interest in Blue Racer. Blue Racer is a joint venture to own, operate, develop, and acquire midstream assets in the Utica Shale and certain adjacent areas in the Marcellus Shale. Blue Racer’s assets include 617 miles of gathering pipelines and the Natrium complex in Marshall County, West Virginia, with a cryogenic processing capacity of 800 MMcf/d and fractionation capacity of approximately 134 Mbbls/d. Blue Racer also owns the Berne complex in Monroe County, Ohio, with a cryogenic processing capacity of 400 MMcf/d, and 102 miles of NGL and condensate pipelines connecting Natrium to Berne. Blue Racer provides gathering, processing, and marketing services primarily under percent-of-liquids and fixed-fee agreements.\nNortheast G&P Operating Statistics\n2024\n2023\n2022\n(Annual Average Amounts)\nConsolidated:\nGathering volumes (Bcf/d)\n4.16 \n4.45 \n4.19 \nPlant inlet natural gas volumes (Bcf/d)\n1.86 \n1.89 \n1.65 \nNGL production (Mbbls/d)\n139 \n139 \n120 \nNGL equity sales (Mbbls/d)\n1 \n1 \n1 \nNon-consolidated: (1)\nGathering volumes (Bcf/d)\n6.46 \n6.92 \n6.61 \nPlant inlet natural gas volumes (Bcf/d)\n0.98 \n0.93 \n0.71 \nNGL production (Mbbls/d)\n72 \n65 \n51 \nNGL equity sales (Mbbls/d)\n5 \n4 \n3 \n__________\n(1)    Includes 100 percent of the volumes associated with operated equity-method investments, including Laurel Mountain and Blue Racer; as well as the Bradford Supply Hub and Marcellus South within Appalachia Midstream Investments.\n15\nWest\nNatural Gas Gathering and Processing Assets\nThe following tables summarize the significant operated assets of this segment:\nNatural Gas Gathering Assets\nLocation\nPipeline Miles\nInlet Capacity (Bcf/d)\nOwnership Interest\nSupply Basins/Shale Formations\nConsolidated:\nWamsutter\nWyoming\n2,251\n0.7\n100%\nWamsutter\nSouthwest Wyoming\nWyoming\n1,613\n0.5\n100%\nSouthwest Wyoming\nPiceance\nColorado\n352\n1.8\n100%\nPiceance\nBarnett Shale\nTexas\n815\n0.5\n100%\nBarnett Shale\nEagle Ford Shale\nTexas\n1,258\n0.5\n100%\nEagle Ford Shale\nHaynesville Shale\nLouisiana & Texas\n869\n5.0\n100%\nHaynesville Shale, Bossier Shale\nPermian\nTexas\n113\n0.1\n100%\nPermian\nMid-Continent\nOklahoma & Texas\n1,695\n0.2\n100%\nMiss-Lime, Granite Wash, Colony Wash\nDJ Basin\nColorado\n472\n0.8\n100%\nDenver-Julesburg\nNatural Gas Processing Facilities\nLocation\nInlet Capacity (Bcf/d)\nNGL Production Capacity (Mbbls/d)\nOwnership Interest\nSupply Basins\nConsolidated:\nEcho Springs\nEcho Springs, WY\n0.6\n48\n100%\nWamsutter\nOpal\nOpal, WY\n0.7\n39\n100%\nSouthwest Wyoming\nWillow Creek\nRio Blanco Co., CO\n0.5\n30\n100%\nPiceance\nParachute\nGarfield Co., CO\n1.0\n5\n100%\nPiceance\nFort Lupton\nWeld Co., CO\n0.3\n50\n100%\nDenver-Julesburg\nKeenesburg I\nWeld Co., CO\n0.2\n40\n100%\nDenver-Julesburg\nFront Range\nWeld Co., CO\n0.1\n12\n100%\nDenver-Julesburg\nDJ Basin Acquisition\ns\nOn November 30, 2023, Williams closed on the acquisition of 100 percent of Cureton Front Range, LLC and the acquisition of the remaining 50 percent interest in Rocky Mountain Midstream Holdings LLC, both of which operate midstream assets in Colorado’s DJ Basin. The Cureton Acquisition includes natural gas gathering pipelines and one in-service processing plant. The RMM Acquisition was the purchase of a partner’s 50 percent interest, resulting in 100 percent ownership by Williams. RMM includes a natural gas gathering pipeline, an approximate 100-mile crude oil transportation pipeline, and natural gas processing assets in the DJ Basin. It also includes crude oil storage and compression assets.\nTrace Acquisition\nOn April 29, 2022, Williams closed on the acquisition of 100 percent of Gemini Arklatex, LLC, through which the gas gathering and related assets of Trace Midstream were acquired. The purpose of this acquisition was to expand Williams’ footprint into the east Texas area of the Haynesville Shale region, increasing in-basin scale.\n16\nOther NGL Operations\nWilliams owns interests in and/or operates NGL fractionation and storage assets in central Kansas near Conway. These assets include a 50 percent interest in an NGL fractionation facility with capacity of slightly more than 100 Mbbls/d and also approximately 23 million barrels of NGL storage capacity. In addition, Williams owns a 189-mile NGL pipeline from a fractionator near Conway, Kansas, to an interconnection with a third-party NGL pipeline system in Oklahoma.\nOverland Pass Pipeline Equity-Method Investment\nWilliams operates and owns a 50 percent interest in OPPL. OPPL is capable of transporting 245 Mbbls/d of NGLs and includes 1,035 miles of NGL pipeline extending from Opal, Wyoming, to the Mid-Continent NGL market center near Conway, Kansas, along with extensions into the Piceance and DJ basins in Colorado and the Bakken Shale in the Williston basin in North Dakota. The equity NGL volumes from Williams’ Wyoming plants as well as certain Colorado plants are dedicated for transport on OPPL under long-term transportation agreements.\nWest Operating Statistics\n2024\n2023\n2022\n(Annual Average Amounts)\nConsolidated:\nGathering volumes (Bcf/d) (1)\n5.46 \n6.02 \n5.19 \nPlant inlet natural gas volumes (Bcf/d)\n1.54 \n1.54 \n1.15 \nNGL production (Mbbls/d)\n90 \n91 \n43 \nNGL equity sales (Mbbls/d)\n7 \n14 \n14 \nNon-Consolidated: (2)\nGathering volumes (Bcf/d)\n— \n— \n0.29 \nPlant inlet natural gas volumes (Bcf/d)\n— \n— \n0.28 \nNGL production (Mbbls/d)\n— \n— \n33 \n________________\n(1)    Includes volumes for gathering assets acquired in the Trace Acquisition after the purchase on April 29, 2022 as well as volumes for gathering assets acquired in the DJ Basin Acquisitions after the purchase on November 30, 2023. Further, the amounts for the acquired assets are averaged over the period owned, not over the entire year.\n(2)    Includes 100 percent of the volumes associated with operated equity-method investment RMM prior to acquisition of the remaining 50 percent interest on November 30, 2023. Volumes associated with the RMM assets for 2023 are presented entirely in the Consolidated section.\nGas & NGL Marketing Services\nWilliams’ natural gas marketing business provides asset management and the wholesale marketing, trading, storage, and transportation of natural gas for a diverse set of natural gas and electric utilities, municipalities, power generators, and producers and markets natural gas from the production at its upstream properties. Williams’ NGL marketing business transports and markets its equity NGLs from the production at its processing plants, NGLs from the production at its upstream properties, and NGLs on behalf of third-party NGL producers, including some of its fee-based processing customers. See the Gas and NGL Marketing section of Service Assets, Customers, and Contracts in Item 1. Business for additional information related to this business segment.\nGas & NGL Marketing Services Operating Statistics\n2024\n2023\n2022\n(Annual Average Amounts)\nSales Volumes:\nNatural Gas (Bcf/d)\n7.11 \n7.05 \n7.20 \nNGLs (Mbbls/d)\n177 \n223 \n250 \n17\nOther\nOther includes upstream operations, certain new energy ventures, and minor business activities that are not reportable segments, as well as corporate operations.\nUpstream Ventures\nWilliams acquired certain crude oil and natural gas properties in the Wamsutter basin in February 2021. Williams had an agreement regarding these properties in which it owned 75 percent of the venture’s undivided interest in each well’s working interest. In November 2024, Williams closed on the acquisition of the third-party operator Crowheart Energy, LLC. After closing on the acquisition Williams is the operator and owns more than a 90 percent working interest in each well. \nCertain natural gas properties in Louisiana were transferred to Williams in November 2020 as part of a bankruptcy resolution with a customer. In the third quarter of 2021, Williams sold 50 percent of the existing wells and wellbore rights in the South Mansfield area of the Haynesville Shale region to a third party operator, in a strategic effort to develop the acreage, thereby enhancing the value of Williams midstream natural gas infrastructure. Under the agreement, the third party operates the upstream position and develops the undeveloped acreage. The third-party’s interest in new wells increased to 75 percent in early 2023 when a certain drilling hurdle was met. Williams retained ownership in the undeveloped acreage until a separate acreage earning hurdle was met in the fourth quarter of 2023, at which time remaining undeveloped acreage was conveyed to the third party resulting in the third party owning 75 percent and Williams owning 25 percent.\nOperating Statistics\n2024 (1)\n2023\n2022\n(Annual Average Amounts)\nNet Product Sales Volumes:\nNatural Gas (Bcf/d)\n0.31 \n0.29 \n0.22 \nNGLs (Mbbls/d)\n11 \n7 \n7 \nCrude Oil (Mbbls/d)\n6 \n4 \n2 \n________________\n(1)    Includes volumes for the Crowheart Acquisition after the purchase on November 1, 2024. Further, the amounts for the acquired assets are averaged over the period owned, not over the entire year.\nNew Energy Ventures\nWilliams’ Other segment also includes investments in certain new energy ventures related to hydrogen, solar, renewable natural gas, and NextGen Gas. NextGen Gas is natural gas that has been independently certified as low emissions gas across all segments of the value chain.\nRate Matters\nFERC regulation requires all terms and conditions of service, including the rates charged, to be filed with and accepted by the FERC before any changes can go into effect. Our interstate natural gas pipelines establish their rates primarily through the FERC’s ratemaking process, but also may negotiate rates with their customers pursuant to the terms of their tariff and FERC policy. Key determinants in the ratemaking process are: (1) costs of providing service, including depreciation expense; (2) allowed rate of return, including the equity component of the capital structure and related income taxes; and (3) contract and volume throughput assumptions. The allowed rate of return is determined in each rate case. Rate design and the allocation of costs between the reservation and commodity rates also impact profitability. As a result of rate case proceedings, certain revenues may be collected subject to refund. Estimates of rate refund liabilities may be recorded considering their and third-party regulatory proceedings, advice of counsel and other risks.\nConsistent with FERC policy, our interstate natural gas pipelines design their rates using the straight fixed-variable (SFV) method of rate design. Under the SFV method of rate design, substantially all fixed costs, including \n18\nreturn on equity and income taxes, are included in a reservation charge to customers and all variable costs are recovered through a commodity charge to customers. While the use of SFV rate design limits our pipelines’ opportunity to earn incremental revenues through increased throughput, it also limits their risk associated with fluctuations in throughput.\nTransco Rate Case Filing\nOn August 30, 2024, Transco filed a general rate case with the FERC for an overall increase in rates. In September 2024, with the exception of certain rates that reflected a rate decrease, the FERC accepted and suspended our general rate filing to be effective March 1, 2025, subject to refund and the outcome of hearing procedures established by the FERC. The specific rates that reflected a rate decrease were accepted, without suspension, to be effective October 1, 2024, as requested by Transco, and will not be subject to refund. The impact of the rates reflecting a rate decrease is expected to reduce revenues by approximately $1 million per month beginning October 1, 2024.\nNWP Rate Case Settlement\nOn November 15, 2022, the FERC approved NWP’s Petition for Approval of Pre-Filing Stipulation and Settlement Agreement (Settlement) in Docket No. RP22-1155. The Settlement established a new general system firm Rate Schedule TF-1 (Large Customer) daily reservation rate of $0.37250/Dth with a $0.00935/Dth commodity rate (which were made effective January 1, 2023), resolved other rate issues, established a Modernization and Emission Reduction Program and satisfied our rate case filing obligation under our settlement in Docket No. RP17-346. Provisions were included in the Settlement that establish a moratorium on any NGA Section 4 or 5 proceedings that would seek to place new rates in effect any earlier than January 1, 2026. The Settlement also provides that Northwest Pipeline file an NGA Section 4 general rate case with rates to be effective not later than April 1, 2028, unless (a) Northwest Pipeline has entered into a pre-filing settlement or (b) a Section 5 general rate case has been filed on or before April 1, 2028. \nAs a result of the Settlement, in January 2023, NWP refunded approximately $126 million, including interest, associated with the decrease in federal tax rates due to the Tax Cuts and Jobs Act of 2017 (Tax Reform), which reduced current \nRegulatory liabilities \non NWP’s Balance Sheet.\nRegulatory Matters \nFERC\nWilliams’ natural gas pipeline interstate transmission and storage activities, including activities of Transco and NWP, are subject to FERC regulation under the NGA and under the Natural Gas Policy Act of 1978, as amended, and, as such, the rates and charges for the transportation of natural gas in interstate commerce, accounting, and the extension, enlargement, or abandonment of the jurisdictional facilities, among other things, are subject to regulation. Each of Williams’ natural gas pipeline companies, including Transco and NWP, holds certificates of public convenience and necessity issued by the FERC authorizing ownership and operation of all pipelines, facilities, and properties for which certificates are required under the NGA. FERC Standards of Conduct govern how the interstate pipelines communicate and conduct transmission transactions with an affiliate that engages in marketing functions. Among other things, the Standards of Conduct require that interstate gas pipelines treat all transmission customers, affiliated and non-affiliated, on a not unduly discriminatory basis. FERC Standards of Conduct govern the relationship between natural gas transmission providers and marketing function employees as defined by the rule. The Standards of Conduct are intended to prevent natural gas transmission providers from preferentially benefiting gas marketing functions by requiring the employees of a transmission provider that perform transmission functions to function independently from marketing function employees and by restricting the information that transmission providers may provide to marketing function employees. Under the Energy Policy Act of 2005, the FERC is authorized to impose civil penalties of more than  $1.5 million per day for each violation of its rules.\nFERC regulation requires all terms and conditions of service, including the rates charged, to be filed with and accepted by the FERC before any changes can go into effect. Williams’ interstate gas pipeline companies, including \n19\nTransco and NWP, establish rates through the FERC’s ratemaking process. In addition, Williams’ interstate gas pipelines, including Transco and NWP, may enter into agreements with customers for negotiated rates, which may be less than, equal to, or greater than the otherwise applicable cost-based recourse rates. Williams, including Transco, has also received authority to charge market-based rates for certain of our storage services. Key determinants in the FERC ratemaking process include:\n•\nCosts of providing service, including depreciation expense;\n•\nAllowed rate of return, including the equity component of the capital structure and related income taxes;\n•\nContract and volume throughput assumptions.\nThe allowed rate of return is determined in each rate case. Rate design and the allocation of costs between the reservation and commodity rates also impact profitability. During the pendency of rate case proceedings, certain revenues collected may be subject to refund.\nWilliams also owns interests in and operates natural gas liquids pipelines that are regulated by various federal and state governmental agencies. Services provided on the interstate natural gas liquids pipelines are subject to regulation under the Interstate Commerce Act by the FERC, which has authority over the terms and conditions of service; rates, including depreciation and amortization policies; and initiation of service. Williams’ intrastate natural gas liquids pipelines providing common carrier service are subject to regulation by various state regulatory agencies. \nUpdated Certificate Policy Statement and Interim Greenhouse Gas (GHG) Policy Statement\nOn February 18, 2022, the FERC issued an Updated Certificate Policy Statement and an Interim GHG Policy Statement, which were to provide guidance for consideration of interstate natural gas pipeline projects. The Updated Certificate Policy Statement was intended to provide an analytical framework for how the FERC would consider whether a project is in the public convenience and necessity. The Interim GHG Policy Statement was intended to set forth how the FERC would assess the impacts of natural gas infrastructure projects on climate change in its reviews under the National Environmental Policy Act and the NGA. On March 24, 2022, the FERC converted the Updated Certificate Policy Statement and the Interim GHG Policy Statement into draft policy statements, and on January 24, 2025, the FERC terminated the Interim GHG Policy Statement proceeding. The FERC has not yet issued final guidance on the Updated Certificate Policy Statement.\nPipeline Safety\nWilliams’ interstate natural gas pipelines, including Transco and NWP, are subject to the Natural Gas Pipeline Safety Act of 1968, as amended, the Pipeline Safety Improvement Act of 2002, the Pipeline Safety, Regulatory Certainty, and Jobs Creation Act of 2011, and the Protecting Our Infrastructure of Pipelines and Enhancing Safety Act of 2016 and 2020, which regulate safety requirements in the design, construction, operation, and maintenance of interstate natural gas transmission facilities. The United States Department of Transportation Pipeline and Hazardous Materials Safety Administration (PHMSA) administers federal pipeline safety laws.\nFederal pipeline safety laws authorize PHMSA to establish minimum safety standards for pipeline facilities and persons engaged in the transportation of gas or hazardous liquids by pipeline. These safety standards apply to the design, construction, testing, operation, and maintenance of gas and hazardous liquids pipeline facilities affecting interstate or foreign commerce. PHMSA has also established reporting requirements for operators of gas and hazardous liquid pipeline facilities, as well as provisions for establishing the qualification of pipeline personnel and requirements for managing the integrity of gas transmission and distribution lines and certain hazardous liquid pipelines. To ensure compliance with these provisions, PHMSA performs pipeline safety inspections and has the authority to initiate enforcement actions.\nIn August 2022, PHMSA published Rule 2, which is the last in the three-part Mega Rule set of regulations. Rule 2 went into effect in May 2023, but a Stay of Enforcement until February 2024 limited the amount of the regulation that was implemented. Since the rule was published in 2022, Williams, including Transco and NWP, has worked to understand the regulatory changes and modify procedures as needed and will continue to monitor impacts, if any, from recently published amendments.  \n20\nPipeline Integrity Regulations\nWilliams has an enterprise-wide Gas Integrity Management Plan, which includes Transco and NWP, that meets the PHMSA final rule issued pursuant to the requirements of the Pipeline Safety Improvement Act of 2002. To meet the PHMSA regulations, Williams has identified all pipelines in high consequence areas (HCAs) and developed baseline assessment plans for all applicable pipelines. In response to the PHMSA Mega Rule, implemented in 2021, Williams identified Moderate Consequence Areas, and integrated those segments into its integrity program along with Class 3 and 4 pipeline locations required by the rule. \nRegulatory changes as part of the Mega Rule, effective in 2024, impose stricter requirements for repairing crack-like, dent, and metal loss features. This has led to increased remediation efforts and higher costs compared to previous years. Additionally, advancements in identifying, evaluating, and remediating hard spot defects have contributed to higher spending.\nWilliams estimates that the cost to be incurred in 2025 with its entire Gas Integrity Management program to be approximately $219 million, which includes $168 million and $38 million for Transco and NWP, respectively. Management considers these costs to be prudent and incurred in the ordinary course of business and, the maintenance capital costs to be recoverable through rate case filings by Williams’ interstate pipelines.\nWilliams also has an enterprise-wide Liquid Integrity Management Plan that meets PHMSA requirements including HCA identification and a baseline assessment plan.  Williams estimates that the cost to be incurred in 2025 associated with this program will be approximately $2 million. Williams considers these costs to be prudent and incurred in the ordinary course of business.\nCybersecurity Matters \nIn 2024, the Transportation Security Administration (TSA) issued two updated security directives to further enhance cybersecurity resilience for pipeline operators. Security Directive Pipeline-2021-01D, effective May 29, 2024, continues to require owners/operators of critical pipelines to: (1) report cybersecurity incidents to the Cybersecurity and Infrastructure Security Agency (CISA) within 24 hours; (2) designate a Cybersecurity Coordinator available 24 hours a day, seven days a week, to coordinate cybersecurity practices and incident responses; and (3) conduct comprehensive reviews of cybersecurity practices, identify gaps, and report results to TSA and CISA. \nAdditionally, Security Directive Pipeline-2021-02E, effective July 27, 2024, builds on previous directives by requiring pipeline operators to: (1) implement a TSA-approved Cybersecurity Implementation Plan, incorporating network segmentation, continuous monitoring, and access control measures; (2) develop and maintain a robust Cybersecurity Incident Response Plan to reduce risks to critical systems during an incident; and (3) establish a Cybersecurity Assessment Plan with annual updates and reports to evaluate the effectiveness of implemented measures and identify vulnerabilities. \nWilliams, including Transco and NWP, has established and received TSA approval for its Cybersecurity Implementation Plan and Cybersecurity Assessment Plan, and is compliant with the remaining requirements established in Security Directives 1D and 2E.\nAdditionally, the United States Coast Guard issued a final rule in January 2025, establishing baseline cybersecurity requirements for maritime transportation assets, including vessels and facilities regulated under the Maritime Transportation Security Act. This rule mandates the development and maintenance of a Cybersecurity Plan, designation of a Cybersecurity Officer, implementation of security measures for account, device, and data protection, regular cybersecurity assessments, and reporting of cyber incidents. Compliance timelines for these requirements are phased, with key milestones such as cybersecurity assessments and plan submissions required within 24 months of the rule’s effective date.\nWilliams is actively monitoring evolving regulatory requirements to ensure compliance across its operations, including Transco and NWP. Williams is assessing the applicability of various regulations to its assets and implementing necessary measures to align with these standards. Williams, including Transco and NWP, \n \nremains \n21\ncommitted to safeguarding its infrastructure, minimizing risks, and maintaining the resilience of its operations in the face of evolving cybersecurity threats \nSee Part I, Item 1A. “Risk Factors” —\n “A breach of information technology infrastructure, including a breach caused by a cybersecurity attack on Williams, Transco, or NWP, or the third parties with whom they are interconnected, may interfere with the safe operation of assets, result in the disclosure of personal or proprietary information, and cause reputational harm.”\nGathering Regulations\nWilliams’ onshore midstream gathering operations are subject to laws and regulations in the various states in which it operates. For example, the Texas Railroad Commission has the authority to regulate the terms of service for Williams’ intrastate natural gas gathering business in Texas. Although the applicable state regulations vary widely, they generally require that pipeline rates and practices be reasonable and nondiscriminatory, and may include provisions covering marketing, pricing, pollution, environment, and human health and safety. Some states, such as New York and Ohio, have specific regulations pertaining to the design, construction, and operations of gathering lines within such state. \nWilliams has been actively implementing PHMSA’s 2021 Gas Gathering final rule that requires all onshore gas gathering lines to report incidents and file annual reports. The final rule also established a new Type C regulated gathering line and now requires Type C gathering lines to comply with specifically identified PHMSA regulations in 49 Code of Federal Regulations Part 192. Since the rule was published, Williams has worked to understand the regulatory changes and modify our procedures as needed.\nLiquids Pipelines\nWilliams’ liquids pipelines are regulated by the Louisiana Department of Natural Resources, the Texas Railroad Commission, and various other state and federal agencies. These pipelines are also subject to the liquid pipeline safety and integrity regulations discussed above since both Louisiana and Texas have adopted the integrity management regulations defined in PHMSA.\nOuter Continental Shelf Lands Act\nWilliams’ offshore gas and liquids pipelines located on the outer continental shelf, including Transco, are subject to the Outer Continental Shelf Lands Act, which provides in part that outer continental shelf pipelines “must provide open and nondiscriminatory access to both owner and non-owner shippers.”\nSee Part I, Item 1A. “Risk Factors” —\n “The operation of Williams’, Transco’s, and NWP’s businesses might be adversely affected by regulatory proceedings, changes in government regulations or in their interpretation or implementation, or the introduction of new laws or regulations applicable to Williams’, Transco’s, and NWP’s businesses or customers,”\n and \n“The natural gas sales, transportation, and storage operations of Williams’, Transco’s, and NWP’s natural gas pipelines are subject to regulation by the FERC, which could have an adverse impact on their ability to establish transportation and storage rates that would allow them to recover the full cost of operating their respective pipelines and storage assets, including a reasonable rate of return.\n”\nEnvironmental Matters \nWilliams’ operations, including Transco and NWP, are subject to federal environmental laws and regulations as well as the state, local, and tribal laws and regulations adopted by the jurisdictions in which they operate. Williams, Transco, and NWP could incur liability to governments or third parties for any unlawful discharge of pollutants into the air, soil, or water, as well as liability for cleanup costs. Materials could be released into the environment in several ways including, but not limited to:\n•\nLeakage from gathering systems, underground gas storage caverns, pipelines, processing or treating facilities, transportation facilities, and storage tanks;\n•\nDamage to facilities resulting from accidents during normal operations;\n22\n•\nDamages to onshore and offshore equipment and facilities resulting from storm events or natural disasters;\n•\nBlowouts, cratering, and explosions.\nIn addition, Williams, Transco, and NWP  may be liable for environmental damage caused by former owners or operators of our properties.\nWilliams, Transco, and NWP believe compliance with current environmental laws and regulations will not have a material adverse effect on their capital expenditures, earnings, or current competitive position. However, environmental laws and regulations could affect their business in various ways from time to time, including incurring capital and maintenance expenditures, fines and penalties, and creating the need to seek relief from the FERC for rate increases to recover the costs of certain capital expenditures and operation and maintenance expenses.\nNWP - Washington State Climate Commitment Act\nIn 2021, the state of Washington passed its Climate Commitment Act establishing a market-based cap-and-invest program to reduce carbon emissions. This program took effect on January 1, 2023, and sets a limit, or cap, on overall carbon emissions in the state and requires businesses like NWP to obtain allowances equal to their annual covered carbon emissions. The state’s cap will be reduced over time to meet the state’s carbon emissions reduction targets, which means fewer carbon emissions allowances will be available to purchase each year. These allowances can be purchased through quarterly auctions hosted by the state or bought and sold on a secondary market. In 2023, NWP began purchasing allowances for the carbon emissions from nine of its thirteen compressor stations within the state whose annual carbon emissions have exceeded 25,000 metric tons of carbon dioxide equivalent at least once since 2015. NWP also began purchasing allowances for NWP’s delivery of natural gas to certain of their customers and certain of their facilities in the state whose annual carbon emissions are insufficient to require their direct participation in the program. NWP’s latest rate case settlement allows them to recover the costs of purchasing allowances under the program in their next rate case.\nFor additional information regarding the potential impact of federal, state, tribal, or local regulatory measures on business and specific environmental issues, please refer to Part 1, Item 1A. “Risk Factors” — \n“Williams’, Transco’s, and NWP’s operations are subject to environmental laws and regulations, including laws and regulations relating to climate change and greenhouse gas emissions, which may expose them to significant costs, liabilities, and expenditures that could exceed expectation\ns\n,”\n and Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations — Environmental” and “Environmental Matters” in Part II, Item 8. Financial Statements and Supplementary Data — Note 18 – Contingencies and Commitments.\nCompetition\nWilliams’ competitive strategy spans all of its product and service offerings. Williams has a narrowed natural gas value chain focus that supports the exceptional reliability and quality services that are valued by our customers.\nGathering and Processing\nCompetition for natural gas gathering, processing, treating, transportation, and storage, as well as NGLs transportation, fractionation, and storage continues to increase as United States production continues to grow. Williams’ midstream services compete with similar facilities that are in close proximity to its assets.\nWilliams faces competition from companies of varying size and financial capabilities, including major and independent natural gas midstream providers, private equity firms, and major integrated oil and natural gas companies that gather, transport, process, fractionate, store, and market natural gas and NGLs, as well as some larger exploration and production companies that are choosing to develop midstream services to handle their own natural gas.\nWilliams’ gathering and processing agreements are generally long-term agreements that may include acreage dedication. Competition for natural gas volumes is primarily based on reputation, flexibility of commercial terms (including but not limited to fees charged, products retained, volume commitments), available capacity, array and quality of services provided, as well as efficiency, reliability, and safety of services. Williams believes its significant \n23\npresence in key supply basins, expertise and reputation as a reliable and safe operator, commitment to sustainability, and ability to offer integrated packages of services positions it well against competition.\nRegulated Interstate Natural Gas Transportation and Storage\nThe market for supplying natural gas is highly competitive and new pipelines, storage facilities, and other related services are expanding to service the growing demand for natural gas. Additionally, pipeline capacity in many natural gas supply basins is constrained and facing more regulation and opposition causing competition to increase among pipeline companies as they strive to connect those basins to major natural gas demand centers. \nWilliams predominately competes with major intrastate and interstate natural gas pipelines. Some local distribution companies are also involved in the long-haul transportation business through joint venture pipelines. The principle elements of competition in the interstate natural gas pipeline business are based on available capacity, rates, reliability, quality of customer service, diversity and flexibility of supply, and proximity or access to customers and market hubs. \nWilliams faces competition in a number of key markets, and competes with other interstate and intrastate pipelines for deliveries to customers who can take deliveries at multiple points. Natural gas delivered on Williams’ system competes with alternative energy sources used to generate electricity such as hydroelectric power, solar, wind, coal, fuel oil, and nuclear. Future demand for natural gas within the power sector could be increased by growing power demand and by regulations limiting or discouraging coal use in power generation. Conversely, natural gas demand could be adversely affected by laws mandating or encouraging solar and wind power sources or restricting the use of natural gas in power generation.\nSignificant entrance barriers to build new pipelines exist, including increased federal and state regulations and elevated public opposition against new pipeline builds, and these factors will continue to impact potential competition for the foreseeable future. However, Williams believes past success in working with regulators and the public, the position of its existing infrastructure, established strategic long-term contracts, and the fact that Williams’ pipelines have numerous receipt and delivery points provide it a competitive advantage, especially along the eastern seaboard and northwestern United States.\nEnergy Management and Marketing Services\nWilliams’ Gas & NGL Marketing Services segment competes with national and regional full-service energy providers, producers, and pipeline marketing affiliates or other marketing companies that aggregate commodities with transportation and storage capacity.\nFor additional information regarding competition for Williams services or otherwise affecting our business, please refer to Part 1, Item 1A. “Risk Factors” - “\nThe business, operating results, and financial condition of Williams’, Transco’s, and NWP’s natural gas transportation and midstream businesses are dependent on the continued availability of natural gas supplies in the supply basins and demand for those supplies in the markets that they serve,”\n “\nThe energy industry is highly competitive, and increased competitive pressure could adversely affect Williams’, Transco’s, and NWP’s businesses and operating results\n,” and “\nWilliams, Transco, and NWP may not be able to replace, extend, or add additional customer contracts or contracted volumes on favorable terms, or at all, as applicable, which could affect Williams’, Transco’s, and NWP’s financial condition and ability to grow, as well as the amount of cash available to Williams to pay dividends.\n”\nHuman Capital Resources\nWilliams is committed to maintaining a work environment that enables Williams to attract, develop, and retain a highly skilled and diverse group of talented employees who help promote long-term value creation now and into the clean energy future.\nEmployees\nAs of February 1, 2025, Williams had 5,829 full-time employees located throughout the United States. During 2024, Williams’ voluntary turnover rate was 5.0 percent.\n24\nTransco and NWP have no employees. Operations, management and certain administrative services are provided by Williams for both Transco and NWP.\nWilliams’ 2023 Sustainability Report is available on its website for more information about human capital programs and initiatives. The 2024 Sustainability Report will be available in the summer of 2025.  Nothing on Williams’ website shall be deemed incorporated by reference into this Annual Report on Form 10-K.\nWorkforce Safety\nWilliams continues to advance a safety-first culture by developing and empowering employees to operate assets in a safe, reliable, and customer-focused way.\n \nWilliams strives to continuously improve safety and implement best practices to progress towards zero safety incidents. When a safety hazard is recognized, every employee has the authority and responsibility to stop work activities, make changes to enhance safety, and share the lessons learned with the organization on how we made it right. \nWilliams includes three safety and environmental metrics as a part of its Annual Incentive Program design. For 2024, these goals included Critical Tier 3 Loss of Primary Containment (LOPC) Ratio, a High Potential Hazard Identification to Incident Ratio goal aimed to focus attention on behaviors that are the leading causes of incidents, as well as a Methane Emissions Reduction goal focusing on efforts to reduce greenhouse gas emissions by safely and reliably operating and maintaining assets. These three metrics comprise 15 percent of Williams annual incentive program for eligible employees, and reinforce the importance of incident prevention and a commitment to environmental and safety-focused improvements. \nFor 2024, the LOPC Ratio, High Potential Hazard Identification to Incident Ratio and Methane Emissions Reduction goals outperformed the established targets.\nWorkforce Health, Engagement, and Development\nWilliams’ employees are its most valued resource, are instrumental in our mission to safely deliver products that support the clean energy economy, and are the driving force behind Williams’ reputation as a safe, reliable company that does the right thing, every time. Cultivating a healthy work environment increases productivity, enhances employee satisfaction, and promotes long-term value creation.\nWilliams provides a competitive total rewards program that includes base salary, an annual incentive program, retirement benefits, and health benefits, including wellness and employee assistance programs. Williams provides employees with company-paid life insurance, disability coverage, and paid parental leave for both birth and non-birth parents, as well as adoption assistance. The annual incentive program is a key component of Williams’ commitment to a performance culture focused on recognizing and rewarding high performance.\nIn order to attract and retain top talent, Williams creates and is committed to maintaining a safe, inclusive workplace where employees feel valued, heard, respected, and supported in their personal and professional development. Williams leverages social and digital platforms like a careers site, external job boards, virtual and in-person career fairs and community events to attract candidates who have the specific skills we need. Further, leaders participate in inclusion training and utilize interview guides with collaboration and inclusion-focused questions to ensure they are equipped with interviewer best practices that help them holistically evaluate candidates. Williams utilizes employee surveys and employee-led advisory councils to understand the needs of the business from the perspective of employees regarding engagement, development and inclusion. Additionally, Williams supports employee engagement through formal programming including professional development, mentoring, and succession planning. \nWilliams provides extensive corporate and technical training programs that are agile and robust. These programs are designed to support the professional, skill, and technological development of employees, which in turn creates a competitive advantage. Williams is committed to adding long-term value by investing in employees’ growth and development. In addition to internal development programming, Williams also supports external development opportunities to further enhance employees’ professional and technical skills. Performance is measured considering both the achieved results associated with attaining annual goals and the observable skills and behaviors based on defined competencies that contribute to workplace effectiveness and career success. All formal leaders are \n25\nevaluated on two additional competencies around building inclusive, high-performing teams.  Including the defined competencies in the annual performance assessments illustrates Williams’ emphasis on, and commitment to, achieving results in the right way.\nAdditionally, Williams is committed to strengthening the communities where we operate through philanthropy  and volunteerism. Williams supports Science, Technology, Engineering, and Math education initiatives, community benefit projects, environmental conservation, first responder efforts, and the work of United Way agencies across the United States. \nThe Compensation and Management Development Committee of Williams’ Board of Directors oversees executive compensation and equity-based compensation plans and the material risks associated with the compensation program, as well as the oversight elements of human capital management, including talent development and diversity and inclusion.\nInclusive Workforce\nWilliams is committed to creating an inclusive culture, where differences are embraced and employees feel valued, welcomed, appreciated, and compelled to reach their full potential. Williams believes that inclusion fosters innovation, collaboration, and drives business growth and long-term success. To create a culture of inclusion, Williams embraces, appreciates, and fully leverages the diversity of background and experience within teams. Williams believes that incorporating differences into a team of people who are working toward the same goal provides a competitive advantage. \nTo create space for employees to share personal experiences and perspectives, and to appreciate differences, Williams offers Employee Resource Groups (ERGs). These groups are employee-led and based on similar interests and experiences, represent different communities and their allies, and are open to everyone. ERG members participate in community events, volunteer, lend professional and personal support to one another, and promote inclusion across the company. Each ERG leadership team includes one or two vice president sponsors to help the group champion efforts. These leadership teams coordinate and prioritize efforts with corporate oversight and support.\nWilliams is committed to helping all employees develop and succeed. Williams seeks inclusive representation at all levels of the organization through our talent management practices and employee development programs, including required baseline inclusion training for all leaders across the company. \nWilliams’ Diversity and Inclusion Council, which includes members of the executive officer team, organizational and operational leaders, and individual employees, promotes policies, practices, and procedures that support the growth of a high-performing workforce where all individuals can achieve their full potential. The council serves as the governing body over enterprise inclusion initiatives, including events, organized and hosted by one of Williams 10 ERGs, and annual awards that recognize an outstanding leader and an individual contributor who champion inclusion.\nAs of December 31, 2024, Williams’ Board of Directors includes 12 members, 11 of whom are independent members, including the Chairman. As part of the director selection and nominating process, the Governance and Sustainability Committee annually assesses the Board’s effectiveness. Williams strives to maintain a board of directors with varied occupational and personal backgrounds.\nTransactions with Affiliates\nTransco and NWP engage in transactions with Williams and its subsidiaries. Please see Part II, Item 8. Financial Statements and Supplementary Data — Note 1 – General, Description of Business, Basis of Presentation, and Summary of Significant Accounting Policies and Note 4 – Related Party Transactions.\n26\nWebsite Access To Reports and Other Information\nWilliams files its annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements, and other documents electronically with the SEC under the Exchange Act. \nWilliams’ Internet website is www.williams.com\n.\n Williams makes available, free of charge, through the Investors tab of its Internet website its annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8‑K, and amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Exchange Act as soon as reasonably practicable after Williams electronically files such material with, or furnishes it to, the SEC. Williams Corporate Governance Guidelines, Sustainability Report, Board committee charters, and the Williams Code of Business Conduct are also available on the Internet website. Williams will also provide, free of charge, a copy of any of our corporate documents listed above upon written request to Williams’ Corporate Secretary, One Williams Center, Suite 4700, Tulsa, Oklahoma 74172.\n27",
  "item7": "Item 7.  \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nCombined Management’s Discussion and Analysis of Financial Condition and Results of Operations\nPage\nGeneral\n56\nCompany Outlook\n59\nCritical Accounting Estimates\n62\nResults of Operations\n65\nWilliams\n65\nTransco\n78\nN\nWP\n81\nManagement\n’\ns Discussion and Analysis of Financial Condition and Liquidity\n83\nGeneral\nWilliams is an energy company committed to being the leader in providing infrastructure that safely delivers natural gas products to reliably fuel the clean energy economy. Its operations are located in the United States.\nWilliams’ interstate natural gas pipeline strategy is to create value by maximizing the utilization of its pipeline capacity by providing high-quality, low-cost transportation of natural gas to large and growing markets. Williams’ gas pipeline businesses’ interstate transmission and storage activities are subject to regulation by the FERC. As such, Williams’ rates and charges for the transportation of natural gas in interstate commerce, and the extension, expansion or abandonment of jurisdictional facilities and accounting, among other things, are subject to regulation. The rates are established primarily through the FERC’s ratemaking process, but Williams may also negotiate rates with its customers pursuant to the terms of its tariffs and FERC policy. Changes in commodity prices and volumes transported have limited near-term impact on these revenues because the majority of the cost of service is recovered through firm capacity reservation charges in transportation rates.\nThe ongoing strategy of Williams’ midstream operations is to safely and reliably operate large-scale midstream infrastructure where its assets can be fully utilized and drive low per-unit costs. Williams focuses on consistently attracting new business by providing highly reliable service to its customers. These services include natural gas gathering, processing, treating, compression and storage; NGL fractionation, transportation and storage; and crude oil production handling and transportation, as well as marketing services for NGL, crude oil, and natural gas.\nConsistent with the manner in which Williams’ chief operating decision maker evaluates performance and allocates resources, Williams’ operations are conducted, managed, and presented within the following reportable segments: Transmission & Gulf of America, Northeast G&P, West, and Gas & NGL Marketing Services. All remaining business activities, including upstream operations, certain new energy ventures, and corporate activities, are included in Other. Williams’ reportable segments are comprised of the following business activities:\n•\nTransmission & Gulf of America is comprised of the Transco, NWP, and MountainWest interstate natural gas pipelines, and their related natural gas storage facilities, as well as natural gas gathering and processing and crude oil production handling and transportation assets in the Gulf Coast region, includ\ning Discovery, \na former 60 percent equity-method investment in which Williams acquired the remaining ownership interest in August 2024 (see Note 3 – Acquisitions and Divestitures),\n a 51 percent interest in Gulfstar One, and a \n50 percent\n equity-method investment in Gulfstream. Transmission & Gulf of America also includes natural gas storage facilities and pipelines providing services in north Texas, and also in Louisiana and \nMississippi related to the January 2024 Gulf Coast Storage Acquisition (see Note 3 – Acquisitions and Divestitures).\n•\nNortheast G&P is comprised of midstream gathering, processing, and fractionation businesses in the Marcellus Shale region primarily in Pennsylvania and New York, and the Utica Shale region of eastern Ohio, as well as a 65 percent interest in Northeast JV which operates in West Virginia, Ohio, and Pennsylvania, a 66 percent interest in Cardinal which operates in Ohio, a 69 percent equity-method \n56\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\ninvestment in Laurel Mountain, a 50 percent equity-method investment in Blue Racer, and Appalachia Midstream Investments.\n•\nWest is comprised of gas gathering, processing, and treating operations in the Rocky Mountain region of Colorado and Wyoming, the Barnett Shale region of north-central Texas, the Eagle Ford Shale region of south Texas, the Haynesville Shale region of east Texas and northwest Louisiana, the Mid-Continent region which includes the Anadarko and Permian basins, and the DJ Basin of Colorado which includes RMM, a former 50 percent equity-method investment in which Williams acquired the remaining ownership interest in November 2023 (see Note 3 – Acquisitions and Divestitures). This segment also includes NGL storage facilities, an undivided 50 percent interest in an NGL fractionator near Conway, Kansas, and a 50 percent equity-method investment in OPPL.\n•\nGas & NGL Marketing Services is comprised of NGL and natural gas marketing and trading operations, which includes risk management and transactions related to the storage and transportation of natural gas and NGLs on strategically positioned assets.\nUnless indicated otherwise, the following discussion and analysis of results of operations and financial condition and liquidity relates to Williams’ current continuing operations and should be read in conjunction with the financial statements and notes thereto included in Part II, Item 8 of this report.\nDividends\nIn December 2024, Williams paid a regular quarterly dividend of $0.4750 per share. On January 28, 2025, Williams’ board of directors approved a regular quarterly dividend of $0.5000 per share payable on March 31, 2025.\nOverview of Year Ended December 31, 2024\nNet income (loss) attributable to The Williams Companies, Inc.\n \nfor the year ended December 31, 2024, decreased $954 million compared to the year ended December 31, 2023. Further discussion of the results is found in this report in the Results of Operations.\nRecent Developments\nTransco FERC Rate Case Filing\nOn August 30, 2024, Transco filed a general rate case with the FERC for an overall increase in rates. In September 2024, with the exception of certain rates that reflected a rate decrease, the FERC accepted and suspended Transco’s general rate filing to be effective March 1, 2025, subject to refund and the outcome of hearing procedures established by the FERC. The specific rates that reflected a rate decrease were accepted, without suspension, to be effective October 1, 2024, as requested by Transco, and will not be subject to refund. The impact of the rates reflecting a rate decrease is expected to reduce revenues by approximately $1 million per month beginning October 1, 2024.\nExpansion Project Updates\nSignificant expansion project updates for the period, including projects placed into service are described below. Ongoing major expansion projects are discussed later in Company Outlook.\nTransmission & Gulf of America\nDeepwater Whale Project\nIn August 2021, Williams reached an agreement with two third-parties to provide offshore natural gas gathering and crude oil transportation services as well as onshore natural gas processing services. The project expands its existing Western Gulf of America offshore infrastructure via a 26-mile gas lateral pipeline from the \n57\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nWhale platform to the existing Perdido gas pipeline and adds a new 124-mile oil pipeline from the Whale platform to Williams’ existing junction platform. This project was placed into service in January 2025.\nSouthside Reliability Enhancement\nIn July 2023, Transco received approval from the FERC for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from receipt points in Virginia and North Carolina to delivery points in North Carolina. This project went into service in the fourth quarter of 2024. The project increased capacity by 423 Mdth/d.\nRegional Energy Access\nIn January 2023, Transco received approval from the FERC for the project to expand Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from receipt points in northeastern Pennsylvania to multiple delivery points in Pennsylvania, New Jersey, and Maryland. Transco placed approximately half of the project into service in the fourth quarter of 2023 and placed the remainder of the project into service in August 2024. The project increased capacity by 829 Mdth/d. \nOn January 24, 2025, the FERC issued an Order on Remand Reinstating Certificate and Abandonment Authorization (Remand Order) for the project. The Remand Order was issued in response to the D.C. Circuit Court of Appeals’ decision in \nNew Jersey Conservation Foundation, et al., v. FER\nC, which vacated the FERC certificate order for the project and remanded the matter to the FERC for appropriate action. In the Remand Order, the FERC (1) continued to find that the project is needed, (2) affirmed its decision not to make a significance determination regarding greenhouse gas emissions, (3) considered Transco’s measures to reduce greenhouse gas emissions, and (4) concluded that the benefits of the project outweigh the adverse impacts. Accordingly, the Remand Order reinstated the certificate and abandonment authority for the project as issued in the FERC’s original certificate order. The authorization took effect upon the issuance of the mandate by the D.C. Circuit Court of Appeals, which occurred on January 29, 2025.\nData Center Power Projects\n \nWilliams continues to pursue projects to support the power demands created by new data center development. Williams is in the process of ordering major equipment and long-lead time items for the most mature of these expected projects. These advanced purchases are supported by reimbursement agreements from the potential customer. \nAcquisitions and Divestitures\nCrowheart Acquisition\nAs of December 31, 2023, Williams had an agreement regarding certain crude oil and natural gas properties in the Wamsutter basin in Wyoming under which it owned a 75 percent undivided interest in each well’s working interest and proportionally consolidated its undivided interest. On November 1, 2024, Williams closed on the acquisition of a third-party operator, Crowheart Energy, LLC, for $307 million cash, subject to working capital and post-closing adjustments. After closing on the acquisition, Williams owns more than a 90 percent working interest in each well. The purpose of this acquisition was to consolidate Williams’ interests in the Wamsutter basin and further optimize development in the area to continue to supply its gathering and processing assets (see Note 3 – Acquisitions and Divestitures).\nDiscovery Acquisition\nAs of December 31, 2023, Williams owned a 60 percent interest in Discovery, which it accounted for as an equity-method investment. On August 1, 2024, Williams closed on the acquisition of the remaining 40 percent interest in Discovery, along with certain other assets, for $170 million cash, subject to working capital and post-closing adjustments. As a result of acquiring this additional interest, Williams obtained control and subsequently consolidates Discovery. Williams recognized a $127 million gain on remeasuring its existing equity-method \n58\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\ninvestment to fair value included in \nOther investing income (loss) – net\n in the Consolidated Statement of Income in the third quarter of 2024. The purpose of this acquisition was to expand Williams’ gathering, processing, and transportation presence in the Gulf of America region. Discovery continues to be reported within the Transmission & Gulf of America segment (see Note 3 – Acquisitions and Divestitures).\nSale of Aux Sable interest\nAlso on August 1, 2024, Williams completed the sale of its equity-method investments in Aux Sable in Williams’ Northeast G&P segment for total consideration of $161 million. As a result of this sale, Williams recorded a gain of $149 million included in \nOther investing income (loss) – net\n in the Consolidated Statement of Income in the third quarter of 2024 (see Note 8 – Investing Activities).\nGulf Coast Storage Acquisition\nOn January 3, 2024, Williams closed on the acquisition from Hartree Partners LP for $1.95 billion of 100 percent of a strategic portfolio of natural gas storage facilities and pipelines, located in Louisiana and Mississippi. The purpose of this acquisition, which is reported in the Transmission & Gulf of America segment, was to expand Williams’ natural gas storage footprint in the Gulf Coast region. The Gulf Coast Storage Acquisition was funded with cash on hand and $100 million of deferred consideration. On January 3, 2025, Williams paid the remaining $100 million of the Gulf Coast Storage Acquisition purchase price obligation (see Note 3 – Acquisitions and Divestitures).\nCompany Outlook\nWilliams’ strategy is to provide a large-scale, reliable, and clean energy infrastructure designed to maximize the opportunities created by the vast supply of natural gas and natural gas products that exists in the United States. Williams accomplishes this by connecting the growing demand for cleaner fuels and feedstocks with our major positions in the premier natural gas and natural gas products supply basins. Williams continues to maintain a strong commitment to safety, environmental stewardship including seeking opportunities for renewable energy ventures, operational excellence, and customer satisfaction. Williams believes that accomplishing these goals will position us to deliver safe, reliable, clean energy services to its customers and an attractive return to shareholders. Williams’ business plan for 2025 includes a continued focus on earnings and cash flow growth.\nIn 2025, Williams’ operating results are expected to benefit from the continued growth in the Transmission & Gulf of America segment, primarily reflecting the impacts of numerous expansion projects at Transco and the Gulf of America. Additionally, growth in 2025 includes the impact of the Transco rate case and higher gathering and processing results associated with growth in the DJ Basin and the Northeast.  Williams also expects increases in Haynesville Shale volumes, including partial year impact of the Louisiana Energy Gateway expansion project and higher expected results from its upstream operations, including the full year impact of the Crowheart Acquisition.  These increases are partially offset by a modest increase in expenses and lower expected Eagle Ford results in our West segment related to minimum volume commitment reductions.\nWilliams seeks to maintain a strong financial position and liquidity, as well as manage a diversified portfolio of safe, clean, and reliable energy infrastructure assets that continue to serve key growth markets and supply basins in the United States. Williams’ growth capital and investment expenditures in 2025 are expected to range from $1.65 billion to $1.95 billion, excluding acquisitions. Growth capital spending in 2025 primarily includes projects supporting growth in the Haynesville Shale basin (including the Louisiana Energy Gateway expansion project), Transco expansions, all of which are fully contracted with firm transportation agreements, and projects supporting the Northeast G&P business. Williams also expects to invest capital in the development of its upstream oil and gas properties. In addition to growth capital and investment expenditures, Williams also remains committed to projects that maintain its assets for safe and reliable operations, as well as projects that reduce emissions, and meet legal, regulatory, and/or contractual commitments.\n59\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nPotential risks and obstacles that could impact the execution of Williams’ plan include:\n•\nA global recession, which could result in downturns in financial markets and commodity prices, as well as impact demand for natural gas and related products;\n•\nOpposition to, and regulations affecting, our infrastructure projects, including the risk of delay or denial in permits and approvals needed for our projects;\n•\nCounterparty credit and performance risk;\n•\nUnexpected significant increases in capital expenditures or delays in capital project execution, including increases from inflation or delays caused by supply chain disruptions;\n•\nUnexpected changes in customer drilling and production activities, which could negatively impact gathering and processing volumes;\n•\nLower than anticipated demand for natural gas and natural gas products which could result in lower-than-expected volumes, energy commodity prices, and margins;\n•\nGeneral economic, financial markets, or industry downturns, including increased inflation, interest rates, or tariffs;\n•\nPhysical damages to facilities, including damage to offshore facilities by weather-related events;\n•\nOther risks set forth under Part I, Item 1A. Risk Factors.\nExpansion Projects\nWilliams’ ongoing major expansion projects include the following:\nTransmission & Gulf of America\nDeepwater Shenandoah Project\nIn June 2021, Williams reached an agreement with two third-parties to provide offshore natural gas gathering and transportation services as well as onshore natural gas processing services. The project expands existing Gulf of America offshore infrastructure connecting to a third-party offshore lateral pipeline from the Shenandoah platform to Discovery’s existing Keathley Canyon Connector pipeline, adds onshore processing facilities at Larose, Louisiana to handle the expected rich Shenandoah production, and the natural gas liquids will be fractionated and marketed at Discovery’s Paradis plant in Louisiana. Williams plans to place the project into service in the second quarter of 2025. \nOverthrust Westbound Compression Expansion\nIn October 2024, MountainWest received approval from the FERC for the project, which involves an expansion of MountainWest’s existing natural gas transmission system to provide incremental firm transportation capacity from multiple receipt points in Wamsutter, Wyoming to a delivery point in Opal, Wyoming. MountainWest plans to place the project into service as early as the fourth quarter of 2025, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 325 Mdth/d.\nTexas to Louisiana Energy Pathway\nIn January 2024, Transco received approval from the FERC for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide firm transportation capacity from receipt points in south Texas to delivery points in Texas and Louisiana. Transco plans to place the project into service during the first quarter of 2025, assuming timely receipt of all necessary regulatory approvals. The project is expected to provide 364 Mdth/d of new firm transportation service through a combination of increasing capacity, converting interruptible capacity to firm, and utilizing existing capacity.\n60\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nSoutheast Energy Connector\nIn November 2023, Transco received approval from the FERC for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from receipt points in Mississippi and Alabama to a delivery point in Alabama. Transco plans to place the project into service in the second quarter of 2025, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 150 Mdth/d.\nCommonwealth Energy Connector\n \nIn November 2023, Transco received approval from the FERC for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity in Virginia. Transco plans to place the project into service as early as the fourth quarter of 2025, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 105 Mdth/d. \nAlabama Georgia Connector\nIn March 2024, Transco received approval from the FERC for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from Transco’s Station 85 pooling point in Alabama to customers in Georgia. Transco plans to place the project into service as early as the fourth quarter of 2025, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 64 Mdth/d.\nSoutheast Supply Enhancement\nIn October 2024, Transco filed a certificate application with the FERC for the project, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from receipt points in Virginia to delivery points in Virginia, North Carolina, South Carolina, Georgia, and Alabama. Transco plans to place the project into service as early as the fourth quarter of 2027, assuming timely receipt of all necessary regulatory approvals.  The project is expected to increase capacity by 1,597 Mdth/d.\nGillis West\nTransco plans to file the prior notice application for the project with the FERC in 2025, which involves an expansion of Transco’s existing natural gas transmission system to provide incremental firm transportation capacity from receipt points in Louisiana to delivery points in Texas. Transco plans to place the project into service as early as the fourth quarter of 2025, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 115 Mdth/d.\nRyckman Creek Loop\n NWP plans to file the prior notice application for the project with the FERC in 2025. The Ryckman Creek Loop expansion involves an expansion of NWP’s existing natural gas transmission system to provide incremental firm transportation capacity from a receipt point in northeast Oregon (Stanfield) to multiple delivery points in southwest Wyoming. NWP plans to place the project into service as early as the fourth quarter of 2025, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 50 MDth/d.\nStanfield South Project\n \nThe Stanfield South Project on NWP’s existing natural gas transmission system will provide year-round transportation capacity from the Stanfield receipt point in Oregon to multiple delivery points in Idaho. NWP plans to place the project into service as early as the fourth quarter of 2025, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 80 Mdth/d. \n61\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nNaughton Coal-to-Gas Conversion\nThe Naughton Coal-to-Gas Conversion project on NWP’s existing natural gas transmission system will provide year-round transportation capacity to a power plant in southwest Wyoming. NWP plans to place the project into service as early as the second quarter of 2026, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 98 Mdth/d. \nKelso-Beaver Reliability Project\n \nThe Kelso-Beaver Reliability project on NWP’s existing natural gas transmission system will provide year-round transportation capacity to various receipt and delivery points in Oregon. NWP plans to file the certificate application with the FERC in 2025. NWP plans to place the project into service during the fourth quarter of 2028, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 183 Mdth/d. \nHuntingdon Connector\nThe Huntingdon Connector project on NWP’s existing natural gas transmission system will provide year-round transportation capacity from the Sumas receipt point to various delivery points in Washington. NWP plans to file the prior notice application for the project with the FERC in 2026. NWP plans to place the project in service during the fourth quarter of 2026, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 87 Mdth/d.\nWild Trail Expansion\nThe Wild Trail Expansion project on NWP’s existing natural gas transmission system will provide year-round transportation capacity from the White River Hub receipt point in western Colorado to various delivery points in southwest Wyoming and southern Colorado. This project is fully subscribed by an affiliate within Williams’ Gas & NGL Marketing Services segment. NWP plans to file the certificate application with the FERC in 2025. NWP plans to place the project in service during the fourth quarter of 2027, assuming timely receipt of all necessary regulatory approvals. The project is expected to increase capacity by 83 Mdth/d.\nWest\nLouisiana Energy Gateway\nIn August 2024, Williams began construction activities on new natural gas gathering assets which are expected to gather 1.8 Bcf/d of natural gas produced in the Haynesville Shale basin for delivery to premium markets, including Transco, industrial markets, and growing LNG export demand along the Gulf Coast. This project is expected to go into service in the third quarter of 2025.\nHaynesville Gathering Expansion\nIn February 2023, Williams announced its agreement with a third party to facilitate natural gas production growth in the Haynesville Shale basin. Williams is constructing a greenfield gathering system in support of the third party’s 26,000-acre dedication. The system, once completed, will provide natural gas gathering services to the third party. The third party has also agreed to a long-term capacity commitment on Williams’ Louisiana Energy Gateway expansion project. This project is expected to go into service in third quarter 2025.  \nCritical Accounting Estimates\nPreparation of financial statements in conformity with generally accepted accounting principles requires management to make estimates and assumptions. The nature of these estimates and assumptions is material due to the subjectivity and judgment necessary, or the susceptibility of such matters to change, and the impact of these on the financial condition or results of operations.\n62\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nWilliams’ Pension and Postretirement Obligations \nWilliams has pension and other postretirement benefit plans that require the use of assumptions and estimates to determine the benefit obligations and costs. These estimates and assumptions involve significant judgment and actual results will likely be different than anticipated. Estimates and assumptions utilized include the expected long-term rates of return on plan assets, discount rates, cash balance interest crediting rate, and employee demographics, including retirement age and mortality. These assumptions are reviewed annually and adjustments are made as needed. The assumptions utilized to compute the benefit obligations and costs are shown in Note 7 – Employee Benefit Plans.\nThe following table presents the estimated increase (decrease) in net periodic benefit cost and obligations resulting from a one-percentage-point change in the specific assumption.\n \nBenefit Cost\nBenefit Obligation\n \nOne-\nPercentage-\nPoint\nIncrease\nOne-\nPercentage-\nPoint\nDecrease\nOne-\nPercentage-\nPoint\nIncrease\nOne-\nPercentage-\nPoint\nDecrease\n \n(Millions)\nPension benefits:\nDiscount rate\n$\n3 \n$\n(4)\n$\n(62)\n$\n71 \nExpected long-term rate of return on plan assets\n(11)\n11 \n— \n— \nCash balance interest crediting rate\n4 \n(4)\n45 \n(39)\nOther postretirement benefits:\nDiscount rate\n(3)\n3 \n(11)\n14 \nExpected long-term rate of return on plan assets\n(3)\n3 \n— \n— \nWilliams’ expected long-term rates of return on plan assets, as determined at the beginning of each fiscal year, are based on historical returns, forward-looking capital market expectations of at least 10 years from Williams’ third-party independent investment advisor, as well as the investment strategy and relative weightings of the asset classes within the investment portfolio. Williams’ expected long-term rate of return on plan assets used for Williams’ pension plans was 5.31 percent in 2024. The 2024 actual return on plan assets for Williams’ pension plans was approximately 8.0 percent. The 10-year average rate of return on pension plan assets through December 2024 was approximately 6.6 percent. The expected rates of return on plan assets are long-term in nature and are not significantly impacted by short-term market performance.\nThe discount rates for Williams’ pension and other postretirement benefit plans are determined separately based on an approach specific to Williams’ plans, which considers a yield curve of high-quality corporate bonds and the duration of the expected benefit cash flows of each plan.\nThe cash balance interest crediting rate assumption represents the average long-term rate by which the pension plans’ cash balance accounts are expected to grow. Interest on the cash balance accounts is based on the 30-year U.S. Treasury securities rate.\nRegulatory Accounting\nTransco and NWP are regulated by the FERC. Accounting Standards Codification (ASC) Topic 980, “Regulated Operations,” (ASC 980) provides that certain costs that would otherwise be charged to expense should be deferred as regulatory assets, based on the expected recovery from customers in future rates. Likewise, certain actual or anticipated credits that would otherwise reduce expense should be deferred as regulatory liabilities, based on the expected return to customers in future rates. Management’s expected recovery of deferred costs and return of deferred credits generally results from specific decisions by regulators granting such ratemaking treatment. Transco and NWP record certain incurred costs and obligations as regulatory assets or liabilities if, based on regulatory orders or other available evidence, it is probable that the costs or obligations will be included in amounts allowable for recovery or refunded in future rates. \n63\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nAccounting for businesses that are regulated and apply the provisions of ASC 980 can differ from the accounting requirements for non-regulated businesses. Transactions that are recorded differently as a result of regulatory accounting requirements include the capitalization of an equity return component on regulated capital projects, capitalization of other project costs, retirements of general plant assets, levelized cost of service, employee-related benefits, environmental costs, negative salvage, asset retirement obligations (ARO) and other costs and taxes included in, or expected to be included in, future rates. As rate-regulated entities, Transco’s and NWP’s management has determined that it is appropriate to apply the accounting prescribed by ASC 980 and, accordingly, the accompanying financial statements include the effects of the types of transactions described above that result from regulatory accounting requirements. Management’s assessment of the probability of recovery or pass through of regulatory assets and liabilities requires judgment and interpretation of laws and regulatory commission orders. If, for any reason, either Transco or NWP ceases to meet the criteria for application of regulatory accounting treatment for all or part of our operations, the regulatory assets and liabilities related to those portions ceasing to meet such criteria would be eliminated from the Balance Sheet and included in the Statement of Net Income for the period in which the discontinuance of regulatory accounting treatment occurs and can be estimated, unless otherwise required to be recorded under other provisions of U.S. generally accepted accounting principles. \nThe aggregate amount of regulatory assets reflected on Transco’s and NWP’s Balance Sheets at December 31, 2024, is $394 million and $55 million, respectively. The aggregate amount of regulatory liabilities reflected on Transco’s and NWP’s Balance Sheets at December 31, 2024, is $1.0 billion and $253 million, respectively. A summary of regulatory assets and liabilities is included in Note 10 – Regulatory Assets and Liabilities.\n64\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nResults of Operations\nWilliams’ Consolidated Overview\nThe following table and discussion is a summary of Williams’ consolidated results of operations for the three years ended December 31, 2024, and should be read in conjunction with the results of operations by segment, as discussed in further detail following this consolidated overview discussion.\n \nYear Ended December 31,\n \n2024\n$ Change\nfrom\n2023*\n% Change\nfrom\n2023*\n2023\n$ Change\nfrom\n2022*\n% Change\nfrom\n2022*\n2022\n \n(Dollars in millions)\nRevenues:\nService revenues\n$\n7,628 \n+602 \n+9 \n%\n$\n7,026 \n+490 \n+7 \n%\n$\n6,536 \nProduct sales and service revenues – commodity consideration\n3,125 \n+200 \n+7 \n%\n2,925 \n-1,891 \n-39 \n%\n4,816 \nNet gain (loss) from commodity derivatives\n(250)\n-1,206 \nNM\n956 \n+1,343 \nNM\n(387)\nTotal revenues\n10,503 \n10,907 \n10,965 \nCosts and expenses:\nProduct costs and net processing commodity expenses\n2,118 \n-83 \n-4 \n%\n2,035 \n+1,422 \n+41 \n%\n3,457 \nOperating and maintenance expenses\n2,179 \n-195 \n-10 \n%\n1,984 \n-167 \n-9 \n%\n1,817 \nDepreciation and amortization expenses\n2,219 \n-148 \n-7 \n%\n2,071 \n-62 \n-3 \n%\n2,009 \nSelling, general, and administrative expenses\n708 \n-43 \n-6 \n%\n665 \n-29 \n-5 \n%\n636 \nGain on sale of business\n— \n-129 \n-100 \n%\n(129)\n+129 \nNM\n— \nOther (income) expense – net\n(60)\n+30 \n+100 \n%\n(30)\n+58 \nNM\n28 \nTotal costs and expenses\n7,164 \n6,596 \n7,947 \nOperating income (loss)\n3,339 \n4,311 \n3,018 \nEquity earnings (losses)\n560 \n-29 \n-5 \n%\n589 \n-48 \n-8 \n%\n637 \nOther investing income (loss) – net\n343 \n+235 \nNM\n108 \n+92 \nNM\n16 \nInterest expense\n(1,364)\n-128 \n-10 \n%\n(1,236)\n-89 \n-8 \n%\n(1,147)\nNet gain from Energy Transfer litigation judgment\n— \n-534 \n-100 \n%\n534 \n+534 \nNM\n— \nOther income (expense) – net\n108 \n+9 \n+9 \n%\n99 \n+81 \nNM\n18 \nIncome (loss) before income taxes\n2,986 \n4,405 \n2,542 \nLess: Provision (benefit) for income taxes\n640 \n+365 \n+36 \n%\n1,005 \n-580 \n-136 \n%\n425 \nIncome (loss) from continuing operations\n2,346 \n3,400 \n2,117 \nIncome (loss) from discontinued operations\n— \n+97 \n+100 \n%\n(97)\n-97 \nNM\n— \nNet income (loss)\n2,346 \n3,303 \n2,117 \nLess: Net income attributable to noncontrolling interests\n121 \n+3 \n+2 \n%\n124 \n-56 \n-82 \n%\n68 \nNet income (loss) attributable to The Williams Companies, Inc.\n$\n2,225 \n-954 \n-30 \n%\n$\n3,179 \n+1,130 \n+55 \n%\n$\n2,049 \n_______\n*    + = Favorable change; - = Unfavorable change; NM = A percentage calculation is not meaningful due to a change in signs, a zero-value denominator, or a percentage change greater than 200.\n65\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\n2024 vs. 2023\nService revenues\n increased primarily due to: \n•\nHigher volumes from the November 2023 DJ Basin Acquisitions at the West segment and the January 2024 Gulf Coast Storage, August 2024 Discovery, and February 2023 MountainWest Acquisitions at the Transmission & Gulf of America segment; partially offset by lower volumes from the September 2023 sale of certain liquids pipelines at the Transmission & Gulf of America segment (See Note 3 – Acquisitions and Divestitures),  \n•\nHigher revenues associated with expansion projects at the Transmission & Gulf of America segment, partially offset by \n•\nLower gathering volumes at the West and Northeast G&P segments.\nThe net sum of \nProduct sales and service revenues – commodity consideration\n, \nProduct costs and net processing commodity expenses,\n and net realized gains and losses on commodity derivatives related to sales of product and shrink gas purchases for processing plants for the reportable segments comprise \nCommodity Margins\n. \nService revenues - commodity consideration\n represent payments received in the form of commodities for processing services provided. Most of these commodity volumes are sold during the month processed and are offset within \nProduct costs and net processing commodity expenses\n. The sum of \nProduct sales\n and net realized gains and losses on commodity derivatives related to the upstream operations comprise \nNet realized product sales\n.\nThe\n Product sales and service revenues – commodity consideration\n increase primarily consists of:\n•\nHigher marketing sales activities primarily at the West segment primarily related to the  DJ Basin Acquisitions and Transmission & Gulf of America segment primarily related to the Discovery Acquisition, as previously discussed; partially offset by lower marketing sales activities related to NGLs at the Gas & NGL Marketing Services segment, primarily related to activity associated with the sale certain liquids pipelines, as previously discussed. Net natural gas marketing sales were impacted by higher storage costs; partially offset by\n•\nLower system management gas sales primarily at the Transmission & Gulf of America segment;\n•\nLower product sales from upstream operations; partially offset by higher volumes from the November 2024 Crowheart Acquisition at Other (See Note 3 – Acquisitions and Divestitures); \n•\nLower equity NGL sales and commodity consideration revenues associated with NGL production activity primarily at the West segment; partially offset by higher activity in the Transmission & Gulf of America segment primarily due to the Discovery Acquisition, as previously discussed.\nAs Williams is acting as agent for natural gas marketing customers, its natural gas marketing product sales are presented net of the related costs of those activities within the Gas & NGL Marketing Services segment.\nNet gain (loss) from commodity derivatives \nincludes realized and unrealized gains and losses from derivative instruments reflected within \nTotal revenues\n primarily in the Gas & NGL Marketing Services and West segments, and at Other (see Note 17 – Commodity Derivatives).\nWilliams experiences significant earnings volatility from the fair value accounting required for the derivatives used to hedge a portion of the economic value of the underlying transportation and storage capacity portfolios as well as upstream-related production. However, the unrealized fair value measurement gains and losses are generally offset by valuation changes in the economic value of the underlying production or transportation and storage capacity contracts, which are not recognized until the underlying transaction occurs.\n66\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nThe \nProduct costs and net processing commodity expenses\n increase primarily consists of:\n•\nHigher marketing activities primarily at the West segment primarily related to the DJ Basin Acquisitions and Transmission & Gulf of America segment primarily related to the Discovery Acquisition, as previously discussed; partially offset by lower marketing activities primarily related to NGLs at the Gas & NGL Marketing Services segment; partially offset by\n•\nLower shrink natural gas purchases and commodity consideration costs associated with Williams’ equity NGL production activities primarily at the West segment.\nOperating and maintenance expenses \nincreased primarily due to operating costs of the assets acquired at the West and Transmission & Gulf of America segments; as well as unfavorable changes in employee-related costs, including the impact of a change in a practice related to payroll timing; and the net imbalance liability due to changes in pricing.\nDepreciation and amortization expenses\n increased primarily related to the assets acquired at the Transmission & Gulf of America  and West segments and an increase at Transco related to additional assets placed in service. The increase is partially offset by lower amortization of intangibles related to the acquisition of Sequent Energy Management, L.P. and Sequent Energy Canada, Corp. (Sequent) in 2021.\nSelling, general, and administrative expenses \nincreased primarily due to employee-related costs, including the impact of a change in a practice related to payroll timing, partially offset by lower acquisition and transition-related costs associated with the MountainWest Acquisition (see Note 3 – Acquisitions and Divestitures).\nGain on sale of business \nreflects a gain from the sale of certain liquids pipelines in the Transmission & Gulf of America segment in 2023, as previously discussed.\nOther (income) expense – net\n within \nOperating income (loss) \nincludes lower project feasibility costs at our Transmission & Gulf of America segment; partially offset by the absence of a 2023 gain related to a contract settlement. \nEquity earnings (losses)\n changed unfavorably primarily due to the impacts of the consolidation of RMM and Discovery, as previously discussed, and the sale of the interests in Aux Sable (see Note 8 – Investing Activities), partially offset by the absence of the share of a loss contingency accrual in 2023 at Aux Sable and favorable results at OPPL.\nOther investing income (loss) – net\n includes gains on the sale of the interests in Aux Sable and the gain on remeasuring the existing equity-method investment in Discovery to fair value with the acquisition of the remaining 40 percent ownership, as previously discussed, partially offset by the absence the 2023 gain on remeasuring the existing equity-method investment in RMM to fair value with the acquisition of the remaining 50 percent ownership (see Note 8 – Investing Activities).\nThe increase in\n Interest expense\n was primarily due to Williams’ 2023 and 2024 debt issuances, and imputed interest on deferred consideration obligations related to the DJ Basin and Gulf Coast Storage Acquisitions, as previously discussed, partially offset by 2023 and 2024 debt retirements (see Note 13 – Debt and Banking Arrangements).\nNet gain from Energy Transfer litigation judgment\n resulted from a favorable ruling on the final order and judgment of Williams’ complaint against Energy Transfer in 2023 (see Note 1 – General, Description of Business, Basis of Presentation, and Summary of Significant Accounting Policies).\nProvision (benefit) for income taxes\n changed favorably primarily due to lower pre-tax income and a higher benefit associated with decreases in Williams’ estimate of the state deferred income tax rate in both periods.  See Note 6 – Provision (Benefit) for Income Taxes for a discussion of the effective tax rate compared to the federal statutory rate for both periods. \n67\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nIncome (loss) from discontinued operations\n in 2023 includes a pre-tax charge of $125 million to increase the accrued liability associated with the Alaska refinery contamination litigation, partially offset by the related income tax effect (see Note 1 – General, Description of Business, Basis of Presentation, and Summary of Significant Accounting Policies).\n2023 vs. 2022 \nService revenues\n increased primarily due to:\n•\nHigher volumes from acquisitions at the Transmission & Gulf of America segment;\n•\nHigher volumes and rates at the Northeast G&P segment; partially offset by\n•\nLower rates, partially offset by higher volumes at the West segment.\nThe\n Product sales and service revenues – commodity consideration\n decrease primarily consists of:\n•\nLower marketing sales activities at the Gas & NGL Marketing Services segment;\n•\nLower sales from upstream operations at Other;\n•\nLower equity NGL sales prices primarily at the West and Transmission & Gulf of America segments;\n•\nLower system management gas sales primarily at the West and Transmission & Gulf of America segments.\nNet gain (loss) from commodity derivatives \nincludes realized and unrealized gains and losses from derivative instruments reflected within \nTotal revenues\n primarily in the Gas & NGL Marketing Services and West segments, and at Other.\nThe \nProduct costs and net processing commodity expenses\n decrease primarily consists of: \n•\nLower marketing activities at the Gas & NGL Marketing Services segment;\n•\nLower costs associated with NGLs acquired as commodity consideration related to Williams’ equity NGL production activities;\n•\nLower system management gas purchases primarily at the West and Transmission & Gulf of America segments.\n•\nUnfavorable change in unrealized gains and losses from commodity derivatives related to processing plant shrink gas purchases;\n•\nPartially offset by lower natural gas purchases due to lower prices associated with Williams’ equity NGL production activities primarily at the West and Transmission & Gulf of America segments.\nOperating and maintenance expenses \nincreased primarily due to higher operating costs, including increased costs associated with the February 2023 MountainWest Acquisition, the April 2022 Trace Acquisition, and the August 2022 NorTex Asset Purchase, and increased scope and timing of operating and maintenance activities.\nDepreciation and amortization expenses\n increased primarily related to the upstream assets, and assets acquired in the February 2023 MountainWest Acquisition, the April 2022 Trace Acquisition, and the August 2022 NorTex Asset Purchase. The increase is partially offset by lower amortization of intangibles related to the acquisition of Sequent in 2021.\nSelling, general, and administrative expenses\n increased primarily due to acquisition and transition-related costs associated with the MountainWest Acquisition.\n68\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nGain on sale of business\n resulted from the sale of certain liquids pipelines in the Gulf Coast region, as previously discussed.\nOther (income) expense – net\n within \nOperating income (loss) \nchanged favorably primarily due to:\n•\nA favorable change associated with regulatory liabilities established for the impacts of deferred income taxes at NWP and the absence of 2022 regulatory charges associated with a decrease in Transco’s estimated deferred state income tax rate;\n•\nThe absence of a 2022 loss related to Eminence storage cavern abandonments;\n•\nA 2023 gain related to a contract settlement.\nEquity earnings (losses)\n changed unfavorably primarily due to a decrease at Laurel Mountain and the share of a loss contingency accrual related to the 14 percent ownership in Aux Sable, partially offset by increases at Blue Racer and OPPL.\nThe favorable change in \nOther investing income (loss) – net\n includes higher interest income earned on higher cash and cash equivalent balances, and a gain on remeasuring the existing equity-method investment in RMM, as previously discussed.\nThe increase in\n Interest expense\n was primarily due to Williams’ 2023 debt issuances and MountainWest’s long-term debt, partially offset by an increase in interest capitalized related to ongoing expansion projects.\nNet gain from Energy Transfer litigation judgment\n resulted from a favorable ruling on the final order and judgment of Williams’ complaint against Energy Transfer, as previously discussed.\nThe favorable change in\n Other income (expense) – net\n below \nOperating income (loss)\n includes an increase in equity allowance for funds used during construction (equity AFUDC) at the Transmission & Gulf of America segment and the related effects of deferred taxes within Other. \nIncome (loss) from discontinued operations\n in 2023 includes a pre-tax charge of $125 million to increase the accrued liability associated with our Alaska refinery contamination litigation, partially offset by the related income tax effect.\nProvision (benefit) for income taxes\n changed unfavorably primarily due to higher pre-tax income, the absence of a benefit related to the release of valuation allowances on deferred income tax assets in 2022, a lower benefit associated with decreases in the Williams’ estimate of the state deferred income tax rate in both periods, and the absence of 2022 federal income tax settlements. \nThe unfavorable change in \nNet income (loss) attributable to noncontrolling interests\n is primarily due to higher results at Cardinal and the Northeast JV.\nPeriod-Over-Period Operating Results – Williams’ Segments\nWilliams’ chief operating decision maker evaluates segment operating performance based upon \nModified EBITDA\n. Note 19 – Segment Disclosures includes a reconciliation of this non-GAAP measure to \nIncome (loss) before income taxes from continuing operations\n. Management uses \nModified EBITDA\n because it is an accepted financial indicator used by investors to compare company performance. In addition, management believes that this measure provides investors an enhanced perspective of the operating performance of Williams’ assets. \nModified EBITDA\n should not be considered in isolation or as a substitute for a measure of performance prepared in accordance with GAAP.\n69\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nTransmission & Gulf of America\nYear Ended December 31,\n2024\n2023\n2022\n(Millions)\nService revenues\n$\n4,246 \n$\n3,858 \n$\n3,579 \nProduct sales and service revenues – commodity consideration (1)\n382 \n290 \n468 \nNet realized gain (loss) from commodity derivatives (1)\n— \n2 \n— \nSegment revenues\n4,628 \n4,150 \n4,047 \nProduct costs and net processing commodity expenses (1)\n(329)\n(259)\n(425)\nOther segment costs and expenses\n(1,199)\n(1,157)\n(1,141)\nGain on sale of business\n— \n129 \n— \nProportional Modified EBITDA of equity-method investments\n173 \n205 \n193 \nTransmission & Gulf of America Modified EBITDA\n$\n3,273 \n$\n3,068 \n$\n2,674 \nCommodity margins\n$\n53 \n$\n33 \n$\n43 \n_______________\n(1)\nIncluded as a component of \nCommodity margins\n.\n2024 vs. 2023\nTransmission & Gulf of America Modified EBITDA\n increased primarily due to higher \nService revenues, \npartially offset by\n \nthe absence of a \nGain on sale of business, \nhigher \nOther segment costs and expenses, \nand lower \nProportional Modified EBITDA of equity-method investments.\nService revenues\n increased primarily due to: \n•\nA $220 million increase primarily in storage revenues due to the Gulf Coast Storage Acquisition in January 2024 (see Note 3 – Acquisitions and Divestitures);\n•\nA $121 million increase in Transco’s revenues primarily associated with expansion projects and higher park and loan services; \n•\nA $41 million increase primarily in gathering revenues due to the Discovery Acquisition in August 2024 (see Note 3 – Acquisitions and Divestitures);\n•\nA $38 million increase in primarily transportation and storage revenues due to the MountainWest Acquisition in February 2023 (see Note 3 – Acquisitions and Divestitures);\n•\nA $22 million increase in NorTex’s revenues primarily associated with higher storage rates; partially offset by \n•\nA $39 million decrease primarily in transportation revenues due to the sale of certain liquids pipelines in the Gulf Coast region in September 2023 (see Note 3 – Acquisitions and Divestitures);\n•\nA $34 million decrease in the Eastern Gulf region primarily due to shut-ins for producer operational issues at Gulfstar One in the Gunflint and Tubular Bells fields and weather-related events, partially offset by higher primarily production handling volumes from a new well at Gulfstar One in the Pickerel field.\nOther segment costs and expenses\n increased primarily due to:\n•\nHigher operating expenses and administrative costs including higher operating, acquisition and transition costs related to Williams’ Gulf Coast Storage and Discovery Acquisitions, as previously discussed; and \n70\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nemployee-related costs, including the impact of a change in a practice related to payroll timing; partially offset by significantly lower acquisition and transition costs related to Williams’ MountainWest Acquisition, as previously discussed, contract services at Transco, and operating costs related to the sale of certain liquids pipelines in the Gulf Coast region, as previously discussed; \n•\nUnfavorable change in the amortization of regulatory pension liabilities at Transco; partially offset by\n•\nLower project feasibility costs; \n•\nA favorable change in equity AFUDC primarily as a result of increased capital expenditures at Williams’ regulated businesses.\nCommodity margins\n increased primarily due to a $19 million increase from Williams’ equity NGLs primarily due to the Discovery Acquisition, as previously discussed.\nGain on sale of business\n reflects a gain recognized on the sale of certain liquids pipelines in the Gulf Coast region in September 2023, as previously discussed.\nProportional Modified EBITDA of equity-method investments\n decreased primarily due to lower proportional results as Discovery was consolidated, as previously discussed.\n2023 vs. 2022 \nTransmission & Gulf of America Modified EBITDA\n increased primarily due to higher \nService revenues\n and a \nGain on sale of business.\nService revenues\n increased primarily due to: \n•\nA $222 million increase due to the acquisition of MountainWest primarily in transportation and storage revenues;\n•\nA $42 million increase due to the NorTex Asset Purchase primarily in storage and transportation revenues;\n•\nA $30 million increase in the Eastern Gulf Coast region primarily due to higher production handling volumes from new wells at Devils Tower, partially offset by lower volumes from the Norphlet pipeline due to natural decline;\n•\nA $15 million increase in Transco’s revenues associated with the Regional Energy Access expansion project placed partially in-service in the fourth quarter of 2023;\n•\nA $12 million increase in Transco’s and Northwest Pipeline’s revenues associated with short-term firm transportation; partially offset by \n•\nA $19 million decrease due to lower rates from the FERC rate case settlement effective January 1, 2023, at Northwest Pipeline;\n•\nA $14 million decrease in reimbursable electric power costs and storage rates, offset by similar changes in electricity charges and storage costs, reflected in \nOther segment costs and expenses;\n•\nA $10 million decrease due to the sale of certain liquids pipelines in the Gulf Coast region in September 2023 primarily in transportation revenues.\nCommodity margins\n decreased primarily due to a $15 million decrease from Williams’ equity NGLs, driven by unfavorable net realized pricing for equity NGL sales, partially offset by lower prices for natural gas purchases associated with its equity NGL production activities.\n71\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nOther segment costs and expenses\n increased primarily due to:\n•\nHigher operating and administrative costs including higher operating, acquisition, and transition costs related to Williams’ MountainWest Acquisition and NorTex Asset Purchase; and higher costs related to timing and scope of general maintenance activities primarily at Transco, partially offset by lower reimbursable electric power costs and storage costs, which are offset by a similar change in electricity reimbursements and storage revenues reflected in \nService revenues\n; and lower employee-related costs;\n•\nHigher project feasibility costs; partially offset by \n•\nFavorable changes associated with regulatory liabilities established for the impacts of deferred income taxes at Northwest Pipeline associated with the FERC rate case settlement mentioned above in \nService revenues\n and the absence of 2022 regulatory charges associated with decreases in Transco’s estimated deferred state income tax rate; \n•\nA favorable change in equity AFUDC as a result of increased capital expenditures at Transco; \n•\nThe absence of losses related to Eminence storage cavern abandonments in 2022.\nGain on sale of business\n reflects a gain recognized on the sale of certain liquids pipelines in the Gulf Coast region in September 2023, as previously discussed.\nNortheast G&P\nYear Ended December 31,\n2024\n2023\n2022\n(Millions)\nService revenues\n$\n1,913 \n$\n1,896 \n$\n1,654 \nProduct sales and service revenues – commodity consideration (1)\n112 \n137 \n148 \nSegment revenues\n2,025 \n2,033 \n1,802 \nProduct costs and net processing commodity expenses (1)\n(88)\n(125)\n(138)\nOther segment costs and expenses\n(581)\n(566)\n(522)\nProportional Modified EBITDA of equity-method investments\n602 \n574 \n654 \nNortheast G&P Modified EBITDA\n$\n1,958 \n$\n1,916 \n$\n1,796 \nCommodity margins\n$\n24 \n$\n12 \n$\n10 \n(1)\nIncluded as a component of \nCommodity margins\n.\n2024 vs. 2023\nNortheast G&P Modified EBITDA\n increased primarily due to higher \nProportional Modified EBITDA of equity-method investments\n, higher \nService revenues\n, and higher \nCommodity margins\n, partially offset by higher \nOther segment costs and expenses.\nService revenues\n increased primarily due to:\n•\nA $20 million increase in revenues at the Northeast JV primarily related to higher gathering volumes as well as higher transportation & fractionation, gathering, and processing rates, partially offset by lower transportation & fractionation and processing volumes;\n72\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\n•\nA $16 million increase in joint venture operating fees primarily related to assuming operatorship of Blue Racer effective January 1, 2024, (which is significantly offset by higher \nOther segment costs and expenses\n discussed below);\n•\nAn $11 million increase in revenues associated with reimbursable expenses, which is offset by similar changes in the charges reflected in \nOther segment costs and expenses\n; partially offset by\n•\nA $19 million decrease in gathering revenues at Susquehanna Supply Hub primarily related to lower volumes partially offset by escalated rates;\n•\nA $16 million decrease in gathering revenues in the Utica Shale region primarily related to lower volumes at Flint and Cardinal partially offset by escalated rates.\nCommodity margins\n increased due to a restructured gas purchase deal in 2024 which allowed for margin gain on residue pricing and liquids from fixed recoveries. In addition, Williams was not significantly impacted by system constraints which impacted margins in 2023.\nOther segment costs and expenses\n increased primarily due to higher employee-related costs, including the impact of a change in a practice related to payroll timing, as well as higher operating expenses, including higher electricity and fuel, and increased support costs related to assuming operatorship of Blue Racer effective January 1, 2024 (substantially offset by higher \nService revenues \ndiscussed above). The increase was partially offset by lower maintenance expenses and the absence of the 2023 loss contingency accrual.\nProportional Modified EBITDA of equity-method investments\n increased at Aux Sable Liquid Products LP primarily due to the absence of Williams’ $31 million share of a loss contingency accrual related to its former ownership in 2023, as well as the terms of the new product marketing agreement, partially offset by the sale of Williams’ investment in Aux Sable Liquid Products LP in the third quarter of 2024. Additionally, Appalachia Midstream Investments increased primarily driven by higher gathering rates partially offset by lower volumes and higher expenses.\n2023 vs. 2022\nNortheast G&P Modified EBITDA\n increased primarily due to higher \nService revenues\n, partially offset by lower \nProportional Modified EBITDA of equity-method investments\n and higher \nOther segment costs and expenses\n.\nService revenues\n increased primarily due to:\n•\nA $92 million increase in revenues at the Northeast JV primarily related to higher transportation & fractionation, processing, and gathering volumes as well as higher processing rates;\n•\nAn $84 million increase in revenues in the Utica Shale region primarily related to higher gathering rates resulting from annual cost-of-service contract redeterminations and higher volumes, partially offset by the absence of proceeds from the release of an acreage dedication in 2022;\n•\nA $61 million increase in gathering revenues at Susquehanna Supply Hub primarily related to escalated rates as well as higher volumes.\nOther segment costs and expenses\n increased primarily due to increased scope of operations, a loss contingency accrual, and higher operating taxes.\nProportional Modified EBITDA of equity-method investments\n decreased at Laurel Mountain due to lower commodity-based gathering rates, MVC, and volumes, and at Aux Sable Liquid Products LP primarily due to Williams’ $31 million share of a loss contingency accrual related to its former ownership in 2023. The decrease was partially offset by an increase at Blue Racer primarily driven by higher gathering and processing volumes. Additionally, Appalachia Midstream Investments increased primarily driven by higher gathering volumes and \n73\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nannual rate escalations at Marcellus South, partially offset by lower gathering rates resulting from annual cost-of-service contract redeterminations and lower volumes at the Bradford Supply Hub.\nWest\nYear Ended December 31,\n2024\n2023\n2022\n(Millions)\nService revenues\n$\n1,718 \n$\n1,502 \n$\n1,542 \nProduct sales and service revenues – commodity consideration (1)\n947 \n544 \n1,023 \nNet realized gain (loss) from commodity derivatives relating to service revenues\n10 \n82 \n(1)\nNet realized gain (loss) from commodity derivatives relating to product sales (1)\n(6)\n7 \n(3)\nNet realized gain (loss) from commodity derivatives\n4 \n89 \n(4)\nSegment revenues\n2,669 \n2,135 \n2,561 \nProduct costs and net processing commodity expenses (1)\n(844)\n(517)\n(918)\nOther segment costs and expenses\n(645)\n(542)\n(564)\nProportional Modified EBITDA of equity-method investments\n132 \n162 \n132 \nWest Modified EBITDA\n$\n1,312 \n$\n1,238 \n$\n1,211 \nCommodity margins\n$\n97 \n$\n34 \n$\n102 \n________________\n(1)    Included as a component of \nCommodity margins\n.\n2024 vs. 2023\nWest Modified EBITDA\n increased primarily due higher \nService revenues \nand\n Commodity margins, \npartially offset by higher \nOther segment costs and expenses,\n an unfavorable change in \nNet realized gain (loss) from commodity derivatives relating to service revenues, \nand lower \nProportional Modified EBITDA of equity-method investments.\nService revenues\n increased primarily due to:\n•\nA $249 million increase in the DJ Basin region associated with the DJ Basin Acquisitions in November 2023 (see Note 3 – Acquisitions and Divestitures); \n•\nA $35 million increase in other NGL operations associated with higher fractionation and transportation  revenue due to higher volumes and higher storage fees primarily due to a new contract;\n•\nA $14 million increase in the Wamsutter region primarily associated with higher gathering volumes from increased producer activity as well as higher volumes associated with the absence of weather-related events in first-quarter 2023;\n•\nA $12 million increase associated with reimbursable compressor power and fuel purchases primarily due to the DJ Basin Acquisitions as previously discussed, which are offset by similar changes in \nOther segment costs and expenses\n; partially offset by\n•\nA $45 million decrease in the Haynesville Shale region primarily due to lower gathering volumes from decreased producer activity, partially offset by higher gathering rates;\n•\nA $31 million decrease in the Eagle Ford Shale region primarily due to lower MVC revenues;\n74\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\n•\nA $24 million decrease in the Barnett Shale region primarily due to lower gathering rates driven by unfavorable commodity pricing and lower gathering volumes.\nNet realized gain (loss) from commodity derivatives relating to service revenues\n reflects an unfavorable change in settled commodity prices relative to Williams’ natural gas hedge positions.\nCommodity margins\n increased $63 million primarily due to $39 million higher margins associated with the DJ Basin Acquisitions, as previously discussed. Margins also increased $21 million from Williams’ equity NGLs primarily due to lower net realized prices for natural gas purchases and lower volumes of natural gas purchased both associated with equity NGL production activities; partially offset by lower volumes of equity NGL sold and lower net realized NGL sales prices.\nOther segment costs and expenses\n increased primarily due to higher operating and employee-related expenses including those resulting from the DJ Basin Acquisitions, as previously discussed, the absence of favorable contract settlements in first-quarter 2023, an unfavorable change in Williams’ net imbalance liability due to changes in pricing, higher reimbursable compressor power and fuel purchases which are offset in \nService revenues\n, and the impact of a change in a practice related to payroll timing; partially offset by higher system gains and the absence of a fourth quarter 2023 write-down of assets held for sale.\nProportional Modified EBITDA of equity-method investments\n decreased primarily due to lower proportional results as RMM was consolidated related to the DJ Basin Acquisitions, as previously discussed, partially offset by higher volumes and higher commodity prices at OPPL.\n2023 vs. 2022\nWest Modified EBITDA\n increased primarily due to a favorable change in \nNet realized gain (loss) from commodity derivatives relating to service revenues, \nhigher\n Proportional Modified EBITDA of equity-method investments, \nand lower \nOther segment costs and expenses, \npartially offset by lower \nCommodity margins \nand \nService revenues.\nService revenues\n decreased primarily due to:\n•\nA $120 million decrease in the Barnett Shale region primarily due to lower gathering rates driven by unfavorable commodity pricing;\n•\nA $13 million decrease in the Eagle Ford Shale region primarily due to lower MVC revenues, partially offset by escalated gathering rates and higher gathering volumes;\n•\nA $6 million decrease associated with reimbursable compressor power and fuel purchases primarily due to lower prices, which are offset by similar changes in \nOther segment costs and expenses\n; partially offset by\n•\nA $69 million increase in the Haynesville Shale region primarily associated with higher gathering volumes including from increased producer activity and the Trace Acquisition in April 2022, partially offset by lower rates driven by unfavorable commodity pricing;\n•\nA $25 million increase in the DJ Basin region primarily associated with the DJ Basin Acquisitions in November 2023 as previously discussed;\n•\nA $15 million increase in our other NGL operations associated with higher storage fees primarily due to a new contract as well as higher fractionation fees primarily due to higher volumes partially offset by lower rates from lower natural gas prices.\nNet realized gain (loss) from commodity derivatives relating to service revenues\n reflects a favorable change in settled commodity prices relative to Williams’ natural gas hedge positions.\nCommodity margins\n decreased $68 million primarily due a $46 million decrease from Williams’ equity NGLs and a $14 million decrease from other sales activities, both primarily due to lower net realized commodity pricing.\n75\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nOther segment costs and expenses\n decreased primarily due to a favorable change in Williams’ net imbalance liability due to changes in pricing, favorable contract settlements in first-quarter 2023, lower corporate allocations, and lower reimbursable compressor power and fuel purchases which are substantially offset in \nService revenues. \nThese items were partially offset by higher operating expenses related to operations including those acquired in the Trace Acquisition and the DJ Basin Acquisitions, lower system gains at Wamsutter, and a fourth quarter 2023 write-down of assets held for sale.\nProportional Modified EBITDA of equity-method investments\n increased primarily due to higher volumes at OPPL as well as higher volumes at RMM, partially offset by lower proportional results as RMM was consolidated related to the DJ Basin Acquisitions.\nGas & NGL Marketing Services\nYear Ended December 31,\n2024\n2023\n2022\n(Millions)\nService revenues\n$\n— \n$\n1 \n$\n3 \nProduct sales (1)\n2,052 \n2,060 \n3,534 \nNet realized gain (loss) from commodity derivative instruments (1)\n72 \n115 \n17 \nNet unrealized gain (loss) from commodity derivative instruments\n(335)\n702 \n(321)\nNet gain (loss) from commodity derivatives\n(263)\n817 \n(304)\nSegment revenues\n1,789 \n2,878 \n3,233 \nProduct costs (1)\n(1,799)\n(1,786)\n(3,228)\nNet unrealized gain (loss) from commodity derivative instruments within\n Net processing commodity expenses\n(6)\n(43)\n47 \nOther segment costs and expenses\n(108)\n(99)\n(92)\nGas & NGL Marketing Services Modified EBITDA\n$\n(124)\n$\n950 \n$\n(40)\nCommodity margins\n$\n325 \n$\n389 \n$\n323 \n________________\n(1)    Included as a component of \nCommodity margins\n.\n2024 vs. 2023\nGas & NGL Marketing Services Modified EBITDA \ndecreased primarily due to an unfavorable change in \nNet unrealized gain (loss) from commodity derivative instruments\n and lower \nCommodity margins\n. \nCommodity margins\n decreased $64 million primarily due to:\n•\nA $44 million decrease in Williams’ natural gas marketing margins including $35 million of lower natural gas transportation capacity marketing margins due to less favorable net realized pricing spreads. The decrease in its natural gas marketing margins also includes $9 million of lower natural gas storage marketing margins primarily driven by higher storage fees and less favorable realized derivative gains, partially offset by a favorable change of $14 million in lower cost or net realizable value inventory adjustment; \n•\nA $20 million decrease in Williams’ NGL marketing margins including an unfavorable change in net realized gains and losses on sale of inventory in 2024 compared to 2023 driven by unfavorable changes in non-ethane prices.\n76\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nThe change in \nNet unrealized gain (loss) from commodity derivative instruments\n within \nSegment revenues\n and \nNet processing commodity expenses\n relates to derivative contracts that are not designated as hedges for accounting purposes. The change from 2023 is primarily due to a change in forward commodity prices relative to Williams’ hedge positions in 2024 compared to 2023.\n2023 vs. 2022\nGas & NGL Marketing Services Modified EBITDA \nincreased primarily due to a favorable change in \nNet unrealized gain (loss) from commodity derivative instruments\n within \nSegment revenues \nand higher \nCommodity margins\n, partially offset by an unfavorable change in \nNet unrealized gain (loss) from commodity derivative instruments\n within \nNet processing commodity expenses\n. \nCommodity margins\n increased $66 million primarily due to:\n•\nA $65 million increase from Williams’ natural gas marketing operations including $129 million of higher natural gas storage marketing margins primarily driven by a favorable change of $111 million in lower of cost or net realizable value adjustment; and the absence of a $15 million charge related to the remaining recognition of a purchase accounting inventory fair value adjustment in 2022. The increase in its natural gas marketing margins was partially offset by $64 million of lower natural gas transportation capacity marketing margins due to less favorable net realized pricing spreads;\n•\nA $1 million increase in Williams’ NGL marketing margins including a $20 million favorable change in lower of cost or net realizable value inventory adjustments, partially offset by higher transportation and fractionation fees and an unfavorable change in net realized gains and losses on sale of inventory in 2023 compared to 2022 driven by an unfavorable change in NGL prices.\nNet unrealized gain (loss) from commodity derivative instruments\n within \nSegment revenues\n and \nNet processing commodity expenses\n. The change from 2022 is primarily due to a change in forward commodity prices relative to Williams’ hedge positions in 2023 compared to 2022.\nOther\n \nYear Ended December 31,\n \n2024\n2023\n2022\n \n(Millions)\nService revenues\n$\n15 \n$\n16 \n$\n24 \nProduct sales (1)\n420 \n442 \n706 \nNet realized gain (loss) from derivative instruments (1)\n35 \n47 \n(104)\nNet unrealized gain (loss) from derivative instruments\n(26)\n1 \n25 \nNet gain (loss) from commodity derivatives\n9 \n48 \n(79)\nNet revenues from upstream operations, corporate, and other business activities. \n444 \n506 \n651 \nOther costs and expenses\n(209)\n(197)\n(217)\nNet gain from Energy Transfer litigation judgment\n— \n534 \n— \nProportional Modified EBITDA of equity-method investments\n2 \n(2)\n— \nModified EBITDA from upstream operations, corporate, and other business activities\n$\n237 \n$\n841 \n$\n434 \nNet realized product sales\n$\n455 \n$\n489 \n$\n602 \n________________\n(1)    Included as a component of \nNet realized product sales\n.\n77\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\n2024 vs. 2023\nModified EBITDA from upstream operations, corporate, and other business activities\n decreased primarily due to:\n•\nA $34 million decrease in \nNet realized product sales\n from  upstream operations primarily due to lower volumes and lower net realized commodity prices associated with Williams’ South Mansfield production in the Haynesville Shale region, and lower net realized commodity prices associated with Williams’ Wamsutter region.  These decreases were partially offset by higher production volumes associated with Williams’ Wamsutter region production, including from the Crowheart Acquisition in the fourth quarter of 2024.\n•\nA $27 million unfavorable change in \nNet unrealized gain (loss) from derivative instruments\n due to a change in forward commodity prices relative to hedge positions in 2024 compared to 2023;\n•\nA $12 million unfavorable change in other costs and expenses primarily related to upstream operations; and\n•\nThe absence of a 2023 gain related to a favorable ruling on the final order and judgement of Williams’ complaint against Energy Transfer reflected in\n Net gain from Energy Transfer litigation judgment \n(see Note 1 – General, Description of Business, Basis of Presentation, and Summary of Significant Accounting Policies).\n2023 vs. 2022\nModified EBITDA from upstream operations, corporate, and other business activities\n increased primarily due to the \nNet gain from Energy Transfer litigation judgmen\nt, as previously discussed, partially offset by lower results from Williams’ upstream operations, which included the following: \n•\nA $113 million decrease in \nNet realized product sales\n primarily due to lower net realized commodity prices, partially offset by higher sales associated with increased production volumes. Higher natural gas production volumes from new wells in the Haynesville Shale region and higher crude oil production volumes from new wells in the Wamsutter region were partially offset by lower natural gas and NGL production volumes in the Wamsutter region driven by the impact of severe winter weather in 2023; \n•\nA $24 million unfavorable change in \nNet unrealized gain (loss) from derivative instruments\n due to a change in forward commodity prices relative to Williams’ hedge positions in 2023 compared to 2022; partially offset by\n•\nAn increase in \nOther costs and expenses\n associated with upstream operations primarily due to increased production volumes and expenses related to severe winter weather in 2023, partially offset by lower associated ad valorem and production taxes, which were impacted by lower commodity prices and lower natural gas and NGL production volumes in the Wamsutter region.\nOther costs and expenses\n not associated with upstream operations decreased primarily due to the absence of an $11 million charge related to an accrual for loss contingency in the third quarter of 2022 and a $19 million favorable change associated with regulatory assets related to the effects of deferred taxes on equity funds used during construction.\n78\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nTransco\nYear Ended December 31,\n2024\n$ Change\nfrom\n2023*\n% Change\nfrom\n2023*\n2023\n(Millions)\nRevenues:\nNatural gas transportation service revenues\n$\n2,619 \n+113 \n+5 \n%\n$\n2,506 \nNatural gas storage service revenues\n200 \n+14 \n+8 \n%\n186 \nNatural gas product sales\n118 \n-19 \n-14 \n%\n137 \nOther service revenues\n27 \n-10 \n-27 \n%\n37 \nTotal revenues\n2,964 \n2,866 \nCosts and expenses:\nNatural gas product costs\n118 \n+19 \n+14 \n%\n137 \nOperating and maintenance expenses\n510 \n+7 \n+1 \n%\n517 \nSelling, general, and administrative expenses\n216 \n-1 \n— \n%\n215 \nDepreciation and amortization expenses\n545 \n-26 \n-5 \n%\n519 \nTaxes, other than income taxes\n111 \n-6 \n-6 \n%\n105 \nOther (income) expense – net\n(35)\n-3 \n-8 \n%\n(38)\nTotal costs and expenses\n1,465 \n1,455 \nOperating income (loss)\n1,499 \n+88 \n+6 \n%\n1,411 \nInterest expense\n(324)\n— \n— \n%\n(324)\nInterest income\n58 \n-29 \n-33 \n%\n87 \nAllowance for equity and borrowed funds used during construction (AFUDC)\n88 \n+11 \n+14 \n%\n77 \nOther income (expense) – net \n(8)\n-4 \n-100 \n%\n(4)\nNet income (loss)\n$\n1,313 \n+66 \n+5 \n%\n$\n1,247 \n_______\n*    + = Favorable change; - = Unfavorable change; NM = A percentage calculation is not meaningful due to a change in signs, a zero-value denominator, or a percentage change greater than 200.\n2024 vs. 2023\nVariances due to the changes in natural gas prices and transportation volumes have little impact on revenues because, under our rate design methodology, the majority of overall cost of service is recovered through firm capacity reservation charges in Transco’s transportation rates.\nTransco has cash out sales, which settle gas imbalances with shippers. In the course of providing transportation services to customers, Transco may receive different quantities of gas from shippers than the quantities delivered on behalf of those shippers. Additionally, Transco transports gas on various pipeline systems, which may deliver different quantities of gas on Transco’s behalf than the quantities of gas received from Transco. These transactions \n79\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nresult in gas transportation and exchange imbalance receivables and payables. Transco’s tariff includes a method whereby the majority of transportation imbalances are settled on a monthly basis through cash out sales or purchases. The cash out sales have no impact on Transco’s operating income.\nRevenues increased primarily due to: \n•\nA $113 million increase in\n Natural gas transportation service revenues \ndue to additional capacity from placing the Regional Energy Access Expansion into service during the fourth quarter of 2023 and in August 2024, the impact of placing the Carolina Market Link Expansion into service during the first quarter of 2024, the impact of placing partially the Southside Reliable Enhancement into service in November 2024, and an additional billing day, partially offset by lower electric power costs in 2024. Electric power costs are recovered from our customers through transportation rates and are offset in \nOperating and maintenance expenses \n resulting in no net impact on our results of operations;\n•\nA $14 million increase in \nNatural gas storage service revenues \nprimarily due to an increase in rates and an additional billing day;\n•\nA $19 million decrease in \nNatural gas product sales\n due to lower pricing offset by higher cash-out volumes, which directly offsets in \nNatural gas product costs \nresulting in no net impact on our results of operations;\n•\nA $10 million decrease in \nOther service revenues\n primarily due to park and loan services.\nNatural gas product costs\n decreased, directly offsetting\n Natural gas product sales \nand\n \nresulting in no net impact on our results of operations.\nOperating and maintenance expenses\n decreased primarily due to lower electric power costs. Electric power costs are recovered from customers through transportation rates and are offset in \nNatural gas transportation service revenues\n resulting in no net impact on results of operations; additionally there were increases in\n Operating and maintenance expenses\n costs from employee-related costs, including the impact of a change in a practice related to payroll timing, offset by a decrease in contractor services costs. \nDepreciation and amortization expenses\n increased as a result of additional assets placed in service and an increase in ARO-related depreciation (offset in \nOther income (expense) – net \n resulting in no net impact on our results of operations).\nTaxes, other than income taxes\n increased primarily due to an increase in property tax as a result of valuation increases in 2024.\nOther (income) expense – net\n incurred an unfavorable change primarily driven by an unfavorable change in the amortization of the regulatory pension liabilities, partially offset by a favorable change in the materials and supplies obsolete inventory reserve and a favorable change associated with the deferral of ARO related depreciation (offset in \nDepreciation and amortization expenses \nresulting in no net impact on our results of operations).  \nInterest income\n decreased due to a decrease in affiliated interest income on our advances to Williams due to a lower note receivable balance during 2024. \nAllowance for equity and borrowed funds used during construction (AFUDC) \nincreased as a result of increased capital expenditures.\nOther income (expense) – net  \nincreased\n \nresulting from various increased expenses incurred in 2024. \n80\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nNWP\nYear Ended December 31,\n2024\n$ Change\nfrom\n2023*\n% Change\nfrom\n2023*\n2023\n(Millions)\nRevenues:\nNatural gas transportation service revenues\n$\n416 \n$\n+1 \n— \n%\n$\n415 \nNatural gas storage service revenues\n15 \n— \n— \n%\n15 \nOther service revenues\n13 \n+3 \n+30 \n%\n10 \nTotal revenues\n444 \n440 \nCosts and expenses:\nOperating and maintenance expenses\n95 \n-7 \n-8 \n%\n88 \nSelling, general, and administrative expenses\n51 \n— \n— \n%\n51 \nDepreciation and amortization expenses\n111 \n— \n— \n%\n111 \nTaxes, other than income taxes\n14 \n-2 \n-17 \n%\n12 \nOther (income) expense - net\n(18)\n+2 \n+13 \n%\n(16)\nTotal costs and expenses\n253 \n246 \nOperating income (loss)\n191 \n-3 \n-2 \n%\n194 \nInterest expense\n(28)\n— \n— \n%\n(28)\nAllowance for equity and borrowed funds used during construction (AFUDC)\n10 \n+6 \n+150 \n%\n4 \nOther income (expense) – net\n7 \n-3 \n-30 \n%\n10 \nNet income (loss)\n$\n180 \n$\n— \n— \n%\n$\n180 \n_______\n*    + = Favorable change; - = Unfavorable change; NM = A percentage calculation is not meaningful due to a change in signs, a zero-value denominator, or a percentage change greater than 200.\n   2024 vs. 2023\nVariances due to changes in natural gas prices and transportation volumes have little impact on revenues, because under our rate design methodology, the majority of overall cost of service is recovered through firm capacity reservation charges in our transportation rates.\nRevenues increased primarily due to: \n•\nA $1 million increase in \nNatural gas transportation service revenues\n primarily due to an additional billing day in the leap year; \n•\nA $3 million increase in \nOther service revenues\n from higher park and loan services.\n81\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nOperating and maintenance expenses\n increased due to higher labor costs, electricity expenses, and higher contract services related to pipeline maintenance inspection activities.\nAllowance for equity and borrowed funds used during construction (AFUDC)\n increased due to increased capital expenditures in 2024. \n \nOther income (expense) – net\n decreased due to lower interest income earned on NWP’s advances to affiliates, which had a reduced balance in 2024.  \n82\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nManagement’s Discussion and Analysis of Financial Condition and Liquidity\nOverview\nWilliams\nDuring 2024, investing and financing expenditures included $2.6 billion of capital expenditures, $2.2 billion of acquisitions including Gulf Coast Storage, Discovery, and Crowheart, and $2.3 billion of dividends paid to common shareholders. These expenditures were funded primarily by $4.974 billion of cash provided by operating activities. Williams ended the year with $60 million of \nCash and cash equivalents\n. See also the following section titled \nSources (Uses) of Cash\n.\nTransco and NWP\nTransco and NWP fund their capital requirements with cash flows from operating activities, equity contributions and advances from Williams, accessing capital markets, and, if required, borrowings under the credit facility (see Note 13 – Debt and Banking Arrangements).\nTransco and NWP may raise capital through private debt offerings, as well as offerings registered pursuant to offering-specific registration statements. Interest rates, market conditions, and industry conditions will affect amounts raised, if any, in the capital markets. Transco and NWP anticipate that they will be able to access public and private debt markets on terms commensurate with their credit ratings to finance their capital requirements, when needed. \nTransco and NWP are also participants in Williams’ cash management program, and both make advances to and receive advances from Williams. At December 31, 2024, Transco’s advances to Williams totaled approximately $638 million and NWP’s advances from Williams totaled approximately $26 million. These advances are represented by demand notes. See Note 4 – Related Party Transactions.\nOutlook\nWilliams\nGrowth capital and investment expenditures in 2025 are expected to range from $1.65 billion to $1.95 billion, excluding acquisitions. Growth capital spending in 2025 primarily includes projects supporting growth in the Haynesville Shale basin (including Louisiana Energy Gateway expansion project), Transco expansions, all of which are fully contracted with firm transportation agreements and projects supporting the Northeast G&P business. Williams also expects to invest capital in the development of its upstream oil and gas properties.  In addition to growth capital and investment expenditures, Williams also remains committed to projects that maintain its assets for safe and reliable operations, as well as projects that reduce emissions, and meet legal, regulatory, and/or contractual commitments. Williams intends to fund substantially all planned 2025 capital spending with cash available after paying dividends. Williams retains the flexibility to adjust planned levels of growth capital and investment expenditures in response to changes in economic conditions or business opportunities including the repurchase of its common stock. \nOn January 9, 2025, Williams issued $1.5 billion of long-term debt and on January 15, 2025, Williams retired $750 million of long term debt (see Note 13 – Debt and Banking Arrangements). \nAs of December 31, 2024, Williams has approximately $1.7 billion of long-term debt due within one year. Williams’ potential sources of liquidity available to address these maturities include cash on hand, proceeds from refinancing, the credit facility, or the commercial paper program, as well as proceeds from asset monetizations.\nTransco and NWP\nTransco and NWP categorize their capital expenditures as either maintenance capital expenditures or growth capital expenditures. Maintenance capital expenditures are those expenditures required to maintain the existing \n83\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\noperating capacity and service capability of their assets, including replacement of system components and equipment that are worn, obsolete, completing their useful life, or necessary to remain in compliance with environmental laws and regulations. Growth capital expenditures improve the service capability of existing assets, extend useful lives, increase transmission or storage capacities from existing levels, reduce costs or enhance revenues. Transco and NWP anticipate 2025 growth capital expenditures will be approximately $336 million and $43 million, respectively, primarily for expansion projects, and $423 million and $186 million, respectively, for maintenance projects. They expect to fund these capital expenditures with cash from operations\n.\nLiquidity\nWilliams expects to have sufficient liquidity to manage its businesses in 2025 based on forecasted levels of cash flow from operations and other sources of liquidity. Williams’ potential material internal and external sources and uses of liquidity are as follows:\nSources:\nCash and cash equivalents on hand\nCash generated from operations\nDistributions from equity-method investees\nUtilization of the credit facility and/or commercial paper program\nCash proceeds from issuance of debt and/or equity securities\nProceeds from asset monetizations\nUses:\nWorking capital requirements\nCapital and investment expenditures\nProduct costs\nGas & NGL Marketing Services payments for transportation and storage capacity and gas supply\nOther operating costs including human capital expenses\nQuarterly dividends to shareholders\nRepayments of borrowings under the credit facility and/or commercial paper program\nDebt service payments, including payments of long-term debt\nDistributions to noncontrolling interests\nShare repurchase program\nAs of December 31, 2024, Williams has approximately $24.7 billion of long-term debt due after one year. Potential sources of liquidity available to address these maturities include cash generated from operations, proceeds from refinancing, the credit facility, or the commercial paper program, as well as proceeds from asset monetizations.\nPotential risks associated with Williams’ planned levels of liquidity discussed above include those previously discussed in Company Outlook\n.\nAs of December 31, 2024, Williams had a working capital deficit of $2.651 billion, including cash and cash equivalents and long-term debt due within one year. Williams available liquidity is as follows:\nDecember 31, 2024\n \n(Millions)\nCash and cash equivalents\n$\n60 \nCapacity available under Williams’ $3.75 billion credit facility, less amounts outstanding under Williams’ $3.5 billion commercial paper program (1)\n3,295 \n$\n3,355 \n__________\n(1)\nIn managing its available liquidity, Williams does not expect a maximum outstanding amount in excess of the capacity of its credit facility inclusive of any outstanding amounts under its commercial paper program. Williams had $455 million of \nCommercial paper\n (at par value) outstanding as of December 31, 2024. Through \n84\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nDecember 31, 2024, the highest amount outstanding under the commercial paper program and credit facility during 2024 was $730 million. Williams expects to be in compliance with the financial covenants associated with the credit facility for the December 31, 2024, reporting period. \nDividends\nWilliams increased the regular quarterly cash dividend to common stockholders by approximately 6.1 percent from the $0.4475 per share paid in each quarter of 2023, to $0.4750 per share paid in each quarter of 2024. On January 28, 2025, Williams’ board of directors approved a regular quarterly dividend of $0.5000 per share payable on March 31, 2025. \nRegistrations\nIn February 2024, Williams filed a shelf registration statement as a well-known seasoned issuer.\nDistributions from Equity-Method Investees\nThe organizational documents of entities in which Williams has an equity-method investment generally require periodic distributions of their available cash to their members. In each case, available cash is reduced, in part, by reserves appropriate for operating their respective businesses. See Note 8 – Investing Activities for our more significant equity-method investees.\nCredit Ratings\nThe interest rates at which Williams is able to borrow money are impacted by its credit ratings, which are currently as follows: \nRating Agency\nOutlook\nSenior Unsecured\nDebt Rating\nS&P Global Ratings\nPositive\nBBB\nMoody’s Investors Service\nStable\nBaa2\nFitch Ratings\nPositive\nBBB\nIn January 2025, Fitch Ratings changed its Outlook from Stable to Positive.\nThese credit ratings are included for informational purposes and are not recommendations to buy, sell, or hold Williams securities, and each rating should be evaluated independently of any other rating. No assurance can be given that the credit rating agencies will continue to assign Williams investment-grade ratings even if it meets or exceeds their current criteria for investment-grade ratios. A downgrade of its credit ratings might increase Williams’ future cost of borrowing and, if ratings were to fall below investment-grade, could require it to provide additional collateral to third parties, negatively impacting Williams’ available liquidity.\n85\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nSources (Uses) of Cash\nThe following table summarizes the sources (uses) of cash and cash equivalents for each of the periods presented in the Williams Consolidated Statement of Cash Flows:\n \nCash Flow\nYear Ended December 31,\n \nCategory\n2024\n2023\n2022\n \n(Millions)\nSources of cash and cash equivalents:\nNet cash provided (used) by operating activities\nOperating\n$\n4,974 \n$\n5,938 \n$\n4,889 \nProceeds from long-term debt (Note 13)\nFinancing\n3,594 \n2,755 \n1,755 \nProceeds from sale of business \n(\nNote 3\n)\nInvesting\n— \n346 \n— \nProceeds from dispositions of equity-method investments (Note 3)\nInvesting\n161 \n— \n— \nProceeds from commercial paper – net\nFinancing\n— \n372 \n345 \nUses of cash and cash equivalents:\nPayments of long-term debt \nFinancing\n(2,946)\n(634)\n(2,876)\nPurchases of businesses, net of cash acquired \n(\nNote 3\n)\nInvesting\n(2,244)\n(1,568)\n(933)\nCommon dividends paid\nFinancing\n(2,316)\n(2,179)\n(2,071)\nCapital expenditures\nInvesting\n(2,573)\n(2,516)\n(2,253)\nDividends and distributions paid to noncontrolling interests\nFinancing\n(242)\n(213)\n(204)\nPayments of commercial paper – net\nFinancing\n(269)\n— \n— \nPurchases of and contributions to equity-method investments\nInvesting\n(114)\n(141)\n(166)\nPurchases of treasury stock\nFinancing\n— \n(130)\n(9)\nOther sources / (uses) – net\nFinancing and Investing\n(115)\n(32)\n(5)\nIncrease (decrease) in cash and cash equivalents\n$\n(2,090)\n$\n1,998 \n$\n(1,528)\nOperating activities \nThe factors that determine Williams’ operating activities are largely the same as those that affect \nNet income (loss)\n, with the exception of noncash items such as \nDepreciation and amortization\n, \nProvision (benefit) for deferred income taxes\n, \nEquity (earnings) losses\n, \nNet unrealized (gain) loss from commodity derivative instruments\n,\n Gain on sale of business, Gain on disposition of equity-method investments, Gain on remeasurement of equity-method investments \n, \nInventory write-downs, \nand \nAmortization of stock-based awards.\nWilliams’\n Net cash provided (used) by operating activities\n for the year ended December 31, 2024, decreased from the same period in 2023 primarily due to unfavorable changes in margin requirements,  lower operating income (excluding non-cash items previously discussed), and unfavorable changes in net operating working capital. \nWilliams’\n Net cash provided (used) by operating activities\n in 2023 increased from 2022 primarily due to higher operating income (excluding noncash items as previously discussed), as well as favorable changes in net operating working capital and  margin requirements, partially offset by lower \nDistributions from equity-method investees\n. \nEnvironmental\nWilliams is a participant in certain environmental activities in various stages including assessment studies, cleanup operations, and/or remedial processes at certain sites, some of which it currently does not own (see Note 18 – Contingencies and Commitments). Williams is monitoring these sites in a coordinated effort with other potentially responsible parties, the EPA, or other governmental authorities. Williams is jointly and severally liable along with unrelated third parties in some of these activities and solely responsible in others. Current estimates of the most likely costs of such activities are approximately $42 million, all of which are included in \nOther current liabilities\n \n86\nTable of Contents\nManagement’s Discussion and Analysis (Continued)\nand \nRegulatory liabilities, deferred income, and other\n at December 31, 2024. Williams will seek to recover approximately $3 million of accrued costs related to remediation activities by its interstate gas pipelines through future natural gas transmission rates. The remainder of these costs will be funded from operations. During 2024, Williams paid approximately $11 million for cleanup and/or remediation and monitoring activities. Williams expects to pay approximately $5 million in 2025 for these activities. Estimates of the most likely costs of cleanup are generally based on completed assessment studies, preliminary results of studies, or Williams’ experience with other similar cleanup operations. At December 31, 2024, certain assessment studies were still in process for which the ultimate outcome may yield different estimates of most likely costs. Therefore, the actual costs incurred will depend on the final amount, type, and extent of contamination discovered at these sites, the final cleanup standards mandated by the EPA or other governmental authorities, and other factors.\nThe EPA and various state regulatory agencies routinely propose and promulgate new rules and issue updated guidance to existing rules. These rulemakings include, but are not limited to, rules for reciprocating internal combustion engine and combustion turbine maximum achievable control technology, reviews and updates to the National Ambient Air Quality Standards, and rules for new and existing source performance standards for volatile organic compounds and methane. Williams continuously monitors these regulatory changes and how they may impact its operations. Implementation of new or modified regulations may result in impacts to Williams’ operations and increase the cost of additions to \nProperty, plant, and equipment – net\n \nfor both new and existing facilities in affected areas; however, due to regulatory uncertainty on final rule content and applicability timeframes, Williams is unable to reasonably estimate the cost these regulatory impacts at this time.\nWilliams considers prudently incurred environmental assessment and remediation costs and the costs associated with compliance with environmental standards to be recoverable through rates for its interstate natural gas transmission pipelines. Historically, with limited exceptions, Williams has been permitted recovery of these environmental costs, and the intent is to continue seeking recovery of such costs through future rate filings.\n87\nTable of Contents",
  "item2": null
}