{
  "source_file": "wmt-20251031.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.  Management's Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nThis discussion, which presents Walmart Inc.'s (\"Walmart,\" the \"Company,\" \"our,\" \"us\" or \"we\") results for periods occurring in the fiscal year ending January 31, 2026 (\"fiscal 2026\") and the fiscal year ended January 31, 2025 (\"fiscal 2025\"), should be read in conjunction with our Condensed Consolidated Financial Statements as of and for the three and nine months ended October 31, 2025, and the accompanying notes included in \nPart I, Item 1\n of this Quarterly Report on Form 10-Q, as well as our Consolidated Financial Statements as of and for the year ended January 31, 2025, the accompanying notes and the related Management's Discussion and Analysis of Financial Condition and Results of Operations, contained in our Annual Report on Form 10-K for the year ended January 31, 2025.\nRecent Developments, Macroeconomic Conditions and Potential Impacts\nWe expect continued uncertainty in our business and the global economy due to tariffs and trade restrictions; inflationary trends; fluctuations in global currencies; swings in macroeconomic conditions and their effect on consumer confidence; volatility in employment trends; and supply chain pressures, any of which may impact our results. While we operate in a highly dynamic tariff environment, less than one third of what we sell in the U.S. is imported, with most of our imports coming from China, Mexico, Vietnam, India and Canada. We are committed to helping customers save money and live better through everyday low prices, supported by everyday low costs. Our operating results are influenced in part by our sourcing, pricing, merchandising, inventory management and other strategies in response to cost increases, which are further discussed in our Annual Report on Form 10-K. Information on certain risks, factors, and uncertainties that can affect our operating results and an investment in our securities can be found herein under \"\nItem 1A. Risk Factors\n\" and \"\nItem 5. Other Information\n.\" \nIn July 2025, the One Big Beautiful Bill Act (the \"Tax Act\") was enacted, introducing a series of corporate tax changes in the U.S., including 100% bonus depreciation on qualified property and full expensing for research and development expenditures. The impacts of the Tax Act were not material to our income tax expense or effective tax rate. We expect certain provisions will decrease cash taxes paid in the current fiscal year and may change the timing of cash tax payments in future periods.\nFor a detailed discussion on results of operations by reportable segment, refer to \"\nResults of Operations\n\" below.\nCompany Performance Metrics\nWe are committed to helping customers save money and live better through everyday low prices, supported by everyday low costs. At times, we adjust our business strategies to maintain and strengthen our competitive positions in the countries in which we operate. We define our financial priorities as follows: \n•\nGrowth - serve customers through a seamless omnichannel experience;\n•\nMargin - improve our operating income margin through productivity initiatives as well as category and business mix; and\n•\nReturns - improve our Return on Investment through margin improvement and disciplined capital spend.\nGrowth\nOur objective of prioritizing growth means we will focus on serving customers and members however they want to shop through our omnichannel business model. This includes increasing comparable store and club sales through increasing membership at Sam's Club U.S. and through Walmart+, accelerating eCommerce sales growth and expansion of omnichannel initiatives that complement our strategy.\nComparable sales is a metric that indicates the performance of our existing stores and clubs by measuring the change in sales for such stores and clubs, including eCommerce sales, for a particular period over the corresponding period in the previous year. The retail industry generally reports comparable sales using the retail calendar (also known as the 4-5-4 calendar). To be consistent with the retail industry, we provide comparable sales using the retail calendar in our quarterly earnings releases. However, when we discuss our comparable sales below, we are referring to our calendar comparable sales calculated using our fiscal calendar, which may result in differences when compared to comparable sales using the retail calendar. We focus on comparable sales in the U.S. as we believe it is a meaningful metric within the context of the U.S. retail market where there is a single currency, one inflationary market and generally consistent store and club formats from year to year.\n19\nTable of Contents\nCalendar comparable sales, as well as the impact of fuel, for the three and nine months ended October 31, 2025 and 2024, were as follows:\n \nThree Months Ended October 31,\nNine Months Ended October 31,\n \n2025\n2024\n2025\n2024\n2025\n2024\n2025\n2024\n \nWith Fuel\nFuel Impact\nWith Fuel\nFuel Impact\nWalmart U.S.\n4.8 \n%\n5.1 \n%\n0.0 \n%\n(0.2)\n%\n4.2 \n%\n4.7 \n%\n0.0 \n%\n(0.1)\n%\nSam's Club U.S.\n2.8 \n%\n3.8 \n%\n(1.4)\n%\n(3.4)\n%\n3.0 \n%\n4.3 \n%\n(2.2)\n%\n(1.7)\n%\nTotal U.S.\n4.5 \n%\n4.9 \n%\n(0.2)\n%\n(0.7)\n%\n4.0 \n%\n4.7 \n%\n(0.4)\n%\n(0.3)\n%\nComparable sales in the U.S., including fuel, increased 4.5% and 4.0% for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The Walmart U.S. segment had comparable sales growth of 4.8% and 4.2% for the three and nine months ended October 31, 2025, respectively, driven by growth in average ticket and transactions, reflecting strength in all merchandise categories. The Walmart U.S. segment's eCommerce net sales positively contributed approximately 4.4% and 3.9% to comparable sales for the three and nine months ended October 31, 2025, respectively. This growth reflects continued strength in customer and Walmart+ member engagement with omnichannel offerings, which was primarily driven by store-fulfilled pickup and delivery.\nComparable sales in the Sam's Club U.S. segment increased 2.8% and 3.0% for the three and nine months ended October 31, 2025, respectively, with growth in unit volumes and transactions, reflecting strong sales in grocery, general merchandise and health and wellness. The Sam's Club U.S. segment's eCommerce net sales positively contributed approximately 3.0% and 3.3% to comparable sales for the three and nine months ended October 31, 2025, respectively, which outpaced the total segment growth as a result of lower fuel sales driven by lower fuel prices. This growth reflects continued strength in member engagement with omnichannel offerings.\nMargin\nOur objective of prioritizing margin focuses on growth by driving incremental margin accretion through a combination of productivity improvements, as well as category and business mix. We invest in technology and process improvements to increase productivity, manage inventory and reduce costs, and we operate with discipline by managing expenses and optimizing the efficiency of how we work. We measure operating discipline through expense leverage, which we define as net sales growing at a faster rate than operating, selling, general and administrative (\"operating\") expenses. Additionally, we focus on our mix of businesses, including expanding our ecosystem in higher margin areas, such as digital advertising and marketplace. Our objective is to achieve operating income leverage, which we define as growing operating income at a faster rate than net sales. \nThree Months Ended October 31,\nNine Months Ended October 31,\n(Amounts in millions)\n2025\n2024\n2025\n2024\nNet sales\n$\n177,769 \n$\n168,003 \n$\n517,500 \n$\n495,708 \nPercentage change from comparable period\n5.8 \n%\n5.4 \n%\n4.4 \n%\n5.3 \n%\nOperating income\n$\n6,696 \n$\n6,708 \n$\n21,117 \n$\n21,489 \nPercentage change from comparable period\n(0.2)\n%\n8.2 \n%\n(1.7)\n%\n8.8 \n%\nPercentage of net sales\nGross profit\n(1)\n24.2 \n%\n24.2 \n%\n24.3 \n%\n24.2 \n%\nOperating expenses\n21.4 \n%\n21.2 \n%\n21.2 \n%\n20.9 \n%\nOperating income\n3.8 \n%\n4.0 \n%\n4.1 \n%\n4.3 \n%\n(1)    \nGross profit defined as net sales less cost of sales.\nGross profit as a percentage of net sales (\"gross profit rate\") increased 2 and 6 basis points for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The increases were primarily due to the Walmart U.S. segment, driven by disciplined inventory management and growth in higher margin businesses, partially offset by mix shifts into lower margin merchandise categories and the timing of Flipkart's The Big Billion Days (\"BBD\") sales event in the Walmart International segment, which primarily occurred in the fourth quarter of fiscal 2025 but mostly shifted to the third quarter of fiscal 2026. Additionally, the increases were partially offset by ongoing channel and format mix shifts in the Walmart International segment. \nOperating expenses as a percentage of net sales increased 28 and 33 basis points for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year, primarily driven by a charge of $0.7 billion related to modification of certain share-based compensation arrangements for our PhonePe subsidiary. The increase for the nine months ended October 31, 2025 was also impacted by higher self-insured general liability claims expense in the U.S. of approximately $0.8 billion, influenced by rising costs to resolve claims across retail and related industries.\nOperating income as a percentage of net sales decreased 22 and 26 basis points for the three and nine months ended October 31, 2025, respectively, primarily due to the factors described above.\n20\nTable of Contents\nReturns\nAs we execute our financial framework, we believe our return on capital will improve over time. We measure return on capital with our return on investment and free cash flow metrics. In addition, we provide returns in the form of share repurchases and dividends, which are discussed in the \nLiquidity and Capital Resources\n section.\nReturn on Assets and Return on Investment \nWe include Return on Assets (\"ROA\") and Return on Investment (\"ROI\") as metrics to assess our return on capital. ROA is the most directly comparable measure based on our financial statements presented in accordance with generally accepted accounting principles in the U.S. (\"GAAP\") while ROI is considered a non-GAAP financial measure. Management believes ROI is a meaningful metric to share with investors because it helps investors assess how effectively Walmart deploys its assets. Trends in ROI can fluctuate over time as management balances long-term strategic initiatives with possible short-term impacts.\nOur calculation of ROI is considered a non-GAAP financial metric because we calculate ROI using financial measures that exclude and include amounts that are included and excluded in ROA, the most directly comparable GAAP financial measure. ROA is consolidated net income for the period divided by average total assets for the period. We define ROI as operating income plus interest income, depreciation and amortization, and rent expense for the trailing 12 months divided by average invested capital during that period. We consider average invested capital to be the average of our beginning and ending total assets, plus average accumulated depreciation and amortization, less average accounts payable and averaged accrued liabilities for that period. Although ROI is a standard financial measure, numerous methods exist for calculating a company's ROI. As a result, the method used by management to calculate our ROI may differ from the methods used by other companies to calculate their ROI.\nThe calculation of ROA and ROI, along with a reconciliation of ROI to the calculation of ROA, the most comparable GAAP financial measure, is as follows:\n \nFor the Trailing Twelve Months Ended October 31,\n(Amounts in millions)\n2025\n2024\nCALCULATION OF RETURN ON ASSETS\nNumerator\nConsolidated net income\n$\n23,303 \n$\n20,410 \nDenominator\nAverage total assets\n(1)\n$\n276,027 \n$\n261,287 \nReturn on assets (ROA)\n8.4 \n%\n7.8 \n%\nCALCULATION OF RETURN ON INVESTMENT\nNumerator\nOperating income\n$\n28,976 \n$\n28,743 \n+ Interest income\n393 \n513 \n+ Depreciation and amortization\n13,837 \n12,715 \n+ Rent\n2,402 \n2,329 \n= ROI operating income\n$\n45,608 \n$\n44,300 \nDenominator\nAverage total assets\n(1)\n$\n276,027 \n$\n261,287 \n'\n+ Average accumulated depreciation and amortization\n(1)\n126,953 \n120,464 \n'\n- Average accounts payable\n(1)\n65,010 \n61,956 \n - Average accrued liabilities\n(1)\n29,819 \n27,125 \n= Average invested capital\n$\n308,151 \n$\n292,670 \nReturn on investment (ROI)\n14.8 \n%\n15.1 \n%\n(1)`\nThe average is based on the addition of the account balance at the end of the current period to the account balance at the end of the previous period and dividing by two.\n \nAs of October 31,\n (Amounts in millions)\n2025\n2024\n2023\nCertain Balance Sheet Data\nTotal assets\n$\n288,655 \n$\n263,399 \n$\n259,174 \nAccumulated depreciation and amortization\n131,099 \n122,806 \n118,122 \nAccounts payable\n67,156 \n62,863 \n61,049 \nAccrued liabilities\n31,521 \n28,117 \n26,132 \n21\nTable of Contents\nROA was 8.4% and 7.8% for the trailing 12 months ended October 31, 2025 and 2024, respectively. The increase in ROA was primarily due to an increase in net income as a result of net increases in the fair value of our equity and other investments combined with higher operating income, offset by an increase in average total assets due to higher purchases of property and equipment. ROI was 14.8% and 15.1% for the trailing 12 months ended October 31, 2025 and 2024, respectively. The decrease in ROI was the result of an increase in average invested capital due to higher purchases of property and equipment. ROI benefited from increased operating income due to improved business performance, which was partially offset by the incremental non-cash share-based compensation charge at PhonePe as well as other business restructuring and certain legal matters.\nCapital Allocation\nOur strategy includes allocating our capital to higher-return areas such as automation and investments in stores and clubs. The following table provides additional detail regarding our capital expenditures:\n(Amounts in millions)\nNine Months Ended October 31,\nAllocation of Capital Expenditures\n2025\n2024\nSupply chain, customer-facing initiatives, technology and other\n$\n11,286 \n$\n9,652 \nStore and club remodels\n4,472 \n4,610 \nNew stores and clubs, including expansions and relocations\n841 \n267 \nTotal U.S.\n16,599 \n14,529 \nWalmart International\n2,028 \n2,167 \nTotal Capital Expenditures\n$\n18,627 \n$\n16,696 \nFree Cash Flow\nFree cash flow is considered a non-GAAP financial measure. Management believes, however, that free cash flow, which measures our ability to generate additional cash from our business operations, is an important financial measure for use in evaluating the Company's financial performance. Free cash flow should be considered in addition to, rather than as a substitute for, consolidated net income as a measure of our performance and net cash provided by operating activities as a measure of our liquidity. See \nLiquidity and Capital Resources\n for discussions of GAAP metrics including net cash provided by operating activities, net cash used in investing activities and net cash used in financing activities.\nWe define free cash flow as net cash provided by operating activities in a period minus payments for property and equipment made in that period. Walmart's definition of free cash flow is limited in that it does not represent residual cash flows available for discretionary expenditures due to the fact that the measure does not deduct the payments required for debt service and other contractual obligations or payments made for business acquisitions. Therefore, we believe it is important to view free cash flow as a measure that provides supplemental information to our Condensed Consolidated Statements of Cash Flows.\nAlthough other companies report their free cash flow, numerous methods may exist for calculating a company's free cash flow. As a result, the method used by management to calculate our free cash flow may differ from the methods used by other companies to calculate their free cash flow.\nThe following table sets forth a reconciliation of free cash flow, a non-GAAP financial measure, to net cash provided by operating activities, which we believe to be the GAAP financial measure most directly comparable to free cash flow, as well as information regarding net cash used in investing activities and net cash used in financing activities.\n \nNine Months Ended October 31,\n(Amounts in millions)\n2025\n2024\nNet cash provided by operating activities\n$\n27,452 \n$\n22,918 \nPayments for property and equipment\n(18,627)\n(16,696)\nFree cash flow\n$\n8,825 \n$\n6,222 \nNet cash used in investing activities\n(1)\n$\n(19,030)\n$\n(12,661)\nNet cash used in financing activities\n(7,012)\n(9,673)\n(1)    \nNet cash used in investing activities includes payments for property and equipment, which is also included in our computation of free cash flow. \nNet cash provided by operating activities was $27.5 billion for the nine months ended October 31, 2025, which represents an increase of $4.5 billion when compared to the same period in the previous fiscal year. The increase was primarily due to timing of certain payments, increased cash provided by operating income and lower cash tax payments. Free cash flow for the nine months ended October 31, 2025 was $8.8 billion, which represents an increase of $2.6 billion when compared to the same period in the previous fiscal year. The increase in free cash flow was due to the increase in net cash provided by operating activities described above, partially offset by an increase of $1.9 billion in capital expenditures to support our investment strategy.\n22\nTable of Contents\nResults of Operations\nConsolidated Results of Operations\nThree Months Ended October 31,\nNine Months Ended October 31,\n(Dollar amounts and retail square feet in millions)\n2025\n2024\n2025\n2024\nNet sales\n$\n177,769 \n$\n168,003 \n$\n517,500 \n$\n495,708 \nPercentage change from comparable period\n5.8 \n%\n5.4 \n%\n4.4 \n%\n5.3 \n%\nMembership and other income\n(1)\n1,727 \n1,585 \n5,007 \n4,723 \nTotal revenues\n179,496 \n169,588 \n522,507 \n500,431 \nPercentage change from comparable period\n5.8 \n%\n5.5 \n%\n4.4 \n%\n5.4 \n%\nGross profit\n(2)\n43,063 \n40,663 \n125,720 \n120,127 \nOperating expenses\n(2)\n38,094 \n35,540 \n109,610 \n103,361 \nOperating income\n6,696 \n6,708 \n21,117 \n21,489 \nOther (gains) and losses\n(2,081)\n132 \n(4,192)\n500 \nConsolidated net income\n$\n6,088 \n$\n4,714 \n$\n17,878 \n$\n14,732 \nPercentage of net sales\nGross profit\n24.2 \n%\n24.2 \n%\n24.3 \n%\n24.2 \n%\nOperating expenses\n21.4 \n%\n21.2 \n%\n21.2 \n%\n20.9 \n%\nOperating income\n3.8 \n%\n4.0 \n%\n4.1 \n%\n4.3 \n%\nUnit counts at period end\n10,822 \n10,660 \n10,822 \n10,660 \nRetail square feet at period end\n1,053 \n1,050 \n1,053 \n1,050 \n(1)    \nMembership and other income includes membership fees and other items such as rental and tenant income, recycling income and gift card breakage income, as well as other income from corporate campus facilities.\n(2)    \nGross profit is defined as net sales less cost of sales. Operating expenses refers to operating, selling, general and administrative expenses.\nOur total revenues \nincreased\n $9.9 billion or 5.8% and $22.1 billion or 4.4% for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The increases were primarily due to strong positive comparable sales in our U.S. segments and international markets driven by growth in average ticket and transactions, with strength in eCommerce. Net sales growth across channels also reflected strong sales in grocery, health and wellness and general merchandise in our U.S. segments. Net sales for the three and nine months ended October 31, 2025 were negatively affected by $0.2 billion and $4.0 billion, respectively, in currency exchange rate fluctuations. Membership and other income increased $0.1 billion or 9.0% and $0.3 billion or 6.0% for the three and nine months ended October 31, 2025, respectively, primarily due to strong growth in membership fee income globally, partially offset by decreases in other income items.\nGross profit rate increased 2 and 6 basis points for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The increases were primarily due to the Walmart U.S. segment, driven by disciplined inventory management and growth in higher margin businesses, partially offset by mix shifts into lower margin merchandise categories and the timing of Flipkart's BBD sales event in the Walmart International segment, which primarily occurred in the fourth quarter of fiscal 2025 but mostly shifted to the third quarter of fiscal 2026. Additionally, the increases were partially offset by ongoing channel and format mix shifts in the Walmart International segment. \nOperating expenses as a percentage of net sales increased 28 and 33 basis points for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year, primarily driven by a charge of $0.7 billion related to modification of certain share-based compensation arrangements for our PhonePe subsidiary. The increase for the nine months ended October 31, 2025 was also impacted by higher self-insured general liability claims expense in the U.S. of approximately $0.8 billion, influenced by rising costs to resolve claims across retail and related industries.\nOther gains and losses consist of certain non-operating items, such as the change in the fair value of our investments and gains or losses on business dispositions, which by their nature can fluctuate from period to period. Other gains and losses for the three and nine months ended October 31, 2025 consisted of net gains of $2.1 billion and $4.2 billion, respectively, compared to net losses of $0.1 billion and $0.5 billion for the same periods in the previous fiscal year. These net gains and losses primarily consisted of changes in fair value of our equity and other investments driven by changes in their underlying stock prices.\nOur effective income tax rate was 25.6% and 23.9% for the three and nine months ended October 31, 2025, respectively, compared to 22.7% and 23.8% for the same periods in the previous fiscal year. The increase in effective tax rate is primarily due to the share-based compensation charge recorded at the Company's PhonePe subsidiary, which provided no tax benefit. Our effective income tax rate may fluctuate as a result of various factors, including changes in our assessment of unrecognized tax benefits, valuation allowances, business operations, acquisitions, investments, entry into new businesses and geographies, intercompany transactions, changes in tax law, changes in the administrative practices, principles, and interpretations related to tax, and the mix and size of earnings among our U.S. operations and international operations, which are subject to statutory rates that may be different than the U.S. statutory rate. \n23\nTable of Contents\nAs a result of the factors discussed above, consolidated net income increased $1.4 billion and $3.1 billion for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. Accordingly, diluted net income per common share attributable to Walmart was $0.77 and $2.20 for the three and nine months ended October 31, 2025, respectively, which represents an increase of $0.20 and $0.45 when compared to the same periods in the previous fiscal year.\nWalmart U.S. Segment\n \nThree Months Ended October 31,\nNine Months Ended October 31,\n(Dollar amounts and retail square feet in millions)\n2025\n2024\n2025\n2024\nNet sales\n$\n120,678 \n$\n114,875 \n$\n353,752 \n$\n338,892 \nNet sales percentage change from comparable period\n5.1 \n%\n5.0 \n%\n4.4 \n%\n4.5 \n%\nCalendar comparable sales increase\n4.8 \n%\n5.1 \n%\n4.2 \n%\n4.7 \n%\nMembership and other income\n665 \n618 \n1,950 \n1,835 \nGross profit\n33,312 \n31,491 \n97,797 \n92,893 \nOperating expenses\n28,197 \n26,674 \n81,542 \n77,370 \nOperating income\n$\n5,780 \n$\n5,435 \n$\n18,205 \n$\n17,358 \nPercentage of net sales\nGross profit\n27.6 \n%\n27.4 \n%\n27.6 \n%\n27.4 \n%\nOperating expenses\n23.4 \n%\n23.2 \n%\n23.1 \n%\n22.8 \n%\nOperating income\n4.8 \n%\n4.7 \n%\n5.1 \n%\n5.1 \n%\nUnit counts at period end\n4,606\n4,606\n4,606\n4,606\nRetail square feet at period end\n698\n698\n698\n698\nNet sales for the Walmart U.S. segment increased $5.8 billion or 5.1% and $14.9 billion or 4.4% for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The increases were due to comparable sales of 4.8% and 4.2% for the three and nine months ended October 31, 2025, driven by growth in average ticket and transactions, reflecting strength in all merchandise categories. The Walmart U.S. segment's eCommerce net sales positively contributed approximately 4.4% and 3.9% to comparable sales for the three and nine months ended October 31, 2025, respectively. This growth reflects continued strength in customer and Walmart+ member engagement with omnichannel offerings, which was primarily driven by store-fulfilled pickup and delivery. \nMembership and other income increased 7.6% and 6.3% for the three and nine months ended October 31, 2025, respectively, primarily driven by double-digit percentage growth in membership fee income from Walmart+. \nGross profit rate increased 19 and 24 basis points for the three and nine months ended October 31, 2025, when compared to the same periods in the previous fiscal year. The increases were primarily driven by disciplined inventory management and growth in higher margin businesses, partially offset by mix shifts into lower margin merchandise categories. \nOperating expenses as a percentage of net sales increased 15 and 22 basis points for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The increases were primarily due to higher self-insured general liability claims expense, increased depreciation expense related to our continued capital investments, as well as VIZIO operating costs following the acquisition in December 2024.\nAs a result of the factors discussed above, operating income increased $0.3 billion and $0.8 billion for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. \n24\nTable of Contents\nWalmart International Segment\n \nThree Months Ended October 31,\nNine Months Ended October 31,\n(Dollar amounts and retail square feet in millions)\n2025\n2024\n2025\n2024\nNet sales\n$\n33,541 \n$\n30,277 \n$\n94,496 \n$\n89,677 \nPercentage change from comparable period\n10.8 \n%\n8.0 \n%\n5.4 \n%\n9.1 \n%\nMembership and other income\n391 \n367 \n1,151 \n1,122 \nGross profit\n7,002 \n6,529 \n20,021 \n19,649 \nOperating expenses\n6,691 \n5,692 \n17,979 \n16,674 \nOperating income\n$\n702 \n$\n1,204 \n$\n3,193 \n$\n4,097 \nPercentage of net sales\nGross profit\n20.9 \n%\n21.6 \n%\n21.2 \n%\n21.9 \n%\nOperating expenses\n19.9 \n%\n18.8 \n%\n19.0 \n%\n18.6 \n%\nOperating income\n2.1 \n%\n4.0 \n%\n3.4 \n%\n4.6 \n%\nUnit counts at period end\n5,615 \n5,454 \n5,615 \n5,454 \nRetail square feet at period end\n274 \n271 \n274 \n271 \nNet sales for the Walmart International segment increased $3.3 billion or 10.8% and $4.8 billion or 5.4% for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The increases were primarily due to positive comparable sales across our international markets, including strength in eCommerce and the shift in timing of Flipkart's BBD sales event, partially offset by negative fluctuations in currency exchange rates of $0.2 billion and $4.0 billion for the three and nine months ended October 31, 2025, respectively.\nGross profit rate decreased 68 and 72 basis points for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The decreases were primarily driven by ongoing channel and format mix shifts, including timing from BBD, partially offset by growth in higher margin businesses.\nOperating expenses as a percentage of net sales increased 115 and 44 basis points for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year, primarily due to a charge of $0.7 billion related to PhonePe's modification of certain share-based payment arrangements in contemplation of a potential initial public offering (refer to \nNote 8\n), partially offset by strong sales, BBD timing as well as format mix shifts.\nAs a result of the factors discussed above, operating income decreased $0.5 billion and $0.9 billion for the three and nine months ended October 31, 2025, when compared to the same periods in the previous fiscal year. \n25\nTable of Contents\nSam's Club U.S. Segment\n \nThree Months Ended October 31,\nNine Months Ended October 31,\n(Dollar amounts and retail square feet in millions)\n2025\n2024\n2025\n2024\nIncluding Fuel\nNet sales\n$\n23,550 \n$\n22,851 \n$\n69,252 \n$\n67,139 \nPercentage change from comparable period\n3.1 \n%\n3.9 \n%\n3.1 \n%\n4.4 \n%\nCalendar comparable sales increase\n2.8 \n%\n3.8 \n%\n3.0 \n%\n4.3 \n%\nMembership and other income\n665 \n588 \n1,889 \n1,728 \nGross profit\n2,749 \n2,643 \n7,902 \n7,585 \nOperating expenses\n2,743 \n2,597 \n7,945 \n7,483 \nOperating income\n$\n671 \n$\n634 \n$\n1,846 \n$\n1,830 \nPercentage of net sales\nGross profit\n11.7 \n%\n11.6 \n%\n11.4 \n%\n11.3 \n%\nOperating expenses\n11.6 \n%\n11.4 \n%\n11.5 \n%\n11.1 \n%\nOperating income\n2.8 \n%\n2.8 \n%\n2.7 \n%\n2.7 \n%\nUnit counts at period end\n601 \n600 \n601 \n600 \nRetail square feet at period end\n81 \n80 \n81 \n80 \nExcluding Fuel \n(1)\nNet sales\n$\n21,148 \n$\n20,263 \n$\n62,072 \n$\n58,946 \nPercentage change from comparable period\n4.4 \n%\n7.2 \n%\n5.3 \n%\n6.0 \n%\nOperating income\n$\n493 \n$\n437 \n$\n1,375 \n$\n1,343 \n(1)    \nWe believe the Excluding Fuel information is useful to investors because it permits investors to understand the effect of the Sam's Club U.S. segment's fuel sales on its results of operations, which are impacted by the volatility of fuel prices. Volatility in fuel prices may continue to impact the operating results of the Sam's Club U.S. segment in the future.\nNet sales for the Sam's Club U.S. segment increased $0.7 billion or 3.1% and $2.1 billion or 3.1% for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The increases were primarily due to comparable sales, including fuel, of 2.8% and 3.0% for the three and nine months ended October 31, 2025, respectively, with growth in unit volumes and transactions, reflecting strong sales in grocery, general merchandise and health and wellness. Sam's Club U.S. eCommerce net sales positively contributed approximately 3.0% and 3.3% to comparable sales for the three and nine months ended October 31, 2025, respectively, which outpaced the total segment comparable sales as a result of lower fuel sales driven by lower fuel prices. This growth reflects continued strength in member engagement with omnichannel offerings.\nMembership and other income increased 13.1% and 9.3% for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The increases were primarily due to growth in the membership base and Plus penetration, as well as breakage income related to unredeemed Sam's Cash rewards.\nGross profit rate increased 10 and 11 basis points for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The increase for the three months ended October 31, 2025 was primarily due to product mix changes and operational efficiencies. The increase for the nine months ended October 31, 2025 was primarily due to higher margins in fuel, product mix changes and operational efficiencies, partially offset by higher eCommerce fulfillment costs and the impact of reorganization charges related to strategic supply chain decisions.\nOperating expenses as a percentage of net sales increased 29 and 32 basis points for the three and nine months ended October 31, 2025, respectively, when compared to the same periods in the previous fiscal year. The increase for the three months ended October 31, 2025 was primarily due to associate wage investments, lower fuel sales and higher self-insured general liability claims expense. The increase for the nine months ended October 31, 2025 was primarily due to lower fuel sales, higher self-insured general liability claims expense and continued technology investments.\nAs a result of the factors discussed above, operating income increased slightly for both the three and nine months ended October 31, 2025, when compared to the same periods in the previous fiscal year.\n26\nTable of Contents\nLiquidity and Capital Resources\nLiquidity\nThe strength and stability of our operations have historically supplied us with a significant source of liquidity. Our cash flows provided by operating activities, supplemented with our long-term debt and short-term borrowings, have been sufficient to fund our operations while allowing us to invest in activities that support the long-term growth of our operations. Generally, some or all of the remaining available cash flow has been used to fund dividends on our common stock and share repurchases. We believe our sources of liquidity will continue to be sufficient to fund operations, finance our investment activities, pay dividends and fund our share repurchases for at least the next 12 months and for the foreseeable future. \nNet Cash Provided by Operating Activities\nNine Months Ended October 31,\n(Amounts in millions)\n2025\n2024\nNet cash provided by operating activities\n$\n27,452 \n$\n22,918 \nNet cash provided by operating activities for the nine months ended October 31, 2025 increased $4.5 billion when compared to the same period in the previous fiscal year. The increase was primarily due to timing of certain payments, increased cash provided by operating income and lower cash tax payments.\nCash Equivalents and Working Capital Deficit \nCash and cash equivalents were $10.6 billion and $10.0 billion at October 31, 2025 and 2024, respectively. Our working capital deficit was $22.8 billion as of October 31, 2025, which increased when compared to the $15.6 billion working capital deficit as of October 31, 2024. The increase in our working capital deficit was primarily driven by the timing of certain payments described above and an increase in short-term borrowings for general corporate purposes, partially offset by an increase in receivables and inventories primarily related to sales growth. We generally operate with a working capital deficit due to our efficient use of cash in funding operations, consistent access to the capital markets and returns provided to our shareholders in the form of cash dividends and share repurchases. \nAs of October 31, 2025 and January 31, 2025, cash and cash equivalents of $4.8 billion and $3.3 billion, respectively, may not be freely transferable to the U.S. due to local laws or other restrictions or are subject to the approval of the noncontrolling interest shareholders.\nNet Cash Used in Investing Activities\n \nNine Months Ended October 31,\n(Amounts in millions)\n2025\n2024\nNet cash used in investing activities\n$\n(19,030)\n$\n(12,661)\nNet cash used in investing activities for the nine months ended October 31, 2025 increased $6.4 billion when compared to the same period in the previous fiscal year. The increase is primarily due to the change in net proceeds received from the sale of certain strategic investments as well as increased payments for property and equipment. \nNet Cash Used in Financing Activities\n \nNine Months Ended October 31,\n(Amounts in millions)\n2025\n2024\nNet cash used in financing activities\n$\n(7,012)\n$\n(9,673)\nNet cash used in financing activities decreased $2.7 billion for the nine months ended October 31, 2025, when compared to the same period in the previous fiscal year. The decrease is primarily due to proceeds from new long-term debt issued and higher short-term borrowings in the current fiscal year, primarily offset by increased share repurchases.\nIn April 2025, the Company renewed and extended its existing 364-day revolving credit facility of $10.0 billion as well as its five-year credit facility of $5.0 billion. In total, we had committed lines of credit in the U.S. of $15.0 billion at October 31, 2025, all undrawn.\n27\nTable of Contents\nLong-term Debt\nThe following table provides the changes in our long-term debt for the nine months ended October 31, 2025:\n(Amounts in millions)\nLong-term debt due within one year\nLong-term debt\nTotal\nBalances as of February 1, 2025\n$\n2,598 \n$\n33,401 \n$\n35,999 \nProceeds from issuance of long-term debt\n(1)\n— \n3,983 \n3,983 \nRepayments of long-term debt\n(2,625)\n— \n(2,625)\nReclassifications of long-term debt\n3,551 \n(3,551)\n— \nCurrency and other adjustments\n(1)\n612 \n611 \nBalances as of October 31, 2025\n$\n3,523 \n$\n34,445 \n$\n37,968 \n(1)\nProceeds from issuance of long-term debt are net of deferred loan costs and any related discount or premium.\nDuring the nine months ended October 31, 2025, our total outstanding long-term debt increased $2.0 billion, primarily due to the issuance of new long-term debt in April 2025 less current year debt repayments. Refer to \nNote 4\n to our Condensed Consolidated Financial Statements for details.\nDividends\nEffective February 20, 2025, the Company approved the fiscal 2026 annual dividend of $0.94 per share, a 13% increase over the fiscal 2025 annual dividend of $0.83 per share. For fiscal 2026, the annual dividend was or will be paid in four quarterly installments of $0.235 per share, according to the following record and payable dates:\nRecord Date\nPayable Date\nMarch 21, 2025\nApril 7, 2025\nMay 9, 2025\nMay 27, 2025\nAugust 15, 2025\nSeptember 2, 2025\nDecember 12, 2025\nJanuary 5, 2026\nThe dividend installments payable on April 7, 2025, May 27, 2025 and September 2, 2025 were paid as scheduled.\nCompany Share Repurchase Program\nFrom time to time, the Company repurchases shares of its common stock under share repurchase programs authorized by the Company's Board of Directors. All repurchases made during the nine months ended October 31, 2025 were made under the current $20 billion share repurchase program approved in November 2022, which has no expiration date or other restrictions limiting the period over which the Company can make repurchases. As of October 31, 2025, authorization for $5.1 billion of share repurchases remained under the share repurchase program. Any repurchased shares are constructively retired and returned to an unissued status.\nWe regularly review share repurchase activity and consider several factors in determining when to execute share repurchases, including, among other things, current cash needs, capacity for leverage, cost of borrowings, our results of operations and the market price of our common stock. We anticipate that a majority of the ongoing share repurchase program will be funded through the Company's free cash flow. The following table provides, on a settlement date basis, share repurchase information for the nine months ended October 31, 2025 and 2024:\nNine Months Ended October 31,\n(Amounts in millions, except per share data)\n2025\n2024\nTotal number of shares repurchased\n75.3 \n45.9 \nAverage price paid per share\n$\n93.04 \n$\n66.37 \nTotal amount paid for share repurchases\n$\n7,008 \n$\n3,049 \nDuring the nine months ended October 31, 2025, the Company repurchased $7.0 billion in shares of its common stock, an increase of $4.0 billion as compared to the same period in the previous fiscal year. The increase was primarily driven by opportunistic prices during the first quarter of fiscal 2026 as part of the Company's long-term strategy. \nMaterial Cash Requirements\nMaterial cash requirements from operating activities primarily consist of inventory purchases, employee related costs, taxes, interest and other general operating expenses, which we expect to be primarily satisfied by our cash from operations. Other material cash requirements from known contractual and other obligations include short-term borrowings, long-term debt and related interest payments, leases and purchase obligations.\n28\nTable of Contents\nCapital Resources\nWe believe our cash flows from operations, current cash position, short-term borrowings and access to capital markets will continue to be sufficient to meet our anticipated cash requirements and contractual obligations, which includes funding seasonal buildups in merchandise inventories and funding our capital expenditures, acquisitions, dividend payments and share repurchases. \nWe have strong commercial paper and long-term debt ratings that have enabled and should continue to enable us to refinance our debt as it becomes due at favorable rates in capital markets. As of October 31, 2025, the ratings assigned to our commercial paper and rated series of our outstanding long-term debt were as follows:\nRating agency\nCommercial paper\nLong-term debt\nStandard & Poor's\nA-1+\nAA\nMoody's Investors Service\nP-1\nAa2\nFitch Ratings\nF1+\nAA\nCredit rating agencies review their ratings periodically and, therefore, the credit ratings assigned to us by each agency may be subject to revision at any time. Accordingly, we are not able to predict whether our current credit ratings will remain consistent over time. Factors that could affect our credit ratings include changes in our operating performance, the general economic environment, conditions in the retail industry, our financial position, including our total debt and capitalization, and changes in our business strategy. Any downgrade of our credit ratings by a credit rating agency could increase our future borrowing costs or impair our ability to access capital and credit markets on terms commercially acceptable to us. In addition, any downgrade of our current short-term credit ratings could impair our ability to access the commercial paper markets with the same flexibility that we have experienced historically, potentially requiring us to rely more heavily on more expensive types of debt financing. The credit rating agency ratings are not recommendations to buy, sell or hold our commercial paper or debt securities. Each rating may be subject to revision or withdrawal at any time by the assigning rating organization and should be evaluated independently of any other rating. Moreover, each credit rating is specific to the security to which it applies.\nOther Matters\nIn \nNote 6\n to our Condensed Consolidated Financial Statements, which is captioned \"Contingencies\" and appears in Part I of this Quarterly Report on Form 10-Q under the caption \"\nItem 1. Financial Statements\n,\" we discuss, under the sub-captions \"\nSettlement of Certain Opioid-Related Matters,\n\" \nand \n\"\nOngoing Opioid-Related Litigation,\n\" certain opioid-related matters, as well as the Prescription Opiate Litigation, and other matters, including certain risks arising therefrom. In \nNote 6\n, we discuss, \"\nAsda Equal Value Claims\n\"\n \nthe Company's indemnification obligation for the Asda Equal Value Claims matter, \"\nMoney Transfer Agent Services Matter,\n\" a government investigation by the U.S. Attorney's Office for the Middle District of Pennsylvania into the Company's consumer fraud prevention and anti-money laundering compliance related to the Company's money transfer agent services, as well as matters related to independent contractor drivers on the driver platform under \"\nDriver Platform Matters.\n\"\n \nIn \nNote 6\n, under \"\nMexico Antitrust Matter\n,\" we also discuss a quasi-judicial administrative process initiated by COFECE against Walmex and Walmex's related constitutional challenge. In \nNote 6\n we also discuss a show cause notice and requests issued by the Directorate of Enforcement to Flipkart regarding Foreign Direct Investment rules and regulations in India and an India Antitrust Matter. We reference various legal proceedings related to the Prescription Opiate Litigation, the DOJ Opioid Civil Litigation, Opioids-Related Securities Class Actions and False Claims Act Litigation; Asda Equal Value Claims; Money Transfer Agent Services Matter; Driver Platform Matters; Mexico Antitrust Matter; and an India Antitrust Matter in \nPart II\n of this Quarterly Report on Form 10-Q under the caption \"\nItem 1. Legal Proceedings\n,\" under the caption \"I. Supplemental Information.\" We also discuss an environmental matter with the U.S. Environmental Protection Agency in\n \nPart II\n of this Quarterly Report on Form 10-Q under the caption \"\nItem 1. Legal Proceedings\n,\" under the sub-caption \"II. Environmental Matters.\" The foregoing matters and other matters described elsewhere in this Quarterly Report on Form 10-Q represent contingent liabilities of the Company that may or may not result in the incurrence of a material liability by the Company upon their final resolution."
}