{
  "source_file": "wrb-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2\n.     \nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nOverview\n    W. R. Berkley Corporation is an insurance holding company that is among the largest commercial lines writers in the United States and operates worldwide in two segments of the property and casualty business: Insurance and Reinsurance & Monoline Excess. Our decentralized structure provides us with the flexibility to respond quickly and efficiently to local or specific market conditions and to pursue specialty business niches. It also allows us to be closer to our customers in order to better understand their individual needs and risk characteristics. While providing our businesses with certain operating autonomy, our structure allows us to capitalize on the benefits of economies of scale through centralized capital, investment, reinsurance, enterprise risk management, and actuarial, financial and corporate legal staff support. The Company’s primary sources of revenues and earnings are its insurance operations and its investments.\n    An important part of our strategy is to form new businesses to capitalize on various market opportunities. Over the years, the Company has formed numerous businesses that are focused on important parts of the economy in the U.S., including healthcare, cyber security, energy and agriculture, and on growing international markets, including the Asia-Pacific region, South America and Mexico.\n    The profitability of the Company’s insurance business is affected primarily by the adequacy of premium rates. The ultimate adequacy of premium rates is not known with certainty at the time an insurance policy is issued because premiums are determined before claims are reported. The ultimate adequacy of premium rates is affected mainly by the severity and frequency of claims, which are influenced by many factors, including natural and other disasters, regulatory measures and court decisions that define and change the extent of coverage and the effects of economic inflation on the amount of compensation for injuries or losses. General insurance prices are also influenced by available insurance capacity, i.e., the level of capital employed in the industry, and the industry’s willingness to deploy that capital.\n    The Company’s profitability is also affected by its investment income and investment gains. The Company’s invested assets are invested principally in fixed maturity securities. The return on fixed maturity securities is affected primarily by general interest rates, as well as the credit quality and duration of the securities. \n    The Company also invests in equity securities, merger arbitrage securities, investment funds, private equity, loans and real estate-related assets. The Company's investments in investment funds and its other alternative investments have experienced, and the Company expects to continue to experience, greater fluctuations in investment income. The Company's share of the earnings or losses from investment funds is generally reported on a one-quarter lag in order to facilitate the timely completion of the Company's consolidated financial statements.\nCritical Accounting Estimates\n    The following presents a discussion of accounting policies and estimates relating to reserves for losses and loss expenses, assumed premiums and allowance for expected credit losses on investments. Management believes these policies and estimates are the most critical to its operations and require the most difficult, subjective and complex judgments.\n    \nReserves for Losses and Loss Expenses\n.\n \nTo recognize liabilities for unpaid losses, either known or unknown, insurers establish reserves, which is a balance sheet account representing estimates of future amounts needed to pay claims and related expenses with respect to insured events which have occurred. Estimates and assumptions relating to reserves for losses and loss expenses are based on complex and subjective judgments, often including the interplay of specific uncertainties with related accounting and actuarial measurements. Such estimates are also susceptible to change as significant periods of time may elapse between the occurrence of an insured loss, the report of the loss to the insurer, the ultimate determination of the cost of the loss and the insurer’s payment of that loss.\n    In general, when a claim is reported, claims personnel establish a “case reserve” for the estimated amount of the ultimate payment based upon known information about the claim at that time. The estimate represents an informed judgment based on general reserving practices and reflects the experience and knowledge of the claims personnel regarding the nature and value of the specific type of claim. Reserves are also established on an aggregate basis to provide for losses incurred but not reported (“IBNR”) to the insurer, potential inadequacy of case reserves and the estimated expenses of settling claims, including legal and other fees and general expenses of administrating the claims adjustment process. Reserves are established based upon the then current legal interpretation of coverage provided.\n32\n \n    In examining reserve adequacy, several factors are considered in estimating the ultimate economic value of losses. These factors include, among other things, historical data, legal developments, changes in social attitudes and economic conditions, including the effects of inflation. The actuarial process relies on the basic assumption that past experience, adjusted judgmentally for the effects of current developments and anticipated trends, is an appropriate basis for predicting future outcomes. Reserve amounts are based on management’s informed estimates and judgments using currently available data. As additional experience and other data become available and are reviewed, these estimates and judgments may be revised. This may result in reserve increases or decreases that would be reflected in our results in periods in which such estimates and assumptions are changed.\n    Reserves do not represent an exact calculation of liability. Rather, reserves represent an estimate of what management expects the ultimate settlement and claim administration will cost. While the methods for establishing reserves are well tested over time, some of the major assumptions about anticipated loss emergence patterns are subject to uncertainty. These estimates, which generally involve actuarial projections, are based on management’s assessment of facts and circumstances then known, as well as estimates of trends in claims severity and frequency, judicial theories of liability and other factors, including the actions of third parties which are beyond the Company’s control. These variables are affected by external and internal events, such as inflation and economic volatility, judicial and litigation trends, reinsurance coverage, legislative changes and claim handling and reserving practices, which make it more difficult to accurately predict claim costs. The inherent uncertainties of estimating reserves are greater for certain types of liabilities where long periods of time elapse before a definitive determination of liability is made. Because setting reserves is inherently uncertain, the Company cannot provide assurance that its current reserves will prove adequate in light of subsequent events.\n    Loss reserves included in the Company’s financial statements represent management’s best estimates based upon an actuarially derived point estimate and other considerations. The Company uses a variety of actuarial techniques and methods to derive an actuarial point estimate for each operating unit. These methods include paid loss development, incurred loss development, paid and incurred Bornhuetter-Ferguson methods and frequency and severity methods. In circumstances where one actuarial method is considered more credible than the others, that method is used to set the point estimate. For example, the paid loss and incurred loss development methods rely on historical paid and incurred loss data. For new lines of business, where there is insufficient history of paid and incurred claims data, or in circumstances where there have been significant changes in claim practices, the paid and incurred loss development methods would be less credible than other actuarial methods. The actuarial point estimate may also be based on a judgmental weighting of estimates produced from each of the methods considered. Industry loss experience is used to supplement the Company’s own data in selecting “tail factors” and in areas where the Company’s own data is limited. The actuarial data is analyzed by line of business, coverage and accident or policy year, as appropriate, for each operating unit.\n    The establishment of the actuarially derived loss reserve point estimate also includes consideration of qualitative factors that may affect the ultimate losses. These qualitative considerations include, among others, the impact of re-underwriting initiatives, changes in the mix of business, changes in distribution sources and changes in policy terms and conditions. Examples of changes in terms and conditions that can have a significant impact on reserve levels are the use of aggregate policy limits, the expansion of coverage exclusions, whether or not defense costs are within policy limits, and changes in deductibles and attachment points.\n    The key assumptions used to arrive at the best estimate of loss reserves are the expected loss ratios, rate of loss cost inflation, and reported and paid loss emergence patterns. Expected loss ratios represent management’s expectation of losses at the time the business is written, before any actual claims experience has emerged. This expectation is a significant determinant of the estimate of loss reserves for recently written business where there is little paid or incurred loss data to consider. Expected loss ratios are generally derived from historical loss ratios adjusted for the impact of rate changes, loss cost trends and known changes in the type of risks underwritten. Expected loss ratios are estimated for each key line of business within each operating unit. Expected loss cost inflation is particularly important for the long-tail lines, such as excess casualty, and claims with a high medical component, such as workers’ compensation. Reported and paid loss emergence patterns are used to project current reported or paid loss amounts to their ultimate settlement value. Loss development factors are based on the historical emergence patterns of paid and incurred losses, and are derived from the Company’s own experience and industry data. The paid loss emergence pattern is also significant to excess and assumed workers’ compensation reserves because those reserves are discounted to their estimated present value based upon such estimated payout patterns. Management believes the estimates and assumptions it makes in the reserving process provide the best estimate of the ultimate cost of settling claims and related expenses with respect to insured events which have occurred; however, different assumptions and variables could lead to significantly different reserve estimates.\n33\n \n    Loss frequency and severity are measures of loss activity that are considered in determining the key assumptions described in our discussion of loss and loss expense reserves, including expected loss ratios, rate of loss cost inflation and reported and paid loss emergence patterns. Loss frequency is a measure of the number of claims per unit of insured exposure, and loss severity is a measure of the average size of claims. Factors affecting loss frequency include the effectiveness of loss controls and safety programs and changes in economic activity or weather patterns. Factors affecting loss severity include changes in policy limits, retentions, rate of inflation and judicial interpretations.\n    Another factor affecting estimates of loss frequency and severity is the loss reporting lag, which is the period of time between the occurrence of a loss and the date the loss is reported to the Company. The length of the loss reporting lag affects our ability to accurately predict loss frequency (loss frequencies are more predictable for lines with short reporting lags) as well as the amount of reserves needed for incurred but not reported losses (less IBNR is required for lines with short reporting lags). As a result, loss reserves for lines with short reporting lags are likely to have less variation from initial loss estimates. For lines with short reporting lags, which include commercial automobile, primary workers’ compensation, other liability (claims-made) and property business, the key assumption is the loss emergence pattern used to project ultimate loss estimates from known losses paid or reported to date. For lines of business with long reporting lags, which include other liability (occurrence), products liability, excess workers’ compensation and liability reinsurance, the key assumption is the expected loss ratio since there is often little paid or incurred loss data to consider. Historically, the Company has experienced less variation from its initial loss estimates for lines of business with short reporting lags than for lines of business with long reporting lags.\n    The key assumptions used in calculating the most recent estimate of the loss reserves are reviewed each quarter and adjusted, to the extent necessary, to reflect the latest reported loss data, current trends and other factors observed. If the actual level of loss frequency and severity are higher or lower than expected, the ultimate losses will be different than management’s estimate. The following table reflects the impact of changes (which could be favorable or unfavorable) in frequency and severity, relative to our assumptions, on our loss estimate for claims occurring in 2024:\n(In thousands)\nFrequency (+/-)\nSeverity (+/-)\n1%\n5%\n10%\n1%\n$\n142,388 \n$\n428,582 \n$\n786,324 \n5%\n428,582 \n726,110 \n1,098,020 \n10%\n786,324 \n1,098,020 \n1,487,640 \n    Our net reserves for losses and loss expenses of approximately $18.6 billion as of September 30, 2025 relate to multiple accident years. Therefore, the impact of changes in frequency or severity for more than one accident year could be higher or lower than the amounts reflected above. The impact of such changes would likely be manifested gradually over the course of many years, as the magnitude of the changes became evident.\n    Approximately $3.4 billion, or 18.4%, of the Company’s net loss reserves as of September 30, 2025 relate to the Reinsurance & Monoline Excess segment. There is a higher degree of uncertainty and greater variability regarding estimates of excess workers' compensation and assumed reinsurance loss reserves, which predominantly comprise these reserves. In the case of excess workers’ compensation, our policies generally attach at $1 million or higher. The claims which reach our layer therefore tend to involve the most serious injuries and many remain open for the lifetime of the claimant, which extends the claim settlement tail. These claims also occur less frequently but tend to be larger than primary claims, which increases claim variability. In the case of assumed reinsurance our loss reserve estimates are based, in part, upon information received from ceding companies. If information received from ceding companies is not timely or correct, the Company’s estimate of ultimate losses may not be accurate. Furthermore, due to delayed reporting of claim information by ceding companies, the claim settlement tail for assumed reinsurance is also extended. Management considers the impact of delayed reporting and the extended tail in its selection of loss development factors for these lines of business.\n    Information received from ceding companies is used to set initial expected loss ratios, to establish case reserves and to estimate reserves for incurred but not reported losses on assumed reinsurance business. This information, which is generally provided through reinsurance intermediaries, is gathered through the underwriting process and from periodic claim reports and other correspondence with ceding companies. The Company performs underwriting and claim audits of selected ceding companies to determine the accuracy and completeness of information provided to the Company. The information received from the ceding companies is supplemented by the Company’s own loss development experience with similar lines of business as well as industry loss trends and loss development benchmarks.\n34\n \n    Following is a summary of the Company’s reserves for losses and loss expenses by business segment:\n(In thousands)\nSeptember 30,\n2025\nDecember 31,\n2024\nInsurance\n$\n15,184,450 \n$\n13,881,574 \nReinsurance & Monoline Excess\n3,417,282 \n3,285,067 \nNet reserves for losses and loss expenses\n18,601,732 \n17,166,641 \nCeded reserves for losses and loss expenses\n3,155,303 \n3,201,389 \nGross reserves for losses and loss expenses\n$\n21,757,035 \n$\n20,368,030 \n    Following is a summary of the Company’s net reserves for losses and loss expenses by major line of business:\n(In thousands)\nReported Case\nReserves\nIncurred But\nNot Reported\nTotal\nSeptember 30, 2025\nOther liability\n$\n2,289,894 \n$\n5,542,391 \n$\n7,832,285 \n     Professional liability \n657,688 \n1,745,596 \n2,403,284 \nWorkers’ compensation (1)\n1,107,966 \n982,111 \n2,090,077 \nAuto\n797,501 \n971,302 \n1,768,803 \nShort-tail lines (2)\n420,866 \n669,135 \n1,090,001 \nTotal Insurance\n5,273,915 \n9,910,535 \n15,184,450 \nReinsurance & Monoline Excess (1) (3)\n1,664,310 \n1,752,972 \n3,417,282 \nTotal\n$\n6,938,225 \n$\n11,663,507 \n$\n18,601,732 \nDecember 31, 2024\nOther liability\n$\n2,104,721 \n$\n5,164,994 \n$\n7,269,715 \n     Professional liability\n613,230 \n1,503,908 \n2,117,138 \nWorkers’ compensation (1)\n1,054,427 \n771,367 \n1,825,794 \nAuto\n729,462 \n936,319 \n1,665,781 \nShort-tail lines (2)\n410,138 \n593,008 \n1,003,146 \nTotal Insurance\n4,911,978 \n8,969,596 \n13,881,574 \nReinsurance & Monoline Excess (1) (3)\n1,622,399 \n1,662,668 \n3,285,067 \nTotal\n$\n6,534,377 \n$\n10,632,264 \n$\n17,166,641 \n___________\n(1) Reserves for workers’ compensation and Reinsurance & Monoline Excess are net of an aggregate net discount of $417 million and $405 million as of September 30, 2025 and December 31, 2024, respectively.\n(2) Short-tail lines include commercial multi-peril (non-liability), inland marine, accident and health, fidelity and surety, boiler and machinery, high net worth homeowners and other lines.\n(3) Reinsurance & Monoline Excess includes property and casualty reinsurance, as well as operations that solely retain risk on an excess basis and certain program management business. \n    The Company evaluates reserves for losses and loss adjustment expenses on a quarterly basis. Changes in estimates of prior year losses are reported when such changes are made. The changes in prior year loss reserve estimates are generally the result of ongoing analysis of recent loss development trends. Original estimates are increased or decreased as additional information becomes known regarding individual claims and aggregate claim trends.\n    Certain of the Company's insurance and reinsurance contracts are retrospectively rated, whereby the Company collects more or less premiums based on the level of loss activity. For those contracts, changes in loss and loss adjustment expenses for prior years may be fully or partially offset by additional or return premiums.\n    Net prior year development (i.e., the sum of prior year reserve changes and prior year earned premiums changes) for the nine months ended September 30, 2025 and 2024 are as follows:\n35\n \n(In thousands)\n2025\n2024\nIncrease in prior year loss reserves\n$\n(23,129)\n$\n(15,279)\nIncrease in prior year earned premiums\n25,483 \n18,126 \nNet favorable prior year development\n$\n2,354 \n$\n2,847 \nDuring the nine months ended September 30, 2025, favorable prior year development (net of additional and return premiums) of $2 million included $34 million of favorable prior year development for the Reinsurance & Monoline Excess segment largely offset by $32 million of adverse prior year development for the Insurance segment.\nFor the Insurance segment, the adverse development during the first nine months of 2025 was driven by other liability and auto liability, and was partially offset by favorable development for short tail lines of business, including commercial property and commercial auto physical damage. The adverse other liability development was driven mainly by umbrella and excess liability claims, and to a lesser degree, adverse development from primary surplus lines casualty business. The umbrella and excess liability development included a significant component stemming from underlying auto exposures. The other liability development was concentrated in accident years 2017 through 2022. The adverse auto liability development was concentrated in accident years 2021 and 2022. The Company believes that auto-related claims are being particularly impacted by social inflation, which is contributing to an increase in the frequency of large losses beyond expectations. Social inflation can include higher settlement demands from plaintiffs, use of tactics such as litigation funding by the plaintiffs’ bar, negative public sentiment towards large businesses and corporations, and erosion of tort reforms, among other factors.  \nThe favorable development for short tail property lines of business during the first nine months of 2025 related to the 2024 accident year, and resulted from favorable settlements of both catastrophe and non-catastrophe claims below our expectations.\nFor the Reinsurance & Monoline Excess segment, the favorable development during the first nine months of 2025 was driven mainly by favorable development in property reinsurance. Similar to the Insurance segment, the favorable property reinsurance development was driven by favorable claim settlements, below our expectations, related mainly to the 2024 accident year.  \nDuring the nine months ended September 30, 2024, favorable prior year development (net of additional and return premiums) of $3 million included $5 million of favorable prior year development for the Reinsurance & Monoline Excess segment partially offset by $2 million of adverse prior year development for the Insurance segment. \nFor the Insurance segment, the adverse development during the first nine months of 2024 was driven by commercial auto liability and other liability (mainly umbrella and excess liability), which was largely offset by favorable development for workers’ compensation and professional liability. The adverse commercial auto liability development was concentrated in accident years 2020 through 2023. The other liability development was mainly driven by umbrella and excess liability claims, and was focused in accident years 2017 through 2021. A significant portion of the umbrella and excess liability development related to underlying commercial auto exposures. The Company believes that commercial auto-related claims were particularly impacted by social inflation, which contributed to an increase in the frequency of large losses beyond expectations. Social inflation can include higher settlement demands from plaintiffs, use of aggressive actions by the plaintiffs’ bar such as litigation funding, negative public sentiment towards large businesses and corporations, and erosion of tort reforms, among other factors.\nThe favorable workers’ compensation development for the Insurance segment was mainly related to accident years 2017 through 2023, while the favorable professional liability development was mainly in accident years 2020 through 2022. For workers' compensation, favorable reported claim frequency, below expectations, continued to be the main driver of the favorable reserve development. For professional liability, reported loss experience for accident years 2020 through 2022 was better than expected, which drove the favorable reserve development. These accident years also feature business written at peak pricing levels, which the Company believes will result in higher profitability than initially anticipated.\nFor the Reinsurance & Monoline Excess segment, the favorable development during the first nine months of 2024 was driven mainly by favorable development in excess workers’ compensation, partially offset by adverse development in the non-proportional reinsurance assumed liability line of business. The favorable excess workers’ compensation development was driven by continued lower claim frequency and reported losses relative to expectations and to favorable claim settlements spread across many prior accident years. The unfavorable development for non-proportional reinsurance was concentrated mainly in accident years 2015 through 2019 and was associated primarily with our U.S. and U.K. excess general liability reinsurance businesses, including coverage for cedants insuring construction projects.\nReserve Discount\n. The Company discounts its liabilities for certain workers’ compensation reserves. The amount of workers’ compensation reserves that were discounted was $1,394 million and $1,358 million at September 30, 2025 and December 31, 2024, respectively. The aggregate net discount for those reserves, after reflecting the effects of ceded \n36\n \nreinsurance, was $417 million and $405 million at September 30, 2025 and December 31, 2024, respectively. At September 30, 2025, discount rates by year ranged from 0.7% to 6.5%, with a weighted average discount rate of 3.6%.\n    Substantially all of the workers’ compensation discount (97% of total discounted reserves at September 30, 2025) relates to excess workers’ compensation reserves. In order to properly match loss expenses with income earned on investment securities supporting the liabilities, reserves for excess workers’ compensation business are discounted using risk-free discount rates determined by reference to the U.S. Treasury yield curve. These rates are determined annually based on the weighted average rate for the period. Once established, no adjustments are made to the discount rate for that period, and any increases or decreases in loss reserves in subsequent years are discounted at the same rate, without regard to when any such adjustments are recognized. The expected loss and loss expense payout patterns subject to discounting are derived from the Company’s loss payout experience. \n    The Company also discounts reserves for certain other long-duration workers’ compensation reserves (representing approximately 3% of total discounted reserves at September 30, 2025), including reserves for quota share reinsurance and reserves related to losses regarding occupational lung disease. These reserves are discounted at statutory rates permitted by the Department of Insurance of the State of Delaware.\n    \nAssumed Reinsurance Premiums\n. The Company estimates the amount of assumed reinsurance premiums that it will receive under treaty reinsurance agreements at the inception of the contracts. These premium estimates are revised as the actual amount of assumed premiums is reported to the Company by the ceding companies. As estimates of assumed premiums are made or revised, the related amount of earned premiums, commissions and incurred losses associated with those premiums are recorded. Estimated assumed premiums receivable were approximately $58 million at September 30, 2025 and $51 million at December 31, 2024. The assumed premium estimates are based upon terms set forth in reinsurance agreements, information received from ceding companies during the underwriting and negotiation of agreements, reports received from ceding companies and discussions and correspondence with reinsurance intermediaries. The Company also considers its own view of market conditions, economic trends and experience with similar lines of business. These premium estimates represent management’s best estimate of the ultimate amount of premiums to be received under its assumed reinsurance agreements.\n    \nAllowance for Expected Credit Losses on Investments\n. \n    \nFixed Maturity Securities\n – For fixed maturity securities in an unrealized loss position where the Company intends to sell, or it is more likely than not that it will be required to sell the security before recovery in value, the amortized cost basis is written down to fair value through net investment gains (losses). For fixed maturity securities in an unrealized loss position where the Company does not intend to sell, or it is more likely than not that it will not be required to sell the security before recovery in value, the Company evaluates whether the decline in fair value has resulted from credit losses or all other factors (non-credit factors). In making this assessment, the Company considers the extent to which fair value is less than amortized cost, changes to the rating of the security by a rating agency, and adverse conditions specifically related to the security, among other factors. If this assessment indicates that a credit loss exists, the present value of cash flows expected to be collected from the security are compared to the amortized cost basis of the security. If the present value of cash flows expected to be collected is less than the amortized cost basis, an allowance for expected credit losses is recorded for the credit loss through net investment gains (losses), limited by the amount that the fair value is less than the amortized cost basis. The allowance is adjusted for any change in expected credit losses and subsequent recoveries through net investment gains (losses). The impairment related to non-credit factors is recognized in other comprehensive income (loss).\n    The Company’s credit assessment of allowance for expected credit losses uses a third party model for available for sale and held to maturity securities, as well as loans receivable. The allowance for expected credit losses is generally based on the performance of the underlying collateral under various economic and default scenarios that involve subjective judgments and estimates by management. Modeling these securities involves various factors, such as projected default rates, the nature and realizable value of the collateral, if any, the ability of the issuer to make scheduled payments, historical performance and other relevant economic and performance factors. A discounted cash flow analysis is used to ascertain the amount of the allowance for expected credit losses, if any. In general, the model reverts to the rating-level long-term average marginal default rates based on 10 years of historical data, beyond the forecast period. For other inputs, the model in most cases reverts to the baseline long-term assumptions linearly over 5 years beyond the forecast period. The long-term assumptions are based on the historical averages. \n    The Company classifies its fixed maturity securities by credit rating, primarily based on ratings assigned by credit rating agencies. For purposes of classifying securities with different ratings, the Company uses the average of the credit ratings assigned, unless in limited situations the Company’s own analysis indicates an internal rating is more appropriate. Securities that are not rated by a rating agency are evaluated and classified by the Company on a case-by-case basis.\n37\n \n    A summary of the Company’s non-investment grade fixed maturity securities that were in an unrealized loss position at September 30, 2025 is presented in the table below: \n($ in thousands)\nNumber of\nSecurities\nAggregate\nFair Value\n Gross       Unrealized      Loss\nForeign government\n75 \n$\n189,418 \n$\n194,357 \nCorporate\n28 \n51,508 \n1,533 \nState and municipal\n6 \n28,795 \n1,256 \nMortgage-backed\n15 \n2,404 \n191 \nAsset-backed\n1 \n2 \n1 \nTotal\n125 \n$\n272,127 \n$\n197,338 \n    As of September 30, 2025, the Company recorded an allowance for expected credit losses on fixed maturity securities of $0.3 million. The Company has evaluated the remaining fixed maturity securities in an unrealized loss position and believes the unrealized losses are due primarily to temporary market and sector-related factors rather than to issuer-specific factors. None of these securities are delinquent or in default under financial covenants. Based on its assessment of these issuers, the Company expects them to continue to meet their contractual payment obligations as they become due. \nLoans Receivable\n – For loans receivable, the Company estimates an allowance for expected credit losses based on relevant information about past events, including historical loss experience, current conditions and forecasts that affect the expected collectability of the amortized cost of the financial asset. The allowance for expected credit losses is presented as a reduction to amortized cost of the financial asset in the consolidated balance sheet and changes to the estimate for expected credit losses are recognized through net investment gains (losses). Loans receivable are reported net of an allowance for expected credit losses of $0.3 million and $1 million as of September 30, 2025 and December 31, 2024, respectively.\n    \nFair Value Measurements\n. The Company’s fixed maturity available for sale securities, equity securities, and its arbitrage trading account securities are carried at fair value. Fair value is defined as “the price that would be received to sell an asset or paid to transfer a liability in an orderly transaction between market participants at the measurement date.” The Company utilizes a fair value hierarchy that prioritizes the inputs to valuation techniques used to measure fair value into three broad levels. Level 1 inputs are quoted prices (unadjusted) in active markets for identical assets or liabilities that the reporting entity has the ability to access at the measurement date. Level 2 inputs are inputs other than quoted prices included within Level 1 that are observable for similar assets in active markets. Level 3 inputs are unobservable inputs for the asset or liability. Unobservable inputs may only be used to measure fair value to the extent that observable inputs are not available. The fair value of the vast majority of the Company’s portfolio is based on observable data (other than quoted prices) and, accordingly, is classified as Level 2.\n    In classifying particular financial securities in the fair value hierarchy, the Company uses its judgment to determine whether the market for a security is active and whether significant pricing inputs are observable. The Company determines the existence of an active market by assessing whether transactions occur with sufficient frequency and volume to provide reliable pricing information. The Company determines whether inputs are observable based on the use of such information by pricing services and external investment managers, the uninterrupted availability of such inputs, the need to make significant adjustments to such inputs and the volatility of such inputs over time. If the market for a security is determined to be inactive or if significant inputs used to price a security are determined to be unobservable, the security is categorized in Level 3 of the fair value hierarchy.\n    Because many fixed maturity securities do not trade on a daily basis, the Company utilizes pricing models and processes which may include benchmark curves, benchmarking of like securities, sector groupings and matrix pricing. Market inputs used to evaluate securities include benchmark yields, reported trades, broker/dealer quotes, issuer spreads, two-sided markets, benchmark securities, bids, offers and reference data. Quoted prices are often unavailable for recently issued securities that are infrequently traded or securities that are only traded in private transactions. For publicly traded securities for which quoted prices are unavailable, the Company determines fair value based on independent broker quotations and other observable market data. For securities traded only in private negotiations, the Company determines fair value based primarily on the cost of such securities, which is adjusted to reflect prices of recent placements of securities of the same issuer, financial data, projections and business developments of the issuer and other relevant information.\n    The following is a summary of pricing sources for the Company's fixed maturity securities available for sale as of September 30, 2025: \n38\n \n($ in thousands)\nCarrying\nValue\nPercent\nof Total\nPricing source:\nIndependent pricing services\n$\n24,173,879 \n97.0 \n%\nSyndicate manager\n133,033 \n0.5 \nDirectly by the Company based on:\nObservable data\n590,698 \n2.4 \nCash flow model\n20,019 \n0.1 \nTotal\n$\n24,917,629 \n100.0 \n%\n    \nIndependent pricing services\n – Substantially all of the Company’s fixed maturity securities available for sale were priced by independent pricing services (generally one U.S. pricing service plus additional pricing services with respect to a limited number of foreign securities held by the Company). The prices provided by the independent pricing services are generally based on observable market data in active markets (e.g., broker quotes and prices observed for comparable securities). The determination of whether markets are active or inactive is based upon the volume and level of activity for a particular asset class. The Company reviews the prices provided by pricing services for reasonableness based upon current trading levels for similar securities. If the prices appear unusual to the Company, they are re-examined and the value is either confirmed or revised. In addition, the Company periodically performs independent price tests of a sample of securities to ensure proper valuation and to verify our understanding of how securities are priced. Based upon the Company’s review of the methodologies used by the independent pricing services, these securities were classified as Level 2.\n    \nSyndicate manager\n – The Company has a 15% participation in a Lloyd’s syndicate, and the Company’s share of the securities owned by the syndicate is priced by the syndicate’s manager. The majority of the securities are liquid, short duration fixed maturity securities. The Company reviews the syndicate manager’s pricing methodology and audited financial statements and holds discussions with the syndicate manager as necessary to confirm its understanding and agreement with security prices. Based upon the Company’s review of the methodologies used by the syndicate manager, these securities were classified as Level 2.\n    \nObservable data\n – If independent pricing is not available, the Company prices the securities directly. Prices are based on observable market data where available, including current trading levels for similar securities and non-binding quotations from brokers. The Company generally requests two or more quotes. If more than one quote is received, the Company sets a price within the range of quotes received based on its assessment of the credibility of the quote and its own evaluation of the security. The Company generally does not adjust quotes obtained from brokers. Since these securities were priced based on observable data, they were classified as Level 2.\n    \nCash flow model\n – If the above methodologies are not available, the Company prices securities using a discounted cash flow model based upon assumptions as to prevailing credit spreads, interest rates and interest rate volatility, time to maturity and subordination levels. Discount rates are adjusted to reflect illiquidity where appropriate. These securities were classified as Level 3.\n39\n \nResults of Operations for the Nine Months Ended September 30, 2025 and 2024  \nBusiness Segment Results\nFollowing is a summary of gross and net premiums written, net premiums earned, loss ratios (losses and loss expenses incurred expressed as a percentage of net premiums earned), expense ratios (underwriting expenses expressed as a percentage of net premiums earned) and GAAP combined ratios (sum of loss ratio and expense ratio) for each of our business segments for the nine months ended September 30, 2025 and 2024. The GAAP combined ratio represents a measure of underwriting profitability, excluding investment income. A GAAP combined ratio in excess of 100 indicates an underwriting loss; a number below 100 indicates an underwriting profit. \n($ in thousands)\n2025\n2024\nInsurance:\nGross premiums written\n$\n10,216,863 \n$\n9,501,027 \nNet premiums written\n8,517,901 \n7,929,439 \nNet premiums earned\n8,144,300 \n7,447,828 \nLoss ratio\n63.9 \n%\n63.0 \n%\nExpense ratio\n28.1 \n%\n28.4 \n%\nGAAP combined ratio\n92.0 \n%\n91.4 \n%\nReinsurance & Monoline Excess:\nGross premiums written\n$\n1,281,101 \n$\n1,212,779 \nNet premiums written\n1,193,771 \n1,105,907 \nNet premiums earned\n1,122,648 \n1,089,757 \nLoss ratio\n55.5 \n%\n53.2 \n%\nExpense ratio\n29.1 \n%\n29.5 \n%\nGAAP combined ratio\n84.6 \n%\n82.7 \n%\nConsolidated:\nGross premiums written\n$\n11,497,964 \n$\n10,713,806 \nNet premiums written\n9,711,672 \n9,035,346 \nNet premiums earned\n9,266,948 \n8,537,585 \nLoss ratio\n62.9 \n%\n61.7 \n%\nExpense ratio\n28.2 \n%\n28.6 \n%\nGAAP combined ratio\n91.1 \n%\n90.3 \n%\n    \nNet Income to Common Stockholders\n. The following table presents the Company’s net income to common stockholders and net income per diluted share for the nine months ended September 30, 2025 and 2024:\n(In thousands, except per share data)\n2025\n2024\nNet income to common stockholders\n$\n1,329,892 \n$\n1,180,014 \nWeighted average diluted shares\n400,306 \n404,053 \nNet income per diluted share\n$\n3.32 \n$\n2.92 \n    The Company reported net income to common stockholders of $1,330 million in 2025 compared to $1,180 million in 2024. The $150 million increase in net income was primarily due to an after-tax increase in net investment gains of $130 million mainly due to change in unrealized gains on equity securities, an after-tax increase of $59 million in net investment income primarily due to income from transportation and financial services funds, a $17 million reduction in tax expense due to a change in the effective tax rate, an after-tax increase of $6 million in profit from insurance service businesses and an after-tax increase in profits from non-insurance businesses of $3 million, partially offset by an after-tax increase in foreign currency losses of $48 million due to the weakening U.S. dollar against other major currencies in 2025, an after-tax increase in corporate expenses of $10 million, an after-tax decrease in underwriting income of $6 million and an after-tax decrease in income of $1 million related to minority interest. The number of weighted average diluted shares decreased 3.7 million for 2025 compared to 2024, mainly reflecting shares repurchased in 2025 and 2024.\n    \nPremiums\n. Gross premiums written were $11,498 million in 2025, an increase of 7% from $10,714 million in 2024. The increase was due to a $716 million increase in the Insurance segment and a $68 million increase in the Reinsurance & Monoline Excess segment. Approximately 80.3% of premiums expiring in 2025 were renewed, and 80.9% of premiums expiring in 2024 were renewed.\n40\n \n    Average renewal premium rates (per unit of exposure) for insurance and facultative reinsurance increased 6.8% in 2025 and increased 7.8% excluding workers' compensation.\n    A summary of gross premiums written in 2025 compared with 2024 by line of business within each business segment follows:\n•\nInsurance\n - gross premiums increased 8% to $10,217 million in 2025 from $9,501 million in 2024. Gross premiums increased $303 million (12%) for short-tail lines, $233 million (6%) for other liability, $95 million (8%) for auto, $74 million (8%) for workers' compensation, and $11 million (1%) for professional liability.\n•\nReinsurance & Monoline Excess\n - gross premiums increased 6% to $1,281 million in 2025 from $1,213 million in 2024. Gross premiums increased $53 million (15%) for property and $23 million (9%) for monoline excess, partially offset by a decrease of $8 million (1%) for casualty.\n    Net premiums written were $9,712 million in 2025, an increase of 7% from $9,035 million in 2024. Ceded reinsurance premiums as a percentage of gross written premiums was 15.5% and 15.7% in 2025 and 2024, respectively.\n    Premiums earned increased 9% to $9,267 million in 2025 from $8,538 million in 2024. Insurance premiums (including the impact of rate changes) are generally earned evenly over the policy term, and accordingly, recent rate increases will be earned over the upcoming quarters. Premiums earned in 2025 are related to business written during both 2025 and 2024. Audit premiums were $248 million in 2025 compared with $270 million in 2024.\n    \nNet Investment Income\n. Following is a summary of net investment income for the nine months ended September 30, 2025 and 2024:\nAmount\nAverage Annualized\nYield\n($ in thousands)\n2025\n2024\n2025\n2024\nFixed maturity securities, including cash and cash equivalents and loans receivable\n$\n960,625 \n$\n954,655 \n4.8 \n%\n5.4 \n%\nInvestment funds\n59,713 \n868 \n5.4 \n0.1 \nArbitrage trading account\n56,309 \n52,562 \n6.6 \n5.8 \nEquity securities\n34,623 \n35,924 \n5.0 \n4.9 \nReal estate\n(11,482)\n(20,579)\n(1.2)\n(2.2)\nGross investment income\n1,099,788 \n1,023,430 \n4.7 \n4.8 \nInvestment expenses\n(8,955)\n(7,707)\n— \n— \nTotal\n$\n1,090,833 \n$\n1,015,723 \n4.7 \n%\n4.7 \n%\n    Net investment income increased 7% to $1,091 million in 2025 from $1,016 million in 2024 due primarily to a $59 million increase in income from investment funds primarily due to transportation funds and financial services funds, a $9 million improvement in real estate, a $6 million increase in income from fixed maturity securities, and a $3 million increase in arbitrage trading account, partially offset by a $1 million decrease in equity securities and a $1 million increase in investment expenses. Investment funds are reported on a one quarter lag. The average annualized yield for fixed maturity securities was 4.8% in 2025 and 5.4% in 2024. The average annualized yield for fixed maturity securities excluding Argentine inflation-linked securities was 4.7% in 2025 and 4.4% in 2024. The effective duration of the fixed maturity portfolio was 2.9 years at September 30, 2025 up from 2.6 years at December 31, 2024. Average invested assets, at cost (including cash and cash equivalents), were $31.3 billion in 2025, up 9% from $28.6 billion in 2024.\n    \nInsurance Service Fees\n. The Company earns fees from an insurance distribution business, a third-party administrator and as a servicing carrier of workers' compensation assigned risk plans for certain states. Insurance service fees increased to $93 million in 2025 from $82 million in 2024, mainly due to organic growth within the business. \n    \nNet Realized and Unrealized Gains (Losses) on Investments\n. The Company buys and sells securities and other investment assets on a regular basis in order to maximize its total return on investments. Decisions to sell securities and other investment assets are based on management’s view of the underlying fundamentals of specific investments as well as management’s expectations regarding interest rates, credit spreads, currency values and general economic conditions. Net realized and unrealized gains on investments were $125 million in 2025 compared with losses of $72 million in 2024. The gains of $125 million in 2025 reflected an increase in unrealized gains on equity securities of $93 million and net realized gains on investments of $32 million. The losses of $72 million in 2024 reflected an increase in unrealized losses on equity securities of $42 million and net realized losses on investments of $30 million.\n41\n \nChange in Allowance for Expected Credit Losses on Investments\n. Based on credit factors, the allowance for expected credit losses is increased or decreased depending on the percentage of unrealized loss relative to amortized cost by security, changes in rating of the security by a rating agency, and adverse conditions specifically related to the security, among other factors. The pre-tax change in allowance for expected credit losses on investments, which are reflected in net investment gains (losses), decreased by $1 million ($1 million after-tax) in 2025 reflecting improved pricing related to fixed maturity securities and the redemption of one loan in the loan receivable portfolio, and $31 million ($24 million after-tax) in 2024 due to improved pricing associated with foreign government securities and corporate securities.\nRevenues from Non-Insurance Businesses\n. Revenues from non-insurance businesses were derived from businesses engaged in the distribution of promotional merchandise, world-wide textile solutions and aviation-related businesses that provide services to aviation markets, including (i) the distribution, manufacturing, repair and overhaul of aircraft parts and components, (ii) the sale of new and used aircraft, and (iii) avionics, fuel, maintenance, storage and charter services. Revenues from non-insurance businesses were $408 million in 2025 and $375 million in 2024. The increase mainly relates to aviation-related business, partially offset by the reduction in promotional merchandise business. \n    \nLosses and Loss Expenses\n. Losses and loss expenses increased to $5,825 million in 2025 from $5,270 million in 2024. The consolidated loss ratio was 62.9% in 2025 and 61.7% in 2024. Catastrophe losses, net of reinsurance recoveries, were $289 million in 2025 with the largest contributors being California wildfire losses and frequency of severe storms, up from $218 million in 2024. Favorable prior year reserve development (net of premium offsets) was $2 million in 2025 and $3 million 2024. The loss ratio excluding catastrophe losses and prior year reserve development increased 0.6 points to 59.8% in 2025 from 59.2% in 2024, largely due to a change in business mix.\n    A summary of loss ratios in 2025 compared with 2024 by business segment follows:\n•\nInsurance\n - The loss ratio was 63.9% in 2025 and 63.0% in 2024. Catastrophe losses were $218 million in 2025 compared with $191 million in 2024. Adverse prior year reserve development was $32 million in 2025 and $2 million in 2024. The loss ratio excluding catastrophe losses and prior year reserve development increased 0.4 points to 60.8% in 2025 from 60.4% in 2024.\n•\nReinsurance & Monoline Excess\n - The loss ratio was 55.5% in 2025 and 53.2% in 2024. Catastrophe losses were $71 million in 2025 and $27 million in 2024. Favorable prior year reserve development was $34 million in 2025 and $5 million in 2024. The loss ratio excluding catastrophe losses and prior year reserve development increased 1.0 points to 52.2% in 2025 from 51.2% in 2024.\nOther Operating Costs and Expenses\n. Following is a summary of other operating costs and expenses for the nine months ended September 30, 2025 and 2024:\n($ in thousands)\n2025\n2024\nPolicy acquisition and insurance operating expenses\n$\n2,620,657 \n$\n2,438,905 \nInsurance service expenses\n70,245 \n66,309 \nNet foreign currency losses\n62,765 \n1,324 \nOther costs and expenses\n210,883 \n198,352 \nTotal\n$\n2,964,550 \n$\n2,704,890 \n    Policy acquisition and insurance operating expenses are comprised of commissions paid to agents and brokers, premium taxes and other assessments and internal underwriting costs. Policy acquisition and insurance operating expenses increased 7% and net premiums earned increased 9% from 2024. The expense ratio (underwriting expenses expressed as a percentage of net premiums earned) decreased 0.4 points to 28.2% in 2025 from 28.6% in 2024, mainly due to growth in net premiums earned and a non-recurring benefit associated with compensation costs. \n    Insurance service expenses, which represent the costs associated with the fee-based businesses, were $70 million in 2025 and $66 million in 2024. \n    Net foreign currency losses (gains) result from transactions denominated in a currency other than a company's operating functional currency. Net foreign currency losses were $63 million in 2025 compared to losses of $1 million in 2024, primarily due to other major currencies strengthening against the U.S. dollar in 2025.\n    Other costs and expenses represent general and administrative expenses of the parent company and other expenses not allocated to business segments, including the cost of certain long-term incentive plans and new business ventures. Other costs \n42\n \nand expenses increased to $211 million in 2025 from $198 million in 2024, primarily due to the increase in compensation-related costs and higher new start-up operating unit expenses in 2025. \n    \nExpenses from Non-Insurance Businesses\n. Expenses from non-insurance businesses represent costs associated with businesses engaged in the distribution of promotional merchandise, world-wide textile solutions and aviation-related businesses that include (i) cost of goods sold related to aircraft and products sold and services provided, and (ii) general and administrative expenses. Expenses from non-insurance businesses were $393 million in 2025 compared to $365 million in 2024. The increase mainly relates to aviation-related business, partially offset by the reduction in promotional merchandise. \nInterest Expense\n. Interest expense was $95 million in both 2025 and 2024. \nIncome Taxes.\n The effective income tax rate was 22.2% and 23.2% for the nine months ended September 30, 2025 and 2024, respectively. The lower effective income tax rate for the nine months ended September 30, 2025, as compared to the earlier period, was primarily due to an improved geographical mix of earnings and larger benefits attributable to equity-based compensation. \n    The Company has not provided U.S. deferred income taxes on the undistributed earnings of approximately $555 million of its non-U.S. subsidiaries, since these earnings are intended to be permanently reinvested in the non-U.S. subsidiaries. In the future, if such earnings were distributed, the Company projects that the incremental tax, if any, will not be material.\nAs part of the Inflation Reduction Act of 2022, a 1% excise tax is imposed on common share repurchases, net of common share issuances, and included in the cost of treasury stock acquired. During the nine months ended September 30, 2025, the Company repurchased 1,200,000 shares of its common stock. \nIn the United States, on July 4, 2025, the budget reconciliation package known as the “One Big Beautiful Bill” was signed into law. Changes resulting from the tax provisions thereunder are not expected to have a material impact on the Company’s results from operations.\n43\n \nResults of Operations for the Three Months Ended September 30, 2025 and 2024  \nBusiness Segment Results\nFollowing is a summary of gross and net premiums written, net premiums earned, loss ratios (losses and loss expenses incurred expressed as a percentage of net premiums earned), expense ratios (underwriting expenses expressed as a percentage of net premiums earned) and GAAP combined ratios (sum of loss ratio and expense ratio) for each of our business segments for the three months ended September 30, 2025 and 2024. The GAAP combined ratio represents a measure of underwriting profitability, excluding investment income. A GAAP combined ratio in excess of 100 indicates an underwriting loss; a number below 100 indicates an underwriting profit. \n($ in thousands)\n2025\n2024\nInsurance:\nGross premiums written\n$\n3,393,023 \n$\n3,219,128 \nNet premiums written\n2,809,743 \n2,673,275 \nNet premiums earned\n2,773,009 \n2,564,490 \nLoss ratio\n63.9 \n%\n63.1 \n%\nExpense ratio\n28.4 \n%\n28.4 \n%\nGAAP combined ratio\n92.3 \n%\n91.5 \n%\nReinsurance & Monoline Excess:\nGross premiums written\n$\n443,233 \n$\n414,150 \nNet premiums written\n417,187 \n384,001 \nNet premiums earned\n383,373 \n362,333 \nLoss ratio\n51.3 \n%\n57.0 \n%\nExpense ratio\n29.8 \n%\n29.7 \n%\nGAAP combined ratio\n81.1 \n%\n86.7 \n%\nConsolidated:\nGross premiums written\n$\n3,836,256 \n$\n3,633,278 \nNet premiums written\n3,226,930 \n3,057,276 \nNet premiums earned\n3,156,382 \n2,926,823 \nLoss ratio\n62.4 \n%\n62.4 \n%\nExpense ratio\n28.5 \n%\n28.5 \n%\nGAAP combined ratio\n90.9 \n%\n90.9 \n%\n    \nNet Income to Common Stockholders\n. The following table presents the Company’s net income to common stockholders and net income per diluted share for the three months ended September 30, 2025 and 2024:\n(In thousands, except per share data)\n2025\n2024\nNet income to common stockholders\n$\n511,032 \n$\n365,634 \nWeighted average diluted shares\n400,204 \n401,817 \nNet income per diluted share\n$\n1.28 \n$\n0.91 \n    The Company reported net income to common stockholders of $511 million in 2025, an increase of 40% from $366 million in 2024. The $145 million increase in net income was primarily due to an after-tax increase in net investment gains of $69 million, mainly due to the realized gains from sale of equity securities, an after-tax decrease in foreign currency losses of $29 million, due to the weakening U.S. dollar against other major currencies in 2024, an after-tax increase of $22 million in net investment income due to fixed maturity securities driven by elevated interest rates and a larger portfolio, an after-tax increase in underwriting income of $17 million, a $9 million reduction in tax expense due to a change in the effective tax rate, and an after-tax increase in profits from non-insurance businesses of $2 million, partially offset by an after-tax increase in corporate expenses of $2 million and an after-tax decrease in minority interest of $1 million. The number of weighted average diluted shares decreased 1.6 million for 2025 compared to 2024, mainly reflecting shares repurchased in 2025 and 2024.\n    \nPremiums\n. Gross premiums written were $3,836 million in 2025, an increase of 6% from $3,633 million in 2024. The increase was due to a $174 million increase in the Insurance segment and a $29 million increase in the Reinsurance & Monoline Excess segment. Approximately 79.6% of premiums expiring in 2025 and 81.1% of premiums expiring in 2024 were renewed.\n44\n \n    Average renewal premium rates (per unit of exposure) for insurance and facultative reinsurance increased 6.6% in 2025 and increased 7.6% excluding workers' compensation.\n    A summary of gross premiums written in 2025 compared with 2024 by line of business within each business segment follows:\n•\nInsurance\n - gross premiums increased 5% to $3,393 million in 2025 from $3,219 million in 2024. Gross premiums increased $103 million (12%) for short-tail lines, $39 million (3%) for other liability, $27 million (9%) for workers' compensation and $7 million (2%) for auto, partially offset by decrease of $2 million (less than 1%) for professional liability.\n•\nReinsurance & Monoline Excess\n - gross premiums increased 7% to $443 million in 2025 from $414 million in 2024. Gross premiums increased $16 million (16%) for monoline excess, $10 million (8%) for property, and $3 million (2%) for casualty.\n    Net premiums written were $3,227 million in 2025, an increase of 6% from $3,057 million in 2024. Ceded reinsurance premiums as a percentage of gross written premiums was 15.9% in both 2025 and 2024.\n    Premiums earned increased 8% to $3,156 million in 2025 from $2,927 million in 2024. Insurance premiums (including the impact of rate changes) are generally earned evenly over the policy term, and accordingly, recent rate increases will be earned over the upcoming quarters. Premiums earned in 2025 are related to business written during both 2025 and 2024. Audit premiums were $80 million in 2025 compared with $86 million in 2024.\n    \nNet Investment Income\n. Following is a summary of net investment income for the three months ended September 30, 2025 and 2024:\nAmount\nAverage Annualized\nYield\n($ in thousands)\n2025\n2024\n2025\n2024\nFixed maturity securities, including cash and cash equivalents and loans receivable\n$\n324,319 \n$\n295,272 \n4.8 \n%\n4.9 \n%\nArbitrage trading account\n16,309 \n17,869 \n5.7 \n6.0 \nEquity securities\n11,497 \n12,203 \n4.7 \n5.1 \nInvestment funds\n5,421 \n4,741 \n1.5 \n1.2 \nReal estate\n(3,373)\n(3,711)\n(1.0)\n(1.2)\nGross investment income\n354,173 \n326,374 \n4.4 \n4.4 \nInvestment expenses\n(2,935)\n(2,618)\n— \n— \nTotal\n$\n351,238 \n$\n323,756 \n4.4 \n%\n4.4 \n%\n    Net investment income increased to $351 million in 2025 from $324 million in 2024 due primarily to a $29 million increase in income from fixed maturity securities, mainly driven by elevated interest rates and a larger fixed maturity securities portfolio, and a $1 million increase in income from investment funds, partially offset by a $2 million decrease in the arbitrage trading account and a $1 million decrease in equity securities. Investment funds are reported on a one quarter lag. The average annualized yield for fixed maturity securities was 4.8% in 2025 and 4.9% in 2024. The average annualized yield for fixed maturity securities excluding Argentine inflation-linked securities was 4.6% in 2025 and 4.5% in 2024. The effective duration of the fixed maturity portfolio was 2.9 years at September 30, 2025 up from 2.6 years at December 31, 2024. Average invested assets, at cost (including cash and cash equivalents), were $32.1 billion in 2025, up 9% from $29.3 billion in 2024.\n    \nInsurance Service Fees\n. The Company earns fees from an insurance distribution business, a third-party administrator and as a servicing carrier of workers' compensation assigned risk plans for certain states. Insurance service fees increased to $31 million in 2025 from $29 million in 2024 mainly due to organic growth within the business. \n    \nNet Realized and Unrealized Gains (Losses) on Investments\n. The Company buys and sells securities and other investment assets on a regular basis in order to maximize its total return on investments. Decisions to sell securities and other investment assets are based on management’s view of the underlying fundamentals of specific investments as well as management’s expectations regarding interest rates, credit spreads, currency values and general economic conditions. Net realized and unrealized gains on investments were $79 million in 2025 compared with losses of $23 million in 2024. The gains of $79 million in 2025 reflected net realized gains on investments of $69 million and an increase in unrealized gains on equity securities of $10 million. The losses of $23 million in 2024 reflected net realized losses on investments of $22 million and an increase in unrealized losses on equity securities of $1 million.\n45\n \nChange in Allowance for Expected Credit Losses on Investments\n. Based on credit factors, the allowance for expected credit losses is increased or decreased depending on the percentage of unrealized loss relative to amortized cost by security, changes in rating of the security by a rating agency, and adverse conditions specifically related to the security, among other factors. The pre-tax change in allowance for expected credit losses on investments, which are reflected in net investment gains (losses), decreased by $0.2 million ($0.1 million after-tax) in 2025 and $15 million ($12 million after-tax) in 2024 due to improved pricing associated with foreign government securities.\nRevenues from Non-Insurance Businesses\n. Revenues from non-insurance businesses were derived from businesses engaged in the distribution of promotional merchandise, world-wide textile solutions and aviation-related businesses that provide services to aviation markets, including (i) the distribution, manufacturing, repair and overhaul of aircraft parts and components, (ii) the sale of new and used aircraft, and (iii) avionics, fuel, maintenance, storage and charter services. Revenues from non-insurance businesses were $150 million in 2025 and $129 million in 2024. The increase mainly relates to aviation-related business, partially offset by the reduction in promotional merchandise and textile businesses. \n    \nLosses and Loss Expenses\n. Losses and loss expenses increased to $1,969 million in 2025 from $1,826 million in 2024. The consolidated loss ratio was 62.4% in both 2025 and 2024. Catastrophe losses, net of reinsurance recoveries, were $79 million in 2025 and $98 million in 2024. Favorable prior year reserve development (net of premium offsets) was $1 million in both 2025 and 2024. The loss ratio excluding catastrophe losses and prior year reserve development increased 0.8 points to 59.9% in 2025 from 59.1% in 2024, largely due to a change in business mix.\n    A summary of loss ratios in 2025 compared with 2024 by business segment follows:\n•\nInsurance\n - The loss ratio was 63.9% in 2025 and 63.1% in 2024. Catastrophe losses were $70 million in 2025 compared with $77 million in 2024. Adverse prior year reserve development was $13 million in 2025, and favorable prior year development was $3 million in 2024. The loss ratio excluding catastrophe losses and prior year reserve development increased 0.7 points to 60.9% in 2025 from 60.2% in 2024.\n•\nReinsurance & Monoline Excess\n - The loss ratio was 51.3% in 2025 and 57.0% in 2024. Catastrophe losses were $9 million in 2025 and $21 million in 2024. Favorable prior year reserve development was $14 million in 2025, and adverse prior year reserve development was $2 million in 2024. The loss ratio excluding catastrophe losses and prior year reserve development increased 1.9 points to 52.6% in 2025 from 50.7% in 2024.\nOther Operating Costs and Expenses\n. Following is a summary of other operating costs and expenses for the three months ended September 30, 2025 and 2024:\n($ in thousands)\n2025\n2024\nPolicy acquisition and insurance operating expenses\n$\n900,312 \n$\n835,376 \nInsurance service expenses\n22,711 \n21,786 \nNet foreign currency (gains) losses\n(12,009)\n24,619 \nOther costs and expenses\n64,319 \n61,584 \nTotal\n$\n975,333 \n$\n943,365 \n    Policy acquisition and insurance operating expenses are comprised of commissions paid to agents and brokers, premium taxes and other assessments and internal underwriting costs. Policy acquisition and insurance operating expenses and net premiums earned both increased 8% from 2024. The expense ratio (underwriting expenses expressed as a percentage of net premiums earned) was 28.5% in both 2025 and 2024. \n    Insurance service expenses, which represent the costs associated with the fee-based businesses, were $23 million in 2025 and $22 million in 2024. \n    Net foreign currency (gains) losses result from transactions denominated in a currency other than a company's operating functional currency. Net foreign currency gains were $12 million in 2025 compared to losses of $25 million in 2024, primarily due to other major currencies strengthening against the U.S. dollar in 2024.\n    Other costs and expenses represent general and administrative expenses of the parent company and other expenses not allocated to business segments, including the cost of certain long-term incentive plans and new business ventures. Other costs and expenses were $64 million in 2025 and $62 million in 2024.\n    \nExpenses from Non-Insurance Businesses\n. Expenses from non-insurance businesses represent costs associated with businesses engaged in the distribution of promotional merchandise, world-wide textile solutions and aviation-related businesses \n46\n \nthat include (i) cost of goods sold related to aircraft and products sold and services provided, and (ii) general and administrative expenses. Expenses from non-insurance businesses were $144 million in 2025 and $125 million in 2024. The increase mainly relates to aviation-related business, partially offset by the reduction in promotional merchandise and textile businesses.\nInterest Expense\n. Interest expense was $32 million in both 2025 and 2024. \nIncome Taxes.\n The effective income tax rate was 21.0% and 23.0% for the three months ended September 30, 2025 and 2024, respectively. The lower effective income tax rate for the three months ended September 30, 2025, as compared to the earlier period, was primarily due to an improved geographical mix of earnings and larger benefits attributable to equity-based compensation. \n    The Company has not provided U.S. deferred income taxes on the undistributed earnings of approximately $555 million of its non-U.S. subsidiaries since these earnings are intended to be permanently reinvested in the non-U.S. subsidiaries. In the future, if such earnings were distributed, the Company projects that the incremental tax, if any, will not be material.\nAs part of the Inflation Reduction Act of 2022, a 1% excise tax is imposed on common share repurchases, net of common share issuances, and included in the cost of treasury stock acquired. During the three months ended September 30, 2025, the Company repurchased 350,000 shares of its common stock. \nIn the United States, on July 4, 2025, the budget reconciliation package known as the “One Big Beautiful Bill” was signed into law. Changes resulting from the tax provisions thereunder are not expected to have a material impact on the Company’s results from operations.\n47\n \nInvestments\n    As part of its investment strategy, the Company establishes a level of cash and highly liquid short-term and intermediate-term securities that, combined with expected cash flow, it believes is adequate to meet its payment obligations. In addition to fixed maturity securities, the Company invests in equity securities, merger arbitrage securities, investment funds, private equity, loans and real estate related assets. The Company's investments in investment funds and its other alternative investments have experienced, and the Company expects to continue to experience, greater fluctuations in investment income.\n    The Company also attempts to maintain an appropriate relationship between the average duration of the investment portfolio and the approximate duration of its liabilities (i.e., policy claims and debt obligations). The average duration of the fixed maturity portfolio, including cash and cash equivalents, was 2.9 years at September 30, 2025 up from 2.6 years at December 31, 2024. The Company’s fixed maturity investment portfolio and investment-related assets as of September 30, 2025 were as follows:\n($ in thousands)\nCarrying\nValue\nPercent\nof Total\nFixed maturity securities:\nU.S. government and government agencies\n$\n3,478,237 \n10.6 \n%\nState and municipal:\nSpecial revenue\n1,258,705 \n3.8 \nState general obligation\n261,797 \n0.8 \nLocal general obligation\n225,190 \n0.7 \nCorporate backed\n181,492 \n0.6 \nPre-refunded (1)\n75,319 \n0.2 \nTotal state and municipal\n2,002,503 \n6.1 \nMortgage-backed:\nAgency\n4,450,198 \n13.6 \nCommercial\n331,629 \n0.9 \nResidential-Prime\n188,034 \n0.6 \nResidential-Alt A\n1,538 \n— \nTotal mortgage-backed\n4,971,399 \n15.1 \nAsset-backed securities\n3,831,174 \n11.7 \nCorporate:\nIndustrial\n3,705,998 \n11.3 \nFinancial\n3,544,403 \n10.8 \nUtilities\n1,252,731 \n3.8 \nOther\n237,640 \n0.7 \nTotal corporate\n8,740,772 \n26.6 \nForeign government and foreign government agencies\n1,923,864 \n5.9 \nTotal fixed maturity securities\n24,947,949 \n76.0 \nEquity securities:\nCommon stocks\n721,950 \n2.2 \nPreferred stocks\n660,482 \n2.0 \nTotal equity securities\n1,382,432 \n4.2 \nCash and cash equivalents (2)\n2,352,117 \n7.1 \nInvestment funds\n1,430,991 \n4.4 \nReal estate\n1,305,299 \n4.0 \nArbitrage trading account\n1,070,304 \n3.3 \nLoans receivable\n326,855 \n1.0 \nTotal investments\n$\n32,815,947 \n100.0 \n%\n____________________\n(1)  Pre-refunded securities are securities for which an escrow account has been established to fund the remaining payments of principal and interest through maturity. Such escrow accounts are funded almost exclusively with U.S. Treasury and U.S. government agency securities.\n(2) Cash and cash equivalents includes trading accounts receivable from brokers and clearing organizations, trading account securities sold but not yet purchased and unsettled purchases.\n48\n \nFixed Maturity Securities\n. The Company’s investment policy with respect to fixed maturity securities is generally to purchase instruments with the expectation of holding them to their maturity. However, management of the available for sale portfolio is considered necessary to maintain an approximate matching of assets and liabilities as well as to adjust the portfolio as a result of changes in financial market conditions and tax considerations.\nThe Company’s philosophy related to holding or selling fixed maturity securities is based on its objective of maximizing total return. The key factors that management considers in its investment decisions as to whether to hold or sell fixed maturity securities are its view of the underlying fundamentals of specific securities as well as its expectations regarding interest rates, credit spreads and currency values. In a period in which management expects interest rates to rise, the Company may sell longer duration securities in order to mitigate the impact of an interest rate rise on the fair value of the portfolio. Similarly, in a period in which management expects credit spreads to widen, the Company may sell lower quality securities, and in a period in which management expects certain foreign currencies to decline in value, the Company may sell securities denominated in those foreign currencies. The sale of fixed maturity securities in order to achieve the objective of maximizing total return may result in realized gains or losses; however, there is no reason to expect these gains or losses to continue in future periods.\nEquity Securities\n. Equity securities primarily represent investments in common and preferred stocks in companies with potential growth opportunities in different sectors, mainly in the financial institutions, energy and technology sectors.\nInvestment Funds\n. At September 30, 2025, the carrying value of investment funds was $1.4 billion, including investments in other funds of $400 million (which includes a deferred compensation trust asset of $42 million), financial services funds of $374 million, transportation funds of $273 million, real estate funds of $177 million, infrastructure funds of $165 million, and energy funds of $42 million. Investment funds are generally reported on a one-quarter lag.\nReal Estate\n. Real estate is directly owned property held for investment. At September 30, 2025, real estate properties in operation included a long-term ground lease in Washington D.C., an office complex in New York City and the completed portion of a mixed-use project in Washington D.C. In addition, part of the previously mentioned mixed-use project in Washington D.C. is under development. The Company expects to fund further development costs for the project with a combination of its own funds and external financing.\nArbitrage Trading Account\n. The arbitrage trading account is comprised of direct investments in arbitrage securities. Merger arbitrage is the business of investing in the securities of publicly held companies that are the targets in announced tender offers and mergers.\nLoans Receivable\n. Loans receivable, which are carried at amortized cost (net of allowance for expected credit losses), had an amortized cost of $327 million and an aggregate fair value of $327 million at September 30, 2025. The amortized cost of loans receivable is net of an allowance for expected credit losses of $0.3 million as of September 30, 2025. Loans receivable include real estate loans of $327 million that are secured by commercial and residential real estate located primarily in the U.K. and New York. Real estate loans generally earn interest at fixed or stepped interest rates and have maturities through 2028. Loans receivable includes a commercial loan of $76 thousand with one small business owner that is secured by business assets, has a fixed interest rate and matures in 2026.\nMarket Risk\n. The fair value of the Company’s investments is subject to risks of fluctuations in credit quality and interest rates. The Company uses various models and stress test scenarios to monitor and manage interest rate risk. The Company attempts to manage its interest rate risk by maintaining an appropriate relationship between the effective duration of the investment portfolio and the approximate duration of its liabilities (i.e., policy claims and debt obligations). The effective duration for the fixed maturity portfolio (including cash and cash equivalents) was 2.9 years at September 30, 2025 up from 2.6 years at December 31, 2024.\nIn addition, the fair value of the Company’s international investments is subject to currency risk. The Company attempts to manage its currency risk by matching its foreign currency assets and liabilities where considered appropriate.\n49\n \nLiquidity and Capital Resources\n    \nCash Flow\n.\n Cash flow provided from operating activities decreased to $2,587 million in the nine months ended September 30, 2025 from $2,868 million in the nine months ended September 30, 2024, primarily due to increased loss and loss expense payments partially offset by increased premium receipts.   \n    The Company's insurance subsidiaries' principal sources of cash are premiums, investment income, service fees and proceeds from sales and maturities of portfolio investments. The principal uses of cash are payments for claims, taxes, operating expenses and dividends. The Company expects its insurance subsidiaries to fund the payment of losses with cash received from premiums, investment income and fees. The Company generally targets an average duration for its investment portfolio that is within 1.5 years of the average duration of its liabilities so that portions of its investment portfolio mature throughout the claim cycle and are available for the payment of claims if necessary. In the event operating cash flow and proceeds from maturities and prepayments of fixed income securities are not sufficient to fund claim payments and other cash requirements, the remainder of the Company's cash and investments is available to pay claims and other obligations as they become due. The Company's investment portfolio is highly liquid, with approximately 83.2% invested in cash, cash equivalents and marketable fixed maturity securities as of September 30, 2025. If the sale of fixed maturity securities were to become necessary, a realized gain or loss equal to the difference between the cost and sales price of securities sold would be recognized.  \n    \nDebt\n.\n At September 30, 2025, the Company had senior notes, subordinated debentures and other debt outstanding with a carrying value of $2,840 million and a face amount of $2,860 million. The maturities of the outstanding debt are $5 million in 2026, $250 million in 2037, $350 million in 2044, $470 million in 2050, $400 million in 2052, $185 million in 2058, $300 million in 2059, $250 million in 2060, and $650 million in 2061.\nOn April 1, 2022, the Company entered into a senior unsecured revolving credit facility that provides for revolving, unsecured borrowings up to an aggregate of $300 million with a $50 million sublimit for letters of credit. The Company may increase the amount available under the facility to a maximum of $500 million subject to obtaining lender commitments for the increase and other customary conditions. Borrowings under the facility may be used for working capital and other general corporate purposes. All borrowings under the facility must be repaid by April 1, 2027, except that letters of credit outstanding on that date may remain outstanding until April 1, 2028 (or such later date approved by all lenders). Our ability to utilize the facility is conditioned on the satisfaction of representations, warranties and covenants that are customary for facilities of this type. As of September 30, 2025, there were no borrowings outstanding under the facility.\n    \nEquity\n.\n At September 30, 2025, total common stockholders’ equity was $9.8 billion, common shares outstanding were 379,877,184 and stockholders’ equity per outstanding share was $25.79. During the nine months ended September 30, 2025, the Company repurchased 1,200,000 shares of its common stock for $74 million. In the third quarter of 2025, the board of directors of the Company declared an ordinary quarterly cash dividend of $0.09 per share. In the second quarter of 2025, the board of directors of the Company declared an ordinary quarterly cash dividend of $0.09 per share and a special quarterly cash dividend of $0.50 per share. In the first quarter of 2025, the board of directors of the Company declared an ordinary quarterly cash dividend of $0.08 per share. The number of common shares outstanding excludes shares held in a grantor trust established by the Company for delivery upon settlement of vested but mandatorily deferred RSUs. \n    \nTotal Capital\n.\n Total capitalization (equity, debt and subordinated debentures) was $12.6 billion at September 30, 2025. The percentage of the Company’s capital attributable to senior notes, subordinated debentures and other debt was 22% at September 30, 2025 down from 25% at December 31, 2024.\n50"
}