{
  "source_file": "wsm-20251102.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nFORWARD-LOOKING STATEMENTS\nThis Quarterly Report on Form 10-Q contains forward-looking statements that involve risks and uncertainties, as well as assumptions that, if they do not fully materialize or are proven incorrect, could cause our business and results of operations to differ materially from those expressed or implied by such forward-looking statements. Such forward-looking statements include statements related to: changes in U.S. (federal, state and local) and international tax laws and trade policies and regulations; the impact of current and potential future tariffs and our ability to mitigate such impacts; the complementary nature of our e-commerce and retail channels; the plans, strategies, initiatives and objectives of management for future operations; our ability to execute strategic priorities and growth initiatives, including those regarding digital leadership, product and technology innovation, cross-brand initiatives, retail transformation and operational excellence; the strength of our business and our brands; our marketing efforts; our ability to provide sustainable products at competitive prices; our ability to provide world-class customer service via supply chain improvements from reduced out-of-market and multiple shipments, fewer customer accommodations, lower returns and damages, and reduced replacements; our belief that our key differentiators, growth strategies and the efficiencies of our operating model will allow us to reduce costs and manage inventory levels in both the short- and long-term; competition from companies with concepts or products similar to ours; our beliefs about our competitive advantages and areas of potential future growth in the market; the seasonal variations in demand; our ability to recruit, retain and motivate skilled personnel; our ability to protect our intellectual property rights; our ability to comply with the laws, rules and regulations of the U.S. and multiple foreign jurisdictions in which we operate; the impact of general economic conditions, inflationary pressures, consumer disposable income, fuel prices, recession and fears of recession, unemployment, war and fears of war, outbreaks of disease, adverse weather, availability of consumer credit, consumer debt levels, conditions in the housing market, elevated interest rates, sales tax rates and rate increases, consumer confidence in future economic and political conditions, and consumer perceptions of personal well-being and security; the impact of periods of decreased home and home furnishing purchases; our ability to grow our business-to-business division and the challenges we may face executing such growth; our ability to anticipate consumer preferences and buying trends overall and as they apply to specific brands; dependence on timely introduction and customer acceptance of our merchandise; effective inventory management; timely and effective sourcing of merchandise from our foreign and domestic suppliers and delivery of merchandise through our supply chain to our stores and customers; factors, including but not limited to fuel costs, labor disputes, union organizing activity, geopolitical instability, acts of terrorism and war, that can affect the global supply chain, including our third-party providers; our belief in the adequacy of our facilities and the availability of suitable additional or substitute space; our ability to improve our systems and processes; changes to our information technology infrastructure; shortages of raw materials used to make our products; uncertainties in e-marketing, infrastructure and regulation; our belief in the reasonableness of the steps taken to protect the security and confidentiality of the information we collect; multi-channel and multi-brand complexities; delays in store openings; our brands, products and related initiatives, including our ability to introduce new products, product lines, brands, and brand extensions, and bring in new customers; our belief in the ultimate resolution of current legal proceedings; challenges associated with our increasing global presence; our global business and expansion efforts, including franchise, other third-party arrangements and company-owned operations; adherence by our suppliers to our global compliance program and quality control standards; the effects of fluctuations in foreign currency rates and the impact of our hedging against such risks; dependence on external funding sources for operating capital; our compliance with financial covenants; disruptions in the financial markets; our ability to control employment, occupancy, supply chain, product, transportation and other operating costs; the adequacy of our insurance coverage; our stock repurchase program; payment of dividends; the impact of new accounting pronouncements; our belief that our cash on hand and available credit facilities will provide adequate liquidity for our business operations; our belief regarding the effects of potential losses under our indemnification obligations; the effects of changes in our inventory reserves; our ability to deliver organic, core-brand growth; growth from our emerging brands; our ability to drive long-term sustainable returns; our capital allocation strategy in fiscal 2025; our planned use of cash in fiscal 2025; projections of earnings, revenues, growth and other financial items; and other risks and uncertainties, as well as statements of belief and statements of assumptions underlying any of the foregoing. You can identify these and other forward-looking statements by the use of words such as “may,” “should,” “expects,” “plans,” “anticipates,” “believes,” “estimates,” “predicts,” “intends,” “potential,” “continue,” or the negative of such terms, or other comparable terminology. The risks, uncertainties and assumptions referred to above that could cause our results to differ materially from the results expressed or implied by such forward-looking statements include, but are not limited to, those discussed under the heading “\nRisk Factors\n” in this document and our Annual Report on Form 10-K for the fiscal year ended February 2, 2025, and the risks, uncertainties and assumptions discussed from time to time in our other public filings and public announcements. All forward-looking statements included in this document are based on information available to us as of the date hereof, and we assume no obligation to update these forward-looking statements.\n17\nTable of Contents\nOVERVIEW\nWilliams-Sonoma, Inc., (the “Company”, “we”, or “us”) is a specialty retailer of high-quality products for the home. We are the world’s largest digital-first, design-led and sustainable home retailer. Our brands – Williams Sonoma, Pottery Barn, Pottery Barn Kids, Pottery Barn Teen, West Elm, Williams Sonoma Home, Rejuvenation, Mark and Graham, and GreenRow – represent distinct merchandise strategies that are marketed through e-commerce, direct-mail catalogs and retail stores. These brands collectively support The Key Rewards, our loyalty and credit card program that offers members exclusive benefits. We operate in the U.S., Puerto Rico, Canada, Australia and the United Kingdom, and have unaffiliated franchisees that operate stores in the Middle East, the Philippines, Mexico, South Korea and India, as well as e-commerce websites in certain locations. \nThe following discussion and analysis of financial condition, results of operations, and liquidity and capital resources for the thirteen weeks ended November 2, 2025 (“third quarter of fiscal 2025”), as compared to the thirteen weeks ended October 27, 2024 (“third quarter of fiscal 2024”) and thirty-nine weeks ended November 2, 2025 (\"first thirty-nine weeks of fiscal 2025\"), as compared to the thirty-nine weeks ended October 27, 2024 (\"first thirty-nine weeks of fiscal 2024\"), should be read in conjunction with our Condensed Consolidated Financial Statements and the notes thereto. All explanations of changes in operational results are discussed in order of magnitude.\nThird Quarter of Fiscal 2025 Financial Results\nNet revenues in the third quarter of fiscal 2025 increased $82.1 million or 4.6%, with company comp growth of 4.0%. This increase was driven by strong non-furniture and furniture sales, including new product introductions and collaborations, as well as higher full-price selling. From a channel perspective, the company comp growth of 4.0% was driven by comp growth of 8.5% in our retail channel and comp growth of 1.9% in our e-commerce channel.\nIn the third quarter of fiscal 2025, Pottery Barn, our largest brand, saw comparable brand revenue (“brand comp”) growth of 1.3% driven by strength in large-ticket items, including furniture, upholstery and lighting, as well as a strong retail performance driven by improvements in store inventory availability, new product assortments and our design services. \nThe Pottery Barn Kids and Teen brands saw brand comp growth of 4.4% in the third quarter of fiscal 2025 driven by strength in collaborations, new product launches, and back-to-school and dorm offerings.\nWest Elm saw brand comp growth of 3.3% in the third quarter of fiscal 2025, driven by strength in new non-furniture and furniture product introductions and a strong retail performance.\nThe Williams Sonoma brand saw brand comp growth of 7.3% in the third quarter of fiscal 2025 with strength in the brand's kitchen business driven by electrics and cookware as well as a strong retail performance.\nFinally, our emerging brands, Rejuvenation, Mark and Graham, and GreenRow, delivered double-digit brand comp growth on a combined basis.\nFor the third quarter of fiscal 2025, diluted earnings per share grew by 4.8% to $1.96, compared to $1.87 in the third quarter of fiscal 2024.\nAs of November 2, 2025, we had $884.7 million in cash and cash equivalents and generated operating cash flow of $718.0 million in the first thirty-nine weeks of fiscal 2025. In addition to our cash balance, we also ended the third quarter of fiscal 2025 with no outstanding borrowings under our revolving line of credit. This strong liquidity position allowed us to fund the operations of the business, invest $178.5 million in capital expenditures and return $792.3 million through stock repurchases and dividends to stockholders in the first thirty-nine weeks of fiscal 2025.\nOut-of-Period Freight Adjustment in First Quarter of Fiscal 2024\nSubsequent to the filing of our fiscal 2023 Form 10-K, in April 2024, we determined that we over-recognized freight expense in fiscal 2021, 2022 and 2023 for a cumulative amount of $49.0 million. We evaluated the error, both qualitatively and quantitatively, and determined that no prior interim or annual periods were materially misstated. We then evaluated whether the cumulative amount of the over-accrual was material to our projected fiscal 2024 results, and determined the cumulative amount was not material. Therefore, the Condensed Consolidated Financial Statements for the thirty-nine weeks ended October 27, 2024 include an out-of-period adjustment of $49.0 million, recorded in the first quarter of fiscal 2024, to reduce cost of goods sold and accounts payable, which corrected the cumulative error on the Consolidated Balance Sheet as of January 28, 2024.\n18\nTable of Contents\nLooking Ahead\nWe remain focused on our three key priorities of (i) returning to growth, (ii) elevating our world-class customer service and (iii) driving earnings. We believe these key priorities will set us apart from our competition and allow us to drive long-term growth and profitability. We believe we have a powerful portfolio of brands, serving a range of categories, aesthetics, and life stages and we have built a strong omni-channel platform and infrastructure, which will position us well for the next stage of growth. However, the current uncertain macroeconomic environment, including the evolving tariff and trade policy landscape, a weak housing market, elevated interest rates, layoffs, inflationary pressure, economic uncertainty and global geopolitical instability could negatively impact our business. Since the end of the first quarter of fiscal 2025, the tariff environment has materially evolved. Specifically, our incremental tariff rate has more than doubled from 14% in May 2025 to 29% as of this Quarterly Report on Form 10-Q. These tariffs, as well as any future tariffs, are expected to result in increased cost for imported materials and finished goods. While we believe that we can offset a portion of these costs, we may not be able to offset all the additional costs. Our inability to minimize the impact of tariffs on our products, increase prices or find alternative sources for our products may have a material impact on our earnings. For information on risks, please see “\nRisk Factors\n” in Part I, Item 1A of our Annual Report on Form 10-K for the fiscal year ended February 2, 2025.\nNET REVENUES\nNet revenues primarily consist of sales of merchandise to our customers through our e-commerce websites, retail stores and direct-mail catalogs, and include shipping fees received from customers for delivery of merchandise to their homes. Our revenues also include sales to our business-to-business customers and franchisees, incentives received from credit card issuers in connection with our private label and co-branded credit cards and breakage income related to our stored-value cards. Revenue from the sale of merchandise is reported net of sales returns.\nThird Quarter of Fiscal 2025 vs. Third Quarter of Fiscal 2024\nNet revenues in the third quarter of fiscal 2025 increased $82.1 million or 4.6%, with company comp growth of 4.0%. This increase was driven by strong non-furniture and furniture sales, including new product introductions and collaborations, as well as higher full-price selling. From a channel perspective, the company comp growth of 4.0% was driven by comp growth of 8.5% in our retail channel and comp growth of 1.9% in our e-commerce channel.\nFirst Thirty-nine Weeks of Fiscal 2025 vs. First Thirty-nine Weeks of Fiscal 2024\nNet revenues in the first thirty-nine weeks of fiscal 2025 increased by $200.4 million, or 3.8%, with company comp growth of 3.7%. This was driven by strong non-furniture and furniture sales, including new product introductions and collaborations, as well as higher full-price selling. From a channel perspective, the company comp growth of 3.7% was driven by comp growth of 7.4% in our retail channel and comp growth of 2.0% in our e-commerce channel. Both channels benefited from improved in-stock inventory levels.\nComparable Brand Revenue\nComparable brand revenue includes comparable e-commerce sales, including through our direct-mail catalog, and store sales, as well as shipping fees, sales returns and other discounts associated with current period sales. Comparable stores are defined as permanent stores where gross square footage did not change by more than 20% in the previous 12 months, and which have been open for at least 12 consecutive months without closure for more than seven days within the same fiscal month. Outlet comparable store revenues are included in their respective brands. Business-to-business revenues are included in comparable brand revenue for each of our brands. Sales to our international franchisees are excluded from comparable brand revenue as their stores and e-commerce websites are not operated by us. Sales from certain operations are also excluded until such time that we believe those sales are meaningful to evaluating their performance. Additionally, comparable brand revenue for new and emerging concepts is not separately disclosed until such time that we believe those sales are meaningful to evaluating the performance of the brand.\nFor the Thirteen Weeks Ended \n1\nFor the Thirty-nine Weeks Ended \n1\nComparable brand revenue growth (decline)\nNovember 2, 2025\nOctober 27, 2024\nNovember 2, 2025\nOctober 27, 2024\nPottery Barn\n1.3 \n%\n(7.5)\n%\n1.5 \n%\n(8.4)\n%\nWest Elm\n3.3 \n(3.5)\n2.3 \n(4.1)\nWilliams Sonoma\n7.3 \n(0.1)\n6.6 \n0.0 \nPottery Barn Kids and Teen\n4.4 \n3.8 \n4.5 \n2.7 \nTotal \n2\n4.0 \n%\n(2.9)\n%\n3.7 \n%\n(3.7)\n%\n1   Comparable brand revenue includes business-to-business revenues within each brand.\n2   Total comparable brand revenue growth (decline) includes the results of Rejuvenation, Mark and Graham, and GreenRow.\n19\nTable of Contents\nSTORE DATA\n \nStore Count \nAverage Leased Square\nFootage Per Store\n  \nAugust 3, 2025\nOpenings\nClosings\nNovember 2, 2025\nOctober 27, 2024\nNovember 2, 2025\nOctober 27, 2024\nPottery Barn\n181 \n2 \n— \n183 \n186 \n15,100 \n15,000 \nWilliams Sonoma\n154 \n— \n(1)\n153 \n160 \n6,900 \n6,900 \nWest Elm\n119 \n— \n— \n119 \n122 \n13,300 \n13,200 \nPottery Barn Kids\n44 \n1 \n— \n45 \n46 \n7,800 \n7,800 \nRejuvenation\n11 \n2 \n— \n13 \n11 \n7,900 \n8,100 \nTotal\n509 \n5 \n(1)\n513 \n525 \n11,400 \n11,400 \nStore selling square footage at period-end\n \n \n3,817,000 \n3,886,000 \nStore leased square footage at period-end\n \n \n5,844,000 \n5,972,000 \nGROSS PROFIT\nGross profit is equal to our net revenues less cost of goods sold. Cost of goods sold includes (i) cost of goods, which consists of cost of merchandise, inbound freight expenses, freight-to-store expenses, tariff expenses and other inventory related costs such as replacements, damages, obsolescence and shrinkage, (ii) occupancy expenses, which consists of rent, other occupancy costs (including property taxes, common area maintenance and utilities) and depreciation, and (iii) shipping costs, which consists of third-party delivery services and shipping materials.\nOur classification of expenses in cost of goods sold may not be comparable to other public companies, as we do not include non-occupancy-related costs associated with our distribution network in cost of goods sold. These costs, which include distribution network employment, third-party warehouse management and other distribution-related administrative expenses, are recorded in selling, general, and administrative expenses (“SG&A”).\n \nFor the Thirteen Weeks Ended\nFor the Thirty-nine Weeks Ended\n(In thousands)\nNovember 2, 2025\n% Net\nRevenues\nOctober 27, 2024\n% Net\nRevenues\nNovember 2, 2025\n% Net\nRevenues\nOctober 27, 2024\n% Net\nRevenues\nGross profit \n1\n$\n867,733 \n46.1 \n%\n$\n817,566 \n45.4 \n%\n$\n2,498,165 \n45.8 \n%\n$\n2,416,674 \n46.0 \n%\n1\nIncludes occupancy expenses of $206.5 million and $195.0 million for the third quarter of fiscal 2025 and fiscal 2024, respectively, and $605.6 million and $588.3 million for the first thirty-nine weeks of fiscal 2025 and fiscal 2024, respectively.\nThird Quarter of Fiscal 2025 vs. Third Quarter of Fiscal 2024\nGross profit increased $50.2 million, or 6.1%, compared to the third quarter of fiscal 2024. Gross margin increased to 46.1% from 45.4% in the third quarter of fiscal 2024. This increase in gross margin of 70 basis points was primarily driven by higher merchandise margins of 60 basis points due to (i) the flow-through of tariffs into cost of goods sold being slower than anticipated due to delayed tariff effective dates, (ii) results from our tariff mitigation plan, including select price increases, and (iii) lower inbound transportation costs. Additionally, supply chain efficiencies contributed 30 basis points, including reductions in outbound shipping expense, damages, replacements and accommodations. These improvements were partially offset by higher occupancy costs of 20 basis points due to our retail outperformance and the higher occupancy costs in that channel.\nFirst Thirty-nine Weeks of Fiscal 2025 vs. First Thirty-nine Weeks of Fiscal 2024\nGross profit increased $81.5 million, or 3.4%, compared to the first thirty-nine weeks of fiscal 2024. Gross margin decreased to 45.8% from 46.0% in the first thirty-nine weeks of fiscal 2024. This decrease in gross margin of 20 basis points was driven by (i) the out-of-period freight adjustment in the first quarter of fiscal 2024 of 90 basis points, partially offset by (ii) supply chain efficiencies of 40 basis points, including reductions in damages, replacements and accommodations, (iii) higher merchandise margins of 20 basis points, and (iv) the leverage of occupancy costs of 10 basis points resulting from higher sales.\n20\nTable of Contents\nSELLING, GENERAL AND ADMINISTRATIVE EXPENSES\nSG&A consists of non-occupancy related costs associated with our retail stores and e-commerce websites, distribution and manufacturing facilities, customer care centers, supply chain operations (buying, receiving and inspection) and corporate administrative functions. These costs include employment, advertising, third party credit card processing, impairment and other general expenses.\nFor the Thirteen Weeks Ended\nFor the Thirty-nine Weeks Ended\n(In thousands)\nNovember 2, 2025\n% Net Revenues\nOctober 27, 2024\n% Net Revenues\nNovember 2, 2025\n% Net Revenues\nOctober 27, 2024\n% Net Revenues\nSelling, general and administrative expenses\n$\n548,590 \n29.1 \n%\n$\n512,535 \n28.5 \n%\n$\n1,560,250 \n28.6 \n%\n$\n1,516,631 \n28.9 \n%\nThird Quarter of Fiscal 2025 vs. Third Quarter of Fiscal 2024\nSG&A increased $36.1 million, or 7.0%, compared to the third quarter of fiscal 2024. SG&A as a percentage of net revenues increased to 29.1% from 28.5% in the third quarter of fiscal 2024. This increase of 60 basis points was primarily driven by (i) an increase in employment expense of 50 basis points due to higher performance-based incentive compensation and (ii) an increase in advertising expenses of 20 basis points, partially offset by (iii) general expense leverage of 10 basis points. \nFirst Thirty-nine Weeks of Fiscal 2025 vs. First Thirty-nine Weeks of Fiscal 2024\nSG&A increased $43.6 million, or 2.9%, compared to the first thirty-nine weeks of fiscal 2024. SG&A as a percentage of net revenues decreased to 28.6% from 28.9% in the first thirty-nine weeks of fiscal 2024. This leverage of 30 basis points was primarily driven by (i) lower advertising expenses of 40 basis points and (ii) lower general expenses of 20 basis points, partially offset by (iii) an increase in employment expense of 30 basis points due to higher performance-based incentive compensation.\nINCOME TAXES\nThe effective tax rate was 25.4% for the first thirty-nine weeks of fiscal 2025, compared to 24.2% for the first thirty-nine weeks of fiscal 2024. The increase was primarily driven by (i) lower excess tax benefit from stock-based compensation in the first thirty-nine weeks of fiscal 2025, (ii) the tax effect of the change in earnings mix and (iii) the tax benefit of state amended returns filed in fiscal 2024.\nOn July 4, 2025, the One Big Beautiful Bill Act (“OBBB”) was signed into law in the United States. The OBBB includes a broad range of tax reform provisions, including permanently extending and modifying certain expiring provisions of the 2017 Tax Cuts and Jobs Act. The legislation has multiple effective dates, with certain provisions becoming effective in fiscal 2025 and the majority taking effect in future years. We currently expect the OBBB to have a minimal impact on the effective tax rate but result in favorable cash tax impacts in fiscal 2025 as a result of certain accelerated tax deductions.\nSince the Organization for Economic Co-operation and Development (“OECD”) announced the OECD/G20 Inclusive Framework on Base Erosion and Profit Shifting (“Framework”) in 2021, a number of countries have begun to enact legislation to implement the OECD international tax framework, including the Pillar Two minimum tax regime. Our subsidiaries were not subject to Pillar Two minimum tax in the first thirty-nine weeks of fiscal 2025. We are continuing to evaluate the potential impact on future periods of the Pillar Two Framework, and monitoring legislative developments by other countries, especially in the regions in which we operate.\nLIQUIDITY AND CAPITAL RESOURCES\nMaterial Cash Requirements\nThere were no material changes during the quarter to the Company’s material cash requirements, commitments and contingencies that are described in \nPart II, Item 7\n of the Company’s Annual Report on Form 10-K for the fiscal year ended February 2, 2025, which is incorporated herein by reference.\nStock Repurchase Program and Dividends\nSee \nNote G\n to our Condensed Consolidated Financial Statements, \nStock Repurchase Program and Dividends, \nwithin Item 1 of this Quarterly Report on Form 10-Q for further information.\nLiquidity Outlook\nFor the remainder of fiscal 2025, we plan to use our cash resources to fund our inventory purchases, employment-related costs, advertising and marketing initiatives, rental payments on our leases, capital expenditures, dividend payments, stock repurchases, and the payment of income taxes.\n21\nTable of Contents\nWe believe our cash on hand, cash flows from operations and our available credit facilities will provide adequate liquidity for our business operations as well as dividends, capital expenditures, stock repurchases and other liquidity requirements associated with our business operations over the next 12 months. We are currently not aware of any other trends or demands, commitments, events or uncertainties that will result in, or that are reasonably likely to result in, our liquidity increasing or decreasing in any material way that would impact our capital needs during or beyond the next 12 months.\nSources of Liquidity\nAs of November 2, 2025, we held $884.7 million in cash and cash equivalents, the majority of which was held in money market funds and interest-bearing demand deposit accounts, and of which $64.2 million was held by our international subsidiaries. Consistent with our industry, our cash balances are seasonal in nature, with the fourth quarter historically representing a significantly higher level of cash than other periods.\nIn addition to our cash balances on hand, in June 2025, we amended our existing credit facility, which increased our unsecured revolving line of credit to $600 million, amended certain interest rates and extended the maturity date of the facility to June 26, 2030, in addition to other updates (the “Credit Facility”). Our Credit Facility may be used to borrow revolving loans or to request the issuance of letters of credit. We may, upon notice to the administrative agent, request existing or new lenders, at such lenders’ option, to increase the Credit Facility by up to $250 million to provide for a total of up to $850 million of unsecured revolving credit.\nDuring the thirteen and thirty-nine weeks ended November 2, 2025 and October 27, 2024, we had no borrowings under our Credit Facility. Additionally, as of November 2, 2025, issued but undrawn standby letters of credit of $12.0 million were outstanding under our Credit Facility. The standby letters of credit were primarily issued to secure the liabilities associated with workers’ compensation and other insurance programs.\nOur Credit Facility contains certain restrictive loan covenants, including, among others, a financial covenant requiring a maximum leverage ratio (funded debt adjusted for operating lease liabilities to earnings before interest, income tax, depreciation, amortization and rent expense), and covenants limiting our ability to incur indebtedness, grant liens, make acquisitions, merge or consolidate, and dispose of assets. As of November 2, 2025, we were in compliance with our financial covenants under our Credit Facility and, based on our current projections, we expect to remain in compliance throughout the next 12 months.\nLetter of Credit Facilities\nWe have three unsecured letter of credit facilities for a total of $35 million. Our letter of credit facilities contain covenants that are consistent with our Credit Facility. Interest on unreimbursed amounts under our letter of credit facilities accrues at a base rate as defined in the Credit Facility, plus an applicable margin based on our leverage ratio. As of November 2, 2025, the aggregate amount outstanding under our letter of credit facilities was $0.6 million, which represents only a future commitment to fund inventory purchases to which we had not taken legal title. On August 7, 2025, we renewed two of our letter of credit facilities totaling $30 million on substantially similar terms. The two letter of credit facilities mature on August 18, 2026, and the latest expiration date possible for future letters of credit issued under these facilities is January 15, 2027. One of the letter of credit facilities totaling $5 million matures on June 26, 2030, which is also the latest expiration date possible for future letters of credit issued under the facility.\nCash Flows from Operating Activities\nFor the first thirty-nine weeks of fiscal 2025, net cash provided by operating activities was $718.0 million compared to $726.7 million for the first thirty-nine weeks of fiscal 2024, and was primarily attributable to net earnings adjusted for non-cash items, partially offset by higher spending on merchandise inventories (as a result of increased tariff costs and timing of receipts). Net cash provided by operating activities compared to the first thirty-nine weeks of fiscal 2024 decreased primarily due to higher spending on merchandise inventories, partially offset by an increase in income taxes payable.\nCash Flows from Investing Activities\nFor the first thirty-nine weeks of fiscal 2025, net cash used in investing activities was $179.7 million compared to $154.0 million for the first thirty-nine weeks of fiscal 2024, and was primarily attributable to purchases of property and equipment related to technology, store construction and supply chain enhancements.\nCash Flows from Financing Activities\nFor the first thirty-nine weeks of fiscal 2025, net cash used in financing activities was $870.1 million compared to $1.0 billion for the first thirty-nine weeks of fiscal 2024, primarily driven by repurchases of our common stock, payment of dividends and remittance of tax withholdings related to stock-based awards. Net cash used in financing activities for the first thirty-nine weeks of fiscal 2025 decreased compared to the first thirty-nine weeks of fiscal 2024, due to a decrease in repurchases of our common stock.\n22\nTable of Contents\nSeasonality\nOur business is subject to substantial seasonal variations in demand. Historically, a significant portion of our revenues and net earnings have been realized during our peak selling season, the period from October through January, and levels of net revenues and net earnings have typically been lower during the period from February through September. We believe this is the general pattern within our industry. In preparation for and during our peak selling season, we hire a substantial number of additional temporary associates, primarily in our retail stores, distribution facilities and customer care centers.\nCRITICAL ACCOUNTING ESTIMATES\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations is based on our Condensed Consolidated Financial Statements, which have been prepared in accordance with U.S. GAAP. The preparation of these Condensed Consolidated Financial Statements requires us to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenues and expenses and related disclosures of contingent assets and liabilities. These estimates and assumptions are evaluated on an ongoing basis and are based on historical experience and various other factors that we believe to be reasonable under the circumstances. Actual results could differ significantly from these estimates. During the third quarter of fiscal 2025, there were no significant changes to the critical accounting estimates discussed in our Annual Report on Form 10-K for the fiscal year ended February 2, 2025."
}