{
  "source_file": "wst-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2.  MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nOVERVIEW\nThe following discussion is intended to further the reader’s understanding of the consolidated financial condition and results of operations of our Company. It should be read in conjunction with our condensed consolidated financial statements and accompanying notes elsewhere in this Quarterly Report on Form 10-Q (“Form 10-Q”) as well as Management’s Discussion and Analysis of Financial Condition and Results of Operations and the consolidated financial statements and accompanying notes included in our 2024 Annual Report. Our historical financial statements may not be indicative of our future performance. This Management’s Discussion and Analysis of Financial Condition and Results of Operations contains a number of forward-looking statements, all of which are based on our current expectations and could be affected by the uncertainties and risks discussed in Part I, Item 1A of our 2024 Annual Report and in Part II, Item 1A of this Form 10-Q.\nThroughout this section, references to “Notes” refer to the notes to our condensed consolidated financial statements (unaudited) in Part I, Item 1 of this Form 10-Q, unless otherwise indicated.\nNon-U.S. GAAP Financial Measures\nFor the purpose of aiding the comparison of our year-over-year results, we may refer to net sales and other financial results excluding the effects of changes in foreign currency exchange rates. Organic net sales exclude the impact from acquisitions and/or divestitures and translate the current-period reported sales of subsidiaries whose functional currency is other than USD at the applicable foreign exchange rates in effect during the comparable prior-year period. We may also refer to adjusted consolidated operating profit and adjusted consolidated operating profit margin, which exclude the effects of unallocated items. The unallocated items are not representative of ongoing operations, and generally include restructuring and related charges, certain asset impairments, and other specifically-identified income or expense items. The re-measured results excluding effects from currency translation, the impact from acquisitions and/or divestitures, and excluding the effects of unallocated items are not in conformity with U.S. GAAP and should not be used as a substitute for the comparable U.S. GAAP financial measures. The non-U.S. GAAP financial measures are incorporated in our discussion and analysis as management uses them in evaluating our results of operations and believes that this information provides users with a valuable insight into our overall performance and financial position.\nOur Operations\nWe are a leading global manufacturer in the design and production of technologically advanced, high-quality, integrated containment and delivery systems for injectable drugs and healthcare products. Our products include a variety of primary proprietary packaging, containment solutions, reconstitution and transfer systems, and drug delivery systems, as well as contract manufacturing, analytical lab services and integrated solutions. Our customers include leading biologic, generic, pharmaceutical, diagnostic, and medical device companies around the world. Our top priority is delivering quality products that meet the exact product specifications and quality standards customers require and expect. This focus on quality includes a commitment to excellence in manufacturing, scientific and technical expertise and management, which enables us to partner with our customers in order to deliver safe, effective drug products to patients quickly and efficiently.\nOur business operations are organized into two global segments, Proprietary Products and Contract-Manufactured Products. Our Proprietary Products reportable segment offers proprietary packaging, containment solutions and drug delivery systems, along with analytical lab services and other integrated services and solutions, primarily to biologic, generic and pharmaceutical drug customers. Our Contract-Manufactured Products reportable segment serves as a fully integrated business, focused on the design, manufacture, and automated assembly of complex devices, primarily for pharmaceutical, diagnostic, and medical device customers. We also maintain collaborations to share technologies and market products with affiliates in Japan and Mexico.\n27\nTable of Contents\nMacroeconomic Factors\nIn recent months, the U.S. government has imposed additional tariffs and trade restrictions on certain goods produced outside of the United States. In response to these actions, certain jurisdictions in which we operate have imposed or are considering imposing tariffs and restrictions on certain goods produced in the United States. We continue to monitor this dynamic situation to assess the impact of these tariffs on our business and actions we can take to minimize their impact. Based on the information available at this time, we do not believe the impact will be material to our 2025 results.\nWe have operations based in Israel that conduct research and development activities and manufacture certain components for our devices. Our Israel-based facilities continue to substantially operate as they had prior to the conflict in Israel and surrounding area. We continue to monitor the impact of the conflict in Israel and surrounding areas on our operations and those of our suppliers, the possible expansion of such conflict and potential geopolitical consequences, if any, on our business and operations.\nFinancial Performance Summary\nThe following tables present a reconciliation from U.S. GAAP to non-U.S. GAAP financial measures for the three and nine months ended \nSeptember 30, 2025:\n($ in millions, except per share data)\nOperating Profit\nIncome tax expense\nNet income\nDiluted EPS\nThree months ended September 30, 2025 U.S. GAAP\n$\n167.6 \n$\n34.0 \n$\n140.0 \n$\n1.92 \nUnallocated items:\nRestructuring and other charges \n(1)\n2.5 \n0.6 \n2.0 \n0.03 \nAmortization of acquisition-related intangible assets \n(2)\n— \n— \n0.4 \n0.01 \nThree months ended September 30, 2025 adjusted amounts (non-U.S. GAAP)\n$\n170.1 \n$\n34.6 \n$\n142.4 \n$\n1.96 \n($ in millions, except per share data)\nOperating profit\nIncome tax expense\nNet income\nDiluted EPS\nNine months ended September 30, 2025 U.S. GAAP\n$\n428.3 \n$\n88.3 \n$\n361.6 \n$\n4.97 \nUnallocated items:\nRestructuring and other charges \n(1)\n21.9 \n3.0 \n19.0 \n0.26 \nAmortization of acquisition-related intangible assets \n(2)\n0.2 \n— \n1.5 \n0.02 \nNine months ended September 30, 2025 adjusted amounts (non-U.S. GAAP)\n$\n450.4 \n$\n91.3 \n$\n382.1 \n$\n5.25 \nDuring the \nthree and nine months ended\n September 30, 2025, we recorded a tax benefit of $1.0 million and $3.9 million respectively, associated with stock-based compensation.\n28\nTable of Contents\nThe following tables present a reconciliation from U.S. GAAP to non-U.S. GAAP financial measures for the three and nine months ended \nSeptember 30, 2024:\n($ in millions, except per share data)\nOperating Profit\nIncome tax expense\nNet income\nDiluted EPS\nThree months ended September 30, 2024 U.S. GAAP\n$\n161.3 \n$\n32.4 \n$\n136.0 \n$\n1.85 \nUnallocated items:\nRestructuring and other charges \n(1)\n(0.9)\n(0.3)\n(0.6)\n(0.01)\nAmortization of acquisition-related intangible assets \n(2)\n0.2 \n0.1 \n0.7 \n0.01 \nThree months ended September 30, 2024 adjusted amounts (non-U.S. GAAP)\n$\n160.6 \n$\n32.2 \n$\n136.1 \n$\n1.85 \n($ in millions, except per share data)\nOperating Profit\nIncome tax expense\nNet income\nDiluted EPS\nNine months ended September 30, 2024 U.S. GAAP\n$\n410.3 \n$\n70.7 \n$\n362.6 \n$\n4.91 \nUnallocated items:\nRestructuring and other charges \n(1)\n(0.9)\n(0.3)\n(0.6)\n(0.01)\nAmortization of acquisition-related intangible assets \n(2)\n0.6 \n0.1 \n2.1 \n0.03 \nNine months ended September 30, 2024 adjusted amounts (non-U.S. GAAP)\n$\n410.0 \n$\n70.5 \n$\n364.1 \n$\n4.93 \nDuring the \nthree and nine months ended\n September 30, 2024, we recorded a tax benefit of $2.7 million and $19.3 million, respectively, associated with stock-based compensation.\n(1)\nDuring the\n \nthree and nine months ended\n September 30, 2025, the Company recorded charges of $2.5 million and $21.9 million, respectively, related to restructuring programs. \nDuring the\n \nthree and nine months ended\n September 30, 2025, the Company recorded $0.9 million and $17.5 million, respectively, of the charges within other expense (income), related to severance and acceleration of depreciation and lease costs in connection with the Company's 2025 restructuring plan. The Company recorded the remaining $1.6 million and $4.4 million, respectively, within selling, general and administrative expenses, related to our plan to optimize the legal structure of the Company and its subsidiaries. Restructuring and other charges were a net benefit of $0.9 million for the \nthree and nine months ended\n September 30, 2024. The net benefit represented the impact of two items, the first of which is a $2.5 million benefit recorded within other expense (income) related to revised severance estimates in connection with the Company's 2022 restructuring plan. This benefit was partially offset by $1.6 million of expense recorded within selling, general and administrative expenses, related to our plan to optimize the legal structure of the Company and its subsidiaries.\n(2)\nDuring the\n nine months ended September 30, 2025\n, the Company recorded\n $0.2 million \nof amortization expense within operating profit associated with an intangible asset acquired during \nthe second quarter of 2020. During the \nthree and nine months ended\n September 30, 2025, the Company recorded $0.4 million and $1.3 million, respectively, of amortization expense in association with an acquisition of increased ownership interest in Daikyo. During the \nthree and nine months ended\n September 30, 2024, \nthe Company recorded\n $0.2 million and $0.6 million, respectively, \nof amortization expense within operating profit associated with an intangible asset acquired during \nthe second quarter of 2020. During the \nthree and nine months ended\n September 30, 2024, the Company recorded $0.6 million and $1.6 million, respectively, of amortization expense \nin association with an acquisition of increased ownership interest in Daikyo.\n29\nTable of Contents\nRESULTS OF OPERATIONS\nWe evaluate the performance of our segments based upon, among other things, segment net sales and operating profit. Segment operating profit excludes general corporate costs, which include executive and director compensation, stock-based compensation, certain pension and other retirement benefit costs, and other corporate facilities and administrative expenses not allocated to the segments. Also excluded are items that we consider not representative of ongoing operations. Such items are referred to as other unallocated items for which further information can be found above in the reconciliation from U.S. GAAP to non-U.S. GAAP financial measures.\nPercentages in the following tables and throughout the \nResults of Operations \nsection may reflect rounding adjustments.\nNet Sales\nThe following table presents net sales, consolidated and by reportable segment, for the three months ended September 30, 2025 and 2024:\nThree Months Ended\nSeptember 30,\nPercentage Change\n($ in millions)\n2025\n2024\nAs-Reported\nOrganic\nProprietary Products\n$\n647.5 \n$\n601.4 \n7.7 \n%\n5.1 \n%\nContract-Manufactured Products\n157.1 \n145.5 \n8.0 \n%\n4.9 \n%\nConsolidated net sales\n$\n804.6 \n$\n746.9 \n7.7 \n%\n5.0 \n%\nConsolidated net sales increased by $57.7 million, or 7.7%, for the three months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $20.1 million. Excluding foreign currency translation effects, consolidated net sales for the three months ended September 30, 2025 increased by $37.6 million, or 5.0%, as compared to the same period in 2024.\nProprietary Products –\n Proprietary Products net sales increased by $46.1 million, or 7.7%, for the three months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $15.7 million. Excluding foreign currency translation effects, net sales for the three months ended September 30, 2025 increased by $30.4 million, or 5.1%, as compared to the same period in 2024, due primarily to an increase in sales of Westar®, Envision® and NovaBrand products. These increases were partially offset by a decline in sales of self-injection device platforms and approximately $19 million in customer incentives received in connection with volumes achieved during the three months ended September 30, 2024 that were not repeated in the same period in 2025. \nContract-Manufactured Products –\n Contract-Manufactured Products net sales increased by $11.6 million, or 8.0%, for the three months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $4.4 million. Excluding foreign currency translation effects, net sales for the three months ended September 30, 2025 increased by $7.2 million, or 4.9%, as compared to the same period in 2024, due primarily to an increase in sales of self-injection devices for obesity and diabetes, partially offset by a decrease in sales of healthcare diagnostic devices.\nThe following table presents net sales, consolidated and by reportable segment, for the nine months ended September 30, 2025 and 2024:\nNine Months Ended\nSeptember 30,\nPercentage Change\n($ in millions)\n2025\n2024\nAs-Reported\nOrganic\nProprietary Products\n$\n1,830.3 \n$\n1,720.6 \n6.4 \n%\n5.3 \n%\nContract-Manufactured Products\n438.8 \n423.8 \n3.5 \n%\n2.1 \n%\nConsolidated net sales\n$\n2,269.1 \n$\n2,144.4 \n5.8 \n%\n4.7 \n%\nConsolidated net sales increased by $124.7 million, or 5.8%, for the nine months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $24.9 million. \n30\nTable of Contents\nExcluding foreign currency translation effects, consolidated net sales for the nine months ended September 30, 2025 increased by $99.8 million, or 4.7%, as compared to the same period in 2024.\nProprietary Products –\n Proprietary Products net sales increased by $109.7 million, or 6.4%, for the nine months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $18.8 million. Excluding foreign currency translation effects, net sales for the nine months ended September 30, 2025 increased by $90.9 million, or 5.3%, as compared to the same period in 2024, due primarily to an increase in sales of Westar®, NovaBrand and Envision® products. These increases were partially offset by a decline in sales of FluroTec® products and approximately $22 million in customer incentives received in connection with volumes achieved during the nine months ended September 30, 2024 that were not repeated in the same period in 2025. \nContract-Manufactured Products –\n Contract-Manufactured Products net sales increased by $15.0 million, or 3.5%, for the nine months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $6.1 million. Excluding foreign currency translation effects, net sales for the nine months ended September 30, 2025 increased by $8.9 million, or 2.1%, as compared to the same period in 2024, due primarily to an increase in sales of self-injection devices for obesity and diabetes, partially offset by a decrease in sales of healthcare diagnostic devices.\nGross Profit\nThe following table presents gross profit and related gross profit margins, consolidated and by reportable segment:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n($ in millions)\n2025\n2024\n2025\n2024\nProprietary Products:\n \n \nGross profit\n$\n264.0 \n$\n235.7 \n$\n722.5 \n$\n649.8 \nGross profit margin\n40.8 \n%\n39.2 \n%\n39.5 \n%\n37.8 \n%\nContract-Manufactured Products:\n \n \n \nGross profit\n$\n30.3 \n$\n29.0 \n$\n77.6 \n$\n75.1 \nGross profit margin\n19.3 \n%\n19.9 \n%\n17.7 \n%\n17.7 \n%\nConsolidated gross profit\n$\n294.3 \n$\n264.7 \n$\n800.1 \n$\n724.9 \nConsolidated gross profit margin\n36.6 \n%\n35.4 \n%\n35.3 \n%\n33.8 \n%\nConsolidated gross profit increased by $29.6 million, or 11.2%, for the three months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $8.6 million for the three months ended September 30, 2025, as compared to the same period in 2024. Consolidated gross profit margin increased by 1.2 margin points for the three months ended September 30, 2025, as compared to the same period in 2024.\nConsolidated gross profit increased by $75.2 million, or 10.4%, for the nine months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $11.8 million for the nine months ended September 30, 2025, as compared to the same period in 2024. Consolidated gross profit margin increased by 1.5 margin points for the nine months ended September 30, 2025, as compared to the same period in 2024.\nProprietary Products - \nProprietary Products gross profit increased by $28.3 million, or 12.0%, for the three months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $7.8 million\n. Proprietary Products gross profit margin increased by 1.6 margin points for the three months ended September 30, 2025, as compared to the same periods in 2024, \ndue primarily\n to\n higher plant absorption from increased customer demand and sales price increases. These increases were partially offset by approximately $19 million in customer incentives received in connection with volumes achieved during the three months ended September 30, 2024 that were not repeated in the same period in 2025.\n31\nTable of Contents\nProprietary Products gross profit increased by $72.7 million, or 11.2%, for the nine months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $10.7 million\n. Proprietary Products gross profit margin \nincreased\n by \n1.7\n margin points for the \nnine months ended \nSeptember 30, 2025, as compared to the same periods in 2024, \ndue primarily to higher plant absorption from increased customer demand and sales price increases. These increases were partially offset by approximately $22 million in customer incentives received in connection with volumes achieved during the nine months ended September 30, 2024 that were not repeated in the same period in 2025. \nContract-Manufactured Products - \nContract-Manufactured Products gross profit increased by $1.3 million, or 4.5%, for the three months ended September 30, 2025\n, as compared to the same period in 2024, including a \nfavorable f\noreign currency translation impact of $0.8 million. Contract-Manufactured Products gross profit margin decreased by 0.6 margin points for the three months ended September 30, 2025, as compared to the same period in 2024, \ndue primarily to increased production costs, partially offset by sales price increases.\nContract-Manufactured Products gross profit increased by $2.5 million, or 3.3%, for the nine months ended September 30, 2025\n, as compared to the same period in 2024, including a\n favorable fo\nreign currency translation impact of $1.1 million. Contract-Manufactured Products gross profit margin remained flat in the \nnine months ended\n September 30, 2025, as compared to the same period in 2024.\nResearch and Development (“R&D”) Costs\nThe following table presents consolidated R&D costs:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n($ in millions)\n2025\n2024\n2025\n2024\nConsolidated R&D costs\n$\n17.1 \n$\n15.5 \n$\n52.5 \n$\n50.6 \nConsolidated R&D costs increased by $1.6 million, \nor 10.3%, and \n$1.9 million, or 3.8% \nfor the three and nine months ended \nSeptember 30, 2025\n, respectively, as compared to the same period in 2024\n.\n \nEfforts remain focused on the continued investment in elastomeric packaging components, formulation development, drug containment systems, self-injection systems and drug administration consumable.\nAll of the R&D costs incurred in the \nthree and nine months ended September 30, 2025\n and \n2024\n related to Proprietary Products.\nSelling, General and Administrative (“SG&A”) Costs\nThe following table presents SG&A costs, consolidated and by reportable segment and corporate and unallocated items:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n($ in millions)\n2025\n2024\n2025\n2024\nProprietary Products\n$\n65.6 \n$\n56.6 \n$\n187.4 \n$\n173.4 \nContract-Manufactured Products\n7.5 \n6.7 \n22.1 \n19.1 \nCorporate and unallocated items\n29.6 \n20.2 \n77.1 \n60.7 \nConsolidated SG&A costs\n$\n102.7 \n$\n83.5 \n$\n286.6 \n$\n253.2 \nSG&A as a % of net sales\n12.8 \n%\n11.2 \n%\n12.6 \n%\n11.8 \n%\nConsolidated SG&A costs increased by $19.2 million, or 23.0%\n, for the three months ended September 30, 2025, as compared to the same period in 2024,\n including an unfavorable foreign currency translation impact of \n$1.2 million\n, due primarily to higher annual incentive compensation, increased salary and wages and increased expense related to stock-based compensation. \n32\nTable of Contents\nConsolidated SG&A costs increased by $33.4 million, or 13.2%\n, for the \nnine months ended\n September 30, 2025, as compared to the same period in 2024,\n including an unfavorable foreign currency translation impact of \n$1.3 million\n, due primarily to higher annual incentive compensation and increased salary and wages, partially offset by decreased costs related to professional services.\nProprietary Products - \nProprietary Products SG&A costs increased by \n$9.0 million\n, or 15.9%, for the three months ended September 30, 2025, as compared to the same period in 2024, \nincluding an unfavorable foreign currency translation impact of \n$1.1 million. Proprietary Products SG&A costs increased \ndue primarily to higher annual incentive compensation and increased salary and wages, partially offset by decreased costs related to professional services.\nProprietary Products SG&A costs \nincreased\n by \n$14.0 million\n, or \n8.1%\n, for the \nnine months ended\n September 30, 2025, as compared to the same period in 2024, \nincluding an unfavorable foreign currency translation impact of \n$1.1 million. Proprietary Products SG&A costs \nincreased\n \ndue primarily to higher annual incentive compensation and increased salary and wages, partially offset by decreased costs related to professional services. \nContract-Manufactured Products - \nContract-Manufactured Products SG&A costs increased by \n$0.8 million\n, or 11.9%, for the three months ended September 30, 2025, as compared to the same period in 2024, \nincluding an unfavorable foreign currency translation impact of \n$0.1 million\n, \ndue \nprimarily to higher annual incentive compensation and increased salary and wages.\nContract-Manufactured Products SG&A costs \nincreased\n by \n$3.0 million\n, or \n15.7%\n, for the \nnine months ended\n September 30, 2025, as compared to the same period in 2024,\n including an unfavorable foreign currency translation impact of \n$0.2 million\n, \ndue \nprimarily to increased salary and wages and higher annual incentive compensation.\nCorporate and unallocated items - \nCorporate SG&A costs increased by \n$9.4 million\n, or 46.5%, for the three months ended September 30, 2025, as compared to the same period in 2024, \ndue primarily to an increase in expense related to stock-based compensation, higher annual incentive compensation and increased salary and wages. \nCorporate SG&A costs \nincreased\n by \n$16.4 million\n, or \n27.0%\n, for the \nnine months ended\n September 30, 2025, as compared to the same period in 2024, \ndue primarily to expenses in connection with a plan to optimize the legal structure of the Company and its subsidiaries, higher annual incentive compensation, increased expense related to stock-based compensation and increased costs related to professional services.\nOther Expense (Income)\nThe following table presents other income and expense items, consolidated and by reportable segment, corporate and unallocated items:\nExpense (Income) \nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n($ in millions)\n2025\n2024\n2025\n2024\nProprietary Products\n$\n6.1 \n$\n5.4 \n$\n15.1 \n$\n10.3 \nContract-Manufactured Products\n0.5 \n0.5 \n1.9 \n(0.1)\nCorporate and unallocated\n0.3 \n(1.5)\n15.7 \n0.6 \nConsolidated other expense (income)\n$\n6.9 \n$\n4.4 \n$\n32.7 \n$\n10.8 \nOther expense and income items consist of restructuring and related charges, foreign exchange transaction gains and losses, contingent consideration, asset impairments and miscellaneous income and charges.\nConsolidated other expense (income) changed by $2.5 million for the three months ended September 30, 2025, as compared to the same period in 2024, and changed by $21.9 million for the \nnine months ended \nSeptember 30, 2025, as compared to the same period in 2024,\n due to the factors described below.\nProprietary Products -\n Proprietary Products other expense (income)\n changed by $0.7 million for the three months ended September 30, 2025, as compared to the same period in 2024, due primarily to increased contingent consideration expense being recorded in the three months ended September 30, 2025, as compared to the same period in 2024.\n33\nTable of Contents\nProprietary Products other expense (income)\n changed by $4.8 million for the nine months ended September 30, 2025, as compared to the same period in 2024, due primarily to increased contingent consideration expense being recorded in the nine months ended September 30, 2025, as compared to the same period in 2024.\nContract-Manufa\nctured Products - \nContract-Manufactured Products \nother expense (income)\n remained flat in the \nthree months ended\n \nSeptember 30, 2025\n, as compared to the same period in \n2024.\nContract-Manufactured Products \nother expense (income)\n changed by $2.0 million for the nine months ended \nSeptember 30, 2025\n, as compared to the same period in \n2024, \ndue primarily to increased foreign exchange losses in the nine months ended September 30, 2025, as compared to the same period in 2024.\nCorporate and unallocated items - \nCorporate and unallocated items changed by $1.8 million for the \nthree months ended\n \nSeptember 30, 2025\n, as compared to the same period in \n2024\n, due primarily to the Company recording expense of $0.9 million to related to restructuring and other charges during the three months ended September 30, 2025, as compared to a net benefit of $2.5 million during the same period in 2024.\nCorporate and unallocated items changed by $15.1 million for the nine months ended September 30, 2025, as compared to the same period in 2024, due primarily to the Company recording expense of $17.5 million related to restructuring and other charges in the nine months ended September 30, 2025, as compared to a net benefit of $2.5 million during the same period in 2024.\nOperating Profit\nThe following table presents adjusted operating profit, consolidated and by reportable segment, corporate and unallocated items:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n($ in millions)\n2025\n2024\n2025\n2024\nProprietary Products\n$\n175.2 \n$\n158.2 \n$\n467.5 \n$\n415.5 \nContract-Manufactured Products\n22.3 \n21.8 \n53.6 \n56.1 \nCorporate and unallocated items\n(29.9)\n(18.7)\n(92.8)\n(61.3)\nConsolidated operating profit\n$\n167.6 \n$\n161.3 \n$\n428.3 \n$\n410.3 \nConsolidated operating profit margin\n20.8 \n%\n21.6 \n%\n18.9 \n%\n19.1 \n%\nUnallocated items\n2.5 \n(0.7)\n22.1 \n(0.3)\nAdjusted consolidated operating profit\n$\n170.1 \n$\n160.6 \n$\n450.4 \n$\n410.0 \nAdjusted consolidated operating profit margin\n21.1 \n%\n21.5 \n%\n19.8 \n%\n19.1 \n%\nConsolidated operating profit increased by $6.3 million, or 3.9%, for the three months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $7.3 million for the three months ended September 30, 2025, as compared to the same period in 2024.\nConsolidated operating profit increased by $18.0 million, or 4.4%, for the nine months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $10.5 million for the nine months ended September 30, 2025, as compared to the same period in 2024.\nProprietary Products - \nProprietary Products operating profit increased by $17.0 million, or 10.7%, for the three months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impa\nct of \n$6.6 million\n, due to the factors described above, most no\ntably higher plant absorption from increased customer demand and sales price increases.\nProprietary Products operating profit increased by $52.0 million, or 12.5%, for the nine months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of $9.6 million, due to the factors described above, most notably higher plant absorption from increased customer demand and sales price increases.\n34\nTable of Contents\nContract-Manufactured Produ\ncts - \nContract-Manufactured Products operating profit increased by \n$0.5 million\n, or 2.3%, for the three months ended September 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of \n$0.7 million\n, due to the factors described abov\ne.\nContract-Manufactured Products operating profit \ndecreased\n by \n$2.5 million\n, or \n4.5%\n, for the \nnine months ended \nSeptember 30, 2025, as compared to the same period in 2024, including a favorable foreign currency translation impact of \n$0.9 million\n, due to the factors described above,\n most notably increased salary and wages.\nCorporate and unallocated - \nExcluding the unallocated items, Corporate costs increased by $8.0 million, or 41.2%, for the three months ended September 30, 2025, as compared \nto the same period in 2024, due to the factors described above, most not\nably the increase in expense related to stock-based compensation.\nExcluding the unallocated items, Corporate costs increased by $9.1 million, or 14.8%, for the nine months ended September 30, 2025, as compared \nto the same period in 2024, due to the factors described above, most notably\n the higher annual incentive compensation.\nFor unallocated items, please refer to the Financial Performance Summary section above for details.\nInterest Expense, Net and Interest Income\nThe following table presents interest expense, net, by significant component:\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n($ in millions)\n2025\n2024\n2025\n2024\nInterest expense\n$\n4.2 \n$\n5.0 \n$\n12.5 \n$\n12.2 \nCapitalized interest\n(4.0)\n(4.3)\n(11.8)\n(8.4)\nInterest expense, net\n$\n0.2 \n$\n0.7 \n$\n0.7 \n$\n3.8 \nInterest income\n$\n(4.7)\n$\n(4.6)\n$\n(12.4)\n$\n(14.8)\nInterest expense, net, decreased by $0.5 million, for the three months ended September 30, 2025, as compared to the same period in 2024, due primarily to a decline in interest rates in 2025, as compared to the same periods in 2024. Interest expense, net, decreased by $3.1 million, for the nine months ended September 30, 2025, as compared to the same period in 2024, due primarily to an increase in capitalized interest.\nInterest income increased by $0.1 million for the three months ended September 30, 2025, as compared to the same period in 2024. Interest income decreased by $2.4 million for the nine months ended September 30, 2025, as compared to the same period in 2024, due primarily to a decline in interest rates in 2025, as compared to the same periods in 2024.\nOther Nonoperating Expense (Income)\nOther nonoperating expense (income) was $0.2 million and $0.7 million for the three months ended September 30, 2025 and 2024, respectively, and $0.6 million and $0.7 million for the nine months ended September 30, 2025 and 2024, respectively.\nIncome Tax Expense\nThe provision for income taxes was $34.0 million and $32.4 million for the three months ended September 30, 2025 and 2024, respectively, and the effective tax rate was 19.8% and 19.7%, respectively.\nThe provision for income taxes was $88.3 million and $70.7 million for the nine months ended September 30, 2025 and 2024, respectively, and the effective tax rate was 20.1% and 16.8%, respectively. The increase in the effective tax rate is due primarily to a decrease in the tax benefit related to stock-based compensation in the nine months ended September 30, 2025 as compared to the same period in 2024.\n35\nTable of Contents\nEquity in Net Income of Affiliated Companies\nEquity in net income of affiliated companies was $2.1 million and $3.9 million for the three months ended September 30, 2025 and 2024, respectively. Equity in net income of affiliated companies decreased by $1.8 million for the three months ended September 30, 2025, as compared to the same period in 2024, due primarily to less favorable operating results at Daikyo and the Mexico affiliates.\nEquity in net income of affiliated companies was $10.5 million and $12.7 million for the nine months ended September 30, 2025 and 2024, respectively. Equity in net income of affiliated companies decreased by $2.2 million for the nine months ended September 30, 2025, as compared to the same period in 2024, due primarily to less favorable operating results at Daikyo, partially offset by more favorable operating results at the Mexico affiliates.\nFINANCIAL CONDITION, LIQUIDITY AND CAPITAL RESOURCES\nCash Flows\nThe following table presents cash flow data for the nine months ended September 30:\n($ in millions)\n2025\n2024\nNet cash provided by operating activities\n$\n503.7 \n$\n463.3 \nNet cash used in investing activities\n$\n(209.8)\n$\n(273.9)\nNet cash used in financing activities\n$\n(173.4)\n$\n(553.7)\nNet Cash Provided by Operating Activities –\n Net cash provided by operating activities increased by $40.4 million for the nine months ended September 30, 2025, as compared to the same period in 2024, due primarily to favorable working capital management. \nNet Cash Used in Investing Activities –\n Net cash used in investing activities decreased by $64.1 million for the nine months ended September 30, 2025, as compared to the same period in 2024, due primarily to a decrease in capital expenditures.\nNet Cash Used in Financing Activities –\n Net cash used in financing activities decreased by $380.3 million for the nine months ended September 30, 2025, as compared to the same period in 2024, due primarily to a decrease in purchases under our share repurchase programs.\nLiquidity and Capital Resources\nThe table below presents selected liquidity and capital measures:\n($ in millions)\nSeptember 30,\n2025\nDecember 31,\n2024\nCash and cash equivalents\n$\n628.5 \n$\n484.6 \nAccounts receivable, net\n$\n625.0 \n$\n552.5 \nInventories\n$\n438.0 \n$\n377.0 \nAccounts payable\n$\n255.8 \n$\n239.3 \nDebt\n$\n202.7 \n$\n202.6 \nEquity\n$\n3,051.5 \n$\n2,682.3 \nWorking capital\n$\n1,187.9 \n$\n987.7 \nCash and cash equivalents include all instruments that have maturities of ninety days or less when purchased. Working capital is defined as current assets less current liabilities. \nCash and cash equivalents –\n Our cash and cash equivalents balance at September 30, 2025 consisted of cash held in depository accounts with banks around the world and cash invested in high-quality, short-term investments. The cash and cash equivalents balance at September 30, 2025 included $96.6 million of cash held by subsidiaries within the U.S., and $531.9 million of cash held by subsidiaries outside of the U.S. During the nine months ended September 30, 2025, we purchased 552,593 shares of our common stock under the share repurchase program at a cost of $134.0 million, or an average price of $242.55 per share.\n36\nTable of Contents\nWorking capital –\n Working capital at September 30, 2025 increased by $200.2 million, or 20.3%, as compared to December 31, 2024, which includes a favorable foreign currency translation impact of \n$48.8 million\n. Excluding the impact of currency exchange rates, cash and cash equivalents, total current liabilities, accounts receivable and inventories \nincreased\n by \n$118.8 million, $53.9 million, $43.4 million and $36.4 million\n, respectively.\nThe \nincrease\n in cash and cash equivalents was \ndue to cash from operations, partially offset by share repurchases and capital expenditures during the nine months ended September 30, 2025. \nThe \nincrease\n in total current liabilities was \ndriven by increases in our annual incentives and short-term hedge liabilities. The increase in accounts receivable was due to increased net sales leading up to the \nSeptember 30, 2025\n balance sheet date as compared to the \nDecember 31, 2024\n balance sheet date. \nThe \nincrease\n in inventories was to ensure we have sufficient inventory on hand to support the needs of our customers\n.\nDebt and credit facilities –\n The total debt balance of $202.7 million at September 30, 2025 increased $0.1 million from the total debt balance at December 31, 2024.\nOur sources of liquidity include our multi-currency revolving credit facility. At September 30, 2025, we had no outstanding borrowings under the multi-currency revolving credit facility. At September 30, 2025, the borrowing capacity available under the multi-currency revolving credit facility, including outstanding letters of credit of $2.3 million, was $497.7 million. We do not expect any significant limitations on our ability to access this source of funds.\nPursuant to the financial covenants in our debt agreements, we are required to maintain established interest coverage ratios and not to exceed established leverage ratios. In addition, the agreements contain other customary covenants, none of which we consider restrictive to our operations. At September 30, 2025, we were in compliance with all of our debt covenants.\nWe believe that cash on hand and cash generated from operations, together with availability under our multi-currency revolving credit facility, will be adequate to address our foreseeable liquidity needs based on our current expectations of our business operations, capital expenditures and scheduled payments of debt obligations.\nCommitments and Contractual Obligations\nA summary of future material cash payments resulting from commitments and contractual obligations was provided in our 2024 Annual Report. During the three months ended September 30, 2025, there were no material changes outside of the ordinary course of business to our commitments and contractual obligations.\nOFF-BALANCE SHEET ARRANGEMENTS\nAt September 30, 2025, we had no off-balance sheet financing arrangements other than unconditional purchase obligations incurred in the ordinary course of business and outstanding letters of credit related to various insurance programs, as noted in our 2024 Annual Report.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nThere have been no changes to the Critical Accounting Policies and Estimates disclosed in Part II, Item 7 of our 2024 Annual Report.\nNEW ACCOUNTING STANDARDS\nFor information on new accounting standards see Note 2, \nNew Accounting Standards\n, within Item 1 of this report.\n37\nTable of Contents\nCAUTIONARY STATEMENT REGARDING FORWARD-LOOKING STATEMENTS \nOur disclosure and analysis in this Form 10-Q contains some forward-looking statements that are based on management’s beliefs and assumptions, current expectations, estimates and forecasts. We also provide forward-looking statements in other materials we release to the public, as well as oral forward-looking statements. Such statements provide our current expectations or forecasts of future events. They do not relate strictly to historical or current facts. We have attempted, wherever possible, to identify forward-looking statements by using words such as “plan,” “expect,” “believe,” “intend,” “will,” “estimate,” “continue” and other words of similar meaning in conjunction with, among other things, discussions of future operations and financial performance, as well as our strategy for growth, product development, market position and expenditures. All statements that address operating performance or events or developments that we expect or anticipate will occur in the future - including statements relating to sales and earnings per share growth, cash flows or uses, and statements expressing views about future operating results - are forward-looking statements.\nForward-looking statements are based on current expectations of future events. The forward-looking statements are, and will be, based on management’s then-current views and assumptions regarding future events and operating performance, and speak only as of their dates. Investors should realize that, if underlying assumptions prove inaccurate or unknown risks or uncertainties materialize, actual results could vary materially from our expectations and projections. Investors are therefore cautioned not to place undue reliance on any forward-looking statements.\nThe following are some important factors that could cause our actual results to differ from our expectations in any forward-looking statements: \n•\nsales demand and our ability to meet that demand;\n•\ncompetition from other providers in our businesses, including customers’ in-house operations, and from lower-cost producers in emerging markets, which can impact unit volume, price and profitability;\n•\ncustomers’ changing inventory requirements and manufacturing plans that alter existing orders or ordering patterns for the products we supply to them;\n•\ninterruptions or weaknesses in our supply chain, including from reasons beyond our control such as extreme weather, longer-term climate changes, natural disasters, pandemic, war, accidental damage, or unauthorized access to our or our customers’ information and systems, which could cause delivery delays or restrict the availability of raw materials, key purchased components and finished products;\n•\nthe timing, regulatory approval and commercial success of customer products that incorporate our products and systems;\n•\nwhether customers agree to incorporate our products and delivery systems with their new and existing drug products, the ultimate timing and successful commercialization of those products and systems, which involves substantial evaluations of the functional, operational, clinical and economic viability of our products, and the rate, timing and success of regulatory approval for the drug products that incorporate our components and systems;\n•\nthe timely and adequate availability of filling capacity, which is essential to conducting definitive stability trials and the timing of first commercialization of customers’ products in Crystal Zenith prefilled syringes;\n•\nprofitability, or mix, of the products sold in any reporting period, including lower-than-expected sales growth of our high-value proprietary product offerings;\n•\nmaintaining or improving production efficiencies and overhead absorption;\n•\ndependence on third-party suppliers and partners, some of which are single-source suppliers of critical materials and products, including our Japanese partner and affiliate, Daikyo;\n•\nthe loss of key personnel or highly-skilled employees;\n38\nTable of Contents\n•\nthe availability and cost of skilled employees required to meet increased production, managerial, research and other needs, including professional employees and persons employed under collective bargaining agreements;\n•\nthe successful and timely implementation of price increases necessary to offset rising production costs, including raw material prices, particularly petroleum-based raw materials;\n•\nthe cost and progress of development, regulatory approval and marketing of new products;\n•\nour ability to obtain and maintain licenses in any jurisdiction in which we do business;\n•\nthe relative strength of USD in relation to other currencies, particularly the Euro, SGD, the Danish Krone, Yen, Colombian Peso, Brazilian Real, and the South Korean Won; and\n•\nthe potential adverse effects of global healthcare legislation on customer demand, product pricing and profitability.\nThis list sets forth many, but not all, of the factors that could affect our ability to achieve results described in any forward-looking statements. Investors should understand that it is not possible to predict or identify all of the factors and should not consider this list to be a complete statement of all potential risks and uncertainties. For further discussion of these and other factors, see the risk factors disclosed in Part I, Item 1A of our 2024 Annual Report as well as Part II, section 1A of this quarterly report. \nExcept as required by law or regulation, we undertake no obligation to publicly update any forward-looking statements, whether as a result of new information, future events or otherwise."
}