{
  "source_file": "wtw-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF\n FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis discussion includes forward-looking statements. See ‘Disclaimer Regarding Forward-looking Statements’ for certain cautionary information regarding forward-looking statements and a list of factors that could cause actual results to differ materially from those predicted in those statements.\nThis discussion includes references to non-GAAP financial measures as defined in the rules of the SEC. We present such non-GAAP financial measures, specifically, adjusted, constant currency and organic non-GAAP financial measures, as we believe such information is of interest to the investment community because it provides additional meaningful methods of evaluating certain aspects of the Company’s operating performance from period to period on a basis that may not be otherwise apparent under U.S. GAAP, and these provide a measure against which our businesses may be assessed in the future.\nSee ‘Non-GAAP Financial Measures’ below for further discussion of our adjusted, constant currency and organic non-GAAP financial measures.\nExecutive Overview\nImpact of Market Conditions on Our Business\nTypically, our business benefits from regulatory change, political risk or economic uncertainty. Insurance broking generally tracks the economy, but demand for both insurance broking and consulting services usually remains steady during times of uncertainty. We have some businesses, such as our health and benefits and administration businesses, which can be counter cyclical during the early period of a significant economic change.\nWithin our insurance and brokerage business, due to the cyclical nature of the insurance market and the impact of other market conditions on insurance premiums, commission revenue may vary widely between accounting periods. A period of low or declining premium rates, generally known as a ‘soft’ or ‘softening’ market, generally leads to downward pressure on commission revenue and can have a material adverse impact on our revenue and operating margin. A ‘hard’ or ‘firming’ market, during which premium rates rise, generally has a favorable impact on our revenue and operating margin. Rates, however, vary by geography, industry and client segment. As a result, and due to the global and diverse nature of our business, we view rates in the aggregate. Overall, at the time of filing this Quarterly Report, we are seeing a softening market.\nMarket conditions in the broking industry in which we operate are generally defined by factors such as the strength of the various geographical economies which we serve around the world, insurance rate movements, and insurance and reinsurance buying patterns of our clients.\nThe markets for our consulting, technology and solutions, and marketplace services are affected by economic, regulatory and legislative changes, technological developments, and increased competition from established and new competitors. We believe that the primary factors in selecting a human resources or risk management consulting company include reputation, the ability to provide measurable increases to shareholder value and return on investment, global scale, quality of service and the ability to tailor services to clients’ unique needs. In that regard, we are focused on developing and implementing technology, data and analytic solutions for both internal operations and for maintaining industry standards and meeting client preferences. We have made such investments from time to time and may decide, based on perceived business needs, to make investments in the future that may be different from past practice or our current expectations.\nWith regard to the market for exchanges, we believe that clients base their decisions on a variety of factors that include the role of health care coverage in recruiting/retaining employees and transitioning employees to retirement, the availability of price competitive individual insurance policies, the array of coverage choices available through the exchange provider and its ability to deliver measurable cost savings for corporate clients, and to both execute efficiently and deliver high quality service. Since the individual insurance market for Medicare policies is well-established and a significant portion of corporate employers have already implemented an exchange for their Medicare retirees, growth in this population segment will be derived from public employers and educational and other not-for-profit institutions. This growth may be more episodic in nature. Growth in other population segments is likely to remain low unless a more competitive individual insurance market emerges for these segments.\nRisks and Uncertainties of the Economic Environment\n \nU.S. and global markets are continuing to experience uncertainty, volatility and disruption as a result of uncertain macroeconomic conditions including tariff actions and uncertainties relating to global trade, fluctuations in currency exchange rates, volatility in debt and equity markets, uncertainty around interest rates, softening consumer confidence and labor markets, the implementation of a broad range of U.S. policy changes, and the ongoing Russia-Ukraine and other geopolitical conflicts and tensions. Although the length and impact of these situations are highly unpredictable, the ongoing uncertainty and volatility of the global economy and capital markets,\n \n\n\n31\n\n\n\n\n \n\n\nwhich has resulted in persistent inflation and fluctuating interest rates in many of the markets in which we operate, could accelerate recessionary pressures and continue to lead to further market disruptions. Further, in addition to the direct impact of the continuing dynamic tariff environment on our business (which we do not expect to be significant, so long as retaliatory actions do not extend to services), recent U.S. legislation and other U.S. federal government actions continue to create uncertainty for the business as well as accounting and tax matters. Other indirect impacts from changes in tariffs or from legislative or regulatory developments, such as changes in consumer sentiment, trade relations, economic activity, disruption of U.S. federal government operations, willingness to do business with U.S.-listed firms, inflationary pressures and employee distraction, among others, could negatively affect our business, operations and financial condition.\nThese general economic conditions, including inflation, stagflation, political volatility, costs of labor, cost of capital, interest rates, bank stability, credit availability and tax rates, affect not only the cost of and access to liquidity, but also our costs to run and invest in our business, including our operating and general and administrative expenses, and we have no control or limited ability to control such factors. These general economic conditions impact revenue from customers, as well as income from funds we hold on behalf of customers and pension-related income. While parts of our business could benefit from uncertainty or regulatory change, we may see increased caution in spending on services we provide that are more discretionary in nature or where there are alternatives, such as self-insurance. Other parts of our business, such as M&A-related services, may be adversely impacted when there is lower economic activity or transaction volumes.\nIf our costs grow significantly in excess of our ability to raise revenue, whether as a result of the foregoing global economic factors or otherwise, our margins and results of operations may be materially and adversely impacted and we may not be able to achieve our strategic and financial objectives.\nSee Part I, Item 1A ‘Risk Factors’ in our Annual Report on Form 10-K, filed with the SEC on February 25, 2025, for a discussion of risks that may affect, among other things, our growth relative to expectation and our ability to achieve our objectives.\nFinancial Statement Overview\nThe table below sets forth our summarized condensed consolidated statements of comprehensive income and data as a percentage of revenue for the periods indicated.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended September 30,\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions, except per share data)\n\n\n \n\n\n\n\n\n\nRevenue\n\n\n \n\n\n$\n\n\n2,288\n\n\n \n\n\n \n\n\n \n\n\n100\n\n\n%\n\n\n \n\n\n$\n\n\n2,289\n\n\n \n\n\n \n\n\n \n\n\n100\n\n\n%\n\n\n \n\n\n$\n\n\n6,772\n\n\n \n\n\n \n\n\n \n\n\n100\n\n\n%\n\n\n \n\n\n$\n\n\n6,895\n\n\n \n\n\n \n\n\n \n\n\n100\n\n\n%\n\n\n\n\n\n\nCosts of providing services\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSalaries and benefits\n\n\n \n\n\n \n\n\n1,413\n\n\n \n\n\n \n\n\n \n\n\n62\n\n\n%\n\n\n \n\n\n \n\n\n1,396\n\n\n \n\n\n \n\n\n \n\n\n61\n\n\n%\n\n\n \n\n\n \n\n\n4,186\n\n\n \n\n\n \n\n\n \n\n\n62\n\n\n%\n\n\n \n\n\n \n\n\n4,135\n\n\n \n\n\n \n\n\n \n\n\n60\n\n\n%\n\n\n\n\n\n\nOther operating expenses\n\n\n \n\n\n \n\n\n352\n\n\n \n\n\n \n\n\n \n\n\n15\n\n\n%\n\n\n \n\n\n \n\n\n419\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n%\n\n\n \n\n\n \n\n\n1,053\n\n\n \n\n\n \n\n\n \n\n\n16\n\n\n%\n\n\n \n\n\n \n\n\n1,315\n\n\n \n\n\n \n\n\n \n\n\n19\n\n\n%\n\n\n\n\n\n\nImpairment\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n \n\n\n \n\n\n46\n\n\n%\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n \n\n\n \n\n\n15\n\n\n%\n\n\n\n\n\n\nDepreciation\n\n\n \n\n\n \n\n\n56\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n%\n\n\n \n\n\n \n\n\n60\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n \n\n\n \n\n\n167\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n%\n\n\n \n\n\n \n\n\n176\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n\n\n\n\nAmortization\n\n\n \n\n\n \n\n\n47\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n%\n\n\n \n\n\n \n\n\n56\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n%\n\n\n \n\n\n \n\n\n144\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n%\n\n\n \n\n\n \n\n\n176\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n29\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n74\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n296\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n%\n\n\n\n\n\n\nTotal costs of providing services\n\n\n \n\n\n \n\n\n1,870\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n3,055\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n5,554\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n7,169\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIncome/(loss) from operations\n\n\n \n\n\n \n\n\n418\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n%\n\n\n \n\n\n \n\n\n(766\n\n\n)\n\n\n \n\n\n \n\n\n(33\n\n\n)%\n\n\n \n\n\n \n\n\n1,218\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n%\n\n\n \n\n\n \n\n\n(274\n\n\n)\n\n\n \n\n\n \n\n\n(4\n\n\n)%\n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n(65\n\n\n)\n\n\n \n\n\n \n\n\n(3\n\n\n)%\n\n\n \n\n\n \n\n\n(65\n\n\n)\n\n\n \n\n\n \n\n\n(3\n\n\n)%\n\n\n \n\n\n \n\n\n(194\n\n\n)\n\n\n \n\n\n \n\n\n(3\n\n\n)%\n\n\n \n\n\n \n\n\n(197\n\n\n)\n\n\n \n\n\n \n\n\n(3\n\n\n)%\n\n\n\n\n\n\nOther income/(loss), net\n\n\n \n\n\n \n\n\n37\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n%\n\n\n \n\n\n \n\n\n(1,167\n\n\n)\n\n\n \n\n\n \n\n\n(51\n\n\n)%\n\n\n \n\n\n \n\n\n(18\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n(1,118\n\n\n)\n\n\n \n\n\n \n\n\n(16\n\n\n)%\n\n\n\n\n\n\nINCOME/(LOSS) FROM OPERATIONS BEFORE\n   INCOME TAXES AND INTEREST IN EARNINGS\n  OF ASSOCIATES\n\n\n \n\n\n \n\n\n390\n\n\n \n\n\n \n\n\n \n\n\n17\n\n\n%\n\n\n \n\n\n \n\n\n(1,998\n\n\n)\n\n\n \n\n\n \n\n\n(87\n\n\n)%\n\n\n \n\n\n \n\n\n1,006\n\n\n \n\n\n \n\n\n \n\n\n15\n\n\n%\n\n\n \n\n\n \n\n\n(1,589\n\n\n)\n\n\n \n\n\n \n\n\n(23\n\n\n)%\n\n\n\n\n\n\n(Provision for)/benefit from income taxes\n\n\n \n\n\n \n\n\n(77\n\n\n)\n\n\n \n\n\n \n\n\n(3\n\n\n)%\n\n\n \n\n\n \n\n\n322\n\n\n \n\n\n \n\n\n \n\n\n14\n\n\n%\n\n\n \n\n\n \n\n\n(121\n\n\n)\n\n\n \n\n\n \n\n\n(2\n\n\n)%\n\n\n \n\n\n \n\n\n248\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n%\n\n\n\n\n\n\nInterest in earnings of associates, net of tax\n\n\n \n\n\n \n\n\n(7\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n(8\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n\n\n\n\nIncome attributable to non-controlling interests\n\n\n \n\n\n \n\n\n(2\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n(3\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n(7\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n(8\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n\n\n\n\nNET INCOME/(LOSS) ATTRIBUTABLE TO WTW\n\n\n \n\n\n$\n\n\n304\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n%\n\n\n \n\n\n$\n\n\n(1,675\n\n\n)\n\n\n \n\n\n \n\n\n(73\n\n\n)%\n\n\n \n\n\n$\n\n\n870\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n%\n\n\n \n\n\n$\n\n\n(1,344\n\n\n)\n\n\n \n\n\n \n\n\n(19\n\n\n)%\n\n\n\n\n\n\nDiluted earnings/(loss) per share\n\n\n \n\n\n$\n\n\n3.11\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n(16.44\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n8.74\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n(13.11\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n\n\n \n\n\n32\n\n\n\n\n \n\n\n \nConsolidated Revenue\nRevenue for both the three months ended September 30, 2025 and 2024 was $2.3 billion, a decrease of $1 million on an as-reported basis. Adjusting for the impacts of foreign currency and acquisitions and disposals, our organic revenue growth was 5% for the three months ended September 30, 2025. Revenue for the nine months ended September 30, 2025 was $6.8 billion, compared to $6.9 billion for the nine months ended September 30, 2024, a decrease of $123 million, or 2%, on an as-reported basis. Adjusting for the impacts of foreign currency and acquisitions and disposals, our organic revenue growth was 5% for the nine months ended September 30, 2025. The decreases in as-reported revenue were due primarily to the sale of our TRANZACT business on December 31, 2024. The increases in organic revenue were driven by strong performances in both segments. For additional information, please see the section entitled ‘Segment Revenue and Segment Operating Income’ elsewhere within this Item 2 of this Quarterly Report on Form 10-Q.\nOur revenue can be materially impacted by changes in currency conversions, which can fluctuate significantly over the course of a calendar year. For the three months ended September 30, 2025, currency translation increased our consolidated revenue by $32 million. The primary currencies driving this change were the Euro and Pound Sterling. For the nine months ended September 30, 2025, currency translation increased our consolidated revenue by $26 million. The primary currencies driving this change were the Pound Sterling and Euro.\nThe following table details our top five markets based on the percentage of consolidated revenue (in U.S. dollars) from the countries where work was performed for the nine months ended September 30, 2025. These figures do not represent the currency of the related revenue, which is presented in the next table.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGeographic Region\n\n\n \n\n\n% of Revenue\n\n\n \n\n\n\n\n\n\nUnited States\n\n\n \n\n\n \n\n\n44\n\n\n%\n\n\n\n\n\n\nUnited Kingdom\n\n\n \n\n\n \n\n\n22\n\n\n%\n\n\n\n\n\n\nFrance\n\n\n \n\n\n \n\n\n5\n\n\n%\n\n\n\n\n\n\nCanada\n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n\n\n\n\nGermany\n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n\n\n \nThe table below details the approximate percentage of our revenue and expenses by transactional currency for the nine months ended September 30, 2025.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTransactional Currency\n\n\n \n\n\nRevenue\n\n\n \n\n\n \n\n\nExpenses \n(i)\n\n\n \n\n\n\n\n\n\nU.S. dollars\n\n\n \n\n\n \n\n\n53\n\n\n%\n\n\n \n\n\n \n\n\n47\n\n\n%\n\n\n\n\n\n\nPounds sterling\n\n\n \n\n\n \n\n\n13\n\n\n%\n\n\n \n\n\n \n\n\n20\n\n\n%\n\n\n\n\n\n\nEuro\n\n\n \n\n\n \n\n\n17\n\n\n%\n\n\n \n\n\n \n\n\n14\n\n\n%\n\n\n\n\n\n\nOther currencies\n\n\n \n\n\n \n\n\n17\n\n\n%\n\n\n \n\n\n \n\n\n19\n\n\n%\n\n\n\n\n \n(i)\nThese percentages exclude certain expenses for significant items which will not be settled in cash, or which we believe to be items that are not core to our current or future operations. These items include amortization of intangible assets.\nThe following tables set forth the total revenue for the three and nine months ended September 30, 2025 and 2024, and the components of the change in total revenue for the three and nine months ended September 30, 2025, as compared to the prior-year periods. The components of the revenue change may not add due to rounding.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAs\n\n\n \n\n\nLess:\n\n\n \n\n\nConstant\n\n\n \n\n\nLess:\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended September 30,\n\n\n \n\n\n \n\n\nReported\n\n\n \n\n\nCurrency\n\n\n \n\n\nCurrency\n\n\n \n\n\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange \n(i)\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue\n\n\n \n\n\n$\n\n\n2,288\n\n\n \n\n\n \n\n\n$\n\n\n2,289\n\n\n \n\n\n \n\n\n—%\n\n\n \n\n\n1%\n\n\n \n\n\n(1)%\n\n\n \n\n\n(6)%\n\n\n \n\n\n5%\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAs\n\n\n \n\n\nLess:\n\n\n \n\n\nConstant\n\n\n \n\n\nLess:\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n \n\n\nReported\n\n\n \n\n\nCurrency\n\n\n \n\n\nCurrency\n\n\n \n\n\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange \n(i)\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue\n\n\n \n\n\n$\n\n\n6,772\n\n\n \n\n\n \n\n\n$\n\n\n6,895\n\n\n \n\n\n \n\n\n(2)%\n\n\n \n\n\n—%\n\n\n \n\n\n(2)%\n\n\n \n\n\n(7)%\n\n\n \n\n\n5%\n\n\n\n\n \n(i)\nInterest income did not contribute to organic change for the three and nine months ended September 30, 2025.\n\n\n33\n\n\n\n\n \n\n\nDefinitions of Constant Currency Change and Organic Change are included under the section entitled ‘Non-GAAP Financial Measures’ elsewhere within Item 2 of this Form 10-Q.\nSegment Revenue and Segment Operating Income\nThe segment descriptions below should be read in conjunction with the full descriptions of our businesses contained in Part I, Item 1. ‘Business’, within our Annual Report on Form 10-K, filed with the SEC on February 25, 2025.\nSegment revenue excludes amounts that were directly incurred on behalf of our clients and reimbursed by them (reimbursed expenses); however, these amounts are included in consolidated revenue, as required by applicable accounting standards and SEC rules. Segment operating income excludes certain costs, including (i) amortization of intangibles; (ii) restructuring costs; and (iii) certain transaction and transformation expenses, and includes certain expense amounts which may be determined on both a direct and allocated basis. See Note 5 – Segment Information within Part I, Item 1 ‘Financial Statements’ of this Quarterly Report on Form 10-Q for more information about how our segment revenue and segment operating income are calculated and for a reconciliation to our GAAP results.\n \nThe Company experiences seasonal fluctuations in its revenue. Revenue is typically higher during the Company’s first and fourth quarters due primarily to the timing of broking-related activities.\nFor each table presented below, the components of the revenue change may not add due to rounding.\nHealth, Wealth & Career\n \nThe Health, Wealth & Career (‘HWC’) segment provides an array of advice, broking, solutions and technology for employee benefit plans, institutional investors, compensation and career programs, and the employee experience overall. Our portfolio of services supports the interrelated challenges that the management teams of our clients face across human resources and finance.\n \nHWC is the larger of the two segments of the Company. Addressing four key areas, Health, Wealth, Career and Benefits Delivery & Outsourcing, the segment is focused on addressing our clients’ people and risk needs to help them succeed in a global marketplace.\nThe following table sets forth HWC revenue for the three months ended September 30, 2025 and 2024, and the components of the change in revenue for the three months ended September 30, 2025 from the three months ended September 30, 2024.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended \nSeptember 30,\n\n\n \n\n\n \n\n\nAs\nReported\n\n\n \n\n\nLess:\nCurrency\n\n\n \n\n\nConstant\nCurrency\n\n\n \n\n\nLess:\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment revenue excluding interest income\n\n\n \n\n\n$\n\n\n1,253\n\n\n \n\n\n \n\n\n$\n\n\n1,320\n\n\n \n\n\n \n\n\n(5)%\n\n\n \n\n\n1%\n\n\n \n\n\n(6)%\n\n\n \n\n\n(11)%\n\n\n \n\n\n4%\n\n\n\n\n\n\nInterest income\n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal segment revenue\n\n\n \n\n\n$\n\n\n1,261\n\n\n \n\n\n \n\n\n$\n\n\n1,328\n\n\n \n\n\n \n\n\n(5)%\n\n\n \n\n\n1%\n\n\n \n\n\n(6)%\n\n\n \n\n\n(11)%\n\n\n \n\n\n4%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment operating income\n\n\n \n\n\n$\n\n\n361\n\n\n \n\n\n \n\n\n$\n\n\n329\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \nHWC segment revenue for both the three months ended September 30, 2025 and 2024 was $1.3 billion. Health delivered organic revenue growth, with increases across all regions, partially offset by the headwind from the prior-year’s book-of-business settlement activity. Wealth generated organic revenue growth from strong levels of Retirement work in Great Britain and North America, as well as growth in our Investments business from new products and client wins. Career revenue growth is largely attributed to strong demand for advisory project work in Europe. A change in compensation survey delivery patterns moved some revenue from this quarter to the fourth quarter. Benefits Delivery & Outsourcing revenue increased due to strong levels of project and core administration work within Europe which was tempered by lower commission revenue in North America.\nHWC segment operating income for the three months ended September 30, 2025 and 2024 was $361 million and $329 million, respectively. HWC segment operating income increased primarily from operating efficiencies.\n \n\n\n34\n\n\n\n\n \n\n\nThe following table sets forth HWC segment revenue for the nine months ended September 30, 2025 and 2024 and the components of the change in revenue for the nine months ended September 30, 2025 from the nine months ended September 30, 2024.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended \nSeptember 30,\n\n\n \n\n\n \n\n\nAs\nReported\n\n\n \n\n\nLess:\nCurrency\n\n\n \n\n\nConstant\nCurrency\n\n\n \n\n\nLess:\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment revenue excluding interest income\n\n\n \n\n\n$\n\n\n3,584\n\n\n \n\n\n \n\n\n$\n\n\n3,898\n\n\n \n\n\n \n\n\n(8)%\n\n\n \n\n\n—%\n\n\n \n\n\n(8)%\n\n\n \n\n\n(12)%\n\n\n \n\n\n4%\n\n\n\n\n\n\nInterest income\n\n\n \n\n\n \n\n\n22\n\n\n \n\n\n \n\n\n \n\n\n26\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal segment revenue\n\n\n \n\n\n$\n\n\n3,606\n\n\n \n\n\n \n\n\n$\n\n\n3,924\n\n\n \n\n\n \n\n\n(8)%\n\n\n \n\n\n—%\n\n\n \n\n\n(9)%\n\n\n \n\n\n(12)%\n\n\n \n\n\n4%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment operating income\n\n\n \n\n\n$\n\n\n952\n\n\n \n\n\n \n\n\n$\n\n\n941\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \nHWC segment revenue for the nine months ended September 30, 2025 and 2024 was $3.6 billion and $3.9 billion, respectively. Health delivered organic revenue growth in all regions, led by double-digit increases across International which benefited from strong new business and geographic expansion coupled with the ongoing appeal of our Global Benefits Management solution. Wealth generated organic revenue growth from higher levels of Retirement work globally, alongside growth in our Investments business. Career reported moderate revenue growth, largely driven by an uptick in advisory work in Europe. Benefits Delivery & Outsourcing increased primarily due to robust project and core administrative work in Europe, although this was partially offset by lower revenue in North America.\nHWC segment operating income for the nine months ended September 30, 2025 and 2024 was $952 million and $941 million, respectively. HWC segment operating income increased primarily from operating efficiencies which were partially offset by the prior-year sale of TRANZACT.\n \n \nRisk & Broking\n \nThe Risk & Broking (‘R&B’) segment provides a broad range of risk advice, insurance brokerage and consulting services to clients worldwide ranging from small businesses to multinational corporations. The segment comprises two primary businesses - Corporate Risk & Broking and Insurance Consulting and Technology.\nThe following table sets forth R&B revenue for the three months ended September 30, 2025 and 2024, and the components of the change in revenue for the three months ended September 30, 2025 from the three months ended September 30, 2024.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended \nSeptember 30,\n\n\n \n\n\n \n\n\nAs\nReported\n\n\n \n\n\nLess:\nCurrency\n\n\n \n\n\nConstant\nCurrency\n\n\n \n\n\nLess:\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment revenue excluding interest income\n\n\n \n\n\n$\n\n\n979\n\n\n \n\n\n \n\n\n$\n\n\n911\n\n\n \n\n\n \n\n\n7%\n\n\n \n\n\n2%\n\n\n \n\n\n6%\n\n\n \n\n\n—%\n\n\n \n\n\n6%\n\n\n\n\n\n\nInterest income\n\n\n \n\n\n \n\n\n28\n\n\n \n\n\n \n\n\n \n\n\n29\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal segment revenue\n\n\n \n\n\n$\n\n\n1,007\n\n\n \n\n\n \n\n\n$\n\n\n940\n\n\n \n\n\n \n\n\n7%\n\n\n \n\n\n2%\n\n\n \n\n\n5%\n\n\n \n\n\n—%\n\n\n \n\n\n6%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment operating income\n\n\n \n\n\n$\n\n\n189\n\n\n \n\n\n \n\n\n$\n\n\n170\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \nR&B segment revenue for the three months ended September 30, 2025 and 2024 was $1.0 billion and $940 million, respectively. Corporate Risk & Broking's organic revenue growth was primarily driven by new business and revenue recognized from project-based placements within the global specialty businesses, offsetting the negative impact of insurance rate headwinds. Insurance Consulting and Technology revenue was flat for the quarter as clients continued to manage spending more cautiously amid ongoing economic uncertainty.\nR&B segment operating income for the three months ended September 30, 2025 and 2024 was $189 million and $170 million, respectively. R&B segment operating income increased due primarily to operating leverage driven by strong organic revenue growth and Transformation program savings, which were partially offset by headwinds from decreased interest income and foreign currency fluctuations.\n\n\n35\n\n\n\n\n \n\n\nThe following table sets forth R&B segment revenue for the nine months ended September 30, 2025 and 2024 and the components of the change in revenue for the nine months ended September 30, 2025 from the nine months ended September 30, 2024.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended \nSeptember 30,\n\n\n \n\n\n \n\n\nAs\nReported\n\n\n \n\n\nLess:\nCurrency\n\n\n \n\n\nConstant\nCurrency\n\n\n \n\n\nLess:\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment revenue excluding interest income\n\n\n \n\n\n$\n\n\n3,008\n\n\n \n\n\n \n\n\n$\n\n\n2,811\n\n\n \n\n\n \n\n\n7%\n\n\n \n\n\n—%\n\n\n \n\n\n7%\n\n\n \n\n\n—%\n\n\n \n\n\n7%\n\n\n\n\n\n\nInterest income\n\n\n \n\n\n \n\n\n73\n\n\n \n\n\n \n\n\n \n\n\n86\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal segment revenue\n\n\n \n\n\n$\n\n\n3,081\n\n\n \n\n\n \n\n\n$\n\n\n2,897\n\n\n \n\n\n \n\n\n6%\n\n\n \n\n\n—%\n\n\n \n\n\n6%\n\n\n \n\n\n—%\n\n\n \n\n\n6%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment operating income\n\n\n \n\n\n$\n\n\n637\n\n\n \n\n\n \n\n\n$\n\n\n575\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n \nR&B segment revenue for the nine months ended September 30, 2025 and 2024 was $3.1 billion and $2.9 billion, respectively. Corporate Risk & Broking had organic revenue growth primarily driven by the success of our global lines, with higher levels of new business activity and revenue recognized from project-based placements within the global specialty businesses along with strong client retention across all regions. Insurance Consulting and Technology had organic revenue growth driven primarily by the Technology practice.\n \nR&B segment operating income for the nine months ended September 30, 2025 and 2024 was $637 million and $575 million, respectively. R&B segment operating income increased due primarily to operating leverage driven by strong organic revenue growth and transformation savings which were partially offset by headwinds from decreased interest income and foreign currency fluctuations.\nCosts of Providing Services\n \nTotal costs of providing services for the three months ended September 30, 2025 were $1.9 billion, compared to $3.1 billion for the three months ended September 30, 2024, a decrease of $1.2 billion, or 39%. Total costs of providing services for the nine months ended September 30, 2025 were $5.6 billion, compared to $7.2 billion for the nine months ended September 30, 2024, a decrease of $1.6 billion, or 23%. See the following discussion for further details.\nSalaries and Benefits\nSalaries and benefits for both the three months ended September 30, 2025 and 2024 were $1.4 billion, an increase of $17 million or 1%. The increase in the current year is primarily due to higher salary expense, driven by increased colleague headcount and cost-of-living compensation adjustments, and higher share-based compensation and benefit costs, partially offset by lower incentive costs. Salaries and benefits, as a percentage of revenue, represented 62% and 61% for the three months ended September 30, 2025 and 2024, respectively.\nSalaries and benefits for the nine months ended September 30, 2025 were $4.2 billion, compared to $4.1 billion for the nine months ended September 30, 2024, an increase of $51 million or 1%. The increase in the current year is primarily due to higher salary expense, driven by increased colleague headcount and cost-of-living compensation adjustments, and higher share-based compensation costs, partially offset by lower incentive costs. Salaries and benefits, as a percentage of revenue, represented 62% and 60% for the nine months ended September 30, 2025 and 2024, respectively.\nOther Operating Expenses\nOther operating expenses for the three months ended September 30, 2025 were $352 million, compared to $419 million for the three months ended September 30, 2024, a decrease of $67 million or 16%. The decrease was primarily due to lower marketing expenses attributable to the sale of our TRANZACT business on December 31, 2024 and lower professional services costs for the current-year period as compared to the prior-year period.\n \nOther operating expenses for the nine months ended September 30, 2025 were $1.1 billion, compared to $1.3 billion for the nine months ended September 30, 2024, a decrease of $262 million or 20%. The decrease was primarily due to lower marketing expenses attributable to the sale of our TRANZACT business on December 31, 2024, decreased office and technology expenses, and lower professional services and occupancy costs, partially offset by higher non-income-related tax expense for the current year as compared to the prior year.\n\n\n36\n\n\n\n\n \n\n\nImpairment\nImpairment for both the three and nine months ended September 30, 2024 was $1.0 billion. Impairment was attributable to the goodwill impairment associated with our Benefits, Delivery and Administration (‘BDA’) reporting unit related to the sale of our TRANZACT business.\nDepreciation\nDepreciation for the three months ended September 30, 2025 was $56 million, compared to $60 million for the three months ended September 30, 2024, a decrease of $4 million or 7%. Depreciation for the nine months ended September 30, 2025 was $167 million, compared to $176 million for the nine months ended September 30, 2024, a decrease of $9 million or 5%. These decreases were primarily due to a lower depreciable base of assets resulting from disposals associated with the Company’s Transformation program that concluded in the fourth quarter of 2024 and a lower dollar value of assets placed in service during the past few years.\nAmortization\nAmortization for the three months ended September 30, 2025 was $47 million, compared to $56 million for the three months ended September 30, 2024, a decrease of $9 million or 16%. Amortization for the nine months ended September 30, 2025 was $144 million, compared to $176 million for the nine months ended September 30, 2024, a decrease of $32 million or 18%. These decreases were due in part to the disposal of intangible assets associated with the sale of our TRANZACT business. Our intangible amortization is generally more heavily weighted to the initial years of the useful lives of the related intangibles, and therefore amortization related to intangible assets has decreased and will continue to decrease over time.\n \nRestructuring Costs\nRestructuring costs for the three and nine months ended September 30, 2024 were $8 million and $29 million, respectively, and primarily related to the real estate rationalization component of our completed Transformation program.\n \nTransaction and Transformation\nTransaction and transformation costs for the three months ended September 30, 2025 were $2 million, compared to $74 million for the three months ended September 30, 2024, a decrease of $72 million. Transaction and transformation costs for the nine months ended September 30, 2025 were $4 million, compared to $296 million for the nine months ended September 30, 2024, a decrease of $292 million. Transaction and transformation costs in the current year were comprised of transaction-related costs, and costs incurred in the prior year primarily included consulting and compensation costs related to our completed Transformation program.\n \nIncome/(Loss) from Operations\nIncome from operations for the three months ended September 30, 2025 was $418 million, compared to a loss of $766 million for the three months ended September 30, 2024, an increase of $1.2 billion. This increase resulted primarily from the current-year absence of impairment expense associated with the prior-year sale of our TRANZACT business, lower transformation and transaction costs due to the completion of our Transformation program during the fourth quarter of 2024, and lower marketing expenses for the current-year period.\n \nIncome from operations for the nine months ended September 30, 2025 was $1.2 billion, compared to a loss of $274 million for the nine months ended September 30, 2024, an increase of $1.5 billion. This increase resulted primarily from the current-year absence of impairment expense associated with the prior-year sale of our TRANZACT business, lower transformation and transaction costs due to the completion of our Transformation program during the fourth quarter of 2024, lower marketing expenses and decreased office and technology expenses in the current year, partially offset by lower revenue due to the prior-year sale of our TRANZACT business.\nInterest Expense\nInterest expense for both the three months ended September 30, 2025 and 2024 was $65 million. Interest expense for the nine months ended September 30, 2025 was $194 million as compared to $197 million for the nine months ended September 30, 2024, a decrease of $3 million or 2%. The year-over-year decrease was primarily due to a lower average level of indebtedness in the current year.\nOther Income/(Loss), Net\nOther income/(loss), net for the three months ended September 30, 2025 was income of $37 million, compared to a loss of $1.2 billion for the three months ended September 30, 2024, an increase of $1.2 billion. Other income/(loss), net for the nine months ended September 30, 2025 was a loss of $18 million, compared to a loss of $1.1 billion for the nine months ended September 30, 2024, an increase of $1.1 billion. These increases were primarily due to gains on disposals of operations in the current year, as compared to the\n \n\n\n37\n\n\n\n\n \n\n\nsignificant loss on disposal in the prior year, which was attributable to the sale of our TRANZACT business, partially offset by lower pension income, which was a result of a significant pension settlement in the current year.\n(Provision for)/Benefit from Income Taxes\nProvision for income taxes for the three months ended September 30, 2025 was $77 million, compared to a benefit from income taxes of $322 million for the three months ended September 30, 2024, an increase of $399 million. The effective tax rate was 19.7% for the three months ended September 30, 2025, and 16.1% for the three months ended September 30, 2024. Provision for income taxes for the nine months ended September 30, 2025 was $121 million, compared to a benefit from income taxes of $248 million for the nine months ended September 30, 2024, an increase of $369 million. The effective tax rate was 12.0% for the nine months ended September 30, 2025 and 15.6% for the nine months ended September 30, 2024. These effective tax rates are calculated using extended values from our condensed consolidated statements of comprehensive income and are therefore more precise tax rates than can be calculated from rounded values. The prior-year effective tax rate for the three months ended September 30, 2024 was lower due to deferred tax benefits recognized on the gross-up to carrying value of net assets to be disposed and a deferred tax benefit of $56 million, net of a $37 million valuation allowance, on the expected tax loss associated with the sale of our TRANZACT business. The current-year effective tax rate for the nine months ended September 30, 2025 is lower due to favorable discrete tax items, primarily related to provision-to-tax return adjustments.\n \nNet Income/(Loss) Attributable to WTW\nNet income attributable to WTW for the three months ended September 30, 2025 was $304 million, compared to a net loss of $1.7 billion for the three months ended September 30, 2024, an increase of $2.0 billion. This increase resulted primarily from the current-year absence of loss on disposal and impairment expense associated with the sale of our TRANZACT business in the prior-year period, partially offset by higher tax expense due to prior-year tax benefits attributable to the losses associated with the sale.\nNet income attributable to WTW for the nine months ended September 30, 2025 was $870 million, compared to a net loss of $1.3 billion for the nine months ended September 30, 2024, an increase of $2.2 billion. This increase resulted primarily from the current-year absence of loss on disposal and impairment expense associated with the sale of our TRANZACT business in the prior-year period, lower transformation and transaction costs due to the completion of our Transformation program during the fourth quarter of 2024, and lower marketing expenses for the current year, partially offset by higher tax expense due to prior-year tax benefits attributable to the losses associated with the TRANZACT sale as well as lower revenue due to the sale.\nLiquidity and Capital Resources\nExecutive Summary\nOur principal sources of liquidity are funds generated by operating activities, available cash and cash equivalents and amounts available under our revolving credit facility and any new debt offerings.\n \nThere has been significant volatility in financial markets, including occasional declines in equity markets, inflation and changes in interest rates and reduced liquidity on a global basis and we expect this volatility could continue, all of which may impact our access to liquidity.\nBased on our current balance sheet and cash flows, current market conditions and information available to us at this time, we believe that WTW has access to sufficient liquidity to meet our cash needs, including debt repayment, for the next twelve months. Including our cash generated from operations, our liquidity also includes all of the borrowing capacity available to draw against our recently-amended and restated $1.5 billion revolving credit facility (see Note 20 — Subsequent Event in Part I, Item 1 ‘Financial Statements’ in this Quarterly Report on Form 10-Q for further information). The use of these funds includes investments in the business for growth, scheduled debt repayments, share repurchases, dividend payments and general corporate purposes. Additionally, under our minority ownership interest in a joint venture with Bain Capital, in connection with which we re-entered the reinsurance broking space during the fourth quarter of 2024, we have an option to acquire a controlling interest in the joint venture in the future. Given the initial funding needs of a start-up venture, we expect to make certain capital contributions from time to time resulting in a reduction to earnings until such time as the joint venture generates sufficient revenue to be profitable.\nDuring the nine months ended September 30, 2025, we repurchased $1.3 billion of our outstanding shares and have authorization to repurchase an additional $1.6 billion under our share repurchase program (as further described below under ‘Share Repurchase Program’). We consider many factors, including market and economic conditions, applicable legal requirements and other business considerations, when considering whether to repurchase shares. Our Share Repurchase Program has no termination date and may be suspended or discontinued at any time.\n\n\n38\n\n\n\n\n \n\n\nEvents that could change the historical cash flow dynamics discussed above include significant changes in operating results, potential future acquisitions or divestitures, material changes in geographic sources of cash, unexpected adverse impacts from litigation or tax or regulatory matters, or future pension funding during periods of severe downturn in the capital markets.\nUndistributed Earnings of Foreign Subsidiaries\nThe Company recognizes deferred tax balances related to the undistributed earnings of subsidiaries when it expects that it will recover those undistributed earnings in a taxable manner, such as through receipt of dividends or sale of the investments.\nWe continue to have certain subsidiaries whose earnings have not been deemed permanently reinvested and for which we have been accruing estimates of the tax effects of such repatriation. Excluding these certain subsidiaries, we continue to assert that the historical cumulative earnings for the remainder of our subsidiaries have been reinvested indefinitely and therefore do not provide deferred taxes on these amounts. If future events, including material changes in estimates of cash, working capital, long-term investment requirements or additional legislation, necessitate that these earnings be distributed, an additional provision for income and foreign withholding taxes, net of credits, may be necessary. Other potential sources of cash may be through the settlement of intercompany loans or return of capital distributions in a tax-efficient manner.\nCash and Cash Equivalents\nOur cash and cash equivalents at September 30, 2025 and December 31, 2024 totaled $1.9 billion. The significant changes in cash from December 31, 2024 to September 30, 2025 were due primarily to $1.0 billion of net cash from operations, receipt of the $750 million earnout related to the 2021 divestiture of Willis Re and $62 million associated with the settlement of a note receivable related to the sale of our Max Matthiessen subsidiary in 2020, partially offset by cash outflows of $1.3 billion of share repurchases, $269 million of dividend payments and $166 million of capital expenditures and capitalized software additions.\nAdditionally, at both September 30, 2025 and December 31, 2024, we had all of the borrowing capacity available to draw against our $1.5 billion revolving credit facility, which was amended and restated on October 17, 2025 (see Note 20 – Subsequent Event in Part I, Item 1 ‘Financial Statements’ of this Quarterly Report on Form 10-Q for additional information about the new revolving credit facility).\nIncluded within cash and cash equivalents at September 30, 2025 and December 31, 2024 are amounts held for regulatory capital adequacy requirements, including $105 million and $104 million, respectively, within our regulated U.K. entities.\nSummarized Condensed Consolidated Cash Flows\nThe following table presents the summarized condensed consolidated cash flow information for the nine months ended September 30, 2025 and 2024:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nNet cash from/(used in):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating activities\n\n\n \n\n\n$\n\n\n1,004\n\n\n \n\n\n \n\n\n$\n\n\n913\n\n\n \n\n\n\n\n\n\nInvesting activities\n\n\n \n\n\n \n\n\n530\n\n\n \n\n\n \n\n\n \n\n\n(230\n\n\n)\n\n\n\n\n\n\nFinancing activities\n\n\n \n\n\n \n\n\n(1,311\n\n\n)\n\n\n \n\n\n \n\n\n205\n\n\n \n\n\n\n\n\n\nINCREASE IN CASH, CASH EQUIVALENTS AND RESTRICTED \n   CASH \n(i)\n\n\n \n\n\n \n\n\n223\n\n\n \n\n\n \n\n\n \n\n\n888\n\n\n \n\n\n\n\n\n\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n\n\n \n\n\n \n\n\n202\n\n\n \n\n\n \n\n\n \n\n\n32\n\n\n \n\n\n\n\n\n\nCASH, CASH EQUIVALENTS AND RESTRICTED CASH, BEGINNING OF PERIOD \n(i)\n\n\n \n\n\n \n\n\n4,998\n\n\n \n\n\n \n\n\n \n\n\n3,792\n\n\n \n\n\n\n\n\n\nCASH, CASH EQUIVALENTS AND RESTRICTED CASH, END OF PERIOD \n(i)\n\n\n \n\n\n$\n\n\n5,423\n\n\n \n\n\n \n\n\n$\n\n\n4,712\n\n\n \n\n\n\n\n \n(i)\nThe amounts of cash, cash equivalents and restricted cash, their respective classification on the condensed consolidated balance sheets, as well as their respective portions of the increase or decrease in cash, cash equivalents and restricted cash for each of the periods presented, have been included in Note 19 \n— \nSupplemental Disclosures of Cash Flow Information within Part I, Item 1 ‘Financial Statements’ within this Quarterly Report on Form 10-Q.\n \nCash Flows From Operating Activities\nCash flows from operating activities were $1.0 billion for the nine months ended September 30, 2025, compared to cash flows from operating activities of $913 million for the nine months ended September 30, 2024. The $1.0 billion of net cash from operating activities for the nine months ended September 30, 2025 included net income of $877 million and $556 million of favorable non-cash adjustments, partially offset by unfavorable changes in operating assets and liabilities of $429 million. This increase in cash flows\n \n\n\n39\n\n\n\n\n \n\n\nfrom operations as compared to the prior year was primarily driven by operating margin expansion and lower Transformation program residual cash outflows.\nThe $913 million of net cash from operating activities for the nine months ended September 30, 2024 included $2.4 billion of favorable non-cash adjustments, partially offset by a net loss of $1.3 billion and unfavorable changes in operating assets and liabilities of $139 million.\nCash Flows From/(Used In) Investing Activities\nCash flows from investing activities for the nine months ended September 30, 2025 were $530 million as compared to cash flows used in investing activities of $230 million for the nine months ended September 30, 2024. The cash flows from investing activities in the current year consisted primarily of net proceeds from sales of operations resulting from divestitures that occurred in prior years. These inflows were partially offset by capital expenditures, including software additions, our net purchases of held-to-maturity and available-for-sale securities and cash and fiduciary fund transfers.\n \nThe cash flows used in investing activities for the nine months ended September 30, 2024 consisted primarily of capital expenditures and capitalized software additions.\n \nCash Flows (Used In)/From Financing Activities\nCash flows used in financing activities for the nine months ended September 30, 2025 were $1.3 billion. The significant financing activities included share repurchases of $1.3 billion and dividend payments of $269 million, partially offset by net proceeds from fiduciary funds held for clients of $343 million.\nCash flows from financing activities for the nine months ended September 30, 2024 were $205 million. The significant financing activities included net proceeds from fiduciary funds held for clients of $934 million and $84 million of net proceeds from the issuance of debt, partially offset by share repurchases of $506 million and dividend payments of $265 million.\n \nIndebtedness\nTotal debt, total equity, and the capitalization ratios at September 30, 2025 and December 31, 2024 were as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nSeptember 30, \n2025\n\n\n \n\n\n \n\n\nDecember 31, \n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n\n\n\n\nLong-term debt\n\n\n \n\n\n$\n\n\n4,763\n\n\n \n\n\n \n\n\n$\n\n\n5,309\n\n\n \n\n\n\n\n\n\nCurrent debt\n\n\n \n\n\n \n\n\n550\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nTotal debt\n\n\n \n\n\n$\n\n\n5,313\n\n\n \n\n\n \n\n\n$\n\n\n5,309\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal WTW shareholders’ equity\n\n\n \n\n\n$\n\n\n7,735\n\n\n \n\n\n \n\n\n$\n\n\n7,940\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCapitalization ratio\n\n\n \n\n\n \n\n\n40.7\n\n\n%\n\n\n \n\n\n \n\n\n40.1\n\n\n%\n\n\n\n\n \nAt September 30, 2025, our mandatory debt repayments over the next twelve months include $550 million outstanding on our 4.400% senior notes, which will mature during the first quarter of 2026. In addition, our $1.5 billion revolving credit facility, which was set to expire on October 6, 2026, was replaced on October 17, 2025 by our third amended and restated $1.5 billion revolving credit facility (see Note 20 – Subsequent Event in Part I, Item 1 ‘Financial Statements’ of this Quarterly Report on Form 10-Q for further information).\n \nFor more information regarding our current and long-term debt, please see ‘Supplemental Guarantor Financial Information’ elsewhere within this Item 2 of this Quarterly Report on Form 10-Q.\n \n \nAt September 30, 2025 and December 31, 2024, we were in compliance with all financial covenants.\n\n\n40\n\n\n\n\n \n\n\nFiduciary Funds\nAs an intermediary, we hold funds, generally in a fiduciary capacity, for the account of third parties, typically as the result of premiums received from clients that are in transit to insurers and claims due to clients that are in transit from insurers. We also hold funds for clients of our benefits account businesses, some of which are invested in open-ended mutual funds as directed by the participant. These fiduciary funds are included in fiduciary assets on our condensed consolidated balance sheets. We present the equal and corresponding fiduciary liabilities related to these fiduciary funds representing amounts or claims due to our clients or premiums due on their behalf to insurers on our condensed consolidated balance sheets.\nFiduciary funds are generally required to be kept in regulated bank accounts subject to guidelines which emphasize capital preservation and liquidity; such funds are not available to service the Company’s debt or for other corporate purposes. Notwithstanding the legal relationships with clients and insurers, the Company is entitled to retain investment income earned on certain of these fiduciary funds in accordance with industry custom and practice and, in some cases, as supported by agreements with insureds.\nAt September 30, 2025 and December 31, 2024, we had fiduciary funds of $4.0 billion and $3.4 billion, respectively.\nShare Repurchase Program\nThe Company is authorized to repurchase shares, by way of redemption or otherwise, and will consider whether to do so from time to time, based on many factors, including market conditions. There are no expiration dates for our repurchase plans or programs.\n \nOn November 20, 2024, the board of directors approved a $1.0 billion increase to the existing share repurchase program. Additionally,  on September 16, 2025, the board of directors approved a $1.5 billion increase to the existing share repurchase program. These increases brought the total approved authorization, since the announcement of the program on April 20, 2016, to $11.7 billion.\nAt September 30, 2025, approximately $1.6 billion remained on the current repurchase authority. The maximum number of shares that could be repurchased based on the closing price of our ordinary shares on September 30, 2025 of $345.45 was 4,752,506.\nDuring the three and nine months ended September 30, 2025, the Company had the following share repurchase activity:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\nThree Months Ended\nSeptember 30, 2025\n\n\n \n\n\nNine Months Ended\nSeptember 30, 2025\n\n\n\n\n\n\nShares repurchased\n\n\n \n\n\n \n\n\n1,848,098\n\n\n \n\n\n4,069,746\n\n\n\n\n\n\nAverage price per share\n\n\n \n\n\n \n\n\n$324.66\n\n\n \n\n\n$319.43\n\n\n\n\n\n\nAggregate repurchase cost (excluding broker costs)\n\n\n \n\n\n \n\n\n$600 million\n\n\n \n\n\n$1.3 billion\n\n\n\n\n \nCapital Commitments\nThe Company’s capital expenditures for fixed assets, capitalized software and software for internal use were $166 million during the nine months ended September 30, 2025. The Company estimates that there will be additional such expenditures in the range of $60 million - $85 million during the remainder of 2025. We currently expect cash from operations to adequately provide for these cash needs. There have been no material changes to our capital commitments since December 31, 2024.\n \nDividends\nTotal cash dividends of $269 million were paid during the nine months ended September 30, 2025. In August 2025, the board of directors approved a quarterly cash dividend of $0.92 per share ($3.68 per share annualized rate), which was paid on October 15, 2025 to shareholders of record as of September 30, 2025.\nSupplemental Guarantor Financial Information\nAs of September 30, 2025, WTW has issued the following debt securities (the ‘notes’):\na)\nWillis North America Inc. (‘Willis North America’) has approximately $4.5 billion senior notes outstanding, of which $1.0 billion were issued on September 10, 2018, $1.0 billion were issued on September 10, 2019, $275 million were issued on May 29, 2020, $750 million were issued on May 19, 2022, $750 million were issued on May 17, 2023 and $750 million were issued on March 5, 2024; and\nb)\nTrinity Acquisition plc has approximately $825 million senior notes outstanding, of which $275 million were issued on August 15, 2013 and $550 million were issued on March 22, 2016, and a recently-amended and restated $1.5 billion revolving credit facility, on which no balance was outstanding, nor on the prior facility, at September 30, 2025.\n\n\n41\n\n\n\n\n \n\n\nThe following table presents a summary of the entities that issue each note and those wholly-owned subsidiaries of the Company that guarantee each respective note on a joint and several basis as of September 30, 2025. These subsidiaries are all consolidated by Willis Towers Watson plc (the ‘parent company’) and together with the parent company comprise the ‘Obligor group’. On December 16, 2024, TA I Limited, Willis Towers Watson UK Holdings Limited and Willis Netherlands Holdings B.V. ceased to be guarantors of our notes and are no longer part of the Obligor group, following the transfer of their respective properties and assets to other existing guarantors within the Obligor group. Further, Willis Towers Watson UK Holdings Limited was released from its guarantees under our credit agreement. TA I Limited and Willis Netherlands Holdings B.V. are not guarantors under our amended and restated credit agreement (see Note 20 – Subsequent Event in Part I, Item 1 ‘Financial Statements’ of this Quarterly Report on Form 10-Q for further information).\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntity\n\n\n \n\n\nTrinity Acquisition plc Notes\n\n\n \n\n\nWillis North America Inc. Notes\n\n\n\n\n\n\nWillis Towers Watson plc\n\n\n \n\n\nGuarantor\n\n\n \n\n\nGuarantor\n\n\n\n\n\n\nTrinity Acquisition plc\n\n\n \n\n\nIssuer\n\n\n \n\n\nGuarantor\n\n\n\n\n\n\nWillis North America Inc.\n\n\n \n\n\nGuarantor\n\n\n \n\n\nIssuer\n\n\n\n\n\n\nWillis Investment UK Holdings Limited\n\n\n \n\n\nGuarantor\n\n\n \n\n\nGuarantor\n\n\n\n\n\n\nWillis Group Limited\n\n\n \n\n\nGuarantor\n\n\n \n\n\nGuarantor\n\n\n\n\n\n\nWillis Towers Watson Sub Holdings Unlimited Company\n\n\n \n\n\nGuarantor\n\n\n \n\n\nGuarantor\n\n\n\n\nThe notes issued by Willis North America and Trinity Acquisition plc:\n•\nrank equally with all of the issuer’s existing and future unsubordinated and unsecured debt;\n•\nrank equally with the issuer’s guarantee of all of the existing senior debt of the Company and the other guarantors, including any debt under the Revolving Credit Facility;\n•\nare senior in right of payment to all of the issuer’s future subordinated debt; and\n•\nare effectively subordinated to all of the issuer’s secured debt to the extent of the value of the assets securing such debt.\nAll other subsidiaries of the parent company are non-guarantor subsidiaries (‘the non-guarantor subsidiaries’).\n \nEach member of the Obligor group has only a stockholder’s claim on the assets of the non-guarantor subsidiaries. This stockholder’s claim is junior to the claims that creditors have against those non-guarantor subsidiaries. Holders of the notes will only be creditors of the Obligor group and not creditors of the non-guarantor subsidiaries. As a result, all of the existing and future liabilities of the non-guarantor subsidiaries, including any claims of trade creditors and preferred stockholders, will be structurally senior to the notes. As of and for the periods ended September 30, 2025 and December 31, 2024, the non-guarantor subsidiaries represented substantially all of the total assets and accounted for substantially all of the total revenue of the Company prior to consolidating adjustments. The non-guarantor subsidiaries have other liabilities, including contingent liabilities that may be significant. Each indenture does not contain any limitations on the amount of additional debt that the Obligor group and the non-guarantor subsidiaries may incur. The amounts of this debt could be substantial, and this debt may be debt of the non-guarantor subsidiaries, in which case this debt would be effectively senior in right of payment to the notes.\nThe notes are obligations exclusively of the Obligor group. Substantially all of the Obligor group’s operations are conducted through its non-guarantor subsidiaries. Therefore, the Obligor group’s ability to service its debt, including the notes, is dependent upon the net cash flows of its non-guarantor subsidiaries and their ability to distribute those net cash flows as dividends, loans or other payments to the Obligor group. Certain laws restrict the ability of these non-guarantor subsidiaries to pay dividends and make loans and advances to the Obligor group. In addition, such non-guarantor subsidiaries may enter into contractual arrangements that limit their ability to pay dividends and make loans and advances to the Obligor group.\nIntercompany balances and transactions between members of the Obligor group have been eliminated. All intercompany balances and transactions between the Obligor group and the non-guarantor subsidiaries have been presented in the disclosures below on a net presentation basis, rather than a gross basis, as this better reflects the nature of the intercompany positions and presents the funding or funded position that is to be received or owed. The intercompany balances and transactions between the Obligor group and non-guarantor subsidiaries, presented below, relate to a number of items including loan funding for acquisitions and other purposes, transfers of surplus cash between subsidiary companies, funding provided for working capital purposes, settlement of expense accounts, transactions related to share-based payment arrangements and share issuances, intercompany royalty and related arrangements, intercompany dividends and intercompany interest. At September 30, 2025 and December 31, 2024, the intercompany balances of the Obligor group with non-guarantor subsidiaries were net receivables of $441 million and $1.0 billion, respectively, and net payables of $15.9 billion and $15.1 billion, respectively.\n\n\n42\n\n\n\n\n \n\n\nNo balances or transactions of non-guarantor subsidiaries are presented in the disclosures other than the intercompany items noted above.\n \nPresented below is certain summarized financial information for the Obligor group.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n`\n\n\n \n\n\nAs of \nSeptember 30, 2025\n\n\n \n\n\n \n\n\nAs of \nDecember 31, 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nTotal current assets\n\n\n \n\n\n$\n\n\n474\n\n\n \n\n\n \n\n\n$\n\n\n290\n\n\n \n\n\n\n\n\n\nTotal non-current assets\n\n\n \n\n\n \n\n\n509\n\n\n \n\n\n \n\n\n \n\n\n1,050\n\n\n \n\n\n\n\n\n\nTotal current liabilities\n\n\n \n\n\n \n\n\n7,566\n\n\n \n\n\n \n\n\n \n\n\n6,254\n\n\n \n\n\n\n\n\n\nTotal non-current liabilities\n\n\n \n\n\n \n\n\n13,898\n\n\n \n\n\n \n\n\n \n\n\n14,442\n\n\n \n\n\n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine months ended\nSeptember 30, 2025\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nRevenue\n\n\n \n\n\n$\n\n\n1,496\n\n\n \n\n\n\n\n\n\nIncome from operations\n\n\n \n\n\n \n\n\n1,332\n\n\n \n\n\n\n\n\n\nIncome from operations before income taxes \n(i)\n\n\n \n\n\n \n\n\n506\n\n\n \n\n\n\n\n\n\nNet income\n\n\n \n\n\n \n\n\n688\n\n\n \n\n\n\n\n\n\nNet income attributable to WTW\n\n\n \n\n\n \n\n\n688\n\n\n \n\n\n\n\n \n(i)\nIncludes intercompany expense, net of the Obligor group from non-guarantor subsidiaries of $428 million for the nine months ended September 30, 2025.\nNon-GAAP Financial Measures\nIn order to assist readers of our condensed consolidated financial statements in understanding the core operating results that WTW’s management uses to evaluate the business and for financial planning purposes, we present the following non-GAAP measures and their most directly comparable U.S. GAAP measure:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMost Directly Comparable U.S. GAAP Measure\n\n\n \n\n\nNon-GAAP Measure\n\n\n\n\n\n\nAs reported change\n\n\n \n\n\nConstant currency change\n\n\n\n\n\n\nAs reported change\n\n\n \n\n\nOrganic change\n\n\n\n\n\n\nIncome/(loss) from operations/margin\n\n\n \n\n\nAdjusted operating income/margin\n\n\n\n\n\n\nNet income/(loss)/margin\n\n\n \n\n\nAdjusted EBITDA/margin\n\n\n\n\n\n\nNet income/(loss) attributable to WTW\n\n\n \n\n\nAdjusted net income\n\n\n\n\n\n\nDiluted earnings/(loss) per share\n\n\n \n\n\nAdjusted diluted earnings per share\n\n\n\n\n\n\nIncome/(loss) from operations before income taxes\n   and interest in earnings of associates\n\n\n \n\n\nAdjusted income before taxes\n\n\n\n\n\n\nProvision for income taxes/U.S. GAAP tax rate\n\n\n \n\n\nAdjusted income taxes/tax rate\n\n\n\n\n\n\nNet cash from operating activities\n\n\n \n\n\nFree cash flow\n\n\n\n\n \nThe Company believes that these measures are relevant and provide pertinent information widely used by analysts, investors and other interested parties in our industry to provide a baseline for evaluating and comparing our operating performance, and in the case of free cash flow, our liquidity results.\n \nWithin the measures referred to as ‘adjusted’, we adjust for significant items which will not be settled in cash, or which we believe to be items that are not core to our current or future operations. Some of these items may not be applicable for the current quarter, however they may be part of our full-year results. Additionally, we have historically adjusted for certain items which are not described below, but for which we may adjust in a future period when applicable. Items applicable to the quarter or full-year results, or the comparable periods, include the following:\n \n•\nRestructuring costs and transaction and transformation – Management believes it is appropriate to adjust for restructuring costs and transaction and transformation when they relate to a specific significant program with a defined set of activities and costs that are not expected to continue beyond a defined period of time, or significant acquisition-related transaction expenses. We believe the adjustment is necessary to present how the Company is performing, both now and in the future when the incurrence of these costs will have concluded. \n•\nImpairment – Adjustment to remove the non-cash goodwill impairment associated with our BDA reporting unit related to the sale of our TRANZACT business.\n\n\n43\n\n\n\n\n \n\n\n•\nProvisions for specified litigation matters – We will include provisions for litigation matters which we believe are not representative of our core business operations. Among other things, we determine this by reference to the amount of the loss (net of insurance and other recovery receivables) and by reference to whether the matter relates to an unusual and complex scenario that is not expected to be repeated as part of our ongoing, ordinary business. These amounts are presented net of insurance and other recovery receivables. See the footnotes to the reconciliation tables below for more specificity on the litigation matter excluded from adjusted results.\n•\nGains and losses on disposals of operations – Adjustment to remove the gains or losses resulting from disposed operations that have not been classified as discontinued operations.\n•\nNet periodic pension and postretirement benefits – Adjustment to remove the recognition of net periodic pension and postretirement benefits (including pension settlements), other than service costs. We have included this adjustment as applicable in our prior-period disclosures in order to conform to the current-period presentation.\n•\nTax effect of significant adjustments – Relates to the incremental tax expense or benefit resulting from significant or unusual events including significant statutory tax rate changes enacted in material jurisdictions in which we operate, internal reorganizations of ownership of certain businesses that reduced the investment held by our U.S.-controlled subsidiaries and the recovery of certain refunds or payment of taxes related to businesses in which we no longer participate.\nThese non-GAAP measures are not defined in the same manner by all companies and may not be comparable to other similarly titled measures of other companies. Non-GAAP measures should be considered in addition to, and not as a substitute for, the information contained within our condensed consolidated financial statements.\n \nConstant Currency Change and Organic Change\nWe evaluate our revenue on an as reported (U.S. GAAP), constant currency and organic basis. We believe presenting constant currency and organic information provides valuable supplemental information regarding our comparable results, consistent with how we evaluate our performance internally.\n•\nConstant currency change -\n Represents the year-over-year change in revenue excluding the impact of foreign currency fluctuations. To calculate this impact, the prior-year local currency results are first translated using the current-year monthly average exchange rates. The change is calculated by comparing the prior-year revenue, translated at the current-year monthly average exchange rates, to the current-year as-reported revenue, for the same period. We believe constant currency measures provide useful information to investors because they provide transparency to performance by excluding the effects that foreign currency exchange rate fluctuations have on period-over-period comparability given volatility in foreign currency exchange markets.\n•\nOrganic change -\n Excludes the impact of fluctuations in foreign currency exchange rates as described above and the period-over-period impact of acquisitions and divestitures on current-year revenue. We believe that excluding transaction-related items from our U.S. GAAP financial measures provides useful supplemental information to our investors, and it is important in illustrating what our core operating results would have been had we not included these transaction-related items, since the nature, size and number of these transaction-related items can vary from period to period.\nThe constant currency and organic change results, and a reconciliation from the reported results for consolidated revenue are included in the ‘Consolidated Revenue’ section within this Form 10-Q. These measures are also reported by segment in the ‘Segment Revenue and Segment Operating Income’ section within this Form 10-Q.\nReconciliations of the as-reported change to the constant currency and organic changes for the three and nine months ended September 30, 2025 from the three and nine months ended September 30, 2024 are as follows. The components of revenue change may not add due to rounding.\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAs\n\n\n \n\n\nLess:\n\n\n \n\n\nConstant\n\n\n \n\n\nLess:\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended September 30,\n\n\n \n\n\n \n\n\nReported\n\n\n \n\n\nCurrency\n\n\n \n\n\nCurrency\n\n\n \n\n\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange \n(i)\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue\n\n\n \n\n\n$\n\n\n2,288\n\n\n \n\n\n \n\n\n$\n\n\n2,289\n\n\n \n\n\n \n\n\n—%\n\n\n \n\n\n1%\n\n\n \n\n\n(1)%\n\n\n \n\n\n(6)%\n\n\n \n\n\n5%\n\n\n\n\n \n \n\n\n44\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAs\n\n\n \n\n\nLess:\n\n\n \n\n\nConstant\n\n\n \n\n\nLess:\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended September 30,\n\n\n \n\n\n \n\n\nReported\n\n\n \n\n\nCurrency\n\n\n \n\n\nCurrency\n\n\n \n\n\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange \n(i)\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue\n\n\n \n\n\n$\n\n\n6,772\n\n\n \n\n\n \n\n\n$\n\n\n6,895\n\n\n \n\n\n \n\n\n(2)%\n\n\n \n\n\n—%\n\n\n \n\n\n(2)%\n\n\n \n\n\n(7)%\n\n\n \n\n\n5%\n\n\n\n\n \n(i)\nInterest income did not contribute to organic change for the three and nine months ended September 30, 2025.\nFor the three months ended September 30, 2025, our as-reported revenue decreased by $1 million and our organic revenue grew by 5%. For the nine months ended September 30, 2025, our as-reported revenue decreased by $123 million, or 2%, and our organic revenue grew by 5%. These decreases in as-reported revenue were due primarily to the sale of our TRANZACT business on December 31, 2024. The increases in organic revenue were driven by strong performances in both segments. For additional information, please see the section entitled ‘Segment Revenue and Segment Operating Income’ elsewhere within Item 2 of this Quarterly Report on Form 10-Q.\nAdjusted Operating Income/Margin\nWe consider adjusted operating income/margin to be important financial measures, which are used internally to evaluate and assess our core operations and to benchmark our operating results against our competitors.\nAdjusted operating income is defined as income/(loss) from operations adjusted for impairment, amortization, restructuring costs, transaction and transformation and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted operating income margin is calculated by dividing adjusted operating income by revenue.\nReconciliations of income/(loss) from operations to adjusted operating income for the three and nine months ended September 30, 2025 and 2024 are as follows:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nThree Months Ended \nSeptember 30,\n\n\n \n\n\n \n\n\nNine Months Ended \nSeptember 30,\n\n\n \n\n\n\n\n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n($ in millions)\n\n\n \n\n\n\n\n\n\nIncome/(loss) from operations\n\n\n$\n\n\n418\n\n\n \n\n\n \n\n\n$\n\n\n(766\n\n\n)\n\n\n \n\n\n$\n\n\n1,218\n\n\n \n\n\n \n\n\n$\n\n\n(274\n\n\n)\n\n\n\n\n\n\nAdjusted for certain items:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nImpairment\n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n\n\n\n\nAmortization\n\n\n \n\n\n47\n\n\n \n\n\n \n\n\n \n\n\n56\n\n\n \n\n\n \n\n\n \n\n\n144\n\n\n \n\n\n \n\n\n \n\n\n176\n\n\n \n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n29\n\n\n \n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n74\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n296\n\n\n \n\n\n\n\n\n\nProvision for specified litigation matter \n(i)\n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n\n\n\n\nAdjusted operating income\n\n\n$\n\n\n467\n\n\n \n\n\n \n\n\n$\n\n\n414\n\n\n \n\n\n \n\n\n$\n\n\n1,366\n\n\n \n\n\n \n\n\n$\n\n\n1,282\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIncome/(loss) from operations margin\n\n\n \n\n\n18.3\n\n\n%\n\n\n \n\n\n \n\n\n(33.5\n\n\n)%\n\n\n \n\n\n \n\n\n18.0\n\n\n%\n\n\n \n\n\n \n\n\n(4.0\n\n\n)%\n\n\n\n\n\n\nAdjusted operating income margin\n\n\n \n\n\n20.4\n\n\n%\n\n\n \n\n\n \n\n\n18.1\n\n\n%\n\n\n \n\n\n \n\n\n20.2\n\n\n%\n\n\n \n\n\n \n\n\n18.6\n\n\n%\n\n\n\n\n \n(i)\nRepresents a provision related to potential litigation arising out of a structured insurance program originally placed for a client over 15 years ago. The program is of a type and complexity that was highly bespoke to the client and for that reason is unlikely to be exactly replicated elsewhere. Because of this, while we do not believe the potential litigation is material, we believe excluding this matter from adjusted results makes results more comparable from period to period and more representative of our core business operations.\nAdjusted operating income increased for the three months ended September 30, 2025 to $467 million, from $414 million for the three months ended September 30, 2024 and increased for the nine months ended September 30, 2025 to $1.4 billion from $1.3 billion for the nine months ended September 30, 2024. These increases resulted primarily from lower marketing expenses and decreased office and technology expenses in the current-year periods, partially offset by lower revenue due to the prior-year sale of our TRANZACT business.\nAdjusted EBITDA/Margin\nWe consider adjusted EBITDA/margin to be important financial measures, which are used internally to evaluate and assess our core operations, to benchmark our operating results against our competitors and to evaluate and measure our performance-based compensation plans.\n\n\n45\n\n\n\n\n \n\n\nAdjusted EBITDA is defined as net income/(loss) adjusted for provision for/(benefit from) income taxes, interest expense, impairment, depreciation and amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations, net periodic pension and postretirement benefits, and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted EBITDA margin is calculated by dividing adjusted EBITDA by revenue.\nReconciliations of net income/(loss) to adjusted EBITDA for the three and nine months ended September 30, 2025 and 2024 are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended \nSeptember 30,\n\n\n \n\n\n \n\n\nNine Months Ended \nSeptember 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n\n\n\n\nNET INCOME/(LOSS)\n\n\n \n\n\n$\n\n\n306\n\n\n \n\n\n \n\n\n$\n\n\n(1,672\n\n\n)\n\n\n \n\n\n$\n\n\n877\n\n\n \n\n\n \n\n\n$\n\n\n(1,336\n\n\n)\n\n\n\n\n\n\nProvision for/(benefit from) income taxes\n\n\n \n\n\n \n\n\n77\n\n\n \n\n\n \n\n\n \n\n\n(322\n\n\n)\n\n\n \n\n\n \n\n\n121\n\n\n \n\n\n \n\n\n \n\n\n(248\n\n\n)\n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n65\n\n\n \n\n\n \n\n\n \n\n\n65\n\n\n \n\n\n \n\n\n \n\n\n194\n\n\n \n\n\n \n\n\n \n\n\n197\n\n\n \n\n\n\n\n\n\nImpairment\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n\n\n\n\nDepreciation\n\n\n \n\n\n \n\n\n56\n\n\n \n\n\n \n\n\n \n\n\n60\n\n\n \n\n\n \n\n\n \n\n\n167\n\n\n \n\n\n \n\n\n \n\n\n176\n\n\n \n\n\n\n\n\n\nAmortization\n\n\n \n\n\n \n\n\n47\n\n\n \n\n\n \n\n\n \n\n\n56\n\n\n \n\n\n \n\n\n \n\n\n144\n\n\n \n\n\n \n\n\n \n\n\n176\n\n\n \n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n29\n\n\n \n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n74\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n296\n\n\n \n\n\n\n\n\n\nProvision for specified litigation matter \n(i)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n\n\n\n\nNet periodic pension and postretirement benefits\n\n\n \n\n\n \n\n\n(12\n\n\n)\n\n\n \n\n\n \n\n\n(22\n\n\n)\n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n \n\n\n \n\n\n(65\n\n\n)\n\n\n\n\n\n\n(Gain)/loss on disposal of operations\n\n\n \n\n\n \n\n\n(26\n\n\n)\n\n\n \n\n\n \n\n\n1,190\n\n\n \n\n\n \n\n\n \n\n\n(40\n\n\n)\n\n\n \n\n\n \n\n\n1,190\n\n\n \n\n\n\n\n\n\nAdjusted EBITDA\n\n\n \n\n\n$\n\n\n515\n\n\n \n\n\n \n\n\n$\n\n\n479\n\n\n \n\n\n \n\n\n$\n\n\n1,517\n\n\n \n\n\n \n\n\n$\n\n\n1,470\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nNet income margin\n\n\n \n\n\n \n\n\n13.4\n\n\n%\n\n\n \n\n\n \n\n\n(73.0\n\n\n)%\n\n\n \n\n\n \n\n\n13.0\n\n\n%\n\n\n \n\n\n \n\n\n(19.4\n\n\n)%\n\n\n\n\n\n\nAdjusted EBITDA margin\n\n\n \n\n\n \n\n\n22.5\n\n\n%\n\n\n \n\n\n \n\n\n20.9\n\n\n%\n\n\n \n\n\n \n\n\n22.4\n\n\n%\n\n\n \n\n\n \n\n\n21.3\n\n\n%\n\n\n\n\n \n(i)\nRepresents a provision related to potential litigation arising out of a structured insurance program originally placed for a client over 15 years ago. The program is of a type and complexity that was highly bespoke to the client and for that reason is unlikely to be exactly replicated elsewhere. Because of this, while we do not believe the potential litigation is material, we believe excluding this matter from adjusted results makes results more comparable from period to period and more representative of our core business operations.\nAdjusted EBITDA for the three months ended September 30, 2025 was $515 million, compared to $479 million for the three months ended September 30, 2024, and was $1.5 billion for both the nine months ended September 30, 2025 and 2024. These increases resulted primarily from lower marketing expenses and decreased office and technology expenses in the current-year periods, partially offset by lower revenue due to the prior-year sale of our TRANZACT business.\nAdjusted Net Income and Adjusted Diluted Earnings Per Share\nAdjusted net income is defined as net income/(loss) attributable to WTW adjusted for impairment, amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations, net periodic pension and postretirement benefits, and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results and the related tax effect of those adjustments and the tax effects of internal reorganizations. This measure is used solely for the purpose of calculating adjusted diluted earnings per share.\nAdjusted diluted earnings per share is defined as adjusted net income divided by the weighted-average number of ordinary shares, diluted. Adjusted diluted earnings per share is used to internally evaluate and assess our core operations and to benchmark our operating results against our competitors.\n\n\n46\n\n\n\n\n \n\n\nReconciliations of net income/(loss) attributable to WTW to adjusted diluted earnings per share for the\n \nthree and nine months ended September 30, 2025 and 2024 are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended \nSeptember 30,\n\n\n \n\n\n \n\n\nNine Months Ended \nSeptember 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n\n\n\n\nNET INCOME/(LOSS) ATTRIBUTABLE TO WTW\n\n\n \n\n\n$\n\n\n304\n\n\n \n\n\n \n\n\n$\n\n\n(1,675\n\n\n)\n\n\n \n\n\n$\n\n\n870\n\n\n \n\n\n \n\n\n$\n\n\n(1,344\n\n\n)\n\n\n\n\n\n\nAdjusted for certain items:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nImpairment\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n\n\n\n\nAmortization\n\n\n \n\n\n \n\n\n47\n\n\n \n\n\n \n\n\n \n\n\n56\n\n\n \n\n\n \n\n\n \n\n\n144\n\n\n \n\n\n \n\n\n \n\n\n176\n\n\n \n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n29\n\n\n \n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n74\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n296\n\n\n \n\n\n\n\n\n\nProvision for specified litigation matter \n(i)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n\n\n\n\nNet periodic pension and postretirement benefits\n\n\n \n\n\n \n\n\n(12\n\n\n)\n\n\n \n\n\n \n\n\n(22\n\n\n)\n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n \n\n\n \n\n\n(65\n\n\n)\n\n\n\n\n\n\n(Gain)/loss on disposal of operations\n\n\n \n\n\n \n\n\n(26\n\n\n)\n\n\n \n\n\n \n\n\n1,190\n\n\n \n\n\n \n\n\n \n\n\n(40\n\n\n)\n\n\n \n\n\n \n\n\n1,190\n\n\n \n\n\n\n\n\n\nTax effect on certain items listed above \n(ii)\n\n\n \n\n\n \n\n\n(9\n\n\n)\n\n\n \n\n\n \n\n\n(391\n\n\n)\n\n\n \n\n\n \n\n\n(47\n\n\n)\n\n\n \n\n\n \n\n\n(476\n\n\n)\n\n\n\n\n\n\nTax effect of significant adjustments\n\n\n \n\n\n \n\n\n(5\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(79\n\n\n)\n\n\n \n\n\n \n\n\n(7\n\n\n)\n\n\n\n\n\n\nAdjusted net income\n\n\n \n\n\n$\n\n\n301\n\n\n \n\n\n \n\n\n$\n\n\n282\n\n\n \n\n\n \n\n\n$\n\n\n902\n\n\n \n\n\n \n\n\n$\n\n\n854\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nWeighted-average ordinary shares — diluted\n\n\n \n\n\n \n\n\n98\n\n\n \n\n\n \n\n\n \n\n\n102\n\n\n \n\n\n \n\n\n \n\n\n100\n\n\n \n\n\n \n\n\n \n\n\n103\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nDiluted earnings/(loss) per share\n\n\n \n\n\n$\n\n\n3.11\n\n\n \n\n\n \n\n\n$\n\n\n(16.44\n\n\n)\n\n\n \n\n\n$\n\n\n8.74\n\n\n \n\n\n \n\n\n$\n\n\n(13.11\n\n\n)\n\n\n\n\n\n\nAdjusted for certain items \n(iii)\n :\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nImpairment\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n10.23\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n10.17\n\n\n \n\n\n\n\n\n\nAmortization\n\n\n \n\n\n \n\n\n0.48\n\n\n \n\n\n \n\n\n \n\n\n0.55\n\n\n \n\n\n \n\n\n \n\n\n1.45\n\n\n \n\n\n \n\n\n \n\n\n1.72\n\n\n \n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.08\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.28\n\n\n \n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n \n\n\n0.02\n\n\n \n\n\n \n\n\n \n\n\n0.73\n\n\n \n\n\n \n\n\n \n\n\n0.04\n\n\n \n\n\n \n\n\n \n\n\n2.89\n\n\n \n\n\n\n\n\n\nProvision for specified litigation matter \n(i)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n0.13\n\n\n \n\n\n\n\n\n\nNet periodic pension and postretirement benefits\n\n\n \n\n\n \n\n\n(0.12\n\n\n)\n\n\n \n\n\n \n\n\n(0.22\n\n\n)\n\n\n \n\n\n \n\n\n0.50\n\n\n \n\n\n \n\n\n \n\n\n(0.63\n\n\n)\n\n\n\n\n\n\n(Gain)/loss on disposal of operations\n\n\n \n\n\n \n\n\n(0.27\n\n\n)\n\n\n \n\n\n \n\n\n11.68\n\n\n \n\n\n \n\n\n \n\n\n(0.40\n\n\n)\n\n\n \n\n\n \n\n\n11.61\n\n\n \n\n\n\n\n\n\nTax effect on certain items listed above \n(ii)\n\n\n \n\n\n \n\n\n(0.09\n\n\n)\n\n\n \n\n\n \n\n\n(3.84\n\n\n)\n\n\n \n\n\n \n\n\n(0.47\n\n\n)\n\n\n \n\n\n \n\n\n(4.64\n\n\n)\n\n\n\n\n\n\nTax effect of significant adjustments\n\n\n \n\n\n \n\n\n(0.05\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n(0.79\n\n\n)\n\n\n \n\n\n \n\n\n(0.07\n\n\n)\n\n\n\n\n\n\nAdjusted diluted earnings per share\n\n\n \n\n\n$\n\n\n3.07\n\n\n \n\n\n \n\n\n$\n\n\n2.77\n\n\n \n\n\n \n\n\n$\n\n\n9.07\n\n\n \n\n\n \n\n\n$\n\n\n8.33\n\n\n \n\n\n\n\n \n(i)\nRepresents a provision related to potential litigation arising out of a structured insurance program originally placed for a client over 15 years ago. The program is of a type and complexity that was highly bespoke to the client and for that reason is unlikely to be exactly replicated elsewhere. Because of this, while we do not believe the potential litigation is material, we believe excluding this matter from adjusted results makes results more comparable from period to period and more representative of our core business operations. \n(ii)\nThe tax effect was calculated using an effective tax rate for each item.\n(iii)\nPer share values and totals may differ due to rounding.\nOur adjusted diluted earnings per share increased for both the three and nine months ended September 30, 2025 as compared to the prior year primarily due to a lower weighted-average outstanding share count due to our share repurchase activity over the last year, and lower marketing expenses and decreased office and technology expenses in the current-year periods, partially offset by lower revenue due to the prior-year sale of our TRANZACT business.\nAdjusted Income Before Taxes and Adjusted Income Taxes/Tax Rate\nAdjusted income before taxes is defined as income/(loss) from operations before income taxes and interest in earnings of associates adjusted for impairment, amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations, net periodic pension and postretirement benefits, and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted income before taxes is used solely for the purpose of calculating the adjusted income tax rate.\nAdjusted income taxes/tax rate is defined as the provision for/(benefit from) income taxes adjusted for taxes on certain items of impairment, amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations, net periodic pension and postretirement benefits, the tax effects of significant adjustments and non-recurring items that, in management’s\n \n\n\n47\n\n\n\n\n \n\n\njudgment, significantly affect the period-over-period assessment of operating results, divided by adjusted income before taxes. Adjusted income taxes is used solely for the purpose of calculating the adjusted income tax rate.\nManagement believes that the adjusted income tax rate presents a rate that is more closely aligned to the rate that we would incur if not for the reduction of pre-tax income for the adjusted items and the tax effects of significant adjustments, which are not core to our current and future operations.\nReconciliations of income/(loss) from operations before income taxes and interest in earnings of associates to adjusted income before taxes and provision for/(benefit from) income taxes to adjusted income taxes for the three and nine months ended September 30, 2025 and 2024 are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nThree Months Ended \nSeptember 30,\n\n\n \n\n\n \n\n\nNine Months Ended \nSeptember 30,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2025\n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n\n\n\n\nINCOME/(LOSS) FROM OPERATIONS BEFORE INCOME \n   TAXES AND INTEREST IN EARNINGS OF \n   ASSOCIATES\n\n\n \n\n\n$\n\n\n390\n\n\n \n\n\n \n\n\n$\n\n\n(1,998\n\n\n)\n\n\n \n\n\n$\n\n\n1,006\n\n\n \n\n\n \n\n\n$\n\n\n(1,589\n\n\n)\n\n\n\n\n\n\nAdjusted for certain items:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nImpairment\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n\n\n\n\nAmortization\n\n\n \n\n\n \n\n\n47\n\n\n \n\n\n \n\n\n \n\n\n56\n\n\n \n\n\n \n\n\n \n\n\n144\n\n\n \n\n\n \n\n\n \n\n\n176\n\n\n \n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n8\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n29\n\n\n \n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n \n\n\n \n\n\n74\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n \n\n\n \n\n\n \n\n\n296\n\n\n \n\n\n\n\n\n\nProvision for specified litigation matter \n(i)\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n\n\n\n\nNet periodic pension and postretirement benefits\n\n\n \n\n\n \n\n\n(12\n\n\n)\n\n\n \n\n\n \n\n\n(22\n\n\n)\n\n\n \n\n\n \n\n\n50\n\n\n \n\n\n \n\n\n \n\n\n(65\n\n\n)\n\n\n\n\n\n\n(Gain)/loss on disposal of operations\n\n\n \n\n\n \n\n\n(26\n\n\n)\n\n\n \n\n\n \n\n\n1,190\n\n\n \n\n\n \n\n\n \n\n\n(40\n\n\n)\n\n\n \n\n\n \n\n\n1,190\n\n\n \n\n\n\n\n\n\nAdjusted income before taxes\n\n\n \n\n\n$\n\n\n401\n\n\n \n\n\n \n\n\n$\n\n\n350\n\n\n \n\n\n \n\n\n$\n\n\n1,164\n\n\n \n\n\n \n\n\n$\n\n\n1,092\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProvision for/(benefit from) income taxes\n\n\n \n\n\n$\n\n\n77\n\n\n \n\n\n \n\n\n$\n\n\n(322\n\n\n)\n\n\n \n\n\n$\n\n\n121\n\n\n \n\n\n \n\n\n$\n\n\n(248\n\n\n)\n\n\n\n\n\n\nTax effect on certain items listed above \n(ii)\n\n\n \n\n\n \n\n\n9\n\n\n \n\n\n \n\n\n \n\n\n391\n\n\n \n\n\n \n\n\n \n\n\n47\n\n\n \n\n\n \n\n\n \n\n\n476\n\n\n \n\n\n\n\n\n\nTax effect of significant adjustments\n\n\n \n\n\n \n\n\n5\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n79\n\n\n \n\n\n \n\n\n \n\n\n7\n\n\n \n\n\n\n\n\n\nAdjusted income taxes\n\n\n \n\n\n$\n\n\n91\n\n\n \n\n\n \n\n\n$\n\n\n69\n\n\n \n\n\n \n\n\n$\n\n\n247\n\n\n \n\n\n \n\n\n$\n\n\n235\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nU.S. GAAP tax rate\n\n\n \n\n\n \n\n\n19.7\n\n\n%\n\n\n \n\n\n \n\n\n16.1\n\n\n%\n\n\n \n\n\n \n\n\n12.0\n\n\n%\n\n\n \n\n\n \n\n\n15.6\n\n\n%\n\n\n\n\n\n\nAdjusted income tax rate\n\n\n \n\n\n \n\n\n22.4\n\n\n%\n\n\n \n\n\n \n\n\n19.7\n\n\n%\n\n\n \n\n\n \n\n\n21.2\n\n\n%\n\n\n \n\n\n \n\n\n21.5\n\n\n%\n\n\n\n\n \n(i)\nRepresents a provision related to potential litigation arising out of a structured insurance program originally placed for a client over 15 years ago. The program is of a type and complexity that was highly bespoke to the client and for that reason is unlikely to be exactly replicated elsewhere. Because of this, while we do not believe the potential litigation is material, we believe excluding this matter from adjusted results makes results more comparable from period to period and more representative of our core business operations.\n(ii)\nThe tax effect was calculated using an effective tax rate for each item.\nOur U.S. GAAP tax rates were 19.7% and 16.1% for the three months ended September 30, 2025 and 2024, respectively, and 12.0% and 15.6% for the nine months ended September 30 2025 and 2024, respectively. The prior-year effective tax rate for the three months ended September 30, 2024 was lower due to deferred tax benefits recognized on the gross-up to carrying value of net assets to be disposed and a deferred tax benefit of $56 million, net of a $37 million valuation allowance, on the expected tax loss associated with the sale of our TRANZACT business. The current-year effective tax rate for the nine months ended September 30, 2025 is lower due to favorable discrete tax items, primarily related to provision-to-tax return adjustments.\nOur adjusted income tax rates were 22.4% and 19.7% for the three months ended September 30, 2025 and 2024, respectively, and 21.2% and 21.5% for the nine months ended September 30, 2025 and 2024, respectively. The current-year quarter’s adjusted tax rate is higher primarily due to the geographical distribution of profits. The adjusted tax rate for the first nine months ended September 30, 2025 is lower due to favorable discrete items, primarily related to provision-to-tax return adjustments, in comparison to the prior year.\nFree Cash Flow\nFree cash flow is defined as cash flows from operating activities less cash used to purchase fixed assets and software. Free cash flow is a liquidity measure and is not meant to represent residual cash flow available for discretionary expenditures.\n \n\n\n48\n\n\n\n\n \n\n\nAs a result of our change in presentation, free cash flow for\n \nthe prior period has been adjusted to conform to the current period, which includes the deduction of our capitalized software costs.\nManagement believes that free cash flow presents the core operating performance and cash generating capabilities of our business operations.\nReconciliations of cash flows from operating activities to free cash flow for the nine months ended September 30, 2025 and 2024 are as follows:\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nNine Months Ended September 30\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2025\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nCash flows from operating activities\n\n\n \n\n\n$\n\n\n1,004\n\n\n \n\n\n \n\n\n$\n\n\n913\n\n\n \n\n\n\n\n\n\nLess: Additions to fixed assets and software\n\n\n \n\n\n \n\n\n(166\n\n\n)\n\n\n \n\n\n \n\n\n(189\n\n\n)\n\n\n\n\n\n\nFree cash flow\n\n\n \n\n\n$\n\n\n838\n\n\n \n\n\n \n\n\n$\n\n\n724\n\n\n \n\n\n\n\nThe increase in free cash flow during the current-year period was primarily driven by operating margin expansion and lower Transformation program residual cash outflows.\nCritical Accounting Estimates\nThere were no material changes from the Critical Accounting Estimates disclosed in our Annual Report on Form 10-K for the year ended December 31, 2024, filed with the SEC on February 25, 2025.\n \n\n\n49"
}