{
  "source_file": "wtw-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. \nBUSINESS\n \n\n\nThe Company\n\n\nWTW is a leading global advisory, broking and solutions company that provides data-driven, insight-led solutions in the areas of people, risk and capital. Utilizing the global view and local expertise of our approximately 49,000 colleagues serving more than 140 countries and markets, we help organizations sharpen strategies, enhance resilience, motivate workforces and maximize performance. We design and deliver solutions that manage risk, optimize benefits, cultivate talent and expand the power of capital to protect and strengthen institutions and individuals. Working closely with our clients, we uncover opportunities for sustainable success.\n\n\nOur clients operate on a global and local scale in a multitude of businesses and industries throughout the world and generally range in size from large, major multinational corporations to middle-market domestic and international companies. Our clients include many of the world’s leading corporations, including approximately 96% of the FTSE 100, 89% of the Fortune 1000, and 90% of the Fortune Global 500 companies. We also advise the majority of the world’s leading insurance companies. We work with major corporations, emerging growth companies, governmental agencies and not-for-profit institutions in a wide variety of industries, with many of our client relationships spanning decades. None of the Company’s clients individually represented more than 10% of its consolidated revenue for each of the years ended December 31, 2024, 2023 and 2022. We place insurance with approximately 2,500 insurance carriers, none of which individually accounted for a significant concentration of the total premiums we placed on behalf of our clients in 2024, 2023 or 2022.\n\n\nAvailable Information\n\n\nThe Company files annual, quarterly and current reports, proxy statements and other information with the SEC. The SEC maintains a website that contains annual, quarterly and current reports, proxy statements and other information that issuers (including WTW) file electronically with the SEC. The SEC’s website is www.sec.gov.\n\n\nThe Company makes available, free of charge through our website, www.wtwco.com, our Annual Report on Form 10-K, our quarterly reports on Form 10-Q, our proxy statement, current reports on Form 8-K and Forms 3, 4, and 5 filed on behalf of directors and Section 16 officers, as well as any amendments to those reports filed or furnished pursuant to the Securities Exchange Act of 1934 (the ‘Exchange Act’) as soon as reasonably practicable after such material is electronically filed with, or furnished to, the SEC. Unless specifically incorporated by reference, information on our website is not a part of this Form 10-K.\n\n\nThe Company’s Memorandum and Articles of Association,\n \nCorporate Governance Guidelines, Audit Committee Charter, Risk and Operational Oversight Committee Charter, Human Capital and Compensation Committee Charter, and Corporate Governance and Nominating Committee Charter are available on our website, www.wtwco.com, in the Investor Relations section, or upon request. Requests for copies of these documents should be directed in writing to the Company Secretary c/o Office of General Counsel, Willis Towers Watson Public Limited Company, Brookfield Place, 200 Liberty Street, New York, NY 10281.\n\n\nGeneral Information\n\n\nWTW offers its clients a broad range of services and solutions to help them to identify and control their risks, and to enhance business performance by improving their ability to attract, retain and engage a talented workforce. Our risk control services range from strategic risk consulting (including providing actuarial analysis) to a variety of due diligence services, to the provision of practical on-site risk control services (such as health and safety or property loss control consulting), as well as analytical and advisory services (such as hazard modeling and climate risk quantification). We assist clients in planning how to manage incidents or crises when they occur. These services include contingency planning, security audits and product tampering plans. We help our clients enhance their business performance by delivering consulting services, technology and solutions that help them anticipate, identify and capitalize on emerging opportunities in human capital management, as well as offer investment advice to help them develop disciplined and efficient strategies to meet their investment goals.\n\n\nAs an insurance broker, we act as an intermediary between our clients and insurance carriers by advising our clients on their risk management requirements, helping them to determine the best means of managing risk and negotiating and placing insurance with insurance carriers through our global distribution network.\n \n\n\nWe operate a private Medicare marketplace in the U.S. through which, along with our active employee marketplace, we help our clients move to a more sustainable economic model by capping and controlling the costs associated with healthcare benefits.\n\n\nWe are not an insurance company, and therefore we do not underwrite insurable risks for our own account. We help sharpen strategies, enhance organizational resilience, motivate workforces and maximize performance to uncover opportunities for sustainable success.\n\n\n3\n\n\n\n\n \n\n\nWe derive the majority of our revenue from either commissions or fees for brokerage or consulting services. We do not determine the insurance premiums on which our commissions are generally based. Commission levels generally follow the same trend as premium levels as they are derived from a percentage of the premiums paid by the insureds. Fluctuations in these premiums charged by the insurance carriers can therefore have a direct and potentially material impact on our results of operations. Our fees for consulting services are spread across a variety of complementary businesses that generally remain steady during times of uncertainty. We have some businesses, such as our health and benefits and administration businesses, which can be counter cyclical during the early period of a significant economic change.\n\n\nBusiness Strategy\n \n\n\nWe believe that a unified and integrated approach to advisory, broking and solutions can be a path to growth for organizations around the world. We harness our collective power as ‘One WTW’ to make smart connections to serve and support our clients.\n\n\nWe operate in attractive markets – both growing and mature – with a diversified platform across industries, segments and businesses globally.\n \n\n\nOur strategy is focused on extending and amplifying WTW’s strengths to deliver sustainable growth and profitability.\n\n\nWe believe we can achieve this through executing on our three objectives:\n\n\n•\nAccelerate performance\n: By executing on the segment growth strategies to strengthen business fundamentals, advance innovative solutions and capitalize on our global footprint. \n\n\n•\nEnhance efficiency\n: By having a continuous improvement mindset, delivering operating leverage in our segments and leveraging WTW Enterprise Delivery Organization (WE DO) to focus on right work, right place, right tools and real estate optimization.\n\n\n•\nOptimize portfolio\n: By intentionally managing our portfolio through inorganic and organic investment in areas of strength and deepen our large and high-growth businesses with strategic investments in corporate risk and broking, health and benefits and wealth. Also, by divesting businesses that are no longer a strategic fit or do not have our desired financial profile. \n\n\nThese objectives are enabled by a focused investment framework and capital allocation strategy.\n\n\nThrough this strategy, we aim to grow revenue, improve margins and increase free cash flow, EBITDA and earnings. In turn, we’ll be able to fulfill our shared company purpose – We transform tomorrows.\n\n\nWe care as much about how we work as we do about the impact that we make. This means commitment to our shared purpose and values, a framework that guides how we run our business and serve clients. Our values of client focus, teamwork, integrity, respect and excellence underlie all that we do, and how we behave and interact with each other, our clients and our partners.\n\n\nFor more information about risks to our strategic plans, see Part I, Item 1A Risk Factors of this Form 10-K.\n\n\nPrincipal Services\n \n\n\nWe manage our business across two integrated reportable operating segments: Health, Wealth & Career and Risk & Broking. Below are the percentages of revenue generated by each segment for each of the years ended December 31, 2024, 2023 and 2022. These percentages exclude revenue that has been classified as discontinued operations in our consolidated statements of comprehensive income.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n\n\n\n\nHealth, Wealth & Career\n\n\n \n\n\n \n\n\n59\n\n\n%\n\n\n \n\n\n \n\n\n60\n\n\n%\n\n\n \n\n\n \n\n\n60\n\n\n%\n\n\n\n\n\n\nRisk & Broking\n\n\n \n\n\n \n\n\n41\n\n\n%\n\n\n \n\n\n \n\n\n40\n\n\n%\n\n\n \n\n\n \n\n\n40\n\n\n%\n\n\n\n\n\n\nThe following presents descriptions of our segments:\n \n\n\nHealth, Wealth & Career\n\n\nThe Health, Wealth & Career (‘HWC’) segment provides an array of advice, broking, solutions and technology for employee benefit plans, institutional investors, compensation and career programs, and the employee experience overall. Our portfolio of services support the interrelated challenges that the management teams of our clients face across human resources (‘HR’) and finance.\n \n\n\n4\n\n\n\n\n \n\n\nHWC is the larger of the two segments of the Company. Addressing four key areas, Health, Wealth, Career and Benefits Delivery & Outsourcing, the segment is focused on addressing our clients’ people and risk needs to help them succeed in a global marketplace.\n\n\nHealth\n\n\nThe Health & Benefits (‘H&B’) business provides strategy and design consulting,\n \nplan management service and support, broking and administration across the full spectrum of health, wellbeing and other group benefit programs, including medical, dental, disability, life, voluntary benefits and other coverage. Our reach extends from small/mid-market clients to large-market and multinational clients, across the full geographic footprint of the Company, and to most industries. We can address our clients’ needs in more than 140 countries.\n\n\nOur consultants help clients make strategic decisions on topics such as optimizing program spend; evaluating emerging vendors, point solutions and coverage options (including publicly-subsidized health insurance exchanges and private exchanges in the U.S.); and dealing with above-inflation-rate increases in healthcare costs. We also assist clients in selecting the appropriate insurance carriers to cover benefit risks and administer the programs. In addition to our consulting and broking services, we manage a number of collective purchasing initiatives, such as pharmacy and stop-loss, that allow employers to realize greater value from third-party service providers than they can achieve on their own.\n\n\nWith Global Benefits Management, our suite of global services supporting medical, dental and risk (e.g., life, disability) programs, we have a tailored offering for multinationals. This offering includes a flexible set of ready-made solutions, proven technology and an integrated approach to service delivery that translates to a globally consistent, high-quality experience for our clients.\n\n\nA meaningful portion of revenue in this business is from recurring work, though contracts may be annual or multi-year. Given the balance of revenue across consulting, broking and solutions, our revenue is somewhat weighted to the first half of the year.\n\n\nW\nealth\n\n\nOur wealth-related businesses include Retirement and Investments.\n\n\nRetirement \n— Our Retirement business provides actuarial support, plan design, and administrative services for all forms of pension and retirement savings plans. Our colleagues help our clients assess the costs and risks of retirement plans on cash flow, earnings and the balance sheet, the effects of changing workforce demographics on their retirement plans, and retiree benefit adequacy and security. We offer clients a full range of integrated retirement consulting services and solutions to meet the needs of all types of employers. We help multinationals coordinate plan design and actuarial services across their complex global plans. We bring in-depth data analysis and perspective to their decision-making process as we have tracked the retirement designs and financing strategies of companies around the world over many decades.\n\n\nFor clients that want to outsource some or all of their pension plan management, we offer broking services, as well as integrated solutions that can combine investment discretionary management, pension administration, core actuarial services, and communication and change management assistance.\n\n\nRetirement relationships are generally long-term in nature, and client retention rates for this business are high. A significant portion of the revenue in this business is from recurring work, with multi-year contracts that are driven by the heavily regulated nature of pension plans and our clients’ annual needs for these services.\n \n\n\nInvestments \n— Our Investments business provides advice and discretionary investment management solutions to defined benefit and defined contribution pension plans as well as to a range of other client types including insurers, endowments and foundations, and private wealth investors. We provide a solution to a significant business problem faced by our clients, namely sustaining the resources and skills required to deliver a financial services product in highly competitive capital markets. We offer a flexible approach that adapts to a wide range of client needs and circumstances, with the objective of higher returns, lower risk and lower costs within each client’s unique situation.\n\n\nOur solutions range from single asset class activity, through complete management of entire pension plan assets including sophisticated liability hedging programs as well as pooled employer plans/Master Trust under our LifeSight branding.\n\n\nWe bring together a broad array of specialist investment knowledge and skills across all asset classes, a high-quality execution platform, a cost advantage through our scale, and expert advisors with experience across all client types from the largest plans in the world to small corporate pension plans.\n\n\nWe have long-term relationships with our Investments clients, with the majority of our revenue driven by retainer contracts.\n\n\n5\n\n\n\n\n \n\n\nCareer\n\n\nOur\n \ncareer-related offerings include advice, data, software and products to address clients’ total rewards and talent issues across the globe delivered through our Work & Rewards and Employee Experience businesses.\n\n\nWork & Rewards\n — Within our Work & Rewards business, we help clients determine the best ways to get work done, the skills needed for jobs, and how to reward employees. We address executive compensation and broad-based rewards. We advise our clients’ management and boards of directors on all aspects of executive pay programs, including base pay, annual bonuses, long-term incentives, perquisites and other benefits. Our focus is on aligning pay plans with an organization’s business strategy and driving desired performance. Our solutions incorporate proprietary market benchmarking data and software to support compensation administration.\n\n\nEmployee Experience\n — Our Employee Experience business focuses on the provision of solutions including employee insight and listening tools, a technology platform that serves as a gateway for employees and plan participants to access their benefits and career information, communication and change management services.\n\n\nRevenue for our career-related businesses is partly seasonal in nature, with heightened activity in the second half of the calendar year during the annual compensation, benefits and survey cycles. While these businesses enjoy long-term relationships with many clients, work in some parts of the businesses is project-based and can be sensitive to economic changes. The businesses benefit from regulatory changes affecting our clients that require strategic advice, program changes and communication, the redefinition of jobs, work location and career paths as technology disaggregates work, and the recalibration of pay and the employee experience amidst shifting labor markets.\n\n\nBenefits Delivery & Outsourcing\n\n\nOur Benefits Delivery & Outsourcing businesses include Benefits Delivery & Administration (‘BDA’) and Global Outsourcing.\n\n\nBenefits Delivery & Administration \n— The\n \nBDA business includes Individual Marketplace and Benefits Accounts.\n \n\n\nIndividual Marketplace \n—\n \nIndividual Marketplace offers decision support processes and tools to connect consumers with insurance carriers in private individual and Medicare markets. Individual Marketplace serves employer-based populations  through its end-to-end consumer acquisition and engagement platforms, which tightly integrate call routing technology, an efficient quoting and enrollment engine, a customer relations management system and deep links with insurance carriers. By leveraging its multiple distribution channels and diverse product portfolio, Individual Marketplace offers solutions to a broad consumer base, helping individuals compare, purchase and use health insurance products, tools and information for life.\n\n\nBenefits Accounts \n—  Benefits Accounts provides employees and retirees with tax-advantaged medical spending and savings accounts including health savings accounts (‘HSA’), health care flexible spending accounts (‘HCFSA’), dependent care flexible spending accounts (‘DCFSA’), limited purpose flexible spending accounts (‘LPFSA’) and health reimbursement arrangements (‘HRA’). Benefits Accounts is an important component of our holistic solutions suite, allowing employers to choose among an array of funding accounts when offering employees and retirees account-based health plans.\n\n\nGlobal Outsourcing \n— Global Outsourcing administers the health, welfare and retirement plans of clients using our proprietary technology, including tools to enable benefit modeling, decision support, enrollment and benefit choice, records management and self-service functions. Drawing on expertise in H&B and Retirement to create high-performing benefit plan designs, we believe we are well-positioned to help clients of all sizes simplify their benefits delivery, while lowering the total costs of benefits and related administration. Our technology also provides trustees and HR teams with timely management information to monitor activity and service levels and reduce administration costs.\n\n\nWith ongoing servicing requirements and multi-year contracts in place, we have high client retention rates. We provide plan administration services in North America, the U.K., Ireland and Germany.\n\n\nA significant portion of the revenue in Benefits Delivery & Outsourcing is recurring in nature, driven by either the commissions from the policies we sell, or from long-term service contracts with our clients that typically range from three to five years. Revenue across this business is seasonal and is generally higher in the fourth quarter as it is driven when typical annual enrollment activity occurs.\n\n\n6\n\n\n\n\n \n\n\nRisk & Broking\n\n\nThe Risk & Broking (‘R&B’) segment provides a broad range of risk advice, insurance brokerage and consulting services to clients globally, ranging from small businesses to multinational corporations.\n\n\nThe segment comprises two primary businesses: our Corporate Risk & Broking and our Insurance Consulting and Technology businesses.\n\n\nCorporate Risk & Broking (‘CRB’)\n\n\nThe\n \nCRB business places more than $30 billion of premiums into the insurance markets on an annual basis and delivers integrated global solutions tailored to client needs. This is underpinned by data and analytics through a balanced matrix of global lines of business and local Property and Casualty businesses, across four geographical areas: North America, Great Britain, Western Europe and International. Globally, and across the businesses, our specialized and data-driven approach is underpinned by our risk analytics and climate analytics propositions.\n\n\nAcross all businesses, our experts take an industry-focused approach to risk management and assessment, delivering broader perspectives and data-informed decision making to our clients. Our lines of business include Property and Casualty, Affinity, Risk & Analytics and our specialty global lines of business.\n\n\nProperty and Casualty \n— Property and Casualty, in each of our geographical areas, provides property and liability insurance brokerage services across a wide range of industries and segments including real estate, healthcare and retail.\n \n\n\nAffinity\n — Through Affinity, we arrange insurance products and services for our affinity client partners to offer to their customers, employees, or members alongside, or in addition to, their principal business offerings.\n\n\nRisk & Analytics (‘R&A’)\n — Our R&A offering includes deep expertise on specific client needs. Through the use of holistic analysis, R&A brings value through risk quantification and development of a robust portfolio risk strategy, ultimately delivering a sound financial approach to all clients.\n\n\nOur specialty global lines of business include:\n\n\nAerospace \n—\n \nAerospace\n \nprovides specialist expertise to the aerospace and space industries. Our aerospace business provides insurance broking, risk management services, contractual and technical advisory expertise to aerospace clients globally, including the world’s leading airlines, aircraft manufacturers, air cargo handlers and other airport and general aviation companies. The specialist InSpace team is also prominent in providing insurance and risk management services to the space industry.\n\n\nConstruction\n — Our Construction business provides services that include insurance broking, claims, loss control and specialized risk advice for a wide range of construction projects and activities. Clients include contractors, project owners, public entities, project managers, consultants and financiers, among others.\n\n\nGlobal Markets Direct & Facultative\n — Operating in the major wholesale reinsurance hubs across the globe, including London, Bermuda, Singapore, Hong Kong and Shanghai, solutions are delivered both directly to clients for the most complex property and casualty risks and as facultative reinsurance placements where we serve as an intermediary for insurance companies. Facultative solutions are provided across various classes of risk for our insurer clients, some of which may also be direct clients of WTW. The aim is to deliver optimum results for our clients by getting the right risk to the right market by the right broker, be it local, wholesale or facultative every time.\n\n\nFinancial, Executive and Professional Risks (‘FINEX’)\n — FINEX encompasses all financial and executive risks, delivering client solutions that range from management and professional liability, employment practices liability, crime, cyber and M&A-related insurances to risk consulting and advisory services. Specialist teams provide risk consulting and risk transfer solutions to a broad spectrum of clients across a multitude of industries, as well as the financial and professional service sectors.\n\n\nFinancial Solutions\n — Financial Solutions provides insurance broking services and specialized risk advice related to credit and political risk. Clients include international banks, commodity traders, export credit agencies and multinational corporations\n.\n\n\nCrisis Management\n — Our global practice delivers crisis management and contingency risk management to multinational clients, providing comprehensive solutions around terrorism, political violence, accident and health, special crime and active assailant.\n\n\nSurety \n—\n \nThe Global Surety team provides expertise in placing bonds across all industries and around the globe. A surety bond is a financial instrument that guarantees contractual performance, statutory compliance, and financial assurance for domestic and international companies.\n\n\n7\n\n\n\n\n \n\n\nMarine \n—\n \nMarine\n \nprovides specialist expertise to the maritime and logistics industries. Our Marine business provides insurance broking services related to hull and machinery, cargo, protection and indemnity, fine art and general marine liabilities, among others. Our Marine clients include, but are not limited to, ship owners and operators, shipbuilders, logistics operations, port authorities, traders, shippers, exhibitors and secure transport companies.\n\n\nNatural Resources\n — Our Natural Resources practice encompasses the oil, gas and chemicals, mining and metals, power and utilities and renewable energy sectors. It provides sector-specific risk transfer solutions and insights, which include insurance broking, risk engineering, contractual reviews, wording analysis and claims management.\n\n\nInsurance Consulting and Technology (‘ICT’)\n\n\nICT is a global business that provides advice and technology solutions to the insurance industry. We leverage our industry experience, strategic perspective and analytical skills to help clients measure and manage risk and capital, improve business performance and create a sustainable competitive advantage. Our services include software and technology, risk and capital management, products and product pricing, financial and regulatory reporting, financial and capital modeling, M&A, outsourcing and business management.\n\n\nHuman Capital\n \n\n\nColleague experience – \nOur colleague experience is an important differentiating factor for WTW and a key enabler of our strategy.  It is designed to provide colleagues with a strong sense of purpose and belonging where everyone is heard and valued, the opportunity to build great connections with people and leaders, meaningful and interesting work\n,\n and opportunities to grow and thrive with recognition and reward in return. This means we strive to foster an inclusive environment where everyone can be their authentic self, where we encourage curiosity, innovation and a continuous improvement mindset and an environment where we are bold in our thinking and care about the impact we have.\n\n\nOur values, vision, purpose, and Colleague Value Proposition (‘CVP’) — we’re Authentic, Curious and Bold, sets the tone for what to expect at WTW. In addition, our strategic priorities enhance our focus on how to support and improve our colleague experience. We continually build on our CVP through execution of a colleague experience roadmap and a robust portfolio of colleague listening activities to attract, engage and retain the most accomplished and aspiring talent.\n\n\nLearning & development –\n We support professional development and personal growth for our talent. Our colleagues take responsibility to develop their expertise, competencies and professional stature, while the Company invests in the tools and opportunities that allow for our colleagues’ continual development. Our digital-first learning approach enables career development for all our colleagues around the world, complemented by business-specific and technical training. Additionally, we offer targeted development programs for early careers, emerging leaders, managers and experienced leaders.\n\n\nColleagues – \nOur success depends on our ability to bring to our clients the most accomplished and aspiring talent in the industry. We provide our colleagues with meaningful long-term careers across our base of full-time (the majority), part-time and seasonal/temporary colleagues to meet the specific needs of our various businesses.\n\n\nThe number of colleagues by segment as of December 31, 2024 is approximated below:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2024 \n(i)\n\n\n \n\n\n\n\n\n\nHealth, Wealth & Career\n\n\n \n\n\n \n\n\n25,700\n\n\n \n\n\n\n\n\n\nRisk & Broking\n\n\n \n\n\n \n\n\n16,500\n\n\n \n\n\n\n\n\n\nCorporate and Other\n\n\n \n\n\n \n\n\n6,700\n\n\n \n\n\n\n\n\n\nTotal Colleagues\n\n\n \n\n\n \n\n\n48,900\n\n\n \n\n\n\n\n\n\n \n\n\n(i)\nHealth, Wealth & Career’s and Risk & Broking’s colleague totals as of December 31, 2024 include colleagues who provide direct support to the segments and were classified as Corporate in the prior year’s colleague totals.\n\n\nThe number of colleagues by geography as of December 31, 2024 is approximated below:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31, 2024\n\n\n \n\n\n\n\n\n\nNorth America\n\n\n \n\n\n \n\n\n15,100\n\n\n \n\n\n\n\n\n\nEurope\n\n\n \n\n\n \n\n\n15,200\n\n\n \n\n\n\n\n\n\nInternational\n\n\n \n\n\n \n\n\n18,600\n\n\n \n\n\n\n\n\n\nTotal Colleagues\n\n\n \n\n\n \n\n\n48,900\n\n\n \n\n\n\n\n\n\nVoluntary turnover excluding TRANZACT colleagues (rolling 12-month attrition) has remained well within target range throughout 2024 (10.9% compared to 10.8% in 2023). Future voluntary turnover trend data will exclude colleagues from our now-divested TRANZACT business, so comparison to prior years’ trends will not be impacted.\n\n\n8\n\n\n\n\n \n\n\nHiring\n\n\n•\nWith turnover remaining within target range, business areas are primarily focusing on targeted hiring campaigns for mid-senior level hires to support growth, future succession planning and/or as part of their location strategy.\n\n\n•\nHiring into the Early Careers programs remained relatively stable and consistent with 2023. The focus remains on building pipelines of high caliber talent through enhanced employer branding and attraction.\n\n\n \n\n\nHiring and internal movement statistics, summarized below, consistent with prior years excludes colleagues in TRANZACT as the volumes are material and fluctuate significantly in light of the nature of hiring in that business,\n \nwhich is materially dependent on seasonal colleagues. As discussed in Note 3 — Acquisitions and Divestitures and elsewhere in this Annual Report on Form 10-K, the sale of TRANZACT was completed on December 31, 2024. Because we have historically excluded TRANZACT colleagues from our annual hiring and internal movement statistics, these statistics will remain comparable year-over-year.\n\n\n•\nHires exceeded 7,800, a decrease of 4% as compared to 2023, primarily attributable to higher-than-typical hiring volumes in 2023 due to Global Service Delivery Center hiring.\n\n\n•\nWe continue to have a strong rate of alumni returning to WTW, with rehires representing 7% of total hires in 2024 compared to 6% in 2023.\n\n\n•\nOur continued focus for 2025 will be to increase our global investment in talent across sales and client-facing colleagues.\n\n\nInclusion and Diversity (‘I&D’) –\n Our people strategy guides our actions to make WTW a destination employer for top talent. Our approach to building and sustaining an inclusive and high-performing culture includes a priority focus on:\n\n\n•\nAttraction and retention \n–\n Growing the pipeline for talent with a broad range of backgrounds, experiences and perspectives.\n\n\n•\nDevelopment and Promotion \n–\n Supporting colleagues in all stages of career development.\n\n\n•\nCulture and Brand \n–\n Promoting an inclusive culture and work environment.\n\n\nOur policies, including our Code of Conduct, require that our employment decisions comply with applicable law.\n\n\nThe following chart reflects global female demographic data and U.S. ethnic and racial demographic data as of December 31, 2024:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nColleague Group\n\n\nAll Colleagues\n\n\n \n\n\nSenior Leadership \n(ii)\n\n\n\n\n\n\nFemale (global)\n\n\n55.2%\n\n\n \n\n\n33.6%\n\n\n\n\n\n\nEthnic and racial diversity (U.S. only)\n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nAsian\n\n\n7.0%\n\n\n \n\n\n5.9%\n\n\n\n\n\n\nBlack\n\n\n15.3%\n\n\n \n\n\n1.5%\n\n\n\n\n\n\nHispanic\n\n\n10.1%\n\n\n \n\n\n2.9%\n\n\n\n\n\n\nOther non-white \n(i)\n\n\n3.2%\n\n\n \n\n\n1.2%\n\n\n\n\n\n\nTotal\n\n\n35.6%\n\n\n \n\n\n11.5%\n\n\n\n\n\n\n \n\n\n(i)\nOther non-white includes American Indian, Native Hawaiian or other Pacific Islander and two or more races.\n\n\n(ii)\nSenior leadership represents 4% of our colleagues and includes those with titles of Managing and Senior Directors.\n\n\nOur board composition reflects a mix of gender, race, ethnicity, nationality, backgrounds, experiences and skill sets. As of December 31, 2024, 40% of directors identify as female, 10% as LGBT+ and 10% as Black (based on self-identified characteristics). In addition, 75% of our board committee chairs are female and 50% identify as Black or LGBT+. Additionally, 60% of our directors have non-US citizenship.\n\n\nTotal Rewards – \nWe invest significant resources in our most important asset, our colleagues, and having the right total rewards programs to support our colleague experience is an important part of our commitment to being the best company we can be. We offer market competitive rewards in aggregate, aligned to a pay-for-performance culture. Alongside our colleague experience, our total rewards programs position WTW as a magnet for the most accomplished and aspiring talent in the industry.\n \n\n\n9\n\n\n\n\n \n\n\nOur total rewards comprise a wide array of programs, including pay, benefits, share ownership, wellbeing, workplace flexibility, time off, career development opportunities and other aspects of the work environment. At its core, our total rewards programs are designed to:\n\n\n•\nAttract, engage, retain and develop talent with a broad range of backgrounds, experiences, and perspectives;\n\n\n•\nImprove colleague performance and engagement; and\n\n\n•\nAllow for meaningful choice, where appropriate, to address individual needs.\n\n\nAt WTW, we continually assess our total rewards strategy, considering colleague preferences and striving to invest in rewards that provide the greatest return. Insights gathered from colleague listening activities inform focus areas and adjustments that align with our strategic priorities and colleague experience — helping us offer the right mix of meaningful and competitive programs now and in the future to deliver our strategy. For example, in 2024, we launched an employee share purchase plan in several countries and a new recognition hub, a global platform for appreciation and recognition of colleagues.\n\n\nWork Styles \n– We have a flexible and adaptable approach to where colleagues work, aligned to the distinct needs of our businesses and leveraging three distinct working solutions: office-based, hybrid and remote. This framework has flexibility at its core and is based on the principle that the work itself drives where and how the work gets done. In-office interactions are encouraged for all colleagues, with some moving to more frequent and regular in-person collaboration, including minimum in-office requirements in some areas of our business. Our flexibility continues to be a key differentiator for us in the market and is an important part of our ongoing strategy to attract, engage and retain top talent.\n\n\nThe failure to successfully attract and retain qualified personnel could materially adversely affect our results of operations and prospects. For more information see Part I, Item 1A Risk Factors of this Annual Report on Form 10-K.\n\n\nCompetition\n \n\n\nWe face competition in all fields in which we operate, based on factors including global capability, product breadth, innovation, quality of service and price. We compete with companies such as Aon plc, Arthur J. Gallagher & Co., Brown & Brown Inc., Cognizant Technology Solutions Corporation, Marsh & McLennan Companies, Inc. (‘Marsh & McLennan’) and Robert Half International Inc., as well as with numerous specialty, regional and local firms.\n \n\n\nCompetition on premium rates has also exacerbated the pressures caused by a continuing reduction in demand in some classes of business. For example, rather than purchase additional insurance through brokers, some insureds have been retaining a greater proportion of their risk portfolios than previously. Industrial and commercial companies increasingly rely upon their own subsidiary insurance companies, known as captive insurance companies, self-insurance pools, risk retention groups, mutual insurance companies and other mechanisms for funding their risks, rather than buy insurance. Additional competitive pressures have arisen and are expected to continue to arise from the entry and expansion of new market participants, such as banks, accounting firms, new brokers and insurance carriers themselves, offering risk management or transfer services.\n\n\nThe human capital and risk management consulting industries are highly competitive. We believe we have developed competitive advantages in providing HR consulting and risk management consulting services. We face strong competition from numerous sources, including from large consulting firms, accounting firms and specialized firms focused on these services as further identified below. See Part I, Item 1A Risk Factors – \n‘Demand for our services could decrease for various reasons, including a general economic downturn, increased competition, or a decline in a client’s or an industry’s financial condition or prospects, all of which could substantially and negatively affect us’\n, for a description of competition-related risks that may affect demand for the Company’s services.\n \n\n\nOur largest competitors in the pension consulting industry are Mercer HR Consulting (a Marsh & McLennan company) and Aon plc. In addition, we face vigorous competition from numerous other companies in the global HR consulting industry.\n\n\nOur major competitors in the insurance consulting and software industry include Milliman, Oliver Wyman (a Marsh & McLennan company), the big four accounting firms (Deloitte LLP, Ernst & Young, PricewaterhouseCoopers, and KPMG), and SunGard. Aon plc, Mercer (a Marsh & McLennan company), Automatic Data Processing and Fidelity are among our largest competitors in the insurance exchange industry. We also compete with the public health insurance exchanges currently run by the U.S. federal and state governments. We also compete with providers of account-based health plans and consumer-directed benefits such as WageWorks and HealthEquity.\n\n\nThe market for our services is subject to change as a result of economic, regulatory and legislative changes, technological developments, and increased competition from established and new competitors. Regulatory and legislative actions, along with continuously evolving technological developments, will likely have the greatest impact on the overall market for our exchange\n \n\n\n10\n\n\n\n\n \n\n\nproducts. See Part I, Item 1A Risk Factors – \n‘Our business will be negatively affected if we are not able to anticipate and keep pace with rapid changes in government laws or regulations, or if government laws or regulations decrease the need for our services, increase our costs or limit our compensation’\n and related risk factors for a description of legal, non-financial/-regulatory and compliance risks to the Company.\n\n\nWe believe the primary factors in selecting an HR consulting or risk management services firm include reputation; the ability to provide measurable increases to shareholder value and return on investment; geographic scope; quality of service; and the ability to tailor services to clients’ unique needs.\n\n\nWith regard to the marketplace for active employee exchanges, we believe that clients base their decisions on a variety of factors that include the ability of the provider to deliver measurable cost savings, a strong reputation for efficient execution, a provider’s capability in delivering a broad number of configurations to serve various population segments, and an innovative service delivery model and platform.\n\n\nFor our traditional consulting and risk management services and the rapidly evolving exchange products, we believe we compete favorably with respect to these factors.\n\n\nRegulation\n\n\nOur business activities are subject to legal requirements and governmental and quasi-governmental regulatory supervision in all countries in which we operate. Also, such regulations may require individual or company licensing to conduct our business activities. While these requirements may vary from location to location, they are generally designed to protect our clients by establishing minimum standards of conduct and practice, particularly regarding the provision of advice and product information, as well as financial criteria. We are also subject to data privacy regulations that apply to health, medical, financial and other types of personal information belonging to our employees, clients and their employees and other third parties across most jurisdictions, including, among others, the E.U. and U.K. General Data Protection Regulations, the Personal Information Protection Law (‘PIPL’) in China and privacy legislation in certain U.S. states, including the California Privacy Rights Act (‘CPRA’). Sustainable investing and environmental, social and governance initiatives continue to be the focus of increased regulatory scrutiny across jurisdictions, with emerging regulation of greenhouse gas emissions and disclosures of their impact on the climate, including in the state of California, final rules adopted by the U.S. Securities and Exchange Commission, and the E.U. Corporate Sustainability Reporting Directive and other regulations across the E.U. Across many jurisdictions we are subject to various financial crime laws and regulations through our activities, activities of associated persons, the products and services we provide and our business and client relationships. Such laws and regulations relate to, among other areas, sanctions and export control, anti-bribery, anti-corruption, anti-money-laundering and counter-terrorist financing. Similarly, we are subject in many jurisdictions to antitrust laws, which are designed to promote robust competition in the markets in which we participate.\n \n\n\nOur most significant regulatory regions are further described below:\n\n\nUnited States\n\n\nOur activities in connection with insurance brokerage services within the U.S. are subject to regulation and supervision by state authorities. Although the scope of regulation and form of supervision may vary from state to state, insurance laws in the United States are often complex and generally grant broad discretion to supervisory authorities in adopting regulations and supervising regulated activities. That supervision generally includes the licensing of insurance brokers and agents and the regulation of the handling and investment of client funds held in a fiduciary capacity. Our continuing ability to provide insurance brokerage in the states in which we currently operate is dependent upon our compliance with the rules and regulations promulgated by the regulatory authorities in each of these states. See Part I, Item 1A Risk Factors under the heading ‘\nOur business will be negatively affected if we are not able to anticipate and keep pace with rapid changes in government laws or regulations, or if government laws or regulations decrease the need for our services, increase our costs or limit our compensation’\n for a description of the risks related to our private exchange activities.\n \n\n\nFurthermore, certain of our activities are subject to regulation under the Health Insurance Portability and Accountability Act (‘HIPAA’), which is enforced by the Office for Civil Rights within the Department of Health and Human Services. As we implement and expand our direct-to-consumer sales and marketing solutions through our Benefits Delivery & Administration business, we are subject to various federal and state laws and regulations that prescribe when and how we may market to consumers (including, without limitation, the Telephone Consumer Protection Act and other telemarketing laws and the Medicare Communications and Marketing Guidelines issued by the Center for Medicare Services).\n\n\nCertain of our activities are governed by other regulatory bodies, such as investment and securities licensing authorities. Our activities in connection with investment services within the United States are subject to regulation and supervision at both the federal and state levels. At the federal level, certain of our operating subsidiaries are regulated by the SEC through the Investment Company Act of\n \n\n\n11\n\n\n\n\n \n\n\n1940 and the Investment Advisers’ Act of 1940 and by the Department of Labor through the Employee Retirement Income Security Act, or ERISA. In connection with the SEC regulations, we are required to file certain reports, and are subject to various marketing restrictions, among other requirements. In connection with ERISA regulations, we are limited in the actions we can take for plans for which we serve as fiduciaries, among other matters. Our U.S. investment activities are also subject to certain state regulatory schemes, and some activities also are subject to regulation by the Commodities and Futures Trading Commission under the Commodities Exchange Act.\n\n\nOur activities in connection with Third Party Administrator (‘TPA’) services in the United States are also subject to regulation and supervision by many state authorities.  Licensing requirements and supervision vary from state to state. As with insurance brokerage services, our continuing ability to provide these services in states that regulate our activities is dependent upon our compliance with the rules and regulations promulgated from time to time by the regulatory authorities in each of these states.\n\n\nUnited Kingdom\n\n\nIn the U.K., our business is regulated by the Financial Conduct Authority (‘FCA’).\n\n\nThe FCA has a sole strategic objective: to ensure that the relevant markets function well. Its operational objectives are to secure an appropriate degree of protection for consumers, to protect and enhance the integrity of the U.K. financial system, and to promote effective competition in the interests of consumers. The FCA has a wide range of rule-making, investigatory and enforcement powers (including the power to censure and fine) and conducts monitoring visits to assess our compliance with regulatory requirements.  In addition, the FCA extended the Senior Managers and Certification Regime (‘SMCR’) which became effective on December 9, 2019 in relation to our U.K. FCA-regulated businesses. The SMCR is designed to drive improvements in culture and governance within financial services firms and to deter misconduct by increasing individual accountability to the FCA.\n\n\nNew regulations and modifications to existing regulations that are specific to the U.K. have and will continue to result in differences from the regulatory requirements of the E.U. See Part I, Item 1A Risk Factors, for a description of Brexit-related risks to the Company.\n\n\nFurthermore, as a result of Brexit, the WTW Brexit broking solution (the U.K. branch of Willis Towers Watson SA/NV) was required to seek authorization from the FCA as a third country branch. Full authorization was granted by the FCA on September 29, 2023 following completion of the application process. As a result of full FCA authorization, the branch is no longer operating under the FCA’s Temporary Permissions Regime. The branch is therefore subject to requirements in key areas such as SMCR and is also subject  to the supervisory oversight of the Belgian Financial Services & Markets Authority.\n\n\nEuropean Union\n\n\nIn 2005, the European Union Insurance Mediation Directive introduced rules to enable insurance and reinsurance intermediaries to operate and provide services within each member state of the E.U. on a basis consistent with the E.U. single market and customer protection aims. Each E.U. member state in which we operate is required to ensure that the insurance and reinsurance intermediaries resident in their country are registered with a statutory body in that country and that each intermediary meets professional requirements in relation to their competence, good repute, professional indemnity cover and financial capacity. The E.U. issued an additional Insurance Distribution Directive that expands the 2005 directive, and all E.U. member states in which we operate were required to enact the directive and adopt local country laws by October 1, 2018.\n \n\n\nCertain of our entities that undertake pension scheme management are subject to MiFID (Markets in Financial Instruments Directive) and MiFIR (the Markets in Financial Instruments Regulation). In addition, revisions to MiFID (‘MiFID II’) took effect in January 2018. These revisions are aimed at strengthening investor protection and improving the function of financial markets. MiFID II imposes a variety of requirements that include, among others, rules relating to product governance and independent investment advice, responsibility of management bodies, inducements, information and reporting to clients, cross-selling, remuneration of staff, and best execution of trades for clients. Further, some of our entities are also authorized and regulated by certain financial services authorities in countries such as Sweden, Ireland, the Netherlands and the U.K.\n\n\nOther\n\n\nAll companies carrying on similar activities discussed above in a given jurisdiction are subject to regulations which are not dissimilar to the requirements for our operations in the U.S. and U.K. We do not consider these regulatory requirements as adversely affecting our competitive position.\n\n\nOur failure, or that of our employees, to satisfy the regulatory compliance requirements or the legal requirements governing our activities, can result in disciplinary action, fines, reputational damage and financial harm.\n\n\n12\n\n\n\n\n \n\n\nSee Part I, Item 1A Risk Factors, for an analysis of how actions by regulatory authorities or changes in legislation and regulation as well as compliance with evolving laws, including with respect to data privacy and cybersecurity, in the jurisdictions in which we operate may have an adverse effect on our business.\n \n\n\nInformation about Executive Officers of the Registrant\n \n\n\nThe executive officers of the Company as of February 25, 2025 were as follows:\n \n\n\nKristy D. Banas (age 51)\n - \nMs. Banas has served as Chief Human Resources Officer and Head of Marketing and Communications since May 1, 2023. Prior to that, she served as Chief Human Resources Officer from August 16, 2021. She also served as the Senior Director, Global Talent Advisor for Human Capital & Benefits from March 2019 to August 2021 and as Senior Director and Head of Global Total Rewards, HR Integration and the HR Business Office from November 2016 to March 2019. From January 2016 to November 2016, Ms. Banas served as Senior Director and Global HR Leader, WTW Operations and Technology. From July 2011 to January 2016, Ms. Banas served as Senior Vice President, Global HR Director for WTW Corporate Functions, and was the Executive HR Sponsor for Global Operations Improvement. Ms. Banas was Vice President and Global HR Partner with XL Capital/XL Global Services/XL Insurance from November 2001 to June 2011. Ms. Banas has a BS in Business Management from Fairfield University and a partial MS in Human Resource Management from the University of Connecticut.\n\n\nLucy Clarke\n \n(age 58)\n \n- \nMs. Clarke has served as the President of Risk & Broking at WTW since July 22, 2024. Previously, she served as President of Marsh JLT Specialty and Global Placement from April 2019 to July 2024. Prior to that, Ms. Clarke was with JLT Group for 17 years, holding diverse leadership roles, including CEO of JLT Global Specialty, the insurance and risk arm of the JLT Group, from April 2018 to April 2019. Ms. Clarke holds a bachelor's degree in English and economics from Vanderbilt University. She also serves as President of the Insurance Institute of London.\n\n\nAlexis Faber (age 47) - \nMs. Faber has served as Chief Operating Officer at WTW since August 30, 2021. \nPreviously, she \nserved as Chief Operating Officer for Corporate Risk & Broking f\nrom \nMarch 2018\n \nto August 2021. Prior to that, \nMs. Faber \nserved as \nG\nlobal \nH\nead of Financial Lines \nsince \nJanuary 2016\n,\n Head of FINEX\n for\n North America \nsince\n April 2014\n,\n Risk Control and Claim Advocacy Practice Leader\n for \nNorth America\n since \nJuly 2012\n,\n Chief Operating Officer for Willis North America \nsince \nAugust 2009 \nand \nas Chief Operating Officer for the Executive Risks practice \nsince \nSeptember 2006\n. Prior to that, Ms. Faber served as \nRegional Finance Officer for North America since July 2004, and as Financial and Operations Controller for Global Specialties, North America since August 2003. Before joining WTW, Ms. Faber worked in investment banking at Schroder Salomon Smith Barney and at Citigroup. Ms. Faber holds a bachelor’s degree in economics from Williams College and an M.B.A from Columbia Business School.\n\n\nMatthew S. Furman (age 55)\n - Mr. Furman has served as General Counsel at WTW since January 4, 2016. Previously, Mr. Furman served as Executive Vice President and Group General Counsel at Willis Group Holdings, where he was a member of the Operating Committee since April 2015. From 2007 until March 2015, Mr. Furman was Senior Vice President, Group General Counsel-Corporate and Governance, and Corporate Secretary for The Travelers Companies, Inc. From 2000 until 2007, Mr. Furman was an attorney at Goldman, Sachs & Co. in New York, where he was Vice President and Associate General Counsel in the finance and corporate legal group. Prior to that, he was in private practice, with almost six years’ experience at Simpson Thacher & Bartlett in New York. Mr. Furman also serves as a Trustee of the Jewish Theological Seminary and a Director of the Legal Aid Society. He previously served as a member of the U.S. Securities and Exchange Commission’s Investor Advisory Committee, where he served on the Executive Committee and chaired the Market Structure Subcommittee. He holds a bachelor’s degree magna cum laude from Brown University and a law degree magna cum laude from Harvard Law School.\n\n\nJulie J. Gebauer (age 63)\n - Ms. Gebauer has served as Head of Health, Wealth and Career at WTW since January 1, 2022. Previously, Ms. Gebauer served as Head of Human Capital & Benefits at WTW since January 4, 2016 and, prior to that, as Managing Director of Towers Watson’s Talent and Rewards business segment since January 1, 2010. Beginning in 2002, Ms. Gebauer served as a Managing Director of Towers Perrin and led Towers Perrin’s global Workforce Effectiveness practice and the global Towers Perrin-International Survey Research Corporation line of business. Ms. Gebauer was a member of Towers Perrin’s board of directors from 2003 through 2006. She joined Towers Perrin in 1986 as a consultant and held several leadership positions at Towers Perrin, serving as the Managing Principal for the New York office from 1999 to 2001 and the U.S. East Region Leader for the Human Capital Group from 2002 to 2006. Ms. Gebauer is a Fellow of the Society of Actuaries. Ms. Gebauer graduated Phi Beta Kappa and with high distinction from the University of Nebraska-Lincoln with a bachelor’s degree in mathematics and was designated a Chancellor’s Scholar.\n\n\nCarl A. Hess (age 63) \n- Mr. Hess has served as Chief Executive Officer at WTW since January 1, 2022 and, prior to that, served as President since August 16, 2021. Mr. Hess was formerly Head of Investment, Risk and Reinsurance from October 27, 2016 to August 16, 2021. Previously, Mr. Hess served as the Co-Head of North America at WTW since January 4, 2016. Prior to that, Mr. Hess served as Managing Director, The Americas of Towers Watson since February 1, 2014, and before that, he served as the Managing Director of Towers Watson’s Investment business since January 1, 2010. Before his service at Towers Watson, Mr. Hess worked in a variety of roles for over 20 years at Watson Wyatt, lastly as Global Practice Director of Watson Wyatt’s Investment business. Mr.\n \n\n\n13\n\n\n\n\n \n\n\nHess is a Fellow of the Society of Actuaries and the Conference of Consulting Actuaries and a Chartered Enterprise Risk Analyst. He has a bachelor’s degree cum laude in logic and language from Yale University.\n \n\n\nAndrew J. Krasner (age 49)\n - Mr. Krasner has served as Chief Financial Officer at WTW since September 7, 2021 and co-head of Corporate Development since October 25, 2024. From February 2021 to August 2021, Mr. Krasner served as Chief Financial Officer for Assured Partners. From June 2018 to January 2021, Mr. Krasner was Global Treasurer and Head of M&A of WTW, and from 2012 to June 2018, was Head of M&A, responsible for the M&A, joint venture, divestiture, and strategic investment activity. Mr. Krasner started with Legacy Willis in June 2009 as Senior Vice President, working on the client side with Willis Capital Markets & Advisory between June 2009 to June 2012. Prior to joining WTW, Mr. Krasner was a Principal with Banc of America Securities from October 2003 to June 2009, an Associate with Deutsche Bank from July 2002 to October 2003 and a Senior Associate with PricewaterhouseCoopers from August 1997 to August 2000. Mr. Krasner has a B.S. degree in applied economics and business management and an M.B.A. with distinction from Cornell University. He is also a Certified Public Accountant.\n\n\nAnne Pullum (age 42)\n - Ms. Pullum has served as Head of Europe at WTW since August 30, 2021 and co-head of Corporate Development since October 25, 2024. Prior to that, Ms. Pullum served as Head of Western Europe from May 31, 2019 to August 30, 2021 and as the Chief Administrative Officer and Head of Strategy and Innovation since October 27, 2016. Beginning on January 4, 2016, Ms. Pullum served as WTW’s Head of Strategy, where she has played a key role in determining the Company’s strategy and worked across all business segments and functional areas. Previously, Ms. Pullum served as the Head of Strategy for Willis Group since May 2014. Before joining Willis, Ms. Pullum worked at McKinsey & Company, where she served financial services and natural resource clients since October 2010. Prior to that, Ms. Pullum conducted economic research at Greenspan Associates in Washington, D.C. and served as an analyst in the Goldman Sachs Equities Division in London. Ms. Pullum holds an M.B.A. from INSEAD and a bachelor’s degree in international economics from Georgetown University’s School of Foreign Service.\n\n\nImran Qureshi (age 54)\n - Mr. Qureshi has served as Head of North America at WTW since August 30, 2021 and took on the additional role as Head of Integrated & Global Solutions in June 2023. Prior to that, he served as the Co-Leader, U.S. from February 2017 to August 30, 2021. He served as Region Leader, U.S. Midwest from February 2017 to October 2019, and was Market Leader, Greater Chicago and Wisconsin from February 2016 to February 2017. Mr. Qureshi was Managing Consultant of the Chicago office from January 2013 to January 2016, and has been with WTW in other roles since March 1999. Mr. Qureshi is currently a board director at Smithbucklin and The Executives' Club of Chicago. Previously, he was the board chair of the Human Resources Management Association of Chicago, and he served on the M&A Faculty of WorldatWork where he taught M&A and taught the International Benefits Course for the International Foundation of Employee Benefit Plans. In 2004, Mr. Qureshi was honored by Business Insurance magazine as one of ‘40 Under 40 People to Watch’ in the commercial insurance and risk/benefits management services industries. He also has lectured on governance and globalization at The Kellogg School of Management at Northwestern University and The University of Chicago Booth School of Business. Mr. Qureshi holds a bachelor’s degree in pure mathematics and statistics with honors from the University of Manchester in the U.K. and has an actuarial background.\n\n\nPamela Thomson-Hall (age 56)\n - \nMs. Thomson-Hall has served as the Head of International at WTW since August 30, 2021. Previously, she served as Head of CEEMEA since July 2018, Managing Director of International since January 2017 and Chief of Staff of International since January 2016. Prior to that, Ms. Thomson-Hall served as Program Director for business integration since September 2014 and before that, as General Counsel of International since April 1999. Prior to joining WTW, Ms. Thomson-Hall worked as a solicitor for Clyde & Co and DLA Piper. Ms. Thomson-Hall holds an LLB from the University College London and completed her LPC at the College of Law.\n\n\n14\n\n\n\n\n \n\n\nBoard of Directors\n \n\n\nA list of the members of the board of directors of the Company as of this date of this Annual Report on Form 10-K and their principal occupations are provided below:\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCarl Hess\n\n\n \n\n\nDame Inga Beale\n\n\n \n\n\nFumbi Chima\n\n\n\n\n\n\nChief Executive Officer\n\n\n \n\n\nFormer Chief Executive Officer of Lloyd’s of London\n\n\n \n\n\nFormer Executive Vice President and Chief Information Officer of Boeing Employees’ Credit Union\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nStephen Chipman\n\n\n \n\n\nMichael Hammond\n\n\n \n\n\nJacqueline Hunt\n\n\n\n\n\n\nFormer Chief Executive Officer of Grant Thornton LLP\n\n\n \n\n\nFormer Chief Executive Officer and Chair, Lockton International Holdings Ltd.\n\n\n \n\n\nFormer Chief Executive Officer of Prudential UK, Europe and Africa\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nPaul Reilly\n\n\n \n\n\nMichelle Swanback\n\n\n \n\n\nPaul Thomas\n\n\n\n\n\n\nExecutive Chair of the Board and former Chief Executive Officer of Raymond James Financial\n\n\n \n\n\nFormer Chief Executive Officer, TTEC Engage, and President of TTEC Holdings, Inc.\n\n\n \n\n\nFormer Chief Executive Officer of Reynolds Packaging Group\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nFredric Tomczyk\n\n\n \n\n\n\n\n\n\nChief Executive Officer of Cboe Global Markets, Inc.\n\n\n \n\n\n\n\n\n\n \n\n\n15",
  "item7": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF\n FINANCIAL CONDITION AND RESULTS OF OPERATIONS\n\n\nThis discussion includes forward-looking statements. See ‘Disclaimer Regarding Forward-looking Statements’ for certain cautionary information regarding forward-looking statements and Part I, Item 1A Risk Factors for a list of factors that could cause actual results to differ materially from those predicted in those statements.\n\n\nThis discussion includes references to non-GAAP financial measures as defined in the rules of the SEC. We present such non-GAAP financial measures, specifically, adjusted, constant currency and organic non-GAAP financial measures, as we believe such information is of interest to the investment community because it provides additional meaningful methods of evaluating certain aspects of the Company’s operating performance from period to period on a basis that may not be otherwise apparent under U.S. GAAP, and these provide a measure against which our businesses may be assessed in the future.\n\n\nOur methods of calculating these measures may differ from those used by other companies and therefore comparability may be limited. These financial measures\n \nshould be viewed in addition to, not in lieu of, the consolidated financial\n \nstatements for the year ended December 31, 2024.\n\n\nSee ‘Non-GAAP Financial Measures’ below for further discussion of our adjusted, constant currency and organic non-GAAP financial measures.\n\n\nExecutive Overview\n \n\n\nMarket Conditions\n \n\n\nTypically, our business benefits from regulatory change, political risk or economic uncertainty. Insurance broking generally tracks the economy, but demand for both insurance broking and consulting services usually remains steady during times of uncertainty. We have some businesses, such as our health and benefits and administration businesses, which can be counter cyclical during the early period of a significant economic change.\n\n\nWithin our insurance and brokerage business, due to the cyclical nature of the insurance market and the impact of other market conditions on insurance premiums, commission revenue may vary widely between accounting periods. A period of low or declining premium rates, generally known as a ‘soft’ or ‘softening’ market, generally leads to downward pressure on commission revenue and can have a material adverse impact on our revenue and operating margin. A ‘hard’ or ‘firming’ market, during which premium rates rise, generally has a favorable impact on our revenue and operating margin. Rates, however, vary by geography, industry and client segment. As a result, and due to the global and diverse nature of our business, we view rates in the aggregate. Overall, we are currently seeing a stabilizing to softening market.\n \n\n\nMarket conditions in the broking industry in which we operate are generally defined by factors such as the strength of the economies in the various geographic regions in which we serve around the world, insurance rate movements, and insurance and reinsurance buying patterns of our clients.\n\n\nThe markets for our consulting, technology and solutions, and marketplace services are affected by economic, regulatory and legislative changes, technological developments, and increased competition from established and new competitors. We believe that the primary factors in selecting a human resources or risk management consulting company include reputation, the ability to provide measurable increases to shareholder value and return on investment, global scale, quality of service and the ability to tailor services to clients’ unique needs. In that regard, we are focused on developing and implementing technology, data and analytic solutions for both internal operations and for maintaining industry standards and meeting client preferences. We have made such investments from time to time and may decide, based on perceived business needs, to make investments in the future that may be different from past practice or what we currently anticipate.\n\n\nWith regard to the market for exchanges, we believe that clients base their decisions on a variety of factors that include the ability of the provider to deliver measurable cost savings for clients, a strong reputation for efficient execution and an innovative service delivery model and platform. Part of the employer-sponsored insurance market has matured and become more fragmented while other segments remain in the entry phase. As these market segments continue to evolve, we may experience growth in intervals, with periods of accelerated expansion balanced by periods of modest growth. In recent years, growth in the market for exchanges has slowed, and this trend may continue.\n\n\nRisks and Uncertainties of the Economic Environment\n\n\nU.S. and global markets are continuing to experience volatility and disruption as a result of the ongoing Russia-Ukraine and Middle East conflicts. Although the length and impact of these situations are highly unpredictable, the conflicts have contributed to negative impacts on and volatility of the global economy and capital markets, resulting in significant inflation and fluctuating interest rates in\n \n\n\n47\n\n\n\n\n \n\n\nmany of the markets in which we operate, and could continue to lead to further market disruptions. This impacts not only the cost of and access to liquidity, but also other costs to run and invest in our business.\n\n\nOther global economic events, such as accommodative monetary and fiscal policy, supply chain disruptions and geopolitical tensions beyond the aforementioned ongoing wars, contributed to significant inflation across the globe. In particular, inflation in the United States, Europe and other geographies has risen to levels not experienced in recent decades, and while this has eased somewhat in the last year, we are seeing its impact on various aspects of our business. Moreover, U.S. and global economic conditions have created market uncertainty and volatility. Such general economic conditions, including inflation, stagflation, political volatility, costs of labor, cost of capital, interest rates, bank stability, credit availability and tax rates, affect our cost of doing business, including our operating and general and administrative expenses, and we have no control or limited ability to control such factors. These general economic conditions impact revenue, including revenue from customers as well as income from funds we hold on behalf of customers and pension-related income.\n \n\n\nIf our costs grow significantly in excess of our ability to raise revenue, whether as a result of the foregoing global economic factors or otherwise, our margins and results of operations may be materially and adversely impacted and we may not be able to achieve our strategic and financial objectives.\n\n\nSee Part I, Item 1A Risk Factors in this Annual Report on Form 10-K for a discussion of risks that may affect, among other things, our growth relative to expectation and our ability to achieve our objectives.\n \n\n\n \n\n\nTransformation Program\n\n\n \n\n\nIn the fourth quarter of 2024, the Company concluded a three-year ‘Transformation program’ designed to enhance operations, optimize technology and align its real estate footprint to its new ways of working. The program incurred cumulative costs of $1.115 billion and capital expenditures of $130 million, resulting in a total investment of $1.245 billion. Although the Transformation program concluded in 2024, we expect additional cash outflows in 2025 from the settlement of accrued costs.\n\n\n \n\n\nThe main categories of charges were in the following four areas:\n\n\n•\nReal estate rationalization — includes costs to align the real estate footprint to our new ways of working (hybrid work) and includes breakage fees and the impairment of right-of-use assets and other related leasehold assets.\n\n\n•\nTechnology modernization — these charges are incurred in moving to common platforms and technologies, including migrating certain platforms and applications to the cloud. This category includes the impairment of technology assets that are duplicative or no longer revenue-producing, as well as costs for technology investments that do not qualify for capitalization. \n\n\n•\nProcess optimization — these costs are incurred in the right-shoring strategy and automation of our operations, which includes optimizing resource deployment and appropriate colleague alignment. These costs include process and organizational design costs, severance and separation-related costs and temporary retention costs.\n\n\n•\nOther — other costs not included above including fees for professional services, other contract terminations not related to the above categories and supplier migration costs.\n\n\nCertain costs under the Transformation program are accounted for under ASC 420, \nExit or Disposal Cost Obligation\n, and are included as restructuring costs in the consolidated statements of comprehensive income. For the years ended December 31, 2024, 2023 and 2022, restructuring charges under our Transformation program totaled $61 million, $68 million and $99 million, respectively. Other costs incurred under the Transformation program are included in transaction and transformation and were $378 million, $347 million and $136 million for the years ended December 31, 2024, 2023 and 2022, respectively.\n \n\n\nFrom the actions taken during 2024, we have identified an additional $136 million of annualized run-rate savings due to newly-realized opportunities and incremental sources of value. Since the inception of the program to its conclusion, we have identified $473 million of cumulative annualized run-rate savings, which overall were primarily\n attributable to process optimization. We began to recognize the benefits\n from the program during 2022.\n\n\nFor a discussion of material risks associated with the Transformation program, please see Part I, Item 1A Risk Factors under the heading \n‘We may not be able to fully realize the anticipated benefits of our strategy or our expected product, service and transaction pipelines’\n and other Risk Factors in this Annual Report on Form 10-K.\n \n\n\n48\n\n\n\n\n \n\n\nFor management’s discussion of our results of operations for the year ended December 31, 2023 in comparison with the year ended December 31, 2022, please see our Annual Report on Form 10-K filed with the SEC on February 22, 2024.\n\n\nFinancial Statement Overview\n \n\n\nThe tables below set forth our summarized consolidated statements of comprehensive income and data as a percentage of revenue for the periods indicated.\n \n\n\nConsolidated Statements of Comprehensive Income\n\n\n($ in millions, except per share data)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYears ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue\n\n\n \n\n\n$\n\n\n9,930\n\n\n \n\n\n \n\n\n \n\n\n100\n\n\n%\n\n\n \n\n\n$\n\n\n9,483\n\n\n \n\n\n \n\n\n \n\n\n100\n\n\n%\n\n\n\n\n\n\nCosts of providing services\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSalaries and benefits\n\n\n \n\n\n \n\n\n5,502\n\n\n \n\n\n \n\n\n \n\n\n55\n\n\n%\n\n\n \n\n\n \n\n\n5,344\n\n\n \n\n\n \n\n\n \n\n\n56\n\n\n%\n\n\n\n\n\n\nOther operating expenses\n\n\n \n\n\n \n\n\n1,833\n\n\n \n\n\n \n\n\n \n\n\n18\n\n\n%\n\n\n \n\n\n \n\n\n1,815\n\n\n \n\n\n \n\n\n \n\n\n19\n\n\n%\n\n\n\n\n\n\nImpairment \n(i)\n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n \n\n\n \n\n\n10\n\n\n%\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n\n\n\n\nDepreciation\n\n\n \n\n\n \n\n\n230\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n%\n\n\n \n\n\n \n\n\n242\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n\n\n\n\nAmortization\n\n\n \n\n\n \n\n\n226\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n%\n\n\n \n\n\n \n\n\n263\n\n\n \n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n \n\n\n61\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n%\n\n\n \n\n\n \n\n\n68\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n%\n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n \n\n\n409\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n%\n\n\n \n\n\n \n\n\n386\n\n\n \n\n\n \n\n\n \n\n\n4\n\n\n%\n\n\n\n\n\n\nTotal costs of providing services\n\n\n \n\n\n \n\n\n9,303\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n8,118\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nIncome from operations\n\n\n \n\n\n \n\n\n627\n\n\n \n\n\n \n\n\n \n\n\n6\n\n\n%\n\n\n \n\n\n \n\n\n1,365\n\n\n \n\n\n \n\n\n \n\n\n14\n\n\n%\n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n(263\n\n\n)\n\n\n \n\n\n \n\n\n(3\n\n\n)%\n\n\n \n\n\n \n\n\n(235\n\n\n)\n\n\n \n\n\n \n\n\n(2\n\n\n)%\n\n\n\n\n\n\nOther (loss)/income, net \n(i)\n\n\n \n\n\n \n\n\n(260\n\n\n)\n\n\n \n\n\n \n\n\n(3\n\n\n)%\n\n\n \n\n\n \n\n\n149\n\n\n \n\n\n \n\n\n \n\n\n2\n\n\n%\n\n\n\n\n\n\nINCOME FROM OPERATIONS BEFORE INCOME TAXES\n\n\n \n\n\n \n\n\n104\n\n\n \n\n\n \n\n\n \n\n\n1\n\n\n%\n\n\n \n\n\n \n\n\n1,279\n\n\n \n\n\n \n\n\n \n\n\n13\n\n\n%\n\n\n\n\n\n\nProvision for income taxes\n\n\n \n\n\n \n\n\n(192\n\n\n)\n\n\n \n\n\n \n\n\n(2\n\n\n)%\n\n\n \n\n\n \n\n\n(215\n\n\n)\n\n\n \n\n\n \n\n\n(2\n\n\n)%\n\n\n\n\n\n\nIncome attributable to non-controlling interests\n\n\n \n\n\n \n\n\n(10\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n \n\n\n \n\n\n(9\n\n\n)\n\n\n \n\n\n \n\n\n—\n\n\n%\n\n\n\n\n\n\nNET (LOSS)/INCOME ATTRIBUTABLE TO WTW\n\n\n \n\n\n$\n\n\n(98\n\n\n)\n\n\n \n\n\n \n\n\n(1\n\n\n)%\n\n\n \n\n\n$\n\n\n1,055\n\n\n \n\n\n \n\n\n \n\n\n11\n\n\n%\n\n\n\n\n\n\nDiluted (loss)/earnings per share\n\n\n \n\n\n$\n\n\n(0.96\n\n\n)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n$\n\n\n9.95\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n(i)\nFor the year ended December 31, 2024, Impairment and Other (loss)/income, net include goodwill-related impairment expense and loss on disposal, respectively, associated with the sale of our TRANZACT business (see Note 3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K).\n\n\nConsolidated Revenue\n \n\n\nWe derive the majority of our revenue from commissions from our brokerage services and fees for consulting and administration services. No single client represented a significant concentration of our consolidated revenue for any of our three most recent fiscal years.\n\n\nThe following table details our top five markets based on percentage of consolidated revenue (in U.S. dollars) from the countries where work was performed for the year ended December 31, 2024. These figures do not represent the currency of the related revenue, which is presented in the next table.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGeographic Region\n\n\n \n\n\n% of Revenue\n\n\n \n\n\n\n\n\n\nUnited States\n\n\n \n\n\n \n\n\n52\n\n\n%\n\n\n\n\n\n\nUnited Kingdom\n\n\n \n\n\n \n\n\n19\n\n\n%\n\n\n\n\n\n\nFrance\n\n\n \n\n\n \n\n\n4\n\n\n%\n\n\n\n\n\n\nCanada\n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n\n\n\n\nGermany\n\n\n \n\n\n \n\n\n3\n\n\n%\n\n\n\n\n\n\n \n\n\n49\n\n\n\n\n \n\n\nThe table below details the approximate percentage of our revenue and expenses from continuing operations by transactional currency for the year ended December 31, 2024.\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTransactional Currency\n\n\n \n\n\nRevenue\n\n\n \n\n\n \n\n\nExpenses \n(i)\n\n\n \n\n\n\n\n\n\nU.S. dollars\n\n\n \n\n\n \n\n\n59\n\n\n%\n\n\n \n\n\n \n\n\n53\n\n\n%\n\n\n\n\n\n\nPounds sterling\n\n\n \n\n\n \n\n\n11\n\n\n%\n\n\n \n\n\n \n\n\n18\n\n\n%\n\n\n\n\n\n\nEuro\n\n\n \n\n\n \n\n\n14\n\n\n%\n\n\n \n\n\n \n\n\n12\n\n\n%\n\n\n\n\n\n\nOther currencies\n\n\n \n\n\n \n\n\n16\n\n\n%\n\n\n \n\n\n \n\n\n17\n\n\n%\n\n\n\n\n\n\n \n\n\n(i)\nThese percentages exclude certain expenses for significant items which will not be settled in cash, or which we believe to be items that are not core to our current or future operations. These items include amortization of intangible assets and transaction and transformation.\n\n\nThe following table sets forth the total revenue for the years ended December 31, 2024 and 2023 and the components of the change in total revenue for the year ended December 31, 2024, as compared to the prior year. The components of the revenue change may not add due to rounding.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAs\n\n\n \n\n\nLess:\n\n\n \n\n\nConstant\n\n\n \n\n\nLess:\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nYears Ended December 31,\n\n\n \n\n\n \n\n\nReported\n\n\n \n\n\nCurrency\n\n\n \n\n\nCurrency\n\n\n \n\n\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange \n(i)\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue\n\n\n \n\n\n$\n\n\n9,930\n\n\n \n\n\n \n\n\n$\n\n\n9,483\n\n\n \n\n\n \n\n\n5%\n\n\n \n\n\n—%\n\n\n \n\n\n5%\n\n\n \n\n\n—%\n\n\n \n\n\n5%\n\n\n\n\n\n\n \n\n\n(i)\nInterest income did not contribute to organic change for the year ended December 31, 2024.\n\n\nRevenue for the year ended December 31, 2024 was $9.9 billion, compared to $9.5 billion for the year ended December 31, 2023, an increase of $447 million, or 5%, on an as-reported basis. Adjusting for the impact of foreign currency and acquisitions and disposals, our organic revenue growth was 5% for the year ended December 31, 2024. The increases in both as-reported and organic revenue were driven by strong performances in both segments.\n\n\nOur revenue can be materially impacted by changes in currency conversions, which can fluctuate significantly over the course of a calendar year. For the year ended December 31, 2024, currency translation decreased our consolidated revenue by $19 million. The primary currency driving this change was the Argentine Peso.\n\n\nDefinitions of Constant Currency Change and Organic Change are included in the section entitled ‘Non-GAAP Financial Measures’ elsewhere within this Form 10-K.\n\n\nSegment Revenue and Segment Operating Income\n\n\nSegment revenue excludes amounts that were directly incurred on behalf of our clients and reimbursed by them (reimbursed expenses); however, these amounts are included in consolidated revenue, as required by applicable accounting standards and SEC rules. Segment operating income excludes certain costs, including (i) amortization of intangibles; (ii) restructuring costs; and (iii) certain transaction and transformation expenses, and includes certain expense amounts which may be determined on both a direct and allocated basis. See Note 5 – Segment Information within Item 8 of this Annual Report on Form 10-K for more information about how our segment revenue and segment operating income is calculated and a reconciliation to our GAAP results.\n\n\nThe Company experiences seasonal fluctuations in its revenue. Revenue is typically higher during the Company’s first and fourth quarters due primarily to the timing of broking-related activities.\n \n\n\nFor all tables presented below, the components of the revenue change may not add due to rounding.\n\n\nHealth, Wealth & Career\n \n\n\nThe Health, Wealth & Career (‘HWC’) segment provides an array of advice, broking, solutions and technology for employee benefit plans, institutional investors, compensation and career programs, and the employee experience overall.\n\n\nHWC is the larger of the two segments of the Company, generating approximately 59% of our segment revenue for the year ended December 31, 2024. Addressing four key areas, Health, Wealth, Career and Benefits Delivery & Outsourcing, the segment is focused on addressing our clients’ people and risk needs to help them succeed in a global marketplace.\n\n\n \n\n\n50\n\n\n\n\n \n\n\nThe following table sets forth HWC segment revenue for the years ended December 31, 2024 and 2023, and the components of the change in revenue for the year ended December 31, 2024 from the year ended December 31, 2023.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAs\n\n\n \n\n\nLess:\n\n\n \n\n\nConstant\n\n\n \n\n\nLess:\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nYears ended December 31,\n\n\n \n\n\n \n\n\nReported\n\n\n \n\n\nCurrency\n\n\n \n\n\nCurrency\n\n\n \n\n\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment revenue excluding interest income\n\n\n \n\n\n$\n\n\n5,745\n\n\n \n\n\n \n\n\n$\n\n\n5,557\n\n\n \n\n\n \n\n\n3%\n\n\n \n\n\n—%\n\n\n \n\n\n3%\n\n\n \n\n\n—%\n\n\n \n\n\n4%\n\n\n\n\n\n\nInterest income\n\n\n \n\n\n \n\n\n32\n\n\n \n\n\n \n\n\n \n\n\n25\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal segment revenue\n\n\n \n\n\n$\n\n\n5,777\n\n\n \n\n\n \n\n\n$\n\n\n5,582\n\n\n \n\n\n \n\n\n3%\n\n\n \n\n\n—%\n\n\n \n\n\n4%\n\n\n \n\n\n—%\n\n\n \n\n\n4%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment operating income\n\n\n \n\n\n$\n\n\n1,717\n\n\n \n\n\n \n\n\n$\n\n\n1,565\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nHWC segment revenue for the years ended December 31, 2024 and 2023 was $5.8 billion and $5.6 billion, respectively. Organic revenue growth in Health was achieved across all regions with the continued expansion of our Global Benefits Management client portfolio being a meaningful driver. Our Wealth businesses generated organic revenue growth from our Investments-related solutions and higher levels of Retirement work. Career had organic revenue growth from increased survey sales, product revenue and advisory project work. Benefits Delivery & Outsourcing revenue was materially flat, as growth in Outsourcing from regulatory-driven project work and new-client wins was largely offset by decreased revenue in TRANZACT.\n \n\n\n \n\n\nHWC segment operating income for the years ended December 31, 2024 and 2023 was $1.7 billion and $1.6 billion, respectively. HWC segment operating income increased due primarily to transformation savings as well as operating leverage driven by organic revenue growth and disciplined expense management.\n \n\n\nRisk & Broking (‘R&B’)\n \n\n\nThe Risk & Broking (‘R&B’) segment provides a broad range of risk advice, insurance brokerage and consulting services to clients worldwide ranging from small businesses to multinational corporations.\n\n\nR&B generated approximately 41% of our segment revenue for the year ended December 31, 2024. The segment comprises two primary businesses - Corporate Risk & Broking and Insurance Consulting and Technology.\n \n\n\nThe following table sets forth R&B segment revenue for the years ended December 31, 2024 and 2023, and the components of the change in revenue for the year ended December 31, 2024 from the year ended December 31, 2023.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAs\n\n\n \n\n\nLess:\n\n\n \n\n\nConstant\n\n\n \n\n\nLess:\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nYears ended December 31,\n\n\n \n\n\n \n\n\nReported\n\n\n \n\n\nCurrency\n\n\n \n\n\nCurrency\n\n\n \n\n\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment revenue excluding interest income\n\n\n \n\n\n$\n\n\n3,926\n\n\n \n\n\n \n\n\n$\n\n\n3,656\n\n\n \n\n\n \n\n\n7%\n\n\n \n\n\n—%\n\n\n \n\n\n8%\n\n\n \n\n\n—%\n\n\n \n\n\n8%\n\n\n\n\n\n\nInterest income\n\n\n \n\n\n \n\n\n112\n\n\n \n\n\n \n\n\n \n\n\n79\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal segment revenue\n\n\n \n\n\n$\n\n\n4,038\n\n\n \n\n\n \n\n\n$\n\n\n3,735\n\n\n \n\n\n \n\n\n8%\n\n\n \n\n\n(1)%\n\n\n \n\n\n9%\n\n\n \n\n\n—%\n\n\n \n\n\n8%\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nSegment operating income\n\n\n \n\n\n$\n\n\n958\n\n\n \n\n\n \n\n\n$\n\n\n813\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nR&B segment revenue for the years ended December 31, 2024 and 2023 was $4.0 billion and $3.7 billion, respectively. Corporate Risk & Broking had organic revenue growth primarily driven by higher levels of new business activity and strong client retention and renewal increases across all geographies. Insurance Consulting and Technology organic revenue growth was driven by strong software sales in Technology, which was partially offset by a decline in demand for discretionary services.\n\n\n \n\n\n51\n\n\n\n\n \n\n\nR&B segment operating income for the years ended December 31, 2024 and 2023 was $958 million and $813 million, respectively. R&B segment operating income increased due primarily to operating leverage driven by organic revenue growth and disciplined expense management, as well as transformation savings.\n\n\nCosts of Providing Services\n \n\n\nTotal costs of providing services for the year ended December 31, 2024 were $9.3 billion, compared to $8.1 billion for the year ended December 31, 2023, an increase of $1.2 billion, or 15%. This increase resulted from the impairment expense associated with the sale of our TRANZACT business in the current year (see Note 3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K). See the following discussion for further details.\n\n\nSalaries and Benefits\n\n\nSalaries and benefits for the year ended December 31, 2024 were $5.5 billion, compared to $5.3 billion for the year ended December 31, 2023, an increase of $158 million, or 3%. The increase in the current year is primarily due to higher salary expense, driven by increased colleague headcount and cost-of-living compensation adjustments, and higher incentive and benefit costs for the year.\n \n\n\nSalaries and benefits, as a percentage of revenue, represented 55% and 56% for the years ended December 31, 2024 and 2023, respectively.\n\n\nOther Operating Expenses\n\n\nOther operating expenses include occupancy, legal, marketing, licenses, royalties, supplies, technology, printing and telephone costs, as well as insurance, including premiums on excess insurance and losses on professional liability claims, travel by colleagues, publications, professional subscriptions and development, recruitment, other professional fees and irrecoverable value-added and sales taxes. Additionally, other operating expenses included costs historically allocated to our Willis Re business which are partially offset by fees under a cost reimbursement Transition Services Agreement (‘TSA’; see Note 3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K) with Arthur J. Gallagher & Co. (‘Gallagher’).\n\n\nOther operating expenses for both years ended December 31, 2024 and 2023 were $1.8 billion, an increase of $18 million, or 1%. The increase was primarily due to higher non-income-related tax expense and higher travel and entertainment costs, partially offset by lower occupancy costs, primarily attributable to our Transformation program, and lower professional service expenses for the current year as compared to the prior year.\n \n\n\nImpairment\n\n\nImpairment for the year ended December 31, 2024 was $1.0 billion. Impairment is attributable to the goodwill impairment associated with our Benefits, Delivery and Administration (‘BDA’) reporting unit related to the sale of our TRANZACT business (see Note 3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K).\n\n\nDepreciation\n\n\nDepreciation represents the expense incurred over the useful lives of our tangible fixed assets and internally-developed software. Depreciation for the year ended December 31, 2024 was $230 million, compared to $242 million for the year ended December 31, 2023, a decrease of $12 million, or 5%. The year-over-year decrease was primarily due to a lower depreciable base of assets resulting from disposals associated with our Transformation program and a lower dollar value of assets placed in service during the past few years.\n\n\nAmortization\n\n\nAmortization represents the amortization of acquired intangible assets, including acquired internally-developed software. Amortization for the year ended December 31, 2024 was $226 million, compared to $263 million for the year ended December 31, 2023, a decrease of $37 million, or 14%. Our intangible amortization is generally more heavily weighted to the initial years of the useful lives of the related intangibles, and therefore amortization related to intangible assets will continue to decrease over time.\n \n\n\nRestructuring Costs\n\n\nRestructuring costs for the years ended December 31, 2024 and 2023 were $61 million and $68 million, respectively. Restructuring costs in both the current year and prior year primarily related to the real estate rationalization component of the Transformation program commenced by the Company during the fourth quarter of 2021 and completed as of December 31, 2024 (see Transformation Program within this section and Note 6 — Restructuring Costs within Item 8 of this Annual Report on Form 10-K).\n \n\n\n52\n\n\n\n\n \n\n\nTransaction and Transformation\n\n\nTransaction and transformation costs for the year ended December 31, 2024 were $409 million, compared to $386 million for the year ended December 31, 2023, an increase of $23 million. Transaction and transformation costs for the current year were higher primarily due to increased lease termination and compensation costs related to our Transformation program (see ‘Transformation Program’ elsewhere within this Item 7) incurred in the current year as compared to the prior year.\n\n\nIncome from Operations\n\n\nIncome from operations for the year ended December 31, 2024 was $627 million, compared to $1.4 billion for the year ended December 31, 2023, a decrease of $738 million. This decrease resulted from the impairment expense associated with the sale of our TRANZACT business (see Note 3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K), higher salary expense and increased incentive and benefit costs in the current year, partially offset by higher revenue in the current year.\n\n\nInterest Expense\n\n\nInterest expense for the years ended December 31, 2024 and 2023 was $263 million and $235 million, respectively. Interest expense, which is attributable primarily to our senior notes, increased by $28 million for the year ended December 31, 2024, which was primarily the result of a greater level of indebtedness in the current year and the higher interest rate-bearing senior notes issued by the Company during the last two years.\n\n\nOther (Loss)/Income, Net\n\n\nOther (loss)/income, net includes gains and losses on disposals of operations, pension credits or expenses that are not attributable to service expense, interest in earnings of associates, foreign exchange gains and losses and other miscellaneous non-operating income and costs.\n \n\n\nOther (loss)/income, net for the year ended December 31, 2024 was a loss of $260 million, compared to income of $149 million for the year ended December 31, 2023, a decrease of $409 million. This decrease was mostly due to the net loss on disposal in the current year, which is primarily attributable to the sale of our TRANZACT business (see Note 3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K), partially offset by the recognition of a $750 million earnout related to the 2021 divestiture of our Willis Re business which is expected to be received during the first half of 2025 (see Note 3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K).\n\n\nProvision for Income Taxes\n\n\nProvision for income taxes for the year ended December 31, 2024 was $192 million, compared to $215 million for the year ended December 31, 2023. The effective tax rates for the years ended December 31, 2024 and 2023 were 184.7% and 16.8%, respectively. These effective tax rates are calculated using extended values from our consolidated statements of comprehensive income and are therefore more precise tax rates than can be calculated from rounded values. The current-year effective tax rate includes a $137 million tax benefit recognized on the sale of our TRANZACT business, partially offset with a $55 million provision for tax expense on the accrual for the Willis Re earnout and a $34 million provision for changes in uncertain tax positions. The prior-year effective tax rate includes a $20 million tax benefit related to changes in state apportionment and a $10 million deferred tax benefit related to the remeasurement of deferred tax assets and liabilities associated with the enactment of the Bermuda corporate income tax law.\n\n\nIn December 2022, E.U. member states formally adopted the E.U.’s Pillar Two Directive, which introduces a global corporate minimum tax of 15% for certain large multinational companies. For the rules to take effect, in 2023 many E.U. countries enacted the necessary legislation to implement Pillar Two, effective January 1, 2024. Ireland, in particular, enacted Pillar Two legislation by signing Finance (No. 2) Bill 2023 into law in December 2023. Other countries and territories have indicated they will introduce Pillar Two legislation beginning in 2025. The Pillar Two minimum tax is treated as a period cost beginning in 2024 and does not have a material impact on the Company's financial results of operations for the current period. The Company continues to monitor evolving tax legislation as well as additional guidance to enacted legislation in the jurisdictions in which we operate.\n\n\nNet (Loss)/Income Attributable to WTW\n\n\nNet loss attributable to WTW for the year ended December 31, 2024 was $98 million, compared to income of $1.1 billion for the year ended December 31, 2023, a decrease of $1.2 billion. This decrease primarily resulted from the loss on disposal and impairment expense associated with the sale of our TRANZACT business (see Note 3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K), higher salary expense and increased incentive and benefit costs in the current year, partially offset by the recognition of a $750 million earnout related to the 2021 divestiture of our Willis Re business which is expected to be received during the first half of 2025 (see Note 3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K), and higher revenue in the current year.\n\n\n53\n\n\n\n\n \n\n\n \n\n\nLiquidity and Capital Resources\n\n\nExecutive Summary\n \n\n\nOur principal sources of liquidity are funds generated by operating activities, available cash and cash equivalents and amounts available under our revolving credit facility and any new debt offerings. These sources of liquidity will fund our short-term and long-term obligations at December 31, 2024. Our most significant long-term obligations include mandatory debt and related interest, operating leases and pension obligations and contributions to our qualified pension plans.\n \n\n\nThere has been significant volatility in financial markets, including occasional declines in equity markets, inflation and changes in interest rates and reduced liquidity on a global basis and we expect this volatility could continue, all of which may impact our access to liquidity.\n \n\n\nBased on our current balance sheet and cash flows, current market conditions and information available to us at this time, we believe that WTW has access to sufficient liquidity to meet our cash needs for the next twelve months. Including our cash generated from operations, our liquidity also includes all of the borrowing capacity available to draw against our $1.5 billion revolving credit facility and the receipt of the $750 million earnout related to the 2021 divestiture of Willis Re, which is expected to be collected during the first half of 2025. The use of these funds includes investments in the business for growth, scheduled debt repayments, share repurchases and dividend payments. During the fourth quarter of 2024, we re-entered the reinsurance broking space by making an initial investment in a reinsurance joint venture with Bain Capital. We hold a minority ownership interest in the joint venture and have an option to acquire a controlling interest in the future. Given the initial funding needs of a start-up venture, we expect that the investment will be a headwind for earnings until such time as the joint venture generates sufficient revenue to be profitable.\n\n\nDuring the year ended December 31, 2024, we completed an offering of $750 million aggregate principal amount of 5.900% senior notes due 2054 and used the net proceeds to repay in full the $650 million aggregate principal amount and related accrued interest of the 3.600% senior notes that were due in 2024. The Company used the remaining net proceeds for general corporate purposes. Additionally, during the year ended December 31, 2024, we repurchased $901 million of shares, with remaining authorization to repurchase an additional $1.4 billion as of December 31, 2024.\n \n\n\nWe consider many factors, including market and economic conditions, applicable legal requirements and other business considerations, when considering whether to repurchase shares. Our share repurchase program (as further described below under ‘Share Repurchase Program’) has no termination date and may be suspended or discontinued at any time.\n \n\n\nEvents that could change the historical cash flow dynamics discussed above include significant changes in operating results, the receipt of significant earnout payments related to past divestitures, potential future acquisitions or divestitures, material changes in geographic sources of cash, unexpected adverse impacts from litigation or tax or regulatory matters, or future pension funding during periods of severe downturn in the capital markets.\n\n\nDistributable Profits\n \n\n\nWe are required under Irish law to have available ‘distributable profits’ to make share repurchases or pay dividends to shareholders. Distributable profits are created through the earnings of the Irish parent company and, among other methods, through intercompany dividends or a reduction in share capital approved by the High Court of Ireland. Distributable profits are not linked to a U.S. GAAP reported amount (e.g. retained earnings). At WTW's Annual General Meeting on June 8, 2022, its shareholders voted in favor of a proposed capital reduction. In accordance with Part 3 of the Irish Companies Act 2014 the Parent Company submitted an application to the High Court of Ireland to reduce its share premium account. On July 19, 2022, the High Court of Ireland approved a reduction of the share premium account of the Parent Company of approximately $9.5 billion, with the resulting balance being treated as realized profits of the Parent Company. The High Court of Ireland's order was registered with the Irish Companies Registration Office and became effective on July 21, 2022. We believe that we will have sufficient distributable profits for the foreseeable future.\n\n\nTax considerations\n \n\n\nThe Company recognizes deferred tax balances related to the undistributed earnings of subsidiaries when it expects that it will recover those undistributed earnings in a taxable manner, such as through receipt of dividends or sale of the investments. We continue to have certain subsidiaries whose earnings have not been deemed permanently reinvested, for which we have been accruing estimates of the tax effects of such repatriation. Excluding these certain subsidiaries, we continue to assert that the historical cumulative earnings for the remainder of our subsidiaries have been reinvested indefinitely and therefore do not provide deferred taxes on these amounts. If future events, including material changes in estimates of cash, working capital, long-term investment requirements or additional legislation, necessitate that these earnings be distributed, an additional provision for income and foreign withholding taxes, net of\n \n\n\n54\n\n\n\n\n \n\n\ncredits, may be necessary. Other potential sources of cash may be through the settlement of intercompany loans or return of capital distributions in a tax-efficient manner.\n \n\n\nCash and Cash Equivalents\n\n\nOur cash and cash equivalents at December 31, 2024 and 2023 totaled $1.9 billion and $1.4 billion, respectively. The increase of $466 million in cash from December 31, 2023 to December 31, 2024 was due primarily to $1.5 billion of cash inflows from operating activities and proceeds of $619 million, primarily from the sale of TRANZACT, partially offset by $901 million of share repurchases, $354 million of dividend payments, $245 million of capital expenditures and capitalized software additions and net cash paid for acquisitions of $107 million.\n \n\n\nAdditionally, we had all of the borrowing capacity available to draw against our $1.5 billion revolving credit facility at December 31, 2024.\n \n\n\nIncluded within cash and cash equivalents at December 31, 2024 and 2023 are amounts held for regulatory capital adequacy requirements, including $104 million and $105 million, respectively, within our regulated U.K. entities.\n\n\nSummarized Consolidated Cash Flows\n\n\nThe following table presents the summarized consolidated cash flow information for the years ended:\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYears ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nNet cash from/(used in):\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nOperating activities\n\n\n \n\n\n$\n\n\n1,512\n\n\n \n\n\n \n\n\n$\n\n\n1,345\n\n\n \n\n\n\n\n\n\nInvesting activities\n\n\n \n\n\n \n\n\n250\n\n\n \n\n\n \n\n\n \n\n\n(1,085\n\n\n)\n\n\n\n\n\n\nFinancing activities\n\n\n \n\n\n \n\n\n(459\n\n\n)\n\n\n \n\n\n \n\n\n(1,200\n\n\n)\n\n\n\n\n\n\nINCREASE/(DECREASE) IN CASH, CASH EQUIVALENTS AND \n   RESTRICTED CASH\n\n\n \n\n\n \n\n\n1,303\n\n\n \n\n\n \n\n\n \n\n\n(940\n\n\n)\n\n\n\n\n\n\nEffect of exchange rate changes on cash, cash equivalents and restricted cash\n\n\n \n\n\n \n\n\n(97\n\n\n)\n\n\n \n\n\n \n\n\n11\n\n\n \n\n\n\n\n\n\nCASH, CASH EQUIVALENTS AND RESTRICTED CASH, BEGINNING OF \n   YEAR \n(i)\n\n\n \n\n\n \n\n\n3,792\n\n\n \n\n\n \n\n\n \n\n\n4,721\n\n\n \n\n\n\n\n\n\nCASH, CASH EQUIVALENTS AND RESTRICTED CASH, END OF YEAR \n(i)\n\n\n \n\n\n$\n\n\n4,998\n\n\n \n\n\n \n\n\n$\n\n\n3,792\n\n\n \n\n\n\n\n\n\n \n\n\n(i)\nThe amounts of the cash, cash equivalents and restricted cash, their respective classification on the consolidated balance sheets, as well as their respective portions of the increase or decrease in cash, cash equivalents and restricted cash for each of the periods presented, have been included in Note 21 \n— \nSupplemental Disclosures of Cash Flow Information within Item 8 of this Annual Report on Form 10-K.\n\n\n \n\n\nCash Flows From Operating Activities\n\n\nCash flows from operating activities were $1.5 billion for 2024, compared to $1.3 billion for 2023. The $1.5 billion net cash from operating activities for 2024 included a net loss of $88 million and $1.9 billion of favorable non-cash adjustments, partially offset by unfavorable changes in operating assets and liabilities of $326 million. The $1.9 billion of favorable non-cash adjustments primarily includes impairment, depreciation, amortization and non-cash lease expense. This increase in cash flows from operations as compared to the prior year was primarily driven by operating margin expansion, partially offset by increased cash outflows related to transformation and discretionary compensation payments in the current year as compared to the prior year.\n \n\n\nCash flows from operating activities of $1.3 billion for 2023 included net income of $1.1 billion and $652 million of favorable non-cash adjustments, partially offset by unfavorable changes in operating assets and liabilities of $371 million. The $652 million of favorable non-cash adjustments primarily includes depreciation, amortization and non-cash lease expense.\n \n\n\nCash Flows From/(Used In) Investing Activities\n\n\nCash flows from investing activities for the year ended December 31, 2024 were $250 million compared to cash flows used in investing activities of $1.1 billion for the year ended December 31, 2023. The cash flows from investing activities in the current year consisted of proceeds of $619 million primarily from the sale of TRANZACT, partially offset by capital expenditures and capitalized software additions of $245 million and net cash paid for acquisitions of $107 million.\n \n\n\nCash flows used in investing activities of $1.1 billion for the year ended December 31, 2023 consisted primarily of cash and fiduciary funds of $922 million associated with the transfer to Gallagher under a side letter agreement to the Willis Re sale agreement (see Note\n \n\n\n55\n\n\n\n\n \n\n\n3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K for more information) and $242 million of capital expenditures and capitalized software additions.\n\n\nCash Flows Used In Financing Activities\n\n\nCash flows used in financing activities for the year ended December 31, 2024 were $459 million. The significant financing activities included share repurchases of $901 million and dividend payments of $354 million, partially offset by net proceeds from fiduciary funds held for clients of $785 million and $82 million of net proceeds from the issuance of debt.\n\n\nCash flows used in financing activities for the year ended December 31, 2023 were $1.2 billion. The significant financing activities included share repurchases of $1.0 billion, dividend payments of $352 million and net payments from fiduciary funds held for clients of $234 million, partially offset by $487 million of net proceeds from the issuance of debt.\n\n\nIndebtedness\n\n\nTotal debt, total equity, and the capitalization ratio at December 31, 2024 and December 31, 2023 were as follows:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nDecember 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nLong-term debt\n\n\n \n\n\n$\n\n\n5,309\n\n\n \n\n\n \n\n\n$\n\n\n4,567\n\n\n \n\n\n\n\n\n\nCurrent debt\n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n \n\n\n \n\n\n650\n\n\n \n\n\n\n\n\n\nTotal debt\n\n\n \n\n\n$\n\n\n5,309\n\n\n \n\n\n \n\n\n$\n\n\n5,217\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nTotal WTW shareholders’ equity\n\n\n \n\n\n$\n\n\n7,940\n\n\n \n\n\n \n\n\n$\n\n\n9,520\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nCapitalization ratio\n\n\n \n\n\n \n\n\n40.1\n\n\n%\n\n\n \n\n\n \n\n\n35.4\n\n\n%\n\n\n\n\n\n\nThe capitalization ratio increased from December 31, 2023 due primarily to $901 million of share repurchases during the year ended December 31, 2024 and the earnings loss in the current year attributable to the recognition of impairment expense and loss on disposal associated with the sale of our TRANZACT business (see Note 3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K).\n\n\nAt December 31, 2024, the Company does not have any mandatory debt repayments over the next twelve months. For more information regarding our current and long-term debt, please see ‘Supplemental Guarantor Financial Information’ elsewhere within this Item 7 Management's Discussion and Analysis of Financial Condition and Results of Operations.\n\n\nAt December 31, 2024 and 2023, we were in compliance with all financial covenants.\n\n\nFiduciary Funds\n\n\nAs an intermediary, we hold funds, generally in a fiduciary capacity, for the account of third parties, typically as the result of premiums received from clients that are in transit to insurers and claims due to clients that are in transit from insurers. We also hold funds for clients of our benefits account businesses, some of which are invested in open-ended mutual funds as directed by the participant. These fiduciary funds are included in fiduciary assets on our consolidated balance sheets. We present the equal and corresponding fiduciary liabilities related to these fiduciary funds representing amounts or claims due to our clients or premiums due on their behalf to insurers on our consolidated balance sheets.\n\n\nFiduciary funds are generally required to be kept in regulated bank accounts subject to guidelines which emphasize capital preservation and liquidity; such funds are not available to service the Company’s debt or for other corporate purposes. Notwithstanding the legal relationships with clients and insurers, the Company is entitled to retain investment income earned on certain of these fiduciary funds in accordance with industry custom and practice and, in some cases, as supported by agreements with insureds.\n\n\nAt December 31, 2024 and 2023, we had fiduciary funds of $3.4 billion and $2.6 billion, respectively.\n \n\n\nShare Repurchase Program\n\n\nThe Company is authorized to repurchase shares, by way of redemption or otherwise, and will consider whether to do so from time to time, based on many factors, including market conditions. There are no expiration dates for our repurchase plans or programs.\n\n\n56\n\n\n\n\n \n\n\nOn May 25, 2022, the board of directors approved a $1.0 billion increase to the existing share repurchase program. Additionally, on September 20, 2023, the board of directors approved a $1.0 billion increase to the existing share repurchase program, and on November 20, 2024, approved a $1.0 billion increase to the existing share repurchase program. These increases brought the total approved authorization, since April 20, 2016, to $10.2 billion. See Part II, Item 5 Market for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities in this Annual Report on Form 10-K for further information regarding the Company’s share repurchase program.\n \n\n\nAt December 31, 2024, approximately $1.4 billion remained on the current repurchase authority. The maximum number of shares that could be repurchased based on the closing price of our ordinary shares on December 31, 2024 of $313.24 was 4,602,709.\n\n\nThe following table presents specified information about the Company’s repurchases of ordinary shares for the year ended December 31, 2024:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear ended\nDecember 31, 2024\n\n\n\n\n\n\nShares repurchased\n\n\n \n\n\n3,144,726\n\n\n\n\n\n\nAverage price per share\n\n\n \n\n\n$286.43\n\n\n\n\n\n\nAggregate repurchase cost (excluding broker costs)\n\n\n \n\n\n$901 million\n\n\n\n\n\n\n \n\n\nDividends\n\n\nTotal cash dividends of $354 million were paid during the year ended December 31, 2024. In February 2025, the board of directors approved a quarterly cash dividend of $0.92 per share ($3.68 per share annualized rate), which will be paid on or around April 15, 2025 to shareholders of record as of March 31, 2025.\n\n\nCapital Commitments\n\n\nThe Company’s capital expenditures for fixed assets, capitalized software and software for internal use were $245 million for the year ended December 31, 2024. Capital expenditures for fixed assets, capitalized software and software for internal use are expected to be in the range of $225 million to $250 million for the year ended December 31, 2025. We expect cash from operations to adequately provide for these cash needs.\n\n\nSupplemental Guarantor Financial Information\n\n\nAs of December 31, 2024, WTW has issued the following debt securities (the ‘notes’):\n\n\na)\nWillis North America Inc. (‘Willis North America’) has approximately $4.5 billion senior notes outstanding, of which $1.0 billion were issued on September 10, 2018, $1.0 billion were issued on September 10, 2019, $275 million were issued on May 29, 2020, $750 million were issued on May 19, 2022, $750 million were issued on May 17, 2023 and $750 million were issued on March 5, 2024; and\n\n\nb)\nTrinity Acquisition plc has approximately $825 million senior notes outstanding, of which $275 million were issued on August 15, 2013 and $550 million were issued on March 22, 2016, and a $1.5 billion revolving credit facility, on which no balance was outstanding at December 31, 2024. \n\n\n The following table presents a summary of the entities that issue each note and those wholly-owned subsidiaries of the Company that guarantee each respective note on a joint and several basis as of December 31, 2024. These subsidiaries are all consolidated by Willis Towers Watson plc (the ‘parent company’) and together with the parent company comprise the ‘Obligor group’. On December 16, 2024, TA I Limited, Willis Towers Watson UK Holdings Limited and Willis Netherlands Holdings B.V. ceased to be guarantors of our notes and are no longer part of the Obligor group, following the transfer of their respective properties and assets to other existing guarantors within the Obligor group. Further, Willis Towers Watson UK Holdings Limited was released from its guarantees under our credit agreement. TA I Limited and Willis Netherlands Holdings B.V. will be released from their guarantees under our credit agreement in 2025.\n\n\n \n\n\n57\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEntity\n\n\n \n\n\nTrinity Acquisition plc Notes\n\n\n \n\n\nWillis North America Inc. Notes\n\n\n\n\n\n\nWillis Towers Watson plc\n\n\n \n\n\nGuarantor\n\n\n \n\n\nGuarantor\n\n\n\n\n\n\nTrinity Acquisition plc\n\n\n \n\n\nIssuer\n\n\n \n\n\nGuarantor\n\n\n\n\n\n\nWillis North America Inc.\n\n\n \n\n\nGuarantor\n\n\n \n\n\nIssuer\n\n\n\n\n\n\nWillis Investment UK Holdings Limited\n\n\n \n\n\nGuarantor\n\n\n \n\n\nGuarantor\n\n\n\n\n\n\nWillis Group Limited\n\n\n \n\n\nGuarantor\n\n\n \n\n\nGuarantor\n\n\n\n\n\n\nWillis Towers Watson Sub Holdings Unlimited Company\n\n\n \n\n\nGuarantor\n\n\n \n\n\nGuarantor\n\n\n\n\n\n\nThe notes issued by Willis North America and Trinity Acquisition plc:\n\n\n•\nrank equally with all of the issuer’s existing and future unsubordinated and unsecured debt;\n\n\n•\nrank equally with the issuer’s guarantee of all of the existing senior debt of the Company and the other guarantors, including any debt under the Revolving Credit Facility;\n\n\n•\nare senior in right of payment to all of the issuer’s future subordinated debt; and\n\n\n•\nare effectively subordinated to all of the issuer’s secured debt to the extent of the value of the assets securing such debt.\n\n\nAll other subsidiaries of the parent company are non-guarantor subsidiaries (‘the non-guarantor subsidiaries’).\n \n\n\nEach member of the Obligor group has only a stockholder’s claim on the assets of the non-guarantor subsidiaries. This stockholder’s claim is junior to the claims that creditors have against those non-guarantor subsidiaries. Holders of the notes will only be creditors of the Obligor group and not creditors of the non-guarantor subsidiaries. As a result, all of the existing and future liabilities of the non-guarantor subsidiaries, including any claims of trade creditors and preferred stockholders, will be structurally senior to the notes. As of and for the periods ended December 31, 2024 and 2023, the non-guarantor subsidiaries represented substantially all of the total assets and accounted for substantially all of the total revenue of the Company prior to consolidating adjustments. The non-guarantor subsidiaries have other liabilities, including contingent liabilities that may be significant. Each indenture does not contain any limitations on the amount of additional debt that the Obligor group and the non-guarantor subsidiaries may incur. The amounts of this debt could be substantial, and this debt may be debt of the non-guarantor subsidiaries, in which case this debt would be effectively senior in right of payment to the notes.\n \n\n\nThe notes are obligations exclusively of the Obligor group. Substantially all of the Obligor group’s operations are conducted through its non-guarantor subsidiaries. Therefore, the Obligor group’s ability to service its debt, including the notes, is dependent upon the net cash flows of its non-guarantor subsidiaries and their ability to distribute those net cash flows as dividends, loans or other payments to the Obligor group. Certain laws restrict the ability of these non-guarantor subsidiaries to pay dividends and make loans and advances to the Obligor group. In addition, such non-guarantor subsidiaries may enter into contractual arrangements that limit their ability to pay dividends and make loans and advances to the Obligor group.\n \n\n\nIntercompany balances and transactions between members of the Obligor group have been eliminated. All intercompany balances and transactions between the Obligor group and the non-guarantor subsidiaries have been presented in the disclosures below on a net presentation basis, rather than a gross basis, as this better reflects the nature of the intercompany positions and presents the funding or funded position that is to be received or owed. The intercompany balances and transactions between the Obligor group and non-guarantor subsidiaries, presented below, relate to a number of items including loan funding for acquisitions and other purposes, transfers of surplus cash between subsidiary companies, funding provided for working capital purposes, settlement of expense accounts, transactions related to share-based payment arrangements and share issuances, intercompany royalty and related arrangements, intercompany dividends and intercompany interest. At December 31, 2024 and 2023, the intercompany balances of the Obligor group with non-guarantor subsidiaries were net receivables of $1.0 billion and $3.4 billion, respectively, and net payables of $15.1 billion and $14.0 billion, respectively.\n\n\nNo balances or transactions of non-guarantor subsidiaries are presented in the disclosures other than the intercompany items noted above.\n \n\n\nPresented below is certain summarized financial information for the Obligor group.\n\n\n \n\n\n58\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nAs of \nDecember 31, 2024\n\n\n \n\n\n \n\n\nAs of \nDecember 31, 2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nTotal current assets\n\n\n \n\n\n$\n\n\n290\n\n\n \n\n\n \n\n\n$\n\n\n299\n\n\n \n\n\n\n\n\n\nTotal non-current assets\n\n\n \n\n\n \n\n\n1,050\n\n\n \n\n\n \n\n\n \n\n\n3,454\n\n\n \n\n\n\n\n\n\nTotal current liabilities\n\n\n \n\n\n \n\n\n6,254\n\n\n \n\n\n \n\n\n \n\n\n7,576\n\n\n \n\n\n\n\n\n\nTotal non-current liabilities\n\n\n \n\n\n \n\n\n14,442\n\n\n \n\n\n \n\n\n \n\n\n11,848\n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear ended\nDecember 31, 2024\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nRevenue\n\n\n \n\n\n$\n\n\n1,008\n\n\n \n\n\n\n\n\n\nIncome from operations\n\n\n \n\n\n \n\n\n820\n\n\n \n\n\n\n\n\n\nLoss from operations before income taxes \n(i)\n\n\n \n\n\n \n\n\n(215\n\n\n)\n\n\n\n\n\n\nNet loss\n\n\n \n\n\n \n\n\n(103\n\n\n)\n\n\n\n\n\n\nNet loss attributable to Willis Towers Watson\n\n\n \n\n\n \n\n\n(103\n\n\n)\n\n\n\n\n\n\n \n\n\n(i)\nIncludes intercompany expense, net of the Obligor group from non-guarantor subsidiaries of $296 million for the year ended December 31, 2024.\n\n\nNon-GAAP Financial Measures\n\n\nIn order to assist readers of our consolidated financial statements in understanding the core operating results that WTW’s management uses to evaluate the business and for financial planning purposes, we present the following non-GAAP measures and their most directly comparable U.S. GAAP measure:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMost Directly Comparable U.S. GAAP Measure\n\n\n \n\n\nNon-GAAP Measure\n\n\n\n\n\n\nAs reported change\n\n\n \n\n\nConstant currency change\n\n\n\n\n\n\nAs reported change\n\n\n \n\n\nOrganic change\n\n\n\n\n\n\nIncome from operations/margin\n\n\n \n\n\nAdjusted operating income/margin\n\n\n\n\n\n\nNet (loss)/income/margin\n\n\n \n\n\nAdjusted EBITDA/margin\n\n\n\n\n\n\nNet (loss)/income attributable to WTW\n\n\n \n\n\nAdjusted net income\n\n\n\n\n\n\nDiluted (loss)/earnings per share\n\n\n \n\n\nAdjusted diluted earnings per share\n\n\n\n\n\n\nIncome from continuing operations before income taxes\n\n\n \n\n\nAdjusted income before taxes\n\n\n\n\n\n\nProvision for income taxes/U.S. GAAP tax rate\n\n\n \n\n\nAdjusted income taxes/tax rate\n\n\n\n\n\n\nNet cash from operating activities\n\n\n \n\n\nFree cash flow/margin\n\n\n\n\n\n\n \n\n\nThe Company believes that these measures are relevant and provide pertinent information widely used by analysts, investors and other interested parties in our industry to provide a baseline for evaluating and comparing our operating performance, and in the case of free cash flow, our liquidity results.\n\n\nWithin the measures referred to as ‘adjusted’, we adjust for significant items which will not be settled in cash, or which we believe to be items that are not core to our current or future operations. These items include the following:\n\n\n•\nRestructuring costs and transaction and transformation – Management believes it is appropriate to adjust for restructuring costs and transaction and transformation when they relate to a specific significant program with a defined set of activities and costs that are not expected to continue beyond a defined period of time, or significant acquisition-related transaction expenses. We believe the adjustment is necessary to present how the Company is performing, both now and in the future when the incurrence of these costs will have concluded. \n\n\n•\nImpairment – Adjustment to remove the non-cash goodwill impairment associated with our BDA reporting unit related to the sale of our TRANZACT business.\n\n\n•\nProvisions for specified litigation matters – We will include provisions for litigation matters which we believe are not representative of our core business operations. Among other things, we determine this by reference to the amount of the loss (net of insurance and other recovery receivables) and by reference to whether the matter relates to an unusual and complex scenario that is not expected to be repeated as part of our ongoing, ordinary business. These amounts are presented net of insurance and other recovery receivables. See the footnotes to the reconciliation tables below for more specificity on the litigation matter excluded from adjusted results.\n\n\n•\nGains and losses on disposals of operations – Adjustment to remove the gains or losses resulting from disposed operations that have not been classified as discontinued operations.\n\n\n59\n\n\n\n\n \n\n\n•\nPension settlement – Adjustment to remove significant pension settlements to better present how the Company is performing.\n\n\n•\nTax effect of significant adjustments – Relates to the incremental tax expense or benefit resulting from significant or unusual events including significant statutory tax rate changes enacted in material jurisdictions in which we operate, internal reorganizations of ownership of certain businesses that reduced the investment held by our U.S.-controlled subsidiaries and the recovery of certain refunds or payment of taxes related to businesses in which we no longer participate. \n\n\nThese non-GAAP measures are not defined in the same manner by all companies and may not be comparable to other similarly titled measures of other companies. Non-GAAP measures should be considered in addition to, and not as a substitute for, the information contained within our consolidated financial statements.\n\n\nConstant Currency Change and Organic Change\n\n\nWe evaluate our revenue on an as reported (U.S. GAAP), constant currency and organic basis. We believe presenting constant currency and organic information provides valuable supplemental information regarding our comparable results, consistent with how we evaluate our performance internally.\n\n\n•\nConstant Currency Change -\n Represents the year-over-year change in revenue excluding the impact of foreign currency fluctuations. To calculate this impact, the prior year local currency results are first translated using the current year monthly average exchange rates. The change is calculated by comparing the prior year revenue, translated at the current year monthly average exchange rates, to the current year as reported revenue, for the same period. We believe constant currency measures provide useful information to investors because they provide transparency to performance by excluding the effects that foreign currency exchange rate fluctuations have on period-over-period comparability given volatility in foreign currency exchange markets.\n\n\n•\nOrganic Change -\n Excludes the impact of fluctuations in foreign currency exchange rates as described above and the period-over-period impact of acquisitions and divestitures on current-year revenue. We believe that excluding transaction-related items from our U.S. GAAP financial measures provides useful supplemental information to our investors, and it is important in illustrating what our core operating results would have been had we not included these transaction-related items, since the nature, size and number of these transaction-related items can vary from period to period.\n\n\nThe constant currency and organic change results, and a reconciliation from the reported results for consolidated revenue, are included in the ‘Consolidated Revenue’ section within this Form 10-K. These measures are also reported by segment in the ‘Segment Revenue and Segment Operating Income’ section within this Form 10-K.\n\n\nA reconciliation of the as-reported change to the constant currency and organic change for the year ended December 31, 2024 from the year ended December 31, 2023 is as follows. The components of revenue change may not add due to rounding.\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nComponents of Revenue Change\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nAs\n\n\n \n\n\nLess:\n\n\n \n\n\nConstant\n\n\n \n\n\nLess:\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nYears ended December 31,\n\n\n \n\n\n \n\n\nReported\n\n\n \n\n\nCurrency\n\n\n \n\n\nCurrency\n\n\n \n\n\nAcquisitions/\n\n\n \n\n\nOrganic\n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\nChange\n\n\n \n\n\nImpact\n\n\n \n\n\nChange\n\n\n \n\n\nDivestitures\n\n\n \n\n\nChange \n(i)\n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nRevenue\n\n\n \n\n\n$\n\n\n9,930\n\n\n \n\n\n \n\n\n$\n\n\n9,483\n\n\n \n\n\n \n\n\n5%\n\n\n \n\n\n—%\n\n\n \n\n\n5%\n\n\n \n\n\n—%\n\n\n \n\n\n5%\n\n\n\n\n\n\n \n\n\n(i)\nInterest income did not contribute to organic change for the year ended December 31, 2024.\n\n\nFor the year ended December 31, 2024, our as-reported and our organic revenue increased by 5%. These increases were driven by strong performances in both segments.\n \n\n\nAdjusted Operating Income/Margin\n\n\nWe consider adjusted operating income/margin to be important financial measures, which are used internally to evaluate and assess our core operations and to benchmark our operating results against our competitors.\n\n\nAdjusted operating income is defined as income from operations adjusted for impairment, amortization, restructuring costs, transaction and transformation and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted operating income margin is calculated by dividing adjusted operating income by revenue.\n \n\n\n60\n\n\n\n\n \n\n\nReconciliations of income from operations to adjusted operating income for the years ended December 31, 2024 and 2023 are as follows:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYears Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n\n\n\n\nIncome from operations\n\n\n \n\n\n$\n\n\n627\n\n\n \n\n\n \n\n\n$\n\n\n1,365\n\n\n \n\n\n\n\n\n\nAdjusted for certain items:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nImpairment\n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nAmortization\n\n\n \n\n\n \n\n\n226\n\n\n \n\n\n \n\n\n \n\n\n263\n\n\n \n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n \n\n\n61\n\n\n \n\n\n \n\n\n \n\n\n68\n\n\n \n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n \n\n\n409\n\n\n \n\n\n \n\n\n \n\n\n386\n\n\n \n\n\n\n\n\n\nProvision for specified litigation matter \n(i)\n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nAdjusted operating income\n\n\n \n\n\n$\n\n\n2,378\n\n\n \n\n\n \n\n\n$\n\n\n2,082\n\n\n \n\n\n\n\n\n\nIncome from operations margin\n\n\n \n\n\n \n\n\n6.3\n\n\n%\n\n\n \n\n\n \n\n\n14.4\n\n\n%\n\n\n\n\n\n\nAdjusted operating income margin\n\n\n \n\n\n \n\n\n23.9\n\n\n%\n\n\n \n\n\n \n\n\n22.0\n\n\n%\n\n\n\n\n\n\n \n\n\n(i)\nRepresents a provision related to litigation arising out of a structured insurance program originally placed for a client over 15 years ago. The program is of a type and complexity that was highly bespoke to the client and for that reason is unlikely to be exactly replicated elsewhere. We believe excluding this matter from adjusted results makes results more comparable from period to period and more representative of our core business operations.\n\n\n \n\n\nAdjusted operating income increased for the year ended December 31, 2024 to $2.4 billion, from $2.1 billion for the year ended December 31, 2023. This increase resulted primarily from higher revenue, and increased margin expansion as a result of benefits recognized from our Transformation program, in the current year, partially offset by higher salary expense and increased incentive and benefit costs in the current year as compared to the prior year.\n \n\n\nAdjusted EBITDA/Margin\n\n\nWe consider adjusted EBITDA/margin to be important financial measures, which are used internally to evaluate and assess our core operations, to benchmark our operating results against our competitors and to evaluate and measure our performance-based compensation plans.\n\n\nAdjusted EBITDA is defined as net (loss)/income adjusted for provision for income taxes, interest expense, impairment, depreciation and amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted EBITDA margin is calculated by dividing adjusted EBITDA by revenue.\n\n\nReconciliations of net (loss)/income to adjusted EBITDA for the years ended December 31, 2024 and 2023 are as follows:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYears Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n\n\n\n\nNET (LOSS)/INCOME\n\n\n \n\n\n$\n\n\n(88\n\n\n)\n\n\n \n\n\n$\n\n\n1,064\n\n\n \n\n\n\n\n\n\nProvision for income taxes\n\n\n \n\n\n \n\n\n192\n\n\n \n\n\n \n\n\n \n\n\n215\n\n\n \n\n\n\n\n\n\nInterest expense\n\n\n \n\n\n \n\n\n263\n\n\n \n\n\n \n\n\n \n\n\n235\n\n\n \n\n\n\n\n\n\nImpairment\n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nDepreciation\n\n\n \n\n\n \n\n\n230\n\n\n \n\n\n \n\n\n \n\n\n242\n\n\n \n\n\n\n\n\n\nAmortization\n\n\n \n\n\n \n\n\n226\n\n\n \n\n\n \n\n\n \n\n\n263\n\n\n \n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n \n\n\n61\n\n\n \n\n\n \n\n\n \n\n\n68\n\n\n \n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n \n\n\n409\n\n\n \n\n\n \n\n\n \n\n\n386\n\n\n \n\n\n\n\n\n\nProvision for specified litigation matter \n(i)\n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nPension settlement\n\n\n \n\n\n \n\n\n23\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nLoss/(gain) on disposal of operations\n\n\n \n\n\n \n\n\n337\n\n\n \n\n\n \n\n\n \n\n\n(43\n\n\n)\n\n\n\n\n\n\nAdjusted EBITDA\n\n\n \n\n\n$\n\n\n2,708\n\n\n \n\n\n \n\n\n$\n\n\n2,430\n\n\n \n\n\n\n\n\n\nNet (loss)/income margin\n\n\n \n\n\n \n\n\n(0.9\n\n\n)%\n\n\n \n\n\n \n\n\n11.2\n\n\n%\n\n\n\n\n\n\nAdjusted EBITDA margin\n\n\n \n\n\n \n\n\n27.3\n\n\n%\n\n\n \n\n\n \n\n\n25.6\n\n\n%\n\n\n\n\n\n\n \n\n\n(i)\nRepresents a provision related to litigation arising out of a structured insurance program originally placed for a client over 15 years ago. The program is of a type and complexity that was highly bespoke to the client and for that reason is unlikely to be exactly replicated elsewhere. We believe excluding this matter from adjusted results makes results more comparable from period to period and more representative of our core business operations.\n\n\n61\n\n\n\n\n \n\n\nAdjusted EBITDA for the year ended December 31, 2024 was $2.7 billion, compared to $2.4 billion for the year ended December 31, 2023, an increase of $278 million. This increase resulted primarily from higher revenue, and increased margin expansion as a result of benefits recognized from our Transformation program, in the current year, partially offset by higher salary expense and increased incentive and benefit costs in the current year as compared to the prior year.\n\n\nAdjusted Net Income and Adjusted Diluted Earnings Per Share\n\n\nAdjusted net income is defined as net (loss)/income attributable to WTW adjusted for impairment, amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results and the related tax effect of those adjustments and the tax effects of significant adjustments. This measure is used solely for the purpose of calculating adjusted diluted earnings per share.\n\n\nAdjusted diluted earnings per share is defined as adjusted net income divided by the weighted-average number of ordinary shares, diluted. Adjusted diluted earnings per share is used to internally evaluate and assess our core operations and to benchmark our operating results against our competitors. When there is a net loss attributable to WTW for the period, basic and diluted shares and earnings per share are the same values.\n \n\n\nReconciliations of net (loss)/income attributable to WTW to adjusted diluted earnings per share for the years ended December 31, 2024 and 2023 are as follows:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYears Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n($ and weighted-average shares in millions)\n\n\n \n\n\n\n\n\n\nNET (LOSS)/INCOME ATTRIBUTABLE TO WTW\n\n\n \n\n\n$\n\n\n(98\n\n\n)\n\n\n \n\n\n$\n\n\n1,055\n\n\n \n\n\n\n\n\n\nAdjusted for certain items:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nImpairment\n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nAmortization\n\n\n \n\n\n \n\n\n226\n\n\n \n\n\n \n\n\n \n\n\n263\n\n\n \n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n \n\n\n61\n\n\n \n\n\n \n\n\n \n\n\n68\n\n\n \n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n \n\n\n409\n\n\n \n\n\n \n\n\n \n\n\n386\n\n\n \n\n\n\n\n\n\nProvision for specified litigation matter \n(i)\n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nPension settlement\n\n\n \n\n\n \n\n\n23\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nLoss/(gain) on disposal of operations\n\n\n \n\n\n \n\n\n337\n\n\n \n\n\n \n\n\n \n\n\n(43\n\n\n)\n\n\n\n\n\n\nTax effect on certain items listed above \n(ii)\n\n\n \n\n\n \n\n\n(276\n\n\n)\n\n\n \n\n\n \n\n\n(195\n\n\n)\n\n\n\n\n\n\nTax effect of significant adjustments\n\n\n \n\n\n \n\n\n(7\n\n\n)\n\n\n \n\n\n \n\n\n2\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n$\n\n\n1,730\n\n\n \n\n\n \n\n\n$\n\n\n1,536\n\n\n \n\n\n\n\n\n\nWeighted-average ordinary shares — diluted\n\n\n \n\n\n \n\n\n102\n\n\n \n\n\n \n\n\n \n\n\n106\n\n\n \n\n\n\n\n\n\nDiluted (loss)/earnings per share\n\n\n \n\n\n$\n\n\n(0.96\n\n\n)\n\n\n \n\n\n$\n\n\n9.95\n\n\n \n\n\n\n\n\n\nAdjusted for certain items \n(iii)\n:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nImpairment\n\n\n \n\n\n \n\n\n10.20\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nAmortization\n\n\n \n\n\n \n\n\n2.21\n\n\n \n\n\n \n\n\n \n\n\n2.48\n\n\n \n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n \n\n\n0.60\n\n\n \n\n\n \n\n\n \n\n\n0.64\n\n\n \n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n \n\n\n4.00\n\n\n \n\n\n \n\n\n \n\n\n3.64\n\n\n \n\n\n\n\n\n\nProvision for specified litigation matter \n(i)\n\n\n \n\n\n \n\n\n0.13\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nPension settlement\n\n\n \n\n\n \n\n\n0.23\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nLoss/(gain) on disposal of operations\n\n\n \n\n\n \n\n\n3.30\n\n\n \n\n\n \n\n\n \n\n\n(0.41\n\n\n)\n\n\n\n\n\n\nTax effect on certain items listed above \n(ii)\n\n\n \n\n\n \n\n\n(2.70\n\n\n)\n\n\n \n\n\n \n\n\n(1.84\n\n\n)\n\n\n\n\n\n\nTax effect of significant adjustments\n\n\n \n\n\n \n\n\n(0.07\n\n\n)\n\n\n \n\n\n \n\n\n0.02\n\n\n \n\n\n\n\n\n\nAdjusted diluted earnings per share \n(iii)\n\n\n \n\n\n$\n\n\n16.93\n\n\n \n\n\n \n\n\n$\n\n\n14.49\n\n\n \n\n\n\n\n\n\n \n\n\n(i)\nRepresents a provision related to litigation arising out of a structured insurance program originally placed for a client over 15 years ago. The program is of a type and complexity that was highly bespoke to the client and for that reason is unlikely to be exactly replicated elsewhere. We believe excluding this matter from adjusted results makes results more comparable from period to period and more representative of our core business operations.\n\n\n(ii)\nThe tax effect was calculated using an effective tax rate for each item.\n\n\n(iii)\nPer share values and totals may differ due to rounding.\n\n\nOur adjusted diluted earnings per share increased for the year ended December 31, 2024 as compared to the year ended December 31, 2023 primarily from higher revenue, and increased margin expansion as a result of benefits recognized from our Transformation program, in the current year, partially offset by higher salary expense and increased incentive and benefit costs in the current year as compared to the prior year.\n\n\n62\n\n\n\n\n \n\n\nAdjusted Income Before Taxes and Adjusted Income Taxes/Tax Rate\n\n\nAdjusted income before taxes is defined as income from operations before income taxes adjusted for impairment, amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results. Adjusted income before taxes is used solely for the purpose of calculating the adjusted income tax rate.\n\n\nAdjusted income taxes/tax rate is defined as the provision for income taxes adjusted for taxes on certain items of impairment, amortization, restructuring costs, transaction and transformation, gains and losses on disposals of operations, the tax effects of significant adjustments and non-recurring items that, in management’s judgment, significantly affect the period-over-period assessment of operating results, divided by adjusted income before taxes. Adjusted income taxes is used solely for the purpose of calculating the adjusted income tax rate.\n\n\nManagement believes that the adjusted income tax rate presents a rate that is more closely aligned to the rate that we would incur if not for the reduction of pre-tax income for the adjusted items and the tax effects of internal reorganizations, which are not core to our current and future operations.\n\n\nReconciliations of income from continuing operations before income taxes to adjusted income before taxes and provision for income taxes to adjusted income taxes for the years ended December 31, 2024 and 2023 are as follows:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYears Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n($ in millions)\n\n\n \n\n\n\n\n\n\nINCOME FROM CONTINUING OPERATIONS BEFORE \n   INCOME TAXES\n\n\n \n\n\n$\n\n\n104\n\n\n \n\n\n \n\n\n$\n\n\n1,279\n\n\n \n\n\n\n\n\n\nAdjusted for certain items:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nImpairment\n\n\n \n\n\n \n\n\n1,042\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nAmortization\n\n\n \n\n\n \n\n\n226\n\n\n \n\n\n \n\n\n \n\n\n263\n\n\n \n\n\n\n\n\n\nRestructuring costs\n\n\n \n\n\n \n\n\n61\n\n\n \n\n\n \n\n\n \n\n\n68\n\n\n \n\n\n\n\n\n\nTransaction and transformation\n\n\n \n\n\n \n\n\n409\n\n\n \n\n\n \n\n\n \n\n\n386\n\n\n \n\n\n\n\n\n\nProvision for specified litigation matter \n(i)\n\n\n \n\n\n \n\n\n13\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nPension settlement\n\n\n \n\n\n \n\n\n23\n\n\n \n\n\n \n\n\n \n\n\n—\n\n\n \n\n\n\n\n\n\nLoss/(gain) on disposal of operations\n\n\n \n\n\n \n\n\n337\n\n\n \n\n\n \n\n\n \n\n\n(43\n\n\n)\n\n\n\n\n\n\nAdjusted income before taxes\n\n\n \n\n\n$\n\n\n2,215\n\n\n \n\n\n \n\n\n$\n\n\n1,953\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nProvision for income taxes\n\n\n \n\n\n$\n\n\n192\n\n\n \n\n\n \n\n\n$\n\n\n215\n\n\n \n\n\n\n\n\n\nTax effect on certain items listed above \n(ii)\n\n\n \n\n\n \n\n\n276\n\n\n \n\n\n \n\n\n \n\n\n195\n\n\n \n\n\n\n\n\n\nTax effect of significant adjustments\n\n\n \n\n\n \n\n\n7\n\n\n \n\n\n \n\n\n \n\n\n(2\n\n\n)\n\n\n\n\n\n\nAdjusted income taxes\n\n\n \n\n\n$\n\n\n475\n\n\n \n\n\n \n\n\n$\n\n\n408\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nU.S. GAAP tax rate\n\n\n \n\n\n \n\n\n184.7\n\n\n%\n\n\n \n\n\n \n\n\n16.8\n\n\n%\n\n\n\n\n\n\nAdjusted income tax rate\n\n\n \n\n\n \n\n\n21.5\n\n\n%\n\n\n \n\n\n \n\n\n20.9\n\n\n%\n\n\n\n\n\n\n \n\n\n(i)\nRepresents a provision related to litigation arising out of a structured insurance program originally placed for a client over 15 years ago. The program is of a type and complexity that was highly bespoke to the client and for that reason is unlikely to be exactly replicated elsewhere. We believe excluding this matter from adjusted results makes results more comparable from period to period and more representative of our core business operations.\n\n\n(ii)\nThe tax effect was calculated using an effective tax rate for each item.\n\n\nOur U.S. GAAP tax rates were 184.7% and 16.8% for the years ended December 31, 2024 and 2023, respectively. The current-year effective tax rate includes a $137 million tax benefit recognized on the sale of our TRANZACT business, partially offset with a $55 million provision for tax expense on the accrual for the Willis Re earnout and a $34 million provision for changes in uncertain tax positions.\n\n\nOur adjusted income tax rates were 21.5% and 20.9% for the years ended December 31, 2024 and 2023, respectively. The prior-year effective tax rate includes a $20 million tax benefit related to changes in state apportionment and a $10 million deferred tax benefit related to the remeasurement of deferred tax assets and liabilities associated with the enactment of the Bermuda corporate income tax law.\n \n\n\n63\n\n\n\n\n \n\n\nFree Cash Flow/Margin\n\n\nFree cash flow is defined as cash flows from operating activities less cash used to purchase fixed assets and software for internal use. Free cash flow is a liquidity measure and is not meant to represent residual cash flow available for discretionary expenditures. Free cash flow margin, which we include on an annual basis as seasonal fluctuations in our revenue render it not meaningful during interim periods, is calculated by dividing free cash flow by revenue.\n\n\nManagement believes that free cash flow and free cash flow margin present the core operating performance and cash generating capabilities of our business operations.\n\n\nReconciliations of cash flows from operating activities to free cash flow for the years ended December 31, 2024 and 2023 are as follows:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYears ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n(in millions)\n\n\n \n\n\n\n\n\n\nCash flows from operating activities\n\n\n \n\n\n$\n\n\n1,512\n\n\n \n\n\n \n\n\n$\n\n\n1,345\n\n\n \n\n\n\n\n\n\nLess: Additions to fixed assets and software for internal use\n\n\n \n\n\n \n\n\n(136\n\n\n)\n\n\n \n\n\n \n\n\n(153\n\n\n)\n\n\n\n\n\n\nFree cash flow\n\n\n \n\n\n$\n\n\n1,376\n\n\n \n\n\n \n\n\n$\n\n\n1,192\n\n\n \n\n\n\n\n\n\nRevenue\n\n\n \n\n\n$\n\n\n9,930\n\n\n \n\n\n \n\n\n$\n\n\n9,483\n\n\n \n\n\n\n\n\n\nFree cash flow margin\n\n\n \n\n\n \n\n\n13.9\n\n\n%\n\n\n \n\n\n \n\n\n12.6\n\n\n%\n\n\n\n\n\n\nThe increase in free cash flow during the current year was primarily driven by operating margin expansion, partially offset by increased cash outflows related to transformation and discretionary compensation payments in the current year as compared to the prior year.\n \n\n\nCritical Accounting Estimates\n\n\nThese consolidated financial statements conform to U.S. GAAP, which requires management to make estimates and assumptions that affect the reported amounts of assets and liabilities, disclosures of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenue and expenses during the reporting period. Our estimates, judgments and assumptions are continually evaluated based on available information and experience. Because of the use of estimates inherent in the financial reporting process, actual results could differ from those estimates. The areas that we believe include critical accounting estimates are revenue recognition, costs to fulfill under our broking contracts, valuation of billed and unbilled receivables from clients, income taxes, commitments, contingencies and accrued liabilities, pension assumptions, and goodwill and intangible assets. The critical accounting estimates discussed below involve making difficult, subjective or complex accounting estimates that could have a material effect on our financial condition and results of operations. These critical accounting estimates require us to make assumptions about matters that are highly uncertain at the time of the estimate or assumption. Different estimates that we could have used, or changes in estimates that are reasonably likely to occur, may have a material effect on our results of operations and financial condition.\n\n\nRevenue Recognition\n \n\n\nWe use significant estimates related to revenue recognition most commonly during our estimation of the transaction prices or where we recognize revenue over time on a proportional performance basis. A brief description of these policies and estimates is included below:\n\n\nEstimation of transaction prices\n — This process occurs most frequently in certain broking transactions. In situations in which our fees are not fixed but are variable, we must estimate the likely commission per policy, taking into account the likelihood of cancellation before the end of the policy. For Medicare broking and Affinity arrangements, the commissions to which we will be entitled can vary based on the underlying individual insurance policies that are placed. For Medicare broking in particular, we base the estimates of transaction prices on supportable evidence from an analysis of past transactions, and only include amounts that are probable of being received or not refunded (referred to as applying ‘constraint’ under ASC 606, \nRevenue From Contracts With Customers\n). Prior to the sale of TRANZACT, we had direct-to-consumer Medicare broking arrangements. The estimate of the total renewal commissions received over the lifetime of the policy required significant judgment, and varied based on product type, estimated commission rates, the expected lives of the respective policies and other factors. The Company applied an actuarial model to account for these uncertainties, which was updated periodically based on actual experience. Each of these processes resulted in us estimating a transaction price that could have been significantly lower than the ultimate amount of commissions we would have collected. The transaction price was then adjusted over time as we received confirmation of our remuneration through receipt of commissions, or as other information became available.\n \n\n\n64\n\n\n\n\n \n\n\nProportional performance basis over time recognition\n — Where we recognize revenue on a proportional performance basis, primarily in our consulting and outsourced administration arrangements, the amount we recognize is affected by a number of factors that can change the estimated amount of work required to complete the project, such as the staffing on the engagement and/or the level of client participation. Our periodic engagement evaluations require us to make judgments and estimates regarding the overall profitability and stages of project completion that, in turn, affect how we recognize revenue. We recognize a loss on an engagement when estimated revenue to be received for that engagement is less than the total estimated costs associated with the engagement.\n \n\n\nCosts to Fulfill —Broking Contracts\n \n\n\nFor our broking business, the Company must estimate the fulfillment costs incurred during the pre-placement of the broking contracts. These judgments include the following:\n\n\n•\nwhich activities in the pre-placement process should be eligible for capitalization;\n\n\n•\nthe amount of time and effort expended on those pre-placement activities;\n\n\n•\nthe amount of payroll and related costs eligible for capitalization; and,\n\n\n•\nthe monthly or quarterly timing of underlying insurance and reinsurance policy inception dates.\n\n\nValuation of Billed and Unbilled Receivables from Clients\n\n\nWe maintain allowances for doubtful accounts to reflect estimated losses resulting from a client’s failure to pay for the services after the services have been rendered, which are recorded in other operating expenses. We also maintain allowances related to our unbilled receivables for such items as expected realization or client disputes, the related provision for which is recorded as a reduction to revenue. Our allowance policy is based in part on the aging of the billed and unbilled client receivables and has been developed based on our write-off history. However, facts and circumstances, such as the average length of time the receivables are past due, general market conditions at the time we perform the work, current economic trends and our clients’ ability to pay, may cause fluctuations in our valuation of billed and unbilled receivables.\n\n\nIncome Taxes\n\n\nThe Company recognizes deferred tax assets and liabilities for the estimated future tax consequences of events attributable to differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases and operating and capital loss and tax credit carryforwards. Deferred tax assets and liabilities are measured using enacted tax rates in effect for the year in which the differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of changes in tax rates is recognized for continuing operations in the consolidated statement of comprehensive income in the period in which the change is enacted. Deferred tax assets are reduced through the establishment of a valuation allowance at such time as, based on available evidence, it is more likely than not that the deferred tax assets will not be realized. The Company adjusts valuation allowances to measure deferred tax assets at the amounts considered realizable in future periods, which is assessed at each balance sheet date. In making such determinations, the Company considers all available positive and negative evidence, including future reversals of existing taxable temporary differences, projected future taxable income, tax planning strategies and recent financial operating results. We place more reliance on evidence that is objectively verifiable.\n\n\nCommitments, Contingencies and Accrued Liabilities\n\n\nWe have established provisions against various actual and potential claims, lawsuits and other proceedings relating principally to alleged errors and omissions in connection with the placement of insurance and reinsurance and the provision of consulting services in the ordinary course of business. Such provisions cover claims that have been reported but not paid and also claims that have been incurred but not reported. These provisions are established based on actuarial estimates together with individual case reviews and are believed to be adequate in the light of current information and legal advice. In certain cases, where a range of loss exists, we accrue the minimum amount in the range if no amount within the range is a better estimate than any other amount.\n\n\nSee Note 15 — Commitments and Contingencies in Item 8 within this Annual Report on Form 10-K.\n\n\nPension Assumptions\n\n\nWe maintain defined benefit pension plans for employees in several countries, with the most significant defined benefit plans offered in the U.S. and U.K. Our disclosures in Note 13 — Retirement Benefits contain additional information about our other less significant but material retirement plans. Within our critical accounting policy discussion, we have excluded analysis for plans outside of those noted in the description below, as any variance of recorded information based on management’s estimates would be immaterial.\n\n\n65\n\n\n\n\n \n\n\nDescriptions of our U.S. and U.K. plans, which comprise 88% of our projected benefit obligations and 89% of our plan assets, are below:\n \n\n\nUnited States\n\n\nLegacy Willis\n – This plan was frozen in 2009. Approximately 550 WTW employees in the United States have a frozen accrued benefit under this plan.\n\n\nWTW Plan\n – Substantially all U.S. employees are eligible to participate in this plan. Benefits are provided under a stable value pension plan design. The original stable value design came into effect on January 1, 2012. Plan participants prior to July 1, 2017 earn benefits without having to make employee contributions, and all newly-eligible employees after that date are required to contribute 2% of pay on an after-tax basis to participate in the plan. Effective January 1, 2024, stable value benefits are earned under the same contributory formula for all eligible colleagues. To participate, participants are required to contribute 2% of eligible earnings (base salary only) on an after-tax basis.\n\n\nUnited Kingdom\n\n\nLegacy Willis\n – This plan covers approximately 400 WTW employees in the U.K. The plan is now closed to new entrants. New employees in the U.K. are offered the opportunity to join a defined contribution plan.\n\n\nLegacy Towers Watson\n – Benefit accruals earned under the Legacy Watson Wyatt defined benefit plan (predominantly pension benefits) ceased on February 28, 2015, although benefits earned prior to January 1, 2008 retain a link to salary until the employee leaves the Company. Benefit accruals earned under the legacy Towers Perrin defined benefit plan (predominantly lump sum benefits) were frozen on March 31, 2008. All participants now accrue defined contribution benefits.\n\n\nThe determination of the Company’s obligations and annual expense under the plans is based on a number of assumptions that, given the longevity of the plans, are long-term in focus. A change in one or a combination of these assumptions could have a material impact on our projected benefit obligation. However, certain of these changes, such as changes in the discount rates and other actuarial assumptions, are not recognized immediately in net income, but are instead recorded in other comprehensive income. The accumulated gains and losses not yet recognized in net income are amortized into net income as a component of the net periodic benefit cost/(income) over the average remaining service period or average remaining life expectancy, as appropriate, of the plan’s participants to the extent that the net gains or losses as of the beginning of the year exceed 10% of the greater of the market-related value of plan assets or the projected benefit obligation.\n\n\nWTW considers several factors prior to the start of each fiscal year when determining the appropriate annual assumptions, including economic forecasts, relevant benchmarks, historical trends, portfolio composition and peer company comparisons. These assumptions, used to determine our pension liabilities and pension expense, are reviewed annually by senior management and changed when appropriate. A discount rate will be changed annually if underlying rates have moved, whereas an expected long-term return on assets will be changed less frequently as longer-term trends in asset returns emerge or long-term target asset allocations are revised. To calculate the discount rate, we use the granular approach to determining service cost and interest cost. The expected rate of return assumptions for all plans are supported by an analysis of the weighted-average yield expected to be achieved with the anticipated makeup of investments. We have allowed for actual and known inflation in preparing our estimates. Other material assumptions include rates of participant mortality, and the expected long-term rates of compensation and pension increases.\n\n\nFunding is based on actuarially determined contributions and is limited to amounts that are currently deductible for tax purposes, or as agreed to with the plan trustees for the U.K. plans. Since funding calculations are based on different measurements than those used for accounting purposes, pension contributions are not equal to net periodic benefit cost.\n\n\n66\n\n\n\n\n \n\n\nWe recorded a combined $1 million net periodic benefit income for our U.S. and U.K. plans for the year ended December 31, 2024. For the U.S. and U.K. plans, the following table presents our estimated net periodic benefit income for 2025 and the impact to both plans of a 0.25% increase and decrease to both the expected return on assets (‘EROA’) and the discount rate assumptions; and the projected benefit obligations as of December 31, 2024 and the impact of a 0.25% increase and decrease to the discount rates:\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nTotals - \ncurrent estimates\n\n\n \n\n\n \n\n\nImpact of 0.25% change to \nEROA\n\n\n \n\n\n \n\n\nImpact of 0.25% change to \ndiscount rate\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nIncrease\n\n\n \n\n\n \n\n\nDecrease\n\n\n \n\n\n \n\n\nIncrease\n\n\n \n\n\n \n\n\nDecrease\n\n\n \n\n\n\n\n\n\nEstimated 2025 expense:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nU.S. Plans\n\n\n \n\n\n$\n\n\n13\n\n\n \n\n\n \n\n\n$\n\n\n(8\n\n\n)\n\n\n \n\n\n$\n\n\n8\n\n\n \n\n\n \n\n\n$\n\n\n(8\n\n\n)\n\n\n \n\n\n$\n\n\n8\n\n\n \n\n\n\n\n\n\nU.K. Plans\n\n\n \n\n\n$\n\n\n11\n\n\n \n\n\n \n\n\n$\n\n\n(6\n\n\n)\n\n\n \n\n\n$\n\n\n6\n\n\n \n\n\n \n\n\n$\n\n\n(1\n\n\n)\n\n\n \n\n\n$\n\n\n2\n\n\n \n\n\n\n\n\n\nProjected benefit obligation at December 31, 2024:\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nU.S. Plans\n\n\n \n\n\n$\n\n\n3,812\n\n\n \n\n\n \n\n\nN/A\n\n\n \n\n\n \n\n\nN/A\n\n\n \n\n\n \n\n\n$\n\n\n(92\n\n\n)\n\n\n \n\n\n$\n\n\n96\n\n\n \n\n\n\n\n\n\nU.K. Plans\n\n\n \n\n\n$\n\n\n2,236\n\n\n \n\n\n \n\n\nN/A\n\n\n \n\n\n \n\n\nN/A\n\n\n \n\n\n \n\n\n$\n\n\n(65\n\n\n)\n\n\n \n\n\n$\n\n\n68\n\n\n \n\n\n\n\n\n\nEconomic factors and conditions often affect multiple assumptions simultaneously, and the effects of changes in key assumptions are not necessarily linear.\n\n\nGoodwill and Intangible Assets — Impairment Review\n\n\nIn applying the acquisition method of accounting for business combinations, amounts assigned to identifiable assets and liabilities acquired were based on estimated fair values as of the date of acquisition, with the remainder recorded as goodwill. Intangible assets are initially valued at fair value using generally accepted valuation methods appropriate for the type of intangible asset. Intangible assets with definite lives are amortized over their estimated useful lives and are reviewed for impairment if indicators of impairment arise. Intangible assets with indefinite lives are tested for impairment annually as of October 1, and whenever indicators of impairment arise. The fair value of the intangible assets is compared with their carrying value and an impairment loss would be recognized for the amount by which the carrying amount exceeds the fair value. Goodwill is tested for impairment annually as of October 1, and whenever indicators of impairment arise.\n\n\nGoodwill is tested at the reporting unit level, and the Company had seven reporting units as of October 1, 2024. As discussed in Note 3 — Acquisitions and Divestitures within Item 8 of this Annual Report on Form 10-K, in connection with the sale of TRANZACT, completed on December 31, 2024, the Company recorded a $1.0 billion non-cash goodwill impairment charge on the BDA reporting unit. The BDA reporting unit goodwill after impairment is approximately $1.2 billion. After reflecting the sale of TRANZACT, the fair value of the remaining reporting unit is estimated to be significantly in excess of its carrying value. The impairment test for the remaining six reporting units resulted in estimated fair values that were significantly in excess of their carrying values.\n\n\nThe Company continuously monitors and evaluates relevant events and circumstances that could unfavorably impact the significant assumptions noted above, including changes to the regulatory environment, general industry, market and macro-economic conditions and recent market valuations from transactions of comparable companies. It is possible that future changes in such circumstances, or in the inputs or assumptions used in estimating the fair value of the reporting unit, could require the Company to record a non-cash impairment charge.\n\n\nTo perform the test, we used valuation techniques to estimate the fair value of a reporting unit that are under the income and/or market approaches of valuation methods:\n\n\n•\nDiscounted cash flow method \n— Under the discounted cash flow method, an income approach, the business enterprise value is determined by discounting to present value the terminal value which is calculated using debt-free after-tax cash flows for a finite period of years. Key estimates in this approach were internal financial projection estimates prepared by management, assessment of business risk, and expected rates of return on capital.\n\n\n•\nGuideline public company method \n—\n The guideline public company method, a market approach, develops valuation multiples by comparing our reporting units to similar publicly traded companies. Key estimates and determination of valuation multiples rely on the selection of similar companies, obtaining forecast revenue and EBITDA estimates for the similar companies and selection of valuation multiples as they apply to the reporting unit characteristics.\n\n\n•\nGuideline transaction method \n—\n Under the guideline transactions method, a market approach, actual transaction prices and operating data from companies deemed reasonably similar to the reporting units are used to develop valuation multiples as an indication of how much a knowledgeable investor in the marketplace would be willing to pay for the business units.\n\n\n67",
  "item2": null
}