{
  "source_file": "wynn-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management's Discussion and Analysis of Financial Condition and Results of Operations\nThe following discussion should be read in conjunction with, and is qualified in its entirety by, the unaudited condensed consolidated financial statements and the notes thereto included elsewhere in this Quarterly Report on Form 10-Q and the audited consolidated financial statements appearing in our Annual Report on Form 10-K for the year ended December 31, 2024. Unless the context otherwise requires, all references herein to the \"Company,\" \"we,\" \"us,\" or \"our,\" or similar terms, refer to Wynn Resorts, Limited, a Nevada corporation, and its consolidated subsidiaries. This discussion and analysis contains forward-looking statements. Please refer to the section below entitled \"Forward-Looking Statements.\"      \nForward-Looking Statements\nWe make forward-looking statements in this Quarterly Report on Form 10-Q based upon the beliefs and assumptions of our management and on information currently available to us. Forward-looking statements include, but are not limited to, information about our business strategy, development activities, competition and possible or assumed future results of operations, throughout this report and are often preceded by, followed by or include the words \"may,\" \"will,\" \"should,\" \"would,\" \"could,\" \"believe,\" \"expect,\" \"anticipate,\" \"estimate,\" \"intend,\" \"plan,\" \"continue\" or the negative of these terms or similar expressions.\nForward-looking statements are subject to a number of risks and uncertainties that could cause actual results to differ materially from those we express in these forward-looking statements, including the risks and uncertainties in Item 1A — \"Risk Factors\" of our Annual Report on Form 10-K for the year ended December 31, 2024 and other factors we describe from time to time in our periodic filings with the Securities and Exchange Commission (\"SEC\"), such as:\n•\nextensive regulation of our business and the cost of compliance or failure to comply with applicable laws and regulations;\n•\npending or future investigations, litigation and other disputes;\n•\nour dependence on key managers and employees;\n•\nour ability to maintain our gaming licenses and concessions and comply with applicable gaming law; \n•\ninternational relations, national security policies, anticorruption campaigns and other geopolitical events, which may impact the number of visitors to our properties and the amount of money they are willing to spend;\n•\ndisruptions caused by, and the impact on regional demand for casino resorts and inbound tourism and the travel and leisure industry more generally from, events outside of our control, including an outbreak of an infectious disease (such as the COVID-19 pandemic), public incidents of violence, mass shootings, riots, demonstrations, extreme weather patterns or natural disasters, military conflicts, civil unrest, and any future security alerts or terrorist attacks;\n•\npublic perception of our resorts and the level of service we provide; \n•\nour dependence on a limited number of resorts and locations for all of our cash flow and our subsidiaries' ability to pay us dividends and distributions;\n•\ncompetition in the casino/hotel and resort industries and actions taken by our competitors, including new development and construction activities of competitors;\n•\nour ability to maintain our customer relationships and collect and enforce gaming receivables;\n•\nwin rates for our gaming operations;\n•\nconstruction and regulatory risks associated with our current and future construction projects or co-investments in such projects;\n•\nany violations by us of various anti-money laundering laws or the Foreign Corrupt Practices Act;\n•\nour compliance with environmental requirements and potential cleanup responsibility and liability as an owner or operator of property;\n•\nadverse incidents or adverse publicity concerning our resorts or our corporate responsibilities;\n•\nchanges in and compliance with the gaming laws or regulations in the various jurisdictions in which we operate;\n•\nchanges in tax laws or regulations related to taxation, including changes in the rates of taxation;\n•\nour collection and use of personal data and our level of compliance with applicable governmental regulations, credit card industry standards and other applicable data security standards;\n•\ncybersecurity risk, including cyber and physical security breaches, system failure, computer viruses, and negligent or intentional misuse by customers, company employees, or employees of third-party vendors;\n•\nour ability to protect our intellectual property rights; \n28\nTable of Contents\n•\nlabor actions and other labor problems; \n•\nour current and future insurance coverage levels; \n•\nrisks specifically associated with our Macau Operations; \n•\nthe level of our indebtedness and our ability to meet our debt service obligations (including sensitivity to fluctuations in interest rates); and\n•\ncontinued compliance with the covenants in our debt agreements.\nFurther information on potential factors that could affect our business, financial condition, results of operations and cash flows are included elsewhere in this report and our other filings with the SEC. You should not place undue reliance on any forward-looking statements, which are based only on information available to us at the time this statement is made. We undertake no obligation to update or revise any forward-looking statement, whether as a result of new information, future developments or otherwise.\nOverview\nWe are a designer, developer, and operator of integrated resorts featuring luxury hotel rooms, high-end retail space, an array of dining and entertainment options, meeting and convention facilities, and gaming, all supported by an unparalleled focus on our guests, our people, and our community. Through our approximately 72% ownership of Wynn Macau, Limited (\"WML\"), our concessionaire Wynn Resorts (Macau) S.A. (\"Wynn Macau SA\") operates two integrated resorts in the Macau Special Administrative Region of the People's Republic of China (\"Macau\"), Wynn Palace and Wynn Macau (collectively, our \"Macau Operations\"). In Las Vegas, Nevada, we operate and, with the exception of certain retail space, own 100% of Wynn Las Vegas. We are a 50.1% owner and managing member of a joint venture that owns and leases certain retail space at Wynn Las Vegas (the \"Retail Joint Venture\"). We refer to Wynn Las Vegas, Encore, an expansion at Wynn Las Vegas, and the Retail Joint Venture as our Las Vegas Operations. In Everett, Massachusetts, we operate Encore Boston Harbor, an integrated resort.\nThe Company has a 40% equity interest in Island 3 AMI FZ-LLC (\"Island 3\"), an unconsolidated affiliate, which is constructing an integrated resort property (\"Wynn Al Marjan Island\") in Ras Al Khaimah, United Arab Emirates.\nKey Operating Measures\nCertain key operating measures specific to the gaming industry are included in our discussion of our operational performance for the periods for which the Condensed Consolidated Statements of Operations are presented. These key operating measures are presented as supplemental disclosures because management and/or certain investors use these measures to better understand period-over-period fluctuations in our casino and hotel operating revenues. These key operating measures are defined below:\n•\nTable drop in mass market for our Macau Operations is the amount of cash that is deposited in a gaming table's drop box plus cash chips purchased at the casino cage. \n•\nTable drop for our Las Vegas Operations is the amount of cash and net markers issued that are deposited in a gaming table's drop box.\n•\nTable drop for Encore Boston Harbor is the amount of cash and gross markers issued that are deposited in a gaming table's drop box.\n•\nRolling chips are non-negotiable identifiable chips that are used to track turnover for purposes of calculating incentives within our Macau Operations' VIP program.\n•\nTurnover is the sum of all losing rolling chip wagers within our Macau Operations' VIP program. \n•\nTable games win is the amount of table drop or turnover that is retained and recorded as casino revenues.  Table games win is before discounts, commissions and the allocation of casino revenues to rooms, food and beverage and other revenues for services provided to casino customers on a complimentary basis. Table games win does not include poker rake.\n•\nSlot machine win is the amount of handle (representing the total amount wagered) that is retained by us and is recorded as casino revenues. Slot machine win is after adjustment for progressive accruals and free play, but before discounts and the allocation of casino revenues to rooms, food and beverage and other revenues for services provided to casino customers on a complimentary basis.\n•\nPoker rake is the portion of cash wagered by patrons in our poker rooms that is retained by the casino as a service fee, after adjustment for progressive accruals, but before the allocation of casino revenues to rooms, food and beverage and other revenues for services provided to casino customers on a complimentary basis. Poker tables are not included in our measure of average number of table games.\n29\nTable of Contents\n•\nAverage daily rate (\"ADR\") is calculated by dividing total room revenues, including complimentaries (less service charges, if any), by total rooms occupied. \n•\nRevenue per available room (\"REVPAR\") is calculated by dividing total room revenues, including complimentaries (less service charges, if any), by total rooms available. \n•\nOccupancy is calculated by dividing total occupied rooms, including complimentary rooms, by the total rooms available. \nBelow is a discussion of the methodologies used to calculate win percentages at our resorts.\nIn our mass market operations in Macau, customers may purchase cash chips at either the gaming tables or at the casino cage. The measurements from our VIP and mass market operations are not comparable as the measurement method used in our mass market operations tracks the initial purchase of chips at the table and at the casino cage, while the measurement method from our VIP operations tracks the sum of all losing wagers. Accordingly, the base measurement from the VIP operations is much larger than the base measurement from the mass market operations. As a result, the expected win percentage with the same amount of gaming win is lower in the VIP operations when compared to the mass market operations.\nIn our VIP operations in Macau, customers primarily purchase rolling chips from the casino cage and can only use them to make wagers. Winning wagers are paid in cash chips. The loss of the rolling chips in the VIP operations is recorded as turnover and provides a base for calculating VIP win percentage. It is customary in Macau to measure VIP play using this rolling chip method. We typically expect our win as a percentage of turnover from these operations to be within the range of 3.1% to 3.4%. \nIn Las Vegas, customers purchase chips at the gaming tables in exchange for cash and markers. Customers may then redeem markers at the gaming tables or at the casino cage. The cash and markers, net of redemptions, used to purchase chips are deposited in the gaming table's drop box. This is the base of measurement that we use for calculating win percentage. Each type of table game has its own theoretical win percentage. Our expected table games win percentage is 22% to 26%.\nAt Encore Boston Harbor, customers purchase chips at the gaming tables in exchange for cash and markers. Customers may then redeem markers only at the casino cage. The cash and gross markers used to purchase chips are deposited in the gaming table's drop box. This is the base of measurement that we use for calculating win percentage. Each type of table game has its own theoretical win percentage. Our expected table games win percentage is 18% to 22%.\nResults of Operations\nSummary of third quarter 2025 results\nThe following table summarizes our financial results for the periods presented (dollars in thousands, except per share data):\nThree Months Ended September 30,\nNine Months Ended September 30,\n2025\n2024\nIncrease/ (Decrease)\nPercent Change\n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nOperating revenues\n$\n1,833,747 \n$\n1,693,323 \n$\n140,424 \n8.3 \n$\n5,271,941 \n$\n5,289,164 \n$\n(17,223)\n(0.3)\nNet income (loss) attributable to Wynn Resorts, Limited\n88,341 \n(32,053)\n120,394 \n375.6 \n227,306 \n224,106 \n3,200 \n1.4 \nDiluted net income (loss) per share\n0.85 \n(0.29)\n1.14 \n393.1 \n2.18 \n2.02 \n0.16 \n7.9 \nThe increase in operating revenues for the three months ended September 30, 2025 was largely driven by increased operating revenues of $129.2 million at our Macau Operations, despite a one-day closure caused by typhoon Ragasa. \nThe increase in net income attributable to Wynn Resorts, Limited for the three months ended September 30, 2025 was primarily attributable to the increase in operating revenues, as well as a decrease in property charges and other expenses. Property charges and other expenses for the three months ended September 30, 2024 included $130.0 million of forfeitures pursuant to a non-prosecution agreement (the \"NPA\").\n30\nTable of Contents\nFinancial results for the three months ended September 30, 2025 compared to the three months ended September 30, 2024.\nOperating revenues\nThe following table presents our operating revenues (dollars in thousands): \n \nThree Months Ended September 30,\n \n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nOperating revenues\n   Macau Operations:\nWynn Palace\n$\n635,472 \n$\n519,790 \n$\n115,682 \n22.3 \nWynn Macau\n365,513 \n351,957 \n13,556 \n3.9 \n   Total Macau Operations\n1,000,985\n \n871,747\n \n129,238\n \n14.8 \n   Las Vegas Operations\n621,012 \n607,172 \n13,840 \n2.3 \n   Encore Boston Harbor\n211,750 \n214,121 \n(2,371)\n(1.1)\nCorporate and other\n— \n283 \n(283)\nNM\n$\n1,833,747\n \n$\n1,693,323\n \n$\n140,424\n \n8.3 \nNM - Not meaningful.\nThe following table presents our casino and non-casino operating revenues (dollars in thousands):\n \nThree Months Ended September 30,\n \n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nOperating revenues\nCasino revenues\n$\n1,174,717\n \n$\n1,018,754\n \n$\n155,963\n \n15.3 \nNon-casino revenues:\n          Rooms\n270,484 \n284,765 \n(14,281)\n(5.0)\n          Food and beverage\n261,990 \n262,597 \n(607)\n(0.2)\n          Entertainment, retail and other\n126,556 \n127,207 \n(651)\n(0.5)\n            Total non-casino revenues\n659,030\n \n674,569\n \n(15,539)\n(2.3)\n$\n1,833,747\n \n$\n1,693,323\n \n$\n140,424\n \n8.3 \nCasino revenues for the three months ended September 30, 2025 were 64.1% of operating revenues, compared to 60.2% for the same period of 2024. Non-casino revenues for the three months ended September 30, 2025 were 35.9% of operating revenues, compared to 39.8% for the same period of 2024. \nCasino revenues\n    \nCasino revenues increased primarily due to higher mass market table games volume and table games win at our Macau Operations and higher casino volumes at our Las Vegas Operations, resulting in increased table games and slot machine win. \n31\nTable of Contents\nThe table below sets forth our casino revenues and associated key operating measures (dollars in thousands, except for win per unit per day): \n \nThree Months Ended September 30,\n \n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nMacau Operations:\n  Wynn Palace:\nTotal casino revenues\n$\n542,439 \n$\n418,043 \n$\n124,396 \n29.8 \nVIP: \nAverage number of table games\n52 \n57 \n(5)\n(8.8)\nVIP turnover\n$\n3,261,314 \n$\n3,199,140 \n$\n62,174 \n1.9 \nVIP table games win \n$\n152,478 \n$\n97,312 \n$\n55,166 \n56.7 \nVIP win as a % of turnover\n4.68 \n%\n3.04 \n%\n1.64 \nTable games win per unit per day\n$\n32,401 \n$\n18,614 \n$\n13,787 \n74.1 \nMass market: \nAverage number of table games\n247 \n247 \n— \n— \nTable drop\n$\n2,057,789 \n$\n1,694,575 \n$\n363,214 \n21.4 \nTable games win\n$\n465,683 \n$\n404,307 \n$\n61,376 \n15.2 \nTable games win %\n22.6 \n%\n23.9 \n%\n(1.3)\nTable games win per unit per day\n$\n20,714 \n$\n17,801 \n$\n2,913 \n16.4 \nAverage number of slot machines\n653 \n596 \n57 \n9.6 \nSlot machine handle\n$\n710,156 \n$\n577,289 \n$\n132,867 \n23.0 \nSlot machine win\n$\n30,482 \n$\n27,230 \n$\n3,252 \n11.9 \nSlot machine win per unit per day\n$\n513 \n$\n497 \n$\n16 \n3.2 \n  Wynn Macau:\nTotal casino revenues\n$\n314,489 \n$\n296,781 \n$\n17,708 \n6.0 \nVIP: \nAverage number of table games\n17 \n30 \n(13)\n(43.3)\nVIP turnover\n$\n1,019,346 \n$\n1,201,516 \n$\n(182,170)\n(15.2)\nVIP table games win\n$\n29,873 \n$\n43,326 \n$\n(13,453)\n(31.1)\nVIP win as a % of turnover\n2.93 \n%\n3.61 \n%\n(0.68)\nTable games win per unit per day\n$\n18,871 \n$\n15,692 \n$\n3,179 \n20.3 \nMass market: \nAverage number of table games\n238 \n222 \n16 \n7.2 \nTable drop\n$\n1,633,273 \n$\n1,515,462 \n$\n117,811 \n7.8 \nTable games win\n$\n305,761 \n$\n280,044 \n$\n25,717 \n9.2 \nTable games win %\n18.7 \n%\n18.5 \n%\n0.2 \nTable games win per unit per day\n$\n14,139 \n$\n13,713 \n$\n426 \n3.1 \nAverage number of slot machines\n809 \n621 \n188 \n30.3 \nSlot machine handle\n$\n855,707 \n$\n815,319 \n$\n40,388 \n5.0 \nSlot machine win\n$\n25,588 \n$\n24,434 \n$\n1,154 \n4.7 \nSlot machine win per unit per day\n$\n347 \n$\n428 \n$\n(81)\n(18.9)\nPoker rake\n$\n2,722 \n$\n3,205 \n$\n(483)\n(15.1)\nNote: Our casino operations in Macau were closed for a 1-day period in September 2025 due to Typhoon Ragasa.\n32\nTable of Contents\n \nThree Months Ended September 30,\n \n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nLas Vegas Operations:\nTotal casino revenues\n$\n161,576 \n$\n145,186 \n$\n16,390 \n11.3 \nAverage number of table games\n233 \n235 \n(2)\n(0.9)\nTable drop\n$\n652,293 \n$\n580,800 \n$\n71,493 \n12.3 \nTable games win\n$\n150,073 \n$\n135,230 \n$\n14,843 \n11.0 \nTable games win %\n23.0 \n%\n23.3 \n%\n(0.3)\nTable games win per unit per day\n$\n6,994 \n$\n6,256 \n$\n738 \n11.8 \nAverage number of slot machines\n1,573 \n1,620 \n(47)\n(2.9)\nSlot machine handle\n$\n1,818,133 \n$\n1,695,799 \n$\n122,334 \n7.2 \nSlot machine win\n$\n123,500 \n$\n112,771 \n$\n10,729 \n9.5 \nSlot machine win per unit per day\n$\n854 \n$\n757 \n$\n97 \n12.8 \nPoker rake\n$\n5,148 \n$\n4,629 \n$\n519 \n11.2 \nEncore Boston Harbor:\nTotal casino revenues\n$\n156,213 \n$\n158,744 \n$\n(2,531)\n(1.6)\nAverage number of table games\n172 \n179 \n(7)\n(3.9)\nTable drop\n$\n323,981 \n$\n347,082 \n$\n(23,101)\n(6.7)\nTable games win\n$\n66,257 \n$\n74,048 \n$\n(7,791)\n(10.5)\nTable games win %\n20.5 \n%\n21.3 \n%\n(0.8)\nTable games win per unit per day\n$\n4,187 \n$\n4,507 \n$\n(320)\n(7.1)\nAverage number of slot machines\n2,727 \n2,611 \n116 \n4.4 \nSlot machine handle\n$\n1,397,554 \n$\n1,378,066 \n$\n19,488 \n1.4 \nSlot machine win\n$\n110,797 \n$\n105,550 \n$\n5,247 \n5.0 \nSlot machine win per unit per day\n$\n442 \n$\n439 \n$\n3 \n0.7 \nPoker rake\n$\n5,410 \n$\n5,334 \n$\n76 \n1.4 \n33\nTable of Contents\nNon-casino revenues\nThe table below sets forth our room revenues and associated key operating measures: \n \nThree Months Ended September 30,\n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nMacau Operations:\n   Wynn Palace\n:\nTotal room revenues (dollars in thousands)\n$\n37,396 \n$\n49,145 \n$\n(11,749)\n(23.9)\nOccupancy\n98.2 \n%\n98.3 \n%\n(0.1)\nADR\n$\n221 \n$\n295 \n$\n(74)\n(25.1)\nREVPAR\n$\n217 \n$\n289 \n$\n(72)\n(24.9)\n   Wynn Macau:\nTotal room revenues (dollars in thousands)\n$\n21,149 \n$\n23,755 \n$\n(2,606)\n(11.0)\nOccupancy\n98.8 \n%\n98.9 \n%\n(0.1)\nADR\n$\n207 \n$\n233 \n$\n(26)\n(11.2)\nREVPAR\n$\n205 \n$\n230 \n$\n(25)\n(10.9)\nLas Vegas Operations:\nTotal room revenues (dollars in thousands)\n$\n186,712 \n$\n187,123 \n$\n(411)\n(0.2)\nOccupancy\n85.7 \n%\n89.0 \n%\n(3.3)\nADR\n$\n505 \n$\n495 \n$\n10 \n2.0 \nREVPAR\n$\n433 \n$\n441 \n$\n(8)\n(1.8)\nEncore Boston Harbor:\nTotal room revenues (dollars in thousands)\n$\n25,227 \n$\n24,742 \n$\n485 \n2.0 \nOccupancy\n95.5 \n%\n96.9 \n%\n(1.4)\nADR\n$\n431 \n$\n426 \n$\n5 \n1.2 \nREVPAR\n$\n412 \n$\n412 \n$\n— \n— \nRoom revenues decreased $14.3 million, primarily due to lower ADR at our Macau Operations.\n34\nTable of Contents\nOperating expenses\nThe table below presents operating expenses (dollars in thousands):  \n \nThree Months Ended September 30,\n \n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nOperating expenses:\nCasino\n$\n705,421 \n$\n617,469 \n$\n87,952 \n14.2 \nRooms\n86,385 \n83,376 \n3,009 \n3.6 \nFood and beverage\n231,100 \n220,187 \n10,913 \n5.0 \nEntertainment, retail and other\n54,541 \n56,184 \n(1,643)\n(2.9)\nGeneral and administrative\n275,035 \n271,829 \n3,206 \n1.2 \n  Provision for credit losses\n4,505 \n1,836 \n2,669 \n145.4 \nPre-opening\n7,289 \n2,457 \n4,832 \n196.7 \nDepreciation and amortization\n152,828 \n156,273 \n(3,445)\n(2.2)\nProperty charges and other\n6,154 \n150,475 \n(144,321)\n(95.9)\nTotal operating expenses\n$\n1,523,258\n \n$\n1,560,086\n \n$\n(36,828)\n(2.4)\nThe decrease in total operating expenses was primarily due to the decrease in property charges and other expenses at our Las Vegas Operations and Corporate and other, partially offset by an increase in casino expenses at our Macau Operations driven by an increase in gaming tax expense.\nCasino expenses increased $9.6 million and $69.6 million at Wynn Macau and Wynn Palace, respectively, which includes increases of $6.1 million and $59.9 million in gaming tax expense at Wynn Macau and Wynn Palace, respectively, as a result of higher casino revenues. \nFood and beverage expenses increased $7.9 million at Wynn Palace, primarily as a result of increased covers; and $4.8 million at our Las Vegas Operations largely due to higher stock-based compensation expense as a result of stock awards granted in connection with the 20th anniversary of the opening of Wynn Las Vegas (\"20th Anniversary\").\nProperty charges and other expenses for the three months ended September 30, 2025 consisted primarily of asset abandonments and disposals of $4.6 million at our Macau Operations. Property charges and other expenses for the three months ended September 30, 2024 consisted primarily of $130.0 million of forfeitures pursuant to the NPA and the Company's $9.4 million contribution towards a legal settlement. Property charges and other expenses for the three months ended September 30, 2024 also included $12.5 million of contract termination and other costs related to the closure of Wynn Interactive's digital sports betting and casino gaming business.\n35\nTable of Contents\nOther non-operating income and expenses\nInterest expense, net of capitalized interest, decreased $10.3 million due to a decrease in the weighted average debt balance to $11.09 billion for the three months ended September 30, 2025 from $11.40 billion for the three months ended September 30, 2024. In addition, we capitalized interest of $11.6 million and $7.8 million in the three months ended September 30, 2025 and 2024, respectively.\nWe recorded interest income of $16.6 million and $30.7 million in the three months ended September 30, 2025 and 2024, respectively, primarily related to interest earned on cash and cash equivalents held at financial institutions. \nWe incurred a foreign currency remeasurement gain of $33.9 million and $21.3 million for the three months ended September 30, 2025 and 2024, respectively. The impact of the exchange rate fluctuation of the Macau pataca, in relation to the U.S. dollar, on the remeasurements of U.S. dollar denominated debt and other obligations from our Macau-related entities drove the variability between periods. \nWe recorded a loss of $13.2 million for the three months ended September 30, 2025, from change in derivatives fair value, which primarily includes a loss of $18.5 million related to the conversion feature on the WML Convertible Bonds and a gain of $6.1 million related to foreign currency swaps. We recorded a loss of $5.5 million for the three months ended September 30, 2024, from change in derivatives fair value, primarily related to the conversion feature on the WML Convertible Bonds. F\nor more information on the Company's derivative instruments, refer to \nItem 1—\"Notes to Condensed Consolidated Financial Statements,\" Note 7, \"Derivative Instruments.\"\nWe recorded a $0.6 million loss on debt financing transactions for the three months ended September 30, 2025, primarily related to the redemption of the WML 5 1/2% Senior Notes due 2026 (\"2026 WML Senior Notes\"). We recorded a $0.1 million loss on debt financing transactions in the three months ended September 30, 2024 related to the WRF Credit Facility amendment.\nIncome taxes \nWe recorded an income tax expense of $61.1 million and $17.1 million for the three months ended September 30, 2025 and 2024, respectively. The increase in income tax expense for the three months ended September 30, 2025, primarily reflects an increase in the valuation allowance on foreign tax credit carryforwards.\nNet income attributable to noncontrolling interests\nWe recognized net income attributable to noncontrolling interests of $40.1 million and $26.6 million for the three months ended September 30, 2025 and 2024, respectively, primarily related to the noncontrolling interest's share of net income from WML. \n36\nTable of Contents\nFinancial results for the nine months ended September 30, 2025 compared to the nine months ended September 30, 2024.\nOperating revenues\nThe following table presents our operating revenues (dollars in thousands):\nNine Months Ended September 30,\n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nOperating revenues\nMacau Operations:\nWynn Palace\n$\n1,711,042 \n$\n1,654,740 \n$\n56,302 \n3.4 \nWynn Macau\n1,039,286 \n1,100,970 \n(61,684)\n(5.6)\nTotal Macau Operations\n2,750,328\n \n2,755,710\n \n(5,382)\n(0.2)\nLas Vegas Operations\n1,884,930 \n1,872,374 \n12,556 \n0.7 \nEncore Boston Harbor\n636,683 \n644,513 \n(7,830)\n(1.2)\nCorporate and other\n— \n16,567 \n(16,567)\nNM\n$\n5,271,941\n \n$\n5,289,164\n \n$\n(17,223)\n(0.3)\nNM - Not meaningful. \nThe following table presents our casino and non-casino operating revenues (dollars in thousands):\nNine Months Ended September 30,\n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nOperating revenues\nCasino revenues\n$\n3,266,981\n \n$\n3,149,166\n \n$\n117,815\n \n3.7 \nNon-casino revenues: \n          Rooms\n836,058 \n916,700 \n(80,642)\n(8.8)\n          Food and beverage\n772,926 \n810,939 \n(38,013)\n(4.7)\n          Entertainment, retail and other\n395,976 \n412,359 \n(16,383)\n(4.0)\n             Total non-casino revenues \n2,004,960\n \n2,139,998\n \n(135,038)\n(6.3)\n$\n5,271,941\n \n$\n5,289,164\n \n$\n(17,223)\n(0.3)\nCasino revenues for the nine months ended September 30, 2025 were 62.0% of operating revenues, compared to 59.5% for the same period of 2024. Non-casino revenues for the nine months ended September 30, 2025 were 38.0% of operating revenues, compared to 40.5% for the same period of \n2024\n.\n37\nTable of Contents\nCasino revenues\nCasino revenues increased primarily due to higher VIP and mass market table games win at Wynn Palace and higher table games and slot machine win at our Las Vegas Operations, partially offset by decreased VIP and mass market table games win at Wynn Macau during the nine months ended September 30, 2025.\nThe table below sets forth our casino revenues and associated key operating measures (dollars in thousands, except for win per unit per day):   \nNine Months Ended\nSeptember 30,\n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nMacau Operations:\nWynn Palace:\nTotal casino revenues\n$\n1,435,245 \n$\n1,336,788 \n$\n98,457 \n7.4 \nVIP:\nAverage number of table games\n53 \n58 \n(5)\n(8.6)\nVIP turnover\n$\n11,337,407 \n$\n9,930,241 \n$\n1,407,166 \n14.2 \nVIP table games win\n$\n373,481 \n$\n342,024 \n$\n31,457 \n9.2 \nVIP win as a % of turnover\n3.29 \n%\n3.44 \n%\n(0.15)\nTable games win per unit per day\n$\n25,888 \n$\n21,677 \n$\n4,211 \n19.4 \nMass market:\nAverage number of table games\n248 \n245 \n3 \n1.2 \nTable drop\n$\n5,606,241 \n$\n5,215,019 \n$\n391,222 \n7.5 \nTable games win\n$\n1,299,679 \n$\n1,251,039 \n$\n48,640 \n3.9 \nTable games win %\n23.2 \n%\n24.0 \n%\n(0.8)\nTable games win per unit per day\n$\n19,282 \n$\n18,620 \n$\n662 \n3.6 \nAverage number of slot machines\n643 \n592 \n51 \n8.6 \nSlot machine handle\n$\n2,202,840 \n$\n1,815,623 \n$\n387,217 \n21.3 \nSlot machine win\n$\n92,320 \n$\n83,790 \n$\n8,530 \n10.2 \nSlot machine win per unit per day\n$\n528 \n$\n517 \n$\n11 \n2.1 \nWynn Macau:\nTotal casino revenues\n$\n883,419 \n$\n923,851 \n$\n(40,432)\n(4.4)\nVIP:\nAverage number of table games\n23 \n30 \n(7)\n(23.3)\nVIP turnover\n$\n3,438,127 \n$\n3,955,277 \n$\n(517,150)\n(13.1)\nVIP table games win\n$\n79,025 \n$\n122,705 \n$\n(43,680)\n(35.6)\nVIP win as a % of turnover\n2.30 \n%\n3.10 \n%\n(0.80)\nTable games win per unit per day\n$\n12,862 \n$\n14,988 \n$\n(2,126)\n(14.2)\nMass market:\nAverage number of table games\n230 \n222 \n8 \n3.6 \nTable drop\n$\n4,793,914 \n$\n4,801,533 \n$\n(7,619)\n(0.2)\nTable games win\n$\n875,146 \n$\n887,194 \n$\n(12,048)\n(1.4)\nTable games win %\n18.3 \n%\n18.5 \n%\n(0.2)\nTable games win per unit per day\n$\n13,993 \n$\n14,599 \n$\n(606)\n(4.2)\nAverage number of slot machines\n763 \n607 \n156 \n25.7 \nSlot machine handle\n$\n2,718,205 \n$\n2,347,521 \n$\n370,684 \n15.8 \nSlot machine win\n$\n75,148 \n$\n76,604 \n$\n(1,456)\n(1.9)\nSlot machine win per unit per day\n$\n362 \n$\n461 \n$\n(99)\n(21.5)\nPoker rake\n$\n8,778 \n$\n11,831 \n$\n(3,053)\n(25.8)\nNote: Our casino operations in Macau were closed for a 1-day period in September 2025 due to Typhoon Ragasa.\n38\nTable of Contents\nNine Months Ended\nSeptember 30,\n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nLas Vegas Operations:\nTotal casino revenues\n$\n471,071 \n$\n410,023 \n$\n61,048 \n14.9 \nAverage number of table games\n234 \n234 \n— \n— \nTable drop\n$\n1,854,052 \n$\n1,721,435 \n$\n132,617 \n7.7 \nTable games win\n$\n427,109 \n$\n409,336 \n$\n17,773 \n4.3 \nTable games win %\n23.0 \n%\n23.8 \n%\n(0.8)\nTable games win per unit per day\n$\n6,691 \n$\n6,380 \n$\n311 \n4.9 \nAverage number of slot machines\n1,575 \n1,612 \n(37)\n(2.3)\nSlot machine handle\n$\n5,356,473 \n$\n4,840,241 \n$\n516,232 \n10.7 \nSlot machine win\n$\n370,350 \n$\n322,544 \n$\n47,806 \n14.8 \nSlot machine win per unit per day\n$\n861 \n$\n730 \n$\n131 \n17.9 \nPoker rake\n$\n17,583 \n$\n16,652 \n$\n931 \n5.6 \nEncore Boston Harbor:\nTotal casino revenues\n$\n477,246 \n$\n478,504 \n$\n(1,258)\n(0.3)\nAverage number of table games\n172 \n182 \n(10)\n(5.5)\nTable drop\n$\n1,002,226 \n$\n1,072,750 \n$\n(70,524)\n(6.6)\nTable games win\n$\n208,155 \n$\n227,496 \n$\n(19,341)\n(8.5)\nTable games win %\n20.8 \n%\n21.2 \n%\n(0.4)\nTable games win per unit per day\n$\n4,433 \n$\n4,553 \n$\n(120)\n(2.6)\nAverage number of slot machines\n2,721 \n2,612 \n109 \n4.2 \nSlot machine handle\n$\n4,120,102 \n$\n4,201,520 \n$\n(81,418)\n(1.9)\nSlot machine win\n$\n327,752 \n$\n315,773 \n$\n11,979 \n3.8 \nSlot machine win per unit per day\n$\n441 \n$\n441 \n$\n— \n— \nPoker rake\n$\n16,482 \n$\n16,422 \n$\n60 \n0.4 \n39\nTable of Contents\nNon-casino revenues\nThe table below sets forth our room revenues and associated key operating measures:\nNine Months Ended\nSeptember 30,\n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nMacau Operations:\nWynn Palace:\nTotal room revenues (dollars in thousands)\n$\n112,492 \n$\n153,287 \n$\n(40,795)\n(26.6)\nOccupancy\n98.4 \n%\n98.7 \n%\n(0.3)\nADR\n$\n225 \n$\n315 \n$\n(90)\n(28.6)\nREVPAR\n$\n222 \n$\n311 \n$\n(89)\n(28.6)\nWynn Macau:\nTotal room revenues (dollars in thousands)\n$\n66,188 \n$\n76,116 \n$\n(9,928)\n(13.0)\nOccupancy\n99.1 \n%\n99.2 \n%\n(0.1)\nADR\n$\n219 \n$\n251 \n$\n(32)\n(12.7)\nREVPAR\n$\n217 \n$\n249 \n$\n(32)\n(12.9)\nLas Vegas Operations:\nTotal room revenues (dollars in thousands)\n$\n590,561 \n$\n617,071 \n$\n(26,510)\n(4.3)\nOccupancy\n87.4 \n%\n89.3 \n%\n(1.9)\nADR\n$\n527 \n$\n541 \n$\n(14)\n(2.6)\nREVPAR\n$\n461 \n$\n483 \n$\n(22)\n(4.6)\nEncore Boston Harbor:\nTotal room revenues (dollars in thousands)\n$\n66,817 \n$\n70,226 \n$\n(3,409)\n(4.9)\nOccupancy\n92.2 \n%\n94.4 \n%\n(2.2)\nADR\n$\n399 \n$\n410 \n$\n(11)\n(2.7)\nREVPAR\n$\n368 \n$\n387 \n$\n(19)\n(4.9)\nRoom revenues decreased $80.6 million due to lower ADR across all of our properties.\nFood and beverage revenues decreased $38.0 million, primarily due to a decrease in revenues from nightlife venues at our Las Vegas Operations during the nine months ended September 30, 2025. The nine months ended September 30, 2024 included incremental food and beverage revenue at our Las Vegas Operations from Super Bowl-related events. \nEntertainment, retail and other revenues decreased $16.4 million, primarily due to a decrease in operating revenues at Wynn Interactive following the closure of its digital sports betting and casino business in the third quarter of 2024. \n40\nTable of Contents\nOperating expenses\nThe table below presents operating expenses (dollars in thousands):\n \n \nNine Months Ended\nSeptember 30,\n \n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nOperating expenses:\nCasino\n$\n1,983,362 \n$\n1,907,426 \n$\n75,936 \n4.0 \nRooms\n256,524 \n245,991 \n10,533 \n4.3 \nFood and beverage\n656,167 \n647,351 \n8,816 \n1.4 \nEntertainment, retail and other\n174,768 \n190,137 \n(15,369)\n(8.1)\nGeneral and administrative\n831,539 \n808,172 \n23,367 \n2.9 \n  Provision for credit losses\n9,254 \n4,352 \n4,902 \n112.6 \nPre-opening\n23,862 \n6,050 \n17,812 \n294.4 \nDepreciation and amortization\n461,156 \n507,611 \n(46,455)\n(9.2)\nProperty charges and other\n31,631 \n206,238 \n(174,607)\n(84.7)\nTotal operating expenses\n$\n4,428,263\n \n$\n4,523,328\n \n$\n(95,065)\n(2.1)\nThe decrease in total operating expenses was primarily due to a decrease in depreciation and amortization expense at Encore Boston Harbor and Corporate and other and a decrease in property charges and other expenses at our Las Vegas Operations and Corporate and other, partially offset by an increase in casino expenses at Wynn Palace.\nCasino expenses increased $71.4 million at Wynn Palace, including an increase of $56.2 million in gaming tax expense driven by an increase in casino revenue, and $21.2 million at our Las Vegas Operations, primarily driven by higher stock-based compensation expense from stock awards granted in connection the 20th Anniversary. These increases were partially offset by a $12.8 million decrease at Wynn Macau, including a decrease of $19.4 million in gaming tax expense driven by a decrease in casino revenue.\nRoom expenses increased $10.0 million at our Las Vegas Operations, largely due to higher stock-based compensation expense as a result of stock awards granted to employees in connection with the 20th Anniversary.\nEntertainment, retail and other expenses decreased $21.7 million at Corporate and other as a result of decreased operating costs related to Wynn Interactive following the closure of its digital sports betting and casino gaming business in the third quarter of 2024.\nGeneral and administrative expenses increased $23.4 million, primarily due to the one-time cost of the 20th Anniversary celebrations, including higher stock-based compensation expense as a result of stock awards granted in connection with the 20th Anniversary. \nPre-opening expense increased $12.8 million at Corporate and other largely due to pre-opening costs associated with Wynn Al Marjan Island.\nDepreciation and amortization expenses decreased $33.5 million at Encore Boston Harbor as a result of certain assets being fully depreciated five years after the opening of the property in June of 2019, and $15.5 million at Corporate and other as a result of the closure of Wynn Interactive's digital sports betting and casino gaming business in the third quarter of 2024.\nProperty charges and other expenses for the nine months ended September 30, 2025 consisted primarily of $6.6 million and $5.8 million of contract terminations and other expenses at our Las Vegas Operations and Encore Boston Harbor, respectively; and $11.7 million, $3.7 million and $2.8 million of asset abandonments and disposals at our Macau Operations, our Las Vegas Operations and Corporate and other, respectively.\nProperty charges and other expenses for the nine months ended September 30, 2024 consisted primarily of $130.0 million of forfeitures pursuant to the NPA and the Company's $9.4 million contribution towards a legal settlement. Property charges and other expenses for the nine months ended September 30, 2024 also included $12.6 million of asset abandonments at Wynn \n41\nTable of Contents\nPalace, $61.5 million of expensed project costs related to a discontinued development project at Corporate and other and $16.8 million of contract terminations and other costs related to Wynn Interactive, partially offset by a gain of $24.6 million related to the sale of certain Wynn Interactive assets.\nOther non-operating income and expenses\nInterest expense, net of capitalized interest, decreased $55.2 million primarily due to a decrease in the weighted average debt balance to $10.99 billion for the nine months ended September 30, 2025 from $11.58 billion for the nine months ended September 30, 2024, and a decrease in the weighted average interest rate to 5.68% for the nine months ended September 30, 2025 from 5.97% for the nine months ended September 30, 2024. In addition, we capitalized interest of $32.8 million and $13.6 million for the nine months ended September 30, 2025 and \n2024\n, respectively.\nWe recorded interest income of $51.8 million and $105.8 million in the nine months ended September 30, 2025 and \n2024\n, respectively, primarily related to interest earned on cash and cash equivalents held at financial institutions. \nWe incurred a foreign currency remeasurement loss of $10.7 million and a gain of $25.3 million for the nine months ended September 30, 2025 and \n2024\n, respectively. The impact of the exchange rate fluctuation of the Macau pataca, in relation to the U.S. dollar, on the remeasurements of U.S. dollar denominated debt and other obligations from our Macau-related entities primarily drove the variability between periods.\nWe recorded a loss of $43.8 million for the nine months ended September 30, 2025, from change in derivatives fair value, which primarily includes a loss of $28.5 million related to the conversion feature on the WML Convertible Bonds and a loss of $8.4 million related to foreign currency swaps. We recorded a loss of $7.9 million from changes in derivatives fair value for the nine months ended September 30, 2024, primarily related to the interest rate collar on the Retail Term Loan.\nWe recorded a $1.7 million loss on debt financing transactions for the nine months ended September 30, 2025 related to the amendment of the WRF credit facility and the redemption of the 2026 WML Senior Notes. We recorded a $1.7 million loss on debt financing transactions for the nine months ended September 30, 2024, primarily related to the issuance of the 2031 Add-On WRF Senior Notes and the repurchase of the tendered 2025 WLV Senior Notes.\nIncome taxes\nWe recorded income tax expense of $82.7 million and $45.1 million for the nine months ended September 30, 2025 and 2024, respectively. The increase in income tax expense for the nine months ended September 30, 2025 primarily reflects an increase in the valuation allowance on foreign tax credit carryforwards.\nNet income attributable to noncontrolling interests\nWe recognized net income attributable to noncontrolling interests of $59.5 million and $93.3 million for the nine months ended September 30, 2025 and 2024, respectively, primarily related to the noncontrolling interest's share of net income from WML.\n42\nTable of Contents\nSegment Information\nAs further described in Item 1—\"Notes to Condensed Consolidated Financial Statements,\" Note 17, \"Segment Information,\" we use Adjusted Property EBITDAR to manage the operating results of our segments. Adjusted Property EBITDAR is net income (loss) before interest, income taxes, depreciation and amortization, pre-opening expenses, property charges and other expenses, triple-net operating lease rent expense related to Encore Boston Harbor, management and license fees, corporate expenses and other expenses (including intercompany golf course, meeting and convention, and water rights leases), stock-based compensation, change in derivatives fair value, loss on debt financing transactions, and other non-operating income and expenses. Adjusted Property EBITDAR is presented exclusively as a supplemental disclosure because management believes that it is widely used to measure the performance, and as a basis for valuation, of gaming companies. Management uses Adjusted Property EBITDAR as a measure of the operating performance of its segments and to compare the operating performance of its properties with those of its competitors, as well as a basis for determining certain incentive compensation. We also present Adjusted Property EBITDAR because it is used by some investors to measure a company's ability to incur and service debt, make capital expenditures and meet working capital requirements. Gaming companies have historically reported EBITDAR as a supplement to GAAP. In order to view the operations of their casinos on a more stand-alone basis, gaming companies, including us, have historically excluded from their EBITDAR calculations pre-opening expenses, property charges, corporate expenses and stock-based compensation, that do not relate to the management of specific casino properties. However, Adjusted Property EBITDAR should not be considered as an alternative to operating income as an indicator of our performance, as an alternative to cash flows from operating activities as a measure of liquidity, or as an alternative to any other measure determined in accordance with GAAP. Unlike net income (loss), Adjusted Property EBITDAR does not include depreciation or interest expense and therefore does not reflect current or future capital expenditures or the cost of capital. We have significant uses of cash flows, including capital expenditures, triple-net operating lease rent expense related to Encore Boston Harbor, interest payments, debt principal repayments, income taxes and other non-recurring charges, which are not reflected in Adjusted Property EBITDAR. Also, our calculation of Adjusted Property EBITDAR may be different from the calculation methods used by other companies and, therefore, comparability may be limited.\nThe following table summarizes Adjusted Property EBITDAR (dollars in thousands) for Wynn Palace, Wynn Macau, Las Vegas Operations, Encore Boston Harbor, and Corporate and other as reviewed by management and summarized in Item 1—\"Notes to Condensed Consolidated Financial Statements,\" Note 17, \"Segment Information.\" That footnote also presents a reconciliation of Adjusted Property EBITDAR to net income attributable to Wynn Resorts, Limited. \n \nThree Months Ended September 30,\nNine Months Ended September 30,\n \n2025\n2024\nIncrease/ (Decrease)\nPercent Change\n2025\n2024\nIncrease/ (Decrease)\nPercent Change\nWynn Palace\n$\n200,282 \n$\n162,283 \n$\n37,999 \n23.4 \n$\n519,373 \n$\n549,112 \n$\n(29,739)\n(5.4)\nWynn Macau\n107,998 \n100,594 \n7,404 \n7.4 \n294,707 \n333,691 \n(38,984)\n(11.7)\nLas Vegas Operations\n203,413 \n202,720 \n693 \n0.3 \n661,586 \n679,315 \n(17,729)\n(2.6)\nEncore Boston Harbor \n58,394 \n63,018 \n(4,624)\n(7.3)\n179,707 \n188,284 \n(8,577)\n(4.6)\nCorporate and other\n— \n(938)\n938 \nNM\n— \n(4,535)\n4,535 \nNM\nNM - Not meaningful.\nAdjusted Property EBITDAR at Wynn Palace increased $38.0 million for the three months ended September 30, 2025 due to an increase in operating revenues of $115.7 million primarily related to higher casino revenue, partially offset by increased casino expense, inclusive of gaming taxes. Adjusted Property EBITDAR at Wynn Palace decreased $29.7 million for the nine months ended September 30, 2025, primarily due to a decrease in rooms revenue as a result of lower ADR.\nAdjusted Property EBITDAR at Wynn Macau increased $7.4 million for the three months ended September 30, 2025 due to a $13.6 million increase in operating revenues, largely attributable to higher casino revenue, partially offset by increased casino expense, inclusive of gaming taxes. Adjusted Property EBITDAR at Wynn Macau for the nine months ended September 30, 2025 decreased $39.0 million due to a decrease in operating revenues of $61.7 million, largely attributable to lower casino revenue, partially offset by a decrease in casino expense, inclusive of gaming taxes.\nAdjusted Property EBITDAR at our Las Vegas Operations for the three months ended September 30, 2025 increased $0.7 million. Adjusted Property EBITDAR at our Las Vegas Operations decreased $17.7 million for the nine months ended \n43\nTable of Contents\nSeptember 30, 2025, primarily due to a decrease of $48.5 million in non-gaming revenues, partially offset by lower operating expenses. The nine months ended September 30, 2024 included incremental food and beverage revenue from Super Bowl-related events and from outlets undergoing renovations. \nAdjusted Property EBITDAR at Encore Boston Harbor decreased $4.6 million for the three months ended September 30, 2025, primarily due to a $2.4 million decrease in operating revenues, coupled with an increase in operating expenses. Adjusted Property EBITDAR decreased $8.6 million for the nine months ended September 30, 2025, primarily due to a decrease in operating revenues of $7.8 million.\nAdjusted Property EBITDAR at Corporate and other decreased $0.9 million and $4.5 million for the three and nine months ended September 30, 2025, respectively, as a result of ceasing our digital sports betting and casino gaming operations in the third quarter of 2024.\nRefer to the discussions above regarding the specific details of our results of operations. \n44\nTable of Contents\nLiquidity and Capital Resources\nOur cash flows were as follows (in thousands):\n \nNine Months Ended September 30,\nCash Flows - Summary\n2025\n2024\nCash flows from operating activities\n$\n874,637\n \n$\n947,175\n \nCash flows from investing activities: \nCapital expenditures, net of construction payables and retention\n(489,185)\n(292,690)\nInvestments in unconsolidated affiliates\n(236,117)\n(454,980)\nPurchase of investments \n(475,000)\n— \nProceeds from maturity of investments\n— \n850,000 \nPurchase of intangible and other assets\n(536)\n(2,615)\nProceeds from sale of assets and other\n1,107 \n26,797 \nNet cash (used in) provided by investing activities\n(1,199,731)\n126,512\n \nCash flows from financing activities:\nProceeds from issuance of long-term debt\n1,752,812 \n1,283,794 \nRepayments of long-term debt\n(1,763,125)\n(1,251,210)\nRepurchase of common stock\n(379,661)\n(198,249)\nProceeds from exercise of stock options\n457 \n1,017 \nDistribution to noncontrolling interest\n(18,138)\n(10,601)\nDividends paid\n(148,861)\n(112,045)\nFinance lease payments\n(19,210)\n(14,498)\nPayments for financing costs\n(26,446)\n(31,459)\nOther\n(9,142)\n(4,486)\nNet cash used in financing activities\n(611,314)\n(337,737)\nEffect of exchange rate on cash, cash equivalents and restricted cash\n(2,487)\n3,351\n \n(Decrease) increase in cash, cash equivalents and restricted cash\n$\n(938,895)\n$\n739,301\n \nOperating Activities \nOur operating cash flows primarily consist of operating income (excluding depreciation and amortization and other non-cash charges), interest paid and earned, and changes in working capital accounts such as receivables, inventories, prepaid expenses, and payables. Our table games play is a mix of cash play and credit play, while our slot machine play is conducted primarily on a cash basis. A significant portion of our table games revenue is attributable to the play of a limited number of premium customers who gamble on credit. The ability to collect these gaming receivables may impact our operating cash flow for the period. Our rooms, food and beverage, and entertainment, retail and other revenue is conducted on a cash and credit basis. Accordingly, operating cash flows will be impacted by changes in operating income and accounts receivable, net.\nDuring the nine months ended September 30, 2025, the decrease in cash flows from operating activities was primarily due to a decrease in operating income at our Macau Operations.\nInvesting Activities\nOur investing activities primarily consist of project capital expenditures and maintenance capital expenditures associated with maintaining and continually refining our world-class integrated resort properties.\n45\nTable of Contents\nDuring the nine months ended September 30, 2025, we incurred capital expenditures of $188.8 million at our Las Vegas Operations, $132.4 million at Wynn Palace, $48.8 million at Wynn Macau, and $17.9 million at Encore Boston Harbor, primarily related to enhancements at our properties and maintenance capital expenditures, and $101.3 million at Corporate and other primarily related to future development projects. In addition, during the nine months ended September 30, 2025, we invested $236.1 million, including $203.3 million of cash contributions, in the joint venture that is constructing Wynn Al Marjan Island and purchased $475.0 million in investments, comprised of fixed deposits maturing in less than one year.\nDuring the nine months ended September 30, 2024, we incurred capital expenditures of $106.0 million at our Las Vegas Operations, $72.1 million at Wynn Palace, $38.8 million at Wynn Macau, and $27.5 million at Encore Boston Harbor, primarily related to maintenance capital expenditures, and $48.4 million at Corporate and other primarily related to future development projects. In addition, during the nine months ended September 30, 2024, we invested $455.0 million, including $442.7 million of cash contributions, in the joint venture that is constructing Wynn Al Marjan Island and received proceeds of $300.0 million and $550.0 million upon the maturity of our investments in debt securities and fixed deposits, respectively. \nFinancing Activities \nThe below table presents proceeds from the issuance, repayments, and repurchases of the specified debt instruments during the nine months ended September 30, 2025 (in thousands):\nProceeds from issuance \nRepayments and repurchases\nWML 6 3/4% Senior Notes, due 2034 (\"2034 WML Senior Notes\")\n$\n1,000,000 \n$\n— \nWML 5 1/2% Senior Notes, due 2026 (\"2026 WML Senior Notes\")\n— \n1,000,000 \nWRF Credit Facilities:\nWRF Term Loan, due 2027\n— \n763,125 \nWRF Term Loan, due 2030\n752,812 \n— \nTotal \n$\n1,752,812\n \n$\n1,763,125\n \nIn addition, during the nine months ended September 30, 2025, we repurchased shares of our common stock for an aggregate cost of $379.7 million, including 4,365,212 shares of our common stock repurchased pursuant to our publicly announced equity repurchase program for an aggregate cost of $358.2 million. We also made dividend payments of $148.9 million, finance lease payments of $19.2 million, paid $26.4 million for financing costs related to the financing activities above, and used cash of $18.1 million for distributions to noncontrolling interest holders of the Retail Joint Venture.\nThe below table presents proceeds from the issuance, repayments, and repurchases of the specified debt instruments during the nine months ended September 30, 2024 (in thousands):\nProceeds from issuance \nRepayments and repurchases\nWRF 6 1/4% Senior Notes, due 2033\n$\n800,000 \n$\n— \nWRF 7 1/8% Senior Notes, due 2031\n412,000 \n— \nWM Cayman II Revolver, due 2028\n— \n351,787 \nWLV 5 1/2% Senior Notes, due 2025\n— \n796,691 \nWRF Credit Facilities:\nWRF Term Loan, due 2027\n71,794 \n102,732 \nTotal \n$\n1,283,794\n \n$\n1,251,210\n \nIn addition, during the nine months ended September 30, 2024, we repurchased shares of our common stock for an aggregate cost of $198.2 million, including 2,206,113 shares of our common stock repurchased pursuant to our publicly announced equity repurchase program for an aggregate cost of $185.7 million. We also made dividend payments of $112.0 million, finance lease payments of $14.5 million, paid $31.5 million for financing costs related to the financing activities above, and used cash of $10.6 million for distributions to noncontrolling interest holders of the Retail Joint Venture.\n46\nTable of Contents\nCapital Resources\nThe following table summarizes our unrestricted cash and cash equivalents, investments and available revolver borrowing capacity, presented by significant financing entity as of September 30, 2025 (in thousands): \nTotal Cash and Cash Equivalents\nInvestments \n(1)\nRevolver Borrowing Capacity\nWynn Macau, Limited and subsidiaries\n$\n973,301 \n$\n475,000 \n$\n1,355,012 \nWynn Resorts Finance, LLC \n(2)\n228,739 \n— \n1,233,783 \nWynn Resorts, Limited and other\n284,251 \n— \n— \nTotal \n$\n1,486,291\n \n$\n475,000\n \n$\n2,588,795\n \n(1) Investments consist of fixed deposits maturing in less than one year. \n(2) Excluding Wynn Macau, Limited and subsidiaries.\nWynn Macau, Limited and subsidiaries\n. WML generates cash from our Macau Operations and may utilize proceeds from the WM Cayman II Revolver as needed. We expect to use this cash to service our WML Senior Notes, WM Cayman II Revolver, and WML Convertible Bonds, to pay dividends to shareholders of WML (of which we own approximately 72%), and to fund working capital and capital expenditure requirements at WML and our Macau Operations.\nWe expect to make estimated project capital expenditures of between $200 million and $250 million during 2025 and between $450 million and $500 million during 2026 related to enhancements at our Macau Operations. We expect to make maintenance capital expenditures at our Macau Operations of between $70 million and $80 million during 2025.\nWML is a holding company and, as a result, its ability to pay dividends to WRF is dependent on WML receiving distributions from its subsidiaries. WML, as guarantor under the WM Cayman II Revolver facility agreement, may be subject to certain restrictions on payments of dividends or distributions to its shareholders, unless certain financial criteria have been satisfied. The WM Cayman II Revolver facility agreement contains representations, warranties, covenants and events of default customary for similar financings, including, but not limited to, restrictions on indebtedness to be incurred by WM Cayman II or its subsidiaries.\nIn June 2025, WML paid a cash dividend of HK$0.185 per share on its common stock for a total U.S. dollar equivalent of approximately $124.0 million in respect of the year ended December 31, 2024. Our share of this dividend was $88.5 million.\nIn September 2025, WML paid a cash dividend of \nHK$0.185 per share on its common stock for a total U.S. dollar equivalent of $125.0 million in respect of the six months ended June 30, 2025. Our share of this dividend was $89.2 million.\nIn July 2025, WM Cayman II increased borrowing capacity under the WM Cayman II Revolver by an additional aggregate amount of $1.0 billion equivalent through the exercise of an accordion feature under the existing facility agreement. As a result, the total committed amount of the WM Cayman II Revolver has increased to $2.5 billion equivalent. In connection with the exercise of the accordion feature on the WM Cayman II Revolver, we recorded debt issuance costs of $11.6 million.\nIn August 2025, WML issued $1.0 billion aggregate principal amount of the 2034 WML Senior Notes. The 2034 WML Senior Notes were issued at par for proceeds of $989.0 million, net of $11.0 million of related fees and expenses. \nIn September 2025, we redeemed in full the outstanding $1.0 billion aggregate principal amount of 2026 WML Senior Notes using net proceeds from the issuance of the 2034 WML Senior Notes, along with cash on hand, at a price equal to 100% of the principal amount.\nIf our portion of cash available for repatriation was repatriated on September 30, 2025, it would be subject to minimal U.S. taxes. \n47\nTable of Contents\nWynn Resorts Finance, LLC and subsidiaries.\n Wynn Resorts Finance, LLC (\"WRF\" or \"Wynn Resorts Finance\") generates cash from distributions from its subsidiaries, which include our Macau Operations, Wynn Las Vegas, and Encore Boston Harbor, and capital contributions from Wynn Resorts, as required. In addition, WRF may utilize its available revolving borrowing capacity as needed. We expect to use this cash to service our WRF Credit Facilities, the WRF Senior Notes, and the Wynn Las Vegas Senior Notes, to pay dividends or distributions to Wynn Resorts, and to fund working capital and capital expenditure requirements as needed.\nWe expect to make estimated project capital expenditures of between $200 million and $225 million during 2025 and between $375 million and $400 million during 2026 related to enhancements at our Las Vegas Operations. We expect to make maintenance capital expenditures at our Las Vegas Operations and Encore Boston Harbor of between $90 million and $115 million, on a combined basis, during 2025.\nWRF is a holding company and, as a result, its ability to pay dividends or distributions to Wynn Resorts is dependent on WRF receiving distributions from its subsidiaries. The WRF Credit Agreement contains customary negative and financial covenants, including, but not limited to, covenants that restrict WRF's ability to pay dividends or distributions and incur additional indebtedness.\nIn June 2025, WRF and certain of its subsidiaries entered into an amendment (the \"WRF Credit Facility Amendment\") to its existing credit agreement. The WRF Credit Facility Amendment (i) extends the final maturity date with respect to all or a portion of the term loan commitments from September 20, 2027 to June 12, 2030, (ii) extends the termination date with respect to all or a portion of the existing revolving commitments and the maturity date with respect to the corresponding revolving commitments from September 20, 2027 to June 12, 2030 and (iii) allows for $500.0 million of incremental extended revolving commitments with a stated maturity date of June 12, 2030.\nWynn Resorts, Limited and other subsidiaries.\n Wynn Resorts, Limited is a holding company and, as a result, our ability to pay dividends is dependent on our ability to obtain funds and our subsidiaries' ability to provide funds to us. Wynn Resorts, Limited and other primarily generates cash from royalty (including intellectual property license) and management agreements with our resorts, dividends and distributions from our subsidiaries, and the operations of the Retail Joint Venture of which we own 50.1%. Fees payable by Wynn Macau SA to Wynn Resorts, Limited under its intellectual property license agreement are capped at $150.0 million for the year ending December 31, 2025. We expect to use cash held by Wynn Resorts, Limited and other to service our Retail Term Loan, to fund working capital needs of our subsidiaries, pay dividends, make required capital contributions to the entity which owns Wynn Al Marjan Island, and for general corporate purposes.\nDuring the third quarter of 2025, the Company contributed $93.9 million of cash into Island 3, bringing our life-to-date cash contributions to $835.0 million. We estimate our remaining 40% pro-rata share of the required equity for the construction of the Wynn Al Marjan Island integrated resort is between $500 million and $575 million, inclusive of capitalized interest, fees, and certain improvements on the Island. Wynn Al Marjan Island is currently expected to open in 2027. \nIsland 3 has partnered with Aman Group, a developer and operator of hotels, resorts and branded residences, to construct a second development adjacent to Wynn Al Marjan Island, which will feature a 132-room hotel and a residential tower with one- to five- bedroom units and a limited collection of standalone villas (“Janu Al Marjan Island”). Janu Al Marjan Island, expected to open in late 2028, will be managed and operated by Aman Group and will offer a variety of guest experiences. The Company’s estimated capital contributions to Island 3 for the construction of the Janu Al Marjan Island are between $25 million and $50 million, net of estimated branded residence sales and estimated 50% loan-to-cost financing to fund project costs.\nThe Company paid a cash dividend of $0.25 per share in each of the quarters ended March 31, 2025, June 30, 2025, and September 30, 2025, and recorded $26.6 million, $26.1 million, $25.9 million in the quarters ended March 31, 2025, June 30, 2025, and September 30, 2025, respectively, against accumulated deficit.\nOn November 6, 2025, the Company announced that its Board of Directors declared a cash dividend of $0.25 per share, payable on November 26, 2025 to stockholders of record as of November 17, 2025.\nOther Factors Affecting Liquidity \nWe may refinance all or a portion of our indebtedness on or before maturity. We cannot assure you that we will be able to refinance any of the indebtedness on acceptable terms or at all.\n48\nTable of Contents\nLegal proceedings in which we are involved also may impact our liquidity. No assurance can be provided as to the outcome of such proceedings. In addition, litigation inherently involves significant costs. For information regarding legal proceedings, see Note 15, \"Commitments and Contingencies.\"\nIn November 2024, the Company’s Board of Directors authorized an increase in the amount of the Company's outstanding shares of common stock available for repurchase under the previously available repurchase authorization to $1.00 billion. The equity repurchase program authorizes discretionary repurchases by the Company from time to time through open market purchases, including pursuant to plans designed to comply with Rule 10b5-1 under the Securities Exchange Act of 1934, as amended, privately negotiated transactions, accelerated share repurchases, or block trades, subject to market conditions, applicable legal requirements and other factors. The repurchase authorization has no expiration date, and the equity repurchase program may be suspended, discontinued or accelerated at any time. As of September 30, 2025, we had $454.9 million in repurchase authority remaining under the program.\nWe have in the past repurchased, and in the future, we may periodically consider repurchasing our outstanding notes for cash. The amount of any shares and/or notes to be repurchased, as well as the timing of any repurchases, will be based on business, market and other conditions and factors, including price, contractual requirements or consents, and capital availability.\nNew business developments or other unforeseen events may occur, resulting in the need to raise additional funds. We continue to explore opportunities to develop additional gaming or related businesses in domestic and international markets. There can be no assurances regarding the business prospects with respect to any other opportunity. Any new development may require us to obtain additional financing. We may decide to conduct any such development through Wynn Resorts, Limited or through subsidiaries separate from the Las Vegas, Boston or Macau-related entities.\nContractual Commitments \nDuring \nthe nine months ended September 30, 2025, \nexcept as described below, there have been no material changes to the contractual obligations previously reported in our Annual Report on Form 10-K for the year ended \nDecember 31, 2024\n. \nAs a result of the financing transactions described in our discussion of capital resources above, our long-term debt obligations will decrease by $10.3 million in the remainder of 2025, $1.03 billion in 2026, $652.4 million in 2027 and will increase by $37.6 million in each of 2028 and 2029, and $1.64 billion thereafter. As of September 30, 2025, our annual fixed interest payments are expected to increase by $39.3 million in 2026, $67.5 million in each of 2027, 2028, and 2029, and $303.8 million thereafter. Our variable interest payments are expected to decrease by $0.2 million in the remainder of 2025 and increase by $1.8 million in 2026, $13.5 million in 2027, $42.6 million in 2028, $40.3 million in 2029, and $30.8 million thereafter.\nOff Balance Sheet Arrangements \nIn February 2025, Wynn Al Marjan Island FZ-LLC, a wholly-owned subsidiary of Island 3, an unconsolidated affiliate, entered into a facility agreement which provides a $2.4 billion (or equivalent in local currency) delayed draw secured term loan facility to finance the development of Wynn Al Marjan Island (the \"Al Marjan Facility\"). The Company is not a party to the Al Marjan Facility agreement, but entered into a guarantee in favor of the secured parties under the Al Marjan Facility agreement. For additional information, refer to Note 15, \"Commitments and Contingencies\" of Part I in this Quarterly Report on Form 10-Q.\nCritical Accounting Policies and Estimates\nA description of our critical accounting policies is included in Item 7 of our Annual Report on Form 10-K for the year ended December 31, 2024. There have been no significant changes to these policies for the nine months ended September 30, 2025.\nRecently Adopted Accounting Standards and Accounting Standards Issued But Not Yet Adopted\nSee related disclosure in Note 2, \"Basis of Presentation and Significant Accounting Policies\" of Part I in this Quarterly Report on Form 10-Q.\n49\nTable of Contents"
}