{
  "item1": "addition, Wynn Las Vegas offers 34 food beverage outlets, approximately 178,000 square feet high-end, brand-name retail space, approximately 513,000 square feet meeting convention space, golf course. nightlife entertainment offerings Wynn Las Vegas include two nightclubs beach club, two theaters presenting exclusive theatrical production various headliner entertainment act. Encore Boston Harbor June 23, 2019, opened Encore Boston Harbor, integrated resort Everett, Massachusetts, adjacent Boston along Mystic River. property features approximately 210,000 square feet casino space 172 table games, 24 poker tables approximately 2,724 slot machines, private high-limit gaming areas, sports book.",
  "item7": "NM - Not meaningful. increase total operating expenses primarily due increased operating costs associated higher business volumes properties, partially offset decreased operating expenses related Wynn Interactive following closure Wynn Interactive's digital sports betting casino gaming business. Casino expenses increased $194.4 million $133.4 million Wynn Palace Wynn Macau, respectively. These increases resulted higher operating costs, including increases $166.5 million $114.7 million incremental gaming tax expense Wynn Palace Wynn Macau, respectively, driven increase casino revenues.",
  "item2": "Item 2. Management's Discussion Analysis Financial Condition Results Operations Forward-Looking Statements extensive regulation business cost compliance failure comply applicable laws regulations; pending future investigations, litigation other disputes; dependence key managers employees; ability maintain gaming licenses concessions comply applicable gaming law; international relations, national security policies, anticorruption campaigns other geopolitical events, which may impact number visitors properties amount money they willing spend; disruptions caused by, impact regional demand casino resorts inbound tourism travel leisure industry more generally from, events outside control, including outbreak infectious disease (such COVID-19 pandemic), public incidents violence, mass shootings, riots, demonstrations, extreme weather patterns natural disasters, military conflicts, civil unrest, any future security alerts terrorist attacks; public perception resorts level service provide; dependence limited number resorts locations all cash flow subsidiaries' ability pay us dividends distributions; competition casino/hotel resort industries actions taken competitors, including new development construction activities competitors; ability maintain customer relationships collect enforce gaming receivables; win rates gaming operations; construction regulatory risks associated current future construction projects co-investments such projects; any violations us various anti-money laundering laws Foreign Corrupt Practices Act; compliance environmental requirements potential cleanup responsibility liability owner operator property; adverse incidents adverse publicity concerning resorts corporate responsibilities; changes compliance gaming laws regulations various jurisdictions which operate; changes tax laws regulations related taxation, including changes rates taxation; collection use personal data level compliance applicable governmental regulations, credit card industry standards other applicable data security standards; cybersecurity risk, including cyber physical security breaches, system failure, computer viruses, negligent intentional misuse customers, company employees, employees third-party vendors; ability protect intellectual property rights; labor actions other labor problems; current future insurance coverage levels; risks specifically associated Macau Operations; level indebtedness ability meet debt service obligations (including sensitivity fluctuations interest rates); continued compliance covenants debt agreements. Further information potential factors could affect business, financial condition, results operations cash flows included elsewhere report other filings SEC. should not place undue reliance any forward-looking statements, which based only information available us time statement made."
}