{
  "source_file": "xel-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1 — BUSINESS\nDefinitions of Abbreviations\nXcel Energy Inc.’s Subsidiaries and Affiliates (current and former)\nCapital Services\nCapital Services, LLC\nEloigne\nEloigne Company\ne prime\ne prime inc.\nNicollet Project Holdings\nNicollet Project Holdings, LLC\nNSP-Minnesota\nNorthern States Power Company, a Minnesota corporation\nNSP System\nThe electric production and transmission system of NSP-Minnesota and NSP-Wisconsin operated on an integrated basis and managed by NSP-Minnesota\nNSP-Wisconsin\nNorthern States Power Company, a Wisconsin corporation\nPSCo\nPublic Service Company of Colorado\nSPS\nSouthwestern Public Service Co.\nUtility subsidiaries\nNSP-Minnesota, NSP-Wisconsin, PSCo and SPS\nWGI\nWestGas InterState, Inc.\nWYCO\nWYCO Development, LLC\nXcel Energy\nXcel Energy Inc. and its subsidiaries\nFederal and State Regulatory Agencies\nCPUC\nColorado Public Utilities Commission\nDOC\nMinnesota Department of Commerce\nDOE\nUnited States Department of Energy\nDOT\nUnited States Department of Transportation\nEPA\nUnited States Environmental Protection Agency\nERCOT\nElectric Reliability Council of Texas\nFASB\nFinancial accounting standards board\nFERC\nFederal Energy Regulatory Commission\nIRS\nInternal Revenue Service\nMPUC\nMinnesota Public Utilities Commission\nMPSC\nMichigan Public Service Commission\nNDPSC\nNorth Dakota Public Service Commission\nNERC\nNorth American Electric Reliability Corporation\nNIST\nNational Institute of Standards and Technology\nNMPRC\nNew Mexico Public Regulation Commission\nNRC\nNuclear Regulatory Commission\nOAG\nMinnesota Office of Attorney General\nPHMSA\nPipeline and Hazardous Materials Safety Administration\nPSCW\nPublic Service Commission of Wisconsin\nPUCT\nPublic Utility Commission of Texas\nSDPUC\nSouth Dakota Public Utility Commission\nSEC\nSecurities and Exchange Commission\nElectric, Purchased Gas and Resource Adjustment Clauses\nCIP\nConservation improvement program\nDSM\nDemand side management\nFCA\nFuel clause adjustment\nGCA\nGas cost adjustment\nRES\nRenewable energy standard \nOther\nADIT\nAccumulated deferred income taxes\nAFUDC\nAllowance for funds used during construction\nALJ\nAdministrative law judge\nARO\nAsset retirement obligation\nARRR\nApplication for rehearing, reargument or reconsideration\nASC\nFinancial Accounting Standards Board Accounting Standards Codification\nASU\nAccounting standards update\nATM\nAt-the-market\nC&I\nCommercial and industrial\nCapX2020\nAlliance of electric cooperatives, municipals and investor-owned utilities in the upper Midwest involved in a joint transmission line planning and construction effort\nCCR\nCoal combustion residuals\nCCR Rule\nFinal rule (40 CFR 257.50 - 257.107) published by the EPA regulating the management, storage and disposal of CCRs as a nonhazardous waste\nCDD\nCooling degree-days\nCEO\nChief executive officer\nCERCLA\nComprehensive Environmental Response, Compensation, and Liability Act\nCFO\nChief financial officer\nCIG\nColorado Interstate Gas Company, LLC\nCON\nCertificate of need\nCO\n2\nCarbon dioxide\nCORE\nCORE Electric Cooperative\nCPCN\nCertificate of public convenience and necessity\nCSPV\nCrystalline silicon photovoltaic\nCWIP\nConstruction work in progress\nDECON\nDecommissioning method where radioactive contamination is removed and safely disposed of at a requisite facility or decontaminated to a permitted level\nDRIP\nDividend Reinvestment Program\nEEI\nEdison Electric Institute\nEMANI\nEuropean Mutual Association for Nuclear Insurance\nEPS\nEarnings per share\nETR\nEffective tax rate\nFTR\nFinancial transmission right\nGAAP\nGenerally accepted accounting principles\nGE\nGeneral Electric\nGHG\nGreenhouse gas\nHDD\nHeating degree-days\nINPO\nInstitute of Nuclear Power Operations\nIRA\nInflation Reduction Act\nIPP\nIndependent power producing entity\nIRP\nIntegrated resource plan\nISO\nIndependent system operator\nITC\nInvestment tax credit\nLP&L\nLubbock Power & Light\nMGP\nManufactured gas plant\nMISO\nMidcontinent Independent System Operator, Inc.\nNative load\nDemand of retail and wholesale customers that a utility has an obligation to serve under statute or contract\nNAV\nNet asset value\nNEIL\nNuclear Electric Insurance Ltd.\nNOL\nNet operating loss\nNOx\nNitrogen oxides\nO&M\nOperating and maintenance\nONES\nOperations, Nuclear, Environmental and Safety\nPFAS\nPer- and polyfluoroalkyl substances\nPIM\nPerformance incentive mechanism\nPost-65\nPost-Medicare\nPPA\nPower purchase agreement\nPre-65\nPre-Medicare\nPSPS\nPublic safety power shutoff\nPTC\nProduction tax credit\nRDF\nRefuse-derived fuel\nREC\nRenewable energy credit\n3\nTable of Contents\n     \nRFP\nRequest for proposal\nROE\nReturn on equity\nROU\nRight-of-use\nRTO\nRegional transmission organization\nS&P\nStandard & Poor’s Global Ratings\nSERP\nSupplemental executive retirement plan\nSMMPA\nSouthern Minnesota Municipal Power Agency\nSPP\nSouthwest Power Pool, Inc.\nSRP\nSystem resiliency plan\nTCJA\n2017 federal tax reform enacted as Public Law No: 115-97, commonly referred to as the Tax Cuts and Jobs Act\nTHI\nTemperature-humidity index\nTSR\nTotal shareholder return\nVaR\nValue at risk\nVIE\nVariable interest entity\nWACC\nWeighted average cost of capital\nWMP\nWildfire mitigation plan\nMeasurements\nBcf\nBillion cubic feet\nKV\nKilovolts\nKWh\nKilowatt hours\nMMBtu\nMillion British thermal units\nMW\nMegawatts\nMWh\nMegawatt hours\nWhere to Find More Information\nXcel Energy’s website address is www.xcelenergy.com. Xcel Energy makes available through its website, free of charge, its annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K and all amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934 as soon as reasonably practicable after the reports are electronically filed with or furnished to the SEC. \nThe SEC maintains an internet site that contains reports, proxy and information statements, and other information regarding issuers that file electronically at http://www.sec.gov. The information on Xcel Energy’s website is not a part of, or incorporated by reference in, this annual report on Form 10-K. Xcel Energy intends to make future announcements regarding Company developments and financial performance through its website, www.xcelenergy.com, as well as through press releases, filings with the SEC, conference calls and webcasts.\nForward-Looking Statements\nExcept for the historical statements contained in this report, the matters discussed herein are forward-looking statements that are subject to certain risks, uncertainties and assumptions. Such forward-looking statements, including those relating to 2025 EPS guidance, long-term EPS and dividend growth rate objectives, future sales, future expenses, future tax rates, future operating performance, estimated base capital expenditures and financing plans, projected capital additions and forecasted annual revenue requirements with respect to rider filings, expected rate increases to customers, expectations and intentions regarding regulatory proceedings, expected pension contributions and expected impact on our results of operations, financial condition and cash flows of interest rate changes, increased credit exposure, and legal proceeding outcomes, as well as assumptions and other statements are intended to be identified in this document by the words “anticipate,” “believe,” “could,” “estimate,” “expect,” “intend,” “may,” “objective,” “outlook,” “plan,” “project,” “possible,” “potential,” “should,” “will,” “would” and similar expressions. Actual results may vary materially. Forward-looking statements speak only as of the date they are made, and we expressly disclaim any obligation to update any forward-looking information. The following factors, in addition to those discussed elsewhere in this Annual Report on Form 10-K for the fiscal year ended Dec. 31, 2024 (including risk factors listed from time to time by Xcel Energy Inc. in reports filed with the SEC, including “Risk Factors” in Item 1A of this Annual Report on Form 10-K), could cause actual results to differ materially from management expectations as suggested by such forward-looking information: operational safety, including our nuclear generation facilities and other utility operations; successful long-term operational planning; commodity risks associated with energy markets and production; rising energy prices and fuel costs; qualified employee workforce and third-party contractor factors; violations of our Codes of Conduct; our ability to recover costs and our subsidiaries’ ability to recover costs from customers; changes in regulation; reductions in our credit ratings and the cost of maintaining certain contractual relationships; general economic conditions, including recessionary conditions, inflation rates, monetary fluctuations, supply chain constraints and their impact on capital expenditures and/or the ability of Xcel Energy Inc. and its subsidiaries to obtain financing on favorable terms; availability or cost of capital; our customers’ and counterparties’ ability to pay their debts to us; assumptions and costs relating to funding our employee benefit plans and health care benefits; our subsidiaries’ ability to make dividend payments; tax laws; uncertainty regarding epidemics; effects of geopolitical events, including war and acts of terrorism; cybersecurity threats and data security breaches; seasonal weather patterns; changes in environmental laws and regulations; climate change and other weather events; natural disaster and resource depletion, including compliance with any accompanying legislative and regulatory changes; costs of potential regulatory penalties and wildfire damages in excess of liability insurance coverage; regulatory changes and/or limitations related to the use of natural gas as an energy source; challenging labor market conditions and our ability to attract and retain a qualified workforce; and our ability to execute on our strategies or achieve expectations related to environmental, social and governance matters including as a result of evolving legal, regulatory and other standards, processes, and assumptions, the pace of scientific and technological developments, increased costs, the availability of requisite financing, and changes in carbon markets.\n4\nTable of Contents\n     \nOverview\nXcel Energy (the “Company”) is a major U.S. regulated electric and natural gas delivery company headquartered in Minneapolis, Minnesota (incorporated in Minnesota in 1909). The Company serves customers in eight states, including portions of Colorado, Michigan, Minnesota, New Mexico, North Dakota, South Dakota, Texas and Wisconsin. Xcel Energy provides a comprehensive portfolio of energy-related products and services to approximately 3.9 million electric customers and 2.2 million natural gas customers through four utility subsidiaries (NSP-Minnesota, NSP-Wisconsin, PSCo and SPS). Along with the utility subsidiaries, the transmission-only subsidiaries, WYCO (a joint venture formed with CIG to develop and lease natural gas pipelines, storage and compression facilities) and WGI (an interstate natural gas pipeline company) comprise the regulated utility operations. The Company’s nonregulated subsidiaries include Eloigne, Capital Services, Venture Holdings and Nicollet Project Holdings.\n \n \n \nSubsidiary / Affiliate\nFunction\nNSP-Minnesota\nElectric & Gas\nNSP-Wisconsin\nElectric & Gas\nPSCo\nElectric & Gas\nSPS\nElectric\nWGI\nInterstate gas pipeline\nWYCO\nGas storage and transportation\nOther Subsidiaries\nSee Note 1 to the consolidated financial statements for further information.\nUtility Subsidiary Overview\nElectric customers\n3.9 million\nNatural gas customers\n2.2 million\nTotal assets\n$70 billion\nElectric generating capacity (owned)\n20,426 MW\nNatural gas storage capacity\n53.3 Bcf\nElectric transmission lines (conductor miles)\n111,000 miles\nElectric distribution lines (conductor miles)\n221,000 miles\nNatural gas transmission lines\n2,100 miles\nNatural gas distribution lines\n38,000 miles\nService Territory \nStrategy\nXcel Energy’s vision is to be the preferred and trusted provider of the energy our customers need. We will deliver on this vision while offering a competitive total return to our shareholders. Our mission is to make energy work better for our customers, helping them thrive every day. \nWe execute on our vision and mission through three strategic priorities.\nOUR CUSTOMERS\nOUR PEOPLE\nOUR PERFORMANCE\nEnhance their experience with Xcel Energy and keep their bills as low as possible\nProvide a rewarding employee experience, with development, engagement and growth\nDeliver excellent operational, financial and clean energy performance\nOur employees are guided by four corporate values: Connected, Committed, Safe and Trustworthy.\nOur values, culture and Code of Conduct serve as the foundation upon which Xcel Energy’s employees, Board of Directors, contractors and suppliers approach their work in delivering on our three strategic priorities.\n5\nTable of Contents\n     \nOUR CUSTOMERS\nXcel Energy has invested more than $2 billion over the past decade in a portfolio of renewable and conservation programs that provide customers with clean energy options and help keep bills low. New demand remains robust in our territories, including load growth from new data centers, industrial electrification and electric vehicle adoption. As such, we are transforming and expanding our electric grid to accommodate load growth, renewable energy and distributed energy resources.\nWe are in the process of installing smart electric meters, which will deliver customer and operational benefits, providing near-real-time communication, allowing customers to know how much energy they are using and what it will cost. In addition, customers will have new digital tools to make it easier to access their energy information, gain useful insights to understand and manage their energy use and make energy choices that lower their bills.\nCustomer affordability is critical to successful strategy execution. Since 2020, our lean operating program has generated nearly $500 million of sustainable savings for our customers, while improving operating outcomes and reducing enterprise risk. At the same time, our Steel for Fuel strategy has saved customers nearly $5 billion since 2017 in avoided fuel costs and PTCs.\nIn turn, we delivered our electric and natural gas products in 2024 at a price that is lower than it was ten years ago on an inflation adjusted basis. Since 2014, our average residential electric bill growth has been 1.7% per year and natural gas bills have declined 0.6% per year on a nominal basis. Additionally, based on available EIA data, the five year average residential electric and natural gas bills for an Xcel Energy customer were 28% and 12% below the national average.\nGoing forward, our goal is to enable the clean energy transition while keeping long-term customer bill growth below the rate of inflation through initiatives including conservation programs, O&M cost control, our One Xcel Energy Way lean management initiative, advanced operational technologies and our Steel for Fuel program. \nWe provide a fundamental service, powering our communities with safe, reliable, competitively priced and increasingly clean energy.\nInvesting in our communities is important to our collective success. We initiated 24 economic development projects for our local communities in 2024, which are projected to create more than $5.1 billion in capital investments and nearly 3,200 jobs. Nearly 59% of our supply chain spend was local. \nApproximately 280 employees served on more than 480 nonprofit organizations or local community boards, providing over 26,000 volunteer hours in 2024. Our annual Day of Service attracted 2,200 people who volunteered over 7,900 combined hours at over 110 nonprofit projects across the company’s service footprint. \nIn 2024, the Xcel Energy Foundation contributed $5 million to 390 nonprofit organizations that support its three charitable giving focus areas of STEM Career Pathways, Environmental Sustainability, and Community Vitality. Through our 2024 Power Your Purpose Giving Campaign, Xcel Energy employees, contractors and retirees donated more than $2 million to over 1,500 nonprofit and community organizations – exceeding our fundraising goal. Combined with the Xcel Energy Foundation match to local United Way chapters, this campaign raised $5 million for our communities.\nOUR PEOPLE\nChampion Safety\nContinuously elevating the quality and safety of the workplace is a top priority. We are considered a benchmark company for our Safety Always approach, focused on eliminating life-altering injuries through a trusted, transparent culture and the use of critical controls. All employees have “stop work authority” and are expected to keep each other, our customers and the public safe. Employees are encouraged to speak up, share experiences and learn from events to help protect themselves, their coworkers and the public.\nThe Board of Directors has oversight for employee and public safety through the Operations, Nuclear, Environmental and Safety committee, both of which are also tied to annual incentive compensation. \nCultivate an Inclusive, Best-in-Class Workforce\nWe aim to create an inclusive work culture where employees are empowered to create innovative solutions, where everyone is respected and there is a collective sense of belonging. We are building a workforce that reflects the broad range of backgrounds, experiences and perspectives within our communities and among our customers. This starts with our Board of Directors.\nThe Board of Directors oversees our workforce strategy, including our inclusion initiatives and employee safety and inclusion KPIs in our management annual incentive plan.\nA total of 70% of annual incentive compensation was tied to safety, system reliability and inclusion metrics. \nManagement evaluates compensation and benefits to maintain a market-competitive, performance-based, shareholder-aligned total rewards package that supports our ability to attract, engage and retain a talented workforce.\nWe partner with educational and community organizations to recruit employees who reflect the communities we serve and live our values. Xcel Energy had 11,380 full-time employees and workforce demographics as of December 2024 were as follows:\nFemale\nEthnically Diverse\nBoard of Directors\n31 \n%\n15 \n%\nCEO direct reports\n38 \n13 \nManagement\n25 \n13 \nEmployees\n23 \n18 \nNew hires\n40 \n28 \nInterns (hired throughout 2024)\n42 \n40 \nXcel Energy respects employees’ freedom of association and their right to collectively organize. As of Dec. 31, 2024, approximately 45% of our employees (5,087) were covered by collective bargaining agreements. \nWe are committed to the advancement and protection of human rights, consistent with U.S. human rights laws and the general principles in the International Labour Organization Conventions.\nAnnual Code of Conduct training is required for all employees and the Board of Directors. We do not tolerate Code of Conduct violations or other unacceptable behaviors. We expect and offer employees multiple avenues to raise concerns or report wrong-doing and do not permit any retaliation. \n6\nTable of Contents\n     \nOUR PERFORMANCE\nDeliver a Competitive Total Return to Investors\nSuccessful strategy execution, along with our disciplined approach to growth, operations and management of environmental, social and governance issues, positions us to continue delivering a competitive TSR.\nWe have consistently achieved our financial objectives, meeting or exceeding our initial ongoing earnings guidance range for 20 consecutive years and delivering dividend growth for 22 consecutive years.\nLeading the Energy Clean Transition\nXcel Energy is committed to maintaining a safe and reliable electric and natural gas system, while leading the clean energy transition. Over the next five years, we plan to make $45 billion of capital investments to improve reliability, resiliency and sustainability. Significant investment in our transmission and distribution systems is essential to ensure resiliency and reliability for customers, we have approximately $28 billion in our 2025 - 2029 capital plan focused specifically on this.\nOur sustainability commitments are summarized as follows:\nSee Item 1A for risks and uncertainties related to strategic and sustainability goals and objectives.\nZero-Carbon Electricity by 2050\nXcel Energy’s operating footprint includes some of the best wind and solar resources in the country, providing for higher capacity factors and lower electricity costs. \nXcel Energy’s wind capacity is now over 11,000 MW, including nearly 4,500 MW of owned wind. In 2024, we completed Phase 1 of our Sherco Solar project in Minnesota. Once Phases 2 and 3 are completed in 2025 and 2026, Sherco Solar’s combined capacity of 710 MW will be one of the largest solar facilities in the country and provide enough clean energy to power 150,000 homes across the upper Midwest. We have 15,000 - 29,000 MW of investment opportunity, through new and extended generation, in development across our NSP, PSCo and SPS footprint. In our base 2025 - 2029 capital investment plan, we have 3,700 MW of new and repowered wind, solar, hybrid and battery storage resources included. \nThrough 2024, we reduced carbon emissions from generation serving customers by an estimated 57% (from 2005 levels) and remain on track to achieve 80% carbon reduction and fully exit coal by the end of 2030. \nNatural Gas Use in Buildings \n–\n Net-Zero GHG by 2050\nRecognizing externalities like the pace of technology development and customer needs, Xcel Energy updated certain interim goals on the path to achieve our 2050 goal to provide net-zero natural gas service from the supply, distribution and end-use natural gas. In 2024 and early 2025, we received approvals for our modified Clean Heat Plan in Colorado and Natural Gas Innovation Plan in Minnesota, which provide starting points for this transition. \nOur net-zero natural gas frameworks include the following priorities:\n•\nOperating a safe, reliable gas system with net-zero methane gas service by 2030.\n•\nOptimize the energy system with electrification-first approaches for new growth by leading voluntary market transformation initiatives.\n•\nProvide customers with a portfolio of solutions to choose from, including natural gas, while ensuring we meet requirements of our regulators.\nElectrification of the Transportation Sector\nWe are also helping reduce carbon emissions in other sectors, including transportation. Similar to our natural gas goals, we revised the interim goals to reflect market considerations for transportation to enable the charging infrastructure for 1.5 million electric vehicles across the areas we serve by 2035. By 2050, our vision remains to run all vehicles in our service area with carbon-free electricity or other clean energy. We have approved clean transportation programs and plans in Colorado, New Mexico, Minnesota and Wisconsin. \nWildfire Resiliency and Mitigation \nProtecting our customers and our system from the threats of extreme weather is a top priority for Xcel Energy. In 2024, we filed an updated Wildfire Mitigation Plan in Colorado and our Resiliency Plan in Texas that integrates industry experience, incorporates evolving risk assessment methodologies, adds new technology and expands the scope, pace and scale of our programs to reduce wildfire risk. We also issued wildfire mitigation plans for each of our other states in 2024. \nIn 2024, we implemented the capability to deliver enhanced, wildfire safety operations and conduct proactive public safety power shutoffs across our entire system. We accelerated pole inspections and replacements on our system and expanded visual coverage of high-risk areas with our PanoAI camera system. We also deployed Technosylva’s advanced risk modelling system enterprise-wide.\nFinally, we are working at both a state and federal level on legislation to enhance the safety of our communities from evolving extreme weather risks while protecting the financial integrity of companies like Xcel Energy.\n7\nTable of Contents\n     \nUtility Subsidiaries \nNSP-Minnesota\nElectric customers\n1.6 million\nNSP-Minnesota conducts business in Minnesota, North Dakota and South Dakota and has electric operations in all three states including the generation, purchase, transmission, distribution and sale of electricity. NSP-Minnesota and NSP-Wisconsin electric operations are managed on the NSP System. NSP-Minnesota also purchases, transports, distributes and sells natural gas to retail customers and transports customer-owned natural gas in Minnesota and North Dakota.\nNatural gas customers\n0.6 million\nTotal assets\n$27.5 billion\nRate Base (estimated)\n$17.4 billion\nGAAP ROE \n9.07%\nOngoing ROE\n9.46%\nElectric generating capacity (owned)\n8,623 MW\nGas storage capacity\n16.9 Bcf\nElectric transmission lines (conductor miles)\n34,000 miles\nElectric distribution lines (conductor miles)\n87,000 miles\nNatural gas transmission lines\n78 miles\nNatural gas distribution lines\n11,000 miles\nNSP-Wisconsin\nElectric customers\n0.3 million\nNSP-Wisconsin conducts business in Wisconsin and Michigan and generates, purchases, transmits, distributes and sells electricity. NSP-Minnesota and NSP-Wisconsin electric operations are managed on the NSP System. NSP-Wisconsin also purchases, transports, distributes and sells natural gas to retail customers and transports customer-owned natural gas. \nNatural gas customers\n0.1 million\nTotal assets\n$4.1 billion\nRate Base (estimated)\n$2.7 billion\nGAAP ROE\n8.98%\nElectric generating capacity (owned)\n500 MW\nGas storage capacity\n4.3 Bcf\nElectric transmission lines (conductor miles)\n12,000 miles\nElectric distribution lines (conductor miles)\n28,000 miles\nNatural gas transmission lines\n3 miles\nNatural gas distribution lines\n3,000 miles\nPSCo\nElectric customers\n1.6 million\nPSCo conducts business in Colorado and generates, purchases, transmits, distributes and sells electricity. PSCo also purchases, transports, distributes and sells natural gas to retail customers and transports customer-owned natural gas.\nNatural gas customers\n1.5 million\nTotal assets\n$26.6 billion\nRate Base (estimated)\n$19.3 billion\nGAAP ROE\n7.63%\nElectric generating capacity (owned)\n6,203 MW\nGas storage capacity\n32.1 Bcf\nElectric transmission lines (conductor miles)\n25,000 miles\nElectric distribution lines (conductor miles)\n82,000 miles\nNatural gas transmission lines\n2,000 miles\nNatural gas distribution lines\n24,000 miles\nSPS\nSPS conducts business in Texas and New Mexico and generates, purchases, transmits, distributes and sells electricity. \nElectric customers\n0.4 million\nTotal assets\n$10.8 billion\nRate Base (estimated)\n$7.6 billion\nGAAP ROE\n9.57%\nElectric generating capacity (owned)\n5,100 MW\nElectric transmission lines (conductor miles)\n41,000 miles\nElectric distribution lines (conductor miles)\n25,000 miles\n8\nTable of Contents\n     \nOperations Overview\nUtility operations are generally conducted as either electric or gas utilities in our four utility subsidiaries.\nElectric Operations\nElectric operations consist of energy supply, generation, transmission and distribution activities across all four utility subsidiaries. Xcel Energy had electric sales volume of 112,273 (millions of KWh), 3.9 million customers and electric revenues of $11,147 million for 2024.\nElectric Operations (percentage of total)\nSales Volume\nNumber of Customers\nRevenues\nResidential\n23 \n%\n86 \n%\n32 \n%\nC&I\n59 \n12 \n49 \nOther\n18 \n2 \n19 \nRetail Sales/Revenue Statistics \n(a)\n2024\n2023\nKWh sales per retail customer\n23,908 \n23,939 \nRevenue per retail customer\n$\n2,357 \n$\n2,464 \nResidential revenue per KWh\n13.82 \n¢\n13.80 \n¢\nC&I revenue per KWh\n8.24 \n¢\n8.82 \n¢\nTotal retail revenue per KWh\n9.86 \n¢\n10.29 \n¢\n(a)\nSee Note 6 to the consolidated financial statements for further information.\nOwned and Purchased Energy Generation — 2024\nElectric Energy Sources\nTotal electric energy generation by source for the year ended Dec. 31: \n9\nTable of Contents\n     \nCarbon-Free\nXcel Energy’s carbon-free energy portfolio includes wind, nuclear, hydroelectric, biomass and solar power from both owned generation facilities and PPAs. Carbon-free percentages will vary year-over-year based on system additions, commodity costs, weather, system demand and transmission constraints.\nSee Item 2 — Properties for further information.\nWind \nWind capacity is shown as net maximum capacity. Net maximum capacity is attainable only when wind conditions are sufficiently available.\nOwned \n— Owned and operated wind farms with corresponding capacity:\nUtility Subsidiary\n2024\n2023\nWind Farms\nCapacity (MW)\nWind Farms\nCapacity (MW)\nNSP System\n17 \n2,445 \n17 \n2,444 \nPSCo\n2 \n1,059 \n2 \n1,059 \nSPS\n2 \n985 \n2 \n985 \nTotal \n21 \n4,489 \n21 \n4,488 \nPPAs \n— Number of PPAs with capacity range:\n \nUtility Subsidiary\n2024\n2023\nPPAs\nRange (MW)\nPPAs\nRange (MW)\nNSP System\n116\n1  — 206 \n120\n1  — 206\nPSCo\n16 \n23  — 301\n17 \n23  — 301\nSPS\n16 \n1  — 250\n16 \n1  — 250\nPPAs \n— Contracted wind capacity (MW) for PPAs:\nUtility Subsidiary\n2024\n2023\nNSP System\n2,061 \n2,066 \nPSCo\n2,996 \n3,026 \nSPS\n1,562 \n1,562 \nAverage Cost \n— Average cost per MWh of wind energy from owned generation and existing PPAs:\nType\nUtility Subsidiary\n2024\n2023\nOwned Generation\n (a)\nNSP System\n$\n7 \n$\n7 \nPPA\nNSP System\n32 \n33 \nOwned Generation\n (a)\nPSCo\n4 \n7 \nPPA\nPSCo\n43 \n42 \nOwned Generation\n (a)\nSPS\n1 \n6 \nPPA\nSPS\n28 \n26 \n(a)\nIncludes the impact of PTCs.\nXcel Energy currently has approximately 1,900 MW of owned wind under development or being repowered. This includes 350 MW of approved repowering projects at the NSP System estimated to be completed in 2025. The Company anticipates approximately 1,550 MW at PSCo as part of the Colorado Resource Plan and anticipates approval of an additional 300 MW of PPAs as part of the Colorado Resource Plan, additions are expected to be placed in service between 2026 - 2028.\nAdditionally, the NSP System anticipates 3,200 MW to be placed in service by 2030, as part of the recently approved Upper Midwest Resource Plan. The RFP process will start in 2025.\nSolar \nOwned \n— Owned and operated solar projects with corresponding capacity:\nUtility Subsidiary\n2024\n2023\nSolar Projects\nCapacity (MW)\nSolar Projects\nCapacity (MW)\nNSP System\n (a)\n1 \n223 \n— \n— \n(a)\nNSP-Minnesota placed in service Sherco Solar 1 in the fourth quarter of 2024. Average cost per MWh will be available after a full year of operations. \nPPAs \n— Solar PPAs capacity by type:\nType\nUtility Subsidiary\nCapacity (MW)\nDistributed Generation\nNSP System\n1,461 \nUtility-Scale\nNSP System\n349 \nDistributed Generation\nPSCo\n1,031 \nUtility-Scale \n(a)\nPSCo\n1,530 \nDistributed Generation\nSPS\n30 \nUtility-Scale\nSPS\n192 \nTotal \n4,593 \n(a)\nIncludes battery storage capacity of 225 MW.\n \nAverage Cost (PPAs) \n— Average cost per MWh of solar energy under existing distributed and utility-scale generation PPAs:\nUtility Subsidiary\n2024\n2023\nNSP System\n$\n100 \n$\n90 \nPSCo\n31 \n34 \nSPS\n68 \n67 \nSolar Development — \nXcel Energy currently has approximately 2,700 MW of owned and PPA solar under development. For the NSP System, this includes 500 MW of solar approved at the Sherco site which are expected to be placed in service in 2025 and 2026. Additionally, various PPAs totaling approximately 105 MW are expected to be completed throughout 2025. Incremental to this amount is 400 MW anticipated as part of the Upper Midwest Resource Plan, to be placed in service by 2030. \nPSCo anticipates development of approximately 1,700 MW of solar generation resources (650 MW company owned, 1,050 MW as PPAs) as part of the Colorado Resource Plan. Colorado Resource Plan additions are expected to be placed in service between 2026 - 2028.\nFor SPS, approximately 450 MW of solar and storage are expected to be placed in service in 2026 and 2027. \nNuclear\nXcel Energy has two nuclear plants with approximately 1,700 MW of total 2024 net summer dependable capacity that safely and reliably generates carbon free electricity for the NSP System. Xcel Energy secures contracts for uranium concentrates, uranium conversion, uranium enrichment and fuel fabrication to operate its nuclear plants. We use varying contract lengths as well as multiple producers for uranium concentrates, conversion services and enrichment services to minimize potential impacts caused by supply interruptions due to geographical and world political issues.\n10\nTable of Contents\n     \nNuclear Fuel Cost — \nDelivered cost per MMBtu of nuclear fuel consumed for owned electric generation and the percentage of total fuel requirements (nuclear, natural gas and coal):\nUtility Subsidiary\nNuclear\nNSP System\nCost\nPercent\n2024\n$\n0.83 \n43 \n%\n2023\n0.76 \n50 \nOther — \nXcel Energy’s other carbon-free energy portfolio includes hydro from owned generating facilities. \nThe NSP System anticipates development of approximately 300 MW of storage capacity at the Sherco site, expected to be placed in service in 2027. Additionally, 600 MW of stand-alone storage are expected to be added as part of the Upper Midwest Resource Plan, to be placed in service by 2030.\nPSCo anticipates development of approximately 1,850 MW of storage capacity (400 MW company owned, 1,450 MW as PPAs) as part of the Colorado Resource Plan. Colorado Resource Plan additions are expected to be placed in service between 2026 - 2028.\nSee Item 2 — Properties for further information.\nFossil Fuel\nXcel Energy’s fossil fuel energy portfolio includes coal and natural gas power from both owned generating facilities and PPAs. \nCoal\nXcel Energy owned and operated coal units with approximately 5,500 MW of total 2024 net summer dependable capacity, which provided 15% of Xcel Energy’s energy mix in 2024. This amount includes the coal units Harrington Units 1-3, which are in the process of being converted to natural gas (net summer dependable capacity of 1,018 MW) and approximately 100 MW derived from RDF and wood fuel sources.\nXcel Energy has plans to retire or convert to natural gas all of its existing coal generation by the end of 2030. Approved early coal plant retirements:\nYear\nUtility Subsidiary\nPlant Unit\nCapacity (MW)\n2025\nPSCo\nComanche 2\n330\n2025\nPSCo\nCraig 1\n42\n(a)\n2025\nPSCo\nPawnee\n (b)\n505\n2026\nNSP-Minnesota\nSherco 1\n680\n2027\nPSCo\nHayden 2\n98\n(a)\n2028\nPSCo\nHayden 1\n135\n(a)\n2028\nPSCo\nCraig 2\n40\n(a)\n2028\nNSP-Minnesota\nA.S. King\n511\n2028\nSPS\nTolk 1\n532\n2028\nSPS\nTolk 2\n535\n2030\nNSP-Minnesota\nSherco 3\n517\n(a)\n2030\nPSCo\nComanche 3\n500\n \n(a)\n(a)\nBased on Xcel Energy’s ownership interest.\n(b)\nReflects planned conversion from coal to natural gas.\nCoal Fuel Cost — \nDelivered cost per MMBtu of coal consumed for owned electric generation and the percentage of fuel requirements (nuclear, natural gas and coal):\nCoal\n \n(a)\nUtility Subsidiary\nCost\nPercent\nNSP System\n2024\n$\n2.24 \n22 \n%\n2023\n2.43 \n29 \nPSCo \n2024\n1.91 \n44 \n2023\n1.57 \n54 \nSPS \n2024\n2.87 \n34 \n2023\n2.73 \n48 \n(a)\nIncludes RDF and wood for the NSP System.\nNatural Gas \nXcel Energy has 22 natural gas plants with approximately 8,000 MW of total 2024 net summer dependable capacity, which provided 33% of Xcel Energy’s mix in 2024. \nNatural gas supplies, transportation and storage services for power plants are procured to provide an adequate supply of fuel. Remaining requirements are procured through a liquid spot market. Generally, natural gas supply contracts have variable pricing that is tied to natural gas indices. Natural gas supply and transportation agreements include obligations for the purchase and/or delivery of specified volumes or payments in lieu of delivery.\nNatural Gas Cost — \nDelivered cost per MMBtu of natural gas consumed for owned electric generation and the percentage of total fuel requirements (nuclear, natural gas and coal):\nNatural Gas\nUtility Subsidiary\nCost\nPercent\nNSP System\n2024\n$\n1.94 \n35 \n%\n2023\n3.91 \n21 \nPSCo \n2024\n2.77 \n56 \n2023\n3.06 \n46 \nSPS \n2024\n0.94 \n66 \n2023\n2.35 \n52 \nThe NSP System anticipates the development of 700 MW of company owned natural gas generation expected to be placed in service between 2025 - 2028.\nPSCo anticipates development of approximately 450 MW of company owned natural gas generation, as part of the Colorado Resource Plan to help ensure resiliency and reliability. Colorado Resource Plan additions are expected to be placed in service between 2026 - 2028.\nIn 2024, SPS converted a total of 339 MW from coal to natural gas related to the Harrington station coal to natural gas repowering project. In January 2025, an additional 341 MW has been converted to natural gas. Through 2025, SPS expects to convert a final 338 MW to natural gas.\n11\nTable of Contents\n     \nCapacity and Demand\nUninterrupted system peak demand and occurrence date:\n2024\n2023\nUtility Subsidiary\nMW\nDate\nMW\nDate\nNSP System \n \n8,822 \nAug. 26\n9,231 \nAug. 23\nPSCo \n7,084 \nAug. 1\n6,909 \nJuly 24\nSPS \n4,437 \nAug. 19\n4,372 \nAug. 17\nTransmission\nTransmission lines deliver electricity at high voltages and over long distances from power sources to substations closer to customers. A strong transmission system ensures continued reliable and affordable service, ability to meet state and regional energy policy goals, and support for a diverse generation mix, including renewable energy. Xcel Energy owns approximately 111,000 conductor miles of transmission lines across its service territory. \nSee Item 2 - Properties for further information.\nDistribution\nDistribution lines allow electricity to travel at lower voltages from substations directly to customers. Xcel Energy has a vast distribution network, owning and operating approximately 221,000 conductor miles of distribution lines across our eight-state service territory.\nSee Item 2 - Properties for further information.\nNatural Gas Operations\nNatural gas operations consist of purchase, transportation and distribution of natural gas to end-use residential, C&I and transport customers in NSP-Minnesota, NSP-Wisconsin and PSCo. Xcel Energy had natural gas deliveries of 387,513 (thousands of MMBtu), 2.2 million customers and natural gas revenues of $2,230 million for 2024\n.\nNatural Gas \n(percentage of total)\nDeliveries\nNumber of Customers\nRevenues\nResidential\n35 \n%\n92 \n%\n58 \n%\nC&I\n24 \n8 \n29 \nTransportation and other\n41 \n<1\n13 \nSales/Revenue Statistics \n(a)\n2024\n2023\nMMBtu sales per retail customer\n105 \n115 \nRevenue per retail customer\n$\n896 \n$\n1,113 \nResidential revenue per MMBtu\n9.48 \n10.54 \nC&I revenue per MMBtu\n7.04 \n8.48 \nTransportation and other revenue per MMBtu\n1.10 \n1.01 \n(a)\nSee Note 6 to the consolidated financial statements for further information.\nCapability and Demand\nNatural gas supply requirements are categorized as firm or interruptible. \nMaximum daily output (firm and interruptible) and occurrence date:\n2024\n2023\nUtility Subsidiary\nMMBtu\nDate\nMMBtu\nDate\nNSP-Minnesota\n841,164 \nJan. 19\n753,642 \nFeb. 3\nNSP-Wisconsin\n163,246 \nJan.17\n158,029 \nJan. 30\nPSCo\n2,357,931 \nJan.15\n2,190,155 \nJan. 30\nNatural Gas Supply and Cost\nXcel Energy seeks natural gas supply, transportation and storage alternatives to yield a diversified portfolio, which increases flexibility and decreases interruption, financial risks and customer rates. In addition, the utility subsidiaries conduct natural gas price hedging activities approved by their states’ commissions. \nAverage delivered cost per MMBtu of natural gas for regulated retail distribution:\nUtility Subsidiary\n2024\n2023\nNSP-Minnesota\n$\n3.97 \n$\n5.31 \nNSP-Wisconsin\n3.77 \n5.26 \nPSCo\n3.36 \n4.91 \nNSP-Minnesota, NSP-Wisconsin and PSCo have natural gas supply transportation and storage agreements that include obligations for purchase and/or delivery of specified volumes or to make payments in lieu of delivery. \nGeneral\nGeneral Economic Conditions\nEconomic conditions may have a material impact on Xcel Energy’s operating results. Management cannot predict the impact of fluctuating energy or commodity prices, pandemics, terrorist activity, war or the threat of war. We could experience a material impact to our results of operations, future growth or ability to raise capital resulting from a sustained general slowdown in economic growth or a significant increase in interest rates or inflation.\nSeasonality\nDemand for electric power and natural gas is affected by seasonal differences in the weather. In general, peak sales of electricity occur in the summer months and peak sales of natural gas occur in the winter months. As a result, the overall operating results may fluctuate substantially on a seasonal basis. Additionally, Xcel Energy’s operations have historically generated less revenues and income when weather conditions are warmer in the winter and cooler in the summer. Sales true-up and decoupling mechanisms mitigate the impacts of weather in certain jurisdictions. \nCompetition\nXcel Energy is subject to public policies that promote competition and development of energy markets. Xcel Energy’s industrial and large commercial customers have the ability to generate their own electricity. In addition, customers may have the option of substituting other fuels or relocating their facilities to a lower cost region. \nCustomers have the opportunity to supply their own power with distributed generation including solar generation and can currently avoid paying for most of the fixed production, transmission and distribution costs incurred to serve them in most jurisdictions. \nSeveral states have incentives for the development of rooftop solar, community solar gardens and other distributed energy resources. Distributed generating resources are potential competitors to Xcel Energy’s electric service business with these incentives and federal tax subsidies.\nThe FERC has continued to promote competitive wholesale markets through open access transmission and other means. Xcel Energy’s wholesale customers can purchase energy from other generation resources and transmission services from other service providers to serve their native load.\n12\nTable of Contents\n     \nFERC Order No. 1000 established competition for ownership of certain new electric transmission facilities under Federal regulations. Some states have state laws that allow the incumbent a Right of First Refusal to own these transmission facilities. \nFERC Order 2222 requires that RTO and ISO markets allow participation of aggregations of distributed energy resources. This order is expected to incentivize distributed energy resource adoption, however implementation is expected to vary by RTO/ISO and the near, medium, and long-term impacts of Order 2222 remain unclear.\nXcel Energy Inc.’s utility subsidiaries have franchise agreements with cities subject to periodic renewal; however, a city could seek alternative means to access electric power or gas, such as municipalization. No municipalization activities are occurring presently. \nWhile each utility subsidiary faces these challenges, Xcel Energy believes their rates and services are competitive with alternatives currently available.\nGovernmental Regulations\nPublic Utility Regulation\nSee Item 7 for discussion of public utility regulation.\nEnvironmental Regulation\nOur facilities are regulated by federal and state agencies that have jurisdiction over air emissions, water quality, wastewater discharges, solid and hazardous wastes or substances. Certain Xcel Energy activities require registrations, permits, licenses, inspections and approvals from these agencies. \nXcel Energy has received necessary authorizations for the construction and continued operation of its generation, transmission and distribution systems. Our facilities strive to operate in compliance with applicable environmental standards and related monitoring and reporting requirements. \nHowever, it is not possible to determine what additional facilities or modifications to existing or planned facilities will be required as a result of changes to regulations, interpretations or enforcement policies or what effect future laws or regulations may have. We may be required to incur expenditures in the future for remediation of historic and current operating sites and other waste treatment, storage and disposal sites. \nThere are significant environmental regulations to encourage use of clean energy technologies and regulate emissions of GHGs. We have undertaken numerous initiatives to meet current requirements and prepare for potential future regulations, reduce GHG emissions and respond to state renewable and energy efficiency goals. Future environmental regulations may result in substantial costs. However, costs to comply with past environmental regulations have largely been recoverable through rates. \nEmerging Environmental Regulation\nClean Air Act\nPower Plant Greenhouse Gas Regulations\n \n—\n In April 2024, the EPA published final rules addressing control of CO\n2\n emissions from the power sector. The rules regulate new natural gas generating units and emission guidelines for existing coal and certain natural gas generation. The rules create subcategories of coal units based on planned retirement date and subcategories of natural gas combustion turbines and combined cycle units based on utilization. The CO\n2\n control requirements vary by subcategory. Based on current estimates and assumptions, Xcel Energy has determined that due to scheduled plant retirements, there is minimal financial or operational impact associated with these requirements and believes that the cost of these initiatives or replacement generation would be recoverable through rates based on prior state commission practices.\nWaste-to-Energy Air Regulations — \nIn January 2024, the EPA proposed air regulations addressing new and existing large municipal waste combustors. The proposed rules lower current emission standards for certain pollutants and would require installation of new pollution controls and/or more intense use of existing pollution controls at French Island Generating Station, Red Wing Generating Plant and Wilmarth Generating Plant. Until final rules are issued, it is not certain what the impact will be on Xcel Energy. Xcel Energy believes that the cost of these initiatives or replacement generation would be recoverable through rates based on prior state commission practices.\nEmerging Contaminants of Concern\nPFAS are man-made chemicals that are widely used in consumer products and can persist and bio-accumulate in the environment. Xcel Energy does not manufacture PFAS, but because PFAS are so ubiquitous in products and the environment, it may impact our operations. \nIn June 2024, the EPA finalized a rule that designated certain PFAS as hazardous substances under CERCLA. In July 2024, the EPA finalized another rule that set enforceable drinking water standards for certain PFAS.\nPotential costs for these rules and any additional proposed regulations related to PFAS are uncertain and will be determined on a site specific basis where applicable. If costs are incurred, Xcel Energy believes the costs will be recoverable through rates based on prior state commission practices.\nEffluent Limitation Guidelines\nIn April 2024, the EPA published final rules under the Clean Water Act, setting Effluent Limitations Guidelines and Standards for steam generating coal plants. This rule establishes more stringent wastewater discharge standards for bottom ash transport water, flue-gas desulfurization wastewater, and combustion residuals leachate from steam electric power plants, particularly coal-fired power plants. Based on current estimates and assumptions, Xcel Energy has determined that there is minimal financial or operational impact associated with these requirements and that any costs would be recoverable through rates based on prior state commission practices. \nEnvironmental Costs\nEnvironmental costs include amounts for nuclear plant decommissioning and payments for storage of spent nuclear fuel, disposal of hazardous materials and waste, remediation of contaminated sites, monitoring of discharges to the environment and compliance with laws and permits with respect to emissions.\n13\nTable of Contents\n     \nCosts charged to operating expenses for nuclear decommissioning, spent nuclear fuel disposal, environmental monitoring and remediation and disposal of hazardous materials and waste and depreciation of previously incurred capital expenditures for environmental improvements were approximately:\n•\n$290 million in 2024.\n•\n$275 million in 2023.\n•\n$365 million in 2022.\nAverage annual expense of approximately $330 million from 2025 – 2029 is estimated for similar costs. The precise timing and amount of environmental costs, including those for site remediation and disposal of hazardous materials, are unknown. Additionally, the extent to which environmental costs will be recovered through rates may fluctuate.\nCapital expenditures for environmental improvements were approximately:\n•\n$25 million in 2024.\n•\n$20 million in 2023.\n•\n$20 million in 2022.\nCertain previously collected nuclear storage costs for the federal nuclear waste program are reimbursed to customers by the federal government as a result of a settlement we pursued regarding the government’s failure to deliver a disposal program. Installments received are reimbursed to customers as approved by the MPUC and other state regulators. \nOther\nOur operations are subject to workplace safety standards under the Federal Occupational Safety and Health Act of 1970 (“OSHA”) and comparable state laws that regulate the protection of worker health and safety. In addition, the Company is subject to other government regulations impacting such matters as labor, competition, data privacy, etc. Based on information to date and because our policies and business practices are designed to comply with all applicable laws, we do not believe the effects of compliance on our operations, financial condition or cash flows are material. \nCapital Spending and Financing\nSee Item 7 for discussion of capital expenditures and funding sources.\nInformation about our Executive Officers \n(a)\nName\nAge\nCurrent and Recent Positions\nTime in Position\nRobert C. Frenzel\n54\nChairman of the Board of Directors, Xcel Energy Inc.\nDecember 2021 — Present\nPresident and Chief Executive Officer and Director, Xcel Energy Inc.\nAugust 2021 — Present\nChief Executive Officer, NSP-Minnesota, NSP-Wisconsin, PSCo and SPS\nAugust 2021 — Present\nPresident and Chief Operating Officer, Xcel Energy Inc. \nMarch 2020 — August 2021\nExecutive Vice President, Chief Financial Officer, Xcel Energy Inc.\nMay 2016 — March 2020\nRobert Berntsen\n55\nExecutive Vice President, Chief Legal and Compliance Officer, Xcel Energy Inc.\nMay 2024 — Present\nSenior Vice President, General Counsel, BHE Renewables, LLC, a development and commercial management of renewable energy projects company\nDecember 2020 — May 2024\nSenior Vice President, General Counsel, Corporate Secretary and Chief Compliance Officer, MidAmerican Energy Company, a regulated electric and gas utility\nMarch 2015 — December 2020\nPatricia Correa\n51\nSenior Vice President, Chief Human Resources Officer, Xcel Energy Inc.\nFebruary 2022 — Present\nSenior Vice President, Human Resources, Eaton Corporation, a power management company\nJuly 2019 — January 2022\nTimothy O’Connor\n65\nExecutive Vice President, Chief Operations Officer, Xcel Energy Inc.\nAugust 2021 — Present\nExecutive Vice President, Chief Generation Officer, Xcel Energy Inc.\nMarch 2020 — August 2021\nSenior Vice President, Chief Nuclear Officer, Xcel Energy Services Inc\nFebruary 2013 — March 2020\nAmanda Rome\n44\nExecutive Vice President, Group President, Utilities, and Chief Customer Officer, Xcel Energy Inc.\nOctober 2023 — Present\nInterim General Counsel, Xcel Energy Inc. \nJanuary 2024 — May 2024\nExecutive Vice President, Chief Legal and Compliance Officer, Xcel Energy Inc.\nJune 2022 — October 2023\nExecutive Vice President, General Counsel, Xcel Energy Inc.\nJune 2020 — June 2022\nVice President and Deputy General Counsel, Xcel Energy Services Inc.\nOctober 2019 — June 2020\nBrian J. Van Abel\n43\nExecutive Vice President, Chief Financial Officer, Xcel Energy Inc. \nMarch 2020 — Present\nSenior Vice President, Finance and Corporate Development, Xcel Energy Services Inc.\nSeptember 2018 — March 2020\n(a)\n \nNo family relationships exist between any of the executive officers or directors.\n14\nTable of Contents",
  "item7": "ITEM 7 — MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nNon-GAAP Financial Measures\nThe following discussion includes financial information prepared in accordance with GAAP, as well as certain non-GAAP financial measures such as ongoing ROE, ongoing earnings and ongoing diluted EPS. Generally, a non-GAAP financial measure is a measure of a company’s financial performance, financial position or cash flows that is adjusted from measures calculated and presented in accordance with GAAP. \nXcel Energy’s management uses non-GAAP measures for financial planning and analysis, for reporting of results to the Board of Directors, in determining performance-based compensation and communicating its earnings outlook to analysts and investors. Non-GAAP financial measures are intended to supplement investors’ understanding of our performance and should not be considered alternatives for financial measures presented in accordance with GAAP. These measures are discussed in more detail below and may not be comparable to other companies’ similarly titled non-GAAP financial measures.\nOngoing ROE\nOngoing ROE is calculated by dividing the net income or loss of Xcel Energy or each subsidiary, adjusted for certain nonrecurring items, by each entity’s average stockholder’s equity. We use these non-GAAP financial measures to evaluate and provide details of earnings results.\nEarnings Adjusted for Certain Items (Ongoing Earnings and Ongoing Diluted EPS)\nGAAP diluted EPS reflects the potential dilution that could occur if securities or other agreements to issue common stock (i.e., common stock equivalents) were settled. The weighted average number of potentially dilutive shares outstanding used to calculate Xcel Energy Inc.’s diluted EPS is calculated using the treasury stock method. Ongoing earnings reflect adjustments to GAAP earnings (net income) for certain items. Ongoing diluted EPS is calculated by dividing the net income or loss of each subsidiary, adjusted for certain items, by the weighted average fully diluted Xcel Energy Inc. common shares outstanding for the period. Ongoing diluted EPS for each subsidiary is calculated by dividing the net income or loss of such subsidiary, adjusted for certain items, by the weighted average fully diluted Xcel Energy Inc. common shares outstanding for the period.\nWe use these non-GAAP financial measures to evaluate and provide details of Xcel Energy’s core earnings and underlying performance. For instance, to present ongoing earnings and ongoing diluted EPS, we may adjust the related GAAP amounts for certain items that are non-recurring in nature. We believe these measurements are useful to investors to evaluate the actual and projected financial performance and contribution of our subsidiaries. These non-GAAP financial measures should not be considered as an alternative to measures calculated and reported in accordance with GAAP. \nThe following table provides a reconciliation of GAAP earnings (net income) to ongoing earnings:\n(Millions of Dollars)\n2024\n2023\nGAAP net income\n$\n1,936 \n$\n1,771 \nLoss on Comanche Unit 3 litigation\n— \n35 \nWorkforce reduction expenses\n— \n72 \nSherco Unit 3 2011 outage refunds\n47 \n— \nLess: tax effect of adjustments\n(13)\n(27)\nOngoing earnings \n(a)\n$\n1,969 \n$\n1,851 \n(a)\nAmounts may not add due to rounding.\nTwelve Months Ended Dec. 31, 2024\nDiluted Earnings (Loss) \nPer Share\nGAAP Diluted EPS\nImpact of Adjustments\nOngoing Diluted EPS\nNSP-Minnesota\n$\n1.41 \n$\n0.06 \n$\n1.47 \nPSCo\n1.39 \n— \n1.39 \nSPS\n0.70 \n— \n0.70 \nNSP-Wisconsin\n0.24 \n— \n0.24 \nEarnings from equity method investments — WYCO\n0.03 \n— \n0.03 \nRegulated utility \n(a)\n3.76 \n0.06 \n3.83 \nXcel Energy Inc. and Other\n(0.33)\n— \n(0.33)\nTotal \n(a)\n$\n3.44 \n0.06 \n$\n3.50 \nTwelve Months Ended Dec. 31, 2023\nDiluted Earnings (Loss) \nPer Share\nGAAP Diluted EPS\nImpact of Adjustments\nOngoing Diluted EPS\nNSP-Minnesota\n$\n1.28 \n$\n0.04 \n$\n1.32 \nPSCo \n(a)\n1.26 \n0.08 \n1.33 \nSPS\n0.70 \n0.01 \n0.71 \nNSP-Wisconsin\n0.25 \n— \n0.25 \nEarnings from equity method investments — WYCO\n0.04 \n— \n0.04 \nRegulated utility \n(a)\n3.52 \n0.14 \n3.66 \nXcel Energy Inc. and Other\n(0.31)\n— \n(0.31)\nTotal \n(a)\n$\n3.21 \n0.14 \n$\n3.35 \n(a)\nAmounts may not add due to rounding.\nAdjustments to GAAP net income include:\nSherco Unit 3 2011 Outage Refunds\n —\n NSP-Minnesota’s Sherco Unit 3 experienced an extended outage following a 2011 incident which damaged its turbine. In 2024, following contested case procedures, Xcel Energy recognized a customer refund of $47 million for replacement power incurred during the outage. \nComanche Unit 3 Litigation\n \n—\n In the third quarter of 2023, PSCo recognized a non-recurring $34 million charge as a result of a jury verdict in Denver County District Court awarding CORE Electric Cooperative lost power damages and other costs.\nWorkforce Reduction\n \n— \nIn 2023, Xcel Energy implemented workforce actions to align resources and investments with our evolving business and customer needs and streamline the organization for long-term success. Xcel Energy initiated a Voluntary Retirement Program, under which approximately 400 eligible non-bargaining employees retired. Xcel Energy also eliminated approximately 150 non-bargaining employees through an involuntary severance program. Workforce reduction expenses of $72 million were recorded in the fourth quarter of 2023. \n25\nTable of Contents\n     \nResults of Operations\nDiluted EPS for Xcel Energy at Dec. 31:\nDiluted Earnings (Loss) Per Share\n2024\n2023\nNSP-Minnesota\n$\n1.41 \n$\n1.28 \nPSCo\n1.39 \n1.26 \nSPS\n0.70 \n0.70 \nNSP-Wisconsin\n0.24 \n0.25 \nEarnings from equity method investments — WYCO\n0.03 \n0.04 \nRegulated utility \n(a)\n3.76 \n3.52 \nXcel Energy Inc. and Other\n(0.33)\n(0.31)\nGAAP Diluted EPS \n(a)\n3.44 \n3.21 \nLoss on Comanche Unit 3 litigation\n— \n0.05 \nWorkforce reduction expenses\n— \n0.09 \nSherco Unit 3 2011 outage refunds\n0.06 \n— \nOngoing Diluted EPS \n(a)\n$\n3.50 \n$\n3.35 \n(a)\nAmounts may not add due to rounding.\nXcel Energy’s management believes that ongoing earnings reflects management’s performance in operating Xcel Energy and provides a meaningful representation of the performance of Xcel Energy’s core business. In addition, Xcel Energy’s management uses ongoing earnings internally for financial planning and analysis, reporting results to the Board of Directors and when communicating its earnings outlook to analysts and investors.\n2024 Comparison with 2023\nXcel Energy\n — GAAP earnings were $3.44 per share compared to $3.21 per share in 2023 and ongoing earnings were $3.50 per share in 2024, compared with $3.35 per share in 2023. The change in EPS was driven by increased recovery of infrastructure investments, partially offset by higher depreciation, interest charges and O&M expenses. \nFluctuations in electric and natural gas revenues associated with changes in fuel and purchased power and/or natural gas sold and transported generally do not significantly impact earnings (changes in costs are offset by the related variation in revenues). \nNSP-Minnesota \n— GAAP earnings increased $0.13 per share and ongoing earnings increased $0.15 per share for 2024 compared to 2023. Ongoing earnings increased due to higher recovery of electric and natural gas infrastructure investments, partially offset by increased depreciation and interest charges. \nPSCo \n— GAAP earnings increased $0.13 per share and ongoing earnings increased $0.06 per share for 2024. Higher ongoing earnings primarily reflects higher recovery of electric and natural gas infrastructure investments, which was partially offset by increased depreciation, O&M and interest charges. \nSPS\n — GAAP earnings were flat and ongoing earnings decreased $0.01 per share for 2024. Ongoing earnings were impacted by increased depreciation, O&M and interest charges, largely offset by regulatory rate outcomes and sales growth.\nNSP-Wisconsin\n — GAAP and ongoing earnings decreased $0.01 per share for 2024. The decrease in ongoing earnings was primarily a result of higher depreciation.\nXcel Energy Inc. and Other\n — Primarily includes financing costs and interest income at the holding company and earnings from investment funds, which are accounted for as equity method investments. The decline in earnings for 2024 is largely due to higher debt levels and increased interest rates, partially offset by a gain on debt repurchases.\nChanges in Diluted EPS\nComponents significantly contributing to changes in 2024 EPS compared with 2023:\nDiluted Earnings (Loss) Per Share\nTwelve Months Ended Dec. 31\nGAAP diluted EPS — 2023\n$\n3.21\n \nComponents of change — 2024 vs. 2023\nElectric regulatory rate outcomes and riders\n0.73 \nHigher other income, net\n0.16 \nNatural gas regulatory rate outcomes and riders\n0.14 \nWorkforce reduction expenses \n0.09 \nLoss on Comanche Unit 3 litigation \n0.05 \nHigher depreciation and amortization\n(0.40)\nInterest charges, net of AFUDC - debt\n(0.24)\nHigher O&M expenses\n(0.13)\nSherco Unit 3 2011 outage refunds\n(0.06)\nOther, net\n(0.11)\nGAAP diluted EPS — 2024\n$\n3.44\n \nSherco Unit 3 2011 outage refunds\n0.06 \nOngoing diluted EPS — 2024\n$\n3.50\n \nROE for Xcel Energy and its utility subsidiaries:\n2024\n2023\nROE\nGAAP ROE\nOngoing ROE\nGAAP ROE\nOngoing ROE\nNSP-Minnesota\n9.07 \n%\n9.46 \n%\n8.82 \n%\n9.11 \n%\nPSCo\n7.63 \n7.63 \n7.32 \n7.77 \nSPS\n9.57 \n9.57 \n9.80 \n9.98 \nNSP-Wisconsin\n8.98 \n8.98 \n10.38 \n10.67 \nUtility Subsidiaries\n8.55 \n8.69 \n8.45 \n8.79 \nXcel Energy\n10.42 \n10.61 \n10.33 \n10.79 \nStatement of Income Analysis\nThe following summarizes the items that affected the individual revenue and expense items reported in the consolidated statements of income.\nEstimated Impact of Temperature Changes on Regulated Earnings \n— Unusually hot summers or cold winters increase electric and natural gas sales, while mild weather reduces electric and natural gas sales. The estimated impact of weather on earnings is based on the number of customers, temperature variances, the amount of natural gas or electricity historically used per degree of temperature and excludes any incremental related operating expenses that could result due to storm activity or vegetation management requirements. As a result, weather deviations from normal levels can affect Xcel Energy’s financial performance. However, electric sales true-up and gas decoupling mechanisms in Minnesota predominately mitigate the positive and adverse impacts of weather in that jurisdiction. \nDegree-day or THI data is used to estimate amounts of energy required to maintain comfortable indoor temperature levels based on each day’s average temperature and humidity.\n26\nTable of Contents\n     \nHDD is the measure of the variation in the weather based on the extent to which the average daily temperature falls below 65° Fahrenheit. CDD is the measure of the variation in the weather based on the extent to which the average daily temperature rises above 65° Fahrenheit. \nEach degree of temperature above 65° Fahrenheit is counted as one CDD, and each degree of temperature below 65° Fahrenheit is counted as one HDD. \nIn Xcel Energy’s more humid service territories, a THI is used in place of CDD, which adds a humidity factor to CDD. HDD, CDD and THI are most likely to impact the usage of Xcel Energy’s residential and commercial customers. Industrial customers are less sensitive to weather.\nNormal weather conditions are defined as either the 10, 20 or 30-year average of actual historical weather conditions. The historical period of time used in the calculation of normal weather differs by jurisdiction, based on regulatory practice. To calculate the impact of weather on demand, a demand factor is applied to the weather impact on sales. Extreme weather variations, windchill and cloud cover may not be reflected in weather-normalized estimates. \nPercentage increase (decrease) in normal and actual HDD, CDD and THI:\n2024 vs.\nNormal\n2023 vs.\nNormal\n2024 vs. 2023\nHDD\n(15.4)\n%\n(7.3)\n%\n(9.8)\n%\nCDD\n28.1 \n5.2 \n23 \nTHI\n(11.2)\n16.0 \n(22.5)\nWeather\n — Estimated impact of temperature variations on EPS compared with normal weather conditions:\n2024 vs. Normal\n2023 vs. Normal\n2024 vs. 2023\nRetail electric\n$\n(0.008)\n$\n0.013 \n$\n(0.021)\nDecoupling and sales true-up\n0.047 \n(0.007)\n0.054 \nElectric total\n$\n0.039 \n$\n0.006 \n$\n0.033 \nFirm natural gas\n(0.070)\n(0.010)\n(0.060)\nDecoupling\n$\n0.027 \n$\n0.013 \n$\n0.014 \nGas total\n$\n(0.043)\n$\n0.003 \n$\n(0.046)\nTotal\n$\n(0.004)\n$\n0.009 \n$\n(0.013)\nSales\n — Sales growth (decline) for actual and weather-normalized sales:\n2024 vs. 2023\nNSP-Minnesota\nPSCo\nSPS\nNSP-Wisconsin\nXcel Energy\nActual\nElectric residential\n(4.1)\n%\n3.9 \n%\n0.7 \n%\n(3.5)\n%\n(0.4)\n%\nElectric C&I\n(2.6)\n— \n9.3 \n(1.9)\n1.7 \nTotal retail electric sales\n(3.1)\n1.3 \n7.8 \n(2.4)\n1.1 \nFirm natural gas sales\n(8.0)\n(6.9)\nN/A\n(7.5)\n(7.2)\n2024 vs. 2023\nNSP-Minnesota\nPSCo\nSPS\nNSP-Wisconsin\nXcel Energy\nWeather-normalized \nElectric residential\n0.2 \n%\n0.9 \n%\n(1.2)\n%\n(1.5)\n%\n0.2 \n%\nElectric C&I\n(1.7)\n(1.1)\n9.3 \n(1.6)\n1.7 \nTotal retail electric sales\n(1.1)\n(0.4)\n7.4 \n(1.5)\n1.3 \nFirm natural gas sales\n(1.1)\n0.6 \nN/A\n(2.5)\n(0.2)\n2024 vs. 2023 (Leap Year Adjusted)\nNSP-Minnesota\nPSCo\nSPS\nNSP-Wisconsin\nXcel Energy\nWeather-normalized \nElectric residential\n(0.1)\n%\n0.7 \n%\n(1.5)\n%\n(1.8)\n%\n(0.1)\n%\nElectric C&I\n(2.0)\n(1.4)\n9.0 \n(1.8)\n1.5 \nTotal retail electric sales\n(1.4)\n(0.7)\n7.1 \n(1.8)\n1.0 \nFirm natural gas sales\n(1.7)\n— \nN/A\n(3.1)\n(0.7)\nAnnual weather-normalized and leap year adjusted electric sales growth (decline)\n•\nNSP-Minnesota — Residential sales declined due to a 1.5% decrease in use per customer, partially offset by a 1.4% increase in customers. The decline in C&I sales was due to lower use per customer, particularly in the manufacturing sector.\n•\nPSCo — Residential sales increased due to a 1.4% increase in customers, partially offset by a 0.7% decrease in use per customer. The decline in C&I sales was attributable to decreased use per customer, particularly in the wholesale trade and mining. \n•\nSPS — Residential sales declined due to a 2.2% decrease in use per customer partially offset by a 0.7% increase in customers. C&I sales increased due to higher use per customer, primarily driven by the energy sector and cryptocurrency mining. \n•\nNSP-Wisconsin — Residential sales declined due to a 2.7% decrease in use per customer, offset by a 1.0% increase in customers. The C&I sales decline was associated with lower use per customer, experienced particularly in the professional services and manufacturing sectors.\nAnnual weather-normalized and leap year adjusted natural gas sales growth (decline)\n•\nNatural gas sales reflect 1.7% residential use per customer and 1.4% C&I use per customer decreases. Partially offsetting these were increased residential and C&I customers in all jurisdictions. \nElectric Revenues\nElectric revenues are impacted by changing sales, fluctuations in the price of natural gas, coal and uranium, regulatory outcomes, market prices and seasonality. In addition, electric customers receive a credit for PTCs generated (wind, nuclear and solar), which reduce electric revenue and income taxes.\n(Millions of Dollars)\n2024 vs. 2023\nRecovery of lower cost of electric fuel and purchase power\n(479)\nPTCs flowed back to customers (offset by lower ETR)\n(302)\nWholesale generation revenues\n(96)\nSherco Unit 3 2011 outage refunds\n(47)\nRegulatory rate outcomes (MN, CO, TX, and NM)\n372 \nNon-fuel riders\n169 \nConservation and demand side management (offset in expense)\n102 \nEstimated impact of weather (net of sales true-up)\n24 \nOther, net\n(42)\nTotal decrease\n$\n(299)\n27\nTable of Contents\n     \nNatural Gas Revenues\nNatural gas revenues vary with changing sales, the cost of natural gas and regulatory outcomes.\n(Millions of Dollars)\n2024 vs. 2023\nRecovery of lower cost of natural gas\n$\n(496)\nEstimated impact of weather (net of decoupling)\n(35)\nRetail sales decline (net of decoupling)\n(1)\nRegulatory rate outcomes (MN, WI, CO, and ND)\n91 \nInfrastructure and integrity riders\n8 \nOther, net\n18 \nTotal decrease\n$\n(415)\nElectric Fuel and Purchased Power \n—\n \nExpenses incurred for electric fuel and purchased power are impacted by fluctuations in market prices of natural gas, coal and uranium, as well as seasonality. These incurred expenses are generally recovered through various regulatory recovery mechanisms. As a result, changes in these expenses are largely offset in operating revenues and have minimal earnings impact. \nElectric fuel and purchased power expenses decreased $490 million in 2024. The decrease is primarily due to timing of fuel recovery mechanisms and lower commodity prices, partially offset by increased volumes.\nCost of Natural Gas Sold and Transported \n—\n \nExpenses incurred for the cost of natural gas sold are impacted by market prices and seasonality. These costs are generally recovered through various regulatory recovery mechanisms. As a result, changes in these expenses are largely offset in operating revenues and have minimal earnings impact.\nNatural gas sold and transported decreased $505 million in 2024. The decrease is primarily due to lower commodity prices and volumes.\nNon-Fuel Operating Expenses and Other Items\nO&M Expenses\n — O&M expenses increased $96 million in 2024 primarily due to operational activities, including generation maintenance, storm response, wildfire mitigation costs and damage prevention. The impact of prior year regulatory deferrals also contributed to increased O&M expenses, partially offset by lower labor and benefit costs and lower bad debt expenses.\nDepreciation and Amortization \n— \nDepreciation and amortization increased $296 million for the year, primarily related to system expansion, partially offset by the impacts of various rate cases, including recognition of previously deferred costs as well as wind and nuclear life extensions. \nOther Income \n—\n Other income increased $121 million for the year, primarily related to interest earned on significant cash balances throughout the year and a gain on debt repurchases, which helped to offset increased spending in our electric and natural gas operations to reduce risk, including wildfire mitigation.\nInterest Charges \n—\n Interest charges increased $200 million in 2024. The increase was largely due to higher long-term debt levels to fund capital investments and higher interest rates.\nAFUDC, Equity and Debt \n— \nAFUDC increased $99 million in 2024. This increase was largely due to increased investment in renewable and transmission projects.\nXcel Energy Inc. and Other Results\nNet income and diluted EPS contributions of Xcel Energy Inc. and its nonregulated businesses:\n(Millions of Dollars)\n2024\n2023\nXcel Energy Inc. financing costs\n$\n(223)\n$\n(174)\nXcel Energy Inc. taxes and other results \n(a)\n38 \n1 \nTotal Xcel Energy Inc. and other costs\n$\n(185)\n$\n(173)\n(Diluted Earnings (Loss) Per Share)\n2024\n2023\nXcel Energy Inc. financing costs\n$\n(0.40)\n$\n(0.32)\nXcel Energy Inc. taxes and other results \n(a)\n0.07 \n0.01 \nTotal Xcel Energy Inc. and other costs\n$\n(0.33)\n$\n(0.31)\n(a)\nAmounts include gain from open market debt repurchases in 2024.\nXcel Energy Inc.’s results include interest charges, which are incurred at Xcel Energy Inc. and are not directly assigned to individual subsidiaries.\n2023 Comparison with 2022 \nA discussion of changes in Xcel Energy’s results of operations, cash flows and liquidity and capital resources from the year ended Dec. 31, 2022 to Dec. 31, 2023 can be found in Part II, “Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations” of our Annual Report on \nForm 10-K\n for the fiscal year 2023, which was filed with the SEC on Feb. 21, 2024. However, such discussion is not incorporated by reference into, and does not constitute a part of, this Annual Report on Form 10-K. \nPublic Utility Regulation\nThe FERC and various state and local regulatory commissions regulate Xcel Energy Inc.’s utility subsidiaries and West Gas Interstate. Xcel Energy is subject to rate regulation by state utility regulatory agencies, which have jurisdiction with respect to the rates of electric and natural gas distribution companies in Minnesota, North Dakota, South Dakota, Wisconsin, Michigan, Colorado, New Mexico and Texas.\nRates are designed to recover plant investment, operating costs and an allowed return on investment. Our utility subsidiaries request changes in utility rates through commission filings. Changes in operating costs can affect Xcel Energy’s financial results, depending on the timing of rate cases and implementation of final rates. Other factors affecting rate filings are new investments, sales, conservation and DSM efforts, and the cost of capital. \nIn addition, the regulatory commissions authorize the ROE, capital structure and depreciation rates in rate proceedings. Decisions by these regulators can significantly impact Xcel Energy’s results of operations and credit quality.\nSee Rate Matters and Other within Note 12 to the consolidated financial statements for further information.\n28\nTable of Contents\n     \nNSP-Minnesota \nSummary of Regulatory Agencies / RTO and Areas of Jurisdiction\nRegulatory Body / RTO\nAdditional Information\nMPUC\nRetail rates, services, security issuances, property transfers, mergers, disposition of assets, affiliate transactions, and other aspects of electric and natural gas operations.\nReviews and approves Integrated Resource Plans for meeting future energy needs.\nCertifies the need and siting for generating plants greater than 50 MW and transmission lines greater than 100 KV in Minnesota.\nReviews and approves natural gas supply plans.\nNDPSC\nRetail rates, services and other aspects of electric and natural gas operations.\nReviews and approves Integrated Resource Plans for meeting future energy needs.\nRegulatory authority over generation and transmission facilities, along with the siting and routing of new generation and transmission facilities in North Dakota.\nPipeline safety compliance.\nSDPUC\nRetail rates, services and other aspects of electric operations.\nRegulatory authority over generation and transmission facilities, along with the siting and routing of new generation and transmission facilities in South Dakota.\nPipeline safety compliance.\nFERC\nWholesale electric operations, hydroelectric licensing, accounting practices, wholesale sales for resale, transmission of electricity in interstate commerce, compliance with NERC electric reliability standards, asset transfers and mergers, and natural gas transactions in interstate commerce.\nMISO\nNSP-Minnesota is a transmission owning member of the MISO RTO and operates within the MISO RTO and wholesale markets. NSP-Minnesota makes wholesale sales in other RTO markets at market-based rates. NSP-Minnesota and NSP-Wisconsin also make wholesale electric sales at market-based prices to customers outside of their balancing authority as jointly authorized by the FERC.\nDOT\nPipeline safety compliance.\nMinnesota Office of Pipeline Safety\nPipeline safety compliance.\nRecovery Mechanisms\nMechanism\nAdditional Information\nCIP Rider\nRecovers costs of conservation and DSM programs. Minnesota state law requires NSP-Minnesota to spend 2% of its state electric revenues and 0.5% of its state natural gas revenues on CIP. These costs are recovered through an annual cost-recovery mechanism.\nCustomer Protection Mechanisms\nMISO capacity revenue tracker, property tax tracker, annual incentive plan, capital true-up, deferred tax asset refund and credit card fee tracker are all mechanisms that mitigate the impact of changes to costs as compared to a baseline for NSP-Minnesota customers. \nDecoupling\nMeasures natural gas revenues against a baseline revenue per-customer for all Minnesota gas customers in classes with more than 50 customers.\nFCA\nRecovers prudently incurred costs of fuel related items and purchased energy (Minnesota, North Dakota and South Dakota).\nGas Utility Infrastructure Cost Rider\nRecovers costs for transmission and distribution pipeline integrity management programs, including funding for pipeline assessments, deferred costs for sewer separation and pipeline integrity management programs in Minnesota.\nInfrastructure Rider\nRecovers costs for investments in generation in South Dakota.\nPurchased Gas Adjustment\nProvides for prospective monthly rate adjustments in Minnesota and North Dakota for costs of purchased natural gas, transportation and storage service. Includes a true-up process for difference between projected and actual costs.\nRenewable Development Fund Rider\nAllocates money collected from customers to support research and development of emerging renewable energy projects and technologies in Minnesota.\nRenewable Energy Rider\nRecovers cost of renewable generation in North Dakota.\nRES Rider\nRecovers cost of renewable generation in Minnesota.\nSales True-up\nMitigates the impact of changes to sales levels as compared to a baseline for all Minnesota electric customers. \nState Energy Policy Electric Rider\nRecovers costs associated with the Prairie Island Legislation settlement and the Reliability Administrator/ Sustainable Building Guidelines in Minnesota.\nTransmission Cost Recovery Rider\nRecovers costs for investments in Minnesota, North Dakota, and South Dakota for electric transmission and distribution grid modernization. \nPending and Recently Concluded Regulatory Proceedings\n2024 Minnesota Natural Gas Rate Case\n — In November 2023, NSP-Minnesota filed a request with the MPUC for a natural gas rate increase of approximately $59 million, or 9.6%. \nIn June 2024, NSP-Minnesota and various parties\n filed an uncontested settlement, which includes the following terms: \n•\nNatural gas rate increase of $46 million, or 7.5%.\n•\nROE of 9.6%.\n•\nEquity ratio of 52.5%.\n•\nRate base of $1.25 billion.\n•\nNo change to Commission approved decoupling.\nIn October 2024, an ALJ recommended the MPUC approve the rate case settlement. In February 2025, the MPUC verbally approved the settlement agreement. NSP-Minnesota expects to implement a rate increase of $50 million (trued up for 2024 weather normalized actual sales) in July 2025.\n2024 North Dakota Natural Gas Rate Case \n— In December 2023, NSP-Minnesota filed a request with the NDPSC seeking an increase in natural gas rates of $8.5 million (9.4%), based on a ROE of 10.20%, an equity ratio of 52.5%, 2024 test year and rate base of $168 million. \nIn November 2024, the NDPSC approved a settlement, reflecting a natural gas rate increase of $7.2 million (8.0%), based on a ROE of 9.9% and an equity ratio of 52.5%. Rates were implemented on Jan. 1, 2025.\n29\nTable of Contents\n     \n2022 Minnesota Electric Rate Case —\n In October 2021, NSP-Minnesota filed a three-year electric rate case with the MPUC. \nIn July 2023, the MPUC approved a three-year rate increase of approximately $332 million for 2022-2024, based on a ROE of 9.25% and an equity ratio of 52.5%. The MPUC also approved a continuation of the sales true-up mechanism.\nIn November 2023, NSP-Minnesota filed an appeal to the Minnesota Court of Appeals regarding MPUC decisions relating to executive compensation, insurance expense and treatment of prepaid pension assets.\nIn January 2025, the Court issued its opinion, which upheld the commission's determination on insurance expense, but reversed and remanded the executive compensation and prepaid pension asset decisions back to the MPUC. The opinion is currently pending further action from the MPUC.\n2024 Minnesota Electric Rate Case —\n \nIn November 2024, NSP-Minnesota filed an electric rate case in Minnesota, seeking a total revenue increase of $491 million (13.2%) over two years, based on an ROE of 10.3%, a 52.5% equity ratio and rate base of $13.2 billion in 2025 and $14 billion in 2026. NSP-Minnesota also requested interim rates of $224 million for 2025. In December 2024, the MPUC reduced the interim rate request for wildfire mitigation costs (as these costs were deemed as new costs not previously approved in a rate case) and approved interim rates of $192 million, effective January 1, 2025. A decision is expected in 2026.\n2024 North Dakota Electric Rate Case —\n \nIn December 2024, NSP-Minnesota filed a request with the NDPSC for an annual electric rate increase of approximately $45 million, or 19.3% over current rates established in 2021. The filing is based on a 2025 forecast test year and includes a requested ROE of 10.3%, rate base of approximately $817 million and an equity ratio of 52.5%. In January 2025, the NDPSC approved interim rates, subject to refund, of approximately $27 million (implemented on Feb. 1, 2025).\nNuclear Power Operations\nNuclear power plant operations produce gaseous, liquid and solid radioactive wastes, which are covered by federal regulation. High-level radioactive wastes primarily include used nuclear fuel. Low-level waste consists primarily of demineralizer resins, paper, protective clothing, rags, tools and equipment contaminated through use.\nNRC Regulation\n — The NRC regulates nuclear operations. Costs of complying with NRC requirements can affect both operating expenses and capital investments of the plants. NSP-Minnesota has obtained recovery of these compliance costs and expects to recover future compliance costs.\nLow-Level Waste Disposal — Low level waste from Monticello and Prairie Island is disposed of at the Clive facility located in Utah and the Waste Control Specialists facility in Texas. NSP-Minnesota has storage capacity available on-site through 2033 at Prairie Island Unit 1, 2034 at Prairie Island Unit 2, and 2040 at Monticello, which would allow both plants to continue to operate if off-site low-level waste disposal facilities become unavailable.\nHigh-Level Radioactive Waste Disposal\n — The federal government has responsibility to permanently dispose of domestic spent nuclear fuel and other high-level radioactive wastes. The Nuclear Waste Policy Act requires the DOE to implement a program for nuclear high-level waste management. \nThis includes the siting, licensing, construction and operation of a repository for spent nuclear fuel from civilian nuclear power reactors and other high-level radioactive wastes at a permanent federal storage or disposal facility. Currently, there are no definitive plans for a permanent federal storage facility site.\nNuclear Spent Fuel Storage\n — NSP-Minnesota has interim on-site storage for spent nuclear fuel at its Monticello and Prairie Island nuclear generating plants. Authorized storage capacity is sufficient to allow NSP-Minnesota to operate until 2040 for Monticello, 2033 for Prairie Island Unit 1, and 2034 for Prairie Island Unit 2.\nIn December 2024, the NRC approved a Subsequent License Renewal application for extended Monticello Plant operation through 2050 (Subsequent Renewed Facility Operating License No. DPR-22, Accession No. ML24310A345). NSP-Minnesota will need authorization from the MPUC for additional storage capacity through 2050.\nIn February 2024, NSP-Minnesota filed a CON with the MPUC for additional storage at Prairie Island to support possible life extension to 2054. NSP-Minnesota has notified the NRC of intent to apply for Prairie Island SLR which would extend operation of Unit 1 to 2053 and Unit 2 to 2054.\nAuthorizations for additional spent fuel storage capacity may be required at each site to support either continued operation or decommissioning if the federal government does not commence storage operations.\nNSP-Wisconsin \nSummary of Regulatory Agencies / RTO and Areas of Jurisdiction\nRegulatory Body / RTO\nAdditional Information\nPSCW\nRetail rates, services and other aspects of electric and natural gas operations.\nCertifies the need for new generating plants and electric transmission lines before the facilities may be sited and built.\nThe PSCW has a biennial base rate filing requirement. By June of each odd numbered year, NSP-Wisconsin must submit a rate filing for the test year beginning the following January.\nPipeline safety compliance.\nMPSC\nRetail rates, services and other aspects of electric and natural gas operations.\nCertifies the need for new generating plants and electric transmission lines before the facilities may be sited and built.\nPipeline safety compliance.\nFERC\nWholesale electric operations, hydroelectric generation licensing, accounting practices, wholesale sales for resale, transmission of electricity in interstate commerce, compliance with NERC electric reliability standards, asset transactions and mergers and natural gas transactions in interstate commerce.\nMISO\nNSP-Wisconsin is a transmission owning member of the MISO RTO that operates within the MISO RTO and wholesale energy market. NSP-Wisconsin and NSP-Minnesota are jointly authorized by the FERC to make wholesale electric sales at market-based prices.\nDOT\nPipeline safety compliance.\n30\nTable of Contents\n     \nRecovery Mechanisms\nMechanism\nAdditional Information\nAnnual Fuel Cost Plan\nNSP-Wisconsin does not have an automatic electric fuel adjustment clause. Under Wisconsin rules, utilities submit a forward-looking annual fuel cost plan to the PSCW. Once the PSCW approves the plan, utilities defer the amount of any fuel cost under-recovery or over-recovery in excess of a 2% annual tolerance band, for future rate recovery or refund. Approval of a fuel cost plan and any rate adjustment for refund or recovery of deferred costs is determined by the PSCW. Rate recovery of deferred fuel cost is subject to an earnings test based on the most recently authorized ROE. Under-collections that exceed the 2% annual tolerance band may not be recovered if the utility earnings for that year exceed the authorized ROE.\nNatural Gas Cost-Recovery Factor (MI)\nNSP-Wisconsin’s natural gas rates for Michigan customers include a natural gas cost-recovery factor, based on 12-month projections and trued-up to actual amounts on an annual basis.\nPower Supply Cost Recovery Factors\nNSP-Wisconsin’s retail electric rate schedules for Michigan customers include power supply cost recovery factors, based on 12-month projections. After each 12-month period, a reconciliation is submitted whereby over-recoveries are refunded and any under-recoveries are collected from customers.\nPurchased Gas Adjustment\nA retail cost-recovery mechanism to recover the actual cost of natural gas, transportation, and storage services.\nWisconsin Energy Efficiency Program\nThe primary energy efficiency program is funded by the utilities, but operated by independent contractors subject to oversight by the PSCW and utilities. NSP-Wisconsin recovers these costs from customers.\nPending Regulatory Proceedings\nMichigan Electric Rate Case — \nIn July 2024, NSP-Wisconsin filed a Michigan electric rate case with the MPSC. In December 2024, the MPSC approved NSP-Wisconsin’s settlement agreement. The settlement order includes an electric rate increase of $1.75 million in 2025 and a step increase of $0.55 million in 2026, based on a ROE of 9.8% and an equity ratio of 50%. \nWisconsin 2025 Stay-Out Proposal —\n In June 2024, NSP-Wisconsin filed a 2025 stay-out proposal with the PSCW. In December 2024, the PSCW approved NSP-Wisconsin’s filing, which offsets $27 million in electric deficiencies and $3 million in natural gas deficiencies by amortizing IRA deferrals, stopping a deferral related to IRA benefits ordered in a previous rate case, and deferring revenue requirement impacts of two natural gas capital projects.\nExcess Liability Insurance Deferral\n – \nIn February 2025, NSP-Wisconsin filed a request with the PSCW for deferred accounting treatment for excess liability insurance expense of $9.6 million incurred as a result of the October 2024 policy renewal. A PSCW decision is expected in the third quarter of 2025.\nNSP System\nPending and Recently Concluded Regulatory Proceedings\nResource Acquisition — \nIn February 2024, NSP filed its Upper Midwest Resource Plan with the MPUC. In October 2024, NSP-Minnesota filed a settlement with several parties reaching agreement on the resource plan, as well as the proposed projects to be approved in the pending 800 MW firm dispatchable resource acquisition.\nIn February 2025, the MPUC verbally approved the terms of the settlement agreement, including: \n•\nThe selection of the company owned 420 MW Lyon County combustion turbine. \n•\nThe selection of the company owned 300 MW 4-hour Sherco battery energy storage system.\n•\nMultiple PPAs to proceed to the negotiation stage. \n•\nThe addition of 3,200 MW of wind, 400 MW of solar and 600 MW of stand-alone storage to be added through 2030 based on an RFP process (a portion of which is expected to be fulfilled with the resources acquired as part of the 2024 RFPs). Of these amounts, approximately 2,800 MW of wind are projected to utilize the Minnesota Energy Connection transmission line.\n•\nPlanned life extensions of the Prairie Island and Monticello nuclear plants through the early 2050s.\nAdditionally, the MPUC approved life extensions of the Red Wing and Mankato RDF plants to 2037 and ordered NSP-Minnesota to file a proposed tariff for customers with super-large load, largely data centers, by July 15, 2025. \nNSP-Minnesota will file additional RFPs for approved resource needs beginning in late 2025 or early 2026.\nNSP-Minnesota and NSP-Wisconsin are actively engaged in multiple processes and proceedings to acquire resources to meet their identified generation resource needs.\n•\nIn October 2023, NSP-Minnesota issued an RFP seeking 1,200 MW of wind assets to replace capacity and reutilize interconnection rights associated with the retiring Sherco coal facilities. The RFP closed in December 2023. NSP-Minnesota expects to file for approval of recommended projects in summer 2025.\n•\nIn 2024, NSP-Minnesota and NSP-Wisconsin each issued an RFP collectively seeking up to 1,600 MW of wind, solar, storage or hybrid resources to interconnect to the NSP System, including reutilization of the interconnection rights associated with the retiring Sherco coal units, and 650 MW of solar and storage resources to specifically reutilize the interconnection rights associated with the retiring King coal unit. Bids are currently under evaluation; NSP-Minnesota and NSP-Wisconsin announced the short listed projects in January 2025 and plan to file for the requisite approvals of the selected resources with the MPUC and PSCW, respectively, in the second half of 2025.\nPurchased Power and Transmission Services\nThe NSP System expects to use power plants, power purchases, conservation and DSM options, new generation facilities and expansion of power plants to meet its system capacity requirements.\nPurchased Power\n — Through the Interchange Agreement, NSP-Wisconsin receives power purchased by NSP-Minnesota from other utilities and independent power producers. Long-term purchased power contracts for dispatchable resources typically require a capacity charge and an energy charge. NSP-Minnesota makes short-term purchases to meet system requirements, replace company owned generation, meet operating reserve obligations or obtain energy at a lower cost.\nPurchased Transmission Services\n \n— NSP-Minnesota and NSP-Wisconsin have contracts with MISO and other regional transmission service providers to deliver power and energy to their customers.\n31\nTable of Contents\n     \nWholesale and Commodity Marketing Operations\nNSP-Minnesota conducts wholesale marketing operations, including the purchase and sale of electric capacity, energy, ancillary services and energy-related products. NSP-Minnesota uses physical and financial instruments to minimize commodity price risk and to hedge sales and purchases. \nNSP-Minnesota also engages in trading activity unrelated to these hedging activities. Sharing of any margins is determined through state regulatory proceedings as well as the operation of the FERC approved joint operating agreement. NSP-Minnesota and NSP-Wisconsin do not serve any wholesale requirements customers at cost-based regulated rates. \nPSCo\nSummary of Regulatory Agencies / RTO and Areas of Jurisdiction\nRegulatory Body / RTO\nAdditional Information on Regulatory Authority\nCPUC\nRetail rates, accounts, services, issuance of securities and other aspects of electric, natural gas and steam operations.\nReviews and approves Integrated Resource Plans for meeting future energy needs.\nCertifies the need and siting for generating plans greater than 50 MW.\nPipeline safety compliance.\nFERC\nWholesale electric operations, accounting practices, hydroelectric licensing, wholesale sales for resale, transmission of electricity in interstate commerce, compliance with the NERC electric reliability standards, asset transactions and mergers and natural gas transactions in interstate commerce.\nWholesale electric sales at cost-based prices to customers inside PSCo’s balancing authority area and at market-based prices to customers outside PSCo’s balancing authority area.\nPSCo holds a FERC certificate that allows it to transport natural gas in interstate commerce without PSCo becoming subject to full FERC jurisdiction.\nRTO\nPSCo is not presently a member of an RTO and does not operate within an RTO energy market. However, PSCo does make certain sales to other RTO’s, including SPP and participates in the SPP Western Energy Imbalance Service market, an energy imbalance market.\nDOT\nPipeline safety compliance.\nRecovery Mechanisms\nMechanism\nAdditional Information\nColorado Energy Plan Adjustment\nRecovers the early retirement costs of Comanche Units 1 and 2 to a maximum of 1% of the customer’s bill.\nDSM Cost Adjustment\nRecovers electric and gas DSM, interruptible service costs and performance incentives for achieving energy savings goals.\nElectric Commodity Adjustment\nRecovers fuel and purchased energy costs. Short-term sales margins are shared with customers. PTCs earned for owned wind generation are returned to customers.\nFCA\nPSCo recovers fuel and purchased energy costs from wholesale electric customers through a fuel cost adjustment clause approved by the FERC. Wholesale customers pay production costs through a forecasted formula rate subject to true-up.\nGCA\nRecovers costs of purchased natural gas and transportation and is revised quarterly to allow for changes in natural gas rates.\nPurchased Capacity Cost Adjustment\nRecovers purchased capacity payments.\nRES Adjustment\nRecovers the incremental costs of compliance with the RES with a maximum of 1% of the customer’s bill.\nSteam Cost Adjustment\nRecovers fuel costs to operate the steam system. The Steam Cost Adjustment rate is revised quarterly.\nTransmission Cost Adjustment\nRecovers costs between rate cases for transmission projects that result in a net increase in capacity or are part of an approved wildfire mitigation plan. Distribution projects are recoverable for 2024 and 2025, subject to a cap of 0.5% and 1.25% of electric retail revenues, respectively.\nTransportation Electrification Plan\nRecovers costs associated with the investment in and adoption of transportation electrification infrastructure.\nPending and Recently Concluded Regulatory Proceedings\nColorado Natural Gas Rate Case — \nIn January 2024, PSCo, filed a request with the CPUC seeking an increase to retail natural gas rates of $171 million (9.5%). The request was based on a 10.25% ROE, an equity ratio of 55%, a 2023 test year and a $4.2 billion year-end rate base. \nIn October 2024, as modified on ARRR in January 2025, the CPUC issued an order including the following key decisions:\n•\nUse of a historic 2023 test year, with a 13-month average rate base.\n•\nWeighted-average cost of capital of 7.0%, based on an ROE range of 9.2%-9.5% and an equity ratio range of 52%-55%.\n•\nAcceleration of $15 million per year of depreciation expense (incremental to PSCo’s original rate request), to be held in an external trust for future decommissioning costs.\n•\nModifications to recoverability of certain operating expenses.\n•\nDenial of PSCo’s decoupling proposal.\nPSCo placed new rates into effect in November, as modified on ARRR in February 2025, with an annual revenue increase of approximately $125 million, inclusive of $15 million of accelerated depreciation. The UCA filed a second ARRR in February 2025, which remains pending. \nColorado Resource Plan\n \n— In December 2023, the CPUC approved a portfolio of 5,835 MW, which includes approximately 3,100 MW of company owned resources and 2,700 MW of PPAs. \nIn December 2023, the CPUC approved a framework for two PIMs associated with the generation projects in the portfolio — a PIM related to capital construction costs and another related to ongoing levelized energy costs with details to be further defined via subsequent proceedings throughout 2024. In September 2024, PSCo filed a proposal for implementation of the PIMs. Intervenor testimony is due Feb. 27, 2025, with a final decision expected in summer 2025. \nIn September 2024, PSCo filed a proposed framework for CPUC review of pricing adjustments for both company owned and PPA resources to enable delivery of the approved portfolio in light of supply chain and geopolitical developments. In January 2025, the CPUC issued a decision granting limited potential pricing relief, subject to evaluation in future CPCN proceedings for company owned projects. \nPSCo filed or expects to file generation and transmission CPCNs throughout 2024 and 2025.\n2024 Colorado Electric Resource Plan —\n \nIn October 2024, PSCo filed its electric resource plan with the CPUC. The filing reflects the expected growth on the system, the generation resources needed to meet the projected growth and the future evaluation of competitive bids for new generation resources. \n•\nThe plan reflects a base sales forecast with 7% compound annual sales growth through 2031. \n•\nThe plan also presents a low sales forecast with a 3% compound annual sales growth through 2031.\n•\nThe resource plan includes forecasted need of 5-14 GW of new generation capacity through 2031, including renewables and firm dispatchable resources to meet the two different scenarios. The acquisitions of generation resources will be determined through a competitive solicitation after the CPUC determines the portfolio. The table below summarizes two of the proposed portfolios based on the different sales scenarios:  \n32\nTable of Contents\n     \n(MW)\nBase Plan\nLow Load\nWind\n7,250 \n2,800 \nSolar\n3,077 \n1,200 \nNatural gas combustion turbine\n1,575 \n1,400 \nStorage (long duration)\n1,600 \n— \nOther storage\n450 \n— \nTotal\n13,952 \n5,400 \nThe procedural schedule is as follows:\n•\nAnswer testimony: April 18, 2025\n•\nRebuttal testimony: May 23, 2025\n•\nSettlement deadline: June 2, 2025\n•\nHearing: June 10-20, 2025\n•\nStatements of position: July 14, 2025\nA CPUC decision on the resource plan is expected by the fall of 2025 (Phase I) with the competitive solicitation for resource additions expected in early 2026.\nWildfire Mitigation Plan — \nIn June 2024, PSCo filed an updated WMP and request for recovery of costs covering the years 2025 to 2027 with the CPUC. The estimated total cost for this plan is approximately $1.9 billion. A CPUC decision is expected in the third quarter of 2025.\nThe WMP integrates industry experience; incorporates evolving risk assessment methodologies; adds new technology; and expands the scope, pace and scale of our work to reduce wildfire risk in a comprehensive and efficient manner under four core programs that include the following:\n•\nSituational awareness \n—\n Meteorology, area risk mapping and modeling, artificial intelligence cameras and continuous monitoring.\n•\nOperational mitigations – Enhanced powerline safety settings and PSPS.\n•\nSystem resiliency \n—\n Asset assessment and remediations, pole replacements, line rebuilds, targeted undergrounding and vegetation management.\n•\nCustomer support \n—\n Coordination and real-time data sharing with customers and other stakeholders and PSPS resiliency rebates. \nIn February 2025, six of the nine intervenors filed answer testimony in the proceeding. Intervenors provided a range of recommendations related to both the scope of proposed work and the cost recovery proposal. \nThe remaining procedural schedule is as follows:\n•\nRebuttal testimony: March 21, 2025\n•\nSettlement deadline: April 11, 2025\n•\nHearing: May 5-15, 2025\n•\nDecision deadline: Aug. 28, 2025\nColorado Senate Bill 23-291\n — In May 2023, Colorado Senate Bill 23-291 was signed into law. The bill includes a number of topics including natural gas and electric fuel incentive mechanisms, natural gas planning rules, regulatory filing requirements, and non-recovery of certain expenses (e.g., certain organizational or membership dues, tax penalties or fines). \nIn November 2023, the CPUC approved PSCo’s natural gas price risk plan to manage customer bill volatility from commodity price changes, establishing upper and lower limits for changes in the GCA rate. As a result, costs above the upper limit are deferred for future recovery, with interest, and costs below the lower limit deferred as a reserve against future cost increases. \nThe legislation also calls for the CPUC to adopt rules to establish fuel cost mechanisms to align the financial incentives of a utility with the interests of the utility’s customers. \nIn December 2024, the CPUC adopted final rules applicable to PSCo’s natural gas utility that would assign to the Company four percent of the change in the price per MMbtu of natural gas compared to the three-year average, subject to rolling 12-month cap based on a percentage of rate base, currently estimated at $7 million. The rules require PSCo to make a filing to implement the mechanism within sixty days of becoming effective, expected later in 2025.\nIn December 2024, the CPUC also adopted rules for electric utilities but did not adopt a specific PIM framework, which will be further considered through additional proceedings in 2025. \nColorado Senate Bill 24-218\n — In May 2024, Colorado Senate Bill 24-218 was signed into law. The bill includes a suite of policy changes to accelerate investment in electric distribution, including a framework to develop distribution planning and performance requirements and the opportunity for current cost recovery through a rider for distribution investments. In July 2024 and December 2024, the CPUC approved PSCo’s request to collect $17 million and $48 million through a rider, over the remainder of 2024 and 2025, respectively, subject to true-up, associated with forecasted capital investments covered by the new legislation. \nExcess Liability Insurance Deferral —\n In August 2024, PSCo filed a request with the CPUC to establish a tracker to defer differences in excess liability insurance premiums after the October 2024 policy renewal (reflecting significantly rising premiums of approximately $40 million, largely associated with wildfire risks throughout the United States) and amounts currently recovered. In January 2025, the CPUC approved a one-year deferral aligned with the current insurance policy year. Cost recovery for incremental insurance premiums will be reviewed in a future rate case.\nPurchased Power and Transmission Service Providers\nPSCo meets its system capacity and energy requirements through its fleet of owned and purchased electric generation resources and, when required, the use of demand-side management programs.\nPurchased Power\n — PSCo purchases power from other utilities, energy marketers and independent power producers. Long-term purchased power contracts for dispatchable resources typically require capacity and energy charges. Much of PSCo’s long-term purchased power is for wind, solar and storage resources. PSCo makes short-term purchases to meet system load and energy requirements, replace generation out of service for maintenance, meet operating reserve obligations, or obtain energy at a lower cost.\nPurchased Transmission Services\n — In addition to using its own transmission system, PSCo has contracts with regional transmission service providers to deliver energy to its customers.\nWholesale and Commodity Marketing Operations\nPSCo conducts various wholesale marketing operations, including the purchase and sale of electric capacity, energy, ancillary services and energy related products. PSCo uses physical and financial instruments to minimize commodity price risk and hedge sales and purchases. PSCo also engages in trading activity unrelated to these hedging activities. \nSharing of any margin is determined through state regulatory proceedings as well as the operation of the FERC approved joint operating agreement.\n33\nTable of Contents\n     \nSPS\nSummary of Regulatory Agencies / RTO and Areas of Jurisdiction\nRegulatory Body / RTO\nAdditional Information\nPUCT\nRetail electric operations, rates, services, construction of transmission or generation and other aspects of SPS’ electric operations.\nThe municipalities in which SPS operates in Texas have original jurisdiction over rates in those communities. The municipalities’ rate setting decisions are subject to PUCT review. \nNMPRC\nRetail electric operations, retail rates and services and the construction of transmission or generation.\nReviews Integrated Resource Plans for meeting future energy needs.\nFERC\nWholesale electric operations, accounting practices, wholesale sales for resale, the transmission of electricity in interstate commerce, compliance with NERC electric reliability standards, asset transactions and mergers, and natural gas transactions in interstate commerce.\nSPP RTO and SPP Integrated and  Wholesale Markets\nSPS is a transmission owning member of the SPP RTO and operates within the SPP RTO and SPP integrated and wholesale markets. SPS is authorized to make wholesale electric sales at market-based prices. \nDOT\nPipeline safety compliance.\nRecovery Mechanisms\nMechanism\nAdditional Information\nAdvanced Metering System Surcharge\nRecovers costs incurred in deployment of the Advanced Metering System in Texas.\nConsulting Fee Rider\nRecovers consulting fees and carrying charges incurred by SPS on behalf of the PUCT.\nDistribution Cost Recovery Factor\nRecovers distribution costs not included in rates in Texas.\nElectric Vehicle Rider\nRecovers costs of the Transportation Electrification Plan in New Mexico.\nEnergy Efficiency Cost Recovery Factor\nRecovers costs for energy efficiency programs in Texas.\nEnergy Efficiency Rider\nRecovers costs for energy efficiency programs in New Mexico.\nFixed Fuel and Purchased Recovery Factor\nProvides for the over- or under-recovery of energy expenses in Texas. Regulations require refunding or surcharging over- or under- recovery amounts, including interest, when they exceed 4% of the utility’s annual fuel and purchased energy costs on a rolling 12-month basis if this condition is expected to continue.\nFuel and Purchased Power Cost Adjustment Clause\nAdjusts monthly to recover actual fuel and purchased power costs in New Mexico. \nGrid Modernization Rider\nRecovers costs incurred in the implementation of Grid Modernization Components in New Mexico.\nRenewable Portfolio Standards\nRecovers deferred costs for renewable energy programs in New Mexico.\nTransmission Cost Recovery Factor\nRecovers certain transmission infrastructure improvement costs and changes in wholesale transmission charges not included in Texas base rates.\nWholesale Fuel and Purchased Energy Cost Adjustment\nSPS recovers fuel and purchased energy costs from its wholesale customers through a monthly wholesale fuel and purchased energy cost adjustment clause accepted by the FERC. Wholesale customers also pay the jurisdictional allocation of production costs.\nPending and Recently Concluded Regulatory Proceedings\n2023 Texas Electric Rate Case \n— In 2023, SPS filed an electric rate case with the PUCT seeking an increase in base rate revenue of $158 million (14%). Interim rates went into effect on Feb. 1, 2024. In April 2024, the PUCT approved a black box settlement between SPS and intervening parties, which reflect the following terms:\n•\nA base rate increase of $65 million effective back to July 13, 2023.\n•\nA 9.55% ROE, a 54.51% equity ratio and a 7.11% WACC for purposes of calculating SPS’ allowance for funds used during construction and in other proceedings filed before the PUCT where a stated WACC is required. \n•\nThe reflection in rates of the retirement of Tolk Generation Station from 2034 to 2028.\n•\nEstablishment of a rate rider of approximately $18 million to be recovered over a three-year period for various deferred expenses. \nIn July 2024, SPS filed to surcharge the final under-recovered amount of $37 million. This will be largely offset by previously deferred costs. In February 2025, the PUCT approved the surcharge.\n2022 All-Source RFP \n— In July 2023, SPS filed for approval of a CPCN for a recommended generation portfolio, which includes 418 MW of self-build solar projects and a 36 MW battery. The NMPRC approved the projects in May 2024. In July 2024, the PUCT approved the solar projects and denied the battery project. The PUCT’s approval included minimum production and PTC guarantees.\nNew Mexico Resource Plan (IRP) \n— In October 2023, SPS filed its IRP with the NMPRC, which supports projected load growth and increasing reliability requirements, and secures replacement energy and capacity for retiring resources. SPS’ projected resource needs ranging from approximately 5,300 MW to 10,200 MW by 2030. In February 2024, the NMPRC accepted the IRP.\nIn July 2024, SPS issued a RFP, seeking approximately 3,200 MW of accredited generation capacity by 2030. The total capacity to be added to the system is expected to align with the range identified in the SPS IRP, depending on the types of resources proposed in the RFP and their accredited capacity factors.\nThe RFP portfolio selection is expected in May 2025. SPS is expected to file for a CON for the recommended portfolio in the summer of 2025. The PUCT and NMPRC are expected to rule on the portfolio in 2026.\nTexas System Resiliency Plan \n— In December 2024, SPS filed its Texas SRP with the PUCT. Consistent with PUCT requirements, SPS’ proposed plan discusses resiliency-related risks and the five measures that have been designed to help SPS prevent, withstand, mitigate or more promptly recover from resiliency events, including wildfire.\nThe SRP includes the following measures:\n•\nDistribution overhead hardening — Replacing and reinforcing key components of the distribution overhead system.\n•\nDistribution system protection modernization — Installing enhanced reclosers, communications equipment and replacing substation relay panels and breakers.\n•\nCommunication modernization — Building out a private LTE network, installing fiber optic cable and adding remote terminal units. \n•\nOperational flexibility — Procuring mobile substation equipment and installing additional switching devices.\n•\nWildfire mitigation — Weather stations, modeling, deploying artificial intelligence and vegetation management.\n34\nTable of Contents\n     \nThe plan covers 2025-2028 and includes the following total spend: \n(Millions of Dollars)\nCapital\nO&M\nTotal\nDistribution overhead hardening\n$\n253 \n$\n— \n$\n253 \nDistribution system protection modernization\n92 \n— \n92 \nCommunication modernization\n112 \n— \n112 \nOperational flexibility\n44 \n— \n44 \nWildfire mitigation\n20 \n17 \n37 \nTotal\n$\n521 \n$\n17 \n$\n538 \nThe procedural schedule is as follows:\n•\nIntervenor testimony: February 28, 2025\n•\nStaff testimony: March 7, 2025\n•\nRebuttal testimony: March 17, 2025\n•\nHearing: March 25-26, 2025\nA PUCT decision is expected in the summer of 2025.\nPurchased Power Arrangements and Transmission Service Providers\nSPS expects to use electric generating stations, power purchases, DSM and new generation options to meet its system capacity requirements. \nPurchased Power\n — SPS purchases power from other utilities and IPPs. Long-term purchased power contracts typically require periodic capacity and energy charges. SPS also makes short-term purchases to meet system load and energy requirements to replace owned generation, meet operating reserve obligations or obtain energy at a lower cost.\nPurchased Transmission Services\n — SPS has contractual arrangements with SPP and regional transmission service providers to deliver power and energy to its native load customers.\nNatural Gas\nSPS does not provide retail natural gas service, but purchases and transports natural gas for its generation facilities and operates limited natural gas pipeline facilities connecting the generation facilities to interstate natural gas pipelines, subject in certain cases to the regulation of the Railroad Commission of Texas. SPS is subject to the jurisdiction of the FERC with respect to natural gas transactions in interstate commerce and the PHMSA, DOT and PUCT for pipeline safety compliance.\nWholesale and Commodity Marketing Operations\nSPS conducts various wholesale marketing operations, including the purchase and sale of electric capacity, energy, ancillary services and energy related products. SPS uses physical and financial instruments to minimize commodity price risk and to hedge sales and purchases. Sharing of any margin is determined through state regulatory proceedings as well as the operation of the FERC approved joint operating agreement.\nOther\nSupply Chain \nXcel Energy’s ability to meet customer energy requirements, growing customer demand, respond to storm-related disruptions, and execute our capital expenditure program are dependent on maintaining an efficient supply chain. \nLarge global demand for energy-related infrastructure has stretched equipment supply chains, extended delivery dates and increased prices for items like combustion turbines, transformers and other large electrical equipment. The labor market for skilled engineering and construction resources to build renewables and gas generation has also been strained, impacting cost and availability. \nIn addition, manufacturing processes have experienced disruptions related to the scarcity of certain raw materials and interruptions in production and shipping. The impact of inflationary pressures, geopolitical events and federal policies have exacerbated the situation. Xcel Energy continues to monitor the situation as it remains fluid and seeks to mitigate the impacts by securing alternative suppliers and key vendor partners, increasing procurement lead times, modifying design standards, and adjusting the timing of work. \nTariffs and Trade Complaints\nIn May 2024, the U.S. Department of Commerce announced the initiation of anti-dumping and countervailing duty investigations of CSPV cells from Cambodia, Malaysia, Thailand and Vietnam, whether or not assembled into modules. \nIn October 2024, the U.S. Department of Commerce announced its preliminary determination in the countervailing duty circumvention investigation, which is not expected to impact Xcel Energy projects. In November 2024, the U.S. Department of Commerce concluded that dumping had occurred and the impact to Xcel Energy is still being evaluated. \nIn May 2024, the White House imposed a new 25% tariff on Lithium-Ion storage along with other trade measures. The tariff went into immediate effect for EV batteries but has a grace period until January 2026 for stationary energy storage applications.\nIn January of 2025, the U.S. International Trade Commission made an affirmative determination in the preliminary phase of the anti-dumping and countervailing duty investigations concerning Active Anode Material, a component of lithium-ion batteries, from China. This case will be reviewed by the U.S. Department of Commerce and the International Trade Commission over the course of 2025.\nIn early 2025, several executive orders were issued, some of which impose new tariffs on certain imports, which may impact our procurement activities. \nXcel Energy continues to assess the impacts of these tariffs, trade complaints and federal policies on its business, including company owned projects and PPAs. Xcel Energy may seek regulatory relief for tariffs, if required, in its jurisdictions.\nFurther policy actions or other restrictions on solar and storage imports, disruptions in imports from key suppliers, or any new trade complaint could impact project timelines and costs of various generation projects and PPAs.\n35\nTable of Contents\n     \nExcess Liability Insurance Coverage\nXcel Energy maintains excess liability coverage, which is intended to insure against liability to third parties. Through the third quarter of 2024, Xcel Energy had approximately $600 million of excess liability coverage; including $520 million of wildfire coverage with an annual premium of approximately $40 million. Examples of claims paid under this policy include property damage or bodily injury to members of the public caused by Xcel Energy’s employees, equipment or facilities. The increased wildfire liability risk and claims are driving a significant increase of premiums and reductions in insurance coverage in the excess liability markets, especially in the western United States. In October 2024, Xcel Energy renewed its excess liability coverage and now has $450 million of total coverage; including $450 million of wildfire coverage for the NSP System and $300 million of wildfire coverage for PSCo and SPS. The annual premium for this excess liability insurance is approximately $130 million. Xcel Energy received an approved deferral at PSCo, filed a deferral request at NSP-Wisconsin and will continue to seek to recover these increased costs through various regulatory proceedings, including planned deferral requests or rate filings in several states. \nCritical Accounting Policies and Estimates\nPreparation of the consolidated financial statements requires the application of accounting rules and guidance, as well as the use of estimates. Application of these policies involves judgments regarding future events, including the likelihood of success of particular projects, legal and regulatory challenges and anticipated recovery of costs. These judgments could materially impact the consolidated financial statements, based on varying assumptions. In addition, the financial and operating environment also may have a significant effect on the operation of the business and results reported. \nAccounting policies and estimates that are most significant to Xcel Energy’s results of operations, financial condition or cash flows, and require management’s most difficult, subjective or complex judgments are outlined below. Each of these has a higher likelihood of resulting in materially different reported amounts under different conditions or using different assumptions. Each critical accounting policy has been reviewed and discussed with the Audit Committee of Xcel Energy Inc.’s Board of Directors on a quarterly basis.\nRegulatory Accounting\nXcel Energy is subject to the accounting for Regulated Operations\n,\n which provides that rate-regulated entities report assets and liabilities consistent with the recovery of those incurred costs in rates, if it is probable that such rates will be charged and collected. Our rates are derived through the ratemaking process, which results in the recording of regulatory assets and liabilities based on the probability of future cash flows. \nRegulatory assets generally represent incurred or accrued costs that have been deferred because future recovery from customers is probable. Regulatory liabilities generally represent amounts that are expected to be refunded to customers in future rates or amounts collected in current rates for future costs. In other businesses or industries, regulatory assets and regulatory liabilities would generally be charged to net income or other comprehensive income.\nEach reporting period we assess the probability of future recoveries and obligations associated with regulatory assets and liabilities. Factors such as the current regulatory environment, recently issued rate orders and historical precedents are considered. Decisions made by regulatory agencies can directly impact the amount and timing of cost recovery as well as the rate of return on invested capital, and may materially impact our results of operations, financial condition or cash flows.\nAs of Dec. 31, 2024 and 2023, Xcel Energy had regulatory assets of $3.4 billion and $3.4 billion, respectively and regulatory liabilities of $6.9 billion and $6.4 billion, respectively. Each subsidiary is subject to regulation that varies from jurisdiction to jurisdiction. If future recovery of costs in any such jurisdiction is no longer probable, Xcel Energy would be required to charge these assets to current net income or other comprehensive income. \nAt Dec. 31, 2024, in assessing the probability of recovery of recognized regulatory assets, unless otherwise disclosed, Xcel Energy noted no current or anticipated proposals or changes in the regulatory environment that it expects will materially impact the recovery of the assets. \nSee Notes 4 and 12 to the consolidated financial statements for further information.\nIncome Tax Accruals\nJudgment, uncertainty and estimates are a significant aspect of the income tax accrual process that accounts for the effects of current and deferred income taxes. Uncertainty associated with the application of tax statutes and regulations and outcomes of tax audits and appeals require that judgment and estimates be made in the accrual process and in the calculation of the ETR.\nChanges in tax laws and rates may affect recorded deferred tax assets and liabilities and our future ETR. ETR calculations are revised every quarter based on best available year-end tax assumptions, adjusted in the following year after returns are filed. Tax accrual estimates are trued-up to the actual amounts claimed on the tax returns and further adjusted after examinations by taxing authorities, as needed.\nIn accordance with the interim period reporting guidance, income tax expense for the first three quarters in a year is based on the forecasted annual ETR. The forecasted ETR reflects a number of estimates, including forecasted annual income, permanent tax adjustments and tax credits.\nValuation allowances are applied to deferred tax assets if it is more likely than not that at least a portion may not be realized. Accounting for income taxes also requires that only tax benefits that meet the more likely than not recognition threshold can be recognized or continue to be recognized. \nWe may adjust our unrecognized tax benefits and interest accruals as disputes with the IRS and state tax authorities are resolved, and as new developments occur. These adjustments may increase or decrease earnings. \nSee Note 7 to the consolidated financial statements for further information.\nEmployee Benefits\nWe sponsor several noncontributory, defined benefit pension plans and other postretirement benefit plans that cover almost all employees and certain retirees. Projected benefit costs are based on historical information and actuarial calculations that include key assumptions (annual return level on pension and postretirement health care investment assets, discount rates, mortality rates and health care cost trend rates, etc.). In addition, the pension cost calculation uses a methodology to reduce the volatility of investment performance over time. Pension assumptions are continually reviewed.\n36\nTable of Contents\n     \nAt Dec. 31, 2024, Xcel Energy set the rate of return on assets used to measure pension costs at 7.13%, which is a 20 basis point increase from the rate set at Dec. 31, 2023. The rate of return used to measure postretirement health care costs is 6.25% at Dec. 31, 2024, which is a 125 basis point increase from the rate set in 2023. Xcel Energy’s pension investment strategy includes plan-specific investments that seek to align the investment allocations to optimize risk adjusted return and interest rate risk management based on factors that include the plan’s funded status. This strategy generally results in a greater percentage of interest rate sensitive securities being allocated to plans with higher funded status ratios and a greater percentage of growth assets being allocated to plans having lower funded status ratios.\nXcel Energy set the discount rates used to value both the pension obligations and postretirement health care obligations at 5.88%  at Dec. 31, 2024. This represents a 39 basis point and 34 basis point increase, respectively, from 2023. Xcel Energy uses a bond matching study as its primary basis for determining the discount rate used to value pension and postretirement health care obligations. The bond matching study utilizes a portfolio of high grade (Aa or higher) bonds that matches the expected cash flows of Xcel Energy’s benefit plans in amount and duration. \nThe effective yield on this cash flow matched bond portfolio determines the discount rate for the individual plans. The bond matching study is validated for reasonableness against the Bank of America US Corporate 15+ Bond Index. In addition, Xcel Energy reviews general actuarial survey data to assess the reasonableness of the discount rate selected.\nIf Xcel Energy were to use alternative assumptions, a 1% change would result in the following impact on 2025 pension costs, net of the effects of regulation:\nPension Costs\n(Millions of Dollars)\n+1%\n-1%\nRate of return \n$\n(12)\n$\n24 \nDiscount rate\n \n(2)\n2 \nMortality rates are developed from actual and projected plan experience for pension plan and postretirement benefits. Xcel Energy’s actuary conducts an experience study periodically to determine an estimate of mortality. Xcel Energy considers standard mortality tables, improvement factors and the plans actual experience when selecting a best estimate.\nAs of Dec. 31, 2024, the initial medical trend cost claim assumptions for Pre-65 was 7.0% and Post-65 was 7.5%. The ultimate trend assumption remained at 4.5% for both Pre-65 and Post-65 claims costs. Xcel Energy bases its medical trend assumption on the long-term cost inflation expected in the health care market, considering the levels projected and recommended by industry experts, as well as recent actual medical cost experienced by Xcel Energy’s retiree medical plan. \nFunding contributions in 2024 were $100 million and will be $125 million in 2025. In future years contributions will decrease slightly but then remain relatively consistent. Investment returns were less than the assumed levels in 2024 and 2022, but were more than the assumed levels in 2023.\nThe pension cost calculation uses a market-related valuation of pension assets. Xcel Energy uses a calculated value method to determine the market-related value of the plan assets. The market-related value is determined by adjusting the fair market value of assets at the beginning of the year to reflect the investment gains and losses (the difference between the actual investment return and the expected investment return on the market-related value) during each of the previous five years at the rate of 20% per year. \nAs differences between actual and expected investment returns are incorporated into the market-related value, amounts are recognized in pension cost over the expected average remaining years of service for active employees (approximately 14 years in 2024).\nXcel Energy currently projects the pension costs recognized for financial reporting purposes will be $60 million in 2025 and $69 million in 2026, while the actual pension costs were $79 million in 2024 and $74 in 2023. The expected decrease in 2025 is primarily due to the absence of a pension settlement.\nPension funding contributions across all four of Xcel Energy’s pension plans, both voluntary and required, for 2022 - 2025:\n•\n$125 million in January 2025.\n•\n$100 million in 2024.\n•\n$50 million in 2023.\n•\n$50 million in 2022.\nFuture amounts may change based on actual market performance, changes in interest rates and any changes in governmental regulations. Therefore, additional contributions could be required in the future. Xcel Energy contributed $11 million, $11 million and $13 million during 2024, 2023 and 2022, respectively, to the postretirement health care plans. Xcel Energy expects to contribute approximately $8 million during 2025. \nXcel Energy recovers employee benefits costs in its utility operations consistent with accounting guidance with the exception of the areas noted below.\n•\nNSP-Minnesota recognizes pension expense in all regulatory jurisdictions using the aggregate normal cost actuarial method. Differences between aggregate normal cost and expense as calculated by pension accounting standards are deferred as a regulatory liability.\n•\nPSCo and SPS recognize pension expense in all regulatory jurisdictions based on GAAP. The Texas and Colorado electric retail jurisdictions and the Colorado gas retail jurisdiction, each record the difference between annual recognized pension expense and the annual amount of pension expense approved in their last respective general rate case as a deferral to a regulatory asset.\n•\nRegulatory Commissions in Texas, New Mexico and FERC jurisdictions allow the recovery of other postretirement benefit costs only to the extent that recognized expense is matched by cash contributions to an irrevocable trust. Xcel Energy has consistently funded at a level to allow full recovery of costs in these jurisdictions.\n•\nPSCo is required to create a regulatory liability to the extent expense is less than that included in rates. No adjustment was needed in 2024.\nSee Note 11 to the consolidated financial statements for further information.\nNuclear Decommissioning\nXcel Energy recognizes liabilities for the expected cost of retiring tangible long-lived assets for which a legal obligation exists. These AROs are recognized at fair value as incurred and are capitalized as part of the cost of the related long-lived assets. In the absence of quoted market prices, Xcel Energy estimates the fair value of its AROs using present value techniques, in which it makes assumptions including estimates of the amounts and timing of future cash flows associated with retirement activities, credit-adjusted risk free rates and cost escalation rates. When Xcel Energy revises any assumptions, it adjusts the carrying amount of both the ARO liability and related long-lived asset. ARO liabilities are accreted to reflect the passage of time using the interest method.\n37\nTable of Contents\n     \nA significant portion of Xcel Energy’s AROs relates to the future decommissioning of NSP-Minnesota’s nuclear facilities. The nuclear decommissioning obligation is funded by the external decommissioning trust fund. Difference between regulatory funding (including depreciation expense less returns from the external trust fund) and expense recognized is deferred as a regulatory liability. The amounts recorded for AROs related to future nuclear decommissioning were $2.5 billion in 2024 and $2.1 billion in 2023. \nNSP-Minnesota obtains periodic independent cost studies to estimate the cost and timing of planned nuclear decommissioning activities. Estimates of future cash flows are highly uncertain and may vary significantly from actual results. NSP-Minnesota is required to file a nuclear decommissioning filing every three years. The filing covers all expenses for the decommissioning of the nuclear plants, including decontamination and removal of radioactive material. In November 2024, the 2025-2027 Triennial Nuclear Plant Decommissioning Study was filed.  \nThe following assumptions have a significant effect on the estimated nuclear obligation:\nTiming \n— Decommissioning cost estimates are impacted by each facility’s retirement date and timing of the actual decommissioning activities. Estimated retirement dates coincide with the retirement dates approved by the MPUC, which can be different than the expiration dates of each unit’s operating license with the NRC (i.e., 2050 for Monticello and 2033 and 2034 for Prairie Island Units 1 and 2, respectively). \nIn December 2024, the operating license for Xcel Energy’s Monticello Nuclear Generating Plant in Monticello, MN was renewed. The approval allows the plant to operate an additional 20 years, through 2050. As of Dec. 31, 2024, the planned retirement dates of the Prairie Island Unit 1 and Unit 2 and Monticello were 2033, 2034 and 2040. In February 2025, the MPUC approved the planned life extension through 2050 as part of the Upper Midwest Resource Plan. These will be incorporated in decommissioning estimates in 2025 once additional approvals have been received.\nThe estimated timing of the decommissioning activities is based upon the 60 year DECON method, which assumes prompt removal and dismantlement. Decommissioning activities are expected to begin at the commission approved retirement date and be completed for both facilities by approximately 2101.\nTechnology and Regulation\n — There is limited experience with actual decommissioning of large nuclear facilities. Changes in technology, experience and regulations could cause cost estimates to change significantly. \nEscalation Rates\n — Escalation rates represent projected cost increases due to general inflation and increases in the cost of decommissioning activities. NSP-Minnesota used an escalation rate of 3.8% in calculating the ARO for nuclear decommissioning of its nuclear facilities, based on weighted averages of labor and non-labor escalation factors.\nDiscount Rates\n — Changes in timing or estimated cash flows that result in upward revisions to the ARO are calculated using the then-current credit-adjusted risk-free interest rate. The credit-adjusted risk-free rate in effect when the change occurs is used to discount the revised estimate of the incremental expected cash flows of the retirement activity.\nIf the change in timing or estimated expected cash flows results in a downward revision of the ARO, the undiscounted revised estimate of expected cash flows is discounted using the credit-adjusted risk-free rate in effect at the date of initial measurement and recognition of the original ARO. Discount rates ranging from approximately 3% to 7% have been used to calculate the net present value of the expected future cash flows over time.\nSignificant uncertainties exist in estimating future costs including the method to be utilized, ultimate costs to decommission and planned method of disposing spent fuel. If different cost estimates, life assumptions or cost escalation rates were utilized, the AROs could change materially.\nHowever, changes in estimates have minimal impact on results of operations as NSP-Minnesota expects to continue to recover all costs in future rates.\nNSP-Minnesota continually makes judgments and estimates related to these critical accounting policy areas, based on an evaluation of the assumptions and uncertainties for each area. The information and assumptions of these judgments and estimates will be affected by events beyond the control of Xcel Energy, or otherwise change over time. \nThis may require adjustments to recorded results to better reflect updated information that becomes available. The accompanying financial statements reflect management’s best estimates and judgments of the impact of these factors as of Dec. 31, 2024.\nSee Note 12 to the consolidated financial statements for further information.\nLoss Contingencies – Wildfires\nThe outcomes of legal proceedings and claims brought against Xcel Energy related to the Marshall Fire, Smokehouse Creek Fire Complex or any future wildfire are subject to uncertainty. An estimated loss from a loss contingency such as a legal proceeding or claim is accrued if it is probable of being incurred and the amount of the loss can be reasonably estimated. Each reporting period we evaluate, among other factors, the degree of probability of unfavorable outcomes and the ability to make reasonable estimates of potential losses. The process for evaluating any wildfire-related liabilities requires a series of complex judgments about past and future events. Factors such as the cause of a wildfire, the extent and magnitude of potential damages and the status of investigations and legal proceedings are considered. See Note 12 accompanying the consolidated financial statements for additional information. \nDerivatives, Risk Management and Market Risk\nWe are exposed to a variety of market risks in the normal course of business. Market risk is the potential loss that may occur as a result of adverse changes in the market or fair value for a particular instrument or commodity. All financial and commodity-related instruments, including derivatives, are subject to market risk. \nXcel Energy is exposed to the impact of adverse changes in price for energy and energy-related products, which is partially mitigated by the use of commodity derivatives. In addition to ongoing monitoring and maintaining credit policies intended to minimize overall credit risk, management takes steps to mitigate changes in credit and concentration risks associated with its derivatives and other contracts, including parental guarantees and requests of collateral. While we expect that the counterparties will perform on the contracts underlying our derivatives, the contracts expose us to credit and non-performance risk.\n38\nTable of Contents\n     \nDistress in the financial markets may impact counterparty risk and the fair value of the securities in the nuclear decommissioning fund and pension fund. \nCommodity Price Risk \n—\n We are exposed to commodity price risk in our electric and natural gas operations. Commodity price risk is managed by entering into long and short-term physical purchase and sales contracts for electric capacity, energy and energy-related products and fuels used in generation and distribution activities. \nCommodity price risk is also managed through the use of financial derivative instruments. Our risk management policy allows us to manage commodity price risk within each rate-regulated operation per commission approved hedge plans.\nWholesale and Commodity Trading Risk \n—\n Xcel Energy conducts various wholesale and commodity trading activities, including the purchase and sale of electric capacity, energy, energy-related instruments and natural gas-related instruments, including derivatives. Our risk management policy allows management to conduct these activities within guidelines and limitations as approved by our risk management committee. \nFair value of net commodity trading contracts as of Dec. 31, 2024:\nFutures / Forwards Maturity\n(Millions of Dollars)\nLess Than\n1 Year\n1 to 3 Years\n4 to 5 Years\nGreater Than\n5 Years\nTotal \nFair Value\nNSP-Minnesota\n \n(a)\n$\n(16)\n$\n(19)\n$\n(4)\n$\n— \n$\n(39)\nNSP-Minnesota\n \n(b)\n3 \n10 \n(4)\n2 \n11 \nPSCo\n \n(a)\n1 \n5 \n— \n— \n6 \n$\n(12)\n$\n(4)\n$\n(8)\n$\n2 \n$\n(22)\nOptions Maturity\n(Millions of Dollars)\nLess Than\n1 Year\n1 to 3 Years\n4 to 5 Years\nGreater Than\n5 Years\nTotal Fair Value\nNSP-Minnesota\n \n(b)\n$\n— \n$\n— \n$\n20 \n$\n— \n$\n20 \n(a)\nPrices actively quoted or based on actively quoted prices.\n(b)\nPrices based on models and other valuation methods.\nChanges in the fair value of commodity trading contracts before the impacts of margin-sharing for the years ended Dec. 31:\n(Millions of Dollars)\n2024\n2023\nFair value of commodity trading net contracts outstanding at Jan. 1\n$\n1 \n$\n(10)\nContracts realized or settled during the period\n— \n(2)\nCommodity trading contract additions and changes during the period\n(3)\n13 \nFair value of commodity trading net contracts outstanding at Dec. 31\n$\n(2)\n$\n1 \nA 10% increase and 10% decrease in forward market prices for Xcel Energy’s commodity trading contracts would have likewise increased and decreased pretax income from continuing operations, by approximately $2 million at Dec. 31, 2024 and $4 million at Dec. 31, 2023.\nThe utility subsidiaries’ commodity trading operations measure the outstanding risk exposure to price changes on contracts and obligations using an industry standard methodology known as VaR. VaR expresses the potential change in fair value of the outstanding contracts and obligations over a particular period of time under normal market conditions.\nThe VaRs for the NSP-Minnesota and PSCo commodity trading operations, excluding both non-derivative transactions and derivative transactions designated as normal purchases and normal sales, calculated on a consolidated basis using a Monte Carlo simulation with a 95% confidence level and a one-day holding period, were as follows:\n(Millions of Dollars)\nYear Ended Dec. 31\nAverage\nHigh\nLow\n2024\n$\n— \n$\n— \n$\n1 \n$\n— \n2023\n— \n— \n1 \n— \nNuclear Fuel Supply \n— NSP-Minnesota has contracted for its 2025 through 2029 enriched nuclear material requirements, which are in various stages of processing in Canada, Europe and the United States. In May 2024, the Prohibiting Russian Uranium Imports Act was signed into law. As such, NSP-Minnesota is no longer permitted to accept deliveries of enriched nuclear material from Russia beginning in August 2024, unless specific waivers are requested and received.   \nInterest Rate Risk\n — Xcel Energy is subject to interest rate risk. Our risk management policy allows interest rate risk to be managed through the use of fixed rate debt, floating rate debt and interest rate derivatives.\nA 100 basis point change in the benchmark rate on Xcel Energy’s variable rate debt would impact pretax interest expense annually by approximately $7 million and $9 million in 2024 and 2023, respectively. \nNSP-Minnesota maintains a nuclear decommissioning fund, as required by the NRC. The nuclear decommissioning fund is subject to interest rate and equity price risk. The fund is invested in a diversified portfolio of debt securities, equity securities and other investments. These investments may be used only for the purpose of decommissioning NSP-Minnesota’s nuclear generating plants. \nFluctuations in equity prices or interest rates affecting the nuclear decommissioning fund do not have a direct impact on earnings due to the application of regulatory accounting. Realized and unrealized gains on the decommissioning fund investments are deferred as an offset of NSP-Minnesota’s regulatory asset for nuclear decommissioning costs.\nThe value of pension and postretirement plan assets and benefit costs are impacted by changes in discount rates and expected return on plan assets. Xcel Energy’s ongoing pension and postretirement investment strategy is based on plan-specific investment recommendations that seek to optimize potential investment risk and minimize interest rate risk associated with changes in the obligations as a plan’s funded status increases over time. The impacts of fluctuations in interest rates on pension and postretirement costs are mitigated by pension cost calculation methodologies and regulatory mechanisms that minimize the earnings impacts of such changes. \nCredit Risk \n—\n Xcel Energy is also exposed to credit risk. Credit risk relates to the risk of loss resulting from counterparties’ nonperformance on their contractual obligations. Xcel Energy maintains credit policies intended to minimize overall credit risk and actively monitors these policies to reflect changes and scope of operations.\nAt Dec. 31, 2024, a 10% increase in commodity prices would have resulted in an increase in credit exposure of $26 million, while a decrease in prices of 10% would have resulted in a decrease in credit exposure of $25 million. At Dec. 31, 2023, a 10% increase in commodity prices would have resulted in an increase in credit exposure of $27 million, while a decrease in prices of 10% would have resulted in an decrease in credit exposure of $24 million.\n39\nTable of Contents\n     \nXcel Energy conducts credit reviews for all wholesale, trading and non-trading commodity counterparties and employs credit risk controls, such as letters of credit, parental guarantees, master netting agreements and termination provisions. \nCredit exposure is monitored, and when necessary, the activity with a specific counterparty is limited until credit enhancement is provided. Distress in the financial markets could increase our credit risk.\nFair Value Measurements\nDerivative contracts, with the exception of those designated as normal purchases and normal sales, are reported at fair value. Xcel Energy’s investments held in the nuclear decommissioning fund, rabbi trusts, pension and other postretirement funds are also subject to fair value accounting. See Notes 10 and 11 to the consolidated financial statements for further information.\nLiquidity and Capital Resources\nCash Flows\nOperating Cash Flows\n(Millions of Dollars)\nTwelve Months Ended Dec. 31\nCash provided by operating activities — 2023\n$\n5,327 \nComponents of change — 2024 vs. 2023\nHigher net income\n165 \nNon-cash transactions\n222 \nChanges in deferred taxes\n284 \nChanges in working capital \n(783)\nChanges in net regulatory and other assets and liabilities\n(574)\nCash provided by operating activities — 2024\n$\n4,641 \nNet cash provided by operating activities decreased by $686 million for 2024 as compared to 2023. The decrease was largely due to interim rate refunds in Minnesota and timing of recovery of deferred fuel costs, partially offset by the change in deferred income taxes, which includes the impact of proceeds for tax credit transfers. \nInvesting Cash Flows\n(Millions of Dollars)\nTwelve Months Ended Dec. 31\nCash used in investing activities — 2023\n$\n(5,926)\nComponents of change — 2024 vs. 2023\nIncreased capital expenditures\n(1,510)\nOther investing activities\n8 \nCash used in investing activities — 2024\n$\n(7,428)\nNet cash used in investing activities increased by $1,502 million for 2024 as compared to 2023. The increase in capital expenditures was largely due to continued system expansion and increased investment in renewable and transmission projects.\nFinancing Cash Flows\n(Millions of Dollars)\nTwelve Months Ended Dec. 31\nCash provided by financing activities —2023\n$\n617 \nComponents of change — 2024 vs. 2023\nHigher long-term debt issuances, net of repayments\n1,512 \nHigher proceeds from issuance of common stock\n847 \nHigher dividends paid to shareholders\n(83)\nOther financing activities\n(56)\nCash provided by financing activities — 2024\n$\n2,837 \nNet cash provided by financing activities increased by $2,220 million for 2024 as compared to 2023. The increase was largely related to additional debt and common stock issuances to fund capital investment.\nSee Note 5 to the consolidated financial statements for further information.\nCapital Requirements\nXcel Energy has contractual obligations and other commitments that will need to be funded in the future. Xcel Energy expects to have adequate amounts of cash from operating and financing activities to meet both its short-term and long-term cash requirements. Xcel Energy’s financing requirements are dependent on both existing contractual obligations and other commitments, as well as projected capital forecasts. Xcel Energy expects to meet future financing requirements by periodically issuing short-term debt, long-term debt, common stock, hybrid and other securities to maintain desired capitalization ratios. Projected future financing requirements can be impacted by various factors including constraints to supply chain and labor, regulatory lag and inflation.\n40\nTable of Contents\n     \nMaterial Cash Requirements and Other Commitments\n \nPayments Due by Period (as of Dec. 31, 2024)\n(Millions of Dollars)\nTotal\nLess than 1 Year\n1 to 3 Years\n3 to 5 Years\nAfter 5 Years\nLong-term debt, principal and interest payments\n$\n50,915 \n$\n2,292 \n$\n3,316 \n$\n3,846 \n$\n41,461 \nFinance lease obligations\n208 \n10 \n17 \n16 \n165 \nOperating leases obligations\n \n(a)\n1,355 \n271 \n432 \n215 \n437 \nUnconditional purchase obligations\n \n(b) (c)\n3,755 \n1,432 \n1,207 \n432 \n684 \nOther long-term obligations, including current portion \n(d)\n85 \n20 \n36 \n29 \n— \nOther short-term obligations\n632 \n632 \n— \n— \n— \nShort-term debt\n695 \n695 \n— \n— \n— \nTotal contractual cash obligations\n$\n57,645 \n$\n5,352 \n$\n5,008 \n$\n4,538 \n$\n42,747 \n(a)\nIncluded in operating lease obligations are $240 million, $372 million, $166 million and $199 million, for the less than 1 year, 1 - 3 years, 3 - 5 years and after 5 years categories, respectively, pertaining to PPAs that are accounted for as operating leases.\n(b)\nXcel Energy Inc. and its subsidiaries have contracts providing for the purchase and delivery of a significant portion of its fuel (nuclear, natural gas and coal) requirements. Additionally, the utility subsidiaries of Xcel Energy Inc. have entered into non-lease purchase power agreements. Certain contractual purchase obligations are adjusted on indices. Effects of price changes are mitigated through cost of energy adjustment mechanisms.\n(c)\nAmounts exclude approximately $1 billion of incremental payments related to SPS’ renegotiation and extension of a non-lease PPA that received PUCT approval in February 2025. The extension to 2040 will result in annual payments of approximately $65 million to $80 million commencing in 2025.\n(d)\nPrimarily consists of contracts for information technology services. \nCapital Expenditures \n—\n Base capital expenditures for Xcel Energy for 2025 through 2029: \nActual \nBase Capital Forecast (Millions of Dollars)\nBy Regulated Utility\n2024\n2025\n2026\n2027\n2028\n2029\n2025 - 2029 Total\nPSCo\n$\n3,180 \n$\n5,820 \n$\n5,190 \n$\n3,940 \n$\n3,780 \n$\n3,550 \n$\n22,280 \nNSP-Minnesota\n2,830 \n3,240 \n2,500 \n2,830 \n2,080 \n2,570 \n13,220 \nSPS\n1,100 \n1,400 \n1,540 \n1,280 \n1,040 \n1,040 \n6,300 \nNSP-Wisconsin\n560 \n640 \n650 \n690 \n660 \n670 \n3,310 \nOther\n \n(a)\n(20)\n(100)\n(40)\n10 \n10 \n10 \n(110)\nTotal base capital expenditures\n$\n7,650 \n$\n11,000 \n$\n9,840 \n$\n8,750 \n$\n7,570 \n$\n7,840 \n$\n45,000 \n(a)\nOther category includes intercompany transfers for safe harbor wind turbines.\nActual\nBase Capital Forecast (Millions of Dollars)\nBy Function\n2024\n2025\n2026\n2027\n2028\n2029\n2025 - 2029 Total\nElectric distribution\n$\n2,220 \n$\n2,570 \n$\n3,000 \n$\n3,400 \n$\n3,320 \n$\n3,540 \n$\n15,830 \nElectric transmission\n1,720 \n2,260 \n2,860 \n2,740 \n2,390 \n2,310 \n12,560 \nRenewables\n1,130 \n3,360 \n1,400 \n260 \n— \n— \n5,020 \nElectric generation\n960 \n1,210 \n1,150 \n910 \n580 \n620 \n4,470 \nNatural gas\n780 \n800 \n680 \n690 \n630 \n620 \n3,420 \nOther\n840 \n800 \n750 \n750 \n650 \n750 \n3,700 \nTotal base capital expenditures\n$\n7,650 \n$\n11,000 \n$\n9,840 \n$\n8,750 \n$\n7,570 \n$\n7,840 \n$\n45,000 \nThe base plan does not include any potential incremental generation or transmission assets that are pending commission approval through an RFP, a resource plan, or from additional data center load, which could result in additional capital expenditures of $10 billion or greater. Xcel Energy generally expects to fund additional capital investment with approximately 40% equity and 60% debt. \nXcel Energy’s capital expenditure forecast is subject to continuing review and modification. Actual capital expenditures may vary from estimates due to changes in electric and natural gas projected load growth, safety and reliability needs, regulatory decisions, legislative initiatives, tax policy, reserve requirements, availability of purchased power, alternative plans for meeting long-term energy needs, environmental initiatives and regulation, and merger, acquisition and divestiture opportunities.\nFinancing for Capital Expenditures through 2029 \n— Xcel Energy issues debt and equity securities to refinance retiring debt maturities, reduce short-term debt, fund capital programs, infuse equity in subsidiaries, fund asset acquisitions and for general corporate purposes. \n41\nTable of Contents\n     \nCurrent estimated financing plans of Xcel Energy for 2025 through 2029 (includes the impact of tax credit transferability):\n(Millions of Dollars)\nFunding Capital Expenditures\nCash from operations\n \n(a)\n$\n25,320 \nNew debt \n(b)\n15,180 \nEquity through the DRIP and benefit program\n500 \nOther equity\n4,000 \nBase capital expenditures 2025 - 2029\n$\n45,000 \nMaturing debt\n$\n3,730 \n(a)\nNet of dividends and pension funding.\n(b)\nReflects a combination of short and long-term debt; net of refinancing.\nOff-Balance Sheet Arrangements\nXcel Energy does not have any off-balance-sheet arrangements, other than those currently disclosed, that have or are reasonably likely to have a current or future effect on financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors.\nCommon Stock Dividends \n—\n Future dividend levels will be dependent on Xcel Energy’s results of operations, financial condition, cash flows, reinvestment opportunities and other factors, and will be evaluated by the Xcel Energy Inc. Board of Directors. In February 2025, Xcel Energy announced an increase in the annual dividend of 9 cents per share, which represents an increase of 4.1%.\nXcel Energy’s dividend policy balances the following:\n•\nProjected cash generation.\n•\nProjected capital investment.\n•\nA reasonable rate of return on shareholder investment.\n•\nThe impact on Xcel Energy’s capital structure and credit ratings.\nIn addition, there are certain statutory limitations that could affect dividend levels. Federal law places limits on the ability of public utilities within a holding company to declare dividends. Under the Federal Power Act, a public utility may not pay dividends from any funds properly included in a capital account. The utility subsidiaries’ dividends may be limited directly or indirectly by state regulatory commissions or bond indenture covenants.\nSee Note 5 to the consolidated financial statements for further information.\nPension Fund\n \n—\n Xcel Energy’s pension assets are invested in a diversified portfolio of domestic and international equity securities, short-term to long-duration fixed income securities and alternative investments, including private equity, real estate and hedge funds. \nFunded status and pension assumptions:\n(Millions of Dollars)\nDec. 31, 2024\nDec. 31, 2023\nFair value of pension assets\n$\n2,504 \n$\n2,690 \nProjected pension obligation\n \n(a)\n2,752 \n2,943 \nFunded status\n$\n(248)\n$\n(253)\n(a)\nExcludes non-qualified plan of $13 million and $12 million at Dec. 31, 2024 and 2023, respectively.\nPension Assumptions\n2024\n2023\nDiscount rate\n5.88 \n%\n5.49 \n%\nExpected long-term rate of return\n7.13 \n6.93 \nCapital Sources\nShort-Term Funding Sources — Xcel Energy generally funds short-term needs, through operating cash flows, notes payable, commercial paper and bank lines of credit. The amount and timing of short-term funding needs depend on construction expenditures, working capital and dividend payments.\nShort-Term Investments — Xcel Energy Inc., NSP-Minnesota, NSP-Wisconsin, PSCo and SPS maintain cash and short-term investment accounts. \nShort-Term Debt — Xcel Energy Inc., NSP-Minnesota, NSP-Wisconsin, PSCo and SPS each have individual commercial paper programs. Authorized levels for these commercial paper programs are:\n•\n$1.50 billion for Xcel Energy Inc.\n•\n$700 million for PSCo.\n•\n$700 million for NSP-Minnesota.\n•\n$500 million for SPS.\n•\n$150 million for NSP-Wisconsin.\nSee Note 5 to the consolidated financial statements for further information.\nCredit Facility Agreements — As of Feb. 24, 2025, Xcel Energy Inc. and its utility subsidiaries had the following committed credit facilities available to meet liquidity needs:\n(Millions of Dollars)\nFacility\n \n(a)\nDrawn\n \n(b)\nAvailable\nCash\nLiquidity\nXcel Energy Inc.\n$\n1,500 \n$\n660 \n$\n840 \n$\n25 \n$\n865 \nPSCo\n700 \n101 \n599 \n10 \n609 \nNSP-Minnesota\n700 \n375 \n325 \n7 \n332 \nSPS\n500 \n255 \n245 \n7 \n252 \nNSP-Wisconsin\n150 \n27 \n123 \n3 \n126 \nTotal\n$\n3,550 \n$\n1,418 \n$\n2,132 \n$\n52 \n$\n2,184 \n(a)\nCredit facilities expire in September 2027.\n(b)\nIncludes outstanding commercial paper and letters of credit.\nXcel Energy Inc., NSP-Minnesota, PSCo and SPS each have the right to request an extension of the revolving credit facility for two additional one-year periods. NSP-Wisconsin has the right to request an extension of the revolving credit facility for an additional year. All extension requests are subject to majority bank group approval. \nRegistration Statements \n—\n Xcel Energy Inc.’s Articles of Incorporation authorize the issuance of one billion shares of $2.50 par value common stock. As of Dec. 31, 2024 and 2023, Xcel Energy had approximately 574 million shares and 555 million shares of common stock outstanding, respectively. \nXcel Energy Inc. and its utility subsidiaries have registration statements on file with the SEC which are uncapped, permitting Xcel Energy Inc. and its utility subsidiaries to issue debt, equity and other securities. Debt issuance at our utility subsidiaries are subject to commission approval.\nLong-Term Borrowings, Equity Issuances and Other Financing Instruments\n \n—\n Xcel Energy may issue equity through its ATM program, forward equity agreements or other offerings. Financing plans are subject to change, depending on capital expenditures, regulatory outcomes, internal cash generation, market conditions, changes in tax policies and other factors.\n42\nTable of Contents\n     \nPlanned Financing Activity\n \n—\n Xcel Energy’s 2025 financing plans reflect the following:\nIssuer\nSecurity\nAmount (Millions of Dollars)\nExpected Tenor\nAnticipated Timing\nXcel Energy Inc.\nSenior Unsecured Notes\n$\n1,000 \n10 Year\nFirst Quarter\nPSCo\nFirst Mortgage Bonds\n2,000 \n10 Year & \n30 Year\nSecond & Third Quarter\nNSP-Minnesota\nFirst Mortgage Bonds\n1,100 \n10 Year & \n30 Year\nFirst & Third Quarter\nSPS\nFirst Mortgage Bonds\n450\n30 Year\nSecond Quarter\nNSP-Wisconsin\nFirst Mortgage Bonds\n250\n30 Year\nSecond Quarter\nSee Note 5 to the consolidated financial statements for further information.\nEarnings Guidance and Long-Term EPS and Dividend Growth Rate Objectives\nXcel Energy 2025 Earnings Guidance\n — Xcel Energy’s 2025 ongoing earnings guidance is a range of $3.75 to $3.85 per share.\n(a)\nKey assumptions as compared with 2024 actual levels unless noted:\n•\nConstructive outcomes in all pending rate case and regulatory proceedings, including requests for deferral of incremental insurance costs associated with wildfire risk and recovery of O&M costs associated with wildfire mitigation plans.\n•\nNormal weather patterns for the year.\n•\nWeather-normalized retail electric sales are projected to increase ~3%.\n•\nWeather-normalized retail firm natural gas sales are projected to increase ~1%. \n•\nCapital rider revenue is projected to increase $260 million to $270 million (net of PTCs).\n•\nO&M expenses are projected to increase ~3%.\n•\nDepreciation expense is projected to increase approximately $210 million to $220 million.\n•\nProperty taxes are projected to increase $55 million to $65 million. \n•\nInterest expense (net of AFUDC - debt) is projected to increase $165 million to $175 million, net of interest income. \n•\nAFUDC - equity is projected to increase $110 million to $120 million.\n(a)\nOngoing earnings is calculated using net income and adjusting for certain nonrecurring or infrequent items that are, in management’s view, not reflective of ongoing operations. Ongoing earnings could differ from those prepared in accordance with GAAP for unplanned and/or unknown adjustments. As Xcel Energy is unable to quantify the financial impacts of any additional adjustments that may occur for the year, we are unable to provide a quantitative reconciliation of the guidance for ongoing EPS to corresponding GAAP EPS.\nLong-Term EPS and Dividend Growth Rate Objectives \n—\n \nXcel Energy expects to deliver an attractive total return to our shareholders through a combination of earnings growth and dividend yield, based on the following long-term objectives:\n•     Deliver long-term annual EPS growth of 6% to 8% based off of $3.55 per share (the mid-point of 2024 original ongoing earnings guidance of $3.50 to $3.60 per share).\n•    Deliver annual dividend increases of 4% to 6%.\n•     Target a dividend payout ratio of 50% to 60%.\n•     Maintain senior secured debt credit ratings in the A range.",
  "item2": null
}