{
  "source_file": "xel-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "ITEM 2 — MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion and analysis by management focuses on those factors that had a material effect on Xcel Energy’s financial condition, results of operations and cash flows during the periods presented or are expected to have a material impact in the future. It should be read in conjunction with the accompanying unaudited consolidated financial statements and the related notes to consolidated financial statements. Due to the seasonality of Xcel Energy’s operating results, quarterly financial results are not an appropriate base from which to project annual results. \nThe demand for electric power and natural gas is affected by seasonal differences in the weather. In general, peak sales of electricity occur in the summer months, and peak sales of natural gas occur in the winter months. As a result, the overall operating results may fluctuate substantially on a seasonal basis. Additionally, Xcel Energy’s operations have historically generated less revenues and income when weather conditions are milder in the winter and cooler in the summer.\nNon-GAAP Financial Measures\nThe following discussion includes financial information prepared in accordance with GAAP, as well as certain non-GAAP financial measures such as ongoing earnings and ongoing diluted EPS. Generally, a non-GAAP financial measure is a measure of a company’s financial performance, financial position or cash flows that adjusts measures calculated and presented in accordance with GAAP. \nXcel Energy’s management uses non-GAAP measures for financial planning and analysis, for reporting of results to the Board of Directors, in determining performance-based compensation and communicating its earnings outlook to analysts and investors. Non-GAAP financial measures are intended to supplement investors’ understanding of our performance and should not be considered alternatives for financial measures presented in accordance with GAAP. These measures are discussed in more detail below and may not be comparable to other companies’ similarly titled non-GAAP financial measures.\nEarnings Adjusted for Certain Items (Ongoing Earnings and Ongoing Diluted EPS)\nGAAP diluted EPS reflects the potential dilution that could occur if securities or other agreements to issue common stock (i.e., common stock equivalents) were settled. The weighted average number of potentially dilutive shares outstanding used to calculate Xcel Energy Inc.’s diluted EPS is calculated using the treasury stock method. \nOngoing earnings reflect adjustments to GAAP earnings (net income) for certain items. Ongoing diluted EPS for Xcel Energy is calculated by dividing net income or loss, adjusted for certain items, by the weighted average fully diluted Xcel Energy Inc. common shares outstanding for the period. Ongoing diluted EPS for each subsidiary is calculated by dividing the net income or loss for such subsidiary, adjusted for certain items, by the weighted average fully diluted Xcel Energy Inc. common shares outstanding for the period.\n24\nTable of Contents\nWe use these non-GAAP financial measures to evaluate and provide details of Xcel Energy’s core earnings and underlying performance. For instance, to present ongoing earnings and ongoing diluted EPS, we may adjust the related GAAP amounts for certain items that are non-recurring in nature. We believe these measurements are useful to investors to evaluate the actual and projected financial performance and contribution of our subsidiaries. These non-GAAP financial measures should not be considered as an alternative to measures calculated and reported in accordance with GAAP.\nThe following table provides a reconciliation of GAAP earnings (net income) to ongoing earnings:\nThree Months Ended Sept. 30\nNine Months Ended Sept. 30\n(Millions of Dollars)\n2025\n2024\n2025\n2024\nGAAP net income\n$\n524 \n$\n682 \n$\n1,451 \n$\n1,472 \nSherco Unit 3 2011 outage refunds\n— \n35 \n— \n46 \nMarshall Wildfire litigation \n287 \n— \n287 \n— \nTax effect\n(74)\n(10)\n(74)\n(13)\nOngoing earnings\n$\n737 \n$\n707 \n$\n1,664 \n$\n1,505 \nSherco Unit 3 2011 Outage Refunds —\n NSP-Minnesota’s Sherco Unit 3 experienced an extended outage following a 2011 incident which damaged its turbine. In October 2024 following contested case procedures, the MPUC ordered a customer refund of $46 million for replacement power incurred during the outage, which is presented as a non-recurring charge to electric revenues.\nMarshall Wildfire Litigation \n—\n In the third quarter of 2025, PSCo recognized a non-recurring $287 million charge as a result of a settlement reached with the plaintiffs in the Marshall Wildfire litigation. \nResults of Operations\nThe only common equity securities that are publicly traded are common shares of Xcel Energy Inc. Diluted earnings and EPS of each subsidiary discussed below do not represent a direct legal interest in the assets and liabilities allocated to such subsidiary but rather represent a direct interest in our assets and liabilities as a whole.\nXcel Energy’s third quarter GAAP diluted earnings were $0.88 per share compared with $1.21 per share in the same period in 2024 and ongoing earnings were $1.24 compared with $1.25 per share in 2024. The change in ongoing earnings per share was primarily driven by higher depreciation, interest charges and O&M expenses partially offset by increased recovery of infrastructure investments. Fluctuations in electric and natural gas revenues associated with changes in fuel and purchased power and/or natural gas sold and transported generally do not significantly impact earnings (changes in costs are offset by the related variation in revenues). \nSummarized diluted EPS for Xcel Energy:\nThree Months Ended Sept. 30\nNine Months Ended Sept. 30\nDiluted Earnings (Loss) Per Share\n2025\n2024\n2025\n2024\nNSP-Minnesota\n$\n0.53 \n$\n0.45 \n$\n1.17 \n$\n1.06 \nPSCo\n0.08 \n0.45 \n0.79 \n1.06 \nSPS\n0.27 \n0.31 \n0.55 \n0.58 \nNSP-Wisconsin\n0.07 \n0.07 \n0.19 \n0.19 \nEarnings from equity method investments — WYCO\n0.01 \n0.01 \n0.02 \n0.02 \nRegulated utility\n0.96 \n1.29 \n2.72 \n2.91 \nXcel Energy Inc. and Other\n(0.07)\n(0.08)\n(0.24)\n(0.28)\nGAAP diluted EPS \n(a)\n$\n0.88 \n$\n1.21 \n$\n2.47 \n$\n2.63 \nSherco Unit 3 2011 outage refunds\n— \n0.04 \n— \n0.06 \nMarshall Wildfire settlement\n0.36 \n— \n0.36 \n— \nOngoing diluted EPS \n(a)\n$\n1.24 \n$\n1.25 \n$\n2.84 \n$\n2.69 \n(a)\nAmounts may not add due to rounding.\nSummary of Earnings\nNSP-Minnesota \n— GAAP earnings increased $0.08 per share and ongoing earnings increased \n$0.04\n for the third quarter. Year-to-date GAAP earnings increased $0.11 per share and ongoing earnings increased \n$0.05\n per share. The year-to-date ongoing earnings increase was driven by higher recovery of electric infrastructure investments, which was partially offset by increased O&M expenses, depreciation and interest charges.\nPSCo \n— GAAP earnings decreased $0.37 per share and ongoing earnings decreased $0.01 for the third quarter of 2025. Year-to-date GAAP earnings decreased $0.27 and ongoing earnings increased $0.09. The year-to-date ongoing earnings increase was driven by higher recovery of electric and natural gas infrastructure investments, which was partially offset by increased depreciation and interest charges. \nSPS \n— GAAP and ongoing earnings decreased $0.04 per share for the third quarter and decreased $0.03 year-to-date. The year-to-date change was driven by unfavorable weather, increased interest charges and O&M expenses, partially offset by higher recovery of electric infrastructure investments and sales growth. \nNSP-Wisconsin \n— GAAP and ongoing earnings per share were flat for the third quarter of 2025 and year-to-date. The year-to-date change was driven by higher recovery of electric and natural gas infrastructure investments, which was offset by increased depreciation and O&M expenses.\nXcel Energy Inc. and Other \n— Primarily includes financing costs and interest income at the holding company and earnings from investment funds, which are accounted for as equity method investments. The change in earnings was largely due to gains on debt repurchases, partially offset by higher interest rates and debt levels and the performance of the equity method investments, which primarily invest in energy technology companies.\n25\nTable of Contents\nChanges in GAAP and Ongoing EPS\nComponents significantly contributing to changes in 2025 EPS compared to 2024:\nDiluted Earnings (Loss) Per Share\nThree Months Ended Sept. 30\nNine Months Ended Sept. 30\nGAAP EPS — 2024\n$\n1.21\n \n$\n2.63\n \nComponents of change - 2025 vs. 2024\nHigher electric revenues\n0.28 \n0.76 \nHigher natural gas revenues\n0.03 \n0.24 \nHigher AFUDC equity & debt\n0.08 \n0.18 \nSherco Unit 3 2011 outage refunds\n0.04 \n0.06 \nMarshall Wildfire settlement\n(0.36)\n(0.36)\nHigher electric fuel and purchased power \n(a)\n(0.05)\n(0.23)\nHigher depreciation\n(0.09)\n(0.21)\nHigher O&M expenses\n(0.05)\n(0.17)\nHigher interest charges\n(0.08)\n(0.17)\nHigher costs of natural gas sold and transported\n (a)\n— \n(0.06)\nCommon stock equity dilution\n(0.07)\n(0.14)\nOther, net\n(0.06)\n(0.06)\nGAAP EPS — 2025\n$\n0.88\n \n$\n2.47\n \nMarshall Wildfire settlement\n0.36 \n0.36 \nOngoing EPS — 2025\n (b)\n$\n1.24\n \n$\n2.84\n \n(a)\nCost of electric fuel and purchased power and natural gas sold and transported are generally recovered through regulatory recovery mechanisms and offset in revenue.\n(b)\nAmounts may not add due to rounding.\nStatement of Income Analysis\nThe following summarizes the items that affected the individual revenue and expense items reported in the consolidated statements of income.\nEstimated Impact of Temperature Changes on Regulated Earnings\n —Unusually hot summers or cold winters increase electric and natural gas sales, while mild weather reduces electric and natural gas sales. The estimated impact of weather on earnings is based on the number of customers, temperature variances, the amount of natural gas or electricity historically used per degree of temperature and excludes any incremental related operating expenses that could result due to storm activity or vegetation management requirements. \nAs a result, weather deviations from normal levels can affect Xcel Energy’s financial performance. Gas decoupling mechanisms (and electric sales true-up in 2024) in Minnesota predominately mitigate the positive and adverse impacts of weather in that jurisdiction. \nDegree-day or THI data is used to estimate amounts of energy required to maintain comfortable indoor temperature levels based on each day’s average temperature and humidity. HDD is the measure of the variation in the weather based on the extent to which the average daily temperature falls below 65° Fahrenheit. CDD is the measure of the variation in the weather based on the extent to which the average daily temperature rises above 65° Fahrenheit.\nEach degree of temperature above 65° Fahrenheit is counted as one CDD, and each degree of temperature below 65° Fahrenheit is counted as one HDD. In Xcel Energy’s more humid service territories, a THI is used in place of CDD, which adds a humidity factor to CDD. HDD, CDD and THI are most likely to impact the usage of Xcel Energy’s residential and commercial customers. Industrial customers are less sensitive to weather. Typically, sales are not impacted in the first or fourth quarter due to THI or CDD. \nNormal weather conditions are defined as either the 10, 20 or 30 year average of actual historical weather conditions. The historical period of time used in the calculation of normal weather differs by jurisdiction, based on regulatory practice. To calculate the impact of weather on demand, a demand factor is applied to the weather impact on sales. Extreme weather variations, windchill and cloud cover may not be reflected in weather-normalized estimates. \nPercentage increase (decrease) in normal and actual HDD, CDD and THI:\nThree Months Ended Sept. 30\nNine Months Ended Sept. 30\n2025 vs. Normal\n2024 vs. Normal\n2025 vs. 2024\n2025 vs. Normal\n2024 vs. Normal\n2025 vs. 2024\nHDD\n(30.6)\n%\n(72.7)\n%\n135.7 \n%\n(1.9)\n%\n(14.7)\n%\n12.3 \n%\nCDD\n(7.2)\n20.1 \n(20.8)\n(6.8)\n24.7 \n(23.0)\nTHI\n12.3 \n(1.8)\n15.9 \n7.3 \n(10.8)\n21.9 \nWeather\n — Estimated impact of temperature variations on EPS compared with normal weather conditions:\nThree Months Ended Sept. 30\nNine Months Ended Sept. 30\n2025 vs. Normal\n2024 vs. Normal\n2025 vs. 2024\n2025 vs. Normal\n2024 vs. Normal\n2025 vs. 2024\nRetail electric\n$\n0.006 \n$\n0.038 \n$\n(0.032)\n$\n(0.001)\n$\n0.015 \n$\n(0.016)\nSales true-up\n (a)\n— \n(0.001)\n0.001 \n— \n0.040 \n(0.040)\nElectric total\n$\n0.006 \n$\n0.037 \n$\n(0.031)\n$\n(0.001)\n$\n0.055 \n$\n(0.056)\nFirm natural gas\n— \n(0.002)\n0.002 \n— \n(0.040)\n0.040 \nDecoupling\n0.001 \n(0.001)\n0.002 \n0.003 \n0.017 \n(0.014)\nNatural gas total\n$\n0.001 \n$\n(0.003)\n$\n0.004 \n$\n0.003 \n$\n(0.023)\n$\n0.026 \nTotal\n$\n0.007 \n$\n0.034 \n$\n(0.027)\n$\n0.002 \n$\n0.032 \n$\n(0.030)\n(a)\nThe sales true-up mechanism in NSP-Minnesota expired in 2024 and is proposed in the pending Minnesota electric rate case to be reestablished in 2026.\nSales \n— Sales growth (decline) for actual and weather-normalized sales in 2025 compared to 2024:\nThree Months Ended Sept. 30\nNSP-Minnesota\nPSCo\nSPS\nNSP-Wisconsin\nXcel Energy\nActual\nElectric residential\n6.4 \n%\n(0.1)\n%\n(7.5)\n%\n3.5 \n%\n1.6 \n%\nElectric C&I\n(0.8)\n(1.5)\n5.4 \n0.1 \n1.0 \nTotal retail electric sales\n1.7\n(0.9)\n2.8 \n1.0 \n1.1 \nFirm natural gas sales\n3.7 \n4.9 \nN/A\n(4.5)\n4.0 \nThree Months Ended Sept. 30\nNSP-Minnesota\nPSCo\nSPS\nNSP-Wisconsin\nXcel Energy\nWeather-Normalized\nElectric residential\n1.9 \n%\n5.2 \n%\n3.3 \n%\n1.9 \n%\n3.3 \n%\nElectric C&I\n(1.9)\n1.5 \n6.5 \n(0.1)\n1.9 \nTotal retail electric sales\n(0.6)\n2.9 \n5.7 \n0.4 \n2.2 \nFirm natural gas sales\n1.7 \n1.7 \nN/A\n(6.2)\n1.2 \n26\nTable of Contents\nNine Months Ended Sept. 30\nNSP-Minnesota\nPSCo\nSPS\nNSP-Wisconsin\nXcel Energy\nActual\nElectric residential\n6.0 \n%\n(0.9)\n%\n(2.1)\n%\n6.1 \n%\n2.2 \n%\nElectric C&I\n0.1 \n(0.3)\n6.3 \n0.2 \n1.9 \nTotal retail electric sales\n2.0 \n(0.5)\n4.7 \n1.8 \n1.9 \nFirm natural gas sales\n15.0 \n2.2 \nN/A\n18.5 \n7.0 \nNine Months Ended Sept. 30\nNSP-Minnesota\nPSCo\nSPS\nNSP-Wisconsin\nXcel Energy\nWeather-Normalized\nElectric residential\n1.2 \n%\n2.4 \n%\n4.4 \n%\n1.7 \n%\n2.2 \n%\nElectric C&I\n(0.9)\n1.2 \n7.0 \n(0.2)\n2.2 \nTotal retail electric sales\n(0.2)\n1.6 \n6.4 \n0.3 \n2.1 \nFirm natural gas sales\n— \n(2.0)\nN/A\n2.4 \n(1.1)\nNine Months Ended Sept. 30 (Leap Year Adjusted)\nNSP-Minnesota\nPSCo\nSPS\nNSP-Wisconsin\nXcel Energy\nWeather-Normalized\nElectric residential\n1.6 \n%\n2.8 \n%\n4.8 \n%\n2.1 \n%\n2.5 \n%\nElectric C&I\n(0.5)\n1.6 \n7.4 \n0.1 \n2.6 \nTotal retail electric sales\n0.2 \n2.0 \n6.8 \n0.6 \n2.5 \nFirm natural gas sales\n0.9 \n(1.2)\nN/A\n3.3 \n(0.3)\nWeather-normalized and leap-year adjusted electric sales growth (decline) — year-to-date\n•\nNSP-Minnesota — Residential sales increased due to customer growth (1.1%) and increase in use per customer (0.4%). C&I sales decreased due to lower use per customer. \n•\nPSCo — Residential sales increased due to increased use per customer (1.6%) and customer growth (1.2%). C&I sales increased due to higher use per customer and customer growth, primarily in the information and energy sectors.\n•\nSPS — Residential sales increased due to higher use per customer (4.1%) and customer growth (0.7%). C&I sales increased due to higher use per customer, primarily driven by the energy sector. \n•\nNSP-Wisconsin — Residential sales increased due to both increased use per customer (1.1%) and customer growth (1.0%). \nWeather-normalized and leap-year adjusted natural gas sales growth (decline) \n—\n year-to-date\n•\nDecrease in natural gas sales was driven primarily by decreased use per customer in PSCo residential, partially offset by growth in other jurisdictions.\nElectric Revenues\nElectric revenues are impacted by fluctuations in the price of natural gas, coal and uranium, regulatory outcomes, market prices and seasonality. In addition, electric customers receive a credit for PTCs generated, which reduce electric revenue and income taxes.\n(Millions of Dollars)\nThree Months Ended Sept. 30, 2025 vs. 2024\nNine Months Ended Sept. 30, 2025 vs. 2024\nRecovery of higher cost of electric fuel and purchased power\n$\n28 \n$\n160 \nNon-fuel riders\n35 \n151 \nRegulatory rate outcomes (MN and ND)\n46 \n98 \nSales and demand\n44 \n98 \nTransmission revenues\n14 \n48 \nSherco Unit 3 2011 outage refunds\n35 \n46 \nPTCs flowed back to customers (offset in ETR)\n32 \n17 \nEstimated impact of weather\n(21)\n(39)\nConservation and demand side management (offset in expense)\n(19)\n(34)\nOther, net \n51 \n69 \nTotal increase \n$\n245 \n$\n614 \nNatural Gas Revenues\nNatural gas revenues vary with changing sales, the cost of natural gas and regulatory outcomes.\n(Millions of Dollars)\nThree Months Ended Sept. 30, 2025 vs. 2024\nNine Months Ended Sept. 30, 2025 vs. 2024\nRegulatory rate outcomes (CO)\n$\n10 \n$\n82 \nRecovery of higher cost of natural gas\n5 \n53 \nConservation revenue (offset in expense)\n6 \n34 \nEstimated impact of weather (net of decoupling)\n3 \n19 \nRetail sales decline (net of decoupling)\n(3)\n(13)\nOther, net\n4 \n5 \nTotal increase\n$\n25 \n$\n180 \nElectric Fuel and Purchased Power \n—\n \nExpenses incurred for electric fuel and purchased power are impacted by fluctuations in market prices of electricity, natural gas, coal and uranium, as well as seasonality. These incurred expenses are generally recovered through various regulatory recovery mechanisms. As a result, changes in these expenses are largely offset in operating revenues and have minimal earnings impact. \nElectric fuel and purchased power expenses increased $38 million for the third quarter of 2025 and $173 million year-to-date. The year-to-date increase was primarily due to increased commodity prices and transmission expense partially offset by decreased volumes and timing of fuel recovery mechanisms. \nCost of Natural Gas Sold and Transported \n—\n \nExpenses incurred for the cost of natural gas sold are impacted by market prices and seasonality. These costs are generally recovered through various regulatory recovery mechanisms. As a result, changes in these expenses are largely offset in operating revenues and have minimal earnings impact.\nNatural gas sold and transported decreased $2 million for the third quarter of 2025 and increased $44 million year-to-date. The year-to-date increase was primarily due to higher commodity prices and volumes, partially offset by timing of fuel recovery mechanisms.\nNon-Fuel Operating Expenses and Other Items\nO&M Expenses\n — O&M expenses increased $37 million for the third quarter of 2025 and $131 million year-to-date. The year-to-date increase was primarily due to increased benefits and healthcare costs, nuclear generation costs and insurance costs.\n27\nTable of Contents\nDepreciation and Amortization \n— Depreciation and amortization increased $69 million for the third quarter of 2025 and $158 million year-to-date. The year-to-date increase was largely the result of system investment.\nOther Income \n— Other income increased $7 million for the third quarter of 2025 and $46 million year-to-date, largely due to gains on debt repurchases in the second quarter of 2025. \nInterest Charges \n— Interest charges increased $58 million for the third quarter of 2025 and $129 million year-to-date, largely due to higher debt levels and interest rates.\nAFUDC, Equity and Debt \n— AFUDC increased $50 million for the third quarter of 2025 and $112 million year-to-date, largely the result of system investment. \nPublic Utility Regulation and Other \nThe FERC and various state and local regulatory commissions regulate Xcel Energy Inc.’s utility subsidiaries and West Gas Interstate. Xcel Energy is subject to rate regulation by state utility regulatory agencies, which have jurisdiction with respect to the rates of electric and natural gas distribution companies in Minnesota, North Dakota, South Dakota, Wisconsin, Michigan, Colorado, New Mexico and Texas.\nRates are designed to recover plant investment, operating costs and an allowed return on investment. Our utility subsidiaries request changes in utility rates through commission filings. Changes in operating costs can affect Xcel Energy’s financial results, depending on the timing of rate cases and implementation of final rates. Other factors affecting rate filings are new investments, sales, conservation and demand side management efforts, and the cost of capital. \nIn addition, the regulatory commissions authorize the ROE, capital structure and depreciation rates in rate proceedings. Decisions by these regulators can significantly impact Xcel Energy’s results of operations.\nExcept to the extent noted below, the circumstances set forth in Public Utility Regulation included in Item 7 of Xcel Energy’s Annual Report on \nForm 10-K\n for the year ended Dec. 31, 2024 appropriately represent, in all material respects, the current status of public utility regulation and are incorporated herein by reference.\nNSP-Minnesota\nUpcoming, Pending and Recently Concluded Regulatory Proceedings\n2025 Minnesota Natural Gas Rate Case \n— On Oct. 31, 2025, NSP-Minnesota plans to file a natural gas rate case in Minnesota, seeking a total revenue increase of $63 million (8.2%). The filing is based on a 2026 forecast test year and includes an ROE of 10.65%, a 52.5% equity ratio and rate base of $1.5 billion. NSP-Minnesota will also request interim rates of $51 million to go into effect on Jan. 1, 2026. As part of the request, NSP-Minnesota plans to file an option for a stay-out alternative. \n2022 Minnesota Electric Rate Case —\n In October 2021, NSP-Minnesota filed a three-year electric rate case with the MPUC. \nIn July 2023, the MPUC approved a three-year rate increase of approximately $332 million for 2022-2024, based on a ROE of 9.25% and an equity ratio of 52.5%. The MPUC also approved a continuation of the sales true-up mechanism.\nIn November 2023, NSP-Minnesota filed an appeal to the Minnesota Court of Appeals regarding MPUC decisions relating to executive compensation, insurance expense and treatment of prepaid pension assets.\nIn January 2025, the Court issued its opinion, which upheld the commission's determination on insurance expense, but reversed and remanded the executive compensation and prepaid pension asset decisions back to the MPUC. In June 2025, the MPUC ordered proceedings to reconsider the treatment of prepaid pension assets and executive compensation, with the procedural schedule expected to be established in the fourth quarter of 2025. \n2024 Minnesota Electric Rate Case —\n \nIn November 2024, NSP-Minnesota filed an electric rate case in Minnesota based on an ROE of 10.3%, a 52.5% equity ratio and rate base of $13.2 billion in 2025 and $14 billion in 2026. In December 2024, the MPUC approved interim rates of $192 million, effective Jan. 1, 2025. In March 2025, NSP-Minnesota filed supplemental direct testimony, updating its total revenue request to $473 million. \nIn August 2025, eight parties filed testimony. The DOC, OAG, XLI, the CUB, Walmart and Joint Intervenors were the only parties to quantify recommended financial adjustments. XLI recommended $190 million in proposed adjustments, based on a reduced ROE and a reduction in certain O&M expenses. CUB recommended proposed adjustments based on a reduced ROE and elimination of reconnection and late fee revenues. Walmart recommended an adjustment based on a reduced ROE. Other parties provided issue specific recommendations. \nProposed DOC modifications to NSP-Minnesota’s request are summarized below:\n(Millions of Dollars)\n2025\n2026\nNSP-Minnesota’s filed base revenue request\n$\n344 \n$\n473 \nRecommended adjustments:\nRate of return\n(101)\n(107)\nO&M expenses\n(62)\n(56)\nGeneration capacity revenue \n(a)\n(39)\n(40)\nDepreciation\n(29)\n(32)\nFederal production tax credits \n(a)\n(22)\n(10)\nRiverside Generating Plant outage\n \n(b)\n(18)\n(13)\nPrepaid pension assets and liability\n(11)\n(11)\nProperty tax\n \n(a)\n(4)\n(12)\nOther, net\n(9)\n(25)\nTotal adjustments\n(295)\n(306)\nTotal proposed revenue change\n$\n49 \n$\n167 \n(a)\nAdjustments largely offset in trackers.\n(b)\nRiverside Generating Plant experienced a mechanical failure in April 2025 that resulted in an extended outage.\nPositions on NSP-Minnesota’s filed rate request:\nRecommended Position\nDOC\nXLI\nCUB\nWalmart\nROE\n9.25%\n8.96%\n9.00%\n9.25%\nEquity\n52.50%\nN/A\nN/A\nN/A\nIn October 2025, NSP-Minnesota filed rebuttal testimony, updating its total revenue request to $365 million. Of NSP-Minnesota’s proposed adjustments, approximately $100 million relates to depreciation expense and $50 million are largely offset in trackers. \nAn ALJ report is expected in April 2026, with a MPUC decision expected in the third quarter of 2026.\n28\nTable of Contents\n2025 South Dakota Electric Rate Case —\n \nIn June 2025, NSP-Minnesota filed a request with the SDPUC for a net annual electric rate increase of $44 million (15%). The filing is based on a 2024 historic test year, a requested ROE of 10.3%, rate base of approximately $1.2 billion and an equity ratio of 52.87%. NSP-Minnesota will request interim rates to begin on Jan. 1, 2026. If approved as filed, this rate request would result in an average annual residential bill increase of 3% over the period from 2016-2026.\nThe procedural schedule is as follows:\n•\nIntervenor direct testimony: March 20, 2026\n•\nRebuttal testimony: April 14, 2026\n•\nEvidentiary Hearing: April 28-30, 2026\nA SDPUC decision is expected in the second quarter of 2026.\n2024 North Dakota Electric Rate Case —\n \nIn December 2024, NSP-Minnesota filed a request with the NDPSC for an annual electric rate increase of approximately $45 million, or 19.3% over current rates established in 2021. The filing is based on a 2025 forecast test year and includes a requested ROE of 10.3%, rate base of approximately $817 million and an equity ratio of 52.5%. In January 2025, the NDPSC approved interim rates, subject to refund, of approximately $27 million (implemented on Feb. 1, 2025). \nOn July 8, 2025, two intervenors filed testimony with a range of recommendations. NDPSC Staff recommended an increase of approximately $30 million, with a 9.41% ROE and a 50% equity ratio, along with other proposed adjustments that were not quantified. NSP-Minnesota estimates the NDPSC Staff recommendation would result in a rate increase of $20 million to $25 million. A NDPSC decision is expected in early 2026.\nNSP-Wisconsin\nPending and Recently Concluded Regulatory Proceedings\nExcess Liability Insurance Deferral\n – \nIn February 2025, NSP-Wisconsin filed a request with the PSCW for deferred accounting treatment for excess liability insurance expense of $9.6 million incurred as a result of the October 2024 policy renewal. The PSCW verbally approved the request in August 2025.\nWisconsin Electric\n \nand Natural Gas Rate Case \n– In March 2025, NSP-Wisconsin filed a request with the PSCW for a multi-year electric and natural gas rate increase. \nFor the electric utility, NSP-Wisconsin is seeking a total electric revenue increase of $94 million (11.8%) in 2026 and an incremental $57 million (7.1%) in 2027, for a total of $151 million over the two-year period of 2026 and 2027. The electric rate increase is based on electric rate base of $2.9 billion in 2026 and $3.2 billion in 2027. For the natural gas utility, NSP-Wisconsin requested a total natural gas revenue increase of $20 million (12.7%) in 2026 and an incremental $4 million (1.5%) in 2027, for a total of $24 million (14.2%) over the two-year period of 2026 and 2027. The natural gas rate increase is based on natural gas rate base of $0.3 billion in 2026 and $0.4 billion in 2027. Both the electric and natural gas rate requests are based on forward-looking test years, with a 10.0% ROE and an equity ratio of 53.5%.\nOn August 8, 2025, the PSCW Staff and intervenors filed their direct testimony. The PSCW Staff recommended an electric base rate increase of $115 million or 14.4% over the two-year period. The PSCW Staff additionally recommended a natural gas rate increase of $21 million, or 12.3% over the two-year period, all based on a ROE of 9.7% and an equity ratio of 53.5%.\nIntervenors mainly limited their comments on revenue requirements to ROE focusing the majority of their testimony on cost of service, rate design and other policy issues. \nThe major components of the PSCW Staff recommendation are summarized below:\n(Millions of Dollars)\nElectric\nNatural Gas\nNSP-Wisconsin’s filed two-year rate request\n$\n151 \n$\n24 \nPSCW Staff recommended adjustments:\nCapital investments \n(a)\n(15)\n(1)\nROE adjustment\n(7)\n(1)\nO&M expenses\n(6)\n(1)\nNuclear decommissioning accrual update \n(b)\n(6)\n—\nOther, net\n(2)\n—\nProposed revenue change\n$\n115 \n$\n21 \n(a)\nCapital investment adjustment includes $7 million associated with two MISO LRTP projects that are pending PSCW approval (Grid Forward and Western Wisconsin Transmission Connection). It is PSCW Staff historic practice to recommend adjustments for projects until Commission approval is received. Approval of both LRTP projects is anticipated in the fourth quarter of 2025. \n(b)\nSince filing the case, the Minnesota Public Utilities Commission authorized a reduction to the annual nuclear decommissioning accrual. This reduction, which flows to NSP-Wisconsin through the interchange agreement, reduced the NSP-Wisconsin rate request and is earnings neutral.\n \nA PSCW decision is anticipated in the fourth quarter of 2025.\nMichigan Natural Gas Rate Case \n– In July 2025, NSP-Wisconsin filed a natural gas rate case in Michigan, seeking a revenue increase of $2.2 million. An MPSC decision is expected in early 2026.\nNSP System\nNSP-Minnesota and NSP-Wisconsin are actively engaged in multiple processes and proceedings to acquire resources to meet their identified generation resource needs.\n•\nIn October 2023, NSP-Minnesota issued an RFP seeking 1,200 MW of wind assets to replace capacity and reutilize interconnection rights associated with the retiring Sherco coal facilities. The RFP closed in December 2023. NSP-Minnesota expects to file for approval of recommended projects in early 2026.\n•\nIn 2024, NSP-Minnesota and NSP-Wisconsin each issued an RFP collectively seeking up to 1,600 MW of wind, solar, storage or hybrid resources to interconnect to the NSP System, including reutilization of the interconnection rights associated with the retiring Sherco coal units, and 650 MW of solar and storage resources to specifically reutilize the interconnection rights associated with the retiring King coal unit. NSP-Minnesota and NSP-Wisconsin announced the short listed projects in January 2025 and plan to file for the requisite approvals of the selected resources with the MPUC and PSCW, respectively, in the fourth quarter of 2025.\n•\nNSP-Minnesota and NSP-Wisconsin will continue to file additional RFPs throughout 2025 and 2026 for resource needs approved as part of the 2024 Upper Midwest Resource Plan. \n29\nTable of Contents\nPSCo\nPending and Recently Concluded Regulatory Proceedings\nColorado Natural Gas Rate Case — \nIn January 2024, PSCo, filed a request with the CPUC seeking an increase to retail natural gas rates of $171 million (9.5%). The request was based on a 10.25% ROE, an equity ratio of 55%, a 2023 test year and a $4.2 billion year-end rate base. \nIn October 2024, as modified on ARRR in January 2025, the CPUC issued an order including the following key decisions:\n•\nUse of a historic 2023 test year, with a 13-month average rate base.\n•\nWeighted-average cost of capital of 7.0%, based on an ROE range of 9.2%-9.5% and an equity ratio range of 52%-55%.\n•\nAcceleration of $15 million per year of depreciation expense (incremental to PSCo’s original rate request), to potentially be held in an external trust for future decommissioning costs.\n•\nModifications to recoverability of certain operating expenses.\n•\nDenial of PSCo’s decoupling proposal.\nPSCo placed new rates into effect in November, as modified on ARRR in February 2025, with an annual revenue increase of approximately $125 million, inclusive of $15 million of accelerated depreciation. In May 2025, PSCo filed an appeal with the Denver District Court seeking review of the CPUC’s decisions related to recovery of certain operating expenses, cost of capital and capital structure, and the treatment of gas storage inventory costs. Briefing will be completed in the fourth quarter of 2025.\nColorado Resource Plan\n \n— In December 2023, the CPUC approved a portfolio of 5,835 MW, which includes approximately 3,100 MW of company owned resources and 2,700 MW of PPAs. \nIn September 2024, PSCo filed a proposed framework for CPUC review of pricing adjustments for both company-owned and PPA resources to enable delivery of the approved portfolio in light of supply chain and geopolitical developments. In January 2025, the CPUC issued a decision granting limited potential pricing relief including potential tariff impacts, subject to evaluation in future CPCN proceedings for company owned projects. In September 2025, the CPUC authorized the process for company-owned and PPA resources to seek up to 15% relief for tariff impacts to projects. Relief requests are due by Dec. 31, 2025 or 18 months prior to COD. The CPUC will ultimately review and approve/deny requests. \nPSCo has filed all generation CPCNs associated with company-owned generation from the Colorado Energy Plan and expects to continue filing transmission CPCNs throughout 2025 and 2026.\n2024 Colorado Electric Resource Plan —\n \nIn October 2024, PSCo filed its electric resource plan with the CPUC. The filing reflects the expected growth on the system, the generation resources needed to meet the projected growth and the future evaluation of competitive bids for new generation resources. \n•\nThe plan reflects a base sales forecast with 7% compound annual sales growth through 2031. \n•\nThe plan also presents a low sales forecast with a 3% compound annual sales growth through 2031.\n•\nThe resource plan includes forecasted need of 5-14 GW of new generation capacity through 2031, including renewables and firm dispatchable resources to meet the two different scenarios. The acquisitions of generation resources will be determined through a competitive solicitation after the CPUC determines the portfolio. The table below summarizes two of the proposed portfolios based on the different sales scenarios: \n(Megawatts)\nBase Plan\nLow Load\nWind\n7,250 \n2,800 \nSolar\n3,077 \n1,200 \nNatural gas combustion turbine\n1,575 \n1,400 \nStorage (long duration)\n1,600 \n— \nOther storage\n450 \n— \nTotal\n13,952 \n5,400 \nA hearing was held in June 2025 and a CPUC decision on the resource need is expected in the fourth quarter of 2025 with the competitive solicitation for resource additions expected in early 2026.\nNear-Term Procurement — \nIn August 2025, PSCo filed a joint motion with state agencies to initiate a “fast-tracked” solution for tax-advantaged new generation resources. The CPUC approved the request in September 2025 with bids submitted in October 2025. The procurement seeks to accelerate development of up to 4,000 MW of clean energy resources, 200 MW of firm, dispatchable resources, and up to 300 MW of other dispatchable resources. A recommended portfolio of resources will be filed December 2025 and a decision is expected in February 2026.\nWildfire Mitigation Plan — \nIn June 2024, PSCo filed an updated WMP and request for recovery of costs covering the years 2025 to 2027 with the CPUC. The estimated total cost for this plan is approximately $1.9 billion.\nThe WMP integrates industry experience; incorporates evolving risk assessment methodologies; adds new technology; and expands the scope, pace and scale of our work to reduce wildfire risk in a comprehensive and efficient manner.\nIn April 2025, PSCo filed with the CPUC a comprehensive and unanimous settlement. Key terms include:\n•\nApproval of the updated WMP, including scope of mitigation activities and the Public Safety Power Shutoffs plan, with certain modifications. \n•\nCost recovery of proposed investments through a Wildfire Mitigation Adjustment rider and recovery of transmission investments through the Transmission Cost Adjustment rider. \n•\nPSCo agrees to request approval to pursue securitization of an estimated $1.2 billion of proposed WMP investments, with a target to complete the transaction by Jan. 1, 2029. \n•\nExtension of the excess liability insurance deferral, with a cap of $50 million after PSCo’s current policy year, which ends October 2025. \nIn August 2025, the CPUC issued a written approval of the settlement agreement.\nColorado Senate Bill 23-291\n — In May 2023, Colorado Senate Bill 23-291 was signed into law. The legislation included a number of topics including for the CPUC to adopt rules to establish fuel cost mechanisms to align the financial incentives of a utility with the interests of the utility’s customers.\nIn December 2024, the CPUC adopted final rules applicable to PSCo’s natural gas utility that would assign to the Company four percent of the change in the price per MMbtu of natural gas compared to the three-year average, subject to rolling 12-month cap based on a percentage of rate base, currently estimated at $7 million. PSCo made a filing in June 2025 to implement the mechanism with a CPUC decision expected in late 2025 or early 2026.\nIn December 2024, the CPUC also adopted rules for electric utilities but did not adopt a specific PIM framework, which will be further considered through additional proceedings expected to commence in the fourth quarter of 2025.\n30\nTable of Contents\nSPS\nPending and Recently Concluded Regulatory Proceedings\nSPS Resource Plan (IRP) \n— In October 2023, SPS filed its IRP with the NMPRC, which supports projected load growth and increasing reliability requirements, and secures replacement energy and capacity for retiring resources. SPS’ projected resource needs range from approximately 5,300 MW to 10,200 MW of nameplate capacity by 2030. In February 2024, the NMPRC accepted the IRP.\nIn July 2024, SPS issued a RFP, seeking approximately 3,200 MW of accredited capacity by 2030. The total capacity to be added to the system is expected to align with the range identified in the SPS IRP, depending on the types of resources proposed in the RFP and their accredited capacity factors.\nIn July 2025, the portfolio selection report was publicly filed with the NMPRC with 3,121 MW of accredited capacity resources, including the following: \nGeneration Resource Nameplate Capacity (in MW)\nCompany Owned\nPPAs\nTotal\nWind Resources\n1,273 \n— \n1,273 \nSolar\n695 \n— \n695 \nStorage\n472 \n640 \n1,112 \nNatural Gas\n2,088 \n— \n2,088 \nTotal\n4,528 \n640 \n5,168 \nSPS filed or expects to file Certificate of Convenience and Necessity filings for the specific assets with the PUCT and NMPRC in 2025, with approvals expected in 2026. \nIn October 2025, SPS issued a second RFP to solicit 870 MW of accredited capacity (approximately 1,500 MW to 3,000 MW nameplate capacity) through 2032. Additional resources will be evaluated to meet the New Mexico Renewable Portfolio Standard compliance need. Bids are due in January 2026, and the portfolio is expected to be filed in the second half of 2026.\nExcess Liability Insurance Deferral \n– In March 2025, SPS filed a request with the PUCT and in April 2025, SPS filed a request with the NMPRC for deferred accounting treatment for incremental excess liability insurance expense incurred as a result of the October 2024 policy renewal, estimated at approximately $30 million across the two jurisdictions. In October 2025, the NMPRC approved the request, resulting in a deferral of approximately $15 million of incremental excess liability insurance costs in 2025. A PUCT decision is expected in the first quarter of 2026.\nOther\nSupply Chain \nXcel Energy’s ability to meet customer energy requirements and growing customer demand, respond to storm-related disruptions, and execute our capital expenditure program are dependent on maintaining an efficient supply chain. \nLarge global demand for energy-related infrastructure has stretched equipment supply chains, extended delivery dates and increased prices for items like combustion turbines, transformers and other large electrical equipment. The labor market for skilled engineering and construction resources to build renewables and gas generation has also been strained, impacting cost and availability. \nIn addition, manufacturing processes have experienced disruptions related to the scarcity of certain raw materials and interruptions in production and shipping. The impact of inflationary pressures, geopolitical events and federal policies have exacerbated the situation. Xcel Energy continues to monitor the situation as it remains fluid and seeks to mitigate the impacts by securing alternative suppliers and key vendor partners, increasing procurement lead times, modifying design standards, and adjusting the timing of work.\nTariffs, Trade Complaints and Federal Actions\nSeveral trade cases related to anti-dumping and countervailing duty investigations are ongoing and we continue to monitor the potential impacts of these cases. \nIn 2025, several executive orders have been issued imposing new global and country-specific tariffs on many imports, which may impact our procurement and development activities. Additionally, executive orders and actions from government agencies may impact the permitting of wind and solar facilities and the retirement of coal facilities.\nXcel Energy continues to assess the impacts of these tariffs, executive orders, trade complaints and federal policies on its business, including company owned projects and PPAs. Xcel Energy may seek regulatory relief, if required, in its jurisdictions.\nContinued and/or further policy actions or other restrictions, disruptions in imports from key suppliers, or any new trade complaint could impact viability, timelines and costs of various projects and PPAs.\nTax Law Changes\nOn July 4, 2025, the President signed into law Public Law No. 119-21 (the “OBBB”). The OBBB modifies certain clean energy tax provisions included in the Inflation Reduction Act. The provisions include: \n•\nEliminating production and investment tax credits for wind and solar facilities placed in service after 2027, for facilities that begin construction after July 4, 2026.\n•\nThe addition of foreign entity of concern rules that apply to projects commencing construction after 2025.\nIn August 2025, the U.S. Treasury issued further guidance related to the beginning of construction for clean energy projects.\nXcel Energy does not expect these provisions to have an impact on our 2026-2030 base capital plan, as steps have been taken to begin construction under the IRS’ safe harbor guidance.\nExcess Liability Insurance Coverage\nXcel Energy maintains excess liability coverage, which is intended to insure against liability to third parties. Through the third quarter of 2024, Xcel Energy had approximately $600 million of excess liability coverage; including $520 million of wildfire coverage with an annual premium of approximately $40 million. Examples of claims paid under this policy include property damage or bodily injury to members of the public caused by Xcel Energy’s employees, equipment or facilities. The increased wildfire liability risk and claims are driving a significant increase of premiums and reductions in insurance coverage in the excess liability markets, especially in the western United States. \n31\nTable of Contents\nIn October 2024, Xcel Energy renewed its excess liability coverage and now has $450 million of total coverage; including $450 million of wildfire coverage for the NSP System and $300 million of wildfire coverage for PSCo and SPS. The annual premium for this excess liability insurance is approximately $130 million. In October 2025, Xcel Energy renewed its excess liability coverage for the same level with an annual premium of approximately $135 million. Xcel Energy has received approved deferrals in Colorado, Wisconsin and New Mexico and has filed for recovery through a deferral request or rate filings in other jurisdictions.\nNuclear Antitrust Class Action\nA class action complaint was filed in federal court for the District of Maryland in July 2025, alleging violations of the Sherman Antitrust Act in establishing wages for employees at nuclear facilities since 2003. The complaint names 28 defendants, including all 26 owner operators of nuclear facilities in the United States, or affiliated entities, including Xcel Energy Inc. NSP-Minnesota owns and operates two nuclear facilities in Minnesota, and is assessing the complaint. \nCritical Accounting Policies and Estimates\nPreparation of the consolidated financial statements requires the application of accounting rules and guidance, as well as the use of estimates. Application of these policies involves judgments regarding future events, including the likelihood of success of particular projects, legal and regulatory challenges and anticipated recovery of costs. These judgments could materially impact the consolidated financial statements, based on varying assumptions. The financial and operating environment also may have a significant effect on the operation of the business and results reported. Items considered critical are included within the Xcel Energy Inc. Annual Report on \nForm 10-K\n for the year ended Dec. 31, 2024.\nEnvironmental Regulation\nThroughout 2025, the EPA has announced various regulatory actions addressing a wide range of environmental regulations. Xcel Energy will continue to monitor these proposed rules as they move toward final action. Additionally, any other amendments and changes to rules will be evaluated as proposed by the EPA. \nClean Air Act\nPower Plant Greenhouse Gas Regulations\n \n—\n In April 2024, the EPA published final rules addressing control of CO\n2\n emissions from the power sector. The rules regulate new natural gas generating units and emission guidelines for existing coal and certain natural gas generation. The rules create subcategories of coal units based on planned retirement date and subcategories of natural gas combustion turbines and combined cycle units based on utilization. The CO\n2\n control requirements vary by subcategory. \nBased on current estimates and assumptions, Xcel Energy has determined that due to scheduled plant retirements, there is minimal financial or operational impact associated with these requirements and believes that the cost of these initiatives or replacement generation would be recoverable through rates based on prior state commission practices.\nIn June 2025, the EPA proposed to repeal these and all other GHG emissions standards for the power sector. In the alternative, the EPA proposed to repeal a narrower subset of the 2024 regulations. \nIn July 2025, the EPA additionally proposed to repeal the 2009 Endangerment Finding and associated regulations addressing GHG emissions under the Clean Air Act. Xcel Energy will monitor the proposed rules and evaluate the impacts of any final rule. \nIn September 2025, the EPA proposed to amend the Clean Air Act GHG Reporting Program to scale back reporting and recordkeeping requirements. Under the amended program, Xcel Energy would no longer be required to report GHG emissions to the federal program. Xcel Energy will continue to report GHG emissions as required under state programs. Xcel Energy will monitor the proposed rule and evaluate the impacts of any final rule upon state reporting programs.\nWaste-to-Energy Air Regulations — In January 2024, the EPA proposed air regulations addressing new and existing large municipal waste combustors. The proposed rules lower current emission standards for certain pollutants and would require installation of new pollution controls and/or more intense use of existing pollution controls at French Island Generating Station, Red Wing Generating Plant and Wilmarth Generating Plant. Until final rules are issued, it is not certain what the impact will be on Xcel Energy. Xcel Energy believes that the cost of these initiatives or replacement generation would be recoverable through rates based on prior state commission practices.\nRegional Haze\n \n—\n \nOn July 16, 2025, EPA proposed to partially approve and partially disapprove the Colorado SIP implementing the Regional Haze rule in Colorado. The proposal seeks to remove mandatory retirement dates as enforceable provisions in the SIP. For PSCo, this includes the SIP retirement dates for Cherokee Unit 4, Comanche Unit 2, Craig Units 1 and 2, and Hayden Units 1 and 2. The comment period for the proposal has concluded, but the EPA has yet to make a final decision. If adopted, the removal of these retirement dates from the federally approved SIP would only impact federal requirements for retirement of these facilities. Colorado has a state regulation that incorporates these retirements at a state level and would require amendment to modify or remove the retirement dates.\nEmerging Contaminants of Concern\nPFAS are man-made chemicals that are widely used in consumer products and can persist and bio-accumulate in the environment. Xcel Energy does not manufacture PFAS, but because PFAS are so ubiquitous in products and the environment, it may impact our operations. \nIn June 2024, the EPA finalized a rule that designated certain PFAS as hazardous substances under CERCLA. In July 2024, the EPA finalized another rule that set enforceable drinking water standards for certain PFAS.\nPotential costs for these rules and any additional proposed regulations related to PFAS are uncertain and will be determined on a site specific basis where applicable. If costs are incurred, Xcel Energy believes the costs will be recoverable through rates based on prior state commission practices.\nEffluent Limitation Guidelines\nIn April 2024, the EPA published final rules under the Clean Water Act, setting Effluent Limitations Guidelines and Standards for steam generating coal plants. This rule establishes more stringent wastewater discharge standards for bottom ash transport water, flue-gas desulfurization wastewater, and combustion residuals leachate from steam electric power plants, particularly coal-fired power plants. Based on current estimates and assumptions, Xcel Energy has determined that there is minimal financial or operational impact associated with these requirements and that any costs would be recoverable through rates based on prior state commission practices. \n32\nTable of Contents\nDerivatives, Risk Management and Market Risk\nWe are exposed to a variety of market risks in the normal course of business. Market risk is the potential loss that may occur as a result of adverse changes in the market or fair value for a particular instrument or commodity. All financial and commodity-related instruments, including derivatives, are subject to market risk. \nXcel Energy is exposed to the impact of adverse changes in price for energy and energy-related products, which is partially mitigated by the use of commodity derivatives. In addition to ongoing monitoring and maintaining credit policies intended to minimize overall credit risk, management takes steps to mitigate changes in credit and concentration risks associated with its derivatives and other contracts, including parental guarantees and requests of collateral. While we expect that the counterparties will perform on the contracts underlying our derivatives, the contracts expose us to credit and non-performance risk.\nDistress in the financial markets may impact counterparty risk and the fair value of the securities in the nuclear decommissioning fund and pension fund. \nCommodity Price Risk \n—\n We are exposed to commodity price risk in our electric and natural gas operations. Commodity price risk is managed by entering into long and short-term physical purchase and sales contracts for electric capacity, energy and energy-related products and fuels used in generation and distribution activities. \nCommodity price risk is also managed through the use of financial derivative instruments. Our risk management policy allows us to manage commodity price risk within each rate-regulated operation per commission approved hedge plans.\nWholesale and Commodity Trading Risk \n—\n Xcel Energy conducts various wholesale and commodity trading activities, including the purchase and sale of electric capacity, energy, energy-related instruments and natural gas-related instruments, including derivatives. Our risk management policy allows management to conduct these activities within guidelines and limitations as approved by our risk management committee. \nFair value of net commodity trading contracts as of Sept. 30, 2025:\nFutures / Forwards Maturity\n(Millions of Dollars)\nLess Than 1 Year\n1 to 3 Years\n4 to 5 Years\nGreater Than 5 Years\nTotal Fair Value\nNSP-Minnesota \n(a)\n$\n(10)\n$\n(15)\n$\n(4)\n$\n(1)\n$\n(30)\nNSP-Minnesota \n(b)\n1 \n1 \n— \n(3)\n(1)\nPSCo \n(a)\n— \n1 \n— \n— \n1 \n$\n(9)\n$\n(13)\n$\n(4)\n$\n(4)\n$\n(30)\nOptions Maturity\n(Millions of Dollars)\nLess Than 1 Year\n1 to 3 Years\n4 to 5 Years\nGreater Than 5 Years\nTotal Fair Value\nNSP-Minnesota \n(b)\n$\n— \n$\n6 \n$\n12 \n$\n— \n$\n18 \n$\n— \n$\n6 \n$\n12 \n$\n— \n$\n18 \n(a)\nPrices actively quoted or based on actively quoted prices.\n(b)\nPrices based on models and other valuation methods.\nChanges in the fair value of commodity trading contracts before the impacts of margin-sharing for the nine months ended Sept. 30:\n(Millions of Dollars)\n2025\n2024\nFair value of commodity trading net contracts outstanding at Jan. 1\n$\n(2)\n$\n1 \nContracts realized or settled during the period\n(1)\n2 \nCommodity trading contract additions and changes during the period\n(9)\n(7)\nFair value of commodity trading net contracts outstanding at Sept. 30\n$\n(12)\n$\n(4)\nA 10% increase and 10% decrease in forward market prices for Xcel Energy’s commodity trading contracts would have likewise increased and decreased pretax income from continuing operations by approximately $2 million at Sept. 30, 2025 and Sept. 30, 2024.\nThe utility subsidiaries’ commodity trading operations measure the outstanding risk exposure to price changes on contracts and obligations using an industry standard methodology known as VaR. VaR expresses the potential change in fair value of the outstanding contracts and obligations over a particular period of time under normal market conditions.\nThe VaRs for the NSP-Minnesota and PSCo commodity trading operations, excluding both non-derivative transactions and derivative transactions designated as normal purchases and normal sales, calculated on a consolidated basis using a Monte Carlo simulation with a 95% confidence level and a one-day holding period, were as follows:\n(Millions of Dollars)\nThree Months Ended Sept. 30\nAverage\nHigh\nLow\n2025\n$\n— \n$\n— \n$\n1 \n$\n— \n2024\n— \n— \n1 \n— \nInterest Rate Risk\n — Xcel Energy is subject to interest rate risk. Our risk management policy allows interest rate risk to be managed through the use of fixed rate debt, floating rate debt and interest rate derivatives.\nA 100-basis point change in the benchmark rate on Xcel Energy’s variable rate debt would impact pretax interest expense annually by approximately $13 million and $1 million at Sept. 30, 2025 and 2024, respectively\nNSP-Minnesota maintains a nuclear decommissioning fund, as required by the NRC. The nuclear decommissioning fund is subject to interest rate and equity price risk. The fund is invested in a diversified portfolio of debt securities, equity securities and other investments. These investments may be used only for the purpose of decommissioning NSP-Minnesota’s nuclear generating plants. \nFluctuations in equity prices or interest rates affecting the nuclear decommissioning fund do not have a direct impact on earnings due to the application of regulatory accounting. Realized and unrealized gains on the decommissioning fund investments are deferred as an offset of NSP-Minnesota’s regulatory asset for nuclear decommissioning costs.\nThe value of pension and postretirement plan assets and benefit costs are impacted by changes in discount rates and expected return on plan assets. Xcel Energy’s ongoing pension and postretirement investment strategy is based on plan-specific investment recommendations that seek to optimize potential investment risk and minimize interest rate risk associated with changes in the obligations as a plan’s funded status increases over time. The impacts of fluctuations in interest rates on pension and postretirement costs are mitigated by pension cost calculation methodologies and regulatory mechanisms that minimize the earnings impacts of such changes. \n33\nTable of Contents\nCredit Risk \n— \nXcel Energy is also exposed to credit risk. Credit risk relates to the risk of loss resulting from counterparties’ nonperformance on their contractual obligations. Xcel Energy maintains credit policies intended to minimize overall credit risk and actively monitors these policies to reflect changes and scope of operations.\nCredit exposure is monitored, and when necessary, the activity with a specific counterparty is limited until credit enhancement is provided. Distress in the financial markets could increase our credit risk.\nXcel Energy’s subsidiaries are subject to credit risk from contracts with generating equipment manufacturers and other suppliers that require deposits or milestone payments. In the event of non-performance by these counterparties, the Xcel Energy subsidiaries could experience credit losses, increased costs or project delays. Xcel Energy frequently seeks to mitigate this risk by requiring parent guarantees, letters of credit or other types of credit support.\nXcel Energy is also subject to credit risk for all wholesale, trading and non-trading commodity counterparties and employs credit risk controls, such as letters of credit, parental guarantees, master netting agreements and termination provisions.\nAt Sept. 30, 2025, a 10% increase in commodity prices would have resulted in an increase in credit exposure of $33 million, while a decrease in prices of 10% would have resulted in a decrease in credit exposure of $32 million. At Sept. 30, 2024, a 10% increase in commodity prices would have resulted in an increase in credit exposure of $31 million, while a decrease in prices of 10% would have resulted in a decrease in credit exposure of $30 million.\nFair Value Measurements\nDerivative contracts, with the exception of those designated as normal purchases and normal sales, are reported at fair value. Xcel Energy’s investments held in the nuclear decommissioning fund, rabbi trusts, pension and other postretirement funds are also subject to fair value accounting. See Note 8 to the consolidated financial statements for further information.\nLiquidity and Capital Resources\nCash Flows\nOperating Cash Flows\n(Millions of Dollars)\nNine Months Ended Sept 30\nCash provided by operating activities — 2024\n$\n3,977 \nComponents of change — 2025 vs. 2024\nLower net income\n(21)\nNon-cash transactions\n109 \nChanges in deferred income taxes \n(11)\nChanges in working capital\n286 \nChanges in net regulatory and other assets and liabilities\n(466)\nCash provided by operating activities — 2025\n$\n3,874 \nNet cash provided by operating activities decreased $103 million for the nine months ended Sept. 30, 2025 compared with the prior year. The decrease was largely due to the timing of regulatory recovery, including deferred net natural gas, fuel and purchased energy costs.\nInvesting Cash Flows\n(Millions of Dollars)\nNine Months Ended Sept 30\nCash used in investing activities — 2024\n$\n(5,197)\nComponents of change — 2025 vs. 2024\nIncreased capital expenditures\n(2,323)\nOther investing activities\n28 \nCash used in investing activities — 2025\n$\n(7,492)\nNet cash used in investing activities increased $2,295 million for the nine months ended Sept. 30, 2025 compared with the prior year. The increase in capital expenditures was largely due to continued system investment in renewable and transmission projects.\nFinancing Cash Flows\n(Millions of Dollars)\nNine Months Ended Sept 30\nCash provided by financing activities — 2024\n$\n2,636 \nComponents of change — 2025 vs. 2024\nHigher net short-term debt proceeds\n1,325 \nHigher long-term debt issuances, net of repayments\n567 \nHigher proceeds from issuance of common stock\n42 \nOther financing activities\n(79)\nCash provided by financing activities — 2025\n$\n4,491 \nNet cash provided by financing activities increased $1,855 million for the nine months ended Sept. 30, 2025 compared with the prior year. The increase was largely related to additional debt to fund capital investment.\nCapital Requirements\nXcel Energy expects to meet future financing requirements by periodically issuing short-term debt, long-term debt, common stock, hybrid and other securities to maintain desired capitalization ratios.\nPension Fund\n \n—\n Xcel Energy’s pension assets are invested in a diversified portfolio of domestic and international equity securities, short-term to long-duration fixed income securities, and alternative investments, including private equity, real estate and hedge funds.\n•\nIn January 2025, contributions of $125 million were made to Xcel Energy’s pension plans.\n•\nIn 2024, contributions of $100 million were made across four of Xcel Energy’s pension plans.\n•\nFor future years, contributions will be made as deemed appropriate based on evaluation of various factors including the funded status of the plans, minimum funding requirements, interest rates and expected investment returns.\nCapital Sources\nShort-Term Funding Sources \n—\n Xcel Energy uses a number of sources to fulfill short-term funding needs, including operating cash flow, notes payable, commercial paper and bank lines of credit. The amount and timing of short-term funding needs depend on financing needs for construction expenditures, working capital and dividend payments.\nShort-Term Investments \n—\n \nXcel Energy Inc., NSP-Minnesota, NSP-Wisconsin, PSCo and SPS maintain cash operating and short-term investment accounts. \n34\nTable of Contents\nAs of Oct. 27, 2025, Xcel Energy Inc. and its utility subsidiaries had the following committed credit facilities available to meet liquidity needs:\n(Millions of Dollars)\nCredit Facility \n(a)\nDrawn \n(b)\nAvailable\nCash\nLiquidity\nXcel Energy Inc.\n$\n2,000 \n$\n620 \n$\n1,380 \n$\n16 \n$\n1,396 \nPSCo\n1,200 \n48 \n1,152 \n65 \n1,217 \nNSP-Minnesota\n800 \n44 \n756 \n13 \n769 \nSPS\n600 \n— \n600 \n2 \n602 \nNSP-Wisconsin\n150 \n— \n150 \n113 \n263 \nTotal\n$\n4,750 \n$\n712 \n$\n4,038 \n$\n209 \n$\n4,247 \n(a)\nCredit facilities expire in December 2029.\n(b)\nIncludes outstanding commercial paper and letters of credit.\nShort-Term Debt \n— Xcel Energy Inc., NSP-Minnesota, NSP-Wisconsin, PSCo and SPS each have individual commercial paper programs. As of Sept. 30, 2025, the authorized levels for these commercial paper programs are:\n•\n$2 billion for Xcel Energy Inc.\n•\n$1.2 billion for PSCo.\n•\n$800 million for NSP-Minnesota.\n•\n$600 million for SPS.\n•\n$150 million for NSP-Wisconsin.\nMoney Pool \n—\n Xcel Energy received FERC approval to establish a utility money pool arrangement with the utility subsidiaries, subject to receipt of required state regulatory approvals. The utility money pool allows for short-term investments in and borrowings between the utility subsidiaries.\nXcel Energy may make investments in the utility subsidiaries at market-based interest rates; however, the money pool arrangement does not allow the utility subsidiaries to make investments in Xcel Energy. The money pool balances are eliminated in consolidation. NSP-Minnesota, NSP-Wisconsin, PSCo and SPS participate in the money pool pursuant to approval from their respective state regulatory commissions. \nCapital Expenditures — \nBase capital expenditures for Xcel Energy for 2026 through 2030 are as follows:\nBase Capital Forecast (Millions of Dollars)\nBy Regulated Utility\n2026\n2027\n2028\n2029\n2030\nTotal\nNSP-Minnesota\n$\n3,740 \n$\n4,870 \n$\n4,210 \n$\n3,660 \n$\n3,650 \n$\n20,130 \nSPS\n3,050 \n5,120 \n5,350 \n3,240 \n2,270 \n19,030 \nPSCo\n5,980 \n3,940 \n2,960 \n1,760 \n2,960 \n17,600 \nNSP-Wisconsin\n910 \n1,210 \n760 \n570 \n580 \n4,030 \nOther \n(a)\n110 \n(10)\n(630)\n(210)\n(50)\n(790)\nTotal base capital expenditures\n$\n13,790 \n$\n15,130 \n$\n12,650 \n$\n9,020 \n$\n9,410 \n$\n60,000 \n(a)\nOther category includes intercompany transfers for equipment with long lead times.\nBase Capital Forecast (Millions of Dollars)\nBy Function\n2026\n2027\n2028\n2029\n2030\nTotal\nElectric transmission\n$\n3,060 \n$\n2,930 \n$\n2,890 \n$\n3,190 \n$\n3,370 \n$\n15,440 \nRenewables\n3,560 \n4,620 \n3,380 \n1,150 \n1,210 \n13,920 \nElectric distribution\n2,920 \n3,250 \n2,930 \n1,680 \n2,930 \n13,710 \nElectric generation\n2,220 \n2,420 \n2,500 \n1,810 \n590 \n9,540 \nNatural gas\n860 \n830 \n700 \n650 \n680 \n3,720 \nOther\n1,170 \n1,080 \n250 \n540 \n630 \n3,670 \nTotal base capital expenditures\n$\n13,790 \n$\n15,130 \n$\n12,650 \n$\n9,020 \n$\n9,410 \n$\n60,000 \nThe plan does not include any potential incremental generation from the current Colorado Near-Term Procurement and Resource Plan, additional future generation RFPs across jurisdictions to fund growth, or additional transmission investments that may come from future planning processes including MISO and SPP. Xcel Energy expects to fund additional capital investment with approximately 40% equity and 60% debt. \nXcel Energy’s capital expenditure forecast is subject to continuing review and modification. Actual capital expenditures may vary from estimates due to changes in electric and natural gas projected load growth, safety and reliability needs, regulatory decisions, legislative initiatives, tax policy, reserve requirements, availability of purchased power, alternative plans for meeting long-term energy needs, environmental initiatives and regulation, and merger, acquisition and divestiture opportunities. \nFinancing for Capital Expenditures through 2030 \n— Xcel Energy issues debt and equity securities to refinance retiring debt maturities, reduce short-term debt, fund capital programs, infuse equity in subsidiaries, fund asset acquisitions and for general corporate purposes. Current estimated financing plans of Xcel Energy for 2026-2030 (includes the impact of tax credit transferability):\n(Millions of Dollars)\nFunding Capital Expenditures\nCash from operations \n(a)\n$\n30,180 \nNew debt \n(b)\n22,820 \nEquity issuances\n (c)\n7,000 \nBase capital expenditures 2026-2030\n$\n60,000 \nMaturing debt\n$\n3,580 \n(a)\nNet of dividends and pension funding.\n(b)\nReflects a combination of short and long-term debt; net of refinancing\n. \n(c)\nAmount could include other financing instruments that receive equity credit from the credit rating agencies.\n2025 Financing Activity\n \n—\n Xcel Energy and its utility subsidiaries issued the following long-term debt:\nIssuer\nSecurity\nAmount\nTenor\nCoupon\nXcel Energy Inc.\nSenior Unsecured Notes\n$\n1,100 \nmillion\n3 Year & 10 Year\n4.75% & 5.60% \nPSCo\nFirst Mortgage Bonds\n1,000 \nmillion\n9 Year & 30 Year\n5.35% & 5.85%\nNSP-Minnesota\nFirst Mortgage Bonds\n1,100 \nmillion\n10 Year & 30 Year\n5.05% & 5.65%\nSPS\nFirst Mortgage Bonds\n500 \nmillion\n10 Year\n5.30%\nNSP-Wisconsin\nFirst Mortgage Bonds\n250 \nmillion\n29 Year\n5.65%\nPSCo\nFirst Mortgage Bonds\n1,000 \nmillion\n10 Year & 30 Year\n5.15% & 5.85%\nXcel Energy Inc. \n(a)\nJunior Subordinated Debt\n900 \nmillion\n60 Year\n6.25%\n(a)\nJunior subordinated debt was issued on Oct. 7, 2025.\nXcel Energy issued 16.4 million shares ($1.16 billion in net proceeds and $9 million in transaction fees paid) through its ATM programs in the nine months ended Sept. 30, 2025. Xcel Energy also entered forward equity agreements and collared forward equity agreements under these programs totaling 18.2 million shares, which have not been settled.\n35\nTable of Contents\nLong-Term Borrowings, Equity Issuances and Other Financing Instruments\n \n—\n Xcel Energy may issue equity through its ATM program or other offerings. Financing plans are subject to change, depending on capital expenditures, regulatory outcomes, internal cash generation, market conditions, changes in tax policies and other factors.\nSee Note 4 to the consolidated financial statements for further information.\nOff-Balance-Sheet Arrangements\nXcel Energy does not have any off-balance-sheet arrangements, other than those currently disclosed, that have or are reasonably likely to have a current or future effect on financial condition, changes in financial condition, revenues or expenses, results of operations, liquidity, capital expenditures or capital resources that is material to investors.\nEarnings Guidance and Long-Term EPS and Dividend Growth Rate Objectives\nXcel Energy 2025 Earnings Guidance \n—\n \nXcel Energy’s 2025 ongoing earnings guidance is a range of $3.75 to $3.85 per share. \n(a)\nKey assumptions as compared with 2024 actual levels unless noted:\n•\nConstructive outcomes in all pending rate case and regulatory proceedings, including requests for deferral of incremental insurance costs associated with wildfire risk and recovery of O&M costs associated with wildfire mitigation plans.\n•\nNormal weather patterns for the year.\n•\nWeather-normalized retail electric sales are projected to increase ~3%.\n•\nWeather-normalized retail firm natural gas sales are projected to be flat.\n•\nCapital rider revenue is projected to increase $255 million to $265 million (net of PTCs).\n•\nO&M expenses are projected to increase ~5%. The increase from prior guidance is primarily due to increasing benefit costs in the third quarter of 2025.\n•\nDepreciation expense is projected to increase approximately $210 million to $220 million. The increase from prior guidance is largely earnings neutral and is offset by changes in electric fuel and purchased power.\n•\nProperty taxes are projected to increase $45 million to $55 million. \n•\nInterest expense (net of AFUDC - debt) is projected to increase $160 million to $170 million, net of interest income. The increase from prior guidance is largely earnings neutral and is offset by changes in electric fuel and purchased power.\n•\nAFUDC - equity is projected to increase $110 million to $120 million.\nXcel Energy 2026 Earnings Guidance — \nXcel Energy’s 2026 ongoing earnings guidance is a range of $4.04 to $4.16 per share. \n(a)\nKey assumptions as compared with 2025 actual levels unless noted:\n•\nConstructive outcomes in all pending rate case and regulatory proceedings.\n•\nNormal weather patterns for the year.\n•\nWeather-normalized retail electric sales are projected to increase ~3%.\n•\nWeather-normalized retail firm natural gas sales are projected to increase ~1%.\n•\nCapital rider revenue is projected to increase $550 million to $560 million. \n•\nO&M expenses are projected to increase ~3%. \n•\nDepreciation expense is projected to increase approximately $370 million to $380 million.\n•\nProperty taxes are projected to increase $30 million to $40 million. \n•\nInterest expense (net of AFUDC - debt) is projected to increase $290 million to $300 million, net of interest income. \n•\nAFUDC - equity is projected to increase $140 million to $150 million.\n(a)\nOngoing earnings is calculated using net income and adjusting for certain nonrecurring or infrequent items that are, in management’s view, not reflective of ongoing operations. Ongoing earnings could differ from those prepared in accordance with GAAP for unplanned and/or unknown adjustments. As Xcel Energy is unable to quantify the financial impacts of any additional adjustments that may occur for the year, we are unable to provide a quantitative reconciliation of the guidance for ongoing EPS to corresponding GAAP EPS.\nLong-Term EPS and Dividend Growth Rate Objectives \n—\n \nXcel Energy expects to deliver an attractive total return to our shareholders through a combination of earnings growth and dividend yield, based on the following long-term objectives:\n•    Deliver long-term annual EPS growth of 6% to 8+% based off of $3.80 per share (the mid-point of 2025 original ongoing earnings guidance of $3.75 to $3.85 per share).\n•    Deliver annual dividend increases of 4% to 6%.\n•    Target a dividend payout ratio of 45% to 55%.\n•    Maintain senior secured debt credit ratings in the A range."
}