{
  "source_file": "xom-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nExxon Mobil Corporation was incorporated in the State of New Jersey in 1882. Divisions and affiliated companies of ExxonMobil operate or market products in the United States and most other countries of the world. Our principal business involves exploration for, and production of, crude oil and natural gas; manufacture, trade, transport and sale of crude oil, natural gas, petroleum products, petrochemicals, and a wide variety of specialty products; and pursuit of lower-emission and other new business opportunities, including carbon capture and storage, hydrogen, lower-emission fuels, Proxxima\nTM\n systems, carbon materials, and lithium. Affiliates of ExxonMobil conduct extensive research programs in support of these businesses.\nExxon Mobil Corporation's divisions and affiliates have many names, including \nExxonMobil\n, \nExxon\n, \nEsso, Mobil\n or \nXTO\n. For convenience and simplicity, in this report the terms \nExxonMobil, Exxon, Esso, Mobil, and XTO\n, as well as terms like \nCorporation\n, \nCompany\n, \nour\n, \nwe,\n and \nits\n, are sometimes used as abbreviated references to specific affiliates or groups of affiliates. The precise meaning depends on the context in question.\nOn May 3, 2024, the Corporation acquired Pioneer Natural Resources Company (Pioneer), an independent oil and gas exploration and production company. With reference to the acquisition, we issued 545 million shares of ExxonMobil common stock having a fair value of $63 billion on the acquisition date, and assumed debt with a fair value of $5 billion. The acquisition transforms ExxonMobil’s upstream portfolio, creating an industry-leading, high-quality U.S. unconventional inventory position. For additional information, see \nNote 21\n in the Financial Section of this report.\nThe energy and petrochemical industries are highly competitive, both within the industries and also with other industries in supplying the energy, fuel, and chemical needs of industrial and individual consumers. Certain industry participants, including ExxonMobil, are expanding investments in lower-emission energy and emission-reduction services and technologies. The Corporation competes with other firms in the sale or purchase of needed goods and services in many national and international markets and employs all methods of competition which are lawful and appropriate for such purposes.\nOperating data and industry segment information for the Corporation are contained in the Financial Section of this report under the following: “Management's Discussion and Analysis of Financial Condition and Results of Operations: \nBusiness Results\n” and \nNote 18\n. Information on oil and gas reserves is contained in the “\nOil and Gas Reserves\n” part of the “Supplemental Information on Oil and Gas Exploration and Production Activities” portion of the Financial Section of this report.\nExxonMobil has a long-standing commitment to the development of proprietary technology. We have a wide array of research programs designed to meet the needs identified in each of our businesses. ExxonMobil held over 8 thousand active patents worldwide at the end of 2024. For technology licensed to third parties, revenues totaled approximately $102 million in 2024. Although technology is an important contributor to the overall operations and results of our Company, the profitability of each business segment is not dependent on any individual patent, trade secret, trademark, license, franchise, or concession.\nExxonMobil operates in a highly complex, competitive, and changing global energy business environment where decisions and risks play out over time horizons that are often decades in length. This long-term orientation underpins the Corporation's philosophy on talent development.\nTalent development begins with recruiting exceptional candidates and continues with individually planned experiences and training designed to facilitate broad development and a deep understanding of our business across the business cycle. Our career-oriented approach to talent development results in strong retention and an average length of service of about 30 years for our career employees. Compensation, benefits, and workplace programs support the Corporation's talent management approach, and are designed to attract and retain employees for a career through compensation that is market competitive, long-term oriented, and highly differentiated by individual performance.\nWith over 60 percent of our global employees from outside the U.S. and 160 nationalities represented across the Company, we encourage and respect diversity of thought, ideas, and perspective from our workforce. We are focused on building an engaged, global workforce; grounded in meritocracy, we strive to have every employee reach their potential over a long-term career by providing unrivaled opportunities for personal and professional growth through impactful work meeting society's essential needs.\nThe number of regular employees was 61 thousand, 62 thousand, and 62 thousand at years ended 2024, 2023, and 2022, respectively. Regular employees are defined as active executive, management, professional, technical, administrative, and wage employees who work full time or part time for the Corporation and are covered by the Corporation’s benefit plans and programs.\nAs discussed in \nItem 1A\n in this report, compliance with existing and potential future government regulations, including taxes, environmental regulations, and other government regulations and policies that directly or indirectly affect the production and sale of our products, may have material effects on the capital expenditures, earnings, and competitive position of ExxonMobil. For additional \n1\ninformation on the Corporation's worldwide environmental expenditures, see “Management's Discussion and Analysis of Financial Condition and Results of Operations: \nEnvironmental Matters\n” in the Financial Section of this report.\nInformation concerning the source and availability of raw materials used in the Corporation’s business, the extent of seasonality in the business, the possibility of renegotiation of profits or termination of contracts at the election of governments, and risks attendant to foreign operations may be found in \nItem 1A\n and \nItem 2\n in this report.\nExxonMobil maintains a website at exxonmobil.com. Our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports filed or furnished pursuant to Section 13(a) of the Securities Exchange Act of 1934 are made available through our website as soon as reasonably practical after we electronically file or furnish the reports to the Securities and Exchange Commission (SEC). Also available on the Corporation’s website are the Company’s Corporate Governance Guidelines, Code of Ethics and Business Conduct, and additional policies as well as the charters of the audit, compensation, and other committees of the Board of Directors. Information on our website is not incorporated into this report.\nThe SEC maintains an internet site (http://www.sec.gov) that contains reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC.",
  "item7": null,
  "item2": null
}