{
  "source_file": "xyl-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1.    BUSINESS\nBusiness Overview\nXylem is a leading global water technology company with 2024 revenues of $8.6 billion and approximately 23,000 employees worldwide. We design, manufacture and service engineered products and solutions across a wide variety of critical applications primarily in the water sector. Our broad portfolio of products, services and solutions addresses customer needs of scarcity, resilience, quality, and affordability across the water cycle, from the delivery, treatment, measurement and use of drinking water, to the collection, testing, analysis and treatment of wastewater, to the return of water to the environment. \nWe have differentiated market positions in core applications including transport and dewatering, process water and wastewater treatment, analytics, smart metering, digital software solutions and comprehensive services. Setting us apart is a unique set of global assets that include:\n•\nMarket-leading brands, some of which have been in use for more than 100 years\n•\nGlobal distribution networks consisting of direct sales forces and independent channel partners serving a diverse customer base in approximately 150 countries \n•\nA substantial global installed base of products and solutions across the water cycle that provides for steady parts, replacement and service revenue\n•\nA strong history of providing innovative products, solutions, services and business models to customers \n•\nA dedicated, experienced, qualified and technologically advanced group of employees focused on safely satisfying our customers' requirements to transport, treat or measure clean water or wastewater and measure energy usage\n•\nA strong financial position and cash generation profile that enables us to fund strategic organic and inorganic growth initiatives, and consistently return capital to shareholders \n•\nA demonstrated commitment to corporate governance, social and environmental sustainability and delivering a positive impact to our customers, communities and employees\nExcept as otherwise indicated or unless the context otherwise requires, “Xylem,” “we,” “us,” “our” and “the Company” refer to Xylem Inc. and its subsidiaries. \nOur Industry\nOur vision is to create a world in which water issues are no longer a constraint to health, prosperity and sustainable development. Our purpose is to empower our customers and communities to build a more water secure world. \nOur planet faces serious water challenges. Less than 1% of the total water available on earth is fresh water, and the supply is threatened by factors such as the draining of aquifers, increased pollution and the effects of climate change. Demand for fresh water is rising rapidly due to population growth, industrial expansion, and increased agricultural development, with consumption estimated to double every 20 years. It is expected that there will be a 40% gap between global water supply and demand by 2030. Even in developed countries with sufficient clean water supply, existing water supply infrastructure is aging and often inefficient. In the U.S., deteriorating pipe systems, theft or inaccurate meters result in approximately one out of every six gallons of treated and transported water being lost prior to reaching the end customer. This problem of \"non-revenue\" water is a major financial challenge of many utilities globally, especially in developing markets where non-revenue water can represent 10% to 60% or more of net water produced and the treatment and energy costs to transport water is substantial. These and other challenges create opportunities for growth in the global water industry. We estimate the total addressable market size of the global water industry, excluding operational expenditures related to labor, energy, and chemicals, to be approximately $750 billion. \nGlobal water needs cannot be met without streamlining the water industry’s cost structure with technologies that fundamentally change the provision and management of water. We compete in areas that are pivotal to improving \"water affordability,\" \"water quality,\" and \"resilience\", while reducing the impact of \"water scarcity\". \"Water affordability\" refers to the more efficient delivery, use and treatment of clean water and wastewater. \"Water quality\" refers to the suitability of water for a particular use based on its physical, chemical and biological characteristics. \"Resilience\" refers to the management of water-related risks, including climate change mitigation, and the resilience of water infrastructure. \"Water scarcity\" refers to the management of the limited supply of water due to climate change, overpopulation and pollution. Our customers often face all four of these challenges, ranging from inefficient and aging water distribution networks and energy-intensive or unreliable water and wastewater management \n4\nsystems (requiring improvements in water affordability); droughts and pollution which limit the amount of water readily available (causing water scarcity); or exposure to natural disasters such as floods (requiring improvements in resilience). Additionally, we also provide solutions to enhance communications and efficiency, improve safety and conserve resources to customers in the water sector. Delivering value in these areas creates significant opportunity for the Company. \nThe Global Water Industry Value Chain\nThe water industry value chain includes Equipment, Technology and Services companies, like Xylem, that address the unique challenges and demands of a diverse customer base. This customer base includes water and wastewater utilities that supply, treat and monitor clean water or transport, treat and analyze wastewater or storm water through an infrastructure network, and engineering, procurement and construction (\"EPC\") firms and third party contractors, that work with utilities to design and build water and wastewater infrastructure networks, as depicted below. Utilities and other customers require products, solutions, services, technology and application expertise from their Equipment, Technology and Services providers to address trends such as rising pollution, stricter regulations, increasing operational costs and the increased outsourcing of process knowledge. In addition to utilities, Equipment, Technology and Service companies also provide distinct technologies and application expertise and services to a wide array of entities, including farms, mines, power plants, industrial facilities (such as food and beverage and pharmaceutical manufacturers) and residential and commercial customers seeking to address similar trends.\nWater Industry Supply Chain\n \nBusiness Strategy \nOur overarching strategy is to help customers solve the world's greatest water challenges with innovative products, services and solutions to deliver sustainable economic, social and environmental benefits. The following strategic pillars guide where and how we focus our efforts and resources to implement this strategy:\n•\nCustomer Centricity.\n We are putting the needs and experiences of our customers at the forefront of everything we do. By listening to our customers and understanding their challenges, we aim to deliver innovative solutions that not only meet but exceed their expectations. This approach helps us build strong, lasting relationships and helps align our products and services with customer needs. We leverage the 80/20 principle to focus on the most impactful opportunities to drive value for our customers. Additionally, we seek to create synergies across our businesses to enhance customer value and streamline operations. We are committed to simplifying how we do business and equipping our sales teams with the tools, training, and insights needed to engage customers effectively. We emphasize transactional excellence to aim for every customer interaction to be seamless, efficient, and value-driven. We aspire for our customers to be enthusiastic advocates for our brand.\n5\n•\nProfitable Growth.\n We prioritize profitable growth to drive long-term success. By applying the 80/20 principle, we focus on the most impactful opportunities to create significant value. We aim to expand our market share, optimize our product portfolio, and drive revenue growth through strategic investments and partnerships. By implementing strategic pricing, we maximize profitability and enhance our competitive position. Additionally, we are dedicated to building high-margin, recurring revenue in growing markets, intelligent solutions, and services. Our goal is to deliver consistent financial performance that benefits our shareholders and supports our long-term vision, building a stable and prosperous future for the company.\n•\nOperational Excellence.\n We are committed to being a leading operator by continuously improving our processes, systems, and capabilities to enhance efficiency and effectiveness. By applying the 80/20 principle to streamline our business, we aim to enhance throughput, reduce inventory, and improve product quality. Implementing lean continuous improvement practices allows us to reduce waste and enhance the speed and ease of doing business, making our operations more efficient and effective. We are dedicated to modernizing our systems to support productivity for growth and maintain operations that are agile and responsive. Through our Xylem Management System and Goal Deployment Process, we align our efforts with strategic objectives, driving disciplined execution and operational excellence. This commitment to excellence helps us remain competitive and enables us to respond quickly to changing market and customer demands. Ultimately, we aim to run our company with discipline, maintaining operations that are streamlined and consistently aligned with our strategic goals.\n•\nSustainability Leadership.\n We strive to be a sustainability leader by integrating sustainability into our business strategy, with a strong emphasis on advancing favorable long-term financial and sustainability outcomes for our customers through our solutions. We also aim to minimize our environmental impact, promote resource conservation, and support customers and the communities we serve together. Our priorities are focused in three areas: decarbonizing the water sector, accelerating corporate water stewardship, and advancing WASH (Water, Sanitation, and Hygiene) access and capacity building. Additionally, we are partnering with venture impact funds, philanthropic organizations, customers, and suppliers to develop long-term commercial opportunities in new markets. Our sustainability leadership, including the skill-based volunteering by employees, provides Xylem with distinct advantages in competitive talent markets.\n•\nHigh-Impact Culture.\n We continuously refine Xylem’s operating model to better serve our customers and create value for our shareholders. Our organizational culture is fundamental to those objectives. We have activated our high-impact culture through three high-impact behaviors: inspired to innovate, accountable to deliver, and empowered to lead. These behaviors drive our employees to learn and innovate every day, to know their role in contributing to our purpose and strategy, and to deliver on our commitments to our customers and communities. Within the framework of these behaviors, we encourage a collaborative and inclusive work environment and are keenly focused on simplifying our organization and processes to drive daily and break-through efficiency and innovation. \nOur strategic plan firmly embeds sustainability at the heart of our competitive advantage and unique business model, and aligns each of our five core strategic pillars to the overarching goal of integrating sustainability into everything we do. \nWhile our strategy will evolve in response to the changing world, our four values are the enduring principles that go to the heart of who we are and guide how we conduct ourselves each day: Respect, Responsibility, Integrity and Creativity. \nBusiness Segments, Distribution and Competitive Landscape\nWe have four reportable business segments that are aligned around the critical market applications they provide: Water Infrastructure, Applied Water, Measurement and Control Solutions and Water Solutions and Services. See Note 21, “Segment and Geographic Data,” in our consolidated financial statements for financial information about segments and geographic areas.\n6\nThe table and descriptions below provide an overview of our business segments:\nMarket\nApplications\n2024 Revenue\n(in millions)\n%\nRevenue\nMajor Products\nPrimary Brands\nWater\nInfrastructure\nTransport\n$\n1,498 \n59 \n%\n•\nWater and wastewater pumps\n•\nFiltration, disinfection and biological treatment equipment\n•\nFlygt\n•\nIonpure\n•\nVortisand\n•\nWallace & Tiernan\n•\nWedeco\nTreatment\n1,057 \n41 \n%\n$\n2,555 \n100 \n%\n \n \nApplied\nWater\nBuilding Solutions\n$\n997 \n56 \n%\n•\nPumps\n•\nValves\n•\nHeat exchangers\n•\nControls\n•\nDispensing equipment systems\n•\nRule\n•\nBell & Gossett\n•\nFlojet\n•\nGoulds Water Technology\n•\nJabsco\n•\nLowara\n•\nStandard Xchange\nIndustrial Water\n796 \n44 \n%\n$\n1,793 \n100 \n%\nMeasurement and Control Solutions\nSmart Metering and Other\n$\n1,519 \n81 \n%\n•\nSmart meters\n•\nNetwork communication devices\n•\nData analytics\n•\nTest instruments\n•\nControls\n•\nSensor devices\n•\nSoftware & managed services\n•\nCritical infrastructure services \n•\nSensus\n•\nSmith Blair\n•\nWTW\n•\nYSI\n•\nXylem Vue\nAnalytics\n352 \n19 \n%\n$\n1,871 \n100 \n%\n \n \nWater Solutions and Services\nCapital and other\n$\n1,355 \n58 \n%\n•\nPreventative maintenance services\n•\nRapid response mobile services\n•\nDigitally enabled/outsourced solutions\n•\nProcess and wastewater treatment systems\n•\nEnvironmental remediation\n•\nOdor and corrosion control\n•\nFiltration\n•\nReverse osmosis\n•\nContinuous deionization\n•\nMobile dewatering equipment and rental services\n•\nAquaPro\n•\nWaterOne\n•\nIon Pure\n•\nFlygt\n•\nPure Technologies\n•\nGodwin\nServices\n988 \n42 \n%\n$\n2,343 \n100 \n%\n7\nWater Infrastructure\nThrough two closely linked applications, transport and treatment, our Water Infrastructure segment primarily supports the process that collects water from a source, treats it and distributes it to users, and then treats and returns the wastewater responsibly to the environment.\nThe customer base consists of two primary end markets: utility and industrial. The utility market includes public, private and public-private entities that support water, wastewater and storm water networks. The industrial market includes customers that require similar water and wastewater infrastructure applications to support various industrial operations.\nWater Infrastructure sells through a combination of direct channels, indirect channels and service capabilities. Both utility and industrial facility customers increasingly require our teams’ global but locally proficient expertise to use our equipment in their specific applications. Several trends are increasing demand for this application expertise: (i) the need for efficient transport and treatment solutions due to the increase in water scarcity, (ii) the increase in both the type and amount of contaminants found in the water supply, (iii) the need to increase system resilience and efficiencies due to aged infrastructure and affordability, (iv) increasing environmental regulations, and (v) the need to reduce carbon emissions generated from transporting and treating water.\nGiven the highly fragmented nature of the water industry, the Water Infrastructure segment competes with a large number of businesses and no one business competes across all the markets Water Infrastructure serves. We differentiate ourselves in the market by focusing on product and service performance, quality and reliability, innovation, speed to market with new or disruptive technologies and business models, application expertise, brand reputation, energy efficiency, product security, product life-cycle cost, timeliness of delivery, effectiveness of our distribution channels, customers' experience and our global installed base. Our key competitors in the Water Infrastructure segment include De Nora, Grundfos, KSB Inc., ProMinent, Sulzer Ltd., Trojan (Veralto Corporation), and Veolia.\nApplied Water\nApplied Water encompasses the uses of water to serve a diverse set of customers in the building solutions and industrial water end markets. Residential consumers represent the end users in the residential market, while owners and managers of properties such as apartment buildings, retail stores, institutional buildings, restaurants, schools/universities, hospitals and hotels are examples of end users in the commercial market. The industrial market includes original equipment manufacturers, exploration and production firms, agricultural customers, and developers and managers of industrial facilities, such as chemical manufacturers, marine, food and beverage companies, data centers and car washes.\nIn the Applied Water segment, end markets vary widely and, as a result, specialized distribution partners are often preferred. As such, the Applied Water segment provides the majority of its sales through strong indirect channels with the remaining sales going through our global direct sales channels. We have long-standing relationships with many of the leading independent distributors in the markets we serve and we provide incentives to distributors, such as specialized loyalty and training programs.\nPopulation growth and urbanization, climate and regulation on energy efficiency, and digitalization enabling self-service and preventive maintenance are macro growth drivers of these markets, driving the need for housing, food, community services and retail goods within growing city centers. \nCompetition in the Applied Water segment focuses on brand reputation, application expertise, product delivery, performance and energy efficiency, quality and reliability, and price. We compete by offering innovative and high-quality products, coupled with world-class application expertise. We believe our distribution through well-established channels and our reputation for quality significantly enhance our market position. Our ability to deliver innovative product offerings has enabled us to compete effectively, to cultivate and maintain customer relationships and to serve and expand into many niche and new markets. Our key competitors in the Applied Water segment include Franklin Electric Co., Inc, Grundfos, Pentair plc, and Wilo SE.\n8\nMeasurement and Control Solutions \nMeasurement and Control Solutions develops advanced technology solutions that enable intelligent use, optimization and conservation of critical water and energy resources. The segment delivers communications, smart metering, measurement and control capabilities, and critical infrastructure technologies that allow customers to more effectively use their distribution networks for the delivery, monitoring and control of critical resources such as water, electricity and natural gas. We also provide analytical instrumentation used to measure and analyze water quality, flow and level in clean water, wastewater and outdoor water environments. Additionally, we offer software and services including cloud-based analytics, and remote monitoring and data management.\nAt the heart of our leading technologies are automation, data management and decision support. Our communications networks enable customers to automate and optimize meter reading, bill customers, monitor flow rates and detect and enable rapid response to changing and unsafe conditions. In short, our communications offerings provide insight into operations and enable our customers to manage the entire scope of their operations remotely through their networks and to optimize their operational costs. At the center of our offering is the FlexNet communication network, which provides a common communications platform and infrastructure for essential metering services. This two-way communication technology remotely connects a wide variety of smart points in a given network with protocols, frequently on Federal Communications Commission (\"FCC\") licensed spectrum in the U.S., to enable reliable, resilient and secure transmissions. These technologies allow our customers to remotely and continuously monitor their water and energy distribution infrastructure, prioritize and manage maintenance, and use data to optimize many aspects of their networks. Our digital software solutions complement these offerings with intelligent applications that help utility decision-makers manage and maintain their networks more effectively in real time.\nThe majority of our sales in the U.S. are conducted through strong, long-standing relationships with leading distributors and dedicated channel partners for the water and energy markets. Internationally, direct sales are often made in markets without established distribution channels; however, some distribution channels are used in more developed markets. A direct sales approach, with key account management, is employed for large utilities and government programs.\nMacro growth drivers include increasing regulation, aging infrastructure and worldwide movement towards smart grid implementation and advanced metering infrastructure (“AMI\"). Water scarcity and conservation, as well as the need to prevent revenue loss (via inaccurate meter readings, leaks or theft) are among the drivers of smart meter and leak detection technologies. \nOur Sensus-branded meters are well positioned in the smart metering sector, the fastest growing sector of the global meter industry. We set ourselves apart in the industry by focusing on our communication network, innovation, new product development and service offerings that deliver tangible savings from efficiency of operating costs in meter reading and billing, and reduction of non-revenue water through improved meter accuracy, reduced theft and identification of leaks. Our YSI and WTW-branded instruments have a strong position in the analytical instrumentation market and provide critical readings of various water quality, level and flow parameters for customers. We provide a differentiated offering in the reliability and accuracy of our products often in rugged, remote and hazardous locations. Our key competitors in the Measurement and Control Solutions segment include Badger Meter, Echologics (Mueller Water Products), Hach (Veralto Corporation), Itron, Kamstrup, Landis+Gyr, Neptune (Roper), and Teledyne.\nWater Solutions and Services\nOur Water Solutions and Services segment provides tailored services and solutions, in collaboration with customers, including on‑demand water, outsourced water, recycle/reuse, specialty dewatering and emergency response service alternatives, to improve operational reliability, performance and environmental compliance. Key offerings within this segment also include equipment systems for industrial needs (influent water, boiler feed water, ultrahigh purity, process water, wastewater treatment, and recycle/reuse), full-scale outsourcing of operations and maintenance, and municipal services, including odor and corrosion control services, and pipeline assessment services, as well as leak detection, condition assessment and asset management and pressure monitoring solutions. The Water Solutions and Services segment also includes sales and rental of specialty dewatering pumps, scalable products, and related equipment, technology and services, which provide the safe removal or draining of groundwater and surface water from construction sites or other industrial sites, and bypass pumping for the repair of aging utility infrastructure, as well as emergency water transport and removal during severe weather events.\nOur Water Solutions and Services segment reaches customers across various municipalities as well as industrial vertical markets such as life sciences, microelectronics, food and beverage, chemical processing, and power \n9\ngeneration. In order to reach these customers, we leverage our application expertise in process water and wastewater treatment, our internal and external partners, and extensive service branch networks across the globe, including a rental fleet of transfer and treatment assets.\nMacro growth drivers include water scarcity, emerging contaminants, increasing regulation surrounding climate and energy efficiency, pressure to optimize energy efficiency and other operational cost, and demand arising from emergency response needs. Our key competitors in the Water Solutions and Services segment include Ecolab, MPW Industrial Services, Ovivo, Sunbelt Rentals and United Rentals.\nGeographic Profile\nThe table below illustrates the annual revenue and percentage of revenue by geographic area for each of the three years ended December 31.\nRevenue\n(in millions)\n2024\n2023\n2022\n$ Amount\n% of Total\n$ Amount\n% of Total\n$ Amount\n% of Total\nUnited States\n$\n4,862\n \n57\n \n%\n$\n3,956 \n54 \n%\n$\n2,573 \n47 \n%\nWestern Europe\n1,745\n \n20\n \n%\n1,655 \n22 \n%\n1,411 \n26 \n%\nEmerging Markets (a)\n1,274\n \n15\n \n%\n1,182 \n16 \n%\n1,074 \n19 \n%\nOther\n681\n \n8\n \n%\n571 \n8 \n%\n464 \n8 \n%\nTotal\n$\n8,562\n \n$\n7,364 \n$\n5,522 \n(a)\nEmerging Markets includes results from the following regions: Eastern Europe, the Middle East and Africa, Latin America and Asia Pacific (excluding Japan, Australia and New Zealand, which are included in \"Other\")\nSupply and Seasonality\nWe have a global manufacturing and assembly footprint, with production facilities in Europe, North America, Latin America, Asia and the Middle East. All of our businesses require various parts and raw materials, the availability and prices of which may fluctuate. Parts and raw materials commonly used in our products include motors, fabricated parts, castings, magnets, bearings, seals, batteries, printed circuit boards (\"PCBs\") and electronic components, including semiconductors, as well as commodities, including steel, brass, nickel, copper, aluminum, rare earth minerals, and plastics. While we may recover some cost increases through operational improvements, we are still exposed to pricing risk, including due to duty and tariff assessments by the U.S. or other governments on foreign imports. We attempt to control costs through fixed-priced contracts with suppliers and various other programs, such as our global procurement initiative.\nOur business relies on third-party suppliers, contract manufacturing and commodity markets to secure raw materials, parts and components used in our products. We typically acquire materials and components through a combination of blanket and scheduled purchase orders to support our materials requirements. For many of our products we have existing alternate sources of supply, or such sources may be readily available.\nWe have experienced price volatility and supply constraints when materials have not been available from multiple sources. From time to time, we acquire certain inventory in anticipation of supply constraints or enter into longer-term pricing commitments with suppliers to improve the priority, price and availability of supply. \nOur business segments experience a modest level of seasonality in their operations. This seasonality is dependent on factors such as customers' capital spending, as well as the effects of climate change and weather conditions, including heavy flooding, prolonged droughts and fluctuations in temperatures or weather patterns, all of which can positively or negatively impact portions of our business. \nCustomers\nOur business is not dependent on any single customer or a few customers, the loss of which would have a material adverse effect on our Company. No individual customer accounted for more than 5% of our consolidated revenues in 2024, 2023 or 2022.\nBacklog\nBacklog includes orders on hand as well as contractual customer agreements at the end of the period. Delivery schedules vary from customer to customer based on their requirements. Annual or multi-year contracts are subject to rescheduling and cancellation by customers due to the long-term nature of the contracts. As such, beginning total backlog, plus orders, minus revenues, will not equal ending total backlog due to contract adjustments, foreign \n10\ncurrency fluctuations, and other factors. Typically, capital projects require longer lead production cycles and deployment schedules, and delays occur from time to time. Total backlog was $5,070 million at December 31, 2024 and $5,088 million at December 31, 2023. We anticipate that approximately 50% of the backlog at December 31, 2024 will be recognized as revenue during 2025. \nResearch and Development\nResearch and development (“R&D”) is a key foundation of our growth strategy and we focus on the design and development of products, services, solutions and application know-how that address anticipated customer needs and emerging trends. Our engineers are involved in new product, service and solution development as well as improvement of existing products, services and solutions to increase customer value. Our businesses invest substantial resources into R&D. We anticipate we will continue to develop and invest in our R&D capabilities to promote a steady flow of innovative, high-quality and reliable products and integrated solutions to further strengthen our position in the markets we serve. In addition to investments made in software development, which were capitalized, we incurred $230 million, $232 million, and $206 million as a result of R&D investment spending in 2024, 2023 and 2022, respectively.\nWe have R&D and development capabilities around the world. R&D activities are initially conducted in our technology centers, located in conjunction with some of our major manufacturing facilities to enable an efficient and robust development process. We have several global technical centers and local development teams around the world where we are supporting global needs and accelerating the customization of our products, services and solutions to address local needs. In some cases, our R&D activities are conducted at our piloting and testing facilities and at strategic customer sites. These piloting and testing facilities enable us to serve our strategic markets globally. As part of expanding our bandwidth and to increase our access to technology, we have built innovation eco-system partnerships with academic institutions as well as other technology firms, start-up accelerators and venture capital organizations.\nCapitalized Software\nWe offer software as a product or service directly to external customers, which is included within \"Other intangible assets, net\" on our Consolidated Balance Sheets. As of December 31, 2024 and 2023 we had net capitalized software used in sales and services to external customers of $185 million and $209 million, respectively. \nIntellectual Property\nWe generally seek patent protection for inventions that we believe will improve our competitive position and are not suitable to be kept as a trade secret. While we own, control or license a significant number of patents, trade secrets, proprietary information, trademarks, trade names, copyrights and other intellectual property rights which, in the aggregate, are important to our business, management believes that our business, as a whole, as well as each of our business segments, is not materially dependent on any one intellectual property right or related group of such rights.\nPatents, patent applications and license agreements expire or terminate over time by operation of law, in accordance with their terms or otherwise. As the portfolio of our patents, patent applications and license agreements has evolved over time, we do not expect the expiration of any specific patent to have a material adverse effect on our financial position or results of operations.\nGovernmental Regulations\nEnvironmental Regulations\nOur global operations are subject to various laws and regulations governing the environment and climate change, such as those promulgated by the U.S. Environmental Protection Agency and similar state and foreign environmental agencies, including related to the discharge of pollutants and the management and disposal of hazardous substances. While environmental and climate change laws and regulations are subject to change, such changes can be difficult to predict reliably and the timing of potential changes is uncertain. We do not believe, based on current circumstances, that compliance costs pursuant to such regulations will have a material adverse effect on our financial position or results of operations. However, the effect of future legislative or regulatory changes could be material to our financial condition or results of operations.\nWe continue to be dedicated to environmental and sustainability programs to minimize the use of natural resources, reduce the utilization and generation of hazardous materials from our processes, and remediate identified environmental concerns. We are currently engaged in site investigations and remediation activities to address environmental cleanup from past operations at a number of current and former manufacturing facilities. We do not \n11\nanticipate these liabilities will have a material adverse effect on our consolidated financial position or results of operations. At December 31, 2024, we had estimated and accrued $4 million related to environmental matters.\nOther Regulations\nAs a company with global operations, we are subject to complex U.S. federal, state and local and foreign laws, regulations and permits in the countries where we conduct business, including related to trade, such as tariffs, imports and exports; anti-bribery and corruption; antitrust and competition; data security and privacy, such as the EU General Data Protection Regulation (“GDPR”) and the China Personal Information Protection Law ('PIPL\"); use of regulated radio spectrum, including that of the U.S. FCC; lobbying activity; health and safety; the environment; air emissions; potable and non-potable water; wastewater discharge; and the generation, handling, storage, use, transport, treatment and disposal of non-hazardous and hazardous materials and wastes, among other matters. We have policies and procedures in place to promote compliance with these laws, regulations and permits. Additional information about the impact of government regulations on Xylem’s business is included in Item 1A. “Risk Factors” under the headings Risks Related to Geopolitical, Macroeconomic and Industry Factors, Risks Related to Our Business and Operations, Risks Related to Financial and Tax, and Risks Related to Legal and Regulatory.\nSustainability\nAt Xylem, sustainability is at the center of who we are and what we do – from our own operations to the solutions we provide to customers that impact communities around the world. As a leading global water technology company, we address some of the world’s most urgent sustainability challenges - responsible stewardship of our shared water resources and resiliency of communities to climate change. Technology is playing an increasingly important role in helping the world solve water issues. We have a long history of innovation, and we are focusing on the powerful capabilities of smart technology, integrated management and data analytics.\nWe believe our financial performance and commitment to sustainability go hand in hand. Xylem approaches sustainability as a way to generate economic value while also creating value for our customers and society, thus meeting the needs of both. Accordingly, in 2019, we evolved our approach to leverage sustainability in our decision making toward long-term value creation for our shareholders, customers, employees and communities in which we operate and we announced a comprehensive slate of 2025 sustainability goals. Additionally, in 2024, we announced several new ambitious 2030 commitments. We also remain committed to reach Net Zero greenhouse gas (\"GHG\") emissions across our value chain before 2050. This commitment reinforces our alignment with sector-wide efforts to reduce carbon footprints and advance sustainability. Following the 2023 acquisition of Evoqua, we updated our emissions baseline and 2030 science-based targets, which have been approved by the Science Based Target initiative (SBTi). \nAs we look beyond 2025, we have established three high-impact pillars of our sustainability efforts aligned with our strategy and long-term value creation, that deliver sustainable outcomes across our value chain, as well as where we believe we can uniquely provide outsized impact for our customers and communities.  These pillars include Decarbonizing the Water Sector, by providing solutions that support energy efficiency and reduced emissions for our customers; Accelerating Water Stewardship, by enabling leading practices in effective water management; and Advancing Water and Sanitation Hygiene (WASH) for All, by providing innovative solutions to increase services to underserved communities around the world.  For each pillar, we have set forth 2030 goals aligned to both practices to deliver impact for our customers and communities.  \nIn setting our sustainability strategy and goals, we are aligned with the United Nations Sustainable Development Goals (\"UNSDGs\"), not only to substantiate our contribution to achieving global objectives, but also to be transparent in our communication to stakeholders by providing details on our responsibility to build a sustainable future. Our sustainability strategy and an update on our progress towards achieving our goals are outlined in our annual Sustainability Report, which is aligned with the Global Reporting Initiative and the Sustainability Accounting Standards Board frameworks.  \nTo further enhance our understanding and management of risks and opportunities related to sustainability, we are committed to continuous progress aligned with the core principles of the United Nations Global Compact, CEO Water Mandate, Race to Zero, Women’s Empowerment Principles, and the Human Rights Campaign Foundation’s Global Business Coalition, among others.\n12\nIn 2023, we entered into a five-year revolving credit facility (the \"2023 Credit Facility\") with Citibank, N.A., as Administrative Agent, and a syndicate of lenders. The 2023 Credit Facility includes a pricing grid that determines the applicable margin based on Xylem's credit rating, with a further adjustment based on Xylem's achievement of certain sustainability related key performance indicators (the \"KPIs\"). Facility fees under the 2023 Credit Facility are also adjusted based on Xylem's credit rating and the KPIs. In 2022, we announced investments in CNote’s Impact Cash™ platform, a mechanism through which we invest and deposit cash at scale in community finance institutions that strengthen and transform underserved communities. In 2021, in partnership with Goldman Sachs, we continued our work towards further integrating our business and finance strategies with sustainability by creating a cash account tied to performance of select 2025 Sustainability goals. In 2020, Xylem completed a $1 billion Green Bond offering in senior unsecured notes, consisting of $500 million of 1.950% senior notes due in January 2028 and $500 million of 2.250% senior notes due in January 2031. The proceeds of this offering were allocated to green projects that help improve water accessibility, water affordability, and water systems resilience. Additionally, during the first quarter of 2021, we issued a special grant to certain employees of less than 0.1 million ESG performance share units. \nHuman Capital \nOur colleagues around the globe are united by our purpose – to empower our customers and communities to build a more water-secure world – and, as such, are key to the Company’s success and execution of our strategy. We seek to foster a high-impact culture – that is, one in which our colleagues are inspired to innovate, empowered to lead, and accountable to deliver – creating an environment that is purpose-driven, people-centered, respectful and inclusive. We believe that our overall success and long-term growth depend, in part, on our continued ability to attract and retain highly skilled colleagues, with a diverse variety of backgrounds, experiences, and perspectives, the reflect our customers and communities, including senior leaders and individuals with skills in our strategic competencies, such as engineering, innovation, digital technologies, sales excellence, sustainability and product and project management, as well as production, field service and technical services talent. The market for individuals with these competencies remains competitive, but we believe our culture and purpose are differentiators in attracting and retaining talent.\nAs of December 31, 2024, Xylem employed approximately 23,000 employees worldwide. We have approximately 9,200 employees in the U.S., 7,900 in western Europe, and 5,200 in the emerging markets, with the remaining 900 in other geographies in which we operate. Approximately 12% of our U.S. colleagues are represented by labor unions. Outside the United States, certain of our colleagues are represented by work councils. We believe that our relations with our employees are good, including with those represented by labor unions and/or works councils.\nWe conduct regular employee surveys and listening sessions to understand our employees’ perspectives, identify areas for additional focus and establish action plans. This includes specific feedback from our colleagues through short pulse surveys that provide insights into employee engagement, customer focus, company culture and organizational effectiveness. In addition, we periodically conduct ad hoc surveys to gain insights into other relevant topics, including well-being, safety and professional development.\nOur Purpose and Values\nOur purpose is to empower our customers and communities to build a more water-secure world and, together with our values, provides the foundation for how we want to grow as a company and behave as an industry leader and as ethical corporate citizens. We devote our technology, time and talent to advance the smarter use of water in service of our purpose and our colleagues are guided by our core values, respect, responsibility, integrity and creativity.\nInclusion and Belonging\nWe are committed to a workplace that creates a sense of belonging for everyone: where all our colleagues feel involved, respected, valued, heard, connected, able to bring their authentic selves to the workplace, and empowered to do their best work. We believe that Xylem is strongest when we embrace the power of belonging and inclusion to drive innovation, to make us more competitive, to positively impact employee and customer satisfaction and the Company’s performance, and to better serve the communities in which we operate, creating value for our shareholders and other stakeholders.\nOur commitment to fostering this environment starts with our Board of Directors (“Board”) and senior leadership team, who represent a broad spectrum of backgrounds, identities and perspectives. We believe that the diversity of backgrounds, experiences and perspectives of our Board and senior leadership team enhances our ability to evolve and execute our business strategy and to attract and retain the best talent.\n13\nKey strategies anchoring our efforts to become a more innovative and inclusive organization – and incorporate broader experiences, backgrounds, skill sets, and perspectives into our work – include expanding sourcing channels and prioritizing candidate slates that include a diversity of backgrounds, experiences, and perspectives, when filling professional roles to increase the pool of qualified candidates considered.  All of our hiring, retention and promotion decisions are merit-based.\nWe offer Employee Network Groups, which are voluntary, employee-led groups formed by colleagues with a common affinity, such as gender, race, sexual orientation and gender identity, military status or other attributes. Each Employee Network Group is sponsored and supported by one or more senior leaders and all groups are open to all employees regardless of any diversity attributes with which they may identify. Collectively, approximately 4,500 colleagues participate as members of our network groups.\nHealth and Safety\nProtecting the safety, health and well-being of our colleagues is one of our highest priorities and also regularly assessed in our business reviews. We have a strong Environmental, Health and Safety program that focuses on governance, risk reduction, training and education, and leadership accountability to provide our colleagues with safe and healthy workplaces.\nBased on employee survey feedback, we regularly augment our holistic well-being strategies, including the expansion of our Employee Assistance Program support across the globe, mental health awareness training and additional mental health resources as well as student loan repayment support.\nCompensation and Benefits\nXylem strives to provide our colleagues with competitive compensation and benefits offerings and takes a total rewards approach that integrates programs for compensation, benefits, recognition and well-being. Individual program components may differ by country, role or level.  Our compensation programs are driven by our commitment to fair and equitable compensation as well as alignment to a pay-for-performance culture. We conduct an annual pay equity assessment based on gender and U.S. minority classifications and make pay adjustments as appropriate based on the results.\nWe seek to align our compensation to support execution of our strategy and drive our high-impact culture. Accordingly, in 2021, the Company expanded its sustainability-linked compensation for our senior leaders, as well as a broader group of executives, through a special, one-time grant of performance share units with goals that are based on five of our strategically transformative 2025 Sustainability goals. We continue to expand our long-term incentive program to reach deeper in the organization to recognize key talent and top performers, and to attract and retain digital talent.\nWe continue to balance in-person, remote and hybrid work based on business needs to attract top talent. While the approaches differ by country and role, for office-based colleagues, we generally have a hybrid working approach. To support our colleagues with this working approach, we provide high-touch global onboarding and continue to enhance collaboration technologies.\nCareer Development\nWe are committed to enhancing colleagues’ capabilities needed for the Company to win in the marketplace. We also are focused on internal talent movement across functions, geographies and businesses. Through our high-impact culture and continuous improvement program, we nurture and grow a continuous improvement and learning mindset throughout all areas of the Company.\nWe have a broad range of talent development programs and experiences to facilitate the continued professional growth and leadership development of our colleagues and to strengthen our succession plans. These programs span across all levels, businesses and functions, including entry-level talent recruitment programs, development programs for emerging leaders, people leader training and executive leadership development. We also provide on-demand/self-paced learning through our recently enhanced learning management system.\nWe prioritize employee engagement through regular, year-round discussions focused on performance feedback and development, opportunities to work on special projects, and volunteer activities involving Watermark, our corporate responsibility program, as well as Xylem Ignite, our youth engagement program. In 2024, approximately 79% of our colleagues participated in employee-led volunteerism, including through Watermark, enhancing the Company’s commitment to employee development, retention, recruiting and collaboration in the communities where we live and work. Our Employee Network Groups support the development of our colleagues by offering formal and informal leadership opportunities.\n14\nLabor Relations\nXylem recognizes the work of labor organizations, works councils and trade unions to better the lives of working people. Accordingly, Xylem respects the legal rights of its employees to join or to refrain from joining such organizations. An employee’s decision to join or not join a labor organization will in no way result in any discrimination against that employee. Xylem informs managers at all levels of the importance of respecting the rights of colleagues to organize or be represented. We work to establish favorable employment conditions that promote positive relationships between our colleagues and their managers, facilitate communication among our colleagues and support their development.\nAvailable Information\nWe are required to file annual, quarterly and current reports, proxy statements and other information with the SEC. Our annual reports on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, proxy statements and amendments to those reports are available free of charge on our website \nwww.xylem.com\n as soon as reasonably practicable after such reports are electronically filed with or furnished to the SEC. The information on our website is not, and shall not be deemed to be, a part hereof or incorporated into this or any of our other filings with the SEC.\nIn addition, the public may read or copy any materials filed with the SEC, free of charge, at \nwww.sec.gov.\n15",
  "item7": "ITEM 7.        MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS \nThe following discussion should be read in conjunction with our consolidated financial statements and the notes thereto. This discussion summarizes the significant factors affecting our results of operations and the financial condition of our business. Except as otherwise indicated or unless the context otherwise requires, “Xylem,” “we,” “us,” “our” and “the Company” refer to Xylem Inc. and its subsidiaries. \nThis section of this Form 10-K generally discusses 2024 and 2023 items and year-to-year comparisons between 2024 and 2023. Due to the change in reportable segments effective January 1, 2024, we have provided an updated discussion covering 2023 and 2022 and year-to-year comparisons between 2023 and 2022, reflective of the current reportable segments. \nOverview\nXylem is a leading global water technology company. We design, manufacture and service highly engineered products and solutions ranging across a wide variety of critical applications in utility, industrial, residential and commercial building services settings. Our broad portfolio of solutions addresses customer needs across the water cycle, from the delivery, measurement and use of drinking water to the collection, test, treatment and analysis of wastewater, to the return of water to the environment. Our product and service offerings are organized into four reportable segments that are aligned around the critical market applications they provide: Water Infrastructure, Applied Water, Measurement and Control Solutions and Water Solutions and Services.\n•\nWater Infrastructure\n serves the water infrastructure sector with pump systems that transport water from aquifers, lakes, rivers and seas; with filtration, ultraviolet and ozone systems that provide treatment, making the water fit to use; and pumping solutions that move the wastewater and storm water to treatment facilities where our mixers, biological treatment, monitoring and control systems provide the primary functions in the treatment process. Additionally, our offerings use monitoring and control, smart and connected technologies to allow for remote monitoring of performance and enable products to self-optimize pump operations maximizing energy efficiency and minimizing unplanned downtime and maintenance for our customers. The Water Infrastructure segment also provides a range of highly differentiated and scalable products and technologies with product offerings in the filtration and separation, disinfection, and wastewater solutions, for municipal and industrial applications. In the Water Infrastructure segment, we provide the majority of our sales directly to customers along with strong applications expertise, while the remaining amount is through distribution partners.\n•\nApplied Water\n serves the water usage applications sector with water pressure boosting systems for heating, ventilation and air conditioning, and for fire protection systems to the residential and commercial building solutions markets. In addition, our pumps, heat exchangers and controls provide cooling to power plants and manufacturing facilities, circulation for food and beverage processing, as well as boosting systems for agricultural irrigation. In the Applied Water segment, we provide the majority of our sales through long-standing relationships with many of the leading independent distributors in the markets we serve, with the remainder going directly to customers.\n•\nMeasurement and Control Solutions\n primarily serves the utility infrastructure solutions and services sector by delivering communications, smart metering, measurement and control capabilities and critical infrastructure technologies that allow customers to more effectively use their distribution networks for the delivery, monitoring and control of critical resources such as water, electricity and natural gas. We also provide analytical instrumentation used to measure and analyze water quality, flow and level in clean water, wastewater and outdoor water environments. Additionally, we offer software and services which have been further enhanced by our Xylem Vue platform to enable a holistic view of the water cycle for our customers through cloud-based analytics, remote monitoring and data management with the purpose of optimizing their operating efficiency. In the Measurement and Control Solutions segment, we generate our sales through a combination of long-standing relationships with leading distributors and dedicated channel partners, as well as direct sales depending on the regional availability of distribution channels and the type of product.\n38\n•\nWater Solutions and Services \nprovides tailored services and solutions, in collaboration with customers, including on‑demand water, outsourced water, recycle/reuse, pipeline assessment services, specialty dewatering and emergency response service alternatives to improve operational reliability, performance and environmental compliance. Key offerings within this segment also include equipment systems for industrial needs (influent water, boiler feed water, ultrahigh purity, process water, wastewater treatment, and recycle/reuse), full-scale outsourcing of operations and maintenance, and municipal services, including odor and corrosion control services, as well as leak detection, condition assessment and asset management and pressure monitoring solutions.\nEvoqua Acquisition \nOn May 24, 2023, Xylem completed the acquisition of Evoqua. Commencing from the acquisition date, Xylem’s financial statements include the assets, liabilities, operating results and cash flows of Evoqua. Refer to Note 3, \"Acquisitions and Divestitures,\" for additional information. \nKey Performance Indicators and Non-GAAP Measures\nManagement reviews key performance indicators including revenue, gross margins, segment operating income and operating income margins, orders growth, working capital and backlog, among others. In addition, we consider certain non-GAAP (or \"adjusted\") measures to be useful to management and investors evaluating our operating performance for the periods presented, and to provide a tool for evaluating our ongoing operations, liquidity and management of assets. This information can assist investors in assessing our financial performance and measures our ability to generate capital for deployment among competing strategic alternatives and initiatives, including, but not limited to, dividends, acquisitions, share repurchases and debt repayment. Excluding revenue, Xylem provides guidance only on a non-GAAP basis due to the inherent difficulty in forecasting certain amounts that would be included in GAAP earnings, such as discrete tax items, without unreasonable effort. These adjusted metrics are consistent with how management views our business and are used to make financial, operating and planning decisions. These metrics, however, are not measures of financial performance under GAAP and should not be considered a substitute for revenue, operating income, net income, earnings per share (basic and diluted) or net cash from operating activities as determined in accordance with GAAP. We consider the following non-GAAP measures to be key performance indicators, as well as the related reconciling items to the most directly comparable measure calculated and presented in accordance with GAAP. The non-GAAP measures may not be comparable to similarly titled measures reported by other companies.\n•\n\"organic revenue\" and \"organic orders\" defined as revenue and orders, respectively, excluding the impact of fluctuations in foreign currency translation and contributions from acquisitions and divestitures.  Divestitures include sales or discontinuance of insignificant portions of our business that did not meet the criteria for classification as a discontinued operation.  The period-over-period change resulting from foreign currency translation impacts is determined by translating current period and prior period activity using the same currency conversion rate.\n•\n\"constant currency\" defined as financial results adjusted for foreign currency translation impacts by translating current period and prior period activity using the same currency conversion rate.  This approach is used for countries whose functional currency is not the U.S. dollar.\n•\n\"adjusted net income\" and \"adjusted earnings per share\" defined as net income and earnings per share, respectively, adjusted to exclude restructuring and realignment costs, amortization of acquired intangible assets, gain or loss from sale of businesses, gain on remeasurement of previously held equity interest, \n39\nspecial charges and tax-related special items, as applicable. A reconciliation of adjusted net income and adjusted earnings per share is provided below. \n(in millions, except per share data)\n2024\n2023\nNet income and Earnings per share\n$\n890\n \n$\n3.65\n \n$\n609 \n$\n2.79 \nRestructuring and realignment\n91\n \n0.37\n \n106 \n0.49 \nAcquired intangible amortization\n216\n \n0.89\n \n176 \n0.81 \nSpecial charges (a)\n57\n \n0.23\n \n138 \n0.63 \nGain on remeasurement of previously held equity interest\n(152)\n(0.62)\n— \n— \nTax-related special items\n(19)\n(0.08)\n(115)\n(c)\n(0.53)\nLoss from sale of business\n46\n \n0.19\n \n1 \n— \nTax effects of adjustments (b)\n(88)\n(0.36)\n(90)\n(0.41)\nAdjusted net income and Adjusted earnings per share\n$\n1,041\n \n$\n4.27\n \n$\n825 \n$\n3.78 \nWeighted average number of shares - diluted\n243.5\n218.2\n(a)\nThe special charges in the years end December 31, 2024 and 2023 primarily relate to $50 million and $134 million of acquisition and integration related costs, respectively.\n(b)\nThe tax effects of adjustments are calculated using the statutory tax rate, taking into consideration the nature of the item and the relevant taxing jurisdiction.\n(c)\nThe tax-related special items in 2023 primarily relate to $70 million of tax benefits from tax exam impacts and $27 million of tax benefits relating to tax law changes.\n▪\n\"adjusted operating expenses\" defined as operating expenses adjusted to exclude amortization of acquired intangible assets, restructuring and realignment costs and special charges, as applicable.\n▪\n\"adjusted operating income\" defined as operating income, adjusted to exclude restructuring and realignment costs, amortization of acquired intangible assets, gain or loss from sale of businesses, gain on remeasurement of previously held equity interest, special charges and tax-related special items, as applicable, and \"adjusted operating margin\" defined as adjusted operating income divided by total revenue.\n▪\n“EBITDA” defined as earnings before interest, taxes, depreciation and amortization expense, \"EBITDA margin\" defined as EBITDA divided by total revenue, \"adjusted EBITDA\" reflects the adjustment to EBITDA to exclude share-based compensation charges, restructuring and realignment costs, gain or loss from sale of businesses, gain on remeasurement of previously held equity interest and special charges, and \"adjusted EBITDA margin\" defined as adjusted EBITDA divided by total revenue.\n▪\n“realignment costs” defined as costs not included in restructuring costs that are incurred as part of actions taken to reposition our business, including items such as professional fees, severance, relocation, travel, facility set-up and other costs.\n▪\n“special charges\" defined as costs incurred by the Company, such as acquisition and integration related costs, non-cash impairment charges and both operating and non-operating adjustments for costs related to the U.K. pension plan buy-out.\n▪\n\"tax-related special items\" defined as tax items, such as tax return versus tax provision adjustments, tax exam impacts, tax law change impacts, excess tax benefits/losses and other discrete tax adjustments.\n▪\n\"free cash flow\" defined as net cash from operating activities, as reported in the Statement of Cash Flows, less capital expenditures. Our definition of \"free cash flow\" does not consider certain non-discretionary cash payments, such as debt. The following table provides a reconciliation of free cash flow. \n(in millions)\n2024\n2023\nNet cash provided by operating activities\n$\n1,263\n \n$\n837 \nCapital expenditures\n(321)\n(271)\nFree cash flow\n$\n942\n \n$\n566 \nNet cash used in investing activities\n$\n(482)\n$\n(628)\nNet cash used in financing activities\n$\n(615)\n$\n(157)\n40\nExecutive Summary\nXylem reported revenue of $8,562 million for 2024, an increase of $1,198 million, or 16.3%, from $7,364 million reported in 2023. On a constant currency basis, revenue increased by $1,210 million, or 16.4%, during the year. The increase at constant currency consists of revenue from acquisitions of $786 million and an increase in organic revenue of $424 million reflecting organic growth across all major geographic regions, with organic growth in the Measurement and Control Solutions, Water Infrastructure, and Water Solutions and Services segments, more than offsetting organic declines in the Applied Water segment.\nOperating income for 2024 was $1,009 million, reflecting an increase of $357 million, or 54.8%, compared to $652 million in 2023. Operating margin was 11.8% in 2024, up 290 basis points from 8.9% in 2023. The increase in operating income for 2024 included a decrease in special charges of $81 million, an increase in purchased intangible amortization of $40 million, and a decrease in restructuring and realignment costs of $15 million as compared to 2023. Excluding the impact of these items, adjusted operating income was $1,373 million, with an adjusted operating margin of 16.0% in 2024 as compared to adjusted operating income of $1,072 million with an adjusted operating margin of 14.6% in 2023, an increase of 140 basis points. \nAdditional financial highlights for 2024 include the following:\n•\nNet income of $890 million, or $3.65 per diluted share, up 30.8% ($1,041 million or $4.27 per diluted share on an adjusted basis, up 13.0% from 2023)\n•\nNet cash provided by operating activities of $1,263 million, up 51% from 2023, and free cash flow of $942 million, up 66% from 2023\n•\nOrders of $8,730 million, up 16.4% from $7,501 million in 2023 (up 4.7% on an organic basis)\n•\nDividends paid to shareholders increased 9% in 2024.\nResults of Operations\n(in millions)\n2024\n2023\n2022\n2024 v. 2023\n2023 v. 2022\nRevenue\n$\n8,562\n \n$\n7,364 \n$\n5,522 \n16.3 \n%\n33.4 \n%\nGross profit\n3,212\n \n2,717 \n2,084 \n18.2 \n%\n30.4 \n%\nGross margin\n37.5\n \n%\n36.9 \n%\n37.7 \n%\n60 \nbp\n(80)\nbp\nTotal operating expenses\n2,203\n \n2,065 \n1,462 \n6.7 \n%\n41.2 \n%\nExpense to revenue ratio\n25.7\n \n%\n28.0 \n%\n26.5 \n%\n(230)\nbp\n150 \nbp\nOperating income\n1,009\n \n652 \n622 \n54.8 \n%\n4.8 \n%\nOperating margin\n11.8\n \n%\n8.9 \n%\n11.3 \n%\n290 \nbp\n(240)\nbp\nU.K. pension settlement expense\n—\n \n— \n140 \nNM\nNM\nInterest and other non-operating expense, net\n28\n \n16 \n43 \n75.0 \n%\n(62.8)\n%\nGain on remeasurement of previously held equity interest\n152\n \n— \n— \nNM\nNM\n(Loss)/gain from sale of business\n(46)\n(1)\n1 \n4,500.0 \n%\n(200.0)\n%\nIncome tax expense\n197\n \n26 \n85 \n657.7 \n%\n(69.4)\n%\nTax rate\n18.1\n \n%\n4.1 \n%\n19.2 \n%\n1,400 \nbp\n(1,510)\nbp\nNet income\n$\n890\n \n$\n609 \n$\n355 \n46.1 \n%\n71.5 \n%\nNM     Not Meaningful\n2024 versus 2023 \nRevenue \nRevenue generated for 2024 was $8,562 million, an increase of $1,198 million, or 16.3%, compared to $7,364 million in 2023. The increase at constant currency consists of revenue from acquisitions of $786 million and an increase in organic revenue of $424 million, reflecting organic growth across all major geographic regions, with organic growth in the Measurement and Control Solutions, Water Infrastructure, and Water Solutions and Services segments, more than offsetting organic declines in the Applied Water segment.\n41\nThe following table illustrates the impact from organic growth, recent acquisitions and divestitures, and foreign currency translation in relation to revenue during 2024:\nWater Infrastructure\nApplied Water\nMeasurement and Control Solutions\nWater Solutions and Services\nTotal Xylem\n(in millions)\n$ Change\n% Change\n$ Change\n% Change\n$ Change\n% Change\n$ Change\n% Change\n$ Change\n% Change\n2023 Revenue\n$\n2,215 \n$\n1,853 \n$\n1,612 \n$\n1,684 \n$\n7,364 \nOrganic Growth\n123 \n5.5 \n%\n(58)\n(3.2)\n%\n255 \n15.9 \n%\n104 \n6.2 \n%\n424 \n5.8 \n%\nAcquisitions/(Divestitures)\n221 \n10.0 \n%\n— \n— \n%\n4 \n0.2 \n%\n561 \n33.3 \n%\n786 \n10.7 \n%\nConstant Currency\n344 \n15.5 \n%\n(58)\n(3.2)\n%\n259 \n16.1 \n%\n665 \n39.5 \n%\n1,210 \n16.5 \n%\nForeign currency translation (a)\n(4)\n(0.2)\n%\n(2)\n(0.1)\n%\n— \n— \n%\n(6)\n(0.3)\n%\n(12)\n(0.2)\n%\nTotal change in revenue\n340 \n15.3 \n%\n(60)\n(3.3)\n%\n259 \n16.1 \n%\n659 \n39.2 \n%\n1,198 \n16.3 \n%\n2024 Revenue\n$\n2,555\n \n$\n1,793\n \n$\n1,871\n \n$\n2,343\n \n$\n8,562\n \n(a)\nForeign currency translation impact for the year primarily due to the weakening in value of various currencies against the U.S. Dollar, the largest being the Canadian Dollar, Chinese Yuan, Chilean Peso, Brazilian Real and the Hungarian Forint, offset by the strengthening in the British Pound.\nWater Infrastructure \nWater Infrastructure revenue increased $340 million, or 15.3%, to $2,555 million in 2024 compared to 2023. Revenue growth was partially made up of the revenue contributed by acquisitions of $221 million, with the remainder of the increase coming from organic revenue growth of $123 million, or 5.5%. Revenue was negatively impacted by $4 million of foreign currency translation. The transport application had $79 million of organic revenue growth, driven by strength in all of our major geographic regions, led by increased sales volume and price realization in the U.S. and Canada, and backlog execution and infrastructure projects in western Europe. Organic revenue for the transport application also benefited from increased infrastructure projects in the emerging markets. Organic revenue for the treatment applications grew by $44 million, led by infrastructure projects in the U.S. and emerging markets.\nApplied Water\nApplied Water revenue decreased $60 million, or 3.3%, to $1,793 million in 2024 compared to 2023. Revenue was negatively impacted by $2 million of foreign currency translation, with the change at constant currency coming entirely from organic declines of $58 million. Industrial organic revenue decreased by $32 million due to timing of projects and softness across all major geographic regions. Organic revenue from building solutions declined $26 million driven by softness in the U.S.\nMeasurement and Control Solutions \nMeasurement and Control Solutions revenue increased $259 million, or 16.1%, to $1,871 million in 2024 compared to 2023. Foreign currency translation was flat during the year, with the change at constant currency coming from organic growth of $255 million, and $4 million of acquisition activity. Smart metering and other applications had $261 million of organic growth, driven by increased sales volume due to backlog execution in the U.S. Organic growth was partially offset by $6 million of organic decline in analytics, driven by lapping of project deliveries and backlog execution in the U.S. and emerging markets in the prior year.\nWater Solutions and Services\nWater Solutions and Services revenue increased $659 million, or 39.2% to $2,343 million in 2024 compared to 2023. Revenue growth was partially made up of the revenue contributed by acquisitions of $561 million, with the remainder of the increase coming from organic revenue growth of $104 million, or 6.2%. Revenue was negatively impacted by $6 million of foreign currency translation. Organic revenue growth was primarily from strength in the dewatering applications in the emerging markets and the U.S. due to increased sales volume, strong rental demand and increased capital project revenue in Canada. \n42\nOrders/Backlog \nAn order represents a legally enforceable, written document that includes the scope of work or services to be performed or equipment to be supplied to a customer, the corresponding price and the expected delivery date for the applicable products or services to be provided. An order often takes the form of a customer purchase order or a signed quote from a Xylem business. \nThe following table illustrates the impact from organic growth, recent acquisitions and divestitures, and foreign currency translation in relation to orders during 2024:\nWater Infrastructure\nApplied Water\nMeasurement and Control Solutions\nWater Solutions and Services\nTotal Xylem\n(in millions)\n$ \nChange\n% \nChange\n$ \nChange\n% \nChange\n$ \nChange\n% \nChange\n$ \nChange\n% \nChange\n$ \nChange\n% \nChange\n2023 Orders\n$\n2,313 \n$\n1,770 \n$\n1,670 \n$\n1,748 \n$\n7,501 \nOrganic Impact\n173 \n7.5 \n%\n57 \n3.2 \n%\n(3)\n(0.2)\n%\n122 \n7.0 \n%\n349 \n4.7 \n%\nAcquisitions/(Divestitures)\n243 \n10.5 \n%\n— \n— \n%\n5 \n0.3 \n%\n643 \n36.8 \n%\n891 \n11.9 \n%\nConstant Currency\n416 \n18.0 \n%\n57 \n3.2 \n%\n2 \n0.1 \n%\n765 \n43.8 \n%\n1,240 \n16.6 \n%\nForeign currency translation (a)\n(2)\n(0.1)\n%\n(3)\n(0.2)\n%\n— \n— \n%\n(6)\n(0.3)\n%\n(11)\n(0.1)\n%\nTotal change in orders\n414 \n17.9 \n%\n54 \n3.1 \n%\n2 \n0.1 \n%\n759 \n43.4 \n%\n1,229 \n16.4 \n%\n2024 Orders\n$\n2,727\n \n$\n1,824\n \n$\n1,672\n \n$\n2,507\n \n$\n8,730\n \n(a)\nForeign currency translation impact for the year primarily due to the weakening in value of various currencies against the U.S. Dollar, the largest being the Canadian Dollar, Chinese Yuan, Chilean Peso, Brazilian Real and the Hungarian Forint, offset by the strengthening in the British Pound.\nBacklog \nBacklog includes orders on hand as well as contractual customer agreements at the end of the period. Delivery schedules vary from customer to customer based on their requirements. Annual or multi-year contracts are subject to rescheduling and cancellation by customers due to the long-term nature of the contracts. As such, beginning total backlog, plus orders, minus revenues, will not equal ending total backlog due to contract adjustments, foreign currency fluctuations, and other factors. Typically, large projects require longer lead production cycles and deployment schedules and delays occur from time to time. Total backlog was $5,070 million at December 31, 2024 and $5,088 million at December 31, 2023, a decrease of 0.4%.  We anticipate that more than 50% of our total backlog at December 31, 2024 will be recognized as revenue during 2025.\nGross Margin \nGross margin as a percentage of consolidated revenue increased 60 basis points to 37.5% in 2024 as compared to 36.9% in 2023. The gross margin increase included 40 basis points of favorable impacts from decreases in realignment costs and special charges as compared to the prior year and 10 basis points of unfavorable impacts from increased intangible amortization expense. The gross margin increase for the year included favorable operational impacts of 280 basis points, driven by 180 basis points of productivity savings and 90 basis points of price realization. These impacts were partially offset by 250 basis points of negative operating impacts, driven by 150 basis points of inflation, 50 basis points of unfavorable impacts from the Evoqua acquisition, and 30 basis points of increased spending on strategic investments.\n43\nOperating Expenses\n(in millions)\n2024\n2023\nChange\nSelling, general and administrative expenses\n$\n1,911\n \n$\n1,757 \n8.8 \n%\nSG&A as a % of revenue\n22.3\n \n%\n23.9 \n%\n(160)\nbp\nResearch and development expenses\n230\n \n232 \n(0.9)\n%\nR&D as a % of revenue\n2.7\n \n%\n3.2 \n%\n(50)\nbp\nRestructuring and asset impairment charges\n62\n \n76 \n(18.4)\n%\nOperating expenses\n$\n2,203\n \n$\n2,065 \n6.7 \n%\nExpense to revenue ratio\n25.7\n \n%\n28.0 \n%\n(230)\nbp\nSelling, General and Administrative (\"SG&A\") Expenses \nSG&A expenses increased by $154 million (increase of 8.8%) to 22.3% of revenue in 2024, as compared to 23.9% of revenue in 2023. Cost increases were driven by $146 million of additional operational SG&A from the acquisition of Evoqua, $49 million of inflation, $36 million of increased spending on strategic investments, $24 million of increased acquired intangible asset amortization and $11 million of increased volume, partially offset by $61 million of savings from productivity initiatives and $56 million of decreased special charges, primarily costs associated with the Evoqua acquisition in the prior year.\nResearch and Development (\"R&D\") Expenses \nR&D expense was $230 million, or 2.7% of revenue, in 2024 which was fairly consistent with the 2023 expense of $232 million, or 3.2% of revenue. \nRestructuring and Asset Impairment Charges\nRestructuring\nFrom time to time, the Company will incur costs related to restructuring actions in order to optimize our cost base and more strategically position itself. Restructuring charges were $55 million in 2024 as compared to $72 million in 2023. \nFor the year ended December 31, 2024, the charges incurred primarily related to actions taken to further streamline our organization in order to strengthen our competitive positioning and the ability to better serve our customers. The charges incurred were across all of our segments, with the majority of the charges impacting the Water Solutions and Services and Water Infrastructure segments.\nFor the year ended December 31, 2023, we incurred these charges primarily as a result of our acquisition of Evoqua. Approximately $27 million of the charges related to share-based compensation expense due to acceleration clauses in Evoqua's equity compensation agreements. Approximately $15 million of the charges represented the reduction of headcount related to the integration of Evoqua. Additionally, during 2023 we incurred $30 million of charges related to our efforts to reposition our businesses to optimize our cost structure, improve our operational efficiency and effectiveness, strengthen our competitive positioning and better serve our customers. The charges were incurred across all of our segments. \nRefer to Note 5, \"Restructuring and Asset Impairment Charges\" for more information.\nThe following is a roll-forward of employee position eliminations associated with restructuring activities for the years ended December 31, 2024 and 2023:\n2024\n2023\nPlanned reductions - January 1\n113\n \n102 \nAdditional planned reductions\n749\n \n454 \nActual reductions and reversals\n(480)\n(443)\nPlanned reductions - December 31\n382\n \n113 \n44\nAs a result of the actions initiated in 2024, we achieved savings of approximately $8 million in 2024 and estimate annual future net savings beginning in 2025 of approximately $55 million, resulting in $47 million of incremental savings from 2024 actions.\nAsset Impairment \nRefer to Note 12, \"Goodwill and Other Intangible Assets,\" for more information on intangible asset impairment charges incurred during the years ended December 31, 2024 and 2023.\nOperating Income, Net Income, and Adjusted EBITDA \nOperating income was $1,009 million (operating margin of 11.8%) during 2024, an increase of $357 million, or 54.8%, when compared to operating income of $652 million (operating margin of 8.9%) during the prior year. Operating margin included favorable impacts of 150 basis points from a net decrease in special charges, restructuring and realignment costs, and acquired intangible asset amortization as compared to the prior year. Additionally, operating margin included 490 basis points of expansion from favorable operating impacts, driven by a 270 basis point increase from productivity savings, 130 basis points from price realization, and 80 basis points from favorable volume. Margin expansion was offset by 350 basis points of unfavorable impacts driven by 210 basis points of inflation and 80 basis points of increased spending on strategic investments. Excluding special charges, acquired intangible asset amortization, and restructuring and realignment costs, adjusted operating income was $1,373 million (adjusted operating margin of 16.0%) for 2024 as compared to adjusted operating income of $1,072 million (adjusted operating margin of 14.6%) during the prior year.\nNet income was $890 million (net income margin of 10.4%) during 2024, an increase of $281 million as compared to net income in the prior year of $609 million (net income margin of 8.3%). The increase in net income was driven by increased operating income of $357 million and a non-recurring gain on the remeasurement of our previously held equity interest in Idrica of $152 million. Net income growth was partially offset by increased income tax expense of $171 million, increased loss on sale of businesses of $45 million, and increased interest and non-operating expense of $12 million. Adjusted EBITDA was $1,763 million (adjusted EBITDA margin of 20.6%) during 2024, an increase of $371 million, or 26.7%, when compared to adjusted EBITDA of $1,392 million (adjusted EBITDA margin of 18.9%) during the prior year. The increase in adjusted EBITDA margin was primarily due to the same factors impacting adjusted operating margin noted above; however, adjusted EBITDA was not negatively impacted by the relative impact of increased depreciation and software amortization expense.\n45\nThe table below provides a reconciliation of total and each segment's operating income to adjusted operating income, and a calculation of the corresponding adjusted operating margin: \n(In millions)\n2024\n2023\nChange\nWater Infrastructure\nOperating income\n$\n356\n \n$\n275 \n29.5 \n%\nOperating margin\n13.9\n \n%\n12.4 \n%\n150 \nbp\nRestructuring and realignment costs\n30\n \n18 \n66.7 \n%\nPurchase accounting intangible amortization\n59\n \n47 \n25.5 \n%\nSpecial charges\n10\n \n28 \n(64.3)\n%\nAdjusted operating income\n$\n455\n \n$\n368 \n23.6 \n%\nAdjusted operating margin\n17.8\n \n%\n16.6 \n%\n120 \nbp\nApplied Water\nOperating income\n$\n271\n \n$\n310 \n(12.6)\n%\nOperating margin\n15.1\n \n%\n16.7 \n%\n(160)\nbp\nRestructuring and realignment costs\n15\n \n14 \n7.1 \n%\nPurchase accounting intangible amortization\n—\n \n— \nNM\n%\nSpecial charges\n—\n \n— \nNM\n%\nAdjusted operating income\n$\n286\n \n$\n324 \n(11.7)\n%\nAdjusted operating margin\n16.0\n \n%\n17.5 \n%\n(150)\nbp\nMeasurement and Control Solutions\nOperating income\n$\n247\n \n$\n133 \n85.7 \n%\nOperating margin\n13.2\n \n%\n8.3 \n%\n490 \nbp\nRestructuring and realignment costs\n10\n \n19 \n(47.4)\n%\nPurchase accounting intangible amortization\n58\n \n57 \n1.8 \n%\nSpecial charges\n12\n \n4 \n200.0 \n%\nAdjusted operating income\n$\n327\n \n$\n213 \n53.5 \n%\nAdjusted operating margin\n17.5\n \n%\n13.2 \n%\n430 \nbp\nWater Solutions and Services\nOperating income\n$\n219\n \n$\n132 \n65.9 \n%\nOperating margin\n9.3\n \n%\n7.8 \n%\n150 \nbp\nRestructuring and realignment costs\n35\n \n20 \n75.0 \n%\nPurchase accounting intangible amortization\n99\n \n72 \n37.5 \n%\nSpecial charges\n15\n \n22 \n(31.8)\n%\nAdjusted operating income\n$\n368\n \n$\n246 \n49.6 \n%\nAdjusted operating margin\n15.7\n \n%\n14.6 \n%\n110 \nbp\nCorporate and other\nOperating loss\n$\n(84)\n$\n(198)\n(57.6)\n%\nRestructuring and realignment costs\n1\n \n35 \n(97.1)\n%\nSpecial charges\n20\n \n84 \n(76.2)\nAdjusted operating loss\n$\n(63)\n$\n(79)\n(20.3)\n%\nTotal Xylem\nOperating income\n$\n1,009\n \n$\n652 \n54.8 \n%\nOperating margin\n11.8\n \n%\n8.9 \n%\n290 \nbp\nRestructuring and realignment costs\n91\n \n106 \n(14.2)\n%\nPurchase accounting intangible amortization\n216\n \n176 \n22.7 \n%\nSpecial charges\n57\n \n138 \n(58.7)\n%\nAdjusted operating income\n$\n1,373\n \n$\n1,072 \n28.1 \n%\nAdjusted operating margin\n16.0\n \n%\n14.6 \n%\n140 \nbp\nNM    Not Meaningful \n46\nThe table below provides a reconciliation of net income to consolidated EBITDA and adjusted EBITDA: \n \n(in millions)\nYear Ended December 31,\n2024\n2023\nChange\nNet Income\n$\n890\n \n$\n609 \n46 \n%\nNet Income margin\n10.4\n \n%\n8.3 \n%\n210 \nbp\nDepreciation\n258\n \n193 \n34 \n%\nAmortization\n304\n \n243 \n25 \n%\nInterest expense, net\n16\n \n21 \n(24)\n%\nIncome tax expense\n197\n \n26 \n658 \n%\nEBITDA\n$\n1,665\n \n$\n1,092 \n52 \n%\nShare-based compensation\n56\n \n60 \n(7)\n%\nRestructuring and realignment\n91\n \n103 \n(12)\n%\nSpecial charges\n57\n \n136 \n(58)\n%\nGain on remeasurement of previously held equity interest\n(152)\n— \nNM\nLoss from sale of business\n46\n \n1 \n4500 \n%\nAdjusted EBITDA\n$\n1,763\n \n$\n1,392 \n27 \n%\nAdjusted EBITDA margin\n20.6\n \n%\n18.9 \n%\n170 \nbp\nThe tables below provide a reconciliation of each segment's operating income (loss) to EBITDA and adjusted EBITDA: \nYear Ended December 31, 2024\n(in millions)\nWater Infrastructure\n \nApplied Water Systems\n \nMeasurement and Control Solutions\nWater Solutions and Services\nOperating Income\n$\n356\n \n$\n271\n \n$\n247\n \n$\n219\n \nOperating margin\n13.9\n \n%\n15.1\n \n%\n13.2\n \n%\n9.3\n \n%\nGain on remeasurement of previously held equity interest\n—\n \n—\n \n152\n \n—\n \nLoss from sale of business\n(40)\n—\n \n—\n \n(6)\nDepreciation\n46\n \n25\n \n26\n \n159\n \nAmortization\n76\n \n3\n \n106\n \n108\n \nOther non-operating expense, excluding interest\n(1)\n(3)\n(10)\n1\n \nEBITDA\n$\n437\n \n$\n296\n \n$\n521\n \n$\n481\n \nShare-based compensation\n12\n \n6\n \n4\n \n11\n \nRestructuring and realignment\n30\n \n15\n \n10\n \n35\n \nSpecial charges\n10\n \n—\n \n12\n \n15\n \nLoss from sale of business\n40\n \n—\n \n—\n \n6\n \nAdjusted EBITDA\n$\n529\n \n$\n317\n \n$\n395\n \n$\n548\n \nAdjusted EBITDA margin\n20.7\n \n%\n17.7\n \n%\n21.1\n \n%\n23.4\n \n%\n47\nYear Ended December 31, 2023\n(in millions)\nWater Infrastructure\n \nApplied Water Systems\n \nMeasurement and Control Solutions\nWater Solutions Services\nOperating Income\n$\n275\n \n$\n310\n \n$\n133\n \n$\n132\n \nOperating margin\n12.4\n \n%\n16.7\n \n%\n8.3\n \n%\n7.8\n \n%\nLoss from sale of business\n— \n— \n(1)\n— \nDepreciation\n34 \n25 \n27 \n105 \nAmortization\n55 \n3 \n97 \n79 \nOther non-operating expense, excluding interest\n3 \n(2)\n(4)\n1 \nEBITDA\n$\n367\n \n$\n336\n \n$\n252\n \n$\n317\n \nShare-based compensation\n13 \n3 \n7 \n10 \nRestructuring and realignment\n18 \n13 \n17 \n20 \nSpecial charges\n28 \n— \n4 \n22 \nLoss from sale of business\n— \n— \n1 \n— \nAdjusted EBITDA\n$\n426\n \n$\n352\n \n$\n281\n \n$\n369\n \nAdjusted EBITDA margin\n19.2\n \n%\n19.0\n \n%\n17.4\n \n%\n21.9\n \n%\n2024 versus 2023\n(in millions)\nWater Infrastructure\n \nApplied Water Systems\n \nMeasurement and Control Solutions\nWater Solutions and Services\nOperating Income (Loss)\n$\n81\n \n$\n(39)\n$\n114\n \n$\n87\n \nOperating margin\n150\n \n bps\n(160)\n bps\n490\n \n bps\n150\n \n bps\nGain on remeasurement of previously held equity interest\n— \n— \n152 \n— \nLoss from sale of business\n(40)\n— \n1 \n(6)\nDepreciation\n12 \n— \n(1)\n54 \nAmortization\n21 \n— \n9 \n29 \nOther non-operating expense, excluding interest\n(4)\n(1)\n(6)\n— \nEBITDA\n$\n70\n \n$\n(40)\n$\n269\n \n$\n164\n \nShare-based compensation\n(1)\n3 \n(3)\n1 \nRestructuring and realignment\n12 \n2 \n(7)\n15 \nSpecial charges\n(18)\n— \n8 \n(7)\nLoss from sale of business\n40 \n— \n(1)\n6 \nAdjusted EBITDA\n$\n103\n \n$\n(35)\n$\n114\n \n$\n179\n \nAdjusted EBITDA margin\n150\n \n bps\n(130)\n bps\n370\n \n bps\n150\n \n bps\n48\nWater Infrastructure\nOperating income was $356 million for our Water Infrastructure segment (operating margin of 13.9%) during 2024, an increase of $81 million, or 29.5%, when compared to operating income of $275 million (operating margin of 12.4%) during the prior year, or a total increase of 150 basis points of operating margin. Operating margin growth included favorable impacts of 30 basis points from a minor overall net increase in acquired intangible asset amortization, restructuring and realignment costs, and special charges relative to the increase in revenue as compared to the prior year. Additionally, operating margin increases included 520 basis points from favorable operating impacts, driven by 270 basis points from productivity savings, 90 basis points of price realization, 60 basis points of favorable mix, and 40 basis points of favorable volume.  Operating margin growth was partially offset by negative operating impacts of 400 basis points including 190 basis points of inflation, 60 basis points of increased spending on strategic investments and 40 basis points of negative operating impact from the impact of the Evoqua acquisition. Excluding acquired intangible asset amortization, special charges and restructuring and realignment costs, adjusted operating income was $455 million (adjusted operating margin of 17.8%) during 2024 as compared to adjusted operating income of $368 million (adjusted operating margin of 16.6%) during the prior year.\nAdjusted EBITDA was $529 million (adjusted EBITDA margin of 20.7%) during 2024, an increase of $103 million, or 24.2%, when compared to adjusted EBITDA of $426 million (adjusted EBITDA margin of 19.2%) during the prior year. The increase in adjusted EBITDA margin was primarily due to the same factors impacting the increase in adjusted operating margin; however, adjusted EBITDA was not negatively impacted by the relative impact of increased depreciation and software amortization expense.\nApplied Water\nOperating income was $271 million for our Applied Water segment (operating margin of 15.1%) during 2024, a decrease of $39 million, or 12.6%, when compared to operating income of $310 million (operating margin of 16.7%) during the prior year, or a total decrease of 160 basis points of operating margin. The decrease in operating margin included unfavorable impacts of 10 basis points from a slight increase in restructuring and realignment costs as compared to the prior year. Operating margin also included negative operating impacts of 470 basis points, driven by 220 basis points of inflation, 110 basis points of unfavorable volume, and 80 basis points of unfavorable mix. Declines were partially offset by 320 basis points of favorable operating impacts, consisting of 270 basis points from productivity savings and 50 basis points of price realization. Excluding restructuring and realignment costs, adjusted operating income was $286 million (adjusted operating margin of 16.0%) during 2024 as compared to adjusted operating income of $324 million (adjusted operating margin of 17.5%) during the prior year.\nAdjusted EBITDA was $317 million (adjusted EBITDA margin of 17.7%) during 2024, a decrease of $35 million, or (9.9)%, when compared to adjusted EBITDA of $352 million (adjusted EBITDA margin of 19.0%) during the prior year. The decrease in adjusted EBITDA margin was primarily due to the same factors impacting the decrease in adjusted operating margin. \nMeasurement and Control Solutions \nOperating income was $247 million for our Measurement and Control Solutions segment (operating margin of 13.2%) during 2024, an increase of $114 million, or 85.7%, when compared to operating income of $133 million (operating margin of 8.3%) during the prior year, or a total increase of 490 basis points of operating margin. Operating margin increases included favorable impacts of 60 basis points from the net impact of restructuring and realignment costs, acquired intangible asset amortization, and special charges being flat as compared to the prior year relative to an increase in revenue. Additionally, the operating margin increase included 870 basis points from favorable operating impacts driven by 340 basis points from productivity savings, 260 basis points of price realization, and 240 basis points from favorable volume. Favorable impacts were partially offset by 440 basis points of unfavorable impacts driven by 270 basis points of inflation, 80 basis points of increased spending on strategic investments, and 60 basis points of increased inventory management costs. Excluding restructuring and realignment costs, acquired intangible asset amortization, and special charges, adjusted operating income was $327 million (adjusted operating margin of 17.5%) during 2024 as compared to adjusted operating income of $213 million (adjusted operating margin of 13.2%) during the prior year.\nAdjusted EBITDA was $395 million (adjusted EBITDA margin of 21.1%) during 2024, an increase of $114 million, or 40.6%, when compared to adjusted EBITDA of $281 million (adjusted EBITDA margin of 17.4%) during the prior year. The increase in adjusted EBITDA margin was due to the same factors as those impacting the increase in adjusted operating margin; however, adjusted EBITDA margin was negatively impacted by increased non-operating expense and did not benefit from the relative impact of decreased share-based compensation expense.\n49\nWater Solutions and Services\nOperating income was $219 million for our Water Solutions and Services segment (operating margin of 9.3%) during 2024 an increase of $87 million, or 65.9%, when compared to operating income of $132 million (operating margin of 7.8%) during the prior year, or a total increase of 150 basis points of operating margin. Operating margin increases included favorable impacts of 40 basis points from increases in revenue outpacing a net increase in acquired intangible asset amortization, restructuring and realignment costs, and special charges as compared to the prior year. Additionally, the operating margin increase included 490 basis points from favorable operating impacts consisting of 160 basis points from productivity savings, 150 basis points from favorable volume, 130 basis points of price realization, and 50 basis points of positive operating impact from the impact of the Evoqua acquisition. Favorable impacts were partially offset by 380 basis points of unfavorable impacts driven by 150 basis points of inflation, and 150 basis points of increased spending on strategic investments. Excluding acquired intangible asset amortization, restructuring and realignment costs, and special charges, adjusted operating income was $368 million (adjusted operating margin of 15.7%) during 2024 as compared to adjusted operating income of $246 million (adjusted operating margin of 14.6%) during the prior year.\nAdjusted EBITDA was $548 million (adjusted EBITDA margin of 23.4%) during 2024, an increase of $179 million, or 49%, when compared to adjusted EBITDA of $369 million (adjusted EBITDA margin of 21.9%) during the prior year. The increase in adjusted EBITDA margin was due to the same factors as those impacting the increase in adjusted operating margin; however, adjusted EBITDA was not unfavorably impacted by the increase in depreciation and software amortization expense.\nCorporate and other \nOperating loss was $84 million for corporate and other during 2024, a decrease of $114 million, or 57.6% when comparing to operating loss of $198 million during the prior year. The decrease in operating loss for the year was primarily due to lower special charges and restructuring and realignment costs as compared to the prior year.  Excluding special charges and restructuring and realignment costs, adjusted operating loss decreased $16 million during 2024 or 20.3%, compared to the prior year.  The decrease in adjusted operating loss is primarily driven by lower employee costs and productivity savings. \nInterest Expense\nInterest expense was $44 million and $49 million for 2024 and 2023, respectively. The decrease in interest expense was primarily driven by increased interest income generated on cross currency swaps offsetting interest expense, and decreased interest from commercial paper. See Note 15, \"Credit Facilities and Debt\", of our consolidated financial statements for a description of our credit facilities and long-term debt and related interest. \nIncome Tax Expense \nThe income tax provision for 2024 was $197 million at an effective tax rate of 18.1% as compared to $26 million at an effective tax rate of 4.1% in 2023. The 2024 effective tax rate differs from that of 2023 primarily due to the impact of audit settlements and tax rate changes in the prior period. See Note 7, \"Income Taxes\", of our consolidated financial statements for additional details on our tax attributes and related tax expense.\n2023 versus 2022 \nRevenue \nRevenue generated for 2023 was $7,364 million, an increase of $1,842 million, or 33.4%, compared to $5,522 million in 2022. On a constant currency basis, revenue grew 33.8% during 2023. The increase at constant currency consists of revenue from acquisitions of $1,177 million and an increase in organic revenue of $690 million, reflecting strong organic growth in all segments as well as across all major geographic regions.\n50\nThe following table illustrates the impact from organic growth, recent acquisitions and divestitures, and foreign currency translation in relation to revenue during 2023 as recast by segment structure change effective on January 1, 2024:\nWater Infrastructure\nApplied Water\nMeasurement and Control Solutions\nWater Solutions and Services\nTotal Xylem\n(in millions)\n$ Change\n% Change\n$ Change\n% Change\n$ Change\n% Change\n$ Change\n% Change\n$ Change\n% Change\n2022 Revenue\n$\n1,686 \n$\n1,767 \n$\n1,275 \n$\n794 \n$\n5,522 \nOrganic Growth\n175 \n10.4 \n%\n96 \n5.4 \n%\n337 \n26.4 \n%\n82 \n10.3 \n%\n690 \n12.5 \n%\nAcquisitions/(Divestitures)\n362 \n21.5 \n%\n— \n— \n%\n— \n— \n%\n815 \n102.6 \n%\n1,177 \n21.3 \n%\nConstant Currency\n537 \n31.9 \n%\n96 \n5.4 \n%\n337 \n26.4 \n%\n897 \n112.9 \n%\n1,867 \n33.8 \n%\nForeign currency translation (a)\n(8)\n(0.5)\n%\n(10)\n(0.5)\n%\n— \n— \n%\n(7)\n(0.8)\n%\n(25)\n(0.4)\n%\nTotal change in revenue\n529 \n31.4 \n%\n86 \n4.9 \n%\n337 \n26.4 \n%\n890 \n112.1 \n%\n1,842 \n33.4 \n%\n2023 Revenue\n$\n2,215\n \n$\n1,853\n \n$\n1,612\n \n$\n1,684\n \n$\n7,364\n \n(a)\nForeign currency translation impact for the year primarily due to the weakening in value of various currencies against the U.S. Dollar, the largest being the Chinese Yuan, the Canadian Dollar and the Norwegian Krone\nWater Infrastructure \nWater Infrastructure revenue increased $529 million, or 31.4%, to $2,215 million in 2023 (31.9% increase on a constant currency basis) compared to 2022. Revenue growth was partially made up of the revenue contributed by acquisitions from Applied Product Technologies of $362 million, with the remainder of the increase coming from organic revenue growth of $175 million, or 10.4%. Revenue was negatively impacted by $8 million of foreign currency translation. Organic revenue growth was driven by our transport applications. Transport experienced $160 million of revenue growth. All three of our major geographic regions contributed to the organic revenue growth in transport.  Western Europe also experienced increases driven by strong price realization and delivery on capital projects. Organic revenue growth for the treatment application was $15 million for the year due to increased sales volume in the U.S. driven by strong backlog execution. \nApplied Water\nApplied Water revenue increased $86 million, or 4.9%, in 2023 (5.4% increase on a constant currency basis) compared to 2022. Revenue was negatively impacted by $10 million of foreign currency translation, with the change at constant currency coming entirely from organic growth during the year of $96 million. Organic growth was led by strength in building solutions, with commercial revenue growth of $97 million, driven by the U.S. with increased sales volume from backlog execution in the first half of the year and strong price realization, partially offset by the residential declines in revenue of $33 million primarily in the emerging markets, driven by softness in the Middle East, and volume declines in the U.S. The industrial water application had organic growth of $32 million, led by the emerging markets due to increased sales volume, and western Europe where we benefited from strong price realization.\nMeasurement and Control Solutions \nMeasurement and Control Solutions revenue increased $337 million, or 26.4%, in 2023, consisting entirely of organic growth. Organic revenue growth during the year was led by growth in the smart metering and other applications of $312 million led by the U.S., where we saw increased sales volume enabled by recovery on prior year component constraints, and western Europe due to strong backlog execution. We also had organic revenue growth in the analytics application of $25 million, driven by strong backlog execution in the U.S.\nWater Solutions and Services\nWater Solutions and Services revenue increased $890 million, or 112.1%, in 2023 compared to 2022. The increase in revenue consisted primarily of $815 million contributed from the Evoqua acquisition and $82 million of organic growth. Revenue was negatively impacted by $7 million of foreign currency translation. Organic revenue growth was led by the U.S. due to higher volume in the dewatering business.\n51\nOrders/Backlog \nAn order represents a legally enforceable, written document that includes the scope of work or services to be performed or equipment to be supplied to a customer, the corresponding price and the expected delivery date for the applicable products or services to be provided. An order often takes the form of a customer purchase order or a signed quote from a Xylem business. \nThe following table illustrates the impact from organic growth, recent acquisitions and divestitures, and foreign currency translation in relation to orders during 2023:\nWater Infrastructure\nApplied Water\nMeasurement and Control Solutions\nWater Solutions and Services\nTotal Xylem\n(in millions)\n$ \nChange\n% \nChange\n$ \nChange\n% \nChange\n$ \nChange\n% \nChange\n$ \nChange\n% \nChange\n$ \nChange\n% \nChange\n2022 Orders\n$\n1,916 \n$\n1,794 \n$\n1,736 \n$\n811 \n$\n6,257 \nOrganic Impact\n62 \n3.2 \n%\n(6)\n(0.3)\n%\n(67)\n(3.9)\n%\n76 \n9.4 \n%\n65 \n1.0 \n%\nAcquisitions/(Divestitures)\n352 \n18.4 \n%\n— \n— \n%\n— \n— \n%\n868 \n107.0 \n%\n1,220 \n19.5 \n%\nConstant Currency\n414 \n21.6 \n%\n(6)\n(0.3)\n%\n(67)\n(3.9)\n%\n944 \n116.4 \n%\n1,285 \n20.5 \n%\nForeign currency translation (a)\n(17)\n(0.9)\n%\n(18)\n(1.0)\n%\n1 \n0.1 \n%\n(7)\n(0.9)\n%\n(41)\n(0.7)\n%\nTotal change in orders\n397 \n20.7 \n%\n(24)\n(1.3)\n%\n(66)\n(3.8)\n%\n937 \n115.5 \n%\n1,244 \n19.9 \n%\n2023 Orders\n$\n2,313\n \n$\n1,770\n \n$\n1,670\n \n$\n1,748\n \n$\n7,501\n \n(a)\nForeign currency translation impact for the year primarily due to the weakening in value of various currencies against the U.S. Dollar, the largest being the Chinese Yuan, the Canadian Dollar and the Norwegian Krone.\nBacklog \nBacklog includes orders on hand as well as contractual customer agreements at the end of the period. Delivery schedules vary from customer to customer based on their requirements. Annual or multi-year contracts are subject to rescheduling and cancellation by customers due to the long-term nature of the contracts. As such, beginning total backlog, plus orders, minus revenues, will not equal ending total backlog due to contract adjustments, foreign currency fluctuations, and other factors. Typically, large projects require longer lead production cycles and deployment schedules and delays occur from time to time. Total backlog was $5,088 million at December 31, 2023 and $3,605 million at December 31, 2022, an increase of 41.1%, with backlog from the acquisition of Evoqua contributing $1,268 million, or 35.2%, of the increase.\nGross Margin \nGross margin as a percentage of consolidated revenue decreased 80 basis points to 36.9% in 2023 as compared to 37.7% in 2022. The gross margin decline for the year included 60 basis points from increases in acquired intangible asset amortization and special charges as compared to 2022. Additionally, the gross margin decline for the year included 530 basis points of negative operating impacts, driven by 230 basis points of inflation, 140 basis points of unfavorable impacts from the Evoqua acquisition, 80 basis points of unfavorable mix, and 30 basis points of increased spending on strategic investments. These impacts were partially offset by favorable impacts of 510 basis points, driven by 270 basis points of price realization and 210 basis points of productivity savings.\n52\nOperating Expenses\n(in millions)\n2023\n2022\nChange\nSelling, general and administrative expenses\n$\n1,757\n \n$\n1,227 \n43.2 \n%\nSG&A as a % of revenue\n23.9\n \n%\n22.2 \n%\n170 \nbp\nResearch and development expenses\n232\n \n206 \n12.6 \n%\nR&D as a % of revenue\n3.2\n \n%\n3.7 \n%\n(50)\nbp\nRestructuring and asset impairment charges\n76\n \n29 \n162.1 \n%\nOperating expenses\n$\n2,065\n \n$\n1,462 \n41.2 \n%\nExpense to revenue ratio\n28.0\n \n%\n26.5 \n%\n150 \nbp\nSelling, General and Administrative (\"SG&A\") Expenses \nSG&A expenses increased by $530 million (increase of 43.2%) to 23.9% of revenue in 2023, as compared to 22.2% of revenue in 2022. Cost increases were driven by $188 million of additional operational SG&A from the acquisition of Evoqua, increased special charges (mostly Evoqua acquisition related costs) and realignment costs of $115 million, increased acquired intangible asset amortization of $58 million, $54 million of inflation, and $51 million in increased spending on strategic investments.\nResearch and Development (\"R&D\") Expenses \nR&D expense was $232 million, or 3.2% of revenue, in 2023 which was fairly consistent with the 2022 expense of $206 million, or 3.7% of revenue. \nRestructuring and Asset Impairment Charges\nRestructuring\nFrom time to time, the Company will incur costs related to restructuring actions in order to optimize our cost base and more strategically position itself. Restructuring charges were $72 million in 2023 as compared to $15 million in 2022. \nDuring 2023, we incurred these charges primarily as a result of our acquisition of Evoqua. Approximately $27 million of the charges related to share-based compensation expense due to acceleration clauses in Evoqua's equity compensation agreements. Approximately $15 million of the charges represented the reduction of headcount related to the integration of Evoqua. Additionally, during 2023 we incurred $30 million of charges related to our efforts to reposition our businesses to optimize our cost structure, improve our operational efficiency and effectiveness, strengthen our competitive positioning and better serve our customers. The charges were incurred across all of our segments. \nDuring 2022, we incurred restructuring charges primarily as a continuation of our efforts to reposition our European and North American businesses to optimize our cost structure and improve our operational efficiency and effectiveness. The charges included the reduction of headcount across all of our segments.\nThe following is a roll-forward of employee position eliminations associated with restructuring activities for the years ended December 31, 2023 and 2022:\n2023\n2022\nPlanned reductions - January 1\n102\n \n60 \nAdditional planned reductions\n454\n \n203 \nActual reductions and reversals\n(443)\n(161)\nPlanned reductions - December 31\n113\n \n102 \nAsset Impairment \nRefer to Note 12, \"Goodwill and Other Intangible Assets,\" for more information on intangible asset impairment charges incurred during the years ended December 31, 2023 and 2022.\nOperating Income, Net Income, and Adjusted EBITDA \nOperating income was $652 million (operating margin of 8.9%) during 2023, an increase of $30 million, or 4.8%, when compared to operating income of $622 million (operating margin of 11.3%) during 2022. Operating margin included unfavorable impacts of 350 basis points from increases in special charges, acquired intangible asset \n53\namortization, and restructuring and realignment costs as compared to 2022. Additionally, operating margin included 780 basis points of expansion from favorable operating impacts, consisting of a 370 basis point increase from price realization, 280 basis points from productivity savings and 130 basis points from favorable volume. Margin expansion was offset by 670 basis points of unfavorable impacts driven by 310 basis points of inflation, 110 basis points of increased spending on strategic investments, 80 basis points of unfavorable mix, and 50 basis points of increased employee related costs. Excluding special charges, acquired intangible asset amortization, and restructuring and realignment costs, adjusted operating income was $1,072 million (adjusted operating margin of 14.6%) for 2023 as compared to adjusted operating income of $744 million (adjusted operating margin of 13.5%) during 2022.\nNet income was $609 million (net income margin of 8.3%) during 2023, an increase of $254 million as compared to net income in 2022 of $355 million (net income margin of 6.4%). The increase in net income was almost entirely due to increased operating income of $30 million, $140 million of charges related to the U.K. pension plan buy-out in the prior year that did not recur, decreased income tax expense of $59 million, and an increase in other non-operating income of $24 million. Adjusted EBITDA was $1,392 million (adjusted EBITDA margin of 18.9%) during 2023, an increase of $452 million, or 48.1%, when compared to adjusted EBITDA of $940 million (adjusted EBITDA margin of 17.0%) during 2022. The increase in adjusted EBITDA margin was primarily due to the same factors impacting adjusted operating margin noted above; however, adjusted EBITDA was not negatively impacted by the relative impact of depreciation and software amortization expense.\n54\nThe table below provides a reconciliation of total and each segment's operating income to adjusted operating income, and a calculation of the corresponding adjusted operating margin: \n(In millions)\n2023\n2022\nChange\nWater Infrastructure\nOperating income\n$\n275\n \n$\n279 \n(1.4)\n%\nOperating margin\n12.4\n \n%\n16.5 \n%\n(410)\nbp\nRestructuring and realignment costs\n18\n \n9 \n100.0 \n%\nPurchase accounting intangible amortization\n47\n \n4 \n1,075.0 \n%\nSpecial charges\n28\n \n— \nNM\n%\nAdjusted operating income\n$\n368\n \n$\n292 \n26.0 \n%\nAdjusted operating margin\n16.6\n \n%\n17.3 \n%\n(70)\nbp\nApplied Water\nOperating income\n$\n310\n \n$\n258 \n20.2 \n%\nOperating margin\n16.7\n \n%\n14.6 \n%\n210 \nbp\nRestructuring and realignment costs\n14\n \n13 \n7.7 \n%\nPurchase accounting intangible amortization\n—\n \n— \nNM\n%\nSpecial charges\n—\n \n— \nNM\n%\nAdjusted operating income\n$\n324\n \n$\n271 \n19.6 \n%\nAdjusted operating margin\n17.5\n \n%\n15.3 \n%\n220 \nbp\nMeasurement and Control Solutions\nOperating income\n$\n133\n \n$\n19 \n600.0 \n%\nOperating margin\n8.3\n \n%\n1.5 \n%\n680 \nbp\nRestructuring and realignment costs\n19\n \n10 \n90.0 \n%\nPurchase accounting intangible amortization\n57\n \n57 \n— \n%\nSpecial charges\n4\n \n13 \n(69.2)\n%\nAdjusted operating income\n$\n213\n \n$\n99 \n115.2 \n%\nAdjusted operating margin\n13.2\n \n%\n7.8 \n%\n540 \nbp\nWater Solutions and Services\nOperating income\n$\n132\n \n$\n122 \n8.2 \n%\nOperating margin\n7.8\n \n%\n15.4 \n%\n(760)\nbp\nRestructuring and realignment costs\n20\n \n2 \n900.0 \n%\nPurchase accounting intangible amortization\n72\n \n11 \n554.5 \n%\nSpecial charges\n22\n \n1 \n2,100.0 \n%\nAdjusted operating income\n$\n246\n \n$\n136 \n80.9 \n%\nAdjusted operating margin\n14.6\n \n%\n17.1 \n%\n(250)\nbp\nCorporate and other\nOperating loss\n$\n(198)\n$\n(56)\n253.6 \n%\nRestructuring and realignment costs\n35\n \n— \nNM\n%\nSpecial charges\n84\n \n2 \n4,100.0 \nAdjusted operating loss\n$\n(79)\n$\n(54)\n46.3 \n%\nTotal Xylem\nOperating income\n$\n652\n \n$\n622 \n4.8 \n%\nOperating margin\n8.9\n \n%\n11.3 \n%\n(240)\nbp\nRestructuring and realignment costs\n106\n \n34 \n211.8 \n%\nPurchase accounting intangible amortization\n176\n \n72 \n144.4 \n%\nSpecial charges\n138\n \n16 \n762.5 \n%\nAdjusted operating income\n$\n1,072\n \n$\n744 \n44.1 \n%\nAdjusted operating margin\n14.6\n \n%\n13.5 \n%\n110 \nbp\nNM    Not Meaningful \n55\nThe table below provides a reconciliation of net income to consolidated EBITDA and adjusted EBITDA: \n \n(in millions)\nYear Ended December 31,\n2023\n2022\nChange\nNet Income\n$\n609\n \n$\n355 \n72 \n%\nNet Income margin\n8.3\n \n%\n6.4 \n%\n190 \nbp\nDepreciation\n193\n \n111 \n74 \n%\nAmortization\n243\n \n125 \n94 \n%\nInterest expense, net\n21\n \n34 \n(38)\n%\nIncome tax expense\n26\n \n85 \n(69)\n%\nEBITDA\n$\n1,092\n \n$\n710 \n54 \n%\nShare-based compensation\n60\n \n37 \n62 \n%\nRestructuring and realignment\n103\n \n34 \n203 \n%\nU.K. pension settlement expense\n—\n \n140 \n(100)\n%\nSpecial charges\n136\n \n20 \n580 \n%\nGain (loss) from sale of business\n1\n \n(1)\n(200)\n%\nAdjusted EBITDA\n$\n1,392\n \n$\n940 \n48 \n%\nAdjusted EBITDA margin\n18.9\n \n%\n17.0 \n%\n190 \nbp\nThe tables below provide a reconciliation of each segment's operating income (loss) to EBITDA and adjusted EBITDA: \nYear Ended December 31, 2023\n(in millions)\nWater Infrastructure\n \nApplied Water Systems\n \nMeasurement and Control Solutions\nWater Solutions and Services\nOperating Income\n$\n275\n \n$\n310\n \n$\n133\n \n$\n132\n \nOperating margin\n12.4\n \n%\n16.7\n \n%\n8.3\n \n%\n7.8\n \n%\n(Loss) from sale of business\n—\n \n—\n \n(1)\n—\n \nDepreciation\n34\n \n25\n \n27\n \n105\n \nAmortization\n55\n \n3\n \n97\n \n79\n \nOther non-operating expense, excluding interest\n3\n \n(2)\n(4)\n1\n \nEBITDA\n$\n367\n \n$\n336\n \n$\n252\n \n$\n317\n \nShare-based compensation\n13\n \n3\n \n7\n \n10\n \nRestructuring and realignment\n18\n \n13\n \n17\n \n20\n \nSpecial charges\n28\n \n—\n \n4\n \n22\n \nLoss from sale of business\n—\n \n—\n \n1\n \n—\n \nAdjusted EBITDA\n$\n426\n \n$\n352\n \n$\n281\n \n$\n369\n \nAdjusted EBITDA margin\n19.2\n \n%\n19.0\n \n%\n17.4\n \n%\n21.9\n \n%\n56\nYear Ended December 31, 2022\n(in millions)\nWater Infrastructure\n \nApplied Water Systems\n \nMeasurement and Control Solutions\nWater Solutions and Services\nOperating Income\n$\n279\n \n$\n258\n \n$\n19\n \n$\n122\n \nOperating margin\n16.5\n \n%\n14.6\n \n%\n1.5\n \n%\n15.4\n \n%\nDepreciation\n24 \n22 \n27 \n36 \nAmortization\n10 \n3 \n92 \n14 \nOther non-operating expense, excluding interest\n(3)\n(2)\n(2)\n— \nEBITDA\n$\n310\n \n$\n281\n \n$\n136\n \n$\n172\n \nShare-based compensation\n7 \n4 \n6 \n3 \nRestructuring and realignment\n9 \n13 \n10 \n2 \nSpecial charges\n— \n— \n13 \n1 \nLoss/(Gain) from sale of business\n— \n— \n(1)\n— \nAdjusted EBITDA\n$\n326\n \n$\n298\n \n$\n164\n \n$\n178\n \nAdjusted EBITDA margin\n19.3\n \n%\n16.9\n \n%\n12.9\n \n%\n22.4\n \n%\n2023 versus 2022\n(in millions)\nWater Infrastructure\n \nApplied Water Systems\n \nMeasurement and Control Solutions\nWater Solutions and Services\nOperating Income (Loss)\n$\n(4)\n$\n52\n \n$\n114\n \n$\n10\n \nOperating margin\n(410)\n bps\n210\n \nbps\n680\n \nbps\n(760)\n bps\n(Loss)/Gain from sale of business\n— \n— \n(1)\n— \nDepreciation\n10 \n3 \n— \n69 \nAmortization\n45 \n— \n5 \n65 \nOther non-operating expense, excluding interest\n6 \n— \n(2)\n1 \nEBITDA\n$\n57\n \n$\n55\n \n$\n116\n \n$\n145\n \nShare-based compensation\n6 \n(1)\n1 \n7 \nRestructuring and realignment\n9 \n— \n7 \n18 \nSpecial charges\n28 \n— \n(9)\n21 \nLoss/(Gain) from sale of business\n— \n— \n2 \n— \nAdjusted EBITDA\n$\n100\n \n$\n54\n \n$\n117\n \n$\n191\n \nAdjusted EBITDA margin\n(10)\n bps\n210\n \nbps\n450\n \nbps\n(50)\n bps\n57\nWater Infrastructure\nOperating income was $275 million for our Water Infrastructure segment (operating margin of 12.4%) during 2023, a decrease of $4 million, or 1.4%, when compared to operating income of $279 million (operating margin of 16.5%) during 2022, or a total decrease of 410 basis points of operating margin. Operating margin declines included unfavorable impacts of 340 basis points from an increase in acquired intangible asset amortization, special charges and restructuring and realignment costs as compared to 2022. Additionally, operating margin declines included 910 basis points from unfavorable operating impacts, driven by 340 basis points of inflation, 210 basis points of unfavorable mix, 160 basis points of increased spending on strategic investments, 30 basis points of increased inventory management costs and 20 basis points of negative operating impact from the impact of the Evoqua acquisition. Operating margin declines were offset by 840 basis points of favorable impacts, consisting of 440 basis points of price realization, 280 basis points from productivity savings and 120 basis points of favorable volume. Excluding acquired intangible asset amortization, special charges and restructuring and realignment costs, adjusted operating income was $368 million (adjusted operating margin of 16.6%) during 2023 as compared to adjusted operating income of $292 million (adjusted operating margin of 17.3%) during 2022.\nAdjusted EBITDA was $426 million (adjusted EBITDA margin of 19.2%) during 2023, an increase of $100 million, or 31%, when compared to adjusted EBITDA of $326 million (adjusted EBITDA margin of 19.3%) during 2022. The slight increase in adjusted EBITDA margin was primarily due to the same factors impacting the decrease in adjusted operating margin; however, adjusted EBITDA was not negatively impacted by the relative impact of the increase in depreciation and amortization and share-based compensation expense.\nApplied Water\nOperating income was $310 million for our Applied Water segment (operating margin of 16.7%) during 2023, an increase of $52 million, or 20.2%, when compared to operating income of $258 million (operating margin of 14.6%) during 2022, or a total increase of 210 basis points of operating margin. Operating margin expansion was partially offset by unfavorable impacts of 10 basis points from increases in restructuring and realignment costs as compared to 2022. Operating margin increases included 820 basis points of favorable operating impacts, consisting of 470 basis points of price realization and 350 basis points from productivity savings. Margin expansion was partially offset by negative operating impacts of 600 basis points, consisting of 320 basis points of inflation, 100 basis points of unfavorable volume, 80 basis points of increased spending on strategic investments and 50 basis points of increased employee related costs. Excluding restructuring and realignment costs, adjusted operating income was $324 million (adjusted operating margin of 17.5%) during 2023 as compared to adjusted operating income of $271 million (adjusted operating margin of 15.3%) during 2022.\nAdjusted EBITDA was $352 million (adjusted EBITDA margin of 19.0%) during 2023, an increase of $54 million, or 18.1%, when compared to adjusted EBITDA of $298 million (adjusted EBITDA margin of 16.9%) during 2022. The increase in adjusted EBITDA margin was due to the same factors impacting the increase in adjusted operating margin. \nMeasurement and Control Solutions \nOperating income was $133 million for our Measurement and Control Solutions segment (operating margin of 8.3%) during 2023, an increase of $114 million, or 600.0%, when compared to operating income of $19 million (operating margin of 1.5%) during 2022, or a total increase of 680 basis points of operating margin. Operating margin increases included favorable impacts of 140 basis points driven by no net increase in special charges, acquired intangible asset amortization, and restructuring and realignment costs on increased revenue as compared to 2022. Additionally, the operating margin increase included 1,360 basis points from favorable operating impacts consisting of 650 basis points from favorable volume, 360 basis points from productivity savings and 350 basis points of price realization. Favorable impacts were partially offset by 820 basis points of unfavorable impacts driven by 400 basis points of inflation, 160 basis points of increased inventory management costs, 70 basis points of increased spending on strategic investments, 50 basis points of unfavorable mix, and 30 basis points of increased employee related costs. Excluding special charges, acquired intangible asset amortization, and restructuring and realignment costs, adjusted operating income was $213 million (adjusted operating margin of 13.2%) during 2023 as compared to adjusted operating income of $99 million (adjusted operating margin of 7.8%) during 2022.\nAdjusted EBITDA was $281 million (adjusted EBITDA margin of 17.4%) during 2023, an increase of $117 million, or 71.3%, when compared to adjusted EBITDA of $164 million (adjusted EBITDA margin of 12.9%) during 2022. The increase in adjusted EBITDA margin was due to the same factors as those impacting the increase in adjusted operating margin; however, adjusted EBITDA was not favorably impacted by the relative impact of only slight increases in depreciation and amortization expense relative to increased revenue.\n58\nWater Solutions and Services\nOperating income was $132 million for our Water Solutions and Services segment during 2023 (operating margin of 7.8%), an increase of $10 million, or 8%, when compared to operating income of $122 million (operating margin of 15.4%) during 2022, or a total decrease of 760 basis points of operating margin. Operating margin declines included unfavorable impacts of 510 basis points from an increase in acquired intangible asset amortization, special charges and restructuring and realignment costs as compared to 2022. Additionally, operating margin declines included 580 basis points from unfavorable operating impacts, driven by 210 basis points of negative operating impact from the Evoqua acquisition, 160 basis points of inflation, 60 basis points of increased spending on strategic investments, and 30 basis points of unfavorable mix. Operating margin declines were offset by 330 basis points of favorable impacts, including 180 basis points of price realization, 60 basis points from productivity savings, and 40 basis points of favorable volume. Excluding amortization of acquired intangible asset amortization, special charges and restructuring and realignment costs, adjusted operating income was $246 million (adjusted operating margin of 14.6%) during 2023 as compared to adjusted operating income of $136 million (adjusted operating margin of 17.1%) during 2022. \nAdjusted EBITDA was $369 million for our Water Solutions and Services segment during 2023 (adjusted EBITDA margin of 21.9%), an increase of $191 million, or 107.3%, when compared to adjusted EBITDA of $178 million (adjusted EBITDA margin of 22.4%) during 2022. The increase in adjusted EBITDA margin was due to the same factors as those impacting the increase in adjusted operating margin; however, adjusted EBITDA was not favorably impacted by the relative impact of depreciation and software amortization and share-based compensation expense.\nCorporate and other \nOperating loss for corporate and other increased $142 million during 2023, or 253.6%, compared to 2022. The increase in operating loss for the year was primarily due to higher special charges and restructuring and realignment costs as compared to 2022.  Excluding special charges and restructuring and realignment costs, adjusted operating loss increased $25 million during 2023, or 46.3%, compared to 2022.  The increase in adjusted operating loss is primarily related to increased operating expense due to the acquisition of Evoqua, increased employee costs and spending on strategic investments. \nInterest Expense\nInterest expense was $49 million and $50 million for 2023 and 2022, respectively. The decrease in interest expense was primarily driven by a reduction of interest expense incurred during 2023 related to our 2.250% Senior Notes due 2023 that were paid off in December 2022, and reduced expense generated by cross currency swaps. Partially offsetting these items was interest expense on several debt facilities, including a term loan entered into in May 2023 for use in funding the acquisition of Evoqua, securitization and equipment financing facilities assumed as part of our acquisition of Evoqua. See Note 15, \"Credit Facilities and Debt\", of our consolidated financial statements for a description of our credit facilities and long-term debt and related interest. \nIncome Tax Expense \nThe income tax provision for 2023 was $26 million at an effective tax rate of 4.1% as compared to $85 million at an effective tax rate of 19.2% in 2022. The 2023 effective tax rate differs from that of 2022 primarily due to the impact of audit settlements and tax rate changes in 2023. See Note 7, \"Income Taxes\", of our consolidated financial statements for a description of our credit facilities and long-term debt and related interest. \nLiquidity and Capital Resources\nThe following table summarizes our sources and uses of cash:\nYear Ended December 31,\n(in millions)\n2024\n2023\nChange\nOperating activities\n$\n1,263\n \n$\n837 \n$\n426 \nInvesting activities\n(482)\n(628)\n146 \nFinancing activities\n(615)\n(157)\n(458)\nForeign exchange (a)\n(53)\n23 \n(76)\nTotal\n$\n113\n \n$\n75 \n$\n38 \n(a)\nThe impact of foreign exchange is primarily due to weakening of the Euro, Canadian Dollar and the Chilean Peso.\n59\nSources and Uses of Liquidity\nOperating Activities\nDuring 2024, net cash provided by operating activities was $1,263 million, compared to $837 million in 2023. The $426 million year-over-year increase was primarily driven by higher cash earnings and non-recurring payments made in 2023 associated with transaction costs related to the acquisition of Evoqua and the investment in a distribution agreement of select technology. Higher use of net working capital partially offset the improved cash performance, driven by increases in inventory and receivables from strong demand in the fourth quarter, partially offset by timing of payables.\nInvesting Activities\nCash used in investing activities was $482 million in 2024, compared to $628 million in 2023. This decrease in cash used of $146 million reflects higher spending in 2023 on acquisitions, primarily the acquisition of Evoqua, and reduced cash used to fund equity investments in 2024. Reduced proceeds from the sale of businesses, higher capital expenditures and cash received from interest rates swaps in 2023 that did not recur in 2024 partially offset the decrease in cash used.\nFinancing Activities\nCash used in financing activities was $615 million in 2024, compared to $157 million in 2023. The year-over-year increase in cash used was mainly driven by cash received from a term loan in connection with the Evoqua acquisition in 2023 that was repaid in 2024 and higher dividend payments. These increased outflows were partially offset by the repayment of a receivable securitization program in 2023 that did not recur in the current year.\nFunding and Liquidity Strategy \nOur ability to fund our capital needs depends on our ongoing ability to generate cash from operations and access to bank financing and the capital markets. We continually evaluate aspects of our spending, including capital expenditures, strategic investments and dividends. Historically, we have generated operating cash flow sufficient to fund our primary cash needs\n.\nIf our cash flows from operations are less than we expect, we may need to incur debt or issue equity. From time to time, we may need to access the long-term and short-term capital markets to obtain financing. Our access to, and the availability of, financing on acceptable terms and conditions in the future will be impacted by many factors, including: (i) our credit ratings or absence of a credit rating, (ii) the liquidity of the overall capital markets and (iii) the current state of the economy. There can be no assurance that such financing will be available to us on acceptable terms or that such financing will be available at all. Our securities are rated investment grade. A significant change in credit rating could impact our ability to borrow at favorable rates. Refer to Note 15, \"Credit Facilities and Debt\", of our consolidated financial statements for a description of limitations on obtaining additional funding. \nWe monitor our global funding requirements and seek to meet our liquidity needs on a cost-effective basis. In addition, our existing committed credit facilities and access to the public debt markets would provide further liquidity if required. \nBased on our current global cash positions, cash flows from operations and access to the capital markets, we believe there is sufficient liquidity to meet our funding requirements and service debt and other obligations in both the U.S. and outside of the U.S. over the next twelve months. Currently, we have available liquidity of approximately $2.1 billion, consisting of $1.1 billion of cash and $1 billion of available credit facilities as disclosed in Note 15, \"Credit Facilities and Debt\", of our consolidated financial statements. \nContractual Obligations \nMaterial contractual obligations arising in the normal course of business primarily consist of debt obligations and related interest payments, lease obligations and unconditional purchase obligations. Refer Note 15, “Credit Facilities and Debt” and Note 11, “Leases” of the consolidated financial statements for related to these matters.\nThe Company has future unconditional purchase commitments which are legally binding and that specify all significant terms including price and/or quantity. Total future commitments within the next twelve months for these obligations is $664 million, excluding contracts that can be canceled without penalty.\nCredit Facilities and Long-Term Contractual Commitments \nSee Note 15, \"Credit Facilities and Debt\" of our consolidated financial statements for a description of our credit facilities and long-term debt. \n60\nNon-U.S. Operations\nAs we continue to grow our operations in the emerging markets and elsewhere outside of the U.S., we expect to continue to generate significant revenue from non-U.S. operations and expect that a substantial portion of our cash will be held by our foreign subsidiaries. We expect to manage our worldwide cash requirements considering available funds among the many subsidiaries through which we conduct business and the cost effectiveness with which those funds can be accessed. We may transfer cash from certain international subsidiaries to the U.S. and other international subsidiaries when we believe it is cost effective to do so. We continually review our domestic and foreign cash profile, expected future cash generation and investment opportunities and reassess whether there is a need to repatriate funds held internationally to support our U.S. operations. \nOff-Balance Sheet Arrangements\nWe are a party to certain off-balance sheet arrangements including certain guarantees. For discussion of these arrangements, see Note 20, “Commitments and Contingencies” of the consolidated financial statements.\nCritical Accounting Estimates\nThe preparation of financial statements in conformity with GAAP requires management to make estimates and assumptions that affect the reported amounts of assets, liabilities, revenue and expenses and the disclosure of contingent liabilities. Management bases its estimates on historical experience and on various other assumptions that it believes to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities that are not readily apparent from other sources.\nSignificant accounting policies used in the preparation of the consolidated financial statements are discussed in Note 1, “Summary of Significant Accounting Policies,” of the consolidated financial statements. Accounting estimates and assumptions discussed in this section are those that we consider most critical to an understanding of our financial statements because they are inherently uncertain, involve significant judgments and include areas where different estimates reasonably could have been used, and because changes in such estimates that are reasonably possible could materially impact the financial statements. Management believes that the accounting estimates employed and the resulting balances are reasonable; however, actual results in these areas could differ from management’s estimates under different assumptions or conditions.\nRevenue Recognition.\n Xylem recognizes revenue in a manner that depicts the transfer of promised goods and services to customers in an amount that reflects the consideration to which it expects to be entitled for providing those goods and services. For each arrangement with a customer, we identify the contract and the associated performance obligations within the contract, determine the transaction price of that contract, allocate the transaction price to each performance obligation and recognize revenue as each performance obligation is satisfied.\nThe satisfaction of performance obligations in a contract is based upon when the customer obtains control over the asset. Depending on the nature of the performance obligation, control transfers either at a particular point in time, or over time, which determines the pattern of revenue recognition.\nFor product sales, other than long-term construction-type contracts, we recognize revenue once control has passed at a point in time, which is generally when products are shipped. In instances where contractual terms include a provision for customer acceptance, revenue is recognized when either (i) we have previously demonstrated that the product meets the specified criteria based on either seller or customer-specified objective criteria, or (ii) upon formal acceptance received from the customer where the product has not been previously demonstrated to meet customer-specified objective criteria. We recognize revenue on product sales to channel partners, including resellers, distributors or value-added solution providers, at the point in time when the risks and rewards, possession, and title have transferred to the customer, which usually occurs at the point of delivery.\nRevenue from performance obligations related to services is primarily recognized over time, as the performance obligations are satisfied. In these instances, the customer consumes the benefit of the service as Xylem performs.\nCertain businesses also enter into long-term construction-type sales contracts where revenue is recognized over time. In these instances, revenue is recognized using a measure of progress that applies the input method based on costs incurred in relation to total estimated costs. We also recognize revenue for certain of these arrangements using the output method and measure progress based on shipments of product where control has transferred to the customer.\nFor all contracts with customers, we determine the transaction price in the arrangement and allocate the transaction price to each performance obligation identified in the contract. Judgment is required to determine the appropriate unit of account, and we separate out the performance obligations if they are capable of being distinct and are distinct within the context of the contract. The transaction price is adjusted for our estimate of variable consideration, \n61\nwhich may include a right of return, discounts, rebates, penalties and retainage. To estimate variable consideration, we apply the expected value method or the most likely amount method, based on whichever method most appropriately predicts the amount of consideration we expect to be entitled to. The method applied is typically based on historical experience and known trends. We constrain the amounts of variable consideration that are included in the transaction price, to the extent that it is probable that a significant reversal in the amount of cumulative revenue recognized will not occur or when uncertainties around the variable consideration are resolved.\nIncome Taxes.\n Deferred tax assets and liabilities are determined based on temporary differences between the financial reporting and tax bases of assets and liabilities, applying enacted tax rates in effect for the year in which we expect the differences will reverse. Based on the evaluation of available evidence, we recognize future tax benefits, such as net operating loss carryforwards, to the extent that we believe it is more likely than not we will realize these benefits. We periodically assess the likelihood that we will be able to recover our deferred tax assets and reflect any changes to our estimate of the amount we are more likely than not to realize in the valuation allowance, with a corresponding adjustment to earnings or other comprehensive income, as appropriate.\nIn assessing the need for a valuation allowance, we look to the future reversal of existing taxable temporary differences, taxable income in carryback years and the feasibility of tax planning strategies and estimated future taxable income. The valuation allowance can be affected by changes to tax laws, changes to statutory tax rates and changes to future taxable income estimates.\nWe have recorded net foreign withholding taxes and state income taxes on earnings that are expected to be repatriated to the U.S. parent. We have not recorded any deferred taxes on the amounts that the Company currently does not intend to repatriate. The determination of deferred taxes on this amount is not practicable.  \nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws in a multitude of jurisdictions across our global operations. We recognize potential liabilities and record tax liabilities for anticipated tax audit issues in the U.S. and other tax jurisdictions based on our estimate of whether, and the extent to which, additional taxes will be due. Furthermore, we recognize the tax benefit from an uncertain tax position only if based on the technical merits of the position it is more likely than not that the tax position will be sustained on examination by the taxing authorities or upon completion of the litigation process. The tax benefits recognized in the financial statements from such a position are measured based on the largest benefit that has a greater than 50% likelihood of being realized upon ultimate resolution.\nWe adjust our liability for uncertain tax positions in light of changing facts and circumstances; however, due to the complexity of some of these uncertainties, the ultimate resolution may result in a payment that is materially different from our current estimate of the tax liabilities. If our estimate of tax liabilities proves to be less than the ultimate assessment, an additional tax expense would result. If a payment of these amounts ultimately proves to be less than the recorded amounts, the reversal of the liabilities would result in tax benefits being recognized in the period when we determine the liabilities are no longer necessary.\nBusiness Combinations. \nWe record acquisitions using the purchase method of accounting. All of the assets acquired, liabilities assumed, contractual contingencies and contingent consideration is recorded at fair value as of the acquisition date. The excess of the purchase price over the estimated fair values of the net tangible and intangible assets acquired is recorded as goodwill. The application of the purchase method of accounting for business combinations requires management to make significant estimates and assumptions in the determination of the fair value of assets acquired and liabilities assumed, in order to properly allocate purchase price consideration between assets that are depreciated and amortized from goodwill. These assumptions and estimates include a market participant’s use of the asset and the appropriate discount rates for a market participant. Our estimates are based on historical experience, information obtained from the management of the acquired companies and, when appropriate, includes assistance from independent third-party appraisal firms. Significant assumptions and estimates include, but are not limited to, the cash flows that an asset is expected to generate in the future, the cost to build/recreate certain technology, the appropriate weighted-average cost of capital, and the cost savings expected to be derived from acquiring an asset. These estimates are inherently uncertain and unpredictable. In addition, unanticipated events and circumstances may occur which may affect the accuracy or validity of such estimates.\nGoodwill and Intangible Assets. \nWe review goodwill and indefinite-lived intangible assets for impairment annually and whenever events or changes in circumstances indicate the carrying value of an asset may not be recoverable. We also review the carrying value of our finite-lived intangible assets for potential impairment when impairment indicators arise. We conduct our annual impairment test as of the first day of the fourth quarter. For goodwill, the estimated fair value of each reporting unit is compared to the carrying value of the net assets assigned to that reporting unit. If the estimated fair value of the reporting unit exceeds its carrying value, goodwill is not impaired. If \n62\nthe carrying value of the reporting unit exceeds its estimated fair value, then an impairment charge is recognized for that excess up to the amount of recorded goodwill. We estimate the fair value of our reporting units using both the income approach and market approach. Weighting is equally attributed to both the market and income approaches in arriving at the fair value of the reporting units. To determine the reasonableness of the calculated fair values, we review the assumptions to ensure that neither the income approach nor the market approach yielded significantly different valuations. Our projected cash flows are discounted using weighted costs of capital and are derived using revenue growth rates and operating margin estimates, taking into consideration industry and market conditions. In instances where we have completed an acquisition shortly before our annual impairment assessment we perform a qualitative assessment to determine if a quantitative assessment is necessary. We estimate the fair value of our intangible assets with indefinite lives using either the income approach or the market approach. Under the income approach, we calculate fair value based on the present value of estimated future cash flows. Under the market approach, we calculate fair value based on recent sales and selling prices of similar assets. \nDetermining the fair value of a reporting unit or an indefinite-lived intangible asset is judgmental in nature and involves the use of significant estimates and assumptions, particularly related to future operating results and cash flows. These estimates and assumptions include, but are not limited to, revenue growth rates and operating margins used to calculate projected future cash flows, risk-adjusted discount rates, assumed royalty rates, future economic and market conditions and identification of appropriate market comparable data. In addition, the identification of reporting units and the allocation of assets and liabilities to the reporting units when determining the carrying value of each reporting unit also require judgment. Goodwill is tested for impairment at either the operating segment level identified in Note 21, “Segment and Geographic Data,” of the consolidated financial statements, or one level below. The fair values of our reporting units and indefinite-lived intangible assets are based on estimates and assumptions that are believed to be reasonable. Significant changes to these estimates and assumptions could adversely impact our conclusions. Actual future results may differ from those estimates.\nThe risks around impairment of our assets are included in our risk factor disclosures referenced under “Item 1A. Risk Factors\".\nDuring the fourth quarter of 2024, we performed our annual impairment assessment and determined that the estimated fair values of our goodwill reporting units were substantially in excess of each of their carrying values. However, future goodwill impairment tests could result in a charge to earnings. We will continue to evaluate goodwill on an annual basis as of the beginning of our fourth quarter and whenever events and changes in circumstances require us to do so. We determined that no material impairment of the indefinite-lived intangibles existed as of the measurement date in 2024. However, future indefinite-lived intangible impairment tests could result in a charge to earnings. We will continue to evaluate indefinite-lived intangibles on an annual basis as of the beginning of our fourth quarter and whenever events and changes in circumstances indicate there may be a potential impairment. \nPost-retirement Benefit Plans. \nCompany employees around the world participate in numerous defined benefit plans. The determination of projected benefit obligations and the recognition of expenses related to these plans are dependent on various assumptions. These assumptions primarily relate to discount rates, expected long-term rates of return on plan assets, rate of future compensation increases, mortality, years of service and other factors (some of which are disclosed in Note 16, “Post-retirement Benefit Plans,” of the consolidated financial statements). Actual results that differ from our assumptions are accumulated and amortized on a straight-line basis only to the extent they exceed 10% of the higher of the market-related value or projected benefit obligation, over the average remaining service period of active plan participants, or for plans with all or substantially all inactive participants, over the average remaining life expectancy.\nSignificant Assumptions\nManagement develops each assumption using relevant Company experience, in conjunction with market-related data for each individual country in which such plans exist. All assumptions are reviewed annually with third-party consultants and are adjusted as necessary. The table below provides the weighted average assumptions used to estimate our defined benefit pension obligations and costs as of and for the years ended 2024 and 2023.\n63\n \n2024\n2023\n \nU.S.\nInt’l\nU.S.\nInt’l\nBenefit Obligation Assumptions\nDiscount rate\n5.65\n \n%\n3.62\n \n%\n5.00 \n%\n3.55 \n%\nRate of future compensation increase\nNM\n2.85\n \n%\nNM\n2.87 \n%\nNet Periodic Benefit Cost Assumptions\nDiscount rate\n5.00\n \n%\n3.55\n \n%\n5.25 \n%\n4.13 \n%\nExpected long-term return on plan assets\n6.00\n \n%\n5.78\n \n%\n6.00 \n%\n5.85 \n%\nRate of future compensation increase\nNM\n2.87\n \n%\nNM\n2.79 \n%\nNM    Not meaningful. The pension benefits for future service for all the U.S. pension plans are based on years of service and not impacted by future compensation increases.\nWe determine the expected long-term rate of return on plan assets by evaluating both historical returns and estimates of future returns. Specifically, the Company analyzes the estimated future returns based on independent estimates of asset class returns and evaluates historical broad market returns over long-term timeframes based on the strategic asset allocation, which is detailed in Note 16, “Post-retirement Benefit Plans” of the consolidated financial statements.\nFor the recognition of net periodic pension cost, the calculation of the expected return on plan assets is generally derived by applying the expected long-term rate of return to the market-related value of plan assets. The market-related value of plan assets is based on average asset values at the measurement date over the last five years. The use of fair value, rather than a calculated value, could materially affect net periodic pension cost. The weighted average expected long-term rate of return for all of our plan assets to be used in determining net periodic benefit costs for 2025 is estimated at 5.70%. We estimate that every 25 basis point change in the expected return on plan assets impacts the expense by less than $1 million.\nThe discount rate reflects our expectation of the present value of expected future cash payments for benefits at the measurement date. A decrease in the discount rate increases the present value of benefit obligations and increases pension expense. We base the discount rate assumption on current investment yields of high-quality fixed income investments during the retirement benefits maturity period. The pension discount rate was determined by considering an interest rate yield curve comprising AAA/AA bonds, with maturities between zero and 30 years, developed by the plan’s actuaries. Annual benefit payments are then discounted to present value using this yield curve to develop a single-point discount rate matching the plan’s characteristics. Our weighted average discount rate for all pension plans effective January 1, 2025, is 3.97%. We estimate that every 25 basis point change in the discount rate impacts the expense by less than $1 million.\nThe rate of future compensation increase assumption reflects our long-term actual experience and future and near-term outlook. Effective January 1, 2025, our expected rate of future compensation increase is 2.99% for all pension plans. The estimated impact of a 25 basis point change in the expected rate of future compensation is less than $1 million.\nWe currently anticipate making contributions to our pension and post-retirement benefit plans in the range of $17 million to $23 million during 2025. Approximately $5 million of contributions are expected to be made in the first quarter.\nFunded Status\nFunded status is derived by subtracting the respective year-end values of the projected benefit obligations from the fair value of plan assets. We estimate that every 25 basis point change in the discount rate impacts the funded status by approximately $11 million.\nFair Value of Plan Assets\nThe plan assets of our pension plans comprise a broad range of investments, including domestic and foreign equity securities, interests in hedge funds, fixed income investments, insurance contracts, and cash and cash equivalents.\nA portion of our pension benefit plan assets portfolio comprises investments in hedge funds that are generally measured at net asset value. However, in certain instances, the values reported by the asset managers were not current at the measurement date. Accordingly, we made estimate adjustments to the last reported value where necessary to measure the assets at fair value at the measurement date. These adjustments consider information received from the asset managers, as well as general market information. The adjustment recorded at December 31, 2024 and 2023 for these assets represented less than 1% of total plan assets in each respective \n64\nyear. Asset values for other positions were generally measured using market observable prices. We estimate that a 5.00% change in asset values will impact funded status by approximately $11 million.\nNew Accounting Pronouncements\nSee Note 2, “Recently Issued Accounting Pronouncements,” of the consolidated financial statements for a complete discussion of recent accounting pronouncements.\n2025 Business Outlook\nWe anticipate total revenue growth of up to 2% in 2025, with organic revenue growth anticipated to be in the range of 3% to 4%. Our outlook reflects our current visibility and expectations based on the current market environment and other factors. Our ability to meet our expectations is subject to a number of risks, including, but not limited to, those described in \"Item 1A. Risk Factors.\" \nOn January 28, 2025, at the delegation of the Company’s Board of Directors, management committed to a restructuring plan. The plan consists of workforce reductions across all of our businesses and functions. Inclusive of these actions, we expect to incur between $90 million and $110 million in restructuring and realignment charges in 2025.  Associated with these actions we expect to realize between $75 million and $95 million in incremental savings during 2025.\n65",
  "item2": null
}