{
  "source_file": "sq-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nYou should read the following discussion and analysis in conjunction with the information set forth within the condensed consolidated financial statements and the notes thereto included elsewhere in this Quarterly Report on Form 10-Q, as well as our Annual Report on Form 10-K. The statements in this discussion regarding our expectations of our future performance, liquidity and capital resources, our plans, estimates, beliefs and expectations that involve risks and uncertainties, and other non-historical statements in this discussion are forward-looking statements. These forward-looking statements are subject to numerous risks and uncertainties, including, but not limited to, the risks and uncertainties described under “Risk Factors” and elsewhere in this Quarterly Report on Form 10-Q. Our actual results may differ materially from those contained in or implied by any forward-looking statements. \nOverview\nWe launched the Square ecosystem in February 2009 to enable businesses (\"sellers\") to accept card payments, an important capability that was previously inaccessible to many businesses. We have expanded to provide sellers additional products and services and to give them access to a cohesive ecosystem of tools to help them manage and grow their businesses. Similarly, with Cash App, we have built an ecosystem of financial products and services to help individuals manage their money. In January 2022, we completed the acquisition of Afterpay, a buy now, pay later (\"BNPL\") platform that facilitates commerce between retail merchants and consumers by allowing retail merchant clients to offer their customers the ability to buy goods and services on a BNPL basis. In addition, our nascent businesses include TIDAL and two bitcoin businesses, Bitkey and Proto.\nIn the third quarter of 2025, we generated gross profit of $2.7 billion, up 18% year over year. Cash App generated gross profit of $1.6 billion in the third quarter of 2025, up 24% year over year, driven by growth in Cash App Borrow. Square generated gross profit of $1.0 billion in the third quarter of 2025, up 9% year over year, driven by strength in our software and integrated payments and banking products.\nIn the third quarter of 2025, operating income was $409.4 million and Adjusted Operating Income was $480.2 million, compared to operating income of $323.0 million and Adjusted Operating Income of $443.5 million in the third quarter of 2024. Net income attributable to common stockholders was $461.5 million for the third quarter of 2025, compared to net income attributable to common stockholders of $283.8 million for the same period in 2024, and Adjusted EBITDA was $832.7 million for the third quarter of 2025, compared to $807.5 million for the same period in 2024. Net income for the third quarter of 2025 and 2024 included a gain of $59.6 million and $5.3 million, respectively, from the remeasurement of our bitcoin investment.\nRefer to the \nKey Operating Metrics and Non-GAAP Financial Measures\n section below for reconciliations of non-GAAP financial measures to their nearest generally accepted accounting principles (\"GAAP\") equivalents.\nStarting in 2023, we sharpened our focus on our organizational structure and expenditures with a view to identifying areas where we can be more cost efficient as we focus on disciplined growth. In 2023, we also announced we would implement an absolute cap of 12,000 on the number of employees we have at our company, which we achieved in 2024, and plan to continue to operate below this cap through a combination of performance management, centralization of teams and functions to reduce duplication, and prioritization of our scope. From 2024 through the third quarter of 2025, we continued to make progress on cost efficiency goals, and we expect to continue these efforts. During the three and nine months ended September 30, 2025, we recorded $10.0 million and $79.5 million of severance and other expenses related to these efforts, respectively. We may continue to incur expenses, including additional restructuring costs, in the short term to implement our initiatives. We continue to realize benefits related to our focus on disciplined growth and cost efficiencies, and we expect to continue to benefit from these actions in future periods.\n    \n40\nDuring the third quarter of 2025, we issued $2.2 billion in aggregate principal amount of senior unsecured notes comprised of \n$1.2 billion\n in aggregate principal amount of senior notes due 2030 (\"2030 Senior Notes\") and \n$1.0 billion\n in aggregate principal amount due 2033 (\"2033 Senior Notes\"). We ended the third quarter of 2025 with $10.5 billion in available liquidity, with $9.7 billion in cash, cash equivalents, restricted cash, and investments in marketable debt securities, as well as an undrawn amount of $775.0 million available under our revolving credit facility. This represents a decrease of $234.2 million from our available liquidity as of December 31, 2024, primarily due to a $1.0 billion cash payment for the settlement of the outstanding 2025 Convertible Notes that matured in March 2025 and $1.5 billion of share repurchases in 2025, partially offset by $2.2 billion cash received related to the 2030 Senior Notes and 2033 Senior Notes issued in the third quarter of 2025.\nIn October 2023, our board of directors authorized the repurchase of up to $1 billion of our Class A common stock. In July 2024, our board of directors authorized an increase to this share repurchase program to repurchase up to an additional $3 billion of our Class A common stock, for a total overall authorization of $4 billion. The goal of the program is to return capital to shareholders. The timing and number of shares repurchased will depend on a variety of factors, including the stock price, business and market conditions, corporate and regulatory requirements, alternative investment opportunities, acquisition opportunities, and other factors. As of September 30, 2025, we have repurchased $2.9 billion of our Class A common stock under the program, of which $403.0 million was purchased in the third quarter of 2025.\nResults of Operations\nRevenue (in thousands, except for percentages)\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nTransaction-based revenue\n$\n1,873,477 \n$\n1,712,421 \n$\n161,056 \n9 \n%\n$\n5,241,606 \n$\n4,936,597 \n$\n305,009 \n6 \n%\nSubscription and services-based revenue\n2,204,889 \n1,797,933 \n406,956 \n23 \n%\n6,148,466 \n5,268,120 \n880,346 \n17 \n%\nHardware revenue\n70,192 \n36,839 \n33,353 \nNM \n(i)\n139,305 \n112,300 \n27,005 \nNM \n(i)\nBitcoin revenue\n1,966,394 \n2,428,608 \n(462,214)\n(19)\n%\n6,411,828 \n7,771,475 \n(1,359,647)\n(17)\n%\nTotal net revenue\n$\n6,114,952 \n$\n5,975,801 \n$\n139,151 \n2 \n%\n$\n17,941,205 \n$\n18,088,492 \n$\n(147,287)\n(1)\n%\n(i)\n Not meaningful (\"NM\")\nTotal net revenue for the three months ended September 30, 2025 increased by $139.2 million, or 2%, compared to the three months ended September 30, 2024 and decreased by $147.3 million, or 1%, for the nine months ended September 30, 2025, compared to the nine months ended September 30, 2024. Bitcoin revenue decreased by $462.2 million and $1.4 billion for the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024, respectively. Excluding bitcoin revenue, total net revenue increased by $601.4 million, or 17%, and $1.2 billion, or 12%, in the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024, respectively.\nTransaction-based revenue for the three and nine months ended September 30, 2025 increased by $161.1 million, or 9%, and $305.0 million, or 6%, compared to the three and nine months ended September 30, 2024, respectively. Gross Payment Volume (\"GPV\") increased by 11% and 8% in the same periods, primarily due to growth in Square GPV, which was partially offset by a decrease in Cash App GPV. The growth in Square GPV of 12% and 10% for the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024, respectively, was driven by strength in food and beverage and retail sellers. See below in Key Operating Metrics and Non-GAAP Financial Measures for further discussion of GPV.\n41\nSubscription and services-based revenue for the three and nine months ended September 30, 2025 increased by $407.0 million, or 23%, and $880.3 million, or 17%, compared to the three and nine months ended September 30, 2024, respectively. This increase was primarily due to growth in Cash App's financial service-related products, including Cash App Borrow, Cash App Card usage, and Cash App Pay, as well as revenue from our BNPL platform. For the three and nine months ended September 30, 2025, Cash App Borrow revenue increased by $198.8 million and $369.1 million, respectively, as we continue to expand access to the product. Growth in Square's financial services-related products, primarily Square Loans, also contributed to the increase in revenue in the three and nine months ended September 30, 2025.\nBitcoin revenue for the three and nine months ended September 30, 2025 decreased by $462.2 million, or 19%, and $1.4 billion, or 17%, compared to the three and nine months ended September 30, 2024, respectively. As bitcoin revenue is the total sale amount of bitcoin to customers, the amount of bitcoin revenue recognized will fluctuate depending on customer demand as well as changes in the market price of bitcoin. The decrease in the three and nine months ended September 30, 2025 was driven by a decrease in trading volume, partially offset by an increase in the average market price of bitcoin, compared to the three and nine months ended September 30, 2024. While bitcoin contributed 32% and 36% of the total revenue for the three and nine months ended September 30, 2025, respectively, gross profit generated from bitcoin was only 3% of the total gross profit for both the three and nine months ended September 30, 2025 as well as for both the three and nine months ended September 30, 2024.\nCost of Revenue (in thousands, except for percentages)\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nTransaction-based costs\n$\n1,141,900 \n$\n1,011,476 \n$\n130,424 \n13 \n%\n$\n3,111,750 \n$\n2,884,696 \n$\n227,054 \n8 \n%\nSubscription and services-based costs\n299,554 \n271,286 \n28,268 \n10 \n%\n872,671 \n832,755 \n39,916 \n5 \n%\nHardware costs\n103,304 \n62,091 \n41,213 \nNM\n232,386 \n181,185 \n51,201 \nNM\nBitcoin costs\n1,894,767 \n2,364,077 \n(469,310)\n(20)\n%\n6,193,760 \n7,559,416 \n(1,365,656)\n(18)\n%\nAmortization of acquired technology assets\n13,857 \n17,186 \n(3,329)\nNM\n42,935 \n52,802 \n(9,867)\nNM\nTotal cost of revenue\n$\n3,453,382 \n$\n3,726,116 \n$\n(272,734)\n(7)\n%\n$\n10,453,502 \n$\n11,510,854 \n$\n(1,057,352)\n(9)\n%\nTotal cost of revenue for the three and nine months ended September 30, 2025 decreased by $272.7 million, or 7%, and $1.1 billion, or 9%, compared to the three and nine months ended September 30, 2024, respectively. Bitcoin costs of revenue, which decreased by $469.3 million and $1.4 billion for the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024, respectively, was the primary driver of the decrease in total cost of revenue. Excluding bitcoin costs of revenue, total cost of revenue increased by approximately $196.6 million, or 14%, and $308.3 million, or 8%, in the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024, respectively, largely related to an increase in Square GPV.\nTransaction-based costs for the three and nine months ended September 30, 2025 increased by $130.4 million, or 13%, and $227.1 million, or 8%, compared to the three and nine months ended September 30, 2024, respectively. While the increase in transaction-based costs was largely in line with GPV growth of 11% and 8% in the same periods, these costs exceeded GPV growth during the three months ended September 30, 2025 due to an increase in credit card transactions that have a higher cost per transaction as compared to debit card transactions. For the nine months ended September 30, 2025, the increase in transaction-based costs was partially offset by a processing vendor settlement of $20.4 million in the second quarter of 2025.\nSubscription and services-based costs for the three and nine months ended September 30, 2025 increased by $28.3 million and $39.9 million, compared to the three and nine months ended September 30, 2024, respectively, primarily due to the growth in Cash App's financial services-related products, including Cash App Borrow and Cash App Card and related processing services. While subscription and services-based revenue increased by 23% and 17% for the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024, the costs of revenues increased by 10% and 5% for the same comparative periods. This gross margin expansion is due to more favorable gross margin economics in Cash App's financial services-related products.\n42\nBitcoin costs for the three and nine months ended September 30, 2025 decreased by $469.3 million, or 20%, and $1.4 billion, or 18%, compared to the three and nine months ended September 30, 2024, respectively. Bitcoin costs are comprised of the total amount we pay to purchase bitcoin, which fluctuates in line with bitcoin revenue. \nOperating Expenses (in thousands, except for percentages)\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nProduct development\n$\n711,235 \n$\n710,983 \n$\n252 \n— \n%\n$\n2,197,222 \n$\n2,144,720 \n$\n52,502 \n2 \n%\n% of total net revenue\n12 \n%\n12 \n%\n12 \n%\n12 \n%\n% of total gross profit \n27 \n%\n32 \n%\n29 \n%\n33 \n%\nSales and marketing\n$\n599,333 \n$\n511,755 \n$\n87,578 \n17 \n%\n$\n1,653,524 \n$\n1,463,202 \n$\n190,322 \n13 \n%\n% of total net revenue\n10 \n%\n9 \n%\n9 \n%\n8 \n%\n% of total gross profit\n23 \n%\n23 \n%\n22 \n%\n22 \n%\nGeneral and administrative\n$\n543,974 \n$\n475,855 \n$\n68,119 \n14 \n%\n$\n1,485,008 \n$\n1,420,683 \n$\n64,325 \n5 \n%\n% of total net revenue\n9 \n%\n8 \n%\n8 \n%\n8 \n%\n% of total gross profit\n20 \n%\n21 \n%\n20 \n%\n22 \n%\nTransaction, loan, and consumer receivable losses\n$\n363,455 \n$\n192,062 \n$\n171,393 \n89 \n%\n$\n827,234 \n$\n549,603 \n$\n277,631 \n51 \n%\n% of total net revenue\n6 \n%\n3 \n%\n5 \n%\n3 \n%\n% of total gross profit\n14 \n%\n9 \n%\n11 \n%\n8 \n%\nAmortization of customer and other acquired intangible assets\n$\n34,133 \n$\n36,021 \n$\n(1,888)\n(5)\n%\n$\n101,680 \n$\n120,116 \n$\n(18,436)\n(15)\n%\n% of total net revenue\n1 \n%\n1 \n%\n1 \n%\n1 \n%\n% of total gross profit\n1 \n%\n2 \n%\n1 \n%\n2 \n%\nTotal operating expenses\n$\n2,252,130 \n$\n1,926,676 \n$\n325,454 \n17 \n%\n$\n6,264,668 \n$\n5,698,324 \n$\n566,344 \n10 \n%\nProduct development expenses were relatively flat for the three months ended September 30, 2025, compared to the three months ended September 30, 2024. For the nine months ended September 30, 2025, these expenses increased by $52.5 million, or 2%, compared to the nine months ended September 30, 2024. For the nine months ended September 30, 2025, the increase in expenses was driven by an increase in allocated facilities, human resources, and IT expenses of $30.1 million, personnel costs of $15.4 million arising from restructuring costs, including severance and other related expenses, as well as an increase of $13.3 million related to amortization of internally developed software, partially offset by reductions in cloud computing infrastructure fees.\nSales and marketing expenses increased by $87.6 million, or 17%, and $190.3 million, or 13%, for the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024, respectively. The increase for the three and nine months ended September 30, 2025 was primarily driven by higher marketing and advertising costs of $91.4 million and $205.7 million, respectively, as we prioritize marketing investments to support the growth of Cash App and Square. Further, for the nine months ended September 30, 2025, personnel costs increased by $26.5 million, which were impacted by restructuring costs, including severance and other related expenses. These expenses were partially offset by higher expenses recognized in the three and nine months ended September 30, 2024, related to changes to certain contractual arrangements and inventory write-offs, that did not recur during the three and nine months ended September 30, 2025.\n43\nGeneral and administrative expenses increased by $68.1 million, or 14%, and $64.3 million, or 5%, for the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024, respectively. The increase was primarily driven by higher personnel costs of $92.9 million and $79.5 million, respectively, and an increase in facilities and other expenses of $21.5 million and $27.8 million for the comparable periods. These expense increases resulted from an in-person company event held in the third quarter of 2025, as well as restructuring costs, including severance and other related expenses, recognized during the three and nine months ended September 30, 2025. In addition, the three and nine months ended September 30, 2024 included higher accrued expenses for estimated amounts in connection with certain litigation and regulatory matters that did not recur during the three and nine months ended September 30, 2025.\nTransaction, loan, and consumer receivable losses increased by $171.4 million, or 89%, and $277.6 million, or 51%, for the three and nine months ended September 30, 2025, compared to the three and nine months ended September 30, 2024, primarily due to an increase in loan losses of $158.8 million and $238.1 million, respectively, for the same periods. The increase in loan losses for the three and nine months ended September 30, 2025 was attributed to significant growth in loan volumes, particularly from Cash App Borrow, which increased 134% and 110%, respectively, compared to the three and nine months ended September 30, 2024, while loss rates remained stable. Additionally, beginning in the second quarter of 2025, Cash App Borrow, along with certain other loan products, are retained on our balance sheet and classified as held for investment, resulting in recognition of an allowance for potential uncollectible amounts.\nAmortization of customer and other acquired intangible assets for the three and nine months ended September 30, 2025 decreased $1.9 million, or 5%, and $18.4 million, or 15%, compared to the three and nine months ended September 30, 2024, respectively, primarily due to the impairment of certain assets in the fourth quarter of 2024, which resulted in no related amortization in 2025. Refer to Note 8, \nAcquired Intangible Assets \nwithin Notes to the Condensed Consolidated Financial Statements for more details.\nInterest Expense (Income), Net (in thousands, except for percentages)\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nInterest expense (income), net\n$\n34,652 \n$\n13,811 \n$\n20,841 \n151 \n%\n$\n75,582 \n$\n(6,805)\n$\n82,387 \nNM\nInterest expense, net, of $34.7 million and $75.6 million for the three and nine months ended September 30, 2025, respectively, was primarily due to interest expense related to our 2032 Senior Notes issued in the second quarter of 2024 as well as our 2030 and 2033 Senior Notes issued in the third quarter of 2025, which more than offset interest income received on invested funds. Refer to Note 12, \nIndebtedness\n within Notes to the Condensed Consolidated Financial Statements for further details. Interest expense, net, of $13.8 million and interest income, net, of $6.8 million for the three and nine months ended September 30, 2024, respectively, was primarily due to interest expense related to our 2032 Senior Notes issued in the second quarter of 2024, offset by interest income received on invested funds.\nRemeasurement Loss (Gain) on Bitcoin Investment (in thousands, except for percentages)\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nRemeasurement gain on bitcoin investment\n$\n(59,588)\n$\n(5,288)\n$\n(54,300)\nNM\n$\n(178,402)\n$\n(168,576)\n$\n(9,826)\n6 \n%\nRemeasurement gain on bitcoin investment of $59.6 million and $178.4 million for the three and nine months ended September 30, 2025, respectively, compared to gain on bitcoin investment of $5.3 million and $168.6 million for the three and nine months ended September 30, 2024, respectively, was due to the remeasurement of our bitcoin investment to its fair value at each reporting date. Refer to Note 11, \nBitcoin\n within Notes to the Condensed Consolidated Financial Statements for further details regarding the remeasurement of our bitcoin investment.\n44\nOther Expense (Income), Net (in thousands, except for percentages)\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nOther income, net\n$\n(167,150)\n$\n(9,661)\n$\n(157,489)\nNM\n$\n(162,103)\n$\n(24,665)\n$\n(137,438)\nNM\nOther income, net, of $167.2 million and $162.1 million for the three and nine months ended September 30, 2025, respectively, was primarily due to the revaluation of certain equity investments, partially offset by losses from the currency revaluation of intercompany loans. During the quarter ended September 30, 2025, one of the Company's investments closed on an additional financing round, which the Company assessed as an observable price change in an orderly transaction. The Company recorded a $171.6 million upward adjustment to the carrying value of this investment. Other income, net, of $9.7 million and $24.7 million for the three and nine months ended September 30, 2024, respectively, was primarily due to accretion on investments and foreign exchange rate impacts.\nSegment Results\nSquare Results\nThe following table provides a summary of the revenue and gross profit for our Square segment for the three and nine months ended September 30, 2025 and September 30, 2024 (in thousands, except for percentages):\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nSegment net revenue\n$\n2,240,846 \n$\n2,001,737 \n$\n239,109 \n12 \n%\n$\n6,259,280 \n$\n5,711,265 \n$\n548,015 \n10 \n%\nSegment cost of revenue\n1,223,186 \n1,069,381 \n153,805 \n14 \n%\n3,316,911 \n3,036,053 \n280,858 \n9 \n%\nSegment gross profit\n$\n1,017,660 \n$\n932,356 \n$\n85,304 \n9 \n%\n$\n2,942,369 \n$\n2,675,212 \n$\n267,157 \n10 \n%\nRevenue\nRevenue for the Square segment for the three and nine months ended September 30, 2025 increased by $239.1 million, or 12%, and $548.0 million, or 10%, compared to the three and nine months ended September 30, 2024, respectively. The increase was primarily due to the Square items referenced within our overall revenue discussion.\nCost of Revenue\nCost of revenue for the Square segment for the three and nine months ended September 30, 2025 increased by $153.8 million, or 14%, and $280.9 million, or 9%, compared to the three and nine months ended September 30, 2024, respectively. The increase was primarily due to the Square items referenced within our overall cost of revenue discussion.\nCash App Results\nThe following table provides a summary of the revenue and gross profit for our Cash App segment for the three and nine months ended September 30, 2025 and September 30, 2024 (in thousands, except for percentages):\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n$ Change\n% Change\n2025\n2024\n$ Change\n% Change\nSegment net revenue\n$\n3,799,501 \n$\n3,929,573 \n$\n(130,072)\n(3)\n%\n$\n11,523,445 \n$\n12,231,304 \n$\n(707,859)\n(6)\n%\nSegment cost of revenue\n2,175,548 \n2,623,630 \n(448,082)\n(17)\n%\n7,019,041\n8,367,890\n(1,348,849)\n(16)\n%\nSegment gross profit\n$\n1,623,953 \n$\n1,305,943 \n$\n318,010 \n24 \n%\n$\n4,504,404 \n$\n3,863,414 \n$\n640,990 \n17 \n%\n45\nRevenue\nRevenue for the Cash App segment for the three and nine months ended September 30, 2025 decreased by $130.1 million, or 3%, and $707.9 million, or 6%, compared to the three and nine months ended September 30, 2024, respectively. The decrease was driven by lower bitcoin revenue, partially offset by the Cash App items referenced within our overall revenue discussion. While bitcoin revenue contributed 52% and 56% of Cash App revenue for three and nine months ended September 30, 2025, respectively, gross profit generated from bitcoin was only 4% and 5% of Cash App gross profit for the three and nine months ended September 30, 2025, respectively.\nExcluding $2.0 billion and $6.4 billion in bitcoin revenue for the three and nine months ended September 30, 2025, respectively, Cash App revenue increased by $332.8 million, or 22%, and $652.4 million, or 15%, compared to the three and nine months ended September 30, 2024, respectively.\nCost of Revenue\nCost of revenue for the Cash App segment for the three and nine months ended September 30, 2025 decreased by $448.1 million, or 17%, and $1.3 billion, or 16%, compared to the three and nine months ended September 30, 2024, respectively. The decrease for the three and nine months ended September 30, 2025 was driven by lower bitcoin costs, partially offset by the other Cash App items referenced within our overall cost of revenue discussion. Excluding $1.9 billion and $6.2 billion in bitcoin cost of revenue for the three and nine months ended September 30, 2025, respectively, Cash App cost of revenue increased by $21.8 million, or 8%, and $17.4 million, or 2%, compared to the three and nine months ended September 30, 2024, respectively.\nKey Operating Metrics and Non-GAAP Financial Measures\nWe collect and analyze operating and financial data to evaluate the health of our business, allocate our resources, and assess our performance. In addition to total net revenue, operating income (loss), net income (loss), and other results reported under GAAP, the following table sets forth key operating metrics and non-GAAP financial measures we use to evaluate our business. We believe these metrics and measures are useful to facilitate period-to-period comparisons of our business, and to facilitate comparisons of our performance to that of other payment solution providers.\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nGross Payment Volume (GPV) (in millions)\n$\n69,283 \n$\n62,492 \n$\n192,695 \n$\n178,858 \nAdjusted Operating Income (in thousands)\n$\n480,186 \n$\n443,518 \n$\n1,496,024 \n$\n1,206,900 \nAdjusted EBITDA (in thousands)\n$\n832,662 \n$\n807,472 \n$\n2,536,878 \n$\n2,272,022 \nAdjusted Net Income Per Share:\nBasic \n$\n0.55 \n$\n0.55 \n$\n1.75 \n$\n1.52 \nDiluted\n$\n0.54 \n$\n0.53 \n$\n1.72 \n$\n1.48 \n46\nChange in Non-GAAP Financial Measures\nBeginning in fiscal 2025, we revised our definition of Adjusted Net Income Per Share (\"Adjusted EPS\") to include share-based compensation. We believe this change provides a more comprehensive view of our operating performance and aligns with our non-GAAP measure of Adjusted Operating Income. Prior period amounts have been recast to reflect the updated presentation.\nGross Payment Volume (GPV)\nGPV includes Square GPV and Cash App Business GPV. Square GPV is defined as the total dollar amount of all card and bank payments processed by sellers using Square, net of refunds. Cash App Business GPV is comprised of Cash App activity related to peer-to-peer transactions received by business accounts, and peer-to-peer payments sent from a credit card. GPV does not include transactions from our BNPL platform because GPV is related only to transaction-based revenue and not to subscription and services-based revenue.\nAdjusted EBITDA, Adjusted EPS and Adjusted Operating Income\nAdjusted EBITDA and Adjusted EPS are non-GAAP financial measures that represent our net income (loss) and net income (loss) per share, adjusted to eliminate the effect of items as described below. Adjusted Operating Income is a non-GAAP financial measure that represents our operating income (loss), adjusted to eliminate the effect of items as described below.\nWe have included these non-GAAP financial measures in this Quarterly Report on Form 10-Q because they are key measures used by our management to evaluate our operating performance, generate future operating plans, and make strategic decisions, including those relating to operating expenses and the allocation of internal resources. Accordingly, we believe these measures provide useful information to investors and others in understanding and evaluating our operating results in the same manner as our management and board of directors. In addition, they provide useful measures for period-to-period comparisons of our business, as they remove the effect of certain non-cash items and certain variable charges that do not vary with our operations.\n•\nWe believe it is useful to exclude certain non-cash charges, such as amortization of intangible assets, from our non-GAAP financial measures because the amount of such expenses in any specific period may not directly correlate to the underlying performance of our business operations.\n•\nWe believe that excluding the expense related to amortization of debt discount and issuance costs from our non-GAAP measures is useful to investors because such incremental non-cash interest expense does not represent a current or future cash outflow for the Company and is therefore not indicative of our continuing operations or meaningful when comparing current results to past results. Additionally, for purposes of calculating diluted Adjusted EPS, we add back cash interest expense on convertible notes, as if converted at the beginning of the period, if the impact is dilutive.\n•\nWe exclude the following from non-GAAP financial measures because we do not believe that these items are reflective of our ongoing business operations: gain or loss on the disposal of property and equipment; gain or loss on revaluation of equity investments; gain or loss from the remeasurement of our bitcoin investment; and tax effects of income tax benefits from deferred taxes, as applicable.\n•\nTo aid in comparability of our results across periods, we also exclude certain acquisition-related and integration costs associated with business combinations, various restructuring and other costs, and goodwill and intangible asset impairment charges, each of which are not normal operating expenses. Acquisition-related costs include amounts paid to redeem acquirees’ unvested share-based compensation awards, charges associated with holdback liabilities, and legal, accounting, valuation, and due diligence costs. Integration costs include advisory and other professional services or consulting fees necessary to integrate acquired businesses. Contingencies, restructuring and other costs that are not reflective of our core business operating expenses may include contingent losses, severance costs, impairment charges, and certain litigation and regulatory charges. We also add back the impact of the acquired deferred revenue and deferred cost adjustment, which was written down to fair value in purchase accounting.\n47\nIn addition to the items above, Adjusted EBITDA as a non-GAAP financial measure also excludes depreciation and amortization, other cash interest income and expense, and other income and expense.\nNon-GAAP financial measures have limitations, should be considered as supplemental in nature, and are not meant as a substitute for the related financial information prepared in accordance with GAAP. These limitations include the following:\n•\nthe intangible assets being amortized may have to be replaced in the future, and the non-GAAP financial measures do not reflect cash capital expenditure requirements for such replacements or for new capital expenditures or other capital commitments; and\n•\nnon-GAAP measures do not reflect changes in, or cash requirements for, our working capital needs.\nIn addition to the limitations above, Adjusted EBITDA as a non-GAAP financial measure does not reflect the effect of share-based compensation expense, which has been, and will continue to be for the foreseeable future, a significant recurring expense in our business and an important part of our compensation strategy, depreciation and amortization expense and related cash capital requirements, income taxes that may represent a reduction in cash available to us, and the effect of foreign currency exchange gains or losses, which is included in other income and expense.\nIn view of the limitations associated with Adjusted EBITDA, we also present Adjusted Operating Income (Loss), which is a non-GAAP financial measure that excludes certain expenses that we believe are not reflective of our core operating performance, including amortization of intangible assets, acquisition-related accelerated share-based compensation expenses, and acquisition-related, integration, and other costs, and goodwill and intangible asset impairment charges. Adjusted Operating Income (Loss) and Adjusted EPS include the effect of share-based compensation expense, as well as depreciation expense.\nOther companies, including companies in our industry, may calculate the non-GAAP financial measures differently or not at all, which reduces their usefulness as comparative measures.\nBecause of these limitations, you should consider the non-GAAP financial measures alongside other financial performance measures, including net income (loss) and our other financial results presented in accordance with GAAP. \n48\n    \nThe following table presents a reconciliation of operating income (loss) to Adjusted Operating Income (Loss) for each of the periods indicated (in thousands):\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nOperating income \n$\n409,440 \n$\n323,009 \n$\n1,223,035 \n$\n879,314 \nAmortization of acquired technology assets\n13,857 \n17,186 \n42,935 \n52,802 \nAcquisition-related and integration costs\n345 \n608 \n1,707 \n48,470 \nContingencies, restructuring and other charges\n20,752 \n66,694 \n114,407 \n99,561 \nRestructuring share-based compensation\n1,659 \n— \n12,260 \n6,637 \nAmortization of customer and other acquired intangible assets\n34,133 \n36,021 \n101,680 \n120,116 \nAdjusted Operating Income\n$\n480,186 \n$\n443,518 \n$\n1,496,024 \n$\n1,206,900 \nThe following table presents a reconciliation of net income (loss) to Adjusted EBITDA for each of the periods indicated (in thousands):\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nNet income attributable to common stockholders\n$\n461,544 \n$\n283,754 \n$\n1,189,874 \n$\n951,027 \nLess: Net income (loss) attributable to noncontrolling interests\n54 \n(2,618)\n(1,220)\n(9,199)\nNet income\n461,598 \n281,136 \n1,188,654 \n941,828 \nShare-based compensation expense\n307,721 \n324,055 \n909,697 \n948,954 \nRestructuring share-based compensation expense\n1,659 \n— \n12,260 \n6,637 \nDepreciation and amortization\n92,119 \n92,706 \n273,464 \n287,249 \nAcquisition-related and integration costs\n345 \n608 \n1,707 \n48,470 \nContingencies, restructuring and other charges\n20,752 \n66,694 \n114,407 \n99,561 \nInterest expense (income), net\n34,652 \n13,811 \n75,582 \n(6,805)\nRemeasurement gain on bitcoin investment\n(59,588)\n(5,288)\n(178,402)\n(168,576)\nOther income, net\n(167,150)\n(9,661)\n(162,103)\n(24,665)\nProvision for income taxes\n139,928 \n43,011 \n299,304 \n137,532 \nLoss on disposal of property and equipment\n617 \n384 \n2,276 \n1,784 \nAcquired deferred revenue and cost adjustment\n9 \n16 \n32 \n53 \nAdjusted EBITDA\n$\n832,662 \n$\n807,472 \n$\n2,536,878 \n$\n2,272,022 \n49\nThe following table presents a reconciliation of net income (loss) to Adjusted Net Income (Loss) Per Share for each of the periods indicated (in thousands, except per share data):\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nNet income attributable to common stockholders\n$\n461,544 \n$\n283,754 \n$\n1,189,874 \n$\n951,027 \nLess: Net income (loss) attributable to noncontrolling interests\n54 \n(2,618)\n(1,220)\n(9,199)\nNet income\n461,598 \n281,136 \n1,188,654 \n941,828 \nAcquisition-related and integration costs\n345 \n608 \n1,707 \n48,470 \nContingencies, restructuring and other charges\n20,752 \n66,694 \n114,407 \n99,561 \nRestructuring share-based compensation expense\n1,659 \n— \n12,260 \n6,637 \nAmortization of intangible assets\n47,990 \n53,207 \n144,615 \n172,918 \nAmortization of debt discount and issuance costs\n3,335 \n4,042 \n9,469 \n10,545 \nLoss (gain) on revaluation of equity investments\n(171,126)\n2,952 \n(172,582)\n469 \nRemeasurement gain on bitcoin investment\n(59,588)\n(5,288)\n(178,402)\n(168,576)\nLoss on disposal of property and equipment\n617 \n384 \n2,276 \n1,784 \nAcquired deferred revenue and cost adjustment\n9 \n16 \n32 \n53 \nTax effect of income tax benefits from deferred tax assets\n(8,909)\n— \n(61,509)\n— \nTax effect of non-GAAP net income adjustments\n39,933 \n(66,774)\n15,100 \n(175,364)\nAdjusted Net Income - basic\n$\n336,615 \n$\n336,977 \n$\n1,076,027 \n$\n938,325 \nCash interest expense on convertible notes\n273 \n682 \n973 \n2,029 \nAdjusted Net Income - diluted\n$\n336,888 \n$\n337,659 \n$\n1,077,000 \n$\n940,354 \nWeighted-average shares used to compute Adjusted Net Income Per Share:\nBasic\n610,199 \n616,428 \n614,117 \n616,830 \nDiluted\n621,658 \n632,760 \n625,256 \n635,419 \nAdjusted Net Income Per Share:\nBasic\n$\n0.55 \n$\n0.55 \n$\n1.75 \n$\n1.52 \nDiluted\n$\n0.54 \n$\n0.53 \n$\n1.72 \n$\n1.48 \nDiluted Adjusted Net Income Per Share is computed by dividing Adjusted Net Income by the weighted-average number of shares of common stock outstanding adjusted for the dilutive effect of all potential shares of common stock. In periods when we reported an Adjusted Net Loss, diluted Adjusted Net Income Per Share is the same as basic Adjusted Net Income Per Share because the effects of potentially dilutive items were anti-dilutive.\n50\nThe following table presents a reconciliation of the tax effect of non-GAAP net income adjustments to our provision for (benefit from) income taxes (in thousands, except effective tax rate):\nThree Months Ended\nSeptember 30,\nNine Months Ended\nSeptember 30,\n2025\n2024\n2025\n2024\nProvision for income taxes, as reported\n$\n139,928\n$\n43,011\n$\n299,304\n$\n137,532\nTax effect of income tax benefits from deferred tax assets\n8,909\n—\n61,509\n—\nTax effect of non-GAAP net income adjustments\n(39,933)\n66,774\n(15,100)\n175,364\nAdjusted provision for income taxes, non-GAAP\n$\n108,904\n$\n109,785\n$\n345,713\n$\n312,896\nNon-GAAP effective tax rate\n24 \n%\n25 \n%\n24 \n%\n25 \n%\nWe determined the adjusted provision for income taxes by calculating the estimated annual effective tax rate based on our adjusted provision for income taxes, non-GAAP and applying it to Adjusted Net Income before income taxes.\nLiquidity and Capital Resources\nLiquidity Sources\nAs of September 30, 2025, we had approximately $10.5 billion in available liquidity, with $9.7 billion in cash, cash equivalents, restricted cash, and investments in marketable debt securities, as well as an undrawn amount of $775.0 million available under our revolving credit facility. Additionally, we had $983.1 million available to be withdrawn under our warehouse funding facilities. Refer to Note 12, \nIndebtedness \nwithin Notes to the Condensed Consolidated Financial Statements for more details. We intend to continue focusing on our long-term business initiatives and believe that our available funds are sufficient to meet our liquidity needs for the foreseeable future, including our share repurchase program. As of September 30, 2025, we were in compliance with all financial covenants associated with our revolving credit facility and senior notes. None of our warehouse funding facilities contain financial covenants.\nThe following table summarizes our available liquidity (in thousands):\n  September 30, 2025\nDecember 31, 2024\nCash and cash equivalents\n$\n8,335,934 \n$\n8,075,247 \nShort-term restricted cash \n(i)\n731,590 \n902,478 \nLong-term restricted cash\n73,786 \n69,915 \nInvestments in short-term debt securities\n370,772 \n403,426 \nInvestments in long-term debt securities\n176,784 \n471,977 \nRevolving credit facility\n775,000 \n775,000 \nTotal liquidity\n$\n10,463,866 \n$\n10,698,043 \n(i)\n As of September 30, 2025, we have invested $96.6 million of restricted cash into a money market fund. See Note 5, \nFair Value Measurements.\n \n51\nOur principal sources of liquidity are our cash and cash equivalents, and investments in marketable debt securities. Customer funds cash and cash equivalents are excluded from our liquidity as these are funds we hold on behalf of customers that are separate from our corporate funds and are not available for corporate purposes. Investments in marketable debt securities were held primarily in certificates of deposits, money market funds, reverse repurchase agreements, U.S. government and agency securities, commercial paper, and corporate bonds. We consider all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents. Our investments in marketable debt securities are classified as available-for-sale. \nAs of September 30, 2025, we held approximately 8,780 bitcoins for long-term investment purposes (\"bitcoin investment\") with a fair value of $1.0 billion based on observable market prices, which is included within “Other non-current assets” on the condensed consolidated balance sheets. We believe cryptocurrency is an instrument of economic empowerment that aligns with our corporate purpose. We expect to hold these investments for the long-term but will continue to reassess our bitcoin investment relative to our balance sheet. Bitcoin is considered an indefinite-lived intangible asset, and upon adoption of Accounting Standards Update No. 2023-08, \nAccounting for and Disclosure of Crypto Assets\n, effective January 1, 2023, our bitcoin investment is remeasured at fair value at each reporting date with changes recognized in net income through \"Remeasurement loss (gain) on bitcoin investment\" within the condensed consolidated statements of operations. We purchased approximately 88 and 295 bitcoins with a cost basis of $10.2 million and $30.7 million during the three and nine months ended September 30, 2025, respectively, for investment purposes. We purchased approximately 152 and 325 bitcoins with a cost basis of $9.7 million and $21.1 million during the three and nine months ended September 30, 2024, respectively, for investment purposes. We did not sell any of our bitcoin investment during the three and nine months ended September 30, 2025 and September 30, 2024. We recognized gains of $59.6 million and $178.4 million from the remeasurement of our bitcoin investment during the three and nine months ended September 30, 2025, respectively. We recognized gains of $5.3 million and $168.6 million from the remeasurement of our bitcoin investment during the three and nine months ended September 30, 2024, respectively.\nOur principal commitments consist of convertible notes, senior notes, revolving credit facility, warehouse funding facilities, operating leases, capital leases, and purchase commitments. Refer to Note 12, \nIndebtedness \nand\n \nNote 17, \nCommitments and Contingencies \nwithin Notes to the Condensed Consolidated Financial Statements for more details on these commitments.\nSenior Notes and Convertible Notes\nAs of September 30, 2025, we held $7.4 billion in aggregate principal amount of debt, comprised of $575.0 million in aggregate amount of convertible senior notes that mature on May 1, 2026 (\"2026 Convertible Notes\"), and $575.0 million in aggregate amount of convertible senior notes that mature on November 1, 2027 (\"2027 Convertible Notes,\" collectively referred to as the “Convertible Notes”), as well as an outstanding $1.0 billion in aggregate principal amount of senior unsecured notes that mature on June 1, 2026 (\"2026 Senior Notes\"), $1.2 billion in aggregate principal amount of senior unsecured notes that mature on August 15, 2030 (\"2030 Senior Notes\"), $1.0 billion in aggregate principal amount of senior unsecured notes that mature on June 1, 2031 (\"2031 Senior Notes\"), $2.0 billion in aggregate principal amount of senior unsecured notes that mature on May 15, 2032 (\"2032 Senior Notes\"), $1.0 billion in aggregate principal amount of senior unsecured notes that mature on August 15, 2033 (\"2033 Senior Notes\" and, together with the 2026 Senior Notes, 2030 Senior Notes, and 2031 Senior Notes, the “Senior Notes” and, together with the Convertible Notes, the “Notes”). Refer to Note 12, \nIndebtedness \nwithin Notes to the Condensed Consolidated Financial Statements for further details.\nOn March 5, 2020, we issued an aggregate principal amount of $1.0 billion of convertible senior notes (\"2025 Convertible Notes\"). On March 1, 2025, we paid $1.0 billion in cash to settle the outstanding principal balance and interest on the 2025 Convertible Notes upon maturity.\nRevolving Credit Facility\nWe have entered into a revolving credit agreement with certain lenders, as subsequently amended, which provides a $775.0 million senior unsecured revolving credit facility maturing in June 2028. Refer to Note 12, \nIndebtedness \nwithin Notes to the Condensed Consolidated Financial Statements for further details.\n52\nWarehouse Funding Facilities\nWe have warehouse funding facilities (\"Warehouse Facilities\") with an aggregate amount of $1.5 billion on a revolving basis, of which $501.0 million was drawn as of September 30, 2025. The Warehouse Facilities have been arranged utilizing wholly-owned and consolidated entities (collectively, the \"Warehouse Special Purpose Entities (SPEs)\") formed for the sole purpose of financing the origination of consumer receivables to partly fund our BNPL platform. Borrowings under the Warehouse Facilities are secured against the respective consumer receivables. While the Warehouse SPEs are included in our condensed consolidated financial statements, they are separate legal entities that maintain legal ownership of the receivables they hold. The assets of the Warehouse SPEs are not available to satisfy our claims or those of our creditors.\nCash, Restricted Cash, and Working Capital\nWe believe that our existing cash and cash equivalents, investment in marketable debt securities, and availability under our line of credit will be sufficient to meet our working capital needs, including any expenditures related to strategic transactions and investment commitments that we may from time to time enter into, short-term debt repayments, shares repurchased through our share repurchase program, and planned capital expenditures for at least the next 12 months. \nFrom time to time, we have raised capital by issuing equity, equity-linked, or debt securities such as our Convertible Notes and Senior Notes; and we may do so in the future. However, such funding may not be available on terms acceptable to us or at all.\nIn the second quarter of 2025, we received an investment grade rating by Fitch Ratings, Inc. (BBB-). During 2024, we received non-investment grade ratings by S&P Global Ratings (BB+) and Moody's Corporation (Ba2). The ratings from Fitch Ratings, Inc., S&P Global Ratings, and Moody's Corporation were affirmed in the third quarter of 2025. We expect that these credit rating agencies will continue to monitor our performance, including our capital structure and results of operations. Our liquidity, access to capital, and borrowing costs could be adversely impacted by declines in our credit rating.\nShort-term restricted cash of $731.6 million as of September 30, 2025 primarily includes cash held by the Warehouse SPEs used in the Warehouse Facilities funding arrangements that will be used to pay the borrowings under the Warehouse Facilities or will be distributed to us. It also includes pledged cash deposits in accounts at the financial institutions that process our sellers' payment transactions and collateral pursuant to various agreements with banks relating to our products. We use restricted cash to secure letters of credit with the related financial institutions to provide collateral for cash flow timing differences in the processing of payments. We have recorded these amounts as current assets on our condensed consolidated balance sheet given the short-term nature of these cash flow timing differences and that there is no minimum time frame during which the cash must remain restricted.\nLong-term restricted cash of $73.8 million as of September 30, 2025 is primarily related to cash held as collateral as required by the Federal Deposit Insurance Corporation (\"FDIC\") for Square Financial Services. We have recorded these amounts as non-current assets on our condensed consolidated balance sheet as the requirement by the FDIC specifies a time frame of 12 months or longer during which the cash must remain restricted.\nWe experience significant day-to-day fluctuations in our cash and cash equivalents due to fluctuations in settlements receivable and customers payable, and hence working capital. These fluctuations are primarily due to:\n•\nTiming of period end.\n For periods that end on a weekend or a bank holiday, our cash and cash equivalents, settlements receivable, and customers payable balances typically will be higher than for periods ending on a weekday, as we settle to our sellers for payment processing activity on business days; and\n•\nFluctuations in daily GPV.\n When daily GPV increases, our cash and cash equivalents, settlements receivable, and customers payable amounts increase. Typically our settlements receivable and customers payable balances at period end represent one to four days of receivables and disbursements to be made in the subsequent period. Customers payable, excluding amounts attributable to Cash App stored funds, and settlements receivable balances typically move in tandem, as pay-out and pay-in largely occur on the same business day. However, customers payable balances will be greater in amount than settlements receivable balances due to the fact that a subset of funds are held due to unlinked bank accounts, risk holds, and chargebacks. Customer funds obligations, which may be impacted by the timing of period end, number of processors used and processing times, are included in customers payable and may also cause customers payable to trend differently than settlements receivable. Holidays and day-of-week may also cause significant volatility in daily GPV amounts.\n53\nCash Flow Activities\nThe following table summarizes our cash flow activities (in thousands):\nNine Months Ended\nSeptember 30,\n2025\n2024\nNet cash provided by operating activities\n$\n1,958,714 \n$\n1,693,550 \nNet cash provided by (used in) investing activities\n(671,814)\n973,108 \nNet cash provided by (used in) financing activities\n(652,901)\n1,245,092 \nEffect of foreign exchange rate on cash and cash equivalents\n80,515 \n13,600 \nNet increase in cash, cash equivalents, restricted cash, and customer funds\n$\n714,514 \n$\n3,925,350 \nCash Flows from Operating Activities \n    \nFor the nine months ended September 30, 2025, cash provided by operating activities was $2.0 billion, comprised of net income of $1.2 billion, adjusted for non-cash expenses of $1.9 billion, consisting primarily of share-based compensation; transaction, loan, and consumer receivable losses; depreciation and amortization; and changes in deferred income taxes, all of which contributed positively to operating activities. These were partially offset by the amortization of discounts and other non-cash adjustments on consumer receivables of $835.0 million; bitcoin remeasurement of $178.4 million; revaluation of equity investments of $172.6 million; and net outflows related to changes in other assets and liabilities, including customers payable and settlements receivable, of $355.1 million due to the timing of period end.\nFor the nine months ended September 30, 2024, cash provided by operating activities was $1.7 billion, comprised of net income of $941.8 million, adjusted for non-cash expenses of $1.9 billion, consisting primarily of share-based compensation; transaction, loan, and consumer receivable losses; and depreciation and amortization, all of which contributed positively to operating activities. These were partially offset by the amortization of discounts and other non-cash adjustments on consumer receivables of $824.2 million; net outflows from loan products of $467.8 million; and bitcoin remeasurement of $168.6 million. Changes in other assets and liabilities, including settlements receivable and customers payable of $358.3 million contributed positively and was primarily due to the timing of period end.\nCash Flows from Investing Activities \nBeginning in the second quarter of 2025, we began originating Cash App Borrow loans through Square Financial Services, which are classified as loans held for investment. Additionally, beginning July 1, 2025, Cash App Borrow loans and certain other customer loan products purchased from the industrial bank, along with customer loan products originated through Square Financial Services, are retained on the Company's balance sheet and classified as held for investment. Cash flows associated with these loans, including originations and principal repayments, are included within cash flows from investing activities.\nFor the nine months ended September 30, 2025, cash used in investing activities was $671.8 million, primarily due to net outflows of $2.0 billion primarily related to Cash App Borrow loans originated through Square Financial Services and the purchases of property and equipment of $113.8 million. These were partially offset by net inflows related to consumer receivables of $1.2 billion and net proceeds from investments of marketable securities of $334.4 million.\nFor the nine months ended September 30, 2024, cash provided by investing activities was $973.1 million, primarily due to a net inflow related to consumer receivables of $945.1 million and net proceeds from investments of marketable securities of $192.2 million. These were partially offset by the purchases of property and equipment and other investments of $127.0 million and $37.2 million, respectively.\n54\nCash Flows from Financing Activities \nFor the nine months ended September 30, 2025, cash used in financing activities was $652.9 million primarily due to $1.5 billion of share repurchases in the first three quarters of 2025; a $1.0 billion cash payment for the settlement of the outstanding 2025 Convertible Notes that matured in March 2025; and net repayments under Warehouse Facilities borrowings of $1.0 billion. These were partially offset by approximately $2.2 billion of net proceeds related to the issuance of the 2030 and 2033 Senior Notes in the third quarter of 2025, increases in customer funds of $620.8 million and interest-bearing deposits of $81.2 million. \nFor the nine months ended September 30, 2024, cash provided by financing activities was $1.2 billion primarily due to approximately $2.0 billion of net proceeds related to the issuance of the 2032 Senior Notes in the second quarter of 2024, a change in customer funds of $763.4 million, and proceeds from issuances of common stock from the exercise of options and purchases under our employee share purchase plan of $88.1 million. These were partially offset by repurchases of common stock of $987.2 million as well as net repayments under Warehouse Facilities borrowings of $647.7 million.\nCritical Accounting Estimates \n    \nOur discussion and analysis of our financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with GAAP. GAAP requires us to make certain estimates and judgments that affect the amounts reported in our financial statements. We base our estimates on historical experience, anticipated future trends, and other assumptions we believe to be reasonable under the circumstances. Because these accounting estimates require significant judgment, our actual results may differ materially from our estimates.\nThere were no significant changes in our critical accounting estimates during the quarter ended September 30, 2025 compared to those previously disclosed in “Critical Accounting Policies and Estimates” in “Management’s Discussion and Analysis of Financial Condition and Results of Operations” included in our Annual Report on Form 10-K for the year ended December 31, 2024.\nRecent Accounting Pronouncements\nSee “Recent Accounting Pronouncements” described in Note 1, \nDescription of Business and Summary of Significant Accounting Policies \nwithin Notes to the Condensed Consolidated Financial Statements."
}