{
  "source_file": "sq-20241231.htm",
  "form_type": "10-K",
  "item1": "ITEM 1. BUSINESS\nOur Business\nAt Block, Inc. (together with its subsidiaries, \"Block\" or \"we\"), we are building an ecosystem dedicated to economic empowerment and unlocking access to the financial system for people around the world. We do this by building the most relevant products and tools for the communities we serve including sellers, consumers, artists, fans and developers. Our brands work together cohesively, often positively reinforcing one another and creating resonant relationships with people who use our products to meet multiple needs across the different aspects of their lives. As we scale, we are focused on investing in building deeper connections between our ecosystems and increasing the resilience of our company.\nOn December 1, 2021, we changed our corporate name from Square, Inc. to Block, Inc. Block is the name for the company as a corporate entity. Since our start in 2009 with the Square business, we have added Cash App, and relatively nascent businesses with TIDAL and two bitcoin businesses, Bitkey and Proto. \nOur two reportable segments are Square, formerly referred to as Seller, and Cash App, which reflects our two primary ecosystems and the manner in which the Company's chief operating decision maker (\"CODM\") reviews and assesses performance. \nSquare Ecosystem\nWe started Block with the Square ecosystem in February 2009 to enable businesses (\"sellers\") to accept card payments, an important capability that was previously inaccessible to many businesses. As our company grew, we recognized that sellers need a variety of solutions to thrive and saw how we could apply our strength in technology and innovation to help sellers. We have since expanded Square into a cohesive commerce ecosystem that provides more than 30 distinct products and services to help our sellers start, run, and grow their businesses. We combine software, hardware, and financial services to create products and services that are cohesive, fast, self-serve, and elegant. These attributes differentiate Square in a fragmented industry that traditionally forced sellers to stitch together products and services from multiple vendors, and often rely on inefficient non-digital processes and tools. Our ability to add new sellers efficiently, help them grow their business, and cross-sell our products and services has historically contributed to our long-term growth. \nCash App Ecosystem\nCash App provides an ecosystem of financial products and services to help consumers manage their money. Cash App’s goal is to redefine the world’s relationship with money by making it more relatable, instantly available, and universally accessible. While Cash App started with the single ability to send and receive money, it now provides an ecosystem of financial services focused on helping consumers make their money go further by enabling customers to store, send, receive, spend, invest, buy now, pay later (\"BNPL\"), borrow or save their money with Cash App. Similar to our Square ecosystem, we believe the aggregation of these products into one app differentiates Cash App from competitors and provides greater utility for customers, allowing Cash App to build retentive relationships with its customers. Over time, with its bank partners, Cash App is aiming to become one of the top providers of banking services to households in the United States that earn up to $150,000 per year. \nTIDAL Ecosystem\nTIDAL expands our purpose of economic empowerment to artists. TIDAL is a global platform for musicians and their fans that uses unique content, experiences, and features to bring fans closer to artists and to provide artists with tools to succeed as entrepreneurs. TIDAL offers an extensive catalog of more than 162 million songs and 927,000 high-quality videos. TIDAL has a global presence with listeners in more than 60 countries and relationships with more than 300 labels and distributors.\n4\nBitcoin Ecosystem\nOur bitcoin ecosystem includes our bitcoin hardware projects, which include Bitkey, a self-custody bitcoin wallet, Proto, a bitcoin mining system, as well as Spiral, an independent team focused on contributing to bitcoin open source work. We believe our bitcoin ecosystem can help address inefficiencies in the current financial system, especially with respect to identity and trust. In the fourth quarter of 2024, we announced our decision to wind down TBD, which was an open developer platform for decentralized finance.\nOur Customers\nOur Square Sellers\nSquare sellers represent a diverse range of industries (including services, food-related, and retail businesses) and sizes, ranging from sole proprietors to multinational businesses. Square sellers span geographies, including the United States, Canada, Japan, Australia, the United Kingdom, Ireland, France, and Spain. We believe the diversity of our sellers underscores the accessibility and flexibility of our offerings. We have also increasingly served mid-market sellers, which we define as sellers that generate more than $500,000 in annualized Square Gross Payment Volume (“Square GPV”), due to our ability to offer more flexible and complex solutions than traditional alternatives, as well as a growing product suite. For the years ended December 31, 2024, 2023, and 2022, none of our customers accounted for greater than 5% of Square GPV. We define Square GPV as the total dollar amount of all card and bank payments processed by sellers using Square, net of refunds. \nIn the year ended December 31, 2024, more than 4 million sellers used the Square ecosystem to make 5.2 billion individual sales transactions totaling $228 billion of Square GPV. These sales transactions originated from more than 800 million payment cards, across more than 300 million buyer profiles. \nThe charts below show the percentage mix of our Square GPV by seller industry and seller size for the year ended December 31, 2024:\n5\nOur Cash App Customers\nAs of December 2024, Cash App had 57 million monthly transacting actives across the United States. In 2024, Cash App was the number one finance app on Google Play and number two finance app on iOS based on downloads in the United States. Cash App has a diverse mix of customers and, in the United States, had monthly transacting actives in each of the 50 states and nearly every county as of December 2024. \nIn 2024, Cash App transacting actives brought $283 billion in inflows into Cash App. Customers can fund their Cash App accounts with inflows in a variety of ways, including by receiving money from another Cash App customer through the app’s core peer-to-peer transfer service, transferring money from a bank account, depositing mobile checks, adding physical cash at participating retailers, and receiving a recurring paycheck by direct deposit. In the fourth quarter of 2024, our Cash App monthly transacting actives brought in an average of $1,255 of inflows during the quarter. A transacting active is a Cash App account that has at least one financial transaction using any product or service within Cash App during the specified period. Examples of transactions include sending or receiving a peer-to-peer payment, transferring money into or out of Cash App, making a purchase using Cash App Card, earning a dividend on a stock investment, and paying back a loan, among others. Certain of these accounts may share an alias identifier with one or more other transacting active accounts. This could represent, among other things, one customer with multiple accounts or multiple customers sharing one alias identifier (for example, families).\n6\n7\nOur Products and Services\nSquare Ecosystem\nOur Square ecosystem consists of more than 30 distinct software, hardware, and financial services products. Our products are designed to be self-serve and intuitive to make initial setup and new employee training fast and easy, although we also offer full-service setup and support. Our products are also flexible enough to serve the needs of both small, single location and large, complex multi-location sellers. Our products are integrated to create a seamless experience and enable a holistic view of sales, customers, employees, and finances. We believe the breadth and depth of our products and services provide us unique advantages in best serving the needs of our sellers through a holistic view of their businesses. We supplement these first party capabilities with our open developer platform that enables integrations with third-party applications. We monetize these products through a combination of transaction, subscription, and service fees. \nStrategic Priorities\nOur focus for Square is on four priorities: maintaining our secure, and flexible multi-product platform, providing a “local” experience to sellers of all sizes, growing with artificial intelligence (“AI”), and further developing our banking offering.\n•\nPlatform: \nIt is critical that we have a strong foundation to build upon to serve external customers through our developer platform and partner ecosystem, and our internal team's first party products. This includes increasing reliability of our platform and also introducing products and features that are most important to our customers.\n•\nLocal:\n Our go-to-market strategy is focused on verticals with a local approach, specifically restaurants and services-based businesses. Growing upmarket has shown us that even larger sellers want to feel authentic to their buyers. We can enable this type of robust offering through our technology and by improving the onboarding process through sales and account management.\n•\nArtificial Intelligence (AI):\n We are focused on enabling growth by leveraging AI to increase productivity and outcomes for our sales and marketing, customer service, and engineering efforts, in addition to building features that help sellers grow their businesses.\n8\n•\nBanking:\n Our robust banking offering primarily helps our sellers manage cash flow and grow their business through our lending capabilities. We will continue to drive trust with our sellers, and build products and features that help with sellers accessing funds securely and timely.\nCommerce\nSquare's commerce products help sellers make sales and track orders, inventory, and fulfillment across in-person and online channels, as well as first-party and third-party channels. Most of our Square commerce products have a free tier (without a subscription fee), which we monetize only through transaction fees on card payments. Some commerce products also have premium tiers with additional functionality, which we monetize through subscription fees in addition to transaction fees on payments.\nSquare Point of Sale\n is our primary commerce application for sellers, and provides an easy-to-use, customizable point-of-sale solution that adapts across business types and stages. Over the past year, we have modernized and simplified our Point of Sale applications, combining our vertical software solutions into one Square Point of Sale app, which now includes: \n•\nA vertical solution tailored for both quick-service and full-service restaurants. It includes table, order, and course management; a kitchen display system; and revenue and cost reporting.\n•\nA vertical solution tailored for appointment-based businesses that need a point-of-sale application with integrated booking capabilities. Our features include a free online booking site so buyers can easily schedule appointments and select their preferred time, service, and staff member. It is also integrated with Square Assistant, an AI-enabled automated messaging tool designed to respond to buyers efficiently and professionally, saving sellers' time and helping prevent missed appointments.\n•\nA vertical solution tailored for sellers in the retail industry. It includes advanced inventory management, cost of goods sold reporting, purchase orders, vendor management, and barcode scanning.\n•\nA customizable digital invoicing solution with integrated and secure online payment acceptance. This eliminates the need to print and mail statements to customers and wait for checks to arrive. Sellers use Square Invoices for upcoming, recurring, or previously delivered goods and services, such as catering orders, contractor services, lessons, and retail orders. Square Invoices also lets sellers send estimates and collect partial payments for goods and services.\nOur commerce products also include:\n•\nSquare Online \nmakes it easy to build a website and online store as well as sell on Instagram and Facebook. The online store is mobile responsive, delivering an app-like ordering experience on a buyer’s phone. With integrated support for QR code ordering, sellers can also streamline their in-store operations by posting the QR code and having their buyers order from their own phones. Fulfillment options include pickup, delivery managed by our sellers, and integrations with partner delivery platforms. The system is designed for orders, items, inventory, and customer data to stay in sync when selling both online and in-person.\n•\nSquare Online Checkout\n makes it easy to sell online without a website by allowing sellers to create a checkout link with only a name and price for their good or service.\n•\nSquare Virtual Terminal \nallows sellers to use a computer as a card terminal. Sellers can take a payment, set up recurring billing, record sales, and send digital receipts for payments, including those made by check and bank transfer.\n•\nRisk Manager \ngives sellers insight into online payment fraud patterns and enables them to set custom rules and alerts to manage risk. Machine-learning algorithms are designed to automatically identify fraud patterns and adapt to fit a seller's operations.\n•\nOrder Manager \nallows sellers to manage online orders that originate from Square Online, their own website on another platform, and third-party websites including online marketplaces such as DoorDash. Order Manager enables tracking open orders, managing prep times and busy times, and marking orders as completed.\n9\n•\nPayment APIs \n(application programming interfaces) and SDKs (software development kits) support in-person, online, and mobile payments. Square Reader SDK enables developers to seamlessly integrate Square hardware with a seller’s custom point of sale, allowing them to build unique checkout experiences such as self-ordering kiosks powered by Square’s managed payments service. With Square's online payments APIs, developers can integrate Square payments into a seller’s e-commerce website or online store. Square's In-App Payments SDK enables developers to build consumer mobile apps that use Square to process payments. These products are monetized primarily through transaction fees on payment volumes.\n•\nCommerce APIs: \nSquare offers more than 30 commerce APIs, through which developers can create and manage orders, subscriptions, product catalogs, inventory, customer profiles, employees, loyalty programs, gift cards, and more to build applications that enrich and integrate with Square's ecosystem of products. In addition, these APIs enable developers to build integrations with their existing business systems such as accounting, customer relationship management (“CRM”), employee management, and enterprise resource planning (“ERP”) software.\nFor card payments, Square acts as the merchant of record for the transaction as well as the payment service provider (“PSP”). As the merchant of record, Square is the party responsible for settling funds with the seller and helps manage transaction risk loss on behalf of the seller. Square’s managed payments offering for sellers includes payment dispute management, data security, and PCI compliance for a transparent transaction fee paid by sellers. Square has negotiated terms and entered into contractual arrangements directly with other service providers of transaction processing services, including the acquiring processors and card networks, and indirectly with issuing banks. These contracts include negotiated terms, such as more favorable pricing, that are generally not available to sellers if they were to contract directly with these sub-service providers. Square's position as the merchant of record helps us better serve our sellers. For example, as the merchant of record, we can more efficiently onboard new sellers through our website, leveraging our risk assessment models, and we have insights into transaction-level data that we use to inform our sellers and launch new products.\nSoftware\nMost of our Square software products have a free tier (without a subscription fee), which we monetize only through transaction fees on card payments. Most software products also have premium tiers with additional functionality, which we monetize through subscription fees in addition to transaction fees on payments.\nSquare’s Customer capabilities help sellers grow their business. By linking customer data together with online and in-person commerce data, Square can offer sellers integrated omnichannel capabilities to acquire, engage, and retain customers. Square transaction data and reporting allows sellers to easily assess performance and return on investment. We typically monetize these products via service and software fees.\n•\nBNPL \nhelps drive net new demand to sellers via discovery in the Afterpay app and has historically increased average conversion rates and average transaction sizes for new and existing customers across online and in-store channels. \n•\nSquare Loyalty\n helps sellers keep their buyers coming back. We have found that buyers that enroll in a Square Loyalty program have been more than three times as likely to be repeat customers and spend 50% more on average.\n•\nSquare Marketing\n helps sellers drive traffic by sending emails or texts to promote in-store events, new products, last-minute deals, or seasonal offers. Sellers can set up recurring automated campaigns to welcome new customers, wish them a happy birthday, send abandoned-cart reminders, or reach out to lapsed customers.\n•\nSquare Gift Cards\n help sellers bring in new buyers when their customers purchase gift cards for their friends and family. \n10\nSquare's staff management products give sellers digital tools to streamline their operations. These tools are designed to seamlessly integrate with other Square products eliminating the latent, time-consuming, and error-prone processes typically used to copy and sync data between disparate systems. We typically monetize these products via software fees. \n•\nSquare Team Management\n makes it easy to schedule staff and view team performance and sales analytics in real time. It also enables limiting access to Square software features per employee or role. The Square Team App enables team members to clock in and out, view and adjust their schedules, and see timecards, hours worked, and estimated pay from their mobile phone. \n•\nSquare Payroll\n allows sellers to pay wages and associated employee taxes, and offer employee benefits (e.g. 401(k) accounts). The Square ecosystem drives competitive differentiation for our Payroll product with the ability to use Payroll in conjunction with our point-of-sale products, Team Management, and Cash App.\nFinancial Services\nThrough our wholly-owned subsidiary bank, Square Financial Services, Inc. (“Square Financial Services”) and with our third-party bank partners, we offer a growing number of banking services that make it easier for sellers to manage cash flow and get faster access to funds. \n•\nSquare Lending \nprovides a platform of lending products to qualified Square sellers. Square Loans (formerly Square Capital) facilitates loans to qualified Square sellers through Square Financial Services, which is an industrial loan company (“ILC\"). Square Loans eliminates the lengthy (and often unsuccessful) loan application process. We are able to approve sellers for these loans by using our unique data set of the seller’s Square transactions to help facilitate loan underwriting and collections, which mitigates risks. Generally, loan repayment occurs automatically through a fixed percentage of every card transaction a seller takes. Loans are sized to be less than 20% of a seller's expected annual Square GPV and, by simply running their business, sellers historically have repaid their loans within nine months on average. We currently fund a majority of these loans from arrangements with institutional third-party investors who purchase these loans on a forward-flow basis, which mitigates our balance sheet and liquidity risk. Since its public launch in May 2014, Square Loans has facilitated more than 3.1 million loans and advances, representing more than $25.8 billion in principal amount loaned or advanced. We launched Square Credit Card in 2023 to provide another lending option to qualified Square sellers. \n•\nInstant Transfer \nenables sellers to receive funds from their payments instantly or later that same day. Instant Transfer is an important tool for sellers that need faster access to their funds in order to better manage their cash flow or working capital. \n•\nSquare Checking \nprovides sellers with an account provided by our bank partner that is eligible for FDIC deposit insurance if certain conditions are met. Square Checking gives sellers instant access to their sales and the ability to immediately use those funds via a debit card (Square Debit Card), withdraw funds from an ATM, or transfer funds via ACH.\n•\nSquare Savings \nis an FDIC-insured, interest earning business savings account at Square Financial Services, with no monthly fees or minimums, designed to make cash flow management easier for sellers. With Square Savings, sellers can easily and automatically put aside a portion of their sales in their savings account while also organizing their money within folders, streamlining the process of saving funds for specific goals and priorities, such as quarterly tax obligations.\n11\nHardware\nSquare custom-designs hardware that can process all major card payment forms, including magnetic stripe, EMV chip, and NFC (contactless). Sellers are able to accept cards issued by Visa, Mastercard, American Express, Discover, JCB (in Japan), Interac Flash (in Canada), e-Money (in Japan), and eftpos (in Australia). Square hardware can be integrated with additional accessories such as cash drawers, receipt printers, scales, and barcode scanners to provide sellers with a comprehensive point-of-sale solution. Square's hardware portfolio includes the following:\n•\nSquare Register \nis an all-in-one offering that combines our hardware, point-of-sale software, and payments technology. The dedicated hardware consists of two screens: a seller display and a customer display with a built-in card reader that accepts tap, dip, and swipe payments. \n•\nSquare Terminal \nis a portable, all-in-one payments device and receipt printer to replace traditional keypad terminals. It accepts tap, dip, and swipe payments, enabling payments anywhere in the store. \n•\nSquare Stand\n enables an iPad to be used as a payment terminal or full point-of-sale solution. It features an integrated contactless and chip reader. \n•\nSquare Reader for contactless and chip \naccepts EMV chip cards and NFC payments, enabling acceptance via Apple Pay, Google Pay, and other mobile wallets. \n•\nSquare Reader \nfor magstripe enables swiped transactions of magnetic-stripe cards by connecting with an iOS or Android smartphone or tablet via the headphone jack or Lightning connector.\nCash App Ecosystem\nWith Cash App, we are building an ecosystem of financial products and services that helps consumers manage their money by making it more relatable, instantly available, and universally accessible. Cash App is primarily in the United States and has a diverse set of customers across demographics and regions. We use our inflows framework to assess the performance of Cash App across transacting actives, inflows per active, and the monetization rate on inflows. \nStrategic Priorities\nCash App sits at the intersection of three traditionally-distinct use cases: financial services, community based transactions (peer-to-peer payments) and commerce. Our approach for Cash App is to combine these three areas together in a unique manner to define a new product category and reinvent banking for our customers. With its bank partners, Cash App aims to become one of the top providers of banking services to households in the United States that earn up to $150,000 per year. To achieve this, we have a three-part strategy: \n(1) bank our base, (2) move upmarket by serving families, and (3) build the next-generation social bank.\n The majority of our near term focus and current investments are on Banking our Base, the first part of our strategy, where we see the most direct opportunity to drive meaningful top line growth for Cash App. As part of our strategy we plan to continue to build \ntrust\n with our customers and enhance our safety, security, and support for current and prospective customers.\n•\nBank Our Base:\n Cash App Card is generally customers’ entry point into a deeper banking relationship with Cash App. Beyond Cash App Card, we want to provide other banking services to our customers through our third-party bank partners. Cash App offers a compelling financial services offering to eligible customers that utilize direct deposit on a monthly basis, including an attractive savings rate, free in-network ATM withdrawals, free overdraft coverage up to a certain amount, and priority phone support. We plan to continue launching additional products and features to strengthen our value proposition and also to invest in incentives and marketing to drive awareness and adoption of direct deposit.\n12\n•\nMove Upmarket by Serving Families:\n Over the last few years, we made Cash App available to individuals aged 13 and older, first starting with Cash App Card and peer to peer transfers and then expanding into additional banking features. We’ve been focused on building trust and safety for teens and their parents by giving parents transparency into their family’s activity, allowing them to set permissions, and offering a robust set of oversight and controls. Through this effort, we’re positioning Cash App for long-term growth by serving families in the near-term and then growing with our teen customer base as they mature, their income grows, and they engage more deeply with the full suite of banking products and financial services that Cash App offers through our third-party bank partners.\n•\nBuild the Next-Generation Social Bank: \nWe are continuing to invest in building our social-driven feature set through areas like expanded profile functionality, sharing/recommendations, and exploring new ways for our customer base to transact together through financial services that have historically been disconnected from the community. A big part of this vision is linking Square’s local priority with Cash App. We want to enable more local commerce by connecting our two largest ecosystems, with Cash App customers buying from Square sellers. \nInflows and Outflows\nCustomers can use Cash App to inflow funds in a variety of ways, including by receiving money from another Cash App customer through the app’s core peer-to-peer transfer service, transferring money from a bank account, depositing mobile checks, adding physical cash at participating retailers, receiving a recurring paycheck by direct deposit, and through other inflow channels. These funds can then be sent to another customer through the app, spent anywhere that accepts Visa cards or Cash App Pay, withdrawn from an ATM using the Cash App Card, invested in stocks or exchange-traded funds (“ETFs”), used to buy bitcoin, or transferred to a bank account (either instantly for a fee or for free in one to three days). \nTrust\nWe serve our customers through a broad suite of financial services, and earning their trust is a key factor in how we can deepen our financial relationship with them. The breadth of our financial service offerings allows us to increase our share of wallet as well as expand our customer base to serve a wider variety of demographics. We develop trust with customers by offering reliable, easy, and secure access to their accounts and convenient support. We also adapt the amount of funds a customer can bring in through specific channels based on risk profile, and as we improve our understanding of a customer’s identity. We believe building and maintaining deep trust with our customers will drive greater product adoption and increased inflows into our ecosystem.\nProduct Categories\nBanking Services\nThrough third-party bank partners, we offer a growing number of banking services that are designed to make it easier for customers to manage cash flow and provide them with fast access to funds. \n•\nCash App Card\n is a debit card, issued by our bank partner, and linked directly to a customer’s Cash App balance. Customers can order a Cash App Card for free and use it anywhere that accepts Visa cards to make purchases, drawing down from the funds stored in their Cash App balance. Cash App earns interchange fees when individuals make purchases with their Cash App Card. Customers can select new or promotional Cash App Card designs for a fee, and can also withdraw funds from an ATM using the Cash App Card. Customers can also purchase and send gift cards at specific merchants to other customers, and recipients can spend them with their Cash App Card.\n•\nDirect deposit\n capabilities, in alliance with our bank partner and system processor, allow customers to receive their recurring paycheck, tax refund, or government disbursement into their Cash App account, which they can then use to send, spend, store, or invest.\n•\nSavings\n allows customers to hold a separate savings balance at our bank partner, and easily set and track towards financial goals. Customers can add money to Savings using their Cash App balance, a linked debit card, or through Round Ups on purchases with Cash App Card.\n13\n•\nCash Offers (formerly Boost)\n is a free and instant rewards program that offers customers discounts at specific businesses (e.g., 10% off a purchase on DoorDash) or at certain business types (e.g., grocery stores). Customers can select the Cash Offers they want to apply to their Cash App Card, and the discount is instantly applied to their Cash App balance for eligible transactions. Some Cash Offers are selected and funded by Cash App, while others are funded by our partners. Costs related to the Cash App rewards program that are funded by Cash App are recognized as reductions to revenue.\n•\nCash App Borrow: \nWe believe credit is an area within our financial services offerings where we can provide simple, fair, and accessible products that promote financial health. Cash App Borrow, our first credit product for consumers, allows customers to access short-term loans for a small fee. The product offers eligible Cash App customers up to $1,000 at any one time that they can pay back in scheduled installments or as a percentage of what they receive into Cash App. We determine a Cash App customer’s eligibility based on prudent risk management by using our unique data set that includes a customer’s inflows and engagement on Cash App. The average Cash App Borrow loan was repaid in less than four weeks in 2024.\nBNPL Platform\nCash App is focused on driving greater commerce between consumers and merchants. Our BNPL platform facilitates commerce between retail merchants and consumers by allowing its retail merchant clients to offer their customers the ability to buy goods and services on a BNPL basis. Our BNPL platform provides consumers the ability to get desired items now but pay for them later, while simultaneously helping merchants increase sales and order values. We have a range of products across our BNPL platform.\n•\nPay in 4:\n Through the use of our BNPL platform, consumers can split their purchases into generally three or four installments, typically due in two-week increments, without paying fees (if payments are made on time). We pay retail merchants the full order value up front (less a percentage fee) and assume the risk of non-payment from the consumer.\n•\nMonthly Payment Solution:\n We also offer the ability for consumers to pay for larger transaction sizes over a six- or twelve-month period using a monthly payment option. The structure of the product includes no late fees and no compounding interest with a cap on total interest owed. Similar to Pay in 4, we pay retail merchants the full order value up front (less a percentage fee) and assume the risk of non-payment from the consumer.\n•\nAdvertising and affiliate:\n Our BNPL platform generates hundreds of millions of leads each year for merchants and has channeled this demand towards scaling an ads and affiliate program for its merchants: for affiliate relationships, we receive a commission when a consumer begins their shopping journey in the Afterpay App and makes a purchase. We may also receive digital advertising revenue based on clicks to a merchant site from the Afterpay App as well as flat fees for premium ad placements.\n•\nShop directory:\n We operate an online shop directory, which allows consumers to search by product category for stores that offer Afterpay as a payment option.\n•\nAfterpay Card, Afterpay Plus Card:\n We offer two in-store cards that allow consumers to pay in 4 for in-person transactions at a merchant’s point of sale. The Afterpay Card allows consumers to shop in-store at Afterpay merchants and is free for the consumer. The Afterpay Plus Card is currently available to select Afterpay consumers in certain regions for a monthly fee and allows them to shop in-store anywhere that Apple Pay or Google Pay is accepted.\nCommunity\nPeer-to-peer payments form the basis of our Community development pillar because customers engage in financial transactions with other members of the Cash App community. When customers use peer-to-peer, they are inviting their friends, family, and coworkers to download Cash App so that they can send each other money. Peer-to-peer becomes more useful for our customers as their communities expand, so our customers are naturally incentivized to bring more people into their networks. We offer the peer-to-peer service to our Cash App customers for free when a linked debit account is used to fund a transaction, as we consider peer-to-peer to be a marketing tool to encourage Cash App usage. We charge a fee to the sender when transactions are funded using a credit card, and a fee to the recipient if it is a business account.\n14\nInstant Deposit was the first feature we started monetizing on Cash App. Customers are able to instantly transfer funds from Cash App to a bank account for a small fee. We believe our customer base values fast access to funds, and this speed is one example of how we differentiate our ecosystem.\nCash App Pay\nCash App Pay is a simple, mobile-friendly way for Cash App customers to pay at merchants across online and in-person channels. Cash App Pay allows customers to seamlessly pay with a Cash App account at participating merchants like DoorDash, Lyft, Google Play Store, Temu, and many more, including thousands of Square sellers. For in-person and desktop web transactions customers simply scan a merchant’s QR code at checkout. On mobile devices, customers can click the Cash App Pay button at checkout for a payment process that is fast, elegantly designed, and secure.\nBitcoin\nWe have a simple bitcoin exchange and custody solution that provides customers with an onramp and offramp to buy and sell bitcoin with Cash App for as little as $1 and a custodial account to store it securely without needing to keep track of any private keys. Our solution offers features that allow customers to complete auto buys and custom limit orders, as well as direct deposit to auto-convert their paycheck into bitcoin and earn instant bitcoin rewards on Cash App Card purchases. \nWe have also focused on payments through bitcoin. Given our network scale, we believe Cash App can help bitcoin evolve beyond an asset class and enable transactional utility, which is why we launched our offering in 2018 with the ability to deposit and withdraw bitcoin across the blockchain. We have since added the ability for customers to send bitcoin across the Cash App network to any phone number or $Cashtag, creating an easy-to-use off-chain network for bitcoin payments that settles instantly between transacting actives. We also allow U.S. actives to send and receive bitcoin to/from anyone with a compatible wallet via the Lightning Network. The Lightning Network is a second layer technology applied to the bitcoin blockchain that enables faster transactions with little to no fees.\nTax Preparation\nCash App Taxes provides a seamless, mobile-first solution for consumers to file their taxes for free.\nStock Brokerage \nCustomers can also use Cash App to invest their funds for free in U.S. listed stocks and ETFs. We believe this makes investing more accessible by giving customers access to hundreds of listed stocks and ETFs that they can purchase using their Cash App balance or a linked debit card for as little as $1. Once the order is filled, all investments are viewable through the stocks applet.\nBusiness Accounts\n    \nCash App allows business accounts to collect payments for their business by accepting peer-to-peer transactions for a fee, while allowing higher weekly limits and providing relevant tax reporting forms.\nSales and Marketing\nSquare Ecosystem\nThe Square ecosystem has a strong brand affinity among its sellers. Our Net Promoter Score (“NPS”) has averaged 53 over the past four quarters, which is notably higher than the average score for banking providers. Our high NPS means Square sellers recommend our services to others, which we believe strengthens the Square brand and helps drive efficient customer acquisition. \nDirect marketing, online and offline, has also been an effective customer acquisition channel. These tactics include online search engine optimization and marketing, online display advertising, direct mail campaigns, direct response television advertising, mobile advertising, and affiliate and seller referral programs. \n15\nOur direct sales and account management teams also contribute to the acquisition and support of larger sellers. Historically, our sales team was primarily focused on converting inbound leads from interest generated through other acquisition channels, and in more recent years, we have built out an outbound sales team focused on outreach to new prospective sellers. These outbound sales were traditionally done remotely via telephone. In the fourth quarter of 2024, we began hiring a field sales team to focus exclusively on in-person seller outreach to further increase acquisition of larger sellers.\nOur direct, ongoing interactions with our sellers help us tailor offerings to them, at scale, and in the context of their usage. We use various scalable communication channels such as email marketing, in-product notifications and messaging, and Square Communities, our online forum for sellers, to increase the awareness and usage of our products and services with little incremental sales and marketing expense. Our customer support team also helps increase awareness and usage of our products as part of helping sellers address inquiries and issues.\nIn addition to direct channels, we work with third-party developers and other partners who offer our solutions to their customers. Partners expand our addressable market to sellers with individualized or industry-specific needs. Through the Square App Marketplace, Square partners are able to expand their own addressable market by reaching the millions of sellers using Square. As of December 31, 2024, Square had more than 900 managed partners connected to its platform.\nCash App Ecosystem\nCash App has also developed a strong brand, which can be traced back to our compelling features, self-serve experience, unique design, and engaging marketing. \nPeer-to-peer transactions serve as the primary acquisition channel for Cash App. Peer-to-peer transactions have powerful network effects as every time a customer sends or requests money, Cash App can potentially acquire a new customer or re-engage an existing customer. We have enhanced the efficiency of peer-to-peer transfers by streamlining the onboarding process for Cash App, enabling customers to sign up in minutes. We offer the peer-to-peer service to our Cash App customers for free, and we consider it to be a marketing tool to encourage the usage of Cash App. We do not generate revenue on the majority of peer-to-peer transactions and for these transactions we characterize card issuance costs, peer-to-peer costs, and risk loss as a sales and marketing expense. \nCash App also uses paid marketing, including referrals, advertising spend, partnerships, and social media campaigns, to expand its network, as these programs help reach new customers, enhance its brand, and improve retention among existing customers. Cash App has a dedicated sales team focused on products like BNPL, Monthly Payment Solution, Cash App Pay, and other new and emerging products. This team builds relationships with several of the largest and most well known merchants in the US and relevant international markets for BNPL.\nAdditionally, we see the launch and advertising of new Cash App features as an important way to attract new customers and engage existing customers. Features such as Cash App Card and Offers rewards, bitcoin buying and selling, investing in stocks and ETFs, Cash App Pay, and a tax preparation service enhance Cash App’s utility for customers and provide reasons for consumers to try Cash App. \nProduct Development and Technology\nWe design both our Square and Cash App products and services to be cohesive, fast, self-serve, and elegant, and product development is a cross-functional effort combining individuals from product management, engineering, data science, analytics, design, and product marketing. Our products and services are platform-agnostic with most supporting iOS, Android, and web. We frequently update our software products and have a rapid software release schedule with improvements deployed regularly. Our services are built on a scalable technology platform, and we place a strong emphasis on data analytics and machine learning to maximize the efficacy, efficiency, and scalability of our services. \nIn our Square ecosystem, this technology platform enables us to capture and analyze billions of transactions per year and automate risk assessment for more than 99.95% of all transactions. Our hardware is designed and developed in-house, and we contract with third-party manufacturers for production.\n16\nOur Competition\nSquare Ecosystem\nThe markets in which our Square ecosystem operates are competitive and evolving. Our competitors range from large, well-established vendors to smaller, earlier-stage companies. We seek to differentiate ourselves from competitors primarily on the basis of our extensive commerce ecosystem and our focus on building remarkable products and services that are cohesive, fast, self-serve, and elegant. In addition, we differentiate ourselves by offering transparent pricing, no long-term contracts, and our ability to innovate and reshape the industries we operate in to expand access to traditionally unserved or underserved sellers. With respect to each of these factors, we believe that we compare favorably to our competitors. Competitors that overlap with certain functions and features that we provide include:\n•\nBusiness software providers such as those that provide point of sale, website building, inventory management, employee management, customer relationship management invoicing, and appointment booking solutions;\n•\nPayment terminal vendors;\n•\nMerchant acquirers;\n•\nBanks that provide payment processing, checking, savings, loans, and payroll;\n•\nPen and paper, manual processes, and paper currency;\n•\nPayroll processors; and\n•\nEstablished or new alternative lenders.\nCash App Ecosystem\nCash App competes with other companies in peer-to-peer payments, debit and prepaid cards, credit card rewards, stock trading, tax filing, digital wallet, bitcoin exchanges, BNPL providers, and shopping and consumer demand generation. Our competitors include money transfer apps, prepaid debit card offerings, brokerage firms, tax firms, financial technology apps, banks, and crypto trading services.\nWe compete primarily on our differentiated lifestyle brand, the breadth of our network, the range of products in our ecosystem, and the simplicity and quality of our customer experience. We invest in brand, design, and technology to keep our products fast and simple, while also improving and expanding our features.\nIntellectual Property\nWe seek to protect our intellectual property rights by relying on a combination of federal, state, and common law rights in the United States and other countries, as well as on contractual measures. It is our practice to enter into confidentiality, non-disclosure, and invention assignment agreements with our employees and contractors, and into confidentiality and non-disclosure agreements with other third parties, in order to limit access to, and disclosure and use of, our confidential information and proprietary technology. In addition to these contractual measures, we also rely on a combination of trademarks, trade dress, copyrights, registered domain names, trade secrets, and patent rights to help protect our brand and our other intellectual property. Additionally, we regularly contribute software source code under open source and other permissive licenses and have made other technology we developed available under such licenses, and we include open source software in our products.\nWe have developed a patent program and strategy to identify, apply for, and secure patents for innovative aspects of our products, services, and technologies where appropriate. We also actively pursue registration of our trademarks, logos, service marks, trade dress, and domain names in the United States and in other jurisdictions. We intend to file additional patent applications as we continue to innovate through our research and development efforts and to pursue additional patent protection to the extent we deem it beneficial and cost-effective, including acquiring patent assets or licensing patent rights from third parties. In addition, we participate in a number of industry organizations that facilitate patent pools or non-assertion commitments, such as the Cryptocurrency Open Patent Alliance that we co-founded, LOT Network, and Open Invention Network.\n17\nGovernment Regulation\nForeign and domestic legal requirements apply to many key aspects of our business. Any actual or perceived failure to comply with these requirements may result in, among other things, revocation of required licenses or registrations, loss of approved status, private litigation, regulatory or governmental investigations, administrative enforcement actions, sanctions, civil and criminal liability, monetary penalties, and constraints on our ability to continue to operate. It is also possible that current or future laws or regulations could be interpreted or applied in a manner that would prohibit, alter, or impair our existing or planned products and services, or that could require costly, time-consuming, or otherwise burdensome compliance measures from us.\nPayments Regulation\nVarious laws and regulations govern the payments industry in the United States and globally. For example, certain jurisdictions in the United States require a license to offer money transmission services, such as Cash App’s peer-to-peer payments, and we maintain a license in each of those jurisdictions and comply with new license requirements as they arise. We are also registered as a “Money Services Business” with the U.S. Department of Treasury’s Financial Crimes Enforcement Network (\"FinCEN\"). These licenses and registrations subject us, among other things, to record-keeping requirements, reporting requirements, bonding requirements, limitations on the investment of customer funds, and examination by state and federal regulatory agencies.\nOutside the United States, we provide localized versions of some of our services to customers, including through various foreign subsidiaries. The activities of those non-U.S. entities are, or may be, supervised by regulatory authorities in the jurisdictions in which they operate. For instance, we hold an Australian Financial Services License issued by the Australian Securities and Investments Commission to provide non-cash payments in Australia, and we are licensed as an Electronic Money Institution to provide payments services and electronic money in the United Kingdom by the Financial Conduct Authority and in the European Union by the Central Bank of Ireland.\nOur payments services may be or become subject to regulation by other authorities, and the laws and regulations applicable to the payments industry in any given jurisdiction are always subject to interpretation and change.\nConsumer Protection\nThe Consumer Financial Protection Bureau and other federal, local, state, and foreign regulatory and law enforcement agencies regulate financial products and enforce consumer protection laws, including those applicable to credit, deposit, and payments services, and other similar services. These agencies have broad consumer protection mandates, and they promulgate, interpret, and enforce rules and regulations that affect our business.\nAnti-Money Laundering, Anti-Corruption, and Sanctions\nWe are subject to anti-money laundering (\"AML\"), anti-corruption, and economic and trade sanctions laws and regulations in the United States and other jurisdictions in which we operate. The anti-corruption laws, such as the U.S. Foreign Corrupt Practices Act and the U.K. Bribery Act, generally prohibit companies from making or offering improper payments to foreign government officials and political figures for the purpose of obtaining or retaining business or to gain an unfair business advantage. Economic and trade sanctions programs that are administered by the U.S. Department of the Treasury’s Office of Foreign Assets Controls and equivalent applicable foreign authorities prohibit or restrict transactions to or from, or dealings with, specified countries, governments, individuals and entities, including narcotics traffickers and terrorists or terrorist organizations. We have implemented compliance programs and controls designed to comply with the laws and regulations to which we are subject.\nBank Regulation\nWe obtained approval from the Federal Deposit Insurance Corporation (\"FDIC\") and the Utah Department of Financial Institutions to open an ILC. The opening of Square Financial Services, Inc., our ILC, in March 2021 subjects us to direct state and federal regulatory supervision and requires compliance with applicable banking regulations. Our partnerships with FDIC-insured financial institutions to offer certain banking products to customers also subject us to certain federal banking regulations. \n18\nLending Regulation\nVarious laws and regulations govern lending in the United States and internationally. In the United States, Square Capital, LLC holds and maintains lending and collections licenses with state regulators to support lending products offered across the United States. Afterpay US Services, LLC holds and maintains lending licenses to support its product offerings. These lending licenses subject us to the supervision and examination authority of state regulators, and our partnerships with FDIC-insured financial institutions to offer certain lending products to customers subjects us to federal regulation and supervision.\nOutside the United States, we provide localized versions of some of our lending services to customers, including through our various foreign subsidiaries. The activities of our foreign subsidiaries are, or may be, supervised by regulatory authorities in the jurisdictions in which they operate. For example, we hold an Australian Credit Licence issued by the Australian Securities and Investments Commission.\nOur lending services have been and may continue to be subject to regulation by other applicable authorities or jurisdictions, and the laws and regulations applicable to the lending industry in any given jurisdiction are always subject to interpretation and change.\nBroker-Dealer Regulation\nOur subsidiary, Cash App Investing LLC (\"Cash App Investing\"), operates as a broker-dealer and is therefore registered with the Securities and Exchange Commission (\"SEC\") and a member of the Financial Industry Regulatory Authority (\"FINRA\"). As a broker-dealer, Cash App Investing is subject to SEC and FINRA rules and regulations concerning matters that include, without limitation, how it markets its services, handles customer assets, keeps records, and reports to the SEC and FINRA. Cash App Investing is also registered in each state where it conducts business, and subject to those states’ securities laws and regulations. \nVirtual Currency Regulation\nWe are subject to certain licensing and supervisory frameworks as a result of our Cash App offering, through which customers can use their stored funds to buy, hold and sell bitcoin, and transfer bitcoin to and from Cash App. We currently hold a New York State BitLicense and a Virtual Currency Business License in Louisiana. The laws and regulations applicable to virtual currency are evolving and subject to interpretation and change. Therefore, our current and future virtual currency services may be or become subject to additional licensing, regulatory requirements and oversight by other state and federal authorities.\nProtection and Use of Information\nWe collect and use a wide variety of information for various purposes in our business, including to help ensure the integrity of our services and to provide features and functionality to our customers. This aspect of our business, including the collection, use, disclosure, and protection of the information we acquire from our own services as well as from third-party sources, is subject to laws and regulations in the United States, the European Union, and elsewhere. Accordingly, we publish our privacy policies and terms of service, which describe our practices concerning the use, transmission, and disclosure of information. As our business continues to expand in the United States and worldwide, and as laws and regulations continue to be passed and their interpretations continue to evolve in numerous jurisdictions, additional laws and regulations may become relevant to us.\nCommunications Regulation\nWe send texts, emails, and other communications in a variety of contexts, such as when providing digital receipts and marketing. Communications laws and regulations, including those promulgated by the Federal Communications Commission, apply to certain aspects of this activity in the United States and elsewhere.\n19\nAdditional Developments\nVarious legislative bodies and regulatory agencies in the United States and elsewhere in our international markets continue to examine a wide variety of issues that could impact our business, including privacy, data protection, information security, virtual currencies, identity theft, tax, marketing, and labor and employment matters. As our business continues to develop and expand, additional laws, rules and regulations may become relevant.\nSeasonality\nHistorically, transaction-based revenue for our Square ecosystem has been strongest in our fourth quarter and weakest in our first quarter, as our sellers typically generate additional GPV during the holiday season. Subscription and services-based revenue generally demonstrates less seasonality than transaction-based revenue. Hardware revenue generally demonstrates less seasonality than transaction-based revenue, with most fluctuations tied to periodic product launches, promotions, or other arrangements with our retail partners.\nHistorically, our Cash App ecosystem has experienced improvements in revenue, gross profit, and inflows related to the distribution of government funds as customers have deposited more funds into Cash App during these times, including during the first quarter when U.S. tax refunds are typically distributed. Certain products within Cash App may also experience stronger fourth quarters and weaker first quarters, such as our BNPL platform, which typically generates additional revenue and gross profit during the holiday season. Typical seasonality trends for the Cash App ecosystem are also impacted by bitcoin revenue, which is driven by customer demand and the current market price of bitcoin, and as such, may not be indicative of future performance and skew typical seasonality trends in the Cash App ecosystem.\nHuman Capital \nOur employees are a driving force behind our purpose of economic empowerment. Attracting, developing, and retaining top talent remain a focus in the development of our human capital programs. As of December 31, 2024, we had 11,372 full-time employees worldwide with 2,627 full-time employees outside the US. We also engage temporary employees and consultants as needed to support our operations. In November 2023, we announced we would implement an absolute cap of 12,000 on the number of employees we have at our company. We expect to keep this cap in place until we believe the growth of the business has meaningfully outpaced the growth of our company.\nWe have a purpose-driven culture, with a focus on employee input and well-being, which we believe enables us to attract and retain exceptional talent. We offer learning and development programs for all employees, as well as a robust manager training program. Employees have the opportunity to actively voice their questions and thoughts through many internal channels, including our company townhall meetings and bi-annual employee engagement surveys. Our distributed work model means that we no longer have a designated headquarters location and, for the vast majority of roles, employees have the flexibility to work within or outside a Block office space. Our distributed work model has unlocked opportunities to hire and retain talent in more locations, as we can hire employees in locations where we do not have office space, and employees can continue to work for us if they need or want to relocate.\nA key focus of our human capital management approach is our commitment to promoting inclusion and fairness in our workplace. We consider it a business requirement to build a company that reflects the customers and communities we serve. In 2024, we established company-wide manager expectations, including their responsibility to break down silos and hierarchy, maintain physiological safety and seek divergent perspectives. Across our employee programs, we have embedded policies and practices to ensure that hiring, promotion and compensation decisions are based on merit alone.\nFrom a total rewards perspective, Block offers a competitive compensation and benefits package, which is reviewed and updated each year. Our annual compensation planning coincides with our feedback cycle during which employees and managers have performance conversations to facilitate learning and career development. As part of our compensation review program, pay equity analyses are conducted annually.\n20\nCorporate Information\n    \nBlock was incorporated in Delaware in June 2009. In 2020, we adopted a distributed work model and we no longer have a designated headquarters location. Our principal executive office, which we are required to identify under Securities and Exchange Commission (\"SEC\") rules, is 1955 Broadway, Suite 600 Oakland, CA 94612. Our telephone number is (415) 375-3176. Our website is located at www.block.xyz, and our investor relations website is located at investors.block.xyz. The information contained in, or accessible through, our website (including any referenced reports or documents) is not part of or incorporated into, this Annual Report on Form 10-K.\nWe use various trademarks and trade names in our business, including “Block,” “Square,” “Cash App” and “Afterpay,” which we have registered in the United States and in various other countries. This Annual Report on Form 10-K also contains trademarks and trade names of other businesses that are the property of their respective holders. We have omitted the ® and ™ designations, as applicable, for the trademarks we name in this Annual Report on Form 10-K.\nAvailable Information\nCopies of our Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, Current Reports on Form 8-K, and amendments to these reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934, as amended (Exchange Act), are available, free of charge, on our investor relations website as soon as reasonably practicable after we electronically file or furnish such material with the SEC. The SEC also maintains a website that contains our SEC filings. The address of the site is www.sec.gov.\nWe webcast our earnings calls and certain events we participate in or host with members of the investment community on our investor relations website. Additionally, we provide notifications of news or announcements regarding our financial performance, including SEC filings, investor events, press and earnings releases, and blogs as part of our investor relations website. We have used, and intend to continue to use, our investor relations website, as well as the X (formerly known as Twitter) accounts @Blocks and @BlockIR, as means of disclosing material non-public information and for complying with our disclosure obligations under Regulation FD. Further corporate governance information, including our board committee charters, code of business conduct and ethics, and corporate governance guidelines, is also available on our investor relations website under the heading “Governance Documents.” The contents of our websites are not intended to be incorporated by reference into this Annual Report on Form 10-K or in any other report or document we file with the SEC, and any references to our websites are intended to be inactive textual references only.\n21",
  "item7": "ITEM 7. MANAGEMENT'S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThis management's discussion and analysis provides a review of the results of operations, key operating metrics and non-GAAP financial measures, and liquidity and capital resources of Block, Inc. on a historical basis and outlines the factors that have affected recent earnings, as well as those factors that may affect future earnings. The following discussion and analysis should be read in conjunction with the consolidated financial statements and the notes thereto included elsewhere in this Annual Report on Form 10-K (\"Form 10-K\"). \nThis section of this Form 10-K generally discusses fiscal 2024 compared to fiscal 2023. The comparison of the fiscal 2023 results with the fiscal 2022 results that are not included in this Form 10-K can be found in the \"Management's Discussion and Analysis Results of Operations\" section in the Company's fiscal 2023 Annual Report within Part II, Item 7 of Form 10-K, filed on February 22, 2024.\nThe statements in this discussion regarding our expectations of our future performance, liquidity, and capital resources; our plans, estimates, beliefs, and expectations that involve risks and uncertainties; and other non-historical statements in this discussion are forward-looking statements. These forward-looking statements are subject to numerous risks and uncertainties, including, but not limited to, the risks and uncertainties described under Item 1A. Risk Factors and elsewhere in this Form 10-K. Our actual results may differ materially from those contained in or implied by any forward-looking statements.\nOverview\nWe launched the Square ecosystem in February 2009 to enable businesses (\"sellers\") to accept card payments, an important capability that was previously inaccessible to many businesses. We have expanded to provide sellers additional products and services and to give them access to a cohesive ecosystem of tools to help them manage and grow their businesses. Similarly, with Cash App, we have built an ecosystem of financial products and services to help individuals manage their money. In January 2022, we completed the acquisition of Afterpay, a buy now, pay later (\"BNPL\") platform that facilitates commerce between retail merchants and consumers by allowing retail merchant clients to offer their customers the ability to buy goods and services on a BNPL basis. In addition, our nascent businesses include TIDAL and two bitcoin businesses, Bitkey and Proto.\nWe delivered strong growth across our primary ecosystems in 2024, with gross profit of $8.9 billion, up 18% year over year. Cash App generated gross profit of $5.2 billion in 2024, up 21% year over year. Performance was driven by growth in inflows per active as we execute on our Bank Our Base strategy, which prioritizes engaging customers with more products across our ecosystem and increasing paycheck deposit actives. Square generated gross profit of $3.6 billion in 2024, up 15% year over year, as we continued to increase product velocity and optimize our go-to-market strategies.\nIn 2024, operating income was $892.3 million and Adjusted Operating Income was $1.6 billion, compared to an operating loss of $278.8 million and Adjusted Operating Income of $351.4 million in 2023. For the same period, net income attributable to common stockholders was $2.9 billion compared to $9.8 million, and Adjusted EBITDA was $3.0 billion, an increase of 69% year over year. Net income for 2024 and 2023 included a gain of $420.9 million and $207.1 million, respectively, from the remeasurement of our bitcoin investment. Additionally, as a result of our improved profitability in the United States, we released our valuation allowance associated with certain federal and state deferred tax assets, as well as recognized deferred tax assets as part of internal legal entity restructuring efforts, which resulted in one-time benefits to net income for 2024 of $1.9 billion. These one-time tax benefits had a corresponding impact of $3.10 and $3.00 per share on our basic and diluted net income per share, respectively, for the year ended December 31, 2024.\nRefer to the \nKey Operating Metrics and Non-GAAP Financial Measures\n section below for reconciliations of non-GAAP financial measures to their nearest generally accepted accounting principles (\"GAAP\") equivalents.\n66\nStarting in 2023, we sharpened our focus on our organizational structure and expenditures with a view to identifying areas where we can be more cost efficient as we focus on disciplined growth and pursuing cost efficiencies. In 2023, we also announced we would implement an absolute cap of 12,000 on the number of employees we have at our company, which we have achieved in 2024, and we plan to continue to operate below this cap through a combination of performance management, centralization of teams and functions to reduce duplication, and prioritization of our scope. In 2024, we continued to make progress on cost efficiency goals and we expect to continue these efforts, including implementing greater expense discipline and reassessing certain contractual vendor arrangements. We may continue to incur expenses, including restructuring costs, in the short term to implement these initiatives. We continue to realize benefits related to our focus on disciplined growth and cost efficiencies and we expect to continue to benefit from these actions in future periods.\nDuring the second quarter of 2024, we issued $2.0 billion in aggregate principal amount of senior unsecured notes due 2032 (\"2032 Senior Notes\"). We ended 2024 with $10.7 billion in available liquidity, with $9.9 billion in cash, cash equivalents, restricted cash, and investments in marketable debt securities, as well as an undrawn amount of $775.0 million available under our revolving credit facility. This represents an increase of $3.0 billion from the end of 2023.\nOn October 26, 2023, our board of directors authorized the repurchase of up to $1 billion of the Company’s Class A common stock. On July 25, 2024, our board of directors authorized an increase to this share repurchase program to repurchase up to an additional $3 billion of our Class A common stock, for a total overall authorization of $4 billion. The goal of the program is to return capital to shareholders. The timing and amount of shares repurchased will depend on a variety of factors, including the stock price, business and market conditions, corporate and regulatory requirements, alternative investment opportunities, acquisition opportunities, and other factors. As of December 31, 2024, we have repurchased $1.3 billion of our Class A common stock under the program, of which $1.2 billion was purchased in 2024.\nComponents of Results of Operations \nRevenue \nTransaction-based Revenue\nWe charge our sellers a transaction fee that is generally calculated based on a percentage of the total transaction amount processed. We also selectively offer custom pricing for certain larger sellers. Transaction-based revenue also includes amounts we charge our Cash App customers for peer-to-peer transactions to business accounts and payments sent from a credit card.\nSubscription and Services-based Revenue\nSubscription and services-based revenue is primarily comprised of revenue we generate from Cash App, Square Loans (formerly known as Square Capital), our BNPL platform, TIDAL, and various other software as a service (“SaaS”) products that we offer through Square. Cash App subscription and services-based revenue is primarily comprised of transaction fees from Cash App Instant Deposit, Cash App Card, bitcoin withdrawal fees, and other Cash App financial services offerings. Our other SaaS products include subscription fees on our vertical software solutions (including Square for Restaurants, Square Appointments, and Square for Retail), Customer Engagement products (including Square Loyalty, Square Marketing, Square Gift Cards), staff management products (including Square Team Management and Square Payroll), website hosting and domain name registration services, and other products.\nInstant Deposit is a functionality within the Cash App and our managed payment solutions that enables customers, including individuals and sellers, to instantly deposit funds into their bank accounts. \nCash App Card offers Cash App customers the ability to use their stored funds via a Visa prepaid card that is linked to the balance the customer stores in Cash App. We charge the customer a per transaction fee when they instantly deposit funds to their bank account or withdraw funds from an ATM. We also earn interchange fees when a Cash App Card is used to make a purchase. These transaction and interchange fees are treated as revenue when charged.\n67\nSquare Loans originates loans to sellers that are generally repaid through withholding a percentage of the collections of the seller's receivables processed by us or a specified monthly amount. In April 2021, we began originating loans in the U.S. through our wholly-owned subsidiary bank, Square Financial Services. We also originate loans to the customers of certain sellers, which are generally repaid via ACH. For some of the loans, it is our intention to sell the rights, title, and interest to third-party investors for an upfront fee. We are retained by the third-party investors to service the loans and earn a servicing fee for facilitating the repayment of these loans through our payments solutions. Certain loans, for which we have the intention and ability to hold through maturity, are not immediately sold to third-party investors, in which case, interest and fees earned are recognized as revenue using the effective interest method.\nCash App Borrow, the first credit product for Cash App customers, allows customers to access short-term loans for a small fee. The loans are repaid at the end of the loan term and customers may elect to prepay all or a part of the outstanding balance. If the outstanding balance is not paid when due, late fees in the form of interest may be charged. The short-term loans are facilitated through a partnership with an industrial bank. The loans are originated by the bank partner, from whom the Company purchases the loans obtaining all rights, title, and interest. Net amounts paid to the bank are recorded as the cost of the loans purchased, and amounts collected in excess of the carrying value are recognized as revenue over the life of the loans.\nRevenue from our BNPL platform includes fees generated from consumer receivables, late fees, and certain affiliate and advertising fees. Through the use of our BNPL platform, consumers can pay for their purchases over time by splitting their purchase price generally into three or four installments, typically due in two-week increments, without paying fees (if payments are made on time). For the majority of our BNPL products, we do not charge consumers interest or fees, other than late fees, which may be charged in certain regions as an incentive to encourage consumers to pay their outstanding balances as and when they fall due. We also offer the ability for consumers to pay for larger transaction sizes over a six- or twelve-month period using a monthly payment option, which includes no late fees and no compounding interest with a cap on total interest owed. For some of the loans, it is our intention to sell the rights, title, and interest to a third-party investor for an upfront fee. We are retained by the third-party investor to service the loans and earn a servicing fee for facilitating the repayment of these loans through our payments solutions.\nTIDAL primarily generates revenue from subscriptions to customers, and such subscriptions allow access to the song library, video library, and improved sound quality. Customers can subscribe to services directly from the TIDAL website or through the Apple store. For both subscription channels, we charge customers a monthly fee for those subscription services.\nHardware Revenue\nHardware revenue includes revenue from sales of magstripe readers, contactless and chip readers, Square Stand, Square Register, Square Terminal, and third-party peripherals. Third-party peripherals include cash drawers, receipt printers, scales, and barcode scanners, all of which can be integrated with Square Stand, Square Register, or Square Terminal to provide a comprehensive point-of-sale solution. \nBitcoin Revenue\nOur Cash App customers have the ability to purchase bitcoin, a cryptocurrency. We recognize revenue when customers purchase bitcoin and it is transferred to the customer's account. We purchase bitcoin from private broker dealers or from Cash App customers and apply a small margin before selling it to our customers. The sale amounts received from our customers are recorded as revenue on a gross basis and the associated bitcoin cost as cost of revenues, as we are the principal in the bitcoin sale transaction. Bitcoin revenue may fluctuate as a result of changes in customer demand or the market price of bitcoin. \nCost of Revenue\nTransaction-based Costs\nTransaction-based costs consist primarily of interchange and assessment fees, processing fees, and bank settlement fees paid to third-party payment processors and financial institutions.\n68\nSubscription and Services-based Costs\nSubscription and services-based costs consist primarily of processing and partnership fees related to Cash App including Instant Deposit and Cash App Card, and our BNPL platform, as well as costs associated with TIDAL.\nHardware Costs\nHardware costs consist primarily of product costs associated with magstripe readers, contactless and chip readers, Square Stand, Square Register, Square Terminal, and third-party peripherals. Product costs include manufacturing-related overhead and personnel-related costs, certain royalties, packaging, and fulfillment costs. Hardware is sold primarily as a means to grow our transaction-based revenue and, as a result, generating positive gross margins from hardware sales is not the primary goal of the hardware business.\nBitcoin Costs\nBitcoin costs consist of the amounts we pay to purchase bitcoin that is sold to customers. These costs fluctuate in line with bitcoin revenue. \nAmortization of Acquired Technology Assets\nAmortization of acquired technology assets is primarily comprised of amortization related to the acquired technology assets from the acquisition of Afterpay.\nOperating Expenses\nOperating expenses consist of product development; sales and marketing; general and administrative expenses; transaction, loan, and consumer receivable losses; bitcoin impairment losses; and amortization of customer and other acquired intangible assets. For product development and general and administrative expenses, the largest single component is personnel-related expenses, including salaries, commissions and bonuses, employee benefit costs, and share-based compensation. In the case of sales and marketing expenses, a significant portion is related to the Cash App peer-to-peer transactions and Cash App Card issuance costs, in addition to paid advertising and personnel-related expenses. Operating expenses also include allocated overhead costs for facilities, human resources, and IT.\nProduct Development Expenses\nProduct development expenses currently represent the largest component of our operating expenses and consist primarily of expenses related to our engineering, data science, and design personnel; fees and supply costs related to maintenance at third-party data center facilities; hardware related development and tooling costs; software and cloud computing infrastructure fees; and fees for software licenses, consulting, legal, and other services that are directly related to growing and maintaining our portfolio of products and services. Additionally, product development expenses include the depreciation of product-related infrastructure and tools, including data center equipment, internally developed software, and computer equipment. We continue to focus our product development efforts on adding new features and expanding our apps, and on enhancing the functionality and ease of use of our offerings. Our ability to realize returns on these investments is substantially dependent upon our ability to successfully address current and emerging requirements of sellers, buyers, and customers through the development and introduction of these new products and services. \nSales and Marketing Expenses\nSales and marketing expenses are aggregated into two main components. The first component consists of traditional advertising costs incurred such as direct sales expense, account management, local and product marketing, retail and e-commerce, partnerships, and communications personnel. The second component of sales and marketing expenses consists of costs incurred for services, incentives, and other costs that are not directly related to revenue generating transactions that we consider to be marketing costs to encourage the usage of Cash App. These expenses include, but are not limited to, Cash App peer-to-peer processing costs and transaction losses, card issuance costs, customer referral bonuses, and promotional giveaways that are expensed as incurred.\n69\nGeneral and Administrative Expenses\nGeneral and administrative expenses consist primarily of expenses related to our customer support, finance, legal, risk operations, human resources, and administrative personnel. General and administrative expenses also include costs related to fees paid for professional services, including legal, tax, and accounting services. \nTransaction, Loan, and Consumer Receivable Losses\nTransaction losses include chargebacks for unauthorized credit card use and the inability to collect on disputes between buyers and sellers over the delivery of goods or services, as well as losses on Cash App activity related to peer-to-peer payments sent from a credit card, Cash for Business, and Cash App Card. We base our reserve estimates on prior chargeback history and current period data points indicative of transaction loss. We reflect additions to the reserve in current operating results, while realized losses are offset against the reserve. The establishment of appropriate reserves for transaction losses is an inherently uncertain process, and ultimate losses may vary from the current estimates. We regularly update our reserve estimates as new facts become known and events occur that may affect the settlement or recovery of losses.\nLoan losses relate to Square Loans and Cash App Borrow and are recorded whenever the amortized cost of a loan exceeds its fair value. Such charges are reversed for subsequent increases in fair value, but only to the extent that such reversals do not result in the amortized cost of a loan exceeding its fair value. \nLosses on consumer receivables relate to management's estimate of expected credit losses in the outstanding portfolio of consumer receivables. We reflect additions to the reserve in current operating results, while realized losses are offset against the reserve.\nAmortization of Customer and Other Acquired Intangible Assets\nAmortization of customer and other acquired intangible assets is primarily as a result of the intangible assets from the Afterpay acquisition.\nInterest Expense (Income), net\nInterest expense (income), net consists primarily of interest expense related to our long-term debt and interest income on our investments in marketable debt securities.\nRemeasurement Loss (Gain) on Bitcoin Investment\nRemeasurement loss (gain) on bitcoin investment is the result of gains or losses arising from remeasurements of our bitcoin investment.\nOther Expense (Income), net\nOther expense (income), net consists primarily of gains or losses arising from remeasurements of our investments in equity securities and foreign currency-related gains and losses.\nProvision for (Benefit from) Income Taxes\nThe provision for (benefit from) income taxes consists primarily of federal, state, local, and foreign tax. Our effective tax rate fluctuates from period to period due to changes in the mix of income and losses in jurisdictions with a wide range of tax rates, the effect of acquisitions, changes resulting from the amount of recorded valuation allowance, permanent differences between U.S. generally accepted accounting principles and local tax laws, certain one-time items, and changes in tax contingencies. \n70\nResults of Operations \nRevenue (in thousands, except for percentages)\nYear Ended December 31,\n2024\n2023\n$ Change\n% Change\nTransaction-based revenue\n$\n6,613,680 \n$\n6,315,301 \n$\n298,379 \n5 \n%\nSubscription and services-based revenue\n7,164,799 \n5,944,842 \n1,219,957 \n21 \n%\nHardware revenue\n143,369 \n157,178 \n(13,809)\nNM\n (i)\nBitcoin revenue\n10,199,205 \n9,498,302 \n700,903 \n7 \n%\n       Total net revenue \n$\n24,121,053 \n$\n21,915,623 \n$\n2,205,430 \n10 \n%\n(i)\n Not meaningful (\"NM\")\nTotal net revenue for the year ended December 31, 2024, increased by $2.2 billion, or 10%, compared to the year ended December 31, 2023. Bitcoin revenue increased by $700.9 million compared to the year ended December 31, 2023. Excluding bitcoin revenue, total net revenue increased by $1.5 billion, or 12%, in the year ended December 31, 2024, compared to the year ended December 31, 2023.\nTransaction-based revenue for the year ended December 31, 2024 increased by $298.4 million, or 5%, compared to the year ended December 31, 2023. This increase in revenue was largely in line with the increase in Gross Payment Volume (\"GPV\") of 6% for the year ended December 31, 2024, compared to the year ended December 31, 2023. GPV increased due to overall Square GPV growth. Square GPV growth was driven by improvements in both card-present and card-not-present volumes as a result of growth from in-person and online channels, as well as growth in our international markets. See below in \nKey Operating Metrics and Non-GAAP Financial Measures \nfor further discussion of GPV.\nSubscription and services-based revenue for the year ended December 31, 2024 increased by $1.2 billion, or 21%, compared to the year ended December 31, 2023. The increase was primarily due to growth in Cash App's financial service-related products, including Cash App Card usage, Cash App Borrow, Cash App Instant Deposit volumes, and Cash App Pay, as well as revenue from the BNPL platform. Revenue generated from the BNPL platform was $1.3 billion for the year ended December 31, 2024 compared to $1.0 billion for the year ended December 31, 2023. Growth in Square's financial services-related products, primarily Square Lending, also contributed to the increase in revenue in 2024.\nBitcoin revenue for the year ended December 31, 2024 increased by $700.9 million, or 7%, compared to the year ended December 31, 2023. As bitcoin revenue is the total sale amount of bitcoin sold to customers, the amount of bitcoin revenue recognized will fluctuate depending on customer demand as well as changes in the market price of bitcoin. This increase for the year ended December 31, 2024 was driven by an increase in the average market price of bitcoin, partially offset by a decrease in the quantity of bitcoin sold to customers, compared to the year ended December 31, 2023. While bitcoin contributed 42% and 43% of the total revenue in 2024 and 2023, respectively, gross profit generated from bitcoin was only 3% of the total gross profit in both 2024 and 2023.\n71\nCost of Revenue (in thousands, except for percentages)\nYear Ended December 31,\n2024\n2023\n$ Change\n% Change\nTransaction-based costs\n$\n3,881,013 \n$\n3,702,016 \n$\n178,997 \n5 \n%\nSubscription and services-based costs\n1,135,813 \n1,075,129 \n60,684 \n6 \n%\nHardware costs\n236,441 \n267,650 \n(31,209)\nNM\nBitcoin costs\n9,910,386 \n9,293,113 \n617,273 \n7 \n%\nAmortization of acquired technology assets\n68,364 \n72,829 \n(4,465)\nNM\nTotal cost of revenue\n$\n15,232,017 \n$\n14,410,737 \n$\n821,280 \n6 \n%\nTotal cost of revenue for the year ended December 31, 2024 increased by $821.3 million, or 6%, compared to the year ended December 31, 2023. Bitcoin costs of revenue, which increased by $617.3 million, was the primary driver of the increase in total cost of revenue, with the remaining increase related to an increase in GPV. Excluding bitcoin costs of revenue, total cost of revenue increased by approximately $204.0 million, or 4%, in the year ended December 31, 2024, compared to the year ended December 31, 2023. \nTransaction-based costs for the year ended December 31, 2024 increased by $179.0 million, or 5%, compared to the year ended December 31, 2023. Transaction-based costs were largely in line with the growth of GPV of 6%, partially offset by more favorable interchange economics for the year ended December 31, 2024.\nSubscription and services-based costs for the year ended December 31, 2024 increased by $60.7 million, or 6%, compared to the year ended December 31, 2023. The increase was driven by growth in Cash App's financial service-related products, including Cash App Card and related processing costs and fees as well as the cost of revenues associated with the BNPL platform. Cost of revenues associated with the BNPL platform were $311.6 million and $286.6 million for the years ended December 31, 2024 and December 31, 2023, respectively.\nBitcoin costs for the year ended December 31, 2024 increased by $617.3 million, or 7%, compared to the year ended December 31, 2023. Bitcoin costs are comprised of the total amount we pay to purchase bitcoin, which fluctuates in line with bitcoin revenue.\nOperating Expenses (in thousands, except for percentages)\nYear Ended December 31,\n2024\n2023\n$ Change\n% Change\nProduct development\n$\n2,914,415 \n$\n2,720,819 \n$\n193,596 \n7 \n%\n% of total net revenue\n12 \n%\n12 \n%\n% of total gross profit \n33 \n%\n36 \n%\nSales and marketing\n$\n1,984,265 \n$\n2,019,009 \n$\n(34,744)\n(2)\n%\n% of total net revenue\n8 \n%\n9 \n%\n% of total gross profit \n22 \n%\n27 \n%\nGeneral and administrative\n$\n2,149,099 \n$\n2,209,190 \n$\n(60,091)\n(3)\n%\n% of total net revenue\n9 \n%\n10 \n%\n% of total gross profit \n24 \n%\n29 \n%\nTransaction, loan, and consumer receivable losses\n$\n794,221 \n$\n660,663 \n$\n133,558 \n20 \n%\n% of total net revenue\n3 \n%\n3 \n%\n% of total gross profit \n9 \n%\n9 \n%\nAmortization of customer and other acquired intangible assets\n$\n154,709 \n$\n174,044 \n$\n(19,335)\n(11)\n%\n% of total net revenue\n1 \n%\n1 \n%\n% of total gross profit \n2 \n%\n2 \n%\nTotal operating expenses\n$\n7,996,709 \n$\n7,783,725 \n$\n212,984 \n3 \n%\n72\nProduct development expenses for the year ended December 31, 2024, increased by $193.6 million, or 7%, compared to the year ended December 31, 2023, primarily due to an increase of $154.1 million in software and cloud computing infrastructure fees for the year ended December 31, 2024, as a result of increased capacity needs and expansion of our cloud-based services. Impairment charges of certain assets related to TIDAL of $60.3 million were also recognized in the fourth quarter of 2024. The increase in product development expenses was partially offset by a decrease of $87.9 million in personnel costs primarily due to a decrease in headcount, which is a result of executing on our cost efficiency goals and employee headcount cap.\nSales and marketing expenses for the year ended December 31, 2024, decreased by $34.7 million, or 2%, compared to the year ended December 31, 2023, primarily due to a decrease of $49.5 million in marketing and other advertising costs from decreased online campaigns as we focused on expense discipline as well as a release of estimated chargeback losses of $27.3 million in the first quarter of 2024. The decrease was partially offset by charges related to changes to certain contractual arrangements as well as inventory write-offs during the third quarter of 2024.\nGeneral and administrative expenses for the year ended December 31, 2024, decreased by $60.1 million, or 3%, compared to the year ended December 31, 2023, primarily due to the following:\n•\na decrease in personnel costs of $169.4 million due to a decrease in headcount as well as a reduction of facilities and other expenses of $59.5 million for the year ended December 31, 2024;\n•\na decrease in certain impairment charges related to TIDAL of $58.8 million compared to the year ended December 31, 2023. Refer to Note 9, \nGoodwill \nwithin Notes to the Consolidated Financial Statements for more details; partially offset by\n•\nan increase in accrued expenses for estimated and settled amounts in connection with certain litigation and regulatory matters of $231.9 million. Refer to Note 19, \nCommitments and Contingencies\n within Notes to the Consolidated Financial Statements for more details; and\n•\na charge of $32.2 million related to adjustments of certain TIDAL acquisition deferred purchase consideration during the first quarter of 2024, as well as a derecognition of $15.1 million during the second quarter of 2024 of certain indemnification assets related to the TIDAL acquisition which were deemed no longer recoverable.\n    \nTransaction, loan, and consumer receivable losses for the year ended December 31, 2024, increased by $133.6 million, or 20%, compared to the year ended December 31, 2023, primarily due to the following: \n•\nan increase in loan losses of $221.3 million compared to the year ended December 31, 2023, primarily due to increased loan volumes; partially offset by\n•\na decrease in transaction losses of $87.7 million for the year ended December 31, 2024. The decrease in transaction losses is attributable to both an operational outage in the third quarter of 2023, which resulted in higher transaction losses incurred, as well as a release of previously established risk loss provisions in the second quarter of 2024 related to prior periods.\nAmortization of customer and other acquired intangible assets decreased $19.3 million for the year ended December 31, 2024, compared to the year ended December 31, 2023, primarily as a result of the revision of certain intangibles' useful lives in the third quarter of 2023.\nInterest Expense (Income), Net (in thousands, except for percentages)\nYear Ended December 31,\n2024\n2023\n$ Change\n% Change\nInterest expense (income), net\n$\n9,302 \n$\n(47,221)\n$\n56,523 \n(120)\n%\nInterest expense, net, of $9.3 million for the year ended December 31, 2024 was primarily due to an increase in interest expense related to our 2032 Senior Notes issued in the second quarter of 2024, which more than offset an increase in interest income received as a result of higher investment balances. Refer to Note 14, \nIndebtedness\n within Notes to the Consolidated Financial Statements for further details. Interest income, net, of $47.2 million for the year ended December 31, 2023 was primarily due to an increase in interest income received as a result of both higher interest rates and investment balances, which more than offset interest expense in the period.\n73\nRemeasurement Loss (Gain) on bitcoin investment (in thousands, except for percentages)\nYear Ended December 31,\n2024\n2023\n$ Change\n% Change\nRemeasurement gain on bitcoin investment\n$\n(420,918)\n$\n(207,084)\n$\n(213,834)\n103 \n%\nRemeasurement gain on bitcoin investment of $420.9 million and $207.1 million for the year ended December 31, 2024 and 2023, respectively, was due to the remeasurement of our bitcoin investment to its fair value at each reporting date. Refer to Note 13, \nBitcoin\n within Notes to the Consolidated Financial Statements for further details regarding the remeasurement of our bitcoin investment.\nOther Expense (Income), Net (in thousands, except for percentages)\nYear Ended December 31,\n2024\n2023\n$ Change\n% Change\nOther expense (income), net\n$\n(53,211)\n$\n4,609 \n$\n(57,820)\nNM\nOther income, net, of $53.2 million for the year ended December 31, 2024 was comprised of unrealized gains of $37.7 million arising from the revaluation of certain equity investments as well as accretion of investments in marketable debt securities. Other expense, net, of $4.6 million for the year ended December 31, 2023 was due to unrealized losses on certain marketable and non-marketable investments, partially offset by accretion of investments in marketable debt securities.\nProvision for (Benefit from) Income Taxes (in thousands, except for percentages)\nYear Ended December 31,\n2024\n2023\n$ Change\n% Change\nBenefit from income taxes\n$\n(1,509,343)\n$\n(8,019)\n$\n(1,501,324)\nNM\nBenefit from income taxes of $1.5 billion for the year ended December 31, 2024, compared to a benefit from income taxes of $8.0 million for the year ended December 31, 2023, was primarily due to one-time benefits of $1.9 billion related to both the release of the valuation allowance associated with certain federal and state deferred tax assets as well as the recognition of deferred tax assets as part of internal legal entity restructuring efforts in the fourth quarter of 2024. These benefits were partially offset by $487.7 million related to our current and deferred tax provisions associated with 2024 activity. Refer to Note 15, \nIncome Taxes\n within Notes to the Consolidated Financial Statements for further details.\nSegment Results\nSquare Results\nThe following tables provide a summary of the revenue and gross profit for our Square segment for the year ended December 31, 2024 and 2023\n \n(in thousands, except for percentages):\nYear Ended December 31,\n2024\n2023\n$ Change\n% Change\nSegment net revenue\n$\n7,681,656 \n$\n7,033,384 \n$\n648,272 \n9 \n%\nSegment cost of revenue\n4,082,744 \n3,904,730 \n178,014 \n5 \n%\nSegment gross profit\n$\n3,598,912 \n$\n3,128,654 \n$\n470,258 \n15 \n%\n74\nRevenue\nRevenue for the Square segment for the year ended December 31, 2024 increased by $648.3 million compared to the year ended December 31, 2023. The increase was primarily due to the Square items referenced within the Company's overall revenue discussion.\nCost of Revenue\nCost of revenue for the Square segment for the year ended December 31, 2024 increased by $178.0 million compared to the year ended December 31, 2023. The increase was primarily due to the Square items referenced within the Company's overall cost of revenue discussion.\nCash App Results\nThe following tables provide a summary of the revenue and gross profit for our Cash App segment for the year ended December 31, 2024 and 2023 (in thousands, except for percentages):\nYear Ended December 31,\n2024\n2023\n$ Change\n% Change\nSegment net revenue\n$\n16,247,880 \n$\n14,681,686 \n$\n1,566,194 \n11 \n%\nSegment cost of revenue\n11,008,869 \n10,358,223 \n650,646 \n6 \n%\nSegment gross profit\n$\n5,239,011 \n$\n4,323,463 \n$\n915,548 \n21 \n%\nRevenue\nRevenue for the Cash App segment for the year ended December 31, 2024 increased by $1.6 billion compared to the year ended December 31, 2023. The increase was due to the Cash App items referenced within the Company's overall revenue discussion. While bitcoin revenue contributed 63% and 65% of Cash App revenue in 2024 and 2023, respectively, gross profit generated from bitcoin was only 6% and 5% of Cash App gross profit in both 2024 and 2023. \nExcluding bitcoin revenue, Cash App net revenue increased $865.3 million, or 17%, compared to the year ended December 31, 2023.\nCost of Revenue\nCost of revenue for the Cash App segment for the year ended December 31, 2024 increased by $650.6 million compared to the year ended December 31, 2023. The increase was due to the items referenced within the Company's overall revenue and cost of revenue discussion. Excluding bitcoin cost of revenue, Cash App cost of revenue increased $33.4 million, or 3%. \n75\nKey Operating Metrics and Non-GAAP Financial Measures \nWe collect and analyze operating and financial data to evaluate the health of our business, allocate our resources, and assess our performance. In addition to total net revenue, operating income (loss), net income (loss), and other results reported under GAAP, the following table sets forth key operating metrics and non-GAAP financial measures we use to evaluate our business. We believe these metrics and measures are useful to facilitate period-to-period comparisons of our business, and to facilitate comparisons of our performance to that of other payment solution providers.\nYear Ended December 31,\n2024\n2023\n2022\nGross Payment Volume (GPV) (in millions)\n$\n240,812 \n$\n227,699 \n$\n203,536 \nAdjusted Operating Income (Loss) (in thousands)\n$\n1,608,790 \n$\n351,351 \n$\n(145,408)\nAdjusted EBITDA (in thousands)\n$\n3,029,031 \n$\n1,792,420 \n$\n990,964 \nAdjusted Net Income Per Share:\nBasic\n$\n3.47 \n$\n1.85 \n$\n1.05 \nDiluted\n$\n3.37 \n$\n1.80 \n$\n1.00 \nGross Payment Volume (\"GPV\")\nGPV includes Square GPV and Cash App Business GPV. Square GPV is defined as the total dollar amount of all card and bank payments processed by sellers using Square, net of refunds. Cash App Business GPV is comprised of Cash App activity related to peer-to-peer transactions received by business accounts, and peer-to-peer payments sent from a credit card. GPV does not include transactions from our BNPL platform because GPV is related only to transaction-based revenue and not to subscription and services-based revenue.\nAdjusted EBITDA, Adjusted Net Income Per Share (\"Adjusted EPS\") and Adjusted Operating Income\nAdjusted EBITDA and Adjusted EPS are non-GAAP financial measures that represent our net income (loss) and net income (loss) per share, adjusted to eliminate the effect of items as described below. Adjusted Operating Income is a non-GAAP financial measure that represents our operating income (loss), adjusted to eliminate the effect of items as described below. \nWe have included these non-GAAP financial measures in this \nAnnual Report on Form 10-K\n because they are key measures used by our management to evaluate our operating performance, generate future operating plans, and make strategic decisions, including those relating to operating expenses and the allocation of internal resources. Accordingly, we believe these measures provide useful information to investors and others in understanding and evaluating our operating results in the same manner as our management and board of directors. In addition, they provide useful measures for period-to-period comparisons of our business, as they remove the effect of certain non-cash items and certain variable charges that do not vary with our operations.\n•\nWe believe it is useful to exclude certain non-cash charges, such as amortization of intangible assets, and share-based compensation expenses, from our non-GAAP financial measures because the amount of such expenses in any specific period may not directly correlate to the underlying performance of our business operations.\n•\nWe believe that excluding the expense related to amortization of debt discount and issuance costs from our non-GAAP measures is useful to investors because such incremental non-cash interest expense does not represent a current or future cash outflow for the Company and is therefore not indicative of our continuing operations or meaningful when comparing current results to past results. Additionally, for purposes of calculating diluted Adjusted EPS, we add back cash interest expense on convertible notes, as if converted at the beginning of the period, if the impact is dilutive.\n76\n•\nWe exclude the following from non-GAAP financial measures because we do not believe that these items are reflective of our ongoing business operations: gain or loss on the disposal of property and equipment; gain or loss on revaluation of equity investments; remeasurement gain or loss of our bitcoin investment, bitcoin impairment losses on our bitcoin investment (prior to the adoption of ASU 2023-08), and one-time income tax impacts from deferred taxes, as applicable. \n•\nTo aid in comparability of our results across periods, we also exclude certain acquisition-related and integration costs associated with business combinations, various restructuring and other costs, and goodwill and intangible asset impairment charges, each of which are not normal operating expenses. Acquisition related costs include amounts paid to redeem acquirees’ unvested share-based compensation awards, charges associated with holdback liabilities, and legal, accounting, valuation, and due diligence costs. Integration costs include advisory and other professional services or consulting fees necessary to integrate acquired businesses. Contingencies, restructuring and other costs that are not reflective of our core business operating expenses may include severance costs, contingent losses, impairment charges, and certain litigation and regulatory charges. We also add back the impact of the acquired deferred revenue and deferred cost adjustment, which was written down to fair value in purchase accounting.\nIn addition to the items above, Adjusted EBITDA as a non-GAAP financial measure also excludes depreciation and amortization, other cash interest income and expense, and other income and expense.\nNon-GAAP financial measures have limitations, should be considered as supplemental in nature, and are not meant as a substitute for the related financial information prepared in accordance with GAAP. These limitations include the following:\n•\nshare-based compensation expense has been, and will continue to be for the foreseeable future, a significant recurring expense in our business and an important part of our compensation strategy;\n•\nthe intangible assets being amortized may have to be replaced in the future, and the non-GAAP financial measures do not reflect cash capital expenditure requirements for such replacements or for new capital expenditures or other capital commitments; and\n•\nnon-GAAP measures do not reflect changes in, or cash requirements for, our working capital needs.\nIn addition to the limitations above, Adjusted EBITDA as a non-GAAP financial measure does not reflect the effect of depreciation and amortization expense and related cash capital requirements, income taxes that may represent a reduction in cash available to us, and the effect of foreign currency exchange gains or losses, which is included in other income and expense.\nIn view of the limitations associated with Adjusted EBITDA, we also present Adjusted Operating Income (Loss), which is a non-GAAP financial measure that excludes certain expenses that we believe are not reflective of our core operating performance, including amortization of intangible assets, bitcoin investment impairment losses (prior to the adoption of ASU 2023-08), acquisition-related accelerated share-based compensation expenses, acquisition-related and integration costs, contingencies, restructuring and other costs, and goodwill and intangible asset impairment charges. Adjusted Operating Income (Loss) does however include the effect of share-based compensation expense, which is a significant recurring expense in our business and an important part of our compensation strategy, as well as depreciation expense.\nOther companies, including companies in our industry, may calculate the non-GAAP financial measures differently or not at all, which reduces their usefulness as comparative measures.\nBecause of these limitations, you should consider the non-GAAP financial measures alongside other financial performance measures, including net income (loss) and our other financial results presented in accordance with GAAP.\n77\nThe following table presents a reconciliation of operating income (loss) to Adjusted Operating Income (Loss) for each of the periods indicated (in thousands):\nYear Ended December 31,\n2024\n2023\n2022\nOperating income (loss)\n$\n892,327 \n$\n(278,839)\n$\n(624,532)\nAmortization of acquired technology assets\n68,364 \n72,829 \n70,194 \nAcquisition-related and integration costs\n49,019 \n11,422 \n105,518 \nContingencies, restructuring and other charges\n302,446 \n239,582 \n51,746 \nRestructuring share-based compensation expense\n8,071 \n— \n— \nGoodwill and intangible asset impairment\n133,854 \n132,313 \n— \nBitcoin impairment losses\n— \n— \n46,571 \nAmortization of customer and other acquired intangible assets\n154,709 \n174,044 \n138,758 \nAcquisition-related share based acceleration costs\n— \n— \n66,337 \nAdjusted Operating Income (Loss)\n$\n1,608,790 \n$\n351,351 \n$\n(145,408)\nThe following table presents a reconciliation of net income (loss) to Adjusted EBITDA for each of the periods indicated (in thousands):\nYear Ended December 31,\n2024\n2023\n2022\nNet income (loss) attributable to common stockholders\n$\n2,897,047 \n$\n9,772 \n$\n(540,747)\nNet loss attributable to noncontrolling interests\n(30,550)\n(30,896)\n(12,258)\nNet income (loss)\n2,866,497 \n(21,124)\n(553,005)\nShare-based compensation expense\n1,264,486 \n1,276,097 \n1,069,289 \nRestructuring share-based compensation expense\n8,071 \n— \n— \nDepreciation and amortization\n376,127 \n408,560 \n340,523 \nAcquisition-related and integration costs\n49,019 \n11,422 \n105,518 \nContingencies, restructuring and other charges\n302,446 \n239,582 \n51,746 \nGoodwill and intangible asset impairment\n133,854 \n132,313 \n— \nInterest expense (income), net\n9,302 \n(47,221)\n36,228 \nRemeasurement gain on bitcoin investment\n(420,918)\n(207,084)\n— \nOther expense (income), net\n(53,211)\n4,609 \n(95,443)\nBitcoin impairment losses\n— \n— \n46,571 \nBenefit from income taxes\n(1,509,343)\n(8,019)\n(12,312)\nLoss on disposal of property and equipment\n2,634 \n3,186 \n1,619 \nAcquired deferred revenue and cost adjustment\n67 \n99 \n230 \nAdjusted EBITDA\n$\n3,029,031 \n$\n1,792,420 \n$\n990,964 \n78\nThe following table presents a reconciliation of net income (loss) to Adjusted Net Income (Loss) Per Share for each of the periods indicated (in thousands, except per share data):\nYear Ended December 31,\n2024\n2023\n2022\nNet income (loss) attributable to common stockholders\n$\n2,897,047 \n$\n9,772 \n$\n(540,747)\nNet loss attributable to noncontrolling interests\n(30,550)\n(30,896)\n(12,258)\nNet income (loss)\n2,866,497 \n(21,124)\n(553,005)\nShare-based compensation expense\n1,264,486 \n1,276,097 \n1,069,289 \nRestructuring share-based compensation expense\n8,071 \n— \n— \nAcquisition-related and integration costs\n49,019 \n11,422 \n105,518 \nContingencies, restructuring and other charges\n302,446 \n239,582 \n51,746 \nGoodwill and intangible asset impairment\n133,854 \n132,313 \n— \nAmortization of intangible assets\n223,072 \n246,873 \n208,952 \nAmortization of debt discount and issuance costs\n14,413 \n11,904 \n15,162 \nLoss (gain) on revaluation of equity investments\n(32,245)\n16,523 \n(73,457)\nRemeasurement gain on bitcoin investment\n(420,918)\n(207,084)\n— \nBitcoin impairment losses\n— \n— \n46,571 \nLoss on disposal of property and equipment\n2,634 \n3,186 \n1,619 \nAcquired deferred revenue and cost adjustment\n67 \n99 \n230 \nTax effect of one-time income tax benefits from deferred tax assets\n(1,909,848)\n— \n— \nTax effect of non-GAAP net income adjustments\n(360,782)\n(582,703)\n(264,523)\nAdjusted Net Income - basic\n$\n2,140,766\n \n$\n1,127,088\n \n$\n608,102\n \nCash interest expense on convertible notes\n2,711 \n3,554 \n5,014 \nAdjusted Net Income - diluted\n$\n2,143,477\n \n$\n1,130,642\n \n$\n613,116\n \nWeighted-average shares used to compute Adjusted Net Income Per Share:\nBasic\n616,993 \n608,856 \n578,949 \nDiluted\n636,390 \n628,320 \n615,034 \nAdjusted Net Income Per Share:\nBasic\n$\n3.47 \n$\n1.85 \n$\n1.05 \nDiluted\n$\n3.37 \n$\n1.80 \n$\n1.00 \nDiluted Adjusted Net Income Per Share is computed by dividing Adjusted Net Income by the weighted-average number of shares of common stock outstanding adjusted for the dilutive effect of all potential shares of common stock. In periods when we reported an Adjusted Net Loss, diluted Adjusted Net Income Per Share is the same as basic Adjusted Net Income Per Share because the effects of potentially dilutive items were anti-dilutive.\n79\nThe following table presents a reconciliation of the tax effect of non-GAAP net income adjustments to our provision for (benefit from) income taxes (in thousands, except effective tax rate):\nYear Ended December 31,\n2024\n2023\n2022\nBenefit from income taxes, as reported\n$\n(1,509,343)\n$\n(8,019)\n$\n(12,312)\nTax effect of one-time income tax benefits from deferred tax assets\n1,909,848\n—\n—\nTax effect of other non-GAAP net income adjustments\n360,782\n582,703\n264,523\nAdjusted provision for income taxes, non-GAAP\n$\n761,287\n$\n574,684\n$\n252,211\nNon-GAAP effective tax rate\n26 \n%\n34 \n%\n29 \n%\nWe determined the adjusted provision for income taxes by calculating the estimated annual effective tax rate based on our adjusted provision for income taxes, non-GAAP and applying it to Adjusted Net Income before income taxes.\n80\nLiquidity and Capital Resources\nAs of December 31, 2024, we had approximately $10.7 billion in available liquidity, with $9.9 billion in cash, cash equivalents, restricted cash, and investments in marketable debt securities, which includes net proceeds of approximately $2.0 billion from the issuance of our 2032 Senior Notes in the second quarter of 2024, as well as an undrawn amount of $775.0 million available under our revolving credit facility subject to compliance with the terms of the credit facility, including our covenants. Additionally, we had $253.9 million available to be withdrawn under our warehouse funding facilities. Refer to Note 14, \nIndebtedness \nwithin Notes to the Consolidated Financial Statements for more details. We intend to continue focusing on our long-term business initiatives and believe that our available funds are sufficient to meet our liquidity needs for the foreseeable future, including our share repurchase program. As of December 31, 2024, we were in compliance with all financial covenants associated with our revolving credit facility and senior notes. None of our warehouse funding facilities contain financial covenants.\nThe following table summarizes our available liquidity (in thousands):\nDecember 31,\n2024\nDecember 31,\n2023\nCash and cash equivalents\n$\n8,075,247 \n$\n4,996,465 \nShort-term restricted cash \n(i)\n902,478 \n770,380 \nLong-term restricted cash\n69,915 \n71,812 \nInvestments in short-term debt securities\n403,426 \n851,901 \nInvestments in long-term debt securities\n471,977 \n251,127 \nRevolving credit facility\n775,000 \n775,000 \nTotal liquidity\n$\n10,698,043 \n$\n7,716,685 \n(i)\n As of December 31, 2024, the Company has invested $319.8 million of restricted cash into a money market fund. See Note 5, \nFair Value Measurements.\n \nOur principal sources of liquidity are our cash and cash equivalents, and investments in marketable debt securities. Customer funds cash and cash equivalents are excluded from our liquidity as these are funds we hold on behalf of customers that are separate from our corporate funds and are not available for corporate purposes. Investments in marketable debt securities were held primarily in certificates of deposits, money market funds, reverse repurchase agreements, U.S. government and agency securities, commercial paper, and corporate bonds. We consider all highly liquid investments with an original maturity of three months or less when purchased to be cash equivalents. Our investments in marketable debt securities are classified as available-for-sale.\nAs of December 31, 2024, we held approximately 8,485 bitcoins for investment purposes (\"bitcoin investment\") with a fair value of $792.3 million based on observable market prices, which is included within “Other non-current assets” on the consolidated balance sheets. We believe cryptocurrency is an instrument of economic empowerment that aligns with our corporate purpose. We expect to hold these investments for the long term but will continue to reassess our bitcoin investment relative to our balance sheet. Bitcoin is considered an indefinite-lived intangible asset, and upon adoption of Accounting Standards Update No. 2023-08, \nAccounting for and Disclosure of Crypto Assets\n, effective January 1, 2023, our bitcoin investment is remeasured at fair value at each reporting date with changes recognized in net income through the consolidated statements of operations. We purchased approximately 447 bitcoins with a cost basis of $31.5 million during the year ended December 31, 2024 for investment purposes. We did not sell any of our bitcoin investment during the year ended December 31, 2024 and 2023. We recognized gains of $420.9 million and $207.1 million from the remeasurement of our bitcoin investment during the year ended December 31, 2024 and 2023, respectively.\nIn September 2020, we announced our intent to invest $100.0 million towards impact investments that further our purpose of economic empowerment. As of December 31, 2024, we have invested $67.9 million in aggregate towards this initiative, of which $23.6 million and $12.3 million were invested in the years ended December 31, 2024 and 2023, respectively.\n81\nOur principal commitments consist of convertible notes, senior notes, our revolving credit facility, warehouse funding facilities, operating leases, capital leases, and purchase commitments. Refer to Note 14, \nIndebtedness \nand\n \nNote 19, \nCommitments and Contingencies \nwithin Notes to the Consolidated Financial Statements for more details on these commitments.\nSenior Notes and Convertible Notes\nAs of December 31, 2024, we held $6.2 billion in aggregate principal amount of debt, comprised of, $1.0 billion in aggregate amount of convertible senior notes that mature on March 1, 2025 (\"2025 Convertible Notes\"), $575.0 million in aggregate amount of convertible senior notes that mature on May 1, 2026 (\"2026 Convertible Notes\"), and $575.0 million in aggregate amount of convertible senior notes that mature on November 1, 2027 (\"2027 Convertible Notes,\" collectively referred to as the “Convertible Notes”), as well as an outstanding $1.0 billion in aggregate principal amount of senior unsecured notes that mature on June 1, 2026 (\"2026 Senior Notes\"), $1.0 billion in aggregate principal amount of senior unsecured notes that mature on June 1, 2031 (\"2031 Senior Notes\"), and $2.0 billion in aggregate principal amount of senior unsecured notes that mature on May 15, 2032 (\"2032 Senior Notes\" and, together with the 2026 Senior Notes and 2031 Senior Notes, the “Senior Notes” and, together with the Convertible Notes, the “Notes”). Refer to Note 14, \nIndebtedness \nwithin Notes to the Consolidated Financial Statements for further details.\nOn May 25, 2018, the Company issued an aggregate principal amount of $862.5 million of convertible senior notes (\"2023 Convertible Notes\"). On May 15, 2023, we paid $461.8 million in cash to settle the outstanding principal balance and interest on the 2023 Convertible Notes upon maturity.\nRevolving Credit Facility\nWe have entered into a revolving credit agreement with certain lenders, as subsequently amended, which provides a $775.0 million senior unsecured revolving credit facility (the \"2020 Credit Facility\") maturing in June 2028. Refer to Note 14, \nIndebtedness \nwithin Notes to the Consolidated Financial Statements for further details.\nWarehouse Funding Facilities\nWe have warehouse funding facilities (\"Warehouse Facilities\") with an aggregate commitment amount of $1.7 billion on a revolving basis, of which $1.5 billion was drawn as of December 31, 2024. The Warehouse Facilities have been arranged utilizing wholly-owned and consolidated entities (collectively, the \"Warehouse Special Purpose Entities (SPEs)\") formed for the sole purpose of financing the origination of consumer receivables to partly fund our BNPL platform. Borrowings under the Warehouse Facilities are secured against the respective consumer receivables. While the Warehouse SPEs are included in our consolidated financial statements, they are separate legal entities that maintain legal ownership of the receivables they hold. The assets of the Warehouse SPEs are not available to satisfy our claims or those of our creditors.\nCash, Restricted Cash, and Working Capital\nWe believe that our existing cash and cash equivalents, investment in marketable debt securities, and availability under our line of credit will be sufficient to meet our working capital needs, including any expenditures related to strategic transactions and investment commitments that we may from time to time enter into, and planned capital expenditures for at least the next 12 months. \nFrom time to time, we have raised capital by issuing equity, equity-linked, or debt securities such as our convertible notes and senior notes; and we may do so in the future, however, such funding may not be available on terms acceptable to us or at all.\nDuring 2024, we received a non-investment grade rating by S&P Global Ratings (BB+), Fitch Ratings, Inc. (BB+), and Moody's Corporation (Ba2). We expect that these credit rating agencies will continue to monitor our performance, including our capital structure and results of operations. Our liquidity, access to capital, and borrowing costs could be adversely impacted by declines in our credit rating.\n82\nShort-term restricted cash of $902.5 million as of December 31, 2024 primarily includes cash held by the Warehouse SPEs used in the Warehouse Facilities funding arrangements that will be used to pay the borrowings under the Warehouse Facilities or will be distributed to us. It also includes pledged cash deposits in accounts at the financial institutions that process our sellers' payment transactions and collateral pursuant to various agreements with banks relating to our products. We use restricted cash to secure letters of credit with the related financial institutions to provide collateral for cash flow timing differences in the processing of payments. We have recorded these amounts as current assets on our consolidated balance sheet given the short-term nature of these cash flow timing differences and that there is no minimum time frame during which the cash must remain restricted.\nLong-term restricted cash of $69.9 million as of December 31, 2024 is primarily related to cash held as collateral as required by the Federal Deposit Insurance Corporation (\"FDIC\") for Square Financial Services. We have recorded these amounts as non-current assets on our consolidated balance sheet as the requirement by the FDIC specifies a time frame of 12 months or longer during which the cash must remain restricted.\nWe experience significant day-to-day fluctuations in our cash and cash equivalents due to fluctuations in settlements receivable, and customers payable, and hence working capital. These fluctuations are primarily due to:\n•\nTiming of period end.\n For periods that end on a weekend or a bank holiday, our cash and cash equivalents, settlements receivable, and customers payable balances typically will be higher than for periods ending on a weekday, as we settle to our sellers for payment processing activity on business days; and\n•\nFluctuations in daily GPV.\n When daily GPV increases, our cash and cash equivalents, settlements receivable, and customers payable amounts increase. Typically our settlements receivable and customers payable balances at period end represent one to four days of receivables and disbursements to be made in the subsequent period. Customers payable, excluding amounts attributable to Cash App stored funds, and settlements receivable balances typically move in tandem, as pay-out and pay-in largely occur on the same business day. However, customers payable balances will be greater in amount than settlements receivable balances due to the fact that a subset of funds are held due to unlinked bank accounts, risk holds, and chargebacks. Customer funds obligations, which may be impacted by the timing of period end, number of processors used and processing times, are included in customers payable and may also cause customers payable to trend differently than settlements receivable. Holidays and day-of-week may also cause significant volatility in daily GPV amounts.\n83\nCash Flow Activities\nThe following table summarizes our cash flow activities (in thousands):\nYear Ended December 31,\n2024\n2023\nNet cash provided by operating activities\n$\n1,707,350 \n$\n100,961 \nNet cash provided by investing activities\n649,952 \n683,201 \nNet cash provided by (used in) financing activities\n1,952,662 \n(240,137)\nEffect of foreign exchange rate on cash and cash equivalents\n(88,539)\n29,156 \nNet increase in cash, cash equivalents, restricted cash, and customer funds\n$\n4,221,425 \n$\n573,181 \nCash Flows from Operating Activities\nFor the year ended December 31, 2024, cash provided by operating activities was $1.7 billion, primarily due to net income of $2.9 billion, adjusted for non-cash expenses of $2.6 billion consisting primarily of share-based compensation; transaction, loan, and consumer receivable losses; depreciation and amortization; goodwill and intangible asset impairments; and non-cash lease expense, each of which contributed positively to cash provided by operating activities. Additionally, there were net inflows related to changes in other assets and liabilities, including settlements receivable and customers payable, of $207.3 million due to timing of period end. These were partially offset by a change in deferred income taxes of $1.7 billion; amortization of discounts and premiums and other non-cash adjustments on consumer receivables of $1.1 billion; net outflows from loan products of $797.5 million; bitcoin remeasurement of $420.9 million; and gains on the revaluation of certain equity investments of $32.2 million.\nFor the year ended December 31, 2023, cash provided by operating activities was $101.0 million, comprised of net loss of $21.1 million, adjusted for non-cash expenses of $2.6 billion, consisting primarily of share-based compensation; transaction, loan, and consumer receivable losses; depreciation and amortization; non-cash lease expense; and goodwill impairment, all of which contributed positively to operating activities. These were partially offset by the amortization of discounts and premiums and other non-cash adjustments of $984.4 million; net outflows from loan products of $553.6 million; bitcoin remeasurement of $207.1 million; a change in deferred income taxes of $85.9 million; as well as changes in other assets and liabilities, including settlements receivable and customers payable, of $685.3 million due to timing of period end, including a $350.0 million deposit held by a processor to meet requirements related to processing volumes.\nCash Flows from Investing Activities \nFor the year ended December 31, 2024, cash provided by investing activities was $650.0 million, primarily due to a net inflow related to consumer receivables of $604.0 million and net proceeds from investments of marketable securities of $253.9 million. These were partially offset by the purchase of property and equipment of $153.9 million and purchases of other investments of $53.9 million.\nFor the year ended December 31, 2023, cash provided by investing activities was $683.2 million, primarily due to the net proceeds from investments of marketable securities of $600.3 million and a net inflow related to consumer receivables of $272.9 million. These were partially offset by the purchase of property and equipment of $151.2 million and purchases of other investments of $38.8 million. \n84\nCash Flows from Financing Activities\nFor the year ended December 31, 2024, cash provided by financing activities was $2.0 billion, primarily due to approximately $2.0 billion of net proceeds related to the issuance of the 2032 Senior Notes in the second quarter of 2024, a change in customer funds of $1.0 billion, and proceeds from issuances of common stock from the exercise of options and purchases under our employee share purchase plan of $154.8 million. These were partially offset by repurchases of common stock of $1.2 billion, a net outflow from warehouse facilities borrowings of $74.0 million, and a net outflow for other financing activities of $18.5 million.\nFor the year ended December 31, 2023, cash used in financing activities was $240.1 million, primarily as a result of a cash payment of $461.8 million to settle the 2023 Convertible Notes in May 2023, stock repurchases of $156.8 million, a net outflow for other financing activities of $20.0 million, and the repayment and forgiveness of Paycheck Protection Program loans of $16.8 million. These were partially offset by net proceeds from warehouse facilities borrowings of $269.6 million and proceeds from issuances of common stock from the exercise of options and purchases under our employee share purchase plan of $130.4 million.\nCritical Accounting Estimates \nOur discussion and analysis of our financial condition and results of operations are based upon our financial statements, which have been prepared in accordance with GAAP. GAAP requires us to make certain estimates and judgments that affect the amounts reported in our financial statements. We base our estimates on historical experience, anticipated future trends, and other assumptions we believe to be reasonable under the circumstances. Because these accounting estimates require significant judgment, our actual results may differ materially from our estimates.\nWe believe accounting policies and the assumptions and estimates associated with the determination of valuation allowances for deferred taxes could potentially have a material effect on our consolidated financial statements, and therefore are critical accounting policies and estimates.\nDeferred Tax Valuation Allowance\nDeferred income tax assets represent amounts available to reduce income taxes payable on taxable income in future years. Such assets arise because of temporary differences between the financial reporting and tax bases of assets and liabilities, as well as from net operating loss, capital loss, and tax credit carryforwards. We evaluate the realizability of our deferred tax assets on a quarterly basis to determine whether a valuation allowance is necessary and reduce such assets to the amount that is more likely than not to be realized. This evaluation requires significant judgment and involves the consideration of all available positive and negative evidence, including our historical operating results, the existence of cumulative losses in recent years, ongoing prudent and feasible tax planning strategies, and projections of future taxable income.\nIn the fourth quarter of 2024, based on the relative weight of positive and negative evidence, including the amount of our taxable income in 2024, and consideration of our expected future taxable earnings, we concluded that it is more likely than not that a material portion of our U.S. federal and certain state deferred tax assets are realizable. Therefore, we released the valuation allowance associated with a material portion of our U.S. federal and certain states' deferred tax assets, resulting in a $1.3 billion non-cash benefit to the provision for income taxes.\nWe have retained a full valuation allowance against California deferred tax assets which primarily consists of tax loss carryovers and tax credit carryovers. We do not have sufficient evidence of future income to realize the California deferred tax assets on a more likely than not basis.\nRefer to Note 15, \nIncome Taxes\n within the Notes to the Consolidated Financial Statements for further details.\nRecent Accounting Pronouncements\nSee “Recent Accounting Pronouncements” described in Note 1, \nDescription of Business and Summary of Significant Accounting Policies\n within Notes to the Consolidated Financial Statements.\n85",
  "item2": null
}