{
  "item1": "ITEM 1. BUSINESS Block, Inc. (together its subsidiaries, \"Block\" \"we\"), building ecosystem dedicated economic empowerment unlocking access financial system people around world. do building most relevant products tools communities serve including sellers, consumers, artists, fans developers.",
  "item7": "ITEM 7. MANAGEMENT'S DISCUSSION ANALYSIS FINANCIAL CONDITION RESULTS OPERATIONS launched Square ecosystem February 2009 enable businesses (\"sellers\") accept card payments, important capability previously inaccessible many businesses. expanded provide sellers additional products services give them access cohesive ecosystem tools help them manage grow businesses. Similarly, Cash App, built ecosystem financial products services help individuals manage money.",
  "item2": "Commitments Contingencies within Notes Condensed Consolidated Financial Statements more details these commitments. Senior Notes Convertible Notes September 30, 2025, held $7.4 billion aggregate principal amount debt, comprised $575.0 million aggregate amount convertible senior notes mature May 1, 2026 (\"2026 Convertible Notes\"), $575.0 million aggregate amount convertible senior notes mature November 1, 2027 (\"2027 Convertible Notes,\" collectively referred “Convertible Notes”), well outstanding $1.0 billion aggregate principal amount senior unsecured notes mature June 1, 2026 (\"2026 Senior Notes\"), $1.2 billion aggregate principal amount senior unsecured notes mature August 15, 2030 (\"2030 Senior Notes\"), $1.0 billion aggregate principal amount senior unsecured notes mature June 1, 2031 (\"2031 Senior Notes\"), $2.0 billion aggregate principal amount senior unsecured notes mature May 15, 2032 (\"2032 Senior Notes\"), $1.0 billion aggregate principal amount senior unsecured notes mature August 15, 2033 (\"2033 Senior Notes\" and, together 2026 Senior Notes, 2030 Senior Notes, 2031 Senior Notes, “Senior Notes” and, together Convertible Notes, “Notes”). Refer Note 12, within Notes Condensed Consolidated Financial Statements further details. March 5, 2020, issued aggregate principal amount $1.0 billion convertible senior notes (\"2025 Convertible Notes\")."
}