{
  "source_file": "yum-20250930.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nIntroduction and Overview\nThe following Management's Discussion and Analysis (“MD&A”), should be read in conjunction with the unaudited Condensed Consolidated Financial Statements (“Financial Statements”), the Forward-Looking Statements and our Annual Report on Form 10-K for the fiscal year ended December 31, 2024, (“2024 Form 10-K”).  All Note references herein refer to the Notes to the Financial Statements.  Tabular amounts are displayed in millions of U.S. dollars except per share and unit count amounts, or as otherwise specifically identified.   \nIn the first quarter of 2025, the Company prospectively changed its basis of presentation to round financial figures in the Financial Statements and as presented in the tabular presentations in this MD&A to the nearest whole number in millions in all instances. As a result, some totals and percentages may not recompute based on rounded figures as presented within this MD&A. Previously, amounts were presented to ensure that all numbers herein recomputed, resulting in the presentation of certain figures inconsistent with their underlying rounding.\nYum! Brands, Inc. and its Subsidiaries (collectively referred to herein as the “Company,” “YUM,” “we,” “us” or “our”) franchise or operate a system of over 62,000 restaurants in more than 155 countries and territories, primarily under the concepts of KFC, Taco Bell, Pizza Hut and The Habit Burger & Grill (collectively, the “Concepts”).  The Company’s KFC, Taco Bell and Pizza Hut brands are global leaders of the chicken, Mexican-inspired and pizza categories, respectively.  The Habit Burger & Grill, is a fast-casual restaurant concept specializing in made-to-order chargrilled burgers, sandwiches and more.  Of the over 62,000 restaurants, 98% are operated by franchisees.\nYUM currently consists of four operating segments:\n•\nThe KFC Division which includes our worldwide operations of the KFC concept\n•\nThe Taco Bell Division which includes our worldwide operations of the Taco Bell concept \n•\nThe Pizza Hut Division which includes our worldwide operations of the Pizza Hut concept\n•\nThe Habit Burger & Grill Division which includes our worldwide operations of the Habit Burger & Grill concept\nThrough our Recipe for Good Growth we intend to deliver iconic restaurant brands and consistently drive better customer experiences, improved unit economics and higher rates of growth. Key enablers include accelerated use of digital and technology, increased collaboration and better leverage of our systemwide scale. This is done through a framework of three pillars: being Loved, Trusted and Connected.\nLoved: We grow by delighting customers with craveable food and a distinctive experience. We innovate and elevate our iconic restaurant brands that people trust and champion, resulting in relevant, easy and distinctive brands.\nTrusted: We operate responsibly with consistency and efficiency in our restaurants, across our system and in our communities. This includes a commitment to our priorities for social responsibility, risk management and sustainable stewardship of our people, food and planet.\nConnected: We use our teamwork, technology and global scale to serve every customer, everywhere, anytime. Our unmatched operating capability allows us to recruit and equip the best restaurant operators in the world to deliver great customer experiences. And our commitment to bold restaurant development drives market and franchise unit expansion with strong economics.\nOur unrivaled culture and talent and leading with smart, heart and courage are key to our success, fueling brand performance and franchise success.\nWe intend for this MD&A to provide the reader with information that will assist in understanding our results of operations, including performance metrics that management uses to assess the Company's performance. Throughout this MD&A, we commonly discuss the following performance metrics:\n•\nSame-store sales growth is the estimated percentage change in system sales of all restaurants that have been open and in the YUM system for one year or more, including those temporarily closed. From time-to-time restaurants may be temporarily closed due to remodeling or image enhancement, rebuilding, natural disasters, health epidemic or pandemic, landlord disputes, boycotts, social or civil unrest or other issues. The system sales of restaurants we deem temporarily closed remain in our base for purposes of determining same-store sales growth and the restaurants remain in our unit count (see below). \n28\nSame-store sales growth excludes, for subsidiaries operating on a monthly calendar, the extra day resulting from a leap year and excludes, for subsidiaries operating on a weekly periodic calendar, the last week of the year in fiscal years with 53rd weeks. We believe same-store sales growth is useful to investors because our results are heavily dependent on the results of our Concepts' existing store base.  Additionally, same-store sales growth is reflective of the strength of our Brands, the effectiveness of our operational and advertising initiatives and local economic and consumer trends. \n•\nGross unit openings reflects new openings by us and our franchisees. Net new unit growth reflects gross unit openings offset by permanent store closures, by us and our franchisees. To determine whether a restaurant meets the definition of a unit we consider whether the restaurant has operations that are ongoing and independent from another YUM unit, serves the primary product of one of our Concepts, operates under a separate franchise agreement (if operated by a franchisee) and has substantial and sustainable sales.  We believe gross unit openings and net new unit growth are useful to investors because we depend on new units for a significant portion of our growth.  Additionally, gross unit openings and net new unit growth are generally reflective of the economic returns to us and our franchisees from opening and operating our Concept restaurants.\n•\nSystem sales and System sales excluding the impacts of foreign currency translation (“FX”) reflect the results of all restaurants regardless of ownership, including Company-owned and franchise restaurants. Sales at franchise restaurants typically generate ongoing franchise and license fees for the Company at a rate of 3% to 6% of sales. Increasingly, customers are paying a fee to a third party to deliver or facilitate the ordering of our Concepts' products. We also include in System sales any portion of the amount customers pay these third parties for which the third party is obligated to pay us a license fee as a percentage of such amount. Franchise restaurant sales and fees paid by customers to third parties to deliver or facilitate the ordering of our Concepts' products are not included in Company sales on the Condensed Consolidated Statements of Income; however, any resulting franchise and license fees we receive are included in the Company's revenues. We believe System sales growth is useful to investors as a significant indicator of the overall strength of our business as it incorporates our primary revenue drivers, Company and franchise same-store sales as well as net new unit growth.\nIn addition to the results provided in accordance with Generally Accepted Accounting Principles in the United States of America (\n“\nGAAP\n”\n), the Company provides the following non-GAAP measurements:\n•\nDiluted Earnings Per Share excluding Special Items (as defined below);\n•\nEffective Tax Rate excluding Special Items;\n•\nCore Operating Profit. Core Operating Profit excludes Special Items and FX and we use Core Operating Profit for the purposes of evaluating performance internally;\n•\nNet Income excluding Special Items;\n•\nCompany restaurant profit and Company restaurant margin as a percentage of sales (as defined below).\nThese non-GAAP measurements are not intended to replace the presentation of our financial results in accordance with GAAP. Rather, the Company believes that the presentation of these non-GAAP measurements provide additional information to investors to facilitate the comparison of past and present operations.\nSpecial Items are not included in any of our Division segment results as the Company does not believe they are indicative of our ongoing operations due to their size and/or nature.  Our chief operating decision maker does not consider the impact of Special Items when assessing segment performance.\nCompany restaurant profit is defined as Company sales less Company restaurant expenses, both of which appear on the face of our Condensed Consolidated Statements of Income.  Company restaurant expenses include those expenses incurred directly by our Company-owned restaurants in generating Company sales, including cost of food and paper, cost of restaurant-level labor, rent, depreciation and amortization of restaurant-level assets and advertising expenses incurred by and on behalf of that Company restaurant. Company restaurant margin as a percentage of sales (“Company restaurant margin %”) is defined as Company restaurant profit divided by Company sales.  We use Company restaurant profit for the purposes of internally evaluating the performance of our Company-owned restaurants and we believe Company restaurant profit provides useful information to investors as to the profitability of our Company-owned restaurants. In calculating Company restaurant profit, the Company excludes revenues and expenses directly associated with our franchise operations as well as non-restaurant-level costs included in General and administrative expenses, some of which may support Company-owned restaurant operations.  The \n29\nCompany also excludes restaurant-level asset impairment and closures expenses, which have historically not been significant, from the determination of Company restaurant profit as such expenses are not believed to be indicative of ongoing operations. Further, while we generally include depreciation and amortization of restaurant-level assets within Divisional Company restaurant expenses used to derive Divisional Company restaurant profit, we record amortization of reacquired franchise rights arising from acquisition accounting within Corporate and unallocated Company restaurant expenses as such amortization is not believed to be indicative of ongoing Divisional results as well as to enhance comparability of acquired stores' margins with those of existing restaurants for which reacquired franchise rights are not applicable. Company restaurant profit and Company restaurant margin % as presented may not be comparable to other similarly titled measures of other companies in the industry. \nCertain performance metrics and non-GAAP measurements are presented excluding the impact of FX. These amounts are derived by translating current year results at prior year average exchange rates. We believe the elimination of the FX impact provides better year-to-year comparability without the distortion of foreign currency fluctuations.\nResults of Operations\nSummary\n  \nAll comparisons within this summary are versus the same period a year ago. \nQuarterly Financial Highlights:\n% Change\nSystem Sales, ex FX\nSame-Store Sales\nUnits\nGAAP Operating Profit\nCore Operating Profit\nKFC Division\n+6\n+3\n+6\n+16\n+14\nTaco Bell Division\n+9\n+7\n+3\n+7\n+7\nPizza Hut Division\n(1)\n(1)\nEven\n(8)\n(8)\nYUM\n+5\n+3\n+3\n+8\n+7\nYear to date Financial Highlights:\n% Change\nSystem Sales, ex FX\nSame-Store Sales\nUnits\nGAAP Operating Profit\nCore Operating Profit\nKFC Division\n+5\n+2\n+6\n+10\n+10\nTaco Bell Division\n+9\n+7\n+3\n+9\n+9\nPizza Hut Division\n(2)\n(1)\nEven\n(14)\n(14)\nYUM\n+5\n+3\n+3\n+5\n+6\nAdditionally:\n•\nForeign currency translation favorably impacted Divisional Operating Profit by $7 million and $1 million for the quarter and year to date ended September 30, 2025, respectively.\nThird Quarter\nYear to date\n2025\n2024\n% Change\n2025\n2024\n% Change\nGAAP EPS\n$1.41\n$1.35\n+5\n$3.64\n$3.73\n(2)\nLess Special Items EPS\n$(0.16)\n$(0.02)\nNM\n$(0.67)\n$(0.14)\nNM\nEPS Excluding Special Items\n$1.58\n$1.37\n+15\n$4.32\n$3.87\n+11\n•\nOur diluted EPS, excluding Special Items, for the year to date ended September 30, 2024, was unfavorably impacted by $0.08 from after-tax investment losses.\n30\n•\nGross unit openings for the quarter were 1,131 units resulting in 744 net new units.  Gross unit openings for the year to date were 2,753 units resulting in 670 net new units.\n◦\nNet new unit growth for the year to date was impacted by unit closures in Turkey. On January 8, 2025, we terminated our franchise agreements with franchisee IS Gida A.S. (IS Gida), the owner and operator of KFC and Pizza Hut restaurants in Turkey and a subsidiary of IS Holding A.S., after failure by IS Gida to meet our standards. As a result, 283 KFC and 254 Pizza Hut restaurants in Turkey were closed in January.\nWorldwide\nGAAP Results\n \nQuarter ended\nYear to date\n \n2025\n2024\n% B/(W)\n2025\n2024\n% B/(W)\nCompany sales\n$\n697 \n$\n621 \n12 \n$\n1,974 \n$\n1,667 \n18 \nFranchise and property revenues\n857 \n804 \n7 \n2,476 \n2,350 \n5 \nFranchise contributions for advertising and other services\n426 \n401 \n6 \n1,249 \n1,170 \n7 \nTotal revenues\n1,979 \n1,826 \n8 \n5,699 \n5,187 \n10 \nCompany restaurant expenses\n587 \n523 \n(12)\n1,668 \n1,393 \n(20)\nG&A expenses\n282 \n263 \n(7)\n885 \n830 \n(7)\nFranchise and property expenses\n35 \n36 \n6 \n107 \n90 \n(19)\nFranchise advertising and other services expense\n427 \n401 \n(7)\n1,251 \n1,169 \n(7)\nRefranchising (gain) loss\n(17)\n(12)\n37 \n(33)\n(31)\n6 \nOther (income) expense\n(1)\n(4)\nNM\n(15)\n(10)\nNM\nTotal costs and expenses, net\n1,313 \n1,207 \n(9)\n3,863 \n3,441 \n(12)\nOperating Profit\n666 \n619 \n8 \n1,836 \n1,746 \n5 \nInvestment (income) expense, net\n— \n(1)\nNM\n(1)\n21 \nNM\nOther pension (income) expense\n1 \n(2)\n(154)\n— \n(5)\n(93)\nInterest expense, net\n124 \n120 \n(4)\n368 \n358 \n(3)\nIncome before income taxes\n541 \n502 \n8 \n1,470 \n1,372 \n7 \nIncome tax provision (benefit)\n144 \n120 \n(21)\n446 \n309 \n(44)\nNet Income\n$\n397 \n$\n382 \n4 \n$\n1,024 \n$\n1,063 \n(4)\nDiluted EPS\n(a)\n$\n1.41 \n$\n1.35 \n5 \n$\n3.64 \n$\n3.73 \n(2)\nEffective tax rate\n26.7 \n%\n23.8 \n%\n(2.9)\nppts.\n30.3 \n%\n22.5 \n%\n(7.8)\nppts.\n(a)\nSee Note 3 for the number of shares used in this calculation.\nPerformance Metrics\nUnit Count\n9/30/2025\n9/30/2024\n% Increase (Decrease)\nFranchise\n60,640 \n58,775 \n3 \nCompany-owned\n1,376 \n1,270 \n8 \nTotal\n62,016 \n60,045 \n3 \nQuarter ended\nYear to date\n \n2025\n2024\n2025\n2024\nSame-store Sales Growth (Decline) %\n3 \n(2)\n3 \n(2)\nSystem Sales Growth %, reported\n6 \n1 \n5 \n1 \nSystem Sales Growth %, excluding FX\n5 \n1 \n5 \n2 \n31\nOur system sales breakdown by Company and franchise sales was as follows:\nQuarter ended\nYear to date\n2025\n2024\n2025\n2024\nConsolidated\nCompany sales\n(a)\n$\n697 \n$\n621 \n$\n1,974 \n$\n1,667 \nFranchise sales\n16,354 \n15,401 \n46,858 \n44,952 \nSystem sales\n17,051 \n16,022 \n48,832 \n46,619 \nNegative (Positive) Foreign Currency Impact\n(b)\n(167)\nN/A\n(26)\nN/A\nSystem sales, excluding FX\n$\n16,884 \n$\n16,022 \n$\n48,806 \n$\n46,619 \nKFC Division\nCompany sales\n(a)\n$\n259 \n$\n220 \n$\n721 \n$\n488 \nFranchise sales\n9,081 \n8,449 \n25,681 \n24,535 \nSystem sales\n9,340 \n8,669 \n26,401 \n25,023 \nNegative (Positive) Foreign Currency Impact\n(b)\n(134)\nN/A\n(31)\nN/A\nSystem sales, excluding FX\n$\n9,206 \n$\n8,669 \n$\n26,370 \n$\n25,023 \nTaco Bell Division\nCompany sales\n(a)\n$\n298 \n$\n267 \n$\n848 \n$\n775 \nFranchise sales\n4,070 \n3,741 \n11,775 \n10,847 \nSystem sales\n4,368 \n4,008 \n12,623 \n11,622 \nNegative (Positive) Foreign Currency Impact\n(b)\n(7)\nN/A\n(5)\nN/A\nSystem sales, excluding FX\n$\n4,362 \n$\n4,008 \n$\n12,618 \n$\n11,622 \nPizza Hut Division\nCompany sales\n(a)\n$\n9 \n$\n1 \n$\n20 \n$\n5 \nFranchise sales\n3,167 \n3,183 \n9,301 \n9,486 \nSystem sales\n3,177 \n3,184 \n9,321 \n9,491 \nNegative (Positive) Foreign Currency Impact\n(b)\n(26)\nN/A\n10 \nN/A\nSystem sales, excluding FX\n$\n3,151 \n$\n3,184 \n$\n9,331 \n$\n9,491 \nHabit Burger & Grill Division\nCompany sales\n(a)\n$\n130 \n$\n133 \n$\n385 \n$\n399 \nFranchise sales\n36 \n28 \n101 \n84 \nSystem sales\n166 \n161 \n486 \n483 \nNegative (Positive) Foreign Currency Impact\n(b)\n— \nN/A\n— \nN/A\nSystem sales, excluding FX\n$\n166 \n$\n161 \n$\n486 \n$\n483 \n(a)\nCompany sales represents sales from our Company-operated stores as presented on our Condensed Consolidated Statements of Income. \n(b)    The foreign currency impact on System sales is presented in relation only to the immediately preceding year presented. When determining applicable System sales growth percentages, the System sales excluding FX for the current year should be compared to the prior year System sales.\nNon-GAAP Items\nNon-GAAP Items, along with the reconciliation to the most comparable GAAP financial measure, as presented below.\nQuarter ended\nYear to date\n2025\n2024\n2025\n2024\nCore Operating Profit Growth %\n7 \n3 \n6 \n6 \nDiluted EPS Growth %, excluding Special Items\n15 \n(5)\n11 \n(1)\nEffective Tax Rate excluding Special Items\n20.8 \n%\n23.9 \n%\n21.4 \n%\n22.9 \n%\nCompany restaurant profit\n$\n110 \n$\n98 \n$\n306 \n$\n274 \nCompany restaurant margin % \n15.8 \n%\n15.8 \n%\n15.5 \n%\n16.4 \n%\n32\nReconciliation of GAAP Operating Profit to Core Operating Profit\nQuarter ended\nYear to date\n2025\n2024\n2025\n2024\nConsolidated\nGAAP Operating Profit \n$\n666 \n$\n619 \n$\n1,836 \n$\n1,746 \nDetail of Special Items:\n(Gain) Loss associated with market-wide refranchisings\n(a)\n— \n(1)\n— \n3 \nCharges associated with Resource Optimization\n(b)\n5 \n12 \n37 \n58 \nCharges associated with Brand HQ Consolidation\n(c)\n3 \n— \n20 \n— \nGerman acquisition and Turkey termination-related costs\n(d)\n1 \n— \n8 \n— \nPizza Hut Strategic Options Review\n(e)\n8 \n— \n8 \n— \nSpecial Items Expense - Operating Profit\n18 \n11 \n73 \n61 \n(Positive) Foreign Currency Impact on Division Operating Profit\n(7)\nN/A\n(1)\nN/A\nCore Operating Profit\n$\n677 \n$\n630 \n$\n1,909 \n$\n1,807 \nSpecial Items as shown above were recorded to the financial statement line items identified below.\nCondensed Consolidated Statements of Income Line Item\nDecrease in Franchise and property revenues\n$\n4 \n$\n— \n$\n5 \n$\n— \nIncrease in General and administrative expenses\n14 \n11 \n71 \n57 \nIncrease in Refranchising (gain) loss\n— \n(1)\n— \n3 \nIncrease in Other (income) expense\n— \n1 \n(3)\n1 \nSpecial Items Expense - Operating Profit\n$\n18 \n$\n11 \n$\n73 \n$\n61 \nKFC Division\nGAAP Operating Profit\n$\n392 \n$\n339 \n$\n1,088 \n$\n986 \nNegative (Positive) Foreign Currency Impact\n(7)\nN/A\n(2)\nN/A\nCore Operating Profit\n$\n385 \n$\n339 \n$\n1,086 \n$\n986 \nTaco Bell Division\nGAAP Operating Profit\n$\n267 \n$\n251 \n$\n770 \n$\n709 \nNegative (Positive) Foreign Currency Impact\n— \nN/A\n— \nN/A\nCore Operating Profit\n$\n267 \n$\n251 \n$\n770 \n$\n709 \nPizza Hut Division\nGAAP Operating Profit\n$\n84 \n$\n91 \n$\n239 \n$\n278 \nNegative (Positive) Foreign Currency Impact\n— \nN/A\n1 \nN/A\nCore Operating Profit\n$\n84 \n$\n91 \n$\n240 \n$\n278 \nHabit Burger & Grill Division\nGAAP Operating Profit (Loss)\n$\n(2)\n$\n1 \n$\n— \n$\n(2)\nNegative (Positive) Foreign Currency Impact\n— \nN/A\n— \nN/A\nCore Operating Profit (Loss)\n$\n(2)\n$\n1 \n$\n— \n$\n(2)\nReconciliation of GAAP Net Income to Net Income excluding Special Items\nGAAP Net Income\n$\n397 \n$\n382 \n$\n1,024 \n$\n1,063 \nSpecial Items Expense - Operating Profit\n18 \n11 \n73 \n61 \nSpecial Items Tax Expense (Benefit)\n(f)\n28 \n(2)\n116 \n(19)\nNet Income excluding Special Items\n$\n442 \n$\n391 \n$\n1,214 \n$\n1,105 \n33\nQuarter ended\nYear to date\n2025\n2024\n2025\n2024\nReconciliation of Diluted EPS to Diluted EPS excluding Special Items\n \n \nDiluted EPS\n$\n1.41 \n$\n1.35 \n$\n3.64 \n$\n3.73 \nLess Special Items Diluted EPS\n(0.16)\n(0.02)\n(0.67)\n(0.14)\nDiluted EPS excluding Special Items\n$\n1.58 \n$\n1.37 \n$\n4.32 \n$\n3.87 \nReconciliation of GAAP Effective Tax Rate to Effective Tax Rate excluding Special Items\nGAAP Effective Tax Rate\n26.7 \n%\n23.8 \n%\n30.3 \n%\n22.5 \n%\nImpact on Tax Rate as a result of Special Items\n5.9 \n%\n(0.1)\n%\n8.9 \n%\n(0.4)\n%\nEffective Tax Rate excluding Special Items\n20.8 \n%\n23.9 \n%\n21.4 \n%\n22.9 \n%\n(a)    Due to their size and volatility, we have reflected as Special Items those refranchising gains and losses that were recorded in connection with market-wide refranchisings. During the quarter and year to date ended September 30, 2024, we recorded net refranchising gains of $1 million and net refranchising losses of $3 million, respectively, that have been reflected as Special Items.  \nAdditionally, we recorded net refranchising gains of $17 million and $11 million during the quarters ended September 30, 2025 and 2024, respectively, that have not been reflected as Special Items. During the years to date ended September 30, 2025 and 2024, we recorded net refranchising gains of $33 million and $34 million, respectively, that have not been reflected as Special Items. These net refranchising gains relate to refranchising of restaurants unrelated to market-wide refranchisings that we believe are indicative of our expected ongoing refranchising activity.\n(b)\nWe recorded charges of $5 million and $37 million during the quarter and year to date ended September 30, 2025, respectively, and $12 million and $58 million during the quarter and year to date ended September 30, 2024, respectively, primarily to Corporate and unallocated General and administrative expenses related to a resource optimization program. Over the past several years, this program has allowed us to reallocate significant resources to accelerate our digital, technology and innovation capabilities to deliver a modern, world-class team member and customer experience and improve unit economics. We expanded the program in 2024 to identify further opportunities to optimize the Company’s spending and identify additional, critical areas in which to potentially reallocate resources, both with a goal to enable the acceleration of the Company’s growth rate. Costs incurred to date related to the program primarily include severance associated with positions that have been eliminated or relocated and consultant fees. Due to their scope and size, these charges have been reflected as Special Items.\n(c)\nDuring the quarter and year to date ended September 30, 2025, we recorded charges of approximately $3 million and $20 million, respectively, to Corporate and unallocated General and administrative expenses associated with our decision to designate two brand headquarters in the U.S., located in Plano, Texas and Irvine, California, to foster greater collaboration among brands and employees. This involved relocating the KFC U.S. corporate office to a KFC Global headquarters and requiring the majority of our U.S.-based remote employees to relocate to an appropriate headquarter office. Costs incurred to date primarily include severance for the employees who have chosen not to relocate and consultant fees. Due to their scope and size, these charges have been reflected as Special Items. \n(d)\nOn January 8, 2025, we terminated our franchise agreements with franchisee IS Gida A.S. (IS Gida), the owner and operator of KFC and Pizza Hut restaurants in Turkey and a subsidiary of IS Holding A.S. (IS Holding), after failure by IS Gida to meet our standards. As a result, 283 KFC restaurants and 254 Pizza Hut restaurants in Turkey were closed during the first quarter of 2025. We also re-acquired the master franchise rights in Germany for KFC and Pizza Hut from the owner of IS Holding in December 2024. We recorded charges of $1 million and $8 million during the quarter and year to date ended September 30, 2025, respectively, to Corporate and unallocated General and administrative expenses consisting primarily of severance costs associated with re-acquiring the master franchise rights in Germany. Consistent with prior charges related to the matter, these charges have been reflected as Special Items.\n(e)\nWe have begun a review of strategic options for the Pizza Hut brand. During the quarter ended September 30, 2025, we incurred approximately $4 million in third-party advising costs associated with this strategic options review and wrote-off approximately $4 million of franchise incentive assets associated with rationalizing the Pizza Hut estate in preparation for a potential transaction. These charges were recorded to Corporate and unallocated General and administrative expenses and Corporate and unallocated franchise and property revenues, respectively. Given the \n34\nsignificance of the costs expected to be incurred through the course of this strategic options review, we have reflected such amounts as Special Items.\n(f)\nThe below table includes the detail of Special Items Tax Expense (Benefit): \nQuarter ended\nYear to date\n9/30/2025\n9/30/2024\n9/30/2025\n9/30/2024\nTax (Benefit) on Special Items Expense\n$\n(4)\n$\n(2)\n$\n(18)\n$\n(15)\nTax Expense - Foreign tax reserve\n3 \n— \n105 \n— \nTax Expense - U.S. OBBBA\n76 \n— \n76 \n— \nTax (Benefit) - Tax audit\n(47)\n— \n(47)\n— \nTax (Benefit) - Other Income tax impacts recorded as Special\n— \n— \n— \n(4)\nSpecial Items Tax Expense (Benefit)\n$\n28 \n$\n(2)\n$\n116 \n$\n(19)\nTax Benefit on Special Items Expense was determined by assessing the tax impact of each individual component within Special Items based upon the nature of the item and jurisdictional tax law. \nTax Expense - Foreign tax reserve in the year to date ended September 30, 2025, is associated with a reserve, and the ongoing foreign exchange and inflationary adjustments, associated with a change in management's judgment around a Mexican subsidiary's ability to utilize losses to offset recapture gains triggered by a historical tax deconsolidation in Mexico (see Note 7). This tax expense was reflected as a Special Item due to its size and the time elapsed since the years to which the reserve relates.\nTax Expense - U.S. OBBBA in the quarter and year to date ended September 30, 2025, reflects the tax expense recorded upon the July 4, 2025, enactment of H.R.1, commonly known as the One Big Beautiful Bill Act (“OBBBA”) in the United States. The tax expense was primarily associated with a change in management's judgment regarding our ability to utilize U.S. foreign tax credit related deferred tax assets that existed at the date of enactment and has been reflected as a Special Item due to the size of the non-recurring adjustment necessary upon enactment of the legislation.\nTax (Benefit) - Tax audit in the quarter and year to date ended September 30, 2025, reflects the benefit associated with the reversal of a reserve due to a favorable audit resolution. Such reserve was established in prior years and was originally recorded as a Special Item.\nOther Income tax impacts recorded as Special in the year to date ended September 30, 2024, include benefits related to the reversal of a reserve due to the favorable resolution of a tax audit in a foreign jurisdiction. Such reserve was established in prior years related to income tax liabilities originally recorded as a Special Item as part of an intercompany restructuring of intellectual property.\n35\nReconciliation of GAAP Operating Profit to Company Restaurant Profit\nQuarter ended 9/30/2025\nKFC Division\nTaco Bell Division\nPizza Hut Division\nHabit Burger & Grill Division\nCorporate and Unallocated\nConsolidated\nGAAP Operating Profit (Loss)\n$\n392 \n$\n267 \n$\n84 \n$\n(2)\n$\n(75)\n$\n666 \nLess:\nFranchise and property revenues\n459 \n254 \n146 \n3 \n(4)\n857 \nFranchise contributions for advertising and other services\n161 \n178 \n85 \n1 \n— \n426 \nAdd:\nGeneral and administrative expenses\n88 \n50 \n50 \n13 \n80 \n282 \nFranchise and property expenses\n15 \n8 \n11 \n1 \n— \n35 \nFranchise advertising and other services expense\n160 \n177 \n89 \n1 \n— \n427 \nRefranchising (gain) loss\n— \n— \n— \n— \n(17)\n(17)\nOther (income) expense\n— \n— \n(4)\n— \n3 \n(1)\nCompany restaurant profit (loss)\n$\n36 \n$\n71 \n$\n(1)\n$\n9 \n$\n(4)\n$\n110 \nCompany sales\n$\n259 \n$\n298 \n$\n9 \n$\n130 \n$\n— \n$\n697 \nCompany restaurant margin %\n13.7 \n%\n23.7 \n%\n(12.2)\n%\n7.0 \n%\nN/A\n15.8 \n%\nQuarter ended 9/30/2024\nKFC Division\nTaco Bell Division\nPizza Hut Division\nHabit Burger & Grill Division\nCorporate and Unallocated\nConsolidated\nGAAP Operating Profit (Loss) \n$\n339 \n$\n251 \n$\n91 \n$\n1 \n$\n(63)\n$\n619 \nLess:\nFranchise and property revenues\n417 \n234 \n150 \n3 \n— \n804 \nFranchise contributions for advertising and other services\n148 \n165 \n87 \n1 \n— \n401 \nAdd:\nGeneral and administrative expenses\n86 \n41 \n51 \n11 \n74 \n263 \nFranchise and property expenses\n20 \n6 \n9 \n1 \n— \n36 \nFranchise advertising and other services expense\n148 \n163 \n89 \n1 \n— \n401 \nRefranchising (gain) loss\n— \n— \n— \n— \n(12)\n(12)\nOther (income) expense\n— \n— \n(3)\n1 \n(2)\n(4)\nCompany restaurant profit (loss)\n$\n28 \n$\n62 \n$\n— \n$\n11 \n$\n(3)\n$\n98 \nCompany sales\n$\n220 \n$\n267 \n$\n1 \n$\n133 \n$\n— \n$\n621 \nCompany restaurant margin % \n12.5 \n%\n23.4 \n%\n(6.1)\n%\n8.3 \n%\nN/A\n15.8 \n%\n36\nYear to date 9/30/2025\nKFC Division\nTaco Bell Division\nPizza Hut Division\nHabit Burger & Grill Division\nCorporate and Unallocated\nConsolidated\nGAAP Operating Profit (Loss)\n$\n1,088 \n$\n770 \n$\n239 \n$\n— \n$\n(260)\n$\n1,836 \nLess:\nFranchise and property revenues\n1,303 \n735 \n436 \n8 \n(5)\n2,476 \nFranchise contributions for advertising and other services\n478 \n514 \n255 \n2 \n— \n1,249 \nAdd:\nGeneral and administrative expenses\n255 \n148 \n159 \n39 \n285 \n885 \nFranchise and property expenses\n51 \n22 \n32 \n3 \n— \n107 \nFranchise advertising and other services expense\n472 \n510 \n268 \n2 \n— \n1,251 \nRefranchising (gain) loss\n— \n— \n— \n— \n(33)\n(33)\nOther (income) expense\n1 \n— \n(9)\n1 \n(8)\n(15)\nCompany restaurant profit (loss)\n$\n85 \n$\n199 \n$\n(2)\n$\n34 \n$\n(11)\n$\n306 \nCompany sales\n$\n721 \n$\n848 \n$\n20 \n$\n385 \n$\n— \n$\n1,974 \nCompany restaurant margin % \n11.9 \n%\n23.5 \n%\n(9.2)\n%\n8.7 \n%\nN/A\n15.5 \n%\nYear to date 9/30/2024\nKFC Division\nTaco Bell Division\nPizza Hut Division\nHabit Burger & Grill Division\nCorporate and Unallocated\nConsolidated\nGAAP Operating Profit (Loss)\n$\n986 \n$\n709 \n$\n278 \n$\n(2)\n$\n(225)\n$\n1,746 \nLess:\nFranchise and property revenues\n1,219 \n678 \n446 \n7 \n— \n2,350 \nFranchise contributions for advertising and other services\n427 \n477 \n264 \n2 \n— \n1,170 \nAdd:\nGeneral and administrative expenses\n253 \n137 \n153 \n38 \n249 \n830 \nFranchise and property expenses\n46 \n22 \n19 \n3 \n— \n90 \nFranchise advertising and other services expense\n424 \n473 \n270 \n2 \n— \n1,169 \nRefranchising (gain) loss\n— \n— \n— \n— \n(31)\n(31)\nOther (income) expense\n(3)\n(1)\n(10)\n1 \n3 \n(10)\nCompany restaurant profit (loss)\n$\n60 \n$\n185 \n$\n— \n$\n33 \n$\n(4)\n$\n274 \nCompany sales\n$\n488 \n$\n775 \n$\n5 \n$\n399 \n$\n— \n$\n1,667 \nCompany restaurant margin % \n12.2 \n%\n23.9 \n%\n(1.9)\n%\n8.2 \n%\nN/A\n16.4 \n%\nItems Impacting Reported Results and Reasonably Likely to Impact Future Results\nThe following items impacted reported results in 2025 and/or 2024 and/or are reasonably likely to impact future results. See also the Detail of Special Items in this MD&A for other items impacting results in 2025 or 2024.  \nInvestment in Devyani \nDuring the quarter ended March 31, 2024, we sold our approximate 5% minority investment in Devyani International Limited (\"Devyani\"), a franchise entity that operates KFC and Pizza Hut restaurants in India, for pre-tax proceeds of $104 million. Changes in the fair value of our ownership interest in Devyani prior to the date of sale resulted in pre-tax investment losses of $20 million in the year to date ended September 30, 2024.\n37\nImpact of Tax Law Changes\nOn July 4, 2025, H.R.1, commonly known as the One Big Beautiful Bill Act (\"OBBBA\") was enacted into law in the U.S. The OBBBA includes a broad range of domestic and international tax reform provisions, including extending and modifying certain key provisions from the Tax Cuts and Jobs Act, as well as provisions allowing accelerated tax deductions for qualified depreciable property and research expenditures. The OBBBA has multiple effective dates, with certain provisions becoming effective in 2025 and others effective through 2027. We currently anticipate the OBBBA will have a favorable impact on our ongoing effective tax rate beginning in 2026.\nPizza Hut Strategic Options Review\nWe have begun a review of strategic options for the Pizza Hut brand. We have not set a deadline or definitive timetable for the completion of the strategic options review, and there can be no assurance this review will result in any specific outcome or transaction. We incurred certain costs during the quarter ended September 30, 2025 associated with this strategic options review (see Detail of Special Items section of this MD&A) and expect to incur further costs of a currently indeterminate amount as this strategic options review progresses.\nKFC Division\nThe KFC Division has 32,951 units, 89% of which are located outside the U.S. Additionally, 99% of the KFC Division units were operated by franchisees as of September 30, 2025.\nQuarter ended\nYear to date\n% B/(W)\n% B/(W)\n2025\n2024\nReported\nEx FX\n2025\n2024\nReported\nEx FX\nSystem Sales \n$\n9,340 \n$\n8,669 \n8 \n6 \n$\n26,401 \n$\n25,023 \n6 \n5 \nSame-Store Sales Growth (Decline) %\n3 \n(4)\nN/A\nN/A\n2 \n(3)\nN/A\nN/A\nCompany sales\n$\n259 \n$\n220 \n18 \n15 \n$\n721 \n$\n488 \n48 \n46 \nFranchise and property revenues\n459 \n417 \n10 \n8 \n1,303 \n1,219 \n7 \n7 \nFranchise contributions for advertising and other services\n161 \n148 \n9 \n7 \n478 \n427 \n12 \n11 \nTotal revenues\n$\n879 \n$\n785 \n12 \n10 \n$\n2,501 \n$\n2,134 \n17 \n16 \nCompany restaurant profit\n$\n36 \n$\n28 \n29 \n26 \n$\n85 \n$\n60 \n43 \n41 \nCompany restaurant margin %\n13.7 \n%\n12.5 \n%\n1.2 \nppts.\n1.3 \nppts.\n11.9 \n%\n12.2 \n%\n(0.3)\nppts.\n(0.3)\nppts.\nG&A expenses\n$\n88 \n$\n86 \n(2)\nEven\n$\n255 \n$\n253 \n(1)\nEven\nFranchise and property expenses\n15 \n20 \n26 \n29 \n51 \n46 \n(10)\n(9)\nFranchise advertising and other services expense\n160 \n148 \n(9)\n(7)\n472 \n424 \n(11)\n(10)\nOperating Profit\n$\n392 \n$\n339 \n16 \n14 \n$\n1,088 \n$\n986 \n10 \n10 \n% Increase (Decrease)\nUnit Count\n9/30/2025\n9/30/2024\nFranchise\n32,463 \n30,684 \n6 \nCompany-owned\n488 \n459 \n6 \nTotal\n32,951 \n31,143 \n6 \n38\nCompany sales and Company restaurant margin %\nThe quarterly increase in Company sales, excluding the impacts of foreign currency translation, was driven by restaurant acquisitions and Company same-store sales growth of 6%.\nThe year to date increase in Company sales, excluding the impacts of foreign currency translation, was driven by the KFC U.K. and Ireland restaurant acquisition (see Note 2) in the second quarter of 2024 and Company same-store sales growth of 4%.\nThe quarterly increase in Company restaurant margin percentage was driven by Company same-store sales growth.\nThe year to date decrease in Company restaurant margin percentage was driven by the margin percentages of the units included in the KFC U.K. and Ireland restaurant acquisition, partially offset by Company same-store sales growth. \nFranchise and property revenues\nThe quarterly increase in Franchise and property revenues, excluding the impacts of foreign currency translation, was driven by franchise same-store sales growth of 3% and unit growth.\nThe year to date increase in Franchise and property revenues, excluding the impacts of foreign currency translation, was driven by franchise same-store sales growth of 2% and unit growth, partially offset by a 1% negative impact from the KFC U.K. and Ireland restaurant acquisition.\nG&A \nG&A, excluding the impacts of foreign currency translation, was flat during the quarter as higher expenses related to our annual incentive compensation programs were offset by lower headcount and salaries.\nG&A, excluding the impacts of foreign currency translation, was flat year to date as higher expenses related to our annual incentive compensation programs and the operation of acquired KFC U.K. and Ireland restaurants were offset by lower headcount and salaries.\nOperating Profit\nThe quarterly and year to date increases in Operating Profit, excluding the impacts of foreign currency translation, were driven by same-store sales growth and unit growth.\nTaco Bell Division\nThe Taco Bell Division has 8,816 units, 87% of which are in the U.S. The Company owned 7% of the Taco Bell Division units in the U.S. as of September 30, 2025.\n39\nQuarter ended\nYear to date\n% B/(W)\n% B/(W)\n2025\n2024\nReported\nEx FX\n2025\n2024\nReported\nEx FX\nSystem Sales \n$\n4,368 \n$\n4,008 \n9 \n9 \n$\n12,623 \n$\n11,622 \n9 \n9 \nSame-Store Sales Growth %\n7 \n4 \nN/A\nN/A\n7 \n3 \nN/A\nN/A\nCompany sales\n$\n298 \n$\n267 \n12 \n12 \n$\n848 \n$\n775 \n9 \n9 \nFranchise and property revenues\n254 \n234 \n8 \n8 \n735 \n678 \n8 \n8 \nFranchise contributions for advertising and other services\n178 \n165 \n9 \n9 \n514 \n477 \n8 \n8 \nTotal revenues\n$\n730 \n$\n666 \n10 \n10 \n$\n2,098 \n$\n1,930 \n9 \n9 \nCompany restaurant profit\n$\n71 \n$\n62 \n13 \n13 \n$\n199 \n$\n185 \n8 \n8 \nCompany restaurant margin %\n23.7 \n%\n23.4 \n%\n0.3 \nppts.\n0.3 \nppts.\n23.5 \n%\n23.9 \n%\n(0.4)\nppts.\n(0.4)\nppts.\nG&A expenses\n$\n50 \n$\n41 \n(22)\n(22)\n$\n148 \n$\n137 \n(8)\n(8)\nFranchise and property expenses\n8 \n6 \n(33)\n(33)\n22 \n22 \n3 \n3 \nFranchise advertising and other services expense\n177 \n163 \n(9)\n(9)\n510 \n473 \n(8)\n(8)\nOperating Profit\n$\n267 \n$\n251 \n7\n7\n$\n770 \n$\n709 \n9 \n9 \n% Increase (Decrease)\nUnit Count\n9/30/2025\n9/30/2024\nFranchise\n8,288 \n8,103 \n2 \nCompany-owned\n528 \n491 \n8 \nTotal\n8,816 \n8,594 \n3 \nCompany sales and Company restaurant margin %\nThe quarterly and year to date increases in Company sales were driven by company same-store sales growth of 6% and 5% for the quarter and year to date, respectively, and unit growth.\nThe quarterly restaurant margin percentage increase was driven by same store sales growth partially offset by commodity inflation (primarily beef), higher labor and other restaurant operating costs. \nThe year-to-date restaurant margin percentage decrease was driven by commodity inflation (primarily beef), higher labor and other restaurant operating costs partially offset by same store sales growth. \nFranchise and property revenues\nThe quarterly and year to date increases in Franchise and property revenues were driven by franchise same-store sales growth of 7% for both the quarter and year to date and unit growth.\nG&A \nThe quarterly increase in G&A was driven by higher expenses related to our annual incentive compensation programs, higher digital and technology expenses and increased professional and legal fees.  \n40\nThe year-to-date increase in G&A was driven by higher digital and technology expenses, higher expenses related to our annual incentive compensation programs and increased share-based compensation partially offset by lower professional and legal fees. \nOperating Profit\nThe quarterly increase in Operating Profit was driven by same-store sales growth and unit growth partially offset by higher G&A and higher restaurant operating costs.\nThe year to date increase in Operating Profit was driven by same-store sales growth and unit growth partially offset by higher restaurant operating costs.\nPizza Hut Division\nThe Pizza Hut Division has 19,872 units, 68% of which are located outside the U.S. The Pizza Hut Division uses multiple distribution channels including delivery, dine-in and express (e.g. airports) and includes units operating under both the Pizza Hut and Telepizza brands. Additionally, over 99% of the Pizza Hut Division units were operated by franchisees as of September 30, 2025.\nQuarter ended\nYear to date\n% B/(W)\n% B/(W)\n2025\n2024\nReported\nEx FX\n2025\n2024\nReported\nEx FX\nSystem Sales \n$\n3,177 \n$\n3,184 \nEven\n(1)\n$\n9,321 \n$\n9,491 \n(2)\n(2)\nSame-Store Sales Growth (Decline) %\n(1)\n(4)\nN/A\nN/A\n(1)\n(5)\nN/A\nN/A\nCompany sales\n$\n9 \n$\n1 \n520 \n520 \n$\n20 \n$\n5 \n301 \n301 \nFranchise and property revenues\n146 \n150 \n(3)\n(3)\n436 \n446 \n(2)\n(2)\nFranchise contributions for advertising and other services\n85 \n87 \n(2)\n(2)\n255 \n264 \n(4)\n(4)\nTotal revenues\n$\n240 \n$\n238 \n1 \nEven\n$\n710 \n$\n715 \n(1)\n(1)\nCompany restaurant profit (loss)\n$\n(1)\n$\n— \nNM\nNM\n$\n(2)\n$\n— \nNM\nNM\nCompany restaurant margin %\n(12.2)\n%\n(6.1)\n%\n(6.1)\nppts.\n(6.1)\nppts.\n(9.2)\n%\n(1.9)\n%\n(7.3)\nppts.\n(7.3)\nppts.\nG&A expenses\n$\n50 \n$\n51 \nEven\nEven\n$\n159 \n$\n153 \n(4)\n(4)\nFranchise and property expenses\n11 \n9 \n(12)\n(9)\n32 \n19 \n(67)\n(67)\nFranchise advertising and other services expense\n89 \n89 \nEven\nEven\n268 \n270 \n1 \n1 \nOperating Profit\n$\n84 \n$\n91 \n(8)\n(8)\n$\n239 \n$\n278 \n(14)\n(14)\n% Increase (Decrease)\nUnit Count\n9/30/2025\n9/30/2024\nFranchise\n19,814 \n19,920 \n(1)\nCompany-owned\n58 \n7 \n729 \nTotal\n19,872 \n19,927 \nEven\nFranchise and property revenues\nThe quarterly and year to date decreases in Franchise and property revenues, excluding the impact of foreign currency translation, were driven by franchise same-store sales declines of (1%).\n41\nG&A \nG&A, excluding the impact of foreign currency translation, was flat during the quarter.\nThe year to date increase in G&A, excluding the impact of foreign currency translation, was driven by higher professional and legal fees, including expenses associated with franchise entities that have or are transitioning to new ownership.\nOperating Profit\nThe quarterly decrease in Operating Profit, excluding the impact of foreign currency translation, was driven by a same store sales decline and higher current year bad debt expense (including bad debt expense associated with franchise entities that have or are transitioning to new ownership).\nThe year to date decrease in Operating Profit, excluding the impacts of foreign currency translation, was driven by higher current year bad debt expense (including bad debt expense associated with franchise entities that have or are transitioning to new ownership), higher G&A, a same store sales decline and timing of digital and technology related spending within Franchise advertising and other services expense.\nHabit Burger & Grill Division\nThe Habit Burger & Grill Division has 377 units, the vast majority of which are in the U.S. The Company owned 80% of the Habit Burger & Grill Division units in the U.S. as of September 30, 2025.  \nQuarter ended\nYear to date\n% B/(W)\n% B/(W)\n2025\n2024\nReported\nEx FX\n2025\n2024\nReported\nEx FX\nSystem Sales\n$\n166 \n$\n161 \n3 \n3 \n$\n486 \n$\n483 \n1 \n1 \nSame-Store Sales Growth (Decline) %\n1 \n(5)\nN/A\nN/A\n(2)\n(6)\nN/A\nN/A\nTotal revenues\n$\n134 \n$\n137 \n(1)\n(1)\n$\n395 \n$\n408 \n(3)\n(3)\nOperating Profit (Loss)\n$\n(2)\n$\n1 \n(572)\n(572)\n$\n— \n$\n(2)\n82 \n82 \nUnit Count\n9/30/2025\n9/30/2024\n% Increase (Decrease)\nFranchise\n75 \n68 \n10 \nCompany-owned\n302 \n313 \n(4)\nTotal\n377 \n381 \n(1)\nCorporate & Unallocated\nQuarter ended\nYear to date\n(Expense) / Income \n2025\n2024\n% B/(W)\n2025\n2024\n% B/(W)\nCorporate and unallocated G&A\n$\n(\n80\n)\n$\n(\n74\n)\n(10)\n$\n(\n285\n)\n$\n(\n249\n)\n(15)\nUnallocated Company restaurant expenses (See Note 9)\n(\n4\n)\n(\n3\n)\n(56)\n(\n11\n)\n(\n4\n)\n(171)\nUnallocated Franchise and property revenues\n(\n4\n)\n—\n \nNM\n(\n5\n)\n—\n \nNM\nUnallocated Refranchising gain (loss)\n17\n \n12\n \n37 \n33\n \n31\n \n6 \nUnallocated Other income (expense)\n(\n3\n)\n2\n \nNM\n8\n \n(\n3\n)\nNM\nInvestment income (expense), net (see Note 9)\n—\n \n1\n \nNM\n1\n \n(\n21\n)\nNM\nOther pension income (expense) (see Note 10)\n(\n1\n)\n2\n \n(154)\n—\n \n5\n \n(93)\nInterest expense, net\n(\n124\n)\n(\n120\n)\n(4)\n(\n368\n)\n(\n358\n)\n(3)\nIncome tax provision (See Note 7)\n(144)\n(120)\n(21)\n(446)\n(309)\n(44)\nEffective tax rate (See Note 7)\n26.7\n \n%\n23.8\n \n%\n(2.9)\nppts.\n30.3\n \n%\n22.5\n \n%\n(7.8)\nppts.\n42\nCorporate and unallocated G&A\nThe quarterly increase in Corporate and Unallocated G&A expense was driven by higher professional and legal fees and higher current year expenses related to our annual incentive compensation programs, partially offset by lower costs associated with our resource optimization program.\nThe year to date increase in Corporate and Unallocated G&A expense was driven by higher professional and legal fees, costs associated with our current year brand headquarters consolidation and higher current year expenses related to our annual incentive compensation programs, partially offset by lower costs associated with our resource optimization program.\nConsolidated Cash Flows \nNet cash provided by operating activities \nwas $1,393 million in 2025 versus $1,176 million in 2024. The increase was primarily driven by lower income tax payments in the current year, an increase in Operating Profit before Special Items and lower incentive compensation payments.\nNet cash used in investing activities \nwas $208 million in 2025 versus $292 million in 2024. The change was primarily driven by maturities of short-term investments in the current year compared to net purchases of short-term investments in the prior year and lower current year spending on restaurant acquisitions, partially offset by lapping prior year proceeds arising from the sale of our approximate 5% minority investment in Devyani and higher current year capital spending. \nNet cash used in financing activities \nwas $822 million in 2025 versus $991 million in 2024. The change was primarily driven by net borrowings in the current year compared to net repayments in the prior year.\nLiquidity and Capital Resources\nWe have historically generated substantial cash flows from our extensive franchise operations, which require a limited YUM investment, and from the operations of our Company-owned stores. Our annual operating cash flows have been in excess of $1.4 billion in each of the past four years and we expect that to continue to be the case in 2025. It is our intent to use these operating cash flows to continue to invest in growing our business and pay a competitive dividend, with any remaining excess then returned to shareholders through share repurchases. Subject to market conditions, we expect to maintain our consolidated net leverage ratio at approximately 4.0x Earnings Before Interest, Taxes, Depreciation and Amortization (\"EBITDA\") over the medium term by issuing incremental debt as our business grows. \nTo the extent operating cash flows plus other sources of cash do not cover our anticipated cash needs, we maintain a $1.5 billion Revolving Facility under our Credit Agreement that was undrawn as of September 30, 2025. Borrowings under our Revolving Facility have original maturities of three months or less. We believe that our ongoing cash from operations, cash on hand, which was approximately $1,050 million at September 30, 2025, and availability under our Revolving Facility will be sufficient to fund our cash requirements over the next twelve months.  \nThere have been no material changes to the disclosures made in Item 7 of the Company's 2024 Form 10-K regarding our material cash requirements, except that we executed purchase agreements with a franchisee to acquire 128 Taco Bell restaurants across the Southeast U.S. during the quarter ended September 30, 2025. These acquisitions are expected to close in the quarter ended December 31, 2025, with a total cash outlay of approximately $670 million, largely financed with cash on hand. \nDue to the ongoing significance of our debt obligations, we are providing the update below.\nDebt Instruments\nAs of September 30, 2025, approximately 96%, including the impact of interest rate swaps, of our $11.5 billion of total debt outstanding, excluding finance leases and debt issuance costs and discounts, is fixed with an effective overall interest rate of approximately 4.5%. \nWe ended the quarter with a consolidated net leverage ratio of 3.7x EBITDA. We continually reassess our optimal leverage ratio to maximize shareholder returns. We target a capital structure which we believe provides an attractive balance between optimized interest rates, duration and flexibility with diversified sources of liquidity and maturities spread over multiple years.\n \nWe have credit ratings of BB+ (Standard & Poor's)/Ba2 (Moody's). \n43\nThe following table summarizes the future maturities of our outstanding long-term debt, excluding finance leases and debt issuance costs and discounts, as of September 30, 2025.  \n2025\n2026\n2027\n2028\n2029\n2030\n2031\n2032\n2037\n2043\nTotal\nSecuritization Notes\n$\n884 \n$\n595 \n$\n590 \n$\n1,000 \n$\n737 \n$\n500 \n$\n4,306 \nCredit Agreement\n$\n7 \n$\n28 \n34\n1,424 \n438\n1,930 \nSubsidiary Senior Unsecured Notes\n750 \n750 \nYUM Senior Unsecured Notes\n800 \n1,050 \n2,100 \n$\n325 \n$\n275 \n4,550 \nTotal\n$\n7 \n$\n28 \n$\n1,668 \n$\n2,019 \n$\n1,028 \n$\n1,800 \n$\n1,787 \n$\n2,600 \n$\n325 \n$\n275 \n$\n11,536 \nSee Note 11 for details on the Securitization Notes, the Credit Agreement, Subsidiary Senior Unsecured Notes and YUM Senior Unsecured Notes, including a refinancing of certain Securitization Notes that took place in September 2025.\nNew Accounting Pronouncements Not Yet Adopted\nIn December 2023, the Financial Accounting Standards Board (\"FASB\") issued ASU 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures, which updates income tax disclosure requirements related to the income tax rate reconciliation and requires disclosure of income taxes paid by jurisdiction. The standard is effective for the Company's Annual Report on Form 10-K for fiscal 2025 with early adoption permitted. The amendments should be applied prospectively; however, retrospective application is permitted. We are currently evaluating the impact of the standard on our disclosures. \nIn November 2024, the FASB issued ASU 2024-03, Disaggregation of Income Statement Expenses (Subtopic 220-40), which requires new financial statement disclosures disaggregating prescribed expense categories within relevant income statement expense captions. The standard is effective for the Company's Annual Report on Form 10-K for fiscal 2027, and subsequent interim periods, with early adoption permitted. The amendments should be applied prospectively; however, retrospective application is permitted. We are currently evaluating the impact of the standard on our disclosures.\nIn September 2025, the FASB issued ASU 2025-06, Intangibles — Goodwill and Other — Internal-Use Software (Subtopic 350-40): Targeted Improvements to the Accounting for Internal-Use Software, which amends certain aspects of the accounting for software costs, including removing software development project stages and requiring companies to capitalize costs when both 1) management authorizes or commits to funding a software project and 2) it is probable that the project will be completed and the software will be used to perform the function intended. The standard is effective for the Company in our first quarter of fiscal 2028, with early adoption permitted and can be applied on a prospective, retrospective or modified prospective basis. We are currently evaluating the impact of the standard on our condensed consolidated financial statements."
}