{
  "source_file": "zbh-20241231.htm",
  "form_type": "10-K",
  "item1": null,
  "item7": "Item 7.\tManagement’s Discussion and Analysis of\n Financial Condition and Results of Operations\n\n\nOn March 1, 2022, we completed the spinoff of our spine and dental businesses into ZimVie.  The historical results of our spine and dental businesses have been reflected as discontinued operations in our consolidated financial statements in our 2022 results through the date of the spinoff.  See Note 3 to our consolidated financial statements for additional information.  The following discussion and analysis is presented on a continuing operations basis unless otherwise noted.\n\n\nThe following discussion and analysis should be read in conjunction with the consolidated financial statements and the corresponding notes included elsewhere in this Annual Report on Form 10-K.  Amounts reported in millions within this Annual Report on Form 10-K are computed based on the actual amounts.  As a result, the sum of the components may not equal the total amount reported in millions due to rounding.  In addition, certain columns and rows within tables may not sum to the totals due to the use of rounded numbers.  Percentages presented are calculated from the underlying unrounded amounts.\n \n\n\nThe following discussion, analysis and comparisons generally focus on the operating results for the years ended December 31, 2024 and 2023.  Discussion, analysis and comparisons of the years ended December 31, 2023 and 2022 that are not included in this Form 10-K can be found in “Management's Discussion and Analysis of Financial Condition and Results of Operations” in Exhibit 99.1 to our Current Report on Form 8-K filed on August 7, 2024.  The Current Report on Form 8-K filed on August 7, 2024 was filed solely to recast financial information and related disclosures contained in our Annual Report on Form 10-K for the year ended December 31, 2023 to reflect changes to the operating profit measures of our operating segments.\n\n\n \n\n\nEXECUTIVE LEVEL OVERVIEW\n\n\n2024 Financial Highlights\n\n\nIn 2024, our net sales increased 3.8 percent when compared to 2023. Net sales growth was driven by a combination of market growth, new product introductions, positive price realization and commercial execution across the organization. These favorable items were negatively impacted by our transition in July 2024 to a new enterprise resource planning (\"ERP\") software system for a significant portion of our U.S. and Canada sales and commercial operations. As a result of this ERP implementation, we experienced operational challenges which affected our ability to fulfill certain customer orders. This disruption mostly affected our U.S. net sales, but our International net sales were also impacted as shipments to our international affiliates were delayed. Shipping levels returned to similar levels that existed prior to the implementation by the end of the year. For the full year 2024, we estimate this ERP implementation had less than a one percent impact to our net sales. In addition, our net sales in 2024 were tempered by a negative 1.0 percent effect from changes in foreign currency exchange rates.\n\n\n \n\n\nOur net earnings were $903.8 million in 2024 compared to $1,024.0 million in 2023. The decline in net earnings was driven by higher favorable tax settlements in 2023 compared to 2024, higher charges from our 2023 Restructuring Plan which was instituted at the end of 2023 and continued into 2024, including $84.6 million in employee termination benefits-related charges recognized in 2024, and higher intangible asset amortization. These unfavorable items were partially offset by the net sales increase, savings from our 2023 Restructuring Plan and other initiatives, and lower research and development (\"R&D\") spending for initial compliance with the European Union Medical Device Regulation (\"EU MDR\").\n\n\n \n\n\n2025 Outlook (excludes any impacts from the proposed Paragon 28, Inc. acquisition)\n\n\nWe expect year-over-year revenue growth of 1.0 percent to 3.5 percent in 2025 to be driven by a combination of market growth, new product introductions and commercial execution.  Based on foreign currency exchange rates at the end of 2024, we expect foreign currency to negatively affect year-over-year net sales by approximately 1.5 percent to 2.0 percent.  We estimate operating profit will increase in 2025 when compared to 2024 due to higher net sales, leverage from fixed operating expenses, ongoing savings from our restructuring plans and lower employee termination and other charges from our restructuring plans.  However, we estimate these favorable items may be partially offset by higher intangible asset amortization, higher net interest expense due to higher interest rates and a higher estimated effective tax rate due to favorable 2024 adjustments that are not expected to recur.\n \n\n\n30\n\n\n\n\n \n\n\nRESULTS OF OPERATIONS\n\n\nWe review sales by two geographies, the United States and International, and by the following product categories: Knees; Hips; S.E.T. (Sports Medicine, Extremities, Trauma, Craniomaxillofacial and Thoracic); and Technology & Data, Bone Cement and Surgical.  This sales analysis differs from our reportable operating segments, which are based upon our senior management organizational structure and how we allocate resources toward achieving operating profit goals.  We review sales by these geographies because the underlying market trends in any particular geography tend to be similar across product categories, because we primarily sell the same products in all geographies and because many of our competitors publicly report in this manner.  Our business is seasonal in nature to some extent, as many of our products are used in elective surgical procedures, which typically decline during the summer months and can increase at the end of the year once annual deductibles have been met on health insurance plans.\n \n\n\nNet Sales by Geography\n\n\nThe following table presents net sales by geography and the percentage changes (dollars in millions):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December\n \n31,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n2024 vs. 2023\n% Inc\n\n\n \n\n\n \n\n\n2023 vs. 2022\n% Inc\n\n\n \n\n\n \n\n\n\n\n\n\nUnited States\n\n\n \n\n\n$\n\n\n4,439.0\n\n\n \n\n\n \n\n\n$\n\n\n4,288.8\n\n\n \n\n\n \n\n\n$\n\n\n4,012.4\n\n\n \n\n\n \n\n\n \n\n\n3.5\n\n\n \n\n\n%\n\n\n \n\n\n6.9\n\n\n \n\n\n%\n\n\n\n\n\n\nInternational\n\n\n \n\n\n \n\n\n3,239.6\n\n\n \n\n\n \n\n\n \n\n\n3,105.4\n\n\n \n\n\n \n\n\n \n\n\n2,927.5\n\n\n \n\n\n \n\n\n \n\n\n4.3\n\n\n \n\n\n \n\n\n \n\n\n6.1\n\n\n \n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n7,678.6\n\n\n \n\n\n \n\n\n$\n\n\n7,394.2\n\n\n \n\n\n \n\n\n$\n\n\n6,939.9\n\n\n \n\n\n \n\n\n \n\n\n3.8\n\n\n \n\n\n \n\n\n \n\n\n6.5\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\nNet Sales by Product Category\n\n\nThe following table presents net sales by product category and the percentage changes (dollars in millions):\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n2024 vs. 2023\n% Inc\n\n\n \n\n\n \n\n\n2023 vs. 2022\n% Inc\n\n\n \n\n\n \n\n\n\n\n\n\nKnees\n\n\n \n\n\n$\n\n\n3,173.5\n\n\n \n\n\n \n\n\n$\n\n\n3,038.4\n\n\n \n\n\n \n\n\n$\n\n\n2,778.3\n\n\n \n\n\n \n\n\n \n\n\n4.4\n\n\n \n\n\n%\n\n\n \n\n\n9.4\n\n\n \n\n\n%\n\n\n\n\n\n\nHips\n\n\n \n\n\n \n\n\n1,999.1\n\n\n \n\n\n \n\n\n \n\n\n1,967.2\n\n\n \n\n\n \n\n\n \n\n\n1,894.9\n\n\n \n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n \n\n\n \n\n\n3.8\n\n\n \n\n\n \n\n\n\n\n\n\nS.E.T.\n\n\n \n\n\n \n\n\n1,865.7\n\n\n \n\n\n \n\n\n \n\n\n1,752.6\n\n\n \n\n\n \n\n\n \n\n\n1,696.7\n\n\n \n\n\n \n\n\n \n\n\n6.5\n\n\n \n\n\n \n\n\n \n\n\n3.3\n\n\n \n\n\n \n\n\n\n\n\n\nTechnology & Data, Bone Cement and Surgical\n\n\n \n\n\n \n\n\n640.3\n\n\n \n\n\n \n\n\n \n\n\n636.0\n\n\n \n\n\n \n\n\n \n\n\n570.0\n\n\n \n\n\n \n\n\n \n\n\n0.7\n\n\n \n\n\n \n\n\n \n\n\n11.6\n\n\n \n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n7,678.6\n\n\n \n\n\n \n\n\n$\n\n\n7,394.2\n\n\n \n\n\n \n\n\n$\n\n\n6,939.9\n\n\n \n\n\n \n\n\n \n\n\n3.8\n\n\n \n\n\n \n\n\n \n\n\n6.5\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nThe following table presents net sales by product category by geography for our Knees and Hips product categories (dollars in millions):\n \n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n2024 vs. 2023\n% Inc\n\n\n \n\n\n \n\n\n2023 vs. 2022\n% Inc\n\n\n \n\n\n \n\n\n\n\n\n\nKnees\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nUnited States\n\n\n \n\n\n$\n\n\n1,814.7\n\n\n \n\n\n \n\n\n$\n\n\n1,770.6\n\n\n \n\n\n \n\n\n$\n\n\n1,615.0\n\n\n \n\n\n \n\n\n \n\n\n2.5\n\n\n \n\n\n%\n\n\n \n\n\n9.6\n\n\n \n\n\n%\n\n\n\n\n\n\nInternational\n\n\n \n\n\n \n\n\n1,358.8\n\n\n \n\n\n \n\n\n \n\n\n1,267.8\n\n\n \n\n\n \n\n\n \n\n\n1,163.3\n\n\n \n\n\n \n\n\n \n\n\n7.2\n\n\n \n\n\n \n\n\n \n\n\n9.0\n\n\n \n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n3,173.5\n\n\n \n\n\n \n\n\n$\n\n\n3,038.4\n\n\n \n\n\n \n\n\n$\n\n\n2,778.3\n\n\n \n\n\n \n\n\n \n\n\n4.4\n\n\n \n\n\n \n\n\n \n\n\n9.4\n\n\n \n\n\n \n\n\n\n\n\n\nHips\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\nUnited States\n\n\n \n\n\n$\n\n\n1,040.0\n\n\n \n\n\n \n\n\n$\n\n\n1,012.3\n\n\n \n\n\n \n\n\n$\n\n\n960.9\n\n\n \n\n\n \n\n\n \n\n\n2.7\n\n\n \n\n\n%\n\n\n \n\n\n5.4\n\n\n \n\n\n%\n\n\n\n\n\n\nInternational\n\n\n \n\n\n \n\n\n959.1\n\n\n \n\n\n \n\n\n \n\n\n954.9\n\n\n \n\n\n \n\n\n \n\n\n934.0\n\n\n \n\n\n \n\n\n \n\n\n0.4\n\n\n \n\n\n \n\n\n \n\n\n2.2\n\n\n \n\n\n \n\n\n\n\n\n\nTotal\n\n\n \n\n\n$\n\n\n1,999.1\n\n\n \n\n\n \n\n\n$\n\n\n1,967.2\n\n\n \n\n\n \n\n\n$\n\n\n1,894.9\n\n\n \n\n\n \n\n\n \n\n\n1.6\n\n\n \n\n\n \n\n\n \n\n\n3.8\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nDemand (Volume/Mix) Trends\n \n\n\nChanges in volume and mix of product sales had a positive effect of 4.2 percent on year-over-year sales growth in 2024.  Market growth and new product introductions contributed positively to volume and mix trends, but were\n \n\n\n31\n\n\n\n\n \n\n\npartially offset by the operational challenges resulting from our ERP implementation.  Market growth is being driven by an aging and active population, technological advancements, and data showcasing positive clinical outcomes among other factors.\n\n\nPricing Trends\n \n\n\nGlobal selling prices had a positive effect of 0.6 percent on year-over-year sales growth in 2024.  The majority of countries in which we operate continue to experience pricing pressure from local hospitals, health systems, and governmental healthcare cost containment efforts.  However, we have had success in offsetting negative effects of pricing pressure due to internal initiatives and being able to pass some inflationary impacts on to customers.\n \n\n\nForeign Currency Exchange Rates\n\n\nIn 2024, changes in foreign currency exchange rates had a negative effect of 1.0 percent on year-over-year sales.\n \n\n\nGeography\n\n\nThe 3.5 percent net sales growth in the U.S. in 2024 when compared to 2023 was driven by market growth in our Knees, Hips and S.E.T. product categories.  However, net sales in the U.S. were negatively impacted by the implementation of our new ERP system which caused operational challenges in fulfilling customer orders.  Internationally, net sales increased by 4.3 percent in 2024 when compared to 2023.  The 2024 International net sales increase was similarly driven by market growth in most of our international markets, but volume increases were partially offset by the negative impacts of changes in foreign currency exchange rates of 2.3 percent.\n \n\n\nProduct Categories\n \n\n\nIn 2024, our Knees and Hips net sales increased by 4.4 percent and 1.6 percent, respectively, when compared to 2023 due to market growth and new product introductions.  Changes in foreign currency exchange rates had negative effects of 0.8 percent and 1.4 percent on 2024 Knees and Hips net sales, respectively.  S.E.T. net sales increased by 6.5 percent in 2024 when compared to 2023.  S.E.T. net sales growth was primarily driven by net sales growth in CMFT, sports medicine and upper extremities products of 14.0 percent, 13.1 percent and 6.0 percent, respectively, partially offset by a 0.5 percent decline in net sales of trauma products.  Changes in foreign currency exchange rates had a negative effect of 0.6 percent on 2024 S.E.T. net sales.  Technology & Data, Bone Cement and Surgical product category net sales increased by 0.7 percent in 2024 when compared to 2023 primarily due to higher net sales for our ROSA robot in the first half of the year, but was partially offset by the operational challenges from our ERP system implementation.\n \n\n\nExpenses as a Percent of Net Sales\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n2023\n\n\n \n\n\n2022\n\n\n \n\n\n2024 vs. 2023\nInc/(Dec)\n\n\n \n\n\n2023 vs. 2022\nInc/(Dec)\n\n\n \n\n\n\n\n\n\nCost of products sold, excluding intangible asset amortization\n\n\n \n\n\n28.5\n\n\n%\n\n\n28.2\n\n\n%\n\n\n29.1\n\n\n%\n\n\n0.3\n\n\n%\n\n\n(0.9)\n\n\n%\n\n\n\n\n\n\nIntangible asset amortization\n\n\n \n\n\n7.7\n\n\n \n\n\n7.6\n\n\n \n\n\n7.6\n\n\n \n\n\n0.1\n\n\n \n\n\n-\n\n\n \n\n\n\n\n\n\nResearch and development\n\n\n \n\n\n5.7\n\n\n \n\n\n6.2\n\n\n \n\n\n5.9\n\n\n \n\n\n(0.5)\n\n\n \n\n\n0.3\n\n\n \n\n\n\n\n\n\nSelling, general and administrative\n\n\n \n\n\n38.2\n\n\n \n\n\n38.4\n\n\n \n\n\n39.8\n\n\n \n\n\n(0.2)\n\n\n \n\n\n(1.4)\n\n\n \n\n\n\n\n\n\nGoodwill and intangible asset impairment\n\n\n \n\n\n-\n\n\n \n\n\n-\n\n\n \n\n\n4.2\n\n\n \n\n\n-\n\n\n \n\n\n(4.2)\n\n\n \n\n\n\n\n\n\nRestructuring and other cost reduction initiatives\n\n\n \n\n\n2.9\n\n\n \n\n\n2.1\n\n\n \n\n\n2.8\n\n\n \n\n\n0.8\n\n\n \n\n\n(0.7)\n\n\n \n\n\n\n\n\n\nQuality remediation\n\n\n \n\n\n-\n\n\n \n\n\n-\n\n\n \n\n\n0.5\n\n\n \n\n\n-\n\n\n \n\n\n(0.5)\n\n\n \n\n\n\n\n\n\nAcquisition, integration, divestiture and related\n\n\n \n\n\n0.3\n\n\n \n\n\n0.3\n\n\n \n\n\n0.2\n\n\n \n\n\n-\n\n\n \n\n\n0.1\n\n\n \n\n\n\n\n\n\nOperating Profit\n\n\n \n\n\n16.7\n\n\n \n\n\n17.3\n\n\n \n\n\n10.0\n\n\n \n\n\n(0.6)\n\n\n \n\n\n7.3\n\n\n \n\n\n\n\n\n\n \n\n\nCost of Products Sold and Intangible Asset Amortization\n\n\n \n\n\n32\n\n\n\n\n \n\n\nCost of products sold, excluding intangible asset amortization, increased in both amount and as a percentage of net sales in 2024 compared to 2023.  The increase in amount was primarily due to a higher volume of net sales.  The increase as a percentage of net sales was due to higher manufacturing costs from inflation and other cost pressures.  The manufacturing cost increase was partially offset by lower royalty expense, volume and mix shift to higher margin products and markets, and improved pricing.  The reduction in royalty expense was partially the result of agreements we entered into in 2023 to acquire intellectual property through the buyout of certain licensing arrangements, which are recognized as intangible assets and result in additional intangible asset amortization expense instead of royalty expense.\n \n\n\n \n\n\nIntangible asset amortization expense increased in amount and as a percentage of net sales in 2024 when compared to 2023 due to acquisitions we made in 2024 and 2023, the buyout of certain royalty-related licensing agreements as described above and other technology-based asset purchases in 2024.\n \n\n\nWe calculate gross profit as net sales minus cost of products sold and intangible asset amortization.  Our gross margin percentage is gross profit divided by net sales.  The following table sets forth the factors that contributed to the gross margin changes in each of 2024 and 2023 compared to the prior year:\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n\n\n\n\nPrior year gross margin\n\n\n \n\n\n \n\n\n64.2\n\n\n %\n\n\n \n\n\n \n\n\n63.3\n\n\n %\n\n\n\n\n\n\nImpact from selling prices\n\n\n \n\n\n \n\n\n0.2\n\n\n \n\n\n \n\n\n \n\n\n(0.2\n\n\n)\n\n\n\n\n\n\nManufacturing costs\n\n\n \n\n\n \n\n\n(1.2\n\n\n)\n\n\n \n\n\n \n\n\n(0.1\n\n\n)\n\n\n\n\n\n\nVolume, product and market mix and other\n\n\n \n\n\n \n\n\n0.7\n\n\n \n\n\n \n\n\n \n\n\n1.4\n\n\n \n\n\n\n\n\n\nInventory charges\n\n\n \n\n\n \n\n\n0.1\n\n\n \n\n\n \n\n\n \n\n\n(0.5\n\n\n)\n\n\n\n\n\n\nChanges in foreign currency exchange rates\n\n\n \n\n\n \n\n\n(0.1\n\n\n)\n\n\n \n\n\n \n\n\n0.3\n\n\n \n\n\n\n\n\n\nIntangible asset amortization\n\n\n \n\n\n \n\n\n(0.1\n\n\n)\n\n\n \n\n\n \n\n\n-\n\n\n \n\n\n\n\n\n\nCurrent year gross margin\n\n\n \n\n\n \n\n\n63.8\n\n\n %\n\n\n \n\n\n \n\n\n64.2\n\n\n %\n\n\n\n\n\n\n \n\n\n \n\n\nOperating Expenses\n\n\n \n\n\nResearch & development (“R&D”) expenses decreased in both amount and as a percentage of net sales in 2024 compared to 2023.  The decreases were driven by lower spending on our initial compliance with the EU MDR as we continue to make progress on the approvals of our products, and savings from our 2023 Restructuring Plan.\n \n\n\nSelling, general & administrative (“SG&A”) expenses increased in amount, but decreased as a percentage of net sales in 2024 compared to 2023.  The increase in expenses was due to selling and distribution costs that are variable expenses which increase as net sales increase.  In addition, SG&A expense increased due to higher bad debt-related charges driven by a bankruptcy at a significant U.S. healthcare system, higher instrument-related costs due to new product introductions, higher litigation-related charges, a gain recognized in 2023 from the sale of an asset which did not recur in 2024, and higher spending on various strategic initiatives.  These higher expenses were partially offset by savings from our 2023 Restructuring Plan and lower performance-related expenses. The decline in SG&A expenses as a percentage of net sales was due to many of our SG&A expenses being fixed costs that do not change as net sales increase.\n\n\nIn December of each of 2023, 2021 and 2019, we initiated global restructuring programs (the “2023 Restructuring Plan,” the “2021 Restructuring Plan” and the “2019 Restructuring Plan,” respectively).  We also have other cost reduction and optimization initiatives that have the goal of reducing costs across the organization.  We recognized expenses of $219.0 million and $151.9 million in 2024 and 2023, respectively, primarily related to employee termination benefits, sales agent contract terminations, and consulting and project management expenses associated with these programs.  The expenses were higher in 2024 compared to 2023 primarily due to additional expenses related to the 2023 Restructuring Plan that had just been initiated at the end of 2023 and additional expenses related to our U.S. and Canada ERP implementation.  For more information regarding these expenses, see Note 5 to our consolidated financial statements.\n \n\n\nAcquisition, integration, divestiture and related expenses increased in 2024 when compared to 2023 due to the acquisitions made in 2024 as well as the fact that the 2023 acquisitions only had a partial year of integration costs in 2023.\n \n\n\n33\n\n\n\n\n \n\n\nOther Expense, net, Interest Expense, net, and Income Taxes\n\n\nIn 2024, we incurred a loss of $31.1 million in our other expense, net compared to a loss of $9.3 million in 2023.  The year-over-year change was primarily due to higher losses on debt and equity security investments in 2024 when compared to 2023.\n \n\n\nInterest expense, net, increased in 2024 when compared to 2023, primarily from higher average debt balances, higher interest rates on new debt issued in 2024 that replaced debt that matured and higher losses incurred on our fixed-to-variable interest rate swaps in 2024.\n \n\n\nOur effective tax rate (“ETR”) on earnings from continuing operations before income taxes was 12.7 percent and 4.0 percent for the years ended December 31, 2024 and 2023, respectively.  In 2024, the ETR was primarily driven by the foreign rate differential as our foreign locations have lower corporate income tax rates and net favorable impact of changes to unrecognized tax benefits. In 2023, the ETR was primarily driven by net favorable impact of changes to unrecognized tax benefits.\n\n\nAbsent discrete tax events, we expect our future ETR will be lower than the U.S. corporate income tax rate of 21.0 percent due to our mix of earnings between U.S. and foreign locations, which have lower corporate income tax rates.  Our ETR in future periods could also potentially be impacted by: changes in our mix of pre-tax earnings; changes in tax rates, tax laws or their interpretation, including the continued adoption of Pillar Two proposals which began to take effect in 2024; the outcome of various federal, state and foreign audits, appeals, and litigation; and the expiration of certain statutes of limitations.  Currently, we cannot reasonably estimate the impact of all these items on our financial results.\n \n\n\nSee Note 17 to our consolidated financial statements for additional information on our income taxes.\n\n\nSegment Operating Profit\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\n \n\n\nSegment Profit as a\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nNet Sales\n\n\n \n\n\n \n\n\nSegment Profit\n\n\n \n\n\n \n\n\nPercentage of Net Sales\n\n\n \n\n\n \n\n\n\n\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\nYear Ended December 31,\n\n\n \n\n\n \n\n\n\n\n\n\n(dollars in millions)\n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n2024\n\n\n \n\n\n \n\n\n2023\n\n\n \n\n\n \n\n\n2022\n\n\n \n\n\n \n\n\n\n\n\n\nAmericas\n\n\n \n\n\n$\n\n\n4,794.8\n\n\n \n\n\n \n\n\n$\n\n\n4,624.1\n\n\n \n\n\n \n\n\n$\n\n\n4,295.5\n\n\n \n\n\n \n\n\n$\n\n\n2,577.0\n\n\n \n\n\n \n\n\n$\n\n\n2,487.1\n\n\n \n\n\n \n\n\n$\n\n\n2,282.4\n\n\n \n\n\n \n\n\n \n\n\n53.7\n\n\n \n\n\n%\n\n\n \n\n\n53.8\n\n\n \n\n\n%\n\n\n \n\n\n53.1\n\n\n \n\n\n%\n\n\n\n\n\n\nEMEA\n\n\n \n\n\n \n\n\n1,691.1\n\n\n \n\n\n \n\n\n \n\n\n1,592.4\n\n\n \n\n\n \n\n\n \n\n\n1,456.5\n\n\n \n\n\n \n\n\n \n\n\n585.8\n\n\n \n\n\n \n\n\n \n\n\n538.2\n\n\n \n\n\n \n\n\n \n\n\n416.1\n\n\n \n\n\n \n\n\n \n\n\n34.6\n\n\n \n\n\n \n\n\n \n\n\n33.8\n\n\n \n\n\n \n\n\n \n\n\n28.6\n\n\n \n\n\n \n\n\n\n\n\n\nAsia Pacific\n\n\n \n\n\n \n\n\n1,192.8\n\n\n \n\n\n \n\n\n \n\n\n1,177.7\n\n\n \n\n\n \n\n\n \n\n\n1,187.8\n\n\n \n\n\n \n\n\n \n\n\n457.6\n\n\n \n\n\n \n\n\n \n\n\n432.3\n\n\n \n\n\n \n\n\n \n\n\n429.1\n\n\n \n\n\n \n\n\n \n\n\n38.4\n\n\n \n\n\n \n\n\n \n\n\n36.7\n\n\n \n\n\n \n\n\n \n\n\n36.1\n\n\n \n\n\n \n\n\n\n\n\n\nAmericas\n\n\nIn the Americas, operating profit increased, but operating profit as a percentage of net sales slightly decreased, in 2024 compared to 2023.  The increase in operating profit in 2024 was primarily due to higher net sales driven by market growth and new product introductions, coupled with lower royalty expense as a result of agreements we entered into in 2023 to acquire intellectual property through the buyout of certain licensing arrangements.  However, operating profit as a percentage of net sales decreased slightly due to investments in instruments to support new product introductions and higher bad debt-related charges in 2024.\n \n\n\nEMEA\n\n\nIn EMEA, operating profit and operating profit as a percentage of net sales increased in 2024 when compared to 2023.  The increases were due to higher net sales driven by market growth and improved pricing, lower excess and obsolete inventory charges, reduced royalty expense as a result of agreements we entered into in 2023 to acquire intellectual property through the buyout of certain licensing arrangements, and lower expenses driven by our 2023 Restructuring Plan and cost savings initiatives.\n \n\n\nAsia Pacific\n\n\nIn Asia Pacific, operating profit and operating profit as a percentage of net sales increased in 2024 when compared to 2023.  The increases were due to higher net sales driven by market growth and improved pricing, reduced royalty expense as a result of agreements we entered into in 2023 to acquire intellectual property through the buyout of certain licensing arrangements, and lower expenses driven by our 2023 Restructuring Plan and cost savings initiatives.\n \n\n\n \n\n\n34\n\n\n\n\n \n\n\nLIQUIDITY AND CAPITAL RESOURCES\n\n\nAs of December 31, 2024, we had $525.5 million in cash and cash equivalents.  In addition, we had $1.0 billion available to borrow under a 364-day revolving credit agreement that matures on June 27, 2025, and $1.5 billion available under a five-year revolving facility that matures on June 28, 2029.  The terms of the 364-day revolving credit agreement and the five-year revolving facility are described further in Note 13 to our consolidated financial statements.\n\n\nWe believe that cash flows from operations, our cash and cash equivalents on hand, and available borrowings under our revolving credit facilities will be sufficient to meet our ongoing liquidity requirements for at least the next twelve months.  However, it is possible our needs may change.  Further, there can be no assurance that, if needed, we will be able to secure additional financing on terms favorable to us, if at all.\n\n\nSources of Liquidity\n\n\nCash flows provided by operating activities from continuing operations were $1,499.4 million in 2024 compared to $1,581.6 million in 2023.  The decrease in 2024 was primarily due to a higher volume of accounts payable payments near the end of 2024 relative to 2023 as well as higher bonus, income tax and restructuring-related payments.  These unfavorable items were partially offset by lower inventory investments in 2024 when compared to 2023.\n\n\nCash flows used in investing activities from continuing operations were $888.1 million in 2024 compared to $778.9 million in 2023.  Instrument and property, plant and equipment additions reflected ongoing investments in our product portfolio, including new product introductions, optimization of our manufacturing and logistics networks,  and investments in ERP software.  The decline in property, plant and equipment additions in 2024 when compared to 2023 was driven by lower ERP software spend as that project is getting implemented, in addition to 2023 including investment in a corporate aircraft which did not recur in 2024.  In addition, in 2024 we paid $276.3 million related to acquisitions and $153.0 million to acquire the ownership rights or gain access to various technologies that were recognized as intangible assets.\n \n\n\nCash flows used in financing activities from continuing operations were $484.5 million in 2024 compared to $763.5 million in 2023.  In 2024, we issued senior notes for $1,436.3 million and used the proceeds, along with cash on hand, to repurchase $868.0 million of our common stock, redeem $850.0 of our senior notes and repay a net $50.0 million under an uncommitted credit facility.  In 2023, we used the proceeds from draws on our existing credit facilities, along with cash on hand, to repurchase $692.2 million of our common stock.  In 2023, we issued senior notes for $499.8 million and used those proceeds to repay amounts outstanding under our existing credit facilities and for general corporate purposes, such that we repaid a net $325.0 million on our various revolving credit facilities and $120.2 million of other debt obligations that were due in the first quarter of 2023.\n \n\n\nWe place our cash and cash equivalents in highly-rated financial institutions and limit the amount of credit exposure to any one entity.  We invest only in high-quality financial instruments in accordance with our internal investment policy.\n \n\n\nAs of December 31, 2024, $436.8 million of our cash and cash equivalents were held in jurisdictions outside of the U.S.  Of this amount, $59.3 million is denominated in U.S. Dollars and, therefore, bears no foreign currency translation risk.  The remaining amount is denominated in currencies of the various countries where we operate. As discussed in Note 17 to our consolidated financial statements, we generally intend to limit distributions such that they would not result in significant U.S. tax costs.\n \n\n\nMaterial Cash Requirements from Known Contractual and Other Obligations\n\n\nAt December 31, 2024, we had outstanding debt of $6,204.6 million, of which $863.0 million was classified as current debt that matures on April 1, 2025.  We believe we can satisfy these debt obligations with cash generated from our operations, by issuing new debt and/or by borrowing on our committed revolving credit facilities.\n \n\n\nFor additional information on our debt, including types of debt, maturity dates, interest rates, debt covenants and available revolving credit facilities, see Note 13 to our consolidated financial statements.\n\n\n35\n\n\n\n\n \n\n\nIn January 2025, we entered into a definitive agreement to acquire all outstanding shares of Paragon 28, Inc (“Paragon 28”).  The proposed transaction will require initial consideration of approximately $1.2 billion to be paid at closing, which is expected to occur in the first half of 2025.  We expect to fund the proposed transaction through a combination of cash on hand and other available debt financing sources.  See Note 22 to our consolidated financial statements for additional information related to this proposed transaction.\n\n\n \n\n\nIn February 2025, we issued senior notes with aggregate principal amounts of $600 million of 4.700% notes due 2027 (“2027 Notes”), $550 million of 5.050% notes due 2030 (“2030 Notes”), and $600 million of 5.500% notes due 2035 (“2035 Notes”).  We intend to use the net proceeds from these notes, together with cash on hand or other immediately available funds, to pay the consideration, fees, and expenses for the Paragon 28 acquisition.  We further intend to use a portion of the proceeds of the 2027 Notes for general corporate purposes, which may include the repayment of other indebtedness (which could include the repayment of our 3.550% notes due April 1, 2025), share repurchases, financing capital commitments and financing future acquisitions.  If we fail to consummate the Paragon 28 acquisition either (i) prior to November 28, 2025 (as such date may be extended in accordance with the terms of the Paragon 28 merger agreement and the supplemental indenture governing the 2030 Notes and the 2035 Notes); or (ii) due to the termination of Paragon 28 merger agreement pursuant to its terms, then we will be obligated to redeem all of the 2030 notes and the 2035 notes on the special mandatory redemption date at a redemption price equal to 101% of the principal amount of such series of notes, plus accrued and unpaid interest to, but excluding, the special mandatory redemption date.\n\n\nIn March, May, August and December 2024, our Board of Directors declared cash dividends of $0.24 per share.  We expect to continue paying cash dividends on a quarterly basis; however, future dividends are subject to approval of the Board of Directors and may be adjusted as business needs or market conditions change.\n \n\n\nIn May 2024, our Board of Directors authorized a $2.0 billion share repurchase program effective May 29, 2024, with no expiration date.  In 2024, we executed share repurchases under this new repurchase program as well as a previous program in an aggregate amount of $868.0 million to return cash to investors as well as to limit ownership dilution from the issuance of common stock under our share-based compensation programs and in connection with our acquisition of Embody, Inc.  As of December 31, 2024, $1,250.0 million remained authorized under this program.\n \n\n\nAs discussed in Note 5 to our consolidated financial statements, we are executing on a 2023 Restructuring Plan, a 2021 Restructuring Plan and a 2019 Restructuring Plan.  The 2023 Restructuring Plan along is expected to result in total pre-tax charges of approximately $120 million by the end of 2025, of which $114 million was incurred through December 31, 2024.  We expect to reduce gross annual pre-tax operating expenses by $175 million to $200 million relative to the 2023 baseline expenses by the end of 2025 as program benefits under the 2023 Restructuring Plan are realized.  The 2021 Restructuring Plan was completed by the end of 2024, resulting in $169 million of total pre-tax charges.  We estimate gross annual pre-tax operating expenses were reduced by approximately $190 million relative to the 2021 baseline expenses by the end of 2024.  The 2019 Restructuring Plan is expected to result in total pre-tax restructuring charges of approximately $400 million by the end of 2025, of which $368 million was incurred through December 31, 2024.  In our original estimates, we expected to reduce gross annual pre-tax operating expenses by approximately $180 million to $280 million relative to the 2019 baseline expenses by the end of 2023 as benefits under the 2019 Restructuring Plan were realized.  Our latest estimates indicate that we will be near the low end of that range, and the full benefits will not be realized until we complete the closure of a manufacturing facility, which is expected to occur in 2025.\n\n\nAs discussed in Note 17 to our consolidated financial statements, the IRS has issued proposed adjustments for years 2013 through 2015 and for years 2016 through 2019.  We have disputed these proposed adjustments and intend to continue to vigorously defend our positions.  Although the ultimate timing for resolution of the disputed tax issues is uncertain, future payments may be significant to our operating cash flows.\n \n\n\n \n\n\nUnder the Tax Cuts and Jobs Act of 2017, we have a $154.6 million liability remaining from a one-time tax on the mandatory deemed repatriation of post-1986 untaxed foreign earnings and profits (“transition tax”) for the deemed repatriation of unremitted foreign earnings. As of December, 31, 2024, $68.7 million and $85.9 million of this amount is recorded in current income tax liabilities and non-current income tax liabilities, respectively, on our consolidated balance sheet.\n \n\n\nAs discussed in Note 21 to our consolidated financial statements, we are involved in various litigation matters.  We estimate the total liabilities for all litigation matters was $156.4 million as of December 31, 2024.  However,\n \n\n\n36\n\n\n\n\n \n\n\nlitigation is inherently uncertain, and upon resolution of any of these uncertainties, we may incur charges in excess of these estimates, and may in the future incur other material judgments or enter into other material settlements of claims.  We expect to pay these liabilities over the next few years.\n\n\nIn the normal course of business, we enter into purchase commitments, primarily related to raw materials.  However, we do not believe these purchase commitments are material to the overall standing of our business or our liquidity.\n\n\nWe have entered into development, distribution and other contractual arrangements that may result in future payments dependent upon various events such as the achievement of certain product R&D milestones, sales milestones, or exclusive rights to distribute a product.  Since there is uncertainty on the timing or whether such payments will have to be made, they have not been recognized on our consolidated balance sheets.  These estimated payments related to these agreements could range from $0 to $325 million.\n\n\n \n\n\nCRITICAL ACCOUNTING ESTIMATES\n\n\nThe preparation of our financial statements is affected by the selection and application of accounting policies and methods, and also requires us to make estimates and assumptions that affect the reported amounts of assets and liabilities and disclosure of contingent assets and liabilities at the date of the financial statements and the reported amounts of revenues and expenses during the reporting period. Critical accounting estimates are those that involve a significant level of estimation uncertainty and have had or are reasonably likely to have a material impact on our financial condition and results of operations. We believe that the accounting estimates and assumptions described below involve significant subjectivity and judgment, and changes to such estimates or assumptions could have a material impact on our financial condition or operating results.\n\n\nExcess Inventory and Instruments\n - We must determine as of each balance sheet date how much, if any, of our inventory may ultimately prove to be unsaleable or unsaleable at our carrying cost.  Similarly, we must also determine if instruments on hand will be put to productive use or remain undeployed as a result of excess supply.  Accordingly, inventory and instruments are written down to their net realizable value.  To determine the appropriate net realizable value, we evaluate current stock levels in relation to historical and expected patterns of demand for all of our products and instrument systems and components.  The basis for the determination is generally the same for all inventory and instrument items and categories except for work in process inventory, which is recorded at cost.  Obsolete or discontinued items are generally destroyed and completely written off.  Management evaluates the need for changes to the net realizable values of inventory and instruments based on market conditions, competitive offerings and other factors on a regular basis.\n \n\n\nIncome Taxes\n - Our income tax expense, deferred tax assets and liabilities and reserves for unrecognized tax benefits reflect management’s best assessment of estimated future taxes to be paid.  We are subject to income taxes in the U.S. and numerous foreign jurisdictions.  Significant judgments and estimates are required in determining the consolidated income tax expense.\n \n\n\nWe estimate income tax expense and income tax liabilities and assets by taxable jurisdiction.  Realization of deferred tax assets in each taxable jurisdiction is dependent on our ability to generate future taxable income sufficient to realize the benefits.  We evaluate deferred tax assets on an ongoing basis and provide valuation allowances unless we determine it is “more likely than not” that the deferred tax benefit will be realized.\n \n\n\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax laws and regulations in numerous jurisdictions across our global operations.  We are subject to regulatory review or audit in virtually all of those jurisdictions and those reviews and audits may require extended periods of time to resolve. We record our income tax provisions based on our knowledge of all relevant facts and circumstances, including existing tax laws, our experience with previous settlement agreements, the status of current examinations and our understanding of how the tax authorities view certain relevant industry and commercial matters.\n \n\n\nWe recognize tax liabilities in accordance with the Financial Accounting Standards Board (“FASB”) guidance on income taxes and we adjust these liabilities when our judgment changes as a result of the evaluation of new information not previously available.  Due to the complexity of some of these uncertainties, the ultimate resolution may result in a payment that is materially different from our current estimate of the tax liabilities.  These differences will be reflected as increases or decreases to income tax expense in the period in which they are determined.\n\n\n37\n\n\n\n\n \n\n\nCommitments and Contingencies\n - We are involved in various ongoing proceedings, legal actions and claims, including product liability, intellectual property, stockholder matters, tax disputes, commercial disputes, employment matters, whistleblower and qui tam claims and investigations, governmental proceedings and investigations, and other legal matters that arise in the normal course of our business.  We establish liabilities for loss contingencies when it is probable that a loss has been incurred and the amount of the loss can be reasonably estimated.  Accruals for product liability and other claims are established with the assistance of internal and external legal counsel based on current information and historical settlement information for claims, related legal fees and for claims incurred but not reported.\n \n\n\nGoodwill and Intangible Assets\n - We evaluate the carrying value of goodwill and indefinite life intangible assets annually, or whenever events or circumstances indicate that the fair value is below its carrying amount.  We evaluate the carrying value of finite life intangible assets whenever events or circumstances indicate the carrying value may not be recoverable.  Significant assumptions are required to estimate the fair value of goodwill and intangible assets, most notably estimated future cash flows generated by these assets and risk-adjusted discount rates.  As such, these fair value measurements use significant unobservable inputs.  Changes to these assumptions could require us to record impairment charges on these assets.\n \n\n\nWe have four reporting units with goodwill assigned to them.  During our annual goodwill impairment testing in the fourth quarter of 2024, for the three reporting units we quantitatively tested their estimated fair values exceeded their carrying values by more than 30 percent.  We estimated the fair value of these reporting units using the income and market approaches.  Fair value under the income approach was determined by discounting to present value the estimated future cash flows of the reporting unit.  Fair value under the market approach utilized the guideline public company methodology, which uses valuation indicators determined from other businesses that are similar to our reporting unit.  We performed a qualitative test on the other reporting unit and concluded it was more likely than not the fair value of this reporting unit exceeded its carrying value.\n \n\n\nFuture impairment in our reporting units could occur if the estimates used in the income and market approaches change.  If our estimates of profitability in the reporting unit decline, the fair value estimate under the income approach will decline.  Additionally, changes in the broader economic environment could cause changes to our estimated discount rates and comparable company valuation indicators, which may impact our estimated fair values.  Further, changes in foreign currency exchange rates could increase the cost of procuring inventory and services from foreign suppliers, which could reduce reporting unit profitability.\n \n\n\nRECENT ACCOUNTING PRONOUNCEMENTS\n\n\nSee Note 2 to our consolidated financial statements for information on how recent accounting pronouncements have affected or may affect our financial position, results of operations or cash flows.",
  "item2": null
}