{
  "source_file": "zbra-20250927.htm",
  "form_type": "10-Q",
  "item1": null,
  "item7": null,
  "item2": "Item 2.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nOverview\nWe are a global leader in the Automatic Identification and Data Capture (“AIDC”) industry. The AIDC market consists of mobile computing, data capture, radio frequency identification devices (“RFID”), barcode printing, and other workflow automation offerings. The Company’s offerings are proven to help our customers and end-users digitize and automate their workflows to achieve their critical business objectives, including improved productivity and operational efficiency, optimized regulatory compliance, and better customer experiences.\nWe design, manufacture, and sell a broad range of AIDC offerings, including: mobile computers, barcode scanners and imagers, RFID readers, specialty printers for barcode labeling and personal identification, real-time location systems (“RTLS”), related accessories and supplies, such as labels and other consumables, and related software applications. We also provide machine vision and robotics automation solutions; a full range of services, including maintenance, technical support, repair, managed and professional services; as well as cloud-based software subscriptions. End-users of our offerings include those in retail and e-commerce, manufacturing, transportation and logistics, healthcare, public sector, and other industries within North America; Europe, Middle East, and Africa (“EMEA”); Asia Pacific; and Latin America.\nWe continue to advance our Enterprise Asset Intelligence (“EAI”) vision: every asset and front-line worker visible, connected, and fully optimized. Through continual innovation, we have expanded beyond the traditional AIDC market to transform activities such as factory production, packages moving through a supply chain, retail shopping, the hospital patient journey and first responders addressing public safety and emergency situations. Data from enterprise assets, including status, condition, location, utilization, and preferences, is analyzed in the cloud to provide prioritized actionable insights. As a result, our offerings enable enterprises to “sense, analyze, and act” more effectively to optimize their activities.\nThe Company’s operations consist of two reportable segments that provide complementary offerings to our customers: Asset Intelligence & Tracking (“AIT”) and Enterprise Visibility & Mobility (“EVM”). \n•\nThe AIT segment is an industry leader in barcode printing and asset tracking technologies. Its major product lines include barcode and card printers, RFID and RTLS offerings, and supplies, including temperature-monitoring labels, and services.\n21\nTable of Contents\n•\nThe EVM segment is an industry leader in automatic information and data capture offerings. Its major product lines include mobile computing, data capture, fixed industrial scanning and machine vision, services, and workflow optimization solutions. Our workflow optimization solutions include cloud-based software subscriptions, retail solutions, and robotic automation solutions.\nWe are a market leader in our core businesses, which are generally considered to be comprised of our mobile computing and data capture offerings, printing and supplies offerings, as well as support and repair services. We continue to focus on growth opportunities within adjacent and expansion markets by scaling and integrating our recent business acquisitions.\nThird Quarter 2025 Financial Summary and Other Recent Developments\n•\nNet sales were $1,320 million in the current quarter compared to $1,255 million in the prior year third quarter.\n•\nOperating income was $183 million in the current quarter compared to $191 million in the prior year third quarter.\n•\nNet income was $101 million, or $1.97 per diluted share in the current quarter, compared to net income of $137 million, or $2.64 per diluted share in the prior year third quarter.\n•\nWe repurchased $284 million of common shares year to date, including $34 million in the third quarter.\nBoth of our segments benefited from growth in demand across most of our primary end markets. We continued to mitigate the negative impacts of tariffs through product sourcing diversification, the impacts of targeted list price increases, and product portfolio optimization efforts.\nSubsequent events\n:\nOn September 30, 2025, the Company acquired Elo Touch Solutions, Inc. (“Elo”) for approximately $1.3 billion in cash. Elo is an innovator of solutions that engage customers, enhance self-service, and accelerate automation across a wide range of end markets. The Elo acquisition expands our portfolio of self-service and consumer-facing workflow offerings. The operating results of Elo will be included in our newly established Connected Frontline segment beginning in the fourth quarter. The Elo acquisition was funded with cash on hand and borrowings from our existing credit facilities.\nEffective with the fourth quarter, the Company’s reportable segments will be changed to Connected Frontline and Asset Visibility & Automation to align with how we operate our business to advance our strategy.\nSee Note 17, \nSubsequent Events\n in the Notes to Consolidated Financial Statements included in this report for additional information.\nResults of Operations\nConsolidated Results of Operations\n(amounts in millions, except percentages)\n \nThree Months Ended\nNine Months Ended\nSeptember 27,\n2025\nSeptember 28,\n2024\n$ Change\n% Change\nSeptember 27,\n2025\nSeptember 28,\n2024\n$ Change\n% Change\nNet sales:\nTangible products\n$\n1,081 \n$\n1,019 \n$\n62 \n6.1 \n%\n$\n3,198 \n$\n2,931 \n$\n267 \n9.1 \n%\nServices and software\n239 \n236 \n3 \n1.3 \n%\n723 \n716 \n7 \n1.0 \n%\nTotal Net sales\n1,320 \n1,255 \n65 \n5.2 \n%\n3,921 \n3,647 \n274 \n7.5 \n%\nGross profit\n634 \n613 \n21 \n3.4 \n%\n1,895 \n1,765 \n130 \n7.4 \n%\nGross margin\n48.0 \n%\n48.8 \n%\n(80) bps\n48.3 \n%\n48.4 \n%\n(10) bps\nOperating expenses\n451 \n422 \n29 \n6.9 \n%\n1,334 \n1,248 \n86 \n6.9 \n%\nOperating income\n$\n183 \n$\n191 \n$\n(8)\n(4.2)\n%\n$\n561 \n$\n517 \n$\n44 \n8.5 \n%\nNet sales to customers by geographic region were as follows (amounts\n \nin millions, except percentages):\n22\nTable of Contents\n \nThree Months Ended\nNine Months Ended\nSeptember 27,\n2025\nSeptember 28,\n2024\n$ Change\n% Change\nSeptember 27,\n2025\nSeptember 28,\n2024\n$ Change\n% Change\nNorth America\n$\n666 \n$\n628 \n$\n38 \n6.1 \n%\n$\n1,969 \n$\n1,839 \n$\n130 \n7.1 \n%\nEMEA\n394 \n405 \n(11)\n(2.7)\n%\n1,252 \n1,204 \n48 \n4.0 \n%\nAsia-Pacific\n163 \n132 \n31 \n23.5 \n%\n429 \n362 \n67 \n18.5 \n%\nLatin America\n97 \n90 \n7 \n7.8 \n%\n271 \n242 \n29 \n12.0 \n%\nTotal Net sales\n$\n1,320 \n$\n1,255 \n$\n65 \n5.2 \n%\n$\n3,921 \n$\n3,647 \n$\n274 \n7.5 \n%\nOperating expenses are summarized below (amounts in millions, except percentages):\n \nThree Months Ended\nNine Months Ended\n \nSeptember 27,\n2025\nSeptember 28,\n2024\nAs a % of Net sales\nSeptember 27,\n2025\nSeptember 28,\n2024\nAs a % of Net sales\n2025\n2024\n2025\n2024\nSelling and marketing\n$\n159 \n$\n151 \n12.0 \n%\n12.0 \n%\n$\n478 \n$\n449 \n12.2 \n%\n12.3 \n%\nResearch and development\n146 \n141 \n11.1 \n%\n11.2 \n%\n441 \n425 \n11.2 \n%\n11.7 \n%\nGeneral and administrative\n111 \n96 \n8.4 \n%\n7.6 \n%\n324 \n274 \n8.3 \n%\n7.5 \n%\nAmortization of intangible assets\n25 \n29 \nNM\nNM\n74 \n80 \nNM\nNM\nAcquisition and integration costs\n10 \n1 \nNM\nNM\n17 \n3 \nNM\nNM\nExit and restructuring costs\n— \n4 \nNM\nNM\n— \n17 \nNM\nNM\nTotal Operating expenses\n$\n451 \n$\n422 \n34.2 \n%\n33.6 \n%\n$\n1,334 \n$\n1,248 \n34.0 \n%\n34.2 \n%\nConsolidated Organic Net sales growth:\nThree Months Ended\nNine Months Ended\nSeptember 27, 2025\nSeptember 27, 2025\nReported GAAP Consolidated Net sales growth\n5.2 \n%\n7.5 \n%\nAdjustments:\nImpact of foreign currency translations\n (1)\n(0.2)\n%\n0.3 \n%\nImpact of acquisitions\n (2)\n(0.2)\n%\n(0.2)\n%\nConsolidated Organic Net sales growth \n(3)\n4.8 \n%\n7.6 \n%\n(1)\nOperating results reported in U.S. Dollars are affected by foreign currency exchange rate fluctuations. Foreign currency translation impact represents the difference in results that are attributable to fluctuations in the currency exchange rates used to convert the results for businesses where the functional currency is not the U.S. Dollar. This impact is calculated by translating the current period results at the currency exchange rates used in the comparable prior year period as well as removing realized cash flow hedge gains and losses from both the current and prior year periods.\n(2)\nFor purposes of computing Organic Net sales growth, amounts directly attributable to business acquisitions are excluded for twelve months following their respective acquisitions.\n(3)\nConsolidated Organic Net sales growth is a non-GAAP financial measure.  See the \nNon-GAAP Measures\n section at the end of this item.\nThird quarter 2025 compared to third quarter 2024\n \nTotal Net sales increased by $65 million or 5.2% compared to the prior year quarter, reflecting growth in both of our segments. Our overall sales growth reflects improved demand in the North America, Asia-Pacific, and Latin America regions. Excluding the effects of currency changes and acquisitions, Consolidated Organic Net sales increased by 4.8%. \n23\nTable of Contents\nGross margin decreased to 48.0% for the current quarter compared to 48.8% for the prior year, primarily due to unfavorable impacts of tariffs, net of mitigating actions, along with lower services and software margins\n. \nAs compared to the prior year quarter, Gross margin improved in our AIT segment and declined in our EVM segment.\nOperating expenses for the quarters ended September 27, 2025 and September 28, 2024 were $451 million and $422 million, or 34.2% and 33.6% of Net sales, respectively. Current quarter Operating expenses increased compared to the prior year quarter primarily due to higher share-based compensation expense related to improved expected attainment associated with performance-based share-based compensation awards.\nOperating income was $183 million for the current quarter compared to $191 million in the prior year quarter. The decrease was due to higher Operating expenses, partly offset by higher Gross profit.\nTotal other expense, net decreased primarily due to foreign exchange losses in the prior year quarter and lower net interest costs associated with the company’s borrowings driven by rate favorability in the current year quarter.\nThe Company’s effective tax rates for the three months ended September 27, 2025 and September 28, 2024 were 36.5% and 8.1%, respectively. The increase in the effective tax rate was primarily due to increased taxes related to foreign earnings subject to U.S. taxation as a result of recently enacted U.S. tax legislation and U.S. state income taxes, partly offset by the release of certain Canadian valuation allowance reserves. \nNet income and diluted earnings per share each decreased in the current quarter due to a higher income tax provision and lower Operating income, partly offset by lower Total other expense, net. \nYear to date 2025 compared to Year to date 2024\n \nTotal Net sales increased by $274 million or 7.5% compared to the prior year period, reflecting growth in both of our segments associated with improved demand trends that began in the middle of 2024. Excluding the effects of currency changes and acquisitions, Consolidated Organic Net sales increased by 7.6%. \nGross margin slightly decreased to 48.3% compared to 48.4% for the prior year period, primarily due to unfavorable impacts of tariffs, net of mitigating actions, along with lower services and software margins, largely offset by volume leverage and favorable business mix. As compared to the prior year period, Gross margin improved in our AIT segment and declined in our EVM segment.\nOperating expenses for the nine months ended September 27, 2025 and September 28, 2024 were $1,334 million and $1,248 million, or 34.0% and 34.2% of Net sales, respectively. Current year Operating expenses increased compared to the prior year period primarily due to higher employee and employee-related costs, including higher incentive compensation, part of which related to changes in share-based compensation eligibility provisions in the first quarter. These increases were partly offset by lower Exit and restructuring costs.\nOperating income was $561 million for the current year period compared to $517 million in the prior year period. The increase was due to higher Gross profit, partially offset by higher Operating expenses.\nTotal other expense, net increased primarily due to non-recurring interest rate swap gains in the prior year and higher foreign exchange transaction losses in the current year, partly offset by lower net interest costs associated with the Company’s borrowings driven by rate favorability and higher interest income on cash equivalents in the current year.\nThe Company’s effective tax rates for the nine months ended September 27, 2025 and September 28, 2024 were 24.5% and 14.5%, respectively. The increase in the effective tax rate was primarily due to increased taxes related to foreign earnings subject to U.S. taxation as a result of recently enacted U.S. tax legislation and U.S. state income taxes, partly offset by the release of certain Canadian valuation allowance reserves.\nNet income and diluted earnings per share each decreased compared to the prior year period due to a higher income tax provision, lower Operating income, and higher Total other expense, net in the current year.  \n24\nTable of Contents\nResults of Operations by Segment\nThe following commentary should be read in conjunction with the financial results of each reportable business segment as detailed in Note 16, \nSegment Information & Geographic Data\n in the Notes to Consolidated Financial Statements. To the extent applicable, segment operating income excludes business acquisition purchase accounting adjustments, amortization of intangible assets, acquisition and integration costs, impairment of goodwill and other intangibles, exit and restructuring costs, as well as certain other non-recurring costs.\nAsset Intelligence & Tracking Segment (“AIT”)\n(amounts in millions, except percentages)\n \nThree Months Ended\nNine Months Ended\nSeptember 27,\n2025\nSeptember 28,\n2024\n$ Change\n% Change\nSeptember 27,\n2025\nSeptember 28,\n2024\n$ Change\n% Change\nNet sales:\nTangible products\n$\n424 \n$\n382 \n$\n42 \n11.0 \n%\n$\n1,244 \n$\n1,115 \n$\n129 \n11.6 \n%\nServices and software\n31 \n28 \n3 \n10.7 \n%\n91 \n84 \n7 \n8.3 \n%\nTotal Net sales\n455 \n410 \n45 \n11.0 \n%\n1,335 \n1,199 \n136 \n11.3 \n%\nGross profit\n230 \n199 \n31 \n15.6 \n%\n669 \n570 \n99 \n17.4 \n%\nGross margin\n50.5 \n%\n48.5 \n%\n200 bps\n50.1 \n%\n47.5 \n%\n260 bps\nOperating expenses\n127 \n116 \n11 \n9.5 \n%\n383 \n338 \n45 \n13.3 \n%\nOperating income\n$\n103 \n$\n83 \n$\n20 \n24.1 \n%\n$\n286 \n$\n232 \n$\n54 \n23.3 \n%\nAIT Organic Net sales growth:\nThree Months Ended\nNine Months Ended\nSeptember 27, 2025\nSeptember 27, 2025\nAIT Reported GAAP Net sales growth\n11.0 \n%\n11.3 \n%\nAdjustments:\nImpact of foreign currency translations\n (1)\n(0.4)\n%\n0.3 \n%\nAIT Organic Net sales growth \n(2)\n10.6 \n%\n11.6 \n%\n(1)\nOperating results reported in U.S. Dollars are affected by foreign currency exchange rate fluctuations. Foreign currency translation impact represents the difference in results that are attributable to fluctuations in the currency exchange rates used to convert the results for businesses where the functional currency is not the U.S. Dollar. This impact is calculated by translating the current period results at the currency exchange rates used in the comparable prior year period as well as removing realized cash flow hedge gains and losses from both the current and prior year periods.\n(2)\nAIT Organic Net sales growth is a non-GAAP financial measure. See the \nNon-GAAP Measures\n section at the end of this item.\nThird quarter 2025 compared to third quarter 2024\nTotal Net sales for AIT increased $45 million or 11.0% compared to the prior year quarter, primarily due to higher sales of printing products. Excluding the impact of foreign currency changes, AIT Organic Net sales increased by 10.6%.\nGross margin increased to 50.5% in the current quarter compared to 48.5% for the prior year quarter, primarily due to favorable business mix and volume leverage.\nOperating income increased 24.1% in the current quarter compared to the prior year quarter due to higher Gross profit, partly offset by higher Operating expenses.\n25\nTable of Contents\nYear to date 2025 compared to Year to date 2024\n \nTotal Net sales for AIT increased $136 million or 11.3% compared to the prior year period, primarily due to higher sales of printing and RFID products. Excluding the impact of foreign currency changes, AIT Organic Net sales increased by 11.6%.\nGross margin increased to 50.1% in the current year period compared to 47.5% for the prior year period, primarily due to favorable business mix and volume leverage along with lower inventory related charges.\nOperating income increased 23.3% in the current year period compared to the prior year period due to higher Gross profit, partly offset by higher Operating expenses.\nEnterprise Visibility & Mobility Segment (“EVM”)  \n(amounts in millions, except percentages)\n \nThree Months Ended\nNine Months Ended\nSeptember 27,\n2025\nSeptember 28,\n2024\n$ Change\n% Change\nSeptember 27,\n2025\nSeptember 28,\n2024\n$ Change\n% Change\nNet sales:\nTangible products\n$\n657 \n$\n637 \n$\n20 \n3.1 \n%\n$\n1,954 \n$\n1,816 \n$\n138 \n7.6 \n%\nServices and software\n208 \n208 \n— \n— \n%\n632 \n632 \n— \n— \n%\nTotal Net sales\n865 \n845 \n20 \n2.4 \n%\n2,586 \n2,448 \n138 \n5.6 \n%\nGross profit\n404 \n414 \n(10)\n(2.4)\n%\n1,226 \n1,195 \n31 \n2.6 \n%\nGross margin\n46.7 \n%\n49.0 \n%\n(230) bps\n47.4 \n%\n48.8 \n%\n(140) bps\nOperating expenses\n289 \n272 \n17 \n6.3 \n%\n860 \n810 \n50 \n6.2 \n%\nOperating income\n$\n115 \n$\n142 \n$\n(27)\n(19.0)\n%\n$\n366 \n$\n385 \n$\n(19)\n(4.9)\n%\nEVM Organic Net sales growth:\nThree Months Ended\nNine Months Ended\nSeptember 27, 2025\nSeptember 27, 2025\nEVM Reported GAAP Net sales growth\n2.4 \n%\n5.6 \n%\nAdjustments:\nImpact of foreign currency translations\n (1)\n(0.1)\n%\n0.3 \n%\nImpact of acquisitions\n (2)\n(0.3)\n%\n(0.3)\n%\nEVM Organic Net sales growth \n(3)\n2.0 \n%\n5.6 \n%\n(1)\nOperating results reported in U.S. Dollars are affected by foreign currency exchange rate fluctuations. Foreign currency translation impact represents the difference in results that are attributable to fluctuations in the currency exchange rates used to convert the results for businesses where the functional currency is not the U.S. Dollar. This impact is calculated by translating the current period results at the currency exchange rates used in the comparable prior year period as well as removing realized cash flow hedge gains and losses from both the current and prior year periods.\n(2)\nFor purposes of computing EVM Organic Net sales growth, amounts directly attributable to business acquisitions are excluded for twelve months following their respective acquisitions.\n(3)\nEVM Organic Net sales growth is a non-GAAP financial measure.  See the \nNon-GAAP Measures\n section at the end of this item.\nThird quarter 2025 compared to third quarter 2024\nTotal Net sales for EVM increased $20 million or 2.4% compared to the prior year quarter, primarily due to higher sales of mobile computing products, partly offset by lower data capture products. Excluding the impacts of foreign currency changes and acquisitions, EVM Organic Net sales increased by 2.0%.\nGross margin decreased to 46.7% in the current quarter compared to 49.0% for the prior year quarter, primarily due to unfavorable impacts of tariffs, net of mitigating actions, along with lower services and software margins.  \n26\nTable of Contents\nOperating income for the current year period decreased by 19.0% compared to the prior year quarter due to higher Operating expenses and lower Gross profit.\nYear to date 2025 compared to Year to date 2024\n \nTotal Net sales for EVM increased $138 million or 5.6% compared to the prior year period, primarily due to higher sales of mobile computing and data capture products. Excluding the impacts of foreign currency changes and acquisitions, EVM Organic Net sales increased by 5.6%.\nGross margin decreased to 47.4% in the current year period compared to 48.8% for the prior year period, primarily due to unfavorable impacts of tariffs, net of mitigating actions, along with lower services and software margins.  \nOperating income for the current year decreased by 4.9% compared to the prior year period due to higher Operating expenses, partly offset by higher Gross profit.\nLiquidity and Capital Resources\nThe primary factors that influence our liquidity include the amount and timing of cash collections from our customers, cash payments to our suppliers, capital expenditures, acquisitions, and share repurchases. Management believes that our existing capital resources, inclusive of available borrowing capacity on debt and other financing facilities and funds generated from operations, are sufficient to meet anticipated capital requirements and service our indebtedness. The following table summarizes our cash flow activities for the periods indicated (in millions):\n \nNine Months Ended\nCash flow provided by (used in):\nSeptember 27,\n2025\nSeptember 28,\n2024\n$ Change\nOperating activities\n$\n560 \n$\n707 \n$\n(147)\nInvesting activities\n(121)\n(42)\n(79)\nFinancing activities\n(286)\n(127)\n(159)\nEffect of exchange rates on cash balances\n(1)\n— \n(1)\nNet change in cash and cash equivalents, including restricted cash\n$\n152 \n$\n538 \n$\n(386)\nThe change in our cash and cash equivalents balance during the nine months ended September 27, 2025 compared to the prior year was primarily due to the following:\n•\n$147 million decrease in net operating cash inflows primarily due to larger reductions in inventory in the prior year, higher employee incentive compensation payments in the current year, and cash receipts from the settlements of terminated interest rate swap agreements in the prior year.  These items were partly offset by favorable timing of customer collections.  \n•\n$79 million increase in net investing cash outflows primarily due to cash payments for the acquisition of Photoneo and higher capital expenditures.\n•\n$159 million increase in net financing cash outflows primarily due to higher share repurchases in the current year, partially offset by net debt repayments in the prior year as well as the timing of transactions associated with servicing factored receivables.\n27\nTable of Contents\nCompany Debt\nThe following table shows the carrying value of the Company’s debt (in millions):\nSeptember 27,\n2025\nDecember 31,\n2024\nTerm Loan A\n$\n1,575 \n$\n1,575 \nSenior Notes\n500 \n500 \nReceivables Financing Facility\n108 \n108 \nTotal debt\n$\n2,183 \n$\n2,183 \nLess: Debt issuance costs\n(8)\n(9)\nLess: Unamortized discounts\n(2)\n(3)\nLess: Current portion of debt\n(66)\n(79)\nTotal long-term debt\n$\n2,107 \n$\n2,092 \nTerm Loan A\nThe principal on Term Loan A is due in quarterly installments, with the next quarterly installment due in the first quarter of 2026 and the majority due upon maturity on May 25, 2027. The Company has made and may make prepayments in whole or in part, without premium or penalty, and would be required to prepay certain outstanding amounts in the event of certain circumstances or transactions. As of September 27, 2025, the Term Loan A interest rate was 5.42%. Interest payments are made monthly and are subject to variable rates plus an applicable margin.\nSenior Notes\nIn the second quarter of 2024, the Company completed a private offering of $500 million senior unsecured notes (the “Senior Notes”) with a 6.5% fixed interest rate. The Senior Notes mature on June 1, 2032, and interest is payable semi-annually in arrears in June and December of each year. The Company has the option to or could be required to prepay certain outstanding amounts in the event of certain circumstances or transactions. \nThe Senior Notes are fully and unconditionally guaranteed on a senior unsecured basis by certain of Zebra’s existing and future subsidiaries. The Senior Notes contain covenants that, among other things, limit the ability of Zebra to: (i) grant or incur liens; (ii) have its subsidiaries guarantee debt without becoming guarantors; and (iii) merge or consolidate with another company or sell all or substantially all of its assets. \nRevolving Credit Facility\nThe Company has a Revolving Credit Facility that is available for working capital and other general business purposes, including letters of credit. As of September 27, 2025, the Company had letters of credit totaling $10 million, which reduced funds available for borrowings under the Revolving Credit Facility from $1,500 million to $1,490 million. As of September 27, 2025 and December 31, 2024, there were no borrowings under the Revolving Credit Facility. Upon borrowing, interest payments are made monthly and are subject to variable rates plus an applicable margin. The Revolving Credit Facility matures on May 25, 2027.\nReceivables Financing Facility\nAs of September 27, 2025, the Company has a Receivables Financing Facility with a borrowing limit of up to $180 million. As collateral, the Company pledges perfected first-priority security interests in its U.S. domestically originated accounts receivable. The Company has accounted for transactions under this facility as secured borrowings. The receivables financing facility matures on March 19, 2027.\nAs of September 27, 2025, the Company’s Consolidated Balance Sheets included $715 million of gross receivables that were pledged under the facility. As of September 27, 2025, $108 million had been borrowed and was classified as non-current. Borrowings under the facility bear interest at a variable rate plus an applicable margin. As of September 27, 2025, the facility had an average interest rate of 5.21%. Interest is paid monthly on these borrowings.\nThe Company’s borrowings described above include terms and conditions that limit the incurrence of additional borrowings and require that certain financial ratios be maintained at designated levels.\n28\nTable of Contents\nReceivables Factoring\nThe Company has a Receivables Factoring arrangement, pursuant to which certain receivables originated from the EMEA and Asia-Pacific regions up to a maximum of €150 million are sold to a bank without recourse in exchange for cash. Such transfers are accounted for as sales and the related receivables are removed from the Company’s balance sheet. The Company does not maintain any beneficial interest in the receivables sold. The Company services the receivables on behalf of the bank, but otherwise maintains no significant continuing involvement with respect to the receivables. Sale proceeds that are representative of the fair value of factored receivables, less a factoring fee, are reflected in Cash flows from operating activities on the Consolidated Statements of Cash Flows, while sale proceeds in excess of the fair value of factored receivables are reflected in Cash flows from financing activities on the Consolidated Statements of Cash Flows.\nAs of both September 27, 2025 and December 31, 2024, there were a total of $28 million of uncollected receivables that had been sold and removed from the Company’s Consolidated Balance Sheets.\nAs servicer of sold receivables, the Company had $60 million and $51 million of obligations that were not yet remitted to the bank as of September 27, 2025 and December 31, 2024, respectively. These obligations are included within Accrued liabilities on the Consolidated Balance Sheets, with changes in such obligations reflected within Cash flows from financing activities on the Consolidated Statements of Cash Flows.\nSee Note 15, \nAccounts Receivable Factoring\n in the Notes to Consolidated Financial Statements for further details.\nShare Repurchases\nOn May 17, 2022, the Company announced that its Board of Directors authorized a share repurchase program for up to $1 billion of its outstanding shares of common stock. The authorized share repurchase program does not have a stated expiration date. The level of the Company’s repurchases depends on a number of factors, including its financial condition, capital requirements, cash flows, results of operations, future business prospects and other factors its management may deem relevant. The timing, volume, and nature of repurchases are subject to market conditions, applicable securities laws and other factors and may be amended, suspended or discontinued at any time. Repurchases may be effected from time to time through open market purchases, including pursuant to a pre-set trading plan meeting the requirements of Rule 10b5-1(c) of the Securities Exchange Act of 1934. \nDuring the first nine months of 2025, the Company repurchased 960,889 shares of common stock for approximately $284 million. As of September 27, 2025, the Company has cumulatively repurchased 1,500,463 shares of common stock for approximately $438 million, resulting in a remaining amount of share repurchases authorized under the May 2022 program of approximately $562 million. Subsequent to the quarter ended September 27, 2025, the Company has repurchased 85,458 shares of common stock for approximately $25 million through October 21, 2025.\nSignificant Customers\nEnd-users of our offerings are diversified across a wide variety of industries. We have three customers, who are distributors of the Company’s offerings, that individually accounted for more than 10% of our Net sales for the periods presented. In the aggregate, the approximate percentage of our segment and Company total Net sales attributable to these customers was as follows:\nNine Months Ended\nSeptember 27, 2025\nSeptember 28, 2024\nAIT\nEVM\nTotal\nAIT\nEVM\nTotal\nSignificant customers as a % of Net sales\n21 \n%\n39 \n%\n60 \n%\n18 \n%\n38 \n%\n56 \n%\nThese customers accounted for 60% of accounts receivable as of September 27, 2025. No other customer accounted for more than 10% of total Net sales during the period ended September 27, 2025.\n29\nTable of Contents\nSafe Harbor\nForward-looking statements contained in this filing are subject to the safe harbor created by the Private Securities Litigation Reform Act of 1995 and are highly dependent upon a variety of important factors, which could cause actual results to differ materially from those expressed or implied in such forward-looking statements. When used in this document and documents referenced, the words “anticipate,” “believe,” “intend,” “estimate,” “will,” and “expect” and similar expressions as they relate to the Company or its management are intended to identify such forward-looking statements but are not the exclusive means of identifying these statements. Any forward-looking statements represent our views only as of today and should not be relied upon as representing our views as of any subsequent date. The forward-looking statements include, but are not limited to, the Company’s financial outlook for full year of 2025. These forward-looking statements are based on current expectations, forecasts and assumptions, and are subject to the risks and uncertainties inherent in the Company’s industry, market conditions, general domestic and international economic conditions, and other factors. These factors include:\n \n•\nMarket acceptance of the Company’s products, services, and software solutions and competitors’ offerings and the potential effects of emerging technologies and changes in customer requirements,\n•\nThe effect of global market conditions, including the North America; EMEA; Latin America; and Asia-Pacific regions in which we do business,\n•\nThe impact of changes in foreign exchange rates, customs duties and trade policies due to the global nature of Zebra’s business,\n•\nOur ability to control manufacturing and operating costs,\n•\nRisks related to the manufacturing of the Company’s products and conducting business operations in non-U.S. countries, including the risk of depending on key suppliers who are also in non-U.S. countries,\n•\nThe Company’s ability to purchase sufficient materials, parts, and components, our ability to provide services, software, and products to meet customer demand, particularly in light of global economic conditions,\n•\nThe availability of credit and the volatility of capital markets, which may affect our suppliers, customers, and ourselves,\n•\nSuccess of integrating acquisitions,\n•\nOur ability to attract, retain, develop, and motivate key personnel,\n•\nInterest rate and financial market conditions,\n•\nAccess to cash and cash equivalents held outside the U.S.,\n•\nThe effect of natural disasters, man-made disasters, public health issues (including pandemics), and cybersecurity incidents on our business, our customers or our contracted third parties,\n•\nThe impact of changes in foreign and domestic governmental policies, laws, or regulations,\n•\nThe outcome of litigation in which the Company may be involved, particularly litigation or claims related to infringement of third-party intellectual property rights, and\n•\nThe outcome of any future tax matters or tax law changes.\nWe encourage readers of this report to review Part II, Item 1A, “Risk Factors” in this report for further discussion of issues that could affect the Company’s future results. We undertake no obligation, other than as may be required by law, to publicly update or revise any forward-looking statements, whether as a result of new information, future events, changed circumstances, or any other reason after the date of this report.\nNew Accounting Pronouncements\nRecently Issued Accounting Pronouncements Not Yet Adopted\nIn December 2023, the FASB issued ASU No. 2023-09, Income Taxes (Topic 740): Improvements to Income Tax Disclosures, which requires an annual tabular effective tax rate reconciliation disclosure including information for specified categories and jurisdiction levels, as well as, disclosure of income taxes paid, net of refunds received, disaggregated by federal, state/local, and significant foreign jurisdiction. This ASU will be effective for the Company’s fiscal December 31, 2025 year-end and will not have an impact on our results of operations, cash flows, or financial condition.\nIn November 2024, the FASB issued ASU No. 2024-03, Disaggregation of Income Statement Expenses, which requires disaggregated disclosure of certain categories of expenses that are included within expense captions presented on the Consolidated Statements of Operations on an annual and interim basis. This ASU will be effective for the Company’s fiscal December 31, 2027 year-end and interim periods thereafter, with early adoption permitted. We are assessing the impact of this guidance on our disclosures; it will not have an impact on our results of operations, cash flows, or financial condition.\nIn July 2025, the FASB issued ASU No. 2025-05, Financial Instruments—Credit Losses (Topic 326): Measurement of Credit Losses for Accounts Receivable and Contract Assets, which provides a practical expedient to assume that current conditions as of the balance sheet date will remain unchanged while estimating the expected credit losses on accounts receivables and contract assets.  This ASU will be effective for the Company beginning in 2026, with early adoption permitted.  While we are \n30\nTable of Contents\ncurrently assessing the impact of this ASU, we do not expect it to have a significant impact to the Company’s consolidated financial statements.\nIn September 2025, the FASB issued ASU No. 2025-06, Intangibles—Goodwill and Other—Internal-Use Software (Subtopic 350-40): Targeted Improvements to the Accounting for Internal-Use Software, which amends the criteria for capitalizing internal-use software development costs.  This ASU will be effective for the Company beginning in 2028, with early adoption permitted.  While we are currently assessing the impact of this ASU, we do not expect it to have a significant impact to the Company’s consolidated financial statements.\nNon-GAAP Measures\nThe Company has provided reconciliations of the supplemental non-GAAP financial measures, as defined under the rules of the Securities and Exchange Commission, presented herein to the most directly comparable financial measures calculated and presented in accordance with GAAP.\nThese supplemental non-GAAP financial measures – Consolidated Organic Net sales growth, AIT Organic Net sales growth, and EVM Organic Net sales growth – are presented because our management evaluates our financial results both including and excluding the effects of business acquisitions and foreign currency translation, as applicable. Management believes that the supplemental non-GAAP financial measures presented provide additional perspective and insights when analyzing the core operating performance of our business from period to period and trends in our historical operating results. These supplemental non-GAAP financial measures should not be considered superior to, as a substitute for, or as an alternative to, and should be considered in conjunction with the GAAP financial measures presented."
}