{
  "item1": "Operations Technologies operations consist two reportable segments: Asset Intelligence & Tracking (“AIT”), which includes barcode card printing, RFID RTLS offerings, supplies, services; Enterprise Visibility & Mobility (“EVM”), which includes mobile computing, data capture, fixed industrial scanning machine vision, services workflow optimization solutions. believe offerings across these segments collectively elevate Zebra’s positioning customers, enabling us better transform workflows. Asset Intelligence & Tracking Barcode Card Printing: design, manufacture, sell printers, which produce high-quality labels, wristbands, tickets, receipts, plastic cards demand. customers use printers wide range applications, including routing tracking, patient safety, transaction processing, personal identification, product authentication, ticketing receipts.",
  "item7": "Selling marketing Research development General administrative Settlement related costs Amortization intangible assets NM NM NM Acquisition integration costs NM NM NM Exit restructuring costs NM NM NM Total Operating expenses Consolidated Organic Net sales growth (decline): Year Ended December 31, Reported GAAP Consolidated Net sales growth (decline) Impact foreign currency translations Impact acquisitions Consolidated Organic Net sales growth (decline) Operating results reported U.S. Dollars affected foreign currency exchange rate fluctuations. Foreign currency translation impact represents difference results attributable fluctuations currency exchange rates used convert results businesses where functional currency not U.S. Dollar.",
  "item2": "Cash flow provided (used in): Operating activities Investing activities Financing activities Effect exchange rates cash balances Net change cash cash equivalents, including restricted cash change cash cash equivalents balance during nine months ended September 27, 2025 compared prior year primarily due following: $147 million decrease net operating cash inflows primarily due larger reductions inventory prior year, higher employee incentive compensation payments current year, cash receipts settlements terminated interest rate swap agreements prior year. These items partly offset favorable timing customer collections. $79 million increase net investing cash outflows primarily due cash payments acquisition Photoneo higher capital expenditures. $159 million increase net financing cash outflows primarily due higher share repurchases current year, partially offset net debt repayments prior year well timing transactions associated servicing factored receivables."
}