{
  "source_file": "zbra-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1.\nBusiness\nThe Company\nWe are a global leader in the Automatic Identification and Data Capture (“AIDC”) industry. The AIDC market consists of mobile computing, data capture, radio frequency identification devices (“RFID”), thermal barcode printing, and other workflow automation products and services. The Company’s products, services, and software solutions (“offerings”) are proven to help our customers and end-users digitize and automate their workflows to achieve their critical business objectives, including improved productivity and operational efficiency, optimized regulatory compliance, and better customer experiences.\nWe design, manufacture, and sell a broad range of AIDC offerings, including: mobile computers, barcode scanners and imagers, RFID readers, specialty printers for barcode labeling and personal identification, real-time location systems (“RTLS”), related accessories and supplies, such as labels and other consumables, and related software applications. We also provide machine vision and robotics automation solutions; a full range of services, including maintenance, technical support, repair, \n4\nTable of Contents\nmanaged and professional services; as well as cloud-based software subscriptions. End-users of our offerings include those in retail and e-commerce, manufacturing, transportation and logistics, healthcare, public sector, and other industries. We operate in 114 facilities with approximately 9,900 employees worldwide.  We provide our offerings globally through a direct sales force and an extensive network of over 10,000 channel partners, operating in approximately 176 countries.\nWe continue to advance our Enterprise Asset Intelligence (“EAI”) vision: every asset and front-line worker visible, connected, and fully optimized. Through continual innovation, we have expanded beyond the traditional AIDC market to transform activities such as factory production, packages moving through a supply chain, retail shopping, the hospital patient journey and first responders addressing public safety and emergency situations. Data from enterprise assets, including status, condition, location, utilization, and preferences, is analyzed in the cloud to provide prioritized actionable insights. As a result, our offerings enable enterprises to “sense, analyze, and act” more effectively to optimize their activities.\nThe need to transform workflows is being driven by secular trends in technology, which include the internet of things (\n“IoT”\n), cloud-based data analytics, automation, mobility, computer vision, as well as artificial intelligence and machine learning. The IoT enables the real-time exchange of an increasingly broad set of information among a proliferation of smart, connected devices. The continued rapid growth of mobile computing devices and application software is also significantly expanding use cases throughout enterprises and supply chains. With these expanded capabilities, end-users can consume and act upon dynamic enterprise data and information anytime and anywhere. Leveraging artificial intelligence through machine learning can analyze real-time data for increased visibility into workflows. Additionally, computer and machine vision technology, which enables the automatic extraction and understanding of useful information from a digital image or video, provides a key element in many of our offerings.\nAcquisitions\nMatrox: \nOn June 3, 2022, the Company acquired Matrox Electronic Systems Ltd. (“Matrox”) for $881 million in cash, net of Matrox’s cash on-hand. Matrox is a leading provider of advanced machine vision components and software serving multiple end-markets. Through its acquisition, the Company expanded its machine vision products and software offerings. The operating results of Matrox are included in the EVM segment. \nPhotoneo\n: On December 27, 2024, the Company entered into a definitive agreement to acquire Photoneo, a leading developer and manufacturer of 3D machine vision solutions. The purchase price of approximately €60 million is expected to be funded with cash on hand.  The transaction is subject to customary closing conditions and is expected to close in the first quarter of 2025. The acquired business will become part of the EVM segment.\nSee Note 5, \nBusiness Acquisitions \nin the Notes to Consolidated Financial Statements for additional details.\n \nOperations and Technologies\nOur operations consist of two reportable segments: Asset Intelligence & Tracking (“AIT”), which includes barcode and card printing, RFID and RTLS offerings, supplies, and services; and Enterprise Visibility & Mobility (“EVM”), which includes mobile computing, data capture, fixed industrial scanning and machine vision, services and workflow optimization solutions. We believe that the offerings across these segments collectively elevate Zebra’s positioning with our customers, enabling us to better transform workflows.\nAsset Intelligence & Tracking\nBarcode and Card Printing:\n We design, manufacture, and sell printers, which produce high-quality labels, wristbands, tickets, receipts, and plastic cards on demand. Our customers use our printers in a wide range of applications, including routing and tracking, patient safety, transaction processing, personal identification, product authentication, ticketing and receipts. These applications require high levels of data accuracy, speed, and reliability.\nOur printers use thermal printing technology, which creates images by heating certain pixels of an electrical printhead to selectively image a ribbon or heat-sensitive substrate.  Our printers integrate company-designed mechanisms, electrical systems, and firmware that supports serial, parallel, Ethernet, USB, Bluetooth, or 802.11 wireless communications with appropriate security protocols.  Enclosures of metal or high-impact plastic help ensure durability of our printers. Printing instructions can be received as a proprietary language such as Zebra Programming Language II, as a print driver-provided image, or as user-defined Extensible Markup Language. These features make our printers easy to integrate into most computer systems.  \nWe also provide dye-sublimination thermal card printers that produce high quality images and are used for secure, reliable personal identification (e.g. state identification cards, drivers’ licenses, and healthcare identification cards), access control (e.g. employee or student building access), and financial transactions (e.g. credit, debit and ATM cards). Additionally, we provide RFID printers that encode data into passive RFID transponders embedded in a label or card. We offer a wide range of accessories and options for our printers, including carrying cases, vehicle mounts and battery chargers. \n5\nTable of Contents\nRFID and RTLS Offerings: \nWe provide a range of hardware and software options for capturing location data to satisfy a large variety of requirements for range, accuracy, and precision. Our active and passive RFID products include fixed readers, RFID enabled mobile computers, and RFID sleds that utilize passive ultra-high frequency to provide high-speed, data capture from hundreds or thousands of RFID tags in near real-time without line of sight, complementing the barcode. Using the Electronic Product Code (“EPC”) standard, end-users across multiple industries use our RFID technology to track high-value assets, monitor shipments, and drive increased retail sales through improved inventory accuracy. Our location solutions offerings include a range of RTLS offerings that generate precise, on-demand information about the physical location and status of high-value assets, equipment, and people. These offerings incorporate active and passive RFID technologies, beacons, and other tracking technologies to enable users to locate, track, manage, and optimize the utilization of enterprise assets and personnel. We provide substantially all elements of the location solution, including tags, sensors, exciters, middleware software, and application software. We also foster a highly specialized ecosystem of location and tracking partners who complement our offerings and help integrate them into our joint customers’ operations.\nSupplies:\n We produce and sell stock and customized thermal labels, wristbands, receipts, ribbons, plastic cards, and RFID tags suitable for use with our printers, as well as wristbands for use in laser printers. We support our printing products, resellers, and end-users with an extensive line of superior quality, high-performance supplies optimized to a particular end-user’s needs, such as chemical or abrasion resistance, extreme temperature environments, exceptional image quality, or long life. We promote the use of supplies with our printing equipment. Our supplies business also includes electronic sensors and temperature-monitoring labels which incorporate chemical indicators designed to change color upon exceeding predefined time and/or temperature thresholds, used in vaccine distribution and other use cases in healthcare and food safety.  \nServices:\n We provide a full range of maintenance, technical support, and repair services. We also provide managed and professional services, including those which help customers manage their devices and related software applications. Our offerings include cloud-based subscriptions and multiple service levels. They are typically contracted through multi-year service agreements. We provide our services directly and through our global network of partners.\nEnterprise Visibility & Mobility\nMobile Computing: \nWe design, manufacture, and sell rugged and enterprise-grade mobile computing products and accessories in a variety of specialized form factors and designs to meet a wide array of enterprise applications. Purpose-built handheld and wearable mobile computers, vehicle mounted computers, tablets and kiosks ensure reliable operations for targeted use cases, surviving years of rough handling and harsh environments. Industrial applications include inventory management in warehouses and distribution centers; field mobility applications include field service, post and parcel, and direct store delivery; and retail and customer facing applications include e-commerce, omnichannel, mobile point of sale, inventory look-up, staff collaboration, and analytics. Our mobile computing products primarily incorporate the Android™ operating system with software extensions for the enterprise and support local-area and wide-area voice and data communications. Our products include software tools and services that enable secure data transmission while also supporting application development, device configuration, and field support to facilitate seamless, rapid deployment and maximum customer return on investment.  Our products often incorporate barcode scanning, global position system and RFID features, and other sensory capabilities. Additionally, specialized features, such as advanced data capture technologies, data analytics technologies, voice and video collaboration tools, and advanced battery technologies, enable our customers to work more efficiently and better serve their own customers.\nData Capture, Fixed Industrial Scanning, and Machine Vision:\n We design, manufacture, and sell barcode scanners, industrial machine vision cameras, and fixed industrial scanners. Our portfolio of scanners includes laser scanning and imager products in a variety of form factors, including fixed, handheld, and embedded original equipment manufacturer (“OEM”) modules. Our scanners incorporate a range of technologies including area imagers, linear imagers, and lasers, as well as read linear and two-dimensional barcodes.  They are used in a broad range of applications, ranging from supermarket checkouts to industrial warehouse optimization to patient management in hospitals.  The design of these offerings reflects the diverse needs of these markets, with different ergonomics, multiple communication protocols, and varying levels of ruggedness.  In 2021 we introduced fixed industrial scanning and machine vision offerings, and in 2022, we significantly expanded our machine vision offerings through the acquisition of Matrox Imaging. Our fixed industrial scanning products automatically track and trace items that move from production through distribution. Our industrial machine vision platform-independent software, software development kits, smart cameras, vision controllers, frame grabbers, input/output cards, and 3D sensors capture, inspect, assess, and record data from industrial vision systems in factory automation, semiconductor inspection, pharmaceutical packaging, food & beverage, among other use cases. We also provide related software and accessories for these offerings.\nServices:\n We provide a full range of maintenance, technical support, and repair services. We also provide managed and professional services that, among other things, help customers design, test, and deploy our offerings as well as manage their mobility devices, software applications and workflows. Our offerings include cloud-based subscriptions with multiple service levels, which are typically contracted through multi-year service agreements. We provide our services directly and through our global network of partners.\n6\nTable of Contents\nWorkflow optimization solutions:\n We provide a portfolio of offerings that help our customers improve the agility and productivity of key workflows by analyzing and acting on operational data in real-time. Our primary focus is on frontline workers in Zebra’s end markets, including retail, transportation and logistics, manufacturing, and healthcare.  Our workflow optimization solutions include:\n•\nSoftware-based offerings, which include workforce management, workflow execution and task management, demand-sensing, price optimization, and prescriptive analytics, as well as communication and collaboration-based offerings. These offerings are typically delivered through cloud-based software subscriptions and leverage big data, artificial intelligence, and mobile and web applications to provide customers with real-time visibility and actionable insights about their business.  By analyzing labor, inventory, transactional and real-time situational data, these offerings are able to forecast demand, prescribe actions, schedule workers, and enhance collaboration. Our software-based offerings are available with multiple service levels, and are often contracted through multi-year service agreements; \n•\nManaged service offerings comprised of software and hardware bundled together, which include a range of physical inventory management offerings for retail, including offerings for full store physical inventories, cycle counts, and analytics; and\n•\nRobotic automation offerings, which include software-powered autonomous robots that enable customers to orchestrate workflows alongside frontline workers, improving productivity and operational efficiency. Our robotic automation offerings are available in a variety of form factors to accommodate many use cases, from e-commerce fulfillment to material movement.\nOur Competitive Strengths \nThe following are core competitive strengths that we believe enable us to differentiate ourselves from our competitors:\nAn industry leader focused on improving enterprise workflows on the frontline\nWe are focused on the key complementary technology offerings that drive improved enterprise workflows on the frontline, including mobile computing, barcode and card printing, data capture, RFID, fixed industrial scanning, machine vision, and workflow optimization solutions, along with related software, services, and accessories. Our leadership position enables us to work with and support customers globally, in a variety of industries, who are focused on implementing leading-edge offerings.\nHigh barriers to entry\nOn a global basis, we have long-standing relationships with end-users and with our extensive network of channel partners. We believe these customer relationships and our strong partner network are critical to our success and would be difficult for a new market entrant to replicate. We believe a significant portion of our offerings are deployed with specialized product performance and software application requirements, which could result in high switching costs.\nCommitment to innovation and deep industry-specific expertise\nOver time, we have developed and delivered improved, targeted end-to-end offerings for our customers.  We remain committed to leveraging our technology portfolio and expertise in the industries that we service to continue to develop innovative offerings that meet the key needs of our customers.\nHighly diversified business mix\nWe are highly diversified across business segments, end markets, geographies, and customers. Additionally, we have strong recurring business in services, supplies, and software driven by an extensive global installed base of purpose-built offerings.\nGlobal reach and brand\nWe sell to customers directly and through our network of channel partners around the world. Our presence gives us the capability to serve our customers globally. In addition, we maintain strong brand recognition with a positive reputation in the industry as a trusted and strategic partner known for delivering high quality offerings that are reliable and durable.      \nScale advantages\nWe believe the size and scope of our operations, including market leadership, offering development investment, portfolio breadth, and global distribution, give us advantages over our competitors. We believe we have the largest installed base of offerings compared to other companies in our industry. These characteristics enable us to compete successfully, achieve economies of scale, and develop industry-leading offerings.\n7\nTable of Contents\nOur Business Strategies \nLeverage our market leadership position and innovation to profitably grow our core business\nWe expect to drive revenue growth by continuing to outpace our competition in our core businesses, including mobile computing, data capture, thermal barcode printing, and services. We expect to achieve this by leveraging our broad portfolio of offerings and product innovation and continuing to be a strategic partner to end customers. We also expect to drive growth by capitalizing on technology transitions occurring in the industry, including transitions to WiFi 7, the 5th generation mobile network (5G) and Android™ operating system in mobile computing and transitions in data capture to technologies involving 2D and 3D imaging and RFID, among others. This includes increased focus on market segments and geographies that offer share-gain opportunities. In addition, we plan to leverage our market-leading installed base to accelerate growth in attach-oriented offerings, including services, supplies, accessories, and software applications. Our global channel partner network is vital to helping us achieve these goals. As such, we will ensure that we provide the necessary value and support for our partners to be successful.\nAdvance our Enterprise Asset Intelligence vision\nOur EAI vision is for every asset and front-line worker to be connected, visible, and fully optimized. We believe that secular technology trends, particularly in IoT, cloud computing, automation, mobility, and artificial intelligence advance our vision and are transforming our customers’ businesses and our industry, providing us with significant new opportunities to create value for our customers and for the Company. We expect to capitalize on these trends, and in particular the proliferation of smart connected sensors and devices in our core market segments, by providing end-to-end offerings that integrate these sensors and devices with cloud-based software which add value to our customers’ workflows and analytics. We plan to continue investing in the development of technologies that serve as the foundation for intelligent operations, providing our customers with visibility, connected frontline workers, and intelligent automation. Our offerings will also increasingly include advanced features, functions, and user experiences to drive additional competitive differentiation and elevate our role as a solutions provider.\nIncrease our opportunity for growth through expansion in adjacent market segments\nWe plan to drive growth through expansion, organically and inorganically, in adjacent market segments that are synergistic with our core markets. We will focus specifically on segments where our offerings, workflow expertise, and customer and industry relationships enable us to provide significant value to end-users.  \nEnhance financial strength and flexibility\nWhile maintaining our strong balance sheet, we intend to continue to improve profitability and cash flow generation through operational execution and increased productivity derived from continuous business process improvement, supply chain resiliency, cost management, and focus on working capital efficiency.\nSustainable business model \nZebra’s sustainability priorities of human capital management, resource conservation, and climate align with our strategic focus and corporate values. Initiatives within these priorities are advanced by our cross-functional Sustainability Council, with executive sponsorship and board oversight. Our approach helps to ensure that our business is sustainable over the long term for the benefit of our primary stakeholder groups, including employees, customers, partners, and investors. We are driving a high-performance culture, striving to consistently be the employer of choice in the communities where we work and live. We also focus on waste reduction, circular economy product innovation with certified refurbished devices, eco-packaging and sustainable product design. Additionally, we have science-based targets for carbon emission reductions in Zebra’s operations and throughout our value chain. \nCompetition\nWe operate in a highly competitive environment. The need for companies to improve productivity and implement their strategies, as well as the secular trends around IoT, cloud computing, automation, and mobility, are some of the factors that are creating growth opportunities for established and new competitors.\nKey competitive factors include the breadth and quality of offerings, as well as pricing, design, performance, durability, geographic availability, warranty coverage, relationships with customers and channel partners, company reputation, and brand recognition. We believe we compete effectively with respect to these factors.\nBarcode and Card Printing\n: We consider our direct competition in printing to be producers of on-demand fixed, mobile, and RFID thermal printers. We also compete with companies producing printing systems that use technologies such as laser, ink-jet, and direct marking. In addition, service bureaus, which provide centralized services, represent an alternative to our card printing offerings. Competitors include: Avery Dennison, Entrust, Honeywell, Sato, Toshiba TEC, and TSC.\n8\nTable of Contents\nData Capture, Fixed Industrial Scanning, and Machine Vision\n: Competitors that provide a broad portfolio of barcode scanning products and related services that are suitable for most global market applications include Datalogic and Honeywell. We also compete against smaller companies that focus on limited product subsets or specific regions, including Newland. Competitors in our fixed industrial scanning and machine vision business include Cognex, Keyence, and SICK.\nMobile Computing\n: Competitors in mobile computing and related services include companies that have historically served enterprises with ruggedized devices. For some applications, we compete with companies that provide tablets and smart phones. Competitors include: Datalogic, Honeywell, Panasonic, and Urovo.\nRFID and RTLS Offerings\n: We compete with numerous companies operating in this market including Chainway, Impinj, Invengo, JADAK, Rodinbell, and Ubisense.\nSupplies\n: The supplies industry is highly fragmented with competition comprised of numerous companies of various sizes around the world.\nWorkflow optimization solutions:\n We compete with a diverse and varied group of companies across our offerings worldwide. Competitors range from providers of software-based offerings serving customers in the retail industry to providers of autonomous mobile robot offerings serving customers in the manufacturing, distribution, and fulfillment industries.\nCustomers\nEnd-users of our offerings are diversified across a wide variety of industries. We have three customers, who are distributors of the Company’s offerings, that individually accounted for more than 10% of our Net sales during the past three years. No other customer accounted for more than 10% of our Net sales during these years. See Note 20, \nSegment Information & Geographic Data \nin the Notes to Consolidated Financial Statements for further information.\nOur Net sales to significant customers as a percentage of the Company’s total Net sales were approximately:\n \nYear Ended December 31,\n \n2024\n2023\n2022\nCustomer A\n21 \n%\n18 \n%\n21 \n%\nCustomer B\n19 \n%\n14 \n%\n15 \n%\nCustomer C\n14 \n%\n12 \n%\n13 \n%\nSales and Marketing\nSales:\n We sell our offerings primarily through distributors (two-tier distribution), value added resellers (“VARs”), independent software vendors (“ISVs”), direct marketers, and OEMs, and our software offerings primarily through our direct sales force. We also sell our offerings directly to a select number of customers through our direct sales force. Distributors purchase our products and sell to VARs, ISVs and others, thereby increasing the distribution of our products globally. VARs, ISVs, OEMs, and systems integrators provide end users with a variety of hardware, accessories, software applications, and services. VARs and ISVs typically customize offerings for specific end-user applications using their industry, systems, and applications expertise. Some OEMs resell Zebra-manufactured offerings under their own brands as part of their own product offerings. Because these sales channels provide specific software, configuration, installation, integration, and support services to end-users within various industry segments, these relationships are highly valued and allow our products to reach end users in a wide array of industries around the world. We believe that the breadth of our distributor and channel partner network is a competitive differentiator and enhances our ability to compete. Finally, we experience some seasonality in sales, depending upon the geographic region and industry served.\nMarketing:\n Our marketing function aligns closely with sales, customer success and product management to promote our offerings that address the needs of our customers. Marketing is responsible for leading strategic cross-functional practices which benefit the broader organization including pricing, enterprise analytics, customer experience, market sizing, brand strategy and channel strategy. From a more traditional sense, the marketing organization is also comprised of regional marketing teams that interface closely with customers, partners, and sellers; plus teams that support external communications, offering marketing, digital marketing, marketing operations, and business intelligence functions.\n9\nTable of Contents\nManufacturing and Outsourcing\nFinal assembly of our hardware products is performed by third parties, including electronics manufacturing services companies (“EMSs”) and joint design manufacturers (“JDMs”). Our products are currently produced in facilities primarily located in the Asia-Pacific region, including China, Taiwan, Vietnam, Malaysia, and Mexico. The EMSs and JDMs produce our products to our design specifications. We maintain control over portions of the supply chain, including supplier selection and price negotiations for key components. The manufacturers generally purchase all the components and subassemblies used in the production of our products. Our products are shipped to regional distribution centers, operated by third-party logistics providers or the Company. A portion of products are reconfigured at the distribution centers through firmware downloads, packaging, and customer specific customization before they are shipped to customers. In addition, certain products are manufactured in accordance with procurement regulations and various international trade agreements and remain eligible for sale to the U.S. government. \nProduction facilities for our supplies products are located in the U.S. and Europe. We also supplement our in-house supplies production capabilities with third-party manufacturers, principally located in Asia-Pacific.\nRepair services for our products are performed by either our own operations or through third parties, with repair service hubs located in each of the regions in which we serve our customers.\nResearch and Development\nThe Company devotes significant resources to developing innovative offerings for our target markets and ensuring that our offerings maintain high levels of reliability and provide value to end-users. Research and development expenditures for the years ended 2024, 2023 and 2022 were $563 million, $519 million and $570 million, or 11.3%, 11.3% and 9.9% of Net sales, respectively. Worldwide, we have employed approximately 2,750 engineers and innovation and design experts, who along with contractors, are focused on strengthening and broadening our extensive portfolio of offerings.\nIntellectual Property\nWe rely on a combination of trade secrets, patents, trademarks, copyrights, and contractual rights to establish and protect our innovations, and hold a large portfolio of intellectual property rights in the U.S. and other countries. As of December 31, 2024, the Company owned approximately 1,700 trademark registrations and trademark applications, and approximately 7,150 patents and patent applications, worldwide.\nWe believe that our intellectual property will continue to provide us with a competitive advantage in our offerings as well as provide leverage for future technologies. Our success depends more upon our extensive know-how, deep understanding of end-user processes and workflows, innovative culture, technical leadership, and marketing and sales abilities. Although we do not rely only on patents or other intellectual property rights to protect or establish our market position, we will enforce our intellectual property rights when and where appropriate.\nHuman Capital\nAs of December 31, 2024, the Company had approximately 9,900 employees globally, with a majority in sales and technical roles. Our employees work in 54 countries with 45% of our employee population residing in the U.S. Some locations where business is conducted, primarily in Europe, China, and India, are subject to labor laws that differ significantly from those in the U.S.\nThe Company is committed to attracting, developing, and retaining talent to enable our strategic vision and purpose. This commitment directly shapes our approach to fostering a culture of belonging and advances employee engagement. It is Zebra’s policy to provide equal employment opportunity to all applications and employees. Our vision is to leverage the workforce where employees can bring their best selves to work, and to be a workspace where all employees are seen, heard, valued and respected. We believe this increases Zebra’s innovation.\nWe believe that our strong Company culture is a key contributor to our success. Following the refresh of Zebra’s values (Lead through Innovation; Deliver Excellence with Agility; Think and Act Customer First; Succeed as One; and Make a Positive Impact) in 2023, we launched our culture reinvigoration campaign in 2024. The campaign’s action-based workshop, experienced virtually or in person, provides employees an opportunity to learn and share experiences relating to the importance of Zebra’s culture and values. Employee engagement within the Company is consistently high and measures above relevant benchmarks for technology companies. Furthermore, as recognition of the Company’s strong culture and commitment to its employees, Zebra was ranked #78 on Newsweek’s list of Global Most Loved Workplaces, and #51 on Fast Company’s list of the Best Workplaces for Innovators.\nThe well-being of Zebra’s employees remains a core focus, and we have benefits reflecting this commitment, including zDay, (a paid, Company-wide day off for all eligible Zebra employees), summer hours, and Focus Fridays (which encourage meeting-free time on Friday afternoons).\n10\nTable of Contents\nTalent Development\nZebra is committed to creating an environment that fosters continuous learning. We believe that effective career development happens when employees and managers have open discussions regarding their development plans and how best to use Zebra’s resources to support their learning and career growth. These resources include the Zebra Education Network, an online learning platform available to all employees offering a wide variety of learning content that employees can connect to their individual development plans. We also offer annual training and certification programs, including mandatory compliance training. We also have structured mentorship programs for our employees.\nZebra’s Global Learning and Leadership Roadmap outlines our development programs and is supplemented through various functional and business unit offerings, focused on functional development needs. The Roadmap invites all employees to participate in their development at any stage of their career.  New employees complete our Foundations course where they learn about Zebra, our vision, purpose, culture, and available resources, all taught through hands-on experiences and interactive presentations. Employees who are new to leading people can complete our Leadership Essentials and our Inclusive Leadership courses, which are designed to foster their leadership and management skills.\nSenior Zebra leaders can also nominate employees for a series of leadership programs and experiences designed to advance the nominees’ development at critical stages of their careers. We connect these nominations to our annual talent review and succession planning process, which includes an assessment of our future leadership pipeline so that we can proactively develop our high potential employees for the future.\nEmployee Resource Groups (ERGs)\nZebra has ten employee-led ERGs, each of which is open to all employees. Over 25% of our employees are members of at least one ERG. We continue to expand membership across the business.\nCommunity Engagement and Philanthropy\nWe have established partnerships with local organizations to forge meaningful relationships within the communities where Zebra operates and have closely tied our outreach strategy with our work in these communities. \nOur employees actively participate in volunteering activities and are supported through our Zebra Gives programs. Through Zebra’s community partnerships, our employees leverage their talents and experience to make a positive impact on important community causes, including the advancement of STEM education. Through our partnerships to advance STEM, we sponsor educational events, mentor teams and individuals, and pilot programs to widen Zebra’s future talent pipeline. Our philanthropy efforts focus on healthcare and disaster relief where we maintain relationships with key strategic partners.\nRegulatory Matters\nWireless Regulatory Matters\nOur business is subject to certain wireless regulatory matters. The use of wireless voice, data, and video communications systems requires radio spectrum, which is regulated by government agencies throughout the world. In the U.S., the Federal Communications Commission (“FCC”) and the National Telecommunications and Information Administration (“NTIA”) regulate spectrum use by commercial entities and federal entities, respectively. Similarly, countries around the world have one or more regulatory bodies that define and implement the rules for use of the radio spectrum, pursuant to their respective national laws and international coordination under the International Telecommunications Union. We manufacture and market products to be used in spectrum bands already made available by regulatory bodies, these include voice and data infrastructure, mobile radios, and portable or hand-held devices. Consequently, our results of operations could be positively or negatively affected by the rules and regulations adopted from time-to-time by the FCC, NTIA, or regulatory agencies in other countries. Our products operate both on the licensed and unlicensed spectrum. The availability of additional radio spectrum may provide new business opportunities, and consequently, the loss of available radio spectrum may result in the loss of business opportunities. Regulatory changes in current spectrum bands may also provide opportunities or may require modifications to some products so they can continue to operate as expected. See Item 1A, \nRisk Factors\n for additional information regarding risks relating to wireless regulatory matters.\nOther Regulatory Matters\nSome of our operations use substances regulated under various federal, state, local, and international laws governing the environment and worker health and safety, including those governing the discharge of pollutants into the ground, air and water, the management and disposal of hazardous substances and wastes and the cleanup of contaminated sites. Certain products are subject to various federal, state, local, and international laws governing chemical substances in electronic offerings. During 2024, compliance with U.S. federal, state and local, and foreign laws regulating the discharge of materials into the environment, or otherwise relating to the protection of the environment did not have a material effect on our business or results of operations.\n11\nTable of Contents\nAvailable Information\nOur website address is www.zebra.com. The information on our website is not, and shall not be deemed to be, a part of this Annual Report on Form 10-K or incorporated into any other filings we make with the Securities and Exchange Commission (“SEC”). Our annual report on Form 10-K, quarterly reports on Form 10-Q, current reports on Form 8-K, and any amendments to those reports, are made available free of charge on the Investor Relations page of our website as soon as reasonably practicable after we electronically file them with or furnish them to the SEC.\n12\nTable of Contents",
  "item7": "Item 7.\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nThis section generally discusses fiscal 2024 and 2023 items and year-over-year comparisons between 2024 and 2023. Discussions of 2022 items and year-over-year comparisons between 2023 and 2022 are not included herein. Refer to “Management’s Discussion and Analysis of Financial Condition and Results of Operations” in Part II, Item 7 of the Company’s Annual Report on Form 10-K for the fiscal year ended December 31, 2023 for that discussion.\nOverview\nThe Company is a global leader in providing Enterprise Asset Intelligence (“EAI”) offerings in the Automatic Identification and Data Capture (“AIDC”) industry. The AIDC market consists of mobile computing, data capture, radio frequency identification devices (“RFID”), barcode printing, and other workflow automation offerings.  The Company’s operations consist of two reportable segments that provide complementary offerings to our customers: Asset Intelligence & Tracking (“AIT”) and Enterprise Visibility & Mobility (“EVM”). Refer to Part I, Item 1 of this document for additional information.\n•\nThe AIT segment is an industry leader in barcode printing and asset tracking technologies. Its major product lines include barcode and card printers, RFID and RTLS offerings, and supplies, including temperature-monitoring labels, and services.\n•\nThe EVM segment is an industry leader in automatic information and data capture offerings. Its major product lines include mobile computing, data capture, fixed industrial scanning and machine vision, services, and workflow optimization solutions. Our workflow optimization solutions include cloud-based software subscriptions, retail solutions, and robotic automation solutions. \n2024 Financial Summary and Other Recent Developments\n \n•\nNet sales were $4,981 million in the current year compared to $4,584 million in the prior year.\n•\nOperating income was $742 million in the current year compared to $481 million in the prior year.\n•\nNet income was $528 million, or $10.18 per diluted share in the current year, compared to Net income of $296 million, or $5.72 per diluted share in the prior year.\n•\nNet cash provided by operating activities was $1,013 million in the current year compared to net cash used in operating activities of $4 million in the prior year.\nAs we entered 2024, we saw the stabilization of distributor inventory levels in both of our segments and the beginning of a modest recovery in demand trends in certain of our offerings within our EVM segment. The demand trend recovery broadened across offerings within both segments beginning in the second half of the year contributing to improved revenue and profitability. As we look ahead to 2025, we expect increased uncertainty and volatility in global trade policy and foreign currency exchange rates.\nThe Company completed its actions under the 2022 Productivity Plan in the current year. Total charges associated with the 2022 Productivity Plan and the U.S. voluntary retirement plan (“VRP”), which was completed in 2023, were $127 million, including $17 million recorded in the current year. The costs of these actions are classified within Exit and restructuring on the Consolidated Statements of Operations. Together, these programs have impacted over 9% of our global employee base and have generated approximately $120 million of annualized net cost savings, primarily within Operating expenses.\nIn the second quarter, the Company completed a private offering of $500 million senior unsecured notes (the “Senior Notes”) with a 6.5% fixed interest rate; the proceeds of which, were partially used to repay outstanding debt. Additionally, with the issuance of the fixed rate Senior Notes, the Company terminated its interest rate swap agreements which were intended to result in a fixed interest rate on a portion of our variable rate debt.\nOn December 27, 2024, the Company entered into a definitive agreement to acquire Photoneo, a leading developer and manufacturer of 3D machine vision offerings. The purchase price of approximately €60 million is expected to be funded with cash on hand.  The transaction is subject to customary closing conditions and is expected to close in the first quarter of 2025. The acquired business will become part of the EVM segment.\n30\nTable of Contents\nResults of Operations: Year Ended 2024 versus 2023 and Year Ended 2023 versus 2022 \nConsolidated Results of Operations \n(amounts in millions, except percentages)\n \nYear Ended December 31,\nPercent\nChange 2024 vs 2023\nPercent\nChange 2023 vs 2022\n \n2024\n2023\n2022\nNet sales:\nTangible products\n$\n4,016 \n$\n3,665 \n$\n4,915 \n9.6 \n%\n(25.4)\n%\nServices and software\n965 \n919 \n866 \n5.0 \n%\n6.1 \n%\nTotal Net sales\n4,981 \n4,584 \n5,781 \n8.7 \n%\n(20.7)\n%\nGross profit\n2,413 \n2,123 \n2,624 \n13.7 \n%\n(19.1)\n%\nGross margin\n48.4 \n%\n46.3 \n%\n45.4 \n%\n210 bps\n90 bps\nOperating expenses\n1,671 \n1,642 \n2,095 \n1.8 \n%\n(21.6)\n%\nOperating income\n$\n742 \n$\n481 \n$\n529 \n54.3 \n%\n(9.1)\n%\nNet sales to customers by geographic region were as follows (amounts in millions, except percentages):\n \nYear Ended December 31,\nPercent\nChange 2024 vs 2023\nPercent\nChange 2023 vs 2022\n \n2024\n2023\n2022\nNorth America\n$\n2,547 \n$\n2,405 \n$\n2,919 \n5.9 \n%\n(17.6)\n%\nEMEA\n1,617 \n1,414 \n1,920 \n14.4 \n%\n(26.4)\n%\nAsia-Pacific\n490 \n481 \n609 \n1.9 \n%\n(21.0)\n%\nLatin America\n327 \n284 \n333 \n15.1 \n%\n(14.7)\n%\nTotal Net sales\n$\n4,981 \n$\n4,584 \n$\n5,781 \n8.7 \n%\n(20.7)\n%\nOperating expenses are summarized below (amounts in millions, except percentages):\n \nYear Ended December 31,\nAs a Percentage of Net sales\n \n2024\n2023\n2022\n2024\n2023\n2022\nSelling and marketing\n$\n600 \n$\n581 \n$\n607 \n12.0 \n%\n12.7 \n%\n10.5 \n%\nResearch and development\n563 \n519 \n570 \n11.3 \n%\n11.3 \n%\n9.9 \n%\nGeneral and administrative\n381 \n334 \n375 \n7.6 \n%\n7.3 \n%\n6.5 \n%\nSettlement and related costs\n— \n— \n372 \n— \n%\n— \n%\n6.4 \n%\nAmortization of intangible assets\n104 \n104 \n136 \nNM\nNM\nNM\nAcquisition and integration costs\n6 \n6 \n21 \nNM\nNM\nNM\nExit and restructuring costs\n17 \n98 \n14 \nNM\nNM\nNM\nTotal Operating expenses\n$\n1,671 \n$\n1,642 \n$\n2,095 \n33.5 \n%\n35.8 \n%\n36.2 \n%\nConsolidated Organic Net sales growth (decline):\nYear Ended December 31,\n2024\n2023\nReported GAAP Consolidated Net sales growth (decline)\n8.7 \n%\n(20.7)\n%\nAdjustments:\nImpact of foreign currency translations \n(1)\n(0.6)\n%\n1.4 \n%\nImpact of acquisitions \n(2)\n— \n%\n(0.5)\n%\nConsolidated Organic Net sales growth (decline) \n(3)\n8.1 \n%\n(19.8)\n%\n(1)\nOperating results reported in U.S. Dollars are affected by foreign currency exchange rate fluctuations. Foreign currency translation impact represents the difference in results that are attributable to fluctuations in the currency exchange rates used to convert the results for businesses where the functional currency is not the U.S. Dollar. This impact is calculated by translating the current period results at the currency exchange rates used in the comparable prior year period as well as removing realized cash flow hedge gains and losses from both the current and prior year periods.\n31\nTable of Contents\n(2)\nFor purposes of computing Organic Net sales growth (decline), amounts directly attributable to business acquisitions are excluded for twelve months following their respective acquisitions.\n(3)\nConsolidated Organic Net sales growth (decline) is a non-GAAP financial measure.  See the \nNon-GAAP Measures\n section at the end of this item.\n2024 compared to 2023\nTotal Net sales increased $397 million or 8.7% compared to the prior year reflecting growth in our EVM segment that was partially offset by a slight decline in our AIT segment as the current year recovery in demand trends benefited EVM earlier in the year than AIT. Excluding the effects of foreign currency changes and acquisitions, Consolidated Organic Net sales increased by 8.1%.\nGross margin increased to 48.4% for the current year compared to 46.3% in the prior year. The increase was primarily due to volume leverage, higher service and software margins, lower freight rates, and lower inventory-related charges. Gross margin was higher in both segments, particularly EVM.\nOperating expenses for the years ended December 31, 2024 and 2023 were $1,671 million and $1,642 million, or 33.5% and 35.8% of Net sales, respectively. Current year Operating expenses were higher than the prior year primarily due to higher incentive compensation, partially offset by lower Exit and restructuring costs and incremental savings largely attributed to our Exit and restructuring actions.\nOperating income was $742 million for the current year compared to $481 million for the prior year. The increase was due to higher Gross profit partially offset by higher Operating expenses.\nNet income increased 78.4% compared to the prior year primarily due to higher Operating income, as described above, as well as lower Interest (expense) income, net which included higher interest rate swap gains and interest income in the current year.\nThe Company’s effective tax rates for the years ended December 31, 2024 and December 31, 2023 were 16.9% and 11.4%, respectively. The increase in the effective tax rate compared to the prior year was primarily due to lower rate benefits from tax credits and discrete items as well as higher state income taxes.\nDiluted earnings per share increased to $10.18 as compared to $5.72 in the prior year primarily due to higher Net income.\nResults of Operations by Segment\nThe following commentary should be read in conjunction with the financial results of each reportable business segment as detailed in Note 20,\n Segment Information & Geographic Data\n in the Notes to Consolidated Financial Statements. To the extent applicable, segment operating income excludes Amortization of intangible assets, Acquisition and integration costs, Exit and restructuring costs, as well as certain other non-recurring costs (such as the Settlement costs in 2022, impairment of goodwill and other intangibles, and business acquisition purchase accounting adjustments).\nAsset Intelligence & Tracking Segment (“AIT”)\n(amounts in millions, except percentages)\n \nYear Ended December 31,\nPercent\nChange 2024 vs 2023\nPercent\nChange 2023 vs 2022\n \n2024\n2023\n2022\nNet sales:\nTangible products\n$\n1,532 \n$\n1,537 \n$\n1,728 \n(0.3)\n%\n(11.1)\n%\nServices and software\n115 \n114 \n109 \n0.9 \n%\n4.6 \nTotal Net sales\n1,647 \n1,651 \n1,837 \n(0.2)\n%\n(10.1)\n%\nGross profit\n793 \n787 \n795 \n0.8 \n%\n(1.0)\n%\nGross margin\n48.1 \n%\n47.7 \n%\n43.3 \n%\n40 bps\n440 bps\nOperating expenses\n458 \n441 \n434 \n3.9 \n%\n1.6 \n%\nOperating income\n$\n335 \n$\n346 \n$\n361 \n(3.2)\n%\n(4.2)\n%\n32\nTable of Contents\nAIT Organic Net sales (decline):\nYear Ended December 31,\n2024\n2023\nAIT Reported GAAP Net sales (decline)\n(0.2)\n%\n(10.1)\n%\nAdjustments:\nImpact of foreign currency translations \n(1)\n(0.7)\n%\n1.3 \n%\nAIT Organic Net sales (decline) \n(2)\n(0.9)\n%\n(8.8)\n%\n(1)\nOperating results reported in U.S. Dollars are affected by foreign currency exchange rate fluctuations. Foreign currency translation impact represents the difference in results that are attributable to fluctuations in the currency exchange rates used to convert the results for businesses where the functional currency is not the U.S. Dollar. This impact is calculated by translating the current period results at the currency exchange rates used in the comparable prior year period as well as removing realized cash flow hedge gains and losses from both the current and prior year periods.\n(2)  AIT Organic Net sales (decline) is a non-GAAP financial measure.  See the Non-GAAP Measures section at the end of this item.\n2024 compared to 2023 \nTotal Net sales for AIT decreased $4 million or 0.2% compared to the prior year primarily due to lower sales of printing products and supplies, partially offset by favorable foreign currency changes and higher sales of RFID products. Excluding the impact of foreign currency changes, AIT Organic Net sales decreased by 0.9%.\nGross margin increased to 48.1% in the current year compared to 47.7% for the prior year primarily due to favorable foreign currency changes, partially offset by higher inventory-related charges.\nOperating income decreased 3.2% in the current year compared to the prior year due to higher Operating expenses partially offset by higher Gross profit.\nEnterprise Visibility & Mobility Segment (“EVM”)\n(amounts in millions, except percentages)\n \nYear Ended December 31,\nPercent\nChange 2024 vs 2023\nPercent\nChange 2023 vs 2022\n \n2024\n2023\n2022\nNet sales:\nTangible products\n$\n2,484 \n$\n2,128 \n$\n3,187 \n16.7 \n%\n(33.2)\n%\nServices and software\n850 \n805 \n757 \n5.6 \n%\n6.3 \n%\nTotal Net sales\n3,334 \n2,933 \n3,944 \n13.7 \n%\n(25.6)\n%\nGross profit\n1,620 \n1,336 \n1,829 \n21.3 \n%\n(27.0)\n%\nGross margin\n48.6 \n%\n45.6 \n%\n46.4 \n%\n300 bps\n(80) bps\nOperating expenses\n1,086 \n993 \n1,118 \n9.4 \n%\n(11.2)\n%\nOperating income\n$\n534 \n$\n343 \n$\n711 \n55.7 \n%\n(51.8)\n%\nEVM Organic Net sales growth (decline):\nYear Ended December 31,\n2024\n2023\nEVM Reported GAAP Net sales growth (decline)\n13.7 \n%\n(25.6)\n%\nAdjustments:\nImpact of foreign currency translations \n(1)\n(0.5)\n%\n1.5 \n%\nImpact of acquisitions \n(2)\n— \n%\n(0.8)\n%\nEVM Organic Net sales growth (decline)\n (3)\n13.2 \n%\n(24.9)\n%\n(1)\nOperating results reported in U.S. Dollars are affected by foreign currency exchange rate fluctuations. Foreign currency translation impact represents the difference in results that are attributable to fluctuations in the currency exchange rates used to convert the results for businesses where the functional currency is not the U.S. Dollar. This impact is calculated by \n33\nTable of Contents\ntranslating the current period results at the currency exchange rates used in the comparable prior year period as well as removing realized cash flow hedge gains and losses from both the current and prior year periods.\n(2)\nFor purposes of computing EVM Organic Net sales growth (decline), amounts directly attributable to business acquisitions are excluded for twelve months following their respective acquisitions.\n(3)\nEVM Organic Net sales growth (decline) is a non-GAAP financial measure. See the \nNon-GAAP Measures\n section at the end of this item.\n2024 compared to 2023 \nTotal Net sales for EVM increased $401 million or 13.7% compared to the prior year primarily due to higher sales of mobile computing products, and services and software, partially offset by lower sales of data capture products. Excluding the impacts of foreign currency changes and acquisitions, EVM Organic Net sales increased by 13.2%.\nGross margin increased to 48.6% in the current year compared to 45.6% for the prior year primarily due to volume leverage, favorable business mix, higher service and software margins, lower inventory-related charges, and lower freight rates.\nOperating income for the current year increased 55.7% compared to the prior year due to higher Gross profit partially offset by higher Operating expenses.\nLiquidity and Capital Resources\nThe primary factors that influence our liquidity include the amount and timing of cash collections from our customers, cash payments to our suppliers, capital expenditures, acquisitions, and share repurchases. Management believes that our existing capital resources, inclusive of available borrowing capacity on debt and other financing facilities and funds generated from operations, are sufficient to meet anticipated capital requirements and service our indebtedness. The following table summarizes our cash flow activities for the years indicated (in millions):\n \nYear Ended December 31,\n$ Change 2024 vs 2023\n$ Change 2023 vs 2022\n \n2024\n2023\n2022\nCash flow provided by (used in):\nOperating activities\n$\n1,013 \n$\n(4)\n$\n488 \n$\n1,017 \n$\n(492)\nInvesting activities\n(57)\n(92)\n(968)\n35 \n876 \nFinancing activities\n(190)\n117 \n253 \n(307)\n(136)\nEffect of exchange rates on cash balances\n(3)\n— \n— \n(3)\n— \nNet increase (decrease) in cash and cash equivalents, including restricted cash\n$\n763 \n$\n21 \n$\n(227)\n$\n742 \n$\n248 \n2024 vs. 2023\n \nThe change in our cash and cash equivalents balance during the current year is reflective of the following: \n•\n$1,017 million change in operating activities primarily due to the timing of cash payments and the reduction of overall inventory levels, lower legal settlement, income tax, and employee incentive compensation payments, higher cash receipts on interest rate swaps attributed to the termination of those agreements, as well as overall improved operating profits.\n•\n$307 million change in financing activities primarily due to current year net debt repayments as a portion of the recently issued Senior Notes was utilized to reduce total debt, compared to net borrowings in the prior year.\n34\nTable of Contents\nCompany Debt\nThe following table shows the carrying value of the Company’s debt (in millions):\nDecember 31,\n2024\n2023\nTerm Loan A\n$\n1,575 \n$\n1,684 \nSenior Notes\n500 \n— \nRevolving Credit Facility\n— \n413 \nReceivables Financing Facilities\n108 \n129 \nTotal debt\n$\n2,183 \n$\n2,226 \nLess: Debt issuance costs\n(9)\n(2)\nLess: Unamortized discounts\n(3)\n(4)\nLess: Current portion of debt\n(79)\n(173)\nTotal long-term debt\n$\n2,092 \n$\n2,047 \nTerm Loan A\nThe principal on Term Loan A is due in quarterly installments, with the next quarterly installment due in the second quarter of 2026 and the majority due upon maturity in 2027. The Company has and may make prepayments in whole or in part, without premium or penalty; and would be required to prepay certain outstanding amounts in the event of certain circumstances or transactions. As of December 31, 2024, the Term Loan A interest rate was 5.71%.  Interest payments are made monthly and are subject to variable rates plus an applicable margin.\nSenior Notes\nIn the second quarter of 2024, the Company completed a private offering of $500 million senior unsecured notes (the “Senior Notes”) with a 6.5% fixed interest rate. The net proceeds of the issuance, after deducting debt issuance costs which were deferred, were approximately $492 million. The Senior Notes mature on June 1, 2032, and interest is payable semi-annually in arrears in June and December of each year, commencing on December 1, 2024. The Company may make prepayments in whole or in part, without premium or penalty, and would be required to prepay certain outstanding amounts in the event of certain circumstances or transactions. \nThe Senior Notes are fully and unconditionally guaranteed on a senior unsecured basis by certain of Zebra’s existing and future subsidiaries. The Senior Notes contain covenants that, among other things, limit the ability of Zebra to: (i) grant or incur liens; (ii) have its subsidiaries guarantee debt without becoming guarantors; and (iii) merge or consolidate with another company or sell all or substantially all of its assets.\nRevolving Credit Facility\nThe Company has a Revolving Credit Facility that is available for working capital and other general business purposes, including letters of credit. As of December 31, 2024, the Company had letters of credit totaling $10 million, which reduced funds available for borrowings under the Revolving Credit Facility from $1,500 million to $1,490 million. As of December 31, 2024, the Revolving Credit Facility had an average interest rate of 5.68%. Upon borrowing, interest payments are made monthly and are subject to variable rates plus an applicable margin. The Revolving Credit Facility matures on May 25, 2027.\nReceivables Financing Facility\nAs of December 31, 2024, the Company has a Receivables Financing Facility with a borrowing limit of up to $180 million. As collateral, the Company pledges perfected first-priority security interests in its U.S. domestically originated accounts receivable. The Company has accounted for transactions under this facility as secured borrowings. During the first quarter of 2024, the Company amended this facility to extend the maturity to March 19, 2027 but otherwise did not substantially change the terms of the facility.\nAs of December 31, 2024, the Company’s Consolidated Balance Sheets included $638 million of gross receivables that were pledged under the facility. As of December 31, 2024, $108 million had been borrowed, of which $79 million was classified as current. Borrowings under the facility bear interest at a variable rate plus an applicable margin. As of December 31, 2024, the facility had an average interest rate of 5.38%. Interest is paid monthly on these borrowings.\nSee Note 12, \nLong-Term Debt\n in the Notes to Consolidated Financial Statements for further details related to the Company’s debt instruments.\n35\nTable of Contents\nReceivables Factoring\nThe Company has a Receivables Factoring arrangement, pursuant to which certain receivables originated from the EMEA and Asia-Pacific regions up to a maximum of €75 million, as amended, are sold to a bank without recourse in exchange for cash. Transactions under the Receivables Factoring arrangement are accounted for as sales and the related receivables are removed from the Company’s balance sheet. The Company does not maintain any beneficial interest in the receivables sold. The bank’s purchase of eligible receivables is subject to a maximum amount of uncollected receivables. The Company services the receivables on behalf of the bank, but otherwise maintains no significant continuing involvement with respect to the receivables. Sale proceeds that are representative of the fair value of factored receivables, less a factoring fee, are reflected in Cash flows from operating activities on the Consolidated Statements of Cash Flows, while sale proceeds in excess of the fair value of factored receivables are reflected in Cash flows from financing activities on the Consolidated Statements of Cash Flows.\nAs of December 31, 2024 and 2023, there were a total of $28 million and $56 million, respectively, of uncollected receivables that had been sold and removed from the Company’s Consolidated Balance Sheets.\nAs servicer of sold receivables, the Company had $51 million and $112 million of obligations that were not yet remitted to the bank as of December 31, 2024 and 2023, respectively. These obligations are included within Accrued liabilities on the Consolidated Balance Sheets, with changes in such obligations reflected within Cash flows from financing activities on the Consolidated Statements of Cash Flows.\nSee Note 19, \nAccounts Receivable Factoring\n in the Notes to Consolidated Financial Statements for further details.\nShare Repurchases\nOn May 17, 2022, the Company announced that its Board of Directors authorized a share repurchase program for up to $1 billion of its outstanding shares of common stock. The authorized share repurchase program does not have a stated expiration date. The level of the Company’s repurchases depends on a number of factors, including its financial condition, capital requirements, cash flows, results of operations, future business prospects and other factors its management may deem relevant. The timing, volume, and nature of repurchases are subject to market conditions, applicable securities laws and other factors and may be amended, suspended or discontinued at any time. Repurchases may be affected from time to time through open market purchases, including pursuant to a pre-set trading plan meeting the requirements of Rule 10b5-1(c) of the Securities Exchange Act of 1934. During the year ended December 31, 2024, the Company repurchased 130,560 shares of common stock for approximately $47 million. As of December 31, 2024, the Company has cumulatively repurchased 539,574 shares of common stock for approximately $154 million, resulting in a remaining amount of share repurchases authorized under the plans of $846 million. Subsequent to the year ended December 31, 2024, the Company has repurchased 128,466 shares of common stock for approximately $50 million through February 6, 2025.\nFuture Cash Requirements\nWe believe that our Cash and cash equivalents, which totaled $901 million as of December 31, 2024, along with anticipated cash generation from operations and available borrowing capacity on debt and other financing facilities, will be sufficient to fund the Company’s cash requirements during the next 12 months and thereafter based on our current business plans.  \nIncluded in the Company’s Cash and cash equivalents are amounts held by foreign subsidiaries, which was $52 million and $33 million as of December 31, 2024 and 2023, respectively. We do not expect that Cash and cash equivalents held by foreign subsidiaries will need to be repatriated to fund the Company’s U.S. operations based on current cash requirements.   \nOur cash requirements during the next 12 months and thereafter include payments to satisfy the following obligations:\n•\nPurchase obligations — The Company has a limited number of multi-year purchase commitments, primarily related to semiconductors and cloud services, which contain minimum purchase requirements and are non-cancellable. As of December 31, 2024, these multi-year commitments were approximately $138 million. This amount excludes routine purchase orders for goods and services, as well as amounts already reflected within Current liabilities on the Consolidated Balance Sheet. See Note 14, \nAccrued Liabilities, Commitments and Contingencies \nin the Notes to Consolidated Financial Statements for additional details.\n•\nDebt obligations — We expect to make total payments of approximately $210 million associated with the Company’s debt facilities in 2025. This expected use of cash is based on the Company’s current borrowings and applicable interest rates and margins as of December 31, 2024, and includes principal and interest payments. In the ordinary course of business, the Company may decide to borrow additional amounts or repay principal earlier than contractually owed, which would affect future cash payments. See Note 12, \nLong-Term Debt \nin the Notes to Consolidated Financial Statements for further details related to the Company’s debt facilities.  \n36\nTable of Contents\n•\nLeases obligations — We lease various manufacturing and repair facilities, distribution centers, research facilities, sales and administrative offices, equipment, and vehicles. As of December 31, 2024, the Company’s fixed lease commitments totaled $233 million, of which $46 million is payable in 2025. See Note 13, \nLeases \nin the Notes to Consolidated Financial Statements for further details related to the Company’s lease arrangements.\nIn addition to the expected cash requirements described above, the Company may use cash to fund strategic acquisitions, investments, or repurchase common stock under its share repurchase program. We also expect to spend approximately $60 million to $70 million on capital expenditures in 2025.\nCritical Accounting Estimates\nManagement prepared the consolidated financial statements of the Company under accounting principles generally accepted in the U.S. The application of these principles requires the use of estimates which affect the amounts reported in our consolidated financial statements. While we believe that our estimates are reasonable based upon available information, actual results could differ substantially from those estimates. Note 2, \nSignificant Accounting Policies\n in the Notes to Consolidated Financial Statements provides additional discussion of these items along with other significant accounting policies of the Company. The accounting estimates described below have been identified by Management as those that are most significant to our financial statements.\nIncome Taxes \nWe estimate a provision or benefit for income taxes and amounts to be settled or recovered in several tax jurisdictions globally.  Our estimates are complex and involve significant judgments and interpretations of regulations. Resolution of income tax treatments in individual jurisdictions may not be known for several years after completion of a given year. We are also required to evaluate the realizability of our deferred tax assets on an ongoing basis, which requires estimation of our ability to generate future taxable income. In particular, our income tax provision or benefit is dependent on our ability to forecast future taxable income in the U.S., U.K., Singapore, and other jurisdictions. Significant judgments included in our forecasts include projecting future sales volumes and pricing, costs to manufacture and procure products and to deliver offerings, among other factors. There were no significant changes in estimates to our income tax provision during the current year.\nAcquisitions\nWe account for acquired businesses using the acquisition method of accounting. This method requires that the purchase price be allocated to the identifiable assets acquired and liabilities assumed at their estimated fair values. The excess of the purchase price over the identifiable assets acquired and liabilities assumed is recorded as goodwill. The estimates used to determine the fair values of long-lived intangible assets can be complex and require judgment. We generally value intangible assets using income-based valuation methodologies, such as the excess earnings method, which require critical estimates that include, but are not limited to, future expected cash flows from revenues and the determination of discount rates.\nGoodwill Impairment\nOur goodwill impairment testing includes a comparison of the estimated fair value of each of our reporting units to its carrying value. Fair value determinations require judgment and can be sensitive to changes in underlying assumptions, estimates, as well as market factors. We estimate the fair value of reporting units using both income and market-based valuation approaches. Estimating the fair value of reporting units requires that we make assumptions and estimates including projections of revenue and income growth rates as well as cash flows; capital investments; competitive and customer trends; appropriate peer group selection; market-based discount rates and other market factors. Our annual impairment testing, most recently completed in the fourth quarter of 2024, continues to indicate that the fair values of each of our reporting units significantly exceed their respective carrying values. \nRevenue Recognition\nWe recognize revenues when we transfer control of promised offerings to our customers in an amount that reflects the consideration we expect to receive. The consideration that we expect to receive is estimated by reflecting reductions to our transaction price for product returns, rebates, and other incentives. These estimates are developed using the expected value that the Company anticipates receiving and are based on recent trends observed in similar transactions. Additionally, some of our contracts with customers contain multiple performance obligations, including various hardware, software, and/or services. For such contracts that contain multiple performance obligations, we allocate the estimated total transaction price to each performance obligation based on relative standalone selling prices (“SSP”). The determination of SSP is established at a regional level. SSP is based on observable prices in recent standalone transactions for the same or similar offerings, to the extent available, which is often applicable to tangible products and software licenses. Alternatively, in the absence of recent observable prices, the Company generally applies the expected cost-plus margin approach to professional services, repair and maintenance services, and solution offerings. There were no changes to our estimation processes for consideration received or SSP that materially affected revenues during the year. \n37\nTable of Contents\nNew Accounting Pronouncements\nSee Note 2, \nSignificant Accounting Policies \nin the Notes to Consolidated Financial Statements regarding recent accounting pronouncements.\nNon-GAAP Measures\nThe Company has provided reconciliations of the supplemental non-GAAP financial measures, as defined under the rules of the Securities and Exchange Commission, presented herein to the most directly comparable financial measures calculated and presented in accordance with GAAP. \nThese supplemental non-GAAP financial measures – Consolidated Organic Net sales growth (decline), AIT Organic Net sales (decline), and EVM Organic Net sales growth (decline) – are presented because our management evaluates our financial results both including and excluding the effects of business acquisitions and foreign currency translation, as applicable. Management believes that the supplemental non-GAAP financial measures presented provide additional perspective and insights when analyzing the core operating performance of our business from period to period and trends in our historical operating results. These supplemental non-GAAP financial measures should not be considered superior to, as a substitute for, or as an alternative to, and should be considered in conjunction with the GAAP financial measures presented.\n38\nTable of Contents",
  "item2": null
}