{
  "source_file": "zts-20241231.htm",
  "form_type": "10-K",
  "item1": "Item 1. Business.\nOverview \nZoetis Inc. is a global leader in the animal health industry, focused on the discovery, development, manufacture and commercialization of medicines, vaccines, diagnostic products and services, biodevices, genetic tests and precision animal health. We have a diversified business, commercializing products across eight core species: dogs, cats and horses (collectively, companion animals) and cattle, swine, poultry, fish and sheep (collectively, livestock); and within seven major product categories: parasiticides, vaccines, dermatology, anti-infectives, pain and sedation, other pharmaceutical and animal health diagnostics. For over 70 years, we have been innovating ways to predict, prevent, detect, and treat animal illness, and continue to stand by those raising and caring for animals worldwide - from veterinarians and pet owners to livestock producers.\nWe were incorporated in Delaware in July 2012 and prior to that the company was a business unit of Pfizer Inc. (Pfizer). The address of our principal executive offices is 10 Sylvan Way, Parsippany, New Jersey 07054. Unless the context requires otherwise, references to “Zoetis,” “the company,” “we,” “us” or “our” in this Annual Report on Form 10-K for the fiscal year ended December 31, 2024 (2024 Annual Report) refer to Zoetis Inc., a Delaware corporation, and its subsidiaries. In addition, unless the context requires otherwise, references to “Pfizer” in this 2024 Annual Report refer to Pfizer Inc., a Delaware corporation, and its subsidiaries. \nOperating Segments\n \nThe animal health medicines, vaccines and diagnostics market is characterized by meaningful differences in customer needs across different regions. This is due to a variety of factors, including: \n•\neconomic differences, such as standards of living in developed markets as compared to emerging markets; \n•\ncultural differences, such as dietary preferences for different animal proteins, pet ownership preferences and pet care standards; \n•\nepidemiological differences, such as the prevalence of certain bacterial and viral strains and disease dynamics; \n•\ntreatment differences, such as utilization of different types of medicines and vaccines, as well as the pace of adoption of new technologies; \n•\nenvironmental differences, such as seasonality, climate and the availability of arable land and fresh water; and \n•\nregulatory differences, such as standards for product approval and manufacturing. \nAs a result of these differences, among other things, we organize and operate our business in two segments: \n•\nUnited States (U.S.)\n with revenue of $5,074 million, or 55% of total revenue for the year ended December 31, 2024; and \n•\nInternational\n with revenue of $4,102 million, or 44% of total revenue for the year ended December 31, 2024. \nWithin each of these operating segments, we offer a diversified product portfolio for both companion animal and livestock customers so that we can capitalize on local trends and customer needs. \nIn addition, our Client Supply Services (CSS) organization which provides contract manufacturing services to third parties, and our human health products, together represented approximately 1% of our total revenue for the year ended December 31, 2024.\n1 |\nTable of Contents\nOur 2024 revenue for the U.S. and key international markets, together with the percentage of revenue attributable to companion animal and livestock products in those markets, is as follows:\n(MILLIONS OF DOLLARS)\nRevenue\nCompanion Animal\nLivestock\nUnited States\n$5,074\n80%\n20%\nTotal International\n$4,102\n54%\n46%\nAustralia\n$319\n53%\n47%\nBrazil\n$414\n41%\n59%\nCanada\n$277\n62%\n38%\nChile\n$123\n23%\n77%\nChina\n$270\n69%\n31%\nFrance\n$156\n66%\n34%\nGermany\n$225\n77%\n23%\nItaly\n$129\n78%\n22%\nJapan\n$147\n70%\n30%\nMexico\n$169\n36%\n64%\nSpain\n$130\n60%\n40%\nUnited Kingdom\n$314\n78%\n22%\nOther Developed\n$564\n49%\n51%\nOther Emerging\n$865\n42%\n58%\nFor additional information regarding our performance in each of our operating segments and the impact of foreign exchange rates, see \nItem 7.\n \nManagement's Discussion and Analysis of Financial Condition and Results of Operations\n and \nItem 8. \nFinancial Statements and Supplementary Data\n: Notes to Consolidated Financial Statements—Note 4. Revenue \nand \nNote 19. Segment Information. \nOur 2024 reported revenue for each segment, by species, is as follows:\n2 |\nTable of Contents\nProducts \nOver the course of our history, we have focused on developing a diverse portfolio of animal health products that deliver solutions across the continuum of care. We refer to all products with the same primary active pharmaceutical or biological ingredient(s) as a single product line, even if such products include different brands, dosages, formulations or indicated species. For vaccines, we typically consider a group of vaccines as a single product line if they share the same brand. We have approximately 300 comprehensive product lines, including products for both companion animals and livestock within each of our major product categories.\nOur companion animal products help extend and improve the quality of life for pets; increase convenience and compliance for pet owners; and help veterinarians improve the quality of their care and the efficiency of their businesses. Growth in the companion animal medicines, vaccines and diagnostics sectors is driven by increases in spending on pet care, economic development and related increases in disposable income. Companion animals are also living longer, deepening the human-animal bond, receiving increased medical treatment and benefiting from advances in animal health medicines, vaccines and diagnostics. Companion animal products represented approximately 68% of our revenue for the year ended December 31, 2024.\nOur livestock products focus on predicting, preventing, detecting and treating diseases, with the understanding that veterinarians and livestock producers must have the tools at their disposal to treat disease expeditiously, which in turn enables the sustainable production of safe, high-quality animal protein. Human population growth and increased standards of living continue to drive demand for increased production of quality animal protein. Population growth leads to greater consumption of natural resources, driving a need for innovative solutions to increase sustainability and productivity. As global food security takes on heightened importance, producers are tasked with facilitating a high quality, safe and reliable food supply. Livestock products represented approximately 31% of our revenue for the year ended December 31, 2024.\nIn addition, our CSS organization, which provides contract manufacturing services to third parties, and our human health products, together represented approximately 1% of our total revenue for the year ended December 31, 2024.\nOn October 31, 2024, we completed the divestiture of our medicated feed additive product portfolio, certain water soluble products and related assets, and, as a result, our major product categories no longer include the category of medicated feed additives. See Notes to Consolidated Financial Statements— \nNote 5. Acquisitions and Divestitures\n.\nOur major product categories are: \n•\nparasiticides:\n products that prevent or eliminate external and internal parasites such as fleas, ticks, lice and worms;\n•\nvaccines:\n biological preparations that help prevent diseases of the respiratory, gastrointestinal and reproductive tracts or induce a specific immune response;\n•\ndermatology:\n products that relieve itch associated with allergic conditions and atopic dermatitis;\n•\nanti-infectives: \nproducts that prevent, kill or slow the growth of bacteria, fungi or protozoa;\n•\npain and sedation:\n products that alleviate pain, primarily associated with osteoarthritis and postoperative pain;\n•\nother pharmaceutical:\n antiemetic, reproductive and oncology products; and\n•\nanimal health diagnostics:\n testing and analysis of blood, urine and other animal samples and related products and services, including point-of-care diagnostic products, instruments and reagents, rapid immunoassay tests, reference laboratory kits and services and blood glucose monitors. \nOur remaining revenue is derived from other non-pharmaceutical product categories, such as nutritionals, as well as products and services in biodevices, genetic tests and precision animal health.\nAs part of our growth strategy, we focus on the discovery and development of new chemical, biopharmaceutical and biological entities, as well as product lifecycle innovation, primarily through our research and development (R&D) group. Historically, a substantial portion of our products and revenue has been the result of product lifecycle innovation where we actively work to broaden the value of existing products by developing new claims, extending to additional species, developing more convenient formulations, modifications and combinations, and by expanding usage into more countries. For example, the first product in our ceftiofur line was an anti-infective approved for treating bovine respiratory disease (BRD) in cattle that was administered via intramuscular injection. Through follow-on studies and reformulations, we have expanded the product line into additional cattle claims and administration routes, as well as other species and regions. The ceftiofur product line currently includes the brands Excede\n®\n, Excenel\n®\n, Naxcel\n® \nand Spectramast\n®\n.\nThe following are examples of our first-in-class and/or best-in-class products that we have launched and products that we believe may represent platforms for future product lifecycle innovation (listed alphabetically): \n•\nApoquel\n®\n, the first Janus kinase inhibitor for use in veterinary medicine, was approved in 2013 for the control of pruritus associated with allergic dermatitis and the control of atopic dermatitis in dogs at least 12 months of age. Since January 2014, we have launched Apoquel in many key markets globally. In 2021, a chewable version of Apoquel was approved in the European Union (EU) and the United Kingdom (U.K.), and has since been approved in other key markets globally, including the U.S. in 2023 and China in 2024;\n•\nCore EQ Innovator\n®\n, the first and only vaccine for horses to contain all five core equine disease antigens - West Nile, Eastern and Western Equine encephalomyelitis, tetanus and rabies - in one combination, was approved in the U.S. in 2018 and in Canada in 2019;\n•\nCytopoint\n®\n, the first canine monoclonal antibody (mAb) to help reduce the clinical signs of atopic dermatitis (such as itching) in dogs of any age, was licensed in the U.S. in 2016 (and was later granted an expanded indication to treat allergic dermatitis in 2018). The product has since been approved in many key markets globally. An injection given once every four to eight weeks, Cytopoint neutralizes interleukin-31, a protein that has been demonstrated to trigger itching in dogs;\n•\nFostera\n®\n PCV MH was introduced in November 2013 in the U.S. and has since been approved in many key markets globally. It was developed to help protect pigs from porcine circovirus-associated disease (PCVAD) and enzootic pneumonia caused by M. hyopneumoniae (M. hyo). Fostera Gold PCV MH, the only vaccine to contain two PCV2 genotypes and long-lasting M. hyo coverage, was approved in the \n3 |\nTable of Contents\nU.S. and Canada in 2018 and has since been approved in many key markets globally. The Fostera/Suvaxyn\n®\n product line also includes Fostera/Suvaxyn\n \nPRRS, which was approved in the U.S. in 2015 and has since been approved in many key markets globally. This vaccine offers protection against both the respiratory and reproductive forms of disease caused by porcine reproductive and respiratory syndrome (PRRS) virus;\n•\nLibrela\n®\n(bedinvetmab), the first and only injectable mAb therapy for monthly alleviation of osteoarthritis (OA) pain in dogs, was approved in the EU in 2020 and has since been approved in other key markets globally, including the U.S. in 2023 and China in 2024;\n•\nPoulvac\n®\n Procerta\n®\n HVT-ND, our first vector vaccine that helps protect against Marek’s disease and Newcastle disease, highly contagious viral infections affecting poultry, was approved in the U.S. in 2019. In 2020, we expanded our line of recombinant vector vaccines with the launch of Poulvac Procerta HVT-IBD, which helps protect against Marek's disease and provides early protection against the contemporary infectious bursal disease (IBD) viruses. We have since expanded Poulvac Procerta HVT-ND into other key markets globally. In 2022, we further expanded our line of recombinant vector vaccines with the launch of Poulvac Procerta HVT-IBD-ND in the U.S., which is an advanced trivalent vector vaccine that delivers powerful early protection against Marek's disease, infectious bursal disease and Newcastle disease in one dose;\n•\nProHeart\n® \n6 (moxidectin), a twice a year injection to prevent heartworm disease in dogs 6 months of age and older, was approved in the U.S. in 2021; In 2019, ProHeart\n® \n12 (moxidectin), a once-yearly injection to prevent heartworm disease in dogs 12 months of age and older;\n•\nProtivity\n®\n, a modified-live bacterial vaccine that is effective in protecting healthy beef and dairy cattle against respiratory disease caused by Mycoplasma bovis (M. bovis), was approved in the U.S. and Canada in 2022, the EU and Mexico in 2023 and the U.K. in 2024;\n•\nRevolution\n®\n Plus/Stronghold\n®\n Plus (selamectin/sarolaner), a topical combination product that treats ticks, fleas, ear mites, lice and gastrointestinal worms and prevents heartworm disease in cats, received EU approval in 2017 and has since been approved in other key markets globally, including the U.S., and received approval in 2024 in key markets globally for new claims related to the treatment and control of lone star tick infestations, flea tapeworm and efficacy against notoedres mange, making it the only parasiticide for cats on the market to defend against four types of ticks;\n•\nSimparica\n®\n (sarolaner) Chewables, a monthly chewable tablet for dogs to control fleas and ticks, was approved in the EU in 2015, the U.S. in 2016 and has since been approved in other key markets globally. Simparica Trio\n®\n, a triple combination parasiticide for dogs, was approved in the EU and Canada in 2019, the U.S. in 2020 and has since been approved in other key markets globally. In 2024, Simparica Chewables and Simparica Trio received U.S. approval for new claims related to the treatment and control of lone star tick infestations. This product is a key internal lifecycle innovation that combines flea and tick treatment (sarolaner) with the prevention of heartworm disease and treatment of gastrointestinal parasites;\n•\nSolensia\n®\n (frunevetmab), the first injectable mAb therapy for monthly alleviation of OA pain in cats, was approved in Switzerland in 2020 and has since been approved in other key markets globally, including the EU and the U.S.; and\n•\nVanguard\n®\n/Versican\n®\n is a market leading vaccine line for dogs intended to help prevent a range of diseases. Since 2016, Zoetis has added new and innovative enhancements to this product line in the U.S. and other key markets with Vanguard crLyme, Vanguard Rapid Resp Intranasal, Vanguard B Oral, Vanguard CIV H3N2/H3N8 and Versican Plus Bb Oral.\nWe pursue the development of new vaccines for emerging infectious diseases, with an operating philosophy of “first to know and fast to market.” Examples of the successful execution of this strategy include the first SARS-CoV-2 (COVID-19) vaccine to help protect the health and well-being of more than 300 mammalian species living in zoos, aquariums, conservatories and other animal organizations around the world; the first equine vaccine for West Nile virus in the U.S. and EU; the first swine vaccine for pandemic H1N1 influenza virus in the U.S.; the first conditionally licensed vaccine against the pandemic H5N1 bird flu in the U.S. and EU, which we provided to the U.S. Department of Agriculture when it recommended our vaccine be used by the U.S. Fish and Wildlife Service to help protect California condors in 2023; a conditionally licensed vaccine to help fight porcine epidemic diarrhea virus (PEDv) in the U.S.; and the first conditionally licensed vaccine to help prevent the H3N2 type of canine influenza that emerged in the U.S. Because approximately 60% of infectious diseases in humans originate in animals (according to CDC) we take a \"One Health\" approach; vaccinating animals can help contain emerging infectious diseases and limit spread to other species including humans. Since 2020, the company has partnered with Colorado State University to increase our understanding of the potential use of immunomodulators in livestock that could reduce the need for antibiotics, as well as advance our understanding of the biology of key diseases affecting companion animals which could lead to new therapies that can treat chronic health conditions in pets. In 2024, the company started a collaboration with Blacksmith Medicines to discover and develop novel antibiotics for animal health and provide new options for our customers to treat life-threatening infections in livestock.\nAdditionally, the Pharmaq business of Zoetis is the global leader in vaccines and innovation for aquatic health products. By preventing and treating diseases, we believe these products contribute to an increase in animal welfare and an improvement in food safety while lessening the burden on the environment.\nZoetis enhanced the portfolio of its diagnostic products with the acquisition in 2018 of Abaxis, Inc. (Abaxis), a leading provider of veterinary point-of-care diagnostic instruments, including the VetScan\n®\n portfolio of benchtop and handheld diagnostic instruments and consumables. In 2023, the company enhanced its Vetscan Imagyst platform by adding artificial intelligence (AI) dermatology and AI fecal for equine, which uses a combination of image recognition technology, algorithms and cloud-based AI to deliver rapid testing results to veterinary clinics. In 2024, the company added AI urine sediment analysis to the Vetscan Imagyst platform and launched Vetscan OptiCell\nTM\n a cartridge-based, AI powered hematology analyzer that provides advanced Complete Blood Count (CBC) analysis. As Zoetis continues to develop additional innovative applications for Vetscan Imagyst, it plans to seamlessly integrate even more new capabilities into the platform, helping veterinarians provide the best possible care for animals. \nIn 2022, the company completed the acquisition of Jurox, an animal health company based in Australia, which brings the company a range of companion animal and livestock products and provides the company with future growth opportunities, manufacturing capacity and increased capabilities in Australia. Also in 2022, the company acquired Basepaws, a petcare genetics company that provides pet owners with genetic tests, analytics and early health risk assessments, which help pet owners and veterinarians understand an individual pet’s risk for disease and helps Zoetis identify solutions to complex diseases by informing our research and innovation.\n4 |\nTable of Contents\nIn 2023, the company completed the acquisition of PetMedix Ltd, a privately held research and development stage animal health biopharmaceutical company based in the U.K., which develops antibody-based therapeutics for companion animals. Also in 2023, the company completed the acquisition of adivo GmbH, a privately held research and development stage animal health biopharmaceutical company based in Germany. \nIn 2024, our two top-selling products and product lines, Simparica/Simparica Trio and Apoquel/Apoquel Chewable, contributed approximately 15% and 11%, respectively, of our revenue. Combined with our next three top-selling products and product lines, Cytopoint, Librela\n \nand our ceftiofur line, these five products and product lines contributed approximately 41% of our revenue. In 2024, our ten top-selling products and product lines contributed approximately 55% of our revenue. \nOur products and product lines that represented approximately 1% or more of our revenue in 2024, which comprise approximately 69% of our total revenue, are as follows (listed alphabetically by product category):\nCompanion animal products\nProduct / product line\nDescription\nPrimary species\nVaccines\nVanguard\n®\n / Versican\n®\n line\nIncludes various individual and combination vaccines protecting against certain viral and bacterial diseases, including leptospirosis, Bordetella, influenza and parainfluenza, adenovirus, distemper, parvovirus and Lyme disease\nDogs\nAnti-infectives\nClavamox\n®\n / Synulox\n®\nA broad-spectrum antibiotic approved for use in dogs and cats; available in both chewable tablets and drop form\nCats, dogs\nConvenia\n®\nInjectable anti-infective for the treatment of common bacterial skin infections\nCats, dogs\nParasiticides\nProHeart\n®\nAn injection to prevent heartworm infestation given either annually or semi-annually based on formulation; also for treatment of existing larval and adult hookworm infections\nDogs\nRevolution\n®\n / Revolution\n®\n Plus / Stronghold\n® \n/ Stronghold\n®\n Plus\nRevolution/Stronghold is a monthly topical antiparasitic for protection against fleas, lice, heartworm disease and ear mites in cats and dogs; sarcoptic mites and American dog tick in dogs and roundworms and hookworms for cats; Revolution Plus/Stronghold Plus, also a monthly topical solution, protects against fleas, lice, heartworm disease, ticks and ear mites and roundworms in cats\nCats, dogs\nSimparica\n®\n/ Simparica Trio\n®\nSimparica is a monthly chewable tablet for dogs to control fleas and ticks; Simparica Trio, also a monthly chewable tablet, is a triple combination parasiticide that delivers all-in-one protection from fleas and ticks, as well as heartworm disease, roundworms and hookworms\nDogs\nOther Pharmaceutical\nCerenia\n®\nA medication that prevents and treats acute vomiting in dogs, treats acute vomiting in cats and prevents vomiting due to motion sickness in dogs; available in injectable or tablet form\nCats, dogs\nPain and Sedation\nLibrela\n®\nAn injectable monthly antibody therapy to alleviate osteoarthritis pain in dogs\nDogs\nRimadyl\n®\nFor the relief of pain and inflammation associated with osteoarthritis and for the control of postoperative pain associated with soft tissue and orthopedic surgeries\nDogs\nSolensia\n®\nAn injectable monthly antibody therapy to alleviate osteoarthritis pain in cats\nCats\nDermatology\nApoquel\n® \n/ Apoquel\n®\n Chewable \nA selective inhibitor of the Janus Kinase 1 enzyme that controls pruritus associated with allergic dermatitis and control of atopic dermatitis in dogs at least 12 months of age; available in both tablet and chewable form\nDogs\nCytopoint\n®\nAn injectable to help reduce the clinical signs such as itching of atopic dermatitis in dogs of any age\nDogs\nAnimal Health Diagnostics\nVetScan\n®\n Chemistry Analyzer\nA benchtop diagnostic instrument with a test menu including chemistry, electrolytes, acid-base and immunoassay tests, and associated consumables\nCats, dogs\n5 |\nTable of Contents\nLivestock products\nProduct / product line\nDescription\nPrimary species\nVaccines\nFostera\n® \n/ Suvaxyn\n® \nline\nFamily of swine vaccines to prevent or control diseases associated with major pathogens such as Porcine Circovirus type 2 (PCV2), Porcine Reproductive and Respiratory Syndrome virus (PRRSv) and Mycoplasma hyopneumoniae (\nM. hyo\n), depending on formulation\nSwine\nImprovac\n® \n/ Improvest\n®\n / Vivax\n®\nReduces boar taint, as an alternative to surgical castration and suppression of estrus in gilts\nSwine\nPoulvac\n®\n line\nFamily of poultry vaccines protecting against certain viral and bacterial, including E. coli, Salmonella, Marek’s disease, infections bursal disease (IBD), Newcastle disease (ND), and infectious bronchitis virus and Avian Influenza virus, depending on formulation\nPoultry\nRispoval\n®\n / Bovi-Shield\n® \nline\nFamily of cattle vaccines protecting against a variety of key respiratory and reproductive diseases, including infectious bovine rhinotracheitis (IBR), bovine viral diarrhea (BVD), parainfluenza 3 (PI3), bovine respiratory syncytial virus (BRSV), and leptosirosis, depending on formulation\nCattle\nAnti-infectives\nCeftiofur line\nAn injectable broad-spectrum cephalosporin antibiotic active against gram-positive and gram-negative bacteria, including ß-lactamase-producing strains; includes Excede\n®\n, Excenel\n®\n RTU EZ and Naxcel\n®\n. Also includes Spectramast\n®\n for the treatment of subclinical or clinical mastitis in dry or lactating dairy cattle, delivered via intramammary infusion\nCattle, sheep, swine\nDraxxin\n® \n/ Draxxin\n® \nKP\nAn injectable antibiotic for the treatment and prevention of bovine and swine respiratory disease, infectious bovine keratoconjunctivitis and bovine foot rot. This product line also includes Draxxin KP/Draxxin Plus, which combines the antimicrobial properties of Draxxin with the anti-inflammatory, analgesic and antipyretic properties of the non-steroidal Ketoprofen to rapidly reduce fever\nCattle, sheep, swine\nParasiticides\nDectomax\n®\nAn injectable or pour-on endectocide, characterized by extended duration of activity, for the treatment and control of internal and external parasite infections\nCattle, swine\nInternational Operations\nWe directly market our products in approximately 45 countries across North America, Europe, Africa, Asia, Australia and South America, and our products are sold in more than 100 countries. Operations outside the U.S. accounted for 44% of our total revenue for the year ended December 31, 2024. We continue to benefit from our past efforts to establish an early and direct presence in many emerging markets, such as Brazil, Chile, China and Mexico, and we believe we are one of the largest animal health medicines and vaccines businesses as measured by revenue across emerging markets as a whole.\nOur international businesses are subject, in varying degrees, to a number of risks inherent in carrying on business in other countries. These include, among other things, currency fluctuations, capital and exchange control regulations, expropriation and other restrictive government actions. See",
  "item7": null,
  "item2": null
}