{
  "source_file": "a-20241031.htm",
  "form_type": "10-K",
  "item1_clean": "Life Sciences and Applied Markets Customers\nWe had approximately 52,000 customers for our life sciences and applied markets business in fiscal year 2024. A significant number of our life sciences and applied markets customers are also customers of our Agilent CrossLab business.\nThe life sciences and applied markets business is susceptible to seasonality in its orders and revenues primarily related to U.S. and foreign government budgets, chemicals and advanced materials and environmental customers and large pharmaceutical company budgets. Historically, the result is that our first and fourth fiscal quarters tend to deliver the strongest profits for the life sciences and applied markets business. However, general economic trends, new product introductions and competition might overshadow this trend in any given year.\nLife Sciences and Applied Markets Sales, Marketing and Support\nThe life sciences and applied markets channels focus on the therapeutics and human disease research customer base (pharma, biopharma, CRO, CMO and generics), clinical customer base (high complexity clinical testing labs), emerging life sciences opportunities in life science research institutes and applied markets (chemicals and advanced materials, food, environmental and forensics). We deploy a multi-channel approach, marketing products to our customers through direct sales, electronic commerce, resellers, manufacturers' representatives and distributors. We primarily use direct sales to market our solutions to our pharmaceutical, biopharmaceutical, clinical, life science research and applied market accounts. Sales agents supplement direct sales by providing broader geographic coverage and coverage of smaller accounts. Our active reseller program augments our ability to provide more complete solutions to our customers. We sell our consumable products through distributors, electronic commerce and direct sales.\nOur products typically come with standard warranties, and extended warranties are available for additional cost.\nLife Sciences and Applied Markets Manufacturing\nOur manufacturing supports our diverse product range and customer-centric focus. We assemble highly configurable products to individual customer orders and make standard products to stock. We employ advanced manufacturing techniques and supply chain management systems to reduce costs and manufacturing cycle times. Our manufacturing process then converts these designs into standard as well as custom products for shipment to customers. We selectively use third parties to provide some supply chain processes for manufacturing, warehousing and logistics. Inside the U.S., we have manufacturing facilities in California, Delaware and Rhode Island. Outside of the U.S., we have manufacturing facilities in Australia, China, Germany, Italy, Malaysia, Netherlands, Singapore and the United Kingdom. We have FDA registered sites in California, Germany and Singapore.\nLife Sciences and Applied Markets Competition\nThe markets for analytical instruments in which we compete are characterized by evolving industry standards and intense competition. Our principal competitors in the life sciences and applied markets arena include: Danaher Corporation, PerkinElmer Inc., Shimadzu Corporation, Thermo Fisher Scientific Inc. and Waters Corporation. We compete on the basis of product performance, reliability, support quality, applications expertise, global channel coverage and price.\nDiagnostics and Genomics Business\nOur diagnostics and genomics business includes the cell analysis, advanced manufacturing partnerships and research and development, pathology, companion diagnostics, reagent partnership, genomics and biomolecular analysis businesses.\nOur diagnostics and genomics business is comprised of seven areas of activity providing active pharmaceutical ingredients (\"APIs\") for oligo-based therapeutics as well as solutions that include reagents, instruments, software and consumables, which enable customers in the clinical and life sciences research areas to interrogate samples at the cellular and molecular level. First, our cell analysis business includes instruments, reagents, software, and labware associated with unique live-cell analysis platforms in addition to mainstream flow cytometers, plate-readers, and plate washers/dispensers which are used across a broad range of applications. Second, our advanced manufacturing partnerships business is a contract and development manufacturing organization that provides services related to and the production of synthesized oligonucleotides under pharmaceutical good manufacturing practices (\"GMP\") conditions for use as API in a class of drugs that utilize nucleic acid molecules for disease therapy. Together, our BIOVECTRA and nucleic acid solutions businesses offer a broader range of contract and development manufacturing services to our customers. They also provide clinical-to-commercial scale production capabilities focused mainly on mRNA manufacturing. Third, our pathology solutions business is focused on product offerings for cancer diagnostics and anatomic pathology workflows. The broad portfolio of offerings includes immunohistochemistry\n\nterm greenhouse gas emission reduction targets which were validated by the Science Based Targets initiative (\"SBTi\"). We also aim to provide transparency on our approach to sustainability management through our annual ESG report.\nA number of our products and services are subject to regulation by the FDA, the U.S. Department of Health and Human Services, the Centers for Medicare and Medicaid Services and certain similar foreign regulatory agencies. These regulations govern a wide variety of product and service related activities, from quality management, design and development to manufacturing, labeling, promotion, sales and distribution. If we fail to comply with FDA regulations and other applicable regulatory requirements or are perceived to potentially have failed to comply, we may face, among other things, warning letters; adverse publicity; investigations or notices of non-compliance, fines, injunctions, and civil or criminal penalties; import or export restrictions; partial suspensions or total shutdown of production facilities or the imposition of operating restrictions; suspension or revocation of our license to operate; increased difficulty in obtaining required FDA clearances or approvals or foreign equivalents; seizures or recalls of our products or those of our customers; or the inability to sell our products. In Europe, the European Union has started to enforce new requirements, known as the EU In Vitro Diagnostic Regulation (“EU IVDR”), which imposes stricter requirements for the marketing and sale of in vitro diagnostics in the European Union. These regulations are more stringent in a variety of areas, including clinical evidence requirements, quality management systems and post-market surveillance activities. The EU IVDR requirements became effective starting in May 2022.\nWe are subject to laws and regulations governing government contracts, and failure to address these laws and regulations or comply with government contracts could harm our business by leading to a reduction in revenue associated with these customers. We have agreements relating to the sale of our products to government entities and, as a result, we are subject to various statutes and regulations that apply to companies doing business with the government. We are also subject to investigation for compliance with the regulations governing government contracts. A failure to comply with these regulations could result in suspension of these contracts, criminal, civil and administrative penalties or debarment.\nWe are also subject to various significant international, federal, state and local regulations in the areas of health and safety, packaging, product content, employment, labor and immigration, import/export controls, trade restrictions and anti-competition. Violations of these laws and regulations could result in fines and penalties, criminal sanctions, restrictions on our business conduct and on our ability to offer our products in one or more countries, and could also materially affect our brand, our ability to attract and retain employees, our international operations, our business and our operating results.\nIn addition, as a global organization, we are subject to data privacy and security laws, regulations, and customer-imposed controls in numerous jurisdictions as a result of having access to and processing confidential, personal, sensitive and/or patient health data in the course of our business. Global privacy laws, including the EU's General Data Protection Regulation (\"GDPR”), Brazil’s\nLei Geral de Protecao de Dados\n, China's Personal Information Protection Law and Data Security Law, and the California Consumer Privacy Act, apply to our activities involving the processing of personal data, both in relation to our product and service offerings and the management of our workforce. The global proliferation of privacy laws, with governmental authorities around the world passing or considering passing legislative and regulatory proposals concerning\n\nAgilent Technologies Inc. (\"we\", \"Agilent\" or the \"company\"), incorporated in Delaware in May 1999, is a global leader in life sciences, diagnostics and applied chemical markets, providing application focused solutions that include instruments, software, services and consumables for the entire laboratory workflow.\nIn the first quarter of fiscal year 2024, we announced a change in our operating segments to move our cell analysis business from our life sciences and applied markets segment to our diagnostics and genomics operating segment in order to further strengthen growth opportunities for both organizations. Following this reorganization, we continued to have three business segments comprised of life sciences and applied markets, diagnostics and genomics and Agilent CrossLab, each of which continues to comprise a reportable segment. All historical financial segment information has been recast to conform to this new presentation in our consolidated financial statements and accompanying notes. There was no change to our Agilent CrossLab business segment. See also Note 23, \"Subsequent Event\" for additional information on recent changes to our organizational structure.\nOur life sciences and applied markets business provides application-focused solutions that include instruments, consumables and software that enable customers to identify, quantify and analyze the physical and biological properties of substances and products, as well as enable customers in the clinical and life sciences research areas to interrogate samples at the molecular and cellular level. Our consumables portfolio is designed to improve customer outcomes. Our diagnostics and genomics business is comprised of seven areas of activity providing active pharmaceutical ingredients (\"APIs\") for oligo-based therapeutics as well as solutions that include reagents, instruments, software and consumables which enable customers in the clinical and life sciences research areas to interrogate samples at the cellular and molecular level. The Agilent CrossLab business spans the entire lab with its extensive services portfolio, which is designed to improve customer outcomes. In addition, we conduct centralized order fulfillment and supply chain operations for our businesses through the order fulfillment and supply chain organization (\"OFS\"). OFS provides resources for manufacturing, engineering and strategic sourcing to our respective businesses. Each of our businesses, together with OFS, is supported by our global infrastructure organization, which provides shared services in the areas of finance, information technology, legal, certain procurement services, workplace services and human resources.\nWe sell our products primarily through direct sales, but we also utilize distributors, resellers, manufact",
  "item7_clean": "Research and development expenses decreased 9 percent in 2024 when compared to 2023. Research and development expenses decreased primarily due to lower expenses attributed to business exit activities and salary expenses related to workforce reduction activities. Research and development expenses increased 2 percent in 2023 when compared to 2022. Research and development expenses increased due to higher wages, additional expenses related to a recent acquisition and higher infrastructure costs.\nSelling, general and administrative expenses decreased 3 percent in 2024 when compared to 2023. Selling, general and administrative expenses decreased due to lower expenses attributed to business exit activities and lower salary expense related to workforce reduction activities partially offset by higher infrastructure costs. Selling, general and administrative expenses decreased 3 percent in 2023 when compared to 2022. Selling, general and administrative expenses decreased due to lower variable pay, the favorable impact of currency movements and lower infrastructure costs.\nOperating margin decreased 1 percentage point in 2024 when compared to 2023. Operating margin decreased due to lower revenue, higher infrastructure costs and higher wages partially offset by lower salary expense related to workforce reduction activities and expenses attributed to business exit activities. Operating margin decreased 1 percentage point in 2023 when compared to 2022. The decrease in operating margin resulted from lower gross margins, the unfavorable impact of currency movements and additional costs related to a recent acquisition partially offset by lower variable pay.\nIncome from Operations\nIncome from operations in 2024 decreased by $43 million or 12 percent when compared to 2023 on a revenue decrease of $104 million. Income from operations in 2023 decreased by $27 million or 7 percent when compared to 2022 on a revenue decrease of $11 million.\nThe Agilent CrossLab business spans the entire lab with its extensive services portfolio, which is designed to improve customer outcomes and represents a broad range of offerings designed to serve customer needs across end-markets and regardless of instrument manufacturer.\nThe services portfolio includes repairs, parts, maintenance, installations, training, compliance support, software as a service, asset management, consulting and various other custom services to support the customers' laboratory operations. Custom services are tailored to meet the specific application needs of various industries and to keep instruments fully operational and compliant with the respective industry requirements.\n\nuse of significant estimates and assumptions related to revenue growth rates, royalty rates and discount rates. We value backlog using the discounted cash flows based on the estimated revenue from pending orders. We value license agreements based on the expected future cash receipts from license agreements, discounted to present value over the term of the agreement. We believe that the fair value assigned to the assets acquired and liabilities assumed are based on reasonable assumptions and estimates that marketplace participants would use. Actual results could differ materially from these estimates. IPR&D is initially capitalized at fair value as an intangible asset with an indefinite life and assessed for impairment thereafter. When the IPR&D project is complete, it is reclassified as an amortizable purchased intangible asset and is amortized over its estimated useful life. If an IPR&D project is abandoned, we will record a charge for the value of the related intangible asset to our consolidated statement of operations in the period it is abandoned.\nWe continually monitor events and changes in circumstances that could indicate carrying amounts of finite-lived intangible assets may not be recoverable. When such events or changes in circumstances occur, we assess the recoverability of finite-lived intangible assets by determining whether the carrying value of such assets will be recovered through undiscounted expected future cash flows. If the total of the undiscounted future cash flows is less than the carrying amount of those assets, we recognize an impairment loss based on the excess of the carrying amount over the fair value of the assets.\nOur indefinite-lived intangible assets are IPR&D intangible assets. The accounting guidance allows a qualitative approach for testing indefinite-lived intangible assets for impairment, similar to the issued impairment testing guidance for goodwill and allows the option to first assess qualitative factors (events and circumstances) that could have affected the significant inputs used in determining the fair value of the indefinite-lived intangible asset to determine whether it is more-likely-than-not (i.e., greater than 50% chance) that the indefinite-lived intangible asset is impaired. An organization may choose to bypass the qualitative assessment for any indefinite-lived intangible asset in any period and proceed directly to calculating its fair value. As of October 31, 2024, we do not have any indefinite-lived intangible assets.\nDuring fiscal year 2024, we recorded an impairment of in-process research and development of $6 million in research and development in the consolidated statement of operations related to a project in our life sciences and applied markets segment. There were no impairments of indefinite-lived intangible assets during fiscal years 2023 and 2022.\nThe main components of our restructuring plan are related to workforce reductions, consolidation of excess leased facilities and site closures. Workforce reduction charges are accrued when payment of benefits becomes probable that the employees are entitled to the severance and the amounts can be estimated. Consolidation of facilities costs primarily consists of accelerated depreciation of right-of-use assets classified as held and used. In accordance with the accounting guidance, it was determined that certain assets had been abandoned, and an assessment was made of the remaining useful lives and potential alternative uses. If the amounts and timing of cash flows from restructuring activities are significantly different from what we have estimated, the actual amounts of restructuring and other related charges could be materially different, either higher or lower, than those we have recorded. See Note 16. \"Restructuring and Other Related Costs\" to the consolidated financial statements for additional information.\nAccounting for Income Taxes.\nWe must make certain estimates and judgments in determining income tax expense for financial statement purposes. These estimates and judgments occur in the calculation of tax credits, benefits and deductions, and in the calculation of certain tax assets and liabilities which arise from differences in the timing of recognition of revenue and expense for tax and financial statement purposes, as well as interest and penalties related to uncertain tax positions. Significant changes to these estimates may result in an increase or decrease to our tax provision in a subsequent period. On a quarterly basis, we provide for income taxes based upon an estimated annual effective tax rate. The effective tax rate is highly dependent upon the geographic composition of worldwide earnings, tax regulations governing each region, availability of tax credits and the effectiveness of our tax planning strategies. We monitor the changes in many factors and adjust our effective income tax rate on a timely basis. If actual results differ from these estimates, this could have a material effect on our financial condition and results of operations.\nSignificant management judgment is also required in determining whether deferred tax assets will be realized in full or in part. When it is more-likely-than-not that all or some portion of deferred tax assets may not be realized, a valuation allowance must be established against such deferred tax assets. We consider all available positive and negative evidence on a jurisdiction-by-jurisdiction basis when assessing whether it is more likely than not that deferred tax assets are recoverable. We consider evidence such as our past operating results, the existence of losses in recent years and our forecast of future taxable income.\nThe calculation of our tax liabilities involves dealing with uncertainties in the application of complex tax law and regulations in a multitude of jurisdictions. Although the guidance on the accounting for uncertainty in income taxes prescribes the use of a recognition and measurement model, the determination of whether an uncertain tax position has met those thresholds will continue to require significant judgment by management. In accordance with the guidance on the accounting for\n\nmargin on products for the year ended October 31, 2023 was significantly impacted by asset impairment charges of $253 million primarily related to the exit of our Resolution Bioscience business. Excluding these asset impairment charges, total gross margin for the year ended October 31, 2023 was relatively flat when compared to 2022. Total gross margin was also impacted by targeted price increases, lower shipping and logistics costs, variable pay expenses and intangible amortization expense offset by the unfavorable impact of currency movements, higher wages, restructuring and other related costs and inventory charges.\nGross inventory charges were $45 million in 2024, $40 million in 2023 and $24 million in 2022. Sales of previously written down inventory were $16 million in 2024, $9 million in 2023 and $11 million in 2022.\nResearch and development expenses for the year ended October 31, 2024 were flat when compared to 2023. Research and development expenses slightly decreased due to lower salary expense related to workforce reduction activities mostly offset by restructuring charges and an impairment of in-process research and development when compared to 2023. Research and development expenses for the year ended October 31, 2023 increased 3 percent when compared to 2022. Research and development expenses increased due to higher wages, program costs in our life sciences and applied markets and diagnostics and genomics businesses and restructuring and other related costs partially offset by the lower variable pay expenses and favorable impact of currency movements.\nSelling, general and administrative expenses decreased 4 percent in 2024 when compared to 2023. Selling, general and administrative expenses decreased due to lower intangible amortization expenses, transformational initiatives, advertising expenses, variable pay and salary expense related to workforce reduction activities partially offset by higher restructuring charges and share-based compensation expense. Selling, general and administrative expenses were flat in 2023 compared to 2022. Selling, general and administrative expenses in 2022 included a decrease in expenses of $25 million related to the change in the fair value of contingent consideration. Excluding this amount, selling, general and administrative expenses decreased 2 percent when compared to 2022. The decrease was due to lower variable pay, intangible amortization expense, sales commissions and the favorable impact of currency movements partially offset by higher wages, restructuring and other related costs and asset impairment charges primarily related to the exit of our Resolution Bioscience business.\nTotal operating margin for the year ended October 31, 2024 increased 3 percentage points when compared to 2023. Total operating margin for the year ended October 31, 2024 increased mostly due to lower impairment charges in 2024 compared to 2023 partially offset by restructuring charges. Total operating margin for the year ended October 31, 2023, decreased 4 percentage points when compared to 2022. Total operating margin for the year ended October 31, 2023 decreased mainly due to asset impairment charges primarily related to the exit of our Resolution Bioscience business and restructuring and other related costs.\nInterest income for the years ended October 31, 2024, 2023 and 2022 was $80 million, $51 million and $9 million, respectively. The increase in interest income in 2024 and 2023 was primarily due to higher cash balances and increases in interest rates related to our cash and cash equivalents.\nInterest expense for the years ended October 31, 2024, 2023 and 2022 was $96 million, $95 million and $84 million, respectively, and primarily relates to the interest charged on our senior notes, term loan, credit facilities, commercial paper and the amortization of the deferred loss recorded upon termination of the forward starting interest rate swap contracts partially offset by the amortization of deferred gains recorded upon termination of interest rate swap contracts. The increase in interest expense from 2022 is primarily related to higher interest rates on short-term commercial paper and the variable rate on the term loan facility.\nOur headcount was approximately 17,900 at October 31, 2024 and 18,100 at October 31, 2023.\nOther income (expense), net\nFor the year ended October 31, 2024, other income (expense), net of $49 million income includes $8 million of income related to foreign currency translation reclassified out of accumulated comprehensive income (loss) and $12 million income related to the provision of site service costs to, and lease income from, Keysight Technologies, Inc. (\"Keysight\"). The costs associated with these services are reported within income from operations. Other income (expense), net also includes $25 million income related to the defined benefit retirement and post-retirement benefit plans (interest cost, expected return on assets, amortization of net actuarial (gain) loss, prior service credits and settlement loss).\n\n(in millions, except margin data)\nResearch and development\nSelling, general and administrative\nIncome from operations\nGross margin decreased 1 percentage point in 2024 compared to 2023. Gross margin was impacted by lower sales volume, unfavorable impact of currency movements and higher warranty costs which were partially offset by lower salary expense related to workforce reduction activities and shipping costs when compared to 2023. Gross margin was flat in 2023 compared to 2022. Gross margin was impacted by lower revenue, the unfavorable impact of currency movements, higher wages and warranty costs which were fully offset by targeted price increases, lower variable pay, logistics and materials cost.\nResearch and development expenses decreased 3 percent in 2024 when compared to 2023. Research and development expenses decreased due to\nsalary expense related to workforce reduction activities, lower consumables costs and depreciation expenses partially offset by the unfavorable impact of currency movements when compared to 2023. Research and development expenses increased 2 percent in 2023 when compared to 2022. Research and development expenses increased due to higher wages and program investments in our software and informatics business partially offset by lower variable pay.\nSelling, general and administrative expenses decreased 2 percent in 2024 compared to 2023. Selling, general and administrative expenses decreased due to lower salary expense related to workforce reduction activities, variable pay and\n\nSelling, general and administrative expenses increased 2 percent in 2024 when compared to 2023. Selling, general and administrative expenses increased\ndue to higher commissions partially offset by lower travel expenses and other discretionary spending and salary expense related to workforce reduction activities.\nSelling, general and administrative expenses decreased 4 percent in 2023 when compared to 2022. The decrease was\nprimarily due to lower variable pay and a favorable impact of currency movements partially offset by higher wages.\nOperating margin increased",
  "item2_clean": null
}