{
  "source_file": "a-20250731.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Our revenue, costs and expenses, and monetary assets and liabilities and equity are exposed to changes in foreign currency exchange rates as a result of our global operating and financing activities. The overall effect of changes in foreign currency exchange rates had no impact on revenue growth for the nine months ended July 31, 2025 when compared to the same period last year. Typically, when movements in foreign currency exchange rates have a positive impact on revenue, they will also have a negative impact by increasing our costs and expenses or vice versa. We calculate the impact of movements in foreign currency exchange rates by applying the actual foreign currency exchange rates in effect during the last month of each\nquarter of the current year to both the applicable current and prior year periods. We hedge revenue, expenses and balance sheet exposures that are not denominated in the functional currencies of our subsidiaries on a short term and anticipated basis. We do experience some fluctuations within individual lines of the condensed consolidated statement of operations and balance sheet because our hedging program is not designed to offset the currency movements in each category of revenues, expenses, monetary assets and liabilities. Our hedging program is designed to hedge currency movements on a relatively short-term basis (up to a rolling twelve-month period). We may also hedge equity balances denominated in foreign currency on a long-term basis. To the extent that we are required to pay for all, or portions, of an acquisition price in foreign currencies, we may enter into foreign exchange contracts to reduce the risk that currency movements will impact the U.S. dollar cost of the transaction.\n\nacross all of our businesses with the exception of strong growth in our liquid chromatography mass spectrometry business and moderate growth in our liquid chromatography business. Within the applied markets, we saw strong revenue growth primarily within the chemicals and advanced materials markets.\n. While the recent tariff changes adversely impacted our costs of revenue in the third quarter, we expect to substantially mitigate the impact during our fiscal year 2026. Therefore, we remain optimistic about our long-term growth opportunities in our end markets and continue to invest in expanding and improving our applications and solutions portfolio. We continue to leverage our liquid chromatography and liquid chromatography mass spectrometry platforms to maximize our growth via key vectors across our markets, making us optimistic about our long-term growth opportunities in the life sciences markets. We remain positive about the growth in our diagnostic and clinical markets around our OMNIS platforms. Market demand for therapeutic oligo continues to grow, and our CDMO business is well positioned to serve expanding customer requirements. We will also continue to invest in research and development, invest in expanding and improving our applications and solutions portfolio and seek to expand our position in developing countries and emerging markets.\nYear over Year Change\n(in millions, except margin data)\nResearch and development\nSelling, general and administrative\nIncome from operations\nGross margin for products and services for the three and nine months ended July 31, 2025, decreased 4 percentage points and 3 percentage points, respectively, when compared to the same periods last year. Gross margin for the three months ended July 31, 2025 was impacted mainly by increased tariffs and shipping costs, unfavorable business mix, increased warranty costs, increased variable pay and the unfavorable impact of currency movements. Gross margin for the nine months ended July 31, 2025 was impacted mainly by increased tariffs and shipping costs, unfavorable business mix and increased variable pay which was partially offset by lower warranty expenses.\nResearch and development expenses for the three and nine months ended July 31, 2025, increased 3 percent and decreased 3 percent, respectively, when compared to the same periods last year.\nResearch and development expenses for the\nmonths ended July 31, 2025\nincreased primarily due to the BIOVECTRA acquisition, increased variable pay and the unfavorable impact of currency movements partially offset by lower salary expenses related to workforce reduction activities. Research and development expenses for the nine months ended July 31, 2025 decreased primarily due to lower salary expenses related to workforce reduction activities partially offset by increases in variable pay and additional expenses related to the BIOVECTRA acquisition.\nSelling, general and administrative expenses for the three and nine months ended July 31, 2025, increased 10 percent and 4 percent, respectively, when compared to the same periods last year. Selling, general and administrative expenses for the three months ended July 31, 2025, increased due to higher commission, travel, the unfavorable impact of currency movements and variable pay expenses. Selling, general and administrative expenses for the nine months ended July 31, 2025, increased due to higher commission, travel and variable pay expenses.\nOperating margin for products and services for the three and nine months ended July 31, 2025 decreased 2 percentage points and was flat, respectively, when compared to the same periods last year. Operating margin for products and services for the three months ended July 31, 2025, decreased primarily due to increased tariffs and shipping costs, unfavorable business mix, increased warranty costs, increased variable pay and the unfavorable impact of currency movements which was partially offset by lower salary expenses related to workforce reduction activities. Operating margin for products and services for the nine months ended July 31, 2025 was flat due to lower salary expense related to workforce reduction activities and lower warranty costs offset by increased tariffs and shipping costs, unfavorable business mix and increased variable pay.\nIncome from operations for the three and nine months ended July 31, 2025 increased $4 million or 3 percent and $21 million or 6 percent, respectively, on a corresponding revenue increase of $85 million and $162 million, respectively.\n\nOur Agilent CrossLab segment provides an extensive services and consumables portfolio that spans the entire lab, in addition to software and laboratory automation solutions, which are designed to improve customer outcomes and represents a broad range of offerings designed to serve customer needs across end-markets and applications. Our services portfolio includes repairs, parts, maintenance, installations, training, compliance support, software as a service,\nasset management, consulting and various other custom services to support the customers' laboratory operations.\nCustom services are tailored to meet the specific application needs of various industries and to keep instruments fully operational and compliant with the respective industry requirem\nents. Our consumables portfolio is designed to improve customer outcomes. Most of the portfolio is vendor neutral, meaning we can serve and supply customers regardless of their instrument purchase choices. Solutions range from chemistries to supplies. Key product categories in consumables include gas chromatography (\"GC\") and liquid chromatography (\"LC\") columns, sample preparation products, custom chemistries, and a large selection of laboratory supplies.\nSoftware and informatics solutions include software for instrument control, data acquisition, data analysis, secure storage of results, and laboratory information and workflow management. This software facilitates the compliant use of instruments in pharmaceutical quality assurance and quality control environments. The OpenLab laboratory software suite is a scalable, open software platform that enables customers to capture, analyze, and share scientific data throughout the lab and across the enterprise. Laboratory automation offers automated sample preparation solutions, including liquid handling, plate management, consumables and scheduling software. These solutions\nrange from standalone automation platforms to integrated workflow solutions with seamless integration to our instrumentation.\nYear over Year Change\nAgilent CrossLab segment revenue for the three and nine months ended July 31, 2025 increased 8 percent and 5 percent, respectively, when compared to the same periods last year. The overall effect of foreign currency movements on revenue\ngrowth for the three and nine months ended July 31, 2025 had a 3 percentage point favorable impact and 1 percentage point unfavorable impact, respectively, when compared to the same periods last year.\nGeographically, revenue for the three months ended July 31, 2025 increased 2 percent in the Americas with a 1 percentage point unfavorable\ncurrency impact, increased 15 percent in Europe with a 7 percentage point favorable currency impact and increased 8 percent in Asia Pacific with a 2 percentage point favorable currency impact compared to the same period last year. For the three months ended July 31, 2025,\nrevenue growth in the Americas was driven by strength in repair, maintenance and installation services and our software and informatics business partially offset by weakness in our lab automation business when compared to the same period last year. Revenue growth in Europe was driven by strength in repair, maintenance and compliance services, and our consumables, lab automation and software and informatics businesses when compared to the same period last year. Revenue growth in Asia Pacific was driven by strength in our consumables business, repair, maintenance and compliance services and our software and informatics businesses when compared to the same period last year.\nRevenue for the nine months ended July 31, 2025 increased 3 percent in the Americas with a 1 percentage point unfavorable currency impac"
}