{
  "source_file": "abbv-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Marketing, Sales and Distribution Capabilities\nAbbVie utilizes a combination of dedicated commercial resources, regional commercial resources and distributorships to market, sell and distribute its products worldwide. AbbVie directs its primary marketing efforts toward securing the prescription, or recommendation, of its brand of products by physicians, external experts and other health care providers. Managed care providers (for example, health maintenance organizations and pharmacy benefit managers), hospitals and state and federal government agencies (for example, State Medicaid programs, the United States Department of Veterans Affairs and the United States Department of Defense) are also important customers. AbbVie also markets directly to consumers themselves, although in the United States many of the company's products must be sold pursuant to a prescription. Outside of the United States, AbbVie focuses its promotional and market access efforts on external experts, payers, physicians and health systems. AbbVie also provides patient support programs closely related to its products.\nAbbVie's products are generally sold worldwide directly to wholesalers, distributors, government agencies, health care facilities, specialty pharmacies and independent retailers from AbbVie-owned distribution centers and public warehouses. Certain products (including aesthetic products and devices) are also sold directly to physicians and other licensed healthcare providers. Although AbbVie's business does not have significant seasonality, AbbVie's product revenues may be affected by end customer and retail buying patterns, fluctuations in wholesaler inventory levels and other factors.\nIn the United States, AbbVie distributes pharmaceutical products principally through independent wholesale distributors, with some sales directly to retailers, pharmacies, patients or other customers. In 2024, three wholesale distributors (McKesson Corporation, Cardinal Health, Inc. and Cencora, Inc.) accounted for substantially all of AbbVie's pharmaceutical product sales in the United States. No individual wholesaler accounted for greater than 39% of AbbVie's 2024 gross revenues in the United States. Outside the United States, AbbVie sells products primarily to wholesalers or through distributors, and depending on the market works through largely centralized national payers systems to agree on reimbursement terms.\nCertain products are co-marketed or co-promoted with other companies. AbbVie has no single customer that, if the customer were lost, would have a material adverse effect on the company's business. No material portion of AbbVie's business is subject to renegotiation of profits or termination of contracts at the election of the government. Orders are generally filled on a current basis and order backlog is not material to AbbVie's business.\nThe markets for AbbVie's products are highly competitive. AbbVie competes with other research-based pharmaceuticals and biotechnology companies that discover, manufacture, market and sell proprietary pharmaceutical products, therapies and biologics. For example, AbbVie's immunology products compete with anti-TNF products, JAK inhibitors and other competitive products intended to treat a number of disease states, and AbbVie's oncology products compete with BTK inhibitors and other competitive products intended to treat certain cancers. In addition, in the past few years, a number of other companies have started to develop, have successfully developed and/or are currently marketing products that are being positioned as competitors to Botox. The search for technological innovations in pharmaceutical products is a significant aspect of competition. The introduction of new products by competitors and changes in medical practices and procedures can result in product obsolescence. Price is also a competitive factor. In addition, the substitution of generic and biosimilar pharmaceutical products for branded pharmaceutical products creates competitive pressures on AbbVie's products that do not have patent protection. New products or treatments brought to market by AbbVie’s competitors could cause revenues for AbbVie’s products to decrease due to price reductions and sales volume decreases.\nCompetition for AbbVie’s biologic products is affected by the approval of follow-on biologics, also known as “biosimilars.” Biologics have added major therapeutic options for the treatment of many diseases, including some for which therapies were unavailable or inadequate. The cost of developing and producing biologic therapies is typically dramatically higher than for small molecule medications, and many biologic medications are used for ongoing treatment of chronic diseases, such as rheumatoid arthritis or inflammatory bowel disease, or for the treatment of previously untreatable cancer. Significant investments in biologics infrastructure and manufacturing are necessary to produce biologic products.\nHumira faces direct biosimilar competition globally, and AbbVie will continue to face competitive pressure from these biologics and from orally administered products.\nIn the United States, the FDA regulates biologics under the Federal Food, Drug, and Cosmetic Act (the FFDCA), the Public Health Service Act (PHSA) and the regulations implementing these statutes. The enactment of federal health care reform legislation in March 2010 provided a pathway for approval of biosimilars under the PHSA, but the approval process for, and science behind, biosimilars is complex. Approval by the FDA is dependent upon many factors, including a showing that the biosimilar is \"highly similar\" to the original product and has no clinically meaningful differences from the original product in\n\nis a global, diversified research-based biopharmaceutical company positioned for success with a comprehensive product portfolio that has leadership positions across immunology, oncology, aesthetics, neuroscience and eye care. AbbVie uses its expertise, dedicated people and unique approach to innovation to develop and market advanced therapies that address some of the world’s most complex and serious diseases. AbbVie was incorporated in Delaware on April 10, 2012. On January 1, 2013, AbbVie became an independent, publicly-traded company as a result of the distribution by Abbott Laboratories (Abbott) of 100% of the outstanding common stock of AbbVie to Abbott's shareholders.\nAbbVie operates as a single global business segment dedicated to the research and development, manufacturing, commercialization and sale of innovative medicines and therapies. This operating structure enables the Chief Executive Officer, as Chief Operating Decision Maker (CODM), to allocate resources and assess business performance on a global basis in order to achieve established long-term strategic goals. Consistent with this structure, a global research and development and supply chain organization is responsible for the discovery, development, manufacturing and supply of products. Commercial efforts that coordinate the marketing, sales and distribution of these products are organized by geographic region or therapeutic area. All of these activities are supported by a global corporate administrative staff. The determination of a single business segment is consistent with the consolidated financial information regularly reviewed by the CODM for purposes of assessing performance, allocating resources and planning and forecasting future periods. See Note 16, \"Segment and Geographic Area Information\" to the Consolidated Financial Statements included under Item 8, \"Financial Statements and Supplementary Data\" and the sales information related to AbbVie's key products and geographies included under Item 7, \"Management's Discussion and Analysis of Financial Condition and Results of Operations.\"\nAbbVie's portfolio of products includes a broad line of therapies that address some of the world's most complex and serious diseases.\nImmunology products.\nAbbVie maintains an extensive immunology portfolio across rheumatology, dermatology and gastroenterology. AbbVie's immunology products address unmet needs for patients with autoimmune diseases. These products are:\nHumira (adalimumab) is a biologic therapy administered as a subcutaneous injection. It is approved to treat the following autoimmune diseases in the United States, Canada and Mexico (collectively, North America) and in the European Union:\n\ninfringement, validity and enforceability. The European Union has also created a pathway for approval of biosimilars and has published guidelines for approval of certain biosimilar products. The more complex nature of biologics and biosimilar products has led to close regulatory scrutiny over follow-on biosimilar products, which can reduce the effect of biosimilars on sales of the innovator biologic as compared to the sales erosion caused by generic versions of small molecule pharmaceutical products.\nAbbVie owns or has licensed rights to a substantial number of patents and patent applications. AbbVie licenses or owns a patent portfolio of thousands of patent families, each of which includes United States patent applications and/or issued patents and may also contain the non-United States counterparts to these patents and applications.\nThese patents and applications, including various patents that expire during the period 2025 to the mid 2040s, in aggregate are believed to be of material importance in the operation of AbbVie’s business. However, AbbVie believes that no single patent, license, trademark (or related group of patents, licenses, or trademarks), are material in relation to the company’s business as a whole.\nIn addition, the following patents, licenses and trademarks are significant: those related to risankizumab (which is sold under the trademark Skyrizi) and those related to upadacitinib (which is sold under the trademark Rinvoq). The United States composition of matter patents covering risankizumab and upadacitinib are expected to expire in 2033.\nAbbVie may rely, in some circumstances, on trade secrets to protect its technology. AbbVie seeks to protect its technology and product candidates, in part, by confidentiality agreements with its employees, consultants, advisors, contractors and collaborators. These agreements may be breached and AbbVie may not have adequate remedies for any breach. In addition, AbbVie’s trade secrets may otherwise become known or be independently discovered by competitors. To the extent that AbbVie’s employees, consultants, advisors, contractors and collaborators use intellectual property owned by others in their work for the company, disputes may arise as to the rights in related or resulting know-how and inventions.\nLicensing, Acquisitions and Other Arrangements\nIn addition to its independent efforts to develop and market products, AbbVie enters into arrangements such as acquisitions, option-to-acquire agreements, licensing arrangements, option-to-license arrangements, strategic alliances, co-promotion arrangements, co-development and co-marketing agreements and joint ventures. The acquisitions and option-to-acquire agreements typically include, among other terms and conditions, non-refundable purchase price payments or option fees, option exercise payments, milestones or earn-outs and other customary terms and obligations. The licensing and other arrangements typically include, among other terms and conditions, non-refundable upfront license fees, option fees and option exercise payments, milestone payments and royalty and/or profit sharing obligations. See Note 5, \"Licensing, Acquisitions and Other Arrangements—Other Licensing & Acquisitions Activity,\" to the Consolidated Financial Statements included under Item 8, \"Financial Statements and Supplementary Data.\"\nThird Party Agreements\nAbbVie has agreements with third parties for process development, product distribution, analytical services and manufacturing of certain product",
  "item7_clean": "2025 Strategic Objectives\nAbbVie's mission is to discover and develop innovative medicines and products that solve serious health issues today and address the medical challenges of tomorrow while achieving top-tier financial performance through outstanding execution. AbbVie intends to execute its strategy and advance its mission in a number of ways, including: (i) maximizing the benefits of a diversified revenue base with multiple long-term growth drivers; (ii) leveraging AbbVie's commercial strength and international infrastructure across therapeutic areas and ensuring strong commercial execution of new product launches; (iii) continuing to invest in and expand its pipeline in support of opportunities in immunology, oncology, aesthetics, neuroscience and eye care as well as continued investment in key on-market products; (iv) generating substantial operating cash flows to support investment in innovative research and development, and return cash to shareholders via a strong and growing dividend while also continuing to repay debt. In addition, AbbVie anticipates several regulatory submissions and data readouts from key clinical trials in the next 12 months.\nAbbVie expects to achieve its strategic objectives through:\nMaximizing revenue growth of our key on-market products, including Skyrizi, Rinvoq, Venclexta, Elahere, Vraylar, Ubrelvy, Qulipta, Vyalev/Produodopa, Botox and Juvederm Collection.\nAdvancing our research and development pipeline by delivering late-stage pipeline milestones, achieving key proof-of-concept objectives across therapeutic areas and continuing to invest in key on-market product indication expansion.\nMaximizing the value of key acquisitions as well as continuing to invest in external innovation.\nContinuing to effectively manage the impact of Humira biosimilar erosion.\nThe favorable impact of pipeline products and indications recently approved or currently under regulatory review where approval is expected in 2025. These products are described in greater detail in the section labeled \"Research and Development\" included as part of this Item 7.\n2024 Financial Results\nAbbVie's strategy has focused on delivering strong financial results, maximizing the benefits of a diversified revenue base, advancing and investing in its pipeline and returning value to shareholders while ensuring a strong, sustainable growth business over the long term. The company's financial performance in 2024 included delivering worldwide net revenues of $56.3 billion, operating earnings of $9.1 billion, diluted earnings per share of $2.39 and cash flows from operations of $18.8 billion. Worldwide net revenues increased by 4% on a reported and 5% on a constant currency basis.\nDiluted earnings per share in 2024 was $2.39 and included the following after-tax costs: (i) $6.5 billion related to the amortization of intangible assets; (ii) $3.7 billion for the change in fair value of contingent consideration liabilities; (iii) $3.5 billion related to intangible asset impairment; (iv) $978 million of acquisition and integration expenses; and (v) $721 million for charges related to litigation matters. These costs were partially offset by an income tax benefit of $1.8 billion primarily related to the settlement of income tax examinations. Additionally, financial results reflected continued funding to support all stages of AbbVie’s pipeline assets and continued investment in AbbVie’s on-market brands.\nThe Inflation Reduction Act of 2022 has and will continue to have a significant impact on how drugs are covered and paid for under the Medicare program, including through the creation of financial penalties for drugs whose price increases outpace inflation, the redesign of Medicare Part D benefits to shift a greater portion of the costs to manufacturers, and through government price-setting for certain Medicare Part B and Part D drugs. In 2023, Imbruvica was selected as one of the first 10 medicines subject to government-set prices beginning in 2026. In 2024, the CMS published Medicare Part D prices that will be applicable to the 10 selected drugs, including Imbruvica, beginning in 2026. In January 2025, HHS, through the CMS, selected Vraylar and Linzess as two of the 15 medicines subject to government-set prices beginning in 2027. It is possible that more of our products, including products that generate substantial revenues, could be selected in future years, which could, among other things, accelerate revenue erosion prior to expiration of intellectual property protections. The effect of reducing prices and reimbursement for certain of our products would significantly impact our results of operations. See Part I, Item 1 “Business – Regulation – Commercialization, Distribution and Manufacturing,” Part I, Item 1A “Risk Factors” and Note 7 to the consolidated financial statements for additional information.\n\nNet revenues for Botox Cosmetic increased 3% in 2024. In the United States, Botox Cosmetic net revenues increased 1% primarily driven by favorable pricing, partially offset by the unfavorable impact of customer inventory destocking and decreased consumer demand. Internationally, Botox Cosmetic net revenues increased 7% primarily driven by favorable pricing and increased consumer demand across key international markets.\nNet revenues for Juvederm Collection decreased 12% in 2024 primarily driven by the unfavorable impact of decreased consumer demand and customer inventory destocking.\nNet revenues for Botox Therapeutic increased 11% in 2024 primarily driven by continued market share uptake as well as market growth.\nNet revenues for Vraylar increased 18% in 2024 primarily driven by continued market share uptake as well as market growth.\nNet revenues for Ubrelvy increased 23% in 2024 primarily driven by continued market share uptake as well as market growth.\nNet revenues for Qulipta increased 61% in 2024 primarily driven by continued strong market share uptake as well as market growth.\nyears ended December 31 (dollars in millions)\nas a percent of net revenues\nGross margin as a percentage of net revenues in 2024 increased compared to 2023. Gross margin percentage for 2024 was favorably impacted by lower intangible asset impairment charges and lower amortization of intangibles. Intangible asset impairment charges were $3.6 billion in 2023.\nSelling, General and Administrative\nyears ended December 31 (dollars in millions)\nSelling, general and administrative\nas a percent of net revenues\nSelling, general and administrative (SG&A) expenses as a percentage of net revenues increased in 2024 compared to 2023. SG&A expense was unfavorably impacted by litigation reserve charges of $910 million in 2024 compared to income of $485 million in 2023 and acquisition and integration costs incurred in connection with the ImmunoGen and Cerevel Therapeutics acquisitions including cash-settled, post-closing expense for both ImmunoGen and Cerevel Therapeutics employee incentive awards. The SG&A expense percentage increase in 2024 was partially offset by the favorable impact of leverage from revenue growth. See Note 5 to the Consolidated Financial Statements for additional information.\nResearch and Development\nyears ended December 31 (dollars in millions)\nResearch and development\nas a percent of net revenues\nResearch and development (R&D) expenses as a percentage of net revenues increased in 2024 compared to 2023. R&D expense percentage for 2024 was unfavorably impacted by the intangible asset impairment charge of $4.5 billion related to emraclidine compared to an intangible asset impairment charge of $630 million in 2023, increased funding to support all stages of the company's pipeline assets and acquisition and integration costs incurred in connection with the ImmunoGen and Cerevel Therapeutics acquisitions including cash-settled, post-closing expense for employee incentive awards. See Note 5 to the Consolidated Financial Statements for additional information.\n\nAcquired IPR&D and Milestones\nyears ended December 31 (in millions)\nDevelopment milestones\nAcquired IPR&D and milestones\nAcquired IPR&D and milestones expense in 2024 included charges related to the upfront payments of $1.4 billion to acquire Aliada Therapeutics Holdings, Inc. (Aliada) and $250 million to acquire Celsius Therapeutics. See Note 5 to the Consolidated Financial Statements for additional information.\nOther Operating Expense (Income), Net\nOther operating expense (income), net included a gain of $169 million in 2023 related to a development liability associated with an asset divested as part of the acquisition of Allergan, Inc. (Allergan) in 2020.\nOther Non-Operating Expenses\nyears ended December 31 (in millions)\nInterest expense, net\nNet foreign exchange loss\nInterest expense in 2024 increased compared to 2023 primarily due to the incremental interest associated with financing the ImmunoGen and Cerevel Therapeutics acquisitions. See Note 10 to the Consolidated Financial Statements for additional information related to debt issued to finance the ImmunoGen and Cerevel Therapeutics acquisitions.\nInterest income in 2024 increased compared to 2023 primarily due to a higher average cash and cash equivalents balance and the impact of higher interest rates.\nOther expense, net included charges related to changes in fair value of contingent consideration liabilities of $3.8 billion in 2024 and $5.1 billion in 2023. The fair value of contingent consideration liabilities is impacted by the passage of time and multiple other inputs, including the probability of success of achieving regulatory/commercial milestones, discount rates, the estimated amount of future sales of the acquired products and other market-based factors. In 2024, the change in fair value reflected higher estimated Skyrizi sales and the passage of time, partially offset by higher discount rates. In 2023, the change in fair value reflected higher estimated Skyrizi sales driven by stronger market share uptake, the passage of time and lower discount rates.\nThe effective income tax rate was (15%) in 2024, 22% in 2023 and 12% in 2022. The effective income tax rate fluctuates year to year due to the allocation of the company’s taxable earnings among jurisdictions, as well as certain discrete factors and events in each year, including changes in tax law and business development activities. The effective income tax rates in 2024, 2023 and 2022 differed from the statutory tax rate principally due to the impact of foreign operations with lower income tax rates in locations outside the United States, the U.S. global minimum tax, changes in fair value of contingent consideration, tax audits and settlements, tax credits and incentives in the United States, Puerto Rico and other foreign tax jurisdictions, and business development activities. The effective income tax rate in 2024 was lower than prior periods due to the resolutions of various tax positions pertaining to multiple prior tax years, including the closing of U.S. IRS examinations covering three tax years, partially offset by increases in unrecognized tax benefits pertaining to prior years. The lower effective income tax rate in 2024 also reflects an increase due to acquisition costs related to certain business development activities and a decrease related to changes in fair value of contingent consideration. The effective income tax rate in 2023 was higher than prior periods due to increased changes in fair value of contingent consideration, intangible asset impairments and the impacts of the transition from the Puerto Rico excise tax to an income tax.\nIn 2022, Puerto Rico enacted Act 52-2002 (the Puerto Rico Act) allowing for a transition from a Puerto Rico excise tax levied on gross inventory purchases to an income-based tax beginning in 2023. The company completed the transition\n\nthe plans' specific cash flows and applies them to the corresponding individual spot rates along the yield curve in calculating the service cost and interest cost portions of expense. For certain plans, AbbVie reviews various indices such as corporate bond and government bond benchmarks to estimate the discount rate.\nAbbVie's assumed discount rates have a significant effect on the amounts reported for defined benefit pension and other post-employment plans as of December 31, 2024. A 50 basis point change in the assumed discount rate would have had the following effects on AbbVie's calculation of net periodic benefit costs in 2025 and projected benefit obligations as of December 31, 2024:\n(in millions) (brackets denote a reduction)\nDefined benefit plans\nNet periodic benefit cost\nProjected benefit obligation\nOther post-employment plans\nNet periodic benefit cost\nProjected benefit obligation\nThe expected long-term rate of return is based on the asset allocation, historical performance and the current view of expected future returns. AbbVie considers these inputs with a long-term focus to avoid short-term market influences. The current long-term rate of return on plan assets for each plan is supported by the historical performance of the trust's actual and target asset allocation. AbbVie's assumed expected long-term rate of return has a significant effect on the amounts reported for defined benefit pension plans as of December 31, 2024 and will be used in the calculation of net periodic benefit cost in 2025. A one percentage point change in assumed expected long-term rate of return on plan assets would increase or decrease the net period benefit cost of these plans in 2025 by $109 million.\nThe health care cost trend rate is selected by reviewing historical trends and current views on projected future health care cost increases. The current health care cost trend rate is supported by the historical trend experience of each plan. Assumed health care cost trend rates have a significant effect on the amounts reported for health care plans as of December 31, 2024 and will be used in the calculation of net periodic benefit cost in 2025.\nAbbVie accounts for income taxes under the asset and liability method. Provisions for federal, state and foreign income taxes are calculated on reported pre-tax earnings based on current tax laws. Deferred taxes are provided using enacted tax rates on the future tax consequences of temporary differences, which are the differences between the financial statement carrying amount of assets and liabilities and their respective tax bases and the tax benefits of carryforwards. A valuation allowance is established or maintained when, based on currently available information, it is more likely than not that all or a portion of a deferred tax asset will not be realized.\nThe company is subject to contingencies, such as various claims, legal proceedings and investigations regarding product liability, intellectual property, commercial, securities and other matters that arise in the normal course of business. See Note 15 to the Consolidated Financial Statements for additional information. Loss contingency provisions are recorded for probable losses at management's best estimate of a loss, or when a best estimate cannot be made, a minimum loss contingency amount within a probable range is recorded. Accordingly, AbbVie is often initially unable to develop a best estimate of loss and therefore, the minimum amount, which could be zero, is recorded. As information becomes known, either the minimum loss amount is increased, resulting in additional loss provisions, or a best estimate can be made, also resulting in additional loss provisions. Occasionally, a best estimate amount is changed to a lower amount when events result in an expectation of a more favorable outcome than previously expected.\nValuation of Goodwill and Intangible Assets\nAbbVie has acquired and may continue to acquire significant intangible assets in connection with business combinations that AbbVie records at fair value. Transactions involving the purchase or sale of intangible assets occur between companies in the phar",
  "item2_clean": null
}