{
  "source_file": "abnb-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "We operate a global marketplace, where hosts offer guests stays and experiences on our platform. We are a community based on connection and belonging—a community that was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country and region across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\nAirbnb has five stakeholders and is designed with all of them in mind. Along with employees and shareholders, we serve hosts, guests, and the communities in which they live. We intend to make long-term decisions considering all of our stakeholders because their collective success is key for our business to thrive.\nOur Long-Term Growth Strategy\nOur key strategic priorities include perfecting our core business, accelerating growth in global markets, and launching and scaling new offerings. Over the past several years, we have introduced hundreds of new features and upgrades to our platform spanning nearly every part of our service from pricing to quality to customer support. Additionally, we are leveraging our global markets strategy, which includes a more localized approach to product updates and marketing investments to raise awareness and consideration in less mature markets. Lastly, we are planning to expand our business beyond travel accommodations using our multi-year product roadmap to help drive long-term growth across new businesses.\nOur Platform for Hosts\nWe built our platform to seamlessly onboard new hosts, especially those who previously had not considered hosting. We partner with hosts throughout the process of setting up their listing and provide them with a robust suite of tools to successfully manage their listings, including scheduling, merchandising, integrated payments, community support, host protections, pricing tools, and feedback from reviews. During 2024, we introduced Co-Host Network, which enables our hosts to find co-hosts who can help manage their listing. Co-hosts are experienced hosts who provide personalized support based on the hosts’ needs, from listing setup to managing bookings and communicating with guests.\nOur Platform for Guests\nOur website and mobile app provide our guests with an engaging way to explore and easily book a wide variety of unique homes and experiences. Over the last several years, we have launched a significant number of new features and upgrades through our biannual product releases to help guests find affordable, high quality and reliable stays across the platform.\nThe system for trust that we have designed includes the following components: host and guest reviews, account protection, risk scoring, secure payments, a nondiscrimination policy, watchlist and background checks in certain jurisdictions, cleanliness, fraud and scam prevention, insurance and similar protections, booking restrictions, an urgent safety line, a 24/7 neighborhood support line, anti-party technology, and a guest refund policy.\nWe offer protection for our hosts through AirCover for Hosts. AirCover for Hosts includes, among other features, guest property damage protection of up to $3 million per stay, liability coverage to hosts of up to $1 million per occurrence in the event of third-party claims of personal injury or property damage, deep cleaning protection, and pet damage protection.\nWe also offer AirCover for guests, which provides support for serious issues with a booking or during a stay, including host cancellations, inability to check-in, inaccurate listings, and a 24-hour safety support line.\nWe have new initiatives under development and will continue to create additional safety features to strengthen the trust and safety on our platform.\nOur technology platform powers our two-sided marketplace and enables our global network of hosts and guests. Given the nature of the business, our technology platform has broad and complex requirements:\nSupport of global payments\n. It enables guests and hosts to send and receive money in their preferred currency, supporting approximately 20 local payment methods. Designed for scalability and reliability, the platform ensures secure transactions through advanced protections against fraud and money laundering.\nDelivery of global community support\n. It provides multilingual, real-time community safety and support, and city-specific regulatory support.\nDelivery of deep business insights\n. It delivers deep business intelligence insights to manage our marketplace, including pricing insights and occupancy optimization for our hosts.\nIncorporation of artificial intelligence (“AI”) and machine learning\n. It incorporates sophisticated AI into key areas, from fraud detection, to personalized listing matching and enabling customized and real-time community support.\nOperation of a microservices architecture\n. We operate a microservices architecture and are evolving our foundational components to enable us to move rapidly in response to evolving customer needs without sacrificing correctness or stability.\nAs we continue to evolve our foundational technology, we are focused on the following broad capabilities:\nData management systems that are designed to support user privacy, analytics, machine learning/AI, and business insights.\nService reliability leading to best-in-class performance centered on availability, latency, disaster recovery and business continuity, security, testability, observability, operability, and agility.\nCloud support focusing on robust capabilities for granular attribution and usage patterns to realize efficiency gains.\nThese continued technological investments aim to create a robust platform that allows us to more quickly adapt to the needs of our hosts and guests around the world and increase the productivity of our product development organization.\nOur marketing strategy includes brand marketing, communications, and performance marketing. Brand marketing increases awareness among potential hosts and guests, helping them understand the benefits of hosting and booking stays and experiences, and what makes these stays and experiences distinctly Airbnb. Our global communications team works across press, policy, and online influencers to share timely and important news about Airbnb. They also oversee the execution of a global consumer, product, corporate, and policy-communications plan that supports our brand strategy and generates considerable press and social media coverage. While performance marketing is one component of our multi-pronged strategy, the strength of the Airbnb brand and our communications strategy allows us to be less reliant on performance marketing.\nWe consider the management of our global talent to be essential to the ongoing success of our business. As of December 31, 2024, we had approximately 7,300 employees.\nAs of December 31, 2024, we relied on a global network of approximately 11,000 third-party workers to handle the vast majority of our community support contacts. Our internal community support employees are comprised of operations teams who handle complex and sensitive issues, and enablement teams who support all community-facing teams, including our partners.\nAttracting, recruiting, developing, and retaining talent from a wide range of backgrounds and experiences enables us to provide our hosts and guests with innovative products and services as well as serve our other stakeholders. Through our hiring process, we commit to finding the best, most qualified candidates for each role, while encouraging inclusion and eliminating bias. We are also focused on supporting all of our employees in continuing to grow and develop throughout the employee lifecycle.\nOur Live and Work Anywhere policy allows for the vast majority of our employees to work remotely. We believe that expanding our talent pool beyond the commuting radius near our offices will allow us to attract the best employees over time, as it helps us to have a broader and more diverse range of qualified candidates for any given position. We aim to create a highly coordinated working culture, and as such, will continue to promote ways to keep employees highly engaged and connected by aligning employees’ work through our product roadmap, as well as curating employee collaboration sessions either in the office or at off-site locations.\nIn 2021, we committed to a goal to operate as a net zero company for our global corporate operations by 2030, reducing greenhouse gas emissions associated with our corporate operations across Scope 1 (direct emissions from stationary combustion and refrigerants), Scope 2 (indirect emissions from purchased electricity, diesel generators and district heat), and the following Scope 3 categories defined by the Greenhouse Gas Protocol: purchased goods and services, capital goods, fuel- and energy-related activities (not included in Scope 1 or Scope 2), waste generated in operations, business travel, employee commuting, and upstream leased assets. To help meet our goals, we are implementing a broad range of initiatives designed to help decarbonize our business and make our corporate operations more sustainable.\nWe also purchase, and plan to continue purchasing, carbon credits to fully achieve our emissions goals in the long-term. Our aim is to procure such credits from high integrity projects, with a focus on nature-based solutions or projects with other co-benefits where feasible.\nWe are subject to laws, regulations, and rules that affect the short-term and long-term rental and home sharing business at city, state, country, and regional levels. While a number of cities, counties, states and countries have implemented legislation to address short-term rentals, there are many others that are not yet explicitly addressing or enforcing short-term rental laws, and could follow suit and enact regulations.\nWe seek to work with governments to establish clear, fair, and workable home sharing rules to create clarity for our hosts, however certain cities have passed onerous restrictions on short-term rentals. For example, New York City passed regulations in 2023, which resulted in a de facto ban of short-term rental activities. Other smaller cities have also passed onerous restrictions on short-term rentals. We will continue to collaborate with policymakers to implement sensible legislation around the world and/or dispute regulations that unreasonably restrict the right to host.\nIn addition to laws, regulations, and rules directly applicable to the short-term and long-term rental and home sharing business, we are subject to a wide variety of laws, regulations and rules governing our business practices. These include those related to the Internet, Internet access, e-commerce, and electronic devices, and those involving taxation, privacy, data privacy, data security, insurance, pricing, content, advertising, discrimination, consumer protection, employment, protection of minors, copyrights, distribution, messaging, mobile communications, use of AI, electronic device certification, electronic waste, electronic contracts, communications, competition, and unfair commercial practices. We are also subject to laws, regulations, and rules governing the provision of online payment services, the design and operation of our platform, and the operations, characteristics, and quality of our platform and services. Additionally, we are subject to a variety of taxes and tax collection obligations in the United States (federal, state, and local) and numerous foreign jurisdictions.\nOur payments platform is subject to various laws, rules, regulations, policies, legal interpretations, and regulatory guidance, including those governing cross-border and domestic money transmission and funds transfers, stored value and prepaid access, foreign exchange, data privacy, data security, cybersecurity, banking s",
  "item7_clean": "Net cash provided by operating activities\nPurchases of property and equipment\nFree Cash Flow Margin\nOur Free Cash Flow is impacted by the timing of GBV because we collect our service fees at the time of booking, which is generally before a stay or experience occurs. Funds held on behalf of our customers and amounts payable to our customers do not impact Free Cash Flow, except interest earned on these funds.\nOur operations are global, and certain trends in our business, such as Nights and Experiences Booked, GBV, revenue, ADR, and Nights per Booking vary by geography. We measure Nights and Experiences Booked by region based on the location of the listing.\n(in millions, except percentages)\nNights and Experiences Booked\nEMEA\nEMEA\nEMEA\nWe saw a 2% increase in ADR in 2024 compared to the prior year, primarily due to higher ADR in EMEA, which increased by 5%.\nOur total Company average nights per booking, excluding experiences, was 3.8 in 2024 compared to 3.9 in 2023. Average nights per booking in 2024 was 4.1 for North America, 3.8 for EMEA, 3.7 for Latin America, and 3.3 for Asia Pacific. We expect that our blended global average nights per booking will continue to fluctuate based on our geographic mix and changes in traveler behaviors.\nNo single city represented more than 2% of our revenue before adjustments for incentives and refunds during the years ended December 31, 2023 and 2024, or more than 1% of our active listings as of December 31, 2023 and 2024.\nResults of Operations\nThe following table sets forth our results of operations for the periods presented (in millions, except percentages):\nOperations and support\nGeneral and administrative\nTotal costs and expenses\nIncome from operations\nIncome before income taxes\nProvision for (benefit from) income taxes\nIncludes stock-based compensation expense as follows (in millions, except percentages):\nOperations and support\nGeneral and administrative\nStock-based compensation expense\nComparison of the Years Ended December 31, 2023 and 2024\n\nOur revenue consists of service fees, net of incentives and refunds, charged to our customers. For stays, service fees, which are charged to customers as a percentage of the value of the booking, excluding taxes, vary based on factors specific to the booking, such as booking value, the duration of the booking, geography, and host type. For experiences, we only earn a host fee. Substantially all of our revenue comes from stays booked on our platform. Incentives include our referral programs and marketing promotions to encourage the use of our platform and attract new customers. We experience a difference in timing between when a booking is made and when we recognize revenue, which occurs upon check-in. We record the service fees that we collect from customers prior to check-in on our balance sheet as unearned fees. Revenue is net of incentives and refunds provided to customers.\n(in millions, except percentages)\nRevenue increased $1.2 billion, or 12%, in 2024 compared to 2023, primarily due to an increase in the number of check-ins relating to Nights and Experiences Booked and a modest increase in ADR driven by our North America and EMEA regions.\nCost of revenue includes payment processing costs, including merchant fees and chargebacks, costs associated with third-party data centers used to host our platform, and amortization of internally developed software and acquired technology. Because we act as the merchant of record, we incur all payment processing costs associated with our bookings, and we have chargebacks, which arise from account takeovers and other fraudulent activities. Cost of revenue may vary as a percentage of revenue from year to year based on activity\non our platform and may also vary from quarter to quarter as a percentage of revenue based on the seasonality of our business and the difference in the timing of when bookings are made and when we recognize revenue.\n(in millions, except percentages)\nPercentage of revenue\nCost of revenue increased $175 million, or 10%, in 2024 compared to 2023, primarily due to an increase in merchant fees of $173 million, due to an increase in GBV, the impact of certain one-time incentives in 2023, and an increase in cloud computing costs of $26 million, due to increased server and data storage usage. These increases were partially offset by a reduction in chargebacks of $34 million.\nOperations and Support\nOperations and support expense primarily consists of personnel-related expenses and third-party service provider fees associated with community support provided via phone, email, and chat to customers; customer relations costs, which include refunds and credits related to customer satisfaction and expenses associated with our host protection programs; and allocated costs for facilities and information technology.\n(in millions, except percentages)\nOperations and support\nPercentage of revenue\nOperations and support expense increased $96 million, or 8%, in 2024 compared to 2023, primarily due to a $38 million increase in payroll-related expenses, an increase in customer relations costs of $25 million, mainly due to higher nights booked, and an increase in insurance costs of $25 million, due to higher premiums as a result of higher nights booked.\nProduct development expense primarily consists of personnel-related expenses and third-party service provider fees incurred in connection with the development of our platform, and allocated costs for facilities and information technology.\n(in millions, except percentages)\nPercentage of revenue\nProduct development expense increased $334 million, or 19%, in 2024, compared to 2023, primarily due to a $288 million increase in payroll-related expenses.\nSales and marketing expense primarily consists of brand and performance marketing, personnel-related expenses, including those related to our field operations, policy and communications, portions of referral incentives and coupons, and allocated costs for facilities and information technology.\n(in millions, except percentages)\nBrand and performance marketing\nField operations and policy\nTotal sales and marketing\nPercentage of revenue\nSales and marketing expense increased $385 million, or 22%, in 2024, compared to 2023, primarily due to a $294 million increase in marketing activities associated with ongoing marketing campaigns and search engine marketing, a $58 million increase in payroll-related expenses, and a $26 million increase in consultant and other service provider costs.\nGeneral and Administrative\nGeneral and administrative expense primarily consists of personnel-related expenses for management and administrative functions, including finance and accounting, legal, and human resources. General and administrative expense also includes certain professional services fees, general corporate and director and officer insurance, allocated costs for facilities and information technology, indirect taxes,\nincluding lodging tax reserves for which we may be held jointly liable with hosts for collecting and remitting such taxes, and bad debt expense.\n(in millions, except percentages)\nGeneral and administrative\nPercentage of revenue\nGeneral and administrative expense decreased $840 million, or 41%, in 2024, compared to 2023, primarily due to decreased non-income taxes and related fees and penalties, partially offset by an increase in payroll-related expenses. Non-income taxes and related fees and penalties decreased $656 million and $194 million, respectively, primarily due to a withholding tax settlement related to Italy, partially off-set by an increase in payroll-related expenses of $22 million.\nInterest income consists primarily of interest earned on our cash, cash equivalents, marketable securities, and amounts held on behalf of customers.\n(in millions, except percentages)\nInterest income increased $97 million, or 13%, in 2024 compared to 2023, primarily due to higher cash and investment balances.\nOther expense, net consists primarily of realized and unrealized gains and losses on foreign currency transactions and balances, unrealized gains and losses on derivatives, the change in fair value of investments and financial instruments, including our share of income or loss from our equity method investments, and interest expense, which consists primarily of interest associated with various indirect tax reserves, amortization of debt issuance and debt discount costs.\n(in millions, except percentages)\nThe change in other expense, net of $177 million in 2024 compared to 2023 was primarily due to increased foreign exchange gains of $77 million and a decrease in interest expense of $58 million related to interest on withholding taxes recorded in 2023, partially offset by an impairment charge of $45 million on an investment in a privately-held company in 2024.\nProvision for (benefit from) Income Taxes\nWe are subject to income taxes in the United States and foreign jurisdictions in which we do business. Foreign jurisdictions have different statutory tax rates than those in the United States. Additionally, certain of our foreign earnings may also be taxable in the United States. We expect our effective tax rate in the future to depend upon the proportion between the following items and income before income taxes: U.S. tax benefits from foreign-derived intangible income, U.S. tax on foreign income net of allowable credits, tax effects from share-based compensation, research tax credits, tax effects from capital losses not expected to be utilized, restructurings, settlement of tax contingency items, tax effects of changes in our business, and the effects of changes in tax law.\n(in millions, except percentages)\nProvision for (benefit from) income taxes\nThe provision for income taxes during 2024 was driven by current tax on U.S. and foreign earnings and deferred tax expense resulting from prior year’s valuation allowance release on our U.S. federal and state deferred tax assets and the utilization of some of those assets in 2024. The income tax benefit for 2023, was primarily due to the release of $2.9 billion of our valuation allowance related to certain of our U.S. federal and state deferred tax assets, as a discrete tax benefit.\nIn 2021, the Organization for Economic Co-operation and Development (“OECD”) established an inclusive framework on base erosion and profit shifting and agreed on a two-pillar solution to global taxation, focusing on global profit allocation, known to as Pillar One and a 15% global minimum effective tax rate, known as Pillar Two. In December of 2022, the EU member states agreed to implement the OECD’s global minimum tax rate of 15%. The OECD issued Pillar Two model rules and continues to release guidance on these rules. The inclusive framework calls for tax law changes by participating countries to take effect in 2024 and 2025. Various countries have enacted or have announced plans to enact new tax laws to implement the global minimum tax. We considered the applicable tax law changes on Pillar Two implementation in the relevant countries, and concluded there was no material impact to our tax provision for 2024. We will continue to evaluate the impact of these tax law changes on future reporting periods.\nLiquidity and Capital Resources\n\nAn active booker is a unique guest who has booked a stay or experience in a given period.\nWe consider a listing of a home or an experience to be an active listing if it is viewable on Airbnb and has been previously booked at least once on Airbnb (excluding HotelTonight).\nAvailable listings are accommodations and experiences that are viewable on a certain date on our platform (excluding HotelTonight).\nCheck-ins represent individual stays or experiences that occur during a period that have not been canceled.\nCo-hosts are experienced hosts who provide personalized support based on the hosts’ needs, from listing setup to managing bookings and communicating with guests.\nGuest arrivals represent an individual and all co-travelers included on a reservation for a stay for completed check-ins during a given period.\nWe count the number of hosts on our platform based on the number of users with available listings as of a certain date.\nPayments to customers\nWe make payments to customers as part of our referral programs and marketing promotions, and refund activities. The payments are generally in the form of coupon credits to be applied toward future bookings or as cash refunds.\nWe are a community based on connection and belonging—a community that was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country and region across the globe. Every day, hosts offer unique stays and experiences that make it possible for guests to connect with communities in a more authentic way.\nWe have five stakeholders and we have designed our Company with all of them in mind. Along with employees and shareholders, we serve hosts, guests, and the communities in which they live. We intend to make long-term decisions considering all of our stakeholders because their collective success is key for our business to thrive.\n2024 Financial Highlights\nIn 2024, revenue increased by 12% to $11.1 billion compared to 2023, primarily due to a 10% increase in Nights and Experiences Booked of 43.3 million combined with higher Average Daily Rate (“ADR”) driving a 12% increase in Gross Booking Value of $8.5 billion. The growth in GBV and revenue demonstrated continued strong travel demand.\nIn 2024, net income decreased by 45% to $2.6 billion, compared to the prior year, primarily due to the release of the majority of our valuation allowance on U.S. federal and state deferred tax assets of $2.9 billion in 2023, and the recognition of deferred tax expense related to the utilization of some of those assets in 2024 (see Note 14,\nincreased 11% to $4.0 billion in 2024 demonstrating the continued strength of our business, growth in revenue and discipline in managing our cost structure.\nOur net cash provided by operating activities was $4.5 billion in 2024, compared to $3.9 billion, in the prior year. We generated Free Cash Flow\nof $4.5 billion for the year ended December 31, 2024, compared to $3.8 billion, in the prior year.\nDuring 2024, we repurchased an aggregate of 24.5 million shares of Class A common stock for $3.4 billion. As of December 31, 2024, we completed the repurchases under the August 2, 2022 share repurchase program and had $3.3 billion available for repurchase of Class A common stock under the May 9, 2023 share repurchase program.\nInflation and other macroeconomic pressures in the United States and the global economy, such as tariffs, foreign currency fluctuations, as well as wars and other geopolitical conflicts, have contributed to an increasingly complex business environment. As a result, our future operational results may be subject to volatility. Additionally, health-related events, political instability, acts of terrorism, and natural disasters, are examples of other events that could have a negative impact on the travel industry in the future.\nKey Business Metrics and Non-GAAP Financial Measures\nWe track the following key business metrics and financial measures that are not calculated and presented in accordance with generally accepted accounting principles in the United States of America (“U.S. GAAP”) (“non-GAAP financial measures”) to evaluate our operating performance, identify trends, formulate financial projections, and make strategic decisions. Accordingly, we believe that these key business metrics and non-GAAP financial measures provide useful information to investors and others in understanding and evaluating our results of operations in the same manner as our management team. We believe that non-GAAP financial information, when taken collectively, may be helpful to investors because it provides consistency and comparability with past financ",
  "item2_clean": null
}