{
  "source_file": "abnb-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "We are a community based on connection and belonging—a community that was born in 2007 when two hosts welcomed three guests to their San Francisco home, and has since grown to over 5 million hosts who have welcomed over 2 billion guest arrivals in almost every country and region across the globe. Every day, hosts offer unique stays, experiences, and services that make it possible for guests to connect with communities in a more authentic way.\nWe have five stakeholders and we have designed our Company with all of them in mind. Along with employees and shareholders, we serve hosts, guests, and the communities in which they live. We intend to make long-term decisions considering all of our stakeholders because their collective success is key for our business to thrive.\nThird Quarter Financial Highlights\nRevenue for the three months ended September 30, 2025 grew by 10% to $4.1 billion, compared to the same period in the prior year. The increase was primarily due to an increase in the number of check-ins relating to Nights and Seats Booked and a modest increase in Average Daily Rate (“ADR”).\nNet income for the three months ended September 30, 2025 increased slightly by $6 million to $1.4 billion, compared to the same period in the prior year. This increase was primarily due to revenue growth, largely offset by an increase in payroll-related expenses, lower interest income due to declining interest rates, and an increase to the income tax provision due to the recording of a valuation allowance against deferred tax assets associated with corporate alternative minimum tax (“CAMT”) credits.\nCash provided by operating activities was $1.4 billion for the three months ended September 30, 2025, compared to $1.1 billion in the same period in the prior year. Free Cash Flow\nwas $1.3 billion for the three months ended September 30, 2025, compared to $1.1 billion in the same period in the prior year.\nDuring the three months ended September 30, 2025, we repurchased 6.7 million shares of Class A common stock for $857 million, leaving $6.6 billion available to repurchase under our share repurchase programs.\nMacroeconomic and Geopolitical Conditions on our Business\nAs we look forward, we recognize the potential impact of challenging macroeconomic and geopolitical conditions on our business, including inflation, interest rates, foreign currency fluctuations, tariffs and trade controls, and potential decreased consumer spending. To date, these conditions have not had a material impact on our business, results of operations, cash flows, and financial condition; however, the impact in the future of these macroeconomic and geopolitical conditions on our business, results of operations, cash flows, and financial condition is uncertain and will depend on future developments that we may not be able to accurately predict.\nKey Business Metrics and Non-GAAP Financial Measures\nWe track the following key business metrics and financial measures that are not calculated and presented in accordance with generally accepted accounting principles in the United States of America (“U.S. GAAP”) (“non-GAAP financial measures”) to evaluate our operating performance, identify trends, formulate financial projections, and make strategic decisions. Accordingly, we believe that these key business metrics and non-GAAP financial measures provide useful information to investors and others in understanding and evaluating our results of operations in the same manner as our management team. We believe that non-GAAP financial information, when taken collectively, may be helpful to investors because it provides consistency and comparability with past financial performance, and assists in comparisons with other companies, some of which use similar non-GAAP financial information to supplement their U.S. GAAP results.\nThese key business metrics and non-GAAP financial measures are presented for supplemental informational purposes only, should not be considered a substitute for financial information presented in accordance with U.S. GAAP, and may be different from similarly titled metrics or measures presented by other companies. A reconciliation of each non-GAAP financial measure to the most directly comparable financial measure stated in accordance with U.S. GAAP is provided under the subsection titled “— Adjusted EBITDA Reconciliation” and “— Free Cash Flow Reconciliation” below. Investors are encouraged to review the related U.S. GAAP financial measures and the reconciliation of these non-GAAP financial measures to their most directly comparable U.S. GAAP financial measures.\nA reconciliation of non-GAAP financial measures to the most comparable U.S. GAAP financial measures is provided under the subsection titled “Key Business Metrics and Non-GAAP Financial Measures— Free Cash Flow Reconciliation” below.\nKey Business Metrics\nWe review the following key business metrics to measure our performance, identify trends, formulate financial projections, and make strategic decisions. We are not aware of any uniform standards for calculating these key metrics, which may hinder comparability with other companies that may calculate similarly titled metrics in a different way.\nThe following table summarizes our key business metrics, for each period presented below (in millions, except percentages):\nNights and Seats Booked\nNights and Seats Booked\nNights and Seats Booked is a key measure of the scale of our platform, which in turn drives our financial performance. Nights and Seats Booked on our platform in a period represents the sum of the total number of nights booked for stays and the total number of seats booked for experiences and services, net of cancellations and alterations that occurred in that period. For example, a booking made on February 15 would be reflected in Nights and Seats Booked for our quarter ended March 31. If, in the example, the booking were canceled on May 15, Nights and Seats Booked would be reduced by the cancellation for our quarter ended June 30. A night can include one or more guests and can be for a listing with one or more bedrooms. Nights and Seats Booked grows as we attract new customers to our platform and as repeat guests increase their activity on our platform. A seat is booked for each participant in an experience or service. Substantially all of the bookings on our platform to date have come from nights. We believe Nights and Seats Booked is a key business metric to help investors and others understand and evaluate our results of operations in the same manner as our management team, as it represents a single unit of transaction on our platform.\nDuring the three and nine months ended September 30, 2025, the increase in Nights and Seats Booked, compared to the same periods in the prior year, was driven by growth across all regions, with the strongest growth percentages in Latin America and Asia Pacific, as we continue to focus on international expansion.\nGBV represents the dollar value of bookings on our platform in a period and is inclusive of host earnings, service fees, cleaning fees, and taxes, net of cancellations and alterations that occurred during that period. The timing of recording GBV and any related cancellations is similar to that described in the subsection titled “— Key Business Metrics and Non-GAAP Financial Measures — Nights and Seats Booked” above. Revenue from the booking is recognized upon check-in; accordingly, GBV is a leading indicator of revenue. The entire amount of a booking is reflected in GBV during the quarter in which booking occurs, whether the guest pays the entire amount of the booking upfront or elects to use our Pay Less Upfront program. Growth in GBV reflects our ability to attract and retain customers and reflects growth in Nights and Seats Booked.\nDuring the three and nine months ended September 30, 2025, the increase in GBV, compared to the same periods in the prior year, was primarily due to an increase in Nights and Seats Booked. We saw GBV growth across all regions, with the strongest growth percentages in Latin America and Asia Pacific.\nNon-GAAP Financial Measures\nOur non-GAAP financial measures include Adjusted EBITDA, Adjusted EBITDA Margin, Free Cash Flow and Free Cash Flow Margin, which are described below. A reconciliation of each non-GAAP financial measure to the most directly comparable financial measure stated in accordance with U.S. GAAP is provided below. Investors are encouraged to review the related U.S. GAAP financial measures and the reconciliation of these non-GAAP financial measures to their most directly comparable U.S. GAAP financial measures. Adjusted EBITDA and Adjusted EBITDA Margin have limitations as a financial measure, should be considered as supplemental in nature, and are not meant as a substitute for the related financial information prepared in accordance with U.S. GAAP. Because of these limitations, Adjusted EBITDA and Adjusted EBITDA Margin should be considered alongside other financial performance measures, including net income and net income margin as well as our other U.S. GAAP results. Free Cash Flow and Free Cash Flow Margin have limitations as analytical tools and should not be considered in isolation or as a substitute for analysis of other U.S. GAAP financial measures, such as net cash provided by operating activities and net cash provided by operating activities margin. Free Cash Flow and Free Cash Flow Margin do not reflect our ability to meet future contractual commitments and may be calculated differently by other companies in our industry, limiting their usefulness as comparative measures.\nPurpose of Non-GAAP Measure\nAdjusted EBITDA Margin\n: Net income adjusted for:\nprovision for income taxes,\nother income (expense), net,\ndepreciation and amortization,\nstock-based compensation expense,\nacquisition-related impacts consisting of gains (losses) recognized on changes in the fair value of contingent consideration arrangements,\nlodging taxes for which we may have join"
}