{
  "source_file": "abt-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nGENERAL DEVELOPMENT OF BUSINESS\nAbbott Laboratories is an Illinois corporation, incorporated in 1900. Abbott’s* principal business is the discovery, development, manufacture, and sale of a broad and diversified line of healthcare products.\nNARRATIVE DESCRIPTION OF BUSINESS\nAbbott has four reportable segments: Established Pharmaceutical Products, Diagnostic Products, Nutritional Products, and Medical Devices.\nEstablished Pharmaceutical Products\nThese products include a broad line of branded generic pharmaceuticals manufactured worldwide and marketed and sold outside the United States in emerging markets. These products are generally sold directly to wholesalers, distributors, government agencies, healthcare facilities, pharmacies, and independent retailers from Abbott-owned distribution centers or public warehouses, depending on the market served. Certain products are co-marketed or co-promoted with, or licensed from, other companies.\nThe principal products included in the broad therapeutic area portfolios of the Established Pharmaceutical Products segment are:\ngastroenterology products, including Creon™, for the treatment of pancreatic exocrine insufficiency associated with several underlying conditions, including cystic fibrosis and chronic pancreatitis; Duspatal™ and Dicetel™, for the treatment of irritable bowel syndrome or biliary spasm; Heptral™, Transmetil™, and Samyr™, for the treatment of intrahepatic cholestasis (associated with liver disease) or depressive symptoms; and Duphalac™, for regulation of the physiological rhythm of the colon;\nwomen’s health products, including Duphaston™, for the treatment of many different gynecological disorders; and Femoston™, a hormone replacement therapy for postmenopausal women;\ncardiovascular and metabolic products, including Lipanthyl™ and TriCor™, for the treatment of dyslipidemia; Omacor™, for the treatment of hypertriglyceridemia; Physiotens™, for the treatment of hypertension; and Synthroid™, for the treatment of hypothyroidism;\npain and central nervous system products, including Serc™, for the treatment of Ménière’s disease and vestibular vertigo; Brufen™, for the treatment of pain, fever, and inflammation; and Sevedol™, for the treatment of severe migraines;\nrespiratory drugs and vaccines, including the anti-infective clarithromycin (sold under the trademarks Klacid™, Claribid™, and Klaricid™); and Influvac™, an influenza vaccine; and\nbiosimilar products, including the areas of oncology and women's health.\nThe Established Pharmaceutical Products segment directs its primary marketing efforts toward building strong brands with key stakeholders, including consumers, pharmacists, physicians, and other healthcare providers. Government agencies are also important customers.\nCompetition in the Established Pharmaceutical Products segment is generally from other healthcare and pharmaceutical companies. In addition, the substitution of generic drugs for the brand prescribed and introduction of additional forms of already marketed established products by generic or branded competitors may increase competitive pressures.\n________________________________________________________\nThese products include a broad line of diagnostic systems and tests manufactured, marketed, and sold worldwide. These products are generally marketed and sold directly to blood banks, hospitals, commercial laboratories, clinics, physicians’ offices, retailers, government agencies, alternate care testing sites, and plasma protein therapeutic companies from Abbott-owned distribution centers, public warehouses or third party distributors.\nThe principal products included in the Diagnostic Products segment are:\ncore laboratory and transfusion medicine systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion serology testing, including the Alinity\nfamily of instruments along with the ARCHITECT\nsystems. These systems are used for screening and/or diagnosis for cancer, cardiac and metabolic disorders, drugs of abuse, thyroid function, fertility, neurologic and general chemistries, infectious diseases such as hepatitis and HIV, therapeutic drug monitoring, and a suite of SARS-CoV-2 serology assays;\nmolecular diagnostics polymerase chain reaction (PCR) instrument systems, including Alinity\nm and m2000™ that automate the extraction, purification, and preparation of DNA and RNA from patient samples, and detect and measure infectious agents including HIV, hepatitis, HPV, sexually transmitted infections, SARS-CoV-2 and influenza A & B, and respiratory syncytial virus (RSV); and products for oncology with the Vysis\nFISH product line of genomic-based tests;\npoint-of-care systems, including the i-STAT\nand cartridges for testing blood gas, chemistry, electrolytes, coagulation and immunoassay;\nrapid diagnostics lateral flow testing products in the area of infectious diseases such as SARS-CoV-2, including the BinaxNOW\nrapid testing platforms, influenza, HIV, hepatitis, and tropical diseases such as malaria and dengue fever; molecular point-of-care testing for HIV, including the m-PIMA\nHIV-1/2 Viral Load Test, and for SARS-CoV-2 and influenza A & B, RSV and strep A, including the ID NOW\nrapid molecular system; cardiometabolic testing, including Afinion\nplatforms and tests; and a toxicology business for drug and alcohol testing; and\ninformatics and automation solutions for use in laboratories, including laboratory automation systems such as the GLP systems Track™, the RALS\npoint-of-care solution, and AlinIQ\n, a suite of informatics tools and professional services.\nThe Diagnostic Products segment’s products are subject to competition in technological innovation, price, convenience of use, service, instrument warranty provisions, product performance, laboratory efficiency, long-term supply contracts, and product potential for overall cost-effectiveness and productivity gains. Some products in this segment can be subject to rapid product obsolescence or regulatory changes. Although Abbott has benefited from technological advantages of certain of its current products, these advantages may be reduced or eliminated as competitors introduce new products.\nNutritional Products\nThese products include a broad line of pediatric and adult nutritional products manufactured, marketed, and sold worldwide. These products are generally marketed and sold directly to consumers and to institutions, wholesalers, retailers, healthcare facilities, government agencies, and third-party distributors from Abbott-owned distribution centers or third-party distributors.\nThe principal products included in the Nutritional Products segment are:\nvarious forms of infant formula and follow-on formula, including Similac\n, Similac Pro-Advance\n, Similac 360 Total Care\nSensitive, Similac Sensitive\n, Go & Grow by Similac\n, Similac Total Comfort\nadult and other pediatric nutritional products, including Ensure\nHigh Protein, Glucerna\n, Glucerna Hunger Smart\n, ProSure™, PediaSure\n, PediaSure SideKicks\n, Abound™, and Pedialyte\nnutritional products used in enteral feeding in healthcare institutions, including Jevity\n, Freego™ (Enteral Pump) and Freego™ sets, Nepro\nPrimary marketing efforts for nutritional products are directed toward consumers or physicians or other healthcare professionals. In addition, nutritional products are also promoted directly to the public by consumer marketing efforts in markets where permitted.\nCompetition for nutritional products in the segment is generally from other diversified consumer and healthcare manufacturers. Competitive factors include consumer advertising, formulation, packaging, scientific innovation, price, retail distribution, and availability of product forms. A significant aspect of competition is the search for ingredient innovations. The introduction of new products by competitors, changes in medical practices and procedures, and regulatory changes can result in product obsolescence. In addition, private label and local manufacturers’ products may increase competitive pressure.\nThese products include a broad line of rhythm management, electrophysiology, heart failure, vascular and structural heart devices for the treatment of cardiovascular diseases, and diabetes care and continuous glucose monitoring products, as well as neuromodulation devices for the management of chronic pain and movement disorders. Medical devices are manufactured, marketed and sold worldwide. In the United States, depending upon the product, medical devices are generally marketed and sold directly to wholesalers, hospitals, ambulatory surgery centers, physicians’ offices, consumers, and distributors from Abbott-owned distribution centers, public warehouses or third party distributors. Outside the United States, sales are made either directly to customers or through distributors, depending on the market served.\nThe principal products included in the Medical Devices segment are:\nrhythm management products, including Assurity MRI\npacemaker systems, and Aveir\nsingle-chamber (VR and AR) and Aveir\ndual chamber (DR) leadless pacemaker systems; Ellipse\nimplantable cardioverter defibrillators and Gallant and Quadra Assura MP\nimplantable cardioverter defibrillator with cardiac resynchronization therapy and MultiPoint™ Pacing technology; and Confirm Rx\nimplantable cardiac monitors;\nelectrophysiology products, including the TactiFlex\nfamilies of ablation catheters, and FlexAbility\nirrigated ablation catheters; EnSite\nfamily of cardiac mapping systems; Agilis\nNxT and Swartz™ introducer catheters; the Advisor\nHD Grid mapping catheter; and ViewFlex\nfamily of intracardiac echocardiography catheters;\nheart failure related products, including the HeartMate\nleft ventricular assist device family; the CardioMEMS\nHF System pulmonary artery sensor, a heart failure monitoring system; the CentriMag\nSystem, an acute mechanical circulatory support system; and patient self-testing products and services;\nvascular products, including the XIENCE\nfamily of drug-eluting coronary stent systems developed on the Multi-Link Vision\nplatform; StarClose SE\nand Perclose ProStyle\nvessel closure devices, TREK\ncoronary balloon dilatation products, Hi-Torque Balance Middleweight Universal II\nPeripheral Stent System, a peripheral vascular stent system; Acculink\n, carotid stent systems; the OPTIS\nintegrated systems with Ultreon\n1.0 and 2.0 Software, compatible with the Dragonfly OPTIS\nimaging catheters and PressureWire\nfractional flow reserve measurement systems; Diamondback 360\ncoronary and peripheral orbital atherectomy systems; and Esprit™ BTK everolimus eluting resorbable scaffold system;\nstructural heart products, including MitraClip\n, a mitral valve transcatheter edge-to-edge repair system; TriClip\n, a tricuspid valve transcatheter edge-to-edge repair system; Epic\n, a surgical family of aortic valve and mitral valve replacement devices; Portico\ntranscatheter aortic heart valves; Regent™ and Masters Series\nmechanical heart valves; Amplatzer\nPFO occluders; Amplatzer Amulet\noccluder devices; and the Tendyne\ntranscatheter mitral valve replacement system;\ncontinuous glucose and blood glucose monitoring systems under the FreeStyle\nbrand such as the FreeStyle Libre\nsystem, including sensors, data management decision software, test strips, and accessories for people with diabetes; and the Lingo\ncontinuous glucose monitoring system, including sensors and data management decision software for people’s health and wellness; and\nneuromodulation products, including spinal cord stimulators Proclaim\nXR recharge-free implantable pulse generators (IPG) and rechargeable Eterna\nIPG, each with BurstDR\nstimulation, and Proclaim\nDRG IPG, a neurostimulation device designed for dorsal root ganglion therapy, for the treatment of chronic pain disorders; and the non-rechargeable Infinity™ deep brain stimulation (DBS) system and the rechargeable Liberta RC™ DBS system, each with directional lead technology for the treatment of movem",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nAbbott’s revenues are derived primarily from the sale of a broad line of health care products, which include medical devices, diagnostic testing products, nutritional products and branded generic pharmaceuticals. These products are sold under short-term receivable arrangements. Patent protection and licenses, technological and performance features, and inclusion of Abbott’s products under a contract most impact which products are sold; price controls, competition and rebates most impact the net selling prices of products; and the measurement of net sales and costs is impacted by foreign currency translation. Sales in international markets comprise 61 percent of consolidated net sales.\nAbbott’s sales growth in 2024 was primarily driven by the Medical Devices, Established Pharmaceutical and Nutritional businesses. The growth is the result of a productive research and development (R&D) pipeline and a combination of the introduction of new products and indication expansions across various businesses. Sales growth was negatively impacted by continued year-over-year decline in COVID-19 testing-related sales, as the COVID-19 pandemic shifted to an endemic state. In 2024, 2023 and 2022, Abbott’s COVID-19 testing related sales total $747 million, $1.6 billion and $8.4 billion, respectively. Sales in emerging markets, which represent approximately 37 percent of total company sales, increased 8.2 percent in 2024 and 5.4 percent in 2023, excluding the impact of foreign exchange. (Emerging markets include all countries, except the United States, Japan, Canada, Australia, New Zealand, the United Kingdom and Western European countries.)\nAbbott’s operating margin profile increased in 2024 to 16.3 percent from 16.2 percent in 2023. The increase in 2024 reflects the favorable impact of margin improvement initiatives, partially offset by foreign exchange and inflation. In 2022, operating margin as a percentage of sales was 19.2 percent. The decrease in 2023 from 2022 reflects the unfavorable effects of lower COVID-19 testing-related sales, foreign exchange, and higher costs for various manufacturing inputs. In 2023, these unfavorable effects were partially offset by the favorable impact of margin improvement initiatives.\nWith respect to the performance of each reportable segment over the last three years, sales in the Medical Devices segment, excluding the impact of foreign exchange, increased 13.7 percent in 2024 and 15.1 percent in 2023. In Medical Devices, sales in 2024 and 2023 increased across all businesses, with double-digit growth in Diabetes Care, Structural Heart, Electrophysiology, and Heart Failure. In 2023, Neuromodulation sales also increased double digits. Growth was led by Diabetes Care where sales of Abbott's continuous glucose monitoring (CGM) systems continued to increase and totaled $6.4 billion in 2024 and $5.3 billion in 2023.\nIn 2024, key product approvals in the Medical Devices segment included:\nU.S. Food and Drug Administration (FDA) clearance for two new over-the-counter CGM systems, Lingo\nand Libre Rio™, which are based on Abbott's FreeStyle Libre\nFDA approval of the Esprit™ below-the-knee (BTK) system, which is designed to keep arteries open in people living with peripheral artery disease and deliver a drug to support vessel healing prior to completely dissolving,\nFDA approval of TriClip\n, which provides a minimally invasive treatment option for patients with tricuspid regurgitation, or a leaky tricuspid heart valve,\nCE Mark for the Aveir\ndual chamber (DR) leadless pacemaker system, which is the world's first dual chamber leadless pacemaker system that treats people with abnormal or slow heart rhythms, and\nFDA clearance for Advisor\nHD Grid X Mapping Catheter, Sensor Enabled™, which will further support mapping of both pulsed field ablation (PFA) and radiofrequency (RF) ablation cases.\nOperating earnings for the Medical Devices segment increased 16.0 percent in 2024 and 19.6 percent in 2023. The operating margin profile for the Medical Devices segment increased from 30.0 percent in 2022 to 31.4 percent in 2023 and then increased to 32.4 percent in 2024. The increase in 2024 from 2022 reflects the impact of higher sales volumes across the Medical Devices businesses.\nIn Abbott’s Diagnostics segment, sales decreased 3.9 percent in 2024 and 38.2 percent in 2023, excluding the impact of foreign exchange. The 2024 and 2023 sales decreases were driven by continued lower demand for the company's portfolio of COVID-19 tests, partially offset by higher volume of routine diagnostic tests in the Rapid Diagnostics and Core Laboratory businesses and the continued deployment of Abbott's Alinity\ntesting platform. Abbott continues to build out its test menu for the Alinity testing platform. In the first quarter of 2024, Abbott received FDA clearance of its i-STAT™ traumatic brain injury (TBI) cartridge for use with the i-STAT Alinity instrument, a whole blood point-of-care test to help assess mild TBI. In the fourth quarter of 2023, Abbott received FDA approval of its new laboratory automation system, GLP systems Track™, to help laboratories optimize lab performance by consolidating multiple analytical instruments into a unified workflow.\nIn 2024, operating earnings for the Diagnostics segment decreased 14.8 percent. The operating margin profile decreased from 40.3 percent in 2022 to 22.2 percent in 2024 primarily due to lower demand for Abbott's COVID-19 tests.\nIn Abbott’s Nutritional Products segment, total pediatric nutrition sales, excluding the impact of foreign exchange, increased 3.7 percent in 2024 and 14.8 percent in 2023, which includes market share recovery in the U.S. infant formula business following the voluntary recall of certain products in 2022, as discussed below, and the continued favorable impact of price increase initiatives. Excluding the impact of foreign exchange, total adult nutrition sales increased 8.0 percent in 2024 and 8.8 percent in 2023, led by the continued growth of Abbott's Ensure\nproducts. U.S. Adult Nutritionals sales were partially offset by the discontinuation of the ZonePerfect\nIn 2024, operating earnings for the Nutritional Products segment increased 12.9 percent compared to 2023. Operating margin profile for this segment increased from 9.5 percent in 2022 to 16.4 percent in 2023 and then increased to 17.9 percent in 2024. The increase in 2024 reflects the favorable effects of higher sales, the favorable impact of price increases and a continued focus on margin improvement initiatives. The increase in 2023 reflects the favorable effects of higher sales and a continued focus on margin improvement initiatives, partially offset by higher commodity and other costs.\nIn February 2022, Abbott’s U.S. Pediatric Nutrition business was impacted by a voluntary recall of certain infant powder formula products manufactured at its facility in Sturgis, Michigan, at which time the company temporarily stopped operations at that facility. Abbott took various actions to mitigate the impact of the recall on the supply of formula in the U.S. Abbott resumed operations later in 2022 and made significant progress through 2023 to increase production of infant formula in the U.S and recover market share. Beginning in the fourth quarter of 2023 and through 2024, Abbott has regained and maintained its market-leading position in the U.S., as measured on a volume basis.\nThe Established Pharmaceutical Products segment focuses on the sale of its products in emerging markets. Excluding the impact of foreign exchange, Established Pharmaceutical sales increased 9.2 percent in 2024 and 10.9 percent in 2023. The sales increase in 2024 was led by higher revenue in several countries in Latin America, Southeast Asia and the Middle East and across several therapeutic areas, including respiratory, gastroenterology, cardiometabolic and central nervous system/pain management. The sales increase in 2023 reflects higher sales in several geographies including India, Vietnam, and Brazil. In 2024, operating earnings for the Established Pharmaceutical Products segment increased 2.2 percent. Operating margin profile increased from 21.4 percent in 2022 to 23.7 percent in 2024 primarily due to the impact of margin improvement initiatives and higher sales, partially offset by inflation on various product inputs.\nWith respect to Abbott’s financial position, at December 31, 2024 and 2023, Abbott’s cash and cash equivalents and short-term investments total approximately $8.0 billion and $7.3 billion, respectively. Abbott’s long-term debt totals $14.1 billion and $14.7 billion at December 31, 2024 and 2023, respectively.\nAbbott declared dividends of\nper share in 2024 and $2.08 per share in 2023, an increase of\n. Dividends paid totaled $\nin 2023. The year-over-year change in the amount of dividends paid reflects the increase in the dividend rate. In December 2024, Abbott increased the company’s quarterly dividend by\nto $0.59 per share from $0.55 per share, effective with the dividend paid in February 2025. In December 2023, Abbott increased the company’s quarterly dividend by\nto $0.55 per share from $0.51 per share, effective with the dividend paid in February 2024.\nOn September 22, 2023, Abbott completed the acquisition of Bigfoot Biomedical, Inc. (Bigfoot)\nAbbott's efforts to develop connected solutions for making diabetes management more personal and precise. On April 27, 2023, Abbott completed the acquisition of Cardiovascular Systems, Inc. (CSI). CSI's atherectomy system, which is used in treating peripheral and coronary artery disease, adds complementary technologies to Abbott's portfolio of vascular device offerings.\nIn 2025, Abbott will focus on continuing to invest in product development areas that provide the opportunity for strong sustainable growth over the next several years. In its diagnostics business, Abbott's focus will include driving sales growth from its Alinity suite of diagnostics instruments along with GLP track integration and its portfolio of rapid diagnostic testing systems. In the medical devices business, Abbott will focus on growing recently launched new products and expanding its market position across the various businesses. In its nutritional business, Abbott will continue to focus on driving growth globally and further enhancing its portfolio with the introduction of science-based products and line extensions. In the established pharmaceuticals business, Abbott will continue to focus on growing its business with the depth and breadth of its portfolio in emerging markets.\nCritical Accounting Policies\n— In 2024, 48 percent of Abbott’s consolidated gross revenues were subject to various forms of rebates and allowances that Abbott recorded as reductions of revenues at the time of sale. Most of these rebates and allowances in 2024 are in the Nutritional Products and Diabetes Care businesses. Abbott provides rebates to state agencies that administer the Special Supplemental Nutrition Program for Women, Infants, and Children (WIC), wholesalers, group purchasing organizations, and other government agencies and private entities. Rebate amounts are usually based upon the volume of purchases using contractual or statutory prices for a product. Factors used in the rebate calculations include the identification of which products have been sold subject to a rebate, which customer or government agency price terms apply, and the estimated lag time between sale and payment of a rebate. Using historical trends, adjusted for current changes, Abbott estimates the amount of the rebate that will be paid, and records the liability as a reduction of gross sales when Abbott records its sale of the product. Settlement of the rebate gener\nally occurs from one to six months after sale. Abbott regularly analyzes the historical rebate trends and makes adjustments to reserves for changes in trends and terms of rebate programs. Rebates and chargebacks charged against gross sales in 2024, 2023, and 2022 amounted to $4.4 billion in 2024 and $3.9 billion in 2023 and 2022, or 18.6 percent, 17.4 percent, and 17.6 percent of gross sales, respectively, based on gross sales of approximately $23.5 billion, $22.7 billion, and $22.4 billion, respectively, subject to rebate. A one-percentage point increase in the percentage of rebates to related gross sales would decrease net sales by approximately $235 million in 2024. Abbott considers a one-percentage point increase to be a reasonably likely increase in the percentage of rebates to related gross sales. Other allowances charged against gross sales were approximately $319 million, $263 million, and $280 million for cash discounts in 2024, 2023, and 2022, respectively, and $211 million, $169 million, and $379 million for returns in 2024, 2023, and 2022, respectively. Cash discounts are known within 15 to 30 days of sale, and therefore can be reliably estimated. Returns can be reliably estimated be\ncause Abbott’s historical returns are low, and because sales returns terms and other sales terms have remained relatively unchanged for several periods.\nManagement analyzes the adequacy of ending rebate accrual balances each quarter. In the domestic nutritional business, management uses both internal and external data available to estimate the accruals. In the WIC business, estimates are required for the amount of WIC sales within each state where Abbott holds the WIC contract. The state where the sale is made, which is the determining factor for the applicable rebated price, is reliably determinable. Rebated prices are based on contractually obligated agreements generally lasting a period of two to four years. Except for a change in contract price or a transition period before or after a change in the supplier for the WIC business in a state, accruals are based on historical redemption rates and data from the U.S. Department of Agriculture (USDA) and the states submitting rebate claims. The USDA, which administers the WIC program, has been making its data available for many years. Management also estimates the states' processing lag time based on sales and claims data. Management has access to several large customers' inventory management data, which allows management to make reliable estimates of inventory in the retail distribution channel. At December 31, 2024, Abbott had WIC business in 42 states.\nHistorically, adjustments to prior years’ rebate accruals have not been material to net earnings. Abbott employs various techniques to verify the accuracy of claims submitted to it, and where possible, works with the organizations submitting claims to gain insight into changes that might affect the rebate amounts. For government agency programs, the calculation of a rebate involves interpretations of relevant regulations, which are subject to challenge or change in interpretation.\n\nincrease in 2024, excluding the impact of foreign exchange, was primarily due to higher vessel closure sales. In 2023, the 9.3 percent increase, excluding the impact of foreign exchange, was primarily due to the acquisition of CSI in April 2023.\nAbbott’s operations in Russia and Ukraine represent approximately 2 percent of Abbott’s total revenues and net assets, and to date the financial impact of Russia’s invasion of Ukraine has not been material to Abbott’s operations or financial condition. Future implications are difficult to predict, but at present Abbott does not anticipate that the Russia-Ukraine conflict will have a material impact on its operations or financial condition. A more detailed discussion of the risks associated with the Russia-Ukraine conflict is contained in Item 1A. Risk Factors.\nThe expiration of licenses and patent protection can affect the future revenues and operating income of Abbott. There are no significant patent or license expirations in the next three years that are expected to materially",
  "item2_clean": null
}