{
  "source_file": "acgl-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "as we lean into the strength of our brand, including underwriting discipline, a longer term view of risk, and use risk-based pricing tools to generate profitable business.\nOur insurance segment reported $129 million of underwriting income for the 2025 third quarter, with net premium written nearly $2 billion, which is an increase of 7.3% from the 2024 third quarter. Growth in net premiums written primarily resulted from the U.S MidCorp and Entertainment Insurance businesses acquired from Allianz on August 1, 2024 (“MCE Acquisition”). The acquired business provides a significant platform from which we intend to build further scale in the middle market sector. We saw selective growth in our North American other liability occurrence business of 17%, supported by middle market and double-digit rate increases in E&S casualty.\nNet premiums written in our North American property and short-tail book increased 15%, where growth in middle market admitted property more than offset declines in E&S property. International premium volume remained stable, as the Lloyd’s and London market businesses are experiencing increased, but rational, competition. Our long-term investment in establishing a leadership position at Lloyd’s continues to yield strong results reflected in favorable signings and our ability to attract top-tier underwriting talent.\nOur reinsurance segment contributed $482 million of underwriting income in the 2025 third quarter. Net premiums written were $1.7 billion, down roughly 11% when compared to 2024 third quarter, reflecting current pricing conditions in short-tail and property catastrophe lines and increased retentions by cedants. We are growing selectively and focusing on areas where margins are attractive. We continue to like our prospects in most lines of business and, with improving conditions in casualty lines, our agility and ability to create opportunities is an advantage for us in this market. Our diversified reinsurance platform, supported by strong partnerships with our brokers and ceding companies across multiple lines and geographies, further enhances our ability to navigate a competitive environment.\nOur mortgage segment continued to deliver a steady level of earnings, generating $260 million of underwriting income in the 2025 third quarter. While new originations remained modest due to affordability challenges, underlying fundamentals remained strong and our U.S. market share was stable as industry pricing discipline held. The persistency of our in force U.S. primary mortgage insurance portfolio remained a healthy 82.3% and our delinquency rate remained low. We continue to expect the mortgage segment to serve as a steady diversifying contributor to our overall earnings and generate attractive underwriting income given the high credit quality and embedded equity of our in-force portfolio.\nARCH CAPITAL\nFINANCIAL MEASURES\nManagement uses the following three key financial indicators in evaluating our performance and measuring the overall growth in value generated for Arch Capital’s common shareholders:\nBook Value per Share\nBook value per share represents total common shareholders’ equity available to Arch divided by the number of common shares outstanding. Management uses growth in book value per share as a key measure of the value generated for our common shareholders each period and believes that book value per share is the key driver of Arch Capital’s share price over time. Book value per share is impacted by, among other factors, our underwriting results, investment returns and share repurchase activity, which has an accretive or dilutive impact on book value per share depending on the purchase price. Book value per share was $62.32 at September 30, 2025, compared to $59.17 at June 30, 2025, and $57.00 at September 30, 2024. The 5.3% increase in book value per share for the 2025 third quarter primarily reflected strong underwriting and investment returns.\nOperating Return on Average Common Equity\nOperating return on average common equity (“Operating ROAE”) represents annualized after-tax operating income available to Arch common shareholders divided by the average of beginning and ending common shareholders’ equity available to Arch during the period. After-tax operating income available to Arch common shareholders, a non-GAAP financial measure as defined in Regulation G, represents net income available to Arch common shareholders, excluding net realized gains or losses (which includes realized and unrealized changes in the fair value of equity securities and assets accounted for using the fair value option, realized and unrealized gains or losses on derivative instruments, changes in the allowance for credit losses on financial assets and gains or losses realized from the acquisition or disposition of subsidiaries), equity in net income or loss of investments accounted for using the equity method, net foreign exchange gains or losses, transaction costs and other and income taxes. Management uses Operating ROAE as a key measure of the return generated to common shareholders. See\n“Comment on Non-GAAP Financial Measures.”\nOur annualized net income return on average common equity was 23.8% for the 2025 third quarter, compared to 19.0% for the 2024 third quarter, and 19.5% for the nine months ended September 30, 2025, compared to 22.9% for the 2024 period. Our Operating ROAE was 18.5% for the 2025 third quarter, compared to 14.8% for the 2024 third quarter and 16.2% for the nine months ended September 30, 2025, compared to 18.3% for the 2024 period. Returns for the 2025 periods reflected strong underwriting and investment returns.\nTotal Return on Investments\nTotal return on investments, a non-GAAP financial measure as defined in Regulation G, includes investment income, equity in net income or loss of investments accounted for using the equity method, net realized gains or losses attributable to the investment portfolio and the change in unrealized gains or losses generated by Arch’s investment portfolio. Total return is calculated on a pre-tax basis and before investment expenses and reflects the effect of financial market conditions along with foreign currency fluctuations. In addition, total return incorporates the timing of investment returns during the periods. The following table summarizes our total return compared to the benchmark return against which we measured our portfolio during the periods. See\n“Comment on Non-GAAP Financial Measures.”\nPre-tax total return (before investment expenses):\nNine Months Ended September 30, 2025\nNine Months Ended September 30, 2024\nTotal return for the 2025 periods reflected the effects of lower bond yields, a weaker U.S. dollar and equity market returns. The portfolio slightly underperformed their benchmark returns, primarily due to the sale of certain alternative investments accounted for using the equity method. The allocation of our portfolio remained neutral relative to our targeted benchmark. We continue to maintain a relatively short duration on our fixed income portfolio of 3.24 years at September 30, 2025, compared to 3.31 years at December 31, 2024.\nThe benchmark return index is a customized combination of indices intended to approximate a target portfolio by asset mix and average credit quality with a fixed income component matching the approximate estimated duration and currency mix of our insurance and reinsurance liabilities. It is recalibrated annually. Although the estimated fixed income duration and average credit quality of this index will move as the duration and rating of its constituent securities\nARCH CAPITAL\nchange, generally we do not adjust the composition of the benchmark return index during the year except to incorporate changes to the mix of liability currencies and durations noted above. The benchmark return index should not be interpreted as expressing a preference for or aversion to any particular sector or sector weight. At September 30, 2025, the fixed income portion of the benchmark had an average credit quality of “A1” by Moody’s and an estimated fixed income duration of 3.18 years.\nThe benchmark return index included weightings to the following indices:\nICE BofA 1-10 Year U.S. Corporate Index\nYield on 3-5 Year U.S. Treasury Index plus 6%\nICE BofA 1-10 Year U.S. Treasury Index\nICE BofA 0-3 Month U.S. Treasury Index\nJPM CLOIE Investment Grade\nICE BofA 1-5 Year U.K. Gilt Index\nICE BofA U.S. High Yield Constrained Index\nICE BofA U.S. ABS & CMBS Index\nS&P 500 Total Return Index\nICE BofA 3-5 Year US Agency CMO Excluding IO & PO Index\nICE BofA German Government 1-5 Year Index\nICE BofA German Government 5-7 Year Index\nICE BofA 1-5 Year Canada Government Index\nICE BofA 15+ Year Canada Government Index\nICE BofA 1-5 Year Australia Government Index\nICE BofA 5-10 Year Australia Government Index\nICE BofA 1-5 Year Japan Government Index\nCOMMENT ON NON-GAAP FINANCIAL MEASURES\nThroughout this filing, we present our operations in the way we believe will be the most meaningful and useful to investors, analysts, rating agencies and others who use our financial information in evaluating the performance of our company. This presentation includes the use of after-tax operating income available to Arch common shareholders, which is defined as net income available to Arch common shareholders, excluding net realized gains or losses (which includes realized and unrealized changes in the fair value of equity securities and assets accounted for using the fair value option, realized and unrealized gains or losses on derivative instruments, changes in the allowance for credit losses on financial assets and gains or losses realized from the acquisition or disposition of subsidiaries), equity in net income or loss of investments accounted for using the equity method, net foreign exchange gains or losses, transaction costs and other, income taxes, and the use of annualized operating return on average common equity. The presentation of after-tax opera"
}