{
  "source_file": "acn-20250531.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nWe use the terms “Accenture,” “we,” “our” and “us” in this report to refer to Accenture plc and its subsidiaries. All references to years, unless otherwise noted, refer to our fiscal year, which ends on August 31. For example, a reference to “fiscal 2025” means the 12-month period that will end on August 31, 2025. All references to quarters, unless otherwise noted, refer to the quarters of our fiscal year.\nWe use the term “in local currency” so that certain financial results may be viewed without the impact of foreign currency exchange rate fluctuations, thereby facilitating period-to-period comparisons of business performance. Financial results “in local currency” are calculated by restating current period activity into U.S. dollars using the comparable prior year period’s foreign currency exchange rates. This approach is used for all results where the functional currency is not the U.S. dollar.\nDisclosure Regarding Forward-Looking Statements\nited to those identified below.\nOur results of operations have been, and may in the future be, adversely affected by volatile, negative or uncertain economic and geopolitical conditions and the effects of these conditions on our clients’ businesses and levels of business activity.\nOur business depends on generating and maintaining client demand for our services and solutions, including through the adaptation and expansion of our services and solutions in response to ongoing changes in technology and offerings, and a significant reduction in such demand or an inability to respond to the evolving technological environment could materially affect our results of operations.\nRisks and uncertainties related to the development and use of AI could harm our business, damage our reputation or give rise to legal or regulatory action.\nIf we are unable to match people and their skills with client demand around the world and attract and retain professionals with strong leadership skills, our business, the utilization rate of our professionals and our results of operations may be materially adversely affected.\nWe face legal, reputational and financial risks from any failure to protect client and/or Accenture data from security incidents or cyberattacks.\nThe markets in which we operate are highly competitive, and we might not be able to compete effectively.\nOur ability to attract and retain business and employees may depend on our reputation in the marketplace.\nIf we do not successfully manage and develop our relationships with key ecosystem partners or if we fail to anticipate and establish new alliances in new technologies, our results of operations could be adversely affected.\nACCENTURE\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nOur profitability could materially suffer due to pricing pressure, if we are unable to remain competitive, if our cost-management strategies are unsuccessful or if we experience delivery inefficiencies or fail to satisfy certain agreed-upon targets or specific service levels.\nChanges in our level of taxes, as well as audits, investigations and tax proceedings, or changes in tax laws or in their interpretation or enforcement, could have a material adverse effect on our effective tax rate, results of operations, cash flows and financial condition.\nOur results of operations could be materially adversely affected by fluctuations in foreign currency exchange rates.\nOur debt obligations could adversely affect our business and financial condition.\nChanges to accounting standards or in the estimates and assumptions we make in connection with the preparation of our consolidated financial statements could adversely affect our financial results.\nAs a result of our geographically diverse operations and our strategy to continue to grow in our key markets around the world, we are more susceptible to certain risks.\nIf we are unable to manage the organizational challenges associated with our size, we might be unable to achieve our business objectives.\nWe might not be successful at acquiring, investing in or integrating businesses, entering into joint ventures or divesting businesses.\nLegal and Regulatory Risks\nOur business could be materially adversely affected if we incur legal liability.\nOur work with government clients exposes us to additional risks inherent in the government contracting environment.\nOur global operations expose us to numerous and sometimes conflicting legal and regulatory requirements, and violation of these regulations could harm our business.\nIf we are unable to protect or enforce our intellectual property rights, or if our services or solutions infringe upon the intellectual property rights of others or we lose our ability to utilize the intellectual property of others, our business could be adversely affected.\nWe are incorporated in Ireland and Irish law differs from the laws in effect in the United States and might afford less protection to our shareholders. We may also be subject to criticism and negative publicity related to our incorporation in Ireland.\nACCENTURE\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nAccenture is a leading global professional services company, providing a broad range of services and solutions across Strategy & Consulting, Technology, Operations, Industry X and Song. We serve clients in three geographic markets: the Americas, EMEA (Europe, Middle East and Africa) and Asia Pacific. We combine our strength in technology and leadership in cloud, data and AI with unmatched industry experience, functional expertise and global delivery capability to help the world’s leading businesses, governments and other organizations build their digital core, optimize their operations, accelerate revenue growth and enhance citizen services—creating tangible value at speed and scale.\nOur results of operations are affected by economic conditions, including macroeconomic conditions, the overall inflationary environment and levels of business confidence. We continue to see significant economic and geopolitical uncertainty in many markets around the world, which has impacted and may continue to impact our business. These conditions have slowed the pace and level of client spending, particularly for smaller contracts with a shorter duration and for our consulting services. Clients continue to prioritize large-scale transformations, which convert to revenue over a longer period.\nIn addition, the U.S. administration is seeking to reduce federal spending and the size of the federal workforce under the guidance of the Department of Government Efficiency. We are seeing some impact from these efforts in our federal government business, including delays in new procurements, reductions in price and contract scope, and contract terminations. These changes have not had a material impact on our results of operations or financial condition.\nKey metrics for the third quarter of fiscal 2025 compared to the third quarter of fiscal 2024 are included below. We have presented operating income, operating margin, effective tax rate and diluted earnings per share for the third quarter of fiscal 2024 on a non-GAAP or “adjusted” basis to exclude the impact of $77 million in business optimization costs recorded during the quarter, as discussed further in our Results of Operations.\nRevenues of $17.7 billion,\nan increase of 8% in U.S. dollars and\n\nWe provide information regarding our new bookings, which include new contracts, including those acquired through acquisitions, as well as renewals, extensions and changes to existing contracts, because we believe doing so provides useful trend information regarding changes in the volume of our new business over time. New bookings can vary significantly quarter to quarter depending in part on the timing of the signing of a small number of large managed services contracts. The types of services and solutions clients are demanding and the pace and level of their spending may impact the conversion of new bookings to revenues. For example, managed services bookings, which are typically for multi-year contracts, generally convert to revenue over a longer period of time compared to consulting bookings.\nInformation regarding our new bookings is not comparable to, nor should it be substituted for, an analysis of our revenues over time. New bookings involve estimates and judgments. There are no third-party standards or requirements governing the calculation of bookings. We do not update our new bookings for material subsequent terminations or reductions related to bookings originally recorded in prior fiscal years. New bookings are recorded using then-existing foreign currency exchange rates and are not subsequently adjusted for foreign currency exchange rate fluctuations.\nThe majority of our contracts are terminable by the client on short notice with little or no termination penalties, and some without notice. Only the non-cancelable portion of these contracts is included in our remaining performance obligations disclosed in Note 2 (Revenues) to our Consolidated Financial Statements under Item 1, “Financial Statements.” Accordingly, a significant portion of what we consider contract bookings is not included in our remaining performance obligations.\nACCENTURE\nItem 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nResults of Operations for the Three and Nine Months Ended May 31, 2025 Compared to the Three and Nine Months Ended May 31, 2024\nRevenues by geographic market, industry group and type of work are as follows:\n\n7% in local currency;\nNew bookings of $19.7 billion,\na decrease of 6% in U.S. dollars and 7% in local currency;\nOperating margin of 16.8%,\ncompared to operating margin of 16.0% and adjusted operating margi"
}