{
  "source_file": "adbe-20241129.htm",
  "form_type": "10-K",
  "item1_clean": "ITEM 1. BUSINESS\nOVERVIEW\nAdobe is a global technology company with a mission to change the world through personalized digital experiences. For over four decades, Adobe’s innovations have transformed how individuals, teams, businesses, enterprises, institutions, and governments engage and interact across all types of media. Our products, services and solutions are used around the world to imagine, create, manage, deliver, measure, optimize and engage with content across surfaces and fuel digital experiences. We have a diverse user base that includes consumers, communicators, creative professionals, developers, students, small and medium businesses and enterprises. We are also empowering creators by putting the power of artificial intelligence (“AI”) in their hands, and doing so in ways we believe are responsible. Our products and services help unleash creativity, accelerate document productivity and power businesses in a digital world.\nOFFERINGS\nWe deliver a wide range of products, services and solutions to empower our customers and users to imagine and express ideas, create content and bring any digital experience to life. We focus our strategic investments in two areas of growth:\nWe provide products, services and solutions that enable individuals, teams, businesses, enterprises, institutions, and governments to create, publish and promote their content anywhere, and accelerate their productivity by transforming how they view, share, engage with and collaborate on documents and content creation. Our Digital Media segment is centered around Adobe Creative Cloud and Adobe Document Cloud, which include Adobe Photoshop, Adobe Illustrator, Adobe Lightroom, Adobe Premiere Pro, Adobe Acrobat, Adobe Acrobat Sign, Adobe Express, Adobe Firefly and many more products, offering a variety of tools for creative professionals (like photographers, graphic designers, video editors and game developers), communicators and other consumers. This is the core of what we have delivered to customers and users for decades, and we have continually evolved and expanded our Digital Media business model to provide our customers and users with a range of flexible solutions to help them reach their full creative potential.\nWe provide an integrated platform and set of products, services and solutions through Adobe Experience Cloud that enable businesses to create, manage, execute, measure, monetize and optimize customer experiences. Our customers include marketers, advertisers, agencies, publishers, merchandisers, merchants, web analysts, data scientists, developers and executives across the C-suite. The foundation of our offering is Adobe Experience Platform, which provides businesses with an open and extensible system for customer experience management that transforms customer data into robust customer profiles that update in real time and uses insights to deliver personalized digital experiences across various channels.\nWe offer a comprehensive suite of products, services and solutions to our customers in our Digital Media business and Digital Experience business. With Adobe GenStudio, our cross-cloud, end-to-end solution that packages offerings across Digital Experience and Digital Media, enterprises can automate, optimize and accelerate their content supply chains for\nmarketing campaigns and personalized customer experiences. We believe we are well positioned to deliver value in both the Digital Media and Digital Experience strategic areas where our mission to change the world through personalized digital experiences has never been more relevant as people seek new ways to create, collaborate and communicate and businesses continue to invest in digital transformation.\nSEGMENTS\nOur business is organized into three reportable segments:\nDigital Experience; and\nPublishing and Advertising.\nThese segments provide Adobe’s senior management with a comprehensive financial view of our key businesses. Our segments are aligned around our two strategic growth opportunities further described below, and our legacy products, services and solutions are contained within the third segment, Publishing and Advertising.\nMARKET OVERVIEW\nThis overview provides an explanation of our markets and a discussion of strategic opportunities in fiscal 2025 and beyond for each of our segments.\nSee the section titled\n“Results of Operations” in Part II, Item 7 titled “Management’s Discussion and Analysis of Financial Condition and Results of Operations”\nNote 2 of our Notes to Consolidated Financial Statement\nof this report for further segment information.\nIn today’s digital world, content and digital documents are fueling the global economy, and productivity, design and creativity have never been more relevant, providing a significant market opportunity for Adobe in digital media. Everyone has a story to tell and needs products and services at their fingertips to tell those stories on an ever-increasing number of canvases. AI- and generative AI-powered technologies are increasing this opportunity by growing the demand for and production of content. This shift is changing how creative professionals work by accelerating their processes, increasing their productivity, and allowing them to explore and create in new fields, while empowering new creators by dramatically lowering barriers to creativity. At the same time, creativity is increasingly a team effort that is redefining productivity, making quick and easy collaboration even more critical to every company’s success. Adobe is driving innovation to shape these trends, democratize creativity, empower individuals to create wherever inspiration strikes and enable more effective collaboration between creators and stakeholders.\nThe flagship of our Digital Media business is Adobe Creative Cloud, a subscription service that allows subscribers to use our creative products and applications (“Apps”) integrated with cloud-delivered services across various surfaces and platforms. We believe in creativity for all, and Creative Cloud addresses the needs of all content creators, from creative professionals, such as artists, designers, developers, students, and administrators, to knowledge workers, marketers, educators, enthusiasts, communicators, and consumers. Our customers rely on our products for content creation, photo editing, design, video and animation production, mobile App and gaming development, and more. Our customers can choose between products optimized for different platforms and capabilities, from the speed and ease of use offered by Adobe Express, our AI-first, task-based web and mobile App, to the greater power and precision of our flagship Creative Cloud Apps. We believe we have significant opportunities to grow our Digital Media business by advancing every creative category across all surfaces; expanding content-first, task-based creativity with Adobe Express; enabling seamless collaboration across all stakeholders; inspiring the creative community through sharing and monetization; and expanding the user base of our tools through the infusion of AI into our products, services and solutions to enable users of any skill level to easily and efficiently create content.\nOur Digital Media segment includes our Adobe Document Cloud business, a unified, cloud-based document services platform that integrates Adobe’s pioneering PDF technology with our Adobe Acrobat, Adobe Scan and Adobe Acrobat Sign Apps to deliver fully digital document workflows across all surfaces. We have the opportunity to continue to accelerate document productivity with Adobe Document Cloud and transform how people view, share, collaborate, and engage with documents. Trillions of PDF documents are created every year, reflecting the important role PDF plays globally. There are hundreds of millions of users who engage with PDF files on a daily basis in industries such as legal, financial services, and publishing, as well as a broad array of communicators and Adobe Acrobat Reader customers who use the expanded capabilities provided by our Acrobat Apps and the document services platform in Adobe Document Cloud.\nOur goal for our Digital Media business is to be a leading platform for creativity and digital document solutions, where we offer a range of products and services that allow anyone to design and deliver content seamlessly. We aim to achieve this goal by using data-driven customer engagement, driving product-led growth to allow our customers to create content and interact with documents in ways that are more frictionless, efficient and accessible, and meeting our customers’ needs holistically to increase the value they derive from our services.\nWe are redefining the creative process with Adobe Creative Cloud to unleash everyone’s ability to imagine and express ideas. We are empowering enterprises and users beyond creative professionals, such as novice content creators and communicators, to create, edit, schedule and share content quickly and easily using Adobe Express, which makes select capabilities from products like Adobe Photoshop, Adobe Premiere Pro and Adobe Acrobat easy to use for users at any level. With Adobe Acrobat Pro, subscribers have full convert and edit capabilities, advanced e-signature features including bulk send and custom branding, advanced protection and additional PDF features. We continue to add collaboration capabilities into our flagship products, Apps and workflows, and to infuse AI into our creative Apps to help our customers and users work faster and smarter, with new models for images and vector graphics, and AI-powered video features natively integrated into our flagship products. We are building our own foundation models in areas where we have domain expertise and which we believe are most relevant to our customers, and partnering with third-party AI models and large language models to further expand the capabilities of our products. We expanded Adobe Firefly with the launch of Adobe Firefly Services, which help organizations automate content production; Custom Models, which enable enterprises to train and customize models to support brand consistency amongst creative and marketing teams; Firefly Video Model (public beta), which enables generative text-to-video and image-to-video; and Firefly Image 3 Foundation Model, which allows for faster and higher-quality image generations. Developing our own foundation models enables us to design Firefly to be commercially safe and in line with our AI Ethics principles of accountability, responsibility and transparency.\nWe continue to pursue ways to inspire, empower and connect the creative community and support live, interactive tutorials with creators. Additionally, with Adobe GenStudio and Adobe GenStudio for Performance Marketing, a generative AI-first product that natively integrates Digital Media and Digital Experience offerings, we help enterprises to quickly create on-brand content variations and accelerate their marketing workflows. Further descriptions of our Digital Media products are included below under “Principal Products, Services and Solutions.”\nIn our Creative Cloud business, we employ our product-led growth strategy to minimize the friction of customer interactions and drive positive product experiences, which results in increasing adoption, usage, conversion, expansion and loyalty. We also continue to employ a pricing strategy, as appropriate, to migrate our customers to higher-value offerings as well as attract past customers and potential customers to try out our products and ultimately subscribe. We use a data-driven operating model and our Adobe Experience Cloud solutions to drive and optimize customer awareness, engagement and licensing of our creative products and services at every stop of the customer journey through our website and across other channels. Adobe.com is the central destination where we engage individual and small business customers to sign up for and renew Creative Cloud subscriptions. Our customers hav",
  "item7_clean": "Accounting for Uncertainty in Income Taxes\nThe gross liabilities for unrecognized tax benefits excluding interest and penalties were $683 million and $501 million at the end of fiscal 2024 and 2023, respectively. If the total unrecognized tax benefits as of November 29, 2024 and December 1, 2023 were recognized, $519 million and $356 million would decrease the respective effective tax rates.\nAs of November 29, 2024 and December 1, 2023, the combined amounts of accrued interest and penalties included in long-term income taxes payable related to tax positions taken on our tax returns were not material.\nThe timing of the resolution of income tax examinations is highly uncertain as are the amounts and timing of tax payments that are part of any audit settlement process. These events could cause large fluctuations in the balance sheet classification of our tax assets and liabilities. We believe that within the next 12 months, it is reasonably possible that either certain audits will conclude or statutes of limitations on certain income tax examination periods will expire, or both. Although the timing of resolution, settlement and closing of audits is not certain, it is reasonably possible that the underlying unrecognized tax benefits may decrease by up to $50 million over the next 12 months.\nOur future effective tax rates may be materially affected by changes in the tax rates in jurisdictions where our income is earned, changes in jurisdictions in which our profits are determined to be earned and taxed, changes in the valuation of our deferred tax assets and liabilities, changes in or interpretation of tax rules and regulations in the jurisdictions in which we do business, or unexpected changes in business and market conditions that could reduce certain tax benefits.\nIn addition, tax laws in the United States as well as other countries and jurisdictions in which we conduct business are subject to change as new laws are passed and/or new interpretations are made available. These countries, governmental bodies, such as the European Commission of the European Union, and intergovernmental economic organizations, such as the Organization for Economic Cooperation and Development, have made or could make unprecedented assertions about how taxation is determined and, in some cases, have proposed or enacted new laws that are contrary to the way in which rules and regulations have historically been interpreted and applied. Changes in our operating landscape, such as changes in laws and/or interpretations of tax rules, could adversely affect our effective tax rates and/or cause us to respond by making changes to our business structure which could adversely affect our operations and financial results.\nMoreover, we are subject to the examination of our income tax returns by domestic and foreign tax authorities. We regularly assess the likelihood of outcomes resulting from these examinations to determine the adequacy of our provision for income taxes and have reserved for potential adjustments that may result from these examinations. Our policy is to record interest and penalties related to unrecognized tax benefits in income tax expense. While we believe our tax estimates are reasonable, we cannot provide assurance that the final determination of any of these examinations will not have an adverse effect on our financial position and results of operations.\nLIQUIDITY AND CAPITAL RESOURCES\nOur primary source of cash is receipts from revenue. Other customary sources of cash include proceeds from maturities and sales of short-term investments. Our primary uses of cash are general business expenses including payroll and related benefits costs, income taxes, marketing and third-party hosting services, as well as our stock repurchase program as described below. Other customary uses of cash include purchases of property and equipment and payments for taxes related to net share settlement of equity awards.\nThis data should be read in conjunction with our Consolidated Statements of Cash Flows.\nCash and cash equivalents\nShort-term investments\nStockholders’ equity\nA summary of our cash flows for fiscal 2024, 2023 and 2022 is as follows:\nNet cash provided by operating activities\nNet cash provided by (used for) investing activities\nNet cash used for financing activities\nEffect of foreign currency exchange rates on cash and cash equivalents\nNet change in cash and cash equivalents\nCash Flows from Operating Activities\nFor fiscal 2024, net cash provided by operating activities of $8.06 billion was primarily comprised of net income adjusted for the net effect of non-cash items. Payment of the $1 billion Figma termination fee during fiscal 2024 had an adverse impact on net income and cash flows from operations.\nCash Flows from Investing Activities\nFor fiscal 2024, net cash provided by investing activities of $149 million was primarily due to maturities of short-term investments, partially offset by ongoing capital expenditures and purchases of long-term and short-term investments.\nCash Flows from Financing Activities\nFor fiscal 2024, net cash used for financing activities of $7.72 billion was primarily due to payments for our common stock repurchases, partially offset by proceeds from the issuance of senior notes.\nSee the sections titled “Senior Notes” and “Stock Repurchase Program” below.\nLiquidity and Capital Resources Considerations\nOur existing cash, cash equivalents and investment balances may fluctuate during fiscal 2025 due to changes in our planned cash outlay.\nCash from operations could also be affected by various risks and uncertainties, including, but not limited to, risks detailed in the section titled “Risk Factors” in Part I, Item 1A of this report. Based on our current business plan and revenue prospects, we believe that our existing cash, cash equivalents and investment balances, our anticipated cash flows from operations and our available credit facility will be sufficient to meet our working capital, operating resource expenditure and capital expenditure requirements for the next twelve months and for the foreseeable future.\nOur cash equivalent and short-term investment portfolio as of November 29, 2024 consisted of money market funds, corporate debt securities, U.S. Treasury securities, time deposits, U.S. agency securities and asset-backed securities. We use professional investment management firms to manage a large portion of our invested cash.\nWe expect to continue our investing activities, including short-term and long-term investments, purchases of computer and server hardware to operate our network infrastructure, sales and marketing, product support and administrative staff. Furthermore, cash reserves may be used to repurchase stock under our stock repurchase program and to strategically acquire companies, products or technologies that are complementary to our business.\nRevolving Credit Agreement\nWe have a $1.5 billion senior unsecured revolving credit agreement (the “Revolving Credit Agreement”) with a syndicate of lenders, providing for loans to us and certain of our subsidiaries through June 30, 2027. Subject to the agreement of lenders, we may obtain up to an additional $500 million in commitments, for a maximum aggregate commitment of $2 billion. As of November 29, 2024, there were no outstanding borrowings under the Revolving Credit Agreement and the entire $1.5 billion credit line remains available for borrowing. Under the terms of our Revolving Credit Agreement, we are not prohibited from paying cash dividends unless payment would trigger an event of default or if one currently exists. We do not anticipate paying any cash dividends in the foreseeable future.\nCommercial Paper Program\nWe have a commercial paper program under which we may issue unsecured commercial paper up to a total of $3 billion outstanding at any time, with maturities of up to 397 days from the date of issue. The net proceeds from the issuance of commercial paper are expected to be used for general corporate purposes, which may include working capital, capital expenditures, acquisitions, stock repurchases, refinancing indebtedness or any other general corporate purposes. As of November 29, 2024, there were no outstanding borrowings under the commercial paper program.\nIn April 2024, we issued $500 million of senior notes due April 4, 2027, $750 million of senior notes due April 4, 2029 and $750 million of senior notes due April 4, 2034. In total, we have $5.65 billion of senior notes outstanding, which rank equally with our other unsecured and unsubordinated indebtedness. As of November 29, 2024, the carrying value of our senior notes was $5.63 billion and our maximum commitment for interest payments was $806 million for the remaining duration of our outstanding senior notes. Interest is payable semi-annually, in arrears. Our senior notes do not contain any financial covenants.\nSee Note 17 of our Notes to Consolidated Financial Statements for further details regarding our debt.\nDuring the first quarter of fiscal 2024, we reclassified the senior notes due February 1, 2025 as current debt in our Consolidated Balance Sheets. As of November 29, 2024, the carrying value of our current debt was $1.50 billion, net of the related discount and issuance costs. Though we intend to refinance the current portion of our debt on or before the due date, the timing of the refinancing may be impacted by market conditions.\nContractual Obligations\nOur principal commitments consist of purchase obligations resulting from agreements to purchase goods and services in the ordinary course of business. As of November 29, 2024, the value of our non-cancellable unconditional purchase obligations was $5.79 billion, primarily relating to contracts with vendors for third-party hosting and data center services.\nSee Note 16 of our Notes to Consolidated Financial Statements for additional information regarding our purchase obligations.\nWe lease certain facilities and data centers under non-cancellable operating lease arrangements that expire at various dates through 2034. As of November 29, 2024, the value of our obligations under operating leases was $463 million.\nS\nee Note 18 of our Notes to Consolidated Financial Statements for additional information regarding our lease obligations\nStock Repurchase Program\nTo facilitate our stock repurchase program, designed to return value to our stockholders and minimize dilution from stock issuances, we may repurchase our shares in the open market or enter into structured repurchase agreements with third parties. In December 2020, our Board of Directors granted authority to repurchase up to $15 billion in our common stock, which became fully utilized during fiscal 2024. In March 2024, our Board of Directors granted additional authority to repurchase up to $25 billion in our common stock through March 14, 2028.\nDuring fiscal 2024, we entered into accelerated share repurchase agreements (“ASRs”) with large financial institutions whereupon we provided them with prepayments totaling $9.5 billion. Subsequent to November 29, 2024, as part of the March 2024 stock repurchase authority, we entered into stock repurchase arrangements with a large financial institution which totaled $3.25 billion, including a $2.75 billion ASR and a trading plan under which we may execute up to $500 million in open market repurchases.\nMarket for Registrant’s Common Equity, Related Stockholder Matters and Issuer Purchases of Equity Securities\nin Part II, Item 5 of this report for stock repurchases during the quarter ended\nand Note 14 of our Notes to Consolidated Financial Statements for further details regarding our stock repurchase program.\nIn the ordinary course of business, we provide indemnifications of varying scope to our customers and channel partners against claims of intellectual property infringement made by third parties arising from the use of our products and from time to time, we are subject to claims by our customers under these indemnification provisions. Historically, costs related to these indemnification provisions have not been significant and we are unable to estimate the maximum potential impact of these indemnification provisions on our future results of operations.\nTo the extent permitted under Delaware law, we have agreements whereby we indemnify our officers and directors for certain events or occurrences while the officer or director is or was serving at our request in such capacity. The indemnification period covers all pertinent events and occurrences during the officer’s or director’s lifetime. The maximum potential amount of future payments we could be required to make under these indemnification agreements is unlimited; however, we have director and officer insurance coverage that reduces our exposure and enables us to recover a portion of any future amounts paid.\n\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nIn preparing our Consolidated Financial Statements in accordance with generally accepted accounting principles in the United States (“GAAP”) and pursuant to the rules and regulations of the SEC, we make assumptions, judgments and estimates that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosures of contingent assets and liabilities. We base our assumptions, judgments and estimates on historical experience and various other factors that we believe to be reasonable under the circumstances. Actual results could differ materially from these estimates under different assumptions or conditions. We evaluate our assumptions, judgments and estimates on a regular basis. We also discuss our critical accounting policies and estimates with the Audit Committee of the Board of Directors.\nWe believe that the assumptions, judgments and estimates involved in the accounting for revenue recognition and income taxes have the greatest potential impact on our Consolidated Financial Statements. These areas are key components of our results of operations and are based on complex rules requiring us to make judgments and estimates, and consequently, we consider these to be our critical accounting policies. Historically, our assumptions, judgments and estimates relative to our critical accounting policies have not differed materially from actual results.\nOur contracts with customers may include multiple goods and services. For example, some of our offerings include both on-premise and/or on-device software licenses and cloud services. Determining whether the software licenses and the cloud services are distinct from each other, and therefore performance obligations to be accounted for separately, or not distinct from each other, and therefore part of a single performance obligation, may require significant judgment. We have concluded that the on-premise/on-device software licenses and cloud services provided in our Creative Cloud and Document Cloud subscription offerings are not distinct from each other such that revenue from each offering should be recognized ratably over the subscription period for which the cloud services are provided. In reaching this conclusion, we considered the nature of our promise to Creative Cloud and Document Cloud customers, which is to provide a complete end-to-end creative design or document workflow solution that operates seamlessly across multiple devices and teams. We fulfill this promise by providing access to a solution that integrates cloud-based and on-premise/on-device features that, together through their integration, provide functionalities, utility and workflow efficiencies that could not be obtained from either the on-premise/on-device software or cloud services on their own.\nCloud-based features that are integral to our Creative Cloud and Document Cloud offerings and that work together with the on-premise/on-device software include, but are not limited to: Creative Cloud Libraries, which enable customers to access their work, settings, preferences and other a",
  "item2_clean": null
}