{
  "source_file": "adbe-20250829.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe following discussion should be read in conjunction with the condensed consolidated financial statements and notes thereto.\nBUSINESS OVERVIEW\nAdobe is a global technology company with a mission to change the world through personalized digital experiences. For over four decades, Adobe’s innovations have transformed how individuals, teams, businesses, enterprises, institutions, and governments engage and interact across all types of media. Our products, services and solutions are used around the world to imagine, create, manage, deliver, measure, optimize and engage with content across surfaces and fuel digital experiences. We have a diverse user base that includes consumers, communicators, creative professionals, developers, students, small and medium businesses and enterprises. We are also empowering creators by putting the power of artificial intelligence (“AI”) in their hands, and doing so in ways we believe are responsible. Our products and services help unleash creativity, accelerate document productivity and power businesses in a digital world. We have operations in the Americas; Europe, Middle East and Africa (“EMEA”); and Asia-Pacific (“APAC”).\nOPERATIONS OVERVIEW\nFor our third quarter of fiscal 2025, we experienced strong demand across our Digital Media and Digital Experience offerings, driven by transformative and customer-focused product innovation. As we execute on our long-term growth initiatives, with emphasis on delivering value through AI-powered and highly differentiated solutions to meet the needs of our diverse and expanding customer base, we have continued to experience growth in software-based subscription revenue across our portfolio of offerings.\nOur Digital Media products, services and solutions help users create, design and publish rich content and 3D experiences, and improve productivity by transforming how they view, share and collaborate on documents and content. These offerings include our Creative Cloud flagship applications (“apps”) such as Adobe Photoshop, Adobe Illustrator, Adobe Lightroom, Adobe Premiere Pro and Adobe Stock; as well as Adobe Acrobat, Adobe Express, Adobe Firefly and many more products, which are available across surfaces and platforms as desktop tools, web and mobile apps and cloud-based services. Adobe Express is our web and mobile app designed to enable a broad spectrum of users, including novice content creators and communicators, to create, edit and customize content quickly and easily with content first, task-based solutions. Our Adobe Acrobat offerings fuel document productivity, enabling users to create, collaborate, review, approve, sign and track documents at home, in the office and across devices. AI innovation is deeply infused into our Digital Media solutions, including through Adobe Firefly-powered generative AI features available across our Creative Cloud flagship apps, and through Acrobat AI Assistant, a generative AI-powered conversational interface designed to enhance document experiences. Our Digital Media customers include business professionals, consumers, creative professionals, creators and marketing professionals.\nAnnualized Recurring Revenue (“ARR”) is currently the key performance metric our management uses to assess the health and trajectory of our overall Digital Media segment. ARR should be viewed independently of revenue, deferred revenue and remaining performance obligations as ARR is a performance metric and is not intended to be combined with any of these items. Digital Media ARR continues to be calculated as the sum of the annual value of Digital Media subscriptions and services and the annual value of Digital Media Enterprise Term License Agreements. We adjust our reported ARR on an annual basis to\nreflect any exchange rate changes. Our reported ARR results in the current fiscal year are based on currency rates set at the beginning of the year and held constant throughout the year for measurement purposes. Prior year ARR balances are also revalued at the new currency rates for comparative purposes.\nDigital Media ARR grew to $18.59 billion at the end of the third quarter of fiscal 2025, representing 11.7% year-over-year growth. Our success in driving growth in ARR has positively affected our revenue growth. Digital Media segment revenue grew to $4.46 billion in the third quarter of fiscal 2025, up from $4.00 billion in the third quarter of fiscal 2024, representing 12% year-over-year growth.\nOur Digital Experience apps and services are designed to accelerate customer experience orchestration at scale and supply intelligence for businesses of any size in any industry. Digital Experience is comprised of solutions to deliver actionable data, with products such as Adobe Analytics and Adobe Real-Time Customer Data Platform; optimize personalized content delivery, with products such as Adobe Experience Manager, Adobe Commerce and Adobe GenStudio for Performance Marketing; and manage customer journeys, with products such as Adobe Marketo Engage and Adobe Campaign. Our differentiation and competitive advantage are strengthened by our ability to use the Adobe Experience Platform to integrate our comprehensive set of solutions and our ability to embed AI into our product portfolio, such as with our Adobe Experience Platform AI Assistant, a generative AI-powered conversational interface designed to help customers automate workflows and generate new audiences and journeys. Our Digital Experience customers include marketing professionals such as brand managers, channel marketers and campaign strategists.\nDigital Experience revenue was $1.48 billion in the third quarter of fiscal 2025, up from $1.35 billion in the third quarter of fiscal 2024, representing 9% year-over-year growth. Subscription revenue grew to $1.37 billion in the third quarter of fiscal 2025, up from $1.23 billion in the third quarter of fiscal 2024, representing 11% year-over-year growth.\nCustomer-Focused Strategy\nOur customers often are involved in workflows that integrate multiple Adobe products across both segments. By combining the creativity of our Digital Media business with the science of our Digital Experience business, such as with our Adobe GenStudio solutions, we help our customers to more efficiently and effectively make, manage, measure and monetize their content across every channel with an end-to-end workflow.\nSpanning both our Digital Media and Digital Experience segments, we are driving continued business success through audience-specific product innovation and go-to-market strategy focused on the following two customer groups:\nBusiness Professionals and Consumers desire web and mobile apps with easy-to-use AI capabilities, and are increasingly benefiting from using Adobe Acrobat and Adobe Express. Revenue associated with the Business Professionals and Consumers customer group consists of Adobe Acrobat offerings and Adobe Express, all of which are part of Digital Media.\nCreative and Marketing Professionals require agile and comprehensive solutions to create high volumes of compelling content, infused with commercially safe AI capabilities; and are benefiting from investments in powerful, integrated workflows through offerings such as Adobe Firefly and Adobe GenStudio. Revenue associated with the Creative and Marketing Professionals customer group consists of Digital Experience offerings as well as Creative Cloud flagship apps such as Photoshop, Lightroom and Illustrator within Digital Media.\nBy viewing the Digital Media and Digital Experience segments through this additional lens, we can more effectively execute on our long-term growth strategies. Our success will be achieved through continued acquisition and retention of our customer base by delivering valuable new features and technologies to customers with our latest releases, including generative AI capabilities to enhance creativity, productivity and marketing, and expanding availability of our offerings across an increasing number of surfaces.\nAs part of our customer-focused strategy, we utilize a data-driven operating model and tailored go-to-market motion to raise awareness of our products and drive customer acquisition, engagement and retention. Overall, our strategy is designed to increase our revenue with existing users, continue to attract new customers, and grow our recurring and predictable revenue stream that is recognized ratably.\nMacroeconomic Conditions\nAs a corporation with an extensive global footprint, we are subject to risks and exposures from the evolving macroeconomic environment, including the effects of increased global inflationary pressures and interest rates, fluctuations in foreign currency exchange rates, potential economic slowdowns or recessions and geopolitical pressures, including the unknown impacts of current and future trade regulations. We continuously monitor the direct and indirect impacts of these circumstances on our business and financial results.\nWhile our revenue and earnings are relatively predictable as a result of our subscription-based business model, the broader implications of these macroeconomic events on our business, results of operations and overall financial position, particularly in the long term, remain uncertain.\nSee the section titled “Risk Factors” in Part II, Item\n1A\nof this report for further discussion of the possible impact of these macroeconomic issues on our business.\nCRITICAL ACCOUNTING POLICIES AND ESTIMATES\nIn preparing our condensed consolidated financial statements in accordance with generally accepted accounting principles in the United States (“GAAP”) and pursuant to the rules and regulations of the SEC, we make assumptions, judgments and estimates that affect the reported amounts of assets, liabilities, revenue and expenses, and related disclosures of contingent assets and liabilities. We base our assumptions, judgments and estimates on"
}