{
  "source_file": "adsk-20250131.htm",
  "form_type": "10-K",
  "item1_clean": "The majority of our research and product development is performed in the United States, Canada, and India. However, we employ experienced software developers in many of our other locations. Translation and localization of our products are performed in several local markets, principally Singapore and Ireland. We generally localize and translate our products into German, French, Italian, Spanish, Japanese, Korean, and simplified and traditional Chinese.\nWe plan to continue managing significant product development operations internationally over the next several years. We believe that our ability to conduct research and development at various locations throughout the world allows us to tap into a diverse global talent pool, optimize costs, and integrate local market knowledge into our development activities. We continually assess costs, hiring challenges, and intellectual property protection, against the benefits of our international development activities.\nFor further discussion regarding risks from our product development and introduction efforts, see Item 1A, “Risk Factors.”\nMARKETING AND SALES\nWe sell our products and services globally, through a combination of direct and indirect channels. We transact directly with our enterprise and named account customers, with customers through our online Autodesk branded store, and with certain customers through our new transaction model whereby Solution Providers provide a quote to customers but the actual transaction occurs directly between Autodesk and the customer. We introduced the new transaction model for our token-based Flex offering in North America, and certain countries in EMEA, and APAC during fiscal 2023 and 2024. Most of our subscription offerings transitioned to the new transaction model in Australia during fiscal 2024. In fiscal 2025, we transitioned most of our indirect business to the new transaction model in our major markets. The new transaction model helps customers with enhanced control and time savings through self-service, consistent pricing, and a more personalized buying experience. Also, it gives Solution Providers and Autodesk access to essential data to improve our offerings and the customers’ buying experience.\nWe expect our indirect channel will continue to transact and support a considerable portion of our customers, particularly in emerging regions and with governments. Our indirect channel model includes both a two-tiered distribution structure, where distributors sell to resellers, and a one-tiered structure, where Autodesk sells directly to resellers. We have a network of approximately 1,260 resellers and distributors worldwide. For fiscal 2025, approximately 58% of our revenue was derived from indirect channel sales through distributors and resellers. We employ a variety of incentive programs and promotions to align our direct and indirect channels with our business strategies.\nWe anticipate that our channel mix will continue to change as we scale our business. With the continued growth of our online Autodesk branded store and our new transaction model, we are transacting directly with more end customers, rather than through distributors, without substantial disruption to our revenue. Our ability to effectively distribute our products depends in part upon the financial and business condition of our distributor, reseller and Solution Provider networks. The loss of, or a significant reduction in, business with any one of our major distributors, large resellers or Solution Providers could harm our business. See Item 1A, “Risk Factors,” for further discussion. The transition to annual billings for multi-year contracts impacted the timing of our billings and cash collections in fiscal year 2025 and we expect this impact to continue into fiscal year 2026. See Part II, Item 7, “Management's Discussion and Analysis of Financial Condition and Results of Operations,” for further discussion.\nRevenue through our largest distributor, TD Synnex Corporation and its global affiliates (collectively, “TD Synnex”), accounted for 33%, 39%, and 37% of our net revenue for the fiscal years ended January 31, 2025, 2024 and 2023, respectively. During fiscal 2023, we entered into transition agreements with TD Synnex to provide transition distribution activities for a one-to-two-year period. In the third fiscal quarter of 2025, we entered into a new distribution agreement with TD Synnex for government business in certain jurisdictions. Existing distribution agreements will continue in emerging markets. We have increased our selling efforts with Solution Providers in connection with our new transaction model. Consequently, we believe our business is not substantially dependent on TD Synnex. No other distributor, reseller, or direct customer accounted for 10% or more of our revenue in fiscal 2025.\nOur customer-related operations are divided into three geographic regions: the Americas; EMEA; and APAC. Each geographic region is supported by global marketing and sales organizations. These organizations develop and manage overall marketing and sales programs and work closely with a network of domestic and international sales offices. We believe that international sales will continue to comprise the majority of our total net revenue. Adverse economic conditions and currency exchange rates in the countries that contribute a significant portion of our net revenue, including emerging economies, may have an adverse effect on our business in those countries and our overall financial performance. Our international operations and sales subject us to a variety of risks. See Item 1A, “Risk Factors,” for further discussion.\nWe also work directly with reseller, distributor, and Solution Provider partner organizations, computer manufacturers, other software developers, and peripherals manufacturers in cooperative advertising, promotions, and trade-show presentations. We connect with our audiences through scalable marketing strategies such as webinars, live and virtual events, personalized outreach, digital campaigns, sponsorships, and targeted advertising across industry publications, technology platforms, media outlets, and social networks. We also foster global user networks and online communities, enabling customers to connect, collaborate, and share insights about our products, services, and solutions.\nWe generate revenue primarily through various offerings that provide recurring revenue. Under our subscription plan, customers can use our software anytime, anywhere, and get access to the latest updates to previous versions through term-based product subscriptions, cloud service offerings, and enterprise business agreements (“EBA”). Historically, we have had increased EBA sales activity in our fourth fiscal quarter. This seasonality may not have an immediate impact on our revenue as we recognize subscription revenue over the term of the contract. This seasonality may also affect the relative value of our billings, Remaining Performance Obligations (“RPO”), and collections in the fourth and first fiscal quarters.\nCUSTOMER AND PARTNER SUPPORT\nWith the new transaction model, we are approaching the final phase of modernizing our go-to-market motion, which includes building more durable and direct relationships with our customers, updating our data infrastructure, and retiring old information systems and business models. We provide technical support and training to customers through a multi-tiered support model, augmented by direct programs designed to address certain specific customer needs. Some of our customers receive support and training from resellers and distributors from which they purchased subscriptions or licenses for our products or services, with Autodesk in turn providing second-tier support to the resellers and distributors. Some of our customers may also purchase support and training from Solution Providers. Other customers are supported directly via self-service using the Autodesk Knowledge Network, which guides customers to answers in our online support assets, support forums, or webinars, or to support representatives using different modalities such as social media, phone, email, and webchat. We also support our resellers and distributors through technical product training, sales training classes, webinars, and other knowledge-sharing programs.\nGOVERNANCE AND IMPACT PROGRAMS\nAutodesk is committed to advancing a more sustainable, resilient, and inclusive world. We take action as a business to support our employees, customers, and communities in our collective opportunity to design and make a better world for all.\nWe focus our efforts to advance positive outcomes across three primary areas: energy and materials, health and resilience, and work and prosperity. These impact opportunity areas are derived from the UN Sustainable Development Goals (“SDGs”) and have been identified through a multi-pronged process to align the top needs of our stakeholders, the issues that are most important to our business, and the areas we are best placed to accelerate positive impact at scale.\nThese opportunities primarily manifest as outcomes through how our customers leverage our technology to design and make net-zero carbon buildings, resilient infrastructure, more sustainable products, and a thriving workforce. We support and amplify these opportunities through powering our business with 100% renewable energy, neutralizing greenhouse gas emissions associated with our operations, developing an inclusive culture and supporting students and educators with tools and training to equip the next generation of innovators. We advance these opportunities with industry innovators through collaboration with our customers and partners, deploying philanthropic capital to changemakers, and providing software donations, and training to our wider ecosystem. Autodesk committed to target 1% of annual operating profit for the long-term support of our impact programs, which includes our philanthropic work and our climate commitments.\nThese programs align with our operational priorities and long-term growth strategy. We aim to maintain our commitments, fostering trust with stakeholders and enabling compliance with global regulations.\nAutodesk is committed to helping students gain the in-demand skills and certifications needed to demonstrate they are prepared for current and emerging roles in the industries we serve. We offer free educational licenses of Autodesk’s complete portfolio of professional software to verified students, educators, and accredited educational institutions worldwide. Additionally, we offer self-paced, modular learning and curriculum for K-12, post-secondary students, and educators. Our intention is to make Autodesk software the preferred choice for those poised to become the next generation of design, engineering, and construction professionals.\nIn addressing the global challenges posed by climate change, we make it possible for our customers to innovate and respond to associated changes in regulation, building code, physical climate parameters, and other climate-related developments. This effort can directly and indirectly create more demand for existing and new Autodesk products and services in the short and long-term. Furthermore, our leadership is committed to taking climate action and that commitment goes hand in hand with our values and reputation in the marketplace.\nClimate Change Management Actions\nTo drive continued progress and meet growing demand, we continue to expand the solutions, education, and support we offer, helping customers secure a competitive advantage for a low-carbon future by designing high-performance buildings, resilient cities and infrastructure, and more efficient transportation and products. To continue to grow this market, we invest in our tools to meet customer’s demand as well as provide software and support to early-stage entrepreneurs, nonprofit organizations, and start-up companies who are designing clea",
  "item7_clean": "RPO consisted of the following:\nRPO\nWe expect that the amount of RPO will change from quarter to quarter for several reasons, including the specific timing, duration, and size of customer subscription and support agreements, the specific timing of customer renewals, and foreign currency fluctuations. Historically, we have had increased EBA sales activity in our fourth fiscal quarter and this seasonality may affect the relative value of our billings, RPO, and cash collections in the fourth and first fiscal quarters. As customers transition from multi-year subscription contracts billed upfront to annual billing installments, some customers may choose annual contracts instead. If this were to occur, we would expect it to proportionately reduce the unbilled portion of our total remaining performance obligations and would expect it to impact total RPO growth rates negatively. Deferred revenue, billings, current RPO, revenue, Non-GAAP operating margin, and free cash flow would remain broadly unchanged in this scenario.\nBalance Sheet and Cash Flow Items\nAt January 31, 2025, we had $2.15 billion in cash, cash equivalents, and marketable securities. Our cash flow from operations increased to $1.61 billion for the fiscal year ended January 31, 2025, from $1.31 billion for the fiscal year ended January 31, 2024. We repurchased 3 million shares of our common stock for $858 million during fiscal 2025. Comparatively, we repurchased 4 million shares of our common stock for $795 million during fiscal 2024. Further discussion regarding the balance sheet and cash flow activities are discussed below under the heading “Liquidity and Capital Resources.”\nRESULTS OF OPERATIONS\nWe believe our investment in cloud products and a subscription business model, backed by a strong balance sheet, give us a robust foundation to successfully navigate complex geopolitical and global macro-economic challenges. However, material scarcity, supply chain disruption and resulting inflationary pressures, higher interest rates, a global labor shortage, ongoing geopolitical conflicts, and foreign exchange rate fluctuations, may impact our outlook. We also expect our transition to annual billings for multi-year contracts to impact the timing of our billings and cash collections. The extent of the impact of these risks on our business in fiscal 2026 and beyond will depend on several factors, some of which are out of our control. Further discussion of the potential impacts of these risks on our business can be found in Part I, Item 1A, “Risk Factors.”\nWe introduced a new transaction model for our token-based Flex offering in North America, and certain countries in EMEA, and APAC during fiscal 2023 and 2024. Most of our subscription offerings transitioned to the new transaction model in Australia during fiscal 2024. In fiscal 2025, we transitioned most of our indirect business to the new transaction model in our major markets. In this new transaction model, Solution Providers provide a quote to customers but the actual transaction occurs directly between Autodesk and the customer.\nOur sales incentives to Solution Providers will be recorded as operating expenses under the new transaction model as we will contract directly with end customers. Accordingly, we expect sales incentives paid to resellers recorded as a reduction of transaction price and subsequently recognized as a reduction to subscription revenue over the contract period will decrease as we transition to the new transaction model. Most of the sales incentives payments to Solution Providers in our new transaction model, will be considered incremental and recoverable costs of obtaining a contract with a customer and will be capitalized and included in “Prepaid expenses and other current assets” and “Long-term other assets” on the Consolidated Balance Sheets. The deferred costs will then be amortized over the period of benefit and recorded to “Sales and Marketing” on the Consolidated Statement of Operations. The sales incentives not qualifying for capitalization will be recorded to “Sales and Marketing” on the Consolidated Statement of Operations as the costs are incurred under the incentive program requirements. In the near term, we expect the change in recognition of sales incentives to indirect channels from contra revenue to operating expenses under the new transaction model to positively impact calculated revenue growth, while being broadly neutral to calculated operating profit and free cash flow dollars, and to result in a calculated negative impact to operating margin.\nNet Revenue by Income Statement Presentation\nSubscription revenue consists of our term-based product subscriptions, cloud service offerings, and flexible EBAs. Revenue from these arrangements is predominately recognized ratably over the contract term commencing with the date our service is made available to customers and when all other revenue recognition criteria have been satisfied.\nMaintenance revenue consists of renewal fees for existing maintenance plan agreements that were initially purchased with a perpetual software license. Under our maintenance plan, customers are eligible to receive unspecified upgrades, when and if available, and technical support. We recognize maintenance revenue ratably over the term of the agreements, which is generally one year.\nOther revenue consists of revenue from consulting and other products and services and is recognized as the products are delivered and services are performed.\n\nDiluted net income per share\nStock-based compensation expense\nAmortization of developed technologies\nAmortization of purchased intangibles\nAcquisition-related costs\nLease-related asset impairments and other charges\nRestructuring, other exit costs, and facility reductions\nLoss (gain) on strategic investments and dispositions, net\n(Release) establishment of valuation allowance on deferred tax assets\nDiscrete GAAP tax items\nIncome tax effect of non-GAAP adjustments\nNon-GAAP diluted net income per share\nTotals may not sum due to rounding.\nOur non-GAAP financial measures may exclude the following:\nStock-based compensation expenses.\nWe exclude stock-based compensation expenses from non-GAAP measures primarily because they are non-cash expenses and management finds it useful to exclude certain non-cash charges to assess the appropriate level of various operating expenses to assist in budgeting, planning, and forecasting future periods. Moreover, because of varying available valuation methodologies, subjective assumptions, and the variety of award types that companies can use under FASB ASC Topic 718, we believe excluding stock-based compensation expenses allows investors to make meaningful comparisons between our recurring core business operating results and those of other companies.\nAmortization of developed technologies and purchased intangibles.\nWe incur amortization of acquisition-related developed technologies and purchased intangibles in connection with acquisitions of certain businesses and technologies. Amortization of developed technologies and purchased intangibles is inconsistent in amount and frequency and is significantly affected by both the timing and size of our acquisitions. Management finds it useful to exclude these variable charges from our cost of revenues to assist in budgeting, planning, and forecasting future periods. Investors should note that the use of intangible assets contributed to our revenues earned during the periods presented and will contribute to our future period revenues as well. Amortization of developed technologies and purchased intangible assets will recur in future periods.\nRestructuring, other exit costs, and facility reductions.\nThese expenses are associated with realigning our business strategies based on current economic conditions. In connection with these restructuring actions or other exit actions, we recognize costs related to termination benefits for former employees whose positions were eliminated, the reduction of facilities, and cancellation of certain contracts. We exclude these charges because these expenses are not reflective of ongoing business and operating results. We believe it is useful for investors to understand the effects of these items on our total operating expenses.\nLease-related asset impairments and other charges.\nThese charges are associated with the optimization of our facilities costs related to leases for facilities that we have vacated as a result of our one-time move to a more hybrid remote workforce. In connection with these facility leases, we recognize costs related to the impairment or abandonment of operating lease right-of-use assets, computer equipment, furniture, and leasehold improvements, and other costs. We exclude these charges because these expenses are not reflective of ongoing business and operating results. We believe it is useful for investors to understand the effects of these items on our total operating expenses.\nAcquisition-related costs.\nWe exclude certain acquisition-related costs, including due diligence costs, professional fees in connection with an acquisition, certain financing costs, and certain integration-related expenses. These expenses are unpredictable, and depend on factors that may be outside of our control and unrelated to the continuing operations of the acquired business or our Company. In addition, the size and complexity of an acquisition, which often drives the magnitude of\nacquisition-related costs, may not be indicative of such future costs. We believe excluding acquisition-related costs facilitates the comparison of our financial results to the Company's historical operating results and to other companies in our industry.\nLoss (gain) on strategic investments and dispositions.\nWe exclude gains and losses related to our strategic investments and dispositions of strategic investments, purchased intangibles, and businesses from our non-GAAP measures primarily because management finds it useful to exclude these variable gains and losses on these investments and dispositions in assessing our financial results. Included in these amounts are non-cash unrealized gains and losses, dividends received, realized gains and losses on the sales or losses on the impairment of these investments, and gain and loss on dispositions. We believe excluding these items is useful to investors because they do not correlate to the underlying performance of our business and these losses or gains were incurred in connection with strategic investments and dispositions which do not occur regularly.\nDiscrete tax provision items.\nWe exclude the GAAP tax provision, including discrete items, from the non-GAAP measure of net income (loss), and include a non-GAAP tax provision based upon the projected annual non-GAAP effective tax rate. Discrete tax items include income tax expenses or benefits that do not relate to ordinary income from continuing operations in the current fiscal year, unusual or infrequently occurring items, or the tax impact of certain stock-based compensation. Examples of discrete tax items include, but are not limited to, certain changes in judgment and changes in estimates of tax matters related to prior fiscal years, certain costs related to business combinations, certain changes in the realizability of deferred tax assets, or changes in tax law. Management believes this approach assists investors in understanding the tax provision and the effective tax rate related to ongoing operations. We believe the exclusion of these discrete tax items provides investors with useful supplemental information about our operational performance.\nEstablishment (release) of a valuation allowance on certain net deferred tax assets.\nThis is a non-cash charge to record or to release a valuation allowance on certain deferred tax assets. As explained above, management finds it useful to exclude certain non-cash charges to assess the appropriate level of various cash expenses to assist in budgeting, planning, and forecasting future periods.\nIncome tax effects on the difference between GAAP and non-GAAP costs and expenses.\nThe income tax effects that are excluded from the non-GAAP measures relate to the tax impact on the difference between GAAP and non-GAAP expenses, primarily due to stock-based compensation, amortization of purchased intangibles, and restructuring charges and other exit costs (benefits) for GAAP and non-GAAP measures.\nLIQUIDITY AND CAPITAL RESOURCES\nOur primary source of cash is from the sale of our software and related services. Our primary use of cash is payment of our operating costs, which consist primarily of employee-related expenses, such as compensation and benefits, as well as general operating expenses for marketing, facilities, and overhead costs. Long-term cash requirements for items other than normal operating expenses are anticipated for the following: the acquisition of businesses, software products, or technologies complementary to our business; repayment of debt; common stock repurchases; and capital expenditures, including the purchase and implementation of internal-use software applications.\nAt January 31, 2025, our principal sources of liquidity were cash, cash equivalents, and marketable securities totaling $2.15 billion and net accounts receivable of $1.01 billion.\nIn November 2022, Autodesk entered into an amended and restated credit agreement (“Credit Agreement”) by and among Autodesk, the lenders party thereto, and Citibank, N.A., as agent, that provides for a revolving credit facility in the aggregate principal amount of $1.5 billion with an option to be increased up to $2.0 billion. The revolving credit facility is available for working capital or other business needs. The maturity date on the Credit Agreement is September 30, 2026. At January 31, 2025, Autodesk had no outstanding borrowings under the Credit Agreement. Additionally, as of March 6, 2025, we have no amounts outstanding under the Credit Agreement. See Part II, Item 8, Note 8, “Borrowing Arrangements,” in the Notes to Consolidated Financial Statements for further discussion on our covenant requirements. If we are unable to remain in compliance with the covenants under the Credit Agreement, we may not be able to draw on our revolving credit facility.\nAs of January 31, 2025, we had $2.30 billion aggregate principal amount of notes outstanding. See Part II, Item 8, Note 8, “Borrowing Arrangements,” in the Notes to Consolidated Financial Statements for further discussion.\nOur cash and cash equivalents are held by diversified financial institutions globally. Our primary commercial banking relationship is with Citigroup and its global affiliates. In addition, Citibank N.A., an affiliate of Citigroup, is one of the lead lenders and agent in the syndicate of our $1.5 billion revolving credit facility.\nOur cash, cash equivalents, and marketable securities balances are concentrated in a few locations around the world, with substantial amounts held outside of the United States. As of January 31, 2025, approximately 66% of our total cash or cash equivalents and marketable securities are located in foreign jurisdictions and that percentage will fluctuate subject to business needs. There are several factors that can impact our ability to utilize foreign cash balances, such as foreign exchange restrictions, foreign regulatory restrictions, or adverse tax costs. Earnings in foreign jurisdictions are generally available for distribution to the United States with little to no incremental U.S. taxes. We regularly review our capital structure and consider a variety of potential financing alternatives and planning strategies to ensure we have the proper liquidity available in the locations in which it is needed. We expect to meet our liquidity needs through or in combination of current cash balances, ongoing cash flows, and external borrowings.\nCash from operations could also be affected by various risks and uncertainties, including, b",
  "item2_clean": null
}