{
  "source_file": "aee-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS.\nAmeren, headquartered in St. Louis, Missouri, is a public utility holding company whose primary assets are its equity interests in its subsidiaries. Ameren’s subsidiaries are separate, independent legal entities with separate businesses, assets, and liabilities. Dividends on Ameren’s common stock and the payment of expenses by Ameren depend on distributions made to it by its subsidiaries. Ameren’s principal subsidiaries are listed below. Ameren also has other subsidiaries that conduct other activities, such as providing shared services.\nAmeren Missouri operates a rate-regulated electric generation, transmission, and distribution business and a rate-regulated natural gas distribution business in Missouri.\nAmeren Illinois operates rate-regulated electric transmission, electric distribution, and natural gas distribution businesses in Illinois.\nATXI operates a FERC rate-regulated electric transmission business within the MISO.\nAmeren’s and Ameren Missouri’s financial statements are prepared on a consolidated basis and therefore include the accounts of their majority-owned subsidiaries. All intercompany transactions have been eliminated. Ameren Illinois has no subsidiaries. All tabular dollar amounts are in millions, unless otherwise indicated.\nIn addition to presenting results of operations and earnings amounts in total, we present certain information in cents per share. These amounts reflect factors that directly affect Ameren’s earnings. We believe this per share information helps readers to understand the impact of these factors on Ameren’s earnings per diluted share.\nOVERVIEW\nNet income attributable to Ameren common shareholders in the three months ended September 30, 2025, was $640 million, or $2.35 per diluted share, compared with $456 million, or $1.70 per diluted share, in the year-ago period. Net income attributable to Ameren common shareholders in the nine months ended September 30, 2025, was $1,204 million, or $4.43 per diluted share, compared with $975 million, or $3.65 per diluted share, in the year-ago period. Net income was favorably affected for the three and nine months ended September 30, 2025, by increased base rate revenues at Ameren Missouri effective June 1, 2025, pursuant to the April 2025 MoPSC electric rate order and decreased tax expense at Ameren Transmission due to the revaluation of excess deferred income tax regulatory liabilities. Earnings were also favorably affected for the three and nine months ended September 30, 2025, by decreased other operations and maintenance expenses not subject to formula rates, riders, or trackers, largely because of the absence in 2025 of an Ameren Missouri charge related to the resolution of outstanding claims in the NSR and Clean Air Act litigation associated with the Rush Island Energy Center. Additionally, earnings were favorably affected for the three and nine months ended September 30, 2025, by increased retail electric sales volumes at Ameren Missouri, primarily due to warmer July temperatures and colder winter temperatures in 2025 and growth in retail electric sales and by the increased deferral of financing costs related to rate base investments at Ameren Missouri, and by increased infrastructure investments at Ameren Transmission and Ameren Illinois Electric Distribution. Net income was unfavorably affected for the three and nine months ended September 30, 2025, by increased financing costs, primarily resulting from higher interest rates on higher debt balances at Ameren (parent) and Ameren Missouri and by increased other operations and maintenance expenses not subject to formula rates, riders, or trackers, excluding a charge related to the NSR and Clean Air Act litigation, primarily due to higher storm costs, higher energy center maintenance expenses, and higher transmission and distribution vegetation management costs.\nAmeren’s strategic plan includes investing in rate-regulated energy infrastructure, enhancing regulatory frameworks and advocating for responsible policies, and optimizing operating performance to capitalize on opportunities to benefit our customers, communities, shareholders, and the environment. Ameren remains focused on disciplined cost management and strategic capital allocation. Ameren invested $3.1 billion in its rate-regulated businesses in the nine months ended September 30, 2025.\nIn April 2025, Missouri Senate Bill 4 was enacted and became effective in August 2025. The law includes certain provisions that affect the regulation of Ameren Missouri’s electric and natural gas businesses. These provisions create modifications to the PISA and integrated resource planning, require electric utilities to submit service tariff schedules for high-demand customers, allow the MoPSC to authorize inclusion of construction work in progress in rate base for new natural gas-fired generation facilities and new generation facilities approved through integrated resource planning, and allow natural gas utilities to file regulatory rate reviews using a future test year, among other things.\nIn April 2025, the MoPSC issued an order in Ameren Missouri’s 2024 electric service regulatory rate review, approving nonunanimous stipulations and agreements. The order authorizes an increase of $355 million to Ameren Missouri’s annual revenue requirement for electric retail service, effective June 1, 2025. The approved revenue requirement was based on infrastructure investments as of December 31, 2024. The order did not explicitly specify an ROE, capital structure, rate base, or any rate base disallowances. The order provides for the continued use of all existing riders and trackers. The order also changed annualized depreciation, regulatory asset and liability amortization amounts, and the base level of expenses for trackers. On an annualized basis, these changes reflect an increase in “Depreciation and amortization” of approximately $70 million, among other expense changes, on Ameren’s and Ameren Missouri’s consolidated statements of income.\nIn November 2025, Ameren Missouri updated its May 2025 request with the MoPSC to modify its existing large primary service tariff to require customers requesting 75 MWs or more of demand and who are served at transmission level voltage to comply with additional tariff terms. The additional terms include a service term of 12 years plus a ramp period of up to five years to reach peak demand, minimum demand charges of 80% of contracted capacity, customer exit terms and fees, and customer credit and collateral requirements, among other terms. In addition, new customer programs would be available under this tariff, which allow customers to support renewable generation, battery storage, and/or nuclear generation through incremental payments. A decision by the MoPSC is expected by February 2026.\nIn June 2025, Ameren Missouri filed for a CCN with the MoPSC to construct the Big Hollow Natural Gas (800-MW facility) and the Big Hollow Battery Energy Storage (400-MW facility) projects. In August 2025, Ameren Missouri filed for a CCN to construct the Reform Solar Project (250-MW facility). Ameren Missouri expects decisions by the MoPSC in the first half of 2026.\nIn July 2025, the MoPSC issued an order in Ameren Missouri’s 2024 natural gas delivery service regulatory rate review, approving a unanimous stipulation and agreement. The order authorizes an increase of $32 million to Ameren Missouri’s annual revenue requirement for natural gas delivery service, effective September 1, 2025. The order did not explicitly specify an ROE, capital structure, rate base, or any rate base disallowances. The order provides for the continued use of all of Ameren Missouri’s existing riders and trackers.\nIn February 2025, Ameren Missouri filed an update to its Smart Energy Plan with the MoPSC, which includes a five-year capital investment overview with a detailed one-year plan for 2025. The plan is designed to upgrade Ameren Missouri’s electric infrastructure and includes investments that will upgrade the grid and accommodate more renewable energy. Investments under the plan are expected to total approximately $16.2 billion over the five-year period from 2025 through 2029, with expenditures largely recoverable under the PISA. The Smart Energy Plan excludes investments in its natural gas distribution business, as well as removal costs, net of salvage.\nIn December 2024, the ICC issued an order in connection with a revised Grid Plan and a revised MYRP filed by Ameren Illinois in March 2024, approving revenue requirements for electric distribution services for 2024 through 2027 of $1,206 million, $1,287 million, $1,367 million, and $1,421 million, respectively. Rate changes consistent with the December 2024 order became effective in December 2024. In March 2025, Ameren Illinois filed an appeal of the ICC’s December 2024 order to the Illinois Appellate Court for the Fifth Judicial District to revise the allowed ROE and to include an asset associated with other postretirement benefits in the rate base, among other things. In addition, Ameren Illinois filed an appeal related to orders issued by the ICC in December 2023 and June 2024 related to the MYRP proceeding. The appellate court is under no deadline to address the appeals.\nIn April 2025, Ameren Illinois filed for a reconciliation adjustment to its 2024 electric distribution service revenue requirement with the ICC. In September 2025, Ameren Illinois filed a revised reconciliation adjustment, requesting recovery of $60 million. The adjustment reflects Ameren Illinois’ actual 2024 recoverable costs, 2024 year-end rate base, and a capital structure composed of 50% common equity. In September 2025, the ICC staff submitted its calculation of the reconciliation adjustment, recommending recovery of $47 million. The ICC staff’s recommendation excluded an asset associated with other postretirement benefits from th"
}