{
  "source_file": "aep-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "$201 million with counterparties and exchanges). Since open trading contracts are valued based on market prices of various commodities, exposures change daily. See the “Quantitative and Qualitative Disclosures About Market Risk” section of Management’s Discussion and Analysis of Financial Condition and Results of Operations for additional information.\nCertain Power Agreements\nI&M\nA UPA between AEGCo and I&M (the I&M Power Agreement) provides for the sale by AEGCo to I&M of all the energy and capacity available to AEGCo at the Rockport Plant unless it is sold to another utility. I&M is obligated, whether or not power is available from AEGCo, to pay as a demand charge for the right to receive such power (and as an energy charge for any associated energy taken by I&M) net of amounts received by AEGCo from any other sources, sufficient to enable AEGCo to pay all of its operating and other expenses, including a rate of return on the common equity of AEGCo as approved by the FERC. The UPA will continue in effect until the debt obligations of AEGCo secured by the Rockport Plant have been satisfied and discharged (currently expected to be December 2028).\nIn April 2021, AEGCo and I&M executed an agreement to purchase 100% of the interests in Rockport Plant, Unit 2 effective at the end of the lease term on December 7, 2022. Prior to the termination of the lease, I&M assigned 30% of the power to KPCo. Beginning December 8, 2022, AEGCo billed 100% of its share of the Rockport Plant to I&M and ceased billing to KPCo. KPCo reached an agreement with I&M, from the end of the lease through May 2023, to buy capacity from Rockport Plant, Unit 2 through the PCA at a rate equal to PJM’s RPM clearing price. See the “Unit Power Agreements” section of Note 17 - Related Party Transactions for additional information.\nOVEC\nAEP and several nonaffiliated utility companies jointly own OVEC. The aggregate equity participation of AEP in OVEC is 43.47%. Parent owns 39.17% and OPCo owns 4.3%. Under the Inter-Company Power Agreement (ICPA), which defines the rights of the owners and sets the power participation ratio of each, the sponsoring companies are entitled to receive and are obligated to pay for all OVEC capacity (approximately 2,400 MWs) in proportion to their respective power participation ratios. The aggregate power participation ratio of APCo, I&M and OPCo is 43.47%. The ICPA terminates in June 2040. The proceeds from charges by OVEC to sponsoring companies under the ICPA based on their power participation ratios are designed to be sufficient for OVEC to meet its operating expenses and fixed costs. OVEC’s Board of Directors, as elected by AEP and nonaffiliated owners, has authorized environmental investments related to their ownership interests, with resulting expenses (including for related debt and interest thereon) included in charges under the ICPA. OVEC financed capital expenditures in excess of $1 billion in connection with flue gas desulfurization projects and the associated scrubber waste disposal landfills at its two generation plants through debt issuances, including tax-advantaged debt issuances. Both OVEC generation plants are operating with the environmental controls in-service. See Note 18 - Variable Interest Entities and Equity Method Investments for additional information.\nELECTRIC DELIVERY\nOther than AEGCo, AEP’s vertically integrated public utility subsidiaries own and operate transmission and distribution lines and other facilities to deliver electric power. See Item 2 – Properties for more information regarding the transmission and distribution lines. Most of the transmission and distribution services are sold to retail customers of AEP’s vertically integrated public utility subsidiaries in their service territories. These sales are made at rates approved by the state utility commissions of the states in which they operate, and in some instances, approved by the FERC. The FERC regulates and approves the rates for both wholesale transmission transactions and wholesale generation contracts. The use and the recovery of costs associated with the transmission assets of the AEP vertically integrated public utility subsidiaries are subject to the rules, principles, protocols and agreements in place with PJM and SPP, and as approved by the FERC. See Item 1. Business – Vertically Integrated Utilities – Regulation – FERC. As discussed below, some transmission services also are separately sold to nonaffiliated companies.\nOther than AEGCo, AEP’s vertically integrated public utility subsidiaries hold franchises or other rights to provide electric service in various municipalities and regions in their service areas. In some cases, these franchises provide the utility with the exclusive right to provide electric service within a specific territory. These franchises have varying provisions and expiration dates. In general, the operating companies consider their franchises to be adequate for the conduct of their business.\nTransmission Agreement\nAPCo, I&M, KGPCo, KPCo and WPCo own and operate transmission facilities that are used to provide transmission service under the PJM OATT and are parties to the TA. OPCo, which is a subsidiary in AEP’s Transmission and Distribution Utilities segment that provides transmission service under the PJM OATT, is also a party to the TA. The TA defines how the parties to the agreement share the revenues associated with their transmission facilities and the costs of transmission service provided by PJM. The TA has been approved by the FERC.\nTransmission Coordination Agreement and Open Access Transmission Tariff\nPSO, SWEPCo and AEPSC are parties to the TCA. Under the TCA, a coordinating committee is charged with the responsibility of: (a) overseeing the coordinated planning of the transmission facilities of the parties to the agreement, including the performance of transmission planning studies, (b) the interaction of such subsidiaries with independent system operators and other regional bodies interested in transmission planning and (c) compliance with the terms of the AEP and SPP OATTs filed with the FERC and the rules of the FERC relating to such tariffs. Pursuant to the TCA, PSO, SWEPCo and AEPSC each have responsibility for monitoring and reporting situations or problems that materially affect the reliability of PSO’s and SWEPCo’s transmission systems. The TCA also provides for the allocation among the parties of revenues collected for transmission and ancillary services as determined by the FERC-approved OATT for the SPP.\nRegional Transmission Organizations\nAEGCo, APCo, I&M, KGPCo, KPCo and WPCo are members of PJM, and PSO and SWEPCo are members of SPP (both FERC-approved RTOs). RTOs operate, plan and control utility transmission assets in a manner designed to provide open access to such assets in a way that prevents discrimination between participants owning transmission assets and those that do not.\nREGULATION\nAEP’s vertically integrated public utility subsidiaries’ retail rates and certain other matters are subject to traditional cost-based regulation by the state utility commissions. AEP’s vertically integrated public utility subsidiaries are also subject to regulation by the FERC under the Federal Power Act with respect to wholesale power and transmission service transactions. I&M is subject to regulation by the NRC under the Atomic Energy Act of 1954, as amended, with respect to the operation of the Cook Plant. AEP and its vertically integrated public utility subsidiaries are also subject to the regulatory provisions of, much of the Energy Policy Act of 2005, which is administered by the FERC.\nHistorically, state utility commissions have established electric service rates on a cost-of-service basis, which is designed to allow a utility an opportunity to recover its cost of providing service and to earn a reasonable return on its investment used in providing that service. A utility’s cost of service generally reflects its operating expenses, including operation and maintenance expense, depreciation expense and taxes. State utility commissions periodically adjust rates pursuant to a review of: (a) a utility’s adjusted revenues and expenses during a defined test period and (b) such utility’s level of investment. Absent a legal limitation, such as a law limiting the frequency of rate changes or capping rates for a period of time, a state utility commission can review and change rates on its own initiative. Some states may initiate reviews at the request of a utility, customer, governmental or other representative of a group of customers. Such parties may, however, agree with one another not to request reviews of or changes to rates for a specified period of time.\nPublic utilities have traditionally financed capital investments until the new asset is placed in-service. Provided the asset was found to be a prudent investment, it was then added to rate base and entitled to a return through rate recovery. Given long lead times in construction, the high costs of plant and equipment and volatile capital markets, management actively pursues strategies to accelerate rate recognition of investments and cash flow. AEP representatives continue to engage state commissioners and legislators on alternative rate-making options to reduce regulatory lag and enhance certainty in the process. These options include pre-approvals, a return on construction work in progress, rider/trackers, formula rates and the inclusion of future test-year projections into rates.\nThe rates of AEP’s vertically integrated public utility subsidiaries are generally based on the cost of providing traditional bundled electric service (i.e., generation, transmission and distribution service). Historically, the state regulatory frameworks in the service area of the AEP vertically integrated public utility subsidiaries reflected specified fuel costs as part of bundled (or, more recently, unbundled) rates or incorporated fuel adjustment clauses in a utility’s rates and tariffs. Fuel adjustment clauses permit periodic adjustments to fuel cost recovery from customers and therefore provide protection against exposure to fuel cost changes.\nThe following state-by-state analysis summarizes the regulatory environment of certain major jurisdictions in which AEP’s vertically integrated public utility subsidiaries operate. Several public utility subsidiaries operate in more than one jurisdiction. See Note 4 - Rate Matters for more information regarding pending rate matters.\nSWEPCo provides retail electric service in Arkansas at bundled rates approved by the APSC, with rates set on a historical cost-of-service basis and formula rates. Arkansas provides for timely fuel and purchased power cost recovery through respective annual fuel and purchased power recovery mechanisms.\nI&M provides retail electric service in Indiana at fully bundled rates approved by the IURC, with rates set on a forecasted cost-of-service basis. Indiana generally allows for timely recovery of fuel expenses through a fuel recovery surcharge mechanism. I&M is subject to a semi-annual Indiana jurisdictional earnings test.\nKPCo provides retail electric service in Kentucky at bundled rates approved by the KPSC, with rates currently set on a historical cost-of-service basis. Kentucky generally allows for timely recovery of fuel expenses through a fuel recovery surcharge mechanism.\nSWEPCo provides retail electric service in Louisiana at bundled rates approved by the LPSC with rates set on a historical cost-of-service basis and formula rates. Louisiana provides for timely fuel and purchased power cost recovery through respective fuel and purchased power recovery mechanisms updated monthly.\nI&M provides retail electric service in Michigan at both unbundled standard service and open access distribution service rates approved by the MPSC, with rates set on a forecasted cost-of-service basis. Open access distribution service is limited to 10% of I&M’s ",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nAEP\nAEP Texas, AEPTCo, APCo, I&M, OPCo, PSO and SWEPCo\nOmitted pursuant to Instruction I(2)(a). Management’s narrative analysis of the results of operations and other information required by Instruction I(2)(a) is incorporated herein by reference to the material under Management’s Discussion and Analysis of Financial Condition and Results of Operations.",
  "item2_clean": null
}