{
  "source_file": "aes-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nThe condensed consolidated financial statements included in Item 1.—\nFinancial Statements\nForward-Looking Information\nThe following discussion may contain forward-looking statements regarding us, our business, prospects and our results of operations, that are subject to certain risks and uncertainties posed by many factors and events that could cause our actual business, prospects and results of operations to differ materially from those that may be anticipated by such forward-looking statements. These statements include, but are not limited to, statements regarding management’s intents, beliefs, and current expectations and typically contain, but are not limited to, the terms “anticipate,” “potential,” “expect,” “forecast,” “target,” “will,” “would,” “intend,” “believe,” “project,” “estimate,” “plan,” and similar words. Forward-looking statements are not intended to be a guarantee of future results, but instead constitute current expectations based on reasonable assumptions. Factors that could cause or contribute to such differences include, but are not limited to, those described in Item 1A.—\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nReaders are cautioned not to place undue reliance on these forward-looking statements which speak only as of the date of this report. We undertake no obligation to revise any forward-looking statements in order to reflect events or circumstances that may subsequently arise. If we do update one or more forward-looking statements, no inference should be drawn that we will make additional updates with respect to those or other forward-looking statements. Readers are urged to carefully review and consider the various disclosures made by us in this report and in our other reports filed with the SEC that advise of the risks and factors that may affect our business.\nOverview of Our Business\nWe are a diversified power generation and utility company organized into the following four SBUs, mainly organized by technology:\n(solar, wind, energy storage, and hydro),\n(AES Indiana, AES Ohio, and AES El Salvador),\nEnergy Infrastructure\n(natural gas, LNG, coal, pet coke, diesel, and oil), and\nNew Energy Technologies\n(investments in Fluence, Uplight, Maximo, and other initiatives). Prior to the first quarter of 2025, our businesses in Chile (which have a mix of generation sources, including renewables, that were pooled to service our existing PPAs) were reported in the Energy Infrastructure SBU. After the sale or disconnection of a significant portion of AES Andes’ coal plants and the expiration of its coal-indexed contracts with regulated customers at the end of 2024, the results of our businesses in Chile, excluding the two remaining coal plants, are now reported as part of the Renewables SBU. The results of the two remaining coal plants in Chile, Angamos and Cochrane, remain within the Energy Infrastructure SBU. For additional information regarding our business, see Item 1.—\nWe have two lines of business: generation and utilities. Our Renewables, Utilities, and Energy Infrastructure SBUs participate in our first business line, generation, in which we own and/or operate power plants to generate and sell power to customers, such as utilities, industrial users, and other intermediaries. Our Utilities SBU participates in our second business line, utilities, in which we own and/or operate utilities to generate or purchase, distribute, transmit, and sell electricity to end-user customers in the residential, commercial, industrial, and governmental sectors within a defined service area. In certain circumstances, our utilities also generate and sell electricity on the wholesale market. Our New Energy Technologies SBU includes investments in new and innovative technologies to support leading-edge greener energy solutions.\nCompared with last year, third quarter net income increased $302 million, from $215 million to $517 million. This increase is primarily due to higher income tax benefit mainly driven by tax credit transfers, higher margins from new projects in the Renewables SBU, and an increase in rider revenues due to revised rates at AES Indiana and AES Ohio in the Utilities SBU. This was partially offset by lower generation at the Energy Infrastructure SBU and the sale of AES Brasil.\nAdjusted EBITDA, a non-GAAP measure, increased $132 million, from $698 million to $830 million, driven by higher contributions from new projects in the Renewables SBU and an increase in rider revenues due to revised rates at AES Indiana and AES Ohio in the Utilities SBU. This was partially offset by the sale of AES Brasil and the impact of the selldown of AES Ohio.\nAdjusted EBITDA with Tax Attributes, a non-GAAP measure, increased $82 million, from $1,174 million to $1,256 million, due to the drivers above, partially offset by lower realized tax attributes driven by timing of tax attribute recognition.\nCompared with last year, third quarter diluted earnings per share from continuing operations increased $0.22, from $0.72 to $0.94. This increase is mainly driven by higher income tax benefit, higher contributions from new projects in the Renewables SBU, and higher retail margin at the Utilities SBU. This was partially offset by lower realized tax attributes at the Renewables SBU due to timing of tax attribute recognition, lower other income, and lower interest income.\nAdjusted EPS, a non-GAAP measure, increased $0.04 from $0.71 to $0.75, mainly driven by a lower adjusted tax rate, including the impact of tax credit transfers, higher retail margin at the Utilities SBU, and lower general and administrative costs at Corporate. This was partially offset by lower realized tax attributes at the Renewables SBU due to timing of tax attribute recognition.\nCompared with last year, net income for the nine months ended September 30, 2025 decreased $352 million from $646 million to $294 million. This decrease is primarily driven by lower earnings from the Energy Infrastructure SBU due to higher prior year revenues from the monetization of the Warrior Run coal plant PPA, higher day-one losses on the commencement of sales type leases at AES Clean Energy Development, and the sale of AES Brasil. This was partially offset by the derecognition of a valuation allowance on the loan receivable upon reclassifying Mong Duong from held-for-sale to held and used, higher margins from new projects in the Renewables SBU, higher income tax benefit mainly driven by tax credit transfers, lower interest expense, and higher retail margin at AES Indiana in the Utilities SBU under the 2024 Base Rate Order, including the impact of certain riders now included in base rates.\nAdjusted EBITDA, a non-GAAP measure, increased $106 million, from $1,996 million to $2,102 million, for the nine months ended September 30, 2025, mainly driven by higher contributions from new projects in the Renewables SBU and higher retail margin at AES Indiana in the Utilities SBU under the 2024 Base Rate Order, including the impact of certain riders now included in base rates. This was partially offset by higher prior year revenues from the monetization of the Warrior Run coal plant PPA and the sale of AES Brasil.\nAdjusted EBITDA with Tax Attributes, a non-GAAP measure, increased $199 million, from $2,891 million to $3,090 million, for the nine months ended September 30, 2025, due to the drivers above as well as higher realized tax attributes driven by higher income from tax credit transfers.\nCompared with last year, diluted earnings per share from continuing operations for the nine months ended September 30, 2025 decreased $0.85, from $1.71 to $0.86. This decrease is mainly driven by lower earnings at the Energy Infrastructure SBU primarily due to higher prior year revenues from the monetization of the Warrior Run coal plant PPA, day-one losses on the commencement of sales-type leases at AES Clean Energy Development, lower realized tax attributes at the Renewables SBU due to timing of tax attribute recognition, lower interest income, higher foreign currency losses, and lower other income. This was partially offset by the derecognition of a valuation allowance on the loan receivable upon reclassifying Mong Duong from held-for-sale to held and used and higher income tax benefit mainly driven by tax credit transfers.\nAdjusted EPS, a non-GAAP measure, decreased $0.07 from $1.60 to $1.53, for the nine months ended September 30, 2025, mainly driven by lower realized tax attributes at the Renewables SBU due to timing of tax attribute recognition, and lower contributions at the Energy Infrastructure SBU primarily due to higher prior year revenues from the monetization of the Warrior Run coal plant PPA. This was partially offset by a lower adjusted tax rate, including the impact of tax credit transfers, and higher realized tax attributes and retail margin at the Utilities SBU.\nNon-GAAP measure. See Item 2.—\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations\nSBU Performance Analysis\nfor reconciliation and definition.\nOverview of Strategic Performance\nAES is leading the industry's transition to clean energy by investing in renewables, utilities, and technology businesses.\nOur PPA backlog, which consists of projects with signed contracts, but which are not yet operational, is 11.1 GW, including 5 GW under construction. Year-to-date, we:\nCompleted the construction of 2.9 GW of solar, energy storage, and wind, and we are on track to add a total of 3.2 GW to our operating portfolio by year-end 2025; and\nSigned or were awarded new long-term PPAs for 2.2 GW.\nOur U.S. utilities made progress toward securing future growth:\nAES Ohio reached a unanimous settlement resolving its distribution rate review;\nAES Indiana reached a partial settlement agreement for its current rate review; and\nAES Indiana filed a 20-year IRP.\nReview of Conso"
}