{
  "source_file": "afl-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "PART I\nFORWARD-LOOKING INFORMATION\nThe Company cautions readers that the following factors, in addition to other factors mentioned from time to time, could cause actual results to differ materially from those contemplated by the forward-looking statements:\ndifficult conditions in global capital markets and the economy, including inflation\ndefaults and credit downgrades of investments\nglobal fluctuations in interest rates and exposure to significant interest rate risk\nconcentration of business in Japan\nlimited availability of acceptable yen-denominated investments\nforeign currency fluctuations in the yen/dollar exchange rate\ndiffering interpretations applied to investment valuations\nsignificant valuation judgments in determination of expected credit losses recorded on the Company's investments\ndecreases in the Company's financial strength or debt ratings\ndecline in creditworthiness of other financial institutions\nthe Company's ability to attract and retain qualified sales associates, brokers, employees, and distribution partners\ndeviations in actual experience from pricing and reserving assumptions\nability to continue to develop and implement improvements in information technology systems and on successful execution of revenue growth and expense management initiatives\ninterruption in telecommunication, information technology and other operational systems, or a failure to maintain the security, confidentiality, integrity or privacy of sensitive data residing on such systems\nsubsidiaries' ability to pay dividends to the Parent Company\ninherent limitations to risk management policies and procedures\noperational risks of third-party vendors\ntax rates applicable to the Company may change\nfailure to comply with restrictions on policyholder privacy and information security\nextensive regulation and changes in law or regulation by governmental authorities\ncompetitive environment and ability to anticipate and respond to market trends\ncatastrophic events, including, but not limited to, as a result of climate change, epidemics, pandemics, tornadoes, hurricanes, earthquakes, tsunamis, war or other military action, major public health issues, terrorism or other acts of violence, and damage incidental to such events\nability to protect the Aflac brand and the Company's reputation\nability to effectively manage key executive succession\nchanges in accounting standards\nlevel and outcome of litigation or regulatory inquiries\nallegations or determinations of worker misclassification in the United States\nITEM 1. BUSINESS\nOVERVIEW\nAflac Incorporated (the Parent Company) was incorporated in 1973 under the laws of the state of Georgia. The Parent Company and its subsidiaries (collectively, the Company) provide financial protection to millions of policyholders and customers in Japan and the United States (U.S.). The Company’s principal business is supplemental health and life insurance products with the goal to provide customers the best value in supplemental insurance products in Japan and the U.S. When a policyholder or insured gets sick or hurt, the Company pays cash benefits fairly and promptly for eligible claims. Throughout its 69-year history, the Company’s supplemental insurance policies have given policyholders the opportunity to focus on recovery, not financial stress.\nThe Company has continued to develop and expand its product offerings over time. In Japan, the Company is cultivating an innovation-driven culture to meet the rapidly changing customer and societal needs. In the U.S., the Company continues to make broad-based investments in digital enhancements and innovation within the U.S. platform. In recent years, the Company invested in distribution opportunities through acquisitions and partnerships and pivoted to digital sales methods. For information on the reporting segments see the Result of Operations by Segment section of Item 7. Management's Discussion and Analysis of Financial Condition and Results of Operations (MD&A).\nREVENUE-GENERATING ACTIVITIES\nThe Company's strategy for growth in the U.S. and Japan has remained straightforward and consistent for many years. The Company develops relevant supplemental health insurance products offering financial protection from the rising out-of-pocket expenses associated with medical events that are not covered by the insureds' primary coverage. The Company also offers a complement of other voluntary health and life insurance products to fit the needs of its customers. Additionally, the Company aims to obtain more customers by selling where the customer prefers to purchase protection, whether through an agent or broker, a distribution partner or directly from the Company. To help promote its insurance products, the Company’s marketing campaigns feature the Aflac Duck.\nLONG-TERM GROWTH STRATEGY\nIn 1999, the Company had been running commercials for nearly a decade, but its brand awareness was hovering at about 10%. An innovative marketing campaign with something unique and memorable that would build brand awareness was needed. The Aflac Duck’s first commercial in the U.S., “Park Bench,” aired on January 1, 2000 and taught consumers how to pronounce “Aflac.” The Aflac Duck made its international debut in Japan in 2003. In the time since its U.S. debut, the Aflac Duck has become one of the most familiar advertising icons in the world, appearing in many commercials and countless print ads in both the U.S. and Japan. Today, the Aflac Duck is a helpmate who increases brand knowledge and connection.\nThe Company's insurance business consists of two reporting segments: Aflac Japan and Aflac U.S. The primary insurance subsidiary in the Aflac Japan segment is Aflac Life Insurance Japan Ltd. (ALIJ). Aflac U.S. includes the insurance subsidiaries American Family Life Assurance Company of Columbus (Aflac); Continental American Insurance Company (CAIC), branded as Aflac Group Insurance (AGI); American Family Life Assurance Company of New York (Aflac New York); Tier One Insurance Company (TOIC); and Aflac Benefits Solutions, Inc. (ABS), which provides a platform for Aflac Dental and Vision in the U.S.\nFor information on the Company's results of operations and financial information by segment, see Item 7. MD&A and Note 2 of the Notes to the Consolidated Financial Statements.\nAFLAC JAPAN\nAflac Japan is the principal contributor to the Parent Company's consolidated earnings and the largest insurer in Japan in terms of cancer and medical (third sector insurance products) policies in force. For information on Aflac Japan's operating results, see the Aflac Japan Segment section of Item 7. MD&A.\nAflac Japan's third sector insurance products are supplemental products designed to help consumers pay for medical and nonmedical costs that are not reimbursed under Japan's national health insurance system. Changes in Japan's economy and an aging population have put increasing pressure on Japan's national health care system. As a result, more costs have been shifted to Japanese consumers, who in turn have become increasingly interested in insurance products that help them manage those costs. Aflac Japan has responded to this consumer need by enhancing existing products and developing new products. The focus at Aflac Japan remains on maintaining leadership in third sector insurance products that are less interest rate sensitive and have strong and stable margins. At the same time, Aflac Japan complements this core business with similarly profitable first sector products as outlined below.\nThird Sector Insurance Products\n\nConsumers in Japan rely on banks to provide not only traditional bank services, but also as one key source to provide insurance solutions and other services. At December 31, 2024, Aflac Japan had agreements with approximately 90% of the total number of banks in Japan to sell its products.\nThe Company competes with other insurance carriers through policyholder service, price, product design and sales efforts, as the number of insurance companies offering stand-alone cancer and medical insurance has more than doubled since the deregulation of the Japan market in 2001. However, based on Aflac Japan's size of annualized premiums in force and diversified distribution network, the Company believes it is well-positioned to continue to adapt to increased competition. Furthermore, the Company believes the continued development and maintenance of operating efficiencies will allow Aflac Japan to offer affordable products that appeal to consumers. The Company believes Aflac Japan will remain a leading provider of third sector products such as cancer and medical insurance coverage in Japan, principally due to its experience in the market, well-known brand, low-cost operations, expansive marketing system and product expertise.\nGovernment Regulation\nFinancial Services Agency (FSA)\nThe financial and business affairs of Aflac Japan are subject to examination by Japan's FSA. Aflac Japan files annual and interim reports and financial statements for the Japanese insurance operations based on a March 31 fiscal year end, prepared in accordance with Japanese regulatory accounting practices prescribed or permitted by the FSA. Japanese regulatory basis earnings are determined using accounting principles that differ materially from U.S. generally accepted accounting principles (U.S. GAAP). For additional information, see Note 13 of the Notes to the Consolidated Financial Statements.\nTwo FSA regulations applicable to Aflac Japan are outlined below.\nPrivacy and Cybersecurity\nWith regard to personal information obtained from policyholders, the insured, or others, Aflac Japan is regulated in Japan by the Act on the Protection of Personal Information (APPI) and guidelines issued by FSA and other governmental authorities.\nFSA Solvency Standard\nThe FSA maintains a solvency standard, the solvency margin ratio (SMR), which is used by Japanese regulators to monitor the financial strength of insurance companies. Aflac Japan's SMR is sensitive to interest rate, credit spread and foreign exchange rate changes. See the Liquidity and Capital Resources section of Item 7. MD&A for additional information on SMR, including a discussion of measures the Company has taken to mitigate the sensitivity of Aflac Japan's SMR and the introduction of an economic value-based solvency regime based on the Insurance Capital Standards (ICS) for insurance companies effective for Aflac Japan's 2025 fiscal year.\nCompanies Act of Japan\n\nWhile Aflac U.S. primarily markets its insurance products at the worksite, Aflac U.S. is also expanding its distribution strategy to directly reach consumers outside of the traditional worksite through digital lead generation.\nAflac U.S. competes against several supplemental insurance carriers on a national and regional basis. Aflac U.S. believes its policies, premium rates, platforms, value-added services and sales commissions are competitive by product type. Moreover, Aflac U.S. believes that its products are distinct from competitive offerings given its product focus (including features, benefits and claims service model), distribution capabilities and brand awareness.\nSince Aflac products provide an additional level of financial protection for policyholders, the Company believes the increased financial exposure some employees may face creates a favorable opportunity for Aflac U.S. products. However, given the profitability erosion some major medical carriers are facing in their core lines of business, the Company has seen a more competitive landscape as these carriers seek entry into Aflac's supplemental product segments and leverage their core benefit offerings by bundling and discounting products in order to gain market share.\nGovernment Regulation\nState Insurance Regulation\n\nFederal legislation and administrative policies in several areas, including health care reform legislation, financial services reform legislation, securities regulation, pension regulation, privacy, tort re",
  "item7_clean": "For Aflac U.S., the Company expects growth in life and disability to increase benefit ratios. This growth as well as realized benefits from the buy to build initiatives are expected to decrease expense ratios over time. For the 2025 through 2027 period, the Company expects Aflac U.S. to generate a benefit ratio in the range of 48% to 52% and an expense ratio in the range of 36% to 39%. For 2025, the Company expects the benefit ratio to be at the lower end of the 48% to 52% range and the expense ratio to be at the higher end of the 36% to 39% range.\nThe Company's objectives for Corporate and other in 2025 include maintaining strong pretax adjusted earnings as compared with 2024, assuming that U.S. interest rates remain stable and excluding the impact of tax credit investments, as tax benefits are recognized in a corresponding lower income tax expense.\nFor important disclosures applicable to statements made in this 2025 Outlook, please see the statement on Forward-Looking Information at the beginning of Item 1. Business, the Risk Factors identified in Item 1A. and this Item 7. MD&A.\nRESULTS OF OPERATIONS\nThe Company earns its revenues principally from insurance premiums and investments. The Company’s operating expenses primarily consist of insurance benefits provided and reserves established for anticipated future insurance benefits, general business expenses, commissions and other costs of selling and servicing its products. Profitability for the Company depends principally on its ability to price its insurance products at a level that enables the Company to earn a margin over the costs associated with providing benefits and administering those products. Profitability also depends on, among other items, actuarial and policyholder behavior experience on insurance products, and the Company's ability to attract and retain customer assets, generate and maintain favorable investment results, effectively deploy capital and utilize tax capacity, and manage expenses.\nThis document includes references to the Company’s financial performance measures which are not calculated in accordance with United States generally accepted accounting principles (U.S. GAAP) (non-U.S. GAAP). The financial measures exclude items that the Company believes may obscure the underlying fundamentals and trends in insurance operations because they tend to be driven by general economic conditions and events or related to infrequent activities not directly associated with insurance operations.\nDue to the size of Aflac Japan, where the functional currency is the Japanese yen, fluctuations in the yen/dollar exchange rate can have a significant effect on reported results. In periods when the yen weakens, translating yen into dollars results in fewer dollars being reported. When the yen strengthens, translating yen into dollars results in more dollars being reported. Consequently, yen weakening has the effect of suppressing current period results in relation to the comparable prior period, while yen strengthening has the effect of magnifying current period results in relation to the comparable prior period. A significant portion of the Company’s business is conducted in yen and never converted into dollars but translated into dollars for U.S. GAAP reporting purposes, which results in foreign currency impact to earnings, cash flows and book value on a U.S. GAAP basis. Management evaluates the Company's financial performance both including and excluding the impact of foreign currency translation to monitor, respectively, cumulative currency impacts and the currency-neutral operating performance over time. The average yen/dollar exchange rate is based on the published MUFG Bank, Ltd. telegraphic transfer middle rate (TTM).\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n\nDeferred Policy Acquisition Costs and Liability for Future Policy Benefits\nThe majority of the supplemental health and life insurance policies the Company issues are classified as long-duration contracts. The contract provisions generally cannot be changed or canceled during the contract period; however, the Company may adjust premiums for supplemental health policies issued in the U.S. within prescribed guidelines and with the approval of state insurance regulatory authorities.\nInsurance premiums for most of the Company's health and life policies, including cancer, accident, hospital, critical illness, supplemental dental and vision, term life, whole life, long-term care and disability, are recognized as earned premiums over the premium-paying periods of the contracts when due from policyholders. When earned premiums are reported, the related amounts of benefits and expenses are charged against such revenues. This association is accomplished by means of annual increases or decreases to the LFPB and the deferral and subsequent amortization of policy acquisition costs.\nPremiums from the Company's products with limited-pay features, including cancer, medical and nursing care, term life, whole life, WAYS, and child endowment, are collected over a significantly shorter period than the contract term (i.e., the period during which benefits are provided). Premiums for these products are recognized as earned premiums over the premium-paying periods when due from policyholders. Any gross premium in excess of the net premium is deferred and recorded as a deferred profit liability, a component of the LFPB, which is subsequently amortized in net earned premiums such that profits are recognized in a constant relationship with insurance in force. Benefits are recorded as an expense when they are incurred. An LFPB is recorded when premiums are recognized using the net premium method.\nDeferred Policy Acquisition Costs\nAmortization of DAC is computed using the same contract groupings (also referred to as cohorts) and mortality and termination assumptions that are used in computing the LFPB and these assumptions are reviewed and updated at least annually. The effects of changes in assumptions are recognized prospectively over the remaining contract term as a revision of the future amortization pattern, while current period amortization is calculated based on the actual experience during the quarter. For additional information, see Note 6 of the Notes to the Consolidated Financial Statements.\nLiability for Future Policy Benefits\nThe Company's LFPB is determined in accordance with applicable guidelines as defined under U.S. GAAP and Actuarial Standards of Practice and represent claims that are expected to occur in the future and already incurred claims (which represent claims that have been incurred and are in the process of payment as well as an estimate of those claims that have been incurred but have not yet been reported to the Company) and are measured using the net level premium method. Future policy benefits are calculated using assumptions and estimates including mortality, morbidity, termination (also referred to as lapses), expense, and discount rates. The assumptions and estimates that the Company uses depend on its judgment regarding the likelihood of future events and are inherently uncertain.\nCash flow assumptions (mortality, morbidity, and termination) are established at policy inception and are evaluated each quarter to determine if an update is needed. To facilitate a more detailed review of cash flow assumptions, experience studies are performed annually during the third quarter. Changes in cash flow assumptions are recognized in reserve remeasurement (gains) losses in the consolidated statements of earnings. Expense assumptions are established at policy inception and are not updated. Actual experience is reflected in the calculation of future policy benefits each quarter, and changes in the liability due to actual experience are recognized in reserve remeasurement (gains) losses in the consolidated statements of earnings.\nDiscount rates used to calculate net premiums are locked in at policy inception and represent the basis to recognize interest expense accreted on insurance reserves in benefits and claims, excluding reserve remeasurement in the consolidated statements of earnings. Discount rates used to measure the carrying value of LFPB in the consolidated balance sheets are updated each reporting period, and the differences between the liability balances calculated using the locked-in discount rates and the updated discount rates are recognized in accumulated other comprehensive income (loss). The discount rate methodology is designed to prioritize observable inputs based on market data available in the local debt markets where the respective policies were issued in the currency in which the policies are denominated. For the discount rates applicable to tenors for which the single-A debt market is not liquid or there is little or no observable market data, the Company uses various estimation techniques consistent with the fair value guidance in ASC 820 - Fair Value Measurement, which include, but are not limited to: (i) for tenors where there is less observable market data and/or the observable market data is available for similar instruments, estimating tenor-specific single-A credit spreads and\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n\nWith Japan’s aging population and the rise in healthcare costs, supplemental health care insurance products remain attractive. Additionally, as Japan enters an era of 100-year lifespans, customers' needs for asset formation and retirement coverage, including nursing care, are increasing. Japan’s existing customers and potential customers seek products that are easily understood, cost-effective and can be accessed through technology-enabled devices.\nCustomer demographics continue to evolve and new opportunities present themselves in different customer segments such as the millennial and multicultural markets. Customer expectations and preferences are changing. Trends indicate existing customers and potential customers seek cost-effective solutions that are easily understood and can be accessed through technology-enabled devices. Additionally, income protection and the health needs of retiring baby boomers are continuing to shape the insurance industry.\nRegulatory Environment\nSee Item 1. Business - Aflac Japan Government Regulation and Aflac U.S. Government Regulation for a discussion of regulatory developments that may impact the Company and the associated risks.\nCompetitive Environment\nSee Item 1. Business - Aflac Japan Competitive Markets and Aflac U.S. Competitive Markets for a discussion of the competitive environment and the basis on which the Company competes in each of its segments.\n2025 OUTLOOK\nThe Company’s strategy to drive long-term shareholder value is to pursue growth and strong profit margins and to exercise tactical capital deployment. The Company's approach to pursue growth is through product development and distribution expansion and to achieve efficiencies by modernizing its technology and streamlining its operations.\nThe Company's objectives in 2025 include maintaining strong pretax margins with increased sales production through product refreshments and growth initiatives in both its Aflac Japan and Aflac U.S. segments. For Aflac Japan, this includes continuing to focus on third sector products as well as introducing policies to new and younger customers. For Aflac U.S., this includes continuing to focus on realizing benefits from its buy to build initiatives and other platform investments, maintaining strong expense management discipline and strengthening the number of career agents for Aflac U.S. The Company believes that its strategy of positioning itself for future growth and efficiency while defending and leveraging its market-leading position, powerful brand recognition and varied distribution in Japan and the U.S. will provide support toward these objectives.\nIn December 2024, the board of directors announced a 16.0% increase in the quarterly cash dividend, effective with the first quarter of 2025. The Company intends to maintain strong capital ratios in Aflac Japan and Aflac U.S. in support of its commitment to shareholder dividends while remaining tactical in its deployment of capital in the form of share repurchases and opportunistic investments. The Company's economic solvency ratio (ESR) target range is 170% to 230% for Aflac Japan and a target combined RBC range of 350% to 450%, over time, for Aflac U.S., which is consistent with the Company's risk management practices.\nFor Aflac Japan, the Company anticipates that favorable morbidity experience and the shift in premiums over the last several years from first sector savings products to third sector cancer and medical products and first sector protection products will result in stable benefit ratios in the Aflac Japan segment with a slightly higher expense ratio reflecting growth and strategic initiatives. The Company also expects that benefit and expense ratios will continue to experience some level of revenue pressure due to the impact of paid up policies and internal reinsurance transactions. For the 2025 through 2027 period, the Company expects Aflac Japan to generate a\nbenefit ratio in the range of 64% to 66% and an expense ratio in the range of 20% to 23%. For 2025, the Company expects the benefit ratio to be toward the higher end of the 64% to 66% range and the expense ratio to be on the lower end of the 20% to 23% range.\nItem 7. Management's Discussion and Analysis of Financial Condition and Results of Operations\n\nThe Company defines the non-U.S. GAAP financial measures included in this document as follows:\nare adjusted revenues less benefits and adjusted expenses. Adjusted earnings per share (basic or diluted) are the adjusted earnings for the period divided by the weighted average outstanding shares (basic or diluted) for the period presented. The adjustments to both revenues and expenses account for certain items that are outside of management’s control because they tend to be driven by general economic conditions and events or are related to infrequent activities not directly associated with insurance operations. Adjusted revenues are U.S. GAAP total revenues excluding adjusted net investment gains and losses. Adjusted expenses are U.S. GAAP total acquisition and operating expenses including the impact of interest from derivatives associated with notes payable but excluding any non-recurring or other items not associated with the normal course of the Company’s insurance operations and that do not reflect the Company's underlying business performance. Management uses adjusted earnings and adjusted earnings per diluted share to evaluate the financial performance of the Company’s insurance operations on a consolidated basis and believes that a presentation of these financial measures is vitally important to an understanding of the underlying profitability drivers and trends of the Company’s insurance business. The most comparable U.S. GAAP financial measures for adjusted earnings and adjusted earnings per share (basic or diluted) are net earnings and net earnings per share, respectively.\nAdjusted net investment gains and losses\nare net investment gains and losses adjusted for i) amortized hedge cost/income related to foreign currency exposure management strategies and certain derivative activity, ii) net interest income/expense from foreign currency and interest rate derivatives associated with certain investment strategies, which are both reclassified to net investment income, and iii) the impact of interest from derivatives associated with notes payable, which is reclassified to interest expense as a component of total adjusted expenses. The Company considers adjusted net investment gains and losses important as it represents the remainder amount that is considered outside management’s control, while excluding the components that are within mana",
  "item2_clean": null
}