{
  "source_file": "aiz-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "to the Consolidated Financial Statements included elsewhere in this Report.\nOur Products and Services\nThe key lines of business in Global Lifestyle are: Connected Living, which includes mobile device solutions (including extended service contracts, insurance policies and device lifecycle related services), extended service contracts and related services for consumer electronics and appliances, and financial services and other insurance products; and Global Automotive.\nThrough partnerships with mobile service providers (including carriers, retailers, original equipment manufacturers (“OEMs”) and cable operators) and financial and other institutions, we underwrite and provide administrative support and related services for extended service contracts. These contracts provide consumers with coverage on mobile devices and consumer electronics and appliances, protecting them from certain covered losses. We pay the cost of repairing or replacing these consumer goods in the event of loss, theft, accidental damage, mechanical breakdown or electronic malfunction after the manufacturer's warranty expires. Our strategy is to provide integrated service solutions to our clients that address all aspects of the insurance or extended service contract, including program design and marketing strategy, risk management, data analytics, customer support and claims handling, supply chain services, service delivery and repair and logistics management, while ensuring exceptional customer experience measured through our net promoter scores. For example, we provide end-to-end mobile device lifecycle solutions in our mobile business from when the device is received and inspected, repaired or refurbished, to when it is ultimately disposed of through a sale to a third-party or used to support an insurance claim. In addition to extended protection for multiple devices, our mobile offerings include trade-in and upgrade programs, premium technical support, including device self-diagnostic tools, and device disposition. We also sell repaired or refurbished mobile and other electronic devices, as well as provide Certified Pre-Owned (“CPO”) devices to our clients to fulfill their insurance and consumer needs. We provide in-store, same-day device repairs to customers through our nationwide network of over 900 repair and partner locations that support both our insurance and non-insurance customers. We believe that with the required administrative capability, digital platforms enabling on-boarding, claims management and service delivery, supply chain management, technical support infrastructure, insurance underwriting capabilities and a variety of adjacent value-added services, like trade-in and upgrade and asset value recovery, we maintain a differentiated position in this marketplace.\nWithin Connected Living, our global financial services business maintains a suite of protection and assurance products that deliver a combination of features and benefits for varying customer segment needs. With major financial services clients, we provide value-added financial services in the U.S. and internationally, ranging from credit insurance to inclusive credit card benefits, packaged bank account benefits and travel coverages.\nWe underwrite and provide administrative services for vehicle service contracts (“VSCs”) and ancillary products providing coverage for vehicles, including automobiles, trucks, recreational vehicles, motorcycles, construction and agricultural equipment, as well as parts. For VSCs, we pay the cost of repairing a customer’s vehicle in the event of mechanical breakdown. For ancillary products, including relating to commercial and other leased or financed equipment, coverage varies, but, generally, we pay the cost of repairing, servicing or replacing parts or provide other financial compensation in the event of mechanical breakdown, accidental damage or theft. We provide integrated service offerings to our clients, including program design and marketing strategy, risk management, data analytics, customer support and claims handling, reinsurance facilitation, actuarial consulting, experiential and digital training and performance management. We work closely with our global partners to develop innovative offerings that reflect the evolution of the auto market, such as Assurant Vehicle Care which represents a majority of dealer services contracts providing a comprehensive suite of enhanced vehicle protection products and a new digital experience for consumers. We also provide risk management solutions tailored for commercial and leased equipment where our core products include insurance tracking and physical damage insurance.\nDistribution and Clients\nGlobal Lifestyle operates globally, with approximately 82.1% of its revenue from North America (the U.S. and Canada), 7.5% from Latin America (Brazil, Argentina, Puerto Rico, Mexico, Chile, Colombia and Peru), 5.9% from Europe (the United Kingdom (the “U.K.”), France, Italy, Spain, Germany and the Netherlands) and 4.5% from Asia Pacific (Japan, Australia, New Zealand, South Korea, India, Singapore and Hong Kong for the year ended December 31, 2024). In fourth quarter 2023, we made the decision to fully exit our operations in mainland China (other than Hong Kong), which were subsequently sold in 2024. Global Lifestyle focuses on establishing strong, long-term relationships with clients that are leaders in their markets, including leading distributors of our products and services. In Connected Living, we partner with mobile service providers (including carriers, retailers, OEMs and cable operators) and financial and other institutions to market our mobile device solutions, with some of the largest OEMs, consumer electronics retailers, appliance retailers (including e-commerce retailers) and cable operators to market our extended service contracts and related services, and with financial institutions, insurers and retailers to market our credit and other insurance products. In Global Automotive, we partner with auto dealers and agents, third-party administrators, manufacturers, equipment retailers and large banks and financing companies to market our vehicle protection, commercial equipment-related products and other related services. Many of our agreements in Global Lifestyle are exclusive and multi-year with terms generally between three and five years and allow us to integrate our administrative systems with those of our clients.\nGlobal Lifestyle is dependent on a few clients, in particular mobile service providers, and a reduction in business with or the loss of one or more such clients could have a material adverse effect on our results of operations and cash flows. See “Item 1A – Risk Factors – Business, Strategic and Operational Risks –\nOur revenues and profits may decline if we are unable to maintain relationships with significant clients, distributors and other parties, or renew contracts with them on favorable terms, or if those parties face financial, reputational or regulatory issues.\nOur Addressable Markets and Market Activity\nThe mobile protection market is a large and growing global market with evolving wireless standards. While smartphone penetration in the U.S., Japanese and European markets is high, other markets are less mature and present growth opportunities. Global adoption of 5G by subscribers is a high priority for mobile service providers. The worldwide used and refurbished smartphone market is growing, driven by the cost and availability of new devices and sustainability-conscious customers.\nConsumer needs relating to mobile devices are continuing to expand in scope. We believe there are growth opportunities in bundled protection products, which support customers as they take full advantage of the features and functions of their mobile devices through their daily interaction with a connected world. Expanded capabilities like repair and logistics, technical support for customers and enhanced customer experience through digital solutions and AI allow us to create product and service offerings that customers find compelling. We believe there are additional growth opportunities in expanding protection to other devices and technologies within the home.\nOur business is subject to fluctuations in mobile device trade-in and upgrade volumes based on the release of new devices and carrier promotional programs, as well as customer preferences.\nU.S. new vehicle sales have shown slight improvements from 2023 driven by increased vehicle availability and OEM incentives. The used vehicle market in the U.S. has started to normalize from recent elevated used vehicle prices and a shift in sales to new vehicles, but this normalization is tempered by lower and aging used vehicle inventory. In addition, higher interest rates have impacted affordability of finance and insurance products and lowered attachment rates. The commercial equipment segment continues to expand, partially mitigating challenges in our U.S. auto business. In addition, new vehicle sales continue to grow in some markets internationally. In addition, inflation continues to have a significant impact on our Global Automotive results as parts and labor adversely affect claims costs for clients where we have underwriting exposure.\nConsumers are becoming increasingly connected across their mobile devices, vehicles and homes, which is creating a global market for smart home devices and related services. We believe this will create long-term opportunities for Assurant as consumers’ lifestyles will increasingly intertwine with their connected ecosystems, which we call the connected world. Due to our capabilities, including device protection, premium technology support, service delivery and financing, as well as technology components such as dynamic fulfillment, which integrates a dynamic mobile claims management process with risk and fraud mitigation, we are well positioned to support customers as the smart home market continues to grow.\nIn our financial services business, our focus is on expanding our partnerships with leading financial institutions to offer travel, purchase protection, and other credit card benefits, including underwriting and claims processing, and packaged bank account offerings to their customers.\nWe earn premiums on our insurance and extended service contracts and fees for our other services. For a portion of our contracts, we share in the underwriting risk with our clients through reinsurance or profit-sharing agreements. We believe that these arrangements better align our clients’ interests with ours and help us to better manage risk exposure. For additional risks relating to our Global Lifestyle segment, please see “Item 1A – Risk Factors.”\nIn our mobile business, we carry inventory to meet the delivery requirements of certain clients. These devices are ultimately disposed of through sales to third parties. Our inventory includes devices and parts on consignment with our nationwide network of over 900 repair and partner locations through which we provide in-store repairs. Inventory levels may vary from period to period due to, among other things, differences between actual and forecasted demand, supply chain constraints, the addition of new devices and parts, and strategic purchases. Payment terms with clients also vary, which may result in less inventory financed by clients and more inventory financed with our own capital.\nWe take various actions to manage our inventory, including monitoring our inventory levels, managing the timing of purchases and obtaining return rights for some programs and devices. However, the value of certain inventory could be adversely impacted by technological changes affecting the usefulness or desirability of the devices and parts, physical problems resulting from faulty design or manufacturing, increased competition, decreased consumer demand, including due to changes in customer preferences and changes in client promotions, supply chain co",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nThe following discussion and analysis of our financial condition and results of operations should be read in conjunction with our Consolidated Financial Statements and accompanying notes included elsewhere in this Report. It contains forward-looking statements that involve risks and uncertainties. Our actual results might differ materially from those projected in these forward-looking statements as a result of various factors, including those discussed below and elsewhere in this Report, particularly under the headings “Item 1A – Risk Factors” and “Forward-Looking Statements.”\nAs of December 31, 2024, we had two reportable operating segments which are defined based on the manner in which the Company’s chief operating decision maker, our CEO, reviews the business to assess performance and allocate resources, and which align to the nature of the products and services offered:\nGlobal Lifestyle: includes mobile device solutions (including extended service contracts, insurance policies and related services), extended service contracts and related services for consumer electronics and appliances, and financial services and other insurance products (referred to as “Connected Living”); and vehicle protection services, commercial equipment services and other related services (referred to as “Global Automotive”); and\nGlobal Housing: includes lender-placed homeowners, manufactured housing and flood insurance, as well as voluntary manufactured housing, condominium and homeowners insurance (referred to as “Homeowners”); and renters insurance and other products (referred to as “Renters and Other”).\nIn addition, we report the Corporate and Other segment, which includes corporate employee-related expenses and activities of the holding company.\nWe define Adjusted EBITDA, our segment measure of profitability, as net income excluding net realized gains (losses) on investments and fair value changes to equity securities, non-core operations (which consists of certain businesses which we have fully exited or expect to fully exit, including the long-tail commercial liability businesses (sharing economy and small commercial businesses), certain legacy long-duration insurance policies and our operations in mainland China (not Hong Kong)), restructuring costs related to strategic exit activities (outside of normal periodic restructuring and cost management activities), Assurant Health runoff operations, interest expense, provision (benefit) for income taxes, depreciation expense, amortization of purchased intangible assets, as well as other highly variable or unusual items. In 2024, mainland China operations were sold.\nSummary of Financial Results\nConsolidated net income\nincreased $117.7 million, or 18%, to $760.2 million for Twelve Months 2024 from $642.5 million for Twelve Months 2023, primarily due to higher Global Housing segment earnings, lower impact of foreign exchange, and lower losses from non-core operations and lower restructuring costs, partially offset by higher reportable catastrophes and higher depreciation expense.\nGlobal Lifestyle Adjusted EBITDA\ndecreased $18.9 million, or 2%, to $773.4 million for Twelve Months 2024 from $792.3 million for Twelve Months 2023, primarily driven by elevated claims costs in Global Automotive and approximately $25.0 million of investments in new client programs and capabilities in Connected Living to support future growth. This decrease was partially offset by a modest increase in Connected Living primarily due to increased contributions in Global Financial Services, higher investment income and improved results within extended service contracts.\nGlobal Lifestyle net earned premiums, fees and other income\nincreased $405.9 million, or 5%, to $8.97 billion for the Twelve Months 2024 from $8.56 billion for Twelve Months 2023, primarily due to contributions from newly launched trade-in programs and device protection programs.\nGlobal Housing Adjusted EBITDA\nincreased $97.0 million, or 17%, to $671.2 million for Twelve Months 2024 from $574.2 million for Twelve Months 2023, primarily driven by growth in Homeowners, partially offset by $134.2 million of higher pre-tax reportable catastrophes. Excluding reportable catastrophes, Adjusted EBITDA increased 34% due to top-line growth and expense leverage within Homeowners, more favorable prior year reserve development, lower reinsurance costs, and growth in Renters from the property management channel.\nGlobal Housing net earned premiums, fees and other income\nincreased $314.1 million, or 15%, to $2.46 billion for Twelve Months 2024 from $2.14 billion for Twelve Months 2023, primarily due to Homeowners top-line growth, including growth in policies in-force and higher average premiums within lender-placed, as well as growth across various specialty Homeowners products.\nCorporate and Other Adjusted EBITDA\nwas $(122.2) million for Twelve Months 2024 compared to $(109.0) million for Twelve Months 2023, primarily driven by higher third-party and employee-related expenses.\nIn addition, the California Wildfires began in January 2025, causing significant damage throughout the Los Angeles metropolitan area and surrounding regions. At the time of this filing, the claims process continues and our current view is that reportable catastrophes from the California Wildfires are expected to approach or slightly exceed our catastrophe reinsurance program per event retention of $150 million.\n\nFees and other income\nNet investment income\nBenefits, losses and expenses:\nPolicyholder benefits\nSelling and underwriting expenses\nTotal benefits, losses and expenses\nGlobal Lifestyle Adjusted EBITDA\nNet earned premiums, fees and other income:\nNet earned premiums, fees and other income:\nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023\ndecreased $18.9 million, or 2%, to $773.4 million for Twelve Months 2024 from $792.3 million for Twelve Months 2023, primarily due to elevated claims costs in Global Automotive, mainly from higher losses in select ancillary products, and from higher labor and parts costs due to inflation, higher expenses for investments in new client programs and capabilities in Connected Living, declines across mobile from trade-in programs due to the business mix and lower volumes and from mobile device protection from higher loss experience, and the unfavorable impact of foreign exchange. The decrease in Adjusted EBITDA was partially offset by higher net investment income across Global Lifestyle, as well as improved contributions from our financial services business and improved results within extended service contracts.\nincreased $415.0 million, or 5%, to $9.32 billion for Twelve Months 2024 from $8.91 billion for Twelve Months 2023. Fees and other income increased $262.5 million, or 22%, primarily due to contributions from newly launched global mobile trade-in programs. Net earned premiums increased $143.4 million, or 2%, primarily driven by growth from global mobile device protection programs and newly launched program within financial services in Connected Living, partially offset by a decline in extended service contracts in Connected Living and the unfavorable impact of foreign exchange. Net investment income increased $9.1 million, or 3%, primarily due to higher yields on cash, short-term investments and fixed maturity securities.\nTotal benefits, losses and expenses\nincreased $433.9 million, or 5%, to $8.55 billion for Twelve Months 2024 from $8.12 billion for Twelve Months 2023. Cost of sales increased $277.4 million, or 49% mainly due to newly launched global mobile programs. Policyholder benefits increased $130.7 million, or 8%, primarily due to elevated claims costs in Global Automotive, as described above, and from higher claims in the global mobile device protection business and global financial services in Connected Living, partially offset by lower losses for extended service contracts in Connected Living in line with the decrease in net earned premiums. General expenses increased $44.7 million, or 4%, due to higher employee-related and information\ntechnology expenses to support growth, as well as higher expenses relating to investments in new client programs and capabilities in Connected Living, as described above. Selling and underwriting expenses decreased $18.9 million, or 0.4% mainly due to lower commission expenses for extended service contracts in Connected Living and Global Automotive, partially offset by higher commissions from global mobile device protection programs.\nThe table below presents information regarding the Global Housing segment’s results of operations for the periods indicated:\n\nFees and other income\nNet investment income\nBenefits, losses and expenses:\nPolicyholder benefits\nSelling and underwriting expenses\nTotal benefits, losses and expenses\nGlobal Housing Adjusted EBITDA\nImpact of reportable catastrophes\nNet earned premiums, fees and other income:\nYear Ended December 31, 2024 Compared to the Year Ended December 31, 2023\nincreased $97.0 million, or 17%, to $671.2 million for Twelve Months 2024 from $574.2 million for Twelve Months 2023, mainly due to continued growth from higher policies in-force, average insured values and premium rates within Homeowners and $52.6 million of favorable year-over-year net impact to non-catastrophe prior year reserve development. Twelve Months 2024 included $106.7 million of favorable non-catastrophe prior year reserve development compared to $54.1 million in Twelve Months 2023. The increase in Adjusted EBITDA was also driven by ongoing expense leverage from scale and operating efficiencies, lower reinsurance costs, higher net investment income and growth from Renters from the property management channel, partially offset by $134.2 million of higher reportable catastrophes and a previously disclosed $27.5 million non-run rate adjustment related to a change in earnings pattern assumptions.\nincreased $331.7 million, or 15%, to $2.58 billion for Twelve Months 2024 from $2.25 billion for Twelve Months 2023. Net earned premiums increased $266.5 million, or 13%, primarily driven by Homeowners from higher lender-placed policies in-force, average insured values, higher premium rates and growth across various specialty products, partially offset by the non-run rate adjustment described above and exits from certain international markets. Fees and other income increased $47.6 million, or 37%, primarily driven by the reclassification of certain service fees from an expense account. Net investment income increased $17.6 million, or 16%, primarily due to higher yields and asset balances on fixed maturity securities, cash and cash equivalents and short-term investments.\nTotal benefits, losses and expenses\nincreased $234.7 million, or 14%, to $1.91 billion for Twelve Months 2024 from $1.68 billion for Twelve Months 2023. Policyholder benefits increased $148.2 million, or 17%, primarily due to higher reportable catastrophe losses and non-catastrophe losses from exposure growth, partially offset by the favorable year-over-year non-catastrophe prior year reserve development. Selling and underwriting expenses increased $21.0 million, or 15%, primarily due to higher costs associated with growth. General expenses increased $65.5 million, or 10%, primarily due to higher costs associated with growth and the reclassification described above.\nThe table below presents information regarding the Corporate and Other segment’s results of operations for the periods indicated:\n\nBecause establishment of reserves is an inherently complex process involving significant judgment and estimates, there can be no certainty that future settlement amounts for claims incurred through the financial reporting date will not vary from reported claims reserves. Future loss development could require reserves to be increased or decreased, which could have a material effect on our earnings in the periods in which such increases or decreases are made. However, based on information currently available, we believe our reserve estimates are adequate. See “Item 1A – Risk Factors – Financial Risks –\nOur actual claims losses may exceed our reserves for claims, requiring us to establish additional reserves or to incur additional expense for settling unreserved liabilities, which could have a material adverse effect on our results of operations, profitability and capital\n” and “ – Financial Risks –\nActual results may differ materially from the analytical models we use to assist in our decision-making in key areas such as pricing, catastrophe risks, reserving and capital management”\nfor more detail on this risk.\nReinsurance Recoverables\nWe utilize reinsurance for loss protection and capital management, business dispositions and client risk and profit sharing. Reinsurance premiums paid are amortized as reductions to premium over the terms of the underlying reinsured policies. Amounts recoverable from reinsurers are estimated in a manner consistent with claim and claim adjustment expense reserves or future policy benefits reserves. Reinsurance recoverables include amounts we are owed by reinsurers for claims paid as well as those included in reserve estimates that are subject to the reinsurance.\nWe use a probability of default and loss given default methodology in estimating an expected credit loss allowance, whereby the credit ratings of reinsurers are used in determining the probability of default. The allowance is established for reinsurance recoverables on paid and unpaid future policy benefits and claims and benefits. Prior to applying default factors, the net exposure to credit risk is reduced for any collateral for which the right of offset exists, such as funds withheld, assets held in trust and letters of credit, which are part of the reinsurance arrangements, with adjustments to include consideration of credit exposure on the collateral. Our methodology incorporates historical default factors for each reinsurer based on their credit rating using comparably rated bonds as published by a major ratings service. The allowance is based upon our ongoing review of amounts outstanding, length of collection periods, changes in reinsurer credit standing and other relevant factors.\nIn the ordinary course of business, we are involved in both the assumption and cession of reinsurance with non-affiliated companies. The following table provides details of the reinsurance recoverables balance as of December 31, 2024 and 2023:\nCeded future policyholder benefits and expense\nCeded unearned premium\nCeded claims and benefits payable\nFor additional information regarding our reserves and reinsurance recoverables, see Notes 2, 4, 16 and 17 to the Consolidated Financial Statements included elsewhere in this Report.\nShort Duration Contracts\n\nIf the actual level of loss frequency and severity are higher or lower than expected, the ultimate reserves required will be different than management’s estimate. The effect of higher and lower levels of loss frequency and severity on our ultimate costs for claims occurring in 2024 would be as follows:\nChange in both loss frequency and severity for all Global Lifestyle and Global Housing\nUltimate cost of claims occurring in 2024\nChange in cost of claims occurring in 2024\nRepresents the sum of the case reserves and incurred but not reported reserves as of December 31, 2024 for Global Lifestyle and Global Housing.\nShort duration contracts in non-core operations primarily consist of the sharing economy and small commercial products previously reported within Global Housing. While the contracts are classified as short duration, the coverages were predominantly commercial liability and have a long reporting and settlement tail compared to property coverages which make up most of our core operations.\nThe reserving methodology described for other short duration contacts is applicable for non-core operation",
  "item2_clean": null
}