{
  "source_file": "ajg-20241231.htm",
  "form_type": "10-K",
  "item1_clean": null,
  "item7_clean": "Fluctuations in premiums charged by property/casualty underwriting enterprises have a direct and potentially material impact on the insurance brokerage industry. Commission revenues are generally based on a percentage of the premiums paid by insureds and normally follow premium levels. Insurance premiums are cyclical in nature and may vary widely based on market conditions. Various factors, including competition for market share among underwriting enterprises, increased underwriting capacity and improved economies of scale following consolidations, can result in flat or reduced property/casualty premium rates (a “soft” market). A soft market tends to put downward pressure on commission revenues. Various countervailing factors, such as greater than anticipated loss experience, unexpected loss exposure and capital shortages, can result in increasing property/casualty premium rates (a “hard” market). A hard market tends to favorably impact commission revenues. Hard and soft markets may be broad-based or more narrowly focused across individual product lines or geographic areas. As markets harden, buyers of insurance (such as our brokerage clients), have historically tried to mitigate premium increases and the higher commissions these premiums generate, including by raising their deductibles and/or reducing the overall amount of insurance coverage they purchase. As the market softens, or costs decrease, these trends have historically reversed. During a hard market, buyers may switch to negotiated fee in lieu of commission arrangements to compensate us for placing their risks, or may consider the alternative insurance market, which includes self-insurance, captives, rent-a-captives, risk retention groups and capital market solutions to transfer risk. Our brokerage units are very active in these markets as well. While increased use by insureds of these alternative markets historically has reduced commission revenue to us, such trends generally have been accompanied by new sales and renewal increases in the areas of risk management, claims management, captive insurance and self-insurance services and related growth in fee revenue. Inflation tends to increase the levels of insured values and risk exposures, resulting in higher overall premiums and higher commissions. However, the impact of hard and soft market fluctuations has historically had a greater impact on changes in premium rates, and therefore on our revenues, than inflationary pressures.\n\nIn the discussion and analysis of our results of operations that follows, in addition to reporting financial results in accordance with GAAP, we provide information regarding EBITDAC, EBITDAC margin, adjusted EBITDAC, adjusted EBITDAC margin, diluted net earnings per share, as adjusted (adjusted EPS), adjusted revenue, adjusted compensation and operating expenses, adjusted compensation expense ratio, adjusted operating expense ratio and organic revenue. These measures are not in accordance with, or an alternative to, the GAAP information provided in this report. We believe that these presentations provide useful information to management, analysts and investors regarding financial and business trends relating to our results of operations and financial condition or because they provide investors with measures that our chief operating decision maker uses when reviewing the Company’s performance. See further below for definitions and additional reasons each of these measures is useful to investors. Our industry peers may provide similar supplemental non-GAAP information with respect to one or more of these measures, although they may not use the same or comparable terminology and may not make identical adjustments. For example, our organic revenue is calculated differently than some of our industry peers. The non-GAAP information we provide should be used in addition to, but not as a substitute for, the GAAP information provided. We make determinations regarding certain elements of executive officer incentive compensation, performance share awards and annual cash incentive awards, partly on the basis of measures related to adjusted EBITDAC.\n\nWe believe increases in property/casualty rates will continue throughout 2025 due to rising loss costs, increased frequency of natural catastrophe and weather related losses, prior year reserve volatility and social inflation. We estimate global insured natural catastrophe losses were approximately $150 billion during 2024, and first quarter 2025 insured losses are likely to be elevated due to the California wildfires and, may cause insurance and/or reinsurance carriers to increase property pricing upon renewal. Additionally, if loss trends deteriorate over the coming quarters, or if profitability concerns on casualty lines increase, it could lead to a more difficult rate and conditions environment in certain lines. The combination of increasing insurable values (due to inflation, including wage inflation), a tight labor market and low unemployment is likely contributing to increases in client insured exposures. Additionally, we expect that our history of strong new business generation, solid retentions and enhanced value-added services for our carrier partners should all result in further organic growth opportunities around the world. Overall, we believe that in a positive rate environment with increasing exposures, our professionals can demonstrate their expertise and high-quality, value-added capabilities by strengthening our clients’ insurance portfolios and delivering insurance and risk management solutions within our clients’ budget. Based on our experience, insurance and reinsurance carriers appear to be making rational pricing decisions and are providing adequate capacity in the market for nearly all lines of coverage\n\nOur consolidated financial statements are prepared in accordance with U.S. GAAP, which require management to make estimates and assumptions that affect the amounts reported in our consolidated financial statements and accompanying notes. These accounting principles require us to make estimates and assumptions that affect the reported amounts of assets and liabilities and revenues and expenses, and the disclosure of contingent assets and liabilities at the date of our consolidated financial statements. We periodically evaluate our estimates and assumptions, including those relating to the valuation of goodwill and other intangible assets, right-of-use assets, investments, income taxes, revenue recognition, deferred costs, stock-based compensation, claims handling obligations, retirement plans, litigation and contingencies. We base our estimates on historical experience and various assumptions that we believe to be reasonable based on specific circumstances. Such estimates and assumptions could change in the future as more information becomes known, which could impact the amounts reported and disclosed herein. We believe the following significant accounting estimates may involve a higher degree of judgment and complexity. See Note 1 to our 2024 consolidated financial statements for other significant accounting policies. See Note 2 to our 2024 consolidated financial statements for a discussion of recently issued accounting pronouncements and their impact or potential future impact on our financial results, if determinable.\n\nthe expected future payments to be made to the sellers of the acquired entities in accordance with the provisions outlined in the respective purchase agreements. In determining fair value, we estimate the acquired entity’s future performance using financial projections developed by management for the acquired entity and market participant assumptions that were derived for revenue growth and/or profitability. We estimate future earnout payments using the earnout formula and performance targets specified in each purchase agreement and these financial projections. Subsequent changes in the underlying financial projections or assumptions will cause the estimated earnout obligations to change and such adjustments are recorded in our consolidated statement of earnings when incurred. Increases in the earnout payable obligations will result in the recognition of expense and decreases in the earnout payable obligations will result in the recognition of income.\n\nand Adjusted EBITDAC Margin\n- Adjusted EBITDAC is EBITDAC adjusted to exclude net gains on divestitures, acquisition integration costs, workforce related charges, lease termination related charges, acquisition related adjustments, transaction related costs, legal and tax related costs, and the period-over-period impact of foreign currency translation, as applicable and Adjusted EBITDAC margin is Adjusted EBITDAC divided by total adjusted revenues (defined above). These measures for the brokerage and risk management segments provide a meaningful representation of our operating performance, and are also presented to improve the comparability of our results between periods by eliminating the impact of the items that have a high degree of variability.\n\n- Reimbursements represent amounts received from clients reimbursing us for certain third-party costs associated with providing our claims management services. In certain service partner relationships, we are considered a principal because we direct the third party, control the specified service and combine the services provided into an integrated solution. Given this principal relationship, we are required to recognize revenue on a gross basis and service partner vendor fees in the operating expense line in our consolidated statement of earnings. The increase in reimbursements in 2024 compared to 2023 was primarily due to a change in business mix that is processed internally versus using outside service partners.\n\nOn December 19, 2024, we closed and funded an offering of $5,000.0 million of unsecured senior notes in five tranches. The $750.0 million aggregate principal amount of 4.60% Senior Notes is due in 2027, $750.0 million aggregate principal amount of 4.85% Senior Notes is due in 2029, $500.0 million aggregate principal amount of 5.00% Senior Notes is due in 2032, $1,500.0 million aggregate principal amount of 5.15% Senior Notes is due in 2035, $1,500.0 million aggregate principal amount 5.55% Senior Notes is due in 2055. The weighted average interest rate is 5.25% per annum after giving effect to underwriting costs and a net hedge gain. During 2024, we entered into a pre-issuance interest rate hedging transaction related to these notes. We realized a net cash gain of approximately $4.1 million on the hedging transactions that will be recognized on a pro rata basis as a decrease to our reported interest expense over ten years. We expect to use the net proceeds of this offering to fund a portion of the cash consideration payable in connection with the AssuredPartners transaction and, to the extent that any proceeds remain thereafter, or if the AssuredPartners transaction is not completed, for general corporate purposes, including other acquisitions.\n\n- On December 19, 2024, we closed and funded an offering of $5,000.0 million of unsecured senior notes in five tranches. The $750.0 million aggregate principal amount of 4.60% Senior Notes is due in 2027, $750.0 million aggregate principal amount of 4.85% Senior Notes is due in 2029, $500.0 million aggregate principal amount of 5.00% Senior Notes is due in 2032, $1,500.0 million aggregate principal amount of 5.15% Senior Notes is due in 2035, $1,500.0 million aggregate principal amount 5.55% Senior Notes is due in 2055. The weighted average interest rate is 5.25% per annum after giving effect to underwriting costs and a net hedge gain. During 2024, we entered into a pre-issuance interest rate hedging transaction related to these notes. We realized a net cash gain of approximately $4.1 million on the hedging transactions that will be recognized on a pro rata basis as a decrease to our reported interest expense over ten years. We expect to use the net proceeds of this offering to fund a portion of the cash consideration payable in connection with the AssuredPartners transaction and, to the extent that any proceeds remain thereafter, or if the AssuredPartners transaction is not completed, for general corporate purposes including other acquisitions.\n\nThe primary source of revenues for our brokerage services is commissions from underwriting enterprises, based on a percentage of premiums paid by our clients, or fees received from clients based on an agreed level of service usually in lieu of commissions. These commissions and fees revenues are substantially recognized at a point in time on the effective date of the associated policies when control of the policy transfers to the client, as well as deferring certain revenues to reflect delivery of services over the contract period. Whether we are paid a commission or a fee, the vast majority of our services are associated with the placement of an insurance (or insurance-like) contract. Accordingly, we recognize approximately 85% of our commission and fee revenues on the effective date of the underlying insurance contract. The amount of revenue we recognize is based on our costs to provide our services up and through that effective date, including an appropriate estimate of our profit margin on a portfolio basis. Based on the proportion of additional services we provide in each period after the effective date of the insurance contract, including an appropriate estimate of our profit margin, we recognize approximately 10% of our commission and fee revenues in the first three months, and the remaining 5% thereafter.\n\nReconciliation of Non-GAAP Information Presented to GAAP Measures\n- This report includes tabular reconciliations to the most comparable GAAP measures, as follows: for EBITDAC (on pages\n), for adjusted revenues, adjusted EBITDAC and adjusted diluted net earnings per share (on page\n), for organic revenue measures (on pages\n), respectively, for the brokerage and risk management segments, for adjusted compensation and operating expenses and adjusted EBITDAC margin (on page\n), respectively, for the brokerage segment and (on page\n) for the risk management segment.\n\nThe net change in the funded status of the Plan in 2024 resulted in an increase in noncurrent assets in 2024 of $3.6 million. In 2024, the funded status of the Plan was favorably impacted by an increase in the discount rates used in the measurement of the pension liabilities at December 31, 2024 and other assumption changes, the net impact of which was approximately $3.7 million. In addition, the funded status was unfavorably impacted by returns on the plan’s assets being lower in 2024 than anticipated by approximately $(0.1) million. The net change in the funded status of the Plan in 2023 resulted in an increase in noncurrent assets in 2023 of $12.3 million. In 2023, the funded status of the Plan was unfavorably impacted by a decrease in the discount rates used in the measurement of the pension liabilities at December 31, 2023 and other assumption changes, the net impact of which was approximately $8.6 million. In addition, the funded status was favorably impacted by returns on the plan’s assets being significantly higher in 2023 than anticipated by approximately $20.9 million.\n\nCompensation expense -\nCompensation expense for 2024 and 2023 includes salary, incentive compensation, and associated benefit expenses of $138.5 million and $135.3 million, respectively. The change in 2024 compensation expense compared to 2023 was primarily due to increased incentive compensation, which includes transaction‑related costs as described on page\nin note (2) and increased costs associated with stock-based compensation, partially offset by savings in base compensation.\n\nThe $91.1 million increase in operating expense in 2024 compared to 2023, was primarily due to expenses associated with the acquisitions completed in the twelve-month period ende",
  "item2_clean": null
}