{
  "source_file": "akam-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "Akamai's mission is to power and protect life online.\nSince 1998, Akamai has developed and provided solutions for global enterprises to build, secure and accelerate their applications and digital experiences. Our massively distributed global network is comprised of core and distributed compute sites, more than 4,300 edge points-of-presence in approximately 130 countries and over 700 cities, and our underlying global network integrated with roughly 1,200 network partners. With this scale and distribution, Akamai has visibility and insight into traffic volumes, congestion, attack patterns, vulnerabilities and other activities across the internet's complex intersections of networks and systems. Leveraging these insights, Akamai offers solutions designed to protect our customers from threats and attacks, along with full-stack compute solutions to build and deliver distributed, low-latency applications on our globally distributed network.\nToday, billions of people work, learn, shop, bank, communicate and do more online globally. We firmly believe that the internet’s role in transforming the way we exchange ideas and information and conduct business is more vital than ever. Our strategy is to help continue to power and protect business online by offering security and compute services with the industry-leading reliability, scale and expertise our customers need to grow their business with confidence.\nWe provide solutions in three core offerings: security, delivery and compute. We also provide services and support for our customers as they utilize our solutions. As part of our mission to make life better for millions of businesses, trillions of times per day, Akamai is committed to enabling our customers to benefit from the latest technology developments. In recent years, artificial intelligence (\"AI\") has been a major focus of corporate initiatives for enterprises in multiple verticals and across the globe. To help our customers seize on the power and potential of AI, we provide cloud computing infrastructure that they can use to build AI-powered applications; cybersecurity solutions, powered by AI and automation, designed to defend against prompt injections, data exfiltration and toxic outputs; generative AI to improve the speed and efficiency of identifying and investigating malicious or suspect activity; and throughput on our global intelligent network to enable the large volumes of data required to power AI-powered applications and facilitate effective real-time protections.\nOur security solutions, threat intelligence and global operations team work to provide defense in depth to safeguard enterprise data and applications. Customers trust Akamai to help keep infrastructure, websites, applications, application\nprogramming interfaces (\"APIs\"), networks and users safe from a multitude of cyberattacks and online threats while improving performance. With insight and automation derived from the world’s most distributed global network, our solutions blend robust automation with customizable protections and managed security services to enable businesses to effectively manage risk and maximize protections. Akamai’s web application and API protection solutions protect web, API and mobile app traffic from attacks that take advantage of security flaws, protection from malicious automated attacks, credential abuse and account takeover, client-side protections that protect end customers from malicious or vulnerable first- and third-party client-side scripts that can lead to audience hijacking and distributed denial of service (\"DDoS\") mitigation. As adversaries relentlessly refine their evasion techniques, it requires continuous innovation in threat detection and specialized defenses to stay ahead of advanced bot and abuse attacks. Our Bot & Abuse portfolio provides tailored, specialized solutions to help customers protect against these threats. Akamai Account Protector offers full account lifecycle protections including the ability to defend against account takeover and opening abuse, adversarial bot protection, protection against credential stuffing, inventory scalping and hoarding. Akamai Content Protector also helps businesses protect their intellectual property, reputation and revenue potential with solutions designed to stop persistent scrapers from stealing content that can be used for malicious purposes like competitive intelligence/espionage, inventory manipulation, site performance degradation and counterfeiting.\nIn May 2023, Akamai acquired Neosec, Inc. (\"Neosec\"), which enabled us to offer a solution we refer to as API Security that works to discover and audit APIs and monitor API activity. API Security complements our application and API security portfolio by extending our visibility into the growing API threat landscape to detect and respond to threats and abuse detection and operates using a response platform based on data and behavioral analytics. In June 2024, Akamai acquired Noname Security Ltd. (\"Noname Security\"), one of the top API security vendors in the market. This enhanced Akamai’s API Security solution and accelerated our ability to meet growing customer demand and market requirements as the use of APIs continues to expand. Akamai also expects to gain greater scale with Noname Security’s additional sales and marketing resources and established channel and alliance relationships. As a result of the acquisition, Akamai expects to offer a complete API security suite enabling customers to better discover “shadow” APIs and detect vulnerabilities and attacks. Akamai’s enhanced offering expects to have greater deployment choices for customers and access to a portfolio of technology integrations that we believe is unrivaled in the market.\nWe also offer microservice and application component protection that analyzes and protects application traffic that moves between application components like containers, APIs and workloads. This is part of a growing set of solutions designed to help businesses implement a Zero Trust security architecture. Our acquisition of Guardicore Ltd. (\"Guardicore\") in October 2021 has enabled us to deliver the Akamai Guardicore Platform, which simplifies enterprise security with broad visibility and granular controls through one console. The Akamai Guardicore Platform simply and efficiently enables Zero Trust through a fully integrated combination of microsegmentation, Zero Trust Network Access, multi-factor authentication, domain name system (\"DNS\") firewall and threat hunting. Guardicore’s microsegmentation solution helps our customers prevent malicious lateral movement in their network through precise segmentation policies, visuals of activity within their IT environment and network security alerts. The platform leverages AI to simplify user experience, vulnerability assessments, compliance and incident response, helping to protect businesses from the threat of ransomware. AI network labeling examines how assets are behaving and suggests labels to help security teams apply appropriate controls, and generative AI allows security professionals to ask natural language questions of their network, instead of manually poring through logs, to drastically expedite a variety of use cases like compliance scoping and incident response.\nAkamai's cloud computing services, which we sometimes refer to as compute, include compute, storage, networking, database and container management services that are required to build, deploy and secure applications and workloads. The cloud computing services running on Akamai's compute platform enable companies to distribute workloads and applications across our core to edge infrastructure to help solve the cost, performance and scale challenges that centralized cloud computing platforms present today.\nIn March 2022, Akamai acquired Linode Limited Liability Company (\"Linode\"), an established cloud computing platform. This acquisition was a significant milestone in our expansion into cloud computing. While Linode was traditionally focused on individual developers, we are leveraging the Linode cloud computing services for enterprise customers by building new enterprise-grade core computing regions and connecting them to the Akamai network, which we believe will give Akamai an advantage over its bigger cloud rivals. Akamai provides a continuum of compute solutions for developers to build and deliver distributed, low-latency applications. We empower businesses to build and deploy massively scalable applications, distribute them to reduce latency and reach underserved locations and work to optimize and secure experiences and data from the core to the digital touchpoint. Akamai’s compute solutions include a broad set of distributed cloud and edge computing services, including virtual machines, graphical processing units, cloud storage and databases, network optimization and security services\nand lightweight serverless functions to help businesses build, deploy and manage applications and workloads with superior performance and affordability on the world’s most distributed platform.\nIn 2024, we expanded Akamai's compute platform to span 41 datacenters in 36 locations. This includes upgrades to 5 existing datacenters and the introduction of 11 datacenters. The locations of these datacenters include Denver, Colorado; Houston, Texas; Querétaro, Mexico; Bogotá, Colombia; Santiago, Chile; Marseille, France; Hamburg, Germany; Johannesburg, South Africa; Auckland, New Zealand; Kuala Lumpur, Malaysia; and Melbourne, Australia. Distributed compute regions provide access to powerful dedicated compute, storage and networking services in major metros that lack cloud computing options and availability, enabling organizations to place compute-intensive workloads as close as possible to end users. These regions act as an extension of primary infrastructure deployed in core compute regions for organizations that aim to improve application performance to attract new customers in new or target regions, and/or stabilize performance to meet user expectations. We also introduced new NVIDIA graphics processing units (\"GPUs\") to provide better productivity and economics for companies in the media and entertainment industry that are challenged with processing video content faster and more efficiently, and for organizations seeking to deploy AI inferencing workloads closer to end users. These GPUs are well-suited for video transcoding and live video streaming, virtual reality and augmented reality content, gaming and graphics rendering, training and inference with neural networks, data analysis and scientific computing and high-performance computing applications, such as modeling and simulation, that require fast and efficient processing of large amounts of data.\nIn November 2024, we launched the Akamai App Platform, a ready-to-run solution that makes it easy to deploy, manage and scale highly distributed applications. The Akamai App Platform is built on top of the cloud native Kubernetes technology Otomi, which Akamai acquired from Red Kubes Holding B.V. and its subsidiary earlier in the year. The application platform provides ready-to-run templates that address common challenges in deploying, managing and scaling Kubernetes clusters at scale. Instead of relying on multiple departments and spending months sourcing, connecting and configuring the software needed to operate Kubernetes fleets, Akamai’s solution automates the provisioning process, allowing developers to build and deploy highly distributed applications in a few clicks. This can cut deployment time from months to less than an hour and provides near-instant scaling as production workloads grow.\nOur delivery solutions consist primarily of web and mobile performance focused solutions and media delivery solutions. Our web and mobile performance solutions are architected to enable dynamic websites and applications to have rapid response times, no matter where the user is, what device or browser t",
  "item7_clean": "Payroll and related costs\nStock-based compensation\nDepreciation and amortization\nFacilities-related costs\nProvision for doubtful accounts\nAcquisition-related costs\nSoftware and related service costs\nTotal general and administrative\nAs a percentage of revenue\nThe increase in general and administrative expenses for 2024 as compared to 2023 was primarily due to higher payroll and related costs as a result of annual merit increases, an increase in stock-based compensation as a result of the timing of our performance-based equity award grants and an increase in other expenses related to professional service fees to support our business. These increases were partially offset by decreased facilities-related costs as we exited certain facilities in connection\nwith our FlexBase program.\nThe increase in general and administrative expenses for 2023 as compared to 2022 was due to higher payroll and related costs, including stock-based compensation, as a result of annual merit increases, headcount growth, the increased expected achievement of our performance-based compensation plans and higher average equity awards to employees driven by the talent market and other expenses due to increased professional service fees to support our business. Additionally, stock-based compensation increased due to the shift in one of our compensation programs from cash-based to stock-based. These increases were partially offset by decreases in facilities-related costs as a result of growth in sublease income from the execution of our FlexBase program and acquisition-related costs in connection with our acquisition of Linode in the first quarter of 2022.\nDuring 2025, we expect our general and administrative expenses to increase as compared to 2024, to support the operations of the business.\nAmortization of Acquired Intangible Assets\nFor the Years Ended December 31,\nFor the Years Ended December 31,\nAmortization of acquired intangible assets\nAs a percentage of revenue\nThe increase in amortization of acquired intangible assets for 2024 as compared to 2023, and 2023 as compared to 2022, was the result of amortization of acquired intangible assets related to our recent acquisitions. Based on acquired intangible assets as of December 31, 2024, future amortization is expected to be $111.5 million, $104.1 million, $89.2 million, $81.9 million and $76.0 million for the years ending December 31, 2025, 2026, 2027, 2028 and 2029, respectively.\nRestructuring Charge\nFor the Years Ended December 31,\nFor the Years Ended December 31,\nRestructuring charge\nAs a percentage of revenue\nThe restructuring charge in 2024 was driven by management's commitment to an action with the primary intent to redeploy resources to support our strategic investments and as a result of our completed acquisitions. The restructuring charge included severance and related expenses for certain headcount reductions, as well as impairments of acquired intangible assets and capitalized internal-use software. We do not expect to incur material additional charges related to these actions.\nThe restructuring charge in 2023 was primarily driven by our FlexBase program as we exited certain facilities that were no longer needed, resulting in impairments of right-of-use-assets and leasehold improvements. We do not expect to incur material additional charges related to the FlexBase program. Additionally, the restructuring charge in 2023 included the result of certain actions initiated in the first quarter of 2023. Management's commitment to an action to restructure certain parts of the company was to enable the prioritization of investments in the fastest growing areas of the business. The restructuring charge for this action includes severance and related expenses for certain headcount reductions. We do not expect to incur material additional charges related to this action.\nThe restructuring charge in 2022 was primarily related to capitalized internal-use software impairment charges related to our investment with Mitsubishi UFJ Financial Group (\"MUFG\") in the joint venture Global Open Network, Inc. (\"GO-NET\"), and MUFG's decision to suspend GO-NET's operations, and impairments of right-of-use-assets for facilities that are no longer needed as a result of our FlexBase program.\nNon-Operating Income (Expense)\nFor the Years Ended December 31,\nFor the Years Ended December 31,\nInterest and marketable securities income, net\nAs a percentage of revenue\nAs a percentage of revenue\nAs a percentage of revenue\nInterest and marketable securities income, net primarily consists of interest earned on invested cash and marketable securities balances and income and losses on mutual funds that are associated with our employee non-qualified deferred compensation plan. The increase to interest and marketable securities income, net for 2024 as compared to 2023, and 2023 as compared to 2022, was the result of increased cash, cash equivalents and marketable securities balances received from our August 2023 issuance of $1,265.0 million in par value of convertible senior notes due 2029 and higher interest rates, as well as increased gains associated with the non-qualified deferred compensation plan.\nOther expense, net primarily represents net foreign exchange gains and losses mainly due to foreign exchange rate fluctuations on the remeasurement of monetary assets and liabilities that are not denominated in the functional currency as well as other non-operating expense and income items. Other expense, net for 2024 and 2022 also includes impairments of $5.1 million and $8.9 million, respectively, from cost method investments. Other expense, net may fluctuate in the future based on changes in foreign currency exchange rates or other events.\nProvision for Income Taxes\nFor the Years Ended December 31,\nFor the Years Ended December 31,\nProvision for income taxes\nAs a percentage of revenue\nEffective income tax rate\nThe decrease in the provision for income taxes for 2024 as compared to 2023 was mainly due to the benefit from an intercompany sale of intellectual property in 2024, an increase in the excess tax benefit related to stock-based compensation, lower profitability and an increase in the benefit of U.S. federal and state research and development credits. These amounts were partially offset by a decrease in foreign income taxed at lower rates, an increase in non-deductible transfer pricing and an increase in certain tax reserves.\nThe decrease in the provision for income taxes for 2023 as compared to 2022 was mainly due to a reduction in intercompany sales of intellectual property and the tax on global intangible low-taxed income. These items were partially offset by a decrease in the excess tax benefit related to stock-based compensation and the revaluation of certain foreign income tax liabilities due to foreign exchange rate fluctuations.\nFor the year ended December 31, 2024, our effective income tax rate was lower than the federal statutory tax rate due to the benefit of U.S. federal, state and foreign research and development credits, an intercompany sale of intellectual property, foreign income taxed at lower rates and the excess tax benefit related to stock-based compensation. These amounts were partially offset by non-deductible stock-based compensation and non-deductible transfer pricing.\nFor the years ended December 31, 2023 and 2022, our effective income tax rate was lower than the federal statutory tax rate due to foreign income taxed at lower rates and the benefit of U.S. federal, state and foreign research and development\ncredits. These amounts were partially offset by non-deductible stock-based compensation and the tax on global intangible low-taxed income. Additionally, our effective income tax rate was lower for the year ended December 31, 2022 due to an intercompany sale of intellectual property.\nOur effective income tax rate may fluctuate between fiscal years and from quarter to quarter due to items arising from discrete events, such as tax benefits from the settlement of employee equity awards, tax law changes and settlements of tax audits and assessments. Our effective income tax rate is also impacted by, and may fluctuate in any given period because of, the composition of income in foreign jurisdictions where tax rates differ depending on the local statutory rates. The Organisation for Economic Co-operation and Development (“OECD”) and participating OECD member countries continue to work toward the enactment of a 15% global minimum corporate tax rate for large multinational enterprise groups, also known as \"Pillar Two\". Many of the participating countries have enacted legislation that became effective beginning in 2024, while other countries continue to work on defining the underlying rules and administrative procedures. Although the enactment and effective legislation in many countries was applicable to us beginning on January 1, 2024, and increased our effective income tax rate, the increase did not have a material impact on our overall results of operations or cash flows. We will continue to monitor and evaluate the impacts of the developing legislation.\n(Gain) Loss from Equity Method Investment\nFor the Years Ended December 31,\nFor the Years Ended December 31,\n(Gain) loss from equity method investment\nAs a percentage of revenue\nThe amounts reflected in (gain) loss from equity method investment relate to our investment with MUFG in a joint venture, GO-NET. GO-NET intended to operate a blockchain-based online payment network. However, GO-NET operations were suspended in February 2022, and ultimately liquidated in August 2023. The gain from equity method investment in 2023 was related to the liquidation and disbursement of our portion of GO-NET's remaining assets, which were previously impaired. The loss from equity method investment in 2022 was the result of our impairment of our investment in GO-NET in the first quarter of 2022 since the operations will no longer generate future cash flows. We do not expect additional activity related to this investment.\nUse of Non-GAAP Financial Measures\nIn addition to providing financial measurements based on generally accepted accounting principles in the United States of America (\"GAAP\") we provide additional financial metrics that are not prepared in accordance with GAAP (\"non-GAAP financial measures\"). Management uses non-GAAP financial measures, in addition to GAAP financial measures, to understand and compare operating results across accounting periods, for financial and operational decision making, for planning and forecasting purposes, to measure executive compensation and to evaluate our financial performance. These non-GAAP financial measures are non-GAAP income from operations, non-GAAP operating margin, non-GAAP net income, non-GAAP net income per diluted share, Adjusted EBITDA, Adjusted EBITDA margin and impact of foreign currency exchange rates, as discussed below.\nManagement believes that these non-GAAP financial measures reflect our ongoing business in a manner that allows for meaningful comparisons and analysis of trends in the business, as they facilitate comparison of financial results across accounting periods and to those of our peer companies. Management also believes that these non-GAAP financial measures enable investors to evaluate our operating results and future prospects in the same manner as management. These non-GAAP financial measures may exclude expenses and gains that may be unusual in nature, infrequent or not reflective of our ongoing operating results.\nThe non-GAAP financial measures do not replace the presentation of our GAAP financial measures and should only be used as a supplement to, not as a substitute for, our financial results presented in accordance with GAAP.\nThe non-GAAP adjustments, and our basis for excluding them from non-GAAP financial measures, are outlined below:\nAmortization of acquired intangible assets\n– We have incurred amortization of intangible assets, included in our GAAP financial statements, related to various acquisitions we have made. The amount of an acquisition's purchase price allocated to intangible assets and term of its related amortization can vary significantly and is unique to each\nacquisition; therefore, we exclude amortization of acquired intangible assets from our non-GAAP financial measures to provide investors with a consistent basis for comparing pre- and post-acquisition operating results.\nStock-based compensation and amortization of capitalized stock-based compensation\n– Stock-based compensation is an important aspect of the compensation paid to our employees, which includes long-term incentive plans to encourage retention, performance-based plans to encourage achievement of specified financial targets and also short-term incentive awards with a one year vest. The grant date fair value of the stock-based compensation awards varies based on the stock price at the time of grant, varying valuation methodologies, subjective assumptions and the variety of award types. This makes the comparison of our current financial results to previous and future periods difficult to interpret; therefore, we believe it is useful to exclude stock-based compensation and amortization of capitalized stock-based compensation from our non-GAAP financial measures in order to highlight the performance of our core business and to be consistent with the way many investors evaluate our performance and compare our operating results to peer companies.\nAcquisition-related costs\n– Acquisition-related costs include transaction fees, advisory fees, due diligence costs and other direct costs associated with strategic activities, as well as certain additional compensation costs payable to employees acquired from the Linode acquisition if employed for a certain period of time. The additional compensation cost was initiated by and determined by the seller and is in addition to normal levels of compensation, including retention programs, offered by Akamai. Acquisition-related costs are impacted by the timing and size of the acquisitions, and we exclude acquisition-related costs from our non-GAAP financial measures to provide a useful comparison of operating results to prior periods and to peer companies because such amounts vary significantly based on the magnitude of our acquisition transactions and do not reflect our core operations.\nRestructuring charge\n– We have incurred restructuring charges from programs that have significantly changed either the scope of the business undertaken by us or the manner in which that business is conducted. These charges include severance and related expenses for workforce reductions, impairments of long-lived assets that will no longer be used in operations (including acquired intangible assets, right-of-use assets, other facility-related property and equipment and internal-use software) and termination fees for any contracts cancelled as part of these programs. We exclude these items from our non-GAAP financial measures when evaluating our continuing business performance as such items vary significantly based on the magnitude of the restructuring action and do not reflect expected future operating expenses. In addition, these charges do not necessarily provide meaningful insight into the fundamentals of current or past operations of our business.\nAmortization of debt issuance costs and capitalized interest expense\n– We have convertible senior notes outstanding that mature in 2029, 2027 and 2025. The issuance costs of the convertible senior notes are amortized to interest expense and are excluded from our non-GAAP results because management believes the non-cash amortization expense is not representative of ongoing operating performance.\nGains and losses on cost method investments\n– We have recorded gains and losses from the disposition, changes to fair value and impairment of cost method investments. We believe excluding these amounts from our non-GAAP financial measures is use",
  "item2_clean": null
}