{
  "source_file": "alb-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nForward-looking Statements\nThese forward-looking statements are not guarantees of future performance and involve certain risks, uncertainties and assumptions, which are difficult to predict and many of which are beyond our control. There can be no assurance that our actual results will not differ materially from the results and expectations expressed or implied in the forward-looking statements. Factors that could cause actual results to differ materially from the outlook expressed or implied in any forward-looking statement include, without limitation, information related to:\nchanges in economic and business conditions;\nproduct development;\nchanges in financial and operating performance of our major customers and industries and markets served by us;\nthe timing of orders received from customers;\nthe gain or loss of significant customers;\nfluctuations in lithium market pricing, which could impact our revenues and profitability particularly due to our increased exposure to index-referenced and variable-priced contracts for battery grade lithium sales;\ninflationary trends in our input costs, such as raw materials, transportation and energy, and their effects on our business and financial results;\nchanges with respect to contract renegotiations;\npotential production volume shortfalls;\ncompetition from other manufacturers;\nchanges in the demand for our products or the end-user markets in which our products are sold;\nlimitations or prohibitions on the manufacture and sale of our products;\navailability of raw materials;\nincreases in the cost of raw materials and energy, and our ability to pass through such increases to our customers;\ntechnological change and development;\nchanges in our markets in general;\nfluctuations in foreign currencies;\nchanges in laws and government regulation impacting our operations or our products;\nchanges in trade policies and tariffs;\nthe occurrence of regulatory actions, proceedings, claims or litigation (including with respect to the U.S. Foreign Corrupt Practices Act and foreign anti-corruption laws);\nthe occurrence of cyber-security breaches, terrorist attacks, industrial accidents or natural disasters;\nthe effects of climate change, including any regulatory changes to which we might be subject;\nhazards associated with chemicals manufacturing;\nthe inability to maintain current levels of insurance, including product or premises liability insurance, or the denial of such coverage;\npolitical unrest affecting the global economy, including adverse effects from terrorism or hostilities;\npolitical instability affecting our manufacturing operations or joint ventures;\nchanges in accounting standards;\nthe inability to achieve results from our global manufacturing cost reduction initiatives as well as our ongoing continuous improvement and rationalization programs;\nchanges in the jurisdictional mix of our earnings and changes in tax laws and rates or interpretation;\nchanges in monetary policies, inflation or interest rates that may impact our ability to raise capital or increase our cost of funds, impact the performance of our pension fund investments and increase our pension expense and funding obligations;\nthe ability to apply for and obtain government funding to support new operations;\nvolatility and uncertainties in the debt and equity markets;\ntechnology or intellectual property infringement, including cyber-security breaches, and other innovation risks;\ndecisions we may make in the future;\nfuture acquisition and divestiture transactions, including the ability to successfully execute, operate and integrate acquisitions and divestitures and incurring additional indebtedness;\nexpected benefits and expenses related to our new operating structure and asset optimization activities;\ntiming of active and proposed restructuring and cost optimization projects;\nimpact of any future pandemics;\nimpacts of the situation in the Middle East and the military conflict between Russia and Ukraine, and the global response to it;\nperformance of our partners in joint ventures and other projects;\nchanges in credit ratings; and\nThe following is a discussion and analysis of our results of operations for the three-month and nine-month periods ended September 30, 2025 and 2024. A discussion of our consolidated financial condition and sources of additional capital is included under a separate heading, “Financial Condition and Liquidity.”\nWe are a world leader in transforming essential resources into critical ingredients for mobility, energy, connectivity, and health. Our purpose is to enable a more resilient world. We partner to pioneer new ways to move, power, connect, and protect. The end markets we serve include grid storage, automotive, aerospace, conventional energy, electronics, construction, agriculture and food, pharmaceuticals and medical devices. We believe that our world-class resources with reliable and consistent supply, our leading process chemistry, high-impact innovation, customer centricity and focus on people and planet will enable us to maintain a leading position in the industries in which we operate.\nSecular trends favorably impacting demand within the end markets that we serve combined with our diverse product portfolio, cost discipline, broad geographic presence and customer-focused solutions will continue to be key drivers of our future earnings. We continue to build upon our existing green solutions portfolio and our ongoing mission to provide innovative, yet commercially viable, clean energy products and services to the marketplace to contribute to our sustainability-based revenue. For example, our Energy Storage business contributes to the growth of clean miles driven with electric vehicles and more efficient use of renewable energy through grid storage; Specialties enables the prevention of fires starting in electronic equipment, greater fuel efficiency from rubber tires and the reduction of emissions from coal fired power plants; and our Ketjen business enhances the efficiency of natural resources through more usable products from a single barrel of oil, enables safer, greener production of alkylates used to produce more environmentally-friendly fuels, and reduced emissions through cleaner transportation fuels. We believe our disciplined cost reduction efforts and ongoing productivity improvements, among other factors, position us well to take advantage of strengthening economic conditions as they occur, while softening the negative impact of the current challenging global economic environment.\nDuring the third quarter of 2025:\nOur net sales for the quarter were $1.3 billion; volumes grew by 6% year-over-year in total, driven by 8% growth in both Energy Storage and Ketjen; adjusted EBITDA improved 7% year-over-year, driven by Specialties.\nOur cash flows from operations for the quarter were $355.6 million, up 57% from the prior-year period; cash flows from operations during the first nine months of 2025 were $893.8 million, an increase of 29% from the prior year.\nOur board of directors declared a quarterly dividend of $0.405 per share on July 22, 2025, which was paid on October 1, 2025 to common shareholders of record at the close of business as of September 12, 2025.\nThe current global business environment presents a diverse set of opportunities and challenges in the markets we serve. In particular, we believe that the global market for lithium battery and energy storage, particularly for electric vehicles (“EV”), remains strong, providing the opportunity to continue to develop high quality and innovative products while managing the high cost of expanding capacity. The other markets we serve continue to present various opportunities for value and growth as we have positioned ourselves to manage the impact on our business of changing global conditions, such as trade policies and tariffs, slow and uneven global growth, currency exchange volatility, crude oil price fluctuation, a dynamic pricing environment, an ever-changing landscape in electronics, the continuous need for cutting edge catalysts and technology by our refinery customers and increasingly stringent environmental standards. During the course of 2023, 2024 and through the first nine months of 2025, lithium index pricing dropped significantly. Amidst these dynamics, and despite recent downward lithium price pressure, we believe our long-term business fundamentals are sound and that we are strategically well-positioned as we remain focused on increasing sales volumes, optimizing and improving the value of our portfolio primarily through pricing and product development, managing costs and delivering value to our customers and shareholders. We believe that our businesses remain well-positioned to capitalize on new business opportunities and long-term trends driving growth within our end markets and to respond quickly to changes in economic conditions in these markets.\nIn order to optimize our cost structure and strengthen our financial flexibility, we have taken proactive actions, including certain restructuring activities and reducing planned capital expenditures. As part of these actions, we announced a new operating structure, effective November 1, 2024, that transitioned from two core global business units to a fully integrated functional model (excluding Ketjen) designed to increase agility, deliver significant cost savings and maintain long-term competitiveness. We continue to report results across our three existing operating segments of Energy Storage, Specialties and Ketjen. If lithium index pricing trends further downward or remains at low levels for an extended time, we may need to take additional measures to support growth and financial flexibility, including further restructuring actions.\nThe Company continues to monitor the potential impact of tariffs proposed or imposed by the U.S. and internationally. At this time we do not expect a "
}