{
  "source_file": "algn-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2. Management’s Discussion and Analysis of Financial Condition and Results of Operations.\nForward-Looking Statements\nThese statements may contain words such as “expects,” “anticipates,” “intends,” “plans,” “believes,” “estimates,” or other words indicating future results. These forward-looking statements are subject to certain risks and uncertainties that could cause actual results to differ materially from those reflected in the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed in Part I, Item 2 “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and in particular, the risks discussed below in Part II, Item 1A “Risk Factors.” We undertake no obligation to revise or update these forward-looking statements. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements.\nExecutive Overview of Results\nTrends and Uncertainties\nOur strategic priorities focus on four principal pillars for growth: (i) international expansion; (ii) general dental practitioners (“GP”) treatment; (iii) patient demand; and (iv) orthodontic utilization. Our growth strategy depends on our ability to facilitate the digital transformation of dentistry, our continuous focus on innovation, and expansion to meet and exceed evolving customer expectations as the array of products and services available to them increases. Below is a discussion of the significant trends and uncertainties that could impact our operations:\nMacroeconomic Challenges, Trade Impediments and Geopolitical Tensions\nOur revenues and other results of operations are susceptible to fluctuations resulting from various events and circumstances, including macroeconomic conditions, threats or actual or proposed tariffs, inflation, higher interest rates, customs duties and fees by nations and retaliatory actions, threats of or actual slowdowns or recessions, wages, debt obligations, discretionary income, fluctuations in foreign currency exchange rates, supply chain challenges, market volatility, employment levels, health insurance coverage, and other factors, each of which impacts customer confidence, consumer sentiment, discretionary spending and ultimately demand for dental services and our products. Moreover, we rely on the operations of the U.S. federal government to obtain and maintain necessary clearances or approvals for the offer, sale and delivery of our products, including from the Patent and Trademark Office, Food and Drug Administration, Customs and Border Protection, and similar agencies. A prolonged government shutdown or reductions in government personnel may impede our ability to sell or deliver our products which could have a material adverse effect on our business, financial condition and results of operations.\nMany of these factors also impact the availability of certain raw materials, parts and components used in our products as well as our costs and those of our suppliers through higher raw material prices, transportation costs, labor costs, supply and distribution operations. We believe that since the second quarter of 2025, sales of our products have been adversely impacted by certain macroeconomic conditions, including global tariff volatility, inflation, and higher interest rates, which we believe have and may continue to impede dental patient demand. For example, patient traffic growth has been uneven for many doctors, with orthodontic starts down for four consecutive years. We believe uncertainty not only impacts consumer purchasing decisions but also the decisions and recommendations that doctors make, especially doctors who offer both clear aligners and wires and brackets in their practices and have the additional time to treat patients with wires and brackets when orthodontic starts are slowing or diminishing. We believe this has resulted in an increase in orthodontic starts using wires and brackets in lieu of clear aligners that was more pronounced in the second quarter of 2025. However, we believe these trends are continuing and will impede future sales for so long as consumer economic uncertainty persists, particularly to the extent it impairs discretionary spending. We also anticipate the geopolitical conflicts involving Ukraine, the Middle East, China and other regions will continue to add to market uncertainties and dampen consumer sentiment and demand.\nMore directly, we believe government actions relating to actual or proposed tariffs and retaliatory actions in key strategic countries or regions, particularly in the United States, China, Europe, Brazil, Canada, Israel and Mexico may adversely impact our revenue and cost of goods sold. Additionally, the trade war and geopolitical tensions between the United States and China may result in the limitation or prohibition of the availability of certain raw materials, components and parts necessary for our products or the products of our suppliers. The degree of our exposure depends on, among other things, the type of goods subject to any tariffs or trade restrictions enacted, the tariff rates or limits imposed, the timing of the tariffs or restrictions and any other retaliatory measures enacted. The impact may vary by time and region, making operational results uncertain and difficult to predict. These events may also cause a shift in public opinion about companies based in the United States and this may have an adverse impact on our reputation and business. We continue to closely monitor the foregoing issues, assess their potential impact on our operations and financial results, and implement plans to seek to mitigate the impact of any adverse events.\nAdditionally, a material amount of our revenues are derived internationally and many of our international operations are denominated in currencies other than the U.S. dollar. In the third quarter of 2025, the U.S. dollar weakened against major currencies, which positively impacted our financial condition and results of operations for the quarter. Foreign exchange volatility and the subsequent strengthening or weakening of the U.S. dollar against other currencies remains uncertain and unpredictable.\nWe continue to monitor the potential for violence and military actions that may directly or indirectly impact our personnel, manufacturing, supply chain, and sales. For instance, the ongoing conflict in Ukraine and unstable environment in the Middle East, as well as increased geopolitical tensions involving Taiwan and the South China Sea may further exacerbate general and regional macroeconomic instability. This is particularly true if fighting erupts, intensifies, spreads to other locations, creates shipping and logistical challenges or cost increases, leads to sanctions or boycotts, or otherwise materially impacts our operations or consumer spending. Our iTero business is headquartered in Israel and, although the sales, delivery times and cost of shipping have not been materially impacted to date, the situation remains fluid. We have implemented contingency planning and business continuity measures to mitigate these risks, but it is uncertain whether further escalation could disrupt our operations. While there have been export and import restrictions imposed against products originating from and businesses operating in Israel, they have not materially impacted our sales or operations to date although we continue to monitor the risk.\nBeginning in in the third quarter of 2025 and continuing into the fourth quarter, we initiated a plan to realign certain business groups and reduce our global workforce in response to the current macroeconomic environment. We anticipate incurring between $40.0 million and $50.0 million in total restructuring expenses, primarily related to involuntary termination benefits, including employee severance and other post-employment benefits. The foregoing estimates that we anticipate incurring in connection with these actions are contingent upon various assumptions and actual results may differ. We may also incur additional costs not currently contemplated due to events related to or resulting from any such action. Our management or board of directors may determine not to pursue certain portions of any of these actions and any actions ultimately pursued may not achieve the benefits currently anticipated. For more information, see\nRestructuring and Other Charges\nof the Notes to Condensed Consolidated Financial Statements\nChanging Product Preferences\nAs the markets for clear aligners and digital processes and workflows used to transform the practice of dentistry continue to mature, we anticipate customer and patient expectations and demands will continue to evolve. We expect to meet customer demands with innovative treatment options that include more choices to address a wider scope of treatment goals and budgets based on our existing and new products. This may result in larger and unpredictable variations in geographic and product mix and selling prices with uncertain implications on our financial statements and business operations. For example, we have and may continue to experience a shift from certain products with higher average selling prices (“ASP”) to those with lower ASPs.\nWe strive to manage the challenges presented by the foregoing trends and uncertainties, including the macroeconomic conditions, tariffs and retaliatory measures, military conflicts and the evolution of our target markets, by focusing on improving our operations, further increasing flexibility and efficiencies in our processes, adjusting our business models to changing circumstances and offering products that meet market demand. Specifically, we are managing financial impacts by implementing strategic product innovations, introductions and pricing actions, implementing cost saving measures, and evaluating hiring needs.\nFurther discussion of the impact of these challenges on ou"
}