{
  "source_file": "all-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "The Allstate Corporation was incorporated under the laws of the State of Delaware on November 5, 1992, to serve as the holding company for Allstate Insurance Company. Its business is conducted principally through Allstate Insurance Company and other subsidiaries (collectively, including The Allstate Corporation, “Allstate”).\nThe Allstate Corporation is one of the largest publicly held personal lines insurers in the United States. Allstate’s strategy is to increase market share in personal property-liability and broaden protection offerings. The Allstate brand is widely known through the\n“You’re In Good Hands With Allstate\nAllstate at a Glance\nlargest personal property and casualty insurer in the United States\ninvestment portfolio\nBased on 2023 statutory direct premiums written according to A.M. Best\ncustomers with protection to help them achieve their hopes and dreams.\naffordable, simple and connected protection solutions.\nopportunity for our team, economic value for our shareholders and improve communities.\nAuto and homeowners insurance\nSelect commercial property and casualty coverages\nAutomotive protection and insurance products\nConsumer product protection plans\nMobility data collection services and analytic solutions using automotive telematics information\nEmployer voluntary benefits, group health insurance and individual health insurance\nOffers private passenger auto, homeowners, other personal lines and commercial insurance through exclusive agents, independent agents, contact centers and online under the Allstate, National General and Answer Financial brands.\nRun-off Property-Liability\nRelates to property and casualty insurance policies written during the 1960s through the mid-1980s with exposure to asbestos, environmental and other claims in run-off.\nProvides consumer product protection plans, device and mobile data collection services and analytic solutions using automotive telematics information, roadside assistance, protection and insurance products and identity protection and restoration through Allstate Protection Plans, Allstate Dealer Services, Allstate Roadside, Arity and Allstate Identity Protection.\nAllstate Health and Benefits\nOffers self-funded stop-loss and fully insured group health products to employers, and Medicare supplement, ancillary products and short-term medical insurance to individuals, sold through independent agents, owned agencies, benefits brokers and Allstate exclusive agents.\nIncludes net investment income, net gains (losses) on investments, other revenue, debt service, holding company activities and certain non-insurance operations.\nAllstate Protection and Run-off Property-Liability segments comprise Property-Liability.\nOn August 13, 2024, Allstate entered into an agreement with StanCorp Financial Group, Inc. to sell Allstate’s employer voluntary benefits business. The transaction is expected to close in the first half of 2025, subject to regulatory approvals and other customary closing conditions. On January 30, 2025, Allstate entered into an agreement with Nationwide Life Insurance Company to sell the group health business. The transaction is expected to close during 2025, subject to regulatory approvals and other customary closing conditions. The individual health business will either be retained or divested.\nThe Allstate Corporation 1\n\nAllstate Health and Benefits Segment\nAllstate Health and Benefits segment accounted for 4.0% of Allstate’s 2024 consolidated total revenue and 2.0% of Allstate’s December 31, 2024 PIF. The Allstate Health and Benefits segment provides consumers with financial protection against the risk of accidents, illness and mortality.\nAllstate Health and Benefits is differentiated through its broad product portfolio, flexible enrollment solutions, strong national accounts team and well-recognized brand.\nEmployer voluntary benefits provides supplemental health and life protection to employees across all company sizes, delivering substantially more value through innovative product offerings and providing exceptional customer service experiences for new and existing customers.\nGroup health provides self-funded stop-loss and fully insured group health products to employers, primarily targeting small employer groups. Group health is differentiated in the market through its customizable products, flexible enrollment solutions and strong distribution team.\nIndividual health is a leading provider of short-term medical, Medicare supplement and ancillary insurance products to individuals as well as third-party health products. Individual health is differentiated through its broad product portfolio, automated enrollment solutions and deep pool of agents.\nOn August 13, 2024, Allstate entered into a share purchase agreement with StanCorp Financial Group, Inc. to sell American Heritage Life Insurance Company and American Heritage Service Company, comprising Allstate’s employer voluntary benefits business. The transaction is expected to close in the first half of 2025, subject to regulatory approvals and other customary closing conditions.\nOn January 30, 2025, Allstate entered into an agreement with Nationwide Life Insurance Company to sell Direct General Life Insurance Company, NSM Sales Corporation and The Association Benefits Solution, LLC, comprising the group health business. The transaction is expected to close during 2025, subject to regulatory approvals and other customary closing conditions. The individual health business will either be retained or divested.\nProducts and distribution channels\nEmployer voluntary benefits\nOver 3,000 independent agents, benefits brokers and Allstate exclusive agents for employer voluntary benefits focusing on workplace benefits for employers\nOver 4,000 independent agents for group health focusing on health plans for small employers\nOver 33,000 independent agents, in-house agencies, direct-to-consumer marketing, wholesaling, worksite marketing and the internet for individual health\nWe compete on a wide variety of factors, including product offerings, brand recognition, financial strength and ratings, price, distribution and customer service.\nThe market for self-funded plans is growing as small employer groups seek to provide medical coverage for their employees while minimizing the cost of insurance. Short-term medical, ancillary products, and Medicare supplement insurance help fill the increasing gaps associated with continued medical cost inflation and the shifting of costs from employers to employees. We compete with large group medical carriers in our stop-loss, fully insured group health insurance, short-term medical and Medicare supplement insurance offerings.\nWe primarily operate in the U.S. (all 50 states and D.C.) and Canada. The top geographic markets based on 2024 statutory direct premiums are reflected below.\n\nAllstate Protection Segment\nOur Allstate Protection segment accounted for 92.4% of Allstate’s 2024 consolidated insurance premiums and contract charges and 18.0% of Allstate’s December 31, 2024 PIF. This segment includes private passenger auto, homeowners and other personal lines products offered through Allstate branded exclusive agents, independent agents and directly to consumers.\nWe have three market-facing property-liability businesses, Allstate brand, National General and Answer Financial with products and services that cater to different customer needs and distribution preferences.\nTransformative Growth\nImprove Customer Value\nSeeking to be a low cost provider through cost reductions, identifying savings opportunities for customers through proactive protection reviews and increasing pricing sophistication\nBroadening the benefits of being connected with the Allstate Mobile app and expanded use of telematics pricing sophistication\nImproving customer interactions and reducing customer effort\nExpand Customer Access\nIncreasing Allstate agent efficiency and productivity, positioning them to deliver greater value to customers at lower costs\nGrowing National General by leveraging Allstate pricing and product capabilities and expanding product offerings and independent agency relationships\nIncreasing direct channel distribution through improved customer experiences, increasing marketing and expanding sales capacity\nIncrease Sophistication and Investment in Customer Acquisition\nImproving the effectiveness of customer acquisition by centralizing lead management and using data and advanced computing capabilities\nIncreasing marketing spend in geographic areas meeting target margins\nDeploy New Technology Ecosystem\nDeploying an advanced technology ecosystem to deliver affordable, simple, and connected experiences and products at a lower cost\nUsing large language models to improve customer communications\nDrive Organizational Transformation\nImprove effectiveness and efficiency by empowering talent with decision clarity, agile business processes, measurement science and advanced technology\n\nAllstate Protection’s strategy is to be a low cost digital provider that offers affordable, simple and connected products. Allstate Protection will increase personal lines market share through Transformative Growth. Transformative Growth is about creating a business model, capabilities and culture that continually transform to better serve customers. This is done by providing affordable, simple and connected protection through multiple distribution channels. The acquisition of National General expanded our independent agent relationships and Transformative Growth has improved our direct sales capabilities. The successful repositioning of distribution has increased new business in all channels. The ultimate objective is to enhance customer value to drive growth in all businesses by:\nImproving customer value by providing low cost affordable, simple and connected protection solutions\nExpanding customer access to Allstate and National General products and services through a wide variety of distribution channels\nIncreasing sophistication and investment in customer acquisition\nDeploying new technology ecosystems that are more flexible and enable a digital customer experience\nDriving organizational transformation\nProtection Services’ strategy is to innovate new products and services, expand distribution and provide affordable, simple and connected protection solutions.\nAllstate Protection Plans\nExpand distribution and product breadth of consumer protection plans through new and existing retailers and mobile operators across North America, Europe, Asia and Australia.\nAllstate Dealer Services\nExpand distribution of Allstate branded protection and insurance products through auto dealerships, business partnerships and direct to consumer.\nModernize the roadside assistance business through technology and enhanced digital capabilities to deliver a superior customer experience.\nProvide industry-leading telematics and mobility insights to insurance companies, the transportation industry and location-enabled consumer apps.\nAllstate Identity Protection\nCreate a leading position in the identity protection and restoration market, offering full-service identity protection and expand partnership and direct to consumer distribution channels.\n\nAllstate supports and funds voluntary, employee-led Employee Impact Groups (“EIGs”) and Business Impact Groups (“BIGs”) that are open to all employees. EIGs and BIGs make our company stronger by enhancing employee connection, belonging and engagement, resulting in better business results and service for our customers. EIGs help foster a sense of belonging by focusing on development, engagement and collaboration. BIGs focus on creating opportunities for employees to solve business problems and serve as an incubator for innovation, collaboration and professional development. Analysis from 2024 shows that EIG members at Allstate have a 28% lower turnover than non-members. In 2024, 14% of our Allstate U.S. workforce participated in at least one EIG. Officers from across the enterpr",
  "item7_clean": "Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations\nRun-off Property-Liability\nReserve for Property and Casualty Insurance Claims and Claims Expense\nAllstate Health and Benefits\nCapital Resources and Liquidity\nEnterprise Risk and Return Management\nApplication of Critical Accounting Estimates\nRegulation and Legal Proceedings\nPending Accounting Standards\nThe following discussion highlights significant factors influencing the consolidated financial position and results of operations of The Allstate Corporation (referred to in this document as “we,” “our,” “us,” the “Company” or “Allstate”). It should be read in conjunction with the consolidated financial statements and related notes found under Item 8. contained herein.\nA discussion of strategy, including updates to the multi-year Transformative Growth initiative, can be found in Part 1, Item 1. Business.\nThe most important factors we monitor to evaluate the financial condition and performance for the Company include:\n: premium, policies in force (“PIF”), new business sales, price changes, claim frequency and severity, catastrophes, loss ratio, expenses, underwriting results and combined ratio\n: revenues, premium written, PIF and adjusted net income\nAllstate Health and Benefits\n: premiums, other revenue, new business sales, PIF, benefit ratio, expenses and adjusted net income\n: exposure to market risk, asset allocation, credit quality, total return, net investment income, cash flows, net gains and losses on investments and derivatives, unrealized capital gains and losses, long-term returns and fixed income portfolio duration\n: liquidity, parent holding company deployable assets, financial strength ratings, operating leverage, debt levels, book value per share and return on equity\nMeasuring segment profit or loss\nThe measure of segment profit or loss used in evaluating performance is underwriting income for the Allstate Protection and Run-off Property-Liability segments and adjusted net income for the Protection Services, Allstate Health and Benefits, and Corporate and Other segments.\nUnderwriting income (loss)\nis calculated as premiums earned and other revenue, less claims and claims expense (“losses”), amortization of deferred policy acquisition costs (“DAC”), operating costs and expenses, amortization or impairment of purchased intangibles, and restructuring and related charges, as determined using accounting principles generally accepted in the United States of America (“GAAP”). We\nuse this measure in our evaluation of results of operations to analyze profitability.\nAdjusted net income (loss)\nis net income (loss) applicable to common shareholders, excluding:\nNet gains and losses on investments and derivatives\nPension and other postretirement remeasurement gains and losses\nAmortization or impairment of purchased intangibles\nGain or loss on disposition\nAdjustments for other significant non-recurring, infrequent or unusual items, when (a) the nature of the charge or gain is such that it is reasonably unlikely to recur within two years, or (b) there has been no similar charge or gain within the prior two years\nIncome tax expense or benefit on reconciling items\nMacroeconomic impacts\nMacroeconomic factors have and may continue to impact the results of our operations, financial condition and liquidity, such as U.S. government fiscal and monetary policies, conflict in the Middle East, the Russia/Ukraine conflict, supply chain disruptions, labor shortages and potential trade policy actions, such as tariffs and quotas. These factors should be considered when comparing the current period to prior periods. Macroeconomic impacts are disclosed in Part 1 “Item 1A. Risk Factors’’, including the risk factors titled “\nA large-scale pandemic, the occurrence of terrorism, military actions, political and social unrest or other disruptive or destabilizing events may have an adverse effect on our business\nConditions in the global economy and capital markets could adversely affect the business and results of operations\n”. This is not inclusive of all potential impacts and should not be treated as such. Within the MD&A, we have included further disclosures related to macroeconomic impacts on our 2024 results.\nOn August 13, 2024, we entered into a share purchase agreement with StanCorp Financial Group, Inc. to sell American Heritage Life Insurance Company and American Heritage Service Company, comprising our employer voluntary benefits business for approximately $2.0 billion in cash. The employer voluntary benefits business is reported in the Allstate Health and Benefits segment, and beginning in the third quarter of 2024, the assets and liabilities of the business were classified as held for sale. The transaction is expected to close in the first half of 2025, subject to regulatory approvals and other customary closing conditions.\nOn January 30, 2025, Allstate entered into an agreement with Nationwide Life Insurance Company to sell Direct General Life Insurance Company, NSM Sales Corporation and The Association Benefits Solution, LLC, comprising the group health business for approximately $1.25 billion in cash, adjusted for the closing balance sheet. The group health business is reported in the Allstate Health and Benefits segment, and beginning in the first quarter of 2025, the assets\nThe Allstate Corporation 35\nand liabilities of the business will be classified as held for sale. The transaction is expected to close during 2025, subject to regulatory approvals and other customary closing conditions. The individual health business will either be retained or divested.\nThe transaction prices less costs to sell exceeds the carrying value of the net assets of both transactions, resulting in an expected gain that will be recognized at closing of each transaction. The ultimate amount of the anticipated gain on the sales will be impacted by purchase price adjustments associated with certain pre-close transactions, changes in the carrying value of net assets, changes in accumulated other comprehensive income and the related tax effects.\nSee Note 4 of the consolidated financial statements for further information on the employer voluntary benefits disposition.\n2024 Operating priorities and results\nAllstate continued to focus on its operating priorities while successfully executing a comprehensive plan to improve auto insurance profitability and making substantial progress in advancing Transformative Growth. The table below summarizes the results of our 2024 Operating Priorities.\n2024 Operating priorities\n\nAchieve 2024 Plan Growth Objectives\nConsolidated policies in force reached 208 million, a 7.2% increase from prior year. Allstate Protection policies in force decreased by 0.6% compared to the prior year, as continued growth in the homeowners insurance business was more than offset by declines in the auto insurance business.\nProtection Services policies in force and revenue increased 9.3% and 16.7%, respectively, primarily due to growth at Allstate Protection Plans through expanding distribution relationships and protection offerings.\nAchieve Target Economic Returns on Capital\nAchieve 2024 Plan Returns\nReturn on average Allstate common shareholders’ equity was 25.8% in 2024.\nTotal return on the $72.61 billion investment portfolio was 3.8% in 2024. Proactive portfolio management repositioned the fixed income portfolio into longer duration and higher-yielding assets to increase income.\nThe Property-Liability combined ratio of 94.3 for the full year decreased compared to the prior year primarily reflecting successful execution of the Company’s comprehensive auto insurance profitability plan and lower catastrophe losses.\nExecute Transformative Growth\nImprove Customer Value\nEnterprise Net Promoter Score, which measures how likely customers are to recommend Allstate, finished below the prior year, reflecting the impact of substantial price increases necessary to offset higher loss costs.\nImproved over 25 million customer interactions.\nExpand Customer Access\nIncreased auto insurance new issued applications in all channels.\nNational General continues to build a strong competitive position in independent agent distribution with successful expansion on non-standard auto sales and roll-out of our auto and home Custom360 product now available in 30 states.\nIncrease Sophistication and Investment in Customer Acquisition\nIncreased advertising and reduced underwriting restrictions as higher average premium outpaced increased loss costs per policy.\nDeploy New Technology Ecosystems\nContinued roll-out of Affordable, Simple and Connected auto insurance offering now available in 31 states for auto, 28 states for renters and Affordable, Simple and Connected homeowners insurance offering now available in 4 states.\nContinued to build a digital enterprise by expanding utilization of machine-based learning and artificial intelligence.\nDrive Organizational Transformation\nStreamlined the organization by reducing bureaucracy, risk aversion and organizational silos.\n2025 operating priorities will remain mostly consistent with the 2024\n\nunderwriting income was $3.15 billion in 2024 compared to an underwriting loss of $2.09 billion in 2023, primarily due to increased premiums earned, favorable reserve reestimates and lower losses, partially offset by higher advertising costs.\nPremiums written increased 11.1% to $55.93 billion in 2024 compared to $50.35 billion in 2023, reflecting higher premiums in auto and homeowners insurance.\nadjusted net income was $217 million in 2024 compared to $106 million in 2023. The increase in 2024 was due to premium growth at Allstate Protection Plans, improved claim severity at Allstate Roadside, higher lead sales revenue at Arity and both growth and lower costs at Allstate Identity Protection. Prior year adjusted net income was also negatively impacted by an increase in state income taxes for Allstate Dealer Services.\nPremiums and other revenues increased 15.7% or $401 million to $2.96 billion in 2024 from $2.56 billion in 2023 primarily due to Allstate Protection Plans.\nAllstate Health and Benefits\nadjusted net income was $186 million in 2024 compared to $242 million in 2023. The decrease was primarily due to increased benefit utilization across all lines of business.\nPremiums and contract charges totaled $1.92 billion in 2024, an increase of 4.1% from $1.85 billion in 2023, primarily due to growth in individual health and group health, partially offset by a decline in employer voluntary benefits.\nThe effective tax rate is the ratio of income tax expense (benefit) divided by income (loss) from operations before income tax expense. For the year ended December 31, 2024, we reported an effective tax rate of 20.2% based on total income tax expense of $1.16 billion on total income from operations before income tax expense of $5.76 billion. The effective rate in 2024 is lower than the federal statutory rate of 21%, primarily due to tax benefits derived from tax credits, tax-exempt interest income, and share-based payments, offset by state income tax expense.\nFor the year ended December 31, 2023, we reported an effective tax rate of 38.8% based on a total income tax benefit of $135 million on the loss from operations before income tax benefit of $348 million. The effective tax rate in 2023 was higher than the federal statutory rate of 21% due to the additional tax benefit derived from tax credits, tax-exempt interest income and shared-based payments, offset by a change in valuation allowance and uncertain tax positions.\nFor additional information, see Note 17 of the consolidated financial statements.\nProperty-Liability Operations\nProperty-Liability operations consist of two reportable segments: Allstate Protection and Run-off Property-Liability. These segments are consistent with the groupings of financial information that management uses to evaluate performance and to determine the allocation of resources.\nWe do not allocate Property-Liability investment income, net gains and losses on investments and derivatives, or assets to the Allstate Protection and Run-off Property-Liability segments. Management reviews assets at the Property-Liability level for decision-making purposes.\nGAAP operating ratios\nare used to measure our profitability to enhance an investor’s understanding of our financial results and are calculated as follows:\n\ndriven by increased lead sale purchases and higher software revenue at Arity.\nClaims and claims expense\nincreased 1.4% or $9 million in 2024 compared to 2023, primarily driven by growth at Allstate Protection Plans partially offset by improved margins at Allstate Protection Plans resulting from lower frequency and lower claim severity at Allstate Roadside.\nincreased 15.0% or $159 million in 2024 compared to 2023, driven by growth at Allstate Protection Plans.\nOperating costs and expenses\nincreased 22.6% or $201 million in 2024 compared to 2023, primarily due to expenses related to growth at Arity and Allstate Protection Plans, partially offset by lower expenses at Allstate Roadside and Allstate Identity Protection.\nReserve for Property and Casualty Insurance Claims and Claims Expense\nReserve for Property and Casualty Insurance Claims and Claims Expense\nUnderwriting results are significantly influenced by estimates of claims and claims expense reserves. The facts and circumstances leading to reestimates of reserves relate to claim activity and updates to the development factors used to predict how losses are likely to develop from the end of a reporting period until all claims have been paid. Reestimates occur when actual losses differ from those predicted by the estimated development factors used in prior reserve estimates. For a description of our reserve process, see Note 10 of the consolidated financial statements. For a description of our reserving policies and the potential variability in our reserve estimates, see the Application of Critical Accounting Estimates section of the MD&A. Reserves are an estimate of amounts necessary to settle all outstanding claims, including IBNR claims, as of the reporting date.\nWe believe the net loss reserves exposures are appropriately established based on available facts, laws and regulations.\nTotal claims and claims expense reserves, net of recoverables (“net reserves”), as of December 31\nRun-off Property-Liability\nTotal Property-Liability\n\ndecreased $56 million in 2024 compared to 2023, primarily due to increased benefit utilization across all lines of business.\nNew annualized premium sales\n(annualized premiums at initial employer voluntary benefit customer enrollment or health policy sale) were $732 million in both 2024 and 2023.\nincreased $75 million in 2024 compared to 2023, primarily due to increases in third party commission revenue for the individual health business and administrative fees in the group health business.\nAccident, health and other policy benefits\nincreased 15.9% or $170 million in 2024 compared to 2023, primarily due to higher benefit utilization in all\nbusinesses and growth in group health and individual health.\nAccident, health and other policy benefits include changes in the reserve for future policy benefits, expected development on reported claims, and reserves for incurred but not reported claims as shown in Note 11 of the consolidated financial statements.\nincreased 6.6 points to 62.8 in 2024 compared to 56.2 in 2023, primarily due to higher claims experience across all lines of business.\n2.7% or $4 million in 2024 compared to 2023. For information on changes in DAC, see Note 13 of the consolidated financial statements.\nOperating costs and expenses\nEmployer voluntary benefits\n\nAuto underwriting results\nFor the periods ended\n($ in millions, except ratios)\nQ4\nQ3\nQ2\nQ1\nQ4\nQ3\nQ2\nQ1\nQ4\nQ3\nQ2\nQ1\nUnderwriting income (loss)\nEffect of prior year non-catastrophe reserve reestimates\nFrequency and severity are influenced by:\nSupply chain disruptions and l",
  "item2_clean": null
}