{
  "source_file": "all-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "increased 13.1% or $534 million in the third quarter of 2025 and increased 15.4% or $1.66 billion in the first nine months of 2025 compared to the same periods of 2024, primarily due to the following factors:\nHigher Allstate brand average premiums from implemented rate increases and inflation in insured home replacement costs and other aging factor adjustments, combined with policies in force growth\nIn the nine months ended September 30, 2025, rate increases of 8.0% were implemented in 44 locations, resulting in total estimated insurance premium impact of 4.3%, excluding the impact of changes in insured home replacement costs\nPIF increased 2.1% or 159 thousand to 7,642 thousand as of September 30, 2025 compared to September 30, 2024, primarily in the direct and exclusive agency channels, partially offset in the independent agency channel\nIncreased new issued applications in direct and exclusive agency channels\nWe are not writing new homeowners business in Florida. We are also non-renewing certain policies in Florida. We may not be able to grow in certain states without regulatory or legislative reforms that enable customers to be provided coverage at appropriate risk adjusted returns.\nHomeowners premium measures and statistics\n\nthreshold of average claims in a specific area, occurring within a certain amount of time following the event. Catastrophes are caused by various natural events including high winds, winter storms and freezes, tornadoes, hailstorms, wildfires, tropical storms, tsunamis, hurricanes, earthquakes and volcanoes.\nWe are also exposed to man-made catastrophic events, such as certain types of terrorism, civil unrest, wildfires or industrial accidents. The nature and level of catastrophes in any period cannot be reliably predicted.\nLoss estimates are generally based on claim adjuster inspections and the application of historical loss development factors. Our loss estimates are calculated in accordance with the coverage provided by our policies. The establishment of appropriate reserves, including reserves for catastrophe losses, is an inherently uncertain and complex process. Reserving for hurricane losses is complicated by the inability of insureds to promptly report losses, limitations placed on claims adjusting staff affecting\ntheir ability to inspect losses, determining whether losses are covered by our homeowners policy (generally for damage caused by wind or wind driven rain) or specifically excluded coverage caused by flood, exposure to mold damage, and the effects of numerous other considerations, including the timing of a catastrophe in relation to other events, such as at or near the end of a financial reporting period, which can affect the availability of information needed to estimate reserves for that reporting period. In these situations, we may need to adapt our practices to accommodate these circumstances in order to determine a best estimate of our losses from a catastrophe.\nOver time, we have limited our aggregate insurance exposure to catastrophe losses in certain regions of the country that are subject to high levels of natural catastrophes by managing coverage, number of policies in force, utilizing reinsurance and participating in various state facilities.\nCatastrophe losses by the type of event\nThree months ended September 30,\nNine months ended September 30,\nHurricanes/tropical storms\nPrior year reserve reestimates\nPrior year aggregate reinsurance recoveries\nCurrent year aggregate reinsurance recoveries\nPrior quarter reserve reestimates\nTotal catastrophe losses\n\nIncludes reinsurance recoveries.\nGross losses before reinsurance recoverables and reinstatement premiums were $6.01 billion.\nCatastrophe reinsurance\nThe catastrophe reinsurance program is part of our catastrophe management strategy, which is intended to provide shareholders with long-term returns on the risks assumed in our property business, reduce earnings volatility, and provide protection to our customers. The current catastrophe reinsurance program supports our risk and return framework which incorporates robust economic capital modeling and is informed by catastrophe risk models including hurricanes, earthquakes and wildfires. As of September 30, 2025, the modeled 1-in-100 annual aggregate probable maximum loss for hurricane, earthquake and wildfire perils is approximately $3.1 billion, net of reinsurance. We continually review our aggregate risk appetite and the cost and availability of reinsurance to optimize the risk and return profile of this exposure.\nThe total cost of our property catastrophe reinsurance programs, excluding reinstatement\npremiums, during the third quarter and first nine months of 2025 was $352 million and $914 million, respectively, compared to $298 million and $880 million in the third quarter and first nine months of 2024. Catastrophe placement premiums reduce net written and earned premium with approximately 82% of the reduction related to homeowners premium.\nPrior year reserve reestimates\nReserve reestimates, including catastrophes, decreased reserves by $570 million and $1.20 billion in the third quarter and first nine months of 2025, respectively. Reserve reestimates primarily related to favorable severity development of $284 million and $565 million in personal auto injury coverage and $196 million and $568 million in personal auto physical damage coverage in the third quarter and first nine months of 2025, respectively.\n\nRun-off Property-Liability\nRun-off Property-Liability Segment\nUnderwriting results\nThree months ended September 30,\nNine months ended September 30,\nClaims and claims expense\nEnvironmental claims\nTotal claims and claims expense\nOperating costs and expenses\nAnnual reserve review\nIn the third quarter of 2025 and 2024, we performed our annual reserve review using established industry and actuarial best practices. The annual review resulted in reserve reestimates that increased reserves by $146 million and $58 million in 2025 and 2024, respectively. The reserve reestimates are included as part of claims and claims expense.\nThe reserve reestimates in 2025 primarily related to new reported information for asbestos claims, new reported claims for environmental and other mass tort claims and increased projections for claims expenses.\nThe reserve reestimates in 2024 primarily related to new reported information for asbestos related\nclaims and adverse developments within the other run-off lines.\nWe believe that our reserves are appropriately established based on available facts, technology, laws, regulations, and assessments of other pertinent factors and characteristics of exposure (e.g., claim activity, potential liability, jurisdiction, products versus non-products exposure) presented by individual policyholders, assuming no change in the legal, legislative or economic environment. However, as we progress with the resolution of disputed claims in the courts and arbitrations and with negotiations and settlements, our reported losses may be more variable.\nReserves for asbestos, environmental and other run-off claims before and after the effects of reinsurance\nEnvironmental claims\nOther run-off claims\n\nFixed income securities are rated by third-party credit rating agencies or are internally rated. The Securities Valuation Office (“SVO”) of the National Association of Insurance Commissioners (“NAIC”) evaluates the fixed income securities of insurers for regulatory reporting and capital assessment purposes. The NAIC assigns securities to one of six credit quality categories defined as “NAIC designations”. In general, securities with NAIC designations of 1 and 2 are considered investment grade and securities with NAIC designations of 3 through 6 are considered below investment grade. The rating is either received from the SVO based on availability of applicable ratings from rating agencies on the NAIC Nationally Recognized Statistical Rating Organizations provider list, including Moody’s Investors Service (“Moody’s”), S&P Global Ratings (“S&P”), Fitch Ratings or a comparable internal rating.\nAs a result of time lags between the funding of investments, the finalization of legal documents, and the completion of the SVO filing process, the portfolio includes certain securities that have not yet been designated by the SVO as of each balance sheet date and the categorization of these securities is based on the expected ratings indicated by internal analysis\nAs of September 30, 2025, 91.5% of the consolidated fixed income securities portfolio was\nrated investment grade. Credit ratings below these designations are considered lower credit quality or below investment grade, which includes high yield bonds.\nMarket prices for certain securities may have credit spreads which imply higher or lower credit quality than the current third-party rating. Our initial investment decisions and ongoing monitoring procedures for fixed income securities are based on a due diligence process which includes, but is not limited to, an assessment of the credit quality, sector, structure and liquidity risks of each issuer.\nFixed income portfolio monitoring is a comprehensive process to identify and evaluate each fixed income security that may require a credit loss allowance. The process includes a quarterly review of all securities to identify instances where the fair value of a security compared to its amortized cost is below internally established thresholds. For further detail on our fixed income portfolio monitoring process, see Note 5 of the condensed consolidated financial statements.\nThe following table presents total fixed income securities by the applicable NAIC designation and comparable S&P rating.\n\nInvestee level expenses include asset level operating expenses on directly held real estate and other consolidated investments reported in investment expense.\nPerformance-based investment income\nincreased 58.7% or $84 million in the third quarter of 2025 compared to the same period of 2024, related "
}