{
  "source_file": "alle-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Item 2 – Management’s Discussion and Analysis of Financial Condition and Results of Operations\nAllegion plc and its consolidated subsidiaries (\"Allegion,\" \"the Company\", \"we,\" \"our,\" or \"us\") are a leading global provider of security products and solutions operating in two segments: Allegion Americas and Allegion International. We sell a wide range of security products and solutions for end-users in commercial, institutional and residential facilities worldwide, including the education, healthcare, government, hospitality, retail, commercial office and single and multi-family residential markets. Our leading brands include CISA®, Interflex®, LCN®, Schlage®, SimonsVoss® and Von Duprin®.\nBusiness and Industry Trends and Outlook\nIn the third quarter of 2025, we delivered low-double digit revenue growth compared to the same period in 2024, driven by favorable pricing and volume growth in the Allegion Americas and Allegion International segments, as well as the impact from acquisitions made during the year.\nDemand for electronic security products has also remained strong and continues to be a long-term growth driver. Macroeconomic conditions in our International markets remain mixed.\nGlobal Trade and Macroeconomic Environment\nThroughout 2025, the U.S. government announced tariffs on imports from several countries from which we manufacture and/or import products and components. Through the nine months ended September 30, 2025, we have offset inflation due to tariffs with pricing actions. We continue to analyze the impact of changes in tariffs and what, if any, steps, including pricing actions, we may take to mitigate the impact of the tariffs. We estimate we source approximately 20-25% of cost of goods sold (\"COGS\") from Mexico, less than 5% of COGS from China, and 5-10% of COGS from all other non-US countries. Additionally, this could impact future demand.\nThe following acquisitions were completed during the nine months ended September 30, 2025:\nOn February 4, 2025, we, through our subsidiaries, acquired Next Door Company (\"Next Door\"), a global provider of security products and solutions based in the United States. Next Door is reported in the Allegion Americas segment.\nOn March 1, 2025, we, through our subsidiaries, acquired Lemaar Pty Ltd (\"Lemaar\"), a global provider of security products and solutions based in Australia. Lemaar is reported in the Allegion International segment.\nOn April 2, 2025, we, through our subsidiaries, acquired 100% of Trimco Hardware (\"Trimco\"), a manufacturer of high-performance and custom-designed architectural hardware primarily sold for commercial and institutional markets based in the United States. Trimco is reported in the Allegion Americas segment.\nOn June 2, 2025, we, through our subsidiaries, acquired 100% of Nova Hardware Pty Ltd (\"Novas\"), an architectural door hardware company based in Australia. Novas is reported in the Allegion International segment.\nOn July 1, 2025, we, through our subsidiaries, acquired 100% of ELATEC, including Elatec GmbH and other group entities (\"ELATEC\"). ELATEC is a leading manufacturer of security and access technology based in Germany. This acquisition helps the Company expand its global electronics portfolio in attractive end markets while also increasing strategic relationships with channel partners. The closing purchase price of the acquisition was €330.0 million (approximately $389.0 million), subject to customary working capital adjustments. We used cash on hand and borrowings under the Revolving Facility to finance the acquisition. ELATEC is reported in the Allegion International segment.\nOn July 2, 2025, we, through our subsidiaries, acquired 100% of Gatewise Inc. (“Gatewise\"), a provider of smart access control solutions in the U.S. multifamily marketplace based in the United States. Gatewise is reported in the Allegion Americas segment.\nOn July 7, 2025, we, through our subsidiaries, acquired 100% of Waitwhile Inc. (“Waitwhile\"), a software-as-a-service provider that specializes in cloud-based appointment scheduling and queue management based in the United States. Waitwhile is reported in the Allegion Americas segment.\nOn August 1, 2025, we, through our subsidiaries, acquired 100% of UAP Group Limited (“UAP\"), a securities solutions provider based in the United Kingdom. UAP is reported in the Allegion International segment.\nOn August 12, 2025, we, through our subsidiaries, acquired 100% of Brisant Secure Limited (“Brisant\"), a security hardware provider based in the United Kingdom. Brisant is reported in the Allegion International segment.\n2025 Dividends and Share Repurchases\nDuring the nine months ended September 30, 2025, we paid dividends of $1.53 per ordinary share to shareholders and repurchased approximately 0.6 million shares for $80.0 million.\nResults of Operations – Three months ended September 30\nIn millions, except per share amounts\nSelling and administrative expenses\nEarnings before income taxes\nProvision for income taxes\nDiluted net earnings per ordinary share:\nThe discussions that follow describe the significant factors contributing to the changes in our results of operations for the periods presented and form the basis used by management to evaluate the financial performance of the business.\nNet revenues for the three months ended September 30, 2025, increased by 10.7%, or $103.1 million, compared with the same period in 2024, due to the following:\nAcquisitions / divestitures\nCurrency exchange rates\nThe increase in Net revenues was driven by improved pricing, favorable impact from acquisitions/divestitures, higher volumes, and favorable foreign currency exchange rate movements.\nPricing includes increases or decreases of price, including discounts, surcharges and/or other sales deductions, on our existing products and services. Volume includes increases or decreases of revenue due to changes in unit volume of existing products and services, as well as new products and services.\nOperating Income/Margin\nOperating income for the three months ended September 30, 2025, increased $18.8 million compared to the same period in 2024. Operating margin, which we define as Operating income as a percentage of total Net revenues, for the three months ended September 30, 2025, decreased to 21.8% from 22.2% for the same period in 2024, due to the following:\nPricing and productivity in excess of inflation and investment spending\nVolume / product mix\nAcquisitions / divestitures\nCurrency exchange rates\nAcquisition / integration / restructuring expenses\nThe increase in Operating income was driven by favorable volume/product mix, the favorable impact from acquisitions/divestitures, pricing and productivity improvements in excess of inflation and investment spending, and favorable foreign currency exchange rate movements, inclusive of transactional currency gains and losses. These increases were partially offset by higher acquisition, integration and restructuring expenses.\nThe decrease in Operating margin was driven by inflation and investment spending in excess of pricing and productivity, higher acquisition, integration and restructuring expenses, and the unfavorable impact on operating margin from acquisitions/divestitures. These decreases were partially offset by favorable volume/product mix.\nInflation and investment spending in excess of pricing and productivity includes the impact to both Operating income and Operating margin from pricing, as defined above, in addition to productivity, inflation and investment spending. Productivity represents improvements in unit costs of materials, cost reductions related to improvements to our manufacturing design and processes and reductions in selling and administrative expenses due to productivity projects. Inflation includes both unit costs for the current period compared to the average actual cost for the prior period, multiplied by current year volumes, and current period costs of ongoing selling and administrative functions compared to the same ongoing expenses in the prior period. Expenses related to increased head count for strategic initiatives, new facilities or other significant spending for strategic initiatives or new product and channel development, are captured in investment spending.\nVolume/product mix represents the impact to both Operating income and Operating margin due to increases or decreases of revenue due to changes in unit volume, including new products and services, including the effect of changes in the mix of products and services sold on Cost of goods sold.\nInterest expense for the three months ended September 30, 2025, decreased $2.2 million compared with the same period in 2024, primarily due to lower outstanding indebtedness compared to the same period in the prior year.\nThe components of Other income, net for the three months ended September 30 were as follows:\nForeign currency exchange loss\nOther (income) expense\nProvision for Income Taxes\nThe effective income tax rates for the three months ended September 30, 2025 and 2024, were 9.8% and 10.5%, respectively. The decrease in the effective income tax rate compared to 2024 is primarily due to a tax benefit related to the enactment of a tax legislative change, partially offset by the unfavorable year over year changes in amounts recognized for uncertain tax positions.\nResults of Operations – Nine months ended September 30\nIn millions, except per share amounts\nSelling and administrative expenses\nEarnings before income taxes\nProvision for income taxes\nDiluted net earnings per ordinary share:\nThe discussions that follow describe the significant factors contributing to the changes in our results of operations for the periods presented and form the basis used by management to evaluate the financial performance of the business.\nNet revenues for the nine months ended September 30, 2025, increased by 7.3%, or $207.5 million, compared with the same period in 2024, due to the following:\nAcquisitions / divestitures\nCurrency exchange"
}