{
  "source_file": "alle-20241231.htm",
  "form_type": "10-K",
  "item1_clean": "BUSINESS\nAllegion plc (\"Allegion,\" \"we,\" \"us\" or \"the Company\") is a leading global provider of security products and solutions that keep people and assets safe and secure in the places they live, learn, work and connect. We pioneer safety and security to create a safer and more accessible world. Central to our work is partnering and developing ecosystems to create flawless, seamless access experiences and enable an uninterrupted and secure flow of people and assets. We offer an extensive and versatile portfolio of security and access control security products and solutions across a range of market-leading brands. Our experts across the globe deliver high-quality hardware, software, services and systems, and we use our deep expertise to serve as trusted partners to end-users who seek customized solutions to their security needs.\nAllegion Principal Products and Services\nDoor controls, door control systems, and exit devices\nDoors, glass and door systems, and accessories\nElectronic security products and access control systems, including time, attendance and workforce productivity\nLocks, locksets, portable locks, and key systems\nServices and software\nSecurity and access control security products and solutions are critical elements in every building and home. Many door openings are configured to maximize a room’s particular form and function while also meeting local and national building and safety code requirements and end-user security needs. Most buildings have multiple door openings, each serving its own purpose and requiring different specific access control solutions. Each door must fit exactly within its frame, be prepared precisely for its hinges, synchronize with its specific lockset and corresponding latch and align with a specific key to secure the door. Moreover, with the growing adoption of connected hardware and software solutions, security products – including credentials – are increasingly linked electronically, integrated into access control software and popular consumer technology platforms and controlled with mobile applications, creating additional functionality and complexity.\nWe believe our ability to deliver a wide range of solutions that can be custom configured to meet end-users’ security needs is a key driver of our success. We accomplish this with:\nOur extensive and versatile product and service portfolio, combined with our deep expertise, which enables us to deliver the right products and solutions to meet diverse security and functional specifications and to successfully and securely integrate into leading technologies and systems;\nOur consultative approach and expertise, which enables us to develop the most efficient and appropriate building security and access control specifications to fulfill the unique needs of our end-users and their partners, including architects, designers, security consultants, contractors, homebuilders and engineers;\nOur access to and management of key channels in the market, which is critical to delivering our products in an efficient and consistent manner; and\nOur enterprise excellence capabilities, including our global manufacturing operations and agile supply chain, which facilitate our ability to deliver specific product and system configurations to end-users and consumers worldwide, quickly and efficiently.\nWe believe the security products industry will continue to benefit from several global macroeconomic trends, including:\nExpected growth in global electronic and electromechanical products and solutions as end-users adopt newer technologies in their facilities and homes;\nHeightened awareness of security and privacy requirements;\nIncreased focus and adoption of mobile technology; and\nThe shift to a digital, interconnected and increasingly interoperable environments that require a strong ecosystem of partners.\nWe operate in and report financial results for two segments: Allegion Americas and Allegion International, the latter of which provides security and access control security products, services and solutions primarily throughout Europe, Asia and Oceania. We sell our products and solutions under the following brands:\nWe sell a wide range of security and access control solutions for end-users in commercial, institutional and residential facilities worldwide, including the education, healthcare, government, hospitality, retail, commercial office and single and multi-family residential markets. Our leading brands include CISA®, Interflex®, LCN®, Schlage®, SimonsVoss®, and Von Duprin®.\nDuring the year ended December 31, 2024, we generated Net revenues of $3,772.2 million and Operating income of $780.7 million.\nHistory and Developments\nWe were incorporated in Ireland on May 9, 2013, to hold the commercial and residential security businesses of what was then Ingersoll Rand plc (\"Ingersoll Rand\"). On December 1, 2013, we became a stand-alone public company after Ingersoll Rand completed the separation of these businesses from the rest of Ingersoll Rand via the transfer of these businesses from Ingersoll Rand to us and the issuance by us of ordinary shares directly to Ingersoll Rand’s shareholders. Our security businesses have long and distinguished operating histories. Several of our brands were established more than 100 years ago, and many originally created their categories:\nVon Duprin, established in 1908, was awarded the first exit device patent;\nSchlage, established in 1920, was awarded the first patents granted for the cylindrical lock and the push button lock;\nLCN, established in 1926, created the first door closer;\nCISA, established in 1926, devised the first electronically controlled lock;\nSimonsVoss, established in 1995, created the first keyless digital transponder; and\nStanley Access Technologies patented the world's first hands-free door operator in 1931.\nWe have built upon these founding legacies since our entry into the security products market through the acquisition of Schlage, Von Duprin and LCN. Today, we continue to develop, acquire and introduce innovative products.\nIn 2018, we announced the formation of Allegion Ventures to invest in and help accelerate the growth of companies that have innovative, digital-first technologies and products such as touchless access and workspace monitoring solutions that complement our core business solutions. Building on this success, in December 2021, Allegion Ventures announced a second fund with an additional allocation of $100 million to focus on investing in technologies like artificial intelligence, video monitoring, machine learning and cybersecurity.\nRecent examples of successful product launches by Allegion are illustrated in the table below:\nProducts and Services\nDoor controls, door control systems, and exit devices\nCISA,\nStanley Access Technologies, Von Duprin\nCISA Multitop Matic Exit, a secondary lock for single and double leaf aluminum and iron panic doors, brings to market the only \"Made in Italy\" counter-lock featuring a long faceplate. Enables the automatic and secure locking of the main leaf against the door jam.\nStanley Access Technologies new automatic door/window solution for increased efficiencies for drive-through restaurants (DuraGlide DT). Telescopic manual and automatic version of ICU doors, providing the biggest clear door opening in the industry, proprietary handle design and the slimmest header (ProCare 8500). More energy-efficient and robust hurricane-rated sliding doors (DuraStorm Class E).\nVon Duprin 70 series delivering both performance and value at a medium price point and is ideal for heavy duty warehouse, industrial, office, multifamily, retail and hospitality applications.\nDoors, glass and door systems, and accessories\nSmoke-rated partition featuring doors, sidelites/transoms and standalone windows suitable for enclosed elevator lobbies in multifamily buildings. It is comprised of glass, frames and hardware and is the first system fully tested to UL 1784 (TGP SmokeSafe™ Window & Door System).\nNorth America’s first fire-rated full-lite door system certified to forced-entry standards (TGP TGProtect™ FR System).\nUL Certification of American Architectural Manufacturers Association (AAMA) 501.8 human impact resistant curtain wall using durable SentryGlas Plus (SGP) laminated glass (Unicel).\nProducts and Services\nElectronic security products and access control systems, including time, attendance, and workforce productivity\nGainsborough,Schlage, SimonsVoss,\nSchlage XE360 series electronic lock is the next generation wireless lock from Schlage, designed specifically for multifamily properties. It delivers innovation, intelligence and reliability wrapped in a modern, sleek design for a variety of lock applications (mortice, tubular and exit device).\nSchlage, in collaboration with Airbnb, was the first to launch the “airkey” integration, connecting Schlage smart locks and Airbnb accounts for easy guest check-ins.\nSchlage Encode Smart WiFi Lever is for use in doors without a deadbolt; connects to home WiFi and pairs with the Schlage app.\nGainsborough Freestyle Trilock now has built-in Wi-Fi, no longer needing a separate bridge to communicate to the router. The latest version of this residential product includes Matter over Thread - the first smart lock in Australia to feature this technology.\nNarrow profile smart lock for Australia and New Zealand for use on aluminum and timber doors, utilizing the Schlage Breeze app (Schlage Artus). Next-generation smart entry door lock for the New Zealand market, operating on the Schlage Breeze app and offering a retrofit solution to Schlage S-6000 and competitor products (Schlage Resolute).\nSimonsVoss AX2Go, a BLE-based mobile app for iOS and Android, supporting the same user experience, regardless the OS of the smartphone. Users can place unlocked smartphone on the lock and the app will send the needed data in the background.\nSimonsVoss PinCode keypad AX, a BLE-based pincode keypad suitable for communication with SimonsVoss based AX products, with a range up to 1.5 meters.\nLocks, locksets, portable locks, and key systems\nBricard Evidence handle range for commercial and residential markets, with an exclusive and unique rose fixation and adjustment design, functionality and finishes.\nBricard Bi-Pass key is equipped with an integrated RFID tag, enabling seamless operation of both mechanical and electronic access control devices.\nNext generation of multi-function mortice locks, 991 Multi-Function Mortice Lock Series (Legge), allows easy conversions and anti-lockout function.\nServices and software\nSimonsVoss AXM Plus Software, first on-premise software variant with an optional cloud con\nnection, to give customers the opportunity to deploy mobile credentials in a virtual networked environment.\nMultifamily access control solution providing a turnkey, simple, secure and smart offering of software and integrated hardware covering all access needs for the building (Zentra).\nIndustry and Competition\nWe serve customers within institutional, commercial and residential construction and remodeling markets throughout North America, Europe, Asia and Oceania. We expect the security products industry will continue to benefit from favorable trends such as increased concerns about safety and security, and technology-driven innovation that enables seamless access and a better user experience as people and assets traverse multiple locations and facilities. Further, we expect continued growth in connected security products and solutions as end-users continue to adopt newer technologies, including mobile solutions and artificial intelligence, in their facilities and single and multi-family homes.\nThe security products markets are highly competitive and fragmented throughout the world, with a number of large multi-national companies and thousands of smaller regional and local companies. This high degree of fragmentation primarily reflects local regulatory requirements and highly variable end-user needs. We believe our principal g",
  "item7_clean": "Determining the costs and obligations associated with our defined benefit plans is dependent on various actuarial assumptions including discount rates, expected returns on plan assets, employee mortality and turnover rates. Changes in any of the assumptions can have an impact on the net periodic pension benefit cost. An estimated 0.5% rate decline in the discount rate would have increased net periodic pension benefit cost by approximately $0.4 million in 2024, while a 0.5% rate decline in the estimated return on assets would have increased net periodic pension benefit cost by approximately $2.2 million. For further details on defined benefit plan activity, see Note 12 to the Consolidated Financial Statements.\n– At December 31, 2024, we have total unrecognized tax benefits for uncertain tax positions of $44.5 million and $9.2 million of related accrued interest and penalties, net of tax, although we are unable to reasonably estimate the timing over which these liabilities might be paid. See Note 18 to the Consolidated Financial Statements for additional information regarding matters relating to income taxes, including unrecognized tax benefits and tax authority disputes.\nContingent Liabilities\n– We are involved in various litigation, claims and administrative proceedings, including those related to environmental, asbestos-related and product liability matters. We believe that these liabilities are subject to the uncertainties inherent in estimating future costs for contingent liabilities and will likely be resolved over an extended period of time. See Note 21 to the Consolidated Financial Statements for additional information.\nGuarantor Financial Information\nAllegion US Hold Co is or was, as applicable, the issuer of the 3.200% Senior Notes, 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes and is the guarantor of the 3.500% Senior Notes. Allegion plc (the “Parent”) is or was, as applicable, the issuer of the 3.500% Senior Notes and is or was, as applicable, the guarantor of the 3.200% Senior Notes, 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes. Allegion US Hold Co is directly or indirectly 100% owned by the Parent and each of the guarantees of Allegion US Hold Co and the Parent is full and unconditional and joint and several.\nThe 3.200% Senior Notes, 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes are or were, as applicable, senior unsecured obligations of Allegion US Hold Co and rank equally with all of Allegion US Hold Co’s existing and future senior unsecured and unsubordinated indebtedness. The guarantee of the 3.200% Senior Notes, 3.550% Senior Notes, 5.411% Senior Notes, and 5.600% Senior Notes is or was, as applicable, the senior unsecured obligation of the Parent and ranks equally with all of the Parent’s existing and future senior unsecured and unsubordinated indebtedness. The 3.500% Senior Notes are senior unsecured obligations of the Parent and rank equally with all of the Parent’s existing and future senior unsecured and unsubordinated indebtedness. The guarantee of the 3.500% Senior Notes is the senior unsecured obligation of Allegion US Hold Co and ranks equally with all of Allegion US Hold Co's existing and future senior unsecured and unsubordinated indebtedness.\nEach guarantee is effectively subordinated to any secured indebtedness of the applicable guarantor to the extent of the value of the assets securing such indebtedness. The Senior Notes are structurally subordinated to indebtedness and other liabilities of the subsidiaries of the applicable guarantor, none of which guarantee the notes. The obligations of the applicable guarantor under its guarantee are limited as necessary to prevent such guarantee from constituting a fraudulent conveyance under applicable law and, therefore, are limited to the amount that the applicable guarantor could guarantee without such guarantee constituting a fraudulent conveyance; this limitation, however, may not be effective to prevent such guarantee from constituting a fraudulent conveyance. If the guarantee was rendered voidable, it could be subordinated by a court to all other indebtedness (including guarantees and other contingent liabilities) of the applicable guarantor, and, depending on the amount of such indebtedness, the applicable guarantor’s liability on its guarantee could be reduced to zero. In such an event, the notes would be structurally subordinated to the indebtedness and other liabilities of the applicable guarantor.\nFor further details, terms and conditions of the Senior Notes refer to the Company’s Forms 8-K filed October 2, 2017, September 27, 2019 June 22, 2022, and May 29, 2024.\nThe following tables present the summarized financial information specified in Rule 1-02(bb)(1) of Regulation S-X for each issuer and guarantor. The summarized financial information has been prepared in accordance with Rule 13-01 of Regulation S-X.\nSelected Condensed Statement of Comprehensive Income Information\nYear ended December 31, 2024\nEquity earnings in affiliates, net of tax\nTransactions with related parties and subsidiaries\nNet earnings attributable to the entity\n(a) Transactions with related parties and subsidiaries include intercompany interest and fees.\nSelected Condensed Balance Sheet Information\nAmounts due from related parties and subsidiaries\nTotal current assets\nAmounts due from related parties and subsidiaries\nTotal noncurrent assets\nCurrent liabilities:\nAmounts due to related parties and subsidiaries\nTotal current liabilities\nNoncurrent liabilities:\nAmounts due to related parties and subsidiaries\nTotal noncurrent liabilities\nCritical Accounting Estimates\nManagement’s Discussion and Analysis of Financial Condition and Results of Operations are based upon our Consolidated Financial Statements, which have been prepared in accordance with GAAP. The preparation of financial statements in accordance with GAAP requires management to use judgment in making estimates and assumptions based on the relevant information available at the end of each period. These estimates and assumptions have a significant effect on reported amounts of assets and liabilities, revenues and expenses as well as the disclosure of contingent assets and liabilities because they result primarily from the need to make estimates and assumptions on matters that are inherently uncertain. Actual results may differ from estimates. If updated information or actual amounts are different from previous estimates, the revisions are included in our results for the period in which they become known.\nThe following is a summary of certain accounting estimates and assumptions made by management that we consider critical:\n– Goodwill is tested annually during the fourth quarter for impairment or when there is a significant change in events or circumstances that indicate the fair value of a reporting unit is, more likely than not, less than its carrying amount. Recoverability of goodwill is measured at the reporting unit level and starts with a comparison of the carrying amount of a reporting unit to its estimated fair value. If the estimated fair value of a reporting unit exceeds its carrying amount, goodwill of the reporting unit is not impaired. To the extent that the carrying value of a reporting unit exceeds its estimated fair value, a goodwill impairment charge will be recognized for the amount by which the carrying value of the reporting unit exceeds its fair value, not to exceed the carrying amount of the reporting unit's goodwill.\nAs quoted market prices are not available for our reporting units, the calculation of their estimated fair values is based on two valuation techniques, a discounted cash flow model (income approach) and a market multiple of earnings (market approach), with each method being weighted in the calculation. The income approach relies on our estimates of revenue growth rates, margin assumptions and discount rates to estimate future cash flows and explicitly addresses factors such as timing, with due consideration given to forecasting risk. These assumptions are subject to varying degrees of judgment and complexity. Estimates of future revenue growth rates and margin assumptions represent our best estimates of future cash flows given our expectations of market growth for the security products industry in the specific markets in which we operate, as well as factors such as our market positioning, brand strength, pricing and marketing efforts and other growth and productivity opportunities and initiatives. Discount rate assumptions represent our best estimates of market participant adjusted weighted-average costs of capital. Although these assumptions represent our best estimates as of the assessment date, certain factors could potentially create variances in these estimates, including, but not limited to:\nDecreases in estimated market sizes or market growth rates due to greater than expected declines in volumes, pricing pressures or disruptive technology;\nDeclines in our market share and penetration assumptions due to increased competition or an inability to develop or launch new products;\nThe impacts of market volatility, including but not limited to, impacts of global pandemics, greater than expected inflation, supply chain disruption and delays, declines in pricing, reductions in volumes or fluctuations in foreign currency exchange rates;\nThe level of success of on-going and future research and development efforts, including those related to acquisitions, and increases in the research and development costs necessary to obtain regulatory approvals and launch new products; and\nVolatility in market interest rates that could impact the selection of an appropriate discount rate.\nThe market approach requires determining an appropriate peer group, which is utilized to derive estimated fair values of our reporting units based on selected market multiples. The market approach reflects the market’s expectations for future growth and risk, with adjustments to account for differences between the selected peer group companies and the subject reporting units. While market multiples are based on observable, arm’s-length evidence of value, these assumptions are still subject to inherent uncertainty, as the peer-group companies may differ in significant ways from one or more of our reporting units in terms of size, growth or business characteristics.\nThe critical accounting estimates and assumptions discussed above, include our estimates of revenue growth rates and margin assumptions, discount rates, our selection of an appropriate peer group and selected market multiples. These estimates and assumptions are considered critical, as they are subject to a high degree of judgment and complexity. Forecasted revenue growth rates and margin assumptions are updated annually and often fluctuate from year to year due to a myriad of factors, such as our assessment of the macroeconomic conditions throughout the major markets in which we do business, supply chain challenges, elevated levels of inflation in recent years and pricing initiatives to offset inflation, market acceptance of new product innovation, investments in productivity projects, restructuring efforts, among other economic, strategic and operational factors impacting our businesses. Discount rate and market multiple assumptions are similarly updated annually, based on our best estimates of market participants, which typically include observable, arm's length-evidence of value, where possible. While we make every effort to estimate fair value as accurately as possible with the information available at the assessment date, changes in assumptions and estimates may affect the estimated fair value of the reporting unit and could result in impairment charges in future periods. During our most recent annual impairment analysis, none of our reporting units were determined to be impaired.\nIndefinite-lived intangible assets\n– Similar to goodwill, indefinite-lived intangible assets are tested annually during the fourth quarter for impairment or when there is a significant change in events or circumstances that indicate the fair value of the asset is, more likely than not, less than its carrying amount. Recoverability of indefinite-lived intangible assets is determined on a relief from royalty methodology, which is based on the implied royalty paid, at an appropriate discount rate, to license the use of an asset rather than owning the asset. The present value of the after-tax cost savings (i.e. royalty relief) indicates the estimated fair value of the asset. Any excess of the carrying value over the estimated fair value is recognized as an impairment loss equal to that excess. The critical assumptions utilized in our annual impairment analysis for indefinite-lived intangible assets include our estimates of revenue growth rate, royalty rates and discount rates, which often differ amongst our various indefinite-lived assets. We assess the appropriateness of each royalty rate\nassumption annually, based on our assessment of observable market royalty rates and an analysis of the profitability of the primary business that owns or otherwise uses the indefinite-lived asset. Discount rate assumptions typically consider the discount rate conclusions for the reporting unit in which an underlying business operates, plus an incremental spread, where appropriate, to consider size, country or other company-specific risk. A significant change in any or a combination of the assumptions used to estimate fair value of our indefinite-lived intangible assets could have a negative impact on the estimated fair values.\n– We account for income taxes in accordance with ASC Topic 740. Deferred tax assets and liabilities are determined based on temporary differences between financial reporting and tax bases of assets and liabilities, applying enacted tax rates expected to be in effect for the year in which the differences are expected to reverse. We recognize future tax benefits, such as net operating losses and non-U.S. tax credits, to the extent that realizing these benefits is considered in our judgment to be more likely than not. The recoverability of our deferred tax assets, which we consider to be a critical estimate, is reviewed regularly by considering our historic profitability, projected future taxable income, timing of the reversals of existing temporary differences and the feasibility of our tax planning strategies. Where appropriate, we record a valuation allowance with respect to future tax benefits. We establish valuation allowances against the realizability of any deferred tax assets based on our consideration of all available evidence, both positive and negative, using a “more likely than not” standard. This assessment considers the nature, frequency and amount of recent losses, the duration of statutory carryforward periods and tax planning strategies. Although our assessments of the valuation and recoverability of our deferred tax assets can change given a change in facts and circumstances (such as a change in a statutory tax rate), in making such judgments and estimates, significant weight is given to evidence that can be objectively verified.\nThe provision for income taxes also involves a significant amount of management judgment regarding interpretation of relevant facts and laws in the jurisdictions in which we operate. Future changes in applicable laws, projected levels of taxable income and tax planning could change the effective tax rate and tax balances recorded by us. In addition, tax authorities periodically review income tax returns filed by us and can raise issues regarding our filing positions, timing and amount of income or deductions and the allocation of income among the jurisdictions in which we operate. A significant period of time may elapse between the filing of an income tax return and the ultimate resolution of an issue raised by a tax authority with respect t",
  "item2_clean": null
}