{
  "source_file": "amat-20241027.htm",
  "form_type": "10-K",
  "item1_clean": "Applied Materials, Inc. is the leader in the materials engineering solutions used to produce virtually every semiconductor and advanced display in the world. We are experts in the design, development, production, and servicing of the critical wafer fabrication and display fabrication tools our customers need to manufacture semiconductors and displays. Our customers’ products are used in a wide variety of products such as personal computing devices, mobile phones, artificial intelligence (AI) and data center servers, automobiles, connected devices, industrial applications and consumer electronics. We have the semiconductor capital equipment industry’s most comprehensive portfolio of products. This breadth allows us the ability to connect and co-optimize technologies across our portfolio, enabling our customers to achieve superior results as manufacturing semiconductors and displays is becoming increasingly complex. Semiconductors provide the foundation for advances in technology that are reshaping the global economy, including artificial intelligence, internet of things, robotics, electric and autonomous vehicles, and clean energy.\nIncorporated in 1967, we are a Delaware corporation. Our fiscal year ends on the last Sunday in October. We operate in three reportable segments: Semiconductor Systems, Applied Global Services® (AGS), and Display. The Semiconductor Systems segment represents the largest contributor to our net revenue. A summary of financial information for each reportable segment is found in Note 14 of Notes to Consolidated Financial Statements. A discussion of factors that could affect operations is set forth under “Risk Factors” in Item 1A, which is incorporated herein by reference.\nSemiconductor Systems\nOur Semiconductor Systems segment designs, develops, manufactures and sells a wide range of primarily 300mm equipment used to fabricate semiconductor chips, also referred to as integrated circuits (ICs). The Semiconductor Systems segment consists of the semiconductor capital equipment industry’s most comprehensive portfolio of products used in the chip making process. Our products address steps across materials engineering, process control and advanced packaging, including the conversion of patterns into device structures, transistor and interconnect fabrication, metrology, inspection and review, and packaging technologies for connecting finished IC die. In addition to providing equipment for individual process steps, we have the ability to combine, co-optimize and integrate our technologies to develop highly differentiated solutions for our customers. Our equipment helps customers improve the power, performance, yield and costs of the semiconductor devices.\nOur patterning systems and technologies address challenges resulting from shrinking pattern dimensions and the growing complexity in vertical stacking found in today’s most advanced semiconductor devices. Our transistor and interconnect products and technologies enable continued power and performance improvements of 3D transistors. Our process control systems employ optical and eBeam technologies that allow customers to inspect and review critical semiconductor architectures throughout the manufacturing process, helping improve chip yields. Our advanced packaging systems use our materials engineering expertise to allow customers to connect multiple chips together through heterogeneous integration, enabling them to advance the technology roadmap beyond a single chip.\nOur Semiconductor Systems sales are to customers that serve the following markets: foundry, logic and other; DRAM; flash memory. Foundry, logic, and other is comprised of leading-edge and non-leading edge technology nodes. Leading-edge represents customers that are producing on the most advanced technology nodes. Non-leading edge technology nodes serve markets such as internet of things, communications, automotive, power and sensors.\nApplied Global Services\nThe AGS segment provides services, spares and factory automation software to customer fabrication plants globally. The AGS segment also manufactures and sells 200mm and other equipment, which is shipped to customers globally that serve non-leading-edge markets.\nAGS’s transactional and subscription service products, spares and factory automation software is purchased by customers to optimize the performance of our large, global installed base of semiconductor, display and other equipment. These solutions are also used to optimize plant performance and productivity. Customer demand is fulfilled through a global distribution system in more than 200 locations and trained field engineers located near customer sites to support our semiconductor, display and other equipment worldwide.\nDisplay segment is comprised primarily of products for manufacturing liquid crystal displays (LCDs), organic light-emitting diodes (OLEDs), and other display technologies for TVs, monitors, laptops, personal computers (PCs), tablets, smartphones, and other consumer-oriented devices. While similarities exist between the technologies utilized in semiconductor and display fabrication, the most significant differences are in the size and composition of the substrate. Substrates used to manufacture display panels and other devices are typically glass, although newer flexible materials are entering the market. Display segment growth depends primarily on consumer demand for increasingly larger and more advanced TVs and high-resolution displays for mobile devices and information technology (IT) products, including laptops, monitors and tablets, as well as new form factors, including thin, light, curved and flexible displays, and new applications such as augmented and virtual reality. In addition to display applications, the segment’s Chemical Vapor Deposition (CVD) technology is used to manufacture solar energy cells. The expertise that we have in materials engineering on large glass substrates is synergistic with the advanced packaging business in the Semiconductor Products Group, as there is a trend in the industry to utilize various types of substrates, including glass.\nWe manufacture systems to meet demand represented by order backlog and customer commitments. Backlog consisted of: (1) orders for which written authorizations have been accepted, or shipment has occurred but revenue has not been recognized; and (2) contractual service revenue and maintenance fees.\nBacklog by reportable segment as of October 27, 2024 and October 29, 2023 was as follows:\n\n(In millions, except percentages)\nSemiconductor Systems\nApplied Global Services\nOf the total backlog as of October 27, 2024, approximately 31% is not reasonably expected to be filled within the next 12 months.\nAs a result of new export rules and regulations issued in December 2024, backlog as of October 27, 2024 is expected to be reduced by approximately $549 million. This reduction would have resulted in total backlog as of October 27, 2024 of $15.3 billion, of which approximately 31% would not have been reasonably expected to be filled within 12 months.\nOur backlog on any particular date is not necessarily indicative of actual sales for any future periods. Our backlog is subject to change, including the potential for customer changes such as new orders or cancellations, and changes in export rules and regulations. Customers may delay delivery of products or cancel orders prior to shipment, subject to possible cancellation penalties. Delays in delivery schedules or a reduction of backlog during any particular period could have a material adverse effect on our business and results of operations.\nManufacturing, Raw Materials and Supplies\nOur worldwide manufacturing activities consist primarily of assembly, integration and test of various proprietary and commercial parts, components and subassemblies that are used to manufacture systems. We utilize a distributed manufacturing model under which manufacturing and supply chain activities are conducted in various countries, including United States, Singapore, Japan, China, Korea, Taiwan, Israel and other countries in Asia and Europe. We use qualified vendors, including contract manufacturers, to supply parts, services and product support. Our supply chain strategy commits to adhere to ethical labor practices, responsible minerals sourcing, Responsible Business Alliance and SEMI guidelines, and the Applied Materials Standards of Business Conduct as defined in our Environmental, Social and Governance (ESG) commitment.\nAlthough we make reasonable efforts to assure that parts are available from multiple qualified suppliers, this is not always possible. Accordingly, some key parts may be obtained from only a qualified single supplier or a limited group of qualified suppliers. We seek to reduce costs and to lower the risks of manufacturing and service interruptions by selecting and qualifying alternate suppliers for parts; monitoring the financial condition of key suppliers; maintaining appropriate inventories of parts; qualifying new parts on a timely basis; and ensuring quality and performance of parts.\nResearch, Development and Engineering\nOur long-term growth strategy requires continued development of new materials engineering solutions, including products and platforms that enable expansion into new and adjacent markets. Our significant investments in research, development and engineering (RD&E) must generally enable us to deliver new products and technologies before the emergence of strong demand, thus allowing customers to incorporate these products into their manufacturing plans during early-stage technology selection. We work closely with our global customers and ecosystem partners to design systems and processes that meet planned technical and production requirements. Our product development and engineering, and process support are performed primarily in the United States, India and Israel. Our customer demonstrations are performed primarily in the United States, China, Taiwan, Israel and South Korea.\nBecause of the highly technical nature of our products, we market and sell products worldwide almost entirely through a direct sales force.\nWe have operations in many countries, with some of our business activities concentrated in certain geographic areas. Our business is based on capital equipment investments by major semiconductor, display and other manufacturers, and is subject to significant variability in customer demand for our products. Customers’ expenditures depend on many factors, including: general economic conditions; anticipated market demand and pricing for semiconductors, display technologies and other electronic devices; the development of new technologies; customers’ factory utilization; capital resources and financing; trade policies and export regulations; and government incentives.\nInformation on net revenue to unaffiliated customers and long-lived assets attributable to our geographic regions is included in Note 14 of Notes to Consolidated Financial Statements. The following companies accounted for at least 10 percent of our net revenue for the following fiscal years for products and services in multiple reportable segments.\n\nSamsung Electronics Co., Ltd.\nTaiwan Semiconductor Manufacturing Company Limited\nThe industries in which we operate are highly competitive and characterized by rapid technological change. Our ability to compete generally depends on our ability to commercialize our technology in a timely manner, continually improve our products, and develop new products that meet constantly evolving customer requirements. Significant competitive factors include technical capability and differentiation, productivity, cost-effectiveness and the ability to support a global customer base. The importance of these factors varies according to customers’ needs, including product mix and respective product requirements, applications, and the timing and circumstances of purchasing decisions. Substantial competiti",
  "item7_clean": "We provide equipment, services and software to the semiconductor, display, and related industries. Our customers include manufacturers of semiconductor wafers and chips, liquid crystal and organic light-emitting diode (OLED) displays, and other electronic devices. Our customers’ products are used in a wide variety of products such as personal computing devices, mobile phones, artificial intelligence (AI) and data center servers, automobiles, connected devices, industrial applications and consumer electronics. Each of our segments is subject to variable industry conditions, as demand for equipment and services can change depending on supply and demand for chips, display technologies and other electronic devices, as well as other factors, such as global economic, political and market conditions, and the nature and timing of technological advances in fabrication processes.\nOur strategic priorities include developing products that help solve customers’ challenges at technology inflections; expanding our served market opportunities in the semiconductor and display industries; and growing our service business. Our long-term growth strategy requires continued development of new materials engineering capabilities, including products and platforms that enable expansion into new and adjacent markets. Our significant investments in research, development and engineering (RD&E) are intended to enable us to deliver new products and technologies before the emergence of strong demand, allowing customers to incorporate these products into their manufacturing plans during early-stage technology selection. We collaborate closely with our global customers to design systems and processes to meet their technical and production requirements.\nOur future operating results depend to a considerable extent on our ability to maintain a competitive advantage in the equipment and service products we provide. Development cycles depend on whether the product is an enhancement of an existing product, which typically has a shorter development cycle, or a new product, which typically has a longer development cycle. Most of our existing products resulted from internal development activities and innovations involving new technologies, materials and processes. In certain instances, we acquire technologies, either in existing or new product areas, to complement our existing technology capabilities and to reduce time to market. Product development and manufacturing activities occur primarily in the United States, Europe, Israel, and Asia. Our portfolio of equipment and service products are highly technical and are sold primarily through a direct sales force.\nWe believe that it is critical to make substantial investments in RD&E to assure the availability of innovative technology that meets the current and projected requirements of our customers’ most advanced designs. We have and continue to invest in RD&E in order to continue to offer new products and technologies.\nWe operate in three reportable segments: Semiconductor Systems, Applied Global Services® (AGS), and Display. A summary of financial information for each reportable segment is found in Note 14 of Notes to Consolidated Financial Statements. A discussion of factors that could affect our operations is set forth under “Risk Factors” in Part I, Item 1A, which is incorporated herein by reference.\nOur results are driven primarily by customer spending on capital equipment and services to support key technology transitions or to increase production volume in response to worldwide demand for semiconductors and displays.\nThe Semiconductor Systems segment is comprised primarily of capital equipment used to fabricate semiconductor chips. Spending by semiconductor customers, which include companies that operate in the foundry, logic, memory, and other semiconductor chip markets, is driven by demand for products such as smartphones, mobile devices, personal computers, servers for artificial intelligence (AI) and data centers, automobiles, clean energy, storage, and other products, and the nature and timing of technological advances in fabrication processes. The growth of data and emerging end-market drivers such as AI, the internet of things, 5G networks, electric and autonomous vehicles and augmented and virtual reality are also creating the next wave of growth for the industry. As a result, products within the Semiconductor Systems segment are subject to significant changes in customer requirements, including transitions to smaller dimensions, increasingly complex chip architectures, new materials and an increasing number of applications. Spending can also depend on customer facility readiness and timeline for installation of capital equipment at customer sites. Development efforts are focused on solving customers’ key technical challenges in patterning, transistor, interconnect, process control, and packaging performance.\nThe AGS segment provides services, spares and factory automation software to customer fabrication plants globally to help customers optimize performance of our large, global installed base of semiconductor, display and other equipment. The AGS segment also includes 200mm and other equipment, which is shipped to many customers globally that serve the non-leading-edge end markets. Demand for AGS’ service and spares is driven by our large and growing installed base of manufacturing systems, and customers’ needs to shorten ramp times, improve system performance, and optimize factory output and operating costs. Industry conditions that affect AGS’ sales of spares and services are primarily characterized by changes in semiconductor manufacturers’ wafer starts and utilization rates, growth of the installed base of equipment and growing service intensity of newer tools. Our strategy is to continue to shift the AGS’ service and spares business to a subscription agreement model, improving customer factory performance and optimizing operating costs, and providing us a more predictable revenue stream.\nThe Display segment encompasses products for manufacturing liquid crystal and OLED displays, and other display technologies for TVs, monitors, laptops, personal computers (PC), tablets, smart phones, other consumer-oriented devices, equipment upgrades and solar energy cells. The segment is focused on expanding its presence through technologically-differentiated equipment and products that provide customers with improved performance and yields. Display segment growth depends primarily on consumer demand for increasingly larger and more advanced TVs and high-resolution displays for mobile devices and information technology (IT) products, including laptops, monitors and tablets, as well as new form factors, including thin, light, curved and flexible displays, and new applications such as augmented and virtual reality. The timing of customer investment in manufacturing equipment is also affected by the timing of next-generation process development and of capacity expansion to meet end-market demand.\nThe Corporate and Other category includes revenues and costs of product sold from other products, as well as certain operating expenses that are not allocated to our reportable segments and are managed separately at the corporate level. These operating expenses include costs for certain management, finance, legal, human resource, and RD&E functions performed at the corporate level; and unabsorbed information technology and occupancy. In addition, we do not allocate to our reportable segments severance, asset impairment and any associated charges related to restructuring actions, unless these actions pertain to a specific reportable segment. Effective in the first quarter of fiscal 2024, management began including share-based compensation expense in the evaluation of reportable segments' performance. Prior-year numbers have been recast to conform to the current-year presentation.\nThe United States government has implemented export regulations for U.S. semiconductor technology sold or provided to customers in China, which have limited our ability to provide certain products and services to customers in China, over the past several years. The U.S. government continues to issue new export licensing requirements, and additional updates and other requirements that have had the effect of further limiting our ability to provide certain products and services to customers outside the U.S., including in China. For a description of these risks, see the risk factor entitled “\nBusiness and Industry Risks - Global trade issues and changes in and uncertainties with respect to trade policies and export regulations, including import and export license requirements, trade sanctions, tariffs and international trade disputes, have adversely impacted and could further adversely impact our business and operations, and reduce the competitiveness of our products and services relative to local and global competitors\n” in Part I, Item 1A, “Risk Factors.”\nResults of Operations\nOur fiscal 2024 and 2023 each contained 52 weeks.\nThe following table presents certain significant measurements for the periods indicated:\n\nFoundry, logic and other\nDynamic random-access memory (DRAM)\nNet revenue in fiscal 2024 increased as compared to the prior year. Gross margin increased primarily driven by lower material, freight, logistics, and manufacturing costs, favorable changes in customer and product mix and lower depreciation expense as a result of changes in certain assets’ useful lives effective as of the beginning of fiscal 2024, partially offset by an increase in labor costs.\nSemiconductor Systems net revenue increased in fiscal 2024 as compared to the prior year as customers continued to make strategic investments in new capacity and new technology transitions. Foundry and logic customers’ spending decreased driven primarily by lower customer investments in leading-edge manufacturing technologies, partially offset by increased customer investments in non-leading edge manufacturing technologies. Memory customers’ spending in fiscal 2024 was higher due to increased investments in DRAM technology transitions. Investments by semiconductor equipment customers are expected to remain strong with growth in the adoption of high-bandwidth memory and other forms of advanced packaging, continued demand for AI and data center computing, and for non-leading edge nodes. The Semiconductor Systems segment continued to represent the largest contributor of net revenue.\nOur AGS net revenue in fiscal 2024 increased primarily due to an increase in net revenue associated with long-term service agreements and customer spending on spares, partially offset by lower customer spending on 200mm equipment. Demand for services is expected to grow as our installed base of systems and chambers increases and customers renew long-term service agreements.\nOur Display net revenue increased in fiscal 2024 compared to the prior year primarily due to higher customer investments in display fabrication equipment for IT products including laptops, monitors and tablets, partially offset by lower customer investments in display fabrication equipment for TVs.\nOver the longer term, we believe secular drivers such as AI, data center computing, the internet of things, 5G networks, electric and autonomous vehicles and augmented and virtual reality will create the next wave of growth for semiconductors and expand our served market opportunities.\nNet revenue by geographic region, determined by the location of customers’ facilities to which products were shipped and services were performed, was as follows:\n\nSemiconductor Systems’ operating margin for fiscal 2024 increased primarily driven by lower material, freight, logistics and manufacturing costs, favorable changes in customer and product mix and lower depreciation expense as a result of changes in certain assets’ useful lives effective as of the beginning of fiscal 2024, partially offset by increased RD&E expenses.\nAGS’ operating margin for fiscal 2024 increased primarily due to the increase in net revenue and a favorable change in product mix.\nDisplay’s operating margin for fiscal 2024 decreased primarily due to unfavorable changes in product mix.\nRecent Accounting Pronouncements\nAccounting Standards Not Yet Adopted\nDisaggregation of Income Statements Expenses\n. In November 2024, the Financial Accounting Standards Board (FASB) issued an accounting standard update to improve income statement expenses disclosures (Subtopic 220-40). The standard requires more detailed information related to the types of expenses, including (among other items) the amounts of purchases of inventory, employee compensation, depreciation and intangible asset amortization included within each interim and annual income statement’s expense caption, as applicable. This authoritative guidance can be applied prospectively or retrospectively and will be effective for us in fiscal 2028 for annual periods and in the first quarter of fiscal 2029 for interim periods, with early adoption permitted. We are evaluating the effect of this guidance on our consolidated financial statements and related disclosures.\nImprovements to Income Tax Disclosures\n. In December 2023, the FASB issued an accounting standard update to improve income tax disclosures (Topic 740). The standard prescribes specific categories for the components of the effective tax rate reconciliation, requires disclosure of income taxes paid by jurisdiction, and modifies other income tax-related disclosures. This authoritative guidance will be effective for us beginning with our annual reporting for fiscal year 2026, with early adoption permitted. We are evaluating the effect of this guidance on our consolidated financial statements and related disclosures.\nImprovements to Reportable Segment Disclosures\n. In November 2023, the FASB issued an accounting standard update to improve reportable segment disclosure requirements, primarily through enhanced disclosures about significant segment expenses (Topic 280). The standard requires interim and annual disclosure of significant segment expenses that are regularly provided to the chief operating decision-maker (CODM) and included within the reported measure of a segment’s profit or loss, requires interim disclosures about a reportable segment’s profit or loss and assets that are currently required annually, requires disclosure of the position and title of the CODM, clarifies circumstances in which an entity can disclose multiple segment measures of profit or loss and contains other disclosure requirements. This authoritative guidance will be effective for us in fiscal 2025 for annual periods and in the first quarter of fiscal 2026 for interim periods, with early adoption permitted. We are evaluating the effect of this guidance on our consolidated financial statements and related disclosures.\nFair Value Measurement of Equity Securities Subject to Contractual Sale Restrictions.\nIn June 2022, the FASB issued an accounting standard update which clarifies how the fair value of equity securities subject to contractual sale restrictions is determined (Topic 820). The amendment clarifies that a contractual sale restriction should not be considered in measuring fair value. It also requires certain qualitative and quantitative disclosures related to equity securities subject to contractual sale restrictions. We will adopt this guidance in the first quarter of fiscal 2025. The adoption of this guidance is not expected to have a significant impact on our consolidated financial statements.\nAccounting Standards Adopted\nFor a description of recently adopted accounting standards, including the date of adoption and the effect, if any, on our consolidated financial statements, see Note 1, “Summary of Significant Accounting Policies,” of the Notes to Consolidated Financial Statements.\nFinancial Condition, Liquidity and Capital Resources\nOur cash, cash equivalents and investme",
  "item2_clean": null
}