{
  "source_file": "amcr-20250930.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "Amcor is the global leader in developing and producing responsible packaging solutions across a variety of materials for nutrition, health, beauty and wellness categories. Our global product innovation and sustainability expertise enables us to solve packaging challenges around the world every day, producing a range of flexible packaging, rigid packaging, cartons and closures that are more sustainable, functional and appealing for our customers and their consumers. We are guided by our purpose of elevating customers, shaping lives and protecting the future. Supported by a commitment to safety, in fiscal year 2025, 77,000 people generated $23 billion in annualized sales from operations on a pro forma basis from over 400 locations in more than 40 countries.\nSignificant Developments and Trends\nMerger with Berry Global Group, Inc.\nOn November 19, 2024, the Company, Aurora Spirit, Inc., a Delaware corporation and wholly-owned subsidiary of the Company (“Merger Sub”), and Berry Global Group, Inc., a Delaware corporation (“Berry”), entered into an Agreement and Plan of Merger (the “Merger Agreement”). The Merger Agreement provides for the merger of Merger Sub with and into Berry (the “Merger”), with Berry surviving the Merger as a wholly-owned subsidiary of Amcor. On April 30, 2025, we completed the transactions called for by the Merger Agreement to obtain all of the ownership interest in Berry for purchase consideration of $10.4 billion, not including Berry debt assumed by Amcor of approximately $5.2 billion. In connection with the closing of the Merger, we issued approximately 846 million ordinary shares to Berry shareholders, excluding shares for Berry vested share-based payment and cash settled awards at closing, and paid $2.2 billion in connection with the required extinguishment of certain Berry indebtedness using the proceeds from the cumulative issuance of $2.2 billion in long-term debt in March 2025. Refer to Part 1, Item 1 - Financial Statements, Note 3, \"Acquisitions\", for further information.\nIn connection with the Merger with Berry, the Company initiated restructuring and integration activities in the fourth quarter of fiscal year 2025 (\"Berry Plan\") aimed at integrating the combined organization. The Company continues to target realizing approximately $530 million of pre-tax synergies driven by procurement, supply chain, and general and administrative savings, $60 million in annual financial synergies and $60 million in pre-tax earnings benefits from growth synergies by the end of fiscal year 2028. The total Berry Plan pre-tax cash cost is estimated at $280 million, net, including restructuring activities and general integration expenses. As of September 30, 2025, the Company has initiated restructuring projects with an expected net cost of approximately $165 million, of which $94 million relates to employee related expenses, $13 million to fixed asset related expenses (net of expected gains on asset disposals), $33 million to other restructuring expenses, and $25 million to restructuring related expenses. In addition, the Company expects to spend approximately $90 million on general integration costs. The restructuring and general integration activities initiated to date are expected to result in $190 million of net cash expenditures. The Berry Plan is expected to be completed by the end of fiscal year 2028.\nIn the three months ended September 30, 2025, the Company incurred $48 million in employee related expenses, $3 million in other restructuring, and $2 million in restructuring related expenses, partially offset by a net gain of $13 million on fixed asset related items, with $9 million incurred in the Global Flexible Packaging Solutions reportable segment, $28 million incurred in the Global Rigid Packaging Solutions reportable segment, and $3 million incurred in Corporate. The Company also incurred $8 million in integration activities in the first quarter of fiscal year 2026. Net cash outflows for restructuring and related expenses for the three months ended September 30, 2025, were approximately $1 million. Net cash expenditures of approximately $100 million to $120 million are expected for the balance of fiscal year 2026 for restructuring and general integration activities, with $80 million to $90 million representing payments for restructuring and related expenses.\nReview of Portfolio-Related Strategic Alternatives\nIn August 2025, we announced that we are reviewing strategic alternatives to maximize the value of our portfolio and have identified businesses with combined sales of $2.5 billion, which includes our North American Beverage business, for further review given they are less aligned with one or more core portfolio attributes including attractive growth and margin profile, industry structure, and scale and leadership position. Possible actions for these businesses include and are not limited to restructuring, partnership and joint venture ownership models, cash sale or a combination thereof. While we continue to progress in our strategic alternatives review and expect to make progress in fiscal year 2026 on actions related to this strategic review, we have not identified a set deadline or definitive timetable for completion of the strategic alternatives review process and related actions and there is no assurance that this review will result in any transaction or that any such outcome will be successful.\nEconomic and Market Conditions\nMarket dynamics remain challenging with softer consumer demand and customer order volatility in certain markets, and higher costs in certain areas, including labor costs, during the first quarter of fiscal year 2026. The underlying causes for the market volatility being experienced can be attributed to a variety of factors, such as geopolitical tension and conflicts, volatility and changes in U.S. domestic and global tariff frameworks and inflation in many economies impacting consumption and consumer demand. Rapid changes in U.S. trade policies, including the announcement of wide-spread tariff increases which were paused and then re-announced, amid persistent inflation in the U.S., has impacted global market conditions resulting in fluctuating consumer demand across many categories.\nWhile we generally source and manufacture our products in the local markets where they are sold, the volatility in tariffs may continue to negatively impact customer and consumer demand, disrupt our supply chains, and increase inflation, raising our costs. In this context, we have remained focused on taking price and cost actions to offset inflation and aligning our cost base with market dynamics and expect to continue to do so. There is no assurance that we will meet our performance expectations or that ongoing geopolitical tensions, including disruptions related to tariffs and other factors, will not negatively impact our financial results.\nHighly Inflationary Accounting\nWe have subsidiaries in Argentina that historically had a functional currency of the Argentine Peso. As of June 30, 2018, the Argentine economy was designated as highly inflationary for accounting purposes. Accordingly, beginning July 1, 2018, we began reporting the financial results of our Argentine subsidiaries with a functional currency of the Argentine Peso at the functional currency of the parent, which is the U.S. dollar. The impact of highly inflationary accounting in the three months ended September 30, 2025, and 2024 resulted in a negative impact on monetary assets of $11 million and $2 million, respectively, and $11 million and $2 million in the three months ended September 30, 2025, and 2024, respectively, in foreign currency transaction losses that were reflected in the unaudited condensed consolidated statements of income. In October 2025, the Argentine central bank indicated it had signed a $20 billion exchange-rate stabilization agreement with the United States Treasury Department. We continue to monitor the foreign currency exposure risk of our operations in Argentina, which represented less than 1% of total assets as of September 30, 2025.\nResults of Operations - Three Months Ended September 30, 2025\nConsolidated Results of Operations\nThree Months Ended September 30,\n($ in millions, except per share data)\nOperating income as a percentage of net sales\nNet income attributable to Amcor plc\nDiluted Earnings Per Share\nNet sales increased by $2,392 million, or 71%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024. Excluding the increase of sales from the merger with Berry Global Group, Inc. (the \"Merger\"), net of divestments, of approximately $2,363 million, the positive currency impacts of approximately $110 million, and the negative impacts from the pass-through of lower raw material costs of approximately $23 million, the remaining variation in net sales for the three months ended September 30, 2025 was a decrease of approximately $58 million or 2%, reflecting lower sales volumes of approximately 3% and favorable price/mix impact of approximately 1%.\nNet income attributable to Amcor plc increased by $71 million, or 37%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024. This is mainly due to increased gross profit of $465 million and higher other income, net, of $24 million, partially offset by higher selling, general, and administrative expenses of $159 million, increased amortization of acquired intangible assets of approximately $94 million, increased restructuring, transaction and integration expenses of $69 million, increased research and development expenses of $18 million, and higher interest expense, net, of $78 million, all primarily due to the Merger.\nDiluted earnings per share (\"Diluted EPS\") decreased by $0.019, or 14%, for the three months ended September 30, 2025, compared to the three months ended September 30, 2024, with the net income available to ordinary shareholders of Amcor p"
}