{
  "source_file": "amd-20241228.htm",
  "form_type": "10-K",
  "item1_clean": "Hyperscale data centers use these products to operate web-based applications or to support public cloud computing and storage service offerings, including but not limited to AI workloads such as generative AI models.\nThird-Party Distributors\nOur authorized channel distributors resell to sub-distributors, OEMs, ODMs, and other customers. Typically, distributors handle a wide variety of products, and may include products from other manufacturers that compete with our products. Distributors typically maintain an inventory of our products. In most instances, our agreements with distributors protect their inventory of our products against price reductions and provide certain return rights with respect to any product that we have removed from our price book or otherwise subject to discontinuation. In addition, some agreements with our distributors may contain standard stock rotation provisions permitting limited product returns.\nAdd-in-Board (AIB) Manufacturers and System Integrators\nWe offer component-level graphics and chipset products to AIB manufacturers who in turn build and sell board-level products using our technology to system integrators (SIs), retailers and sub distributors. In most instances, our agreements with AIBs protect their inventory of our products against price reductions. We also sell directly to some SI customers. SIs typically sell from positions of regional or product-based strength in the market. They usually operate on short design cycles and can respond quickly with new technologies. SIs often use discrete graphics solutions as a means to differentiate their products and add value to their customers.\nThe markets in which our products are sold are highly competitive and delivering the latest and best products to market on a timely basis is critical to achieving revenue growth. We believe that the main factors that determine our product competitiveness are total cost of ownership, timely product introductions, product quality, product features and capabilities (including accelerations for key workloads such as AI), energy efficiency (including power consumption and battery life, given their impact on total cost of ownership), reliability, performance, size (or form factor), selling price, cost, adherence to industry standards (and the creation of open industry standards), level of integration, software and hardware compatibility, ease of use and functionality of software design tools, completeness of applicable software solutions, security and stability, brand recognition and availability. We expect that competition will continue to be intense due to rapid technological changes, frequent product introductions by our competitors or new competitors of products that may provide better performance or experiences or that may include additional features that render our products comparatively less competitive.\nCompetition in Data Center Segment\nIn the Data Center segment, we compete primarily against Intel Corporation (Intel) and NVIDIA Corporation (NVIDIA) with our CPU, GPU and DPU server products. In addition, we compete against Intel with our FPGA and Adaptive SoC server products. A variety of smaller fabless silicon companies offer proprietary accelerator solutions and Arm based CPUs targeting data center use-cases. In addition, some of our customers are internally developing their own data center microprocessor products and accelerator products which could impact the available market for our products.\nCompetition in Client Segment\nOur primary competitor in the supply of CPUs and APUs is Intel.\n\nBUSINESS\nCautionary Statement Regarding Forward-Looking Statements\nThe statements in this report include forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. These forward-looking statements are based on current expectations and beliefs and involve numerous risks and uncertainties that could cause actual results to differ materially from expectations. These forward-looking statements speak only as of the date hereof or as of the dates indicated in the statements and should not be relied upon as predictions of future events, as we cannot assure you that the events or circumstances reflected in these statements will be achieved or will occur. You can identify forward-looking statements by the use of forward-looking terminology including “believes,” “expects,” “may,” “will,” “should,” “seeks,” “intends,” “plans,” “pro forma,” “estimates,” “anticipates,” or the negative of these words and phrases, other variations of these words and phrases or comparable terminology. The forward-looking statements relate to, among other things: possible impact of future accounting rules on AMD’s consolidated financial statements; demand for AMD’s products; AMD’s strategy and expected benefits; the growth, change and competitive landscape of the markets in which AMD participates; international sales will continue to be a significant portion of total sales in the foreseeable future; that AMD’s cash, cash equivalents, and short-term investment balances together with the availability under that certain revolving credit facility (the Revolving Credit Agreement) made available to AMD and certain of its subsidiaries, our commercial paper program, and our cash flows from operations will be sufficient to fund AMD’s operations including capital expenditures and purchase commitments\nAdditionally, we make certain voluntary disclosures in this report and on our website, which are informed by various standards and frameworks (including standards for the measurement of underlying data), and the interests of various stakeholders. As such, these voluntary disclosures may not necessarily be “material” under the federal securities laws for SEC reporting purposes. Furthermore, much of this information is subject to methodological considerations or information, including from third-parties, that is still evolving and subject to change, and which AMD does not independently verify. For example, our disclosures based on any standards may change due to revisions in framework requirements, availability of information, changes in our business or applicable government policies, or other factors, some of which may be beyond our control.\nAMD is the high performance and adaptive computing leader, powering the products and services that help solve the world’s most important challenges. Our technologies advance the future of data centers, powering the cloud services that have become an essential part of how we work, game, and connect to network, PCs, edge computing, and artificial intelligence (AI). We drive innovation through high-performance and adaptive computing technology, software and product leadership.\nWith our high-performance product portfolios, we deliver differentiated solutions, such as our semi-custom System-on-Chip (SoCs), Adaptive SoCs, and accelerated processing units (APUs), and platform level client computing devices, embedded platforms and servers for our customers. We offer a deep portfolio of data center computing solutions including AI accelerators, microprocessors (CPUs), graphic processing units (GPUs), data processing units (DPUs), Smart Network Interface Cards (SmartNICs), and field programmable gate arrays (FPGAs), to meet the vast computing performance requirements of today’s data centers, supercomputers, AI and Machine Learning (ML) data center environments and cloud environments. We drive innovation with our line-up of CPUs, APUs and chipsets for desktops and notebooks, to bring performance, efficiency, AI capabilities and modern security features to gamers, creators, consumers and enterprises. AMD was the first company to integrate a dedicated neural processing unit (NPU) on the same SoC as an x86 CPU for AI PCs. Our GPUs, including discrete GPUs, semi-custom SoC products and development services, work together with software to power immersive gaming experiences for PCs, game consoles and cloud gaming services. We are a leader in embedded computing, where we deliver high-performance and scalability across a full portfolio of CPUs, APUs, FPGAs, system on modules (SOMs) and Adaptive SoCs that are used in a variety of markets, including automotive, industrial, healthcare, storage and networking. We also incorporate dedicated AI processing capabilities into our embedded portfolio.\nWe develop world-class software stacks that are used to enable our high-performance products. Our software stacks include development tools, compilers, and drivers for our CPUs, APUs, GPUs and FPGAs. We work closely with our customers to define and develop customized solutions to precisely match their requirements. We enable this by combining our broad portfolio of high-performance IP with our leadership design and packaging to deliver world-class customized solutions to our customers. We invest in innovative technology and solutions such as our custom-ready chiplet platform and AMD Infinity Architecture to maintain our leadership position as a custom-design silicon provider of choice.\nWe believe that AI is defining the next era of computing and that the full potential of AI will be realized when the technology is pervasive across cloud, edge and end devices. We believe AMD has the compute engines, intellectual property, software capabilities and expertise to be a leader in this next computing era with a broad, portfolio of high-performance compute engines spanning across supercomputing, cloud, edge, embedded and end devices. We believe we have a unique opportunity to make AMD the end-to-end AI leader based on the breadth of our technology and product portfolios.\nOur AI strategy is focused on three priorities. The first is delivering a broad portfolio of high-performance adaptive hardware and software solutions. The second is expanding the deep and collaborative partnerships we have established across the ecosystem to accelerate deployments of AMD based AI solutions at scale. And the third is providing compelling user experiences to extend the open and proven software platform we have established that enables our AI hardware to be deployed more broadly and easily.\nOne of our priorities in 2024 was to accelerate growth in our Data Center segment. The demand for our data center AI accelerator products was very strong as large hyperscaler customers, OEMs and ODMs deployed our AMD Instinct™ MI300X GPUs. During the year, we announced that we have accelerated our AMD AI accelerator roadmap to deliver an annual cadence of leadership AMD Instinct solutions. We announced our 5th Gen AMD EPYC™ family of server processors, providing leadership performance and capabilities for a wide range of data center workloads.\nDuring the year, we completed the acquisition of Silo AI Oy (Silo AI), an AI lab based in Finland. The acquisition of Silo AI expanded our capability to accelerate development and deployment of AI models on AMD hardware. Silo AI has also developed a software stack used to train multiple state-of-the-art large language models (LLMs) on AMD Instinct accelerators that can accelerate the development of highly-performant AMD training solutions.\nWe also focused on building our data center AI rack and data center-scale solutions capabilities by entering into an agreement to acquire ZT Group Int’l, Inc. (ZT Systems), a provider of AI and general purpose compute infrastructure for hyperscale computing companies in August 2024. We believe that with the acquisition of ZT Systems, we can deliver leadership training and inferencing solutions that can accelerate time to deployment for our AMD Instinct platforms. The acquisition is expected to close in the first half of fiscal year 2025, subject to certain regulatory approvals and other customary closing conditions. We intend to seek a strategic partner to acquire ZT Systems' manufacturing business.\nWe continued to invest in driving software capabilities and the open ecosystem to deliver powerful new features and capabilities i",
  "item7_clean": "ITEM 7. MANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nIn 2024, we delivered strong annual revenue growth with net revenue increasing 14% to $25.8 billion, compared to $22.7 billion in 2023. This growth was driven by the performance of our Data Center and Client segments. Data Center net revenue of $12.6 billion increased by 94% compared to $6.5 billion in 2023, driven by higher sales of our AMD Instinct™ GPUs and AMD EPYC™ CPUs. Client segment net revenue of $7.1 billion in 2024 increased by 52% compared to $4.7 billion in 2023, primarily due to higher sales of our AMD Ryzen™ mobile and desktop processors. The increase in annual net revenue was partially offset by a decrease in net revenue in our Gaming and Embedded segments. Gaming net revenue of $2.6 billion decreased by 58% compared to $6.2 billion in 2023. The decrease in net revenue was primarily due to lower semi-custom product revenue. Embedded net revenue of $3.6 billion decreased by 33% compared to net revenue of $5.3 billion in 2023, as customers normalized their inventory levels.\nDuring the year, we successfully launched multiple leadership products and made significant progress executing our AI strategy. One of our priorities in 2024 was to accelerate growth in our Data Center segment. The demand for our Data Center AI accelerator products was very strong led by large hyperscale cloud customers deploying our AMD Instinct MI300X GPU accelerators. During the year, we unveiled an accelerated AMD Instinct accelerator roadmap to deliver an annual cadence of leadership AI solutions. To further expand our high-performance server CPU portfolio, we launched our 5th Gen AMD EPYC™ processors, formerly codenamed “Turin,” built with our latest “Zen 5” core architecture designed to deliver leadership performance and efficiency.\nWe took a major step in our AI PC roadmap with the launch of AMD Ryzen AI 300 Series processors that combine leadership compute capabilities based on our “Zen 5” architecture and an industry-leading neural processing unit (NPU) powered by our XDNA 2 architecture for next-generation AI PCs. We added to our Ryzen family of desktop CPUs with the Ryzen 9000 series processors for laptop and desktop PCs that deliver leadership performance in gaming, productivity and content creation. In our Gaming segment, we extended our multigenerational partnership with Sony as they introduced the PlayStation® 5 Pro, which features a new AMD semi-custom SoC designed to deliver increases in graphics and ray tracing performance to enable AI-driven upscaling.\nWe expanded our adaptive computing portfolio with differentiated solutions with the launch of the new Versal™ Series Gen 2 devices, including the new Versal AI Edge Series Gen 2 and Versal Prime Series Gen 2 adaptive SoCs, which bring preprocessing, AI inference, and postprocessing together in a single device for end-to-end acceleration of AI-driven embedded systems.\nTo execute our AI strategy, we brought together multiple AI teams across AMD to drive development of a comprehensive software ecosystem spanning our full product portfolio. We made several key optimizations and introduced new features in the latest AMD ROCm™ software that increased performance in key generative AI workloads, expanded support and optimization for additional frameworks and libraries, and simplified the overall developer experience. We also made strategic investments to further expand our AI software capabilities with the acquisition of Silo AI Oy (Silo AI), an AI lab based in Finland. The acquisition of Silo AI enables customers to accelerate development and deployment of AI models on AMD hardware. Silo AI has also developed a software stack used to train multiple state-of-the-art large language models (LLMs) on AMD Instinct accelerators that can accelerate the development of highly-performant AMD training solutions.\nWe also focused on extending our data center infrastructure capabilities by entering into an agreement in August 2024 to acquire ZT Group Int’l, Inc. (ZT Systems), a provider of AI and general purpose compute infrastructure for hyperscale computing companies. We believe that with the acquisition of ZT Systems, we can accelerate time to market for our leadership AI training and inferencing solutions. The acquisition is expected to close in the first half of fiscal year 2025, subject to certain regulatory approvals and other customary closing conditions. We intend to seek a strategic partner to acquire ZT Systems' manufacturing business.\nGross margin, as a percentage of net revenue, was 49% for 2024, compared to 46% in 2023. The increase in gross margin was primarily due to a favorable shift in revenue mix with higher Data Center and Client revenues, lower Gaming revenue, partially offset by the impact of lower Embedded revenue. Operating income for 2024 was $1.9 billion compared to operating income of $401 million for 2023. The increase in operating income was primarily driven by higher revenue, partially offset by increased R&D investments. Net income for 2024 was $1.6 billion compared to $854 million in the prior year. The increase in net income was primarily driven by higher revenue.\nCash, cash equivalents and short-term investments as of December 28, 2024 were $5.1 billion, compared to $5.8 billion at the end of 2023. Our aggregate principal amount of total debt as of December 28, 2024 was $1.8 billion, compared to $2.5 billion\n\nLong-lived and intangible assets to be held and used are reviewed for impairment if indicators of potential impairment exist and at least annually for indefinite-lived intangible assets. Impairment indicators are reviewed on a quarterly basis. Assets are grouped and evaluated for impairment at the lowest level of identifiable cash flows. When indicators of impairment exist and assets are held for use, we estimate future undiscounted cash flows attributable to the related asset groups. In the event such cash flows are not expected to be sufficient to recover the recorded value of the assets, the assets are written down to their estimated fair values based on the expected discounted future cash flows attributable to the asset group or based on appraisals.\n. In determining taxable income for financial statement reporting purposes, we must make certain estimates and judgments. These estimates and judgments are applied in the calculation of certain tax liabilities and in the determination of the recoverability of deferred tax assets which arise from temporary differences between the recognition of assets and liabilities for tax and financial statement reporting purposes.\nWe regularly assess the likelihood that we will be able to recover our deferred tax assets. Unless recovery is considered more-likely-than-not (a probability level of more than 50%), we will record a charge to income tax expense in the form of a valuation allowance for the deferred tax assets that we estimate will not ultimately be recoverable or maintain the valuation allowance recorded in prior periods. When considering all available evidence, if we determine it is more-likely-than-not we will realize our deferred tax assets, we will reverse some or all of the existing valuation allowance, which would result in a credit to income tax expense and the establishment of an asset in the period of reversal.\nIn determining the need to establish or maintain a valuation allowance, we consider the four sources of jurisdictional taxable income: (i) carryback of net operating losses to prior years; (ii) future reversals of existing taxable temporary differences; (iii) viable and prudent tax planning strategies; and (iv) future taxable income exclusive of reversing temporary differences and carryforwards.\nThe federal valuation allowance maintained is due to limitations, under Internal Revenue Code Section 382 or 383, separate return loss year rules, or dual consolidated loss rules. Certain state and foreign valuation allowances are maintained due to a lack of sufficient sources of future taxable income.\nIn addition, the calculation of our tax liabilities involves addressing uncertainties in the application of complex, multi-jurisdictional tax rules and the potential for future adjustment of our uncertain tax positions by the Internal Revenue Service or other taxing authorities.\nResults of Operations\nAdditional information on our reportable segments is contained in Note 4\nOur operating results tend to vary seasonally. Historically, our net revenue has been generally higher in the second half of the year than in the first half of the year, although market conditions and product transitions could impact these trends.\nThe following table provides a summary of net revenue and operating income (loss) by segment for 2024 and 2023:\nOperating income (loss):\nTotal operating income\nData Center net revenue of $12.6 billion in 2024 increased by 94%, compared to net revenue of $6.5 billion in 2023. The increase was primarily driven by higher sales of AMD Instinct GPUs and AMD EPYC CPUs.\nData Center operating income was $3.5 billion in 2024, compared to operating income of $1.3 billion in 2023. The increase in operating income was primarily due to higher revenue, partially offset by higher R&D investment.\nClient net revenue of $7.1 billion in 2024 increased by 52%, compared to net revenue of $4.7 billion in 2023, primarily due to a 34% increase in unit shipments and a 13% increase in average selling price driven by strong demand for AMD mobile and desktop Ryzen processors.\nClient operating income was $897 million in 2024, compared to operating loss of $46 million in 2023. The increase in operating income was primarily due to higher revenue, partially offset by higher operating expenses.\nGaming net revenue of $2.6 billion in 2024 decreased by 58%, compared to net revenue of $6.2 billion in 2023. The decrease in net revenue was primarily due to lower semi-custom product revenue.\nGaming operating income was $290 million in 2024, compared to operating income of $971 million in 2023. The decrease in operating income was primarily driven by lower revenue.\nEmbedded net revenue of $3.6 billion in 2024\nby 33%, compared to net revenue of $5.3 billion in 2023. The decrease in net revenue was primarily due to lower demand as customers continued to normalize their inventory levels.\nEmbedded operating income was $1.4 billion in 2024, compared to operating income of $2.6 billion in 2023. The decrease in operating income was primarily driven by lower revenue.\nAll Other operating loss of $4.2 billion in 2024 primarily consisted of $2.4 billion of amortization of acquisition-related intangibles and $1.4 billion of stock-based compensation expense. All Other operating loss of $4.4 billion in 2023 primarily consisted of $2.8 billion of amortization of acquisition-related intangibles and $1.4 billion of stock-based compensation expense.\nComparison of Gross Margin, Expenses, Licensing Gain, Interest Expense, Other Income (expense) and Income Taxes\nThe following is a summary of certain Consolidated Statement of Operations data for 2024 and 2023:\n\n(In millions, except for percentages)\nAmortization of acquisition-related intangibles\nResearch and development\nMarketing, general and administrative\nAmortization of acquisition-related intangibles\nRestructuring charges\nOther income (expense), net\nIncome tax provision (benefit)\nGross margin as a percentage of net revenue was 49% in 2024 compared to 46% in 2023. The increase in gross margin was due to a favorable shift in revenue mix of higher Data Center and Client revenues, lower Gaming revenue, partially offset by the impact of lower Embedded revenue.\nResearch and Development Expenses\nResearch and development expenses of $6.5 billion in 2024 increased by $584 million, or 10%, compared to $5.9 billion in 2023. The increase was primarily due to higher employee-related costs due to an increase in headcount in support of our AI strategy.\nMarketing, General and Administrative Expenses\nMarketing, general and administrative expenses of $2.8 billion in 2024 increased by $431 million, or 18%, compared to $2.4 billion in 2023. The increase was primarily due to an increase in go-to-market activities to support our revenue growth.\nAmortization of Acquisition-Related Intangibles\nAmortization of acquisition-related intangibles of $2.4 billion for 2024 decreased by $417 million, or 15%, compared to $2.8 billion in 2023. The decrease was primarily due to certain acquisition-related intangibles being fully amortized in the prior fiscal year.\nRestructuring Charges\nmillion of restructuring charges in 2024 due to the implementation of a restructuring plan (the 2024 Restructuring Plan). The 2024 Restructuring Plan was focused on driving efficiencies across the business and aligning resources with our largest growth opportunities in the AI and enterprise markets.\nWe hold equity interests in two joint ventures (collectively, the THATIC JV) with Higon Information Technology Co., Ltd. (THATIC), a third-party Chinese entity. We recognized $48 million and $34 million of licensing gain from royalty income associated with the licensed IP to the THATIC JV, in 2024 and 2023, respectively.\nInterest expense of $92 million in 2024 decreased by $14 million compared to $106 million in 2023, primarily due to repayment of the 2.95% Senior Notes due in June 2024.\nOther Income (expense), net\nOther income (expense), net is primarily comprised of interest income from short-term investments, changes in valuation of equity investments and foreign currency transaction gains and losses.\nOther income (expense), net was $181 million in 2024 compared to $197 million of Other income, net in 2023. The change was primarily due to a decrease in interest income from lower balances held in short-term investments compared to the prior year.\nIncome Tax Provision (Benefit)\nWe recorded an income tax provision of $381 million in 2024 and an income tax benefit of $346 million in 2023, representing effective tax rates of 19% and (68%), respectively. The increase in income tax provision in 2024 was primarily due to higher pre-tax income and a $373 million tax effect from an intercompany integration transaction.\nThe OECD is continuing discussions surrounding fundamental changes in allocation of profits among tax jurisdictions in which companies do business, as well as the implementation of a global minimum tax (namely the “Pillar One” and “Pillar Two” proposals). The Council of the European Union has adopted the global corporate 15% minimum tax as provided for in Pillar Two and has directed EU member states to implement legislation enacting Pillar Two. Many countries, including non-EU member states, have implemented laws based on Pillar Two proposals, with effective dates that started in 2024. Although many countries have already introduced Pillar Two legislation applicable to us effective in 2024, certain jurisdictions in which we operate have not adopted corresponding legislation to date. For 2024, the impact to us associated with Pillar Two was immaterial. We continue to evaluate the impact of proposed and enacted legislative changes to our effective tax rate and cash flows as new guidance becomes available.\nInternational sales as a percentage of net revenue were\nin 2024 and 65% in 2023. We expect that international sales will continue to be a significant portion of total sales in the foreseeable future. Substantially all of our sales transactions are denominated in U.S. dollars.\nFINANCIAL CONDITION\nLiquidity and Capital Resources\nAs of December 28, 2024, our cash, cash equivalents and short-term investments were $5.1 billion compared to $5.8 billion as of December 30, 2023. The percentage of cash and cash equivalents held domestically was 90% as of December 28, 2024, and 77% as of December 30, 2023.\nOur operating, investing and financing cash flow activities for 2024 and 2023 were as follows:\n\nas of December 30, 2023. We repaid our ",
  "item2_clean": null
}