{
  "source_file": "amd-20250927.htm",
  "form_type": "10-Q",
  "item1_clean": null,
  "item7_clean": null,
  "item2_clean": "ITEM 2.\nMANAGEMENT’S DISCUSSION AND ANALYSIS OF FINANCIAL CONDITION AND RESULTS OF OPERATIONS\nAMD, the AMD Arrow logo, AMD Instinct, EPYC, Radeon, Ryzen, Xilinx and combinations thereof are trademarks of Advanced Micro Devices, Inc. Other names are for informational purposes only and are used to identify companies and products and may be trademarks of their respective owners. “Zen” is a codename for an AMD architecture and is not a product name.\nOverview and Recent Developments\nWe are a global semiconductor company primarily offering:\nArtificial Intelligence (AI) accelerators, microprocessors (CPUs) for servers, graphics processing units (GPUs), accelerated processing units (APUs), data processing units (DPUs), Field Programmable Gate Arrays (FPGAs), Smart Network Interface Cards (SmartNICs) and Adaptive System-on-Chip (SoC) products for data centers;\nCPUs, APUs, chipsets for desktops and notebooks, discrete GPUs, semi-custom SoC products and development services; and\nembedded CPUs, GPUs, APUs, FPGAs, System on Modules (SOMs), and Adaptive SoC products.\nFrom time to time, we may also sell or license portions of our intellectual property (IP) portfolio.\nIn this section, we will describe the general financial condition and the results of operations of Advanced Micro Devices, Inc. and its wholly-owned subsidiaries (collectively, “we”, “us,” “our”, “AMD” or the “Company”), including a discussion of our results of operations for the three and nine months ended September 27, 2025 compared to the prior year period and an analysis of changes in our financial condition\nNet revenue for the three months ended September 27, 2025 was $9.2 billion, a 36% increase compared to the prior year period. The increase in net revenue was driven by an increase in Client and Gaming segment revenue, primarily driven by strong demand for our AMD Ryzen™ processors, semi-custom game console SoCs and Radeon™ gaming GPUs; and an increase in Data Center segment revenue primarily driven by strong demand for our 5th generation AMD EPYC™ processors and AMD Instinct™ MI350 Series GPUs. Embedded segment revenue decreased as certain end market demand remained mixed.\nGross margin for the three months ended September 27, 2025 was 52% compared to gross margin of 50% for the prior year period, a 2% increase primarily driven by product mix.\nOperating income for the three months ended September 27, 2025 was $1.3 billion compared to operating income of $724 million for the prior year period. The increase in operating income was due to higher gross profit, partially offset by higher operating expenses. Net income for the three months ended September 27, 2025 was $1.2 billion compared to net income of $771 million for the prior year period. The increase in net income was primarily driven by higher operating income.\nAs of September 27, 2025, our cash, cash equivalents and short-term investments were $7.2 billion compared to $5.1 billion as of December 28, 2024. During the nine months ended September 27, 2025\nwe generated $5.1 billion of cash from operating activities and we returned $1.3 billion to stockholders through the repurchase of common stock under our Repurchase Program.\nOn March 31, 2025 (the Acquisition Date), we completed the acquisition of ZT Group Int’l, Inc. (ZT Systems), which is expected to enable AMD to deliver end-to-end AI solutions and accelerate the design and deployment of AMD-powered AI infrastructure at scale optimized for the cloud. On the Acquisition Date, we paid $3.2 billion in cash and issued 8,335,849 shares of our common stock. ZT Systems is comprised of the data center infrastructure manufacturing business (ZT Manufacturing Business), which was classified as held for sale, and the design operations (ZT Design Business).\nOn October 27, 2025, we completed the sale of the ZT Manufacturing Business to Sanmina Corporation (Sanmina) for 1,151,052 shares of Sanmina common stock and $2.4 billion in cash, subject to certain purchase price adjustments, as closing consideration. We are eligible to receive additional cash consideration of up to $450 million to the extent certain conditions are met following the close of the sale.\nOn October 30, 2025, we settled the contingent consideration liability associated with the acquisition of ZT Systems of $300 million in cash and 740,961 shares of the Company’s common stock with the former ZT Systems stockholders and warrant holders.\nOn October 5, 2025, the Company issued to OpenAI OpCo, LLC (the Warrantholder) a warrant to purchase up to an aggregate of 160 million shares of the Company’s common stock at an exercise price of $0.01 per share. The warrant shares will vest in tranches based on certain GPU purchase milestones by the Warrantholder, or its affiliates, or indirectly through third parties, and achievement of specified Company stock price targets and stock performance. Each vested tranche is further subject to the fulfillment of certain other technical and commercial conditions prior to exercise. Subject to certain conditions, the warrant is exercisable through October 5, 2030.\nIn April 2025, new U.S. export restrictions on certain semiconductors to China led to approximately $800 million in product inventory and related charges on AMD Instinct MI308 Data Center GPU products during the second quarter of fiscal year 2025. We applied for and were granted some licenses by the U.S. government that allow us to ship MI308 products to certain China-based customers. We did not record MI308 China-based customer revenue during the three months ended September 27, 2025. Sales of our MI308 products into China depend on customer demand, China’s import control rules and our ability to obtain licenses.\nWe intend the discussion of our financial condition and results of operations that follows to provide information that will assist in understanding our financial statements, the changes in certain key items in those financial statements from period to period, the primary factors that resulted in those changes, and how certain accounting principles, policies and estimates affect our financial statements.\nCritical Accounting Policies and Estimates\nOur discussion and analysis of our financial condition and results of operations are based upon our condensed consolidated financial statements, which have been prepared in accordance with U.S. generally accepted accounting principles (U.S. GAAP). The preparation of our financial statements requires us to make estimates and judgments that affect the reported amounts in our consolidated financial statements. We evaluate our estimates on an ongoing basis, including those related to our revenue, inventories, goodwill, long-lived and intangible assets, business combination accounting and income taxes. We base our estimates on historical experience and on various other assumptions that we believe to be reasonable under the circumstances, the results of which form the basis for making judgments about the carrying values of assets and liabilities. Although actual results have historically been reasonably consistent with management’s expectations, the actual results may differ from these estimates or our estimates may be affected by different assumptions or conditions.\nBusiness Combinations.\nWe allocate the fair value of purchase consideration to the tangible and intangible assets acquired and liabilities assumed based on their estimated fair values. Such valuations require management to make significant estimates and assumptions, especially with respect to assets and liabilities held for sale, intangible assets and contingent consideration. Significant estimates and inputs used in valuing acquired assets and liabilities held for sale, developed technology, and other identifiable intangible assets include, but are not limited to, expected future revenue, future changes in technology, useful lives, and risk-adjusted discount rates. Management's estimates of fair value are based upon assumptions believed to be reasonable, but which are inherently uncertain and unpredictable and, as a result, actual results may differ from estimates. Allocation of purchase consideration to identifiable assets and liabilities affects our amortization expense, as acquired finite-lived intangible assets are amortized over their useful life, whereas any indefinite-lived intangible assets, including goodwill, are not amortized.\nResults of Continuing Operations\nBeginning with the fiscal year ending December 27, 2025, we combined the Client and Gaming segments into one reportable segment to align with how we manage our business. Neither of the Client and Gaming businesses qualify as a separate reportable operating segment, however, we continue to separately disclose revenues for each business. All prior period segment data were retrospectively adjusted.\nOur operating results tend to vary seasonally. Historically, our net revenue has been generally higher in the second half of the year than in the first half of the year, although market conditions and product transitions could impact this trend.\nThe following table provides a summary of net revenue and operating income (loss) by segment:\nTotal Client and Gaming\nCost of sales and operating expenses:\nTotal cost of sales and operating expenses\nOperating income (loss):\nTotal operating income\nData Center net revenue of $4.3 billion for the three months ended September 27, 2025 increased by 22%, compared to net revenue of $3.5 billion for the prior year period. Data Center net revenue of $11.3 billion for the nine months ended September 27, 2025 increased by 29%, compared to net revenue of $8.7 billion for the prior year period. The increase in both periods was primarily driven by strong demand for our 5th generation AMD EPYC™ processors and AMD Instinct™ MI350 Series GPUs.\nData Center operating income was $1.1 billion for the three months ended September 27, 2025, compared to operating income of $1.0 billion for the prior year period. The increase in "
}